{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "No Thanksgiving for bacteria or fungus: Tryptophan blockers offer new way to kill bad guys - Phys.org", "description": "UC Riverside scientists have developed a technique for solving a decades-old mystery involving the chemical in turkey that makes people sleepy. Their new ability to map the atoms involved in the production of tryptophan opens the door to new antibiotic and an…", "url": "https://phys.org/news/2022-03-thanksgiving-bacteria-fungus-tryptophan-blockers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/tryptophan-blockers-of.jpg", "publishedAt": "2022-03-10T10:30:29Z", "content": "UC Riverside scientists have developed a technique for solving a decades-old mystery involving the chemical in turkey that makes people sleepy. Their new ability to map the atoms involved in the prod… [+3747 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "AAP", "title": "Biologist puts shark sleep mystery to bed - The West Australian", "description": "An Australian biologist has proven for the first time that sharks do sleep and it's more than simply a fun fact.", "url": "https://thewest.com.au/news/wildlife/biologist-puts-shark-sleep-mystery-to-bed-c-6007286", "urlToImage": "https://images.thewest.com.au/publication/C-6007286/a044f86e5b080f918786471197a89d2558e05595-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-03-10T07:02:00Z", "content": null}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "What we wish we knew about the origin of life - Big Think", "description": "Shortly after planet Earth formed, life took a permanent hold on our surface. But just how common is such an outcome?", "url": "https://bigthink.com/starts-with-a-bang/origin-of-life-169450/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/11/https___blogs-images.forbes.com_startswithabang_files_2019_03_NASA-Dana-Berry.jpg", "publishedAt": "2022-03-10T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Scientists discover a new twist on an 80-year-old biochemical pathway - Verve Times", "description": "Credit: Pixabay/CC0 Public Domain                        Every year, thousands of biochemistry majors and medical students around the world learn to memorize the major biochemical path", "url": "https://vervetimes.com/scientists-discover-a-new-twist-on-an-80-year-old-biochemical-pathway/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/pigeon.jpg", "publishedAt": "2022-03-10T06:44:11Z", "content": "Credit: Pixabay/CC0 Public Domain\r\nEvery year, thousands of biochemistry majors and medical students around the world learn to memorize the major biochemical pathways that allow cells to function. Ho… [+8477 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "NASA waited 50 years to open this vacuum sealed sample from the Moon - TweakTown", "description": "NASA has waited around 50 years to open a certain sample that was harvested from the Moon by astronauts on the Apollo missions.", "url": "https://www.tweaktown.com/news/85011/nasa-waited-50-years-to-open-this-vacuum-sealed-sample-from-the-moon/index.html", "urlToImage": "https://static.tweaktown.com/news/8/5/85011_02_nasa-waited-50-years-to-open-this-vacuum-sealed-sample-from-the-moon_full.png", "publishedAt": "2022-03-10T06:33:02Z", "content": "A 1972 Apollo mission saw two NASA astronauts, Eugene Cernan and Harrison \"Jack\" Schmitt taking two samples from the lunar surface back to Earth.\r\nOne of the tube samples was placed in an unsealed co… [+1272 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Gravity: Mathematical Discovery Could Shed Light on Secrets of the Universe - SciTechDaily", "description": "How can Einstein's theory of gravity be unified with quantum mechanics? It is a challenge that could give us deep insights into phenomena such as black holes and the birth of the universe. Now, a new article in Nature Communications, written by researchers fr…", "url": "https://scitechdaily.com/quantum-gravity-mathematical-discovery-could-shed-light-on-secrets-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Einstein-Theory-of-Gravity-Unified-With-Quantum-Mechanics-scaled.jpg", "publishedAt": "2022-03-10T06:09:02Z", "content": "How can Einstein’s theory of gravity be unified with quantum mechanics? This is a challenge that could give us deep insights into phenomena such as black holes and the birth of the universe. Now, a n… [+5512 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "7 Space Concepts That Were Too Wild for NASA - Gizmodo Australia", "description": "It boggles the mind to think of all the wondrous things that NASA has achieved since its inception in 1958,...", "url": "https://www.gizmodo.com.au/2022/03/7-space-concepts-that-were-too-wild-for-nasa/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/03/10/5cf9b418a00ae4ab31420f7005cef0b1.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-03-10T06:00:00Z", "content": "It boggles the mind to think of all the wondrous things that NASA has achieved since its inception in 1958, but its equally astounding to think about all the projects that couldve been. Here are seve… [+5931 chars]"}, {"source": {"id": null, "name": "Thomasnet.com"}, "author": null, "title": "The Space Missions That Took Off, Touched Down in 2021 - ThomasNet News", "description": "2021 was a big year for the space and aeronautics industry, with at least nine different space missions launching or having a successful outcome.", "url": "https://www.thomasnet.com/insights/the-space-missions-that-took-off-touched-down-in-2021/", "urlToImage": "https://cdn.thomasnet.com/insights-images/d9bbd311-ddca-49a1-8ff0-aedefa30edae/small.jpg", "publishedAt": "2022-03-10T05:29:55Z", "content": "Welcome to Thomas Insights every day, we publish the latest news and analysis to keep our readers up to date on whats happening in industry. Sign up here to get the days top stories delivered straigh… [+3780 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Variant that combines Delta and Omicron identified; dogs sniff out virus with high accuracy; Meteorite gouged huge Greenland crater 58 million years ago, study finds and more - Devdiscourse", "description": "The scientists said that the effects were even seen in people who had not been hospitalised with COVID, and whether the impact could be partially reversed or if they would persist in the long term needed further investigation.  Original Buzz Aldrin moon walk …", "url": "https://www.devdiscourse.com/article/science-environment/1956199-science-news-roundup-variant-that-combines-delta-and-omicron-identified-dogs-sniff-out-virus-with-high-accuracy-meteorite", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_02_2022_10_04_37_7170559.jpg?width=920&format=jpeg", "publishedAt": "2022-03-10T04:57:57Z", "content": "Following is a summary of current science news briefs.\r\nVariant that combines Delta and Omicron identified; dogs sniff out virus with high accuracy\r\nThe following is a summary of some recent studies … [+2911 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Wormholes Could Help Solve an Infamous Black Hole Paradox, Says Fun New Paper - ScienceAlert", "description": "What happens to information after it has passed beyond the event horizon of a black hole? There have been suggestions that the geometry of wormholes might help us solve this vexing problem – but the math has been tricky, to say the least.", "url": "https://www.sciencealert.com/wormholes-could-help-resolve-the-annoying-black-hole-information-paradox", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/wormhole-illustration_1024.jpg", "publishedAt": "2022-03-10T04:56:56Z", "content": "What happens to information after it has passed beyond the event horizon of a black hole? There have been suggestions that the geometry of wormholes might help us solve this vexing problem but the ma… [+3719 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "US and Russia's Space Station partnership could be unraveling - ABC News", "description": "ABC’s Gio Benitez reports on the escalating situation that could put Astronaut Mark Vande Hei’s ride home from the International Space Station in jeopardy.AB...", "url": "https://www.youtube.com/watch?v=cUjatpBEe-Q", "urlToImage": "https://i.ytimg.com/vi/cUjatpBEe-Q/hqdefault.jpg", "publishedAt": "2022-03-10T04:15:01Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "The First Explosion of Life on Earth Made an Impact Deep Under The Surface - ScienceAlert", "description": "The Cambrian Explosion – around 541 million years ago – was when life and organisms really got going on planet Earth. Now new research has revealed how that explosion of life has left behind traces deep within Earth's mantle.", "url": "https://www.sciencealert.com/the-first-explosion-of-life-on-earth-left-traces-deep-underground-in-its-mantle", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/KimberliteRock_1024.jpg", "publishedAt": "2022-03-10T01:40:32Z", "content": "The Cambrian Explosion around 541 million years ago was when life and organisms really got going on planet Earth. Now new research has revealed how that explosion of life has left behind traces deep … [+3242 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "New discovery says the closest black hole to Earth isn’t a black hole at all - BGR", "description": "What was once believed to be the Earth's closest black hole has now been classified as a two-star system with a vampiric star.", "url": "http://bgr.com/science/new-discovery-says-the-closest-black-hole-to-earth-isnt-a-black-hole-at-all/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/10/BGRpic-Recovered-Recovered-Recovered.jpg?quality=82&strip=all", "publishedAt": "2022-03-10T00:03:00Z", "content": "The Earth’s closest black hole isn’t a black hole at all. Instead, astronomers say it’s just a two-star system where one star is sucking the life out of the other.\r\nEarth’s closest black hole isn’t a… [+2741 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Axiom Space Ax-1 mission: The first all-private crew to the International Space Station - Space.com", "description": "The launch will send a SpaceX Crew Dragon to orbit March 30, for a 10-day International Space Station mission.", "url": "https://www.space.com/ax-1-axiom-space-station-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kr373cX5UfBRephugtBpyg-1200-80.jpg", "publishedAt": "2022-03-09T22:58:34Z", "content": "Axiom Mission 1 is a mission to the International Space Station by the Houston-based Axiom Space that will be the first fully private crew to the orbiting complex. It is scheduled to launch on March … [+12259 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Stefanie Waldek", "title": "SpaceX launches 48 more Starlink satellites on an 'American broomstick' - Yahoo Lifestyle Australia", "description": "At 5:45 this morning PST, a Falcon 9 rocket lifted off from Space Launch Complex 40 at Cape Canaveral in Florida, adding 48 new satellites to SpaceX’s 2,000-...", "url": "https://au.lifestyle.yahoo.com/spacex-launches-48-more-starlink-224229609.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LpEJ7Aht4PWCU8Zy47UZDQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/lgUJduge5MQ7D5w3_mKGTg--~B/aD0yNTYwO3c9Mzg0MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/6956d8ca15194f754ca85de0d76a879f", "publishedAt": "2022-03-09T22:42:29Z", "content": "Its up, up and away for another SpaceX Starlink mission. At 5:45 this morning PST, a Falcon 9 rocket lifted off from Space Launch Complex 40 at Cape Canaveral in Florida, adding 48 new satellites to … [+1927 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Iqbal Pittalwala", "title": "Simulations on how a virus packages its genetic material could help design nanocontainers used in drug delivery - Phys.org", "description": "Each simple RNA virus has a genome, its \"native RNA.\" This genome dictates how the virus replicates in cells to eventually cause disease. The genome also has the code for making a capsid, the protein shell of a virus that encapsulates the genome and protects …", "url": "https://phys.org/news/2022-03-simulations-virus-packages-genetic-material.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/how-a-virus-packages-i.jpg", "publishedAt": "2022-03-09T22:09:50Z", "content": "Each simple RNA virus has a genome, its \"native RNA.\" This genome dictates how the virus replicates in cells to eventually cause disease. The genome also has the code for making a capsid, the protein… [+3613 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "How did Earth go From Molten Hellscape to Habitable Planet? - Universe Today", "description": "Earth might have become habitable sooner than thought. But for that to happen, something had to remove all those GHGs more quickly.", "url": "https://www.universetoday.com/154874/how-did-earth-go-from-molten-hellscape-to-habitable-planet/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/11/Hadean-Small.jpg", "publishedAt": "2022-03-09T21:53:22Z", "content": "Earth formed from the Sun’s protoplanetary disk about 4.6 billion years ago. In the beginning, it was a molten spheroid with scorching temperatures. Over time, it cooled, and a solid crust formed. Ev… [+12872 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New research sheds light on nature of friction in multi-layered graphene: New study provides insights into how surface structures influence nanoscale friction in this promising 2D material - Science Daily", "description": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely clear. Now, in a recent study, scientists analyze how surface s…", "url": "https://www.sciencedaily.com/releases/2022/03/220309104411.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T21:48:29Z", "content": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely cle… [+3335 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A River Runs Through It: NASA's Mars Perseverance Rover Onward to the Delta - SciTechDaily", "description": "The delta is calling and we must go! With one Earth year in its rearview mirror, the Perseverance rover has been racking up the odometry en route to the site of it’s next science campaign. It’s been a trip down memory lane since leaving Séítah on Sol 340 (Feb…", "url": "https://scitechdaily.com/a-river-runs-through-it-nasa-mars-perseverance-rover-onward-to-the-delta/", "urlToImage": "https://scitechdaily.com/images/Mars-Perseverance-Sol-361.jpg", "publishedAt": "2022-03-09T21:35:23Z", "content": "A ‘Kodiak’ Moment: This enhanced color image was acquired by the Mastcam-Z instrument aboard NASA’s Perseverance Mars rover on April 18, 2021 (sol 57). Kodiak, the prominent layered mound, stands app… [+2973 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison, Afp", "title": "Ants have the ability to sniff out cancer in humans, study reveals - Daily Mail", "description": "Researchers from the French National Centre for Scientific Research (CNRS) discovered that ant species Formica fusca has a  well developed sense of smell.", "url": "https://www.dailymail.co.uk/sciencetech/article-10595727/Ants-ability-sniff-cancer-humans-study-reveals.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/21/55159213-0-image-a-48_1646859764939.jpg", "publishedAt": "2022-03-09T21:12:04Z", "content": "Ants have the ability to sniff out cancerous cells in humans, a new study has discovered, suggesting they could be used for cancer diagnosis in future.\r\nResearchers from the French National Centre fo… [+5010 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Exploring the bounds of room-temperature superconductivity - Science Daily", "description": "There are a few superconducting material systems for electric transmission in various stages of development. In the meantime, researchers are conducting experiments to look for superconductivity in a room-temperature and atmospheric pressure environment.", "url": "https://www.sciencedaily.com/releases/2022/03/220309154834.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T21:03:31Z", "content": "In the simplest terms, superconductivity between two or more objects means zero wasted electricity. It means electricity is being transferred between these objects with no loss of energy.Many natural… [+3787 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA admits it may be time to study sex in space ahead of Mars missions - Daily Mail", "description": "Understanding sex, and how it will work in a low gravity environment, is essential, according to the academics from Concordia University in Montreal, Canada.", "url": "https://www.dailymail.co.uk/sciencetech/article-10595151/NASA-admits-time-study-sex-space-ahead-Mars-missions.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/18/55155043-0-image-a-33_1646852368512.jpg", "publishedAt": "2022-03-09T20:24:05Z", "content": "NASA says it is considering studying sex in space, as it is 'crucial' for future long-haul missions to the Moon and Mars, that could see astronauts away from Earth for years.\r\nThis was said in respon… [+12526 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "An 'oracle' for predicting the evolution of gene regulation - Science Daily", "description": "Computational biologists have created a neural network model capable of predicting how changes to non-coding DNA sequences in yeast affect gene expression. They also devised a unique way of representing this data in two dimensions, making it easy to understan…", "url": "https://www.sciencedaily.com/releases/2022/03/220309131825.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T20:20:30Z", "content": "Computational biologists have created a neural network model capable of predicting how changes to non-coding DNA sequences in yeast affect gene expression. They also devised a unique way of represent… [+8613 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "196 lasers help scientists recreate the conditions inside gigantic galaxy clusters - Nanowerk", "description": "Experiments point the way to solving mystery that keeps clusters hot.", "url": "https://www.nanowerk.com/news2/space/newsid=59991.php", "urlToImage": "https://www.nanowerk.com/news2/space/id59991_1.jpg", "publishedAt": "2022-03-09T20:14:32Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Hiawatha Crater Dated To A Few Million Years After Dinosaurs’ Extinction Impact - Forbes", "description": "Scientists have long debated whether a massive impact crater buried beneath Greenland's ice sheet had anything to do with a sudden cold snap and megafauna extinction 10,000 years ago. However, a new analysis shows the crater is far older.", "url": "https://www.forbes.com/sites/davidbressan/2022/03/09/hiawatha-crater-dated-to-a-few-million-years-after-dinosaurs-extinction-impact/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6228fea17d32de93782edc8c/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-03-09T19:46:34Z", "content": "Digital Elevation Model showing an impact crater beneath the ice sheet of Greenland.\r\nKjæer et al. 2018/Science Advances\r\nDanish and Swedish researchers have dated the enormous Hiawatha impact crater… [+3818 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "AFP", "title": "Buzz Aldrin's famous 1969 moon walk picture sells at auction - ฺBangkok Post", "description": "COPENHAGEN - More than 70 original NASA photographs including a celebrated image of Buzz Aldrin's moon walk taken by Neil Armstrong were sold at auction in Copenhagen on Wednesday for more than 155,000 euros ($172,000).", "url": "https://www.bangkokpost.com/world/2276575/buzz-aldrins-famous-1969-moon-walk-picture-sells-at-auction", "urlToImage": "https://static.bangkokpost.com/media/content/20220310/c1_4250051_700.jpg", "publishedAt": "2022-03-09T19:45:00Z", "content": "COPENHAGEN - More than 70 original NASA photographs including a celebrated image of Buzz Aldrin's moon walk taken by Neil Armstrong were sold at auction in Copenhagen on Wednesday for more than 155,0… [+993 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Stephen Johnson", "title": "When to See the 'Worm Moon' at Peak Brilliance - Lifehacker", "description": "Or the “Crow Comes Back Moon,\" or the “Sore Eyes Moon,\" or whatever other moon name you prefer.", "url": "https://lifehacker.com/when-to-see-the-worm-moon-at-peak-brilliance-1848629005", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/5c7375576bcdf77c0ae1e4a4d3b4d1b3.jpg", "publishedAt": "2022-03-09T19:30:00Z", "content": "Moon fans and casual lunar observers: If everything goes according to plan, the full moon in March will rise on Friday, March 18. Known as the Worm Moon, it will be brightest at around 3:20 a.m. ET. … [+2086 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Warming coral reefs in the past, present and future: an interview with PLOS Climate authors - Latitude - latitude.plos.org", "description": "Recent publications in PLOS Climate have highlighted how marine heatwaves are becoming the ‘new normal’, and the vulnerability of coral reef ecosystems…", "url": "https://latitude.plos.org/2022/03/warming-reefs/", "urlToImage": "http://latitude.plos.org/wp-content/uploads/sites/18/2022/03/sea-g32f3fa4be_1920.jpg", "publishedAt": "2022-03-09T19:09:16Z", "content": "Recent publications in PLOS Climatehave highlighted how marine heatwaves are becoming the ‘new normal’, and the vulnerability of coral reef ecosystems to warming oceans. We spoke to the authors of a … [+3419 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Black hole billiards in the centers of galaxies — ScienceDaily - Verve Times", "description": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggested solution, now published in Nature, involves a ch", "url": "https://vervetimes.com/black-hole-billiards-in-the-centers-of-galaxies-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T18:56:06Z", "content": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggest… [+6703 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Team Chosen To Extract Oxygen From the Surface of the Moon - SciTechDaily", "description": "Following a competition, ESA has selected the industrial team that will design and build the first experimental payload to extract oxygen from the surface of the Moon. The winning consortium, led by Thales Alenia Space in the UK, has been tasked with producin…", "url": "https://scitechdaily.com/team-chosen-to-extract-oxygen-from-the-surface-of-the-moon/", "urlToImage": "https://scitechdaily.com/images/European-Large-Logistics-Lander-Landing-scaled.jpg", "publishedAt": "2022-03-09T17:25:22Z", "content": "Following a competition, ESA has selected the industrial team that will design and build the first experimental payload to extract oxygen from the surface of the Moon. The winning consortium, led by … [+4720 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Spiders Use Electric Fields to Fly, And We May Finally Know How - ScienceAlert", "description": "Having never evolved wings, many species of spider instead evolved an uncanny ability to take to the skies using nothing more than a few short threads of gossamer dangling from their dainty butts.", "url": "https://www.sciencealert.com/simulations-show-in-unprecedented-detail-how-spiders-fly-using-electromagnetism", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SpiderLitByBokehLight_1024.jpg", "publishedAt": "2022-03-09T17:03:51Z", "content": "Having never evolved wings, many species of spider instead evolved an uncanny ability to take to the skies using nothing more than a few short threads of gossamer dangling from their dainty butts.\r\nJ… [+3535 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jens N. Lallensack, Peter Falkingham", "title": "We discovered how the largest dinosaurs walked – and it was more like rhinos than elephants - The Conversation", "description": "Thanks to our new technique using fossilised tracks, we have been able to learn more about the locomotion of the largest creatures ever to have roamed this planet.", "url": "https://theconversation.com/we-discovered-how-the-largest-dinosaurs-walked-and-it-was-more-like-rhinos-than-elephants-178194", "urlToImage": "https://images.theconversation.com/files/450781/original/file-20220308-21-iec6t4.jpg?ixlib=rb-1.1.0&rect=0%2C53%2C3539%2C1766&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-03-09T16:23:14Z", "content": "While our knowledge of dinosaurs and other extinct animals has dramatically increased during the last couple of decades, their gaits the order and timing of how animals move their legs have remained … [+5176 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Business Insider España", "title": "This scientist's meteorite defense system idea has NASA's attention - Business Insider", "description": "Professor Lubin's PI system could orbit the Earth or be placed on the surface of the Moon, he has written.", "url": "https://www.businessinsider.com/nasa-meteorite-defense-system-moon-save-earth-asteroid-strike-2022-3", "urlToImage": "https://i.insider.com/6228fa8e9fa32d00184c9279?width=1200&format=jpeg", "publishedAt": "2022-03-09T16:06:06Z", "content": "Our planet is hit by around 17,000 meteorites every year, according to a study by the University of Manchester and Imperial College London published in Geology.\r\nBut most of them disintegrate just af… [+2929 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "Exploring the Limitations of “Resurrecting” Extinct Animals - Technology Networks", "description": "A team of paleogeneticists have focused on the potential limitations of de-extinction, using the Christmas Island rat as a model organism.", "url": "https://www.technologynetworks.com/genomics/news/exploring-the-limitations-of-resurrecting-extinct-animals-359412", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359412/exploring-the-limitations-of-resurrecting-extinct-animals-359412-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T16:03:21Z", "content": "De-extinction, a process whereby scientists resurrect an organism that is or resembles an extinct species, was once talk of science fiction. Now, advances in genomic technologies have made it a forth… [+7223 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": null, "title": "New study sheds light on early human hair evolution - Phys.org", "description": "Hair is an important feature of primate—including human—diversity and evolution, serving functions tied to thermoregulation, protection, camouflage and signaling. However, the evolution of wild primate hair remained relatively ...", "url": "https://phys.org/visualstories/2022-03-early-human-hair-evolution.amp", "urlToImage": null, "publishedAt": "2022-03-09T16:02:04Z", "content": "Hair is an important feature of primateincluding humandiversity and evolution, serving functions tied to thermoregulation, protection, camouflage and signaling. However, the evolution of wild primate… [+28 chars]"}, {"source": {"id": null, "name": "Hhmi.org"}, "author": null, "title": "When Ribosomes Collide: How Bacteria Clean Up After Molecular Crashes - Howard Hughes Medical Institute", "description": "Tiny cellular machines called ribosomes build proteins. When this building process goes awry in bacteria, ribosomes collide, triggering the arrival of a first responder molecule that begins a rescue operation.", "url": "https://www.hhmi.org/news/when-ribosomes-collide-how-bacteria-clean-after-molecular-crashes", "urlToImage": "https://www.hhmi.org/sites/default/files/ecdisomes-overview-952x480.jpg", "publishedAt": "2022-03-09T16:01:12Z", "content": "When ribosomes collide in the cells of complex organisms, from yeast to humans, they trigger a quality control process that keeps protein production on track. New work suggests that the collisions (a… [+5449 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A surprisingly soft mineral may control how Earth recycles rocks - Phys.org", "description": "The geological events we see on the surface of the Earth as mountains, volcanoes and earthquakes are expressions of processes that are happening deep in our planet. Here on the Earth's crust, we're part of a conveyor belt system called plate tectonics where o…", "url": "https://phys.org/news/2022-03-x-ray-view-subducting-tectonic-plates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/x-ray-view-of-subducti.jpg", "publishedAt": "2022-03-09T16:00:07Z", "content": "The geological events we see on the surface of the Earth as mountains, volcanoes and earthquakes are expressions of processes that are happening deep in our planet. Here on the Earth's crust, we're p… [+7159 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Psyche: NASA just took a key step to visiting a fantastic, metal-rich asteroid - Interesting Engineering", "description": "NASA's Psyche mission is coming close to liftoff to investigate one of the most metal-rich asteroids ever observed, 16 Psyche.", "url": "https://interestingengineering.com/psyche-nasa-metal-rich-asteroid", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/jvwvj078wx/sizes/psyche_md.jpeg", "publishedAt": "2022-03-09T15:05:01Z", "content": "NASA's Psyche mission, which will investigate one of the most metal-rich asteroids ever observed, 16 Psyche, is edging ever nearer to liftoff.\r\nThe Psyche spacecraft just had its twin solar arrays in… [+3065 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "China's Yutu 2 rover sends back image after 3 years on moon's far side - Daijiworld.com", "description": "Beijing, Mar 9 (IANS): China's Yutu 2 rover, traversing the harsh environment of the moon's far side, has returned a view of its path over the last three years.\r\nYutu 2 touched down on the lunar far side in January 2019 atop the Chang'e 4 lander, making the p…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=935098", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-03-09T14:12:35Z", "content": "Beijing, Mar 9 (IANS): China's Yutu 2 rover, traversing the harsh environment of the moon's far side, has returned a view of its path over the last three years.\r\nYutu 2 touched down on the lunar far … [+1664 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Past Climate Change May Have Influenced Fossilization - AZoCleantech", "description": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.", "url": "https://www.azocleantech.com/news.aspx?newsID=31297", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31297_16468254146348397.jpg", "publishedAt": "2022-03-09T13:41:00Z", "content": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.\r\nA fossil of a crustacean claw exoskeleton from the Posidonia Shale in Germany. Image Credit: Drew M… [+4228 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Juno spacecraft clicks Jupiter`s moon casting shadow on the gas giant - WION", "description": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on Earth as when Moon comes between the Sun and Earth, the sha…", "url": "https://www.wionews.com/science/nasa-juno-spacecraft-clicks-jupiters-moon-casting-shadow-on-gas-giant-460580", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/09/246450-jupiter.jpg", "publishedAt": "2022-03-09T12:51:21Z", "content": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on… [+1028 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Study Using Microrobots Demonstrates How Animal Swarms Respond to Danger - AZoRobotics", "description": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Bechinger, a member of the Cluster of Excellence \"Centre for t…", "url": "https://www.azorobotics.com/News.aspx?newsID=12798", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_12798_16468293543237810.jpg", "publishedAt": "2022-03-09T12:27:00Z", "content": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Be… [+4446 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "There's a big rock stuck inside one of Perseverance's wheels - Phys.org", "description": "It looks like the Perseverance rover has an unwanted passenger, a rock stuck inside one of its wheels. The image of the stone was selected by public input as the \"Image of the Week\" for Week 54 (Feb. 20–26, 2022) of the Perseverance mission. Perseverance capt…", "url": "https://phys.org/news/2022-03-big-stuck-perseverance-wheels.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/theres-a-big-rock-stuc.jpg", "publishedAt": "2022-03-09T11:59:53Z", "content": "It looks like the Perseverance rover has an unwanted passenger, a rock stuck inside one of its wheels. The image of the stone was selected by public input as the \"Image of the Week\" for Week 54 (Feb.… [+3380 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Miguel Brown", "title": "Asteroid to Hit Earth on 2023 Reviewed by Scientists No Longer a Threat - Nature World News", "description": "A finding of a highly deadly asteroid set astrophysicists on a thrilling experience trip prior this season.\r\nScientists at the Mount Lemmon Laboratory in Arizona detected an extraterrestrial around 70-meters (230 ft) large, early on January 6th of year 2022.", "url": "https://www.natureworldnews.com/articles/49809/20220309/asteroid-earth-2023-asteroid-2022-ae1.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/58620/australia-japan-science-space-asteroid-hayabusa.jpg", "publishedAt": "2022-03-09T11:08:42Z", "content": "A finding of a highly deadly asteroid set astrophysicists on a thrilling experience trip prior this season.\r\nScientists at the Mount Lemmon Laboratory in Arizona detected an extraterrestrial around 7… [+3854 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "​​​​​​​Research sheds light on mysterious messenger RNA modifications - Phys.org", "description": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long remained a fundamental mystery in molecular biology.", "url": "https://phys.org/news/2022-03-mysterious-messenger-rna-modifications.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2015/messengerrna.png", "publishedAt": "2022-03-09T10:00:02Z", "content": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long… [+3900 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "A zigzag blueprint for topological electronics - Nanowerk", "description": "A new study confirms switching mechanism for a new, proposed generation of ultra-low energy 'topological electronics'.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=59981.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id59981.jpg", "publishedAt": "2022-03-09T09:57:30Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Genes Inherited From Mom or Dad Could Shape Behaviors - Technology Networks", "description": "According to new research led by scientists at University of Utah Health, each parent has their own impact on hormones and other chemical messengers that control mood and behavior.", "url": "https://www.technologynetworks.com/genomics/news/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359377/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T09:27:11Z", "content": "Parenting is not the only way moms and dads impact the behavior of their offspring. Genes matter, too. And although most of our genes are inherited in pairsone copy from each parentmoms and dads exer… [+5742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Our sun keeps flaring and these 2 missions are capturing it all - CNN", "description": "The sun is getting more active as it nears solar maximum, and the Solar Orbiter and Parker Solar Probe missions are perfectly poised to witness our star's increasing flares and storms.", "url": "https://www.cnn.com/2022/03/09/world/solar-orbiter-parker-probe-sun-flare-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309042318-02-solar-orbiter-sun-flare-super-tease.jpeg", "publishedAt": "2022-03-09T09:00:00Z", "content": null}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Charlotte Edwards, The Sun", "title": "How Chinese rocket crashed into moon - news.com.au", "description": "<p>An unruly chunk of rocket debris is thought to have crashed into the moon.</p>", "url": "https://www.news.com.au/technology/science/space/mindblowing-video-reveals-how-chinese-rocket-crashed-into-moon-last-week/news-story/74ce0e557c5085c327dc6564ad9a97c9", "urlToImage": "https://content.api.news/v3/images/bin/42eaea9f90b2e57e44faf8754f7b943d", "publishedAt": "2022-03-09T00:44:03Z", "content": "A mind-blowing video has revealed how a rocket which originated in China crashed into the dark side of the moon last week.An unruly chunk of rocket debris is thought to have crashed into the moon.\r\nA… [+2206 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Angie Jackman Works to Develop Rocket That Will Bring Mars Samples to Earth – NASA Mars Exploration - NASA Mars Exploration", "description": "Meet the project manager of the first rocket to launch from the surface of another planet, the Mars Ascent Vehicle.", "url": "https://mars.nasa.gov/news/9141/nasas-angie-jackman-works-to-develop-rocket-that-will-bring-mars-samples-to-earth/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/9141_PIA25078-web.jpg", "publishedAt": "2022-03-08T17:50:56Z", "content": "NASA’s Mars Sample Return mission will revolutionize our understanding of Mars by returning samples for study using the most sophisticated instruments around the world. These samples, collected by Pe… [+358 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Researchers Name Fossilised Vampire Squid After Joe Biden - Gizmodo Australia", "description": "A team of paleontologists has announced the discovery of a 328-million-year-old cephalopod with 10 arms. It’s an ancestor of modern...", "url": "https://www.gizmodo.com.au/2022/03/researchers-name-fossilized-vampire-squid-after-joe-biden/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/03/09/8c4ad807784747fe87b626ebb4067bca.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-03-08T17:37:00Z", "content": "A team of paleontologists has announced the discovery of a 328-million-year-old cephalopod with 10 arms. Its an ancestor of modern octopuses and vampire squids and offers exciting insights into when … [+4076 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Mars rover reveals new features on the red planet - CGTN", "description": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist on Monday.", "url": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/img/3fdec88f93ed474187756d7b39fed3bb/3fdec88f93ed474187756d7b39fed3bb-750.png", "publishedAt": "2022-03-08T15:00:57Z", "content": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist o… [+1163 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "This extinct ten-armed fossil may be earliest known ancestor of vampire squid - Ars Technica", "description": "Syllipsimopodi bideni named to honor US President Joe Biden's commitment to science.", "url": "https://arstechnica.com/science/2022/03/this-extinct-ten-armed-fossil-may-be-earliest-known-ancestor-of-vampire-squid/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/squid1ROTATE-760x380.jpg", "publishedAt": "2022-03-08T13:43:49Z", "content": "Enlarge/ An artistic reconstruction of the newly described 328-million-year-old vampyropod, Syllipsimopodi bideni.\r\n31 with 23 posters participating\r\nPaleontologists believe they have discovered a ne… [+4819 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Researchers Attempt to Make Highly Sustainable Renewable Energy Devices - AZoCleantech", "description": "3D printing was utilized by the University of Cambridge researchers to make grids of high-rise “nano-housing” where sun-loving bacteria grow rapidly.", "url": "https://www.azocleantech.com/news.aspx?newsID=31284", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31284_16467411562085546.jpg", "publishedAt": "2022-03-08T13:42:00Z", "content": "3D printing was utilized by researchers at the University of Cambridge to make grids of high-rise “nano-housing” where sun-loving bacteria grow rapidly.\r\n3D-printed custom electrodes. Image Credit: G… [+4739 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists significantly improved micro-computed tomography - Tech Explorist", "description": "Advances in micro-computed tomography.", "url": "https://www.techexplorist.com/scientists-significantly-improved-micro-computed-tomography/45154/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/micro-computed-tomography-scanner.jpg", "publishedAt": "2022-03-08T10:57:30Z", "content": "Also known as microtomography, Micro-computed tomography (Micro-CT) is a 3D imaging technique that generates 3D images of the internal structure of samples with small dimensions. It is generally used… [+3475 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "How does the brain make memories? Researchers discover neurons that separate experience into segments, then... - Verve Times", "description": "Researchers have discovered two types of brain cells that play a key role in dividing continuous human experience into distinct segments that can be recalled later. The discovery provides new promise as a path toward development of novel treatments f", "url": "https://vervetimes.com/how-does-the-brain-make-memories-researchers-discover-neurons-that-separate-experience-into-segments-then-help-the-brain-time-travel-and-remember-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T10:14:48Z", "content": "Researchers have discovered two types of brain cells that play a key role in dividing continuous human experience into distinct segments that can be recalled later. The discovery provides new promise… [+6493 chars]"}]}