{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New concept for rocket thruster exploits the mechanism behind solar flares - Nanowerk", "description": "A new type of rocket thruster that could take humankind to Mars and beyond has been proposed by a physicist. The device would apply magnetic fields to cause particles of plasma to shoot out the back of a rocket and propel the craft forward.", "url": "https://www.nanowerk.com/news2/space/newsid=57155.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57155.jpg", "publishedAt": "2021-01-28T18:17:03Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Oldest Land-Fossil Could Explain How Earth Recovered From Snowball State - IFLScience", "description": "Thread-like filaments, attached to hollow spheres in 635 million-year-old rocks, represent the earliest evidence we have of life on land. They may also hel", "url": "https://www.iflscience.com/plants-and-animals/oldest-land-fossil-could-explain-how-earth-recovered-from-snowball-state/", "urlToImage": "https://cdn.iflscience.com/images/9e2b14d7-4dc5-5da8-9fbf-b3f394a7ae43/default-1611848669-oldest-fungus.jpg", "publishedAt": "2021-01-28T18:06:00Z", "content": "Thread-like filaments, attached to hollow spheres in 635 million-year-old rocks, represent the earliest evidence we have of life on land. They may also help explain how life rebounded from Snowball E… [+2906 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Life on Venus claim faces strongest challenge yet - Nature.com", "description": "New studies knock down a controversial report observing phosphine in the planet’s atmosphere.", "url": "https://www.nature.com/articles/d41586-021-00249-y", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-00249-y/d41586-021-00249-y_18803520.jpg", "publishedAt": "2021-01-28T17:34:57Z", "content": "Japans Akatsuki orbiter captured this image of Venuss clouds with its ultraviolet imager.Credit: ISAS, JAXA, Akatsuki; Processing: Meli thev\r\nTwo papers have dealt a fresh blow to the idea that Venus… [+5060 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Successful test paves way for new planetary radar - EurekAlert", "description": "Collaboration between the National Radio Astronomy Observatory, the Green Bank Observatory, and Raytheon Intelligence & Space turns the Green Bank Telescope and the Very Long Baseline Array into a radar system for studying the Solar System.", "url": "https://www.eurekalert.org/pub_releases/2021-01/nrao-stp012821.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-01-28T17:19:51Z", "content": "The National Science Foundation's Green Bank Observatory (GBO) and National Radio Astronomy Observatory (NRAO), and Raytheon Intelligence &amp; Space conducted a test in November to prove that a new … [+2888 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Nasa's Perseverance rover is bearing down on Mars - Yahoo News Australia", "description": "The biggest, most sophisticated vehicle ever sent to land on another planet", "url": "https://news.yahoo.com/nasas-perseverance-rover-bearing-down-155053895.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/MYmQ8i8r358ZE0l1GR9dkA--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/ed476f5faa7fb52e6b2b79747fd2b36f", "publishedAt": "2021-01-28T17:15:00Z", "content": "The US space agency's Perseverance rover is now just three weeks from arriving at Mars.\r\nThe robot's current distance to the Red Planet is still some 4.5 million km (3 million miles), but that gap is… [+5095 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Yasemin Saplakoglu", "title": "The deep mantle may be pushing the Atlantic Ocean apart - Livescience.com", "description": "The Atlantic is expanding by a couple of inches a year.", "url": "https://www.livescience.com/atlantic-ocean-widening-mantle-upwelling.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PBwTwPhNHqHE294xqxrPed-1200-80.jpg", "publishedAt": "2021-01-28T17:01:00Z", "content": "The Atlantic Ocean is getting wider, shoving the Americas to one side and Europe and Africa to the other. But its not known exactly how. \r\nA new study suggests that deep beneath the Earths crust, in … [+7536 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Human Thumbs Got a Major Upgrade 2 Million Years Ago, Sparking a Cultural Revolution, Study Finds - Gizmodo Australia", "description": "The human thumb is a marvel of evolution, allowing our ancestors to craft stone tools and radically expand their food choices. New research suggests our agile, dextrous thumbs appeared 2 million years ago, in a development that irrevocably changed the course …", "url": "https://www.gizmodo.com.au/2021/01/human-thumbs-got-a-major-upgrade-2-million-years-ago-sparking-a-cultural-revolution-study-finds/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/01/29/uksysxvkvkwtrcjztotx.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-01-28T17:00:00Z", "content": "The human thumb is a marvel of evolution, allowing our ancestors to craft stone tools and radically expand their food choices. New research suggests our agile, dextrous thumbs appeared 2 million year… [+7672 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Lewis", "title": "The first full moon of 2021 — the \"Wolf Moon\" — shines bright in the sky tonight - CBS News", "description": "Look up! The full moon reaches peak illumination this afternoon.", "url": "https://www.cbsnews.com/news/first-full-wolf-moon-shines-bright-night-sky-01-28-2021/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2021/01/28/09d7be70-c7f6-4305-9d0e-fedfd813a575/thumbnail/1200x630/79af7e40583ad30815066bb126f74a64/gettyimages-1230811562.jpg", "publishedAt": "2021-01-28T16:35:00Z", "content": "The first full moon of the year will light up the night sky on Thursday, January 28, 2021. But you won't have to wait until the middle of the night to see it — the full \"Wolf Moon\" moon reaches peak … [+2402 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Physicists Precisely Measure Charge Radius of Alpha Particle | Physics - Sci-News.com", "description": "Using a method called atomic spectroscopy, an international team of physicists has produced a new value for the charge radius of the α particle, the nucleus of the helium-4 atom.", "url": "http://www.sci-news.com/physics/charge-radius-alpha-particle-09296.html", "urlToImage": "http://cdn.sci-news.com/images/2021/01/image_9296-Alpha-Particle.jpg", "publishedAt": "2021-01-28T16:25:10Z", "content": "Using a method called atomic spectroscopy, an international team of physicists has produced a new value for the charge radius of the particle, the nucleus of the helium-4 atom.\r\nThe trace of an parti… [+2326 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "The Long-Standing Mystery of Climate Change Resolved - AZoCleantech", "description": "According to a study under the guidance of Rutgers University, the main mystery behind climate change has been resolved by the researchers, which shows that the current yearly global temperature is the warmest of the last 10,000 years—in contrast to recent re…", "url": "https://www.azocleantech.com/news.aspx?newsID=28735", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28735_16118375542077523.jpg", "publishedAt": "2021-01-28T14:49:00Z", "content": "Written by AZoCleantechJan 28 2021\r\nAccording to a study under the guidance of Rutgers University, the main mystery behind climate change has been resolved by the researchers, which shows that the cu… [+3872 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Eyes reveal life history of fish: Eye-popping research helps inform salmon and floodplain management - Science Daily", "description": "If you look deep into the eyes of a fish, it will tell you its life story. Scientists demonstrate that they can use stable isotopic analysis of the eye lenses of freshwater fish -- including threatened and endangered salmon -- to reveal a fish's life history …", "url": "https://www.sciencedaily.com/releases/2021/01/210128091213.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-28T14:28:20Z", "content": "If you look deep into the eyes of a fish, it will tell you its life story.Scientists from the University of California, Davis, demonstrate that they can use stable isotopic analysis of the eye lenses… [+5070 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Owen Jarus", "title": "Puppy prints and wall illusions found in 1,500-year-old house in Turkey - Livescience.com", "description": "", "url": "https://www.livescience.com/ancient-house-turkey-puppy-prints.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LwK4iXvBLRyLFv6N6tUxVb-1200-80.jpg", "publishedAt": "2021-01-28T14:20:00Z", "content": "Archaeologists have discovered a fantastical-looking, 1,500-year-old house in Turkey that was decorated with illusory wall paintings and terracotta tiles on the floor with puppy prints and possible c… [+3372 chars]"}, {"source": {"id": null, "name": "hortidaily.com"}, "author": null, "title": "Study on growing plants in space with quantum dot films - hortidaily.com", "description": "UbiQD, a New Mexico-based advanced materials company, announced today that it has published the results of the first phase of its NASA-funded plant trials in the open-access Nature Research…", "url": "https://www.hortidaily.com/article/9288548/study-on-growing-plants-in-space-with-quantum-dot-films/", "urlToImage": "https://www.hortidaily.com/remote.axd?https://agfstorage.blob.core.windows.net/misc/HD_com/2021/01/28/ubiq.jpg?preset=OgImage", "publishedAt": "2021-01-28T13:57:48Z", "content": "UbiQD, a New Mexico-based advanced materials company, announced today that it has published the results of the first phase of its NASA-funded plant trials in the open-access Nature Research journal, … [+1709 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "First-ever cloudless 'hot Jupiter' with four-day year discovered in exoplanet survey - Firstpost", "description": "The gas giant was first detected in 2012 using the Wide Angle Search for Plants (WASP) South survey, but this is the first time that its atmosphere has been studied", "url": "https://www.firstpost.com/tech/science/first-ever-cloudless-hot-jupiter-with-four-day-year-discovered-in-exoplanet-survey-9249681.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/Cloudless-Hot-Jupiter_M-Weiss_CfA.jpg", "publishedAt": "2021-01-28T13:10:25Z", "content": "FP TrendingJan 28, 2021 18:40:25 IST\r\nAstronomers have been able to discover an exoplanet which has no clouds. It is only the second of its kind to have been discovered. According to study authors it… [+1680 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Eddie Irizarry", "title": "Say goodbye to Earth’s mini-moon on February 1 and 2 - EarthSky", "description": "In November, a new mini-moon began orbiting Earth. NASA later confirmed it's a lost-and-found 60s-era rocket from the Surveyor 2 moon mission, launched more than 50 years ago. Now the object - SO 2020 - is coming close again for one last time. Here's how to s…", "url": "https://earthsky.org/space/2020-so-mini-moon-asteroid-or-space-junk", "urlToImage": "https://earthsky.org/upl/2020/01/2020-SO-trajectory-earth-passes-2020-2021-800-300x225.gif", "publishedAt": "2021-01-28T13:08:57Z", "content": "Strange space object 2020 SO was discovered on September 17, 2020, on approach to Earth. On November 8, it slowly drifted into Earth’s sphere of gravitational dominance, to become a new mini-moon. It… [+8956 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sean Martin", "title": "SpaceX Starship launch live stream: Watch as Elon Musk's firm attempts lift-off for SN9 - Daily Express", "description": "SPACEX is preparing to finally test launch its current SN9 Starship rocket prototype after days of delays. You can watch the event unfold live here, courtesy of SpaceX.", "url": "https://www.express.co.uk/news/science/1390252/spacex-starship-launch-live-stream-watch-elon-musk-sn9-launch-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1390252.jpg", "publishedAt": "2021-01-28T12:59:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Sextuply-eclipsing sextuple star system uncovered in TESS data with an assist from AI - Phys.org", "description": "An international team of researchers led by Brian P. Powell at NASA's Goddard Space Flight Center and Veselin P. Kostov at the SETI Institute has identified a unique system consisting of six stars. The three binary stars form a gravitationally-bound system an…", "url": "https://phys.org/news/2021-01-sextuply-eclipsing-sextuple-star-uncovered-tess.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/sextuplyecli.jpg", "publishedAt": "2021-01-28T12:33:16Z", "content": "An international team of researchers led by Brian P. Powell at NASA's Goddard Space Flight Center and Veselin P. Kostov at the SETI Institute has identified a unique system consisting of six stars. T… [+3713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "NASA’s sonification video of supernova leaves netizens mesmerised - The Indian Express", "description": "Shared on official account for NASA's Hubble Space Telescope, the post features a series of time-lapse observation videos gathered from NASA’s Chandra X-ray Observatory and the Hubble telescope.", "url": "https://indianexpress.com/article/trending/trending-globally/nasa-supernova-sonification-7165349/", "urlToImage": "https://images.indianexpress.com/2021/01/NASA-6.jpg", "publishedAt": "2021-01-28T12:14:06Z", "content": "The National Aeronautics and Space Administration’s (NASA) data sonification projects reveal mesmerising sounds of the celestial objects. The latest in the series is the sonification of supernova 198… [+576 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists measured carbon at pressures reaching 2,000 GPa - Tech Explorist", "description": "A team of scientists successfully measured carbon at pressures reaching 2,000 GPa (five times the pressure in Earth’s core), nearly doubling the maximum pressure at which a crystal structure has ever been directly probed.", "url": "https://www.techexplorist.com/scientists-measured-carbon-pressures-reaching-2000-gpa/37527/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/diamond.jpg", "publishedAt": "2021-01-28T12:06:00Z", "content": "Carbon is one of the most ubiquitous elements. Besides being a building block for all known life, carbon material sits in carbon-rich exoplanets’ interior, hence subject to an intense investigation b… [+3468 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "US and Europe are literally growing further apart as Atlantic Ocean widens each year - RT", "description": "Scientists have discovered that, contrary to popular wisdom, the mid-ocean mountain ranges beneath the Atlantic Ocean appear to play a much bigger role in the shape of the Earth, and are literally driving the US and Europe apart.", "url": "https://www.rt.com/news/513869-atlantic-expanding-tectonic-plates-research/", "urlToImage": "https://cdni.rt.com/files/2021.01/article/601285b385f5406a352f2188.jpg", "publishedAt": "2021-01-28T12:03:00Z", "content": "The precise mechanism which underlies the movement of Earth's tectonic plates has long eluded scientists but this latest research from the University of Southampton could yield major changes to think… [+2243 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Soap bubble freezes into an iridescent snow globe in cool new video - Livescience.com", "description": "", "url": "https://www.livescience.com/frozen-soap-bubbles-winnipeg.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wiTVEuB8kXMm5eMzn5cHdi-1200-80.jpg", "publishedAt": "2021-01-28T12:00:00Z", "content": "A photographer captured mesmerizing footage of a soap bubble freezing over and transforming into a delicate snow globe after temperatures plunged in Winnipeg, Canada.  \r\nThe stunning footage was capt… [+2783 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Dark matter not 'super heavy' or 'super light': In a first, scientists calculate its mass range - Down To Earth Magazine", "description": "Quantum gravity, a combination of Einstein&rsquo;s concepts of quantum physics and general relativity, was used in the research", "url": "https://www.downtoearth.org.in/news/science-technology/dark-matter-not-super-heavy-or-super-light-in-a-first-scientists-calculate-its-mass-range-75243", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2021-01-28/0.39848300_1611828140_wiki-dark-matter.jpg", "publishedAt": "2021-01-28T11:37:44Z", "content": "Quantum gravity, a combination of Einstein’s concepts of quantum physics and general relativity, was used in the researchAround 95 percent of the Universe is unknown to human beings. It is often refe… [+4699 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Pinkstone", "title": "Scientists claim to have found an extract from mangrove trees that can cure BALDNESS - Daily Mail", "description": "Scientists from  Chulalongkorn University have been studying Avicequinon-C for several years and the recent tests won an award from the National Research Council of Thailand.", "url": "https://www.dailymail.co.uk/sciencetech/article-9196917/Scientists-claim-extract-mangrove-trees-cure-BALDNESS.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/28/11/38587642-0-image-a-8_1611834075423.jpg", "publishedAt": "2021-01-28T11:32:00Z", "content": "Thai researchers claim to have found an extract from mangrove trees that can cure baldness. \r\nA small study of 50 people suffering with androgenic alopecia the most common form of baldness indicates … [+5084 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Lauren Napier", "title": "Thousands more satellites will soon orbit Earth – we need better rules to prevent space crashes - The Conversation UK", "description": "The shift toward mega-constellations is a challenge for global space governance.", "url": "https://theconversation.com/thousands-more-satellites-will-soon-orbit-earth-we-need-better-rules-to-prevent-space-crashes-154014", "urlToImage": "https://images.theconversation.com/files/380684/original/file-20210126-13-1irjvln.jpg?ixlib=rb-1.1.0&rect=123%2C322%2C4425%2C2209&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-01-28T10:39:00Z", "content": "In recent years, satellites have become smaller, cheaper, and easier to make with commercial off the shelf parts. Some even weigh as little as one gram. This means more people can afford to send them… [+5908 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "635 million-year-old fungi-like microfossil that bailed us out of an ice age discovered - Phys.org", "description": "When you think of fungi, what comes to mind may be a crucial ingredient in a recipe or their amazing ability to break down dead organic matter into vital nutrients. But new research by Shuhai Xiao, a professor of geosciences with the Virginia Tech College of …", "url": "https://phys.org/news/2021-01-million-year-old-fungi-like-microfossil-bailed-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/635millionye.jpg", "publishedAt": "2021-01-28T10:00:01Z", "content": "When you think of fungi, what comes to mind may be a crucial ingredient in a recipe or their amazing ability to break down dead organic matter into vital nutrients. But new research by Shuhai Xiao, a… [+7127 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Joe Middleton", "title": "Upsurge of matter pushing Europe and America further apart, research suggests - The Independent", "description": "The continents drifting roughly 4cm further apart each year, as experts tell Joe Middleton", "url": "https://www.independent.co.uk/news/science/earth-matter-pushing-europe-america-apart-b1793523.html", "urlToImage": "https://static.independent.co.uk/2021/01/27/14/DSC_8087.jpg", "publishedAt": "2021-01-28T08:16:00Z", "content": "An upsurge of matter from  deep beneath the Earth's crust is pushing America and Europe further apart by about four centimetres every year, new research has found.\r\nUK experts studied the seismic act… [+429 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: Coronavirus variants escape effects of antibody drugs Scientists produce embryos in race to save northern white rhino from extinction - Devdiscourse", "description": "Drugs, vaccines less effective vs new virus variants; antibody cocktail may protect patients' contacts  The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the …", "url": "https://www.devdiscourse.com/article/science-environment/1424836-science-news-roundup-coronavirus-variants-escape-effects-of-antibody-drugs-scientists-produce-embryos-in-race-to-save-nort", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_08_2020_20_23_44_6331919.jpg?width=920&format=jpeg", "publishedAt": "2021-01-28T04:57:46Z", "content": "Following is a summary of current science news briefs.\r\nDrugs, vaccines less effective vs new virus variants; antibody cocktail may protect patients' contacts\r\nThe following is a roundup of some of t… [+2172 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "George Citroner", "title": "Can a Full Moon Affect Your Sleep? - Healthline", "description": "A new study finds we sleep less on the nights leading up to a full moon, but researchers don’t understand why this occurs.", "url": "https://www.healthline.com/health-news/how-a-full-moon-may-affect-your-sleep", "urlToImage": "https://post.healthline.com/wp-content/uploads/2021/01/full-moon-light-flooding-bedroom-1200x628-facebook-1200x628.jpg", "publishedAt": "2021-01-28T00:49:53Z", "content": "<ul><li>A new study finds we sleep less on the nights leading up to a full moon, but researchers dont understand why this occurs.</li><li>Researchers looked at people who live with no, limited, and f… [+5762 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Avery", "title": "Hopes of finding life on Venus are dashed as study finds atmosphere does NOT contain phosphine gas - Daily Mail", "description": "A study refutes the theory that phosphine gas, which can indicate microbial life, was found in the clouds above Venus. Researches now say it was sulfur dioxide detected in upper atmosphere.", "url": "https://www.dailymail.co.uk/sciencetech/article-9194853/Hopes-finding-life-Venus-dashed-study-finds-atmosphere-does-NOT-contain-phosphine-gas.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/27/22/38563672-0-image-a-43_1611786961069.jpg", "publishedAt": "2021-01-27T23:49:00Z", "content": "Scientists have sucked the life out of a theory suggesting Venus could be home to biological organisms.\r\nIn September, researchers claimed to have detected trace amounts of phosphine gas in the plane… [+10218 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "National Museum of the US Air Force to unveil new space exhibit - WDTNTV", "description": "The National Museum of the US Air Force wants to ignite your desire for space exploration and discovery with a new exhibit.", "url": "https://www.youtube.com/watch?v=nsJd6wr0cnY", "urlToImage": "https://i.ytimg.com/vi/nsJd6wr0cnY/maxresdefault.jpg", "publishedAt": "2021-01-27T22:41:32Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "New MIT brain research shows how AI could help us understand consciousness - The Next Web", "description": "A team of researchers from MIT and Massachusetts General Hospital recently published a study linking social awareness to individual neuronal activity. To the best of our knowledge, this is the first time evidence for the ‘theory of mind‘ has been identified a…", "url": "https://thenextweb.com/neural/2021/01/27/new-mit-brain-research-shows-how-ai-could-help-us-understand-consciousness/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2018%2F03%2Fbraincomputer.jpg&signature=7c84c378b610fb68d903388947e164c2", "publishedAt": "2021-01-27T20:34:00Z", "content": "A team of researchers from MIT and Massachusetts General Hospital recently published a study linking social awareness to individual neuronal activity. To the best of our knowledge, this is the first … [+4019 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "Astronomers Find a Planet Like Jupiter, but It Doesn’t Have any Clouds - Universe Today", "description": "Astronomers have found the first Jupiter-like exoplanet with no clouds or haze. It's an ideal object for further study with the James Webb Space Telescope.", "url": "https://www.universetoday.com/149833/astronomers-find-a-planet-like-jupiter-but-it-doesnt-have-any-clouds/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/01/WASP-62b.jpg", "publishedAt": "2021-01-27T20:28:06Z", "content": "Can you picture Jupiter without any observable clouds or haze? It isn’t easy since Jupiter’s latitudinal cloud bands and its Great Red Spot are iconic visual features in our Solar System. Those featu… [+7705 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Up-trending farming and landscape disruptions threaten Paris climate agreement goals - Phys.org", "description": "One of President Joe Biden's first post-inauguration acts was to realign the United States with the Paris climate accord, but a new study led by researchers at the University of California, Irvine demonstrates that rising emissions from human land-use will je…", "url": "https://phys.org/news/2021-01-up-trending-farming-landscape-disruptions-threaten.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/uptrendingfa.jpg", "publishedAt": "2021-01-27T20:22:26Z", "content": "One of President Joe Biden's first post-inauguration acts was to realign the United States with the Paris climate accord, but a new study led by researchers at the University of California, Irvine de… [+4349 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Urton", "title": "Purported phosphine on Venus more likely to be ordinary sulfur dioxide, new study shows - Phys.org", "description": "In September, a team led by astronomers in the United Kingdom announced that they had detected the chemical phosphine in the thick clouds of Venus. The team's reported detection, based on observations by two Earth-based radio telescopes, surprised many Venus …", "url": "https://phys.org/news/2021-01-purported-phosphine-venus-ordinary-sulfur.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-purportedpho.jpg", "publishedAt": "2021-01-27T20:21:59Z", "content": "In September, a team led by astronomers in the United Kingdom announced that they had detected the chemical phosphine in the thick clouds of Venus. The team's reported detection, based on observation… [+7224 chars]"}, {"source": {"id": null, "name": "Surreycomet.co.uk"}, "author": "Press Association 2021", "title": "Astronauts complete spacewalk to install British-built broadband hub on ISS - Surrey Comet", "description": "The technology will revolutionise scientists’ ability in the UK and Europe to access the results of space-based experiments.", "url": "https://www.surreycomet.co.uk/news/national/19043990.astronauts-complete-spacewalk-install-british-built-broadband-hub-iss/", "urlToImage": "https://www.surreycomet.co.uk/resources/images/12265672/", "publishedAt": "2021-01-27T20:02:00Z", "content": "Two astronauts have completed a spacewalk to install a British-built broadband hub that will beam scientific research back to Earth.\r\nThe technology marks the country’s first major industrial contrib… [+2559 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How heavy is dark matter? Scientists radically narrow the potential mass range for the first time - Science Daily", "description": "Scientists have calculated the mass range for Dark Matter - and it's tighter than the science world thought.", "url": "https://www.sciencedaily.com/releases/2021/01/210127140126.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-27T19:38:59Z", "content": "Scientists have calculated the mass range for Dark Matter -- and it's tighter than the science world thought.Their findings -- due to be published in Physics Letters B in March -- radically narrow th… [+2370 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Women's menstrual cycles temporarily synchronize with Moon cycles - EurekAlert", "description": "An analysis of long-term menstrual cycle records kept by 22 women for up to 32 years shows that women with cycles lasting longer than 27 days intermittently synchronized with cycles that affect the intensity of moonlight and the moon's gravitational pull. Thi…", "url": "https://www.eurekalert.org/pub_releases/2021-01/aaft-wmc012621.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-01-27T19:05:46Z", "content": "An analysis of long-term menstrual cycle records kept by 22 women for up to 32 years shows that women with cycles lasting longer than 27 days intermittently synchronized with cycles that affect the i… [+2422 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Prebiotic ingredients for life found around young star - Space.com", "description": "Someday the molecules may end up in a planet and become the necessary elements for life.", "url": "https://www.space.com/prebiotic-ingredients-life-found-young-star", "urlToImage": "https://cdn.mos.cms.futurecdn.net/unsfrxg9wLav7g7M3CgzjV-1200-80.jpg", "publishedAt": "2021-01-27T17:00:00Z", "content": "Paul M. Sutter\r\nis an astrophysicist atSUNY\r\nStony Brook and the Flatiron Institute, host ofAsk a Spaceman\r\nandSpace Radio\r\n, and author of How to Die in Space\r\n. He contributed this article to Space… [+5289 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Palaeoclimate puzzle explained by seasonal variation - Nature.com", "description": "A method that corrects for seasonal bias in climate proxies.", "url": "https://www.nature.com/articles/d41586-021-00115-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-00115-x/d41586-021-00115-x_18796948.png", "publishedAt": "2021-01-27T16:45:25Z", "content": "Understanding past climate change is crucial for putting modern global warming in context. Reconstructions of climate during the Holocene the current interglacial epoch, which began 11,700 years ago … [+7578 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "What Did The Solar System Look Like Before All The Planets Migrated? - Universe Today", "description": "Early planetary migration in the solar system has been long established, and there are myriad theories that have been put forward to explain where the planets were coming from. Theories such as the Grand Tack Hypothesis an the Nice Model show how important th…", "url": "https://www.universetoday.com/149849/what-did-the-solar-system-look-like-before-all-the-planets-migrated/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/01/4129.jpg", "publishedAt": "2021-01-27T16:23:49Z", "content": "Early planetary migration in the solar system has been long established, and there are myriad theories that have been put forward to explain where the planets were coming from. Theories such as the G… [+2580 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Spinosaurus Wasn't Aquatic Pursuit Predator, New Research Shows | Paleontology - Sci-News.com", "description": "The giant dinosaur Spinosaurus acted like modern herons or storks, taking fish and other aquatic prey from the edges of water or in shallow water, but also foraging for terrestrial prey and scavenging on occasion.", "url": "http://www.sci-news.com/paleontology/wandering-spinosaurus-09290.html", "urlToImage": "http://cdn.sci-news.com/images/2021/01/image_9290-Spinosaurus.jpg", "publishedAt": "2021-01-27T14:54:25Z", "content": "The giant dinosaur Spinosaurus acted like modern herons or storks, taking fish and other aquatic prey from the edges of water or in shallow water, but also foraging for terrestrial prey and scavengin… [+3407 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Varghese Mathai", "title": "Expert in fluid dynamics explains how to reduce the risk of COVID-19 airborne transmission inside a car - The Conversation US", "description": "Keeping windows open while driving at a moderate speed can increase airflow inside the cabin of the car, but which ones should you keep open?", "url": "https://theconversation.com/expert-in-fluid-dynamics-explains-how-to-reduce-the-risk-of-covid-19-airborne-transmission-inside-a-car-153972", "urlToImage": "https://images.theconversation.com/files/380587/original/file-20210125-15-18tvsyd.jpg?ixlib=rb-1.1.0&rect=0%2C989%2C8164%2C4082&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-01-27T13:26:00Z", "content": "Editors note: Varghese Mathai is a physicist at the University of Massachusetts Amherst who studies the flow of fluids and gases. He conducted a study using computational fluid dynamics simulations t… [+3218 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Space tourists paying $71 million each to be first all-private International Space Station crew - The New Daily", "description": "The first fully private, multi-person space station crew has been introduced: Three men who are each paying $US55 million to fly on a SpaceX rocket.", "url": "https://thenewdaily.com.au/news/2021/01/27/space-tourists-international-space-station-crew/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2021/01/1611738766-SpaceX-Dragon-capsule-NASA-960x600.jpg", "publishedAt": "2021-01-27T10:14:44Z", "content": "The first fully private, multi-person space station crew has been introduced: Three men who are each paying $US55 million ($71 million) to fly on a SpaceX rocket.\r\nThey will be led by a former NASA a… [+3931 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Mariella Moon", "title": "NASA's asteroid-sampling OSIRIS-REx probe will head back to Earth in May - Yahoo Finance Australia", "description": "The OSIRIS-REx spacecraft will soon bid asteroid Bennu farewell.  NASA has announced that OSIRIS-REx will start its journey back to our planet on May 10th...", "url": "https://au.finance.yahoo.com/news/nasa-osiris-rex-start-journey-back-to-earth-may-091847253.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-01/02ce4f00-6074-11eb-97f7-85fb03157388", "publishedAt": "2021-01-27T09:18:00Z", "content": "Dublin, Jan. 27, 2021 (GLOBE NEWSWIRE) -- The \"Automated Storage &amp; Retrieval System Market Research Report by Function (Assembly, Distribution, Kitting, Order Picking, and Storage), by Type (Auto… [+10314 chars]"}, {"source": {"id": null, "name": "Aawsat.com"}, "author": "", "title": "Tourism in Thailand Drops to Lowest Level in 12 Years - Asharq Al-awsat - English", "description": "Foreign tourist arrivals into Thailand plunged to the lowest level in at least 12 years due to the impact of the coronavirus pandemic on the travel and aviation industry across the globe.\nTourist arrivals slumped to 6.7 million in 2020 from 39.9 mill", "url": "https://english.aawsat.com/home/article/2767866/tourism-thailand-drops-lowest-level-12-years", "urlToImage": "https://english.aawsat.com/sites/default/files/styles/large/public/2021/01/27/chinese_tourists_visit_the_grand_palace_in_bangkok._reuters.jpg?itok=1skgvvx3", "publishedAt": "2021-01-27T07:00:25Z", "content": "Foreign tourist arrivals into Thailand plunged to the lowest level in at least 12 years due to the impact of the coronavirus pandemic on the travel and aviation industry across the globe.\r\nTourist ar… [+872 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Mira's last journey: Exploring the dark universe - Science Codex", "description": null, "url": "https://www.sciencecodex.com/miras-last-journey-exploring-dark-universe-665766", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/254703_web.jpg", "publishedAt": "2021-01-27T05:00:00Z", "content": "A massive simulation of the cosmos and a nod to the next generation of computing\r\nA team of physicists and computer scientists from the U.S. Department of Energy's (DOE) Argonne National Laboratory p… [+7835 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Carnivorous baby dinosaurs were born with teeth and 'ready to hunt', scientists find - ABC News", "description": "Scientists for the first time find embryonic remains of ferocious meat-eating dinosaurs similar to the Tyrannosaurus rex, which shows their babies were \"born ready\" to hunt.", "url": "https://www.abc.net.au/news/2021-01-27/scientists-finds-carnivorous-baby-dinosaurs-born-with-teeth/13095118", "urlToImage": "https://www.abc.net.au/cm/rimage/13095304-16x9-large.jpg?v=2", "publishedAt": "2021-01-27T03:31:00Z", "content": "Scientists for the first time have found embryonic remains from a group of ferocious meat-eating dinosaurs that includes the Tyrannosaurus rex.\r\n<ul><li>A roughly 77 million-year-old jawbone, about 3… [+2302 chars]"}, {"source": {"id": null, "name": "ABC17News.com"}, "author": "CNN Newsource", "title": "SpaceX, Amazon spat pits world's richest men against each other over space real estate - ABC17News.com", "description": "SpaceX and Amazon — companies run by the two richest men in the world — are sparring over their competing satellite-based internet businesses, with SpaceX accusing Amazon of “stifling competition” and Amazon accusing SpaceX of looking to “smother competition …", "url": "https://abc17news.com/money/2021/01/26/spacex-amazon-spat-pits-worlds-richest-men-against-each-other-over-space-real-estate/", "urlToImage": "https://abc17news.b-cdn.net/abc17news.com/2021/01/hypatia-h_8097f191870338dd7e0122e10d836ddb-h_c54e08ee82d5461f118aa95557c87585_preview.jpg", "publishedAt": "2021-01-26T23:19:56Z", "content": "SpaceX and Amazon companies run by the two richest men in the world are sparring over their competing satellite-based internet businesses, with SpaceX accusing Amazon of “stifling competition” and Am… [+5080 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Extreme black holes have hair that can be combed - Phys.org", "description": "Black holes are considered amongst the most mysterious objects in the universe. Part of their intrigue arises from the fact that they are actually among the simplest solutions to Einstein's field equations of general relativity. In fact, black holes can be fu…", "url": "https://phys.org/news/2021-01-extreme-black-holes-hair.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/extremeblack.jpg", "publishedAt": "2021-01-26T21:30:08Z", "content": "Black holes are considered amongst the most mysterious objects in the universe. Part of their intrigue arises from the fact that they are actually among the simplest solutions to Einstein's field equ… [+3628 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "The International Space Station Beautifully Captures Earth's Aurora - PetaPixel", "description": "The International Space Station's current Expedition 64 crew has recently shared a few gorgeous photos of Earth's auroras. The stunning natural colors are", "url": "https://petapixel.com/2021/01/26/the-international-space-station-beautifully-captures-earths-aurora/", "urlToImage": "https://petapixel.com/assets/uploads/2021/01/The-International-Space-Station-Beautifully-Captures-Earths-Aurora.jpg", "publishedAt": "2021-01-26T21:12:00Z", "content": "The International Space Station’s current Expedition 64 crew has recently shared a few gorgeous photos of Earth’s auroras. The stunning natural colors are thanks to the station’s orbit that takes it … [+2120 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Mihir Neal", "title": "Deep Space Network upgrades and new antennas increase vital communication capabilities - NASASpaceFlight.com - NASASpaceflight.com", "description": "NASA’s Deep Space Network, commonly referred to as the DSN, has welcomed a new dish,…", "url": "https://www.nasaspaceflight.com/2021/01/deep-space-network-upgrades/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/01/70meter_with_flags.png", "publishedAt": "2021-01-26T21:05:00Z", "content": "NASA’s Deep Space Network, commonly referred to as the DSN, has welcomed a new dish, Deep Space Station 56, to its family of powerful ground listening stations around the world.\r\nThe now-operational … [+6667 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Substance found in Antarctic ice may solve a martian mystery - Science Magazine", "description": "Mineral jarosite suggests glaciers helped forge Mars’s dusty soil", "url": "https://www.sciencemag.org/news/2021/01/substance-found-antarctic-ice-may-solve-martian-mystery", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/antarctica_1280p_1.jpg?itok=oFSRBkFt", "publishedAt": "2021-01-26T20:40:00Z", "content": "Sunlight shines on the snow-capped peaks of the Gerlache Strait in Antarctica.\r\nAndrew Peacock/iStock.com \r\nBy Tess JoosseJan. 26, 2021 , 3:40 PM\r\nResearchers have discovered a common martian mineral… [+3445 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Sweet View From Deep Space Shows Earth, Venus, and Mars in a Single Frame - Gizmodo Australia", "description": "Well, here’s something you don’t see every day. On November 18, 2020, the Solar Orbiter managed to capture three of our solar system’s eight planets in a single frame, according to a European Space Agency statement. The resulting four-second movie was stitche…", "url": "https://www.gizmodo.com.au/2021/01/sweet-view-from-deep-space-shows-earth-venus-and-mars-in-a-single-frame/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/01/27/er1oc7qikyqyh2up8b2t.gif?ar=16%3A9&fit=crop&q=80&w=1280&nrs=40&fm=jpg", "publishedAt": "2021-01-26T20:20:00Z", "content": "Well, heres something you dont see every day.\r\nOn November 18, 2020, the Solar Orbiter managed to capture three of our solar systems eight planets in a single frame, according to a European Space Age… [+1833 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "SpaceX launches 143 spacecraft, a record for a single launch - SatelliteProME.com", "description": "The rocket ferried 133 commercial and government spacecraft, as well as 10 Starlink satellites.", "url": "https://satelliteprome.com/news/spacex-launches-143-spacecraft-a-record-for-a-single-launch/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2021/01/spacex.jpg", "publishedAt": "2021-01-26T20:14:33Z", "content": "The rocket ferried 133 commercial and government spacecraft, as well as 10 Starlink satellites.\r\nSpaceX has launched a batch of 143 spacecraft into space under the companys new cost-cutting SmallSat … [+981 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Switzerland- CHEOPS telescope reveals new planets orbiting star - MENAFN.COM", "description": "A Swiss-designed telescope travelling on board the CHEOPS space satellite has revealed three previously undiscovered planets orbiting a distant star, whose physical composition raises questions about how planetary systems are formed.</p><br/><br/>This content…", "url": "https://menafn.com/1101496114/Switzerland-CHEOPS-telescope-reveals-new-planets-orbiting-star", "urlToImage": "https://menafn.com/updates/pr/2021-01/26/S_35848c9c-aimage_story.jpg", "publishedAt": "2021-01-26T19:35:33Z", "content": "(MENAFN - Swissinfo) A Swiss-designed telescope travelling on board the CHEOPS space satellite has revealed three previously undiscovered planets orbiting a distant star, whose physical composition r… [+1071 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Asteroid 2009 PQ1 approaching Earth in August poses no threat — scientist - TASS", "description": "However, if it gets into Earth’s gravity trap in 2029, it will have more chances to ram our planet in 2036", "url": "https://tass.com/science/1183391", "urlToImage": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200729/1276491.jpg", "publishedAt": "2020-07-28T21:58:24Z", "content": "MOSCOW, July 28. /TASS/. Asteroid 2009 PQ1, which will fly past Earth in August 2020, will pose no threat to our planet, Vice President of the Russian Academy of Sciences, astrophysicist Yuri Balega,… [+1166 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "Australian Prime Minister Shuts Down Bid to Make Outkast's \"Hey Ya!\" The National Anthem - Mental Floss", "description": "The government also rejected a more serious request to change the anthem's official lyrics to be more inclusive of indigenous peoples.", "url": "https://www.mentalfloss.com/article/501151/australian-prime-minister-shuts-down-bid-make-outkast’s-hey-ya-national-anthem", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_fill,g_auto,h_1248,w_2220/v1555183089/shape/mentalfloss/501151-gettyimages-2949509.jpg?itok=HMjY63LN", "publishedAt": "2019-11-06T10:03:51Z", "content": "Outkasts Hey Ya! is a popular dance anthem, but recently, a small group of Australian citizens wanted to make it a national anthem, as well. As HuffPost Australia reports, four people submitted a pet… [+2222 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 28 Jan 2021: Popocatépetl volcano, Merapi, Reventador, Sangay, Sabancaya\r\n 05:00 AM | BY: VN\r\nMerapi (Central Java, Indonesia): Volcanic Ash Advisory Center Darwin (VAAC) issued the … [+1575 chars]"}]}