{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The intricate dance between waves, wind, and gliding pelicans is worked out for the first time - Phys.org", "description": "It's a common sight: pelicans gliding along the waves, right by the shore. These birds make this kind of surfing look effortless, but actually the physics involved that give them a big boost are not simple.", "url": "https://phys.org/news/2021-04-intricate-gliding-pelicans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thewavebenea.jpg", "publishedAt": "2021-04-21T21:04:01Z", "content": "It's a common sight: pelicans gliding along the waves, right by the shore. These birds make this kind of surfing look effortless, but actually the physics involved that give them a big boost are not … [+3629 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Deep-sea volcanic eruptions create megaplumes that may have dispersed early life - MENAFN.COM", "description": "The ocean floor is famously unexplored and is imaged in much less detail than the surfaces of Mars, the Moon and Venus. Draining the water from the oceans would reveal a vast and mostly unknown volcanic landscape. In fact, the majority of Earth's volcanic act…", "url": "https://menafn.com/1101959159/Deep-sea-volcanic-eruptions-create-megaplumes-that-may-have-dispersed-early-life", "urlToImage": "https://menafn.com/updates/pr/2021-04/21/TC_b85a6008-2image_story.jpg", "publishedAt": "2021-04-21T18:25:01Z", "content": "(MENAFN - The Conversation) The ocean floor is famously unexplored and is imaged in much less detail than the surfaces of Mars, the Moon and Venus. Draining the water from the oceans would reveal a v… [+6966 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "SpaceX flight to ISS postponed by one day due to weather: NASA - Macau Business", "description": "International, MNA | A crewed SpaceX mission to the International Space Station has been postponed by a day due to concerns over the weather, NASA said Wednesday.", "url": "https://www.macaubusiness.com/spacex-flight-to-iss-postponed-by-one-day-due-to-weather-nasa/", "urlToImage": null, "publishedAt": "2021-04-21T18:16:54Z", "content": "A crewed SpaceX mission to the International Space Station has been postponed by a day due to concerns over the weather, NASA said Wednesday.\r\nThe flight had been scheduled for Thursday but because o… [+1478 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Bubble with titanium triggers titanic explosions - Phys.org", "description": "Scientists have found fragments of titanium blasting out of a famous supernova. This discovery, made with NASA's Chandra X-ray Observatory, could be a major step in pinpointing exactly how some giant stars explode.", "url": "https://phys.org/news/2021-04-titanium-triggers-titanic-explosions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-bubblewithti.jpg", "publishedAt": "2021-04-21T16:12:30Z", "content": "Scientists have found fragments of titanium blasting out of a famous supernova. This discovery, made with NASA's Chandra X-ray Observatory, could be a major step in pinpointing exactly how some giant… [+5312 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Incredible Fossil Skeleton Reveals an Ancient Human Relative Who Swung Through Trees - Gizmodo Australia", "description": "The fossilized shoulder joint of an early hominin named “Little Foot” suggests the upright-walking species was also proficient at swinging through trees, at a skill long gone among modern humans. Some 3.7 million years ago in what is now South Africa, a human…", "url": "https://www.gizmodo.com.au/2021/04/incredible-fossil-skeleton-reveals-an-ancient-human-relative-who-swung-through-trees/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/22/wkkfbdazcb5l3qfggyow-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-21T15:35:00Z", "content": "The fossilized shoulder joint of an early hominin named Little Foot suggests the upright-walking species was also proficient at swinging through trees, at a skill long gone among modern humans.\r\nSome… [+3575 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Gemma Conroy", "title": "Biodegradable plastic that can break down in your compost developed by scientists - ABC News", "description": "Biodegradable plastic bags, cutlery, and coffee cup lids may seem like a win for the environment, but they often introduce more problems than solutions. But now a research team from the US may be able to change that.", "url": "https://www.abc.net.au/news/science/2021-04-22/biodegradable-plastic-compost-enzymes-environment-soil-green/100082958", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/7c1708b5eb6b4f64231c5b0bc0fb1830?impolicy=wcms_crop_resize&cropH=1152&cropW=2048&xPos=0&yPos=110&width=862&height=485", "publishedAt": "2021-04-21T15:00:00Z", "content": "Biodegradable plastic bags, cutlery and coffee cup lids may seem like a win for the environment, but they often introduce more problems than solutions.\r\nKey points:\r\n<ul><li>Standard biodegradable pl… [+5926 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Discovery of Mass Death Site Bolsters Theory That Tyrannosaurs Hunted in Packs - Gizmodo Australia", "description": "A remarkable fossil site in Utah, in which several tyrannosaurs were found buried together, strengthens a burgeoning theory that these fearsome creatures hunted in packs, similar to wolves. That tyrannosaurs were social hunters is a possibility paleontologist…", "url": "https://www.gizmodo.com.au/2021/04/discovery-of-mass-death-site-bolsters-theory-that-tyrannosaurs-hunted-in-packs/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/21/hsii6rfvf5c5lrwryb7r.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-21T13:23:00Z", "content": "A remarkable fossil site in Utah, in which several tyrannosaurs were found buried together, strengthens a burgeoning theory that these fearsome creatures hunted in packs, similar to wolves.\r\nThat tyr… [+6658 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Outback radio telescope discovers dense, spinning, dead star - EurekAlert", "description": "Astronomers have discovered a pulsar--a dense and rapidly spinning neutron star sending radio waves into the cosmos--using a low-frequency radio telescope in outback Australia. The new pulsar is located more than 3,000 light-years from Earth and spins about o…", "url": "https://www.eurekalert.org/pub_releases/2021-04/icfr-ort042021.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/262624_web.jpg", "publishedAt": "2021-04-21T13:10:07Z", "content": "IMAGE: An artist's impression of Pulsar -- a dense and rapidly spinning neutron star sending radio waves into the cosmos.\r\n view more \r\nCredit: Credit: ICRAR / Curtin University.\r\nAstronomers have di… [+4682 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Astronomers find an exoplanet where an exoplanet shouldn’t be - SYFY WIRE", "description": "Over 4,000 exoplanets — alien planets orbiting other stars — have been found by astronomers so far. There are a variety of ways to find them, most of which use indirect methods, but one of the coolest is quite direct: Getting actual images of the planets near…", "url": "https://www.syfy.com/syfywire/astronomers-find-an-exoplanet-where-an-exoplanet-shouldnt-be", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/art_hot_young_gasgiant.jpg?offset-y=0", "publishedAt": "2021-04-21T13:00:00Z", "content": "Over 4,000 exoplanets alien planets orbiting other stars have been found by astronomers so far.\r\nThere are a variety of ways to find them, most of which use indirect methods, but one of the coolest i… [+5431 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New conductive polymer ink opens for next-generation printed electronics: A high-conductivity n-type polymeric ink for printed electronics - Science Daily", "description": "Researchers have developed a stable high-conductivity polymer ink. The advance paves the way for innovative printed electronics with high energy efficiency.", "url": "https://www.sciencedaily.com/releases/2021/04/210421082849.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-21T12:53:11Z", "content": "Researchers at Linköping University, Sweden, have developed a stable high-conductivity polymer ink. The advance paves the way for innovative printed electronics with high energy efficiency. The resul… [+2780 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Saumya Agrawal", "title": "Shocking! Shark drags fisherman overboard and capsizes his boat - WATCH - Times Now", "description": "A dramatic footage of the confrontation which has gone viral shows the shark keenly pursuing the bait with its teeth bared, while Graham fights for control of his fishing rod. Watch:", "url": "https://www.timesnownews.com/the-buzz/article/shocking-shark-drags-fisherman-overboard-and-capsizes-his-boat-watch/747885", "urlToImage": "https://imgk.timesnownews.com/story/Shark_drags_fisherman_overboard.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-04-21T12:41:14Z", "content": "A shark dragged a fisherman underwater and capsized his boat off the Irish coast using pure brute strength. Graham Smith was plunged into the water after his kayak overturned.\r\nHe battled a \"very cle… [+1751 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PR Newswire", "title": "When Gods Walk - Using Imaginary Time as a Tool to Traverse a Scientifically Created Universe: Astrophysicist and Robotics Expert, Rodney Bartlett, Publishes Academic Collection Exploring Science of the Distant Future - Yahoo Finance", "description": "Rodney Bartlett officially announced the release of his book \"Out of Time,\" a thematically linked collection of essays offering a nuanced exploration of the ...", "url": "https://finance.yahoo.com/news/gods-walk-using-imaginary-time-123800788.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/_NQ7vZ_6hlQvAkXl5qWeRA--~B/aD0xNjt3PTE2O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/prnewswire.com/d86be59dfb9212e7ea3183d25444917e", "publishedAt": "2021-04-21T12:38:00Z", "content": "Its that time again time to look for upwardly mobile stocks at relative bargain prices. Weve just seen a pullback in market prices, but for some stocks the pullback started earlier and has run deeper… [+7054 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Aylin Woodward", "title": "Watch 2 supermassive black holes dance around each other in a mesmerizing NASA animation - Business Insider Australia", "description": "Black holes are encircled by a glowing disk of hot gas. When one black hole approaches another, its strong gravity can bend the other's light.", "url": "https://www.businessinsider.com.au/nasa-animation-supermassive-black-holes-orbiting-2021-4", "urlToImage": "https://i.insider.com/608051e674da0300181e2fd2?format=jpeg", "publishedAt": "2021-04-21T11:55:00Z", "content": "At the heart of every galaxy lies a black hole, where gravity is so strong that nothing can escape its boundary. Sometimes when two galaxies merge, their black holes get caught in lock-step, perpetua… [+2808 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Dezell Turner", "title": "Hide and seek: How NASA's Lucy mission team discovered Eurybates' satellite - Phys.org", "description": "On Jan. 9, 2020, NASA's Lucy mission officially announced that it would be visiting not seven, but eight asteroids. As it turns out, Eurybates, one of the asteroids along Lucy's path, has a small satellite.", "url": "https://phys.org/news/2021-04-nasa-lucy-mission-team-eurybates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/hideandseekh.gif", "publishedAt": "2021-04-21T11:49:48Z", "content": "On Jan. 9, 2020, NASA's Lucy mission officially announced that it would be visiting not seven, but eight asteroids. As it turns out, Eurybates, one of the asteroids along Lucy's path, has a small sat… [+9309 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andrew Logan", "title": "Electrifying cement with nanocarbon black - Phys.org", "description": "Since its invention several millennia ago, concrete has become instrumental to the advancement of civilization, finding use in countless construction applications—from bridges to buildings. And yet, despite centuries of innovation, its function has remained p…", "url": "https://phys.org/news/2021-04-electrifying-cement-nanocarbon-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/electrifying.jpg", "publishedAt": "2021-04-21T11:48:48Z", "content": "Since its invention several millennia ago, concrete has become instrumental to the advancement of civilization, finding use in countless construction applicationsfrom bridges to buildings. And yet, d… [+8425 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "NASA reaches out to commercial partners for new spacesuits and spacewalk tech - Space.com", "description": "They could be used on the moon by Artemis astronauts.", "url": "https://www.space.com/nasa-rfi-spacewalk-artemis-spacesuits-commercial-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/65U88Di54wkuvAzGWW52WU-1200-80.jpg", "publishedAt": "2021-04-21T11:27:55Z", "content": "NASA is looking to commercial partners to help develop the next generation of spacesuits and spacewalk\r\n technology. \r\nIn a request for information (RFI) published April 14, NASA revealed that it is … [+3681 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Nathan James Enriquez, Nicolas Campione, Phil Bell", "title": "Fat-footed tyrannosaur parents couldn’t keep up with their skinnier offspring, fossil footprints reveal - The Conversation AU", "description": "So how accurate is the T. rex's running speed in that famous Jurassic Park jeep-chase scene?", "url": "https://theconversation.com/fat-footed-tyrannosaur-parents-couldnt-keep-up-with-their-skinnier-offspring-fossil-footprints-reveal-154188", "urlToImage": "https://images.theconversation.com/files/381455/original/file-20210130-18933-t5ob7.png?ixlib=rb-1.1.0&rect=54%2C222%2C1778%2C887&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-04-21T08:26:26Z", "content": "Tyrannosaurus rex is perhaps the most famous of all dinosaurs. It and its closest kin, a group referred to as tyrannosaurs, have been embedded in popular culture as powerful and mobile predators. \r\nC… [+5454 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Our Planet Is Travelling Through The Debris of Ancient Supernovae - ScienceAlert", "description": "Radioactive dust deep beneath the ocean waves suggests that Earth is moving through a massive cloud left behind by an exploded star.", "url": "https://www.sciencealert.com/our-planet-is-travelling-through-the-debris-of-ancient-supernovae", "urlToImage": "https://www.sciencealert.com/images/2020-08/processed/interstellar-cloud_1024.jpg", "publishedAt": "2021-04-21T07:25:01Z", "content": "Radioactive dust deep beneath the ocean waves suggests that Earth is moving through a massive cloud left behind by an exploded star.\r\nContinuously, for the last 33,000 years, space has been seeding E… [+3516 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Lyrids meteor shower in Australia: What is it? Can I see it? What time will it happen? - ABC News", "description": "Stargazers keen enough to stay up into the early hours could be rewarded with one of the word's oldest recorded meteor showers in the coming nights.", "url": "https://www.abc.net.au/news/2021-04-21/lyrids-meteor-shower-australia-how-to-watch/100084340", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/50c6aca41fcc17ab93c7604e0fc4914a?impolicy=wcms_crop_resize&cropH=1048&cropW=1871&xPos=32&yPos=10&width=862&height=485", "publishedAt": "2021-04-21T06:52:22Z", "content": "Stargazers keen enough to stay up into the early hours might be rewarded with meteor showers in the coming nights.\r\nAlthough most visible in the northern hemisphere, Australian observers are often lu… [+1639 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "Bangkok Post Public Company Limited", "title": "Science without gravity aboard the International Space Station - Bangkok Post", "description": "PARIS: In two decades orbiting the Earth the International Space Station has become a cutting-edge cosmic laboratory, with astronauts researching everything from black holes to disease and even gardening in microgravity.", "url": "https://www.bangkokpost.com/world/2103219/science-without-gravity-aboard-the-international-space-station", "urlToImage": "https://static.bangkokpost.com/media/content/20210421/c1_3953135_700.jpg", "publishedAt": "2021-04-21T06:45:00Z", "content": "PARIS: In two decades orbiting the Earth the International Space Station has become a cutting-edge cosmic laboratory, with astronauts researching everything from black holes to disease and even garde… [+5074 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "CNN", "title": "Tyrannosaurus rex walked surprisingly slowly, new study finds - 9News", "description": "<p>Tyrannosaurus rex was a fearsome predator, but it sure wasn&#x27;t a particularly fast mover. In fact, most humans could easily keep up with the dinosaur without breaking a sweat.</p>", "url": "https://www.9news.com.au/national/tyrannosaurus-rex-walked-surprisingly-slowly-new-study-finds-science-news/f6a641bd-255f-4671-b26e-52ef33aa2ad6", "urlToImage": "https://imageresizer.static9.net.au/e29T-GbTAcsg3swdDt3jRiR9zyE=/303x0:1404x619/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F62a488f5-d601-4ada-b43e-afdb18684f63", "publishedAt": "2021-04-21T06:44:24Z", "content": "Property News:  A stunning Gordon's Bay home with an epic ocean outlook - domain.com.au"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Paul Simons", "title": "Plantwatch: the trees that feed on metal - The Guardian", "description": "These plants can clean contaminated soils, could they also offer a greener way of collecting much-needed substances?", "url": "https://amp.theguardian.com/science/2021/apr/21/plantwatch-the-trees-that-feed-on-metal", "urlToImage": null, "publishedAt": "2021-04-21T05:00:00Z", "content": "A magnificent tall tree called Pycnandra acuminata grows on the island of New Caledonia in the South Pacific, and it does something strange when its bark is cut it bleeds a bright blue-green latex th… [+972 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Dinosaur species newly discovered in Chile's Atacama desert once roamed amid lush greenery - ABC News", "description": "Scientists in Chile's Atacama desert discover the remains of a previously unknown species of dinosaur, Arackar licanantay, thought to have lived amid flowering plants, ferns and palm trees.", "url": "https://www.abc.net.au/news/2021-04-21/scientists-chile-dinosaur-worlds-driest-desert/100083924", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/9377bb3c5ae9d7b88b62d0015a65fc3b?impolicy=wcms_crop_resize&cropH=744&cropW=1323&xPos=542&yPos=0&width=862&height=485", "publishedAt": "2021-04-21T01:54:04Z", "content": "Scientists in Chile's parched Atacama desert, the world's driest, have discovered the remains of a previously unknown species of dinosaur that, millions of years ago, lived among lush greenery there.… [+1768 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Full moon 2021: Space news, when you can spot a Harvest Moon, Hunter’s Moon, Blood Moon - 7NEWS.com.au", "description": "You’ll be able to view a full moon from Earth about once a month.", "url": "https://7news.com.au/technology/space/australias-full-moon-calendar-for-2021-c-2647183", "urlToImage": "https://images.7news.com.au/publication/C-2647183/a4fa6b419ac8bd1f71635fc8258d3937b13b91c0-16x9-x0y110w2121h1193.jpg?imwidth=1024", "publishedAt": "2021-04-20T23:24:00Z", "content": "Youll be able to view a full moon from Earth about once a month.\r\nAccording to TimeandDate.com a full moon is, ...when the Sun and the Moon are aligned on opposite sides of Earth, and 100% of the Moo… [+1858 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "NASA's Mars helicopter Ingenuity: What happens next, second flight, future missions - CNET", "description": "On Monday, NASA engineers pulled off a historic first: flying a machine on another planet. The feat could change space exploration forever.", "url": "https://www.cnet.com/news/nasas-mars-helicopter-ingenuity-what-happens-next-second-flight-future-missions/", "urlToImage": "https://www.cnet.com/a/img/cZtsPnxZasNRrNZ58Dx5dpB27fA=/1200x630/2021/04/19/a2dd04a0-ebfa-4d71-b9d5-11a606422d1d/3-pia24584-ingenuitys-first-black-and-white-heli-shot-from-the-air.jpg", "publishedAt": "2021-04-20T23:24:00Z", "content": "Ingenuity takes flight on Mars in this NASA animation.\r\nNASA/JPL-Caltech\r\nIngenuity did it! On April 19, the NASA chopper took to the skies over Mars, hovering briefly above the surface before return… [+10259 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Boeing pushes second Starliner test flight to late summer - Space.com", "description": "The wait for Starliner's space station arrival extends to summer.", "url": "https://www.space.com/boeing-starliner-oft-2-test-launch-delayed-summer-2021", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Fu2xUaHCnTdDmNSZiWCcdW-1200-80.jpg", "publishedAt": "2021-04-20T20:11:56Z", "content": "The second test flight for Boeing's Starliner crew capsule, known as the Orbital Flight Test-2 (OFT-2) mission, won't lift off until late this summer. After months of delays, NASA and Boeing have pus… [+3127 chars]"}, {"source": {"id": null, "name": "Inside Science News Service"}, "author": null, "title": "Scientists Invent Whitest White Paint - Inside Science News Service", "description": "(Inside Science) -- Typical commercial white paints reflect only 80% to 90% of sunlight and fail to help buildings stay cool during the day. For the past six years, mechanical engineer Xiulin Ruan at Purdue University in West Lafayette, Indiana, and his colle…", "url": "http://www.insidescience.org/news/scientists-invent-whitest-white-paint", "urlToImage": "http://www.insidescience.org/sites/default/files/2021-04/whitest-white_cropped.jpg", "publishedAt": "2021-04-20T18:08:00Z", "content": "(Inside Science) -- Typical commercial white paints reflect only 80% to 90% of sunlight and fail to help buildings stay cool during the day. For the past six years, mechanical engineer Xiulin Ruan at… [+3330 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA, SpaceX Crew-2 mission: How to watch Dragon launch to the ISS - CNET", "description": "A SpaceX Falcon 9 rocket is set to launch to the ISS on Friday with astronauts from the US, Europe and Japan.", "url": "https://www.cnet.com/news/nasa-and-spacex-crew-2-mission-how-to-watch-dragon-launch-to-the-iss-april-23/", "urlToImage": "https://www.cnet.com/a/img/6cXox2BdfjDsW0dFRYCoc4nqmxE=/1200x630/2021/04/08/b8ae20e0-3bb9-465c-ac9c-c35be682143f/crew2pic.jpg", "publishedAt": "2021-04-20T17:16:00Z", "content": "ESA's Thomas Pesquet, NASA's Megan McArthur and Shane Kimbrough, and JAXA's Akihiko Hoshide tried on their SpaceX flight suits.\r\nNASA\r\nNASA and SpaceX are gearing up for the second operational flight… [+2433 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "Extreme melt reduced Greenland ice sheet storage: study | - Macau Business", "description": "International, MNA | The vast melting of Greenland's ice sheet caused by unusually high temperatures in 2012 had a lasting impact on its ability to absorb and store future", "url": "https://www.macaubusiness.com/extreme-melt-reduced-greenland-ice-sheet-storage-study/", "urlToImage": null, "publishedAt": "2021-04-20T17:10:10Z", "content": "The vast melting of Greenland’s ice sheet caused by unusually high temperatures in 2012 had a lasting impact on its ability to absorb and store future meltwater, new research showed Tuesday.\r\nAuthors… [+2749 chars]"}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "So a helicopter flew on Mars for the first time. A space physicist explains why that’s such a big deal - Australian Times", "description": "Yesterday at 9pm Australian Eastern standard time, the Ingenuity helicopter — which landed on Mars with the Perseverance rover in February — took off from the Martian surface. More importantly, it hovered for about 30 seconds, three metres above the surface a…", "url": "https://www.australiantimes.co.uk/news/so-a-helicopter-flew-on-mars-for-the-first-time-a-space-physicist-explains-why-thats-such-a-big-deal/", "urlToImage": "https://www.australiantimes.co.uk/wp-content/uploads/2021/04/Mars-helicopter.jpg", "publishedAt": "2021-04-20T17:05:00Z", "content": "Gail Iles, RMIT University\r\nYesterday at 9pm Australian Eastern standard time, the Ingenuity helicopter which landed on Mars with the Perseverance rover in February took off from the Martian surface.… [+5306 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "New plan to deal with deadly space debris which could destroy satellites - Yahoo New Zealand News", "description": "Since 1957, thousands of space launches have left Earth surrounded by orbiting space debris, with up to 26,000 objects now tracked.", "url": "https://nz.news.yahoo.com/space-debris-plan-162250435.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.HNQABPAP8kgjA4cEjmZog--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD02Njc-/https://s.yimg.com/os/creatr-uploaded-images/2021-04/df8089c0-a1f3-11eb-beb5-26d632139006", "publishedAt": "2021-04-20T16:30:28Z", "content": "Thousands of pieces of debris orbit our Earth (Getty) \r\nSince 1957, thousands of space launches have left Earth surrounded by orbiting space debris, with up to 26,000 objects now tracked.\r\nThere are … [+3852 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MagicDNA: Tiny, Complex DNA Robots Designed in Minutes Instead of Days - SciTechDaily", "description": "New software will allow creation of more complex devices. Someday, scientists believe, tiny DNA-based robots and other nanodevices will deliver medicine inside our bodies, detect the presence of deadly pathogens, and help manufacture increasingly smaller elec…", "url": "https://scitechdaily.com/magicdna-tiny-complex-dna-robots-designed-in-minutes-instead-of-days/", "urlToImage": "https://scitechdaily.com/images/DNA-Airplane.jpg", "publishedAt": "2021-04-20T16:24:50Z", "content": "This “airplane,” made of strands of DNA, is 1000 times smaller than the width of a human hair. Credit: Ohio State University\r\nNew software will allow creation of more complex devices.\r\nSomeday, scien… [+5342 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Thomas Burghardt", "title": "After NASA taps SpaceX's Starship for first Artemis landings, agency looks to on-ramp future vehicles - NASASpaceFlight.com - NASASpaceflight.com", "description": "Following a year of testing and development, NASA recently selected SpaceX’s Starship-based Human Landing System…", "url": "https://www.nasaspaceflight.com/2021/04/nasa-starship-first-landings-on-ramp/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/04/LeadImage.jpg", "publishedAt": "2021-04-20T16:07:45Z", "content": "Following a year of testing and development, NASA recently selected SpaceX’s Starship-based Human Landing System (HLS) to land astronauts on the moon under the Artemis program. SpaceX’s proposal was … [+12575 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Nuclear fallout is showing up in U.S. honey, decades after bomb tests - Science Magazine", "description": "Levels of radioactive cesium aren’t concerning, but study shows how they persist in food products", "url": "https://www.sciencemag.org/news/2021/04/nuclear-fallout-showing-us-honey-decades-after-bomb-tests", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/honey_1280p.jpg?itok=hDcYRI3U", "publishedAt": "2021-04-20T15:15:00Z", "content": "Flowering plants can transfer radiocesium from soils to honey bees, who can then concentrate the contaminant in honey.\r\nArx0nt/iStock \r\nBy Nikk OgasaApr. 20, 2021 , 11:15 AM\r\nFallout from nuclear bom… [+4227 chars]"}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": null, "title": "JCU Associate Professor Eric Roberts part of tyrannosaur study finds new evidence of social behaviours - The Mercury", "description": "Subscribe to The Mercury to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.themercury.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-04-20T14:02:17Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Little Foot fossil shows early human ancestor clung closely to trees - Science Daily", "description": "The fossil provides the oldest, most intact example of the shoulder of a human ancestor ever found. The bones provide telltale clues of how the individual moved and was adapted to climbing, a research team reports.", "url": "https://www.sciencedaily.com/releases/2021/04/210420092921.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-20T13:42:09Z", "content": "A long-awaited, high-tech analysis of the upper body of famed fossil \"Little Foot\" opens a window to a pivotal period when human ancestors diverged from apes, new USC research shows.Little Foot's sho… [+4928 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "British scientists are calling on the public to help find the 15 'Moon Trees' - Daily Mail", "description": "The Moon Trees, grown from orbiting seeds flown in 1971, could be anywhere in the UK, including in  private gardens, according to the Royal Astronomical Society.", "url": "https://www.dailymail.co.uk/sciencetech/article-9490509/British-scientists-calling-public-help-15-Moon-Trees.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/20/13/41988590-0-image-a-44_1618923041893.jpg", "publishedAt": "2021-04-20T12:51:35Z", "content": "There could be 15 trees throughout the UK grown from seeds that were flown around the moon by NASA on the Apollo 14 mission, and scientists are trying to find them.\r\nThe Moon Trees, grown from orbiti… [+8560 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "BBC", "title": "New species of dinosaur unearthed in Chile's Atacama desert - Yahoo News Australia", "description": "Scientists found remains of the sauropod in rocks from what is today the Atacama desert.", "url": "https://news.yahoo.com/species-dinosaur-unearthed-chiles-atacama-112239181.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ujMe63td952XSHuUDm5YaQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMTI1/https://s.yimg.com/uu/api/res/1.2/a.VtFeIK948ie4IIcP.I3A--~B/aD0xMTUyO3c9MjA0ODthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bbc_us_articles_995/00f28d0846f970b2e0a6ea0d56a92ece", "publishedAt": "2021-04-20T12:41:39Z", "content": "An artist's impression of the dinosaur whose remains scientists discovered in Chile\r\nScientists have identified a new species of dinosaur from parts of a skeleton found in northern Chile.\r\nThe creatu… [+1575 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "420 Blaze It (The Planet) - Gizmodo Australia", "description": "We finally did it — we’ve hit 420! Parts per million, that is. Not to harsh your mellow, but there’s more carbon dioxide in the atmosphere now than in any other point in recorded history. Earlier this month, scientists at Mauna Loa Observatory in Hawaii took …", "url": "https://www.gizmodo.com.au/2021/04/420-blaze-it-the-planet/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/21/ktnigkzxdt3fcnwwekdf-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-20T01:59:00Z", "content": "We finally did it weve hit 420!\r\nParts per million, that is. Not to harsh your mellow, but theres more carbon dioxide in the atmosphere now than in any other point in recorded history.\r\nEarlier this … [+3840 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  ALEX WINSTON", "title": "Red Sea coral reefs at risk of bleaching if temperature drops - study - The Jerusalem Post", "description": "Research showed just how close their lower threshold Israel's southern coral reefs live.", "url": "https://www.jpost.com/health-science/red-sea-coral-reefs-at-risk-of-bleaching-if-temperature-drops-study-665648", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/475000", "publishedAt": "2021-04-19T17:21:00Z", "content": null}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Planets Jupiter and Saturn Form Visible \"Double Planet\" - UPI.com", "description": "Planets Jupiter and Saturn are situated close together in the night sky in New York City on Monday, December 21, 2020. Jupiter and Saturn are so close today that they will appear to form a \"double planet. \"The Spectacular Great Conjunction\",as this planetary …", "url": "https://www.upi.com/News_Photos/view/upi/9330c71a7ef3fc65a34100fcf38f8e53/Planets-Jupiter-and-Saturn-Form-Visible-Double-Planet/", "urlToImage": "https://cdnph.upi.com/pv/upi/9330c71a7ef3fc65a34100fcf38f8e53/JUPITER-SATURN-DOUBLE-PLANET.jpg", "publishedAt": "2020-12-21T23:16:12Z", "content": "Planets Jupiter and Saturn are situated close together in the night sky in New York City on Monday, December 21, 2020. Jupiter and Saturn are so close today that they will appear to form a \"double pl… [+156 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Supermoons, Pink moon, and next full moon for 2021 - 7NEWS.com.au", "description": "Full moons always make for dramatic skywatching, but so-called “supermoons” are even more special because they appear a bit bigger and brighter than a typical full moon.", "url": "https://7news.com.au/technology/space/supermoon-and-full-moon-for-2021-c-1778764", "urlToImage": "https://images.7news.com.au/publication/C-1778764/33f8239d89e837019d80594d739b0a2b512ea7fa-16x9-x0y99w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T23:21:50Z", "content": "Full moons always make for dramatic skywatching, but so-called supermoons are even more special because they appear a bit bigger and brighter than a typical full moon.\r\nIts a full moon that coincides… [+2827 chars]"}, {"source": {"id": null, "name": "Upworthy"}, "author": "Annie  Reneau", "title": "Scientists just created an enzyme that rapidly breaks down plastic pollution - Upworthy", "description": "This is huge.", "url": "https://www.upworthy.com/plastic-eating-super-enzyme-works-six-times-faster", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDQ0NzkyMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2MzEzNTczNn0.sIN3tm4ffHckcqWhtIWZ9gLdtpjijBwr8SOGULnUec0/img.jpg?width=1200&coordinates=0%2C15%2C0%2C15&height=600", "publishedAt": "2020-09-30T06:14:28Z", "content": "In March of 2020, the world shut down because the COVID-19 pandemic was raging across the country and the world. Once again, people didn't know much about the virus and they didn't really know how to… [+9644 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Perseverance - Hackaday", "description": null, "url": "https://hackaday.com/tag/perseverance/", "urlToImage": "https://hackaday.com/wp-content/uploads/2020/07/hackaday-logo-with-text-opengraph-default-image.jpg", "publishedAt": "2020-07-30T14:26:37Z", "content": "More bad news from Mars this week, and this time not just from Perseverance. Last week the eagerly anticipated first flight of the helicopter Ingenuity was delayed for a couple of days after failing … [+3713 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Rare 'ring of fire' solar eclipse to dim Africa, Asia - Arab News", "description": "PARIS: Skywatchers along a narrow band from west Africa to the Arabian Peninsula, India and southern China will witness on Sunday the most dramatic “ring of fire” solar eclipse to shadow the Earth in years. Annular eclipses occur when the Moon — passing betwe…", "url": "https://www.arabnews.com/node/1692611", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/06/20/2154941-2039166004.jpg", "publishedAt": "2020-06-20T07:00:10Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "SpaceX's astronaut-riding Dragon arrives at space station - Arabnews", "description": "CAPE CANAVERAL: SpaceX delivered two astronauts to the International Space Station for NASA on Sunday, following up a historic liftoff with an equally smooth docking in yet another first for Elon Musk’s company. With test pilots Doug Hurley and Bob Behnken po…", "url": "https://www.arabnews.com/node/1682691", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/05/31/2127741-998717714.jpg", "publishedAt": "2020-05-31T14:37:42Z", "content": "LONDON: A Syrian refugee schoolboy in the UK faced death threats and was forced to flee his home with his family due to social media posts from a far-right extremist, a British court heard on Wednesd… [+2126 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "Total lunar eclipse comes with supermoon bonus - Arab News", "description": "CAPE CANAVERAL, Florida: The only total lunar eclipse this year and next came with a supermoon bonus. On Sunday night, the moon, Earth and sun lined up to create the eclipse, which was visible throughout North and South America, where skies were clear. There …", "url": "https://www.arabnews.com/node/1439041", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2019/01/21/1436206-1304718084.jpg", "publishedAt": "2019-08-29T14:52:52Z", "content": "TOKYO: To celebrate the opening of Arab-Japan Day, an online event was held on April 21 attended by many notable figures including Prime Minister Suga Yoshihide who delivered a speech.\r\nThe celebrati… [+3458 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "REUTERS", "title": "Stephen Hawking to join Newton, Darwin in final resting place - Arab News", "description": "LONDON: British physicist Stephen Hawking is to take his place among some of the greatest scientists in history when his ashes are interred inside Westminster Abbey, close to the graves of Isaac Newton and Charles Darwin. Hawking, the world’s most recognizabl…", "url": "https://www.arabnews.com/node/1270266", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/03/20/1134196-2004637151.jpg", "publishedAt": "2019-08-27T21:27:00Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Mariette le Roux and Laurence Coustal | AFP", "title": "Plane-sized 'void' discovered in Great Pyramid: scientists - Arab News", "description": "PARIS: A passenger plane-sized “void” has been discovered in the middle of the Great Pyramid of Egypt, where it has lain secret and untouched for 4,500 years, scientists revealed on Thursday. The space is one of four cavities, along with the king and queen’s …", "url": "https://www.arabnews.com/node/1187191", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/11/02/1025816-705365387.jpg", "publishedAt": "2019-08-26T19:16:53Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "DNA shows first modern Briton had dark skin, blue eyes - Arab News", "description": "LONDON: The first modern Briton had dark skin and blue eyes, London scientists said on Wednesday, following groundbreaking DNA analysis of the remains of a man who lived 10,000 years ago.Known as “Cheddar Man” after the area in southwest England where his ske…", "url": "https://www.arabnews.com/node/1241106", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/02/07/1094041-1335845856.jpg", "publishedAt": "2019-08-26T16:29:06Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "MARCIA DUNN | AP", "title": "SpaceX launches its first recycled rocket in historic leap - Arab News", "description": "CAPE CANAVERAL, Florida: SpaceX successfully launched and then retrieved its first recycled rocket Thursday, the biggest leap yet in its bid to drive down costs and speed up flights.The Falcon 9 blasted off from Florida’s Kennedy Space Center, hoisting a broa…", "url": "https://www.arabnews.com/node/1076931", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/03/31/883181-1719927649.jpg", "publishedAt": "2019-08-26T09:42:14Z", "content": "LONDON: A British-Pakistani Muslim family has been served pork burgers in the enforced hotel quarantine for arrivals in the UK, as government ministers face legal challenges over the conditions and s… [+2479 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Ivan Couronne | AFP", "title": "Amazon's Bezos unveils lunar lander project 'Blue Moon' - Arab News", "description": "WASHINGTON: Jeff Bezos, the richest man in the world and head of space company Blue Origin, announced Thursday his intent to participate in the new race to the Moon with a high-tech lander to carry vehicles and equipment. “This is Blue Moon,” the 55-year-old …", "url": "https://www.arabnews.com/node/1495001", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/05/10/1575931-905414438.jpg", "publishedAt": "2019-05-10T02:01:08Z", "content": "DUBAI: A Dubai-based edutech start-up has launched a digital library for researchers in Saudi Arabia the first subscription-based library for scholarly literature of its kind in the Middle East and N… [+6515 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "Scientists Think They Know What Causes Trypophobia - Mental Floss", "description": "Warning: We cropped most of the holes from the honeycomb image, but the story contains a photo of a dried lotus seed pod.", "url": "https://www.mentalfloss.com/article/503056/scientists-think-they-know-what-causes-trypophobia", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_838,w_1490,x_5,y_0/v1555004967/shape/mentalfloss/trypophobia-iStock-467331275.jpg?itok=lrUSiGHH", "publishedAt": "2019-04-22T00:48:46Z", "content": "Picture a boat hull covered with barnacles, a dried lotus seed pod, milk bubbles on a latte, or a honeycomb. Images of these objects are harmlessunless you're one of the millions of people suffering … [+2347 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Watch: Giant mystery sea creature washes up on Indonesian beach - Arab News", "description": "DUBAI: A 15-meter unidentified sea creature washed up on a remote beach in Indonesia this week, causing a stir among locals who flocked to the scene. The creature was found on Tuesday night on the northern shoreline of Seram Island in the province of Maluku, …", "url": "https://www.arabnews.com/node/1098451", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/05/12/910201-1728948142.jpg", "publishedAt": "2018-08-28T07:51:57Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "KERRY SHERIDAN | AFP", "title": "Rare 'super blood blue moon' visible on Jan 31 - Arab News", "description": "MIAMI: A cosmic event not seen in 36 years — a rare “super blood blue moon” — may be glimpsed January 31 in parts of western North America, Asia, the Middle East, Russia and Australia. The event is causing a buzz because it combines three unusual lunar events…", "url": "https://www.arabnews.com/node/1234506", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/01/28/1086121-1466084572.jpg", "publishedAt": "2018-08-27T15:49:34Z", "content": "SANAA: At the thought of breaking his Ramadan fast with a snack of sambusa, a deep-fried savoury pastry triangle popular in Yemen, Issa Al-Shabis face lights up with joy.\r\nOn a street in the capital … [+2052 chars]"}, {"source": {"id": null, "name": "TheWrap"}, "author": "Tim Kenneally", "title": "Stephen Hawking Honored by Strip-Club Owner With Botched Tribute (Photo) - TheWrap", "description": "Stringfellows proprietor pays tribute to Stephen Hawking by sharing his favorite photo with \"Professor Steve Harking\"", "url": "http://www.thewrap.com/stephen-hawking-honored-by-strip-club-owner-with-botched-tribute-photo/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2018/03/GettyImages-73570451.jpg", "publishedAt": "2018-03-15T03:43:38Z", "content": "Stephen Hawking is gone, but he’s not forgotten. And neither is that Steve Harking fellow.\r\nPeter Stringfellow, owner of London strip club Stringfellows, sought to pay tribute to Hawking, who died We… [+3248 chars]"}, {"source": {"id": null, "name": "TheWrap"}, "author": "Tony Maglio, Jennifer Maas", "title": "‘Big Bang Theory’ Cast Remembers Stephen Hawking - TheWrap", "description": "Like so many lives touched by Stephen Hawking's brilliance, the cast of \"The Big Bang Theory\" is spending Wednesday morning in mourning.", "url": "http://www.thewrap.com/big-bang-theory-cast-remembers-stephen-hawking/", "urlToImage": "https://www.thewrap.com/wp-content/uploads/2018/03/Stephen-Hawking-Big-Bang-Theory-Cast.png", "publishedAt": "2018-03-14T16:05:28Z", "content": "Like so many lives touched by Stephen Hawking’s brilliance, the cast of “The Big Bang Theory” is spending Wednesday morning in mourning.\r\nStars Mayim Bialik, Kaley Cuoco, Jim Parsons and Johnny Galec… [+2999 chars]"}]}