{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "Researchers Reveal How They Confirmed The Booster Hitting The Moon Wasn't From SpaceX - SlashGear", "description": "Researchers revealed how they were able to identify a piece of space junk from hundreds of thousands of miles away - before it hit the moon.", "url": "https://www.slashgear.com/772091/researchers-reveal-how-they-confirmed-the-booster-hitting-the-moon-wasnt-from-spacex/", "urlToImage": "https://www.slashgear.com/img/gallery/how-researchers-confirmed-the-booster-hitting-the-moon-wasnt-from-spacex/l-intro-1645129758.jpg", "publishedAt": "2022-02-17T20:30:00Z", "content": "In the next few weeks, the moon is getting a surprise visitor a manmade object which will impact the moon's surface on March 4, 2022. Originally, people had thought that the offending object was part… [+1253 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "CNN", "title": "Groundbreaking discovery in Queensland shows odd pairing of crocodile and dinosaur - 7NEWS", "description": "A new species of crocodile dating back millennia has been discovered in Queensland - and scientists got a surprise when they opened its stomach.", "url": "https://7news.com.au/news/crocodile/groundbreaking-discovery-in-queensland-shows-odd-pairing-of-crocodile-and-dinosaur-c-5737649", "urlToImage": "https://images.7news.com.au/publication/C-5737649/03687212071e4f49099e1d28e1fa3e07f99ca9d2-16x9-x0y0w5592h3145.jpg?imwidth=1200", "publishedAt": "2022-02-17T20:18:00Z", "content": "A new species of crocodile dating back to the Cretaceous period has been discovered in Queensland and its last meal was a young dinosaur, scientists say.\r\nThe fossilised bones of a Confractosuchus sa… [+2534 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Sediment cores from ocean floor could contain 23-million-year-old climate change clues — ScienceDaily - Verve Times", "description": "Sediment cores taken from the Southern Ocean dating back 23 million years are providing insight into how ancient methane escaping from the seafloor could have led to regional or global climate and environmental changes, according to a study from two", "url": "https://vervetimes.com/sediment-cores-from-ocean-floor-could-contain-23-million-year-old-climate-change-clues-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-17T19:48:36Z", "content": "Sediment cores taken from the Southern Ocean dating back 23 million years are providing insight into how ancient methane escaping from the seafloor could have led to regional or global climate and en… [+2541 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Developing Time Crystals for Use in Real-World Applications - SciTechDaily", "description": "Time crystals that persist indefinitely at room temperature could have applications in precision timekeeping. We have all seen crystals, whether a simple grain of salt or sugar, or an elaborate and beautiful amethyst. These crystals are made of atoms or molec…", "url": "https://scitechdaily.com/developing-time-crystals-for-use-in-real-world-applications/", "urlToImage": "https://scitechdaily.com/images/Abstract-Time-Crystal-Concept.gif", "publishedAt": "2022-02-17T18:39:12Z", "content": "Time crystals that persist indefinitely at room temperature could have applications in precision timekeeping.\r\nWe have all seen crystals, whether a simple grain of salt or sugar, or an elaborate and … [+3850 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Elephant sharks offer a novel perspective on how humans evolved — ScienceDaily - Verve Times", "description": "Researchers at University of California San Diego School of Medicine and in Japan have used an ancient fish to reel in new insights about human biology and, in particular, how and why a widely used medication works to abort pregnancies (in people, no", "url": "https://vervetimes.com/elephant-sharks-offer-a-novel-perspective-on-how-humans-evolved-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-17T18:27:03Z", "content": "Researchers at University of California San Diego School of Medicine and in Japan have used an ancient fish to reel in new insights about human biology and, in particular, how and why a widely used m… [+2580 chars]"}, {"source": {"id": null, "name": "Aviation Week"}, "author": null, "title": "Russian Progress MS-19 Delivers Space Station Cargo - Aviation Week", "description": "Russia’s MS-19 Progress resupply capsule successfully docked with the seven-person International Space Station early Feb. 17, completing the delivery of a nearly 3-ton cargo, including food, water, propellant and other supplies and research equipment.", "url": "https://aviationweek.com/defense-space/space/russian-progress-ms-19-delivers-space-station-cargo", "urlToImage": "https://aviationweek.com/sites/default/files/2022-02/russiaspace.jpg", "publishedAt": "2022-02-17T18:03:53Z", "content": "Russian Progress MS-19 Delivers Space Station Cargo is published in Aerospace Daily &amp; Defense Report, an Aviation Week Intelligence Network (AWIN) Market Briefing and is included with your AWIN m… [+314 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Combating leukemia cells by disrupting their energy maintenance mechanism - News-Medical.net", "description": "Acute myeloid leukemia, which affects blood and bone marrow cells, is a particularly dangerous form of cancer. More than half of patients under the age of 60 die.", "url": "https://www.news-medical.net/news/20220217/Combating-leukemia-cells-by-disrupting-their-energy-maintenance-mechanism.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/shutterstock_499282837_f18bafe030744de991560feceed98d20-620x480.jpg", "publishedAt": "2022-02-17T17:22:00Z", "content": "Acute myeloid leukemia, which affects blood and bone marrow cells, is a particularly dangerous form of cancer. More than half of patients under the age of 60 die. This proportion rises to 85% for pat… [+4481 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Tonga volcano's massive plume has reached the average ocean - 38 miles into the atmosphere - Balkan Travellers", "description": "The plume coming from Hunga Tonga-Hunga Ha'apai acted like a massive thunderstorm that soared 58 kilometers (38 miles) into the atmosphere. When an", "url": "https://www.balkantravellers.com/tonga-volcanos-massive-plume-has-reached-the-average-ocean-38-miles-into-the-atmosphere/", "urlToImage": "https://www.balkantravellers.com/wp-content/uploads/2022/02/Tonga-volcanos-massive-plume-has-reached-the-average-ocean.gif", "publishedAt": "2022-02-17T17:21:45Z", "content": "The plume coming from Hunga Tonga-Hunga Ha’apai acted like a massive thunderstorm that soared 58 kilometers (38 miles) into the atmosphere.\r\nWhen an underwater volcano erupts near a small uninhabited… [+5696 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Scientists are one step closer to turning CO2 into fuel using sunlight - Interesting Engineering", "description": "Though some experts warn carbon capture technologies are a \"dangerous distraction\".", "url": "https://interestingengineering.com/scientists-convert-co2-fuel", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/94w5WxKjGo/sizes/carbonheader_md.png", "publishedAt": "2022-02-17T16:59:49Z", "content": "Sunlight already provides us with a great deal of energy via renewable energy, but it might soon also be harnessed to create fuel out of carbon dioxide.\r\nThat's because an international team of resea… [+2326 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The surprising structural reason your kitchen sponge is disgusting - Phys.org", "description": "Researchers at Duke University have uncovered a basic but surprising fact: your kitchen sponge is a better incubator for diverse bacterial communities than a laboratory Petri dish. But it's not just the trapped leftovers that make the cornucopia of microbes s…", "url": "https://phys.org/news/2022-02-kitchen-sponge-disgusting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-surprising-structu.jpg", "publishedAt": "2022-02-17T16:07:25Z", "content": "Researchers at Duke University have uncovered a basic but surprising fact: your kitchen sponge is a better incubator for diverse bacterial communities than a laboratory Petri dish. But it's not just … [+4564 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX's Elon Musk shares simulation video 'Starship to Mars' depicting his plans for the red planet - WION", "description": "SpaceX CEO billionaire Elon Musk shared a simulation video of SpaceX's Mars program. Musk is known to have desires for humans to travel to the red planet.#Sp...", "url": "https://www.youtube.com/watch?v=hO-Y8ZYrjeA", "urlToImage": "https://i.ytimg.com/vi/hO-Y8ZYrjeA/hqdefault.jpg", "publishedAt": "2022-02-17T15:25:41Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "Quantum Computing And Holograms Might Tell Us What's Inside A Black Hole - IFLScience", "description": "Black holes are objects at the limit of our understanding of physics. We can’t see what goes on inside them, beyond the event horizon, because their enormo", "url": "https://www.iflscience.com/physics/quantum-computing-and-holograms-might-tell-us-whats-inside-a-black-hole/", "urlToImage": "https://cdn.iflscience.com/images/a4761a8c-e2ba-5ba9-a3f2-3619d8f8db70/default-1645111225-image-credit-enrico-rinaldi-u-m-riken-and-a-silvestri.jpg", "publishedAt": "2022-02-17T15:23:00Z", "content": "Black holes are objects at the limit of our understanding of physics. We cant see what goes on inside them, beyond the event horizon, because their enormous gravity doesn't let anything, including li… [+3534 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Biohybrid Robotic Fish Paves the Way for Artificial Human Heart - AZoRobotics", "description": "Researchers in the United States have designed the world’s first fully autonomous biohybrid device using human stem-cell-derived cardiac muscle cells.", "url": "https://www.azorobotics.com/News.aspx?newsID=12755", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ImageForNews_12755_16451102851179133.jpg", "publishedAt": "2022-02-17T15:06:00Z", "content": "Researchers in the United States have designed the world’s first fully autonomous biohybrid device using human stem-cell-derived cardiac muscle cells. The biohybrid fish swims by mimicking the muscul… [+5253 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Patrick Greenfield", "title": "Fish love songs and fighting talk: underwater sound library to reveal language of the deep - The Guardian", "description": "Scientists plan a vast global store of aquatic noises to help monitor marine life, identify species – and even uncover regional dialects", "url": "https://amp.theguardian.com/environment/2022/feb/17/underwater-sound-library-to-reveal-language-of-the-deep-aoe", "urlToImage": null, "publishedAt": "2022-02-17T15:00:00Z", "content": "The age of extinctionScientists plan a vast global store of aquatic noises to help monitor marine life, identify species and even uncover regional dialects\r\nFrom the boing of a minke whale to the dru… [+3696 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How picking up your smartphone could reveal your identity - Science Daily", "description": "The time a person spends on different smartphone apps is enough to identify them from a larger group in more than one in three cases say researchers, who warn of the implications for security and privacy. They fed 4,680 days of app usage data into statistical…", "url": "https://www.sciencedaily.com/releases/2022/02/220217090711.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-17T14:45:42Z", "content": "The time a person spends on different smartphone apps is enough to identify them from a larger group in more than one in three cases say researchers, who warn of the implications for security and pri… [+2525 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Inorganic materials make ultra-thin solar cells more efficient - MINING.COM - MINING.com", "description": "A new approach used to develop solar cells based on AgBiS2 enables absorption coefficients higher than any other photovoltaic material used to date.", "url": "https://www.mining.com/inorganic-materials-make-ultra-thin-solar-cells-more-efficient/", "urlToImage": "https://www.mining.com/wp-content/uploads/2022/02/Inorganic-materials-make-ultra-thin-solar-cells-more-efficient_1.jpeg", "publishedAt": "2022-02-17T14:08:00Z", "content": "But even though they were a promising green alternative to silicon, these cells were still not capable of achieving compelling performance relevant for commercialization.\r\nScientists, thus, delved in… [+4035 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Unusually cold 'Blue Blob' is slowing the rapid melting of Iceland's glaciers, but not for long - Livescience.com", "description": "The mysterious patch of the North Atlantic Ocean is fighting back the effects of climate change.", "url": "https://www.livescience.com/blue-blob-slows-melting-of-iceland-glaciers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iGE5tdciaTrkbdw3ChKTbH-1200-80.jpeg", "publishedAt": "2022-02-17T14:07:54Z", "content": "A recent slowdown in the melting of Iceland’s glaciers is likely caused by a patch of unusually cold water in the North Atlantic Ocean, known as the \"Blue Blob,\" \"according to a new study. (Image cre… [+5011 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Steinar Brandslet", "title": "Hunting or other wildlife regulations can make a population more viable, if done correctly - Phys.org", "description": "This may sound counterintuitive, but reducing the number of animals in a population can help the remaining individuals to survive through the winter.", "url": "https://phys.org/news/2022-02-wildlife-population-viable-correctly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/reindeer.jpg", "publishedAt": "2022-02-17T14:06:54Z", "content": "This may sound counterintuitive, but reducing the number of animals in a population can help the remaining individuals to survive through the winter.\r\n\"Harvesting or other means of regulating an anim… [+4422 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Direct Energetic Ion Acceleration by Irradiating Graphene Target with Ultra-Intense Laser - AZoOptics", "description": "Laser-driven ion acceleration has been studied to develop a compact and efficient plasma-based accelerator, which is applicable to cancer therapy, nuclear fusion, and high energy physics.", "url": "https://www.azooptics.com/News.aspx?newsID=27414", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ThumbForNews_27414_16450994414629625.jpg", "publishedAt": "2022-02-17T13:46:00Z", "content": "Laser-driven ion acceleration has been studied to develop a compact and efficient plasma-based accelerator, which is applicable to cancer therapy, nuclear fusion, and high energy physics. Osaka Unive… [+2897 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Chinese major rocket maker envisions reusable Mars Express - Global Times", "description": "Postgraduates of China’s largest developer and producer of carrier rockets the China Academy of Launch Vehicle Technology (CALT) have envisioned a reusable transport system that will commute between a future space station in the Mars orbit and the outpost fac…", "url": "https://www.globaltimes.cn/page/202202/1252540.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-11-09/5467a756-89bf-4373-b8da-082958aa2124.jpeg", "publishedAt": "2022-02-17T13:36:00Z", "content": "Illustration of the Tianwen-1 orbiter in the remote sensing orbit Photo: CASC\r\nPostgraduates of China's largest developer and producer of carrier rockets the China Academy of Launch Vehicle Technolog… [+3337 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Researchers create hydrocarbon molecule that can be used to make mini-transistors - News9 LIVE", "description": "The single hydrocarbon molecule has a logic gate function similar to conventional transistors", "url": "https://www.news9live.com/science/researchers-create-hydrocarbon-molecule-that-can-be-used-to-create-mini-transistors-154216", "urlToImage": "https://media.news9live.com/h-upload/2022/02/17/241809-strang-rektanglecropped.jpg", "publishedAt": "2022-02-17T12:36:27Z", "content": "Computers can become faster and more energy efficient by using smaller transistors. There is a limit to how small logic gates can become. Researchers from Lund University in Sweden have created the c… [+1725 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Superfluids provide new insight into turbulence - Phys.org", "description": "Eddies in an exotic liquid known as a superfluid merge to form large vortices, analogous to how cyclones form in the turbulent atmosphere.", "url": "https://phys.org/news/2022-02-superfluids-insight-turbulence.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/superfluids-provide-ne.jpg", "publishedAt": "2022-02-17T12:14:04Z", "content": "Eddies in an exotic liquid known as a superfluid merge to form large vortices, analogous to how cyclones form in the turbulent atmosphere.\r\nThe new research, by a team from The University of Queensla… [+2606 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "KATRIN experiment constrains upper mass limit of neutrinos with unprecedented precision - News9 LIVE", "description": "The Karlsruhe Tritium Neutrino (KATRIN) experiment is located at Germany's Karlsruhe Institute of...", "url": "https://www.news9live.com/science/katrin-experiment-constrains-upper-mass-limit-of-neutrinos-with-unprecedented-precision-154197", "urlToImage": "https://media.news9live.com/h-upload/2022/02/17/241747-01aircoilsystemmainspectrometernccropped.jpg", "publishedAt": "2022-02-17T11:45:24Z", "content": "A research team known as Karlsruhe Tritium Neutrino (KATRIN) located at the Karlsruhe Institute of Technology (KIT) in Germany have established a new upper limit for the mass of the neutrino, at 0.8 … [+2658 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Our Correspondent", "title": "Meet Anna Menon, crew member of SpaceX human mission and wife of Kerala-origin astronaut candidate - Onmanorama", "description": "Anna is a Lead Space Operations Engineer at SpaceX, where she manages the development of crew operations and serves in mission control as both a Mission Director and crew communicator.", "url": "https://www.onmanorama.com/news/world/2022/02/17/anna-menon-spacex-polaris-dawn-anil-menon-malayali-wife.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/news/world/images/2022/2/17/anna-and-anil.jpg", "publishedAt": "2022-02-17T11:31:16Z", "content": "New York: All eyes are set on the Space Walk to be organised by SpaceX which is expected to take place by the end of the year.\r\nSpaceX , the rocket company founded by tech billionaire Elon Musk, aims… [+4548 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jacco van Loon", "title": "Curious Kids: could we change other planets in the Solar System so we could live on them? - The Conversation UK", "description": "Humans might one day be able to live somewhere else in the Universe.", "url": "https://theconversation.com/curious-kids-could-we-change-other-planets-in-the-solar-system-so-we-could-live-on-them-176738", "urlToImage": "https://images.theconversation.com/files/446785/original/file-20220216-25-1t0fpbr.jpg?ixlib=rb-1.1.0&rect=0%2C623%2C3750%2C1875&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-17T11:04:44Z", "content": "Can we terraform other planets so that the human race can spread around the Solar System? Xander, aged 14, Eindhoven, The Netherlands\r\nOf the eight planets in the Solar System, we live on Earth, and … [+4440 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "J Oliver Conroy", "title": "Inside the Mars simulation project, where volunteers put their bodies on the line - The Guardian", "description": "To study life on the red planet, people from around the world volunteer to live with strangers in the middle of nowhere", "url": "https://amp.theguardian.com/science/2022/feb/17/mars-utah-simulation-volunteers", "urlToImage": "https://i.guim.co.uk/img/media/c71390ff58d0725113a074671561836963cc5374/0_81_1920_1152/master/1920.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f01a8c31ef54245003d00c491d0d5366", "publishedAt": "2022-02-17T09:00:00Z", "content": "The Mars weather is beautiful today, and an astronaut is about to suffocate to death under the cloudless blue sky.\r\nThe trouble starts after three crew members leave the safety of the Hab, their pres… [+13887 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "After Solar Storm destroys SpaceX satellites, scientists worry about Earth impact - HT Tech", "description": "After SpaceX satellites were destroyed in earth orbit by a solar storm, scientists are worried about the impact on Earth as Sun enters volatile phase.", "url": "https://tech.hindustantimes.com/tech/news/after-solar-storm-destroys-spacex-satellites-scientists-worry-about-earth-impact-71645083117775.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/17/1600x900/131_171cu_0_1645083260004_1645083283589.jpg", "publishedAt": "2022-02-17T07:38:03Z", "content": "Recently, 40 SPaceX satellites were desroyed just a day after launch due to a massive solar storm that caused them to crash back on to Earth. This has made the entire scientific community worried as … [+2788 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Exclusive interview: answers to 20 questions from the James Webb Space Telescope team - Big Think", "description": "Once science operations begin for James Webb, we'll never look at the Universe the same way again. Here's what everyone should know.", "url": "https://bigthink.com/starts-with-a-bang/20-questions-james-webb/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/12/https___blogs-images.forbes.com_startswithabang_files_2017_02_16865135741_2353176727_k-1200x819-1.jpg", "publishedAt": "2022-02-17T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The True Source of Earth's Water Could Be Wildly Different to What You Think - ScienceAlert", "description": "Nothing on Earth can live without water. The origin of water on Earth, therefore, is the origin of life in the Solar System (and the Universe) as we know it.", "url": "https://www.sciencealert.com/moon-rocks-may-reveal-the-true-source-of-earth-s-water-and-it-s-not-asteroids", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/TurbulentOceanWaters_1024.jpg", "publishedAt": "2022-02-17T04:40:17Z", "content": "Nothing on Earth can live without water. The origin of water on Earth, therefore, is the origin of life in the Solar System (and the Universe) as we know it.\r\nFiguring out where and how our world obt… [+4083 chars]"}, {"source": {"id": null, "name": "Startupdaily.net"}, "author": "Sara Webb & Rebecca Allen", "title": "How Victorian high school students are leading an experiment on space-made yoghurt - Startup Daily", "description": "They worked with researchers at Swinburne University to design an experiment investigating the nutritional values of space-made yoghurt", "url": "https://www.startupdaily.net/2022/02/how-victorian-high-school-students-are-leading-an-experiment-on-space-made-yoghurt/", "urlToImage": "https://www.startupdaily.net/wp-content/uploads/2022/02/NASA-ISS.jpeg", "publishedAt": "2022-02-17T01:23:28Z", "content": "Its probably no surprise that keeping healthy in space is incredibly important. And without the typical resources found on Earth, creative solutions have to be explored.\r\nRight now, some excited Year… [+6117 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Scientists develop a laser-guided system that can send a spacecraft to Mars in 45 days - Balkan Travellers", "description": "NASA expects it will take about 500 days for humans to reach the Red Planet, but Canadian engineers say a laser-based system could cut that journey down", "url": "https://www.balkantravellers.com/scientists-develop-a-laser-guided-system-that-can-send-a-spacecraft-to-mars-in-45-days/", "urlToImage": "https://www.balkantravellers.com/wp-content/uploads/2022/02/Scientists-develop-a-laser-guided-system-that-can-send-a-spacecraft.jpg", "publishedAt": "2022-02-17T01:18:03Z", "content": "NASA expects it will take about 500 days for humans to reach the Red Planet, but Canadian engineers say a laser-based system could cut that journey down to just 45 days.\r\nThe US space agency plans to… [+8865 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "CNN", "title": "NASA reveals stunning first image of glowing clouds surrounding an exploding star - 7NEWS", "description": "In the never-before-seen images, glowing purple gas clouds surround the exploding star.", "url": "https://7news.com.au/technology/science/nasa-reveals-stunning-first-image-of-glowing-clouds-surrounding-an-exploding-star-c-5728392", "urlToImage": "https://images.7news.com.au/publication/C-5728392/40ef1afe2d130949d0a65343b86ffa9ffa07e310-16x9-x0y74w510h287.png?imwidth=1200", "publishedAt": "2022-02-17T00:06:00Z", "content": "A new pair of X-ray eyes on the universe is allowing us to see extreme objects like never before.\r\nJust over two months after launching to space, NASAs newest explorer - the Imaging X-Ray Polarimetry… [+3913 chars]"}, {"source": {"id": null, "name": "Theinformant.co.nz"}, "author": "Callie Jensen", "title": "Where are we going to crash the International Space Station in 2031? - theinformant.co.nz", "description": "The absorption of the International Space Station will be canceled in January 2031. To do", "url": "https://theinformant.co.nz/where-are-we-going-to-crash-the-international-space-station-in-2031/", "urlToImage": "https://theinformant.co.nz/wp-content/uploads/2022/02/Where-are-we-going-to-crash-the-International-Space-Station.jpg", "publishedAt": "2022-02-16T22:28:21Z", "content": "The absorption of the International Space Station will be canceled in January 2031. To do this, it will be voluntarily redirected to Earth. It will disintegrate in the atmosphere, heading towards a p… [+2521 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "New atomic clock loses only one second every 300 billion years - Space.com", "description": "The device could help hunt dark matter or search for gravitational waves, scientists say.", "url": "https://www.space.com/atomic-clock-one-second-300-billion-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cyjHt9iAjA259uPVbmCqea-1200-80.jpg", "publishedAt": "2022-02-16T21:00:25Z", "content": "A group of physicists has announced one of the highest performance atomic clocks ever made.\r\nThe instrument is said to measure time so precisely that it will only lose one second every 300 billion ye… [+4012 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Beth Mundy", "title": "Lake evaporation patterns will shift with climate change - Phys.org", "description": "For many people, warm summer days feature spending time swimming in a lake. Lakes are important for more than just recreation and serve as a major global source of freshwater. But as temperatures continue to get warmer, so will lakes. As global average temper…", "url": "https://phys.org/news/2022-02-lake-evaporation-patterns-shift-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/lake-evaporation-patte.jpg", "publishedAt": "2022-02-16T20:56:22Z", "content": "Fig. 1: Spatially coupled future changes in lake evaporation and hydroclimate and the implication on regional lake volume changes. a Spatial pattern of future changes in lake evaporation based on the… [+6065 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Sunlight can help dissolve oil into seawater — ScienceDaily - Verve Times", "description": "The 2010 Deepwater Horizon oil spill was the largest marine oil spill in United States history. The disaster was caused by an explosion on the Deepwater Horizon oil rig, taking 11 lives and releasing nearly 210 million gallons of crude oil into the G", "url": "https://vervetimes.com/sunlight-can-help-dissolve-oil-into-seawater-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-16T20:42:05Z", "content": "The 2010 Deepwater Horizon oil spill was the largest marine oil spill in United States history. The disaster was caused by an explosion on the Deepwater Horizon oil rig, taking 11 lives and releasing… [+4355 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Claim Earth's Core Is a Weird New State of Matter - Futurism", "description": "Physicists at the Chinese Academy of Sciences determined that the Earth's inner core is in a \"superionic sate,\" technically neither a solid or a liquid.", "url": "https://futurism.com/the-byte/scientists-earths-core-weird-state-matter", "urlToImage": "https://wp-assets.futurism.com/2022/02/scientists-earths-core-weird-state-matter.jpg", "publishedAt": "2022-02-16T20:33:51Z", "content": "\"It is quite abnormal.\"\r\nSuperionic\r\nNobody quite knows whats lurking at the very core of the Earth. Is it solid, liquid, or a new form of matter entirely?\r\nWith the help of his colleagues, Chinese A… [+2117 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "16 Psyche: An asteroid once thought to be worth $700 quintillion - Interesting Engineering", "description": "A recent study on the asteroid 16 Psyche indicates that prospective space miners may have rejoiced far too soon.", "url": "https://interestingengineering.com/asteroid-psyche-700-quintillion", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/qrwBQ0V365/sizes/16-psyche_md.jpeg", "publishedAt": "2022-02-16T15:21:10Z", "content": "Future space missions will travel to asteroids to mine the great wealth of material they transport around space.\r\nThe \"holy grail\" of asteroids for future space miners is 16 Psyche, with early estima… [+4162 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Chang'e-5 lunar samples help reset clock for solar system evolution - CGTN", "description": "Using the lunar samples returned by China's Chang'e-5 mission in December 2020, Chinese researchers have established an updated lunar chronology model, which will serve as a more precise time ruler for not just the evolution of the moon, but also that of othe…", "url": "https://news.cgtn.com/news/2022-02-16/Chang-e-5-lunar-samples-help-reset-clock-for-solar-system-evolution-17HxIRW0s0g/index.html", "urlToImage": "https://news.cgtn.com/news/2022-02-16/Chang-e-5-lunar-samples-help-reset-clock-for-solar-system-evolution-17HxIRW0s0g/img/51d18cc9668b477ba0906cfb1c79e917/51d18cc9668b477ba0906cfb1c79e917-750.jpeg", "publishedAt": "2022-02-16T15:04:41Z", "content": "Screenshot of the study from the website of Nature Astronomy.\r\nScreenshot of the study from the website of Nature Astronomy.\r\nUsing the lunar samples returned by China's Chang'e-5 mission in December… [+2808 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DNA design brings predictability to polymer gels - Science Daily", "description": "Simulations have led to the fabrication of a polymer-DNA gel that could be used in tissue regeneration and robotics.", "url": "https://www.sciencedaily.com/releases/2022/02/220216083003.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-16T14:35:53Z", "content": "Simulations have led to the fabrication of a polymer-DNA gel that could be used in tissue regeneration and robotics.Scientists in Japan have made a tuneable, elastic and temperature-sensitive gel by … [+2652 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Fusion Energy that Fuels the Sun Could be Replicated on Earth Following New Breakthrough of an Old Concept - AZoQuantum", "description": "Researchers have accomplished an extraordinary breakthrough in the conceptual design of twisty stellarators, experimental magnetic facilities that could replicate on Earth the fusion energy that fuels the sun and stars.", "url": "https://www.azoquantum.com/News.aspx?newsID=8783", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_8783_1645013498530989.png", "publishedAt": "2022-02-16T14:17:00Z", "content": "Researchers have accomplished an extraordinary breakthrough in the conceptual design of twisty stellarators - experimental magnetic facilities that could replicate on Earth the fusion energy that fue… [+6423 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Nathaniel Scharping", "title": "This rare Frankenstein star wears the skin of its dead companion - Inverse", "description": "This merger takes a pretty exact mass range of two white dwarves, one that causes one star to thrash the other and pull its gas on top.", "url": "https://www.inverse.com/science/violent-white-dwarf-star-merger", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2019/10/30/87fc4527-3959-4fb5-bf72-6ab4c4f4d537-shutterstock-197326970.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-16T14:00:25Z", "content": "Astronomers say \r\ntheyve found a unique new kind of star in the universe, one born from a merger between two white dwarves. The resulting star, which consists of a core of helium surrounded by an out… [+5985 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers find largest radio galaxy ever - Phys.org", "description": "By a stroke of luck, a team led by Dutch Ph.D. student Martijn Oei has discovered a radio galaxy of at least 16 million light-years long. The pair of plasma plumes is the largest structure made by a galaxy known thus far. The finding disproves some long-kept …", "url": "https://phys.org/news/2022-02-astronomers-largest-radio-galaxy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-find-large.jpg", "publishedAt": "2022-02-16T13:52:45Z", "content": "By a stroke of luck, a team led by Dutch Ph.D. student Martijn Oei has discovered a radio galaxy of at least 16 million light-years long. The pair of plasma plumes is the largest structure made by a … [+5417 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Insights into creating a source of oxygen on Moon or Mars - Tech Explorist", "description": "How easy is it to create oxygen from water on Mars?", "url": "https://www.techexplorist.com/insights-creating-source-oxygen-moon-mars/44746/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/02/half-moon.jpg", "publishedAt": "2022-02-16T11:38:06Z", "content": "Establishing a permanent human presence on the Moon or Mars requires a secure oxygen supply for life support and refueling. Electrolysis is a popular potential method for sustainable habitation of th… [+2735 chars]"}, {"source": {"id": null, "name": "Light Reading"}, "author": null, "title": "Musk eyes 30,000 LEO sats - but how many are too many? - Light Reading", "description": "Just how many satellites are too many - and how close is that? What happens if there's more? Could space debris stop space exploration? The experts explain.", "url": "https://www.lightreading.com/satellite/musk-eyes-30000-leo-sats---but-how-many-are-too-many/d/d-id/775286", "urlToImage": "https://img.lightreading.com/2022/02/775286/8602.jpg", "publishedAt": "2022-02-16T11:02:43Z", "content": "It's possible to have too much of a good thing. The trick is knowing how much is too much.\r\nElon Musk's SpaceX currently has permission from the Federal Communications Commission (FCC) to launch 12,0… [+5364 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Mars wheel control algorithms gain momentum - Balkan Travellers", "description": "Picture the scene: You're driving around in your car when, at least an hour from nearest help, one of your tires starts losing air. do not worry! You have", "url": "https://www.balkantravellers.com/mars-wheel-control-algorithms-gain-momentum/", "urlToImage": null, "publishedAt": "2022-02-16T09:14:42Z", "content": "Picture the scene: You’re driving around in your car when, at least an hour from nearest help, one of your tires starts losing air. do not worry! You have a spare tire with the tools and knowledge to… [+1892 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "New Sensor that Mimics Automatic Human Reaction to Heat Could Pave the Way for 'Soft Robots of the Future' - AZoSensors", "description": "A new robotic sensor that mimics the automatic human reaction to heat is being hailed as a world first.", "url": "https://www.azosensors.com/news.aspx?newsID=14922", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_14922_16450025047296461.jpg", "publishedAt": "2022-02-16T09:11:00Z", "content": "A new robotic sensor that mimics the automatic human reaction to heat is being hailed as a world first. \r\nImage Credit: Liverpool Hope University\r\nThe device has been built by a team of experts from … [+3892 chars]"}, {"source": {"id": null, "name": "Splash 247"}, "author": "Sam Chambers", "title": "World's most extreme rogue wave recorded in the North Pacific - Splash247 - Splash 247", "description": "Researchers have announced that a 17.6 m rogue wave – the most extreme rogue wave ever recorded – has been measured in the waters off of Ucluelet, British Colombia. The rogue wave, which measures as h", "url": "https://splash247.com/worlds-most-extreme-rogue-wave-recorded-in-the-north-pacific/", "urlToImage": "https://467222-1467340-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2020/12/ONE-Apus-in-port.jpeg", "publishedAt": "2022-02-16T08:45:53Z", "content": "Researchers have announced that a 17.6 m rogue wave the most extreme rogue wave ever recorded has been measured in the waters off of Ucluelet, British Colombia.\r\nThe rogue wave, which measures as hig… [+2874 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Fermin Koop", "title": "Lichens are having a hard time catching up to climate change - ZME Science", "description": "Global average temperature is going up, and nature is finding it difficult to adapt.", "url": "https://www.zmescience.com/science/lichens-difficult-time-catch-up-climate-change-15022022/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/02/tjRe6L4o-1-1.jpg", "publishedAt": "2022-02-16T08:04:53Z", "content": "Lichens are some of the most inconspicuously amazing organisms out there. They’re essentially composite, symbiotic organisms made from a fungus and algae or cyanobacterium living among the filaments … [+3062 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Christie's auctioning Costa Rican doghouse struck by meteorite - ABC News", "description": "It's a modest dog kennel that was once home to a German shepherd named Roky, but the meteorite that hit it in 2019, leaving an 18cm hole in the roof, is set to see it auctioned for as much as $US300,000.", "url": "https://www.abc.net.au/news/2022-02-16/meteorite-dog-house-listed-for-auction-christies/100837018", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4a0014153ac3189d341f00260a516403?impolicy=wcms_crop_resize&cropH=591&cropW=1051&xPos=0&yPos=77&width=862&height=485", "publishedAt": "2022-02-16T07:02:57Z", "content": "Christie's, the luxury auction house normally associated with listings of dazzling jewels and works of fine arts produced by household names, has an offering that would, on first glance, leave many s… [+2961 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Hubble captures a cosmic interaction - Tech Explorist", "description": "It is rare to capture an image of two galaxies interacting in such a visibly dynamic way.", "url": "https://www.techexplorist.com/hubble-captures-cosmic-interaction/44735/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/02/arp-282.jpg", "publishedAt": "2022-02-16T05:27:22Z", "content": "NASA/ESA Hubble Space Telescope snaps an image of an interacting galaxy pair in the Arp 282 system. The system is located almost 319 million light-years away in the constellation of Andromeda.\r\nThe g… [+983 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Strange Quantum Object Successfully Created in The Lab For The First Time - ScienceAlert", "description": "Quantum mechanics – the behavior of the Universe at the smallest of scales – continues to surprise us, with scientists now having been able to successfully create a quantum object called a domain wall in laboratory settings.", "url": "https://www.sciencealert.com/scientists-create-a-new-type-of-quantum-object-in-the-lab-domain-walls", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/DomainWalls_1024.jpg", "publishedAt": "2022-02-16T01:52:57Z", "content": "Quantum mechanics the behavior of the Universe at the smallest of scales continues to surprise us, with scientists now having been able to successfully create a quantum object called a domain wall in… [+2964 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "How embryo cells gain independence — ScienceDaily - Verve Times", "description": "It happens in the first hours after fertilization: The cells of the early embryo begin to independently produce proteins, the building blocks for cells and organs. Their own, uniquely composed genetic material serves as the blueprint. In vertebrates,", "url": "https://vervetimes.com/how-embryo-cells-gain-independence-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-16T01:19:08Z", "content": "It happens in the first hours after fertilization: The cells of the early embryo begin to independently produce proteins, the building blocks for cells and organs. Their own, uniquely composed geneti… [+2666 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "With a rest, researchers have found an explanation for dark matter-poor galaxies - Balkan Travellers", "description": "Zoom / The slightly blurry spot of light in the middle of the image is the DF2 galaxy, scattered so that other galaxies are clearly visible behind it. The", "url": "https://www.balkantravellers.com/with-a-rest-researchers-have-found-an-explanation-for-dark-matter-poor-galaxies/", "urlToImage": "https://www.balkantravellers.com/wp-content/uploads/2022/02/With-a-rest-researchers-have-found-an-explanation-for-dark.png", "publishedAt": "2022-02-16T01:13:50Z", "content": "Zoom/ The slightly blurry spot of light in the middle of the image is the DF2 galaxy, scattered so that other galaxies are clearly visible behind it.\r\nThe first evidence of dark matter was galaxies t… [+4990 chars]"}]}