{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Pompeii of prehistoric plants' unlocks evolutionary secret: study - Phys.org", "description": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominate so much of the Earth today.", "url": "https://phys.org/news/2021-03-pompeii-prehistoric-evolutionary-secret.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/60462a8c7fae7.jpg", "publishedAt": "2021-03-08T20:00:03Z", "content": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominat… [+3813 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Tegan Taylor", "title": "Microplastics in seafood are most likely to come via oysters, mussels and shellfish. But how much of a health risk do they pose? - ABC News", "description": "Researchers have identified the seafoods that are most likely to contribute microplastics to the Australian diet — but we still don't know what effect, if any, the tiny particles have on human health.", "url": "https://www.abc.net.au/news/health/2021-03-09/microplastics-in-seafood-what-is-the-health-risk/13202958", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/3bbf7fdf6054a87c34fa22248d21c45c?impolicy=wcms_crop_resize&cropH=1689&cropW=3000&xPos=0&yPos=308&width=862&height=485", "publishedAt": "2021-03-08T19:00:00Z", "content": "Perhaps you've seen headlines saying we consume a credit card's worth of microplastics a week, or that microplastics have been found in our poo.\r\nNow a new research paper has tried to identify the se… [+4031 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Brain activity foreshadows changes in stock prices - EurekAlert", "description": "Forecasting changes in stock prices may be possible with the help of brain activity in regions associated with how people feel before making investment choices. Scientists could accurately forecast market price changes based on the average brain activity amon…", "url": "https://www.eurekalert.org/pub_releases/2021-03/sfn-baf030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257895_web.jpg", "publishedAt": "2021-03-08T18:02:50Z", "content": "IMAGE: Whole brain confirmation that activity in predicted regions forecasts stock price direction and inflection. Top, Stock price direction: NAcc activity forecast stock price direction in experime… [+1743 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Former NASA Leader Says SpaceX Should Build NASA's Moon Rocket - Futurism", "description": "\"I would not have recommended the government build a $27 billion rocket.\"", "url": "https://futurism.com/former-nasa-spacex-should-build-nasas-moon-rocket", "urlToImage": "https://wp-assets.futurism.com/2021/03/former-nasa-spacex-should-build-nasas-moon-rocket.jpg", "publishedAt": "2021-03-08T17:19:02Z", "content": "Former NASA deputy administrator Lori Garver believes that the agencys extremely expensive and overdue Space Launch System (SLS), the rocket meant to return American astronauts to the surface of the … [+3895 chars]"}, {"source": {"id": null, "name": "Nintendo-power.com"}, "author": "Ebenezer Robbins", "title": "\"The end of the world is very long\" - Nintendo-Power", "description": "In his new book \"Towards the End of Time\" (Ed. Flamorian), Brian Green, a global expert on string theory and a professor at Columbia University in NY,", "url": "https://nintendo-power.com/the-end-of-the-world-is-very-long/", "urlToImage": null, "publishedAt": "2021-03-08T17:01:01Z", "content": "In his new book “Towards the End of Time” (Ed. Flamorian), Brian Green, a global expert on string theory and a professor at Columbia University in NY, tells us how it all started. After all, thats ho… [+10386 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Mars Rover Landing Site Named After Sci-Fi Legend Octavia Butler - Gizmodo Australia", "description": "That magical spot in Jezero crater where NASA’s Perseverance rover made its historic landing last month has been named “Octavia E. Butler Landing” in honour of the late sci-fi author. “I can think of no better person to mark this historic landing site than Oc…", "url": "https://www.gizmodo.com.au/2021/03/mars-rover-landing-site-named-after-sci-fi-legend-octavia-butler/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/09/rteavlxpg3pmkknhockx.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nr=20", "publishedAt": "2021-03-08T17:01:00Z", "content": "That magical spot in Jezero crater where NASAs Perseverance rover made its historic landing last month has been named Octavia E. Butler Landing in honour of the late sci-fi author.\r\nI can think of no… [+3374 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "NASA is Considering a Radio Telescope on the Far Side of the Moon - Universe Today", "description": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView, would harvest building materials from the Lunar surface its…", "url": "https://www.universetoday.com/150417/nasa-is-considering-a-radio-telescope-on-the-far-side-of-the-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/lunar_deposition_rover_light_lr_.jpg", "publishedAt": "2021-03-08T16:52:00Z", "content": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView,… [+7405 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "Hubble Space Telescope unexpectedly enters safe mode - CNET", "description": "The veteran spy of the deep cosmos needs a nap.", "url": "https://www.cnet.com/news/hubble-space-telescope-unexpectedly-enters-safe-mode/", "urlToImage": "https://cnet2.cbsistatic.com/img/7OoIHCNQ58ivcC59kmcqkce-E7g=/0x0:4031x4095/1200x630/2021/03/08/959e4074-a4b9-47d6-898b-165836adcda9/sts109-730-034.jpg", "publishedAt": "2021-03-08T16:10:40Z", "content": "The Hubble Space Telescope just chillin' at altitude.\r\nNASA\r\nThe Hubble Space Telescope is taking the senior satellite equivalent of a mental health day. The godfather of all orbiting observatories \"… [+1470 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Insatiable demand for cannabis has created a giant carbon footprint - Phys.org", "description": "It's no secret that the United States' $13 billion cannabis industry is big business. Less obvious to many is the environmental toll this booming business is taking, in the form of greenhouse gas emissions from commercial, mostly indoor production.", "url": "https://phys.org/news/2021-03-insatiable-demand-cannabis-giant-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/insatiablede.jpg", "publishedAt": "2021-03-08T16:00:04Z", "content": "It's no secret that the United States' $13 billion cannabis industry is big business. Less obvious to many is the environmental toll this booming business is taking, in the form of greenhouse gas emi… [+4861 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "Hey, So These Sea Slugs Decapitate Themselves and Grow New Bodies - WIRED", "description": "Showing off their best impressions of Deadpool, the animals survived for weeks without organs, only to regrow everything and go about their business.", "url": "https://www.wired.com/story/sea-slugs-decapitate-themselves-and-grow-new-bodies/", "urlToImage": "https://media.wired.com/photos/60428283dc2eb5608fca593d/191:100/w_1280,c_limit/Science_The-head-of-Elysia-cf-marginata-just-after-autotomy-CREDIT-Sayaka-Mitoh.jpg", "publishedAt": "2021-03-08T16:00:00Z", "content": "Imagine biologist Sayaka Mitohs surprise the day she found that a sea slug in her lab was suddenly missing its body. Or its head, reallydepends on your perspective. Either way, the sea slug was in tw… [+2193 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "Origin of Solar-Mass Black Holes and the Connection to Dark Matter - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/origin-of-solar-mass-black-holes-and-the-connection-to-dark-matter/", "urlToImage": null, "publishedAt": "2021-03-08T15:33:15Z", "content": "What is the origin of black holes and how is that question connected with another mystery, the nature of dark matter? Dark matter comprises the majority of matter in the Universe, but its nature rema… [+3700 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Nanoenzymes designed with a unique combination of structure and functions - Phys.org", "description": "Researchers at the UAB have designed minimalist biostructures that imitate natural enzymes, capable of carrying out two differentiated and reversibly regulated activities thanks to a unique combination of structural and functional properties. The strategy use…", "url": "https://phys.org/news/2021-03-nanoenzymes-unique-combination-functions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/60462b4425bf7.jpg", "publishedAt": "2021-03-08T15:29:43Z", "content": "Researchers at the UAB have designed minimalist biostructures that imitate natural enzymes, capable of carrying out two differentiated and reversibly regulated activities thanks to a unique combinati… [+4645 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Sea Level Rise Causes Increase in Nuisance Flooding on U.S. Coasts - AZoCleantech", "description": "In recent decades, there has been an increase in nuisance flooding on U.S. coasts caused by sea level rise.", "url": "https://www.azocleantech.com/news.aspx?newsID=29005", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29005_16152044290992117.jpg", "publishedAt": "2021-03-08T15:01:00Z", "content": "Written by AZoCleantechMar 8 2021\r\nIn recent decades, there has been an increase in nuisance flooding on U.S. coasts caused by sea level rise. A new study co-authored by the University of Central Flo… [+4106 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Electrical Engineer and NASA Astronaut Joan Higginbotham - NASA", "description": "At NASA, women – be they scientists, pilots, astronauts and others – help the Agency fulfill its mission. Joan Higginbotham  is one of those women.", "url": "https://www.nasa.gov/image-feature/electrical-engineer-and-nasa-astronaut-joan-higginbotham/", "urlToImage": "http://www.nasa.gov/sites/default/files/images/715067main_JSC2003-00678_full.jpg", "publishedAt": "2021-03-08T14:41:42Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why slow-pouring coffee makes a tower of liquid in your cup - Phys.org", "description": "When a droplet of coffee hits the liquid surface in the cup, a characteristic tower of coffee forms for a very short time, sometimes even with a new droplet on top. In a paper that appeared in Physical Review Fluids today, a team of researchers from Amsterdam…", "url": "https://phys.org/news/2021-03-slow-pouring-coffee-tower-liquid-cup.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/coffee.jpg", "publishedAt": "2021-03-08T14:38:48Z", "content": "When a droplet of coffee hits the liquid surface in the cup, a characteristic tower of coffee forms for a very short time, sometimes even with a new droplet on top. In a paper that appeared in Physic… [+3912 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Insights on how night shift work increases cancer risk - Science Daily", "description": "A recent study offers new clues as to why night shift workers are at increased risk of developing certain types of cancer compared to those who work regular daytime hours. Findings suggest that night shifts disrupt natural 24-hour rhythms in the activity of c…", "url": "https://www.sciencedaily.com/releases/2021/03/210308091744.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-08T14:31:59Z", "content": "New clues as to why night shift workers are at increased risk of developing certain types of cancer are presented in a new study conducted at Washington State University Health Sciences Spokane.Publi… [+6032 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Large supernova remnant detected by eROSITA - Phys.org", "description": "Using the extended Röntgen Survey Imaging Telescope Array (eROSITA) instrument onboard the Spektr-RG spacecraft, astronomers have detected in X-rays a new large supernova remnant (SNR). The newfound object, dubbed \"Hoinga,\" turns out to be one of the largest …", "url": "https://phys.org/news/2021-03-large-supernova-remnant-erosita.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/largesuperno.jpg", "publishedAt": "2021-03-08T14:00:02Z", "content": "Using the extended Röntgen Survey Imaging Telescope Array (eROSITA) instrument onboard the Spektr-RG spacecraft, astronomers have detected in X-rays a new large supernova remnant (SNR). The newfound … [+3224 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earth has a hidden layer, and no one knows exactly what it is - Livescience.com", "description": "", "url": "https://www.livescience.com/new-earth-layer-solid-inner-core.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uHtqwrQcroA2RGYBdNwUfQ-1200-80.jpg", "publishedAt": "2021-03-08T13:49:51Z", "content": "Earth\r\n might have more layers than scientists thought.\r\nNew research finds that there may be a hidden layer inside the Earth's solid inner core an inner-inner core, if you will. The precise nature o… [+3974 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Research explores promoting public trust in AI - Phys.org", "description": "The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI and has the authority to mete out sanctions if it causes or is likely to cause harm.", "url": "https://phys.org/news/2021-03-explores-ai.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5-ai.jpg", "publishedAt": "2021-03-08T13:49:03Z", "content": "The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI and has the authority to mete out sancti… [+3336 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Isabelle Osterholt", "title": "Research illuminates embryonic stem cell fate - Phys.org", "description": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight into stem cell pluripotency and evolutionary developmental b…", "url": "https://phys.org/news/2021-03-illuminates-embryonic-stem-cell-fate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/chickeneggs.jpg", "publishedAt": "2021-03-08T13:48:23Z", "content": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight … [+3978 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "This 'Ninja Giant' is the oldest titanosaur on record - Livescience.com", "description": "", "url": "https://www.livescience.com/oldest-titanosaur-ninja-giant-argentina.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6VFMocyhu49Gi9Xro46vn7-1200-80.jpg", "publishedAt": "2021-03-08T13:21:03Z", "content": "A new long-neck dinosaur discovered in Argentina might be the oldest titanosaur ever discovered.\r\nThe dinosaur, dubbed Ninjatitan zapati, lived 140 million years ago, which is 20 million years before… [+3914 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "How Do Eyeless Worms Know To Avoid The Color Blue? - IFLScience", "description": "The roundworm Caenorhabditis elegans is among the most studied species on Earth, but it retains the capacity to surprise, or even astonish, scientists. The", "url": "https://www.iflscience.com/plants-and-animals/how-do-eyeless-worms-know-to-avoid-the-color-blue/", "urlToImage": "https://cdn.iflscience.com/images/05e2f48b-f05b-5dda-b7d6-ce026a99968b/default-1614956949-c-elegans-tangle.jpg", "publishedAt": "2021-03-08T12:51:00Z", "content": "The roundworm Caenorhabditis elegans is among the most studied species on Earth, but it retains the capacity to surprise, or even astonish, scientists. The most recent discovery is the worms can avoi… [+3136 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Saqib Shah", "title": "Comets may have seeded Earth with life-supporting carbon - Yahoo Finance Australia", "description": "A snapshot of a comet carrying carbon as it zipped past Earth in 2016 is helping NASA learn more about the origins of life.", "url": "https://au.finance.yahoo.com/news/comets-may-have-seeded-earth-with-life-supporting-carbon-120129729.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/AlpmUxxhfaERm_n_UA8JqQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMTQ3/https://s.yimg.com/os/creatr-uploaded-images/2021-03/5e3aef70-8003-11eb-8e8b-9fba022eb3bb", "publishedAt": "2021-03-08T12:01:29Z", "content": "[175+ Pages Research Report] According to the recent analysis research report; the global Personal Mobility Devices Market in 2019 was approximately USD 5,400 Million. The market is expected to grow … [+13421 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ellie Harrison", "title": "Harry and Meghan: Jada Pinkett Smith and Gabrielle Union among celebrities to react after Oprah interview - The Independent", "description": "Many stars defended the couple on social media", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/harry-meghan-oprah-interview-celebrity-reactions-b1813871.html", "urlToImage": "https://static.independent.co.uk/2021/03/08/08/meghan%20harry_.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-03-08T11:36:39Z", "content": "Gabrielle Union and Jada Pinkett Smith are among the celebrities who have reacted to Prince Harry and Meghan Markles interview with Oprah Winfrey.\r\nThe TV event, which aired in the US on CBS on Sunda… [+2113 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "Scientists Say: Egg and sperm - Science News for Students", "description": "An egg or a sperm cell contains half of the normal genes an organism needs. They fuse together to form a new individual.", "url": "https://www.sciencenewsforstudents.org/article/scientists-say-egg-and-sperm", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2021/03/1030_SS_egg_and_sperm_feat.jpg", "publishedAt": "2021-03-08T11:30:00Z", "content": "algae: Single-celled organisms, once considered plants (they arent). As aquatic organisms, they grow in water. Like green plants, they depend on sunlight to make their food.\r\nbirds: Warm-blooded anim… [+5009 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Arecibo Observatory has more science to do despite iconic radio telescope's collapse - Space.com", "description": "Arecibo Observatory must scientifically reinvent itself even as it continues mourning its iconic radio telescope and cleaning up its debris.", "url": "https://www.space.com/arecibo-observatory-science-after-telescope-collapse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uLNdCAEzieav26XkAof84L-1200-80.jpg", "publishedAt": "2021-03-08T11:24:38Z", "content": "For decades, the words \"Arecibo Observatory\r\n\" was shorthand for the facility's massive radio telescope, one of those rare instruments that reached icon status  beyond its core science community.\r\nBu… [+10047 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Sakshat Kolhatkar", "title": "Scientists at CARMENES discover Super Earth Gliese 486 b, 26 light years away from Earth - Republic TV", "description": "Scientists have discovered a new planet called Gliese 486 b which is being considered a super Earth-like planet. Scientists are excited about this finding.", "url": "https://www.republicworld.com/technology-news/science/scientists-at-carmenes-discover-super-earth-gliese-486-b-26-light-years-away-from-earth.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ryc7iie30urnwtvl_1615190511.jpeg?tr=f-jpeg", "publishedAt": "2021-03-08T10:18:00Z", "content": "Scientists have just discovered a giant super Earth-like planet at a distance of 26 light-years away from the Earth. Scientists feel this newly discovered planet will help them study the atmospheric … [+2523 chars]"}, {"source": {"id": null, "name": "VentureBeat"}, "author": "Kyle Wiggers", "title": "Nvidia and Harvard develop AI tool that speeds up genome analysis - VentureBeat", "description": "Nvidia and Harvard researchers say they've developed an AI tool that can dramatically speed up genome analysis.", "url": "https://venturebeat.com/2021/03/08/nvidia-and-harvard-develop-ai-tool-that-speeds-up-genome-analysis/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2018/02/shutterstock_400845934-e1572448996720.jpg?w=1200&strip=all", "publishedAt": "2021-03-08T10:00:33Z", "content": "Join Transform 2021 for the most important themes in enterprise AI &amp; Data. Learn more.\r\nResearchers affiliated with Nvidia and Harvard today detailed AtacWorks, a machine learning toolkit designe… [+3666 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Pip Christmass", "title": "International Space Station: How to view as it flies over east coast of Australia - 7NEWS.com.au", "description": "Over the next two nights, stargazers have an opportunity to get a clear view of the space station.", "url": "https://7news.com.au/technology/space/international-space-station-how-to-view-as-it-flies-over-east-coast-of-australia-c-2309844", "urlToImage": "https://images.7news.com.au/publication/C-2309844/c9ea9594826044f6f81b819514e9e92ca4066f83-16x9-x0y452w4827h2715.jpg?imwidth=1024", "publishedAt": "2021-03-08T06:52:54Z", "content": "The International Space Station (ISS) will be passing over the skies of Australia over the next two nights.\r\nSo where and when is the best time to see it where you live?\r\nOn Monday night, sky gazers … [+1702 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals physical phenomena relied by oocytes to grow big - News-Medical.net", "description": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.", "url": "https://www.news-medical.net/news/20210308/Study-reveals-physical-phenomena-relied-by-oocytes-to-grow-big.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_of_sperms_and_an_egg_cell-Sebastian_Kaulitzki-2000_61f390311d3c4b1abeec7aceca5ab548-620x480.jpg", "publishedAt": "2021-03-08T05:39:00Z", "content": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.\r\nThere's a reason … [+6401 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We've Found The Best Time And Place to Live in The Milky Way... And It's Not Here - ScienceAlert", "description": "More and more, it seems that the existence and persistence of life on Earth is the result of sheer luck. According to a new analysis of the history of the Milky Way, the best time and place for the emergence of life isn't here, or now, but over 6 bil", "url": "https://www.sciencealert.com/when-was-the-best-time-and-place-to-live-in-the-milky-way-not-where-we-are-apparently", "urlToImage": "https://www.sciencealert.com/images/2021-03/processed/milky-way-bulge_1024.jpg", "publishedAt": "2021-03-08T05:19:44Z", "content": "More and more, it seems that the existence and persistence of life on Earth is the result of sheer luck. According to a new analysis of the history of the Milky Way, the best time and place for the e… [+5280 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Most distant cosmic jet providing clues about early universe - Science Codex", "description": null, "url": "https://www.sciencecodex.com/most-distant-cosmic-jet-providing-clues-about-early-universe-668429", "urlToImage": null, "publishedAt": "2021-03-08T05:00:00Z", "content": "Astronomers using the National Science Foundation's Karl G. Jansky Very Large Array (VLA) and Very Long Baseline Array (VLBA) have found and studied the most distant cosmic jet discovered so far -- a… [+2488 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Rain Jordan", "title": "Better Primates? Humans Evolved to be More Water Efficient Than Nearest Animal Kin - Nature World News", "description": "A new genetic characteristic that distinguishes humans from other primates has been discovered. In comparison to other animals, humans have learned to consume less water every day.", "url": "https://www.natureworldnews.com/articles/45375/20210307/humans-evolved-to-be-more-water-efficient-compared-to-other-primates.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/52626/evolution.jpg", "publishedAt": "2021-03-08T04:25:33Z", "content": "Scientists have found a new feature that distinguishes humans from other primates, such as chimps. According to the findings, humans consume 30 to 50 percent less water every day than our nearest ani… [+3495 chars]"}, {"source": {"id": null, "name": "Shepherdgazette.com"}, "author": null, "title": "First Proof of Tectonic Exercise on an Exoplanet - The Shepherd of the Hills Gazette", "description": "This artist’s illustration represents the possible interior dynamics of the super-Earth exoplanet LHS 3844b. The planet’s interior properties and the", "url": "https://shepherdgazette.com/first-proof-of-tectonic-exercise-on-an-exoplanet/", "urlToImage": "https://shepherdgazette.com/wp-content/uploads/2021/03/lhs-3844b-an-exoplanet-with-hemispheric-tectonics-720x720.jpg", "publishedAt": "2021-03-08T02:18:41Z", "content": "This artists illustration represents the possible interior dynamics of the super-Earth exoplanet LHS 3844b. The planets interior properties and the strong stellar irradiation might lead to a hemisphe… [+2974 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Atom and a Clever Trick Reveals the Long-Kept Secrets of the Solar System - SciTechDaily", "description": "Using the extinct niobium-​92 atom, ETH researchers have been able to date events in the early solar system with greater precision than before. The study concludes that supernova explosions must have taken place in the birth environment of our sun. If an atom…", "url": "https://scitechdaily.com/extinct-atom-and-a-clever-trick-reveals-the-long-kept-secrets-of-the-solar-system/", "urlToImage": "https://scitechdaily.com/images/Unstable-Atom-92Nb.jpg", "publishedAt": "2021-03-08T00:42:33Z", "content": "The unstable atom 92Nb, which has long since disappeared, provides information about the beginnings of our solar system. Credit: Makiko K. Haba\r\nUsing the extinct niobium-​92 atom, ETH researchers ha… [+3528 chars]"}, {"source": {"id": null, "name": "Prensa Latina"}, "author": "", "title": "China´s Tianwen-1 probe sends back three images of Mars - Prensa Latina", "description": "Beijing, Mar 4 (Prensa Latina) China´s Tianwen-1 probe has sent back three pictures of Mars, placed close to the red planet since late February.", "url": "https://www.plenglish.com/index.php?SEO=chinas-tianwen-1-probe-sends-back-three-images-of-mars&id=65032&o=rn", "urlToImage": "http://www.plenglish.com/images/2021/marzo/04/Marte-Imagen-Tianwen-1.jpg", "publishedAt": "2021-03-08T00:13:54Z", "content": "Beijing, Mar 4 (Prensa Latina) China´s Tianwen-1 probe has sent back three pictures of Mars, placed close to the red planet since late February.\r\nAccording to the National Space Administration, the p… [+983 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Bill Whitaker", "title": "NASA's new race to put a woman on the moon - 60 Minutes - CBS News", "description": "Nearly a half-century after the last Apollo astronaut stepped foot on the moon, NASA is working to send its first woman to the lunar surface. Bill Whitaker reports.", "url": "https://www.cbsnews.com/news/moon-nasa-efforts-return-60-minutes-2021-03-07/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/03/07/5736a0be-0854-4523-9a34-5cf0f495b7fb/thumbnail/1200x630/7babe070bd258e82106c815d6c09fa9e/moonarticle.jpg", "publishedAt": "2021-03-07T23:59:00Z", "content": "Twelve American men have walked on the moon. The last Apollo astronaut left his footprint there in December 1972. Now, a half-century later, NASA is planning to send people back to the moon. The new … [+11266 chars]"}, {"source": {"id": null, "name": "Theburnin.com"}, "author": null, "title": "Rapid 3D printing method could be key to making organs | The Burn-In - The Burn-In", "description": "Researchers from the University of Buffalo have developed a new rapid 3D printing method that could be the key to making human organs.", "url": "https://www.theburnin.com/technology/rapid-3d-printing-method-organs-2021-03-07/", "urlToImage": "https://www.theburnin.com/wp-content/uploads/2021/03/rsz_istock-1038989298-1.jpg", "publishedAt": "2021-03-07T23:57:50Z", "content": "Over the years, 3D printing has found more and more real-world uses across a variety of industries. Although it is most commonly used to print rigid, non-changing parts and structures, researchers be… [+3328 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "https://www.facebook.com/profile.php?id=100022982110913", "title": "TWIRL 3: Rocket Lab to attempt launch of delayed mission - Neowin", "description": "There are four planned rocket launches this week, two from SpaceX, one from Rocket Lab, and another from the Chinese National Space Administration. Rocket Lab's mission was delayed from last week.", "url": "https://www.neowin.net/news/twirl-3-rocket-lab-to-attempt-launch-of-delayed-mission/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2021/03/1615147213_1613946023_special_rocket_story.jpg", "publishedAt": "2021-03-07T20:16:02Z", "content": "Last week was quite good for SpaceX with it almost successfully landing its Starship rocket during a test, unfortunately, it caught fire and exploded on the pad. Rocket Lab also had to delay its “The… [+2048 chars]"}, {"source": {"id": null, "name": "Fintechzoom.com"}, "author": null, "title": "Spacex News - Hayley Arceneaux To Be The Youngest American Woman In Space - Fintech Zoom", "description": "Spacex News - Hayley Arceneaux To Be The Youngest American Woman In Space -", "url": "https://fintechzoom.com/fintech_news_stock-market/spacex-news-hayley-arceneaux-to-be-the-youngest-american-woman-in-space/", "urlToImage": null, "publishedAt": "2021-03-07T19:50:05Z", "content": "29-year-old physician assistant and cancer survivor Hayley Arceneaux is the latest member to join SpaceXs all-civilian crew. Her age makes her the youngest American woman to ever go into spaceand tha… [+1880 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "Hubble Solves Mystery of Monster Star’s Dimming – Red Hypergiant Is As Bright as 300,000 Suns - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/hubble-solves-mystery-of-monster-stars-dimming-red-hypergiant-is-as-bright-as-300000-suns/", "urlToImage": null, "publishedAt": "2021-03-07T15:38:14Z", "content": "The red hypergiant VY Canis Majoris is enshrouded in huge clouds of dustStars come in an extraordinary range of sizes. One of the most colossal is VY Canis Majoris.\r\nIf placed in the middle of our so… [+6229 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "Animals Fake Death for Long Periods of Time to Escape Predators - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/animals-fake-death-for-long-periods-of-time-to-escape-predators/", "urlToImage": null, "publishedAt": "2021-03-07T14:39:14Z", "content": "Many animals feign death to try to escape their predators, with some individuals in prey species remaining motionless, if in danger, for extended lengths of time.\r\nCharles Darwin recorded a beetle th… [+2802 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comet Catalina’s Glowing Tail Indicates Comets Delivered Carbon to Rocky Planets - SciTechDaily", "description": "In early 2016, an icy visitor from the edge of our solar system hurtled past Earth. It briefly became visible to stargazers as Comet Catalina before it slingshot past the Sun to disappear forevermore out of the solar system. Among the many observatories that …", "url": "https://scitechdaily.com/comet-catalinas-glowing-tail-indicates-comets-delivered-carbon-to-rocky-planets/", "urlToImage": "https://scitechdaily.com/images/Oort-Cloud-Comet-Illustration-scaled.jpg", "publishedAt": "2021-03-07T13:27:54Z", "content": "Illustration of a comet from the Oort Cloud as it passes through the inner solar system with dust and gas evaporating into its tail. SOFIA’s observations of Comet Catalina reveal that it’s carbon-ric… [+4484 chars]"}, {"source": {"id": null, "name": "Fci Academy"}, "author": "Nancy Gilson, The Columbus Dispatch", "title": "Book review: 'The Code Breaker' is a fascinating look at a genetics discovery - The Columbus Dispatch", "description": "'The Code Breaker' is a captivating exploration of geneticist Jennifer Doudna's life, and her life-changing scientific discovery.", "url": "https://www.dispatch.com/story/entertainment/books/2021/03/07/books-code-breaker-fascinating-look-nobel-winners-genetic-discovery/6840829002/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/02/26/NCOD/c6fd6500-555f-47b3-8322-7fa8f6930dc0-code.jpg?auto=webp&crop=328,185,x0,y174&format=pjpg&width=1200", "publishedAt": "2021-03-07T13:26:52Z", "content": "When Jennifer Doudna and Emmanuelle Charpentier won the 2020 Nobel Prize in Chemistry, they became only the sixth and seventh women to do so; the first being Marie Curie in 1911.\r\nThe Nobel acknowled… [+4122 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "‘Space hurricane:’ Why March is wild month for space weather - Inverse", "description": "The Russell-McPherron effect causes us to experience enhanced space weather throughout the month of March.", "url": "https://www.inverse.com/science/space-hurricane-why-march-is-a-wild-month", "urlToImage": "https://imgix.bustle.com/uploads/getty/2021/3/5/ca400d9c-d309-4b22-9290-95177565c8d3-getty-1303998193.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-03-07T13:00:25Z", "content": "We're barely a week into March \r\nand already there are reports of bright aurorae, coronal mass ejections, and an alleged \"space hurricane.\"\r\nIt's hard to predict space weather, but scientists know th… [+5739 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Mark Bustos", "title": "‘Fungal Ghosts’: New Synthetic Melanin Can Shield from Radiation, Toxins - Science Times", "description": "A new study from Northwestern University in Illinois has synthesized a new form of melanin that could help shield the human skin and fabrics from toxins and radiation.", "url": "https://www.sciencetimes.com/articles/30026/20210307/fungal-ghosts-new-synthetic-melanin-shield-radiation-toxins.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/32383/cryptococcus-neoformans-using-a-light-india-ink-staining-preparation.jpg", "publishedAt": "2021-03-07T12:26:04Z", "content": "A new study from Northwestern University in Illinois has synthesized a new form of melanin that could help shield the human skin and fabrics from toxins and radiation.\r\nSelectively porous materials h… [+3326 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Matthew Warke", "title": "A billion years from now, a lack of oxygen will wipe out life on Earth - Space.com", "description": "", "url": "https://www.space.com/billion-years-from-now-oxygen-lack-wipes-out-life-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vgsWfq9pcZ4zbhz2HvkoX-1200-80.jpg", "publishedAt": "2021-03-07T12:22:02Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nMatthew Warke, Research Fellow, School of Earth… [+5623 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Chelsea Gohd", "title": "Mount Etna's fiery eruptions seen from space (satellite photos) - Livescience.com", "description": "Thar she blows!", "url": "https://www.livescience.com/mount-etna-volcano-eruption-2021-satellite-photos.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WrjKvwQDtAc6kkp7iYhroj-1200-80.jpg", "publishedAt": "2021-03-07T12:00:00Z", "content": "Mount Etna erupts, as seen from space on Feb. 18, 2021.  (Image credit: Landsat data from the U.S. Geological Survey)\r\nMount Etna has been spewing lava across Sicily for weeks during a series of erup… [+3266 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Video \"Perseverance\" robot moves to the surface of Mars for the first time - SwordsToday.ie", "description": "The U.S. space agency \"NASA\" announced on Friday that the probe \"Perseverance\" had succeeded in traveling a few meters on Mars for the first time since it", "url": "https://swordstoday.ie/video-perseverance-robot-moves-to-the-surface-of-mars-for-the-first-time/", "urlToImage": null, "publishedAt": "2021-03-07T07:56:58Z", "content": "The U.S. space agency “NASA” announced on Friday that the probe “Perseverance” had succeeded in traveling a few meters on Mars for the first time since it landed on the surface two weeks ago.\r\nThe si… [+2480 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Space Fans In France Told To Look Out For An Apricot-Sized Meteor That Fell To Earth - India Times", "description": "Last weekend, an apricot-sized meteorite fell to Earth in France and now space fans are being urged to find it. The space rock is estimated to weigh 150 gm and was captured plunging through the atmosphere by cameras at an astronomy education facility in Maura…", "url": "https://www.indiatimes.com/trending/social-relevance/apricot-sized-meteorite-in-france-535768.html", "urlToImage": "https://im.indiatimes.in/content/2021/Mar/meteor_60446605b794b.jpg", "publishedAt": "2021-03-07T07:10:58Z", "content": "Last weekend, an apricot-sized meteorite fell to Earth in France and now space fans are being urged to find it. \r\nThe space rock is estimated to weigh 150 gm and was captured plunging through the atm… [+1693 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Found: A Planet Close To Us With A Day That Lasts Forever And An Eternal Night Lit Up By Exploding Volcanoes - Forbes", "description": "The first evidence of global tectonic activity on a planet outside our Solar System.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/03/06/found-a-planet-close-to-us-with-a-day-that-lasts-forever-and-an-eternal-night-lit-up-by-exploding-volcanoes/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6040a9a00aab0d1751d3d0dc%2F0x0.jpg%3FcropX1%3D293%26cropX2%3D2486%26cropY1%3D254%26cropY2%3D1488", "publishedAt": "2021-03-07T03:00:00Z", "content": "This artists illustration represents the possible interior dynamics of the super-Earth exoplanet ... [+] LHS 3844b. The planet's interior properties and the strong stellar irradiation might lead to a… [+5720 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Viral: Massive flock of starlings form perfect bird shape as they fly over an Irish lake [WATCH] - Times Now", "description": "Crombie added that he had to take between 400 to 500 shots before finally capturing the perfect pictures.", "url": "https://www.timesnownews.com/the-buzz/article/viral-massive-flock-of-starlings-form-perfect-bird-shape-as-they-fly-over-an-irish-lake-watch/729096", "urlToImage": "https://imgk.timesnownews.com/story/Bird2.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-07T02:05:07Z", "content": "It was something that was too surreal and otherwordly to believe at first sight. Yet, it is all too real.\r\nPictures may confuse us but they share truths that are more simple, profound, and awe-inspir… [+1963 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Thomas Burghardt", "title": "Rocket Lab reveals reusable, medium-lift Neutron rocket - NASASpaceFlight.com - NASASpaceflight.com", "description": "To date, Rocket Lab has successfully introduced the first dedicated small satellite launch vehicle, Electron,…", "url": "https://www.nasaspaceflight.com/2021/03/rocket-lab-reveals-neutron/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/03/Neutron_Facts_LEO.png", "publishedAt": "2021-03-07T00:15:55Z", "content": "To date, Rocket Lab has successfully introduced the first dedicated small satellite launch vehicle, Electron, which CEO Peter Beck said would never be reusable. Then, the company successfully recover… [+8717 chars]"}, {"source": {"id": null, "name": "Somag News"}, "author": null, "title": "Astronauts do space walk to touch solar panels - Somag News", "description": "This Friday (5), astronauts from the International Space Station (ISS) concluded a space walk of almost seven hours to update the station's", "url": "https://www.somagnews.com/astronauts-do-space-walk-to-touch-solar-panels/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2021/03/Space.jpg", "publishedAt": "2021-03-06T20:56:07Z", "content": "This Friday (5), astronauts from the International Space Station (ISS) concluded a space walk of almost seven hours to update the station’s solar panels.\r\nKate Rubins, from NASA, and Soichi Noguchi, … [+974 chars]"}, {"source": {"id": null, "name": "Herald Sun"}, "author": null, "title": "How virtual reality gave family precious time together - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-03-06T09:01:14Z", "content": null}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "NASA’s Perseverance Rover successfully lands on Mars - TASS", "description": "NASA clarified that it had already received two images from the planet", "url": "https://tass.com/science/1258337", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20210219/1303761.jpg", "publishedAt": "2021-02-18T23:02:46Z", "content": "NEW YORK, February 19. /TASS/. The US Perseverance Rover has successfully touched down on Mars and sent two pictures back to Earth almost immediately, NASA reported Thursday.\r\n\"Touchdown confirmed,\" … [+799 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Arab world basks in the glory of UAE Mars mission triumph - Arab News", "description": "DUBAI: For months, the Hope probe’s journey to Mars had been tracked eagerly by the Arab news media. In the UAE, hoardings depicting the unmanned spacecraft (known in Arabic as Al-Amal) have been positioned along highways as part of the country’s 50th anniver…", "url": "https://www.arabnews.com/node/1806701", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/10/2466686-1441476290.jpg", "publishedAt": "2021-02-10T01:29:01Z", "content": "ROME / MEXICO CITY: Pope Francis, the head of the Roman Catholic Church, will become the first pontiff ever to set foot in Iraq, where he hopes to encourage the dwindling Christian community to remai… [+7142 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": "Leena Sharma", "title": "Half of coral population of Great Barrier Reef is over - Micky News", "description": "The largest coral reef in the world, the Great Barrier Reef, known for its diverse coral population and beauty, has been depleting in the past three decades. Mo", "url": "https://micky.com.au/half-of-coral-population-of-great-barrier-reef-is-over/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/10/shutterstock_1707128332-1.jpg", "publishedAt": "2020-10-15T19:44:24Z", "content": "In a study produced by the Royal Society, it is propounded that the primary cause of this depletion has been climate change and the rising temperature and sea levels.\r\nHow does it affect the Australi… [+2409 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Russian cosmonaut praises space rocket’s dependability during Soyuz’s emergency landing - TASS", "description": "The space rocket’s functions demonstrated their reliability during the emergency landing of the manned Soyuz MS-10 spacecraft, MS-10 Commander Alexei Ovchinin says", "url": "https://tass.com/science/1026162", "urlToImage": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20181016/1205089.jpg", "publishedAt": "2019-06-15T12:03:11Z", "content": "MOSCOW, October 16. /TASS/. The space rockets functions demonstrated their reliability during the emergency landing of the manned Soyuz MS-10 spacecraft, MS-10 Commander Alexei Ovchinin told RT Inter… [+1656 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 4 Mar 2021: Etna volcano, Pacaya, Fuego, Popocatépetl, Dukono, Krísuvík, Sabancaya, Pinatubo\r\n 16:00 PM | BY: VN\r\nEtna (Sicily, Italy): Less than 2 days after the previous lava fount… [+5729 chars]"}]}