{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Australian"}, "author": null, "title": "Magnetic disaster ‘that wiped out neanderthals’ is due a repeat - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-19T05:26:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Found a Way to Communicate With People Who Are Asleep And Dreaming - ScienceAlert", "description": "Scientists have identified a new phenomenon they describe as \"interactive dreaming\", where people experiencing deep sleep and lucid dreams are able to follow instructions, answer simple yes-or-no questions, and even solve basic mathematics problems.", "url": "https://www.sciencealert.com/people-can-answer-questions-and-even-do-math-problems-when-asleep-study-shows", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/sleeping_people_communication_cover_1024.jpg", "publishedAt": "2021-02-19T01:46:40Z", "content": "Scientists have identified a new phenomenon they describe as \"interactive dreaming\", where people experiencing deep sleep and lucid dreams are able to follow instructions, answer simple yes-or-no que… [+3808 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "First black hole ever detected is more massive than we thought - Science Daily", "description": "New observations of the first black hole ever detected have led astronomers to question what they know about the Universe's most mysterious objects. The research shows the system known as Cygnus X-1 contains the most massive stellar-mass black hole ever detec…", "url": "https://www.sciencedaily.com/releases/2021/02/210218142815.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-18T22:35:35Z", "content": "New observations of the first black hole ever detected have led astronomers to question what they know about the Universe's most mysterious objects.Published today in the journal Science, the researc… [+3811 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}