{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Mountains on neutron stars are not even a millimetre tall due to extreme gravity - The Register", "description": "According to simulations, anyway", "url": "https://www.theregister.com/2021/07/21/mountain_neutron_stars/", "urlToImage": "https://regmedia.co.uk/2020/07/01/star.jpg", "publishedAt": "2021-07-21T07:27:00Z", "content": "The gravitational field of neutron stars is so strong that so-called mountains poking out from their surfaces only grow to a fraction of a millimetre in height in simulations.\r\nWhen certain massive s… [+3063 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Tiny organisms shed big light on ocean nutrients - Phys.org", "description": "As the world warms, sweeping changes in marine nutrients seem like an expected consequence of increased ocean temperatures. However, the reality is more complicated. New research suggests that processes below the ocean surface may be controlling what is happe…", "url": "https://phys.org/news/2021-07-tiny-big-ocean-nutrients.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/tiny-organisms-shed-bi.jpg", "publishedAt": "2021-07-21T07:12:26Z", "content": "As the world warms, sweeping changes in marine nutrients seem like an expected consequence of increased ocean temperatures. However, the reality is more complicated. New research suggests that proces… [+4748 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "NASA marks 20 years of ISS spacewalks, but not all have been smooth sailing - Digital Trends", "description": "NASA is marking 20 years since one of its astronauts emerged for the first time from the International Space Station’s Quest airlock into the cold void of space.", "url": "https://www.digitaltrends.com/news/nasa-marks-20-years-of-astronaut-spacewalks-at-iss/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/nasa-spacewalk-2.jpg", "publishedAt": "2021-07-21T06:15:10Z", "content": "NASA is marking 20 years since one of its astronauts emerged for the first time from the International Space Stations Quest airlock into the cold void of space.\r\nThe historic spacewalk — or extravehi… [+2980 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Florina Spînu", "title": "Urwerk Watch Takes You to Space and Back, Mirrors NASA Space Shuttle Enterprise - autoevolution", "description": "On July 20th, 52 years ago, Neil Armstrong and Buzz Aldrin were putting their boots down on the Moon. Eight years later, on the same day, NASA was achieving space transportation for Earth-to-orbit crew and cargo with its Space Shuttle program. What better way…", "url": "https://www.autoevolution.com/news/urwerk-watch-takes-you-to-space-and-back-mirrors-nasa-space-shuttle-enterprise-165658.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/urwerk-watch-takes-you-to-space-and-back-mirrors-nasa-space-shuttle-enterprise-165658_1.jpg", "publishedAt": "2021-07-21T05:17:00Z", "content": "The Space Shuttle was a partially reusable low Earth orbital spacecraft system that was in service from 1981 to 2011. While the program has come to an end a decade ago, the Space Shuttle Enterprise, … [+1865 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "Fossil reveals burrowing lifestyle of tiny dino - Macau Business", "description": "A finger-sized fossil from 308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures", "url": "https://www.macaubusiness.com/fossil-reveals-burrowing-lifestyle-of-tiny-dino/", "urlToImage": null, "publishedAt": "2021-07-21T02:23:20Z", "content": "A finger-sized fossil from  308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures that may be the forerunners of reptiles, researc… [+3007 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "15,000 Year Old Viruses Found In Tibetan Glaciers By Researchers - Gizmodo Australia", "description": "Researchers have discovered a number of brand new viruses that are 15,000 years old in the glaciers of the Tibetan Plateau of China.", "url": "https://www.gizmodo.com.au/2021/07/15000-year-old-viruses-glaciers-tibet/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/07/21/GettyImages-1269800463-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-07-21T02:12:00Z", "content": "In news that would be far less terrifying if we weren’t living through a pandemic, scientists have discovered 15,000 year old viruses in some Tibetan glaciers. I simply cannot stress this enough: put… [+2442 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Belinda Sanders", "title": "Super-fast hendra test - Mornings - ABC News", "description": "A rapid point-of-care diagnostic test to detect Hendra infections in horses has been needed for decades.", "url": "https://www.abc.net.au/radio/southqld/programs/mornings/hendra-test/13463508", "urlToImage": "https://www.abc.net.au/cm/rimage/4155948-16x9-large.jpg?v=2", "publishedAt": "2021-07-21T01:52:38Z", "content": "Gatton based researchers are developing a kit that can detect the deadly Hendra virus in horses in under an hour.\r\nCurrently it takes a week for test results to be confirmed... but a new test, develo… [+244 chars]"}, {"source": {"id": null, "name": "Texasnewstoday.com"}, "author": "martinricker", "title": "NASA predicts that \"wobble\" in the moon's orbit could lead to record floods on Earth - Texasnewstoday.com", "description": "All coasts of the United States are facing rapidly increasing high-tide floods, thanks to the \"wobble\" of the lunar orbit, which works in tandem with climate-fueled rises. Sea level.. A new study rece", "url": "https://texasnewstoday.com/nasa-predicts-that-wobble-in-the-moons-orbit-could-lead-to-record-floods-on-earth/359902/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/07/13/d1eba35a-bca7-4da4-a4ae-5b428ead6929/thumbnail/1200x630/d68bb15705703c50def51513f77f2735/gettyimages-490700730.jpg", "publishedAt": "2021-07-21T01:49:07Z", "content": "All coasts of the United States are facing rapidly increasing high-tide floods, thanks to the “wobble” of the lunar orbit, which works in tandem with climate-fueled rises. Sea level..\r\nA new study re… [+3459 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Targeting Piezo1 protein may be a new and ideal strategy to cure multiple sclerosis - News-Medical.Net", "description": "In a new University of California, Irvine-led study, researchers found that a certain protein prevented regulatory T cells (Tregs) from effectively doing their job in controlling the damaging effects of inflammation in a model of multiple sclerosis (MS), a de…", "url": "https://www.news-medical.net/news/20210720/Targeting-Piezo1-protein-may-be-a-new-and-ideal-strategy-to-cure-multiple-sclerosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2021-07-21T01:31:00Z", "content": "In a new University of California, Irvine-led study, researchers found that a certain protein prevented regulatory T cells (Tregs) from effectively doing their job in controlling the damaging effects… [+3057 chars]"}, {"source": {"id": null, "name": "Nerdist"}, "author": null, "title": "MIT Engineers Program Robot to Help People with Disabilities - Nerdist", "description": "Engineers at MIT have programmed a robot arm that's able to help people with disabilities or limited mobility safely put on their clothes.", "url": "https://nerdist.com/article/mit-engineers-program-robot-to-help-people-with-disabilities/", "urlToImage": "https://nerdist.com/wp-content/uploads/2021/07/Robot-Clothing-Arm-feature-image-07202021.jpg", "publishedAt": "2021-07-20T23:52:39Z", "content": "Humanoid robots are already dancing, backflipping, and scaring the heck out of people all over the world. But, they still need a lot of work. Delicate motor skills often represent a challenge that ne… [+2136 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "MCG scientists find copper transporter as potential therapeutic target for cardiovascular diseases - News-Medical.Net", "description": "An internal transporter that enables us to use the copper we consume in foods like shellfish and nuts to enable a host of vital body functions also has the essential role of protecting the receptor that enables us to grow new blood vessels when ours become di…", "url": "https://www.news-medical.net/news/20210720/MCG-scientists-find-copper-transporter-as-potential-therapeutic-target-for-cardiovascular-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2021-07-20T23:45:00Z", "content": "An internal transporter that enables us to use the copper we consume in foods like shellfish and nuts to enable a host of vital body functions also has the essential role of protecting the receptor t… [+6035 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Miranda Bryant", "title": "‘Part-time adventurers’: amateur fossil hunters get record haul in Cotswolds - The Guardian", "description": "More than 1,000 scientifically significant specimens taken from former quarry after discovery", "url": "https://amp.theguardian.com/science/2021/jul/21/part-time-adventurers-amateur-fossil-hunters-get-record-haul-in-cotswolds", "urlToImage": null, "publishedAt": "2021-07-20T23:01:00Z", "content": "FossilsMore than 1,000 scientifically significant specimens taken from former quarry after discovery\r\nWed 21 Jul 2021 00.01 BST\r\nWhen Sally and Neville Hollingworth started going stir crazy in lockdo… [+4379 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Fun video showing what happens if you drop a ball on different planets! - SwordsToday.ie", "description": "Photo 鹤 槐: Pixels Expressive imageFollow RT An interesting animated planetary scientist who shows how fast an object falls on the surface of the Sun,", "url": "https://swordstoday.ie/fun-video-showing-what-happens-if-you-drop-a-ball-on-different-planets/", "urlToImage": "", "publishedAt": "2021-07-20T22:51:21Z", "content": "An interesting animated planetary scientist who shows how fast an object falls on the surface of the Sun, Earth, Jupiter, Moon and Pluto. Revealed by James O’Donoghue.\r\nAnimation shows a ball falling… [+1787 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Emirates Mars Mission Marks Busy First Year - MENAFN.COM", "description": "bai, UAE: The Emirates Mars Mission, the first interplanetary exploration undertaken by an Arab nation, tomorrow marked a year since the mission's lau", "url": "https://menafn.com/1102485418/Emirates-Mars-Mission-Marks-Busy-First-Year", "urlToImage": "https://menafn.com/updates/pr/2021-07/20/M_80593image_story.png", "publishedAt": "2021-07-20T22:40:18Z", "content": "( MENAFN - Mid-East.Info\r\nDu)bai, UAE: The Emirates Mars Mission, the first interplanetary exploration undertaken by an Arab nation, tomorrow marked a year since the mission's launch from Tanegashima… [+5889 chars]"}, {"source": {"id": null, "name": "Thedailyguardian.net"}, "author": "Martin Woolridge", "title": "Martian methane mystery deepens with lack of signals - thedailyguardian.net", "description": "Madrid, 20 July. (European Press) - The European Space Agency and Roscosmos's Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the", "url": "https://thedailyguardian.net/martian-methane-mystery-deepens-with-lack-of-signals/", "urlToImage": null, "publishedAt": "2021-07-20T22:21:20Z", "content": "Madrid, 20 July. (European Press) – \r\n The European Space Agency and Roscosmos’s Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the Martian atmosphere at New data collection… [+4330 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Just 7% of Human DNA Is Unique, Says Latest Large-scale Genetic Study - Ancient Origins", "description": "Among all the species of man that ever existed, Homo sapiens (modern man) is the sole survivor. But that doesn’t make us quite as special as we thought.", "url": "https://www.ancient-origins.net/news-evolution-human-origins/human-dna-0015599", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/human-DNA.jpg", "publishedAt": "2021-07-20T22:05:17Z", "content": "Among all the species of man that ever existed, Homo sapiens (modern man) is the sole survivor. But that doesnt make us quite as special as we thought. A genetic study carried out by researchers at t… [+6405 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Journey to the Center of Mars With the InSight Lander Team – NASA's Mars Exploration Program - NASA Mars Exploration", "description": "Scientists will talk about new findings in a question-and-answer session with the news media and public.", "url": "https://mars.nasa.gov/news/8992/journey-to-the-center-of-mars-with-the-insight-lander-team/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/8992_22116_PIA22743-16x9.jpeg", "publishedAt": "2021-07-20T22:00:26Z", "content": "Scientists will talk about new findings in a question-and-answer session with the news media and public.\r\nScientists working with NASA’s InSight Mars lander will share new results in a virtual discus… [+2422 chars]"}, {"source": {"id": null, "name": "Headlines of Today"}, "author": "PR Newswire", "title": "Utilis works in cooperation with Argentinian satellite firm for data used to protect natural resources - H ... - Headlines of Today", "description": "SAN DIEGO, July 20, 2021 /PRNewswire/ -- Utilis recently announced its collaboration with VENG, the Argentinian company that brings products and data derived from Satellites for Observation and Communication (SAOCOM) to market. Utilis, the world leader in sat…", "url": "https://www.headlinesoftoday.com/topic/press-releases/utilis-works-in-cooperation-with-argentinian-satellite-firm-for-data-used-to-protect-natural-resources.html/", "urlToImage": "https://c212.net/c/img/favicon.png", "publishedAt": "2021-07-20T21:31:00Z", "content": "SAN DIEGO, July 20, 2021 /PRNewswire/ — Utilis recently announced its collaboration with VENG, the Argentinian company that brings products and data derived from Satellites for Observation and Commun… [+2735 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Brad Bergan", "title": "Astrophysicists Say Our Universe Might Actually Be Finite - Interesting Engineering", "description": "We might live in a donut-shaped universe! While big if true, there is ample evidence to support the theory, despite it remaining unconfirmed.", "url": "https://interestingengineering.com/universe-finite-donut", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/rV6nWQm1wX/sizes/universe-finite-donut_md.jpg", "publishedAt": "2021-07-20T19:38:36Z", "content": "Navigating the universe may be more mind-bending than we thought.\r\nIf our universe takes the shape of a three-dimensional, finite donut, we can imagine a spacecraft traveling in one direction, and ev… [+3230 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Strong signals: Modeling the dynamics of cell differentiation in the development of bile ducts: Research may lead to an improved understanding of embryonic signaling pathways - Science Daily", "description": "Scientists employed a mathematical model to simulate the differentiation of epithelial cells based on signaling molecules from the liver's portal vein. This work may lead to new tools to better understand the very complicated signaling pathways involved in ce…", "url": "https://www.sciencedaily.com/releases/2021/07/210720114325.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-20T19:31:16Z", "content": "Scientists from the department of Anatomy and Embryology at the Faculty of Medicine of the University of Tsukuba created a computer model to simulate the development of complex structures based on th… [+2909 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Taylor Kubota-Stanford", "title": "Watch a bubble pop like a blooming flower - Futurity: Research News", "description": "High-speed cameras operating at 20,000 frames per second, over 300 times faster than a human eye, show how some bubbles pop like blooming flowers.", "url": "https://www.futurity.org/bubbles-physics-fluid-dynamics-2599422/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2021/07/bubbles-popping-physics-1600.jpg", "publishedAt": "2021-07-20T19:27:00Z", "content": "A new study using high-speed cameras and analytical modeling offers clues on how different kinds of bubbles form and eventually pop.\r\nThe oil industry, pharmaceutical companies, and bioreactor manufa… [+4155 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "ESA's Solar Orbiter Encounters Tail of Fragmented Comet ATLAS | Astronomy, Space Exploration - Sci-News.com", "description": "The long-period comet C/2019 Y4 (ATLAS) fragmented during its perihelion in April 2020. About two months later, ESA’s Solar Orbiter observed the dusty tail of the fragmented comet when the spacecraft was at a distance of approximately 0.5 AU from the Sun.", "url": "http://www.sci-news.com/astronomy/solar-orbiter-tail-fragmented-comet-atlas-09876.html", "urlToImage": "http://cdn.sci-news.com/images/2020/04/image_8374_2-Comet-ATLAS.jpg", "publishedAt": "2021-07-20T18:38:07Z", "content": "The long-period comet C/2019 Y4 (ATLAS) fragmented during its perihelion in April 2020. About two months later, ESAs Solar Orbiter observed the dusty tail of the fragmented comet when the spacecraft … [+3534 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Preston pony theft: Urgent appeal to find Shetland in need of medication - BBC News", "description": "Police say the pony is in need of daily medication and could suffer as a result of the heat.", "url": "https://www.bbc.com/news/uk-england-humber-57906346", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/174D0/production/_119504459_mediaitem119499298.jpg", "publishedAt": "2021-07-20T18:18:34Z", "content": "image copyrightHumberside Police\r\nimage captionThe pony is chestnut in colour with two distinctive white markings on his face and is about 40in tall, police said\r\nPolice fear a 33-year-old Shetland p… [+1200 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Frontiers", "title": "New Method Predicts 'Stealth' Solar Storms Before They Wreak Geomagnetic Havoc on Earth - Newswise", "description": "On 23 July 2012, humanity escaped technological and economic disaster. A diffuse cloud of magnetized plasma in the shape of a slinky toy tens of thousands of ki", "url": "https://www.newswise.com/articles/new-method-predicts-stealth-solar-storms-before-they-wreak-geomagnetic-havoc-on-earth", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2021-07-20T16:55:00Z", "content": "Newswise — On 23 July 2012, humanity escaped technological and economic disaster. A diffuse cloud of magnetized plasma in the shape of a slinky toy tens of thousands of kilometers across was hurled f… [+4468 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Suvrath Mahadevan and Sam Sholtis", "title": "Exoplanet discovery tool begins its mission - Phys.org", "description": "The NEID spectrometer, a new tool for the discovery of planets outside of our solar system, has now started its scientific mission at the WIYN 3.5m telescope at Kitt Peak National Observatory, Arizona.", "url": "https://phys.org/news/2021-07-exoplanet-discovery-tool-mission.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/from-the-sun-to-the-st.jpg", "publishedAt": "2021-07-20T16:22:11Z", "content": "The NEID spectrometer, a new tool for the discovery of planets outside of our solar system, has now started its scientific mission at the WIYN 3.5m telescope at Kitt Peak National Observatory, Arizon… [+5930 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Rebooted Hubble Telescope Wastes No Time, Captures Cool New Pics of Misfit Galaxies - Gizmodo Australia", "description": "It was looking grim there for a while, but Hubble is back in business after a computer glitch kept the...", "url": "https://www.gizmodo.com.au/2021/07/rebooted-hubble-telescope-wastes-no-time-captures-cool-new-pics-of-misfit-galaxies/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/07/21/e23524e9f4770682020142f6406d5021.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nrs=30", "publishedAt": "2021-07-20T15:50:00Z", "content": "It was looking grim there for a while, but Hubble is back in business after a computer glitch kept the space telescope offline for over a month. With no time to waste, the 31-year-old observatory is … [+2897 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Wistar Institute", "title": "Wistar Scientists Discovered Fundamental and Widespread Gene Expression Control Mechanism that Potentially Creates Proteins at Distinct Locations in the Cell, with Implications in Immunity and Cancers - Newswise", "description": "Alternative polyadenylation (APA) is an RNA processing mechanism that regulates gene expression by generating different ends on RNA transcripts of the same gene", "url": "https://www.newswise.com/articles/wistar-scientists-discovered-fundamental-and-widespread-gene-expression-control-mechanism-that-potentially-creates-proteins-at-distinct-locations-in-the-cell-with-implications-in-immunity-and-cancers", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/07/20/60f6dd22cb875_1 BinTianFinal.JPG&width=100&height=100", "publishedAt": "2021-07-20T14:30:00Z", "content": "Newswise — PHILADELPHIA — (July 20, 2021) — Alternative polyadenylation (APA) is an RNA processing mechanism that regulates gene expression by generating different ends on RNA transcripts of the same… [+4339 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Padilla", "title": "3D hohlraum model assists in indirect-drive implosions at NIF - Phys.org", "description": "Scientists from Lawrence Livermore National Laboratory (LLNL) and the Laboratory for Laser Energetics (LLE) have described a simple 3D model in hohlraums and capsules for inertial confinement fusion (ICF) implosions. The model will assist in delivering the re…", "url": "https://phys.org/news/2021-07-3d-hohlraum-indirect-drive-implosions-nif.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/3d-hohlraum-model-assi.jpg", "publishedAt": "2021-07-20T14:26:49Z", "content": "Scientists from Lawrence Livermore National Laboratory (LLNL) and the Laboratory for Laser Energetics (LLE) have described a simple 3D model in hohlraums and capsules for inertial confinement fusion … [+6752 chars]"}, {"source": {"id": null, "name": "Science X"}, "author": "Cristiane de Morais Smith", "title": "Can consciousness be explained by quantum physics? Research is closer to finding out - Science X", "description": "One of the most important open questions in science is how our consciousness is established. In the 1990s, long before winning the 2020 Nobel Prize in Physics for his prediction of black holes, physicist Roger Penrose teamed up with anaesthesiologist Stuart H…", "url": "https://sciencex.com/news/2021-07-consciousness-quantum-physics-closer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/can-consciousness-be-e.jpg", "publishedAt": "2021-07-20T14:26:15Z", "content": "One of the most important open questions in science is how our consciousness is established. In the 1990s, long before winning the 2020 Nobel Prize in Physics for his prediction of black holes, physi… [+6871 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Stephanie M. McPherson", "title": "Lockdowns reveal inequities in opportunities for walking activities - Phys.org", "description": "Lockdowns saved lives during the global SARS-CoV-2 pandemic. But as much as they have slowed the spread of COVID-19, there have been some unintended consequences.", "url": "https://phys.org/news/2021-07-lockdowns-reveal-inequities-opportunities.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/crosswalk.jpg", "publishedAt": "2021-07-20T14:20:48Z", "content": "Lockdowns saved lives during the global SARS-CoV-2 pandemic. But as much as they have slowed the spread of COVID-19, there have been some unintended consequences.\r\nNew MIT research shows that lockdow… [+7952 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Craig Hooper", "title": "Elon Musk And Other Space Players Are Building Up Navies As They Take Rocketry To Sea - Forbes", "description": "SpaceX, Blue Origin and even China are racing to move rocketry offshore, seeking looser regulatory oversight and the flexibility to launch from anywhere.", "url": "https://www.forbes.com/sites/craighooper/2021/07/20/challenges-and-opportunities-as-space-companies-build-navies/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60f5af4581a81aab4963132d%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D2000%26cropY1%3D141%26cropY2%3D1266", "publishedAt": "2021-07-20T13:53:17Z", "content": "A SpaceX autonomous booster recovery barge returns from a mission.\r\nSpaceX\r\nAs Jeff Bezos and Sir Richard Branson prepared to blast into space this month, Elon Musk looked to the sea, tweeting about … [+10592 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jack Lee", "title": "A new method produces improved surface strain rate maps - Phys.org", "description": "Earthquakes occur when tectonic strain that has gradually accumulated along a fault is suddenly released. Measurements of how much Earth's surface deforms over time, or the strain rate, can be used in seismic hazard models to predict where earthquakes might o…", "url": "https://phys.org/news/2021-07-method-surface-strain.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/sanandreasfa.jpg", "publishedAt": "2021-07-20T13:35:14Z", "content": "Earthquakes occur when tectonic strain that has gradually accumulated along a fault is suddenly released. Measurements of how much Earth's surface deforms over time, or the strain rate, can be used i… [+2945 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sara Cody", "title": "With the HUMANS project, a message that space is for everyone - Phys.org", "description": "When the Voyager 1 and Voyager 2 spacecraft launched in 1977, they each carried a Golden Record, a special project spearheaded by astrophysicist Carl Sagan, in addition to the scientific instruments necessary for their mission to explore the outer reaches of …", "url": "https://phys.org/news/2021-07-humans-message-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/with-the-humans-projec.jpg", "publishedAt": "2021-07-20T13:31:12Z", "content": "When the Voyager 1 and Voyager 2 spacecraft launched in 1977, they each carried a Golden Record, a special project spearheaded by astrophysicist Carl Sagan, in addition to the scientific instruments … [+4130 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "ExoMars orbiter continues hunt for key signs of life on Mars - Phys.Org", "description": "The ESA-Roscosmos Trace Gas Orbiter has set new upper limits on how much methane, ethane, ethylene and phosphine is in the martian atmosphere—four so-called 'biomarker' gases that are potential signs of life.", "url": "https://phys.org/news/2021-07-exomars-orbiter-key-life-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/exomars-orbiter-contin.jpg", "publishedAt": "2021-07-20T13:29:45Z", "content": "The ESA-Roscosmos Trace Gas Orbiter has set new upper limits on how much methane, ethane, ethylene and phosphine is in the martian atmospherefour so-called 'biomarker' gases that are potential signs … [+6551 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New X-ray pulsar discovered - Phys.org", "description": "Using ART-XC and eROSITA telescopes onboard the Spectrum Roentgen Gamma (SRG) mission, an international team of astronomers has detected a new pulsar. The newly found object, designated SRGA J204318.2+443815, turns out to be a long-period, faint X-ray pulsar …", "url": "https://phys.org/news/2021-07-x-ray-pulsar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/new-x-ray-pulsar-disco.jpg", "publishedAt": "2021-07-20T13:00:01Z", "content": "Using ART-XC and eROSITA telescopes onboard the Spectrum Roentgen Gamma (SRG) mission, an international team of astronomers has detected a new pulsar. The newly found object, designated SRGA J204318.… [+3487 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Supermassive black holes put a brake on star formation - Tech Explorist", "description": "A 20-year long debate has been resolved.", "url": "https://www.techexplorist.com/supermassive-black-holes-brake-star-formation/40123/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/07/Messier-101.jpg", "publishedAt": "2021-07-20T11:51:46Z", "content": "Several years of observations and theoretical modeling have helped astrophysicists better understand how gas collapses to form new stars in galaxies. But, not all galaxies are actively star-forming. … [+1894 chars]"}, {"source": {"id": null, "name": "Rbth.com"}, "author": "Boris Egorov", "title": "What did the first man on the Moon discover on his trip to the USSR? (PHOTOS) - Russia Beyond", "description": "Neil Armstrong met with Yury Gagari’s widow after the Soviet cosmonaut’s untimely passing. He was also the first foreigner to set foot in the hypersonic “Soviet Concord” and even had the opportunity to cook ukha soup on the shores of the Siberian “sea”.", "url": "https://www.rbth.com/history/334020-first-man-on-moon-ussr", "urlToImage": "https://cdni.rbth.com/rbthmedia/images/2021.07/article/60f6a39685600a484b7f4d03.jpg", "publishedAt": "2021-07-20T10:30:22Z", "content": "In the 1960s-1970s, It was difficult to find people more popular than cosmonauts and astronauts. As frontrunners in our exploration of space, they enjoyed colossal public attention and respect. And o… [+3944 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Study reveals mechanics behind bubbles popping - SlashGear", "description": "Researchers at Stanford University have conducted a study involving high-speed cameras to reveal how bubbles form and eventually burst. The study also used analytical modeling to reveal a new poppi…", "url": "https://www.slashgear.com/study-reveals-mechanics-behind-bubbles-popping-20683102/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/07/bubble-popping.jpg", "publishedAt": "2021-07-20T10:27:00Z", "content": "Researchers at Stanford University have conducted a study involving high-speed cameras to reveal how bubbles form and eventually burst. The study also used analytical modeling to reveal a new popping… [+1878 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Maxime MAMET", "title": "Bacteria enlisted in French push for rare earths autonomy - Yahoo Finance Australia", "description": "As Europe seeks to reduce its reliance on China for the rare earth metals needed for modern batteries and electronics, French researchers have found a...", "url": "https://au.finance.yahoo.com/news/bacteria-enlisted-french-push-rare-094346807.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ld5BJCv61y9_CQpxIxKjNw--~B/aD01MTI7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.au/46a3f27a618b5bffb695201c80c3a76a", "publishedAt": "2021-07-20T09:43:46Z", "content": "As Europe seeks to reduce its reliance on China for the rare earth metals needed for modern batteries and electronics, French researchers have found a potentially potent ally: bacteria that can help … [+3356 chars]"}, {"source": {"id": null, "name": "Singularity Hub"}, "author": "Shelly Fan", "title": "Protein Folding AI Is Making a 'Once in a Generation' Advance in Biology - Singularity Hub", "description": "For a simple protein, the RoseTTAFold algorithm was able to solve the structure using a gaming computer in about 10 minutes.", "url": "https://singularityhub.com/2021/07/20/new-protein-folding-ai-just-made-a-once-in-a-generation-advance-in-biology/", "urlToImage": "https://singularityhub.com/wp-content/uploads/2021/07/AI-generated-protein-structure.jpg", "publishedAt": "2021-07-20T07:00:19Z", "content": "Thanks to AI, we just got stunningly powerful tools to decode life.\r\nIn two back-to-back papers last week, scientists at DeepMind and the University of Washington described deep learning-based method… [+8705 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Urian B.", "title": "NASA Astronaut Shows 'Terminator Line' Through Endeavour's Window | Here's How it Looks Like - Tech Times", "description": "Shane Kimbrough, a NASA astronaut, shows what the \"terminator line\" looks like from the Endeavour's Window.", "url": "https://www.techtimes.com/articles/263091/20210720/nasa-astronaut-shows-terminator-line-through-endeavours-window-heres-how-it-looks-like.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/389325/nasa-astronaut-shows-terminator-line-through-endeavours-window-heres-how-it-looks-like.png", "publishedAt": "2021-07-20T05:00:00Z", "content": "NASA Astronaut Shows 'Terminator Line' Through Endeavour's Window | Here's How it Looks Like\r\n(Photo : Screenshot From Commons.Wikipedia.org) NASA Astronaut Shows 'Terminator Line' Through Endeavour'… [+3703 chars]"}, {"source": {"id": null, "name": "Griffith.edu.au"}, "author": null, "title": "Researchers develop tool for streamlined molecular weight analysis - Griffith News", "description": "World-first method streamlines process of identifying structure and molecular weight of compounds.", "url": "https://news.griffith.edu.au/2021/07/20/researchers-develop-tool-for-streamlined-molecular-weight-analysis/", "urlToImage": "https://news.griffith.edu.au/wp-content/uploads/2021/07/molecules-1818492_1920-1200x1080.jpg", "publishedAt": "2021-07-20T03:31:38Z", "content": "New world-first Griffith University-led research has streamlined the process of identifying the structure and molecular weight of compounds, which could have positive implications for scientists work… [+2806 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Phil Edwards", "title": "A new image shows jets of plasma shooting out of a supermassive black hole - The Conversation AU", "description": "Astronomers have taken a close-up look at the jets of plasma streaking away from a supermassive black hole - one of the strangest and most energetic features of galaxies.", "url": "https://theconversation.com/a-new-image-shows-jets-of-plasma-shooting-out-of-a-supermassive-black-hole-164709", "urlToImage": "https://images.theconversation.com/files/412048/original/file-20210720-19-ragc5m.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-07-20T02:49:00Z", "content": "In 2019, when astronomers captured the first image of a black holes shadow a bright orange doughnut-shaped halo created by the black holes intense gravity bending light around it it was rightly haile… [+5271 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Newly introduced butterfly could become widespread in Canada - Science Daily", "description": "This summer, if you see a butterfly with wings that are blue on top with orange spots underneath, you may have crossed paths with a male European Common Blue (or Polyommatus icarus), a newly introduced species in Canada. Could it be a fluke? Probably not, acc…", "url": "https://www.sciencedaily.com/releases/2021/07/210719110317.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-20T01:23:49Z", "content": "This summer, if you see a butterfly with wings that are blue on top with orange spots underneath, you may have crossed paths with a male European Common Blue (or Polyommatus icarus), a newly introduc… [+3747 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3526174", "title": "UNSW hosts National Science Week events | UNSW Newsroom - UNSW Newsroom", "description": "UNSW will play a key role in Australia's annual science celebration hosting several digital events.", "url": "https://newsroom.unsw.edu.au/news/science-tech/unsw-hosts-national-science-week-events-0", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/unsw_cfi-nsw_sciencewebbanner_1800x620_2.jpg", "publishedAt": "2021-07-20T01:08:16Z", "content": "UNSW will play a key role in Australia's annual science celebration hosting several digital events.UNSW Sydney will unpack some of the most extraordinary advances in science and technology influencin… [+3272 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists deconstruct the protein-based machine responsible for SARS-CoV-2 replication - News-Medical.net", "description": "In February 2020, a trio of bio-imaging experts were sitting amiably around a dinner table at a scientific conference in Washington, D.C., when the conversation shifted to what was then a worrying viral epidemic in China.", "url": "https://www.news-medical.net/news/20210719/Scientists-deconstruct-the-protein-based-machine-responsible-for-SARS-CoV-2-replication.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/6/Chem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2021-07-19T23:47:00Z", "content": "In February 2020, a trio of bio-imaging experts were sitting amiably around a dinner table at a scientific conference in Washington, D.C., when the conversation shifted to what was then a worrying vi… [+7218 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Physicists Get a Unique View of a Destroyed Comet - Gizmodo Australia", "description": "When C/2019 Y4 ATLAS fragmented in April 2020, many were dismayed at the loss of what would’ve been the brightest...", "url": "https://www.gizmodo.com.au/2021/07/physicists-get-a-unique-view-of-a-destroyed-comet/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/07/20/7e7b36d30f6fd61df75ce908b91d1edc.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nr=20", "publishedAt": "2021-07-19T20:33:00Z", "content": "When C/2019 Y4 ATLAS fragmented in April 2020, many were dismayed at the loss of what wouldve been the brightest comet since the 1997 passing of Hale-Bopp. But NASA and the European Space Agencys Sol… [+2825 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler", "title": "A Shockingly Small Percentage of Our DNA Is Uniquely 'Human', Study Finds - ScienceAlert", "description": "By now you might have heard the factoid that modern humans share a pretty large chunk of our genomes with bananas. But delving down much deeper, how much of our genome is uniquely Homo sapiens.", "url": "https://www.sciencealert.com/a-shockingly-small-percentage-of-our-dna-is-uniquely-human-study-finds", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/imansyah-muhamad-putera-n4KewLKFOZw-unsplash-cropped_1024.jpg", "publishedAt": "2021-07-19T18:01:17Z", "content": "By now you might have heard the factoid that modern humans share a pretty large chunk of our genomes with bananas. But delving down much deeper, how much of our genome is uniquely Homo sapiens.\r\nA ne… [+2992 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Cristiane de Morais Smith", "title": "Can consciousness be explained by quantum physics? My research takes us a step closer to finding out - The Conversation UK", "description": "New experiments could help scientists settle the longstanding debate about whether consciousness is generated by quantum activity.", "url": "https://theconversation.com/can-consciousness-be-explained-by-quantum-physics-my-research-takes-us-a-step-closer-to-finding-out-164582", "urlToImage": "https://images.theconversation.com/files/411896/original/file-20210719-25-191cj1c.jpeg?ixlib=rb-1.1.0&rect=53%2C359%2C6000%2C3000&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-07-19T17:08:15Z", "content": "One of the most important open questions in science is how our consciousness is established. In the 1990s, long before winning the 2020 Nobel Prize in Physics for his prediction of black holes, physi… [+6383 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Land Plants Changed The Way Earth Regulates Its Own Climate - Forbes", "description": "The arrival of plants on land about 400 million years ago may have changed the way the Earth naturally regulates its own climate.", "url": "https://www.forbes.com/sites/davidbressan/2021/07/19/land-plants-changed-the-way-earth-regulates-its-own-climate/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60f574cc64eefe43c5092d1e%2F0x0.jpg", "publishedAt": "2021-07-19T13:31:28Z", "content": "The ancient ancestors of all modern land plants - with 298,900 species among the most successful ... [+] life forms on Earth - resembled mosses.\r\nD.Bressan\r\nThe carbon cycle, the process through whic… [+3323 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Single-cell analysis enters the multiomics age - Nature.com", "description": "A rapidly growing collection of software tools is helping researchers to analyse multiple huge ‘-omics’ data sets.", "url": "https://www.nature.com/articles/d41586-021-01994-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-01994-w/d41586-021-01994-w_19363296.jpg", "publishedAt": "2021-07-19T12:31:51Z", "content": "Single-cell data (top) increasingly are being combined with spatial information (bottom).Credit: 10x Genomics\r\nIt takes about 20 days for a mouse to grow from fertilized egg to newborn pup. Ricard Ar… [+16258 chars]"}, {"source": {"id": null, "name": "FREE NEWS"}, "author": null, "title": "Neutron stars turned out to be smooth spheres, making them harder to track | FREE NEWS - FREE NEWS", "description": "Astrophysicists from the British Royal Astronomical Society (RAS) created a new model of the structure of the interior of neutron stars and found that stars of this type turned out to be almost perfectly spherical objects", "url": "https://freenews.live/neutron-stars-turned-out-to-be-smooth-spheres-making-them-harder-to-track/", "urlToImage": "https://freenews.live/wp-content/uploads/2021/07/neuron-star.jpg", "publishedAt": "2021-07-19T11:14:12Z", "content": "Astrophysicists from the British Royal Astronomical Society (RAS) created a new model of the structure of the interior of neutron stars and found that stars of this type turned out to be almost perfe… [+1457 chars]"}]}