{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Joey Roulette", "title": "NASA’s new Mars rover is about to spawn a tiny helicopter - The Verge", "description": "NASA’s Perseverance Mars rover is about to deploy the Ingenuity helicopter, a small rotorcraft that will attempt the first-ever flight of its kind on another planet.", "url": "https://www.theverge.com/2021/3/22/22345034/nasa-mars-rover-perseverance-ingenuity-helicopter", "urlToImage": "https://cdn.vox-cdn.com/thumbor/O8oNte2lpIQh_aepcq9QqZdvx-U=/0x216:1200x844/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22389539/middle_color_CROPPED.png", "publishedAt": "2021-03-22T22:10:37Z", "content": "The mini Ingenuity helicopter aims to become the first off-Earth rotorcraft\r\nIngenuitys debris shield lies beneath Perseverance\r\nNASA/JPL\r\nNASAs Perseverance rover is getting ready to deploy a mini-h… [+5343 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Fans prefer teams that built success over time more than with purchased super - Phys.Org", "description": "When a franchise buys a superstar like Tom Brady or LeBron James, the team tends to win more games. But do the fans follow? How much team loyalty is purchased along with an expensive star? Maybe not as much as some owners might hope—in the NBA Finals between …", "url": "https://phys.org/news/2021-03-fans-teams-built-success-super.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/fans.jpg", "publishedAt": "2021-03-22T20:40:42Z", "content": "When a franchise buys a superstar like Tom Brady or LeBron James, the team tends to win more games. But do the fans follow? How much team loyalty is purchased along with an expensive star? Maybe not … [+2739 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Fruit fly egg takes an active hand in its own growth, highlighting parallels to mammals - Phys.Org", "description": "A cast of so-called 'nurse cells' surrounds and supports the growing fruit fly egg during development, supplying the egg—or 'oocyte'—with all the nutrients and molecules it needs to thrive. Long viewed as passive in this process, the Drosophila egg actually p…", "url": "https://phys.org/news/2021-03-fruit-egg-growth-highlighting-parallels.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/fruitflyeggt.jpg", "publishedAt": "2021-03-22T20:37:22Z", "content": "A cast of so-called 'nurse cells' surrounds and supports the growing fruit fly egg during development, supplying the eggor 'oocyte'with all the nutrients and molecules it needs to thrive. Long viewed… [+5612 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mural shows earliest known record of salt being sold at a marketplace in the Maya region - Phys.org", "description": "The first documented record of salt as an ancient Maya commodity at a marketplace is depicted in a mural painted more than 2,500 years ago at Calakmul, a UNESCO World Heritage site in the Yucatan Peninsula in Mexico. In the mural that portrays daily life, a s…", "url": "https://phys.org/news/2021-03-mural-earliest-salt-sold-marketplace.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/worthonessalt.jpg", "publishedAt": "2021-03-22T20:24:10Z", "content": "The first documented record of salt as an ancient Maya commodity at a marketplace is depicted in a mural painted more than 2,500 years ago at Calakmul, a UNESCO World Heritage site in the Yucatan Pen… [+3321 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "This ‘Map of Life’ Shows Where Undiscovered Species May Be Lurking - Gizmodo Australia", "description": "Nine years ago, a team of Yale ecologists mapped out the world’s life, a project that showed biodiversity patterns in geographical context; basically, a heat map of animal life. Now, they’ve gone a step further: documenting the likeliest spots for unknown spe…", "url": "https://www.gizmodo.com.au/2021/03/this-map-of-life-shows-where-undiscovered-species-may-be-lurking/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/23/qskjlv1tiypiva4dsu9c-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-22T19:40:00Z", "content": "Nine years ago, a team of Yale ecologists mapped out the worlds life, a project that showed biodiversity patterns in geographical context; basically, a heat map of animal life. Now, theyve gone a ste… [+3799 chars]"}, {"source": {"id": null, "name": "Dcvelocity.com"}, "author": "DC Velocity Staff", "title": "A look into the future of robotics - DC Velocity", "description": "<p>Where does the robotics industry stand today? Which technologies are attracting the most user interest? What does the future hold with respect to new innovations and applications? To get some answers, we asked leading experts from companies participating i…", "url": "https://www.dcvelocity.com/articles/49989-a-look-into-the-future-of-robotics", "urlToImage": "https://www.dcvelocity.com/ext/resources/images/articles/2021/202103/20210322_primer_warehouse_robots.jpg?height=635&t=1616436866&width=1200", "publishedAt": "2021-03-22T19:36:51Z", "content": "Q: How do you view the current state of the robotics industry?\r\nChris Cacioppo 6 River Systems: The robotics industry is experiencing a boom as other verticals, including manufacturing and retail, ar… [+20569 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "To produce more food, scientists look to get more mileage out of plant enzymes - Phys.org", "description": "Enzymes play essential roles in the cells of every living thing, from bacteria, to plants to people. Some do their jobs a few times and fizzle out. Others can repeat a task hundreds of thousands of times before they quit.", "url": "https://phys.org/news/2021-03-food-scientists-mileage-enzymes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/plants.jpg", "publishedAt": "2021-03-22T19:00:06Z", "content": "Enzymes play essential roles in the cells of every living thing, from bacteria, to plants to people. Some do their jobs a few times and fizzle out. Others can repeat a task hundreds of thousands of t… [+3989 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Explosive origins of 'secondary' ice—and snow - Phys.org", "description": "Where does snow come from? This may seem like a simple question to ponder as half the planet emerges from a season of watching whimsical flakes fall from the sky—and shoveling them from driveways. But a new study on how water becomes ice in slightly supercool…", "url": "https://phys.org/news/2021-03-explosive-secondary-iceand.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/explosiveori.jpg", "publishedAt": "2021-03-22T19:00:04Z", "content": "Where does snow come from? This may seem like a simple question to ponder as half the planet emerges from a season of watching whimsical flakes fall from the skyand shoveling them from driveways. But… [+9536 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Morgan McFall-Johnsen", "title": "SpaceX hopes to launch and land a new prototype of its Starship mega-rocket this week. The last 3 exploded. - Business Insider Australia", "description": "Elon Musk wants SpaceX to build and fly fully reusable rockets and spaceships. But first, Starship prototypes have to stop exploding.", "url": "https://www.businessinsider.com.au/spacex-to-launch-starship-prototype-sn11-watch-live-2021-3", "urlToImage": "https://i.insider.com/60539162fe6a340019acf600?format=jpeg", "publishedAt": "2021-03-22T18:54:19Z", "content": "Starship launches have become a regular occurrence at SpaceX’s rocket-development facilities in Boca Chica, Texas. For the second time this month, the company is preparing to fly an advanced prototyp… [+2853 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "France 24", "title": "Natural soundscapes boost health markers, lower stress - FRANCE 24", "description": "", "url": "https://www.france24.com/en/live-news/20210322-natural-soundscapes-boost-health-markers-lower-stress", "urlToImage": "https://s.france24.com/media/display/b0cf0676-8b3a-11eb-8dbc-005056bff430/w:1280/p:16x9/660c47d2af57c1445b46dc1e882d1d92d653da09.jpg", "publishedAt": "2021-03-22T18:16:16Z", "content": "Washington (AFP)\r\nStressed out by the pandemic? \r\nSpending more time in green spaces might be just what the doctor ordered, according to a study that quantifies the health benefits of natural sounds,… [+3361 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Researchers tackle the 'spiders' from Mars - Science Daily", "description": "Researchers have been shedding light on the enigmatic 'spiders from Mars', providing the first physical evidence that these unique features on the planet's surface can be formed by the sublimation of CO2 ice.", "url": "https://www.sciencedaily.com/releases/2021/03/210322135227.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-22T18:04:02Z", "content": "Researchers at Trinity College Dublin have been shedding light on the enigmatic \"spiders from Mars,\" providing the first physical evidence that these unique features on the planet's surface can be fo… [+4384 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Kris Holt", "title": "Lego unveils a Space Shuttle Discovery and Hubble Telescope set - Yahoo Finance Australia", "description": "NASA worked with Lego on the 1:70 scale, 2,354-piece kit.", "url": "https://au.finance.yahoo.com/news/lego-space-shuttle-discovery-hubble-telescope-set-173117807.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/c231d970-8b30-11eb-9ffe-a49c7a0b5659", "publishedAt": "2021-03-22T17:34:10Z", "content": "-- EXPAREL is the first and only FDA-approved long-acting local analgesic for children aged six and over -- Conference call tomorrow at 8:30 a.m. ET -- PARSIPPANY, N.J., March 22, 2021 (GLOBE NEWSWIR… [+9638 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Electrode interphase formation - EurekAlert", "description": "Batteries charge and recharge--apparently all thanks to a perfect interplay of electrode material and electrolyte. However, for ideal battery function, the solid electrolyte interphase (SEI) plays a crucial role. Materials scientists have now studied nucleati…", "url": "https://www.eurekalert.org/pub_releases/2021-03/w-eif032221.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-22T17:26:57Z", "content": "Batteries charge and recharge--apparently all thanks to a perfect interplay of electrode material and electrolyte. However, for ideal battery function, the solid electrolyte interphase (SEI) plays a … [+3077 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "Bizarre Interstellar Object Is Likely From Another Solar System, New Study Says - IGN - IGN", "description": "An interstellar object previously thought to be from aliens might actually be a piece of a planet from a different solar system, a new study says.", "url": "https://www.ign.com/articles/bizarre-interstellar-object-is-likely-from-another-solar-system-new-study-says", "urlToImage": "https://assets1.ignimgs.com/2021/03/22/pia09113-orig-1616432258201.jpeg?width=1280", "publishedAt": "2021-03-22T17:11:11Z", "content": "An interstellar object previously believed by some to be from aliens might actually be a piece of planet from another solar system, according to a new study.A massive cigar-shaped object known as Oum… [+4131 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Detect Two New Polycyclic Aromatic Hydrocarbons in Interstellar Medium | Astronomy - Sci-News.com", "description": "Using data from the Robert C. Byrd Green Bank Telescope, astronomers have identified emission from two isomers of a small polycyclic aromatic hydrocarbon (PAH) called cyanonapthalene in the starless cloud core TMC-1, which is part of the interstellar Taurus M…", "url": "http://www.sci-news.com/astronomy/polycyclic-aromatic-hydrocarbons-interstellar-medium-09473.html", "urlToImage": "http://cdn.sci-news.com/images/2021/03/image_9473f-TMC-1-PAHs.jpg", "publishedAt": "2021-03-22T17:00:30Z", "content": "Using data from the Robert C. Byrd Green Bank Telescope, astronomers have identified emission from two isomers of a small polycyclic aromatic hydrocarbon (PAH) called cyanonapthalene in the starless … [+4206 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "This microscopic hitchhiker is a friend to both plants and humans - Science Magazine", "description": "Bacterial spores hitch a ride on other microbes to deliver critical antibiotics", "url": "https://www.sciencemag.org/news/2021/03/microscopic-hitchhiker-friend-both-plants-and-humans", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/flagella_1280p.jpg?itok=5xHGpNms", "publishedAt": "2021-03-22T16:45:00Z", "content": "By Elizabeth PennisiMar. 22, 2021 , 12:45 PM\r\nSoil bacteria called Streptomyces are the guardian angels of the microbial world: They produce antibiotics that humans depend on and protect plants from … [+1303 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Island In South East Asia May Hold The Key To Humanity's Interbreeding - IFLScience", "description": "People whose ancestry comes from Southeast Asia's eastern islands carry extensive evidence of interbreeding with Denisovans. There are, however, no such tr", "url": "https://www.iflscience.com/plants-and-animals/island-in-south-east-asia-may-hold-the-key-to-humanitys-interbreeding/", "urlToImage": "https://cdn.iflscience.com/images/ad7c9f4d-e4fc-5db2-83a8-9aced33d8d60/default-1616423417-homo-erectus.jpg", "publishedAt": "2021-03-22T16:34:00Z", "content": "People whose ancestry comes from Southeast Asia's eastern islands carry extensive evidence of interbreeding with Denisovans. There are, however, no such traces of three other members of the human fam… [+3972 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study finds that offshore pile driving noise alters feeding behaviors of longfin squid - Phys.org", "description": "With the offshore wind industry expanding in the United States and elsewhere, a new study raises questions about how the noise from impact pile driving to install turbine supports can affect feeding behaviors of longfin squid, a commercially and ecologically …", "url": "https://phys.org/news/2021-03-offshore-pile-noise-behaviors-longfin.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-studyfindsth.jpg", "publishedAt": "2021-03-22T16:15:40Z", "content": "With the offshore wind industry expanding in the United States and elsewhere, a new study raises questions about how the noise from impact pile driving to install turbine supports can affect feeding … [+3999 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Agricultural biodiversity: Different perceptions in science and practice - Science Daily", "description": "To minimize negative impacts of agriculture on biodiversity and related ecosystem services, 'biodiversity-friendly' management is needed. Why scientific results are rarely translated into agricultural practice could be explained by their different perceptions…", "url": "https://www.sciencedaily.com/releases/2021/03/210322112940.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-22T16:03:50Z", "content": "For the study, 209 farmers and 98 environmental scientists were asked how they perceive agricultural biodiversity and its management in Germany and Austria. \"The results show that the perceptions of … [+2381 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Michael Sheetz", "title": "SpaceX's Starlink satellite internet in talks for a place in the UK's $6.9 billion 'Project Gigabit' - CNBC", "description": "Elon Musk's SpaceX is in talks with the United Kingdom for Starlink to potentially earn funding from a $6.9 billion internet infrastructure program.", "url": "https://www.cnbc.com/2021/03/22/elon-musks-spacex-starlink-in-talks-with-uks-project-gigabit.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106827235-1611167269914-starlink_rural_canada_6.png?v=1611167356", "publishedAt": "2021-03-22T15:35:00Z", "content": "A Starlink user terminal being set up.\r\nElon Musk's SpaceX is in talks with the United Kingdom for the company's Starlink satellite unit to potentially to earn funding as a part of the government's n… [+4106 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Europe is starting to freak out about the launch dominance of SpaceX - Ars Technica", "description": "The Falcon 9 has come to dominate commercial satellite launches.", "url": "https://arstechnica.com/science/2021/03/european-leaders-say-an-immediate-response-needed-to-the-rise-of-spacex/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/37917_A4-760x380.jpg", "publishedAt": "2021-03-22T15:24:24Z", "content": "Enlarge/ Artist's view of the configuration of Ariane 6 using two boosters (A62) on the ELA-4 launch pad together with the system's mobile launch gantry.\r\n115 with 84 posters participating, including… [+3632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cells May Use “Fingers” to Communicate Instructions for Wound Closure - SciTechDaily", "description": "Researchers from Nara Institute of Science and Technology have broadened the known functions of an under-appreciated cell structure, with possible applications in wound closure and cancer therapy. What if you found out that you could heal using only a finger?…", "url": "https://scitechdaily.com/cells-may-use-fingers-to-communicate-instructions-for-wound-closure/", "urlToImage": "https://scitechdaily.com/images/Filopodia-Lattice-Light-Sheet-Microscopic-Images.jpg", "publishedAt": "2021-03-22T15:00:37Z", "content": "The lattice light sheet microscopic images of the filopodia by expressing the I-BAR domain protein MIM. The vesicles that were released by the scission of MIM-induced filopodia are highlighted by yel… [+3760 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Striking image highlights the entirety of galaxy Messier 106 - TechSpot", "description": "Also commonly called NGC 4258, the galaxy is similar in size and brightness to the Andromeda Galaxy but is much further away at more than 20 million...", "url": "https://www.techspot.com/news/88999-striking-image-highlights-entirety-galaxy-messier-106.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/03/2021-03-22-image-8.jpg", "publishedAt": "2021-03-22T14:38:00Z", "content": "In brief: The image you see above was captured by the Nicholas U. Mayall 4-meter Telescope at Kitt Peak National Observatory in Tucson, Arizona. It depicts what is perhaps the best photo to date of t… [+1228 chars]"}, {"source": {"id": null, "name": "Aero-mag.com"}, "author": null, "title": "NASA tests world's most powerful rocket set for moon missions - Aerospace Manufacturing", "description": "Aerospace Manufacturing magazine is a B2B publication covering the design, production and supply chain elements of the civil and defence aerospace sectors.", "url": "https://www.aero-mag.com", "urlToImage": null, "publishedAt": "2021-03-22T14:16:59Z", "content": ""}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "HORIBA Launches New Website Resource Centre Dedicated to Supporting Academia - AZoOptics.com", "description": "HORIBA UK Limited announces that it has reinforced its provision to Academia by launching a new dedicated resource center on its website.", "url": "https://www.azooptics.com/News.aspx?newsID=26694", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ThumbForNews_26694_16164197712181590.jpg", "publishedAt": "2021-03-22T13:33:00Z", "content": "Image Credit: fongbeerredhot/Shutterstock.com\r\nHORIBA UK Limited announces that it has reinforced its provision to Academia by launching a new dedicated resource center on its website. This is part o… [+2390 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Barry Fitzgerald", "title": "Faster fusion reactor calculations thanks to machine learning - Phys.org", "description": "Fusion reactor technologies are well-positioned to contribute to our future power needs in a safe and sustainable manner. Numerical models can provide researchers with information on the behavior of the fusion plasma, as well as valuable insight on the effect…", "url": "https://phys.org/news/2021-03-faster-fusion-reactor-machine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/plasma.jpg", "publishedAt": "2021-03-22T13:20:22Z", "content": "Fusion reactor technologies are well-positioned to contribute to our future power needs in a safe and sustainable manner. Numerical models can provide researchers with information on the behavior of … [+3783 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Atomic techniques reveal the evolution of a bacterial protein - Phys.org", "description": "Researchers show how bacteria have adapted a sensing mechanism that allows them to live in different environments.", "url": "https://phys.org/news/2021-03-atomic-techniques-reveal-evolution-bacterial.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/605889a4a81f1.jpg", "publishedAt": "2021-03-22T13:18:48Z", "content": "Researchers show how bacteria have adapted a sensing mechanism that allows them to live in different environments.\r\nA combination of an array of atomic-level techniques has allowed researchers to sho… [+3591 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Kate Wheeling", "title": "A Window into the Weather on Titan - Eos", "description": "Cassini’s final flybys of Saturn’s largest moon may have captured a temperature drop due to rainfall, one of the first observations of weather changes on Titan.", "url": "https://eos.org/articles/a-window-into-the-weather-on-titan", "urlToImage": "https://eos.org/wp-content/uploads/2021/03/titan_in_true_color.jpeg", "publishedAt": "2021-03-22T13:14:14Z", "content": "Its been 4 years since NASAs Cassini spacecraft flew by Titanthe spacecraft vaporized in Saturns atmosphere in 2017but the data collected on the 13-year mission are still yielding new information abo… [+4530 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UBCO researcher recommends systematic approach to forest and water supply management - EurekAlert", "description": "As World Water Day is observed around the globe, new research from UBC Okanagan suggests a systematic approach to forest and water supply research may yield an improved assessment and understanding of connections between the two.\r\nHealthy forests play a vital…", "url": "https://www.eurekalert.org/pub_releases/2021-03/uobc-urr031821.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/259613_web.jpg", "publishedAt": "2021-03-22T13:02:40Z", "content": "IMAGE: Dr. Adam Wei, professor of earth, environmental and geographic sciences, visits the Williston Reservoir near Fort St. John, B.C.\r\n view more \r\nCredit: UBCO\r\nAs World Water Day is observed arou… [+3524 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Chilean researchers investigate chemical composition of globular cluster NGC 6553 - Phys.org", "description": "Using the Very Large Telescope (VLT), astronomers from Chile have performed a chemical analysis of a sample of stars in the globular cluster NGC 6553. Results of this study, available in a paper published March 12 on the arXiv pre-print server, shed more ligh…", "url": "https://phys.org/news/2021-03-chilean-chemical-composition-globular-cluster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/chileanresea.jpg", "publishedAt": "2021-03-22T13:00:01Z", "content": "Using the Very Large Telescope (VLT), astronomers from Chile have performed a chemical analysis of a sample of stars in the globular cluster NGC 6553. Results of this study, available in a paper publ… [+3225 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "‘State Of The Planet’ Report Depicts Grim Future If We Are Unwilling To Change - Forbes", "description": "Human actions are threatening the resilience and stability of Earth's biosphere. This has profound implications for the development of our global civilization.", "url": "https://www.forbes.com/sites/davidbressan/2021/03/22/state-of-the-planet-report-depicts-grim-future-if-we-are-unwilling-to-change/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60588736acc891fd26af6420%2F0x0.jpg", "publishedAt": "2021-03-22T12:34:08Z", "content": "Climate change activist holding sign.\r\ngetty\r\nHuman actions are threatening the resilience and stability of Earth's biosphere. This has profound implications for the development of civilization, say … [+4426 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "12-year-old child genius accepted into College, wants to work at NASA - TweakTown", "description": "A 12-year-old child genius has already been accepted into College, and now wants to become a NASA engineer in the next 4 years.", "url": "https://www.tweaktown.com/news/78336/12-year-old-child-genius-accepted-into-college-wants-to-work-at-nasa/index.html", "urlToImage": "https://static.tweaktown.com/news/7/8/78336_01_12-year-old-wants-to-work-at-nasa-already-been-accepted-into-college_full.jpg", "publishedAt": "2021-03-22T12:32:01Z", "content": "A 12-year-old has announced that she has been accepted into college and is now on route to work as an engineer for NASA in the next four years.\r\nThe 12-year-old is named Alena Wicker, and has been ac… [+883 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Li Yuan", "title": "Researchers develop nanofiltration membrane for highly efficient dye/salt separation - Phys.org", "description": "A research group led by Prof. Wan Yinhua from the Institute of Process Engineering (IPE) of the Chinese Academy of Sciences has developed a robust, dually charged loose nanofiltration (NF) membrane for highly efficient dye/salt separation.  The study was publ…", "url": "https://phys.org/news/2021-03-nanofiltration-membrane-highly-efficient-dyesalt.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/54-researchersd.jpg", "publishedAt": "2021-03-22T11:45:28Z", "content": "A research group led by Prof. Wan Yinhua from the Institute of Process Engineering (IPE) of the Chinese Academy of Sciences has developed a robust, dually charged loose nanofiltration (NF) membrane f… [+2686 chars]"}, {"source": {"id": null, "name": "StreetInsider.com"}, "author": null, "title": "Reports of Poor Care by St. Vincent Hospital Replacement Nurses Pile Up as MNA Nurses Enter Third Week of Strike for Safer Patient Care - StreetInsider.com", "description": "WORCESTER, Mass., March 22, 2021 /PRNewswire/ --&Acirc;&nbsp;As the 800 striking nurses of St. Vincent Hospital move into their third week of an open-ended strike against Dallas-based Tenet Healthcare, local media, and staff...", "url": "https://www.streetinsider.com/PRNewswire/Reports+of+Poor+Care+by+St.+Vincent+Hospital+Replacement+Nurses+Pile+Up+as+MNA+Nurses+Enter+Third+Week+of+Strike+for+Safer+Patient+Care/18156914.html", "urlToImage": "http://www.streetinsider.com/images/silogo-new.png", "publishedAt": "2021-03-22T11:35:05Z", "content": "WORCESTER, Mass., March 22, 2021 /PRNewswire/ --Â As the 800 striking nurses of St. Vincent Hospital move into their third week of an open-ended strike against Dallas-based Tenet Healthcare, local me… [+11403 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Space debris removal demonstration launches - BBC News", "description": "A mission will aim to showcase methods for keeping space activity sustainable.", "url": "https://www.bbc.com/news/science-environment-56482726", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/FFCD/production/_117658456_launch.jpg", "publishedAt": "2021-03-22T11:32:17Z", "content": "Jonathan AmosScience correspondent@BBCAmoson Twitter\r\nimage copyrightGK Launch Services\r\nimage captionA wet morning launch for the Soyuz at Baikonur\r\nA Soyuz rocket has launched from the Baikonur cos… [+3959 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Researchers Discover Fossils Of A Unique ‘Eagle Shark’ That Glided Through Seas About 93 Million Years Ago! - Mashable India", "description": "There’s another new exciting news in the world of palaeontology! Scientists have recently discovered the full fossil of a unique ‘eagle shark’ that fed on plankton and glided through seas in northeastern Mexico about  93 million years ago.", "url": "https://in.mashable.com/science/21055/researchers-discover-fossils-of-a-unique-eagle-shark-that-glided-through-seas-about-93-million-years", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/25556/25556_gamp.jpg", "publishedAt": "2021-03-22T11:08:36Z", "content": "Theres another new exciting news in the world of palaeontology! Scientists have recently discovered the full fossil of a unique eagle shark that fed on plankton and glided through seas in northeaster… [+1880 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "The mysterious core of Mars is on the large side, NASA's InSight lander data suggests - Space.com", "description": "", "url": "https://www.space.com/insight-mission-mars-core-size-finding", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GKzpWVXyVysCqGwzhVgqBM-1200-80.jpeg", "publishedAt": "2021-03-22T11:00:27Z", "content": "NASA's InSight lander\r\n has spent more than a full Martian year stationed on the Red Planet, and scientists are pleased with the spacecraft's observations to date, despite the challenges Mars has pos… [+4802 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ashley P. Taylor", "title": "More than 50 new environmental chemicals detected in people - Livescience.com", "description": "The chemicals were discovered in a study of pregnant women and their newborns.", "url": "https://www.livescience.com/new-environmental-chemicals-pfas-pregnant-woment.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/A655UF75XbQUpXDeSmdHHE-1200-80.jpg", "publishedAt": "2021-03-22T11:00:00Z", "content": "Researchers have detected more than 50 new environmental chemicals lurking in people's bodies, the vast majority of which are little known or unknown compounds.\r\nThese chemicals which have never been… [+6622 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Spots a Peculiar Sight: Unusual Spiral Galaxy With a Heavy Arm - SciTechDaily", "description": "This week’s Hubble/ESA Picture of the Week features NGC 7678 — a galaxy located approximately 164 million light-years away in the constellation of Pegasus (The Winged Horse). With a diameter of around 115,000 light-years, this bright spiral galaxy is a simila…", "url": "https://scitechdaily.com/hubble-spots-a-peculiar-sight-unusual-spiral-galaxy-with-a-heavy-arm/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-7678.jpg", "publishedAt": "2021-03-22T10:36:01Z", "content": "Credit: ESA/Hubble &amp; NASA, A. Riess et al.\r\nThis week’s Hubble/ESA Picture of the Week features NGC 7678 — a galaxy located approximately 164 million light-years away in the constellation of Pega… [+593 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Tunable smart materials - Nanowerk", "description": "Researchers demonstrate tunable microparticles that can assemble into larger structures based on the content of attached chemical groups, which may lead to the development of smart sensors or self-healing materials.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57575.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57575.jpg", "publishedAt": "2021-03-22T10:22:47Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Timebulletin.com"}, "author": "Raeesa Sayyad", "title": "NASA successful hot-fire tests Space Launch System rocket that will support NASA’s Artemis astronaut ... - Time Bulletin", "description": "The Space Launch System rocket that will launch NASA's Artemis astronauts into space on their way to the moon went through a final and successful hot-fire test of the core stage on Thursday. The test occurred at NASA's Stennis Space Center external Bay St. Lo…", "url": "https://www.timebulletin.com/nasa-successful-hot-fire-tests-space-launch-system-rocket-that-will-support-nasas-artemis-astronauts-reach-the-moon/", "urlToImage": "https://www.timebulletin.com/wp-content/uploads/2021/03/NASA-successful-hot-fire-tests-Space-Launch-System-rocket-that-will-support-NASAs-Artemis-astronauts-reach-the-moon.jpg", "publishedAt": "2021-03-22T10:12:26Z", "content": "The Space Launch System rocket that will launch NASA’s Artemis astronauts into space on their way to the moon went through a final and successful hot-fire test of the core stage on Thursday.\r\nThe tes… [+5916 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "No threat to Earth as huge asteroid zooms past - Al Jazeera English", "description": "Asteroid 2001 FO32 makes its closest approach to Earth, giving astronomers the chance to study the rock as it passes.", "url": "https://www.aljazeera.com/news/2021/3/22/no-threat-to-earth-as-huge-asteroid-zooms-past", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/000_94T462.jpg?resize=1041%2C630", "publishedAt": "2021-03-22T09:33:05Z", "content": "The largest asteroid to pass by Earth this year has made its closest approach, posing no threat of a cataclysmic collision but giving astronomers a rare chance to study a rock formed during the begin… [+3387 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "RFI", "title": "Swiss kids suit up for 'Mission to Mars' - RFI", "description": "", "url": "https://www.rfi.fr/en/swiss-kids-suit-up-for-mission-to-mars", "urlToImage": "https://s.rfi.fr/media/display/c2666eca-8ae9-11eb-9c40-005056bf87d6/w:1280/p:16x9/fb93d8469c3a5f56e34cc2e29796028a61fe5b76.jpg", "publishedAt": "2021-03-22T08:39:22Z", "content": "Lausanne (AFP)\r\nLeo pulls on a shiny, silver suit and places the helmet gingerly over his head before marching with the other budding astronauts towards their spaceship.\r\n\"Going to Mars is really my … [+4397 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Former senator Bill Nelson who flew in space shuttle nominated by Biden to lead NASA - Firstpost", "description": "If confirmed by the Senate, Nelson – who currently serves as an advisor to NASA – will become the agency's 14th administrator.", "url": "https://www.firstpost.com/tech/science/former-senator-bill-nelson-who-flew-in-space-shuttle-nominated-by-biden-to-lead-nasa-9446421.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/03/Bill-Nelson_NASA.jpg", "publishedAt": "2021-03-22T04:01:15Z", "content": "The Associated PressMar 22, 2021 09:31:15 IST\r\nPresident Joe Biden has chosen a former senator from Florida who flew on the space shuttle right before the Challenger accident to lead NASA. Biden on F… [+3713 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Charlie Osborne", "title": "Popular remote lesson monitoring program could be exploited to attack student PCs - ZDNet", "description": "The vulnerabilities allowed attackers full and unfettered access to student PCs.", "url": "https://www.zdnet.com/article/popular-remote-student-learning-program-found-to-be-riddled-with-security-holes/", "urlToImage": "https://www.zdnet.com/a/hub/i/r/2021/03/19/9e96689b-fb45-4c57-8774-63274f282a37/thumbnail/770x578/35daea81946cefc7e8f09c1cb17336aa/screenshot-2021-03-19-at-09-40-22.png", "publishedAt": "2021-03-22T04:01:00Z", "content": "Researchers have uncovered a slew of critical vulnerabilities in remote monitoring software -- an incident made worse as it could impact student safety and privacy.  \r\nOn Monday, McAfee disclosed the… [+4158 chars]"}, {"source": {"id": null, "name": "Timebulletin.com"}, "author": "Raeesa Sayyad", "title": "Space peculiarity Oumuamua presumably shard of Pluto-like world, researchers say - Time Bulletin", "description": "Our solar system’s initially realized interstellar guest is neither a comet nor asteroid as first suspected and looks in no way like a cigar. A new study says the mystery object is likely a leftover of a Pluto-like world and formed like a cookie. Arizona Stat…", "url": "https://www.timebulletin.com/space-peculiarity-oumuamua-presumably-shard-of-pluto-like-world-researchers-say/", "urlToImage": "https://www.timebulletin.com/wp-content/uploads/2021/03/Space-peculiarity-Oumuamua-presumably-shard-of-Pluto-like-world-researchers-say.jpg", "publishedAt": "2021-03-22T03:26:01Z", "content": "Our solar systems initially realized interstellar guest is neither a comet nor asteroid as first suspected and looks in no way like a cigar. A new study says the mystery object is likely a leftover o… [+3380 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Cory Weinberg", "title": "A rat is causing 'apocalypse plague' in eastern Australia - Sprout Wired", "description": "An indifferent rat plague prevailed over the lives of citizens in Eastern Australia. There are mice in the cabinets. Mice on the streets. Thousands and", "url": "https://www.sproutwired.com/a-rat-is-causing-apocalypse-plague-in-eastern-australia/", "urlToImage": "https://www.sproutwired.com/wp-content/uploads/2021/03/A-rat-is-causing-apocalypse-plague-in-eastern-Australia.jpg", "publishedAt": "2021-03-22T00:35:10Z", "content": "An indifferent rat plague prevailed over the lives of citizens in Eastern Australia. There are mice in the cabinets. Mice on the streets. Thousands and thousands of rats in the barns …\r\nA farmer Inte… [+1739 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": "Staff Writers", "title": "USQ helps launch first private rocket test site in Australia - South Burnett Times", "description": "A partnership between the University of Southern Queensland and Rocket Technologies International led to engineers converting an old sandstone quarry into a rocket test site.", "url": "https://www.thechronicle.com.au/news/toowoomba/lockyer-rocket-test-site-gives-australia-leg-up-in-space-race/news-story/b125cb81eafd3bd9511ab36bc96735ed", "urlToImage": "https://media.apnarm.net.au/media/images/2021/03/22/v3imagesbin8d276be7a2be0e8752baf4c65beef608-237qwary5ch7xhmg2w2_ct1880x930.jpg", "publishedAt": "2021-03-21T23:30:00Z", "content": "In a giant leap for Australian space research, the first privately-owned, static rocket testing site has been developed in a partnership between Rocket Technologies International and the University o… [+3760 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "B. David Zarley", "title": "Researchers Have Grown a Mouse Embryo in a Bottle - Freethink", "description": "Researchers have grown a mouse embryo outside the uterus for longer than ever before, opening up the door to learning more about how mammals grow.", "url": "https://www.freethink.com/articles/mouse-embryo", "urlToImage": "https://www.freethink.com/media/pages/articles/mouse-embryo/2967211403-1616188485/mouse-embryo-opengraph-1200x630.jpg", "publishedAt": "2021-03-21T17:45:31Z", "content": "Building on seven years of previous research, scientists at Israel's Weizmann Institute of Science have now grown a mouse embryo in a bottle ex utero to the stage of developing organs and limbs. It i… [+5536 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "How James Webb will peer through a dusty cloud to study supermassive black hole - Digital Trends", "description": "NASA has shared a glimpse into the work the James Webb telescope will perform in a profile of research to be conducted on the nearby galaxy Centaurus A.", "url": "https://www.digitaltrends.com/news/james-webb-centaurus-a/", "urlToImage": "https://img.dtcn.com/image/digitaltrends/stsci-j-p2115a-f-1200x630-c-ar1.91.jpg", "publishedAt": "2021-03-21T17:05:20Z", "content": "Centaurus A sports a warped central disk of gas and dust, which is evidence of a past collision and merger with another galaxy. It also has an active galactic nucleus that periodically emits jets. It… [+3584 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Insanely beautiful image of the Milky Way took 12 years to complete - SlashGear", "description": "One look at the image below, and at a glance, it might appear to be something a digital artist created. It’s an actual image of the Milky Way, the galaxy we live in, created by a Finnish astr…", "url": "https://www.slashgear.com/insanely-beautiful-image-of-the-milky-way-took-12-years-to-complete-21664703/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/03/milky-way-12.jpg", "publishedAt": "2021-03-21T16:47:00Z", "content": "One look at the image below, and at a glance, it might appear to be something a digital artist created. It’s an actual image of the Milky Way, the galaxy we live in, created by a Finnish astrophotogr… [+1364 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lightning Strikes Played a Vital Role – Just As Important as Meteorites – in Life’s Origins on Earth - SciTechDaily", "description": "Lightning strikes were just as important as meteorites in creating the perfect conditions for life to emerge on Earth, geologists say. Minerals delivered to Earth in meteorites more than 4 billion years ago have long been advocated as key ingredients for the …", "url": "https://scitechdaily.com/lightning-strikes-played-a-vital-role-just-as-important-as-meteorites-in-lifes-origins-on-earth/", "urlToImage": "https://scitechdaily.com/images/Illustration-of-Early-Earth.jpg", "publishedAt": "2021-03-21T16:32:31Z", "content": "An illustration of early Earth, as it would have looked around 4 billion years ago. Credit: Lucy Entwisle\r\nLightning strikes were just as important as meteorites in creating the perfect conditions fo… [+4948 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rebecca Speare-Cole", "title": "Loud boom heard across four counties likely caused by meteor, experts say - Yahoo News Australia", "description": "Witnesses in parts of Devon, Dorset, Cornwall and Somerset heard the sonic boom at around 3pm on Saturday afternoon.", "url": "https://au.news.yahoo.com/loud-boom-heard-across-four-counties-revealed-meteor-144722280.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/885d1dc0-8a51-11eb-b7cd-c60172125e0e", "publishedAt": "2021-03-21T14:53:59Z", "content": "Ian Dryhurst was in his car in Jersey when he saw a 'bright light' shoot through the sky on Saturday afternoon. (SWNS)\r\nA loud boom that was heard across four counties was likely caused by a meteor, … [+3266 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "Meteor streaks over Cuba, briefly illuminates skies and causes explosion: Watch - Republic TV", "description": "Head of the National Seismological Service, Enrique Arango Arias, said service's instruments \"registered the expansive wave\" from meteor explosion.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/meteor-streaks-over-cuba-briefly-illuminates-skies-and-causes-explosion-watch.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/d56uzru7ygm5meyz_1616334650.jpeg?tr=f-jpeg", "publishedAt": "2021-03-21T14:47:00Z", "content": "A meteor in Santiago de Cuba that streaked across the night sky exploded, creating boom sounds as it entered the Earths atmosphere, residents and eyewitnesses reported. According to Cubas National Ce… [+1898 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Understanding how porphyry-type copper deposits are formed may lead to new resources - study - MINING.COM - MINING.com", "description": "UK-based researchers found the missing link in models that explain the formation of porphyry-type copper deposits.", "url": "https://www.mining.com/understanding-how-porphyry-type-copper-deposits-are-formed-may-lead-to-new-resources-study/", "urlToImage": "https://www.mining.com/wp-content/uploads/2021/03/Understanding-how-porphyry-type-copper-deposits-are-formed-may-lead-to-new-resources-study.jpg", "publishedAt": "2021-03-21T14:28:07Z", "content": "Their geology makes porphyry deposits rare, while most large near-surface examples have already been found. This means that understanding how and where they form can be of interest for mining compani… [+1699 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Bizarre, winged shark provides new clues about underwater flight • Earth.com - Earth.com", "description": "In a new study from CNRS, experts describe bizarre winged sharks that lived in the Gulf of Mexico 93 million years ago", "url": "https://www.earth.com/news/bizarre-winged-shark-provides-new-clues-about-underwater-flight/", "urlToImage": "https://cff2.earth.com/uploads/2021/03/21064240/shutterstock_4974947563-scaled.jpg", "publishedAt": "2021-03-21T12:51:25Z", "content": "In a new study from CNRS, experts describe winged sharks that lived in the Gulf of Mexico 93 million years ago. The newly discovered fossil species, Aquilolamna milarcae, had long and thin pectoral f… [+1687 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Vishal Tiwari", "title": "Melting glaciers in Alaska causing frequent earthquakes, study finds - Republic TV", "description": "Researchers have said that massive glacier loss in Alaska could be causing earthquakes with a magnitude of 5.0 or greater since the past century.", "url": "https://www.republicworld.com/world-news/us-news/melting-glaciers-in-alaska-causing-frequent-earthquakes-study-finds.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ocgzx4bylantrly4_1616326094.jpeg?tr=f-jpeg", "publishedAt": "2021-03-21T12:10:00Z", "content": "Researchers have said that massive glacier loss in Alaska could be causing earthquakes with a magnitude of 5.0 or greater since the past century. According to a recently published research article, s… [+1650 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": null, "title": "NASA Turns to College Students to Design New Suit Technology - Voice of America", "description": "Bradley University student Zach Bachmann didn’t grow up thinking he’d be an astronaut.\n\n“I’m short, blind and asthmatic, so I can’t really be an astronaut if I wished to,” he said.\n\nBut a lifelong interest in video games and computers is putting him at the ce…", "url": "https://www.voanews.com/science-health/nasa-turns-college-students-design-new-suit-technology", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/kaltura-video-thumbs/1_0/1_02gatgdj.jpg", "publishedAt": "2021-03-21T07:15:25Z", "content": "PEORIA, ILLINOIS - Bradley University student Zach Bachmann didnt grow up thinking hed be an astronaut.\r\nIm short, blind and asthmatic, so I cant really be an astronaut if I wished to, he said.\r\nBut … [+3776 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Antarctica news: 'Amazing level' of seafloor life discovered deep under broken off iceberg - Daily Express", "description": "ANTARCTICA scientists have uncovered a subterranean world teeming with life deep under the Brunt Ice Shelf. The researchers have published the world's very first images from the mysterious seafloor.", "url": "https://www.express.co.uk/news/science/1412561/antarctica-news-life-under-brunt-ice-shelf-polarstern-expedition-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1412561.jpg", "publishedAt": "2021-03-21T07:10:00Z", "content": null}, {"source": {"id": null, "name": "Bioedge.org"}, "author": null, "title": "Mouse embryos grown in vitro by Israeli researchers - BioEdge", "description": "Opens up possibility of organ harvesting", "url": "https://www.bioedge.org/bioethics/mouse-embryos-grown-in-vitro-by-israeli-researchers/13744", "urlToImage": "https://www.bioedge.org/images/2008images/Hatchery.jpeg_.jpg", "publishedAt": "2021-03-21T06:07:52Z", "content": "Another step in “an explosion of new techniques and ideas for studying early development” of human embryos comes from Israel, where researchers have successfully grown mouse embryos for 12 days, whic… [+1937 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "The largest asteroid flyby of the year is almost here: How to watch - CNET", "description": "It's flying by closer than the moon and could be the size of a building.", "url": "https://www.cnet.com/news/the-largest-asteroid-flyby-of-the-year-is-monday-how-to-watch/", "urlToImage": "https://cnet2.cbsistatic.com/img/5gJvvNme9g411l3xIeCyt49800I=/1200x630/2020/09/21/d044f9f6-d4b0-4996-997c-9fe52b0f616e/nasaasteroidillustration.jpg", "publishedAt": "2021-03-21T02:56:00Z", "content": "Asteroid 2021 EQ3 will pass closer than the moon.\r\nNASA/JPL-Caltech\r\nA particularly big asteroid will pass by Earth particularly close on Monday night, and the encounter will be streamed live online.… [+1920 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Isabella Beltran", "title": "Sperm Memory Helps in Embryotic Transfer of Non-DNA Coded Traits - Science Times", "description": "Research shows that sperm cells can transfer non-DNA coded information such as environmental signatures to embryos due to basic proteins.", "url": "https://www.sciencetimes.com/articles/30223/20210320/sperm-memory-embryotic-transfer-non-dna-coded-traits.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/32577/sperm-cells.jpg", "publishedAt": "2021-03-21T01:49:59Z", "content": "Studies in mammalian species have shown that sperm cells can pass down non-coded traits such as diet, weight, stress, and environmental effects from paternal dads to offsprings via embryonic fertiliz… [+3263 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Powerful Stratospheric Winds Measured On Jupiter For The First Time - Eurasia Review", "description": "Using the Atacama Large Millimeter/submillimeter Array (ALMA), in which the European Southern Observatory (ESO) is a partner, a team of astronomers have", "url": "https://www.eurasiareview.com/21032021-powerful-stratospheric-winds-measured-on-jupiter-for-the-first-time/", "urlToImage": "https://i2.wp.com/www.eurasiareview.com/wp-content/uploads/2021/03/c-122.jpg?fit=800%2C450&ssl=1", "publishedAt": "2021-03-21T00:22:37Z", "content": "Using the Atacama Large Millimeter/submillimeter Array (ALMA), in which the European Southern Observatory (ESO) is a partner, a team of astronomers have directly measured winds in Jupiter’s middle at… [+4745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Mars long ago was wet. You may be surprised where the water went - The Indian Express", "description": "Early in its history, Mars may have possessed liquid water on its surface approximately equivalent in volume to half of the Atlantic Ocean, enough to have covered the entire planet with water perhaps up to nearly a mile (1.5 km) deep.", "url": "https://indianexpress.com/article/technology/science/mars-water-minerals-eva-scheller-nasa-study-7233757/", "urlToImage": "https://images.indianexpress.com/2021/03/mars-water-exploration.jpg", "publishedAt": "2021-03-20T07:09:52Z", "content": "Mars was once a wet world, with abundant bodies of water on its surface. But this changed dramatically billions of years ago, leaving behind the desolate landscape known today. So what happened to th… [+2322 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": null, "title": "'Hear That?': NASA Releases Audio of Rover Driving Over Martian Surface - Chronicle", "description": "<p>A sound recording of NASA&rsquo;s Perseverance rover traveling across the surface of Mars on March 7 was released on March 17. NASA said more than 16 minutes of sound from the rover&rsquo;s 90-foot drive on March 7 were recorded. They said a microphone had…", "url": "https://www.thechronicle.com.au/news/national/hear-that-nasa-releases-audio-of-rover-driving-over-martian-surface/video/ad831674dcbaa5ce8d23a16171b1cf47?nk=768c9e89d837114551d889f3d4073404-1616446250", "urlToImage": null, "publishedAt": "2021-03-18T10:28:28Z", "content": "A sound recording of NASA’s Perseverance rover traveling across the surface of Mars on March 7 was released on March 17. NASA said more than 16 minutes of sound from the rover’s 90-foot drive on Marc… [+364 chars]"}]}