{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "NASA Mars helicopter survives first freezing -90C night on Mars - Yahoo News Australia", "description": "The four-pound Ingenuity helicopter was deployed on the surface by NASA’s Perseverance rover, having previously been attached to the rover’s belly.", "url": "https://au.news.yahoo.com/nasa-helicopter-160220954.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-04/3906da80-96f0-11eb-9ff0-aba13cda9733", "publishedAt": "2021-04-06T16:08:04Z", "content": "The helicopter hopes to become the first vehicle to make a powered flight on another planet. (NASA)\r\nA battery-powered NASA helicopter which hopes to become the first vehicle to make a powered flight… [+3265 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Our Stone Age Ancestors Were Apex Predators - Interesting Engineering", "description": "It turns out that humans switched to feeding on vegetables only after animals started becoming extinct towards the end of the stone age.", "url": "https://interestingengineering.com/our-stone-age-ancestors-were-apex-predators", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/9lwjDeb7GE/sizes/human-hunter_md.jpg", "publishedAt": "2021-04-06T15:59:52Z", "content": "There's an ongoing debate among today's humans about whether eating meat is ethically and/or environmentally right or not. A debate that would've made our stone-age ancestors crack up.\r\nA new study f… [+2188 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Watch Live: NASA Drops an Orion Spacecraft Into a Giant Pool - Gizmodo Australia", "description": "NASA is getting ready to drop a 6,350 kg mock-up of the Orion spacecraft into a large pool in Virginia, the latest in a series of drop tests leading up to the eventual Artemis II lunar mission. The test is set for 1:45 p.m. ET and will be viewable live...", "url": "https://www.gizmodo.com.au/2021/04/watch-live-nasa-drops-an-orion-spacecraft-into-a-giant-pool/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/07/hp7cmogptlzfk3wisrmb.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-06T15:21:00Z", "content": "NASA is getting ready to drop a 6,350 kg mock-up of the Orion spacecraft into a large pool in Virginia, the latest in a series of drop tests leading up to the eventual Artemis II lunar mission. The t… [+1507 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Tobi Thomas", "title": "#MainCharacter: pandemic brings TikTok self-parody to the fore - The Guardian", "description": "Why are young people imagining themselves as the protagonist in fictionalised versions of their lives?", "url": "https://amp.theguardian.com/technology/2021/apr/06/maincharacter-pandemic-brings-tiktok-self-parody-to-the-fore", "urlToImage": null, "publishedAt": "2021-04-06T14:35:00Z", "content": "TikTokWhy are young people imagining themselves as the protagonist in fictionalised versions of their lives?\r\nStaring longingly out of a window watching the sunset across the New York skyline, or sit… [+4670 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Investigating the interplay of topology and non-Hermitian physics with nonlinear effects - Phys.org", "description": "An international team of researchers has investigated the interplay of topology and non-Hermitian physics with nonlinear effects. In their paper published in the journal Science, the group describes contructing an optical waveguide lattice using a biased phot…", "url": "https://phys.org/news/2021-04-interplay-topology-non-hermitian-physics-nonlinear.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/606c4e31827cd.jpg", "publishedAt": "2021-04-06T13:30:01Z", "content": "An international team of researchers has investigated the interplay of topology and non-Hermitian physics with nonlinear effects. In their paper published in the journal Science, the group describes … [+2781 chars]"}, {"source": {"id": null, "name": "Globalbiotechinsights.com"}, "author": "IDTechEx", "title": "Ultrashort Peptides to a Long Way for Tissue Engineering - 3D Printing Progress", "description": "A printable hydrogel made of ultrashort peptides could help shape cells into viable tissues.", "url": "https://www.globalbiotechinsights.com/articles/23485/ultrashort-peptides-to-a-long-way-for-tissue-engineering", "urlToImage": "https://idtxs3.imgix.net/si/40000/80/D3.jpg?w=1200&h=627&fit=crop&crop=faces,entropy&q=50", "publishedAt": "2021-04-06T11:03:08Z", "content": "Global Biotechnology Insights\r\nA printable hydrogel made of ultrashort peptides could help shape cells into viable tissues. A new automated process prints a peptide-based hydrogel scaffold containing… [+2783 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "A safer way to deploy bacteria as environmental sensors - Nanowerk", "description": "Encapsulating modified bacteria in tough hydrogel spheres prevents them from spreading genes to other microbes.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57709.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57709.jpg", "publishedAt": "2021-04-06T10:30:51Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Lightning strikes to spark more Arctic fires: study - Global Times", "description": "Lightning strikes inside the Arctic circle may double this century, sparking widespread tundra fires and increasing the risk of setting off the carbon time bomb held within permafrost, new research showed Monday.", "url": "https://www.globaltimes.cn/page/202104/1220344.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-04-06/ed2da32c-1551-4b07-817c-f663faa68fdf.jpeg", "publishedAt": "2021-04-06T10:08:00Z", "content": "Lightning strikes inside the Arctic circle may double this century, sparking widespread tundra fires and increasing the risk of setting off the carbon time bomb held within permafrost, new research s… [+1170 chars]"}, {"source": {"id": null, "name": "Somag News"}, "author": null, "title": "Meteorite destroying dinosaurs created Amazon rainforest - Somag News", "description": "The origin of the Amazon, as well as modern tropical forests, may be a consequence of the impact of the large asteroid that fell", "url": "https://www.somagnews.com/meteorite-destroying-dinosaurs-created-amazon-rainforest/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2021/04/Meteoro.jpg", "publishedAt": "2021-04-06T09:58:55Z", "content": "The origin of the Amazon, as well as modern tropical forests, may be a consequence of the impact of the large asteroid that fell on Earth in the late Cretaceous period and extinguished the dinosaurs.… [+3046 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Separating beer waste into proteins for foods, and fiber for biofuels - Phys.org", "description": "Home brewing enthusiasts and major manufacturers alike experience the same result of the beer-making process: mounds of leftover grain. Once all the flavor has been extracted from barley and other grains, what's left is a protein- and fiber-rich powder that i…", "url": "https://phys.org/news/2021-04-beer-proteins-foods-fiber-biofuels.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/beerbrewing.jpg", "publishedAt": "2021-04-06T09:00:01Z", "content": "Home brewing enthusiasts and major manufacturers alike experience the same result of the beer-making process: mounds of leftover grain. Once all the flavor has been extracted from barley and other gr… [+4043 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Time to regulate AI that interprets human emotions - Nature.com", "description": "The pandemic is being used as a pretext to push unproven artificial-intelligence tools into workplaces and schools.", "url": "https://www.nature.com/articles/d41586-021-00868-5", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-00868-5/d41586-021-00868-5_19022884.jpg", "publishedAt": "2021-04-06T08:44:06Z", "content": "During the pandemic, technology companies have been pitching their emotion-recognition software for monitoring workers and even children remotely. Take, for example, a system named 4 Little Trees. De… [+5206 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Is Going To Crash A Probe Right Smack Dab Into An Asteroid For A Really Good Reason - Gizmodo Australia", "description": "NASA's Double Asteroid Redirection Test (DART) is all about potentially diverting dangerous asteroids from becoming meteors that hit Earth.", "url": "https://www.gizmodo.com.au/2021/04/nasa-is-going-to-crash-a-probe-right-smack-dab-into-an-asteroid-for-a-really-good-reason/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/05/kqcfaeqcxxyjpcroyu7g.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-06T07:51:00Z", "content": "Normally, NASA likes its probes to make contact with other objects in space in a very controlled manner. You want to land a rover on Mars, not drop a rover on Mars, for example. The Double Asteroid R… [+2648 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "How Scientists Use Hydrogen Gas, In Space And On Earth, To Measure The Big Bang - Forbes", "description": "Even 13.8 billion years after the Big Bang, we can reconstruct the first 3 minutes.", "url": "https://www.forbes.com/sites/startswithabang/2021/04/06/how-scientists-use-hydrogen-gas-in-space-and-on-earth-to-measure-the-big-bang/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F57acd29b4bbe6f092f7270f6%2F0x0.jpg", "publishedAt": "2021-04-06T06:00:00Z", "content": "The absorption lines at a variety of redshifts show that the fundamental physics and sizes of atoms ... [+] have not changed throughout the Universe, even as the light has redshifted due to its expan… [+15930 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Laura Revell", "title": "Climate explained: rising carbon emissions (probably) won't make the Earth uninhabitable - The Conversation AU", "description": "The Earth should be safe (and habitable) for a few billions of years, but we still need to worry about the impact now of just a few degrees of global warming.", "url": "https://theconversation.com/climate-explained-rising-carbon-emissions-probably-wont-make-the-earth-uninhabitable-155447", "urlToImage": "https://images.theconversation.com/files/389486/original/file-20210315-24-b9l6t3.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C6000%2C3000&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-04-06T04:48:28Z", "content": "CC BY-ND\r\nClimate Explained is a collaboration between The Conversation, Stuff and the New Zealand Science Media Centre to answer your questions about climate change.\r\nIf you have a question youd lik… [+4364 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "China's Mars Probe Just Sent Haunting Photos of The Red Planet - ScienceAlert", "description": "China's Mars probe, Tianwen-1, has been hanging around Mars in a parking orbit for nearly two whole months now, preparing for its rover landing in May.", "url": "https://www.sciencealert.com/we-can-t-get-enough-of-tianwen-1-s-new-latest-photos-of-mars", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/mars-cresc-head_1024.jpg", "publishedAt": "2021-04-06T02:40:34Z", "content": "China's Mars probe, Tianwen-1, has been hanging around Mars in a parking orbit for nearly two whole months now, preparing for its rover landing in May.\r\nBut it's not just sitting there in orbit twidd… [+1933 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Elon Musk Just Casually Confirmed Why the SpaceX SN11 Test Flight Exploded - Gizmodo Australia", "description": "SpaceX founder and CEO Elon Musk has confirmed that a methane leak is the cause for last week's SN11 test flight explosion.", "url": "https://www.gizmodo.com.au/2021/04/spacex-sn11-elon-musk-confirms-fuel-leak-caused-explosion/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/06/Screen-Shot-2021-04-06-at-10.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-06T01:12:00Z", "content": "SpaceX founder and CEO Elon Musk has finally revealed the cause of last week’s Starship SN11 malfunction after the prototype exploded into a massive fireball during a test flight on March 30.\r\nIn a t… [+3655 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Humans were apex predators for two million years, study finds: What did our ancestors eat during the stone age? Mostly meat - Science Daily", "description": "In a new study, researchers were able to reconstruct the nutrition of stone-age humans. The study's authors collected about 25 lines of evidence from about 400 scientific papers from different scientific disciplines, dealing with the focal question: Were ston…", "url": "https://www.sciencedaily.com/releases/2021/04/210405113606.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-05T23:21:59Z", "content": "Researchers at Tel Aviv University were able to reconstruct the nutrition of stone age humans. In a paper published in the American Journal of Physical Anthropology (Yearbook of Physical Anthropology… [+6763 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Compounds from Baltic Amber Could Help Fight Drug-Resistant Bacteria | Medicine - Sci-News.com", "description": "A team of researchers at the University of Minnesota Twin Cities has pinpointed compounds that help explain Baltic amber’s therapeutic effects and that could lead to new medicines to combat antibiotic-resistant bacteria such as Staphylococcus aureus.", "url": "http://www.sci-news.com/medicine/baltic-amber-compounds-09523.html", "urlToImage": "http://cdn.sci-news.com/images/2021/04/image_9523-Baltic-Amber.jpg", "publishedAt": "2021-04-05T21:16:25Z", "content": "A team of researchers at the University of Minnesota Twin Cities has pinpointed compounds that help explain Baltic ambers therapeutic effects and that could lead to new medicines to combat antibiotic… [+3177 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leah Burrows", "title": "Size of raindrops can help identify potentially habitable planets outside our solar system - Phys.org", "description": "One day, humankind may step foot on another habitable planet. That planet may look very different from Earth, but one thing will feel familiar—the rain.", "url": "https://phys.org/news/2021-04-size-raindrops-potentially-habitable-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/raindrops.jpg", "publishedAt": "2021-04-05T20:51:59Z", "content": "One day, humankind may step foot on another habitable planet. That planet may look very different from Earth, but one thing will feel familiarthe rain.\r\nIn a recent paper, Harvard researchers found t… [+3629 chars]"}, {"source": {"id": null, "name": "Shepherdgazette.com"}, "author": null, "title": "NASA's InSight lander detects two medium marsquakes on the Purple Planet - The Shepherd of the Hills Gazette", "description": "NASA's InSight lander on Mars has detected two more crisp quakes on the Red Planet, both stemming from the same region where the mission's previous best", "url": "https://shepherdgazette.com/nasas-insight-lander-detects-two-medium-marsquakes-on-the-purple-planet/", "urlToImage": "https://shepherdgazette.com/wp-content/uploads/2021/04/XV3GjhWCfJcuLxZEHF7Vin.jpeg", "publishedAt": "2021-04-05T17:41:34Z", "content": "NASA’s InSight lander on Mars has detected two more crisp quakes on the Red Planet, both stemming from the same region where the mission’s previous best observations originated.\r\nThe robotic geophysi… [+3039 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Carbon–“Survived Vast Journeys from Cold, Dark Molecular Clouds in the Interstellar Medium” - The Daily Galaxy --Great Discoveries Channel", "description": "Can all life as we know it be traced back to the interstellar medium (ISM)? This March 2021, Michael McCarthy, an astrochemist and Acting Deputy Director of  Harvard Center for Astrophysics (CfA), commented about the discovery of a vast, previously unknown re…", "url": "https://dailygalaxy.com/2021/04/carbon-backbone-of-life-on-earth-survived-vast-journeys-from-cold-dark-molecular-clouds-in-the-interstellar-medium/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2021/04/75990f96f330af52a0a0003972b043f886fdd063-interstellar-medium-e1617642451926.jpeg", "publishedAt": "2021-04-05T17:11:53Z", "content": "Can all life as we know it be traced back to the interstellar medium (ISM)? This March 2021, Michael McCarthy, an astrochemist and Acting Deputy Director of  Harvard Center for Astrophysics (CfA), co… [+7345 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Masks, ventilation stop COVID spread better than social distancing, study shows: The results indicate masks and proper ventilation may be key to allowing more capacity in schools, businesses and other indoor areas - Science Daily", "description": "A new study suggests that masks and a good ventilation system are more important than social distancing for reducing the airborne spread of COVID-19 in classrooms. The research comes at a critical time when schools and universities are considering returning t…", "url": "https://www.sciencedaily.com/releases/2021/04/210405123311.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-05T17:05:13Z", "content": "A new study from the University of Central Florida suggests that masks and a good ventilation system are more important than social distancing for reducing the airborne spread of COVID-19 in classroo… [+4701 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "\"Nuclear speckle\" structures inside cells enhance gene activity, may help block cancers - EurekAlert", "description": "A team led by scientists at the Perelman School of Medicine at the University of Pennsylvania has illuminated the functions of mysterious structures in cells called ''nuclear speckles,'' showing that they can work in partnership with a key protein to enhance …", "url": "https://www.eurekalert.org/pub_releases/2021-04/uops-ss033121.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-04-05T15:02:40Z", "content": "PHILADELPHIA - A team led by scientists at the Perelman School of Medicine at the University of Pennsylvania has illuminated the functions of mysterious structures in cells called \"nuclear speckles,\"… [+5638 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "This hydrogen fuel machine could be the ultimate guide to self-improvement - Phys.org", "description": "Three years ago, scientists at the University of Michigan discovered an artificial photosynthesis device made of silicon and gallium nitride (Si/GaN) that harnesses sunlight into carbon-free hydrogen for fuel cells with twice the efficiency and stability of s…", "url": "https://phys.org/news/2021-04-hydrogen-fuel-machine-ultimate-self-improvement.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/thishydrogen.jpg", "publishedAt": "2021-04-05T15:00:01Z", "content": "Three years ago, scientists at the University of Michigan discovered an artificial photosynthesis device made of silicon and gallium nitride (Si/GaN) that harnesses sunlight into carbon-free hydrogen… [+6919 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Burnt Chunk of SpaceX Falcon 9 Rocket Found on a Farmer’s Field in Washington - Gizmodo Australia", "description": "The failed deorbiting of a SpaceX Falcon 9 second stage late last month produced a spectacular light show over the Pacific Northwest, but the incident resulted in a large part of the rocket crashing onto a farmer’s field. The second stage was supposed to burn…", "url": "https://www.gizmodo.com.au/2021/04/burnt-chunk-of-spacex-falcon-9-rocket-found-on-a-farmers-field-in-washington/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/06/mcxbjlqnzjvgywr6abpv-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-05T14:46:00Z", "content": "The failed deorbiting of a SpaceX Falcon 9 second stage late last month produced a spectacular light show over the Pacific Northwest, but the incident resulted in a large part of the rocket crashing … [+3178 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Aleksandra Serebriakova. Sputnik International", "title": "'Football Field-Sized' Asteroid Hurtling Towards Earth at Nine Kilometres Per Second - Sputnik International", "description": "NASA’s Centre for Near Earth Object Studies closely monitors what's going on above our heads to gauge if there's anything we should be worried about in space, including...", "url": "https://sputniknews.com/science/202104051082547995-football-field-sized-asteroid-hurtling-towards-earth-at-nine-kilometres-per-second/", "urlToImage": "https://cdn2.img.sputniknews.com/images/107738/14/1077381411.jpg", "publishedAt": "2021-04-05T13:17:00Z", "content": null}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Ida Eriksen-U. Copenhagen", "title": "What if 70% of the universe isn't dark energy after all? - Futurity: Research News", "description": "The findings of a new paper suggest dark energy might not account for nearly 70% of the ever-accelerating, expanding universe.", "url": "https://www.futurity.org/dark-energy-dark-matter-universe-expansion-2543202-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2021/04/dark_matter_1600.jpg", "publishedAt": "2021-04-05T12:54:55Z", "content": "Researchers have tested a model that suggests the universe’s expansion is due to a dark substance with a kind of magnetic force, not dark energy.\r\nUntil now, researchers have believed that dark energ… [+3552 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "A Safe and Cheap Technology for the Disinfection of Packaged Eggs - AZoCleantech", "description": "Scientists from Russia have designed a secured, trustworthy, and cheap packed eggs surface disinfection technology. This technology helps destroy bacteria, such as salmonella, present on eggshells.", "url": "https://www.azocleantech.com/news.aspx?newsID=29188", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29188_1617627201191971.jpg", "publishedAt": "2021-04-05T12:52:00Z", "content": "Written by AZoCleantechApr 5 2021\r\nScientists from Russia have designed a safe and cheap packaged egg surface disinfection technology. This technology helps destroy bacteria, such as salmonella, pres… [+3369 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Morgan McFall-Johnsen", "title": "Astronauts on the space station just flew SpaceX's Crew Dragon to a new port - a first for the spaceship - Business Insider Australia", "description": "The International Space Station is getting crowded - SpaceX's Crew Dragon spaceship had to move to make room for yet another Dragon capsule.", "url": "https://www.businessinsider.com.au/astronauts-space-station-flew-spacex-crew-dragon-to-new-port-2021-4", "urlToImage": "https://i.insider.com/606b667fa7d803001963ecf4?format=jpeg", "publishedAt": "2021-04-05T12:09:00Z", "content": "SpaceX’s first full astronaut crew successfully maneuvered its Crew Dragon spaceship to a new port on the International Space Station on Monday. It was the first time the vehicle had attempted the ma… [+3564 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Spooky 'spiders on Mars' finally explained after two decades - Livescience.com", "description": "", "url": "https://www.livescience.com/spiders-on-mars-explained-dry-ice.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rnK6EamZfQVBXiQuBW6vFd-1200-80.jpg", "publishedAt": "2021-04-05T11:45:07Z", "content": "Ziggy played guitar\r\n, and scientists in the U.K. played with a big chunk of dry ice to try to figure out what's behind the strange alien patterns known as the \"spiders on Mars\r\n.\"\r\nThose patterns, v… [+3356 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA selects 9 scientists to join 2022 Korea Pathfinder Lunar Orbiter mission - Space.com", "description": "", "url": "https://www.space.com/nasa-joins-korea-pathfinder-lunar-orbiter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VXXNQUxipTnFJbsCQbncaj-1200-80.jpeg", "publishedAt": "2021-04-05T10:47:52Z", "content": "Nine U.S. scientists will join South Korea's first lunar orbiter mission launching next year. \r\nThe Korea Pathfinder Lunar Orbiter (KPLO) is scheduled to launch on a SpaceX Falcon 9 rocket\r\n in Augus… [+3613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvesting Energy From Radio Waves to Power Wearable Electronic Devices - SciTechDaily", "description": "From microwave ovens to Wi-Fi connections, the radio waves that permeate the environment are not just signals of energy consumed but are also sources of energy themselves. An international team of researchers, led by Huanyu \"Larry\" Cheng, Dorothy Quiggle Care…", "url": "https://scitechdaily.com/harvesting-energy-from-radio-waves-to-power-wearable-electronic-devices/", "urlToImage": "https://scitechdaily.com/images/Flexible-Self-Powered-Electronics.jpg", "publishedAt": "2021-04-05T05:38:32Z", "content": "An international team of researchers, led by Huanyu “Larry” Cheng, Dorothy Quiggle Career Development Professor in the Penn State Department of Engineering Science and Mechanics, has developed a stre… [+4664 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "A Crescent Moon Skims The Giant Planets During ‘International Dark Sky Week’: What You Can See In The Night Sky This Week - Forbes", "description": "Your stargazing highlights for the week ahead include Jupiter and Saturn in conjunction with the Moon, good views of the planet Mars and a first chance to glimpse the Milky Way galaxy.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/04/04/a-crescent-moon-skims-the-giant-planets-during-international-dark-sky-week-what-you-can-see-in-the-night-sky-this-week/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1004957944%2F0x0.jpg", "publishedAt": "2021-04-05T02:00:00Z", "content": "A crescent moon and the planet Venus set behind an American flag at sunset on July 15, 2018 in ... [+] Bayonne, New Jersey. (Photo by Gary Hershorn/Getty Images)\r\nGetty Images\r\nEach Monday I pick out… [+5344 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Season of Change in the Labrador Sea - nasa.gov - nasa.gov", "description": "The high-latitude region displays a beautiful palette of textures as the atmosphere interacts with the ice and water.", "url": "https://earthobservatory.nasa.gov/images/148141/season-of-change-in-the-labrador-sea", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/148000/148141/labrador_oli_2021086_th.jpg", "publishedAt": "2021-04-04T21:56:15Z", "content": null}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance Mars rover investigates 'odd' rock, zaps it with a laser - CNET", "description": "Scientists speculate the rock could be a meteorite or a far-flung chunk of Mars.", "url": "https://www.cnet.com/news/nasa-perseverance-mars-rover-looks-into-odd-rock-on-red-planet-zaps-it-with-laser/", "urlToImage": "https://www.cnet.com/a/img/NdWoVUtmIU96VMWdnBgzuSDoIjo=/1200x630/2021/03/31/c2ab3ad5-ca3d-438d-8e3e-522d5ccb969e/oddrock.jpg", "publishedAt": "2021-04-04T21:09:00Z", "content": "NASA's Perseverance rover snapped a view of this odd rock on March 28. If you look closely just to the right of center, you can see a series of tiny marks where the rover's laser zapped it.\r\nNASA/JPL… [+2403 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Chris Bergin", "title": "Starship SN15 prepares to rollout as Raptor testing ups a gear - NASASpaceFlight.com - NASASpaceflight.com", "description": "Just days after Starship SN11 conducted a fog-cloaked test flight that ended in an explosive…", "url": "https://www.nasaspaceflight.com/2021/04/starship-sn15-rollout-raptor-testing/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/04/NSF-2021-04-04-19-56-58-042.jpg", "publishedAt": "2021-04-04T19:45:43Z", "content": "Just days after Starship SN11 conducted a fog-cloaked test flight that ended in an explosive finale, SN15 is already in final preparations for a rollout down Highway 4 at SpaceX Starbase (Boca Chica)… [+9112 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "Video Shows NASA's Mars Rover Perseverance Landing on the Red Planet - Mental Floss", "description": "NASA’s latest Mars mission is progressing nicely after Perseverance survived its “seven minutes of terror.”", "url": "https://www.mentalfloss.com/article/642771/video-shows-nasas-mars-rover-perseverance-landing-red-planet", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1150,w_2048,x_0,y_288/v1614101949/shape/mentalfloss/642771-nasa-perseverance.png?itok=Wsfwd237", "publishedAt": "2021-02-23T19:34:46Z", "content": "On Thursday, February 18, the NASA rover Perseverance touched down on the surface of Mars after more than half a years journey through space. If youre wondering what that landing process looks like, … [+2681 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "AFP", "title": "UAE’s ‘Hope’ probe enters Mars orbit in first for Arab world - Prothom Alo English", "description": "The United Arab Emirates’ “Hope” probe on Monday successfully entered Mars’ orbit, making history as the Arab world’s first interplanetary mission", "url": "https://en.prothomalo.com/science-technology/science/uaes-hope-probe-enters-mars-orbit-in-first-for-arab-world", "urlToImage": "https://images.prothomalo.com/prothomalo-english%2F2021-02%2F8d0835f3-b068-4540-b66b-339cd104b216%2F649389_01_02.jpg?overlay=&overlay_position=bottom&overlay_opacity=1&w=1200&h=627&auto=format%2Ccompress&ogImage=true&overlay_width_pct=1", "publishedAt": "2021-02-10T04:59:55Z", "content": "Bigger objective\r\nWhile the probe is designed to provide a comprehensive image of the planets weather dynamics, it is also a step towards a much more ambitious goalbuilding a human settlement on Mars… [+1079 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Supermoons, Pink moon, and next full moon for 2021 - 7NEWS.com.au", "description": "Full moons always make for dramatic skywatching, but so-called “supermoons” are even more special because they appear a bit bigger and brighter than a typical full moon.", "url": "https://7news.com.au/technology/space/supermoon-and-full-moon-for-2021-c-1778764", "urlToImage": "https://images.s.7news.com.au/publication/C-1778764/33f8239d89e837019d80594d739b0a2b512ea7fa-16x9-x0y99w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T23:21:50Z", "content": "Full moons always make for dramatic skywatching, but so-called supermoons are even more special because they appear a bit bigger and brighter than a typical full moon.\r\nIts a full moon that coincides… [+2827 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "By MARI YAMAGUCHI | AP", "title": "Japan awaits spacecraft return with asteroid soil samples - Arab News", "description": "TOKYO: Japan’s space agency said the Hayabusa2 spacecraft successfully separated a capsule and sent it toward Earth to deliver samples from a distant asteroid that could provide clues to the origin of the solar system and life on our planet. The Japan Aerospa…", "url": "https://www.arabnews.com/node/1772786", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/12/05/2373551-1553701125.jpg", "publishedAt": "2020-12-05T08:32:19Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": "Leena Sharma", "title": "Half of coral population of Great Barrier Reef is over - Micky News", "description": "The largest coral reef in the world, the Great Barrier Reef, known for its diverse coral population and beauty, has been depleting in the past three decades. Mo", "url": "https://micky.com.au/half-of-coral-population-of-great-barrier-reef-is-over/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/10/shutterstock_1707128332-1.jpg", "publishedAt": "2020-10-15T19:44:24Z", "content": "In a study produced by the Royal Society, it is propounded that the primary cause of this depletion has been climate change and the rising temperature and sea levels.\r\nHow does it affect the Australi… [+2409 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Rare 'ring of fire' solar eclipse to dim Africa, Asia - Arab News", "description": "PARIS: Skywatchers along a narrow band from west Africa to the Arabian Peninsula, India and southern China will witness on Sunday the most dramatic “ring of fire” solar eclipse to shadow the Earth in years. Annular eclipses occur when the Moon — passing betwe…", "url": "https://www.arabnews.com/node/1692611", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/06/20/2154941-2039166004.jpg", "publishedAt": "2020-06-20T07:00:10Z", "content": "ANKARA: The Turkish government faced a tough challenge over the weekend after a video of Kursat Ayvatoglu, a member of the ruling Justice and Development Party (AKP), was publicized on social media w… [+4356 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "How to Watch SpaceX Demo2 Launch Live - Mental Floss", "description": "SpaceX is about to make company history when it launches its first crewed spacecraft for a mission to the International Space Station. Here are the best places to stream the event.", "url": "https://www.mentalfloss.com/article/624846/where-watch-spacex-demo2-launch-live", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1126,w_2000,x_0,y_52/v1590863778/shape/mentalfloss/624846-gettyimages-1235550243.jpg?itok=AcOGbgNx", "publishedAt": "2020-05-27T15:36:31Z", "content": "After scrubbing its original launch on May 27 due to bad weather, SpaceX will attempt to make history yet again today (May 30) when it launches its first crewed spacecraft from Cape Canaveral, Florid… [+1789 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "First Person on Mars Will Likely be a Woman, Says NASA Boss - Mental Floss", "description": "The human-led mission isn't expected to happen until at least 2030, but when it does, a woman will likely be the first person to set foot on the Red Planet.", "url": "https://www.mentalfloss.com/article/576854/first-person-on-mars-likely-a-woman", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1434,w_2544,x_0,y_266/v1552496782/shape/mentalfloss/539787-gettyimages-1010311954.jpg?itok=ow1drGGD", "publishedAt": "2019-11-04T11:36:45Z", "content": "In what is sure to be one giant leap for humankind, the head of NASA has announced that the first astronaut to set foot on Mars is likely to be female. As CNN reports, NASA administrator Jim Bridenst… [+1846 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "THE ASSOCIATE PRESS", "title": "Wary of climate change, Vanuatu villagers seek higher ground - Arab News", "description": "TAKARA, Vanuatu: Many people living in this coastal village in Vanuatu believe the March cyclone that sent waves surging through their homes was the latest and most dramatic sign of climate change. They are now considering rebuilding their entire community on…", "url": "https://www.arabnews.com/node/775586", "urlToImage": "https://www.arabnews.com/sites/default/files/2015/07/12/file-12-1436704181322814600.jpg", "publishedAt": "2019-09-01T05:25:14Z", "content": "MANILA: Philippine authorities have launched an investigation into the death of a 28-year-old man who was allegedly forced to do nearly 300 repetitions of a squat-like exercise after he flouted coron… [+3729 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AGENCE FRANCE PRESSE", "title": "'Lost world' found in remote Australia - Arab News", "description": "SYDNEY: An expedition to a remote part of northern Australia has uncovered three new vertebrate species isolated for millions of years, with scientists Monday calling the area a “lost world.”Conrad Hoskin from James Cook University and a National Geographic f…", "url": "https://www.arabnews.com/node/469143", "urlToImage": "https://www.arabnews.com/sites/default/files/media/29/10/2013/lost%20world.jpg", "publishedAt": "2019-08-30T05:49:22Z", "content": "DUBAI: A Dubai-based edutech start-up has launched a digital library for researchers in Saudi Arabia the first subscription-based library for scholarly literature of its kind in the Middle East and N… [+6515 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Mother of all photobombs? Twitter erupts as space station sneaks into snap of the eclipse - Arab News", "description": "DUBAI: As millions across the US gathered to watch an eclipse of the sun on Monday, one photographer noticed something unexpected — an International Space Station photobombed the shot. Millions of Americans gazed in wonder at the cosmic spectacle, with the be…", "url": "https://www.arabnews.com/node/1148891", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/08/22/975971-1708758572.jpg", "publishedAt": "2019-08-28T11:26:09Z", "content": "ANKARA: The Turkish government faced a tough challenge over the weekend after a video of Kursat Ayvatoglu, a member of the ruling Justice and Development Party (AKP), was publicized on social media w… [+4356 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Tablet found in modern-day Iraq shows Babylonians, not Greeks, developed trigonometry - Arab News", "description": "DUBAI: A 3,700-year-old clay tablet analyzed by researchers in Australia has proven that Babylonians, not Greeks, developed trigonometry. The tablet, known as Plimpton 332, was found in the early 1900s in modern-day southern Iraq but experts at the University…", "url": "https://www.arabnews.com/node/1150966", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/08/26/978701-1866980556.jpg", "publishedAt": "2019-08-27T15:11:56Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "160000 year-old remains of human relative found in Tibet - Arab News", "description": "NEW YORK: Nearly 40 years after it was found by a monk in a Chinese cave, a fossilized chunk of jawbone has been revealed as coming from a mysterious relative of the Neanderthals. Until now, the only known remains of these Denisovans were a few scraps of bone…", "url": "https://www.arabnews.com/node/1491231", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/05/02/1563666-719660114.jpg", "publishedAt": "2019-08-26T21:58:48Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "SpaceX launches hefty rocket with 24 satellites - Arab News", "description": "CAPE CANAVERAL, Florida: SpaceX launched its heftiest rocket with 24 research satellites Tuesday, a middle-of-the-night rideshare featuring a deep space atomic clock, solar sail, a clean and green rocket fuel testbed, and even human ashes. It was the third fl…", "url": "https://www.arabnews.com/node/1515921", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/06/25/1638671-1420294325.jpg", "publishedAt": "2019-08-26T21:37:52Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Antarctic sea ice in dizzying decline since 2014: study - Arab News", "description": "WASHINGTON: After mysteriously expanding for decades, Antarctica’s sea ice cover melted by an area four times greater than France in just a few years and now stands at a record low, according to a study published Monday. Scientists already knew Antarctica was…", "url": "https://www.arabnews.com/node/1519251", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/07/02/1648041-1728163684.jpg", "publishedAt": "2019-08-26T21:34:01Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Mariette le Roux and Laurence Coustal | AFP", "title": "Plane-sized 'void' discovered in Great Pyramid: scientists - Arab News", "description": "PARIS: A passenger plane-sized “void” has been discovered in the middle of the Great Pyramid of Egypt, where it has lain secret and untouched for 4,500 years, scientists revealed on Thursday. The space is one of four cavities, along with the king and queen’s …", "url": "https://www.arabnews.com/node/1187191", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/11/02/1025816-705365387.jpg", "publishedAt": "2019-08-26T19:16:53Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Tasmanian tiger doomed long before humans came along - Arab News", "description": "SYDNEY: The Tasmanian tiger was doomed long before humans began hunting the enigmatic marsupial, scientists said Tuesday, with DNA sequencing showing it was in poor genetic health for thousands of years before its extinction. Scientists genetically mapped the…", "url": "https://www.arabnews.com/node/1207691", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/12/12/1052031-1341624965.jpg", "publishedAt": "2019-08-26T13:13:23Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "REUTERS", "title": "Aliens, apocalypse, lightning? ... No, just a meteor rocking Michigan - Arab News", "description": "A bright meteor briefly swept across the sky over parts of the US Midwest and Canada on Tuesday, weather and geology agencies said, and then caused a powerful explosion that rattled homes and onlookers. The meteor was seen across the region in places such as …", "url": "https://www.arabnews.com/node/1227736", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/01/17/1077611-208936423.jpg", "publishedAt": "2019-06-24T13:16:41Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Underwater Robot Kills Reef Starfish - The Maritime Executive", "description": "An underwater drone that can accurately identify and fire an injection into crown-of-thorns starfish...", "url": "https://www.maritime-executive.com/article/underwater-robot-kills-reef-starfish", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Miscellaneous/qut-drone.79f19d.jpg", "publishedAt": "2018-09-01T23:23:00Z", "content": "By\r\nThe Maritime Executive \r\n09-01-2018 07:14:21 \r\nAn underwater drone that can accurately identify and fire an injection into crown-of-thorns starfish is ready to be put to the test on the Great Bar… [+2116 chars]"}, {"source": {"id": null, "name": "Billboard"}, "author": "Hilary Hughes", "title": "Elon Musk Says He's 'Inspired' by Kanye West at SXSW - Billboard", "description": null, "url": "https://www.billboard.com/articles/news/8240348/elon-musk-kanye-west-inspiration-sxsw", "urlToImage": "https://static.billboard.com/files/media/Elon-Musk-sxsw-2018-a-billboard-1548-compressed.jpg", "publishedAt": "2018-03-11T19:38:41Z", "content": "Elon Musk may be an innovator and icon for several South by Southwest festival attendees, but the engineer and tech magnate made it clear who he turns to for inspiration -- and it's one of the best i… [+403 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Deepwater ROV Ready for Scientific Discovery - The Maritime Executive", "description": "U.S.-based Schmidt Ocean Institute has completed tests of its new Remotely Operated Vehicle (ROV) SuBastian in the open ocean off the island of Guam", "url": "https://www.maritime-executive.com/article/deepwater-rov-ready-for-scientific-discovery", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/Cropped/Guam-SuBastian-rov%2016x9.jpg", "publishedAt": "2017-10-24T23:30:54Z", "content": "By\r\nThe Maritime Executive \r\n08-24-2016 08:58:22 \r\nU.S.-based Schmidt Ocean Institute has completed tests of its new Remotely Operated Vehicle (ROV) SuBastian in the open ocean off the island of Guam… [+1731 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 5 Apr 2021: Fuego volcano, Popocatépetl, Ibu, Dukono, Reventador, Sangay, Sinabung, Sakurajima\r\n 20:00 PM | BY: VN\r\nSakurajima (Kyushu, Japan): Volcanic Ash Advisory Center Tokyo (VA… [+2685 chars]"}]}