{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Ucsd.edu"}, "author": null, "title": "'Comet' Illustrates the Mechanical Process of Cancer Growth - UC San Diego Health", "description": "Tissues which consist largely of collagen were the focus of a recent collaborative study by a team from Stanford University and Purdue University. To accomplish their work, they used the Comet supercomputer at the San Diego Supercomputer Center at UC San Dieg…", "url": "https://ucsdnews.ucsd.edu/pressrelease/comet-illustrates-the-mechanical-process-of-cancer-growth", "urlToImage": "https://ucsdnews.ucsd.edu/news_uploads/PR20210302_cancer_growth_150.jpg", "publishedAt": "2021-03-02T21:52:53Z", "content": "Schematic of model system (left) and results of simulations showing deformation of collagen matrix (center and right) as cell undergoes division. Fcyto is constant inward force applied to the cell me… [+4342 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Step 2, Station: Space Laboratory as Testbed for Moon, Mars - NASA", "description": "Aboard the International Space Station, NASA scientists conduct research to help understand and manage the effects of extended stays in space.", "url": "https://www.nasa.gov/feature/step-2-station-space-laboratory-as-testbed-for-moon-mars/", "urlToImage": "/sites/default/files/thumbnails/image/jessica-meir-life-sciences-glovebox-main.jpg", "publishedAt": "2021-03-02T21:38:58Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists use forest color to gauge permafrost depth - Phys.org", "description": "Scientists regularly use remote sensing drones and satellites to record how climate change affects permafrost thaw rates—methods that work well in barren tundra landscapes where there's nothing to obstruct the view.", "url": "https://phys.org/news/2021-03-scientists-forest-gauge-permafrost-depth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/9-scientistsus.jpg", "publishedAt": "2021-03-02T21:16:21Z", "content": "Scientists regularly use remote sensing drones and satellites to record how climate change affects permafrost thaw ratesmethods that work well in barren tundra landscapes where there's nothing to obs… [+4681 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "UMD study finds the fuel efficiency of one car may be cancelled by your next car purchase - Newswise", "description": "In a recent collaborative study led by the University of Maryland (UMD), researchers find that consumers tend to buy something less fuel efficient than they nor", "url": "https://www.newswise.com/articles/umd-study-finds-the-fuel-efficiency-of-one-car-may-be-cancelled-by-your-next-car-purchase", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2021-03-02T20:50:00Z", "content": "Newswise — In a recent collaborative study led by the University of Maryland (UMD), researchers find that consumers tend to buy something less fuel efficient than they normally would for their second… [+4781 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "How Did the Chaos of Chemicals Become Ordered Biology at the Dawn of Life on Earth? - Newswise", "description": "By pursuing biochemical answers to how life on Earth began, UNC-Chapel Hill scientists hope to enhance our understanding of important cellular processes to open", "url": "https://www.newswise.com/articles/how-did-the-chaos-of-chemicals-become-ordered-biology-at-the-dawn-of-life-on-earth", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/03/2/carterresearchgraphic.png&width=100&height=100", "publishedAt": "2021-03-02T20:15:00Z", "content": "Newswise — CHAPEL HILL, NC – About four billion years ago, life arose from a primordial soup of chemicals. Somehow, amino acids linked together to form proteins, and from these proteins, the basic mo… [+6730 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Yahoo News Video", "title": "Fossils of oldest member of huge dinosaur group found in Argentina - Yahoo Finance Australia", "description": "Scientists have unearthed in Argentina's Patagonian wilderness fossils of what may be the oldest-known member of the dinosaur group known as titanosaurs that...", "url": "https://news.yahoo.com/fossils-oldest-member-huge-dinosaur-200015360.html", "urlToImage": "https://s.yimg.com/hd/cp-video-transcode/prod/2021-03/02/603e99519505d732ff6859d6/603e99519505d732ff6859d7_o_U_v2.jpg", "publishedAt": "2021-03-02T20:09:11Z", "content": "British Prime Minister Boris Johnson says it is the \"right time\" for the United Kingdom and Ireland to launch a bid to host the 2030 soccer World Cup.And nearly $4 million dollars are due to be set a… [+1258 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Emma Pollard", "title": "Sir Thomas Brisbane Planetarium curator Mark Rigby retires but stargazing will never end - ABC News", "description": "After 36 years at the helm of the Sir Thomas Brisbane Planetarium, well-known curator and passionate space enthusiast Mark Rigby says his attention is turning towards Earth.", "url": "https://www.abc.net.au/news/2021-03-03/sir-thomas-brisbane-planetarium-curator-mark-rigby-retires/13183046", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/190779c03ba9dce74610a4b9b30a519a?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2021-03-02T20:02:45Z", "content": "After 36 years at the helm of the Sir Thomas Brisbane Planetarium, well-known curator and passionate space enthusiast Mark Rigby is retiring.\r\nThroughout his career under the cosmic skydome at Mount … [+4312 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "Renaissance-era letter sealed for centuries just virtually unfolded and read for the first time - Livescience.com", "description": "X-ray scans and digital reconstructions unlocked long-sealed documents.", "url": "https://www.livescience.com/sealed-renaissance-letter-virtually-unfolded.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/C9cDup5fHYJHtqcY6Tk7KK-1200-80.gif", "publishedAt": "2021-03-02T19:53:20Z", "content": "More than 600 years ago, someone intricately folded, sealed and posted a letter that was never delivered. Now, scientists have digitally \"unfolded\" this and other similarly locked letters found in a … [+4273 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "Jupiter has Added a Comet to its Trojan Collection - Universe Today", "description": "Jupiter is notorious for capturing objects that venture too close to the gas giant and its enormous pull of gravity. Asteroids known as Jupiter Trojans are a large group of space rocks that have been snared by the planet, which usually remain in a stable orbi…", "url": "https://www.universetoday.com/150359/jupiter-has-added-a-comet-to-its-trojan-collection/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/STScI-H-p2105a-f-703x479-1.jpg", "publishedAt": "2021-03-02T19:42:04Z", "content": "Jupiter is notorious for capturing objects that venture too close to the gas giant and its enormous pull of gravity. Asteroids known as Jupiter Trojans are a large group of space rocks that have been… [+3899 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Covering metal catalyst surfaces with thin two-dimensional oxide materials can enhance chemical reactions - Science Daily", "description": "Scientists have discovered that physically confined spaces can make for more efficient chemical reactions.", "url": "https://www.sciencedaily.com/releases/2021/03/210302130630.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-02T19:36:23Z", "content": "Physically confined spaces can make for more efficient chemical reactions, according to recent studies led by scientists from the U.S. Department of Energy's (DOE) Brookhaven National Laboratory. The… [+11746 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Astrophysicist's 2004 theory confirmed: Why the Sun's composition varies - Science Daily", "description": "An astrophysicist theorized why the chemical composition of the Sun's tenuous outermost layer differs from that lower down. His theory has recently been validated by combined observations of the Sun's magnetic waves from the Earth and from space.", "url": "https://www.sciencedaily.com/releases/2021/03/210302130711.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-02T19:34:47Z", "content": "About 17 years ago, J. Martin Laming, an astrophysicist at the U.S. Naval Research Laboratory, theorized why the chemical composition of the Sun's tenuous outermost layer differs from that lower down… [+3246 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "New research indicates the whole universe could be a giant neural network - The Next Web", "description": "The core idea is deceptively simple: every observable phenomenon in the entire universe can be modeled by a neural network. And that means, by extension, the universe itself may be a neural network. Vitaly Vanchurin, a professor of physics at the University o…", "url": "https://thenextweb.com/neural/2021/03/02/new-research-indicates-the-whole-universe-could-be-a-giant-neural-network/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F06%2Funiverse.jpg&signature=e8e5b134d1f003f0963a0be338b9a893", "publishedAt": "2021-03-02T19:18:00Z", "content": "The core idea is deceptively simple: every observable phenomenon in the entire universe can be modeled by a neural network. And that means, by extension, the universe itself may be a neural network.\r… [+3546 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How the trap-jaw ant got its ultrafast bite - Phys.org", "description": "Powerful and deadly, the bite of a trap-jaw ant is renowned throughout the animal kingdom. Unlike normal gripping jaws, which rely on muscles to open and close, the trap-jaw latches itself open, storing energy like a stretched spring. When released, the jaws …", "url": "https://phys.org/news/2021-03-trap-jaw-ant-ultrafast.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/evolutionofo.jpg", "publishedAt": "2021-03-02T19:00:53Z", "content": "Powerful and deadly, the bite of a trap-jaw ant is renowned throughout the animal kingdom. Unlike normal gripping jaws, which rely on muscles to open and close, the trap-jaw latches itself open, stor… [+6738 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Intriguing particles emerge when two photons couple - EurekAlert", "description": "Researchers exploring the interactions between light particles, photons and matter find that optical microresonators host quasiparticles made by two photons.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uob-ipe030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257929_web.jpg", "publishedAt": "2021-03-02T18:44:39Z", "content": "IMAGE: Photon-photon polaritons in microresonators\r\n view more \r\nCredit: University of Bath\r\nScientists at the University of Bath in the UK have found a way to bind together two photons of different … [+3913 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Scientists want virtual meetings to stay after the COVID pandemic - Nature.com", "description": "A Nature poll shows that a year of online research conferences has brought big benefits, but blending them with in-person meetings in future will be a challenge.", "url": "https://www.nature.com/articles/d41586-021-00513-1", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-00513-1/d41586-021-00513-1_18903092.jpg", "publishedAt": "2021-03-02T18:34:44Z", "content": "The COVID-19 pandemic has forced scientists to share their research at virtual conferences in the past year.Credit: Laurence Dutton/Getty\r\nAlthough researchers are getting Zoom fatigue just like ever… [+8114 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Scientists build robot that 'hears' through the ear of a dead locust - CNET", "description": "Researchers kept the zombie organ alive by feeding it and giving it oxygen.", "url": "https://www.cnet.com/news/scientists-build-robot-that-hears-through-the-ear-of-a-dead-locust/", "urlToImage": "https://cnet1.cbsistatic.com/img/lAOimWXsalYiGNqzUCJDt_Cs_a0=/1200x630/2021/03/02/f428ab96-bc56-4ed3-af94-244e50f8588e/ear.jpg", "publishedAt": "2021-03-02T18:07:00Z", "content": "The Ear-Bot listens through the ear of a dead locust. \r\nTel Aviv University\r\nBeetles wearing camera backpacks and moths driving tiny cars are the results of real insect experiments. A team of researc… [+1645 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Monica Haider", "title": "NASA Names DC Headquarters After Mary Jackson, STEM Leader And NASA’s First Black Female Engineer - Forbes", "description": "NASA named its D.C. headquarters after Mary Jackson, a pioneer in math and engineering who became NASA's first Black woman engineer. Jackson worked during and after segregation and fought for equality for other women at NASA. Other notable women in STEM also …", "url": "https://www.forbes.com/sites/monicahaider/2021/03/02/nasa-names-dc-headquarters-after-mary-jackson-stem-leader-and-nasas-first-black-female-engineer/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F603e763c297958111d674607%2F0x0.jpg", "publishedAt": "2021-03-02T17:38:50Z", "content": "View of Mary Jackson working at NASA's Langley Research Center in Hampton, Virginia, 1980. (Photo by ... [+] Bob Nye/NASA/Interim Archives/Getty Images)\r\nGetty Images\r\nNASAs Washington D.C. headquart… [+5073 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Igor Bonifacic", "title": "The CPU from Apple's iMac G3 is powering NASA's Perseverance rover - Yahoo Finance Australia", "description": "When NASA's Perseverance guided itself to the surface of Mars on February 18th, it did so with the help of the same processor that powered the 1998 iMac G3.", "url": "https://au.finance.yahoo.com/news/nasa-perseverance-powerpc-750-171516292.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9fkbSOCo1qtXlZ0SERyveQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzcz/https://s.yimg.com/os/creatr-uploaded-images/2021-03/b14c4200-7b7f-11eb-b79b-283e8166d0dc", "publishedAt": "2021-03-02T17:25:39Z", "content": "TORONTO, March 02, 2021 (GLOBE NEWSWIRE) -- i3 Interactive inc. (CSE: BETS) (FRA: F0O3) (OTC: BLITF) (the Company) is pleased to announce that it will be completing a corporate name change to Interac… [+5183 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New study finds atmospheric rivers increase snow mass in West Antarctica - EurekAlert", "description": "A new study published today in the journal <i>Geophysical Research Letters</i> used NASA's ice-measuring laser satellite to identify atmospheric river storms as a key driver of increased snowfall in West Antarctica during the 2019 austral winter.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uoc--nsf030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257910_web.jpg", "publishedAt": "2021-03-02T17:13:18Z", "content": "IMAGE: Thwaites Glacier in 2019. Credit: Kiya Riverman\r\n view more \r\nCredit: Kiya Riverman\r\nA new study published today in the journal Geophysical Research Letters used NASA's ice-measuring laser sat… [+5339 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Harvard study challenges lateral-to-sagittal shift in mammal spine evolution - EurekAlert", "description": "The study challenges the lateral-to-sagittal hypothesis by looking at the vertebrae of modern reptiles, mammals, and the extinct nonmammalian synapsids to determine how their vertebrae changed over time and its effect on how these creatures likely moved.", "url": "https://www.eurekalert.org/pub_releases/2021-03/hu-hsc030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257876_web.jpg", "publishedAt": "2021-03-02T17:02:29Z", "content": "IMAGE: Photograph of a skeleton of the early non-mammalian synapsid (ancient mammal relative) Edaphosaurus on display at the Field Museum of Natural History.\r\n view more \r\nCredit: Ken Angielczyk\r\nWhe… [+5736 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "How does plastic debris make its way into ocean garbage patches? - EurekAlert", "description": "Researchers in the U.S. and Germany decided to explore which pathways transport debris to the middle of the oceans, causing garbage patches, as well as the relative strengths of different subtropical gyres and how they influence long-term accumulation of debr…", "url": "https://www.eurekalert.org/pub_releases/2021-03/aiop-hdp022521.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257499_web.jpg", "publishedAt": "2021-03-02T16:03:09Z", "content": "WASHINGTON, March 2, 2021 -- Tons of plastic debris get released into the ocean every day, and most of it accumulates within the middle of garbage patches, which tend to float on the oceans' surface … [+3750 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Matthew Warke", "title": "A billion years from now, a lack of oxygen will wipe out life on Earth - The Conversation UK", "description": "This discovery will shape the hunt for life on exoplanets.", "url": "https://theconversation.com/a-billion-years-from-now-a-lack-of-oxygen-will-wipe-out-life-on-earth-156241", "urlToImage": "https://images.theconversation.com/files/387012/original/file-20210301-12-pyj8jo.jpg?ixlib=rb-1.1.0&rect=333%2C0%2C4577%2C2286&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-03-02T15:50:45Z", "content": "Earth will not be able to support and sustain life forever. Our oxygen-rich atmosphere may only last another billion years, according to a new study in Nature Geoscience. \r\nAs our Sun ages, it is bec… [+4805 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Elle Hunt", "title": "'Giant luminous shark': researchers discover three deep-sea sharks glow in the dark - The Guardian", "description": "Discovery off New Zealand includes kitefin shark, which at up to 180cm is now biggest-known luminous vertebrate", "url": "https://amp.theguardian.com/environment/2021/mar/02/giant-luminous-shark-researchers-discover-that-three-deep-sea-sharks-glow-in-the-dark", "urlToImage": null, "publishedAt": "2021-03-02T15:39:00Z", "content": "SharksDiscovery off New Zealand includes kitefin shark, which at up to 180cm is now biggest-known luminous vertebrate \r\nScientists studying sharks off New Zealand have discovered that three deep-sea … [+3131 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Rare Australian bee rediscovered after nearly a century - Livescience.com", "description": "It hadn't been seen since 1923 and was thought to be extinct.", "url": "https://www.livescience.com/rare-australian-bee-rediscovered.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3vwFCjUViY4zzD7FYeCyHE-1200-80.jpg", "publishedAt": "2021-03-02T15:35:00Z", "content": "An extremely rare species of bee that hasn't been seen for nearly a century and was thought to be extinct has been rediscovered by a lone researcher in Australia.\r\nThis rare \"masked\" bee, known as Ph… [+3736 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Queenie Hoi Shan Chan", "title": "Scientists have found dust from the asteroid that wiped out the dinosaurs inside the crater it left - The Conversation UK", "description": "A new study found iridium, an element found in asteroids, in the rocks of the Chicxulub impact crater.", "url": "https://theconversation.com/scientists-have-found-dust-from-the-asteroid-that-wiped-out-the-dinosaurs-inside-the-crater-it-left-156232", "urlToImage": "https://images.theconversation.com/files/387199/original/file-20210302-15-1mk088s.jpg?ixlib=rb-1.1.0&rect=314%2C775%2C6423%2C3206&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-03-02T14:27:24Z", "content": "More than 99% of all organisms that have ever lived on Earth are now extinct. Most of these just died out quietly. However, in Earths history there have been five major mass extinction events known a… [+4863 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Origin of life - The chicken-and-the-egg problem - EurekAlert", "description": "A Ludwig-Maximilians-Universitaet (LMU) in Munich team has shown that slight alterations in transfer-RNA molecules (tRNAs) allow them to self-assemble into a functional unit that can replicate information exponentially. tRNAs are key elements in the evolution…", "url": "https://www.eurekalert.org/pub_releases/2021-03/lm-ool030121.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-02T14:02:31Z", "content": "A Ludwig-Maximilians-Universitaet (LMU) in Munich team has shown that slight alterations in transfer-RNA molecules (tRNAs) allow them to self-assemble into a functional unit that can replicate inform… [+6492 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Adi Gaskell", "title": "Overcoming Zoom Fatigue - Forbes", "description": "Zoom has been vital for keeping business going during Covid, but its constant use has led to fatigue and exhaustion. A new paper from Stanford provides some tips to overcome Zoom fatigue", "url": "https://www.forbes.com/sites/adigaskell/2021/03/02/overcoming-zoom-fatigue/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60369b4bf19856cb41fcbf2f%2F0x0.jpg", "publishedAt": "2021-03-02T13:40:00Z", "content": "Overcoming Zoom Fatigue\r\ngetty\r\nIn the early months of the Covid pandemic there was a general sense of enjoyment around the remote working that was mandated by the various control measures introduced… [+4221 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "NASA's James Webb Space Telescope completes final functional tests to prepare for launch - Phys.org", "description": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams successfully completed two important milestones that confirmed t…", "url": "https://phys.org/news/2021-03-nasa-james-webb-space-telescope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/nasasjameswe.jpg", "publishedAt": "2021-03-02T13:10:05Z", "content": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams succ… [+6041 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Observations of First Black Hole Ever Detected Leads to Questions About the Universe's Most Mysterious Objects - SciTechDaily", "description": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to question what they know about the Universe's most mysterious ob…", "url": "https://scitechdaily.com/new-observations-of-first-black-hole-ever-detected-leads-to-questions-about-the-universes-most-mysterious-objects/", "urlToImage": "https://scitechdaily.com/images/Cygnus-X-1-System.gif", "publishedAt": "2021-03-02T12:34:58Z", "content": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to que… [+5569 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Niiler", "title": "Can Technology Open Spaceflight to Disabled Astronauts? - WIRED", "description": "The European Space Agency wants to make sure its new astronaut class is more diverse. But it will take redesigned gear to make space accessible to everybody.", "url": "https://www.wired.com/story/can-technology-open-spaceflight-to-disabled-astronauts/", "urlToImage": "https://media.wired.com/photos/603d2a7a2d6b6299017ee0d4/191:100/w_1280,c_limit/Science_disabledastronauts_348873main_fd7-repair_full.jpg", "publishedAt": "2021-03-02T12:00:00Z", "content": "What would it be like to have a spaceship with a truly diverse crewnot the mix of alien species seen in so many sci-fi series, but human beings with all kinds of bodies? The European Space Agency ann… [+3769 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "‘Little Foot’ fossil sheds further light on human origins - The New Daily", "description": "The fossil of an early human forerunner that inhabited South Africa 3.67 million years ago is shedding light on human origins.", "url": "https://thenewdaily.com.au/life/2021/03/02/little-foot-fossil-human-origins/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2021/03/1614684366-Little-Foot-fossil-2017-960x600.jpg", "publishedAt": "2021-03-02T11:45:02Z", "content": "Sophisticated scanning technology is revealing intriguing secrets about Little Foot, the fossil of an early human forerunner that inhabited South Africa 3.67 million years ago during a critical junct… [+4001 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Gene Kim,Jessica Orwig", "title": "Earth's north magnetic pole is on the move - here's what will happen when our poles flip - Business Insider Australia", "description": "Our protective shield might soon go into a transformation that could threaten all the lives on Earth.", "url": "https://www.businessinsider.com.au/earth-north-south-poles-flip-magnetic-field-2018-4-2", "urlToImage": "https://i.insider.com/5ac3e2647a74af25008b4568?format=jpeg", "publishedAt": "2021-03-02T09:40:00Z", "content": "Following is a transcript of the video.\r\nNarrator: Did you know that Earth has two North Poles? There’s the geographic North Pole, which never changes. And there’s the magnetic North Pole, which is a… [+4553 chars]"}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "Nuclear fusion: building a star on Earth is hard, which is why we need better materials - Australian Times", "description": "Nuclear fusion is the process that powers the Sun and all other stars. During fusion, the nuclei of two atoms are brought close enough together that they fuse together, releasing huge amounts of energy.", "url": "https://www.australiantimes.co.uk/news/nuclear-fusion-building-a-star-on-earth-is-hard-which-is-why-we-need-better-materials/", "urlToImage": "https://storage.googleapis.com/cdn.australiantimes.co.uk/wp-content/uploads/2021/03/2b972205-nuclear-fusion.jpg", "publishedAt": "2021-03-02T09:17:00Z", "content": "Aneeqa Khan, Manchester University\r\nNuclear fusion is the process that powers the Sun and all other stars. During fusion, the nuclei of two atoms are brought close enough together that they fuse toge… [+5983 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "9News Staff", "title": "Strange striped patterns in Russia snow baffle NASA scientists - 9News", "description": "<p>A satellite has captured strange rippled lines across parts of Russia&#x27;s arctic, leaving scientists confused as to what they are.</p>", "url": "https://www.9news.com.au/wild-weather/russia-stripe-patterns-photographed-by-satellite-leave-nasa-scientists-baffled/e0e9ca3e-eaf4-49b6-8e8d-a3801778f27b", "urlToImage": "https://imageresizer.static9.net.au/m6pknW4UhMFmfADh13vlZijWWvk=/0x37:720x442/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Ff7201559-7cc1-4879-acc6-d972aea125d5", "publishedAt": "2021-03-02T05:08:34Z", "content": "Auto news: Old Datsun sells for $1.1 million, breaks auction records in Japan - caradvice.com.au"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Meeting the meat needs of the future - Science Codex", "description": null, "url": "https://www.sciencecodex.com/meeting-meat-needs-future-668036", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/257546_web.jpg", "publishedAt": "2021-03-02T05:00:00Z", "content": "Tokyo, Japan - Humans are largely omnivores, and meat in various forms has always featured in the diet of most cultures. However, with the increasing population and pressure on the environment, tradi… [+2425 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Gold-phosphorus nanosheets catalyzes nature gas to greener energy selectively - Science Codex", "description": null, "url": "https://www.sciencecodex.com/gold-phosphorus-nanosheets-catalyzes-nature-gas-greener-energy-selectively-668007", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/257827_web.jpg", "publishedAt": "2021-03-02T05:00:00Z", "content": "Advances in hydraulic fracturing technology have enabled discovery of large reserves of natural gas which primarily contains methane, which is mainly burned directly and causing global warming potent… [+1739 chars]"}, {"source": {"id": null, "name": "The Market Herald"}, "author": "Oliver Gray", "title": "Victoria issues fresh alert to Melbourne suburbs after coronavirus fragments detected in wastewater - The Market Herald", "description": "An urgent alert has been issued to another three suburbs in Melbourne's west after fragments of COVID-19 were discovered at the Werribee wastewater treatment plant.", "url": "https://themarketherald.com.au/victoria-issues-fresh-alert-to-melbourne-suburbs-after-coronavirus-fragments-detected-in-wastewater-2021-03-02/", "urlToImage": "https://themarketherald.com.au/wp-content/uploads/2021/03/og-21644-shutterstock_599171096-1280x720.jpg", "publishedAt": "2021-03-02T03:09:36Z", "content": "<ul><li>An urgent alert has been issued to another three suburbs in Melbourne's west after fragments of COVID-19 were discovered at the Werribee wastewater treatment plant</li><li>The warning was sen… [+2056 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Primates Appeared Almost Immediately After Dinosaurs Went Extinct, New Research Suggests - Gizmodo Australia", "description": "A formation famous for producing T. rex fossils has now yielded the oldest evidence of primates in the fossil record, in what is being hailed a significant discovery. Jawbones and an assortment of teeth found in the Hell’s Creek formation of northeastern Mont…", "url": "https://www.gizmodo.com.au/2021/03/primates-appeared-almost-immediately-after-dinosaurs-went-extinct-new-research-suggests/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/02/qg2jjp8ref6moocpitke.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-01T22:25:00Z", "content": "A formation famous for producing T. rex fossils has now yielded the oldest evidence of primates in the fossil record, in what is being hailed a significant discovery. \r\nJawbones and an assortment of … [+5141 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "When should you end a conversation? Probably sooner than you think - Science Magazine", "description": "Study finds most chats don’t end when people want them to", "url": "https://www.sciencemag.org/news/2021/03/when-should-you-end-conversation-probably-sooner-you-think", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/conversation_1280p.jpg?itok=KgoOShN2", "publishedAt": "2021-03-01T20:45:00Z", "content": "By Cathleen OGradyMar. 1, 2021 , 3:45 PM\r\nWhile studying for his masters degree at the University of Oxford, Adam Mastroianni confronted a fear common to many party goers: Would he get stuck in a con… [+4115 chars]"}, {"source": {"id": null, "name": "Unimelb.edu.au"}, "author": "Dr Mike Haydon, University of Melbourne", "title": "How plants tell time - Pursuit", "description": "Plants can’t go to a fridge for a midnight snack, but a new University of Melbourne-led study shows they sense time at dusk to conserve energy made from the sun", "url": "https://pursuit.unimelb.edu.au/articles/how-plants-tell-time", "urlToImage": "https://res-2.cloudinary.com/the-university-of-melbourne/image/upload/s--qYVyNDiK--/c_fill,f_auto,h_630,q_75,w_1200/v1/pursuit-uploads/727/eb9/34e/727eb934ece257daa595775034c6a9ac345a6cbc8c3c778466c5e10e6bb5.jpg", "publishedAt": "2021-03-01T20:06:36Z", "content": "Probably the most important process on the planet is photosynthesis the way plants make their own food using energy from sunlight.\r\nPhotosynthesis drives food production for us and the animals we eat… [+5346 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Neanderthals had the capacity to perceive and produce human speech - Science Daily", "description": "Neanderthals -- the closest ancestor to modern humans -- possessed the ability to perceive and produce human speech, according to a new study.", "url": "https://www.sciencedaily.com/releases/2021/03/210301112358.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T18:25:25Z", "content": "Neanderthals -- the closest ancestor to modern humans -- possessed the ability to perceive and produce human speech, according to a new study published by an international multidisciplinary team of r… [+4768 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "In the Distant Future, All Earth's Creatures May Asphyxiate From Lack of Oxygen - Futurism", "description": "The Sun is going to be a lot hotter a billion years from now.", "url": "https://futurism.com/distant-future-earth-creatures-asphyxiate-lack-oxygen", "urlToImage": "https://wp-assets.futurism.com/2021/03/distant-future-earth-creatures-asphyxiate-lack-oxygen.jpg", "publishedAt": "2021-03-01T17:54:04Z", "content": "All complex aerobic life on Earth as we know it will eventually die as oxygen levels deplete in our planets atmosphere.\r\nFortunately, that wont happen for another billion years or so, according to an… [+2542 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Orbiting spacecraft spots Nasa’s Mars Rover in huge crater on planet surface - Yahoo New Zealand News", "description": "The Rover was pictured in the Jezero Crater – a 28-mile-wide depression containing sediments of an ancient river delta.", "url": "https://nz.news.yahoo.com/nasa-mars-rover-space-174829552.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/7e5040b0-7ab5-11eb-a79a-cb5dfbb57249", "publishedAt": "2021-03-01T17:48:29Z", "content": "The orbiting craft spotted Perseverance on the surface (ESA)\r\nAn orbiting European Space Agency (ESA) spacecraft has spotted Nasas Perseverance Rover on the surface of Mars along with its parachute, … [+3119 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New skills of graphene: Tunable lattice vibrations - Phys.org", "description": "Without electronics and photonics, there would be no computers, smartphones, sensors, or information and communication technologies. In the coming years, the new field of phononics may further expand these options. That field is concerned with understanding a…", "url": "https://phys.org/news/2021-03-skills-graphene-tunable-lattice-vibrations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/newskillsofg.jpg", "publishedAt": "2021-03-01T17:08:24Z", "content": "Without electronics and photonics, there would be no computers, smartphones, sensors, or information and communication technologies. In the coming years, the new field of phononics may further expand… [+3085 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Wrasses dazzle: How fairy wrasses got their flamboyant colours - Phys.org", "description": "With their exuberant colors, fiery personalities and captivating courtship displays, the fairy wrasses are one of the most beloved coral reef fish. Despite this, the evolutionary history of its genus was not well understood—until now.", "url": "https://phys.org/news/2021-03-wrasses-dazzle-fairy-flamboyant-colours.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-wrassesdazzl.jpg", "publishedAt": "2021-03-01T17:04:32Z", "content": "With their exuberant colors, fiery personalities and captivating courtship displays, the fairy wrasses are one of the most beloved coral reef fish. Despite this, the evolutionary history of its genus… [+3973 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Meteorites may be just north of Cheltenham - Yahoo News Australia", "description": "The hunt is on for the fireball fragments that probably fell to Earth over England on Sunday night.", "url": "https://news.yahoo.com/meteorites-may-just-north-cheltenham-164354855.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/iejGpaFoHX5VywVr9L9lzA--~B/aD0zNjA7dz02NDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/844677ecbf1d2f4917ee65bdd4d17181", "publishedAt": "2021-03-01T16:54:01Z", "content": "The hunt is on for meteorite fragments that are likely to have fallen to Earth over England on Sunday night.\r\nMany people across Northern Europe saw a fireball in the sky shortly before 22:00 GMT, an… [+3023 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Second Order Optical Merons, or Light Pretending to Be a Ferromagnet - SciTechDaily", "description": "Scientists have demonstrated how to structure light such that its polarization behaves like a collective of spins in a ferromagnet forming half-skyrmions (also known as merons). To achieve this, the light was trapped in a thin liquid crystal layer between two…", "url": "https://scitechdaily.com/second-order-optical-merons-or-light-pretending-to-be-a-ferromagnet/", "urlToImage": "https://scitechdaily.com/images/Light-Spin-Texture.jpg", "publishedAt": "2021-03-01T16:47:39Z", "content": "Spin texture of a second-order half-skyrmion (meron) on the surface of a birefringent cavity. Credit: Physics UW, M. Krol\r\nScientists have demonstrated how to structure light such that its polarizati… [+4293 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Warming impairs trophic transfer efficiency in a long-term field experiment - Nature.com", "description": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic level makes it up to the next1–3. Recent theory suggests thi…", "url": "https://www.nature.com/articles/s41586-021-03352-2", "urlToImage": "", "publishedAt": "2021-03-01T16:17:48Z", "content": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic … [+1237 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Bispecific antibodies targeting mutant RAS neoantigens - Science", "description": "RAS oncogene mutations are common in various cancers, controlling their growth and survival. Targeting mutant RAS proteins with antibodies has been unsuccessful due to low surface expression, even when targeting mutant RAS peptides presented via HLA on the su…", "url": "https://immunology.sciencemag.org/content/6/57/eabd5515.full", "urlToImage": "https://immunology.sciencemag.org/content/6/57/eabd5515/F1.large.jpg", "publishedAt": "2021-03-01T15:51:18Z", "content": "INTRODUCTION\r\nSelective killing of cancer cells is challenging because cancer cells and their normal counterparts are so similar. At the genetic level, the most important differences between cancer c… [+12122 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "The $450 question: Should journals pay peer reviewers? - Science Magazine", "description": "Payment advocates expect quicker, better reviews but opponents fear unsustainable costs", "url": "https://www.sciencemag.org/news/2021/03/450-question-should-journals-pay-peer-reviewers", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/money_1280p.jpg?itok=r2CygPAX", "publishedAt": "2021-03-01T15:45:00Z", "content": "By Jeffrey BrainardMar. 1, 2021 , 10:45 AM\r\nFor many busy working scientists, receiving yet another invitation from an academic journal to peer review yet another manuscript can trigger groans. The w… [+7999 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Akanksha Arora", "title": "64 Human Genomes successfully sequenced by scientists for the first time ever - Republic TV", "description": "Scientists from the University of Maryland School of Medicine (UMSOM) have managed to successfully sequence 64 full human genomes.", "url": "https://www.republicworld.com/technology-news/science/64-human-genomes-successfully-sequenced-by-scientists-for-the-first-time-ever.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/dxnirppvv8gw81io_1614609422.jpeg?tr=f-jpeg", "publishedAt": "2021-03-01T15:19:00Z", "content": "Scientists from the University of Maryland School of Medicine (UMSOM) have managed to successfully sequence 64 full human genomes. These genomes were discovered as a part of the Human Genome Project … [+2164 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jade Boyd", "title": "Bottling the world's coldest plasma - Phys.org", "description": "Rice University physicists have discovered a way to trap the world's coldest plasma in a magnetic bottle, a technological achievement that could advance research into clean energy, space weather and astrophysics.", "url": "https://phys.org/news/2021-03-bottling-world-coldest-plasma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/bottlingthew.jpg", "publishedAt": "2021-03-01T14:45:55Z", "content": "Rice University physicists have discovered a way to trap the world's coldest plasma in a magnetic bottle, a technological achievement that could advance research into clean energy, space weather and … [+6644 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "", "title": "New magnesium alloy shows exceptional corrosion resistance | Research - Chemistry World", "description": "Magnesium reaps big benefits from tiny amounts of calcium", "url": "https://www.chemistryworld.com/news/new-magnesium-alloy-shows-exceptional-corrosion-resistance/4013323.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/0/0/5/512005_index_3652.jpg", "publishedAt": "2021-03-01T14:30:06Z", "content": "Scientists in Germany have created an alloy with an exceptionally low corrosion rate lower, even, than ultra high-purity magnesium that they say approaches stainless magnesium, by alloying pure magne… [+2761 chars]"}, {"source": {"id": null, "name": "Digital Camera World"}, "author": "Louise Carey", "title": "Every camera on the Mars Perseverance rover from NASA explained - Digital Camera World", "description": "The Mars Perseverance rover from NASA has a total of 23 cameras – and here's what they all do", "url": "https://www.digitalcameraworld.com/uk/news/these-are-all-the-cameras-on-nasas-mars-perseverance-rover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pxaQAe8Pmt39w9cQfMGts9-1200-80.jpg", "publishedAt": "2021-03-01T14:15:19Z", "content": "The landing of the Perseverance rover on Mars is one of the most exciting events to happen for space enthusiasts in quite a while. The Perseverance rover will be searching for ancient life, collectin… [+5799 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "ESA is working on a mission to explore caves on the moon - Phys.org", "description": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes necessary to support a moon base. ESA is also contributing both m…", "url": "https://phys.org/news/2021-03-esa-mission-explore-caves-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/esaisworking.jpg", "publishedAt": "2021-03-01T13:35:17Z", "content": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes neces… [+3716 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "World's first space HOTEL to begin construction in low Earth orbit in 2025 - Daily Mail", "description": "Developed by the Orbital Assembly Corporation (OAC), the Voyager Station could be operational as early as 2027, with the infrastructure built in orbit around the Earth.", "url": "https://www.dailymail.co.uk/sciencetech/article-9311791/Worlds-space-HOTEL-begin-construction-low-Earth-orbit-2025.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/01/10/39898762-0-image-a-10_1614595927308.jpg", "publishedAt": "2021-03-01T11:55:00Z", "content": "Work is due to start on the world's first 'space hotel' in low Earth orbit in 2025 - and it will come equipped with restaurants, a cinema, spa and rooms for 400 people.\r\nDeveloped by the Orbital Asse… [+8841 chars]"}, {"source": {"id": null, "name": "Sciencenordic.com"}, "author": "Tobias Kvist Stripp", "title": "Research and social media: A dangerous cocktail or winged messenger? - ScienceNordic", "description": "OPINION: Social media plays a huge part in the process of scientific publication. Is this a good or a bad thing? How do we ensure, that science stays trustworthy under the influence of social media?", "url": "https://sciencenordic.com/a/1820056", "urlToImage": "https://image.sciencenordic.com/1821879.jpg?imageId=1821879&panow=100&panoh=60.169491525424&panox=0&panoy=39.830508474576&heightw=34.48275862069&heighth=100&heightx=0&heighty=0&width=1200&height=630", "publishedAt": "2021-03-01T10:11:21Z", "content": "Research is usually considered trustworthy. Many would probably argue that research published in scientific papers is as close as we can get to truthful knowledge about the world.\r\nWe usually do not … [+10346 chars]"}, {"source": {"id": null, "name": "Farmonline.com.au"}, "author": "", "title": "The lies the lyrebird tells to keep his girl - North Queensland Register", "description": "Male lyrebirds mimic outside threats from other birds when a female attempts to leave a male's dancing arena without mating.", "url": "https://www.farmonline.com.au/story/7144970/the-lies-the-lyrebird-tells-to-keep-his-girl/", "urlToImage": "https://www.farmonline.com.au/images/transform/v1/crop/frm/32XghFRykTWK8psrWNhdBMC/e945f8db-3295-4c3a-8793-7c42eef14663.jpg/r53_37_996_570_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T07:00:00Z", "content": "Researchers at Western Sydney University in partnership with Cornell University, the University of Wollongong and the Australian National University, have found male superb lyrebirds can create an as… [+1841 chars]"}, {"source": {"id": null, "name": "Armidale Express"}, "author": "Jacinta Dickins", "title": "New England North West towns including Armidale and Tamworth named as COVID-19 vaccination satellite sites - Armidale Express", "description": "These 12 towns in the region will be satellite sites for the vaccination rollout.", "url": "https://www.armidaleexpress.com.au/story/7147684/new-england-covid-19-vaccination-sites-revealed/", "urlToImage": "https://www.armidaleexpress.com.au/images/transform/v1/crop/frm/JV4n4a6iwKJ9DNUAb9ehsn/3c2ae18c-d75e-4844-b2f8-26fe032dbe28.jpg/r9_376_4021_2643_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T06:00:00Z", "content": ""}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "7NEWS", "title": "European stargazers hear ‘sonic boom’ as flaming meteor lights up sky - 7NEWS.com.au", "description": "The speeding ball of fire was seen by witnesses from the south of England all the way to Ireland.", "url": "https://7news.com.au/technology/meteor/european-stargazers-hear-sonic-boom-as-flaming-meteor-lights-up-sky-c-2263679", "urlToImage": "https://images.7news.com.au/publication/C-2263679/d997857e625d2bedae130bfe27aea72ee5f3c5fc-16x9-x0y60w712h400.jpg?imwidth=1024", "publishedAt": "2021-03-01T05:40:10Z", "content": "British and Irish stargazers were pleasantly surprised on Sunday night when a flaming meteor shot through the sky.\r\nAs seen in the video above, the meteor sped through the night around 10pm (Monday 9… [+1653 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Launch of Falcon 9 carrier rocket with Starlink satellites delayed until Monday - SpaceX - United News of India", "description": "Washington, Mar 1 (UNI) SpaceX has cancelled the planned launch of a Falcon 9 carrier rocket with 60 Starlink satellites.", "url": "http://www.uniindia.com/~/launch-of-falcon-9-carrier-rocket-with-starlink-satellites-delayed-until-monday-spacex/World/news/2331439.html", "urlToImage": "http://www.uniindia.com/cms/gall_content/2021/3/2021_3$largeimg01_Mar_2021_094952613.jpg", "publishedAt": "2021-03-01T03:30:00Z", "content": "Washington, Mar 1 (UNI) SpaceX has cancelled the planned launch of a Falcon 9 carrier rocket with 60 Starlink satellites.\r\n\"Auto-abort at T-1:24 ahead of tonight's Falcon 9 launch of Starlink; next l… [+681 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Argentinian titanosaur may be oldest yet: Study - Al Jazeera English", "description": "The 20-metre lizard, discovered in Argentina in 2014, roamed what is now Patagonia some 140 million years ago.", "url": "https://www.aljazeera.com/news/2021/3/1/argentine-titanosaur-may-be-oldest-yet-study", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/000_736K5.jpg?resize=1200%2C630", "publishedAt": "2021-03-01T03:08:42Z", "content": "A colossal dinosaur dug up in Argentina could be the oldest titanosaur ever found, having roamed what is now Patagonia some 140 million years ago at the beginning of the Cretaceous period, scientists… [+1088 chars]"}]}