{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "ESA releases new image of Mars captured by ExoMars TGO - Devdiscourse", "description": "Read more about ESA releases new image of Mars captured by ExoMars TGO on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1885861-esa-releases-new-image-of-mars-captured-by-exomars-tgo", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_01_2022_10_39_44_3254002.jpg?width=920&format=jpeg", "publishedAt": "2022-01-17T05:09:44Z", "content": "The European Space Agency (ESA) has released a new image of Mars that shows signs of 'geology in motion' on the Red Planet. The image - the first release of 2022 - was captured by the CaSSIS camera o… [+1867 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Come Sail Away With Me - SciTechDaily", "description": "The spiral arms of the galaxy NGC 3318 are lazily draped across this image from the NASA/ESA Hubble Space Telescope. This spiral galaxy lies in the constellation Vela and is roughly 115 light-years away from Earth. Vela was originally part of a far larger con…", "url": "https://scitechdaily.com/come-sail-away-with-me/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-3318-scaled.jpg", "publishedAt": "2022-01-17T05:09:29Z", "content": "ByESA/HubbleJanuary 16, 2022\r\nSpiral galaxy NGC 3318 imaged by the Hubble Space Telescope. Credit: ESA/Hubble &amp; NASA, ESO, R. J. Foley, Acknowledgement: R. Colombari\r\nThe spiral arms of the galax… [+1486 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA issues warning on asteroids approaching Earth undetected - HT Tech", "description": "NASA found that asteroids can \"sneak up\" on Earth by bypassing the network of telescopes that are searching open space for them.", "url": "https://tech.hindustantimes.com/tech/news/nasa-issues-warning-on-asteroids-approaching-earth-undetected-71642392899018.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/17/1600x900/asteroid_(Flickr)_1638627105271_1642393057028.jpg", "publishedAt": "2022-01-17T04:19:00Z", "content": "A group of astronomers funded by the NASA have warned that dangerous asteroids may be heading towards Earth and that these can go totally undetected due to a blind spot in the sky. These asteroids ca… [+2289 chars]"}, {"source": {"id": null, "name": "iTech Post"}, "author": "Hannah Grace", "title": "Elon Musk Warns \"100% Chance\" of Mass Extinction Because of the Sun; But There's a Solution - iTech Post", "description": "Due to the expansion of the Sun, Elon Musk tweeted that there is a \"100 percent\" possibility of mass extinction. With that being stated, Musk offered a solution of making human life multi-planetary.", "url": "https://www.itechpost.com/articles/108725/20220116/elon-musk-warns-100-chance-mass-extinction-sun-theres-solution.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/103580/elon-musk-warns-100-chance-of-mass-extinction-because-of-the-sun-but-theres-a-solution.jpg", "publishedAt": "2022-01-17T03:59:36Z", "content": "Due to the expansion of the Sun, Elon Musk tweeted that there is a \"100 percent\" possibility of mass extinction. With that being stated, Musk offered a solution of making human life multi-planetary.\r… [+3849 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Science and the scientific method: Definitions and examples - newsconcerns", "description": "Science is a systematic and logical approach to discovering how things in the universe work. It is also the body of knowledge accumulated through the discoveries about all the things in the universe. The word \"science\" is derived from the Latin word", "url": "https://newsconcerns.com/science-and-the-scientific-method-definitions-and-examples/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jc7TU5vT7Z2FVkmgxUaQAc-1200-80.jpg", "publishedAt": "2022-01-17T02:56:32Z", "content": "Science is a systematic and logical approach to discovering how things in the universe work. It is also the body of knowledge accumulated through the discoveries about all the things in the universe.… [+10136 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "For The First Time, Astronomers Detect Rugby-Ball Shape of a Deformed Exoplanet - ScienceAlert", "description": "Beyond the Solar System, out there in the wider galaxy, a very strange subset of exoplanets exists. Called hot Jupiters, these are majorly clingy – hugging so close to their host stars, they're not just intensely hot, but also likely warped by grav", "url": "https://www.sciencealert.com/for-the-first-time-we-ve-been-able-to-measure-the-shape-of-a-warped-exoplanet", "urlToImage": "https://www.sciencealert.com/images/2022-01/processed/wasp-103b_1024.jpg", "publishedAt": "2022-01-17T02:02:17Z", "content": "Beyond the Solar System, out there in the wider galaxy, a very strange subset of exoplanets exists. Called hot Jupiters, these are majorly clingy hugging so close to their host stars, they're not jus… [+4939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Type of “Strange Metal” – Material That Shares Fundamental Quantum Attributes With Black Holes - SciTechDaily", "description": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black holes. Scientists understand quite well how temperature affects…", "url": "https://scitechdaily.com/newly-discovered-type-of-strange-metal-material-that-shares-fundamental-quantum-attributes-with-black-holes/", "urlToImage": "https://scitechdaily.com/images/Strange-Metals-New-State-of-Matter.gif", "publishedAt": "2022-01-17T01:35:02Z", "content": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black hol… [+6135 chars]"}, {"source": {"id": null, "name": "Sportsfinding"}, "author": null, "title": "NASA will send a mission to study an asteroid valued at 10,000 trillion dollars - Sportsfinding", "description": "Advertisement As if it were the movie “Don’t look up”, NASA is preparing to send a mission to study the composition of an asteroid 226 kilometers in diameter that could be worth close to 10,000 trillion dollars. Discovered in 1852 by the Italian astronomer An…", "url": "https://sportsfinding.com/nasa-will-send-a-mission-to-study-an-asteroid-valued-at-10000-trillion-dollars/128637/", "urlToImage": "https://sportsfinding.com/wp-content/uploads/2022/01/700x420_blue-origin-1.jpg", "publishedAt": "2022-01-17T00:44:05Z", "content": "As if it were the movie “Don’t look up”, NASA is preparing to send a mission to study the composition of an asteroid 226 kilometers in diameter that could be worth close to 10,000 trillion dollars.\r\n… [+2714 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Hole at Center of Milky Way Is Unpredictable and Chaotic – Mysterious Flares Erupt Every Day - SciTechDaily", "description": "An international team of researchers, led by postgraduate student Alexis Andrés, has found that the black hole at the center of our galaxy, Sagittarius A*, not only flares irregularly from day to day but also in the long term. The team analyzed 15 years’ wort…", "url": "https://scitechdaily.com/black-hole-at-center-of-milky-way-is-unpredictable-and-chaotic-mysterious-flares-erupt-every-day/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Artists-Concept-Illustration-scaled.jpg", "publishedAt": "2022-01-17T00:25:00Z", "content": "ByRoyal Astronomical SocietyJanuary 16, 2022\r\nArtist’s concept illustration of a supermassive black hole emitting an x-ray jet. Credit: NASA/JPL-Caltech\r\nAn international team of researchers, led by … [+3652 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Astronauts test bioprinted bandages made from human skin - BollyInside", "description": "SpaceX’s 24th commercial resupply mission to the International Space Station, which launched in late 2021, carried with it a handheld device known as the", "url": "https://www.bollyinside.com/news/astronauts-test-bioprinted-bandages-made-from-human-skin", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-01-17T00:18:27Z", "content": "SpaceXs 24th commercial resupply mission to the International Space Station, which launched in late 2021, carried with it a handheld device known as the Bioprint FirstAid Handheld Bioprinter, or Biop… [+3084 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Western Scientists Analyze Legendary BC Woman's Bedroom Meteorite - Optic Flux", "description": "Western specialists are investigating a meteorite that became popular after falling into a woman's bedroom in British Columbia. The meteorite piece traveled for hundreds of millions of years before landing on the planet. According to Western experts, a meteor…", "url": "https://www.opticflux.com/western-scientists-analyze-legendary-bc-womans-bedroom-meteorite/14478/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/01/meteorite.webp", "publishedAt": "2022-01-16T23:31:04Z", "content": "Western specialists are investigating a meteorite that became popular after falling into a woman’s bedroom in British Columbia.\r\nThe meteorite piece traveled for hundreds of millions of years before … [+2865 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "How to watch SpaceX Cargo Dragon depart from ISS this week - Digital Trends", "description": "This week, a SpaceX Cargo Dragon craft will depart from the International Space Station (ISS) carrying supplies and scientific experiments back to Earth.", "url": "https://www.digitaltrends.com/news/spacex-cargo-dragon-24-departure-livestream/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/51802388049_2967665350_k_11.jpg", "publishedAt": "2022-01-16T23:00:38Z", "content": "This week, a SpaceX Cargo Dragon craft will depart from the International Space Station (ISS) carrying supplies and scientific experiments back to Earth. The uncrewed craft is scheduled to begin its … [+2016 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "Rocks found in Greenland reveal Earth was once covered in an ocean of magma - Study Finds", "description": "The planet's oldest rocks show that the planet's magma ocean was hundreds of miles deep and stretched across Earth's surface.", "url": "https://www.studyfinds.org/earth-covered-ocean-magma/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2022/01/AdobeStock_149398834-scaled.jpeg", "publishedAt": "2022-01-16T21:15:27Z", "content": "CAMBRIDGE, England — Earth was nothing more than a giant ocean of lava 3.6 billion years ago, according to new research. The planet’s oldest rocks show that the planet’s magma sea was hundreds of mil… [+4466 chars]"}, {"source": {"id": null, "name": "Nation.lk"}, "author": null, "title": "See the dramatic and beautiful flame nebula in Orion - nation.lk - The Nation Newspaper", "description": "The European Southern Observatory (ESO) has released a spectacular pair of images showing the dramatic Flame Nebula as seen by a radio telescope.", "url": "https://nation.lk/online/see-the-dramatic-and-beautiful-flame-nebula-in-orion-166139.html", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/the-flame-nebula-region-as-seen-with-apex-and-vista.jpg", "publishedAt": "2022-01-16T21:01:00Z", "content": "The European Southern Observatory (ESO) has released a spectacular pair of images showing the dramatic Flame Nebula as seen by a radio telescope. This nebula is located in the constellation of Orion,… [+2460 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "2021 – A Year Physicists Asked, “What Lies Beyond the Standard Model?” - SciTechDaily", "description": "If you ask a physicist like me to explain how the world works, my lazy answer might be: “It follows the Standard Model.” The Standard Model explains the fundamental physics of how the universe works. It has endured over 50 trips around the Sun despite experim…", "url": "https://scitechdaily.com/2021-a-year-physicists-asked-what-lies-beyond-the-standard-model/", "urlToImage": "https://scitechdaily.com/images/LHC-ATLAS-Calorimeter-scaled.jpg", "publishedAt": "2022-01-16T18:38:31Z", "content": "ByAaron McGowan, Rochester Institute of TechnologyJanuary 16, 2022\r\nExperiments at the Large Hadron Collider in Europe, like the ATLAS calorimeter seen here, are providing more accurate measurements … [+8024 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "Oldest remains of modern humans are much older than previously thought, researchers say - USA TODAY", "description": "Remains in Ethiopia were originally thought to be around 200,000 years ago. Scientists now say they are at least 230,000 years ago.", "url": "https://www.usatoday.com/story/news/world/2022/01/16/oldest-modern-human-remains-ethiopia/6548811001/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/01/16/USAT/7f0184bc-4ff7-4869-a6b2-e14be7b1ac13-AFP_9VZ4RT.jpg?auto=webp&crop=1671,940,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-01-16T18:23:11Z", "content": "Thanks to volcanic ash from an ancient eruption, fossils widely believed to be one of the oldest remains of modern humans in the world are actually much older than previously thought.\r\nThe remains, k… [+3565 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Roberta Bondar flew into space 30 years ago and never saw Earth the same after that - CBC.ca", "description": "It's been 30 years since Roberta Bondar was strapped into a five-point harness on the space shuttle Discovery and blasted into space and into fame as Canada's first female astronaut.", "url": "https://www.cbc.ca/radio/sunday/the-sunday-magazine-for-january-16-2022-1.6313448/roberta-bondar-flew-into-space-30-years-ago-and-never-saw-earth-the-same-after-that-1.6313449", "urlToImage": "https://i.cbc.ca/1.6313459.1642086775!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dr-roberta-bondar.jpg", "publishedAt": "2022-01-16T17:56:42Z", "content": "It's been 30 years since Roberta Bondar was strapped into a five-point harness on the space shuttle Discovery and blasted into fame as Canada's first female astronaut.\r\nBut first, she left a tearful … [+5678 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "The free-energy principle explains the brain — ScienceDaily - Verve Times", "description": "The RIKEN Center for Brain Science (CBS) in Japan, along with colleagues, has shown that the free-energy principle can explain how neural networks are optimized for efficiency. Published in the scientific journal Communications Biology, the study fir", "url": "https://vervetimes.com/the-free-energy-principle-explains-the-brain-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-16T17:48:01Z", "content": "The RIKEN Center for Brain Science (CBS) in Japan, along with colleagues, has shown that the free-energy principle can explain how neural networks are optimized for efficiency. Published in the scien… [+3463 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artemis I SLS Rocket Core Stage Engineering Testing Complete - SciTechDaily", "description": "Last week, engineers and technicians successfully completed an engineering test series of the Space Launch System (SLS) rocket core stage inside the Vehicle Assembly Building at NASA’s Kennedy Space Center as part of the integrated testing before launch. Afte…", "url": "https://scitechdaily.com/artemis-i-sls-rocket-core-stage-engineering-testing-complete/", "urlToImage": "https://scitechdaily.com/images/Space-Launch-System-in-Flight-scaled.jpg", "publishedAt": "2022-01-16T17:08:16Z", "content": "ByNASAJanuary 16, 2022\r\nThe SLS is an advanced, heavy-lift rocket that will provide an entirely new capability for science and human exploration beyond Earth’s orbit. Credit: NASA\r\nLast week, enginee… [+2463 chars]"}, {"source": {"id": null, "name": "Nation.lk"}, "author": null, "title": "How to Take Care of Air Plants - nation.lk - The Nation Newspaper", "description": "Despite the classic excuse of not having a “green thumb,” keeping a houseplant alive has more to do with the ability to make and remember to stick to a schedule than being born without a pretend gene that makes...", "url": "https://www.nation.lk/online/how-to-take-care-of-air-plants-166078.html", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/58415708cc3d8dd7bb54c38caeabb142.jpg", "publishedAt": "2022-01-16T17:01:33Z", "content": "Photo: Al Cole (Shutterstock)\r\nDespite the classic excuse of not having a “green thumb,” keeping a houseplant alive has more to do with the ability to make and remember to stick to a schedule than be… [+2198 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Mars Perseverance Rover: Pebbles Before Mountains - SciTechDaily", "description": "NASA’s Mars 2020 mission team has been working methodically and thoroughly, making good progress on understanding the best path forward to remove the uninvited pebbles from Perseverance’s bit carousel. Over the previous weekend, and earlier this week, operati…", "url": "https://scitechdaily.com/nasa-mars-perseverance-rover-pebbles-before-mountains/", "urlToImage": "https://scitechdaily.com/images/Mars-Perseverance-Sol-320.jpg", "publishedAt": "2022-01-16T16:26:37Z", "content": "ByJennifer Trosper, NASA's Jet Propulsion LaboratoryJanuary 16, 2022\r\nMars Perseverance Sol 320 – WATSON Image: NASA’s Mars Perseverance rover acquired this image using its onboard SHERLOC WATSON ima… [+3870 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "A new framework helps prioritize the public interest in the internet of things — ScienceDaily - Verve Times", "description": "The Internet of Things (IoT) is completely enmeshed in our daily lives, a network of connected laptops, phones, cars, fitness trackers -- even smart toasters and refrigerators -- that are increasingly able to make decisions on their own. But how to e", "url": "https://vervetimes.com/a-new-framework-helps-prioritize-the-public-interest-in-the-internet-of-things-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-16T16:11:05Z", "content": "The Internet of Things (IoT) is completely enmeshed in our daily lives, a network of connected laptops, phones, cars, fitness trackers — even smart toasters and refrigerators — that are increasingly … [+3000 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Earth's Interior is Cooling Faster Than Expected: Research - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A measuring system that measures the thermal conductivity of bridgmanite in the laboratory, under the pressure and temperature conditions that prevail inside the Earth, has been developed by a team of re…", "url": "https://www.latestly.com/agency-news/science-news-earths-interior-is-cooling-faster-than-expected-research-3261853.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/Captujbyf65hjbghk022011615275720220116153351-588x441.jpg", "publishedAt": "2022-01-16T15:48:23Z", "content": "Zurich [Switzerland], January 16 (ANI): A measuring system that measures the thermal conductivity of bridgmanite in the laboratory, under the pressure and temperature conditions that prevail inside t… [+4194 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "NASA citizen scientist spots Jupiter-like planet - The Tribune", "description": "A citizen scientist has discovered a giant gaseous planet about 379 light-years from Earth, orbiting a star with the same mass as the Sun, NASA has said.", "url": "https://www.tribuneindia.com/news/schools/nasa-citizen-scientist-spots-jupiter-like-planet-361831", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_2042924501.jpg", "publishedAt": "2022-01-16T15:48:00Z", "content": "Washington, Jan 16 \r\nA citizen scientist has discovered a giant gaseous planet about 379 light-years from Earth, orbiting a star with the same mass as the Sun, NASA has said.\r\nThe exoplanet, called T… [+2861 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Researchers explored the evolution of metal-binding proteins across billions of years — ScienceDaily - newsconcerns", "description": "Addressing one of the most profoundly unanswered questions in biology, a Rutgers-led team has discovered the structures of proteins that may be responsible for the origins of life in the primordial soup of ancient Earth.The study appears in the journ", "url": "https://newsconcerns.com/researchers-explored-the-evolution-of-metal-binding-proteins-across-billions-of-years-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-16T15:44:33Z", "content": "Addressing one of the most profoundly unanswered questions in biology, a Rutgers-led team has discovered the structures of proteins that may be responsible for the origins of life in the primordial s… [+2812 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Jon Kelvey", "title": "NASA 2022 calendar: 11 space missions and projects to look forward to - Inverse", "description": "NASA had a big 2021 and finally launched the James Webb Telescope. But its 2022 schedule is nothing to sneeze at.", "url": "https://www.inverse.com/science/nasa-2022-calendar-missions", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/1/14/f80ac46a-1c06-423b-b114-dafbd48791e7-getty-1192209246.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-01-16T15:30:25Z", "content": "NASA had a big 2021.\r\n The space agency landed the Perseverance rover on Mars and made the first powered, controlled flight on another planet with the associated Ingenuity helicopter. It launched the… [+7038 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Anurag Roushan", "title": "China builds artificial moon research centre to simulate low gravity on Earth: Report - Republic World", "description": "The artificial moon is housed in a vacuum chamber, despite the fact that it is only 60 centimetres in diameter compared to the actual moon's 3,474.8 kilometres.", "url": "https://www.republicworld.com/world-news/china/china-builds-artificial-moon-research-centre-to-simulate-low-gravity-on-earth-report-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/bf3kbt1njgblxdlq_1642342693.jpeg", "publishedAt": "2022-01-16T14:42:00Z", "content": "China has established an artificial moon research centre that simulates low-gravity conditions to aid in the exploration of the satellite. According to Li Ruilin of the China University of Mining and… [+2127 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Lunar water discovered for the first time on the lunar surface - BollyInside", "description": "Water is a rare resource in deep space. Given that it’s a vital, life-sustaining ingredient, the scarcity of it beyond Earth presents an obstacle for", "url": "https://www.bollyinside.com/news/lunar-water-discovered-for-the-first-time-on-the-lunar-surface", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-01-16T14:18:27Z", "content": "Water is a rare resource in deep space. Given that its a vital, life-sustaining ingredient, the scarcity of it beyond Earth presents an obstacle for people to explore space. Scientists have been inte… [+3591 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Astronomers Create Largest Ever 3D Map of the Cosmos - Interesting Engineering", "description": "The project is called the Dark Energy Spectroscopic Instrument (DESI) and it's run by the Lawrence Berkeley National Laboratory's Department of Energy.", "url": "https://interestingengineering.com/astronomers-create-largest-ever-3d-map-of-the-cosmos", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/M3Oej9mnGN/sizes/the-map_md.jpg", "publishedAt": "2022-01-16T14:15:26Z", "content": "You may have heard of the Dark Energy Spectroscopic Instrument (DESI) from the Lawrence Berkeley National Laboratory's Department of Energy. We reported on the project all the way back in 2016 when t… [+1626 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ashley Hamer", "title": "Are daddy longlegs really the most venomous spiders in the world? - Livescience.com", "description": "These long-legged animals look creepy, but are they dangerous?", "url": "https://www.livescience.com/are-daddy-longlegs-the-most-venomous-spiders", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GfVShUkPEwa8PYaA7FaZHb-1200-80.jpg", "publishedAt": "2022-01-16T12:00:00Z", "content": "You've probably heard this playground legend: Daddy longlegs are the most venomous spiders in the world, but their fangs are too short to bite you. Is this really true? \r\nThe short answer: no. But to… [+3514 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "What Is the Origin of Earth's Oxygen? - Optic Flux", "description": "There is a lot of oxygen on Earth, but where did it come from?Today, about 21% of the air on Earth is made up of oxygen. But our planet's atmosphere took a long time to get to the point where it was safe to breathe. A mix of gases that formed a thick blanket …", "url": "https://www.opticflux.com/what-is-the-origin-of-earths-oxygen/14414/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/01/ImageWall5_1920x1200-80-1.jpg", "publishedAt": "2022-01-16T11:32:02Z", "content": "There is a lot of oxygen on Earth, but where did it come from?Today, about 21% of the air on Earth is made up of oxygen.\r\nBut our planet’s atmosphere took a long time to get to the point where it was… [+4696 chars]"}, {"source": {"id": null, "name": "The Ritz Herald"}, "author": "Ryan Offman", "title": "New Research May Help Scientists Unravel the Physics of the Solar Wind - The Ritz Herald", "description": "A new study led by University of Minnesota Twin Cities researchers, using data from NASA’s Parker Solar Probe, provides insight into what generates and accelerates the solar wind, a stream…", "url": "https://ritzherald.com/new-research-may-help-scientists-unravel-the-physics-of-the-solar-wind/", "urlToImage": "https://ritzherald.com/wp-content/uploads/2022/01/New-Research-May-Help-Scientists-Unravel-the-Physics-of-the-Solar-Wind.jpg", "publishedAt": "2022-01-16T10:51:22Z", "content": "A new study led by University of Minnesota Twin Cities researchers, using data from NASAs Parker Solar Probe, provides insight into what generates and accelerates the solar wind, a stream of charged … [+5217 chars]"}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": "", "title": "Astrophysicists will 'keep tabs' on large asteroid passing by earth - The Mercury", "description": "Astrophysicist Brad Tucker says the scientific community will “keep tabs on” an asteroid twice the size of the Empire State Building, which is set to pass by earth this week.\n\nThe asteroid, named Asteroid 7482, is one kilometre wide and travelling at 19 kilom…", "url": "https://www.themercury.com.au/business/astrophysicists-will-keep-tabs-on-large-asteroid-passing-by-earth/video/b83c26e9877821900777ec28f77379c7?nk=513a2dec8f990532659661d085cb6a9a-1642337446", "urlToImage": "https://content.api.news/v3/images/bin/37bf55dad7ec1f51df1615545eff2392", "publishedAt": "2022-01-16T07:36:50Z", "content": "Astrophysicist Brad Tucker says the scientific community will “keep tabs on” an asteroid twice the size of the Empire State Building, which is set to pass by earth this week.\r\nThe asteroid, named Ast… [+438 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "How wandering bodies in interstellar space ended up on their own - The Tribune", "description": "We now know of almost 5,000 planets outside the Solar System. If you were to picture what it would be like on one of these distant worlds, or exoplanets, your mental image would probably include a parent star &ndash; or more than one, especially if you're a S…", "url": "https://www.tribuneindia.com/news/schools/how-wandering-bodies-in-interstellar-space-ended-up-on-their-own-361761", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/1/2022_1$largeimg_1871091274.jpg", "publishedAt": "2022-01-16T07:25:00Z", "content": "Milton Keynes (UK), January 16\r\nWe now know of almost 5,000 planets outside the Solar System. If you were to picture what it would be like on one of these distant worlds, or exoplanets, your mental i… [+5451 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "Yutu-2 Chinese Rover Unveils Mysterious Shape on the Hidden Side of the Moon – Air & Naval Defense - Play Crazy Game", "description": "Our Space, a Chinese Space Administration outreach program, revealed that the cubic formation with the appearance of a “mystery house” detected across the moon last month by the Yutu-2 rover is a rock, according to with a post made this Friday to his WeChat a…", "url": "https://playcrazygame.com/2022/01/09/yutu-2-chinese-rover-unveils-mysterious-shape-on-the-hidden-side-of-the-moon-air-naval-defense/", "urlToImage": "https://cdn-defesaaereanaval.nuneshost.com/wp-content/uploads/2022/01/Mistério-na-Lua.jpg", "publishedAt": "2022-01-16T07:22:10Z", "content": "Our Space, a Chinese Space Administration outreach program, revealed that the cubic formation with the appearance of a mystery house detected across the moon last month by the Yutu-2 rover is a rock,… [+1760 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: Indonesia's sweeping restructuring of science sector faces criticism; Anemia in astronauts could be a challenge for space missions - Devdiscourse", "description": "The policy will see half a dozen science, technology and research institutes integrated into a National Research and Innovation Agency (BRIN), a move the government hopes will improve access to resources and funding, and boost competitiveness.  Anemia in astr…", "url": "https://www.devdiscourse.com/article/technology/1884931-science-news-roundup-indonesias-sweeping-restructuring-of-science-sector-faces-criticism-anemia-in-astronauts-could-be-a-c", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_06_2021_09_58_02_3896563.jpg?width=920&format=jpeg", "publishedAt": "2022-01-16T04:57:26Z", "content": "Following is a summary of current science news briefs.\r\nIndonesia's sweeping restructuring of science sector faces criticism\r\nIndonesia's government is facing criticism from some top scientists and l… [+875 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Harikrishnan Nair", "title": "Space travel destroys 3 million red blood cells per second - Sydney Morning Herald", "description": "Doctors thought ‘space anaemia’ was a temporary problem, new research shows it could interfere with future planned missions.", "url": "https://www.smh.com.au/world/north-america/space-travel-destroys-3-million-red-blood-cells-per-second-20220116-p59om0.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.22859999999999997%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_99/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/129d4cf1b19585120e96a34fe409b4915ca9f9cd", "publishedAt": "2022-01-16T04:06:31Z", "content": "The astronauts generated extra red cells to compensate for the destroyed ones. But, Trudel asked, how long can the body constantly produce 50 per cent more red cells? A round trip mission to Mars wou… [+1158 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Infamous Mars meteorite contains organic molecules. But they aren’t proof of life. - newsconcerns", "description": "Organic molecules found in a Mars meteorite that crash-landed on Earth are not signs of life, but instead formed in chemical reactions between water and rock on the Red Planet about 4 billion years ago, a new study finds. These findings could shed li", "url": "https://newsconcerns.com/infamous-mars-meteorite-contains-organic-molecules-but-they-arent-proof-of-life/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zhc58vBrDQ5L8szVZB5bfB-1200-80.jpg", "publishedAt": "2022-01-16T01:44:33Z", "content": "Organic molecules found in a Mars meteorite that crash-landed on Earth are not signs of life, but instead formed in chemical reactions between water and rock on the Red Planet about 4 billion years a… [+3615 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Fuzzy molecular threesome is basis of gene expression — ScienceDaily - The News Motion", "description": "Specific nuclear proteins act as a glue to pack genetic material in an absurdly small space in the human body. Proteins \"gluing\" DNA are called linker histones, and hold their secret in their electric charge. They are strongly positively charged, fus", "url": "https://thenewsmotion.com/fuzzy-molecular-threesome-is-basis-of-gene-expression-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-16T01:01:52Z", "content": "Specific nuclear proteins act as a glue to pack genetic material in an absurdly small space in the human body. Proteins “gluing” DNA are called linker histones, and hold their secret in their electri… [+2940 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "TAMMY SEWELL", "title": "80 years of Stephen Hawking: 8 books to enter the thought of the great astrophysicist - OI Canadian", "description": "Scientist Stephen Hawking would turn 80 on January 8On January 8, 1942, the day three hundred years had passed since the death of Galileo, in the city of Oxford was born Stephen Hawking. His parents l", "url": "https://oicanadian.com/80-years-of-stephen-hawking-8-books-to-enter-the-thought-of-the-great-astrophysicist/", "urlToImage": "https://www.infobae.com/new-resizer/f0sZm1WhZVCBf8a0kYLUIhK_16k=/1200x628/filters:format(webp):quality(85)//cloudfront-us-east-1.images.arcpublishing.com/infobae/FYUMK33AG5H5HPD4KBU6YENEHY.jpg", "publishedAt": "2022-01-16T00:14:44Z", "content": "On January 8, 1942, the day three hundred years had passed since the death of Galileo, in the city of Oxford was born Stephen Hawking. His parents lived in North London, but during the bombings of Wo… [+5643 chars]"}, {"source": {"id": null, "name": "Lake Country Calendar"}, "author": "Bailey Moreton", "title": "Space travel can improve everyone's lives, says Canadian astronaut Chris Hadfield – Lake Country Calendar - Lake Country Calendar", "description": "<p>Improvements in space technology accelerating, having major impact on life on Earth </p>", "url": "https://www.lakecountrycalendar.com/news/space-travel-can-improve-everyones-lives-says-canadian-astronaut-chris-hadfield/", "urlToImage": "https://www.lakecountrycalendar.com/wp-content/uploads/2022/01/27839615_web1_25788207-8af8c497f3a548acb6ee68d58168c9db-1024x677.jpg", "publishedAt": "2022-01-15T23:00:00Z", "content": "Space exploration continues to deliver benefits to life on Earth, despite criticism of recent private ventures into the beyond by billionaires, according to Canadian astronaut Cmdr. Chris Hadfield.\r\n… [+3524 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "A Massive Icefish Breeding Colony Secretly Existed in Antarctica – Until Now - The bharat express news", "description": "A polar research exploration has discovered a previously unknown breeding colony of millions of fish in an icy Antarctic sea.Considered the largest known", "url": "https://www.thebharatexpressnews.com/a-massive-icefish-breeding-colony-secretly-existed-in-antarctica-until-now/", "urlToImage": "https://img.huffingtonpost.com/asset/61e33f49260000edf03d2d41.jpg?cache=cKyAIv3TEP&ops=scalefit_720_noupscale", "publishedAt": "2022-01-15T22:15:33Z", "content": "A polar research exploration has discovered a previously unknown breeding colony of millions of fish in an icy Antarctic sea.\r\nConsidered the largest known fish breeding site in the world, Jonah’s ap… [+1848 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Thomas Villagomez", "title": "This week’s Russian spacewalk: how to watch it from outside the International Space Station - Ceng News", "description": "Two Russian cosmonauts are scheduled to perform a spacewalk outside the International Space Station this week to prepare a Russian", "url": "https://www.cengnews.com/tech/this-weeks-russian-spacewalk-how-to-watch-it-from-outside-the-international-space-station-195690.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/01/iss066e096810_large1.jpg", "publishedAt": "2022-01-15T18:58:42Z", "content": "Two Russian cosmonauts are scheduled to perform a spacewalk outside the International Space Station this week to prepare a Russian space station module for future missions. The entire spacewalk will … [+1644 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "NASA Says That It Is Running Out Of Astronauts - Wonderful Engineering", "description": "Advertisement Several employers are having problems in finding employees and now NASA is one of them. A new report has been released by the agency’s Office of Investigator General which stated that the astronaut corps is shrinking, and it has not been like th…", "url": "https://wonderfulengineering.com/nasa-says-that-it-is-running-out-of-astronauts/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/01/imgonline-com-ua-resize-ssHVPXROx1wnbm5J.jpg", "publishedAt": "2022-01-15T18:58:08Z", "content": "Several employers are having problems in finding employees and now NASA is one of them.\r\nA new report has been released by the agencys Office of Investigator General which stated that the astronaut c… [+1702 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Astronomers might have spotted one of the first exomoons - Digital Trends", "description": "Astronomers from Columbia University believe they may have located evidence of an exomoon, or a moon outside our solar system.", "url": "https://www.digitaltrends.com/news/exomoon-candidate-spotted/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/david-kipping-exomoon-illustration1.jpg", "publishedAt": "2022-01-15T18:18:15Z", "content": "We have now confirmed the existence of over 4,000 exoplanets, or planets outside our solar system, which are teaching us about how planets and systems form and could even help us locate other habitab… [+2042 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Brad Tucker", "title": "Excitement builds for photos from NASA's James Webb Space Telescope - The Canberra Times", "description": "Nervous eyes from astronomers all around the world watched as it took off into space. The launch was almost textbook.", "url": "https://www.canberratimes.com.au/story/7582139/seeing-the-universe-in-a-whole-new-light/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/rJkJNFPcdBkDQKqtkgHSjA/0ccd3c11-b291-41a0-aeb4-43f9653c5b2b.jpg/r12_162_5187_3086_w1200_h678_fmax.jpg", "publishedAt": "2022-01-15T18:00:00Z", "content": ""}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "NASA's InSight put into safe mode during Martian dust storm - Digital Trends", "description": "A dust storm on Mars has required that the NASA InSight lander be placed into safe mode in order to preserve its battery power.", "url": "https://www.digitaltrends.com/news/insight-dust-storm-safe-mode/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/jpegpia23203-width-13201.jpg", "publishedAt": "2022-01-15T16:37:17Z", "content": "Mars is a tough environment for many reasons: It’s cold, the atmosphere is extremely thin, and the planet experiences epic dust storms which can cover everything within a region in a coating of parti… [+2401 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "John Drucker", "title": "Astronomers witness red supergiant star's death for the first time - Global Circulate", "description": "Astronomers have captured the death of a red supergiant star for the first time. The real-time discovery was published Jan. 6 in Astrophysical Journal and led by researchers at Northwestern University and the University of California, Berkele", "url": "https://globalcirculate.com/astronomers-witness-red-supergiant-stars-death-for-the-first-time/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/01/red-supergiant.jpg?quality=90&strip=all&w=1024", "publishedAt": "2022-01-15T16:06:03Z", "content": "Astronomers have captured the death of a red supergiant star for the first time. \r\nThe real-time discovery was published Jan. 6 in Astrophysical Journal and led by researchers at Northwestern Univers… [+2631 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ross Pomeroy", "title": "How biomining could sustain space colonies - Big Think", "description": "Coupled with 3D printing, biomining the Moon or Mars with microbes could sustain human colonies without constant re-supply from Earth.", "url": "https://bigthink.com/the-future/biomining-space-colonies/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/01/AdobeStock_48999259.jpeg", "publishedAt": "2022-01-15T16:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exploring Earth From Space: The Stunningly Beautiful Kangerlussuaq Glacier - SciTechDaily", "description": "The Kangerlussuaq Glacier, one of Greenland’s largest tidewater outlet glaciers, is pictured in this false-color image captured by the Copernicus Sentinel-1 mission. Meaning ‘large fjord’ in Greenlandic, the Kangerlussuaq Glacier flows into the head of the Ka…", "url": "https://scitechdaily.com/exploring-earth-from-space-the-stunningly-beautiful-kangerlussuaq-glacier/", "urlToImage": "https://scitechdaily.com/images/Kangerlussuaq-Glacier-Greenland-scaled.jpg", "publishedAt": "2022-01-15T14:39:24Z", "content": "Copernicus Sentinel-1 satellite image of Kangerlussuaq Glacier, Greenland This false-color image shows visible changes on the ground and sea surface between three different acquisition dates. Credit:… [+2754 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "SpaceX Falcon 9 rocket spotted from space before and after epic 105-satellite launch (images) - newsconcerns", "description": "SpaceX has some nice before-and-after photos to mark the 10th launch of one of its Falcon 9 rockets, thanks to a satisfied customer.A Falcon 9 successfully delivered 105 satellites to orbit Thursday (Jan. 13), including 44 \"SuperDove\" cubesats for Pl", "url": "https://newsconcerns.com/spacex-falcon-9-rocket-spotted-from-space-before-and-after-epic-105-satellite-launch-images/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gXTQsYABX9kyfjE8VnB3YJ-1200-80.jpg", "publishedAt": "2022-01-15T14:32:32Z", "content": "SpaceX\r\n has some nice before-and-after photos to mark the 10th launch of one of its Falcon 9 rockets, thanks to a satisfied customer.\r\nA Falcon 9 successfully delivered 105 satellites to orbit Thurs… [+2251 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Observations of a hot Jupiter may also advance our understanding of planet origins and evolution — Sc... - The News Motion", "description": "Imagine being in a place where the winds are so strong that they move at the speed of sound. That's just one aspect of the atmosphere on XO-3b, one of a class of exoplanets (planets outside our solar system), known as hot Jupiters. The eccentric orbi", "url": "https://thenewsmotion.com/observations-of-a-hot-jupiter-may-also-advance-our-understanding-of-planet-origins-and-evolution-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-15T14:04:02Z", "content": "Imagine being in a place where the winds are so strong that they move at the speed of sound. That’s just one aspect of the atmosphere on XO-3b, one of a class of exoplanets (planets outside our solar… [+4048 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Why is the world map you know wrong? - News Concerns", "description": "Walk into any school classroom and you will likely see a flat, rectangular map of the world sprawled across the wall. Generations of children have grown up learning that this projection is what Earth looks like. But does this flat map really reflect", "url": "https://newsconcerns.com/why-is-the-world-map-you-know-wrong/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iS2nbQccNtCe95TdhN3Ee7-1200-80.jpg", "publishedAt": "2022-01-15T13:22:32Z", "content": "Walk into any school classroom and you will likely see a flat, rectangular map of the world sprawled across the wall. Generations of children have grown up learning that this projection is what Earth… [+6339 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "How big does an asteroid have to be to wipe out all life on Earth? - The Goa Spotlight", "description": "Very small asteroids, compared to Earth, have hit our planet in the past, which have caused massive", "url": "https://thegoaspotlight.com/2022/01/15/how-big-does-an-asteroid-have-to-be-to-wipe-out-all-life-on-earth/", "urlToImage": "https://eldiariony.com/wp-content/uploads/sites/2/2022/01/pexels-kid-candy-5425513.jpg?quality=80&strip=all&w=1200", "publishedAt": "2022-01-15T12:07:11Z", "content": "Very small asteroids, compared to Earth, have hit our planet in the past, which have caused massive destruction; naturally, the most notable example is the one that caused the extinction of the non-a… [+2133 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Maxwell Moe", "title": "Harvard Astronomers on the ‘Detective Story’ of a 1,000-Light-Year-Wide Bubble Surrounding Earth - The Daily Galaxy --Great Discoveries Channel", "description": "“This is really an origin story; for the first time we can explain how all nearby star formation began,” says astronomer and data visualization expert Catherine Zucker a NASA Hubble Fellow at the Harvard Center for Astrophysics and Space Science Institute abo…", "url": "https://dailygalaxy.com/2022/01/harvard-astronomers-on-the-detective-story-of-a-1000-light-year-wide-bubble-surrounding-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2022/01/LocalBubbleStarFormation_lores-Nadia-Whitehead_0-1.jpg", "publishedAt": "2022-01-15T12:01:28Z", "content": "“This is really an origin story; for the first time we can explain how all nearby star formation began,” says astronomer and data visualization expert Catherine Zucker a NASA Hubble Fellow at the Har… [+8657 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "UK Space Agency Funds Development of New Laser-Based Satellite Communications System - SciTechDaily", "description": "The UK Space Agency has awarded almost £650,000 to Northumbria University to continue world-leading work to develop the first commercially available laser-based inter-satellite communications system. Currently satellites use radio frequency to transmit data, …", "url": "https://scitechdaily.com/uk-space-agency-funds-development-of-new-laser-based-satellite-communications-system/", "urlToImage": "https://scitechdaily.com/images/Laser-Based-Communication-Between-Satellites.jpg", "publishedAt": "2022-01-15T11:37:23Z", "content": "Artists impression of laser-based communication between satellites. Credit: Northumbria University\r\nThe UK Space Agency has awarded almost £650,000 to Northumbria University to continue world-leading… [+5762 chars]"}, {"source": {"id": null, "name": "Tittlepress.com"}, "author": "newsdesk", "title": "NASA spacecraft touches corona of sun; everything you need to know-World News, Firstpost - TittlePress", "description": "The spacecraft plunged into the unexplored solar atmosphere known as the Sun's corona. He went through an extreme", "url": "https://tittlepress.com/covid19/1453053/", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/12/Space-Touch-the-Sun-640.jpg", "publishedAt": "2022-01-15T10:56:18Z", "content": "The spacecraft plunged into the unexplored solar atmosphere known as the Sun’s corona. He went through an extreme environment of around 2 million degrees Fahrenheit.\r\nArtist’s impression of the Parke… [+6848 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "A treasure map for the realm of electrocatalysts — ScienceDaily - newsconcerns", "description": "Efficient electrocatalysts, which are needed for the production of green hydrogen, for example, are hidden in materials composed of five or more elements. A team has developed an efficient method for identifying promising candidates in the myriad of", "url": "https://newsconcerns.com/a-treasure-map-for-the-realm-of-electrocatalysts-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-15T09:38:35Z", "content": "Efficient electrocatalysts, which are needed for the production of green hydrogen, for example, are hidden in materials composed of five or more elements. A team has developed an efficient method for… [+2627 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study finds copper-based chemicals might be leading to ozone layer depletion - Devdiscourse", "description": "A new study has found that copper released into the environment from brake pads, antifouling paints, and other sources may be contributing significantly to stratospheric ozone depletion.", "url": "https://www.devdiscourse.com/article/science-environment/1884283-study-finds-copper-based-chemicals-might-be-leading-to-ozone-layer-depletion", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/15_01_2022_09_11_44_9076487.jpg?width=920&format=jpeg", "publishedAt": "2022-01-15T09:12:07Z", "content": "A new study has found that copper released into the environment from brake pads, antifouling paints, and other sources may be contributing significantly to stratospheric ozone depletion. The research… [+8678 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Hubble views a tranquil galaxy with an explosive past - Verve Times", "description": "Credit: ESA/Hubble & NASA, D. Jones, A. Riess et al.                        The lazily winding spiral arms of the spectacular galaxy NGC 976 fill the frame of this image from the N", "url": "https://vervetimes.com/hubble-views-a-tranquil-galaxy-with-an-explosive-past/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/hubble-views-a-tranqui.jpg", "publishedAt": "2022-01-15T08:49:58Z", "content": "Credit: ESA/Hubble &amp; NASA, D. Jones, A. Riess et al.\r\nThe lazily winding spiral arms of the spectacular galaxy NGC 976 fill the frame of this image from the NASA/ESA Hubble Space Telescope. This … [+1759 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "At the bottom of the Mediterranean, 'BathyBot' will hunt down the mysteries of the 'dark ocean' - Tech News Inc", "description": "France Press agency , Posted on Friday, January 14, 2022 at 8:32 pm The crane gently deposits the small white and yellow 'rover' mounted on the larvae at", "url": "https://technewsinc.com/at-the-bottom-of-the-mediterranean-bathybot-will-hunt-down-the-mysteries-of-the-dark-ocean/", "urlToImage": "https://media3.woopic.com/api/v1/images/661/afp-news/20b/0e9/bdd1399b9ab809499c08a175a5/au-fond-de-la-mediterranee-bathybot-va-traquer-les-mysteres-de-l-ocean-obscur|000_9W46EM-highDef.jpg?format=470x264&facedetect=1&quality=85", "publishedAt": "2022-01-15T05:24:19Z", "content": "France Press agency , Posted on Friday, January 14, 2022 at 8:32 pm\r\nThe crane gently deposits the small white and yellow ‘rover’ mounted on the larvae at the bottom of a test tank at the Evermer Cen… [+4031 chars]"}]}