{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Mars lander InSight is awake from safe mode after dust storm - Digital Trends", "description": "NASA's InSight lander on Mars has returned to normal operations after a break of around two weeks due to a regional dust storm.", "url": "https://www.digitaltrends.com/news/mars-insight-awake-dust-storm/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/jpegpia23203-width-13201.jpg", "publishedAt": "2022-01-23T12:20:56Z", "content": "NASA’s InSight lander on Mars has returned to normal operations after a break of around two weeks due to a regional dust storm. The lander is currently active, but its science instruments will remain… [+2305 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "No Way to Stop the Melting of the \"Doomsday Glacier\" It Could Fall Apart in Decades - Optic Flux", "description": "Researchers say the \"Doomsday Glacier\" is irreversibly melting and may come apart in decades. A recent interview with atmospheric scientist David Holland of New York University exposes truths about the melting Thwaites Glacier. Axios said this morning that th…", "url": "https://www.opticflux.com/no-way-to-stop-the-melting-of-the-doomsday-glacier-it-could-fall-apart-in-decades/14868/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/01/cold-1866516_960_720.jpg", "publishedAt": "2022-01-23T11:38:01Z", "content": "Researchers say the “Doomsday Glacier” is irreversibly melting and may come apart in decades.\r\nA recent interview with atmospheric scientist David Holland of New York University exposes truths about … [+1880 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Earth's Core is Cooling Quicker than Previously Anticipated, According to Scientists - Optic Flux", "description": "According to experts, the Earth's core is cooling faster than previously believed, which might hasten the planet's eventual march toward uninhabitability in millions or billions of years. For the duration of Earth's 4.5 billion-year history, the planet's inte…", "url": "https://www.opticflux.com/earths-core-is-cooling-quicker-than-previously-anticipated-according-to-scientists/14864/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/01/earth-1756274_960_720.webp", "publishedAt": "2022-01-23T11:09:35Z", "content": "According to experts, the Earth’s core is cooling faster than previously believed, which might hasten the planet’s eventual march toward uninhabitability in millions or billions of years.\r\nFor the du… [+1925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Study provides new insights into seasons on a planet outside our solar system - Times of India", "description": "Science News: MONTREAL: A recent study provided new insights into what seasons looked like on a planet outside our solar system.", "url": "https://timesofindia.indiatimes.com/home/science/study-provides-new-insights-into-seasons-on-a-planet-outside-our-solar-system/articleshow/89073710.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-01-23T09:33:00Z", "content": null}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Increasingly efficient production of human pluripotent stem cells - The News Motion", "description": "Reliable production of high-quality iPS cells enables their increasingly efficient utilization in biomedical applications. Credit: Ras Trokovic, University of Helsinki", "url": "https://thenewsmotion.com/increasingly-efficient-production-of-human-pluripotent-stem-cells/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-opportunities-for-1.jpg", "publishedAt": "2022-01-23T08:37:41Z", "content": "Researchers at the University of Helsinki have developed a new, faster and more reliable technique for reverting human cells to the stem cell state. Pluripotent stem cells are a key tool in biomedici… [+3204 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Explores Methods to Help Reduce Injury After Successful Post-concussion Return-to-play - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Injuries and concussions are part and parcel of sports, as has been observed over so many years. A new study has examined the efficacy of neuromuscular training (NMT) intervention, which may lead to new t…", "url": "https://www.latestly.com/agency-news/health-news-study-explores-methods-to-help-reduce-injury-after-successful-post-concussion-return-to-play-3283734.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-Health-News-784x441.jpg", "publishedAt": "2022-01-23T07:42:20Z", "content": "Colorado [US], January 23 (ANI): Injuries and concussions are part and parcel of sports, as has been observed over so many years. A new study has examined the efficacy of neuromuscular training (NMT)… [+4740 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "NASA offers $1mn for innovative, sustainable ideas to feed astronauts in space - mid-day.com", "description": "In coordination with the Canadian Space Agency, NASA has launched the 'Deep Space Food Challenge' that calls on teams to design, build, and demonstrate prototypes of food production technologies that provide tangible nutritional products -- or food", "url": "https://www.mid-day.com/lifestyle/culture/article/nasa-offers-1mn-dollars-for-innovative-and-sustainable-ideas-to-feed-astronauts-in-space-23210953", "urlToImage": "https://images.mid-day.com/images/images/2022/jan/NASA_d.png", "publishedAt": "2022-01-23T06:35:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Bioengineers Have Modeled The Workings of The World's Most Basic Synthetic Life Form - ScienceAlert", "description": "Life is complicated. Even the smallest cells contain a mind-blowing assortment of chemical reactions that allow them to thrive in a chaotic landscape.", "url": "https://www.sciencealert.com/bioengineers-have-modelled-the-workings-of-the-world-s-most-basic-synthetic-life-form", "urlToImage": "https://www.sciencealert.com/images/2022-01/processed/JCVI-syn3ASim_1024.jpg", "publishedAt": "2022-01-23T06:01:11Z", "content": "Life is complicated. Even the smallest cells contain a mind-blowing assortment of chemical reactions that allow them to thrive in a chaotic landscape.\r\nIf we want to know where to draw the line betwe… [+3977 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "We Will Soon Know the Genome Sequencing of Every Complex Species on Earth - Gizmodo Australia", "description": "The Earth Biogenome Project, a global consortium that aims to sequence the genomes of all complex life on earth (some...", "url": "https://www.gizmodo.com.au/2022/01/we-will-soon-know-the-genome-sequencing-of-every-complex-species-on-earth/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/21/GettyImages-1311468420.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-01-23T05:00:00Z", "content": "The Earth Biogenome Project, a global consortium that aims to sequence the genomes of all complex life on earth (some 1.8 million described species) in ten years, is ramping up.\r\nThe projects origins… [+5491 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Fastest-ever study of how electrons respond to X-rays performed - The News Motion", "description": "Credit: Greg Stewart/SLAC National Accelerator Laboratory                        A study of electron dynamics timed to millionths of a billionth of a second reveals the damage radiatio", "url": "https://thenewsmotion.com/fastest-ever-study-of-how-electrons-respond-to-x-rays-performed/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/fastest-ever-study-of.jpg", "publishedAt": "2022-01-23T04:53:32Z", "content": "A study of electron dynamics timed to millionths of a billionth of a second reveals the damage radiation can do on a molecular level.\r\nThe first-of-its kind study used ultrafast X-ray laser pulses to… [+4654 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Watch: Powerful Solar Flare Captured By NASA's Solar Dynamics Observatory - India Times", "description": "After NASA's Parker Probe reached extremely close to the Sun's corona, the space agency has captured the visuals of a \"significant\" solar flare. Captured at 11:31 am IST on Friday, the mid-level solar flare was captured by NASA's Solar Dynamics Observatory th…", "url": "https://www.indiatimes.com/technology/science-and-future/solar-flare-captured-by-nasa-560013.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jan/Social-image-22_61eab5f6e19bd.jpg", "publishedAt": "2022-01-23T01:55:26Z", "content": "After NASA's Parker Probe reached extremely close to the Sun's corona, the space agency has captured the visuals of a \"significant\" solar flare. Captured at 11:31 am IST on Friday, the mid-level sola… [+2188 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Crystal-clear images of meandering bipolar stellar jets from young stars captured with adaptive optics R... - The News Motion", "description": "Sinuous stellar jets meander lazily across a field of stars in new images captured from Chile by the international Gemini Observatory, a Program of NSF's NOIRLab. The gently curving stellar jets are the outflow from young stars, and astronomers suspe", "url": "https://thenewsmotion.com/crystal-clear-images-of-meandering-bipolar-stellar-jets-from-young-stars-captured-with-adaptive-optics-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-23T00:41:53Z", "content": "Sinuous stellar jets meander lazily across a field of stars in new images captured from Chile by the international Gemini Observatory, a Program of NSF’s NOIRLab. The gently curving stellar jets are … [+4991 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "Brazil discovers 25 asteroids, one of them is rare and may be on its way - Sprout Wired", "description": "medical student, Verena Pacola Menezes, 22, prefers to spend her time between microscopes and telescopes. While the former helps him...", "url": "https://www.sproutwired.com/brazil-discovers-25-asteroids-one-of-them-is-rare-and-may-be-on-its-way/", "urlToImage": "https://www.sproutwired.com/wp-content/uploads/2022/01/Brazil-discovers-25-asteroids-one-of-them-is-rare-and.png", "publishedAt": "2022-01-23T00:36:42Z", "content": "medical student, \r\nVerena Pacola Menezes, 22, prefers to spend her time between microscopes and telescopes. While the former helps him become a neurosurgeon, binoculars have shown Medicine Location. … [+2696 chars]"}, {"source": {"id": null, "name": "Heraldoffashion.com"}, "author": "Arzu", "title": "There are about 40 billion black holes in the universe! - Herald of Fashion", "description": "We do not know how far the universe stretches in space, but we do know how to estimate the size of what is called the observable universe. The team of", "url": "https://heraldoffashion.com/there-are-about-40-billion-black-holes-in-the-universe/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/8/0/8/808b341731_50173138_trou-noir-esa-hubble-n-bartmann.jpg", "publishedAt": "2022-01-22T21:19:21Z", "content": "We do not know how far the universe stretches in space, but we do know how to estimate the size of what is called the observable universe. The team of astronomers believes they have succeeded in mode… [+7263 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This Adorable Jumping Spider Can't Actually See Its Own Most Vivid Color - ScienceAlert", "description": "Jumping spiders may have exceptional eyes, but one adorable species seems to have a curious lack in the vision department. New experimental evidence suggests that a jumping spider called Saitis barbipes has no photoreceptors capable of perceiving the", "url": "https://www.sciencealert.com/this-adorable-jumping-spider-can-t-see-its-own-most-vivid-color", "urlToImage": "https://www.sciencealert.com/images/2022-01/processed/saidis-barbipes-header-inaturalist_1024.jpg", "publishedAt": "2022-01-22T21:01:00Z", "content": "Jumping spiders may have exceptional eyes, but one adorable species seems to have a curious lack in the vision department. New experimental evidence suggests that a jumping spider called Saitis barbi… [+3544 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Scientists detect something really unexpected beneath Saturn's 'Death Star' moon - Mashable", "description": "Mimas couldn't possibly harbor an ocean. Or could it?", "url": "https://mashable.com/article/moon-ocean-detection-mimas-saturn", "urlToImage": "https://helios-i.mashable.com/imagery/articles/011EaGrQ7947NUUQjoHL2wQ/hero-image.fill.size_1200x675.v1642797113.jpg", "publishedAt": "2022-01-22T20:49:51Z", "content": null}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Discover Black Hole That's Creating Stars Instead of Devouring Them - Futurism", "description": "The Hubble Space Telescope found a star formation in a dwarf starburst galaxy. The black hole in the center may have actually created the star formation.", "url": "https://futurism.com/the-byte/black-hole-creating-stars", "urlToImage": "https://wp-assets.futurism.com/2022/01/black-hole-creates-stars.png", "publishedAt": "2022-01-22T20:28:46Z", "content": "Is this the least deadly black hole in the universe?\r\nLets Be Friends\r\nNot all black holes are the destructive monsters theyre often made out to be, according to new research done with the Hubble Spa… [+1902 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Flight Destroys Red Blood Cells - SciTechDaily", "description": "It’s really true: space wants to kill us. And this time, space is trying to kill us from the inside out. A new study on astronauts living on board the International Space Station shows that while in space, the astronauts’ bodies destroyed 54 percent more red …", "url": "https://scitechdaily.com/space-flight-destroys-red-blood-cells/", "urlToImage": "https://scitechdaily.com/images/Astonaut-Anne-McClain-Holding-Biomedical-Gear-for-MARROW-scaled.jpg", "publishedAt": "2022-01-22T19:39:42Z", "content": "Flight Engineer Anne McClain in the cupola holding biomedical gear for MARROW. Credit: NASA\r\nIt’s really true: space wants to kill us. And this time, space is trying to kill us from the inside out.\r\n… [+5206 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Brian Koberlein", "title": "SpaceX Starlink: Why humanity needs to act now before it's too late - Inverse", "description": "It is clear we will soon need to make some difficult choices about satellite Internet. SpaceX Starlink and Amazon Project Kuiper could soon take charge.", "url": "https://www.inverse.com/science/spacex-starlink-amazon-interference", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/1/20/1aee3bdf-9ac0-4ffb-971f-18924872ca78-51135650621_187bc9fa5b_o.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-01-22T19:01:25Z", "content": "With the rapid\r\n expansion of commercial space, there is a growing number of satellites in orbit around our planet. Most of these are in low-Earth orbit, which is becoming increasingly crowded. This … [+2968 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Scientists Have Proposed A Mission To Track Down A Strange Galactic Object - Wonderful Engineering", "description": "Advertisement A space mission to study the strange cosmic object known as ‘Oumuamua,’ which has interested astronomers for years and has been hypothetically connected to extraterrestrial life, has been suggested by scientists. In 2017, Oumuamua was discovered…", "url": "https://wonderfulengineering.com/scientists-have-proposed-a-mission-to-track-down-a-strange-galactic-object/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/01/oumuamua.jpg", "publishedAt": "2022-01-22T18:59:25Z", "content": "A space mission to study the strange cosmic object known as ‘Oumuamua,’ which has interested astronomers for years and has been hypothetically connected to extraterrestrial life, has been suggested b… [+3367 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "NASA’s gamma-ray burst hunting Swift Observatory in safe mode - Digital Trends", "description": "An issue with NASA's Swift Observatory has forced it to suspend science operations and enter safe mode while the team investigates.", "url": "https://www.digitaltrends.com/news/nasa-swift-observatory-issue/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/swift1.jpg", "publishedAt": "2022-01-22T18:41:48Z", "content": "An issue with NASA’s Swift Observatory has forced it to suspend science operations and enter safe mode while the team investigates. The space-based telescope is not one of NASA’s best-known missions,… [+2060 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Martian dust storm delays next flight of Ingenuity helicopter - Digital Trends", "description": "Earth isn't the only place where bad weather affects space flights. The weather on Mars can also be tricky, causing problems for the Ingenuity helicopter.", "url": "https://www.digitaltrends.com/news/mars-ingenuity-dust-storm-delay/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/26498_pia25096-web1.jpg", "publishedAt": "2022-01-22T18:00:26Z", "content": "Earth isn’t the only place where bad weather affects space flights. The weather on Mars can also be tricky, and recently it has caused some problems for the planned flight of the Ingenuity helicopter… [+2581 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "Here's what would really happen if an asteroid was going to hit Earth - SlashGear", "description": "If you watched Don’t Look Up this Christmas, you might be one of many people wondering about how realistic the danger posited by the movie was. Could Earth really be struck by an asteroid? Ho…", "url": "https://www.slashgear.com/heres-what-would-really-happen-if-an-asteroid-was-going-to-hit-earth-22708356/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2022/01/asteroid-1.jpg", "publishedAt": "2022-01-22T17:05:34Z", "content": "If you watched Don’t Look Up this Christmas, you might be one of many people wondering about how realistic the danger posited by the movie was. Could Earth really be struck by an asteroid? How would … [+3033 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Consistent Asteroid Collisions Rock Previous Thinking on Mars Impact Craters - SciTechDaily", "description": "New Curtin University research has confirmed the frequency of asteroid collisions that formed impact craters on Mars has been consistent over the past 600 million years. New Curtin University research has confirmed the frequency of asteroid collisions that fo…", "url": "https://scitechdaily.com/consistent-asteroid-collisions-rock-previous-thinking-on-mars-impact-craters/", "urlToImage": "https://scitechdaily.com/images/Ancient-Crater-Triplet-on-Mars-Perspective-View.jpg", "publishedAt": "2022-01-22T16:25:32Z", "content": "ByCurtin UniversityJanuary 22, 2022\r\nThis image provides a perspective view of a triple crater in the ancient Martian highlands. Credit: ESA/DLR/FU Berlin\r\nNew Curtin University research has confirme… [+3594 chars]"}, {"source": {"id": null, "name": "Theglobalherald.com"}, "author": "News Desk", "title": "Watch again: SpaceX cargo ship departs from station - The Global Herald - The Global Herald", "description": "The Independent published this video item, entitled \"Watch again: SpaceX cargo ship departs from station\" - below is their description.", "url": "https://theglobalherald.com/news/watch-again-spacex-cargo-ship-departs-from-station/", "urlToImage": null, "publishedAt": "2022-01-22T16:08:52Z", "content": "The Independent published this video item, entitled Watch again: SpaceX cargo ship departs from station below is their description.Got a comment? Leave your thoughts in the comments section, below. P… [+52 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "Mysterious rocks painted violet have been found everywhere on Mars - brytfmonline.com", "description": "Red may be the dominant color associated with the red planet, but it’s purple. determination...", "url": "https://www.brytfmonline.com/mysterious-rocks-painted-violet-have-been-found-everywhere-on-mars/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/01/Mysterious-rocks-painted-violet-have-been-found-everywhere-on-Mars.jpg", "publishedAt": "2022-01-22T15:14:29Z", "content": "Red may be the dominant color associated with the red planet, but it’s purple. determination Continue to find Mars. Violet painted rocks to be exact. They are everywhere. \r\nThe brave Mars rover has f… [+3075 chars]"}, {"source": {"id": null, "name": "Techgamingreport.com"}, "author": "Mortimer Rodgers", "title": "The Resort House discharges straight into the ditch that turns into nauseating: two administrators denounced - Tech Gaming Report", "description": "PORTO RECANATI – The smell of the Fosso della Vena is pestilent and the protests...", "url": "https://www.techgamingreport.com/the-resort-house-discharges-straight-into-the-ditch-that-turns-into-nauseating-two-administrators-denounced/", "urlToImage": "https://www.techgamingreport.com/wp-content/uploads/2022/01/The-Hotel-House-discharges-directly-into-the-ditch-that-becomes.jpg", "publishedAt": "2022-01-22T14:36:59Z", "content": "PORTO RECANATI – The smell of the Fosso della Vena is pestilent and the protests of the neighbors drive the forestry law enforcement to denounce two previous administrators of thehotel house for air … [+2998 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Has a Zany Plan to Sail to an Asteroid - Gizmodo Australia", "description": "NASA wants to propel a shoebox-sized spacecraft to an asteroid using a solar sail, the first deep space mission by the agency...", "url": "https://www.gizmodo.com.au/2022/01/nasa-has-a-zany-plan-to-sail-to-an-asteroid/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/23/8a317fa28e3c7173754e656815d17bc9.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2022-01-22T14:00:00Z", "content": "NASA wants to propel a shoebox-sized spacecraft to an asteroid using a solar sail, the first deep space mission by the agency to use such a mechanism.\r\nThe Near-Earth Asteroid Scout (NEA Scout) is a … [+2461 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Black holes eating each other confirmed to collide in eccentric orbits for the 1st time - Republic World", "description": "The study experts said that this eccentric circle also underlines the fact that two black holes consume other black holes at the center of a galaxy.", "url": "https://www.republicworld.com/technology-news/science/black-holes-eating-each-other-confirmed-to-collide-in-eccentric-orbits-for-the-1st-time-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ivm9rmxrknhcrzox_1642858514.jpeg", "publishedAt": "2022-01-22T13:44:00Z", "content": "In a historic first, a team of astronomers has confirmed the detection of two black holes merging into one after spiralling in eccentric orbits. Conducted by researchers from the Rochester Institute … [+2154 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Find the Biggest Structure in the Milky Way: Filament of Hydrogen 3,900 Light-Years Long - SciTechDaily", "description": "Roughly 13.8 billion years ago, our Universe was born in a massive explosion that gave rise to the first subatomic particles and the laws of physics as we know them. About 370,000 years later, hydrogen had formed, the building block of stars, which fuse hydro…", "url": "https://scitechdaily.com/astronomers-find-the-biggest-structure-in-the-milky-way-filament-of-hydrogen-3900-light-years-long/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Galaxy-Artists-Conception.jpg", "publishedAt": "2022-01-22T13:17:00Z", "content": "ByMatt Williams, Universe TodayJanuary 22, 2022\r\nArtist’s conception of the Milky Way galaxy. Credit: Pablo Carlos Budassi\r\nRoughly 13.8 billion years ago, our Universe was born in a massive explosio… [+7955 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Star search: Canadian scientist to travel way back in time using world's largest space telescope - CBC.ca", "description": "The James Webb Space Telescope was recently launched into space. It's NASA’s largest and most powerful space telescope ever constructed. Astrophysicist Tyrone Woods, originally from Edmonton, hopes to use it to find the first stars ever created.", "url": "https://www.cbc.ca/news/canada/edmonton/star-search-canadian-scientist-to-travel-way-back-in-time-using-world-s-largest-space-telescope-1.6322347", "urlToImage": "https://i.cbc.ca/1.6322367.1642721715!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/james-webb-space-telescope-launch.jpg", "publishedAt": "2022-01-22T13:00:00Z", "content": "A team of astrophysicists may soon be getting a key to unlocking the mystery on the origins of life. \r\nThe James Webb Space Telescope was launched into space from French Guiana in South America on De… [+2911 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "Gorilla in space. Astronauts experienced moments of horror - Spark Chronicles", "description": "Mark Kelly, one of NASA's two famous astronaut brothers, once smuggled a full gorilla outfit aboard", "url": "https://sparkchronicles.com/gorilla-in-space-astronauts-experienced-moments-of-horror-2/", "urlToImage": "https://i.iplsc.com/-/000EAIM8KUJ532YS-C411.jpg", "publishedAt": "2022-01-22T12:55:18Z", "content": "Mark Kelly, one of NASA’s two famous astronaut brothers, once smuggled a full gorilla outfit aboard International Space Station. He didn’t tell anyone about it. One day, without anyone knowing, he pu… [+2022 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Exoplanet discovered by NASA's TESS might be first to get swallowed by its host star - Republic World", "description": "The planets TOI-2337b, TOI-4329b, and TOI-2669b, were found in the images taken between 2018 and 2019 and are orbiting dangerously close to their star.", "url": "https://www.republicworld.com/science/space/exoplanet-discovered-by-nasas-tess-might-be-first-to-get-swallowed-by-its-host-star-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/mib6uglsvhn91wqf_1642853934.jpeg", "publishedAt": "2022-01-22T12:43:00Z", "content": "Three Jupiter-like gas giants, which were discovered using NASAs Transiting Exoplanet Survey Satellite (TESS) will soon be swallowed by their host stars, a new study finds. The planets TOI-2337b, TOI… [+2179 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Tug of Sun, Moon could be driving plate motions on 'imbalanced' Earth: Study - Devdiscourse", "description": "A recent study proposed that the imbalanced forces and torques in the Earth-moon-sun system drive the circulation of the whole mantle.", "url": "https://www.devdiscourse.com/article/science-environment/1893527-tug-of-sun-moon-could-be-driving-plate-motions-on-imbalanced-earth-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_01_2022_12_19_45_6510088.jpg?width=920&format=jpeg", "publishedAt": "2022-01-22T12:19:47Z", "content": "A recent study proposed that the imbalanced forces and torques in the Earth-moon-sun system drive the circulation of the whole mantle. The study, led by geophysicist Anne M. Hofmeister was published … [+2940 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "Two new Space Force satellites launched aboard unique Atlas V rocket - TweakTown", "description": "The United Launch Alliance (ULA) has launched two satellites for the United States Space Force (USSF) for the USSF-8 mission.", "url": "https://www.tweaktown.com/news/84159/two-new-space-force-satellites-launched-aboard-unique-atlas-rocket/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84159_01_ulas-atlas-launches-satellite-inspection-mission-for-space-force_full.jpg", "publishedAt": "2022-01-22T11:00:02Z", "content": "Known as Big Slider, the Atlas V rocket was launched on January 21st, 2022.\r\nThe Atlas V rocket launched from the Space Launch Complex 41 at Cape Canaveral Space Force Station in Florida, with liftof… [+903 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope's Million Mile Journey to L2 Is Nearly Complete - SciTechDaily", "description": "On Monday, January 24, engineers plan to instruct NASA’s James Webb Space Telescope to complete a final correction burn that will place it into its desired orbit, nearly 1 million miles away from the Earth at what is called the second Sun-Earth Lagrange point…", "url": "https://scitechdaily.com/webb-space-telescopes-million-mile-journey-to-l2-is-nearly-complete/", "urlToImage": "https://scitechdaily.com/images/Webb-Telescope-L2-Flyby.gif", "publishedAt": "2022-01-22T10:54:48Z", "content": "ByNASAJanuary 22, 2022\r\nThe James Webb Space Telescope (JWST) is the next of NASA’s Great Observatories; following in the line of the Hubble Space Telescope, the Compton Gamma-ray Observatory, the Ch… [+6403 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "Exotic 'X' particles detected for the first time in quark-gluon plasma - TweakTown", "description": "MIT physicists have identified around a hundred X particles in the quark-gluon plasma made by the Large Hadron Collider at CERN.", "url": "https://www.tweaktown.com/news/84158/exotic-particles-detected-for-the-first-time-in-quark-gluon-plasma/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84158_01_first-detection-of-exotic-x-particles-in-quark-gluon-plasma_full.jpg", "publishedAt": "2022-01-22T10:30:02Z", "content": "The detection is detailed in a new study published in the journal Physical Review Letters.\r\nImmediately following the Big Bang, the universe was an extremely hot, concentrated plasma of elementary pa… [+1218 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DNA Mutations Are Not Random: New Research Radically Changes Our Understanding of Evolution - SciTechDaily", "description": "Findings could lead to advances in plant breeding, human genetics. A simple roadside weed may hold the key to understanding and predicting DNA mutation, according to new research from University of California, Davis, and the Max Planck Institute for Developme…", "url": "https://scitechdaily.com/dna-mutations-are-not-random-new-research-radically-changes-our-understanding-of-evolution/", "urlToImage": "https://scitechdaily.com/images/Arabidopsis-1.jpg", "publishedAt": "2022-01-22T10:09:58Z", "content": "ByUniversity of California - DavisJanuary 22, 2022\r\nStudying the genome of thale cress, a small flowering weed, led to a new understanding about DNA mutations. Credit: Pádraic Flood\r\nFindings could l… [+5423 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tim McNulty", "title": "'Like the Wild West' Satellite debris sparks concern - 'Big portions of space unusable!' - Daily Express", "description": "SATELLITE debris produced by the world's emerging commercial space industry risks making 'big portions of space unusable,' an industry expert has warned.", "url": "https://www.express.co.uk/news/science/1553938/Satellite-debris-space-junk-collision-NASA-latest-astronauts-starlink-orbit-news-vn", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1553938.jpg", "publishedAt": "2022-01-22T10:01:00Z", "content": null}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "NASA's TESS passes huge milestone for exoplanet observations - TweakTown", "description": "NASA's Transiting Exoplanet Survey Satellite (TESS) has identified over five thousand exoplanet candidates, adding to its catalog.", "url": "https://www.tweaktown.com/news/84157/nasas-tess-passes-huge-milestone-for-exoplanet-observations/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84157_01_nasas-tess-hits-milestone-of-5-000-exoplanet-candidates_full.jpg", "publishedAt": "2022-01-22T10:00:03Z", "content": "NASA's Transiting Exoplanet Survey Satellite (TESS) passed the five thousand mark for TESS Objects of Interest (TOIs).\r\nTESS's mission began in 2018, and its most recent addition to the TOI catalog c… [+1211 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "Researchers boil water with ice to expand an 18th-century phenomenon - TweakTown", "description": "Virginia Tech researchers have expanded on the Leidenfrost effect to levitate ice with temperatures of at least 550&#176;C (1022&#176;F).", "url": "https://www.tweaktown.com/news/84156/researchers-boil-water-with-ice-to-expand-an-18th-century-phenomenon/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84156_01_using-ice-to-boil-water-researcher-makes-heat-transfer-discovery-that_full.jpg", "publishedAt": "2022-01-22T09:30:03Z", "content": "A new study on the discovery was published in the journal Physical Review Fluids.\r\nPhase changes in water are well understood by most; heating ice (solid) makes water (liquid), and heating water prod… [+2260 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "Square Kilometre Array vs James Webb Space Telescope - MyBroadband", "description": "Why we need the James Webb Space Telescope and the SKA.", "url": "https://mybroadband.co.za/news/science/431078-square-kilometre-array-vs-james-webb-space-telescope.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/01/MeerKAT-SKA-square-kilometre-array.jpg", "publishedAt": "2022-01-22T08:59:47Z", "content": "The headline-making launch in late December of the James Webb Space Telescope is humankinds latest attempt to learn about the origins of our universe. Like the Square Kilometre Array (SKA) the James … [+6845 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Reveals New Information About Movement and Evolution of Dinosaurs - LatestLY", "description": "Get latest articles and stories on Science at LatestLY.  Bristol (England) [UK], January 22, (ANI): A new research led by the University of Bristol has revealed the evolution of giant 50-tonne sauropod dinosaurs, like Diplodocus, from its much smaller ancesto…", "url": "https://www.latestly.com/agency-news/science-news-study-reveals-new-information-about-movement-and-evolution-of-dinosaurs-3280567.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/dinosaur20220122052122_-_Copy20220122054149-588x441.jpg", "publishedAt": "2022-01-22T05:56:24Z", "content": "Bristol (England) [UK], January 22, (ANI): A new research led by the University of Bristol has revealed the evolution of giant 50-tonne sauropod dinosaurs, like Diplodocus, from its much smaller ance… [+3490 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Here’s why whales don’t drown when they gulp down food underwater — ScienceDaily - newsconcerns", "description": "Ever wondered whether whales can burp, and why they don't drown when they gulp down gallons of water and krill? New UBC research may just hold the answer.Researchers found that lunge-feeding whales have an 'oral plug', a fleshy bulb in their mouths t", "url": "https://newsconcerns.com/heres-why-whales-dont-drown-when-they-gulp-down-food-underwater-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-22T04:44:32Z", "content": "Ever wondered whether whales can burp, and why they don’t drown when they gulp down gallons of water and krill? New UBC research may just hold the answer.Researchers found that lunge-feeding whales h… [+3960 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Neutrons detect clogs non-destructively through the metal walls of pipelines — ScienceDaily - newsconcerns", "description": "Industry and private consumers alike depend on oil and gas pipelines that stretch thousands of kilometers underwater. It is not uncommon for these pipelines to become clogged with deposits. Until now, there have been few means of identifying the form", "url": "https://newsconcerns.com/neutrons-detect-clogs-non-destructively-through-the-metal-walls-of-pipelines-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-22T01:14:32Z", "content": "Industry and private consumers alike depend on oil and gas pipelines that stretch thousands of kilometers underwater. It is not uncommon for these pipelines to become clogged with deposits. Until now… [+4717 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists With Nothing Better to Do Created a Bubble That Lasted 465 Days Before Popping - Futurism", "description": "Researchers from the University of Lille in France created a scientific, plastic-coated bubble that lived for 465 days before bursting.", "url": "https://futurism.com/scientists-bubble-lasted", "urlToImage": "https://wp-assets.futurism.com/2022/01/scientists-bubble-434-days.jpg", "publishedAt": "2022-01-21T23:02:05Z", "content": "Were willing to bet that as a kid, most of us blew bubbles and tried to see which ones lasted the longest. Were also willing to bet that none of them lasted more than a few fleeting moments.\r\nNow, sc… [+2399 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": null, "title": "Near-Earth Objects/Planetary Defense - Voice of America", "description": "NASA says there are some 28,000 comets and asteroids in our planet’s neighborhood, with more being discovered every day. Fortunately, the space agency also says the probability of a major collision is quite small. Dr. Paul Chodas, manager of NASA’s Center for…", "url": "https://www.voanews.com/a/6386233.html", "urlToImage": "https://gdb.voanews.com/9159ff23-2c0e-4342-8c0c-829145fd7fb9_w1200_r1.jpg", "publishedAt": "2022-01-21T22:30:00Z", "content": "NASA says there are some 28,000 comets and asteroids in our planets neighborhood, with more being discovered every day. Fortunately, the space agency also says the probability of a major collision is… [+205 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "NASA emergency beacons save 330 lives in 2021 - newsconcerns", "description": "Credit: NOAA                        In 2021, NASA technology saved 330 lives in the U.S. network region of the international satellite-aided search and rescue effort, Cospas-Sarsat. NA", "url": "https://newsconcerns.com/nasa-emergency-beacons-save-330-lives-in-2021/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasa-emergency-beacons.jpg", "publishedAt": "2022-01-21T21:44:37Z", "content": "In 2021, NASA technology saved 330 lives in the U.S. network region of the international satellite-aided search and rescue effort, Cospas-Sarsat. NASA has lent technical expertise to the Cospas-Sarsa… [+1656 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Antarctica’s doomed A68 iceberg dumped 1 trillion tons of water into the ocean over 3 years - newsconcerns", "description": "After the world's largest iceberg snapped off of the Antarctic Peninsula in July 2017, it drifted north on a three-year death march, shedding an unfathomable amount of meltwater into the sea. Now, a new study of the doomed iceberg (named A68a) reveal", "url": "https://newsconcerns.com/antarcticas-doomed-a68-iceberg-dumped-1-trillion-tons-of-water-into-the-ocean-over-3-years/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cVMiyVsVcLf3GaU33AykWd-1200-80.jpg", "publishedAt": "2022-01-21T21:30:34Z", "content": "After the world’s largest iceberg snapped off of the Antarctic Peninsula in July 2017, it drifted north on a three-year death march, shedding an unfathomable amount of meltwater into the sea. Now, a … [+3868 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "Curiosity Sees a Strong Carbon Signature in a Bed of Rocks - Universe Today", "description": "NASA's Curiosity Rover found a strong carbon signal on Mars. Is it a sign of ancient life? It's too soon to say, but the findings are definitely intriguing.", "url": "https://www.universetoday.com/154139/curiosity-sees-a-strong-carbon-signature-in-a-bed-of-rocks/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/01/Stimson-sandstone-carbon.jpg", "publishedAt": "2022-01-21T21:07:56Z", "content": "Carbon is critical to life, as far as we know. So anytime we detect a strong carbon signature somewhere like Mars, it could indicate biological activity. \r\nDoes a strong carbon signal in Martian rock… [+10994 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": null, "title": "Scientists first spoke about the international operation to search for dark matter - The Saxon", "description": "Dark matter does not interact with ordinary matter, so it is almost impossible to detect it. But there is one hypothetical exception to the rule. In an experiment to search for dark matter and other exotic particles, scientists used 14 magnetometers in German…", "url": "https://thesaxon.org/scientists-first-spoke-about-the-international-operation-to-search-for-dark-matter/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2022/01/uchenye-vpervye-rasskazali-o-mezhdunarodnoj-operacii-po-poisku-temnoj-materii-5ae5890.jpg", "publishedAt": "2022-01-21T20:24:53Z", "content": "Dark matter does not interact with ordinary matter, so it is almost impossible to detect it. But there is one hypothetical exception to the rule.\r\nIn an experiment to search for dark matter and other… [+2667 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "David K. Li", "title": "French physicists developed a bubble that didn't burst for more than a year - AOL", "description": "French physicists have figured out a way to extend the usually short lives of bubbles.", "url": "https://www.nbcnews.com/news/world/french-physicists-developed-bubble-didnt-burst-year-rcna13077", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-01/220121-soap-bubbles-stock-mn-1200-86cbf9.jpg", "publishedAt": "2022-01-21T20:08:38Z", "content": "French physicists have figured out a way to extend the usually short lives of bubbles. \r\nUniversity of Lille physicists published findings Tuesday in the journal Physical Review Fluids, recounting ho… [+2604 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New Species of Branching Worm Discovered in Waters Off Japan - Sci-News.com", "description": "Marine biologists have described a third species of branching syllid worm -- and the second within the genus Ramisyllis -- living inside an undescribed species of the sponge genus Petrosia found in shallow waters at Sado Island, Japan.", "url": "http://www.sci-news.com/biology/ramisyllis-kingghidorahi-10483.html", "urlToImage": "http://cdn.sci-news.com/images/2022/01/image_10483f-Ramisyllis-kingghidorahi.jpg", "publishedAt": "2022-01-21T20:01:55Z", "content": "Marine biologists have described a third species of branching syllid worm — and the second within the genus Ramisyllis — living inside an undescribed species of the sponge genus Petrosia found in sha… [+3838 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Harnessing noise in optical computing for AI - Science Daily", "description": "A research team has developed an optical computing system for AI and machine learning that not only mitigates the noise inherent to optical computing but actually uses some of it as input to help enhance the creative output of the artificial neural network wi…", "url": "https://www.sciencedaily.com/releases/2022/01/220121145409.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-21T18:56:15Z", "content": "Artificial intelligence and machine learning are currently affecting our lives in many small but impactful ways. For example, AI and machine learning applications recommend entertainment we might enj… [+5321 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "How can we control their movement? Scientists identify a stop switch for a motor protein called kinesin 1 &... - newsconcerns", "description": "Inside neurons, motor proteins haul precious cargo, moving essential goods along thread-like roadways called microtubule tracks.This miniature highway system is vital for keeping neurons healthy: When traffic is flowing well, critical materials are a", "url": "https://newsconcerns.com/how-can-we-control-their-movement-scientists-identify-a-stop-switch-for-a-motor-protein-called-kinesin-1-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-21T18:14:34Z", "content": "Inside neurons, motor proteins haul precious cargo, moving essential goods along thread-like roadways called microtubule tracks.This miniature highway system is vital for keeping neurons healthy: Whe… [+3606 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Astronomers propose building a neutrino detector out of the Pacific Ocean - Verve Times", "description": "Neutrinos are one of the most elusive particles in the cosmos, second only to ultra-mysterious dark matter. They are made in considerable quantity — they participate in the weak nuclear force and they're responsible for nuclear fusion and decay. So a", "url": "https://vervetimes.com/astronomers-propose-building-a-neutrino-detector-out-of-the-pacific-ocean/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nkRmLdFedTanQDTs5jWxoi-1200-80.jpg", "publishedAt": "2022-01-21T18:09:28Z", "content": "Neutrinos are one of the most elusive particles in the cosmos, second only to ultra-mysterious dark matter\r\n. They are made in considerable quantity they participate in the weak nuclear force and the… [+6053 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Scientists build ‘valves’ in DNA to shape biological information flows — ScienceDaily - newsconcerns", "description": "Scientists at the University of Bristol have developed new biological parts that are able to shape the flow of cellular processes along DNA.The work, now published in the journal Nature Communications, offers a fresh perspective on how information is", "url": "https://newsconcerns.com/scientists-build-valves-in-dna-to-shape-biological-information-flows-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-21T16:22:32Z", "content": "Scientists at the University of Bristol have developed new biological parts that are able to shape the flow of cellular processes along DNA.The work, now published in the journal Nature Communication… [+3452 chars]"}, {"source": {"id": null, "name": "The National"}, "author": "Kieran Doody", "title": "Celestial events UK 2022: Solar eclipse, meteor showers, full moons and more - The National", "description": "2022 is a busy year for the stargazers among us.", "url": "https://www.thenational.scot/news/19866064.celestial-events-uk-2022-solar-eclipse-meteor-showers-full-moons/", "urlToImage": "https://www.thenational.scot/resources/images/13399505/", "publishedAt": "2022-01-21T15:43:36Z", "content": "×Why are you making commenting on The National only available to subscribers?\r\nWe know there are thousands of National readers who want to debate, argue and go back and forth in the comments section … [+1266 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Researchers Develop New 2D Material Made of Copper and Iodine Atoms - AZoNano", "description": "Binding of atoms is done by sharing electrons. The process through which it happens not only relies on the atom types but also on conditions like pressure and temperature.", "url": "https://www.azonano.com/news.aspx?newsID=38562", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38562_16427675640796369.jpg", "publishedAt": "2022-01-21T15:23:00Z", "content": "The binding of atoms is done by sharing electrons. The process through which it happens not only relies on the atom types but also on conditions like pressure and temperature.\r\nA single layer of cupr… [+3101 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Molecular Dynamics Inform Ideal Tool Shape for Nanofabrication - AZoM", "description": "Researchers use a molecular dynamics simulation model to analyze the effect of different machining tool shapes on the surface quality of monocrystalline nickel nanofabrication.", "url": "https://www.azom.com/news.aspx?newsID=57979", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_57979_16427782916506664.jpg", "publishedAt": "2022-01-21T15:20:00Z", "content": "In a recent study published in the journal Molecules, researchers from China used a molecular dynamics simulation model to analyze the effect of different machining tool shapes on the surface quality… [+6780 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Crystallography for Misfit Crystals: Advanced Algorithms Reveal Material Structures - SciTechDaily", "description": "Advanced algorithms plus an exceptional X-ray laser can reveal the structures of not-so-neat-and-tidy materials unattainable by other techniques. Francis Crick, who famously co-discovered the shape of DNA, once said: “If you want to understand function, study…", "url": "https://scitechdaily.com/crystallography-for-misfit-crystals-advanced-algorithms-reveal-material-structures/", "urlToImage": "https://scitechdaily.com/images/Serial-Femtosecond-X-Ray-Crystallography-Process.jpg", "publishedAt": "2022-01-21T15:06:46Z", "content": "ByLawrence Berkeley National LaboratoryJanuary 21, 2022\r\nAn illustration of the serial femtosecond X-ray crystallography process, showing a jet of liquid solvent combined with the sample particles be… [+7895 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Astronomers focus robotic eyes on the Milky Way, our cosmic home - Verve Times", "description": "The Focal Plane System replaces a time-consuming, hands-on approach to making simultaneous observations of hundreds of stars. Credit: SDSS-V                        Thanks to a breakthr", "url": "https://vervetimes.com/astronomers-focus-robotic-eyes-on-the-milky-way-our-cosmic-home/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-focus-robo.jpg", "publishedAt": "2022-01-21T14:56:40Z", "content": "The Focal Plane System replaces a time-consuming, hands-on approach to making simultaneous observations of hundreds of stars. Credit: SDSS-V\r\nThanks to a breakthrough robotic innovation, an internati… [+5648 chars]"}, {"source": {"id": null, "name": "Unite.AI"}, "author": "Alex McFarland", "title": "Researchers Develop “Microrobots” That Create Their Own Bone - Unite.AI", "description": "A team of researchers at the universities of Linköping in Sweden and Okayama in Japan have developed a combination of materials that can morph into shapes and harden. The team was inspired by the growth of bones in the skeleton. The unique material starts out…", "url": "https://www.unite.ai/researchers-develop-microrobots-that-create-their-own-bone/", "urlToImage": "https://ml8ygptwlcsq.i.optimole.com/fMKjlhs.QRSi~1ce64/w:auto/h:auto/q:auto/https://www.unite.ai/wp-content/uploads/2022/01/DanfenCao2cEdwinJager2cJoseGabrielMartinez-2-LiU-2021.jpg", "publishedAt": "2022-01-21T14:36:44Z", "content": "A team of researchers at the universities of Linköping in Sweden and Okayama in Japan have developed a combination of materials that can morph into shapes and harden. The team was inspired by the gro… [+3230 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Sunflowers' invisible colours are revealed - Daily Mail", "description": "The same molecules that produce UV patterns in sunflowers also help the plant respond to stresses such as drought or extreme temperatures, experts from the University of British Columbia found.", "url": "https://www.dailymail.co.uk/sciencetech/article-10423801/Sunflowers-invisible-colours-revealed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/21/11/53204143-0-image-a-17_1642764231465.jpg", "publishedAt": "2022-01-21T11:22:54Z", "content": "They brighten our days with their sunny, vibrant and summery feel.\r\nBut as it turns out sunflowers are not just pretty to look at, they also have a hidden feature that may offer clues as to how plant… [+5008 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Modeling how cells choose their fates - newsconcerns", "description": "Credit: Ronghui Zhu, Elowitz lab, Caltech                        It may seem hard to believe, but each one of us began as a single cell that proliferated into the trillions of cells th", "url": "https://newsconcerns.com/modeling-how-cells-choose-their-fates/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/modeling-how-cells-cho.jpg", "publishedAt": "2022-01-21T11:14:36Z", "content": "It may seem hard to believe, but each one of us began as a single cell that proliferated into the trillions of cells that make up our bodies. Though each of our cells has the exact same genetic infor… [+4748 chars]"}]}