{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Emirates Mars Mission: Hope probe lines up historic Mars manoeuvre - Yahoo News Australia", "description": "The United Arab Emirates aims to put a probe in orbit at Mars to study its atmosphere.", "url": "https://news.yahoo.com/emirates-mars-mission-hope-probe-004311084.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/y7o276egvsftLJdbFTiXQQ--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/ab5630f8d3f7dae7e314dd9a29c2961b", "publishedAt": "2021-02-09T00:51:10Z", "content": "Artwork: It's seven months since Hope left Earth\r\nHistory beckons for the United Arab Emirates as it seeks on Tuesday to place a probe around Mars.\r\nThe Hope spacecraft, launched from Earth seven mon… [+5491 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study of Supergiant Star Betelgeuse Unveils the Cause of Its Pulsations – Not at All Close to Exploding - SciTechDaily", "description": "Recalibrated Betelgeuse's mass, radius, and distance. Betelgeuse is normally one of the brightest, most recognizable stars of the winter sky, marking the left shoulder of the constellation Orion. But lately, it has been behaving strangely: an unprecedentedly …", "url": "https://scitechdaily.com/study-of-supergiant-star-betelgeuse-unveils-the-cause-of-its-pulsations-not-at-all-close-to-exploding/", "urlToImage": "https://scitechdaily.com/images/Betelgeuse-Southern-Region-Evolving.gif", "publishedAt": "2021-02-08T23:45:18Z", "content": "ByKavli Institute for the Physics and Mathematics of the UniverseFebruary 8, 2021This graphic illustrates how the southern region of the rapidly evolving, bright, red supergiant star Betelgeuse may h… [+4704 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Gorgeous New Image Shows a Pinwheel Galaxy in Exquisite Detail - Gizmodo Australia", "description": "An observatory in northern Chile has captured a stunning view of Messier 83, also known as the Spiral of the Southern Pinwheel. Messier 83 is an almost perfect illustration of what a spiral galaxy is stereotypically supposed to look like. This is because we h…", "url": "https://www.gizmodo.com.au/2021/02/gorgeous-new-image-shows-a-pinwheel-galaxy-in-exquisite-detail/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/09/pinwheel-galaxy.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-08T22:11:00Z", "content": "An observatory in northern Chile has captured a stunning view of Messier 83, also known as the Spiral of the Southern Pinwheel.\r\nMessier 83 is an almost perfect illustration of what a spiral galaxy i… [+2290 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": "Reuters", "title": "Scientists warn over misuse of climate models in financial markets - Financial Post", "description": "LONDON — Misuse of climate models could pose a growing risk to financial markets by giving investors a false sense of certainty over how the physical impacts…", "url": "https://financialpost.com/pmn/business-pmn/scientists-warn-over-misuse-of-climate-models-in-financial-markets-2", "urlToImage": null, "publishedAt": "2021-02-08T21:35:07Z", "content": "LONDON Misuse of climate models could pose a growing risk to financial markets by giving investors a false sense of certainty over how the physical impacts of climate change will play out, according … [+1034 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists discover how a group of caterpillars became poisonous - Phys.org", "description": "The Atala butterfly (Eumaeus atala) and its five closest relatives in the genus Eumaeus like to display their toxicity. This sextet's toxicity comes from what they eat as caterpillars: plants called cycads that have been around since before dinosaurs roamed t…", "url": "https://phys.org/news/2021-02-scientists-group-caterpillars-poisonous.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/24-scientistsdi.jpg", "publishedAt": "2021-02-08T21:09:54Z", "content": "The Atala butterfly (Eumaeus atala) and its five closest relatives in the genus Eumaeus like to display their toxicity. This sextet's toxicity comes from what they eat as caterpillars: plants called … [+5765 chars]"}, {"source": {"id": null, "name": "Sydney.edu.au"}, "author": null, "title": "A billion years in 40 seconds: video reveals our dynamic planet - News - The University of Sydney", "description": "How the planet has changed in a billion years. For the first time geoscientists at the University of Sydney have produced an uninterrupted flow of Earth's tectonic plates. When a billion years is condensed into 40 seconds a mesmerising dance is revealed.", "url": "https://www.sydney.edu.au/news-opinion/news/2021/02/09/billion-years-40-seconds-video-reveals-dynamic-earth-plate-tectonics.html", "urlToImage": "https://www.sydney.edu.au/content/dam/corporate/images/news-and-opinion/news/2021/february/rock-folds-agios-pavlos-crete-shutterstock.jpg", "publishedAt": "2021-02-08T20:06:58Z", "content": "Co-author, Dr Michael Tetley, who also completed his PhD at the University of Sydney, told Euronews: For the first time a complete model of tectonics has been built, including all the boundaries\r\nOn … [+741 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "To figure out how dinosaurs walked, start with how they didn't - Phys.org", "description": "Paleontologists have made great strides in understanding how extinct animals like dinosaurs walked, ran, swam and flew when they were alive—but much about the mechanics of how different species moved remains uncertain. A new study led by researchers at Brown …", "url": "https://phys.org/news/2021-02-figure-dinosaurs-didnt.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-dinosaurs.jpg", "publishedAt": "2021-02-08T20:00:04Z", "content": "Paleontologists have made great strides in understanding how extinct animals like dinosaurs walked, ran, swam and flew when they were alivebut much about the mechanics of how different species moved … [+4787 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How rocks rusted on Earth and turned red - Phys.org", "description": "How did rocks rust on Earth and turn red? A Rutgers-led study has shed new light on the important phenomenon and will help address questions about the Late Triassic climate more than 200 million years ago, when greenhouse gas levels were high enough to be a m…", "url": "https://phys.org/news/2021-02-rusted-earth-red.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/howrocksrust.jpg", "publishedAt": "2021-02-08T20:00:02Z", "content": "How did rocks rust on Earth and turn red? A Rutgers-led study has shed new light on the important phenomenon and will help address questions about the Late Triassic climate more than 200 million year… [+3818 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Badham", "title": "New material yields soft, elastic objects that feel like human tissue - Phys.org", "description": "Researchers in the labs of Christopher Bates, an assistant professor of materials at UC Santa Barbara, and Michael Chabinyc, a professor of materials and chair of the department, have teamed to develop the first 3-D-printable \"bottlebrush\" elastomer. The new …", "url": "https://phys.org/news/2021-02-material-yields-soft-elastic-human.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/newmaterialy.jpg", "publishedAt": "2021-02-08T19:53:49Z", "content": "Researchers in the labs of Christopher Bates, an assistant professor of materials at UC Santa Barbara, and Michael Chabinyc, a professor of materials and chair of the department, have teamed to devel… [+6188 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "OSIRIS-REx to Fly a Farewell Tour of Bennu - NASA", "description": "On April 7, NASA’s OSIRIS-REx mission will give asteroid Bennu one last glance before saying farewell.", "url": "https://www.nasa.gov/feature/goddard/2021/osiris-rex-to-fly-a-farewell-tour-of-bennu/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/flyby_beauty_shot_trajectory1.png", "publishedAt": "2021-02-08T18:58:52Z", "content": null}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Helium Ion Microscope Captures New Images of SARS-CoV-2 | Biology - Sci-News.com", "description": "New images of the SARS-CoV-2 coronavirus demonstrate the potential of the helium ion microscopy in bioimaging, especially for the imaging of interactions between viruses and their host organisms.", "url": "http://www.sci-news.com/biology/helium-ion-microscope-images-sars-cov-2-09331.html", "urlToImage": "http://cdn.sci-news.com/images/2021/02/image_9331-SARS-CoV-2.jpg", "publishedAt": "2021-02-08T18:51:57Z", "content": "New images of the SARS-CoV-2 coronavirus demonstrate the potential of the helium ion microscopy in bioimaging, especially for the imaging of interactions between viruses and their host organisms.\r\nTh… [+2113 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Rare blast's remains discovered in Milky Way's center - Phys.org", "description": "Astronomers may have found our galaxy's first example of an unusual kind of stellar explosion. This discovery, made with NASA's Chandra X-ray Observatory, adds to the understanding of how some stars shatter and seed the universe with elements critical for lif…", "url": "https://phys.org/news/2021-02-rare-blast-milky-center.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-rareblastsre.jpg", "publishedAt": "2021-02-08T18:33:31Z", "content": "Astronomers may have found our galaxy's first example of an unusual kind of stellar explosion. This discovery, made with NASA's Chandra X-ray Observatory, adds to the understanding of how some stars … [+5277 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rafi Letzter", "title": "Mystery of gamma radiation solved: Hidden cannibal star is just having dinner - Livescience.com", "description": "Don't get too close to this redback.", "url": "https://www.livescience.com/citizen-supercomputer-finds-neutron-star.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/e7Pq3AZ5dwpjuNSrzie4Fj-1200-80.jpg", "publishedAt": "2021-02-08T18:27:00Z", "content": "The mystery at the heart of an unexplained, bright point of gamma-ray light in the sky has been solved: There's a deadly spider star flaying a second, wimpier star to bits, sending out rapid-fire bur… [+2193 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Kind of Magnetism Formed by “Magnetic Graphene” – Could Reveal Secrets of Superconductivity - SciTechDaily", "description": "Researchers have identified a new form of magnetism in so-called magnetic graphene, which could point the way toward understanding superconductivity in this unusual type of material. The researchers, led by the University of Cambridge, were able to control th…", "url": "https://scitechdaily.com/a-new-kind-of-magnetism-formed-by-magnetic-graphene-could-reveal-secrets-of-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Magnetism-Concept.jpg", "publishedAt": "2021-02-08T16:43:10Z", "content": "Researchers have identified a new form of magnetism in so-called magnetic graphene, which could point the way toward understanding superconductivity in this unusual type of material.\r\nThe researchers… [+6598 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study of supergiant star Betelgeuse unveils the cause of its pulsations - Phys.org", "description": "Betelgeuse is normally one of the brightest, most recognizable stars of the winter sky, marking the left shoulder of the constellation Orion. But lately, it has been behaving strangely: an unprecedentedly large drop in its brightness has been observed in earl…", "url": "https://phys.org/news/2021-02-supergiant-star-betelgeuse-unveils-pulsations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-studyofsuper.jpg", "publishedAt": "2021-02-08T16:26:12Z", "content": "Betelgeuse is normally one of the brightest, most recognizable stars of the winter sky, marking the left shoulder of the constellation Orion. But lately, it has been behaving strangely: an unpreceden… [+3636 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Bernese researchers create sophisticated lung-on-chip - EurekAlert", "description": "In collaboration with clinical partners from the Inselspital, researchers from the ARTORG Center for Biomedical Research of the University of Bern have developed a second-generation lung-on-chip model with life-size dimension alveoli in a stretchable membrane…", "url": "https://www.eurekalert.org/pub_releases/2021-02/uob-brc020821.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/255730_web.jpg", "publishedAt": "2021-02-08T16:21:54Z", "content": "IMAGE: Immunostaining of patients cell cultures on a second-generation lung-on-chip.\r\n view more \r\nCredit: Pauline Zamprogno, ARTORG Center for Biological Engineering Research\r\nThe lung is a complex … [+6212 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Watch this tiny crustacean make some of the fastest snaps on Earth - Science Magazine", "description": "Amphipods may use the behavior to frighten off enemies", "url": "https://www.sciencemag.org/news/2021/02/watch-tiny-crustacean-make-some-fastest-snaps-earth", "urlToImage": "https://www.sciencemag.org/sites/default/files/shrimp-thumb.png", "publishedAt": "2021-02-08T16:00:00Z", "content": "By Tess JoosseFeb. 8, 2021 , 11:00 AM\r\nHow many times can you snap your fingers in a second? Whatever your record, youre no match for the creature in the video above. This amphipoda microscopic, shri… [+1592 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Callum Hoare", "title": "Elon Musk's Mars plan rocked as SpaceX CEO fears humans will 'self-extinguish' before 2050 - Daily Express", "description": "ELON MUSK revealed his fears that humans could 'self-extinguish' before SpaceX is able to help colonise Mars, adding that 'we're looking a little rickety right now'.", "url": "https://www.express.co.uk/news/science/1394940/elon-musk-mars-red-planet-spacex-starship-crash-2050-climate-change-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1394940.jpg", "publishedAt": "2021-02-08T12:46:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Rapid, reliable on-site drug detection using wearable sensor - Phys.org", "description": "Researchers in South Korea have successfully developed a wearable sensor that can detect illegal drugs in sweat by using nanomaterials technology that amplify the optical signal of narcotics to a flexible, body-worn material. Led by Dr. Ho Sang Jung, the rese…", "url": "https://phys.org/news/2021-02-rapid-reliable-on-site-drug-wearable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/rapidreliabl.jpg", "publishedAt": "2021-02-08T12:26:35Z", "content": "Researchers in South Korea have successfully developed a wearable sensor that can detect illegal drugs in sweat by using nanomaterials technology that amplify the optical signal of narcotics to a fle… [+3968 chars]"}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Stuart Layt", "title": "Light in the darkness: Fish with eyes that made scientists look twice - WAtoday", "description": "Scientists have confirmed a species of coral fish has eyes even better at seeing in low light than some species found in the deepest depths of the ocean.", "url": "https://www.brisbanetimes.com.au/national/queensland/light-in-the-darkness-fish-with-eyes-that-made-scientists-look-twice-20210208-p570np.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.21083735909822862%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_103%2C$y_102/t_crop_custom/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/e7a84f4ba74a245a794efdda83e102932b2ad535", "publishedAt": "2021-02-08T12:00:00Z", "content": "Many species from the deep ocean have what we call a multibank retina, where these rod cells are stacked in layers, usually between two to six layers, Dr De Busserolles said.\r\nBut these fish from the… [+1543 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Five twinkling galaxies help us uncover the mystery of the Milky Way’s missing matter - The New Daily", "description": "We’ve all looked up at night and admired the brightly shining stars. Measuring that light helps us learn about matter in our galaxy, the Milky Way.", "url": "https://thenewdaily.com.au/life/science/2021/02/08/milky-way-discovery/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2019/12/1577663764-GettyImages-542121340-960x600.jpg", "publishedAt": "2021-02-08T11:06:59Z", "content": "Weve all looked up at night and admired the brightly shining stars. Beyond making a gorgeous spectacle, measuring that light helps us learn about matter in our galaxy, the Milky Way.\r\nWhen astronomer… [+4628 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Bond distance of rare element einsteinium is measured – Physics World - physicsworld.com", "description": "Breakthrough could help scientists create more superheavy elements", "url": "https://physicsworld.com/bond-distance-of-rare-element-einsteinium-is-measured/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2021/02/Sam-Jarman-8-Feb-2020.jpg", "publishedAt": "2021-02-08T11:05:04Z", "content": "Nuclear PPE: Leticia Arnedo-Sanchez (from left), Katherine Shield, Korey Carter, and Jennifer Wacker take precautions against radioactivity as well as coronavirus to conduct experiments in Rebecca Ab… [+3393 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Half of global wastewater treated, rates in developing countries still lagging - Science Codex", "description": null, "url": "https://sciencecodex.com/half-global-wastewater-treated-rates-developing-countries-still-lagging-666532", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/255590_web.jpg", "publishedAt": "2021-02-08T05:00:00Z", "content": "A new study by scientists at Utrecht University and the United Nations University concludes that about half of global wastewater is treated, rather than the previous estimate of 20%. Despite this pro… [+2857 chars]"}, {"source": {"id": null, "name": "Siliconrepublic.com"}, "author": "Jenny Darmody", "title": "New 3D-printed material could lead to lighter, safer vehicles Just now - Siliconrepublic.com", "description": "Engineers have developed a new form of 3D-printed material that could be both tougher and lighter than similar types of aluminium.", "url": "https://www.siliconrepublic.com/machines/3d-printed-material-aluminium-carbon", "urlToImage": "https://www.siliconrepublic.com/wp-content/uploads/2021/02/material-science.jpg", "publishedAt": "2021-02-08T03:16:11Z", "content": "Engineers have developed a new form of 3D-printed material that could be both tougher and lighter than similar types of aluminium.\r\nMaterial scientists are often searching for ways to create material… [+2872 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "SpaceX Nabbed NASA’s SPHEREx Launch Contract - Gizmodo Australia", "description": "SpaceX may be a lot of things conflicting things, but you have to admit one thing: NASA approves. So much so that it’s going to use SpaceX as launch company for the SPHEREx program. The SPHEREx project is a seriously cool one. The name stands for Spectro-Phot…", "url": "https://www.gizmodo.com.au/2021/02/spacex-nabbed-nasas-spherex-launch-contract/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/07/ng21pdocx4wmdmaw817k.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-08T00:00:00Z", "content": "SpaceX may be a lot of things conflicting things, but you have to admit one thing: NASA approves. So much so that its going to use SpaceX as launch company for the SPHEREx program.\r\nThe SPHEREx proje… [+1867 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "How to Live in Space: What We’ve Learned From 20 Years of the International Space Station - Gizmodo Australia", "description": "November 2 marks 20 years since the first residents arrived on the International Space Station (ISS). The orbiting habitat has been continuously occupied ever since. Twenty straight years of life in space makes the ISS the ideal “natural laboratory” to unders…", "url": "https://www.gizmodo.com.au/2021/02/how-to-live-in-space-what-weve-learned-from-20-years-of-the-international-space-station/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2020/11/02/nasa-living-in-space.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-07T22:04:00Z", "content": "November 2 marks 20 years since the first residents arrived on the International Space Station (ISS). The orbiting habitat has been continuously occupied ever since.\r\nTwenty straight years of life in… [+5990 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "A Program Is Turning Discarded Oyster Shells Into Treasure - Gizmodo Australia", "description": "If you eat oysters in Galveston, there’s a chance your discarded oyster shells will end up back in the bay near the Texas city. Unlike throwing trash in the sea, that’s a good thing. The Galveston Bay Foundation takes discarded shells from area restaurants on…", "url": "https://www.gizmodo.com.au/2021/02/a-program-is-turning-discarded-oyster-shells-into-treasure/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/06/bhocxo6rk8by9dwbmdne.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-07T21:43:00Z", "content": "If you eat oysters in Galveston, theres a chance your discarded oyster shells will end up back in the bay near the Texas city. Unlike throwing trash in the sea, thats a good thing.\r\nThe Galveston Bay… [+11633 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "5 twinkling galaxies help us uncover the mystery of the Milky Way's missing matter - MENAFN.COM", "description": "We've all looked up at night and admired the brightly shining stars. Beyond making a gorgeous spectacle, measuring that light helps us learn about matter in our galaxy, the Milky Way.</p>\n<p>When astronomers add up all the matter detectable around us (such as…", "url": "https://menafn.com/1101561812/5-twinkling-galaxies-help-us-uncover-the-mystery-of-the-Milky-Ways-missing-matter", "urlToImage": "https://menafn.com/updates/pr/2021-02/07/TC_370582ab-7image_story.jpg", "publishedAt": "2021-02-07T20:40:26Z", "content": "(MENAFN - The Conversation) We've all looked up at night and admired the brightly shining stars. Beyond making a gorgeous spectacle, measuring that light helps us learn about matter in our galaxy, th… [+5057 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "What We Are Reading Today: Extraterrestrial by Avi Loeb - Arab News", "description": "Extraterrestrial is a provocative and fascinating book written by American theoretical physicist and Harvard University astronomer Avi Loeb.  In Extraterrestrial, Loeb takes readers inside the thrilling story of the first interstellar visitor to be spotted in…", "url": "https://www.arabnews.com/node/1805446", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/07/2463056-822604459.png", "publishedAt": "2021-02-07T20:31:09Z", "content": "Extraterrestrial is a provocative and fascinating book written by American theoretical physicist and Harvard University astronomer Avi Loeb. \r\nIn Extraterrestrial, Loeb takes readers inside the thril… [+960 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Mars Perseverance rover: What to expect on landing day - CNET", "description": "On Feb. 18, NASA's latest Mars rover will try for a dramatic touchdown on the red planet.", "url": "https://www.cnet.com/news/nasa-mars-perseverance-rover-what-to-expect-when-it-lands-february-18/", "urlToImage": "https://cnet1.cbsistatic.com/img/_m4uufR0NTpQa4dLCt2C6I8ZJO8=/1200x630/2021/01/15/da1300d1-8a78-4dcd-9c50-c20fc017a88d/pia24318-08-powereddescent-2000.jpg", "publishedAt": "2021-02-07T18:45:00Z", "content": "NASA will use a \"sky crane\" to gently lower Perseverance to the surface of Mars.\r\nNASA\r\nWhen it comes to space happenings, few are as thrilling as landing a vehicle on another planet. It's tense, exc… [+4924 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Rebecca Shepherd", "title": "Largest Asteroid To Fly Past Earth In 2021 'Potentially Hazardous' - LADbible", "description": "On 21 March the big rock - known as the 2001 FO32 - will be within... wait for it... 4.6 million miles of Earth's path around the sun", "url": "https://www.ladbible.com/news/news-largest-asteroid-to-fly-past-earth-in-2021-potentially-hazardous-20210207", "urlToImage": "https://www.ladbible.com/cdn-cgi/image/width=808,quality=70,format=jpeg,fit=cover,dpr=1/https%3A%2F%2Fs3-images.ladbible.com%2Fs3%2Fcontent%2F08e919a36020e0c3d575ff4b916f301e.png", "publishedAt": "2021-02-07T17:42:00Z", "content": "Mark your calendars, guys, because 2021's largest known asteroid will be passing Earth on 21 March and it's said to be 'potentially hazardous'. \r\nThe space rock - which is known as 2001 FO32 - is one… [+2196 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Can we vaccinate people against falling for vaccine lies? - ABC News", "description": "A hallmark of the coronavirus pandemic has been the related \"infodemic\" of fake news that has circulated online. But while many have tried valiantly to set the story straight, fact-based debunking is often a tougher sell than a wild conspiracy theory. Now exp…", "url": "https://www.abc.net.au/radio/programs/coronacast/can-we-vaccinate-people-against-falling-for-vaccine-lies/13130412", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=4", "publishedAt": "2021-02-07T17:01:00Z", "content": "A hallmark of the coronavirus pandemic has been the related \"infodemic\" of fake news that has circulated online. \r\nBut while many have tried valiantly to set the story straight, fact-based debunking … [+373 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": null, "title": "Could a human enter a black hole to study it? - Salon", "description": "A person could travel past (certain) black holes' event horizons without dying immediately — here's how", "url": "https://www.salon.com/2021/02/07/could-a-human-enter-a-black-hole-to-study-it_partner/", "urlToImage": "https://media.salon.com/2019/01/black-hole.jpg", "publishedAt": "2021-02-07T15:00:00Z", "content": "To solve the mysteries of black holes, a human should just venture into one. However, there is a rather complicated catch: A human can do this only if the respective black hole is supermassive and is… [+5279 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "These self-sufficient robots can have ‘babies’ and colonize distant planets - The Next Web", "description": "It’s been suggested that an advance party of robots will be needed if humans are ever to settle on other planets. Sent ahead to create conditions favorable for humankind, these robots ...", "url": "https://thenextweb.com/space/2021/02/07/these-self-sufficient-robots-can-have-babies-and-colonize-distant-planets-syndication/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F02%2F1-copy-17.jpg&signature=987357ef358ad3fa60ad7231d1fffa0c", "publishedAt": "2021-02-07T11:04:08Z", "content": "Its been suggested that an advance party of robots will be needed if humans are ever to settle on other planets. Sent ahead to create conditions favorable for humankind, these robots will need to be … [+6154 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Detect a Tiny Dwarf Galaxy That Has Way More Dark Matter Than We Expected - ScienceAlert", "description": "A tiny, ancient dwarf galaxy named Tucana II orbiting the Milky Way has been harbouring a big secret. According to a new study of stars around the object, gravitationally bound to it at great distances, its dark matter halo is a lot more massive than", "url": "https://www.sciencealert.com/this-tiny-ancient-dwarf-galaxy-has-way-more-dark-matter-than-we-thought", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/fornax_1024.jpg", "publishedAt": "2021-02-07T05:56:48Z", "content": "A tiny, ancient dwarf galaxy named Tucana II orbiting the Milky Way has been harbouring a big secret. According to a new study of stars around the object, gravitationally bound to it at great distanc… [+4856 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Supermoons, Pink moon, and next full moon for 2021 - 7NEWS.com.au", "description": "Full moons always make for dramatic skywatching, but so-called “supermoons” are even more special because they appear a bit bigger and brighter than a typical full moon.", "url": "https://7news.com.au/technology/space/supermoon-and-full-moon-for-2021-c-1778764", "urlToImage": "https://images.7news.com.au/publication/C-1778764/33f8239d89e837019d80594d739b0a2b512ea7fa-16x9-x0y99w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T23:21:50Z", "content": "Full moons always make for dramatic skywatching, but so-called supermoons are even more special because they appear a bit bigger and brighter than a typical full moon.\r\nIts a full moon that coincides… [+2827 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Asteroid 501647 (2014 SD224) to pass Earth - 7NEWS.com.au", "description": "The space rock is travelling about 10 kilometres per second.", "url": "https://7news.com.au/technology/space/giant-asteroid-to-pass-earth-on-christmas-day-c-1747386", "urlToImage": "https://images.7news.com.au/publication/C-1747386/e12709dd4f23f99b89c25d8fa4a62fe770574398-16x9-x0y188w2000h1125.jpg?imwidth=1024", "publishedAt": "2020-12-10T21:21:42Z", "content": "Santa Claus wont be the only one flying above Earth on Christmas Day.\r\nAn asteroid measuring about 123 metres in size will whiz past our planet according to NASA.\r\nThe huge space rock is officially k… [+922 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 8 Feb 2021: Fuego volcano, Klyuchevskoy, Popocatépetl, Ibu, Reventador, Sangay, Sakurajima, Sabancaya\r\n 03:00 AM | BY: VN\r\nKlyuchevskoy (Kamchatka): Volcanic Ash Advisory Center Toky… [+2565 chars]"}]}