{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Doris Elin Urrutia", "title": "Exoplanet evolution? Mini-Neptunes may shed their atmospheres and become super-Earths - Space.com", "description": "Two new studies point to peculiar possibilities for planetary evolution.", "url": "https://www.space.com/mini-neptune-exoplanet-transform-super-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cowxkUVqcgVKXvWeNq9mT9-1200-80.jpeg", "publishedAt": "2022-02-05T12:13:22Z", "content": "New research suggests that stellar radiation is stripping away the \"fluffy\" atmospheres of exoplanets slightly smaller than Neptune, leaving behind their rocky cores and transforming them into worlds… [+4573 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Chromosomes of the earliest animals on Earth demonstrates underlying unity of all life - News9 LIVE", "description": "For over half a billion years, evolution has conserved the chromosomes that work well in all...", "url": "https://www.news9live.com/science/chromosomes-of-the-earliest-animals-on-earth-demonstrates-underlying-unity-of-all-life-151712", "urlToImage": "https://media.news9live.com/h-upload/2022/02/05/222160-amphioxus704pxcropped.jpg", "publishedAt": "2022-02-05T12:00:07Z", "content": "Chromosomes inherited from ancient ancestors 600 million years ago are preserved among a diverse group of marine invertebrates, including sponges, jellyfish, sea squirts, placozoans, lancets, choanof… [+4616 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "The deep seafloor is filled with entire branches of life yet to be discovered - Livescience.com", "description": "Nearly two-thirds of seafloor life has not been discovered yet.", "url": "https://www.livescience.com/deep-ocean-floor-teeming-with-unknown-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RDYyPNEViBUdXGsbM4qHbU-1200-80.jpg", "publishedAt": "2022-02-05T12:00:00Z", "content": "The deep-ocean floor is teeming with undiscovered life-forms that help to regulate Earth's climate, a new study finds.\r\nResearchers sequenced DNA\r\n from deep-sea sediments around the world and found … [+3484 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "First-ever wandering black hole found roaming through space - TweakTown", "description": "Astronomers have identified the first free-floating black hole roaming through interstellar space from a 2011 microlensing event.", "url": "https://www.tweaktown.com/news/84412/first-ever-wandering-black-hole-found-roaming-through-space/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84412_01_first-ever-free-floating-black-hole-found-roaming-through-interstellar_full.jpg", "publishedAt": "2022-02-05T10:01:01Z", "content": "A new preprint paper has been published detailing the finding.\r\nAstronomers witnessed a potential microlensing event in 2011 that has now been confirmed to be due to the presence of a free-floating b… [+946 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Naoko Yamazaki: ‘Seeing the Earth from space, I was astonished by its beauty — and its fragility’ - Financial Times", "description": "Q&A with the astronaut on gender equality, being on board the Space Station and being in a microgravity environment", "url": "https://www.ft.com/content/532cf86e-c6bb-4ee8-bee7-d5055eb72218", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F57ea32fb-0a32-43c3-aa89-ca0d2d1c52ec.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2022-02-05T05:00:31Z", "content": "Naoko Yamazaki, 51, joined the National Space Development Agency of Japan (now JAXA) in 1996 and worked on various engineering projects before going into space on the Nasa Discovery shuttle in 2010. … [+4099 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Discovery unravels how atomic vibrations emerge in nanomaterials - EurekAlert", "description": "A hundred years of physics tells us that collective atomic vibrations, called phonons, can behave like particles or waves. When they hit an interface between two materials, they can bounce off like a tennis ball. If the materials are thin and repeating, as in…", "url": "https://www.eurekalert.org/news-releases/942482", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-05T02:03:57Z", "content": "A hundred years of physics tells us that collective atomic vibrations, called phonons, can behave like particles or waves. When they hit an interface between two materials, they can bounce off like a… [+10097 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "How fault lines in a kitchen sink are changing what we know about geology — ScienceDaily - Verve Times", "description": "In a new paper recently published in the journal Geology, researchers at the University of Massachusetts Amherst unveiled a physical model that yields an unprecedented, high-resolution look at the slip rates of faults, which determine the likelihood", "url": "https://vervetimes.com/how-fault-lines-in-a-kitchen-sink-are-changing-what-we-know-about-geology-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-05T01:53:03Z", "content": "In a new paper recently published in the journal Geology, researchers at the University of Massachusetts Amherst unveiled a physical model that yields an unprecedented, high-resolution look at the sl… [+3116 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "50 interesting facts about Earth - The News Motion", "description": "Did you know that our planet is rocketing around the sun at 67,000 mph? Or that it may once have been purple? Here are 50 facts about Earth.1. We're the third rock from the sun(Image credit: Getty Images)Our home, Earth, is the third planet from the", "url": "https://thenewsmotion.com/50-interesting-facts-about-earth/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Xm5tNGu2r7gT9WzeXqd8S9-1200-80.jpg", "publishedAt": "2022-02-05T01:29:47Z", "content": "Did you know that our planet is rocketing around the sun at 67,000 mph? Or that it may once have been purple? Here are 50 facts about Earth.\r\n1. We’re the third rock from the sun\r\n(Image credit: Gett… [+4954 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Martian Atmospheric Breakdown: Helicopters Flying on Mars May Glow at Dusk - SciTechDaily", "description": "The whirling blades on drones flying above Mars may cause tiny electric currents to flow in the Martian atmosphere, according to a NASA study. These currents, if large enough, might cause the air surrounding the craft to glow. This process occurs naturally at…", "url": "https://scitechdaily.com/martian-atmospheric-breakdown-helicopters-flying-on-mars-may-glow-at-dusk/", "urlToImage": "https://scitechdaily.com/images/Mars-Drone-Glow.jpg", "publishedAt": "2022-02-05T00:47:02Z", "content": "This is an artist’s concept of a glow surrounding a drone at Mars during flight. The glow, exaggerated for visibility, might happen if the drone’s spinning rotor blades generate an electric field tha… [+5989 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "A Tracking System is now Scanning the Entire sky Every 24 Hours Looking for Dangerous Asteroids - Universe Today", "description": "As evidenced by a recent Netflix movie, dangerous asteroids can come from anywhere.  So there was an obvious weakness in our asteroid defense system when only one of the hemispheres was covered by telescopes that constantly scan the sky.  That was the case un…", "url": "https://www.universetoday.com/154400/a-tracking-system-is-now-scanning-the-entire-sky-every-24-hours-looking-for-dangerous-asteroids/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/02/6210.jpg", "publishedAt": "2022-02-05T00:32:13Z", "content": "As evidenced by a recent Netflix movie, dangerous asteroids can come from anywhere.  So there was an obvious weakness in our asteroid defense system when only one of the hemispheres was covered by te… [+2569 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Jupiter’s powerful auroras form during a ‘tug of war’ between the planet and nearby moon volcanoes - Business Insider Australia", "description": "NASA's Juno spacecraft and the Hubble Space Telescope helped researchers chart the electric currents driving Jupiter's aurora.", "url": "https://www.businessinsider.com/space-lava-from-moon-volcanoes-creates-jupiters-powerful-aurora-lights-2022-2", "urlToImage": "https://i.insider.com/61fc6530b0ec040018d0cba5?format=jpeg", "publishedAt": "2022-02-05T00:02:00Z", "content": "A composite of two observations from NASA’s Hubble Space Telescope show Jupiter’s aurora. NASA/ESA/J. Nichols (University of Leicester) \r\nJupiter’s auroras the lights that dance around its poles are … [+3776 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Young stars illuminate 'Chamaeleon' stellar nursery in new Hubble image - Space.com", "description": "NASA's Hubble Space Telescope has captured a stunning new view of a stellar nursery known as the Chamaeleon Cloud Complex, which is illuminated by the bright blue light of young stars.", "url": "https://www.space.com/hubble-telescope-chamaeleon-stellar-nursery-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zWxc4akqFJEFcVrrBdFtLN-1200-80.jpg", "publishedAt": "2022-02-04T23:50:29Z", "content": "NASA's Hubble Space Telescope has captured a stunning new view of a stellar nursery illuminated by the bright blue light of young stars. \r\nThis vast stellar nursery, known as the Chamaeleon Cloud Com… [+2352 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Hubble Space Telescope gazes at 'cosmic oddball' with a funky shape - CNET", "description": "NGC 1705, which recently went through a peppy \"starburst\" phase of star formation, could help scientists understand how galaxies evolve.", "url": "https://www.cnet.com/news/hubble-space-telescope-gazes-at-cosmic-oddball-with-a-funky-shape/", "urlToImage": "https://www.cnet.com/a/img/uhnoHm7UUCmxTFsYhyXS2aOhwHQ=/1200x630/2022/02/04/42097202-63ba-4834-a4f1-50875c9ba5b4/hubble-ngc1705-potw2205a.jpg", "publishedAt": "2022-02-04T23:19:00Z", "content": "Hubble captured this view of fascinating dwarf galaxy NGC 1705.\r\nESA/Hubble &amp; NASA, R. Chandar\r\nSome galaxies really have it together. They sport glorious, well-organized spiral arms and defined … [+1487 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "A parachute on a SpaceX Dragon capsule didn’t open as fast as expected as the craft descended to Earth - Business Insider Australia", "description": "It's the second time a SpaceX Dragon parachute has failed to open as expected. NASA and SpaceX are investigating.", "url": "https://www.businessinsider.com/spacex-nasa-lagging-parachute-phenomenon-dragon-spacecraft-2022-2", "urlToImage": "https://i.insider.com/61fe43c0bd5041001918e43a?format=jpeg", "publishedAt": "2022-02-04T22:55:00Z", "content": "SpaceX CEO Elon Musk. PHILIP PACHECO/AFP via Getty Images \r\nOne of the four primary parachutes on a SpaceX Dragon craft took longer than expected to deploy as the capsule descended to Earth in Januar… [+1664 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Michael Kan", "title": "Astronomers Join Forces to Prevent Starlink, Satellite Swarms From Polluting Skies - PCMag AU", "description": "The International Astronomical Union creates a new coordination center devoted to the protection of night skies from satellite mega-constellations, including SpaceX's Starlink.", "url": "https://au.pcmag.com/networking/92295/astronomers-join-forces-to-prevent-starlink-satellite-swarms-from-polluting-skies", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/a/astronomer/astronomers-join-forces-to-prevent-starlink-satellite-swarms_dh72.1200.jpg", "publishedAt": "2022-02-04T22:17:58Z", "content": "The astronomical community is setting up a center to work with companies and governments on preventing satellite networks, including SpaceXs Starlink, from polluting the night sky. \r\nThe effort comes… [+2749 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Liquid metals, surface patterns, and the romance of the three kingdoms — ScienceDaily - Verve Times", "description": "The opening lines of the great Chinese historical novel Romance of the Three Kingdoms condense its complex and spectacular stories into a coherent pattern, that is, power blocs divide and unite cyclically in turbulent battle years.A good philosophy o", "url": "https://vervetimes.com/liquid-metals-surface-patterns-and-the-romance-of-the-three-kingdoms-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-04T20:28:47Z", "content": "The opening lines of the great Chinese historical novel Romance of the Three Kingdoms condense its complex and spectacular stories into a coherent pattern, that is, power blocs divide and unite cycli… [+3557 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "This remote-control robot takes its orders from space - SlashGear", "description": "One of the biggest challenges in space exploration is the dangerous nature of space environments: many places we want to explore have no or low levels of oxygen, low or micro-gravity, and potential…", "url": "https://www.slashgear.com/this-remote-control-robot-takes-its-orders-from-space-04710661/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2022/02/robot.jpg", "publishedAt": "2022-02-04T20:25:25Z", "content": "One of the biggest challenges in space exploration is the dangerous nature of space environments: many places we want to explore have no or low levels of oxygen, low or micro-gravity, and potentially… [+2876 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Claire Cameron", "title": "NASA confirms the Webb Telescope has successfully detected its first photons - Inverse", "description": "The James Webb Space Telescope has captured its first photons — the genesis of its scientific mission to image the universe in new ways.", "url": "https://www.inverse.com/science/webb-first-photons", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/2/4/9890ec6b-43b7-4239-b588-6a01a8ae31ea-getty-1320428199.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-04T20:00:30Z", "content": "The \r\nJames Webb\r\n Space Telescope has done it: On February 3, NASA announced the first particles of light have made their way through the entire telescope. This is the closest scientists have come t… [+4236 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Scientists discover youngest-known asteroid pair, and they're cosmic babies - CNET", "description": "Congratulations! It's a bouncing baby asteroid pair!", "url": "https://www.cnet.com/news/scientists-discover-youngest-known-asteroid-pair-and-theyre-cosmic-babies/", "urlToImage": "https://www.cnet.com/a/img/Wx5UQzFmlzoX3M2CujFykWJsUl4=/1200x630/2022/02/04/a79b4e2d-a17c-41ab-bf75-6862eb03c63d/asteroidpairilluspromo.jpg", "publishedAt": "2022-02-04T19:35:00Z", "content": "This illustration shows what Asteroid pair 2019 PR 2 and 2019 QR6 might look like.  \r\nUC Berkeley/SETI Institute\r\nBack when asteroids 2019 PR2 and 2019 QR6 were born, humans in the 18th century were … [+2279 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Reuters", "title": "Ghost riders in the sky! Found in Earth's orbit, not just 1, but 2 asteroids - HT Tech", "description": "An asteroid was discovered riding along in Earth's orbit and it might remain as a hitchhiker with our planet for at least 4,000 years. There is another too", "url": "https://tech.hindustantimes.com/tech/news/ghost-riders-in-the-sky-found-in-earth-s-orbit-not-just-1-but-2-asteroids-71644001875763.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/04/1600x900/SPACE-EXPLORATION-ASTEROID-0_1644002463059_1644002516400.JPG", "publishedAt": "2022-02-04T19:24:54Z", "content": "An asteroid that was discovered riding along in Earth's orbit is about three-quarters of a mile (1.2 km) wide and might remain as a hitchhiker with our planet for at least 4,000 more years while posi… [+3392 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Mars Perseverance Rover: Almost on the Rove Again - SciTechDaily", "description": "Science as Perseverance dislodges pebbles and prepares to head back north. We’ll soon be on the move again after shaking loose some pesky pebbles that became lodged in Perseverance’s bit carousel. How has the science team been making the best use of our exten…", "url": "https://scitechdaily.com/nasa-mars-perseverance-rover-almost-on-the-rove-again/", "urlToImage": "https://scitechdaily.com/images/NASA-Mars-Perseverance-Rover-Driving.gif", "publishedAt": "2022-02-04T18:25:05Z", "content": "Anomation of the Perseverance Rover driving on Mars. NASA/JPL-Caltech\r\nScience as Perseverance dislodges pebbles and prepares to head back north.\r\nWe’ll soon be on the move again after shaking loose … [+3142 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Raphael Rosen", "title": "New insight into blobs improves understanding of a universal process - Phys.org", "description": "Researchers at the U.S. Department of Energy's (DOE) Princeton Plasma Physics Laboratory (PPPL) have gained insight into a fundamental process found throughout the universe. They discovered that the magnetic fields threading through plasma, the charged state …", "url": "https://phys.org/news/2022-02-insight-blobs-universal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-insight-into-blobs.jpg", "publishedAt": "2022-02-04T18:21:45Z", "content": "Researchers at the U.S. Department of Energy's (DOE) Princeton Plasma Physics Laboratory (PPPL) have gained insight into a fundamental process found throughout the universe. They discovered that the … [+4012 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Observing more disk galaxies than theory allows - Phys.org", "description": "The Standard Model of Cosmology describes how the universe came into being according to the view of most physicists. Researchers at the University of Bonn have now studied the evolution of galaxies within this model, finding considerable discrepancies with ac…", "url": "https://phys.org/news/2022-02-disk-galaxies-theory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/too-many-disk-galaxies.jpg", "publishedAt": "2022-02-04T18:19:56Z", "content": "The Standard Model of Cosmology describes how the universe came into being according to the view of most physicists. Researchers at the University of Bonn have now studied the evolution of galaxies w… [+4518 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Doris Elin Urrutia", "title": "Axiom Space's 1st space station crew approved by NASA, ISS partners - Space.com", "description": "The mission is scheduled to launch on March 30.", "url": "https://www.space.com/axiom-space-ax-1-iss-crew-approved", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CHBsuLvnePa5o43cWnMjuH-1200-80.jpg", "publishedAt": "2022-02-04T16:48:22Z", "content": "Axiom Space's first astronaut crew just got the green light from NASA and the other International Space Station (ISS) partners for a trip to the orbiting lab.\r\nAxiom's first crewed mission to the ISS… [+4793 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Laminating organic photovoltaics onto curved surfaces - Phys.org", "description": "Heat-shrinkable technology developed by an all-RIKEN team could allow solar cells and touch sensors to be attached to objects whose shapes make them challenging to laminate.", "url": "https://phys.org/news/2022-02-laminating-photovoltaics-surfaces.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/laminating-organic-pho.jpg", "publishedAt": "2022-02-04T16:20:02Z", "content": "Heat-shrinkable technology developed by an all-RIKEN team could allow solar cells and touch sensors to be attached to objects whose shapes make them challenging to laminate.\r\nRecent studies have indi… [+3180 chars]"}, {"source": {"id": null, "name": "Myheraldreview.com"}, "author": "Ted Forte", "title": "Backyard Astronomer: NASA's return to the moon well under way - myheraldreview.com", "description": "For the first time in 50 years, NASA is poised to return humans to the moon. The Artemis Program’s initial goal is to land the first woman and the next", "url": "https://www.myheraldreview.com/news/soco_life/backyard-astronomer-nasa-s-return-to-the-moon-well-under-way/article_442242f8-85d6-11ec-a75e-a3b61c34fdce.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/myheraldreview.com/content/tncms/custom/image/5de3b48c-b05c-11e7-99b7-db39ff5c3a7d.jpg?crop=630%2C630%2C285%2C0&resize=200%2C200&order=crop%2Cresize", "publishedAt": "2022-02-04T16:19:00Z", "content": "For the first time in 50 years, NASA is poised to return humans to the moon. The Artemis Programs initial goal is to land the first woman and the next man on the moon in 2025.\r\nIn Greek mythology, Ar… [+4554 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "MIT Engineers Build Impossible Material: Stronger Than Steel But Light As Plastic - India Times", "description": "MIT engineers have developed a novel material that’s stronger than steel and as light as plastic.                         Representational image: UnsplashAlso Read: Promising New Material Can Store Solar Energy For At Least Four Months: StudyDeveloped with th…", "url": "https://www.indiatimes.com/technology/news/mit-engineers-stronger-than-steel-plastic-light-material-561186.html", "urlToImage": "https://im.indiatimes.in/content/2022/Feb/FB-Image-Quote-16_61fd08ad10b7e.jpg", "publishedAt": "2022-02-04T13:30:59Z", "content": "MIT engineers have developed a novel material thats stronger than steel and as light as plastic. \r\nRepresentational image: Unsplash\r\nAlso Read: Promising New Material Can Store Solar Energy For At Le… [+2495 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Focus on organic transistors for health sensors within living organisms - Phys.org", "description": "QUT researchers are part of an international group who have explored ways in which organic transistors are being developed for use as wearable health sensors.", "url": "https://phys.org/news/2022-02-focus-transistors-health-sensors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/focus-on-organic-trans.jpg", "publishedAt": "2022-02-04T13:04:41Z", "content": "QUT researchers are part of an international group who have explored ways in which organic transistors are being developed for use as wearable health sensors.\r\nThe currently available bioelectronic d… [+3375 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "A New Database Reveals How Much Humans Are Messing With Evolution - Verve Times", "description": "This might seem like a minor concern, in the wake of coral bleaching and mass extinction, but it could have serious knock-on effects. Take salmon for instance: Smaller fish mean less money for the communities who rely on catching them. It means less", "url": "https://vervetimes.com/a-new-database-reveals-how-much-humans-are-messing-with-evolution/", "urlToImage": "https://media.wired.com/photos/61fc4b8d03f9ae99229f486a/191:100/w_1280,c_limit/Science_evolution_GettyImages-528708268.jpg", "publishedAt": "2022-02-04T12:33:51Z", "content": "This might seem like a minor concern, in the wake of coral bleaching and mass extinction, but it could have serious knock-on effects. Take salmon for instance: Smaller fish mean less money for the co… [+3833 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA shares stunning images of cosmic phenomena, see viral pictures here - WION", "description": "NASA has shared a set of stunning images taken from its Hubble telescope and Chandra X-Ray Observatory. It claims that these telescopes can detect different kinds of light which helps them in fully investigating the cosmic phenomena.", "url": "https://www.wionews.com/world/nasa-shares-stunning-images-of-cosmic-phenomena-see-viral-pictures-here-450449", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/02/04/238449-untitled-design-2.jpg", "publishedAt": "2022-02-04T11:59:31Z", "content": "NASA has shared a set of stunning images taken from its Hubble telescope and Chandra X-Ray Observatory. It claims that these telescopes can detect different kinds of light which helps them in fully i… [+1199 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Detecting non-uniformities in 2D materials may lead to new medical sensors - Phys.org", "description": "A novel and better approach at detecting non-uniformities in the optical properties of two-dimensional (2D) materials could potentially open the door to new uses for these materials, such as the application of 2D materials for drug detection, according to a t…", "url": "https://phys.org/news/2022-02-non-uniformities-2d-materials-medical-sensors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/detecting-non-uniformi.jpg", "publishedAt": "2022-02-04T11:46:06Z", "content": "A novel and better approach at detecting non-uniformities in the optical properties of two-dimensional (2D) materials could potentially open the door to new uses for these materials, such as the appl… [+6615 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "https://www.facebook.com/malewar.amit", "title": "New submersible robot to help explore uncharted, underwater glacial walls - Inceptive Mind", "description": "The new mission will explore three of Greenland's glaciers with a submersible robot.", "url": "https://www.inceptivemind.com/nui-submersible-robot-explore-uncharted-underwater-greenlands-glaciers/23198/", "urlToImage": "https://cdn.inceptivemind.com/wp-content/uploads/2022/02/Greenland-glacier-Kangerlussuup-Sermia.jpg", "publishedAt": "2022-02-04T11:41:16Z", "content": "Greenland’s glaciers – which make up the world’s second-largest ice sheet – are the front line of climate change and could hold the key to predicting a global sea-level rise. But what goes on at the … [+2853 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Found Mars Rock in Sahara Desert Provides New Insights Into The Red Planet's Habitability - Optic Flux", "description": "Curtin University is researching a chunk of a Martian meteorite found on Earth in the Moroccan Sahara Desert in 2011 and initially reported in 2013. According to experts from Australia's Curtin University, scientists are one step closer to knowing when Mars w…", "url": "https://www.opticflux.com/found-mars-rock-in-sahara-desert-provides-new-insights-into-the-red-planets-habitability/15357/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/nh3kflhxikegxcnc_1643890665.webp", "publishedAt": "2022-02-04T09:26:44Z", "content": "Curtin University is researching a chunk of a Martian meteorite found on Earth in the Moroccan Sahara Desert in 2011 and initially reported in 2013.\r\nAccording to experts from Australia’s Curtin Univ… [+4094 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Astrophysicists identified the origin of supermassive black hole flares - Tech Explorist", "description": "Largest-ever simulations suggest flickering powered by magnetic ‘reconnection’.", "url": "https://www.techexplorist.com/origin-supermassive-black-hole-flares/44539/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/02/black-hole.jpg", "publishedAt": "2022-02-04T08:53:51Z", "content": "Supermassive black holes don’t give off light themselves, but they are known to emit flares periodically. These flares are shining from just outside the event horizon of supermassive black holes. \r\nA… [+4491 chars]"}, {"source": {"id": null, "name": "Sunshinecoastnews.com.au"}, "author": null, "title": "How some GRLTLK can create positive ripples for teens - Sunshine Coast News", "description": "Two Sunshine Coast women are hoping to help young girls find their own empowered sense of self love as they navigate their tricky teenage years. GRLTLK, or Girl Talk, is the shared vision of Sarhan Allen and Aelish Healy, who hope to use their own experiences…", "url": "https://www.sunshinecoastnews.com.au/2022/02/04/girl-talk-workshop-grltlk/", "urlToImage": "https://www.sunshinecoastnews.com.au/wp-content/uploads/2022/02/GRLTLK-e1643964328116.jpg", "publishedAt": "2022-02-04T08:46:02Z", "content": "Two Sunshine Coast women are hoping to help young girls find their own empowered sense of self love as they navigate their tricky teenage years.\r\nGRLTLK, or Girl Talk, is the shared vision of Sarhan … [+2817 chars]"}, {"source": {"id": null, "name": "Gadgettendency.com"}, "author": "https://www.facebook.com/gadgettendencycom/", "title": "“When you first get on the ISS, you notice a very strong smell,” NASA astronaut prepares Tom Cruise to shoot the first action movie in space - Gadget Tendency", "description": "NASA astronaut Victor Glover spoke with Hollywood actor Tom Cruise to prepare him for his upcoming stay aboard the International Space Station. Glover, who participated in the first operational crewed mission to the ISS aboard the SpaceX Crew Dragon spacecraf…", "url": "https://gadgettendency.com/when-you-first-get-on-the-iss-you-notice-a-very-strong-smell-nasa-astronaut-prepares-tom-cruise-to-shoot-the-first-action-movie-in-space/", "urlToImage": "https://gadgettendency.com/wp-content/uploads/2022/02/When-you-first-get-on-the-ISS-you-notice-a.jpg", "publishedAt": "2022-02-04T06:14:16Z", "content": "NASA astronaut Victor Glover spoke with Hollywood actor Tom Cruise to prepare him for his upcoming stay aboard the International Space Station. Glover, who participated in the first operational crewe… [+1341 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Landsat 9 continues to monitor Earth as post-launch review ends - The Guardian", "description": "Landsat programme began in 1970s and will pass 50th anniversary of unbroken images of Earth this year", "url": "https://amp.theguardian.com/science/2022/feb/04/landsat-9-continues-to-monitor-earth-as-post-launch-review-ends", "urlToImage": null, "publishedAt": "2022-02-04T06:00:00Z", "content": "SpacewatchLandsat programme began in 1970s and will pass 50th anniversary of unbroken images of Earth this year\r\nLandsat 9 has completed its post-launch assessment and begun its operational phase. La… [+1580 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Rollout of NASA’s New Megarocket Delayed Until at Least March - Gizmodo Australia", "description": "NASA won’t be performing a wet dress rehearsal of SLS in February as planned. This latest delay to the Artemis...", "url": "https://www.gizmodo.com.au/2022/02/rollout-of-nasas-new-megarocket-delayed-until-at-least-march/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/03/6bd4df8e49800148cbe76a66ad4a6303.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2022-02-04T05:30:00Z", "content": "NASA wont be performing a wet dress rehearsal of SLS in February as planned. This latest delay to the Artemis I mission means the 98.15 m-tall rocket wont roar through Florida skies until April at th… [+4151 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Earth’s water was around before Earth - Verve Times", "description": "Credit: Pixabay/CC0 Public Domain                        To understand how life emerged, scientists investigate the chemistry of carbon and water. In the case of water, they track the", "url": "https://vervetimes.com/earths-water-was-around-before-earth/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-water.jpg", "publishedAt": "2022-02-04T05:06:45Z", "content": "Credit: Pixabay/CC0 Public Domain\r\nTo understand how life emerged, scientists investigate the chemistry of carbon and water. In the case of water, they track the various forms, or isotopes, of its co… [+2218 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "A Cosmic Water Cloud Shadow Has Revealed The Temperature of The Early Universe - ScienceAlert", "description": "Sometimes astronomers and astrophysicists are working at such gigantic, mind-bending scales – in terms of both distance and time – that you can't help but be awestruck at the new discoveries they keep coming out with.", "url": "https://www.sciencealert.com/the-shadow-of-a-cosmic-water-cloud-reveals-the-temperature-of-the-early-universe", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/BlueGreenYellowPatchedBackground_1024.jpg", "publishedAt": "2022-02-04T05:03:07Z", "content": "Sometimes astronomers and astrophysicists are working at such gigantic, mind-bending scales in terms of both distance and time that you can't help but be awestruck at the new discoveries they keep co… [+3754 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Are scientists being fooled by bacteria? Previous studies of a genetic on/off switch may have been confound... - Verve Times", "description": "For decades, a small group of cutting-edge medical researchers have been studying a biochemical, DNA tagging system, which switches genes on or off. Many have studied it in bacteria and now some have seen signs of it in, plants, flies, and even human", "url": "https://vervetimes.com/are-scientists-being-fooled-by-bacteria-previous-studies-of-a-genetic-on-off-switch-may-have-been-confounded-by-contamination-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-04T04:53:28Z", "content": "For decades, a small group of cutting-edge medical researchers have been studying a biochemical, DNA tagging system, which switches genes on or off. Many have studied it in bacteria and now some have… [+6313 chars]"}, {"source": {"id": null, "name": "Hurriyet Daily News"}, "author": "hurriyetdailynews.com", "title": "99 million-year-old flowers perfectly preserved in amber - Hurriyet Daily News", "description": "Flowers discovered perfectly preserved in globs of amber bloomed at the feet of dinosaurs, suggesting that some flowering plants in South Africa today have remained unchanged for 99 million years, a new study reveals.", "url": "https://www.hurriyetdailynews.com/99-million-year-old-flowers-perfectly-preserved-in-amber-171247", "urlToImage": "https://i.hurimg.com/i/hdn/75/200x200/61fba0724e3fe012c04e4252.jpg", "publishedAt": "2022-02-04T04:00:00Z", "content": "LONDON\r\nFlowers discovered perfectly preserved in globs of amber bloomed at the feet of dinosaurs, suggesting that some flowering plants in South Africa today have remained unchanged for 99 million y… [+2063 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Details Plan to Retire ISS in 2030 and Deliberately Crash It Into the Pacific Ocean - Gizmodo Australia", "description": "The end of the International Space Station is finally approaching, with NASA declaring the retirement of the orbital outpost in...", "url": "https://www.gizmodo.com.au/2022/02/nasa-details-plan-to-retire-iss-in-2030-and-deliberately-crash-it-into-the-pacific-ocean/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/04/7adcf4af8aef31be67aa74c2885961e6-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-04T03:20:00Z", "content": "The end of the International Space Station is finally approaching, with NASA declaring the retirement of the orbital outpost in 2030 and a dramatic deorbiting early in the following year.\r\nNothing la… [+5186 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Reading DNA is team work - EurekAlert", "description": "When an organism develops, dividing cells specialize to form the variety of tissues and organs that build up the adult body, while keeping the same genetic material – contained in our DNA. In a process known as transcription, parts of the DNA – the genes – ar…", "url": "https://www.eurekalert.org/news-releases/942155", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/89069d93-9469-4710-a098-1b88a6beae8a/Rendition/thumbnail/Content/Public", "publishedAt": "2022-02-04T02:03:13Z", "content": "image: Droplets of transcription factors wet a surface and reveal regulatory DNA regions. This process is symbolized in this photograph of droplets of purified protein on a glass surface with hand-dr… [+5417 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Warps drive disruptions in planet formation in young solar systems - EurekAlert", "description": "A new study from the University of Warwick demonstrates the impact of passing stars, misaligned binary stars and passing gas clouds on the formation of planets in early star systems.", "url": "https://www.eurekalert.org/news-releases/942293", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/ae174bf5-5991-4f5a-9ad8-9d7275efb8ce/Rendition/thumbnail/Content/Public", "publishedAt": "2022-02-04T02:03:13Z", "content": "image: Image showing a rotating protoplanetary disc without a warpview more \r\nCredit: University of Warwick\r\n<ul><li>University of Warwick scientists identify a process that hinders the formation of … [+4944 chars]"}, {"source": {"id": null, "name": "Theislanderonline.com.au"}, "author": null, "title": "KI Research Station discovers new pollination system on Fiji - The Islander", "description": "Researchers alerted to pollination linked bat feeding thanks to the observations of Fijian island elders.", "url": "https://www.theislanderonline.com.au/story/7607390/ki-research-station-discovers-new-pollination-system-on-fiji/", "urlToImage": "https://www.theislanderonline.com.au/images/transform/v1/crop/frm/YBh6smpfqc8LAq7KVtmah/a83d22f5-213e-4420-93a0-adab2221aa40.jpg/r0_118_1280_841_w1200_h678_fmax.jpg", "publishedAt": "2022-02-04T01:28:00Z", "content": "The Kangaroo Island Research Station helped discover a new pollination system in a Fijian plant family that represents one of the last missing pieces of the puzzle of flowering plant evolution.\r\nThe … [+4625 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Do forests lead to more or fewer clouds? It depends - The News Motion", "description": "Credit: Unsplash/CC0 Public Domain                        Large-scale deforestation, forest restoration, forest fires, and droughts all have one thing in common: Most research on these", "url": "https://thenewsmotion.com/do-forests-lead-to-more-or-fewer-clouds-it-depends/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/forest-1.jpg", "publishedAt": "2022-02-04T01:27:48Z", "content": "Large-scale deforestation, forest restoration, forest fires, and droughts all have one thing in common: Most research on these topics focuses on forest ecosystems’ impact on carbon storage and releas… [+3420 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "China's Tianwen 1 Mars orbiter takes amazing video selfie for lunar New Year - Space.com", "description": "Tianwen 1 did something similar to celebrate the solar New Year a month ago.", "url": "https://www.space.com/china-tianwen-1-mars-selfie-lunar-new-year", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Mp79FLgiPk8gxQeYW6yahi-1200-80.jpeg", "publishedAt": "2022-02-03T23:10:23Z", "content": "China's Tianwen 1 Mars orbiter is once again delivering stunning imagery, with a new video released to celebrate the lunar New Year.\r\nThe 38-second clip shows shadows and sunlight moving across the b… [+1295 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Sanders,", "title": "Losing amphibian diversity also means losing poison diversity - Phys.org", "description": "While frog and salamander declines worldwide have made scientists outspoken about the need to preserve amphibian genetic diversity, two University of California, Berkeley, biologists emphasize another important reason for conserving these animals: Their poiso…", "url": "https://phys.org/news/2022-02-amphibian-diversity-poison.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/losing-amphibian-diver.jpg", "publishedAt": "2022-02-03T21:40:54Z", "content": "While frog and salamander declines worldwide have made scientists outspoken about the need to preserve amphibian genetic diversity, two University of California, Berkeley, biologists emphasize anothe… [+7922 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Supermountains May Have Played Crucial Role in Evolution of Life on Earth - Sci-News.com", "description": "The supermountains formed twice in Earth’s history: the first between 2 and 1.8 billion years ago and the second between 650 and 500 million years ago.", "url": "http://www.sci-news.com/othersciences/geoscience/nuna-gondwana-supermountains-10521.html", "urlToImage": "http://cdn.sci-news.com/images/2022/02/image_10521-Supermountains.jpg", "publishedAt": "2022-02-03T21:39:52Z", "content": "According to new research from the Australian National University and the Queensland University of Technology, the supermountains formed twice in Earths history: the first between 2 and 1.8 billion y… [+3668 chars]"}, {"source": {"id": null, "name": "FOX 10 News Phoenix"}, "author": "FOX TV Digital Team", "title": "‘Cosmic mystery’: Object found in space emitted radio bursts every 18 minutes - fox26houston.com", "description": "“We've discovered something completely new, and I'm thrilled that the universe can still surprise us like this,” said Dr. Natasha Hurley-Walker, the team's lead researcher.", "url": "https://www.fox10phoenix.com/news/cosmic-mystery-object-found-in-space-emitted-radio-bursts-every-18-minutes", "urlToImage": "https://images.foxtv.com/static.fox26houston.com/www.fox26houston.com/content/uploads/2022/02/1280/720/Stellarium1.jpg?ve=1&tl=1", "publishedAt": "2022-02-03T19:29:00Z", "content": "AUSTRALIA - A team of astrophysicists mapping the southern skies recently discovered something unusual: an unknown object that released a giant burst of energy three times an hour.\r\nThe team from the… [+2953 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New MeerKAT Image Reveals Radio-Emitting Filaments in Milky Way's Center - Sci-News.com", "description": "The new image from the MeerKAT telescope at the South African Radio Astronomy Observatory (SARAO) in Cape Town, South Africa, shows nearly 1,000 magnetized threads in the Galactic center.", "url": "http://www.sci-news.com/astronomy/radio-emitting-filaments-milky-ways-center-10519.html", "urlToImage": "http://cdn.sci-news.com/images/2022/02/image_10519-Milky-Way-Center.jpg", "publishedAt": "2022-02-03T19:18:26Z", "content": "The new image from the MeerKAT telescope at the South African Radio Astronomy Observatory (SARAO) in Cape Town, South Africa, shows nearly 1,000 magnetized threads in the Galactic center.\r\nAn image o… [+4063 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Jessica Thorne and Sabine Bellstedt", "title": "Some black holes are anything but black – and we've... - Daily Maverick", "description": "When the most massive stars die, they collapse to form some of the densest objects known in the Universe: black holes. They are the “darkest” objects in the cosmos, as not even light can escape their incredibly strong gravity.", "url": "https://www.dailymaverick.co.za/article/2022-02-03-some-black-holes-are-anything-but-black-and-weve-found-more-than-75000-of-the-brightest-ones/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/01/eso0903a-e1643191425172.jpg?w=1280", "publishedAt": "2022-02-03T18:11:11Z", "content": "Because of this, its impossible to directly image black holes, making them mysterious and quite perplexing. But our new research has road-tested a way to spot some of the most voracious black holes o… [+4631 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "A kind of sponge that absorbs certain messengers — ScienceDaily - Verve Times", "description": "Bacteria are extremely resourceful when it comes to adapting to a given environment. A team of researchers has now discovered a new trick bacteria use: a kind of sponge that absorbs certain messengers.Each year, at least 1.27 million people die from", "url": "https://vervetimes.com/a-kind-of-sponge-that-absorbs-certain-messengers-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-03T16:34:38Z", "content": "Bacteria are extremely resourceful when it comes to adapting to a given environment. A team of researchers has now discovered a new trick bacteria use: a kind of sponge that absorbs certain messenger… [+4613 chars]"}, {"source": {"id": null, "name": "Perfectmarketresearch.com"}, "author": "Maheen McMahon", "title": "Bacteria in the lake suggest life could have existed on Mars - Perfect Market Research", "description": "According to a study, microorganisms have adapted to one of the most hostile environments on Earth, a sulphurous and acidic lake in Costa Rica considered an analogue of the ancient lakes of Mars.", "url": "https://perfectmarketresearch.com/bacteria-in-the-lake-suggest-life-could-have-existed-on-mars/", "urlToImage": "https://perfectmarketresearch.com/wp-content/uploads/2022/02/Bacteria-in-the-lake-suggest-life-could-have-existed-on-Mars.jpg", "publishedAt": "2022-02-03T16:21:29Z", "content": "According to a study, microorganisms have adapted to one of the most hostile environments on Earth, a sulphurous and acidic lake in Costa Rica considered an analogue of the ancient lakes of Mars.\r\nOn… [+2676 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Prehistoric human vertebra discovered in the Jordan Valley tells the story of prehistoric migration from Africa: Approximately one and a half million years old, the vertebra is the earliest evidence of ancient man discovered in Israel - Science Daily", "description": "A new study presents a 1.5 million-year-old human vertebra discovered in Israel's Jordan Valley. According to the research, ancient human migration from Africa to Eurasia was not a one-time event but occurred in waves.", "url": "https://www.sciencedaily.com/releases/2022/02/220202080314.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-03T15:25:41Z", "content": "A new study, led by researchers from Bar-Ilan University, Ono Academic College, The University of Tulsa, and the Israel Antiquities Authority, presents a 1.5 million-year-old human vertebra discovere… [+5319 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Maxwell Moe", "title": "Dark-Matter Asteroids – “Trillions of Trillions May Exist in the Milky Way” - The Daily Galaxy --Great Discoveries Channel", "description": "“Dark matter holds the key to understanding the universe,” says astrophysicist Paul Davies. The mysterious dark matter particles compose 80% of the matter in the Universe, and they have been described as ranging from planet-sized particles to dark-matter life…", "url": "https://dailygalaxy.com/2022/02/dark-matter-asteroids-trillions-of-trillions-may-exist-in-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2022/02/shutterstock_215289955-1-scaled-e1643899910311.jpg", "publishedAt": "2022-02-03T15:13:06Z", "content": "Dark matter holds the key to understanding the universe, says astrophysicist Paul Davies. The mysterious dark matter particles compose 80% of the matter in the Universe, and they have been described … [+4914 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Understanding How Ghost Forests Produce Methane - AZoCleantech", "description": "Recent research indicates that ghost forests produce an abundance of methane. While the methane is initially produced in the soil, the trees act like vents that allow the methane to rise and escape into the atmosphere.", "url": "https://www.azocleantech.com/news.aspx?newsID=31081", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31081_16438999983667819.jpg", "publishedAt": "2022-02-03T14:56:00Z", "content": "Ghost forests are regions of former forests where dead trees are dominant. They usually occur in coastal regions where shifts in the plate tectonics or rising sea levels have significantly altered th… [+4688 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Courtney Chandler", "title": "Studying the evolution of mammals to uncover gene regulation connecting pregnancy and cancer metastasis - Phys.org", "description": "Researchers from UConn Heath and Yale University have made new advances connecting the evolution of pregnancy and cancer metastasis.", "url": "https://phys.org/news/2022-02-evolution-mammals-uncover-gene-pregnancy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/horse-and-foal.jpg", "publishedAt": "2022-02-03T14:07:23Z", "content": "Researchers from UConn Heath and Yale University have made new advances connecting the evolution of pregnancy and cancer metastasis.\r\nPublishing in the Proceedings of the National Academy of Sciences… [+4309 chars]"}]}