{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Physicists Reveal The Weird Shapes Ice Takes as It Melts at Different Temperatures - ScienceAlert", "description": "Melting ice can take on different shapes depending on the temperature of the water around it, new research reveals, giving us new insights into the complex physics that underlie this deceptively complicated transition.", "url": "https://www.sciencealert.com/the-shape-of-melting-ice-depends-on-what-temperature-it-is", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/IceMelt_1024.jpg", "publishedAt": "2022-02-02T04:05:25Z", "content": "Melting ice can take on different shapes depending on the temperature of the water around it, new research reveals, giving us new insights into the complex physics that underlie this deceptively comp… [+3836 chars]"}, {"source": {"id": null, "name": "Itbrief.com.au"}, "author": "Newsdesk", "title": "From the human brain to the stars beyond: Swinburne supercomputer to support new discoveries - DataCenterNews Asia", "description": "The as-yet-unnamed supercomputer will enable Victoria to stay on the cutting edge of space, medical technology, and sustainability research.", "url": "https://itbrief.com.au/story/from-the-human-brain-to-the-stars-beyond-swinburne-supercomputer-to-support-new-discoveries", "urlToImage": "https://itbrief.com.au/uploads/story/2022/02/02/compatible_unnamed.jpg", "publishedAt": "2022-02-02T03:00:00Z", "content": "Australia's Swinburne University of Technology will soon be home to a new supercomputer that will support research about the universe, the earth, and the human brain, thanks in part to funding of $5.… [+2697 chars]"}, {"source": {"id": null, "name": "10play.com.au"}, "author": "tenplay", "title": "Earth Has A Second Trojan Asteroid In Its Orbit And Will Be Our Friend For The Next 4000 Years - 10 News First", "description": "The Earth is confirmed to have a second Trojan Asteroid that travels ahead of it in when orbiting the Sun, a new study published in Nature Communications said.", "url": "https://10play.com.au/theproject/articles/earth-has-a-second-trojan-asteroid-in-its-orbit-and-will-be-our-friend-for-the-next-4000-years/tpa220202itwml", "urlToImage": "https://10play.com.au/ip/s3/2022/02/02/444b5da202ce36bcacb61062459d7d8f-1124968.png?image-profile=image_full&io=landscape", "publishedAt": "2022-02-02T02:17:33Z", "content": "A Trojan asteroid travels either before or behind a planet in its orbit of the Sun, in an area of the orbit known as the Lagrange point.\r\nEach planets' orbit has five Lagrange points, but only in poi… [+1187 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Nanomedicine can be improved with proper and more predictive in vitro assays - News-Medical.Net", "description": "Messenger RNA (mRNA) vaccines are a prime example of the promising field of nanomedicine. But progress in the design and application of nanoparticles as efficient delivery vehicles for biopharmaceutics containing nucleic acid or protein drug substances is, un…", "url": "https://www.news-medical.net/news/20220201/Nanomedicine-can-be-improved-with-proper-and-more-predictive-in-vitro-assays.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/PLGA_nanoparticles_for_delivery_of_drugs-620x480.jpg", "publishedAt": "2022-02-02T02:01:00Z", "content": "Messenger RNA (mRNA) vaccines are a prime example of the promising field of nanomedicine. But progress in the design and application of nanoparticles as efficient delivery vehicles for biopharmaceuti… [+3181 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Artificial intelligence system rapidly predicts how two proteins will attach: The machine-learning model could help scientists speed the development of new medicines - Science Daily", "description": "A new machine learning system can predict the structure formed when two proteins dock, in a process that's between 50 to 800 times faster than some software-based methods. This could help scientists better understand biological processes or speed the developm…", "url": "https://www.sciencedaily.com/releases/2022/02/220201165655.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-02T01:35:56Z", "content": "Antibodies, small proteins produced by the immune system, can attach to specific parts of a virus to neutralize it. As scientists continue to battle SARS-CoV-2, the virus that causes Covid-19, one po… [+5946 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New research links continents to key transitions in Earth's oceans, atmosphere and climate - Science Daily", "description": "A new study advances the understanding of the role that continents have played in the chemical evolution of Earth's oceans, with implications for understanding atmospheric oxygenation and global climate oscillations.", "url": "https://www.sciencedaily.com/releases/2022/02/220201161052.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-02T01:21:43Z", "content": "A new study led by University of Wisconsin Oshkosh geologist Timothy Paulsen and Michigan Tech geologist Chad Deering advances the understanding of the role that continents have played in the chemica… [+2336 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "John Hanscombe", "title": "One man, his robot and a bold bid to save the Great Barrier Reef - Port Macquarie News", "description": "Stephen Rodan's love of the Great Barrier Reef was forged in childhood.", "url": "https://www.canberratimes.com.au/story/7603722/one-man-his-robot-and-a-bold-bid-to-save-the-great-barrier-reef/", "urlToImage": "https://www.portnews.com.au/images/transform/v1/crop/frm/GJZ5TVpAk84wrTzsQfLQRB/83529b42-c187-4381-8879-8c178b5c58d9.PNG/r4_49_1838_1085_w1200_h678_fmax.jpg", "publishedAt": "2022-02-02T01:00:00Z", "content": "Stephen Rodan spent his childhood exploring the Whitsundays. Photo: Studio John Fish"}, {"source": {"id": null, "name": "Travel Weekly"}, "author": null, "title": "Royal Caribbean ship under investigation for stopping SpaceX rocket launch – Travel Weekly - Travel Weekly", "description": "Harmony of the Seas, a cruise ship from Royal Caribbean, sailed too close to the 'no-go zone' of a SpaceX rocket launch, causing the launch to be aborted.", "url": "https://www.travelweekly.com.au/article/royal-caribbean-ship-under-investigation-for-stopping-spacex-rocket-launch/", "urlToImage": "https://www.travelweekly.com.au/wp-content/uploads/2016/05/HM-Southampton-Arrival.jpg", "publishedAt": "2022-02-02T00:42:56Z", "content": "Harmony of the Seas, a Royal Caribbean cruise ship, sailed too close to the ‘no-go zone’ of a SpaceX rocket launch, causing the launch to be aborted.\r\nAn investigation has been opened by the US Coast… [+1368 chars]"}, {"source": {"id": null, "name": "Times Higher Education (THE)"}, "author": null, "title": "Preprints 'largely unchanged' by peer review, even during Covid - Times Higher Education (THE)", "description": "Two separate studies, including one that looked at early Covid papers, suggest majority of alterations are minimal", "url": "https://www.timeshighereducation.com/news/preprints-largely-unchanged-peer-review-even-during-covid", "urlToImage": "https://www.timeshighereducation.com/sites/default/files/elvis_the_030222_p7_elvis_getty_copy.jpg", "publishedAt": "2022-02-02T00:12:27Z", "content": "Most preprint studies are being fully published without major changes, including those that were quickly shared on servers in the early days of the pandemic, according to two separate studies.\r\nIn on… [+2491 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "UK plants flowering a month earlier due to climate change - Phys.org", "description": "Climate change is causing plants in the UK to flower a month earlier on average, which could have profound consequences for wildlife, agriculture and gardeners.", "url": "https://phys.org/news/2022-02-uk-month-earlier-due-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/uk-plants-flowering-a.jpg", "publishedAt": "2022-02-02T00:00:02Z", "content": "Climate change is causing plants in the UK to flower a month earlier on average, which could have profound consequences for wildlife, agriculture and gardeners.\r\nUsing a citizen science database with… [+5543 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Space Telescope Captures a Star-Forming Chamaeleon - SciTechDaily", "description": "This NASA Hubble Space Telescope image captures one of three segments that comprise a 65-light-year wide star-forming region named the Chamaeleon Cloud Complex. The segment in this Hubble composite image, called Chamaeleon Cloud I (Cha I), reveals dusty-dark …", "url": "https://scitechdaily.com/hubble-space-telescope-captures-a-star-forming-chamaeleon/", "urlToImage": "https://scitechdaily.com/images/Chamaeleon-Cloud-Complex-scaled.jpg", "publishedAt": "2022-02-01T22:58:15Z", "content": "Hubble Space Telescope image of Chamaeleon Cloud I (a segment of the Chamaeleon Cloud Complex), reveals dusty-dark clouds where stars are forming, dazzling reflection nebulae glowing by the light of … [+2167 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Powerful solar flare from recent sun eruption should reach Earth Wednesday - Space.com", "description": "A powerful solar flare has been traveling through space and it will arrive at planet Earth Wednesday (Feb. 2).", "url": "https://www.space.com/sunspot-ar2936-solar-flare-cme-arrival-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ixsdd3WHKdrBtgQkeodRuh-1200-80.gif", "publishedAt": "2022-02-01T22:12:57Z", "content": "A CME erupted on Jan. 30, 2022 and is set to arrive at Earth on Feb. 2, 2022.  (Image credit: SOHO)\r\nA powerful solar flare has been traveling through space and it will arrive at planet Earth Wednesd… [+2154 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "​​Large-scale study shows declining soybean resistance to stem and root rot - Phys.org", "description": "Phytophthora stem and root rot results in approximately $50 million in annual losses for Canadian soybean production and is especially devastating because it can attack soybean plants at all growth stages. To combat this disease, growers turn to soybeans with…", "url": "https://phys.org/news/2022-02-large-scale-declining-soybean-resistance-stem.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/large-scale-study-show.jpg", "publishedAt": "2022-02-01T22:08:50Z", "content": "Phytophthora stem and root rot results in approximately $50 million in annual losses for Canadian soybean production and is especially devastating because it can attack soybean plants at all growth s… [+2558 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Damian Carrington", "title": "Extreme heat in oceans ‘passed point of no return’ in 2014 - The Guardian", "description": "Formerly rare high temperatures now covering half of seas and devastating wildlife, study shows", "url": "https://amp.theguardian.com/environment/2022/feb/01/extreme-heat-oceans-passed-point-of-no-return-high-temperatures-wildlife-seas", "urlToImage": null, "publishedAt": "2022-02-01T22:00:00Z", "content": "OceansFormerly rare high temperatures now covering half of seas and devastating wildlife, study shows\r\nExtreme heat in the worlds oceans passed the point of no return in 2014 and has become the new n… [+4279 chars]"}, {"source": {"id": null, "name": "Aviation Week"}, "author": null, "title": "NRO To Launch Classified Payload On Falcon 9 - Aviation Week", "description": "The National Reconnaissance Office and SpaceX on Feb. 2 plan to launch the first Falcon 9 carrying an NRO payload procured under the National Security Space Launch program, and the first time a booster will be reused for another NRO mission.", "url": "https://aviationweek.com/aerospace/urban-unmanned-aviation/nro-launch-classified-payload-falcon-9", "urlToImage": "https://aviationweek.com/sites/default/files/2021-06/falcon9launchbetter.jpeg", "publishedAt": "2022-02-01T21:59:03Z", "content": "NRO To Launch Classified Payload On Falcon 9 is published in Aerospace Daily &amp; Defense Report, an Aviation Week Intelligence Network (AWIN) Market Briefing and is included with your AWIN membersh… [+307 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA details plan to deorbit International Space Station in 2031 - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-02-01T21:15:23Z", "content": ""}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Miller", "title": "Did comet's fiery destruction lead to downfall of ancient Hopewell? - Phys.org", "description": "The rapid decline of the Hopewell culture about 1,500 years ago might be explained by falling debris from a near-Earth comet that created a devastating explosion over North America, laying waste to forests and Native American villages alike.", "url": "https://phys.org/news/2022-02-comet-fiery-destruction-downfall-ancient.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/did-comets-fiery-destr.jpg", "publishedAt": "2022-02-01T21:03:39Z", "content": "The rapid decline of the Hopewell culture about 1,500 years ago might be explained by falling debris from a near-Earth comet that created a devastating explosion over North America, laying waste to f… [+6058 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "Weird Exoplanet Has ‘Extreme Cocktail’ Of An Atmosphere - Forbes", "description": "A huge, distant “hot Jupiter” orbiting close to its parent star has interesting stuff in its atmosphere.", "url": "https://www.forbes.com/sites/elizabethhowell1/2022/02/01/weird-exoplanet-has-extreme-cocktail-of-an-atmosphere/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/61f6aabe8549f926fe8b8f44/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-02-01T21:00:00Z", "content": "Artist's impression of WASP-189b.\r\nESA\r\nA huge, distant hot Jupiter orbiting close to its parent star has a lot of interesting components in its atmosphere, new studies reveal.\r\nIron, chromium, vanad… [+2508 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Moons may yield clues to what makes planets habitable - Science Daily", "description": "Earth's moon is vitally important in making Earth the planet we know today. Because the moon is so important to life on Earth, scientists conjecture that a moon may be a potentially beneficial feature in harboring life on other planets. Most planets have moon…", "url": "https://www.sciencedaily.com/releases/2022/02/220201144027.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T20:53:20Z", "content": "Earth's moon is vitally important in making Earth the planet we know today: the moon controls the length of the day and ocean tides, which affect the biological cycles of lifeforms on our planet. The… [+3753 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Monisha Ravisetti", "title": "This space rock could lead us to a gold mine of cosmic discoveries - CNET", "description": "The second \"Earth Trojan\" ever located can serve as a marker for future space exploration.", "url": "https://www.cnet.com/news/this-space-rock-could-lead-us-to-a-gold-mine-of-cosmic-discoveries/", "urlToImage": "https://www.cnet.com/a/img/HEozwxdCWUdpWbnlgAbBxAJGLg8=/1200x630/2022/02/01/e8cde084-89e6-4735-8118-37d6893f1cec/noirlab-asteroid.jpg", "publishedAt": "2022-02-01T20:43:00Z", "content": "In this illustration, the asteroid is found at the lower left. The two bright points above it on the far left are Earth (right) and the moon. The sun appears on the top right. \r\nNOIRLab/NSF/AURA/J. d… [+6128 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA’s Asteroid Detector Was Upgraded to Scan the Entire Sky Every Day - Gizmodo Australia", "description": "NASA’s ATLAS, a planetary defence system that scans the sky for near-Earth objects, has been upgraded to search the entire...", "url": "https://www.gizmodo.com.au/2022/02/nasas-asteroid-detector-was-upgraded-to-scan-the-entire-sky-every-day/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/02/c79da3e8dbdb27ab5f0a934524fdb7e1-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-01T20:25:00Z", "content": "NASAs ATLAS, a planetary defence system that scans the sky for near-Earth objects, has been upgraded to search the entire night sky half of it in either hemisphere once every 24 hours. The surveillan… [+3865 chars]"}, {"source": {"id": null, "name": "TechTheLead"}, "author": "Roxana Ion", "title": "Planetary Scientist Believe Mars Had Habitats for Longer Than we Thought - TechTheLead", "description": "Life on Mars ain’t just a song. For a long time, humans have been investigating life forms on the red planet, and this is still being the most intriguing dilemma for planetary scientists. Well, progress has been made as new research from Mars scientists sugge…", "url": "https://techthelead.com/planetary-scientist-believe-mars-had-habitats-for-longer-than-we-thought/", "urlToImage": "https://d3eys52k95jjdh.cloudfront.net/wp-content/uploads/2022/02/images-2.fit_lim.size_2000x.v1643395792-1000x600.jpg", "publishedAt": "2022-02-01T20:02:30Z", "content": "Life on Mars ain’t just a song. For a long time, humans have been investigating life forms on the red planet, and this is still being the most intriguing dilemma for planetary scientists.\r\nWell, prog… [+1512 chars]"}, {"source": {"id": null, "name": "Motorbiscuit.com"}, "author": null, "title": "Looks Like Elon Musk Will Crash a Falcon 9 Rocket Into the Moon - MotorBiscuit", "description": "We don't tend to worry about space junk, but Elon Musk and his Falcon 9 rocket have forced us to care about space trash.", "url": "https://www.motorbiscuit.com/elon-musk-might-literally-crash-falcon-9-moon/", "urlToImage": "https://www.motorbiscuit.com/wp-content/uploads/2022/02/SpaceX-Falcon-9-scaled.jpg", "publishedAt": "2022-02-01T20:02:04Z", "content": "As if we didn’t have enough to worry about from Tesla’s eccentric CEO, Elon Musk. The tech giant has long had one eye on Earth and the other on space. He and his other company, SpaceX, have sent seve… [+2851 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Spot Second-Generation Planet-Forming Disks around Ancient Binary Stars - Sci-News.com", "description": "Astronomers have assembled a catalog of all known Galactic binaries featuring massive disks of gas and dust that are similar to the protoplanetary disks that are known to surround young stars.", "url": "http://www.sci-news.com/astronomy/second-generation-planet-forming-disks-ancient-binary-stars-10510.html", "urlToImage": "http://cdn.sci-news.com/images/2022/02/image_10510-Second-Generation-Planets.jpg", "publishedAt": "2022-02-01T19:58:05Z", "content": "Astronomers have assembled a catalog of all known Galactic binaries featuring massive disks of gas and dust that are similar to the protoplanetary disks that are known to surround young stars.\r\nAn ar… [+2599 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New computational tool predicts cell fates and genetic perturbations - Science Daily", "description": "Researchers have built a machine learning framework that can define the mathematical equations describing a cell's trajectory from one state to another, such as its development from a stem cell into one of several different types of mature cell. The framework…", "url": "https://www.sciencedaily.com/releases/2022/02/220201115139.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T18:52:58Z", "content": "Imagine a ball thrown in the air: it curves up, then down, tracing an arc to a point on the ground some distance away. The path of the ball can be described with a simple mathematical equation, and i… [+7877 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Elizabeth Fernandez", "title": "Earth's mantle: how earthquakes reveal the history and inner structure of our planet - Big Think", "description": "We know more about the universe than what is beneath our feet. But Earth's mantle holds subtle clues about our planet's past.", "url": "https://bigthink.com/hard-science/earths-mantle-earthquakes/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/02/AdobeStock_206315813.jpeg", "publishedAt": "2022-02-01T18:00:00Z", "content": null}, {"source": {"id": null, "name": "Nature World News"}, "author": "Rain Jordan", "title": "Migratory Birds Use Earth's Magnetic Field to Effectively Locate Their Nesting Places - Nature World News", "description": "Migratory birds have no issue finding their route because of a combination of vision-based monitoring of the Earth's magnetic field and an in-built compass that allows them to position themselves according to magnetic intensity.", "url": "https://www.natureworldnews.com/articles/49128/20220201/birds-use-earths-magnetic-field-effectively-locate-nesting-places.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/57235/poultry-placed-indoors-due-to-deadly-h5n1-virus.jpg", "publishedAt": "2022-02-01T17:50:26Z", "content": "Migratory birds have no issue finding their route because of a combination of vision-based monitoring of the Earth's magnetic field and an in-built compass that allows them to position themselves acc… [+4110 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Southern Ocean outgassing affects the global carbon budget - Earth.com", "description": "Southern Ocean outgassing affects the global carbon budget • Earth.com", "url": "https://www.earth.com/news/southern-ocean-outgassing-affects-the-global-carbon-budget/", "urlToImage": "https://cff2.earth.com/uploads/2022/02/01100258/outgassing-scaled.jpg", "publishedAt": "2022-02-01T17:43:08Z", "content": "Since it contains large amounts of carbon dioxide, the Southern Ocean surrounding Antarctica plays a highly important role in global climate. According to a new study led by the University of Gothenb… [+2206 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Meet Matthias Maurer, Crew-3 Mission Specialist - NASA Johnson", "description": "Can a materials scientist and former paramedic find a place in space?  ESA (European Space Agency) astronaut Matthias Maurer is doing just that, right now, o...", "url": "https://www.youtube.com/watch?v=dQLFYgCEVJA", "urlToImage": "https://i.ytimg.com/vi/dQLFYgCEVJA/maxresdefault.jpg", "publishedAt": "2022-02-01T17:34:48Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Meet Tom Marshburn, Crew-3 Pilot - NASA Johnson", "description": "Very few astronauts can boast of having launched to space on three different vehicles, but NASA’s Tom Marshburn is one of them!  The former flight surgeon, a...", "url": "https://www.youtube.com/watch?v=svXtXWC-XIo", "urlToImage": "https://i.ytimg.com/vi/svXtXWC-XIo/maxresdefault.jpg", "publishedAt": "2022-02-01T17:34:44Z", "content": null}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Curiosity detects potentially biologically-produced carbon signature on Mars - NASASpaceFlight.com - NASASpaceflight.com", "description": "NASA’s Curiosity rover, which has been scouring Gale Crater and the slopes of Mount Sharp…", "url": "https://www.nasaspaceflight.com/2022/02/curiosity-carbon-signature/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/01/51440689915_4e81a84534_o-2.jpg", "publishedAt": "2022-02-01T17:17:22Z", "content": "NASAs Curiosity rover, which has been scouring Gale Crater and the slopes of Mount Sharp (Aeolis Mons) since 2012, has detected an important carbon signature in samples collected using its assortment… [+7792 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Peculiar ionized structures, supernova remnants detected around an ultraluminous X-ray source - Phys.org", "description": "Using the Very Large Telescope (VLT), French astronomers have performed spectroscopic observations of an ultraluminous X-ray source known as NGC 1313 X–1. The observational campaign resulted in the detection of a shocked-ionized bubble, an X-ray photoionized …", "url": "https://phys.org/news/2022-02-peculiar-ionized-supernova-remnants-ultraluminous.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/peculiar-ionized-struc.jpg", "publishedAt": "2022-02-01T17:00:02Z", "content": "Using the Very Large Telescope (VLT), French astronomers have performed spectroscopic observations of an ultraluminous X-ray source known as NGC 1313 X1. The observational campaign resulted in the de… [+3492 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "What It Looks Like When A Spacecraft Flies Through A Comet Tail - Forbes", "description": "A European spacecraft zoomed through a comet tail last month and got incredible views.", "url": "https://www.forbes.com/sites/elizabethhowell1/2022/02/01/what-it-looks-like-when-a-spacecraft-flies-through-a-comet-tail/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/61f6adcd8430a5ab047ac52f/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-02-01T17:00:00Z", "content": "Three views of Comet Leonard in ultraviolet light.\r\nESA/Solar Orbiter/Metis Team\r\nA European spacecraft zoomed through a comet tail last month and got incredible data showing the environment in this … [+2287 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Mars rock makes 'surprised' face as NASA rover snags a sample - CNET", "description": "It's the Mr. Bill of Martian rocks.", "url": "https://www.cnet.com/news/mars-rock-makes-surprised-face-as-nasa-rover-snags-a-sample/", "urlToImage": "https://www.cnet.com/a/img/HZtvwSByaKJ_uV_4FBiAtqulcE0=/1200x630/2022/01/31/df5742a9-61ea-481c-9457-bc6a424af15f/marssurprise.jpg", "publishedAt": "2022-02-01T16:29:50Z", "content": "This Mars rock nicknamed \"Issole\" looks like it's wearing a surprise face, but that actually comes from NASA's Perseverance rover drilling for rock samples.\r\nNASA/JPL-Caltech\r\nThis story is part of W… [+1942 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "N-alkanes proved to be a safe, novel and green cooling material - Phys.org", "description": "The traditional refrigerant Freon is a strong greenhouse gas that leads to serious climate problems. Stimulated by the excellent cooling performance of plastic crystal materials, barocaloric (BC) cooling received much attention recently as a promising green r…", "url": "https://phys.org/news/2022-02-n-alkanes-safe-green-cooling-material.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/n-alkanes-proved-as-a.jpg", "publishedAt": "2022-02-01T16:21:52Z", "content": "The traditional refrigerant Freon is a strong greenhouse gas that leads to serious climate problems. Stimulated by the excellent cooling performance of plastic crystal materials, barocaloric (BC) coo… [+2704 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "After a dazzling evening launch, SpaceX going for Falcon 9 doubleheader - Ars Technica", "description": "Seeing stage separation in a whole new light after this flight.", "url": "https://arstechnica.com/science/2022/02/after-a-dazzling-evening-launch-spacex-going-for-falcon-9-doubleheader/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/51856205295_5ae7527666_k-760x380.jpg", "publishedAt": "2022-02-01T16:01:47Z", "content": "31 with 27 posters participating\r\n<ul><li>\r\n Launch of the COSMO-SkyMed Second Generation satellite on January 31. \r\n</li><li>\r\n This was the fifth attempt to launch this mission. \r\n</li><li>\r\n The s… [+3317 chars]"}, {"source": {"id": null, "name": "Graphene-Info"}, "author": "Roni Peleg", "title": "Machine learning helps improve the flash graphene process - Graphene-Info", "description": null, "url": "https://www.graphene-info.com/machine-learning-helps-improve-flash-graphene-process", "urlToImage": null, "publishedAt": "2022-02-01T15:45:10Z", "content": "Scientists at Rice University are using machine-learning techniques to fine-tune the process of synthesizing graphene from waste through flash Joule heating. The researchers describe in their new wor… [+2977 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Joanna Wendel", "title": "Clues to Pluto's history lie in its faults - Phys.org", "description": "The world first glimpsed Pluto up close when NASA's New Horizons spacecraft whizzed by it in July 2015. One of the most exciting discoveries scientists made based on New Horizons data was that Pluto, despite orbiting at more than 5 billion kilometers from the…", "url": "https://phys.org/news/2022-02-clues-pluto-history-faults.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/clues-to-plutos-histor.jpg", "publishedAt": "2022-02-01T15:14:49Z", "content": "The world first glimpsed Pluto up close when NASA's New Horizons spacecraft whizzed by it in July 2015. One of the most exciting discoveries scientists made based on New Horizons data was that Pluto,… [+3413 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Steve Lundeberg", "title": "Research finds little genetic basis for some sea stars staying healthy amid deadly wasting syndrome - Phys.org", "description": "Healthy-looking ochre sea stars have minimal genetic difference from those displaying symptoms of sea star wasting syndrome, say Oregon State University researchers who examined whether genetic variation was the reason some animals went unaffected during an e…", "url": "https://phys.org/news/2022-02-genetic-basis-sea-stars-healthy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/research-finds-little.jpg", "publishedAt": "2022-02-01T15:12:48Z", "content": "Healthy-looking ochre sea stars have minimal genetic difference from those displaying symptoms of sea star wasting syndrome, say Oregon State University researchers who examined whether genetic varia… [+4649 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Alien hammerhead flatworm named after pandemic - Verve Times", "description": "Scientists have discovered an alien hammerhead flatworm species that looks a bit like a miniature king cobra, or perhaps an itty-bitty snake with a moustache. The researchers found the tiny creatures hunting snails in France and Italy, and they’ve na", "url": "https://vervetimes.com/alien-hammerhead-flatworm-named-after-pandemic/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5vV8Mor2cpFunubP4P6oog-1200-80.jpg", "publishedAt": "2022-02-01T14:53:54Z", "content": "Scientists have discovered an alien hammerhead flatworm species that looks a bit like a miniature king cobra, or perhaps an itty-bitty snake with a moustache. The researchers found the tiny creatures… [+2893 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Scientists discover 100-million-year-old fossil flowers preserved in amber - CGTN", "description": "An international research team led by Chinese scientists has discovered 100-million-year-old fossil flowers preserved in amber, providing evidence for the study of the evolution of flowering plants in Southeast Asia and tectonic plate movement.", "url": "https://news.cgtn.com/news/2022-02-01/Scientists-discover-100-mln-year-old-fossil-flowers-preserved-in-amber-17iT5lanC9O/index.html", "urlToImage": "https://news.cgtn.com/news/2022-02-01/Scientists-discover-100-mln-year-old-fossil-flowers-preserved-in-amber-17iT5lanC9O/img/8acac77769a643d3975b1f569ef56d10/8acac77769a643d3975b1f569ef56d10-750.jpeg", "publishedAt": "2022-02-01T14:51:14Z", "content": "An international research team led by Chinese scientists discovered 100-million-year-old fossil flowers preserved in amber. /Xinhua\r\nAn international research team led by Chinese scientists discovere… [+1512 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Humanity Could Survive A ’Planet-Killer’ Asteroid, A New Study Says - Forbes", "description": "Based on current technology, humanity could survive a \"planet killer\" - a 10 kilometer wide rocky asteroid - hitting Earth.", "url": "https://www.forbes.com/sites/davidbressan/2022/02/01/humanity-could-survive-a-planet-killer-asteroid-a-new-study-says/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/61f92345f6b294187f799e72/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-02-01T14:18:11Z", "content": "An asteroid collides with Earth.\r\ngetty\r\nAbout 66 million years ago, a \"planet killer\" - a 10-kilometer-wide rocky asteroid - hit Earth. The Chicxulub impact caused a mass extinction on a planetary s… [+2656 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Earth's 'Goldilocks zone' responsible for metal ore deposit formation - MINING.COM - MINING.com", "description": "Researchers have discovered a ‘Goldilocks zone’ at the base of the earth’s crust where temperature allows for metals to be transported to shallower levels near the surface.", "url": "https://www.mining.com/earths-goldilocks-zone-responsible-for-metal-ore-deposit-formation/", "urlToImage": "https://www.mining.com/wp-content/uploads/2022/02/Earths-Goldilocks-zone-responsible-for-metal-ore-deposit-formation.jpg", "publishedAt": "2022-02-01T14:13:36Z", "content": "The main issue at hand is that most of these metals are primarily stored at depths of more than 25 kilometres, making them inaccessible for exploitation. Yet in certain parts of the world, nature can… [+1116 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "The first life on Earth depended on a deadly poisonous gas, study suggests - Verve Times", "description": "At one time, Earth had no life. Then, it did. Whether the process was gradual or rapid, the transformation of chemistry to biochemistry on our planet was one of the most amazing developments to happen in the universe. It's so rare that to date, we ha", "url": "https://vervetimes.com/the-first-life-on-earth-depended-on-a-deadly-poisonous-gas-study-suggests/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8n5FsyLuA7PFBHF9sQN9aZ-1200-80.jpeg", "publishedAt": "2022-02-01T14:06:03Z", "content": "At one time, Earth had no life. Then, it did. Whether the process was gradual or rapid, the transformation of chemistry to biochemistry on our planet was one of the most amazing developments to happe… [+5289 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gregory Moore", "title": "The ancient, intimate relationship between trees and fungi, from fairy toadstools to technicolour mushrooms - Phys.org", "description": "You may be familiar with the red toadstool with white spots, which are often the homes of fairies in children's stories. These toadstools are also a small part of grander magical story: they are striking examples of mycorrhizas.", "url": "https://phys.org/news/2022-02-ancient-intimate-relationship-trees-fungi.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-ancient-intimate-r.jpg", "publishedAt": "2022-02-01T12:40:01Z", "content": "You may be familiar with the red toadstool with white spots, which are often the homes of fairies in children's stories. These toadstools are also a small part of grander magical story: they are stri… [+5844 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "Proof of 9,200 year-old Solar Storm hitting Earth found; Another will spell DISASTER - HT Tech", "description": "A powerful solar storm capable of destroying all modern communication systems had hammered Earth. Thankfully, that was 9,200 years ago. We are not ready for another.", "url": "https://tech.hindustantimes.com/tech/news/proof-of-9-200-year-old-solar-storm-hitting-earth-found-another-will-spell-disaster-71643716665238.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/01/1600x900/sun-11030_1631065589823_1643716784172.jpg", "publishedAt": "2022-02-01T12:02:40Z", "content": "About 9,200 years ago, Earth faced a massive solar storm that not only caused damage to the planet but also carved permanent marks on icebergs. These icebergs, which are now deep underwater around Gr… [+1992 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Anwesha Majumdar", "title": "Astronaut shares images of Arabian Peninsula taken from ISS; 'look like true work of art' - Republic World", "description": "The astronaut who is currently stationed in the ISS shared pictures of Arabian Peninsula which display attractive bright colours and patterns", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/astronaut-shares-images-of-arabian-peninsula-taken-from-iss-look-like-true-work-of-art-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/usbdhrjxoxw5yqaf_1643715548.jpeg", "publishedAt": "2022-02-01T11:54:00Z", "content": "German European Space Agency astronaut Matthias Maurer has shared a set of mesmerizing images of the Arabian Peninsula which has been taken from outer space. The astronaut who is currently stationed … [+2057 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Low volcanic temperatures led to the fourth mass extinction - Tech Explorist", "description": "Low volcanic temperature ushered in global cooling and the thriving of dinosaurs.", "url": "https://www.techexplorist.com/low-volcanic-temperatures-led-fourth-mass-extinction/44450/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/02/eruption.jpg", "publishedAt": "2022-02-01T11:19:18Z", "content": "Climatic fluctuations created by significant volcanic eruptions lead to evolutionary changes. Yet, the cooling and warming of climate rely on the volcanic temperature of the eruption.\r\nOne of the mos… [+1946 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "Hibernation could be 'game-changing' for getting to Mars, says ESA - TweakTown", "description": "The European Space Agency (ESA) has found hibernation could reduce the size of a spacecraft for a return trip to Mars by a third.", "url": "https://www.tweaktown.com/news/84317/hibernation-could-be-game-changing-for-getting-to-mars-says-esa/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84317_01_hibernating-for-trip-to-mars-the-way-bears-do_full.jpg", "publishedAt": "2022-02-01T11:03:02Z", "content": "A paper by the European Space Agency (ESA) has investigated the potential for hibernation in Mars-bound journeys.\r\nEngineers have to account for about two years worth of food and water to keep an ast… [+1164 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "NASA astronaut warns Tom Cruise about what the ISS smells like - TweakTown", "description": "NASA astronaut Victor Glover has spoken with actor Tom Cruise and described the odor of the International Space Station.", "url": "https://www.tweaktown.com/news/84312/nasa-astronaut-warns-tom-cruise-about-what-the-iss-smells-like/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84312_05_nasa-astronaut-warns-tom-cruise-about-what-the-iss-smells-like_full.jpg", "publishedAt": "2022-02-01T08:32:02Z", "content": "Actor Tom Cruise has sat down with NASA astronaut Victor Glover to talk about the experiences of being an astronaut and what it's like to spend extended periods of time aboard the International Space… [+2299 chars]"}, {"source": {"id": null, "name": "Kidsnews.com.au"}, "author": null, "title": "NASA launches James Webb Space Telescope - Kids News", "description": "World’s most powerful space telescope launched", "url": "https://www.kidsnews.com.au/space/nasas-james-webb-space-telescope-begins-epic-mission-to-peer-into-universes-past/news-story/45009880f371e2520b0b058cf87c6029", "urlToImage": "https://content.api.news/v3/images/bin/d6261a22a9adb58bc75c106c938169cc", "publishedAt": "2022-02-01T07:40:51Z", "content": "While Aussie kids were on holidays, a team at NASA was busy launching the world’s most powerful space telescope into orbit.\r\nThe James Webb Space Telescope blasted off from Earth in a Ariane 5 rocket… [+3646 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "How NASA in Silicon Valley will use Webb Telescope to study distant worlds - Space Daily", "description": "Moffett Field CA (SPX) Feb 01, 2022 - \r\nNASA's James Webb Space Telescope is getting ready to give us the best view yet of worlds beyond our own solar system, commonly known as exoplanets. Scientists at NASA's Ames Research Center in Cali", "url": "https://www.spacedaily.com/reports/How_NASA_in_Silicon_Valley_will_use_Webb_Telescope_to_study_distant_worlds_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/extrasolar-trappist-1-seven-rocky-exoplanets-hg.jpg", "publishedAt": "2022-02-01T04:32:20Z", "content": "NASA's James Webb Space Telescope is getting ready to give us the best view yet of worlds beyond our own solar system, commonly known as exoplanets. Scientists at NASA's Ames Research Center in Calif… [+6393 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "How studying coral skeletons could help estimate their resilience to climate change - Malay Mail", "description": "MADISON (US), Feb 1 — Researchers have studied the hard skeletons of coral reefs to better predict their survival. Vulnerable to ocean acidification caused by global warming, corals are among the most threatened underwater species. Corals that inhabit the oce…", "url": "https://www.malaymail.com/news/life/2022/02/01/how-studying-coral-skeletons-could-help-estimate-their-resilience-to-climat/2038832", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-02/20220201_CORAL_REEF_Shutterstock_ETX_01-seo.jpg", "publishedAt": "2022-02-01T01:30:11Z", "content": "The corals that inhabit the ocean floor are particularly vulnerable to global warming. Shutterstock pic via ETX Studio\r\nMADISON (US), Feb 1 Researchers have studied the hard skeletons of coral reefs … [+2123 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers use microscopic strands of DNA to assemble hydrogel blocks - News-Medical.net", "description": "Researchers from the Okinawa Institute of Science and Technology Graduate University (OIST) have used microscopic strands of DNA to guide the assembly of gel blocks that are visible to the naked eye.", "url": "https://www.news-medical.net/news/20220131/Researchers-use-microscopic-strands-of-DNA-to-assemble-hydrogel-blocks.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/78486183-620x480.jpg", "publishedAt": "2022-02-01T01:19:00Z", "content": "Researchers from the Okinawa Institute of Science and Technology Graduate University (OIST) have used microscopic strands of DNA to guide the assembly of gel blocks that are visible to the naked eye.… [+4883 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Frits Sweijen", "title": "The universe is in much sharper focus with new algorithms and supercomputers - Phys.org", "description": "With new algorithms and supercomputers, an incredibly detailed radio map of the universe has been created. Now astronomers can look at radio data of galaxies with much more precision. This research was published in Nature Astronomy by Leiden University Ph.D. …", "url": "https://phys.org/news/2022-01-universe-sharper-focus-algorithms-supercomputers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-universe-is-in-muc.jpg", "publishedAt": "2022-01-31T21:07:22Z", "content": "With new algorithms and supercomputers, an incredibly detailed radio map of the universe has been created. Now astronomers can look at radio data of galaxies with much more precision. This research w… [+3946 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Astrophysicists Found 1,000 Magnetic Milky Way ‘Strands’ - Gizmodo Australia", "description": "A new mosaic image taken by the MeerKAT radio telescope in South Africa has revealed nearly 1,000 multi-light-year-long electron strands...", "url": "https://www.gizmodo.com.au/2022/02/astrophysicists-found-1000-magnetic-milky-way-strands/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/01/4d9ced642f155d054f912c9e48aac86c.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-01-31T20:45:00Z", "content": "A new mosaic image taken by the MeerKAT radio telescope in South Africa has revealed nearly 1,000 multi-light-year-long electron strands at the centre of the Milky Way. The strands are huge streaks o… [+2341 chars]"}, {"source": {"id": null, "name": "XDigitalNews"}, "author": null, "title": "'Spooky' object that unleashes periodic bursts of energy detected in Milky Way - XDigitalNews", "description": "Astrophysicist Natasha Hurley-Walker was scanning radio signals across huge swaths of the cosmos in late 2020 when she and her colleagues stumbled on something they had never seen before. In a patch of sky that was monitored continuously over 24 hours, the sc…", "url": "https://xdigitalnews.com/spooky-object-that-unleashes-periodic-bursts-of-energy-detected-in-milky-way/", "urlToImage": "https://xdigitalnews.com/wp-content/uploads/2022/01/a4aa7827b0645dc2b7111af47c32ced8.jpeg", "publishedAt": "2022-01-31T19:35:50Z", "content": "Astrophysicist Natasha Hurley-Walker was scanning radio signals across huge swaths of the cosmos in late 2020 when she and her colleagues stumbled on something they had never seen before.\r\nIn a patch… [+5315 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Binary Black Holes can Unlock Another of Einstein’s Predictions - Universe Today", "description": "Gravitational waves from merging black holes can tell us more about a gravitational dance known as spin-orbit resonance.", "url": "https://www.universetoday.com/154308/binary-black-holes-can-unlock-another-of-einsteins-predictions/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/01/gw170104.jpg", "publishedAt": "2022-01-31T19:05:00Z", "content": "In the grand scheme of things, the structure of a black hole is pretty simple. All you need to know is its mass, electric charge, and rotation, and you know what the structure of space and time aroun… [+3303 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Frances Mulraney", "title": "Wooly mammoths ‘being brought back from extinction’ as scientists plan to use genes to create ‘Arctic eleph... - The US Sun", "description": "", "url": "https://www.the-sun.com/news/4580661/wooly-mammoths-back-from-extinction-create-arctic-elephant/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/01/lv-comp-wooly-mammoth-being-brought-back-off-platform.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-01-31T18:16:00Z", "content": "SCIENTISTS are working to bring the genes of wooly mammoths back from extinction and use them to create an \"Arctic elephant.\"\r\nMammoths completely disappeared from the earth around 4,000 years ago. \r… [+5838 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers identify key regulator of blood stem cell development - Phys.org", "description": "A protein that masterminds the way DNA is wrapped within chromosomes has a major role in the healthy functioning of blood stem cells, which produce all blood cells in the body, according to a new study from researchers at Weill Cornell Medicine.", "url": "https://phys.org/news/2022-01-key-blood-stem-cell.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-identify-k-2.jpg", "publishedAt": "2022-01-31T13:00:03Z", "content": "A protein that masterminds the way DNA is wrapped within chromosomes has a major role in the healthy functioning of blood stem cells, which produce all blood cells in the body, according to a new stu… [+5670 chars]"}]}