{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Tittlepress.com"}, "author": "newsdesk", "title": "Dive deep into earthquake prediction - TittlePress", "description": "Scientists who study the world's most dangerous earthquakes are racing against time to get up close and personal", "url": "https://tittlepress.com/latest/1465585/", "urlToImage": "https://cosmosmagazine.com/wp-content/uploads/2022/01/boreholes-header-1200.jpg", "publishedAt": "2022-01-21T03:59:40Z", "content": "Scientists who study the world’s most dangerous earthquakes are racing against time to get up close and personal with their sources.\r\nThe need is urgent: These super-hazardous fault lines are in subd… [+10932 chars]"}, {"source": {"id": null, "name": "The Japan Times"}, "author": null, "title": "Monster iceberg released 'billions of tons' of fresh water into ocean - The Japan Times", "description": "The iceberg was twice the size of Luxembourg when it separated from the Larsen ice shelf, which has warmed faster than any other part of Earth's southernmost continent.", "url": "https://www.japantimes.co.jp/news/2022/01/21/world/monster-iceberg-antactica/", "urlToImage": "https://cdn-japantimes.com/wp-content/uploads/2022/01/np_file_136409-870x489.jpeg", "publishedAt": "2022-01-21T02:15:28Z", "content": "A giant iceberg that detached from Antarctica in 2017 released the equivalent of 61 million Olympic-sized swimming pools of fresh water as it melted, according to research published Thursday, raising… [+3244 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Physicists have created “everlasting bubbles” - Ars Technica", "description": "One gas bubble lasted for a whopping 465 days, a world record for this type of object.", "url": "https://arstechnica.com/science/2022/01/physicists-have-created-everlasting-bubbles/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/01/bubbleGIF.gif", "publishedAt": "2022-01-21T02:01:13Z", "content": "The shell of a water/glycerol gas marble (bubble) remains liquid and spherical even after 101 days, and it reacts as a liquid film when punctured. These human-made bubbles could be used to create sta… [+5840 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Advancing materials science with the help of biology and a dash of dish soap: High-speed X-ray free-electron lasers have unlocked the crystal structures of small molecules relevant to chemistry and materials science, proving a new method that could advance - Science Daily", "description": "Scientists have finally found a way to probe delicate microcrystals with powerful X-ray laser beams. They say their method could help advance semiconductor and solar cell development.", "url": "https://www.sciencedaily.com/releases/2022/01/220120140711.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-21T01:12:09Z", "content": "Compounds that form tiny crystals hold secrets that could advance renewable energy generation and semiconductor development. Revealing the arrangement of their atoms has already allowed for breakthro… [+5492 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Motor proteins haul precious cargo in neurons. How can we control their movement? - EurekAlert", "description": "“Our publication details how GSK3β attaches a molecular tag to kinesin 1 motors, which causes the motors to stop without detaching from microtubule tracks. We are super excited, since now we know how to control the ‘engine’ while it is moving on a track,” say…", "url": "https://www.eurekalert.org/news-releases/940810", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-01-20T23:51:09Z", "content": "BUFFALO, N.Y. — Inside neurons, motor proteins haul precious cargo, moving essential goods along thread-like roadways called microtubule tracks.\r\nThis miniature highway system is vital for keeping ne… [+3834 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "NASA's gamma-ray observatory is in safe mode after a possible wheel failure - Space.com", "description": "NASA's Neil Gehrels Swift Observatory has temporarily stopped its science observations while the mission team investigates an issue.", "url": "https://www.space.com/nasa-swift-observatory-safe-mode-reaction-wheel", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bTYZnyNZZyCeZcrr8XRrcQ-1200-80.jpeg", "publishedAt": "2022-01-20T23:00:32Z", "content": "A visualization of the Neil Gehrels Swift Observatory.  (Image credit: NASA)\r\nNASA's Neil Gehrels Swift Observatory has temporarily stopped its science observations while the mission team investigate… [+2213 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "Hubble finds weird black hole which is helping stars to grow - SlashGear", "description": "When you think of black holes, you probably think of destruction. Consuming everything in their path, they are the monsters of the astronomical world, gobbling up gas and dust and planets and stars…", "url": "https://www.slashgear.com/hubble-finds-weird-black-hole-which-is-helping-stars-to-grow-20708181/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2022/01/space-black-hole.jpg", "publishedAt": "2022-01-20T22:53:11Z", "content": "When you think of black holes, you probably think of destruction. Consuming everything in their path, they are the monsters of the astronomical world, gobbling up gas and dust and planets and stars a… [+2116 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Newly discovered DNA repair mechanisms point to potential therapy targets for cancer and neurodegenerative diseases: Investigators have identified nine new factors involved in the process of DNA repair that is critical to the health of human cells - Science Daily", "description": "Faulty DNA damage repair can lead to many types of cancer, neurodegenerative diseases, and other serious disorders. Investigators have developed high-throughput microscopy and machine learning systems that can identify and classify DNA repair factors. The inv…", "url": "https://www.sciencedaily.com/releases/2022/01/220120103403.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-20T22:18:58Z", "content": "Faulty DNA damage repair can lead to many types of cancer, neurodegenerative diseases, and other serious disorders. Investigators have developed high-throughput microscopy and machine learning system… [+3440 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "There Are 40,000,000,000,000,000,000+ Black Holes in the Observable Universe, Says New Estimate - Gizmodo Australia", "description": "A team of astrophysicists has calculated the number of stellar-mass black holes in the observable universe to be 40 quintillion,...", "url": "https://www.gizmodo.com.au/2022/01/there-are-40000000000000000000-black-holes-in-the-observable-universe-says-new-estimate/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/21/451fa580969f97f0ff63818cb733aa2f.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-01-20T22:00:00Z", "content": "A team of astrophysicists has calculated the number of stellar-mass black holes in the observable universe to be 40 quintillion, accounting for 1% of the total ordinary matter in the universe.\r\nThe r… [+3158 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Experiment with turnstiles of single electrons shows way towards new power standard - Phys.org", "description": "The world's most commonly used system of measurement, the International System of Units (SI), was redefined in 2019. Since then, units have needed to be defined in terms of the constants of nature—that is, nature's rules that are fixed and of no uncertainty, …", "url": "https://phys.org/news/2022-01-turnstiles-electrons-power-standard.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/electron.jpg", "publishedAt": "2022-01-20T21:59:03Z", "content": "The world's most commonly used system of measurement, the International System of Units (SI), was redefined in 2019. Since then, units have needed to be defined in terms of the constants of naturetha… [+3321 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Propose Mission to Catch Up With Mysterious Interstellar Object - Futurism", "description": "Getting a closer look at interstellar rock 'Oumuamua could forever change the way we understand the universe around us, scientists argue.", "url": "https://futurism.com/the-byte/mission-catch-up-interstellar-object", "urlToImage": "https://wp-assets.futurism.com/2022/01/scientists-propose-mission-to-catch-up-with-mysterious-interstellar-object.jpg", "publishedAt": "2022-01-20T21:45:46Z", "content": "It would take around 26 years.\r\nOumuamua Jokes\r\nThe interstellar object Oumuamua has fascinated and puzzled astronomers ever since it was first detected four years ago and now some are itching to get… [+2031 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers develop novel microscopic picoshell particles - Phys.org", "description": "Production of high-energy fats by microalgae may provide a sustainable, renewable energy source that can help tackle climate change. However, microalgae engineered to produce lipids rapidly usually grow slowly themselves, making it difficult to increase overa…", "url": "https://phys.org/news/2022-01-microscopic-picoshell-particles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/ucla-researchers-devel.jpg", "publishedAt": "2022-01-20T21:32:13Z", "content": "Production of high-energy fats by microalgae may provide a sustainable, renewable energy source that can help tackle climate change. However, microalgae engineered to produce lipids rapidly usually g… [+6912 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "NASA solar sail mission to chase tiny asteroid after Artemis I launch - newsconcerns", "description": "NEA Scout is composed of a small, shoebox-sized CubeSat (top left) and a thin, aluminum-coated solar sail about the size of a racquetball court (bottom left). After the spacecraft laun", "url": "https://newsconcerns.com/nasa-solar-sail-mission-to-chase-tiny-asteroid-after-artemis-i-launch/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasa-solar-sail-missio.jpg", "publishedAt": "2022-01-20T21:28:34Z", "content": "Launching with the Artemis I uncrewed test flight, NASA’s shoebox-size Near-Earth Asteroid Scout will chase down what will become the smallest asteroid ever to be visited by a spacecraft. It will get… [+5917 chars]"}, {"source": {"id": null, "name": "HeritageDaily"}, "author": "http://www.facebook.com/archaeologynews", "title": "Muscular study provides new information about how the largest dinosaurs moved and evolved - HeritageDaily", "description": "In a new study published today in the journal Royal Society Open Science, researchers present a reconstruction of the limb muscles of Thecodontosaurus, detailing the anatomy of the most important muscles involved in movement. - HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2022/01/muscular-study-provides-new-information-about-how-the-largest-dinosaurs-moved-and-evolved/142553", "urlToImage": "https://www.heritagedaily.com/wp-content/uploads/2022/01/da1-scaled.jpg", "publishedAt": "2022-01-20T21:09:17Z", "content": "In a new study published today in the journal Royal Society Open Science, researchers present a reconstruction of the limb muscles of Thecodontosaurus, detailing the anatomy of the most important mus… [+2811 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Bizarre knotted DNA structures linked to cancer in mice - Livescience.com", "description": "Missing enzymes may cause troublesome knots to appear in DNA.", "url": "https://www.livescience.com/cancer-linked-to-strange-loop-and-knots-in-dna", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2rCqoYASCvxsMf9JMHzmpB-1200-80.jpg", "publishedAt": "2022-01-20T20:31:09Z", "content": "Oddly tangled and looped DNA structures could be linked to cancer, according to a new study in mice.\r\nDNA\r\n typically looks like a twisted ladder. But the loss of key enzymes in the body causes the g… [+4172 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "Photographer Films Real-Time View of Huge Asteroid Flying Past Earth - PetaPixel", "description": "Photographer Andrew McCarthy captured real-time footage of asteroid 1994 PC1 (7482) flying past Earth on January 18th, 2022.", "url": "https://petapixel.com/2022/01/20/photographer-films-real-time-view-of-huge-asteroid-flying-past-earth/", "urlToImage": "https://petapixel.com/assets/uploads/2022/01/asteroid-flyby-captured-by-photographer-andrew-mccarthy.jpg", "publishedAt": "2022-01-20T20:25:03Z", "content": "A massive and “potentially hazardous” asteroid measuring 0.68 miles (1.1km) wide flew past the Earth at over 43,000 miles per hour on Tuesday. Photographer Andrew McCarthy managed to capture real-tim… [+3429 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Ingenuity helicopter experiences first delayed flight due to bad weather on Mars - CNN", "description": "The Ingenuity helicopter had to delay its 19th flight because of an unusually strong regional dust storm on Mars, according to NASA. The little chopper is expected to fly on Sunday now that the storm has cleared.", "url": "https://www.cnn.com/2022/01/20/world/ingenuity-helicopter-mars-storm-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220120131141-01-nasa-mars-storm-ingenuity-super-tease.jpg", "publishedAt": "2022-01-20T20:10:00Z", "content": null}, {"source": {"id": null, "name": "KIRO Seattle"}, "author": "Lauren Silver, Cox Media Group National Content Desk", "title": "Study: Earth's core is cooling faster than scientists thought - KIRO Seattle", "description": "A new study suggests that Earth’s core is cooling down faster than scientists believed, and that could eventually turn our planet solid.", "url": "https://www.kiro7.com/news/trending/study-earths-core-is-cooling-faster-than-scientists-thought/A2BKA43P3JGNLOO3PUCIGTRDBY/", "urlToImage": "https://cmg-cmg-tv-10090-prod.cdn.arcpublishing.com/resizer/ebhJxWYWpENlxJs35-rcDltEL_A=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/GZEWGLBIIJFKBPKTVHN7O6QFTQ.jpg", "publishedAt": "2022-01-20T20:07:29Z", "content": "A new study suggests that Earths core is cooling down faster than scientists believed, and that could eventually turn our planet solid.\r\n&gt;&gt; Read more trending news\r\nThe study studied bridgmanit… [+1041 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Miguel Brown", "title": "New Study Discovers Protein Structures Responsible for the Origins of Life - Nature World News", "description": "The issue as to how life initially arose on our habitable planet has yet to be investigated properly, but academia is making progress all the time, wherein recent research uncovers the geometries of the enzymes that might be responsible.", "url": "https://www.natureworldnews.com/articles/48975/20220120/structures-of-proteins-proteins-origins-of-life.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/57711/argentina-health-virus-llama.jpg", "publishedAt": "2022-01-20T20:02:53Z", "content": "The issue as to how life initially arose on our habitable planet has yet to be investigated properly, but academia is making progress all the time, wherein recent research uncovers the geometries of … [+3457 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Luke Auburn", "title": "Scientists confirm a highly eccentric black hole merger for the first time - Phys.org", "description": "For the first time, scientists believe they have detected a merger of two black holes with eccentric orbits. According to a paper published in Nature Astronomy by researchers from Rochester Institute of Technology's Center for Computational Relativity and Gra…", "url": "https://phys.org/news/2022-01-scientists-highly-eccentric-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/rit-scientists-confirm.jpg", "publishedAt": "2022-01-20T19:35:37Z", "content": "For the first time, scientists believe they have detected a merger of two black holes with eccentric orbits. According to a paper published in Nature Astronomy by researchers from Rochester Institute… [+3224 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Webb Space Telescope’s Mirrors Are Fully Deployed - Gizmodo Australia", "description": "The Webb Space Telescope completed its complex mirror deployment this week, and the observatory is getting tantalizingly close to completing...", "url": "https://www.gizmodo.com.au/2022/01/webb-space-telescopes-mirrors-are-fully-deployed/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/21/348712af39e7d9db8ae041879d0fa434.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-01-20T19:20:00Z", "content": "The Webb Space Telescope completed its complex mirror deployment this week, and the observatory is getting tantalizingly close to completing its journey to L2, where it will orbit the Sun a million m… [+1987 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Gregory Moore", "title": "Dinosaur food and Hiroshima bomb survivors: maidenhair trees are 'living fossils' and your new favourite plant - The Conversation AU", "description": "Maidenhair trees, Ginkgo biloba, can live for over 1,000 years and grow 35m tall. While they’re beautiful to look at, they’re also notorious for their vomit-smelling seeds.", "url": "https://theconversation.com/dinosaur-food-and-hiroshima-bomb-survivors-maidenhair-trees-are-living-fossils-and-your-new-favourite-plant-164630", "urlToImage": "https://images.theconversation.com/files/440755/original/file-20220113-27-1n973ig.jpg?ixlib=rb-1.1.0&rect=24%2C510%2C5383%2C2691&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-20T19:04:45Z", "content": "Most of us are captivated by the thought of a living fossil, which is any organism that appeared millions of years ago in the fossil record and survives today, relatively unchanged.\r\nThe maidenhair t… [+6437 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "2021 in Space: It was all about NASA, Mars, Virgin, SpaceX, China - HT Tech", "description": "2021 in space was exciting and all about NASA, Mars, Virgin Galactic, SpaceX, China, Blue origin…, and yes, there was Star Trek's William Shatner too.", "url": "https://tech.hindustantimes.com/tech/news/2021-in-space-it-was-all-about-nasa-mars-virgin-spacex-china-71642703380919.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/20/1600x900/Pictures-of-the-Week-Global-Photo-Gallery-3_1642704077372_1642704101123.jpg", "publishedAt": "2022-01-20T18:36:38Z", "content": "From the Mars Ingenuity helicopter's first powered flight on another world to the launch of the James Webb Space Telescope that will peer into the earliest epoch of the Universe, 2021 was a huge year… [+6188 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Sidewinding young stellar jets spied by Gemini South - Phys.org", "description": "Young stellar jets are a common by-product of star formation and are thought to be caused by the interplay between the magnetic fields of rotating young stars and the disks of gas surrounding them. These interactions eject twin torrents of ionized gas in oppo…", "url": "https://phys.org/news/2022-01-sidewinding-young-stellar-jets-spied.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sidewinding-young-stel.jpg", "publishedAt": "2022-01-20T18:11:44Z", "content": "Young stellar jets are a common by-product of star formation and are thought to be caused by the interplay between the magnetic fields of rotating young stars and the disks of gas surrounding them. T… [+4979 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "New Array of Brain Sensors Could Aid Neurosurgeons in the Treatment of Brain Tumors - AZoSensors", "description": "Researchers establish a novel array of brain sensors that can sophisticatedly record electrical brain signals in record-breaking detail.", "url": "https://www.azosensors.com/news.aspx?newsID=14894", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_14894_16426990717887843.jpg", "publishedAt": "2022-01-20T17:20:00Z", "content": "High-resolution recordings of electrical signals from the surface of the brain could provide neurosurgeons with the capability to extract brain tumors and treat epilepsy, unlocking new potentialities… [+4479 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists discover new type of supernova - WION", "description": "Supernovas are explosions of big star which occur at the end of their life. The fuel that keeps the star glowing runs out and a massive explosion takes place. This is true for large stars, much bigger than the Sun. Scientists previously thought that not all l…", "url": "https://www.wionews.com/science/scientists-discover-new-type-of-supernova-446290", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/01/20/234928-supernova.jpg", "publishedAt": "2022-01-20T17:03:42Z", "content": "Supernovas are explosions of big star which occur at the end of their life. The fuel that keeps the star glowing runs out and a massive explosion takes place. This is true for large stars, much bigge… [+1192 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Giant Pandas Gain More Weight when Eating Bamboo Shoots: Study - Sci-News.com", "description": "Shifts in the gut microbiota of the giant panda (Ailuropoda melanoleuca) in the season when nutritious bamboo shoots become available helps the herbivorous bear gain more weight and store more fat.", "url": "http://www.sci-news.com/biology/bamboo-giant-pandas-10477.html", "urlToImage": "http://cdn.sci-news.com/images/2022/01/image_10477f-Giant-Panda.jpg", "publishedAt": "2022-01-20T16:50:03Z", "content": "Shifts in the gut microbiota of the giant panda (Ailuropoda melanoleuca) in the season when nutritious bamboo shoots become available helps the herbivorous bear gain more weight and store more fat, w… [+2987 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA's InSight Mars lander awakens from 'safe mode' after Red Planet dust storm - Space.com", "description": "The Marsquake-hunting mission will pause science for the time being.", "url": "https://www.space.com/insight-mars-lander-exits-safe-mode", "urlToImage": "https://cdn.mos.cms.futurecdn.net/w3LciQ5bF39bZh8kdymCnh-1200-80.jpg", "publishedAt": "2022-01-20T16:31:49Z", "content": "A NASA spacecraft has safely emerged from a precautionary \"safe mode\" after an intense Martian dust storm.\r\nThe solar-powered InSight lander, which is designed to study the interior of Mars, entered … [+1858 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Fickle sunshine slows down Rubisco enzyme and limits photosynthetic productivity of crops - Phys.org", "description": "Researchers from Lancaster University working to improve the sustainable productivity of key crops in sub-Saharan Africa have discovered an imperfection in a critical enzyme within cowpea—and believe this imperfection is likely shared with other crops.", "url": "https://phys.org/news/2022-01-fickle-sunshine-rubisco-enzyme-limits.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/fickle-sunshine-slows.jpg", "publishedAt": "2022-01-20T16:28:39Z", "content": "Researchers from Lancaster University working to improve the sustainable productivity of key crops in sub-Saharan Africa have discovered an imperfection in a critical enzyme within cowpeaand believe … [+5025 chars]"}, {"source": {"id": null, "name": "Purdue News Service"}, "author": "Purdue News Service", "title": "Perseverance's first year on Mars: Purdue professor, mission team member looks at what is ahead - Purdue News Service", "description": "Almost one year into the Mars rover mission, accomplishing its goal is on the horizon for Purdue University’s Briony Horgan and the Perseverance team.", "url": "https://www.purdue.edu/newsroom/releases/2022/Q1/perseverances-first-year-on-mars-purdue-professor,-mission-team-member-looks-at-what-is-ahead.html", "urlToImage": "https://www.purdue.edu/uns/images/2021/horgan-centerOG.jpg", "publishedAt": "2022-01-20T16:23:46Z", "content": "WEST LAFAYETTE, Ind. — Almost one year into the Mars rover mission, accomplishing its goal is on the horizon for Purdue University’s Briony Horgan and the Perseverance team.\r\nFeb. 18 will mark one ye… [+4296 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Here's why whales don't drown when they gulp down food underwater - Phys.org", "description": "Ever wondered whether whales can burp, and why they don't drown when they gulp down gallons of water and krill? New UBC research may just hold the answer.", "url": "https://phys.org/news/2022-01-whales-dont-gulp-food-underwater.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/whale.jpg", "publishedAt": "2022-01-20T16:00:06Z", "content": "Ever wondered whether whales can burp, and why they don't drown when they gulp down gallons of water and krill? New UBC research may just hold the answer.\r\nResearchers found that lunge-feeding whales… [+4611 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Brothers in Rice lab find audio from graphene production contains valuable data - ScienceDaily - newsconcerns", "description": "It may be true that seeing is believing, but sometimes hearing can be better.Case in point: Two brothers in a Rice University laboratory heard something unusual while making graphene. Ultimately, they determined the sound itself could give them valua", "url": "https://newsconcerns.com/brothers-in-rice-lab-find-audio-from-graphene-production-contains-valuable-data-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-20T14:14:36Z", "content": "It may be true that seeing is believing, but sometimes hearing can be better.Case in point: Two brothers in a Rice University laboratory heard something unusual while making graphene. Ultimately, the… [+4817 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "https://www.wypr.org/people/vanessa-romo", "title": "Archaeologists launch first-ever 'dig' into life on the International Space Station - WYPR", "description": "The project, a first of its kind, aims to study the social and cultural dimensions of living in space and how people adapt their behavior when they're living in a completely new environment.", "url": "https://www.npr.org/2022/01/20/1074216381/archeologists-launch-first-ever-dig-into-life-on-the-international-space-station?ft=nprml&amp;f=1074216381", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/df2a323/2147483647/strip/true/crop/706x371+0+80/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F01%2F19%2Ffirst-archaeological-e-bb4130b8295ef7234b311cdcaa8bcf8b7e43e6dc.jpg", "publishedAt": "2022-01-20T12:00:00Z", "content": "A group of researchers has launched the first-ever archaeological study of humans in space, observing the lives of the crew living on the International Space Station.\r\nThe experiment, which will anal… [+2449 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "This Is The Actual Truth Behind The Gorilla In Space Prank - IFLScience", "description": "Every now and then, and for obvious reasons, some footage of a man in a gorilla suit chasing fellow astronauts around the International Space Station (ISS)", "url": "https://www.iflscience.com/space/this-is-the-actual-truth-behind-the-gorilla-in-space-prank/", "urlToImage": "https://cdn.iflscience.com/images/a08cf6d6-24ea-54e4-a576-c5e978d91aa8/default-1642611012-space-gorilla-chase-in-progress.jpg", "publishedAt": "2022-01-20T11:19:00Z", "content": "Every now and then, and for obvious reasons, some footage of a man in a gorilla suit chasing fellow astronauts around the International Space Station (ISS) goes viral.\r\nIn the latest retelling of eve… [+1796 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers find star fuel surrounding galaxies - Phys.org", "description": "Most galaxies, including our own, grow by accumulating new material and turning them into stars—that much is known. What has been unknown is where that new material comes from and how it flows into galaxies to create stars.", "url": "https://phys.org/news/2022-01-astronomers-star-fuel-galaxies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/astronomer-finds-star.jpg", "publishedAt": "2022-01-20T09:34:42Z", "content": "Most galaxies, including our own, grow by accumulating new material and turning them into starsthat much is known. What has been unknown is where that new material comes from and how it flows into ga… [+2782 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA prepares final rocket tests for first Artemis moon mission launch - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-01-20T07:05:06Z", "content": ""}, {"source": {"id": null, "name": "ZME Science"}, "author": "Michelle Petersen", "title": "China builds the world’s first artificial moon. - ZME Science", "description": "Scientists will use the new moon to aid in future interstellar colonization.", "url": "https://www.zmescience.com/science/china-builds-the-worlds-first-artificial-moon/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/01/748af176-9fc1-4920-bc66-d02412ef6256_b2f299a1.jpg", "publishedAt": "2022-01-20T07:04:37Z", "content": "Chinese scientists have built an artificial moon possessing lunar-like gravity to help them prepare astronauts for future exploration missions. The structure uses a powerful magnetic field to produce… [+6320 chars]"}, {"source": {"id": null, "name": "Singularity Hub"}, "author": "Jenny Graves", "title": "Scientists Are Sequencing the Genome of Every Complex Species on Earth - Singularity Hub", "description": "The Earth Biogenome Project will help us understand how complex life evolved, how it functions, and how biodiversity can be protected.", "url": "https://singularityhub.com/2022/01/20/scientists-are-sequencing-the-genome-of-every-complex-species-on-earth/", "urlToImage": "https://singularityhub.com/wp-content/uploads/2022/01/animals-Earth-Biogenome-Project-genetics-ocean-life.jpg", "publishedAt": "2022-01-20T07:00:25Z", "content": "The Earth Biogenome Project, a global consortium that aims to sequence the genomes of all complex life on Earth (some 1.8 million described species) in 10 years, is ramping up.\r\nThe projects origins,… [+5445 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "A volcanic eruption in 2020 led to hours-long thunderstorm - newsconcerns", "description": "Lightning during the Taal eruption. Credit: etrhamjr/Wikimedia Commons                        A study conducted by scientists at the U.S. Geological Survey, the National Oceanic and At", "url": "https://newsconcerns.com/a-volcanic-eruption-in-2020-led-to-hours-long-thunderstorm/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/2020-volcanic-eruption-2.jpg", "publishedAt": "2022-01-20T05:50:36Z", "content": "A study conducted by scientists at the U.S. Geological Survey, the National Oceanic and Atmospheric Administration, and Vaisala Inc., published yesterday in the Geological Society of America’s journa… [+3730 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Researchers set their sights on chalcogenide nanostructured displays - newsconcerns", "description": "Illustration of the antimony trisulphide programmable metasurface and its reflection spectrum in multiple states. Credit: SUTD                        One of the key components behind n", "url": "https://newsconcerns.com/researchers-set-their-sights-on-chalcogenide-nanostructured-displays/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/sutd-sets-its-sights-o.jpg", "publishedAt": "2022-01-20T02:48:36Z", "content": "One of the key components behind next-generation high resolution video displays will be optical nanoantennas. These devices use nanotechnology to mix and interfere with light beams to produce color a… [+3606 chars]"}, {"source": {"id": null, "name": "Happy Mag"}, "author": null, "title": "Astronomers have discovered the largest object in the Milky Way - Happy Mag", "description": "Astronomers believe a giant gas cloud called \"Maggie\" could be the largest known object in the Milky Way galaxy.", "url": "https://happymag.tv/largest-object-in-milky-way/", "urlToImage": "https://happymag.tv/wp-content/uploads/2022/01/Milky-Way.png", "publishedAt": "2022-01-20T01:58:35Z", "content": "The gas cloud was uncovered by astronomers at the Max Planck Institute in Heidelberg and has since been confirmed to be the largest known object in the entire galaxy.\r\nMaggie was named by Colombian a… [+1013 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Sovereign risk: Australia in space - Australian Academy of Science", "description": "Few Australians realise the risks of droughts, floods, and bushfires are managed using foreign-owned satellites. Our new Space Science Decadal Plan explains ...", "url": "https://www.youtube.com/watch?v=r7EZsGOik_E", "urlToImage": "https://i.ytimg.com/vi/r7EZsGOik_E/hqdefault.jpg", "publishedAt": "2022-01-19T23:31:44Z", "content": null}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "10 Fascinating Facts About Buzz Aldrin - Mental Floss", "description": "Buzz Aldrin is best known as the second astronaut to walk on the moon, but he also holds a Guinnnes World Record.", "url": "https://www.mentalfloss.com/article/654554/buzz-aldrin-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_900,w_1600,x_0,y_685/v1642626239/shape/mentalfloss/654554-nasa-ksc-2014-3204_orig.jpg?itok=cwvm6Y_b", "publishedAt": "2022-01-19T23:06:26Z", "content": "Buzz Aldrin is best known as the second man to walk on the moon, but the West Point graduate, Air Force pilot, and MIT-trained engineer has had an incredible life beyond the Apollo 11 mission. Here a… [+6576 chars]"}, {"source": {"id": null, "name": "HIT Consultant"}, "author": "Josh Ryu, Chief Technology Officer and Co-founder, Rebus Biosystems", "title": "Spatial Omics: The Next Wave in the Biological Research Revolution - HIT Consultant", "description": "Spatial omics, which enables multiplex quantitative analyses in intact tissues, has emerged as the next wave in the biological research...", "url": "https://hitconsultant.net/2022/01/19/spatial-omics-seeing-the-forest-through-the-trees/", "urlToImage": "https://hitconsultant.net/wp-content/uploads/2022/01/Josh-Ryu-Phd.jpg", "publishedAt": "2022-01-19T22:01:08Z", "content": "Josh Ryu, Chief Technology Officer and Co-founder, Rebus Biosystems\r\nFor decades, biomedical researchers pursued a reductionist strategy, investigating DNA, RNA, proteins and other cellular players i… [+6018 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Unexpected energy storage capability where water meets metal surfaces — ScienceDaily - Verve Times", "description": "Although interfaces between metals and water are the local areas where crucial processes of energy technologies such as water splitting occur, comparably little is known about their structure and changes during such processes. For more than 100 years", "url": "https://vervetimes.com/unexpected-energy-storage-capability-where-water-meets-metal-surfaces-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T21:30:36Z", "content": "Although interfaces between metals and water are the local areas where crucial processes of energy technologies such as water splitting occur, comparably little is known about their structure and cha… [+2883 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Elon Musk's Starlink Is Causing More Streaks to Appear in Space Images - Gizmodo Australia", "description": "Researchers at the Zwicky Transient Facility in California have analysed the degree to which SpaceX’s Starlink satellite constellation is affecting...", "url": "https://www.gizmodo.com.au/2022/01/elon-musks-starlink-is-causing-more-streaks-to-appear-in-space-images/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/20/f479e7438480e923cdae0aa2439112c3.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2022-01-19T21:01:00Z", "content": "Researchers at the Zwicky Transient Facility in California have analysed the degree to which SpaceXs Starlink satellite constellation is affecting ground-based astronomical observations. The results … [+4830 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers use electrically responsive fluid to make eye-like adaptive lens - Phys.org", "description": "Researchers have developed an adaptive liquid lens based on a new electrically responsive fluid called dibutyl adipate (DBA) that changes focal length when a voltage is applied. The lens is lightweight, compact and simple to fabricate, which makes it ideal fo…", "url": "https://phys.org/news/2022-01-electrically-responsive-fluid-eye-like-lens.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-use-electr.jpg", "publishedAt": "2022-01-19T20:42:18Z", "content": "Researchers have developed an adaptive liquid lens based on a new electrically responsive fluid called dibutyl adipate (DBA) that changes focal length when a voltage is applied. The lens is lightweig… [+4008 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Puzzled by Purple Coating on Mars Rocks - Futurism", "description": "The Perseverance rover found evidence of this mysterious coloring on rocks at almost every site the craft has visited on Mars.", "url": "https://futurism.com/the-byte/purple-coating-mars-rocks", "urlToImage": "https://wp-assets.futurism.com/2022/01/purple-coating-mars-rocks.jpg", "publishedAt": "2022-01-19T20:17:33Z", "content": "\"I dont really have a good answer for you.\"\r\nColor Out of Space \r\nThe Red Planet might need to update its name after NASA discovered a weird purple veneer coating a bunch of Martian rocks. \r\nThe Pers… [+2021 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Weathering rocks hold clues to Earth's Great Oxidation Event - Phys.org", "description": "About 2.4 billion years ago, Earth's atmosphere underwent what is called the Great Oxidation Event (GOE). Prior to the GOE, early Earth had far less molecular oxygen than we have today. After the GOE, molecular oxygen began to increase in abundance, eventuall…", "url": "https://phys.org/news/2022-01-weathering-clues-earth-great-oxidation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/weathering-rocks-hold-2.jpg", "publishedAt": "2022-01-19T20:12:21Z", "content": "About 2.4 billion years ago, Earth's atmosphere underwent what is called the Great Oxidation Event (GOE). Prior to the GOE, early Earth had far less molecular oxygen than we have today. After the GOE… [+5008 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "164 million-year-old plant fossil is the oldest example of a flowering bud - The News Motion", "description": "The fossilized Florigerminis jurassica plant with a defined stem, bulbous fruit and fossilized flower bud (marked by the white arrow). (Image credit: NIGPAS)Researchers have uncovered the earliest example of a flower bud in a 164 million-year-old pla", "url": "https://thenewsmotion.com/164-million-year-old-plant-fossil-is-the-oldest-example-of-a-flowering-bud/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fApDBnumx46h8CfMsKZjBL-1200-80.jpg", "publishedAt": "2022-01-19T20:05:44Z", "content": "The fossilized Florigerminis jurassica plant with a defined stem, bulbous fruit and fossilized flower bud (marked by the white arrow). (Image credit: NIGPAS)\r\nResearchers have uncovered the earliest … [+3486 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "The Moon’s Far Side Is Covered in Sticky Soil and Fresh Craters - Gizmodo Australia", "description": "The Chinese lunar rover Yutu-2 has been exploring the far side of the Moon for three years, making it the...", "url": "https://www.gizmodo.com.au/2022/01/the-moons-far-side-is-covered-in-sticky-soil-and-fresh-craters/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/20/8bc43f376dcdc803f7e4c9d5ded527bd.png?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2022-01-19T19:42:00Z", "content": "The Chinese lunar rover Yutu-2 has been exploring the far side of the Moon for three years, making it the longest lunar surface mission in history. In a paper published today in Science Robotics, the… [+2248 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Curiosity rover finds 'tantalizing' signs of ancient Mars life - newsconcerns", "description": "NASA's Curiosity Mars rover used two different cameras to create this selfie in front of a rock outcrop named Mont Mercou, which stands 20 feet (6 meters) tall. (Image credit: NASA/JPL-Caltech/MSSS)NASA's Curiosity rover has found some interesting or", "url": "https://newsconcerns.com/curiosity-rover-finds-tantalizing-signs-of-ancient-mars-life/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/535duZ4qJNT4qrcAPAPU6W-1200-80.jpg", "publishedAt": "2022-01-19T17:42:31Z", "content": "NASA’s Curiosity Mars rover used two different cameras to create this selfie in front of a rock outcrop named Mont Mercou, which stands 20 feet (6 meters) tall. (Image credit: NASA/JPL-Caltech/MSSS)\r… [+5843 chars]"}, {"source": {"id": null, "name": "Inside Science News Service"}, "author": null, "title": "Feathery Wings Help Explain a Miniature Beetle's Speedy Flight - Inside Science News Service", "description": "(Inside Science) -- Small insects typically fly slower than larger ones, but some of the world's littlest insects appear to contradict that rule. Scientists have discovered that a tiny beetle's feathery wings and unusual style of flight may help explain its e…", "url": "https://www.insidescience.org/news/feathery-wings-help-explain-miniature-beetles-speedy-flight", "urlToImage": "https://www.insidescience.org/sites/default/files/2022-01/featherwing-beetle_top.jpg", "publishedAt": "2022-01-19T16:44:36Z", "content": "(Inside Science) -- Small insects typically fly slower than larger ones, but some of the world's littlest insects appear to contradict that rule. Scientists have discovered that a tiny beetle's feath… [+4574 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Emily Swaby", "title": "Plesiosaurs, pliosaurs, hybodonts: looking back at three prehistoric predators of the Jurassic seas - The Conversation UK", "description": "The fossil of a gigantic ichthyosaur was recently discovered in the UK. It wasn’t the only creature lurking in the Jurassic oceans.", "url": "https://theconversation.com/plesiosaurs-pliosaurs-hybodonts-looking-back-at-three-prehistoric-predators-of-the-jurassic-seas-174828", "urlToImage": "https://images.theconversation.com/files/441539/original/file-20220119-17-1evl26h.jpg?ixlib=rb-1.1.0&rect=0%2C377%2C5991%2C2991&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-19T16:30:46Z", "content": "The fossilised remains of a gigantic ichthyosaur, colloquially known as a sea dragon, were recently uncovered at the Rutland Water Nature Reserve in the UK. Measuring at least ten metres in length an… [+5533 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "John Hewitt", "title": "Why do mitochondria look like they do? - Phys.org", "description": "One of the biggest challenges in biology today is to explain the structure of cristae, the inner membranes of mitochondria. An explanation in this case is a set of principles to predict what form the cristae will take after basic metabolic manipulations of th…", "url": "https://phys.org/news/2022-01-mitochondria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-do-mitochondria-lo.jpg", "publishedAt": "2022-01-19T16:30:02Z", "content": "One of the biggest challenges in biology today is to explain the structure of cristae, the inner membranes of mitochondria. An explanation in this case is a set of principles to predict what form the… [+5976 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Scientists uncover evidence for an internal ocean in small Saturn moon - Nanowerk", "description": "Scientist set out to prove that the tiny, innermost moon of Saturn was a frozen inert satellite and instead discovered compelling evidence that Mimas has a liquid internal ocean.", "url": "https://www.nanowerk.com/news2/space/newsid=59580.php", "urlToImage": "https://www.nanowerk.com/news2/space/id59580.jpg", "publishedAt": "2022-01-19T16:29:36Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Galaxy evolution: A cosmic romance written in the stars - Phys.org", "description": "An international team of astronomers has taken a step forward in understanding the evolution of galaxies, and in so doing, told a story written in the heavens.", "url": "https://phys.org/news/2022-01-galaxy-evolution-cosmic-romance-written.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-cosmic-romance-writt.jpg", "publishedAt": "2022-01-19T13:06:19Z", "content": "An international team of astronomers has taken a step forward in understanding the evolution of galaxies, and in so doing, told a story written in the heavens.\r\nIt has long been a mystery how some sp… [+5021 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Vishwam Sankaran", "title": "Owl wing-inspired design reduces noise from aircraft engines, study finds - The Independent", "description": "Owls produce about 18 decibels less noise than other birds at similar flight speeds due to wing design", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/owl-wing-design-aircraft-noise-b1996085.html", "urlToImage": "https://static.independent.co.uk/2022/01/19/09/Low-Res_POF21-AR-05013_image1.jpg.png?width=1200&auto=webp&quality=75", "publishedAt": "2022-01-19T10:47:05Z", "content": "The serrated edge of owl wings, which help the birds swoop down stealthily on unsuspecting prey, can help inform better designs that cut noise from aeronautical and turbine engines, according to a ne… [+2134 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Steve Dent", "title": "Anemia could make space travel to Mars a challenge, study finds - Yahoo Lifestyle Australia", "description": "Anemia is more serious than thought in space and may create challenges with future travel to Mars.", "url": "https://au.lifestyle.yahoo.com/anemia-could-make-space-travel-to-mars-a-challenge-study-finds-103522230.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/YUc9h4MJrdHXuO6I7c.kQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://s.yimg.com/os/creatr-uploaded-images/2022-01/f6b08be0-7907-11ec-bffd-7cf065a4b8a0", "publishedAt": "2022-01-19T10:35:22Z", "content": "A new Canadian study has found that \"space anemia\" caused by weightlessness is not a temporary issue as once thought, the CBC has reported. \"As long as you are in space, you are destroying more blood… [+1986 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Why did ocean productivity decline abruptly 4.6 million years ago? — ScienceDaily - newsconcerns", "description": "By drilling deep down into sediments on the ocean floor researchers can travel back in time. A research team led from Uppsala University now presents new clues as to when and why a period often referred to as the 'biogenic bloom' came to an abrupt en", "url": "https://newsconcerns.com/why-did-ocean-productivity-decline-abruptly-4-6-million-years-ago-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T08:36:36Z", "content": "By drilling deep down into sediments on the ocean floor researchers can travel back in time. A research team led from Uppsala University now presents new clues as to when and why a period often refer… [+3365 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Smart soil bugs offer farmers an ecofriendly route to controlling crop diseases — ScienceDaily - Verve Times", "description": "An innovative method of controlling a range of damaging crop diseases using native, beneficial soil bacteria has emerged from a research-industry collaboration.The agri-tech innovation hopes to give farmers a way to reduce the cost and environmental", "url": "https://vervetimes.com/smart-soil-bugs-offer-farmers-an-ecofriendly-route-to-controlling-crop-diseases-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T08:31:54Z", "content": "An innovative method of controlling a range of damaging crop diseases using native, beneficial soil bacteria has emerged from a research-industry collaboration.The agri-tech innovation hopes to give … [+4397 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Sunflowers’ invisible colors help them attract bees and adapt to drought — ScienceDaily - Verve Times", "description": "It turns out sunflowers are more than just a pretty face: the ultraviolet colours of their flowers not only attract pollinators, but also help the plant regulate water loss, according to new UBC research.The dense collection of yellow petals of a sun", "url": "https://vervetimes.com/sunflowers-invisible-colors-help-them-attract-bees-and-adapt-to-drought-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T06:29:27Z", "content": "It turns out sunflowers are more than just a pretty face: the ultraviolet colours of their flowers not only attract pollinators, but also help the plant regulate water loss, according to new UBC rese… [+3446 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "Carnegie Mellon-led team to develop robotics to service satellites and build structures - Space Daily", "description": "Washington DC (SPX) Jan 19, 2022 - \r\nThere are 6,500 satellites in orbit, but only about half of them are functional. Once a satellite breaks down or runs out of fuel, it is essentially useless. Repairs, maintenance and upgrades are ne", "url": "https://www.spacedaily.com/reports/Carnegie_Mellon_led_team_to_develop_robotics_to_service_satellites_and_build_structures_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/northrop-grumman-mission-robotic-vehicle-hg.jpg", "publishedAt": "2022-01-19T04:12:33Z", "content": "There are 6,500 satellites in orbit, but only about half of them are functional. Once a satellite breaks down or runs out of fuel, it is essentially useless. Repairs, maintenance and upgrades are nea… [+6270 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Arthritis-related gene also regenerates cartilage in joints and growth plates — ScienceDaily - newsconcerns", "description": "The IL-6 family of proteins has a bad reputation: it can promote inflammation, arthritis, autoimmune disease and even cancer. However, a new USC-led study published in Communications Biology reveals the importance of IL-6 and associated genes for mai", "url": "https://newsconcerns.com/arthritis-related-gene-also-regenerates-cartilage-in-joints-and-growth-plates-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T03:42:30Z", "content": "The IL-6 family of proteins has a bad reputation: it can promote inflammation, arthritis, autoimmune disease and even cancer. However, a new USC-led study published in Communications Biology reveals … [+3964 chars]"}]}