{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Theoretical interpretations of the pulsar timing data recently released by NANOGrav - Phys.org", "description": "The North American Nanohertz Observatory for Gravitational Waves (NANOGrav) is a gravitational-wave detector that monitors areas in the vicinity of Earth using a network of pulsars (i.e., clock-like stars). At the end of 2020, the NANOGrav collaboration gathe…", "url": "https://phys.org/news/2021-03-theoretical-pulsar-nanograv.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/theoreticali.jpg", "publishedAt": "2021-03-02T14:30:01Z", "content": "The North American Nanohertz Observatory for Gravitational Waves (NANOGrav) is a gravitational-wave detector that monitors areas in the vicinity of Earth using a network of pulsars (i.e., clock-like … [+19015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Plant clock could be the key to producing more food for the world - Phys.org", "description": "A University of Melbourne led study has established how plants use their metabolism to tell time and know when to grow—a discovery that could help leverage growing crops in different environments, including different seasons, different latitudes or even in ar…", "url": "https://phys.org/news/2021-03-clock-key-food-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/plant.jpg", "publishedAt": "2021-03-02T14:01:46Z", "content": "A University of Melbourne led study has established how plants use their metabolism to tell time and know when to growa discovery that could help leverage growing crops in different environments, inc… [+2774 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Detective work inside plant cells finds a key piece of the C4 photosynthesis puzzle - Phys.org", "description": "An impressive body of evidence published this week reveals the answer to a mystery that has puzzled plant scientists for more than 30 years: the role of the molecule suberin in the leaves of some of our most productive crops. This discovery could be the key t…", "url": "https://phys.org/news/2021-03-cells-key-piece-c4-photosynthesis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/detectivewor.jpg", "publishedAt": "2021-03-02T13:48:53Z", "content": "An impressive body of evidence published this week reveals the answer to a mystery that has puzzled plant scientists for more than 30 years: the role of the molecule suberin in the leaves of some of … [+4545 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "NASA's James Webb Space Telescope completes final functional tests to prepare for launch - Phys.org", "description": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams successfully completed two important milestones that confirmed t…", "url": "https://phys.org/news/2021-03-nasa-james-webb-space-telescope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/nasasjameswe.jpg", "publishedAt": "2021-03-02T13:10:05Z", "content": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams succ… [+6041 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "You need to watch this space-time bending doc on Apple TV ASAP - Inverse", "description": "A new documentary details the process of capturing the first image of a black hole, and how a group of people created an Earth-sized telescope.", "url": "https://www.inverse.com/science/black-hole-documentary-how-did-we-image-the-invisible", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/3/1/c21c2ed1-c51a-413b-a387-95c2eb0044a5-blackhole.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-03-02T13:00:25Z", "content": "Supermassive black holes lurk\r\n at the center of myriad galaxies like spiders at the center of their web. Yet these cosmic behemoths are invisible to our Earthly instruments  we \"see\" them only via t… [+7660 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The time is ripe! An innovative contactless method for the timely harvest of soft fruits - Phys.org", "description": "In agriculture, there are many mechanical methods to indirectly measure a fruit's ripeness through its firmness. However, most fall short for soft fruits, which do not exhibit the same types of measurable vibration as harder ones. Now, scientists from Shibaur…", "url": "https://phys.org/news/2021-03-ripe-contactless-method-harvest-soft.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thetimeisrip.jpg", "publishedAt": "2021-03-02T12:53:02Z", "content": "In agriculture, there are many mechanical methods to indirectly measure a fruit's ripeness through its firmness. However, most fall short for soft fruits, which do not exhibit the same types of measu… [+4922 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ecology literature dominated by men in a handful of countries - Phys.org", "description": "Publishing in peer-reviewed scientific journals is crucial for the development of a researcher's career. The scientists that publish the most often in the most prestigious journals generally acquire greater renown, as well as higher responsibilities. However,…", "url": "https://phys.org/news/2021-03-ecology-literature-dominated-men-countries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/men.jpg", "publishedAt": "2021-03-02T12:52:25Z", "content": "Publishing in peer-reviewed scientific journals is crucial for the development of a researcher's career. The scientists that publish the most often in the most prestigious journals generally acquire … [+1711 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Observations of First Black Hole Ever Detected Leads to Questions About the Universe's Most Mysterious Objects - SciTechDaily", "description": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to question what they know about the Universe's most mysterious ob…", "url": "https://scitechdaily.com/new-observations-of-first-black-hole-ever-detected-leads-to-questions-about-the-universes-most-mysterious-objects/", "urlToImage": "https://scitechdaily.com/images/Cygnus-X-1-System.gif", "publishedAt": "2021-03-02T12:34:58Z", "content": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to que… [+5569 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Precious Smith", "title": "Lack Of Oxygen Will Lead to 'Death' of Most Life on Earth in Billion Years, Says Experts - Nature World News", "description": "In the early history of Earth, levels of oxygen were much lower and they are more likely to be low again in the distant future which will lead to the death of most life", "url": "https://www.natureworldnews.com/articles/45330/20210302/lack-of-oxygen-will-lead-to-the-death-of-most-life-on-earth-in-a-billion-years-research-study.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/52991/earth.jpg", "publishedAt": "2021-03-02T12:31:53Z", "content": "Earth's atmosphere will have very little oxygen, thereby making it unlivable for complex aerobic life in a billion years from now.\r\nPresently, the earth's atmosphere is made up of around 21 percent o… [+3062 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tim Childers", "title": "Lab-grown black hole behaves just like Stephen Hawking said it would - Livescience.com", "description": "", "url": "https://www.livescience.com/black-hole-analog-confirms-hawking.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vw9j4BpfTqhS4SovcAiUtV-1200-80.jpg", "publishedAt": "2021-03-02T12:23:51Z", "content": "In 1974, Stephen Hawking theorized that the universe's darkest gravitational behemoths, black holes, were not the pitch-black star swallowers astronomers imagined, but they spontaneously emitted ligh… [+5004 chars]"}, {"source": {"id": null, "name": "Smart Energy"}, "author": null, "title": "Powering a Moon village - Smart Energy", "description": "With interest growing in a return of humans to the moon, attention is turning to the possibility of establishing a long-term presence there.", "url": "https://www.smart-energy.com/industry-sectors/new-technology/powering-a-moon-village/", "urlToImage": "https://d346xxcyottdqx.cloudfront.net/wp-content/uploads/2021/03/lunarpowerstation.png", "publishedAt": "2021-03-02T12:08:10Z", "content": "With interest growing in a return of humans to the moon, says Jonathan Spencer Jones, attention is turning to the possibility of establishing a long-term presence there and the form that such a settl… [+12541 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Niiler", "title": "Can Technology Open Spaceflight to Disabled Astronauts? - WIRED", "description": "The European Space Agency wants to make sure its new astronaut class is more diverse. But it will take redesigned gear to make space accessible to everybody.", "url": "https://www.wired.com/story/can-technology-open-spaceflight-to-disabled-astronauts/", "urlToImage": "https://media.wired.com/photos/603d2a7a2d6b6299017ee0d4/191:100/w_1280,c_limit/Science_disabledastronauts_348873main_fd7-repair_full.jpg", "publishedAt": "2021-03-02T12:00:00Z", "content": "What would it be like to have a spaceship with a truly diverse crewnot the mix of alien species seen in so many sci-fi series, but human beings with all kinds of bodies? The European Space Agency ann… [+3769 chars]"}, {"source": {"id": null, "name": "Haaretz"}, "author": "Ruth Schuster", "title": "Neanderthals could speak, new study claims to prove - Haaretz", "description": "Modeling ear structures of Homo sapiens, Neanderthals and an archaic human from Spain shows the Neanderthals could hear, and produce sounds, much as we do", "url": "https://www.haaretz.com/archaeology/neanderthals-could-speak-new-study-claims-to-prove-1.9581958", "urlToImage": "https://img.haarets.co.il/img/1.9582021/2990046590.jpg?precrop=2088,1213,x112,y21&height=698&width=1200", "publishedAt": "2021-03-02T12:00:00Z", "content": "To some its obvious that Neanderthals had language. To sustain and convey their cultural sophistication, they had to be able to speak, goes the argument. Now a new multidisciplinary approach, based o… [+8814 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "‘Little Foot’ fossil sheds further light on human origins - The New Daily", "description": "The fossil of an early human forerunner that inhabited South Africa 3.67 million years ago is shedding light on human origins.", "url": "https://thenewdaily.com.au/life/2021/03/02/little-foot-fossil-human-origins/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2021/03/1614684366-Little-Foot-fossil-2017-960x600.jpg", "publishedAt": "2021-03-02T11:45:02Z", "content": "Sophisticated scanning technology is revealing intriguing secrets about Little Foot, the fossil of an early human forerunner that inhabited South Africa 3.67 million years ago during a critical junct… [+4001 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Sami Fathi", "title": "NASA Mars Perseverance Rover Uses Same PowerPC Chipset Found in 1998 G3 iMac - MacRumors", "description": "NASA's Perseverance rover, which recently made history landing on the surface of Mars, is powered by the same processor used in an iMac more than...", "url": "https://www.macrumors.com/2021/03/02/nasa-mars-perseverance-rover-imac-powerpc/", "urlToImage": "https://images.macrumors.com/t/-F6kpq6Qco7iT9smVOJBzJC3458=/1600x/https://images.macrumors.com/article-new/2021/03/PIA23764-RoverNamePlateonMars-web.jpg", "publishedAt": "2021-03-02T11:21:37Z", "content": "NASA's Perseverance rover, which recently made history landing on the surface of Mars, is powered by the same processor used in an iMac more than 23 years old.\r\nAs reported by NewScientist (via Gizmo… [+846 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Amy Barrett, PA Science", "title": "'Space hurricane' observed above the North Pole - BBC Focus Magazine", "description": "The space hurricane was detected in the Earth's upper atmosphere and 'rained electrons' over the North Pole for nearly eight hours.", "url": "https://www.sciencefocus.com/news/space-hurricane-observed-above-the-north-pole/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2021/03/space-hurricane-hero-781275c.png?quality=90&resize=960,413", "publishedAt": "2021-03-02T11:00:33Z", "content": "Scientists say they have confirmed the existence of space hurricanes after analysing a 1,000km-wide swirling mass of plasma spotted hundreds of kilometres above the North Pole.\r\nThe space hurricane, … [+3357 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": null, "title": "Türkiye’nin Ay Yolculuğu Hedefinde En Büyük Destek 3D Yazıcıdan Çıkacak - RaillyNews", "description": "Turkey's Journey to the Moon 3D Printer from the Destination Biggest Support to Exit | Local and national 3D printer manufacturer Zaxe General Manager Emre Akinci, Turkey, to reach the moon until 2023 in the National Space Program Plan", "url": "https://raillynews.com/2021/03/In-turkiyenin-month-journey-from-3D-printers-will-hit-the-target-most-big-support/", "urlToImage": "https://i2.wp.com/rayhaber.com/wp-content/uploads/2021/03/turkiyenin-ay-yolculugu-hedefinde-en-buyuk-destek-3d-yazicidan-cikacak.jpg?fit=1424%2C800&ssl=1", "publishedAt": "2021-03-02T10:13:34Z", "content": "the biggest support from other printers will hit the target turkiyenin month journey\r\nLocal and national 3D printer manufacturer Zaxe General Manager Emre Akinci, Turkey said it would be the biggest … [+5817 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Meeting the meat needs of the future - EurekAlert", "description": "Researchers from the University of Tokyo have succeeded in culturing meat in the laboratory in the form of millimeter-scale slabs of contractile bovine muscle. This innovative tissue culture process, arrayed in stackable hydrogel modules, uses electrical puls…", "url": "https://www.eurekalert.org/pub_releases/2021-03/iois-mtm022621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257546_web.jpg", "publishedAt": "2021-03-02T10:02:19Z", "content": "IMAGE: Researchers at The University of Tokyo develop a method of culturing meat in the laboratory in the form of millimeter-scale contractile beef muscle that closely simulates steak meat\r\n view mor… [+3091 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sara Castellanos", "title": "A Letter Sealed for Centuries Has Been Read—Without Even Opening It - The Wall Street Journal", "description": "‘Virtual unfolding’ technique used to read a letterlocked 17th century missive could also be used in healthcare and engineering", "url": "https://www.wsj.com/articles/a-letter-sealed-for-centuries-has-been-readwithout-even-opening-it-11614679203", "urlToImage": "https://images.wsj.net/im-305112/social", "publishedAt": "2021-03-02T10:00:00Z", "content": "Using computer algorithms and an X-ray scanner designed for dental research, an international team of researchers has unlocked the secrets of a tightly folded letter sealed since 1697without opening … [+1028 chars]"}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "Nuclear fusion: building a star on Earth is hard, which is why we need better materials - Australian Times", "description": "Nuclear fusion is the process that powers the Sun and all other stars. During fusion, the nuclei of two atoms are brought close enough together that they fuse together, releasing huge amounts of energy.", "url": "https://www.australiantimes.co.uk/news/nuclear-fusion-building-a-star-on-earth-is-hard-which-is-why-we-need-better-materials/", "urlToImage": "https://storage.googleapis.com/cdn.australiantimes.co.uk/wp-content/uploads/2021/03/2b972205-nuclear-fusion.jpg", "publishedAt": "2021-03-02T09:17:00Z", "content": "Aneeqa Khan, Manchester University\r\nNuclear fusion is the process that powers the Sun and all other stars. During fusion, the nuclei of two atoms are brought close enough together that they fuse toge… [+5983 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kristen Minogue", "title": "Stressed-out young oysters may grow less meat on their shells - Phys.org", "description": "Early exposure to tough conditions—particularly warmer waters and nightly swings of low oxygen—could leave lasting scars on oysters' ability to grow meaty tissue. A team of biologists at the Smithsonian Environmental Research Center (SERC) reported the discov…", "url": "https://phys.org/news/2021-03-stressed-out-young-oysters-meat-shells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-stressedouty.jpg", "publishedAt": "2021-03-02T08:29:16Z", "content": "Early exposure to tough conditionsparticularly warmer waters and nightly swings of low oxygencould leave lasting scars on oysters' ability to grow meaty tissue. A team of biologists at the Smithsonia… [+6140 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dennis Overbye", "title": "Once Upon a Time on Mars - The New York Times", "description": "A dune buggy is about to set off on behalf of its human owners to fulfill a primordial yearning.", "url": "https://www.nytimes.com/2021/03/02/science/mars-perseverance-nasa-astronomy.html", "urlToImage": "https://static01.nyt.com/images/2021/03/02/science/02SCI-MARS1/02SCI-MARS1-facebookJumbo.jpg", "publishedAt": "2021-03-02T07:30:12Z", "content": "Three and a half billion years ago, waves splashed and streams surged across this dusty expanse on Mars now known as Jezero Crater. On a nascent Earth, chemistry was coagulating toward the exalted st… [+628 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Modern Oasis of Jubbah: A Long-Ago Lake Amid the Dunes - SciTechDaily", "description": "The modern oasis of Jubbah sits within the wind shadow of historic mountains and the basin of an ancient lakebed. Long-sustained westerly winds shaped the dunes surrounding the Saudi Arabian oasis of Jubbah in this photograph shot by an astronaut from the Int…", "url": "https://scitechdaily.com/modern-oasis-of-jubbah-a-long-ago-lake-amid-the-dunes/", "urlToImage": "https://scitechdaily.com/images/Jubbah-2020-scaled.jpg", "publishedAt": "2021-03-02T06:31:00Z", "content": "November 26, 2020\r\nThe modern oasis of Jubbah sits within the wind shadow of historic mountains and the basin of an ancient lakebed.\r\nLong-sustained westerly winds shaped the dunes surrounding the Sa… [+2738 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "9News Staff", "title": "Strange striped patterns in Russia snow baffle NASA scientists - 9News", "description": "<p>A satellite has captured strange rippled lines across parts of Russia&#x27;s arctic, leaving scientists confused as to what they are.</p>", "url": "https://www.9news.com.au/wild-weather/russia-stripe-patterns-photographed-by-satellite-leave-nasa-scientists-baffled/e0e9ca3e-eaf4-49b6-8e8d-a3801778f27b", "urlToImage": "https://imageresizer.static9.net.au/m6pknW4UhMFmfADh13vlZijWWvk=/0x37:720x442/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Ff7201559-7cc1-4879-acc6-d972aea125d5", "publishedAt": "2021-03-02T05:08:34Z", "content": "Auto news: Old Datsun sells for $1.1 million, breaks auction records in Japan - caradvice.com.au"}, {"source": {"id": null, "name": "The Market Herald"}, "author": "Oliver Gray", "title": "Victoria issues fresh alert to Melbourne suburbs after coronavirus fragments detected in wastewater - The Market Herald", "description": "An urgent alert has been issued to another three suburbs in Melbourne's west after fragments of COVID-19 were discovered at the Werribee wastewater treatment plant.", "url": "https://themarketherald.com.au/victoria-issues-fresh-alert-to-melbourne-suburbs-after-coronavirus-fragments-detected-in-wastewater-2021-03-02/", "urlToImage": "https://themarketherald.com.au/wp-content/uploads/2021/03/og-21644-shutterstock_599171096-1280x720.jpg", "publishedAt": "2021-03-02T03:09:36Z", "content": "<ul><li>An urgent alert has been issued to another three suburbs in Melbourne's west after fragments of COVID-19 were discovered at the Werribee wastewater treatment plant</li><li>The warning was sen… [+2056 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "AAP", "title": "Oldest titanosaur unearthed in Argentina - The West Australian", "description": "Scientists in Argentina have discovered the oldest known titanosaur species, Ninjatitan zapatai, that lived 140 million years ago during the Cretaceous Period.", "url": "https://thewest.com.au/technology/oldest-titanosaur-unearthed-in-argentina-ng-s-2051677", "urlToImage": "https://images.thewest.com.au/publication/S-2051677/1614651275533_Argentina_Dinosaur_16-9_20489336_2051677_2021030213038e1b1be0a-08c6-44c3-b958-3951a2ebb670.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2021-03-02T02:13:00Z", "content": "Scientists have unearthed in Argentina's Patagonian wilderness fossils of what may be the oldest-known member of the dinosaur group that includes the largest land animals in Earth's history.\r\nResearc… [+1766 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "news.com.au", "title": "How to watch Jupiter, Mercury in conjunction on March 5 - NEWS.com.au", "description": "How to watch Jupiter, Mercury in conjunction on March 5", "url": "https://www.news.com.au/technology/science/space/how-to-watch-jupiter-mercury-in-conjunction-on-march-5/news-story/648425ddb99e2cd73c7d3db6d294a070", "urlToImage": "https://cdn.newsapi.com.au/image/v1/e8b8b22500649df7c648e53d393ce2a4?width=1280", "publishedAt": "2021-03-02T02:03:28Z", "content": "Southern hemisphere skywatchers are in for a treat this week with the best chances of seeing the conjunction of Mercury and Jupiter.Conjunctions occur when a planet’s orbit of the sun aligns with ano… [+1281 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Isabella Beltran", "title": "How Climate Change Helped Dinosaurs Migrate from South America to Greenland - Science Times", "description": "A study suggests that in the late Triassic period, roughly 252 million years ago, a dip in the atmospheric CO2 made Earth conditions milder, allowing Sauropodomorphs to migrate from South America to Greenland.", "url": "https://www.sciencetimes.com/articles/29943/20210301/climate-change-helped-dinosaurs-migrate-south-america-greenland.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/32309/henan-geological-museum-sauropod-mural.jpg", "publishedAt": "2021-03-02T01:55:45Z", "content": "Millions of years ago, a shift in atmospheric carbon dioxide allowed herbivores like sauropodomorphs to migrate from South America to Greenland as the planet became milder.\r\nHow The Earth Became Mild… [+3266 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Primates Appeared Almost Immediately After Dinosaurs Went Extinct, New Research Suggests - Gizmodo Australia", "description": "A formation famous for producing T. rex fossils has now yielded the oldest evidence of primates in the fossil record, in what is being hailed a significant discovery. Jawbones and an assortment of teeth found in the Hell’s Creek formation of northeastern Mont…", "url": "https://www.gizmodo.com.au/2021/03/primates-appeared-almost-immediately-after-dinosaurs-went-extinct-new-research-suggests/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/02/qg2jjp8ref6moocpitke.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-01T22:25:00Z", "content": "A formation famous for producing T. rex fossils has now yielded the oldest evidence of primates in the fossil record, in what is being hailed a significant discovery. \r\nJawbones and an assortment of … [+5141 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "When should you end a conversation? Probably sooner than you think - Science Magazine", "description": "Study finds most chats don’t end when people want them to", "url": "https://www.sciencemag.org/news/2021/03/when-should-you-end-conversation-probably-sooner-you-think", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/conversation_1280p.jpg?itok=KgoOShN2", "publishedAt": "2021-03-01T20:45:00Z", "content": "By Cathleen OGradyMar. 1, 2021 , 3:45 PM\r\nWhile studying for his masters degree at the University of Oxford, Adam Mastroianni confronted a fear common to many party goers: Would he get stuck in a con… [+4115 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "SpaceX Falcon 9 missed its landing last month because of a hole in a boot - CNET", "description": "The booster appeared to miss the landing pad of the company's droneship in the Atlantic on Feb. 15.", "url": "https://www.cnet.com/news/spacex-falcon-9-missed-landing-last-month-because-of-a-hole-in-a-boot/", "urlToImage": "https://cnet4.cbsistatic.com/img/5lWsi8lbWCVWyLkR2KvnI76D0rU=/0x0:1670x1379/1200x630/2021/01/06/5b675692-ad86-41b5-9983-c124d59c94f6/nightlaunch1.jpg", "publishedAt": "2021-03-01T20:00:00Z", "content": "A Falcon 9 loaded with Starlink satellites prepares for launch.\r\nSpaceX\r\nAfter successfully sending another batch of its Starlink broadband satellites into orbit Feb. 15 from Florida's Cape Canaveral… [+2224 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Global warming poses threat to food chains - Science Daily", "description": "Rising temperatures could reduce the efficiency of food chains and threaten the survival of larger animals, new research shows.", "url": "https://www.sciencedaily.com/releases/2021/03/210301112403.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T18:21:52Z", "content": "Rising temperatures could reduce the efficiency of food chains and threaten the survival of larger animals, new research shows.Scientists measured the transfer of energy from single-celled algae (phy… [+2092 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "New SpaceX Starship prototype SN10 rocket could fly as soon as Wednesday - CNET", "description": "The latest version of Elon Musk's Mars rocket is on the launch pad in Texas.", "url": "https://www.cnet.com/news/new-spacex-starship-prototype-sn10-rocket-could-fly-as-soon-as-wednesday/", "urlToImage": "https://cnet2.cbsistatic.com/img/vxm8TANrcrdsxKZoH3lI07JiskA=/1200x630/2021/02/17/9ae0e4e1-56a6-4e3d-b99d-61e4a113f6a7/50906488116-c44db82fc1-k.jpg", "publishedAt": "2021-03-01T17:57:00Z", "content": "SN10 and its predecessor SN9 on the launch pad in Boca Chica, Texas, in early February.\r\nSpaceX\r\nJust a few weeks after its predecessor SN9 flew high and then crash-landed on Texas' Gulf Coast, SN10 … [+2793 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": null, "title": "Wrasses dazzle: How fairy wrasses got their flamboyant colours - Phys.Org", "description": "With their exuberant colors, fiery personalities and captivating courtship displays, the fairy wrasses are one of the most beloved coral reef fish. Despite this, the evolutionary history of its genus was not well understood—until ...", "url": "https://phys.org/visualstories/2021-03-wrasses-dazzle-fairy-flamboyant-colours.amp", "urlToImage": null, "publishedAt": "2021-03-01T17:06:54Z", "content": "Fairy wrasses diverged in form and color after repeated sea level rises and falls during the last ice age, finds a new study. Published in top journal Systematic Biology, it employed a novel genome-w… [+511 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Meteorites may be just north of Cheltenham - Yahoo News Australia", "description": "The hunt is on for the fireball fragments that probably fell to Earth over England on Sunday night.", "url": "https://news.yahoo.com/meteorites-may-just-north-cheltenham-164354855.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/iejGpaFoHX5VywVr9L9lzA--~B/aD0zNjA7dz02NDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/844677ecbf1d2f4917ee65bdd4d17181", "publishedAt": "2021-03-01T16:54:01Z", "content": "The hunt is on for meteorite fragments that are likely to have fallen to Earth over England on Sunday night.\r\nMany people across Northern Europe saw a fireball in the sky shortly before 22:00 GMT, an… [+3023 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Second Order Optical Merons, or Light Pretending to Be a Ferromagnet - SciTechDaily", "description": "Scientists have demonstrated how to structure light such that its polarization behaves like a collective of spins in a ferromagnet forming half-skyrmions (also known as merons). To achieve this, the light was trapped in a thin liquid crystal layer between two…", "url": "https://scitechdaily.com/second-order-optical-merons-or-light-pretending-to-be-a-ferromagnet/", "urlToImage": "https://scitechdaily.com/images/Light-Spin-Texture.jpg", "publishedAt": "2021-03-01T16:47:39Z", "content": "Spin texture of a second-order half-skyrmion (meron) on the surface of a birefringent cavity. Credit: Physics UW, M. Krol\r\nScientists have demonstrated how to structure light such that its polarizati… [+4293 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Satellite Spots NASA’s New Rover — and Its Garbage — From Mars Orbit - Gizmodo Australia", "description": "The Perseverance rover, along with several components used during the recent landing, have been imaged from space. The image, captured by the ExoMars Trace Gas Orbiter, reveals the location of the parachute and back shell, the descent stage, the heat shield, …", "url": "https://www.gizmodo.com.au/2021/03/satellite-spots-nasas-new-rover-and-its-garbage-from-mars-orbit/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/02/rkkjwkrao8wlhndclkpl-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-01T16:30:00Z", "content": "The Perseverance rover, along with several components used during the recent landing, have been imaged from space.\r\nThe image, captured by the ExoMars Trace Gas Orbiter, reveals the location of the p… [+1886 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Warming impairs trophic transfer efficiency in a long-term field experiment - Nature.com", "description": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic level makes it up to the next1–3. Recent theory suggests thi…", "url": "https://www.nature.com/articles/s41586-021-03352-2", "urlToImage": "", "publishedAt": "2021-03-01T16:17:48Z", "content": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic … [+1237 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Melissa Gaskill", "title": "International Space Station archives fuel new scientific discoveries - Phys.org", "description": "When scientists complete an experiment aboard the International Space Station, the ramifications of that work have just begun. NASA carries on a legacy of decades of biological research data, fueling new discoveries long after studies wrap up in space.", "url": "https://phys.org/news/2021-03-international-space-station-archives-fuel.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-internationa.jpg", "publishedAt": "2021-03-01T15:56:17Z", "content": "When scientists complete an experiment aboard the International Space Station, the ramifications of that work have just begun. NASA carries on a legacy of decades of biological research data, fueling… [+6255 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Bispecific antibodies targeting mutant RAS neoantigens - Science", "description": "RAS oncogene mutations are common in various cancers, controlling their growth and survival. Targeting mutant RAS proteins with antibodies has been unsuccessful due to low surface expression, even when targeting mutant RAS peptides presented via HLA on the su…", "url": "https://immunology.sciencemag.org/content/6/57/eabd5515.full", "urlToImage": "https://immunology.sciencemag.org/content/6/57/eabd5515/F1.large.jpg", "publishedAt": "2021-03-01T15:51:18Z", "content": "INTRODUCTION\r\nSelective killing of cancer cells is challenging because cancer cells and their normal counterparts are so similar. At the genetic level, the most important differences between cancer c… [+12122 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "The $450 question: Should journals pay peer reviewers? - Science Magazine", "description": "Payment advocates expect quicker, better reviews but opponents fear unsustainable costs", "url": "https://www.sciencemag.org/news/2021/03/450-question-should-journals-pay-peer-reviewers", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/money_1280p.jpg?itok=r2CygPAX", "publishedAt": "2021-03-01T15:45:00Z", "content": "By Jeffrey BrainardMar. 1, 2021 , 10:45 AM\r\nFor many busy working scientists, receiving yet another invitation from an academic journal to peer review yet another manuscript can trigger groans. The w… [+7999 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New skills of Graphene: Tunable lattice vibrations - Science Daily", "description": "Technological innovation in the last century was mainly based on the control of electrons or photons. Now, in the emerging research field of phononics, phonons or vibrations of the crystal lattice attract attention. A team showed a graphene-based phononic cry…", "url": "https://www.sciencedaily.com/releases/2021/03/210301095942.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T15:23:31Z", "content": "Without electronics and photonics, there would be no computers, smartphones, sensors, or information and communication technologies. In the coming years, the new field of phononics may further expand… [+2533 chars]"}, {"source": {"id": null, "name": "Digital Camera World"}, "author": "Louise Carey", "title": "Every camera on the Mars Perseverance rover from NASA explained - Digital Camera World", "description": "The Mars Perseverance rover from NASA has a total of 23 cameras – and here's what they all do", "url": "https://www.digitalcameraworld.com/uk/news/these-are-all-the-cameras-on-nasas-mars-perseverance-rover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pxaQAe8Pmt39w9cQfMGts9-1200-80.jpg", "publishedAt": "2021-03-01T14:15:19Z", "content": "The landing of the Perseverance rover on Mars is one of the most exciting events to happen for space enthusiasts in quite a while. The Perseverance rover will be searching for ancient life, collectin… [+5799 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Physicist's AI Algorithm Could Prove Our Reality Is Just A Simulation - India Times", "description": "We've accustomed ourselves to AI algorithms making accurate predictions to enhance the comforts and convenience of our life. But just what exactly is life and this reality we all experience? Could it all be one big simulation, like they showed in the movie Th…", "url": "https://www.indiatimes.com/technology/science-and-future/physicist-hong-qin-ai-algorithm-could-prove-our-reality-is-just-a-simulation-535379.html", "urlToImage": "https://im.indiatimes.in/content/2021/Mar/Facebook-Thumbnail_603cf2acdfe91.jpg", "publishedAt": "2021-03-01T14:03:16Z", "content": "We've accustomed ourselves to AI algorithms making accurate predictions to enhance the comforts and convenience of our life. But just what exactly is life and this reality we all experience? Could it… [+3386 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "ESA is working on a mission to explore caves on the moon - Phys.org", "description": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes necessary to support a moon base. ESA is also contributing both m…", "url": "https://phys.org/news/2021-03-esa-mission-explore-caves-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/esaisworking.jpg", "publishedAt": "2021-03-01T13:35:17Z", "content": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes neces… [+3716 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "Josef Aschbacher is new ESA Director General - Space Ref", "description": "Josef Aschbacher is new ESA Director General - SpaceRef", "url": "http://spaceref.com/news/viewpr.html?pid=57069", "urlToImage": null, "publishedAt": "2021-03-01T12:49:12Z", "content": "Josef Aschbacher is new ESA Director General\r\nPress Release\r\n From: European Space AgencyPosted: Monday, March 1, 2021 \r\nAs of today, 1 March 2021, ESA has a new Director General: Dr Josef Aschbacher… [+524 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Super Soaker Mission Seeks to Understand Bright Night-Shining Clouds by Creating One - SciTechDaily", "description": "Since the late 1800s, observers have searched the polar skies for elusive, high-flying clouds that shine in the darkness. These polar mesospheric clouds, or PMCs, are wispy swarms of ice crystals that form in the late spring and summer over the North and Sout…", "url": "https://scitechdaily.com/nasa-super-soaker-mission-seeks-to-understand-bright-night-shining-clouds-by-creating-one/", "urlToImage": "https://scitechdaily.com/images/Water-Canister-Release.gif", "publishedAt": "2021-03-01T12:16:22Z", "content": "Time lapse of the Super Soaker launch. Three rockets launched with the mission, two using vapor tracers to track wind movement and one releasing a water canister to seed a polar mesospheric cloud. Th… [+5346 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Planetary defense experts use infamous asteroid Apophis to practice spotting dangerous space rocks - Space.com", "description": "Apophis definitely won't hit Earth this month, but scientists are pretending it might.", "url": "https://www.space.com/apophis-2021-flyby-for-planetary-defense-practice", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZN2MLRSc92EHh25Y2W5ebm-1200-80.gif", "publishedAt": "2021-03-01T12:02:44Z", "content": "Earth's most recent brush with asteroid danger was eight years ago, when a space rock the size of a six-story building came seemingly out of nowhere, injuring 1,200 people when it exploded over Chely… [+10146 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Meet the swirlon, a new kind of matter that bends the laws of physics - Livescience.com", "description": "Researchers discover a new state of active matter.", "url": "https://www.livescience.com/swirlonic-matter-unusual-behavor.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AnQtax5jsCUukFJ2sYxGNX-1200-80.jpg", "publishedAt": "2021-03-01T12:00:45Z", "content": "Fish school, insects swarm and birds fly in murmurations. Now, new research finds that on the most basic level, this kind of group behavior forms a new kind of active matter, called a swirlonic state… [+3068 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Margaret Davis", "title": "Huge Solar Flare Captured Erupting from Sun's Surface in New NASA Video - Science Times", "description": "NASA's Solar Dynamics Observatory (SDO) captured a huge solar flare bursting from the Sun's northwest hemisphere followed by a few shockwaves.", "url": "https://www.sciencetimes.com/articles/29938/20210301/huge-solar-flare-capture-erupting-suns-surface-new-nasa-video.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/32301/huge-solar-flare-capture-erupting-from-the-suns-surface-in-new-nasa-video.jpg", "publishedAt": "2021-03-01T10:24:29Z", "content": "NASA's Solar Dynamics Observatory (SDO) captured in the video a solar flare bursting from the northwest hemisphere of the Sun. It can be seen that a blast of filament is booming through the Sun's atm… [+3181 chars]"}, {"source": {"id": null, "name": "Sciencenordic.com"}, "author": "Tobias Kvist Stripp", "title": "Research and social media: A dangerous cocktail or winged messenger? - ScienceNordic", "description": "OPINION: Social media plays a huge part in the process of scientific publication. Is this a good or a bad thing? How do we ensure, that science stays trustworthy under the influence of social media?", "url": "https://sciencenordic.com/a/1820056", "urlToImage": "https://image.sciencenordic.com/1821879.jpg?imageId=1821879&panow=100&panoh=60.169491525424&panox=0&panoy=39.830508474576&heightw=34.48275862069&heighth=100&heightx=0&heighty=0&width=1200&height=630", "publishedAt": "2021-03-01T10:11:21Z", "content": "Research is usually considered trustworthy. Many would probably argue that research published in scientific papers is as close as we can get to truthful knowledge about the world.\r\nWe usually do not … [+10346 chars]"}, {"source": {"id": null, "name": "Farmonline.com.au"}, "author": "", "title": "The lies the lyrebird tells to keep his girl - North Queensland Register", "description": "Male lyrebirds mimic outside threats from other birds when a female attempts to leave a male's dancing arena without mating.", "url": "https://www.farmonline.com.au/story/7144970/the-lies-the-lyrebird-tells-to-keep-his-girl/", "urlToImage": "https://www.farmonline.com.au/images/transform/v1/crop/frm/32XghFRykTWK8psrWNhdBMC/e945f8db-3295-4c3a-8793-7c42eef14663.jpg/r53_37_996_570_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T07:00:00Z", "content": "Researchers at Western Sydney University in partnership with Cornell University, the University of Wollongong and the Australian National University, have found male superb lyrebirds can create an as… [+1841 chars]"}, {"source": {"id": null, "name": "KIRO Seattle"}, "author": "Michelle Ewing, Cox Media Group National Content Desk", "title": "Snow Moon 2021: 10 stunning photos of February’s full moon - KIRO Seattle", "description": "February's full moon, also known as the snow moon, appeared in the night sky over the weekend. Skygazers took to social media to share their photos. Here are some of our favorites.", "url": "https://www.kiro7.com/news/trending/snow-moon-2021-10-stunning-photos-februarys-full-moon/A7MKFJWYSBEXDJ4CX4OH4L2G4E/", "urlToImage": "https://www.kiro7.com/resizer/ssGakui1K4W37fKWA7dGTuH9WyE=/1200x628/cloudfront-us-east-1.images.arcpublishing.com/cmg/BUT44AYTRRFW7HSLXJK73UGFDQ.jpg", "publishedAt": "2021-03-01T06:55:59Z", "content": null}, {"source": {"id": null, "name": "Armidale Express"}, "author": "Jacinta Dickins", "title": "New England North West towns including Armidale and Tamworth named as COVID-19 vaccination satellite sites - Armidale Express", "description": "These 12 towns in the region will be satellite sites for the vaccination rollout.", "url": "https://www.armidaleexpress.com.au/story/7147684/new-england-covid-19-vaccination-sites-revealed/", "urlToImage": "https://www.armidaleexpress.com.au/images/transform/v1/crop/frm/JV4n4a6iwKJ9DNUAb9ehsn/3c2ae18c-d75e-4844-b2f8-26fe032dbe28.jpg/r9_376_4021_2643_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T06:00:00Z", "content": ""}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Argentinian titanosaur may be oldest yet: Study - Al Jazeera English", "description": "The 20-metre lizard, discovered in Argentina in 2014, roamed what is now Patagonia some 140 million years ago.", "url": "https://www.aljazeera.com/news/2021/3/1/argentine-titanosaur-may-be-oldest-yet-study", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/000_736K5.jpg?resize=1200%2C630", "publishedAt": "2021-03-01T03:08:42Z", "content": "A colossal dinosaur dug up in Argentina could be the oldest titanosaur ever found, having roamed what is now Patagonia some 140 million years ago at the beginning of the Cretaceous period, scientists… [+1088 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Astronaut captures incredible footage of Earth during spacewalk - ABC News", "description": "Earth, as it is seen from space, takes centre stage in footage filmed during two astronauts' seven-hour mission outside the International Space Station.", "url": "https://www.abc.net.au/news/2021-03-01/astronauts-capture-incredible-footage-of-earth-from-space/13202788", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/0d2dfbbccc4b92ba9344478f1f909fae?impolicy=wcms_crop_resize&cropH=576&cropW=1023&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2021-03-01T02:13:57Z", "content": "Footage from NASA showing astronauts spacewalking during a seven-hour mission over the weekend has been released. \r\n<ul><li>The two astronauts were installing frames for new solar panels</li><li>The … [+1377 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "This Is What Rolling Blackouts Look Like From Space - Universe Today", "description": "Extreme winter weather hit Texas hard this February. An air mass from the arctic extended deep into the United States from Canada, with disastrous results for the ordinarily warm state. Along with snow and unusually low temperatures, the state’s capacity for …", "url": "https://www.universetoday.com/150322/this-is-what-rolling-blackouts-look-like-from-space/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/02/Houston-Dark-1024x840.jpg", "publishedAt": "2021-03-01T01:17:23Z", "content": "Extreme winter weather hit Texas hard this February. An air mass from the arctic extended deep into the United States from Canada, with disastrous results for the ordinarily warm state. Along with sn… [+3772 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Scientists sequence 64 human genomes to better reflect genetic diversity - Yahoo News Australia", "description": "Scientists have sequenced 64 full human genomes to better understand genetic diversity in the species.", "url": "https://au.news.yahoo.com/sequence-64-human-genomes-genetic-diversity-195605887.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/cuq4BRX0ck9df.K6GLo.Dg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMTI1/https://s.yimg.com/os/creatr-uploaded-images/2021-02/71ea0fe0-79f7-11eb-a732-012e236670a5", "publishedAt": "2021-02-28T20:14:46Z", "content": "The Human Genome Project shed light on our species in 2001, but it was a patchwork of different humans' genes that didn't really reflect humanity's genetic makeup. Flash forward 20 years, however, an… [+1192 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Lilia Dergacheva. Sputnik International", "title": "Dust From Asteroid That Allegedly Ended Dinosaur Era Dots I’s on Impact Event Theory - Sputnik International", "description": "Dinosaur diversity came to a dramatic end around 66 million years ago, as scientists have long linked the end of this megafauna era to an celestial impact event that...", "url": "https://sputniknews.com/society/202102281082213041-dust-from-asteroid-that-allegedly-ended-dinosaur-era-dots-is-on-impact-event-theory/", "urlToImage": "https://cdn1.img.sputniknews.com/images/107211/57/1072115746.jpg", "publishedAt": "2021-02-28T16:49:00Z", "content": "Dinosaur diversity came to a dramatic end around 66 million years ago, as scientists have long linked the end of this megafauna era to an celestial impact event that had struck what is today the Yuca… [+2285 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Satellite view of Japan at night • Earth.com - Earth.com", "description": "Today's Image of the Day from NASA Earth Observatory features a satellite view of Japan at night.", "url": "https://www.earth.com/image/satellite-view-of-japan-at-night/", "urlToImage": "https://cff2.earth.com/uploads/2021/02/28073923/ISS053-E-209380_720.jpg", "publishedAt": "2021-02-28T15:37:55Z", "content": "Today’s Image of the Day from NASA Earth Observatory features a satellite view of Japan at night. The lights clustered in the top of the photo represent the Greater Tokyo area. Home to more than 30 m… [+839 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Sensing suns - EurekAlert", "description": "Red supergiants are a class of star that end their lives in supernova explosions. Their lifecycles are not fully understood, partly due to difficulties in measuring their temperatures. For the first time, astronomers develop an accurate method to determine th…", "url": "https://eurekalert.org/pub_releases/2021-02/uot-ss022521.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257409_web.jpg", "publishedAt": "2021-02-28T15:02:39Z", "content": "IMAGE: The red supergiant appears as a red starburst between two orange clouds.\r\n view more \r\nCredit: © 2021 Andrew Klinger\r\nRed supergiants are a class of star that end their lives in supernova expl… [+5765 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": null, "title": "Half of coral population of Great Barrier Reef is over - Micky News", "description": "The largest coral reef in the world, the Great barrier reef, known for its diverse coral population and beauty, has been depleting.", "url": "https://micky.com.au/half-of-coral-population-of-great-barrier-reef-is-over/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/10/shutterstock_1707128332-1.jpg", "publishedAt": "2020-10-15T19:44:24Z", "content": "In a study produced by the Royal Society, it is propounded that the primary cause of this depletion has been climate change and the rising temperature and sea levels.\r\nHow does it affect the Australi… [+2094 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Tasmanian tiger doomed long before humans came along - Arab News", "description": "SYDNEY: The Tasmanian tiger was doomed long before humans began hunting the enigmatic marsupial, scientists said Tuesday, with DNA sequencing showing it was in poor genetic health for thousands of years before its extinction. Scientists genetically mapped the…", "url": "https://www.arabnews.com/node/1207691", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/12/12/1052031-1341624965.jpg", "publishedAt": "2019-08-26T13:13:23Z", "content": "JEDDAH: The ketogenic diet has become one of the fastest-growing dietary trends, but experts have warned that many of its advocates are unaware of the dangerous side effects the diet can cause.\r\nAcco… [+2503 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 1 Mar 2021: Fuego volcano, Popocatépetl, Reventador, Sangay, Sabancaya\r\n 08:00 AM | BY: VN\r\nPopocatépetl (Central Mexico): Explosive activity continues. Volcanic Ash Advisory Center … [+1403 chars]"}]}