{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "The Haunting Music of Whale Song Is an Ocean of Untapped Seismic Data, Scientists Say - ScienceAlert", "description": "The way that the songs of fin whales echo back from the seabed could become a useful tool for scientists studying the sediment and rock that make up Earth's crust, according to new research carried out in the northeast Pacific Ocean.", "url": "https://www.sciencealert.com/whale-songs-could-help-with-scientific-studies-of-earth-s-crust", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/fin-w-2_1024.jpg", "publishedAt": "2021-02-17T01:49:20Z", "content": "The way that the songs of fin whales echo back from the seabed could become a useful tool for scientists studying the sediment and rock that make up Earth's crust, according to new research carried o… [+3035 chars]"}, {"source": {"id": null, "name": "B&T"}, "author": null, "title": "Fridays For Future unveils '1%', a satirical tourism ad for Mars, Via FRED & FARID - B&T", "description": "In anticipation of the arrival of NASA's Perseverance Rover on Mars on 18 February, Fridays For Future has unveiled “1%”, a satirical tourism ad for Mars, to awaken the 99 per cent of humans who will have to stay on Earth.", "url": "https://www.bandt.com.au/fridays-for-future-unveils-1-a-satirical-tourism-ad-for-mars-via-fred-farid/", "urlToImage": "https://www.bandt.com.au/information/uploads/2021/02/FFF_1_13-750x313.jpg", "publishedAt": "2021-02-17T00:44:00Z", "content": null}, {"source": {"id": null, "name": "Sydney.edu.au"}, "author": null, "title": "How icebergs really melt – and what it means for climate change - News - The University of Sydney", "description": "Climate scientists have incorrectly assumed icebergs melt uniformly in warming oceans. University of Sydney mathematicians have developed a new model to more accurately describe icebergs melting, which contributes 50% of freshwater ice melt in the oceans.", "url": "https://www.sydney.edu.au/news-opinion/news/2021/02/17/how-icebergs-really-melt-what-it-means-climate-change.html", "urlToImage": "https://www.sydney.edu.au/content/dam/corporate/images/news-and-opinion/news/2021/february/greenland-iceberg-aline-dassel-pixabay-crop.jpg", "publishedAt": "2021-02-17T00:43:29Z", "content": "Eric Hester, lead author of the study.\r\nSome of this ice loss is direct from the ice sheets, but about half of the overall ice loss from Greenland and Antarctica happens when icebergs melt in the oce… [+1113 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A New Measurement of Quantum Space-Time Has Found Nothing Going On - ScienceAlert", "description": "In the very smallest measured units of space and time in the Universe, not a lot is going on. In a new search for quantum fluctuations of space-time on Planck scales, physicists have found that everything is smooth.", "url": "https://www.sciencealert.com/a-new-measurement-of-quantum-space-time-has-found-nothing-going-on", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/holometer_1024.jpg", "publishedAt": "2021-02-16T22:09:52Z", "content": "In the very smallest measured units of space and time in the Universe, not a lot is going on. In a new search for quantum fluctuations of space-time on Planck scales, physicists have found that every… [+4394 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Craig Butt, Mark Stehle, Reginal Sengkey, Richard Lama", "title": "Welcome to our new COVID-19 vaccine data tracker - Sydney Morning Herald", "description": "The race to vaccinate the world against coronavirus has produced a whole new set of data to follow. Use our dashboard to track progress around the globe.", "url": "https://www.smh.com.au/national/welcome-to-our-new-covid-19-vaccine-data-tracker-20210216-p5731f.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.48406571087216244%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_72%2C$y_52/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/07fe5b0a3b1c24c88a271b1f4bcd721364e8526c", "publishedAt": "2021-02-16T21:40:00Z", "content": "The worldwide battle against COVID-19 has moved to its next phase as vaccines are rolled out across the globe. Most countries now face the enormous logistical challenge of vaccinating enough people s… [+1367 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Updates Coverage of Space Station Cargo Ship Docking - NASA", "description": "In response to a winter storm currently affecting NASA personnel and broadcast capabilities in Texas, NASA is adjusting coverage of the arrival and docking of a Russian cargo spacecraft to the International Space Station.", "url": "https://www.nasa.gov/press-release/nasa-updates-coverage-of-international-space-station-cargo-ship-docking/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/40577160923_5af05a505e_k.jpg", "publishedAt": "2021-02-16T21:32:15Z", "content": null}, {"source": {"id": null, "name": "Inside Science News Service"}, "author": null, "title": "Not Just Bats: Researchers Say Numerous Mammals Could Host Unknown Coronaviruses - Inside Science News Service", "description": "(Inside Science) -- Most of the coronaviruses that humans encounter typically cause only mild infections. But the three most recent novel strains -- SARS-CoV-1, MERS-CoV and SARS-CoV-2, which causes COVID-19 -- are unusually virulent with relatively high fata…", "url": "http://www.insidescience.org/news/not-just-bats-researchers-say-numerous-mammals-could-host-unknown-coronaviruses", "urlToImage": "http://www.insidescience.org/sites/default/files/2021-02/Coronavirus-particles.jpg", "publishedAt": "2021-02-16T19:27:00Z", "content": "(Inside Science) -- Most of the coronaviruses that humans encounter typically cause only mild infections. But the three most recent novel strains -- SARS-CoV-1, MERS-CoV and SARS-CoV-2, which causes … [+4722 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jonathan O'Callaghan", "title": "Something Crashed Into Jupiter Last Year - And A NASA Spacecraft Saw It Happen - Forbes", "description": "NASA’s Juno spacecraft likely witnessed the moment an asteroid or comet slammed into Jupiter and disintegrated in its atmosphere, according to a team of researchers.", "url": "https://www.forbes.com/sites/jonathanocallaghan/2021/02/16/something-crashed-into-jupiter-last-yearand-a-nasa-spacecraft-saw-it-happen/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F602c0a8924667be94be1a8f4%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1399%26cropY1%3D61%26cropY2%3D994", "publishedAt": "2021-02-16T18:16:40Z", "content": "Jupiter, seen by Juno in May 2019.\r\nKevin M. Gill/NASA/JPL-Caltech/SwRI/MSSS\r\nNASAs Juno spacecraft likely witnessed the moment an asteroid or comet slammed into Jupiter and disintegrated in its atmo… [+3333 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Research linking violent entertainment to aggression retracted after scrutiny - Science Magazine", "description": "Questioned psychology papers linger on in meta-analyses", "url": "https://www.sciencemag.org/news/2021/02/research-linking-violent-entertainment-aggression-retracted-after-scrutiny", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/mickey_1280p.jpg?itok=jYZwJ0pB", "publishedAt": "2021-02-16T18:00:00Z", "content": "Do violent movies like Sin City lead to aggression? Retracted studies have muddied the debate.\r\nAF archive/Alamy Stock Photo \r\nBy Cathleen OGradyFeb. 16, 2021 , 1:00 PM\r\nAs Samuel West combed through… [+5087 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Graphene 'nano-origami' creates tiniest microchips yet: Nanomaterial developments could lead to computers and phones running thousands of times faster - Science Daily", "description": "Experimental physicists have developed the smallest microchips ever - 100 times smaller than conventional microchips. They believe that this next generation of microchips could lead to computers and phones running thousands of times faster.", "url": "https://www.sciencedaily.com/releases/2021/02/210216100141.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-16T17:27:29Z", "content": "The tiniest microchips yet can be made from graphene and other 2D-materials, using a form of 'nano-origami', physicists at the University of Sussex have found.This is the first time any researchers h… [+1809 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Planet Nine at edge of solar system ‘could be an illusion’, new research suggests - Yahoo News Australia", "description": "New research has dealt a blow to the idea that a huge planet which has never been seen by human eyes could be lurking unseen at the edge of our solar system.", "url": "https://au.news.yahoo.com/planet-nine-solar-system-illusion-172655707.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/d5467e60-707a-11eb-8adb-6b6c1754f612", "publishedAt": "2021-02-16T17:26:00Z", "content": "Is there a huge hidden planet at the edge of the solar system (NASA)\r\nNew research has dealt a blow to the idea that a huge planet which has never been seen by human eyes\r\n could be lurking unseen at… [+2775 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Astra approved! But do we have a boomer problem? - ABC News", "description": "The Oxford AstraZeneca vaccine has been approved for use in Australia, but it comes with fine print around who should get it. In its approval, the Therapeutic Goods Administration noted that the \"decision to immunise an elderly patient should be decided on a …", "url": "https://www.abc.net.au/radio/programs/coronacast/astra-approved-but-do-we-have-a-boomer-problem/13161284", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=4", "publishedAt": "2021-02-16T17:01:00Z", "content": "Tegan Taylor: Hello, this is Coronacast, a daily podcast all about the coronavirus. I'm health reporter Tegan Taylor.Norman Swan: I'm physician and journalist Dr Norman Swan. It's Wednesday, 17 Febru… [+12528 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Daily caffeine consumption can change the gray matter of the brain - News-Medical.Net", "description": "Coffee, cola or an energy drink: caffeine is the world's most widely consumed psychoactive substance. Researchers from the University of Basel have now shown in a study that regular caffeine intake can change the gray matter of the brain. However, the effect …", "url": "https://www.news-medical.net/news/20210216/Daily-caffeine-consumption-can-change-the-gray-matter-of-the-brain.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Caffeine-620x480.jpg", "publishedAt": "2021-02-16T15:47:00Z", "content": "Coffee, cola or an energy drink: caffeine is the world's most widely consumed psychoactive substance. Researchers from the University of Basel have now shown in a study that regular caffeine intake c… [+3283 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Climate Change Could Have Helped Dinosaurs Migrate from South America to Greenland - AZoCleantech", "description": "A new article has refined the estimates of when herbivorous or plant-eating dinosaurs could have crossed North America on a northerly journey to reach Greenland, and pointed out an interesting climatic occurrence that could have aided these animals along the …", "url": "https://www.azocleantech.com/news.aspx?newsID=28870", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28870_16134761332029929.jpg", "publishedAt": "2021-02-16T15:41:00Z", "content": "Written by AZoCleantechFeb 16 2021\r\nA new article has refined the estimates of when herbivorous or plant eating dinosaurs could have crossed North America on a northerly journey to reach Greenland, a… [+5549 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Matthew S. Williams", "title": "Growing Plants in Alien Soil: How Will Future Missions Feed Astronauts - Interesting Engineering", "description": "Our species is determined to make extraterrestrial agriculture sustainable. No matter what.", "url": "https://interestingengineering.com/growing-plants-in-alien-soil-how-will-future-missions-feed-astronauts", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Lg6EyJ7M6N/sizes/space-agri-header_md.jpg", "publishedAt": "2021-02-16T15:19:29Z", "content": "In three years, NASA will be sending astronauts back to the Moon for the first time since the Apollo Era. Known as Artemis III, this mission is currently scheduled to launch in October of 2024 as par… [+21982 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "First humans in Tasmania must have seen spectacular auroras: Laschamp excursion occurred in Australia and seen by first humans - Science Daily", "description": "A small sub-alpine lake in western Tasmania has helped establish that 41,000 years ago Australia experienced the Laschamp geomagnetic excursion and that Tasmanian, Aboriginals, would've seen it.", "url": "https://www.sciencedaily.com/releases/2021/02/210216092853.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-16T15:08:01Z", "content": "Drilling a 270,000-year old core from a Tasmanian lake has provided the first Australian record of a major global event where the Earth's magnetic field 'switched '- and the opportunity to establish … [+3150 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Darrell Etherington", "title": "SpaceX launches 60 more satellites for its Starlink service on the heels of opening up access - Yahoo News Australia", "description": "SpaceX has launched yet another batch of Starlink satellites – a full complement of 60, the standard size for its current Falcon 9-based Starlink missions.  ...", "url": "https://au.news.yahoo.com/spacex-launches-60-more-satellites-133643867.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5G.ybXohBquNpMdWe4TW.Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/uu/api/res/1.2/REfGIJUCpb.BPZ.qe9Pkrw--~B/aD0yMDAwO3c9MzAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/12ad004a5ff1632212dd13c1beab2725", "publishedAt": "2021-02-16T14:15:39Z", "content": "SpaceX has launched yet another batch of Starlink satellites a full complement of 60, the standard size for its current Falcon 9-based Starlink missions. This brings SpaceX's total to just around 1,0… [+2040 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Planetary scientists discover evidence for a reduced atmosphere on ancient Mars - Phys.org", "description": "Both Earth and Mars currently have oxidising atmospheres, which is why iron-rich materials in daily life develop rust (a common name for iron oxide) during the oxidation reaction of iron and oxygen. The Earth has had an oxidising atmosphere for approximately …", "url": "https://phys.org/news/2021-02-planetary-scientists-evidence-atmosphere-ancient.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/602bc596d2f78.jpg", "publishedAt": "2021-02-16T13:20:07Z", "content": "Both Earth and Mars currently have oxidising atmospheres, which is why iron-rich materials in daily life develop rust (a common name for iron oxide) during the oxidation reaction of iron and oxygen. … [+5076 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Aylin Woodward", "title": "The space rock that doomed the dinosaurs was shrapnel from a comet that flew too close to the sun, a Harvard study suggests - Business Insider Australia", "description": "The origin of the space rock that killed the dinosaurs has been a mystery. A new study suggests it wasn't an asteroid, but a comet fragment.", "url": "https://www.businessinsider.com.au/asteroid-killed-dinosaurs-extinction-comet-study-2021-2", "urlToImage": "https://i.insider.com/602abac02edd0f001a8d5cec?format=jpeg", "publishedAt": "2021-02-16T12:54:00Z", "content": "About 66 million years ago, a space rock more than 10km wide collided with Earth, striking land that is now part of Mexico.\r\nThe impact sparked wildfires that stretched for hundreds of miles, trigger… [+5582 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PR Newswire", "title": "Top Scientists, Advances in Analytical Chemistry Recognized - Yahoo Finance", "description": "Each year, Pittcon provides a venue where scientists who have made outstanding contributions to analytical chemistry and applied spectroscopy are honored...", "url": "https://finance.yahoo.com/news/top-scientists-advances-analytical-chemistry-125000758.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/yvXDXO1fiRTK1Pfi3AvYXQ--~B/aD05Mjt3PTQwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/aa4fc52c2276df8f33f79c65312f1a1c", "publishedAt": "2021-02-16T12:50:00Z", "content": "Awards and Related Symposia Featured at Pittcon 2021\r\nPITTSBURGH, Feb. 16, 2021 /PRNewswire/ -- Each year, Pittcon provides a venue where scientists who have made outstanding contributions to analyti… [+3892 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Metcalfe", "title": "Original 'Stonehenge' discovered, confirming a legend of the wizard Merlin - Livescience.com", "description": "", "url": "https://www.livescience.com/original-stonehenge-discovered-in-wales.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V39JDPxtQR4u2CWV5bLpom-1200-80.jpg", "publishedAt": "2021-02-16T12:00:00Z", "content": "The earliest megalithic circle at Stonehenge was first built in the west of Wales more than 5,000 years ago, before its stones were dug up and dragged over 140 miles (225 kilometers) to its present s… [+7551 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "‘Strange creatures’ found under Antarctica - The New Daily", "description": "A group of scientists have discovered \"strange creatures\" under a 900-metre thick ice shelf of the Antarctic, a new article says.", "url": "https://thenewdaily.com.au/life/science/environment/2021/02/16/strange-creatures-found-antarctica/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2020/07/GettyImages-553789219-960x600.jpg", "publishedAt": "2021-02-16T11:28:56Z", "content": "A group of scientists have discovered “strange creatures” under a 900-metre thick ice shelf of the Antarctic, according to an article published in the journalFrontiers in Marine Science.\r\nBy drilling… [+1442 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Climate change likely drove the extinction of North America's largest animals - EurekAlert", "description": "A new study published in <i>Nature Communications</i> suggests that the extinction of North America's largest mammals was not driven by overhunting by rapidly expanding human populations following their entrance into the Americas. Instead, the findings, based…", "url": "https://www.eurekalert.org/pub_releases/2021-02/mpif-ccl021221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/256254_web.jpg", "publishedAt": "2021-02-16T10:04:25Z", "content": "IMAGE: The study's findings suggest that decreasing hemispheric temperatures and associated ecological changes were the primary drivers of the Late Quaternary megafauna extinctions in North America.\r… [+7243 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "COVID battle heads into space in UQ, Boeing ISS project - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-16T08:40:00Z", "content": null}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "We found the first Australian evidence of a major shift in Earth’s magnetic poles. It may help us predict the next - Australian Times", "description": "But at 14,000 years old, the records from these lakes are much younger than the Laschamp excursion. Four decades later, our work at Lake Selina with modern techniques has revealed the exciting potential for similar research at other Australian lakes.", "url": "https://www.australiantimes.co.uk/news/we-found-the-first-australian-evidence-of-a-major-shift-in-earths-magnetic-poles-it-may-help-us-predict-the-next/", "urlToImage": "https://storage.googleapis.com/cdn.australiantimes.co.uk/wp-content/uploads/2021/02/f2cdd30d-australian-evidence.jpg", "publishedAt": "2021-02-16T06:27:00Z", "content": "Agathe Lise-Pronovost, University of Melbourne\r\nAbout 41,000 years ago, something remarkable happened: Earths magnetic field flipped and, for a temporary period, magnetic north was south and magnetic… [+5780 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Birds keep a layer of soft, fluffy down feathers to regulate body temperature - News-Medical.net", "description": "Feathers are a sleek, intricate evolutionary innovation that makes flight possible for birds, but in addition to their stiff, aerodynamic feathers used for flight, birds also keep a layer of soft, fluffy down feathers between their bodies and their outermost …", "url": "https://www.news-medical.net/news/20210215/Birds-keep-a-layer-of-soft-fluffy-down-feathers-to-regulate-body-temperature.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Black_and_White_Sneezy_Cold_Guy_-_Rynio_Productions_d9ab890b0c744a1389d404dd606049d9-620x480.jpg", "publishedAt": "2021-02-16T04:51:00Z", "content": "Feathers are a sleek, intricate evolutionary innovation that makes flight possible for birds, but in addition to their stiff, aerodynamic feathers used for flight, birds also keep a layer of soft, fl… [+5291 chars]"}, {"source": {"id": null, "name": "Uwa.edu.au"}, "author": null, "title": "New technology to improve worlds most sensitive scientific instruments - University News: The University of Western Australia", "description": "A new technology that can improve gravitational-wave detectors has been pioneered by physicists at UWA.", "url": "https://www.uwa.edu.au/news/article/2021/february/new-technology-to-improve-worlds-most-sensitive-scientific-instruments", "urlToImage": "https://www.uwa.edu.au/news/-/media/Project/UWA/UWA/Newsroom/Card-image/2021/Space-telescope-2---944x522.jpg", "publishedAt": "2021-02-16T01:43:49Z", "content": "A new technology that can improve gravitational-wave detectors, one of the most sensitive instruments used by scientific researchers, has been pioneered by physicists at The University of Western Aus… [+3338 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "The Hope Probe Just Sent Back Another Stunning Picture of Mars - Gizmodo Australia", "description": "The United Arab Emirates' Hope probe has successfully arrived at Mars and sent back its first stunning image of the red planet.", "url": "https://www.gizmodo.com.au/2021/02/the-hope-probe-just-sent-back-another-stunning-picture-of-mars/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/16/UAE-Hope-mars.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-16T01:01:00Z", "content": "Mars is having a busy month with three missions scheduled to arrive at the red planet this February. The first of these is the United Arab Emirates’ Hope probe which has sent recently sent back its f… [+2104 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Planet Nine Might Be a Giant Illusion, Scientists Say, And Here's Why - ScienceAlert", "description": "A hypothetical mystery planet thought to be responsible for strange orbits in the outer Solar System just got dealt one of its biggest blows yet.", "url": "https://www.sciencealert.com/new-paper-extreme-solar-system-objects-contain-no-evidence-of-planet-nine", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/planet-nine_1024.jpg", "publishedAt": "2021-02-15T22:16:16Z", "content": "A hypothetical mystery planet thought to be responsible for strange orbits in the outer Solar System just got dealt one of its biggest blows yet.\r\nAccording to a comprehensive analysis of extremely d… [+5128 chars]"}, {"source": {"id": null, "name": "Herald Sun"}, "author": null, "title": "Meteor ‘explodes’ across Victorian skyline - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-15T19:41:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "Melting dusty ice may have carved Martian gullies - Phys.org", "description": "By analyzing the occurrences of exposed dusty ice on Mars using data from NASA's Mars Reconnaissance Orbiter, ASU planetary scientists Aditya Khuller and Philip Christensen have found the lowest latitude detection of dusty water ice on Mars.", "url": "https://phys.org/news/2021-02-dusty-ice-martian-gullies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/meltingdusty.jpg", "publishedAt": "2021-02-15T19:39:08Z", "content": "By analyzing the occurrences of exposed dusty ice on Mars using data from NASA's Mars Reconnaissance Orbiter, ASU planetary scientists Aditya Khuller and Philip Christensen have found the lowest lati… [+3718 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Astronomers confirm most distant object in our solar system, which takes 1,000 years to go round the sun - Yahoo News Australia", "description": "A 250-mile wide object lurking at the edge of our solar system, 132 times further from the sun than Earth is the most distant object found so far in our...", "url": "https://au.news.yahoo.com/distant-solar-system-farfarout-173432533.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/97e74f80-6fb3-11eb-b57f-4605c96289a6", "publishedAt": "2021-02-15T17:39:29Z", "content": "Watch: The furthest object in the solar system has just been confirmed and its FarFarOut there\r\nA 250-mile wide object lurking 132 times further from the sun than Earth is the most distant object fou… [+3241 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Kagome graphene promises exciting properties - EurekAlert", "description": "Rémy Pawlak shows how Kagome graphene is produced and what is so special about it.", "url": "https://www.eurekalert.org/pub_releases/2021-02/sniu-kgp021521.php", "urlToImage": "https://eurekalert.org/multimedia_ml/pub/web/13934_web.jpg", "publishedAt": "2021-02-15T08:03:45Z", "content": "For the first time, physicists from the University of Basel have produced a graphene compound consisting of carbon atoms and a small number of nitrogen atoms in a regular grid of hexagons and triangl… [+3992 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Light used to detect quantum information stored in 100000 nuclear quantum bits - Science Codex", "description": null, "url": "https://www.sciencecodex.com/light-used-detect-quantum-information-stored-100000-nuclear-quantum-bits-666959", "urlToImage": null, "publishedAt": "2021-02-15T05:00:00Z", "content": "Researchers have found a way to use light and a single electron to communicate with a cloud of quantum bits and sense their behaviour, making it possible to detect a single quantum bit in a dense clo… [+4647 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": null, "title": "Russia to Carry Out Over 10 Space Launches From Baikonur Cosmodrome in 2021 - Sputnik International", "description": "MOSCOW, February 15 (Sputnik) - Russia is going to carry out more than 10 launches of Soyuz-2 carrier rockets from the Baikonur cosmodrome this year, Ruslan...", "url": "https://sputniknews.com/russia/202102151082079348-russia-to-carry-out-over-10-space-launches-from-baikonur-cosmodrome-in-2021/", "urlToImage": "https://cdn2.img.sputniknews.com/images/07e5/02/0f/1082079737.jpg", "publishedAt": "2021-02-15T04:39:00Z", "content": null}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "We found the first Australian evidence of a major shift in Earth's magnetic poles. It may help us predict the next - MENAFN.COM", "description": "About 41,000 years ago, something remarkable happened: Earth's magnetic field flipped and, for a temporary period, magnetic north was south and magnetic south was north. </p>\n<p>Palaeomagnetists refer to this as a geomagnetic excursion. This event, which is d…", "url": "https://menafn.com/1101601210/We-found-the-first-Australian-evidence-of-a-major-shift-in-Earths-magnetic-poles-It-may-help-us-predict-the-next", "urlToImage": "https://menafn.com/updates/pr/2021-02/14/TC_c54dfa8f-cimage_story.jpg", "publishedAt": "2021-02-15T04:30:51Z", "content": "Author: \r\nAgathe Lise-Pronovost \r\n(MENAFN - The Conversation) About 41,000 years ago, something remarkable happened: Earth's magnetic field flipped and, for a temporary period, magnetic north was sou… [+6253 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Alex Chapman", "title": "Space news: NASA monitors 2001 FO32 asteroid tracking towards Earth - 7NEWS.com.au", "description": "The asteroid has been described as 'potentially dangerous’ by NASA.", "url": "https://7news.com.au/technology/space/asteroid-the-size-of-the-golden-gate-bridge-hurtling-towards-earth-c-2146978", "urlToImage": "https://images.7news.com.au/publication/C-2146978/59ef04ddbe2bf01b709b8617e77dd0c41028fb22-16x9-x0y0w4850h2728.jpg?imwidth=1024", "publishedAt": "2021-02-12T22:55:41Z", "content": "An asteroid the size of Californias famous Golden Gate Bridge is hurtling towards Earth and will make a close pass next month.\r\nThe space rock, officially called 231937 (2001 FO32), will come within … [+812 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Mars Hope Probe success strengthens UAE-Japan partnership - Arab News", "description": "TOKYO: Japan’s Foreign Minister MOTEGI Toshimitsu praised the successful arrival of the UAE’s Hope Probe to Mars and its entry into orbit. Motegi also extended Japan’s congratulations to the UAE for this achievement, and pledged continued strategic bilateral …", "url": "https://www.arabnews.com/node/1808041", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/12/2470666-1735982505.jpg", "publishedAt": "2021-02-12T08:41:15Z", "content": "TOKYO: Japans Foreign Minister MOTEGI Toshimitsu praised the successful arrival of the UAEs Hope Probe to Mars and its entry into orbit. Motegi also extended Japans congratulations to the UAE for thi… [+1863 chars]"}, {"source": {"id": null, "name": "eTurboNews | Trends | Travel News"}, "author": null, "title": "SpaceX Starship explosion puts brakes on space tourism Read more Skip - Buzz.travel | eTurboNews | Travel News", "description": "The Mark I prototype of SpaceX’s Starship launch vehicle exploded during a test on Wednesday. The explosion blew off part of the bulkhead which went | eTurboNews | Trends | Travel News Online | Travel Safety & Emergencies", "url": "https://eturbonews.com/448124/spacex-starship-explosion-puts-brakes-on-space-tourism/", "urlToImage": "https://eturbonews.com/wp-content/uploads/2019/11/0a1a-214.jpg", "publishedAt": "2020-12-30T03:14:15Z", "content": "The Mark I prototype of SpaceXs Starship launch vehicle exploded during a test on Wednesday. The explosion blew off part of the bulkhead which went flying as video from the scene shows.\r\nIn what the … [+972 chars]"}, {"source": {"id": null, "name": "Hit 107"}, "author": "The Hit Network Team", "title": "A Once In A Lifetime 'Christmas Star' Is About To Happen So Grab Your Binoculars! - Hit 107", "description": "Just a mere four days before Christmas, the sky will be lit up by what astronomers are calling a 'Christmas Star'.", "url": "https://www.hit.com.au/story/a-once-in-a-lifetime-christmas-star-is-about-to-happen-so-grab-your-binoculars-166088", "urlToImage": "https://cdn-img.scalabs.com.au/FAEQdyYUx1qxZzgp4ASNNCPQkCSCsG8p2CVgw3Qlf6I/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvNTg2MjUvc3Rh/cnMtZWRpdC5qcGc_/cHJlc2V0PW1ycHJl/dmFydGljbGU", "publishedAt": "2020-12-10T23:54:16Z", "content": "This could quite literally be THE biblical 'star' the three wise men saw way back when Jesus was about to be born! \r\nJust a mere four days before Christmas, the sky will be lit up by what astronomers… [+1501 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "SpaceX's Starship prototype explodes on landing after test launch - Arab News", "description": "WASHINGTON: SpaceX’s Starship prototype exploded while attempting to land on Wednesday after an otherwise successful test launch from the company’s rocket facility in Boca Chica, Texas, live video of the flight showed. The Starship rocket destroyed in the acc…", "url": "https://www.arabnews.com/node/1775086", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/12/10/2379351-1276717104.jpg", "publishedAt": "2020-12-10T05:28:11Z", "content": "DUBAI: With their few hurriedly packed belongings wrapped tightly in fabric, entire families, many with young children, are traversing vast distances on foot these days to escape fighting in northern… [+7552 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Japan's capsule with asteroid samples retrieved in Australia - Arab News", "description": "TOKYO: Japan’s space agency said its helicopter search team on Sunday retrieved a capsule carrying asteroid samples after it successfully landed in a remote area in southern Australia as planned. The spacecraft Hayabusa2 released the small capsule on Saturday…", "url": "https://www.arabnews.com/node/1773126", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/12/06/2374406-328530570.jpg", "publishedAt": "2020-12-06T02:54:57Z", "content": "LONDON: A new coronavirus variant has been detected in the UK, with scientists warning that a surge in new testing is crucial to prevent its spread.\r\nThe B1525 variant contains an alarming set of new… [+2057 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "AFP", "title": "Pair of NASA studies confirm water on the Moon - Prothom Alo English", "description": "The Moon was believed to be bone dry until around a decade ago, when a series of findings suggested that our nearest celestial neighbour had traces of water ice in permanently-shadowed craters at its polar regions.", "url": "https://en.prothomalo.com/science-technology/science/pair-of-nasa-studies-confirm-water-on-the-moon", "urlToImage": "https://images.prothomalo.com/prothomalo-english%2F2020-10%2F1457e617-85c6-4993-a532-3cf26fc4baf7%2F048819_01_04.jpg?rect=204%2C0%2C1173%2C616&overlay=&overlay_position=bottom&overlay_opacity=1&w=1200&h=627&auto=format%2Ccompress&ogImage=true&overlay_width_pct=1", "publishedAt": "2020-10-27T08:32:18Z", "content": "\"If you were standing on the Moon near one of the poles, you would see a whole 'galaxy' of little shadows speckled across the surface,\" said lead author Paul Hayne of the Department of Astrophysics a… [+762 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "NASA astronauts splash down after journey home aboard SpaceX capsule - Arab News", "description": "US astronauts Bob Behnken and Doug Hurley, who flew to the International Space Station in SpaceX’s new Crew Dragon, splashed down in the capsule in the Gulf of Mexico on Sunday after a two-month voyage that was NASA’s first crewed mission from home soil in ni…", "url": "https://www.arabnews.com/node/1713666", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/08/02/2213181-1272834477.jpg", "publishedAt": "2020-08-02T19:21:08Z", "content": null}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Vaneeza Rupani attends Launch of Perseverance and Ingenuity Spacecraft to Mars - UPI.com", "description": "Teenager, Vaneeza Rupani is on hand to attend the launch of the Mars 2020 Rover and Mars Helicopter at the Kennedy Space Center, Florida on Tuesday, July 28, 2020. Veneeza named the Drone \"Ingenuity\". The spacecraft is destined for Mars and is planned to arri…", "url": "https://www.upi.com/News_Photos/view/upi/b6b73a012beaacb2512db31ba722e054/Vaneeza-Rupani-attends-Launch-of-Perseverance-and-Ingenuity-Spacecraft-to-Mars/", "urlToImage": "https://cdnph.upi.com/pv/upi/b6b73a012beaacb2512db31ba722e054/NASA-ULA-LAUNCH-TO-MARS.jpg", "publishedAt": "2020-07-28T19:09:45Z", "content": "Teenager, Vaneeza Rupani is on hand to attend the launch of the Mars 2020 Rover and Mars Helicopter at the Kennedy Space Center, Florida on Tuesday, July 28, 2020. Veneeza named the Drone \"Ingenuity\"… [+121 chars]"}, {"source": {"id": null, "name": "Hit 107"}, "author": "Hit News Team", "title": "A Pink Super Moon Will Cover Australia Tonight! - Hit 107", "description": "We may be confined to our homes right now, but you know what is still here to amaze us: the night’s sky!", "url": "https://www.hit.com.au/story/a-pink-super-moon-will-cover-australia-this-april-152954", "urlToImage": "https://cdn-img.scalabs.com.au/2WCevWsT5QzTGyNQdK5YiSsxyUN7wg6r4xmmgDCNV9g/aHR0cHM6Ly9zdy1o/aXQtcHJkLnNjYWRp/Z2l0YWwuaW8vbWVk/aWEvMzc2MTkvYmxv/b2QtbW9vbi1waXhh/YmF5LmpwZz9wcmVz/ZXQ9bXJwcmV2YXJ0/aWNsZQ", "publishedAt": "2020-04-03T05:48:52Z", "content": "We may be confined to our homes right now, but you know what is still here to amaze us: the nights sky!\r\nLucky for us, this April 8th marks the phenomenon of a Pink Super Moon!\r\nThe moon will classif… [+1170 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Japanese spacecraft touches down on asteroid to get samples - Arab News", "description": "TOKYO: A Japanese spacecraft touched down on a distant asteroid Friday on a mission to collect material that could provide clues to the origin of the solar system and life on Earth. Workers at the Japan Aerospace Exploration Agency (JAXA) control center appla…", "url": "https://www.arabnews.com/node/1456166", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/02/22/1468826-1404023075.jpg", "publishedAt": "2019-08-27T04:50:35Z", "content": "DUBAI: With their few hurriedly packed belongings wrapped tightly in fabric, entire families, many with young children, are traversing vast distances on foot these days to escape fighting in northern… [+7552 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Fossil 'mother lode' records Earth-shaking asteroid's impact: study - Arab News", "description": "WASHINGTON: Scientists in the US say they have discovered the fossilized remains of a mass of creatures that died minutes after a huge asteroid slammed into the Earth 66 million years ago, sealing the fate of the dinosaurs. In a paper to be published Monday, …", "url": "https://www.arabnews.com/node/1475711", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/04/01/1515891-109345324.jpg", "publishedAt": "2019-08-26T19:58:33Z", "content": "DUBAI: A cleric from the Iranian city of Qom, known for his historic vitriol against Western medicine, has posted on social media against interacting with people who receive the coronavirus vaccine, … [+1598 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Trump says NASA should stop talking about going back to the Moon - Arab News", "description": "WASHINGTON: US President Donald Trump tweeted on Friday that NASA should stop talking about going back to the Moon, which caused confusion since his administration aims to restart Moon landings by 2024. “For all the money we are spending, NASA should NOT be t…", "url": "https://www.arabnews.com/node/1507781", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/06/08/1614336-937970345.jpg", "publishedAt": "2019-08-26T16:06:14Z", "content": "ROME: Top Italian Catholic clergy and politicians have been paying tribute to the imam of the city of Perugia, who died aged 72 from COVID-19.\r\nAbdel Qader Mohamad, a retired medical doctor who had l… [+1403 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "First plants on moon, China says it has done the job - Hindustan Times", "description": "Pictures sent back January 12 showed plant shoots growing well nine days after the experiment was initiated, Chongqing University, which led the biological project, said in a briefing .", "url": "https://www.hindustantimes.com/world-news/china-says-it-has-grown-the-first-plants-on-the-moon/story-zcLzR3BdZ3MXlZW1LK06wL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2019/01/16/Pictures/_3418370c-194e-11e9-b6e9-9c4bb39de67f.png", "publishedAt": "2019-01-16T05:16:36Z", "content": "Chinese scientists say they have grown the first plants on the moon as part of the countrys lunar mission.\r\nPictures sent back Jan. 12 showed plant shoots growing well nine days after the experiment … [+1428 chars]"}]}