{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jonathan Amos - BBC Science Correspondent", "title": "Winchcombe meteorite is first UK find in 30 years - Yahoo News Australia", "description": "Fragments are recovered from the blazing fireball that lit up the sky above England last month.", "url": "https://news.yahoo.com/winchcombe-meteorite-first-uk-30-235835346.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/IQ4hk64tph3qwt3_gcqhRw--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/b504864c0c3812f18c80fdaaa56aa182", "publishedAt": "2021-03-09T00:12:17Z", "content": "The Winchcombe fragments total in excess of 300g\r\nSeveral rocky fragments have been recovered from the fireball that lit up the sky above southern England just over a week ago.\r\nThey came down in the… [+4751 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "CNN", "title": "Most distant cosmic jet discovered 13 billion light-years away - 9News", "description": "<p>It has taken 13 billion years for the light from the powerful jets of a distant object to reach us.</p>", "url": "https://www.9news.com.au/world/most-distant-cosmic-jet-discovered-13-billion-lightyears-away/ca62de67-0d67-4a46-985c-69d4960bc6ba", "urlToImage": "https://imageresizer.static9.net.au/rtmJ3GnztCQTTmUW2YhQmtMsQ74=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F1648906f-3788-4d30-a733-5efbbf712a10", "publishedAt": "2021-03-08T23:29:13Z", "content": null}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Cleanup Costs at the Damaged Arecibo Observatory Could Reach $US50 ($65) Million - Gizmodo Australia", "description": "A new estimate suggests it’ll cost somewhere between $US30 ($39) million and $US50 ($65) million to clean up the mess created by the collapse of the iconic Arecibo Observatory dish late last year, according to an NSF report detailing the aftermath of the disa…", "url": "https://www.gizmodo.com.au/2021/03/cleanup-costs-at-the-damaged-arecibo-observatory-could-reach-us50-65-million/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/09/pll8qremmzbzznhssoyh-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-08T21:55:00Z", "content": "A new estimate suggests itll cost somewhere between $US30 ($39) million and $US50 ($65) million to clean up the mess created by the collapse of the iconic Arecibo Observatory dish late last year, acc… [+5803 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Issam AHMED", "title": "Neanderthals disappeared from Europe earlier than thought, says study - Yahoo News Australia", "description": "Neanderthal fossils from a cave in Belgium believed to belong to the last survivors of their species ever discovered in Europe are thousands of years older...", "url": "https://au.news.yahoo.com/neanderthals-disappeared-europe-earlier-thought-205450084.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.Evm6ObqsiAX.8jP3qiXvQ--~B/aD01MTI7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.au/b8790854100940e671fde75323772808", "publishedAt": "2021-03-08T21:14:59Z", "content": "Neanderthal fossils from a cave in Belgium believed to belong to the last survivors of their species ever discovered in Europe are thousands of years older than once thought, a new study said Monday.… [+3037 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Hubble Space Telescope in safe mode after software glitch - Space.com", "description": "The iconic telescope is safe and stable, NASA says.", "url": "https://www.space.com/hubble-space-telescope-safe-mode-march-2021", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ToSnvdPZKkG3qvgAuibrQ-1200-80.jpg", "publishedAt": "2021-03-08T20:40:33Z", "content": "NASA's Hubble Space Telescope\r\n is taking an unexpected break.\r\nThe iconic observatory went into a protective \"safe mode\" early Sunday morning (March 7), but its handlers seem confident it will bounc… [+2145 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "We Have a Chance to Keep the Tropics Habitable - Gizmodo Australia", "description": "If we can hit the most aggressive targets set by the Paris Agreement, we could stave off the worst health impacts for people living in one of the most climate-vulnerable areas on Earth. A study published Monday in Nature Geoscience projects that the tropics w…", "url": "https://www.gizmodo.com.au/2021/03/we-have-a-chance-to-keep-the-tropics-habitable/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/09/xcm3fasm2ez5mx4tsbnk-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-08T20:30:00Z", "content": "If we can hit the most aggressive targets set by the Paris Agreement, we could stave off the worst health impacts for people living in one of the most climate-vulnerable areas on Earth. A study publi… [+4155 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Pompeii of prehistoric plants' unlocks evolutionary secret: study - Phys.org", "description": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominate so much of the Earth today.", "url": "https://phys.org/news/2021-03-pompeii-prehistoric-evolutionary-secret.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/60462a8c7fae7.jpg", "publishedAt": "2021-03-08T20:00:03Z", "content": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominat… [+3813 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Tegan Taylor", "title": "Microplastics in seafood are most likely to come via oysters, mussels and shellfish. But how much of a health risk do they pose? - ABC News", "description": "Researchers have identified the seafoods that are most likely to contribute microplastics to the Australian diet — but we still don't know what effect, if any, the tiny particles have on human health.", "url": "https://www.abc.net.au/news/health/2021-03-09/microplastics-in-seafood-what-is-the-health-risk/13202958", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/3bbf7fdf6054a87c34fa22248d21c45c?impolicy=wcms_crop_resize&cropH=1689&cropW=3000&xPos=0&yPos=308&width=862&height=485", "publishedAt": "2021-03-08T19:00:00Z", "content": "Perhaps you've seen headlines saying we consume a credit card's worth of microplastics a week, or that microplastics have been found in our poo.\r\nNow a new research paper has tried to identify the se… [+4031 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Linda Geddes", "title": "Brain activity data may improve stock market forecasts, study shows - The Guardian", "description": "US research suggests scans offer better price predictions than the actual choices investors make", "url": "https://www.theguardian.com/science/2021/mar/08/brain-activity-data-may-improve-stock-market-forecasts-study-shows", "urlToImage": "https://i.guim.co.uk/img/media/6b7ade14fc7a1e7ccd95a3a8fae3974a7b2f8523/0_90_6960_4176/master/6960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eb5f3020afedad2d2c21395065c97732", "publishedAt": "2021-03-08T18:02:00Z", "content": "From never trading during the first 30 minutes, to not returning to a stock for a third time, financial investors have a stack of superstitions for predicting stock price changes. Now neuroscientists… [+2852 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Establishing the origin of solar-mass black holes and the connection to dark matter - Science Daily", "description": "What is the origin of black holes and how is that question connected with another mystery, the nature of dark matter? Dark matter comprises the majority of matter in the Universe, but its nature remains unknown.", "url": "https://www.sciencedaily.com/releases/2021/03/210308111925.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-08T18:01:46Z", "content": "What is the origin of black holes and how is that question connected with another mystery, the nature of dark matter? Dark matter comprises the majority of matter in the Universe, but its nature rema… [+3476 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Aniel Strain", "title": "A giant, sizzling planet may be orbiting the star Vega - Phys.org", "description": "Astronomers have discovered new hints of a giant, scorching-hot planet orbiting Vega, one of the brightest stars in the night sky.", "url": "https://phys.org/news/2021-03-giant-sizzling-planet-orbiting-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/agiantsizzli.jpg", "publishedAt": "2021-03-08T17:58:38Z", "content": "Astronomers have discovered new hints of a giant, scorching-hot planet orbiting Vega, one of the brightest stars in the night sky.\r\nThe research, published this month in The Astrophysical Journal, wa… [+4721 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Atmospheric drying will lead to lower crop yields, shorter trees across the globe - Phys.org", "description": "A global observation of an ongoing atmospheric drying—known by scientists as a rise in vapor pressure deficit—has been observed worldwide since the early 2000s. In recent years, this concerning phenomenon has been on the rise, and is predicted to amplify even…", "url": "https://phys.org/news/2021-03-atmospheric-crop-yields-shorter-trees.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/atmosphericd.jpg", "publishedAt": "2021-03-08T17:51:07Z", "content": "A global observation of an ongoing atmospheric dryingknown by scientists as a rise in vapor pressure deficithas been observed worldwide since the early 2000s. In recent years, this concerning phenome… [+4494 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Former NASA Leader Says SpaceX Should Build NASA's Moon Rocket - Futurism", "description": "\"I would not have recommended the government build a $27 billion rocket.\"", "url": "https://futurism.com/former-nasa-spacex-should-build-nasas-moon-rocket", "urlToImage": "https://wp-assets.futurism.com/2021/03/former-nasa-spacex-should-build-nasas-moon-rocket.jpg", "publishedAt": "2021-03-08T17:19:02Z", "content": "Former NASA deputy administrator Lori Garver believes that the agencys extremely expensive and overdue Space Launch System (SLS), the rocket meant to return American astronauts to the surface of the … [+3895 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "NASA is Considering a Radio Telescope on the Far Side of the Moon - Universe Today", "description": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView, would harvest building materials from the Lunar surface its…", "url": "https://www.universetoday.com/150417/nasa-is-considering-a-radio-telescope-on-the-far-side-of-the-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/lunar_deposition_rover_light_lr_.jpg", "publishedAt": "2021-03-08T16:52:00Z", "content": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView,… [+7405 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Someone to watch over AI and keep it honest - and it's not the public! - Newswise", "description": "The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI a", "url": "https://www.newswise.com/articles/someone-to-watch-over-ai-and-keep-it-honest-and-it-s-not-the-public", "urlToImage": "https://www.newswise.com/images/new-newswise-logo-square.jpg", "publishedAt": "2021-03-08T16:40:00Z", "content": "Newswise — The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI and has the authority to mete… [+2953 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Hailey Summers, Jason Quinn", "title": "Growing cannabis indoors produces a lot of greenhouse gases – just how much depends on where it's grown - The Conversation US", "description": "Growing weed indoors is not an environmentally friendly process. Climate controls create a lot of greenhouse gas emissions, and where the pot is produced has a huge influence on emission levels.", "url": "https://theconversation.com/growing-cannabis-indoors-produces-a-lot-of-greenhouse-gases-just-how-much-depends-on-where-its-grown-156486", "urlToImage": "https://images.theconversation.com/files/387982/original/file-20210305-13-c99s0z.jpg?ixlib=rb-1.1.0&rect=0%2C179%2C2982%2C1491&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-03-08T16:35:38Z", "content": "The Research Brief is a short take about interesting academic work.\r\nThe big idea\r\nIndoor cannabis production is a major source of greenhouse gas emissions, and the environmental effects vary signifi… [+3637 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "These Slugs Cut Off Their Own Heads When They Want a New Body - Gizmodo Australia", "description": "Looking like opened pea pods with a lustrous sheen, the sea slugs Elysia cf. marginata and Elysia atroviridis aren’t your average gastropods. First off, they’re members of sacoglossa, a clade of slugs known for taking the algae from marine plants and integrat…", "url": "https://www.gizmodo.com.au/2021/03/these-slugs-cut-off-their-own-heads-when-they-want-a-new-body/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/09/szdebgtgu0hp79p5odxb-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-08T16:00:00Z", "content": "Looking like opened pea pods with a lustrous sheen, the sea slugs Elysia cf. marginata and Elysia atroviridis arent your average gastropods. First off, theyre members of sacoglossa, a clade of slugs … [+4916 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Research shows we're surprisingly similar to Earth's first animals - EurekAlert", "description": "The earliest multicellular organisms may have lacked heads, legs, or arms, but pieces of them remain inside of us today, new research shows. According to a UC Riverside study, 555-million-year-old oceanic creatures from the Ediacaran period share genes with t…", "url": "https://www.eurekalert.org/pub_releases/2021-03/uoc--rsw030821.php", "urlToImage": "https://eurekalert.org/multimedia/pub/web/258403_web.jpg", "publishedAt": "2021-03-08T15:19:54Z", "content": "IMAGE: Recreation of Ediacaran sealife displayed at the Smithsonian Institution.\r\n view more \r\nCredit: Ryan Somma\r\nThe earliest multicellular organisms may have lacked heads, legs, or arms, but piece… [+3431 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why slow-pouring coffee makes a tower of liquid in your cup - Phys.org", "description": "When a droplet of coffee hits the liquid surface in the cup, a characteristic tower of coffee forms for a very short time, sometimes even with a new droplet on top. In a paper that appeared in Physical Review Fluids today, a team of researchers from Amsterdam…", "url": "https://phys.org/news/2021-03-slow-pouring-coffee-tower-liquid-cup.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/coffee.jpg", "publishedAt": "2021-03-08T14:38:48Z", "content": "When a droplet of coffee hits the liquid surface in the cup, a characteristic tower of coffee forms for a very short time, sometimes even with a new droplet on top. In a paper that appeared in Physic… [+3912 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Insights on how night shift work increases cancer risk - Science Daily", "description": "A recent study offers new clues as to why night shift workers are at increased risk of developing certain types of cancer compared to those who work regular daytime hours. Findings suggest that night shifts disrupt natural 24-hour rhythms in the activity of c…", "url": "https://www.sciencedaily.com/releases/2021/03/210308091744.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-08T14:31:59Z", "content": "New clues as to why night shift workers are at increased risk of developing certain types of cancer are presented in a new study conducted at Washington State University Health Sciences Spokane.Publi… [+6032 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earth has a hidden layer, and no one knows exactly what it is - Livescience.com", "description": "", "url": "https://www.livescience.com/new-earth-layer-solid-inner-core.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uHtqwrQcroA2RGYBdNwUfQ-1200-80.jpg", "publishedAt": "2021-03-08T13:49:51Z", "content": "Earth\r\n might have more layers than scientists thought.\r\nNew research finds that there may be a hidden layer inside the Earth's solid inner core an inner-inner core, if you will. The precise nature o… [+3974 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Isabelle Osterholt", "title": "Research illuminates embryonic stem cell fate - Phys.org", "description": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight into stem cell pluripotency and evolutionary developmental b…", "url": "https://phys.org/news/2021-03-illuminates-embryonic-stem-cell-fate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/chickeneggs.jpg", "publishedAt": "2021-03-08T13:48:23Z", "content": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight … [+3978 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Katy Evans", "title": "China's Tianwen-1 Sends Back First Incredible High-Res Images Of Mars - IFLScience", "description": "China’s Tianwen-1 spacecraft currently orbiting Mars has sent back its first high definition images of the Red Planet and they are incredible. There really", "url": "https://www.iflscience.com/space/chinas-tianwen1-sends-back-first-incredible-highres-images-of-mars/", "urlToImage": "https://cdn.iflscience.com/images/a9ea77dd-7bd3-59b7-bfcd-007dfc8f4f2e/default-1615201113-cover-image.jpg", "publishedAt": "2021-03-08T12:58:00Z", "content": "Chinas Tianwen-1 spacecraft currently orbiting Mars has sent back its first high definition images of the Red Planet and they are incredible. There really is no such thing as too much Mars.\r\nIn early… [+2893 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/saqib-shah", "title": "Comets may have seeded Earth with life-supporting carbon - Engadget", "description": "A snapshot of a comet carrying carbon as it zipped past Earth in 2016 is helping NASA learn more about the origins of life.", "url": "https://www.engadget.com/comets-may-have-seeded-earth-with-life-supporting-carbon-120129729.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/kbmvChzIPRqkSzFjBOP06w--~B/aD0xOTM0O3c9MzM3MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2021-03/5e3aef70-8003-11eb-8e8b-9fba022eb3bb.cf.jpg", "publishedAt": "2021-03-08T12:02:48Z", "content": "NASA's airborne telescope has made another major discovery just months after it confirmed the presence of water on the Moon's sunlit surfaces. SOFIA's latest find relates to the essence left by an ic… [+2546 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ellie Harrison", "title": "Harry and Meghan: Jada Pinkett Smith and Gabrielle Union among celebrities to react after Oprah interview - The Independent", "description": "Many stars defended the couple on social media", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/harry-meghan-oprah-interview-celebrity-reactions-b1813871.html", "urlToImage": "https://static.independent.co.uk/2021/03/08/08/meghan%20harry_.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-03-08T11:36:39Z", "content": "Gabrielle Union and Jada Pinkett Smith are among the celebrities who have reacted to Prince Harry and Meghan Markles interview with Oprah Winfrey.\r\nThe TV event, which aired in the US on CBS on Sunda… [+2113 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "Scientists Say: Egg and sperm - Science News for Students", "description": "An egg or a sperm cell contains half of the normal genes an organism needs. They fuse together to form a new individual.", "url": "https://www.sciencenewsforstudents.org/article/scientists-say-egg-and-sperm", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2021/03/1030_SS_egg_and_sperm_feat.jpg", "publishedAt": "2021-03-08T11:30:00Z", "content": "algae: Single-celled organisms, once considered plants (they arent). As aquatic organisms, they grow in water. Like green plants, they depend on sunlight to make their food.\r\nbirds: Warm-blooded anim… [+5009 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Sakshat Kolhatkar", "title": "Scientists at CARMENES discover Super Earth Gliese 486 b, 26 light years away from Earth - Republic TV", "description": "Scientists have discovered a new planet called Gliese 486 b which is being considered a super Earth-like planet. Scientists are excited about this finding.", "url": "https://www.republicworld.com/technology-news/science/scientists-at-carmenes-discover-super-earth-gliese-486-b-26-light-years-away-from-earth.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ryc7iie30urnwtvl_1615190511.jpeg?tr=f-jpeg", "publishedAt": "2021-03-08T10:18:00Z", "content": "Scientists have just discovered a giant super Earth-like planet at a distance of 26 light-years away from the Earth. Scientists feel this newly discovered planet will help them study the atmospheric … [+2523 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Stephanie Condon", "title": "Nvidia, Harvard researchers use AI to find active areas in cell DNA - ZDNet", "description": "Using a new deep learning toolkit called AtacWorks, researchers are studying how diseases and genomic variation influence specific types of cells in the human body.", "url": "https://www.zdnet.com/article/nvidia-harvard-researchers-use-ai-to-find-active-areas-in-cell-dna/", "urlToImage": "https://www.zdnet.com/a/hub/i/r/2021/03/08/0e0d1f1c-d00c-4ad2-a2d0-7dd775d328e3/thumbnail/770x578/4885ae54856c543c49e964dc43a8f311/embargo-atacworks-image.png", "publishedAt": "2021-03-08T10:00:03Z", "content": "Researchers from Nvidia and Harvard are publishing research this week on a new way they've applied deep learning to epigenomics  -- the study of modifications on the genetic material of a cell.  \r\nUs… [+3468 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Pip Christmass", "title": "International Space Station: How to view as it flies over east coast of Australia - 7NEWS.com.au", "description": "Over the next two nights, stargazers have an opportunity to get a clear view of the space station.", "url": "https://7news.com.au/technology/space/international-space-station-how-to-view-as-it-flies-over-east-coast-of-australia-c-2309844", "urlToImage": "https://images.7news.com.au/publication/C-2309844/c9ea9594826044f6f81b819514e9e92ca4066f83-16x9-x0y452w4827h2715.jpg?imwidth=1024", "publishedAt": "2021-03-08T06:52:54Z", "content": "The International Space Station (ISS) will be passing over the skies of Australia over the next two nights.\r\nSo where and when is the best time to see it where you live?\r\nOn Monday night, sky gazers … [+1702 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals physical phenomena relied by oocytes to grow big - News-Medical.net", "description": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.", "url": "https://www.news-medical.net/news/20210308/Study-reveals-physical-phenomena-relied-by-oocytes-to-grow-big.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_of_sperms_and_an_egg_cell-Sebastian_Kaulitzki-2000_61f390311d3c4b1abeec7aceca5ab548-620x480.jpg", "publishedAt": "2021-03-08T05:39:00Z", "content": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.\r\nThere's a reason … [+6401 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We've Found The Best Time And Place to Live in The Milky Way... And It's Not Here - ScienceAlert", "description": "More and more, it seems that the existence and persistence of life on Earth is the result of sheer luck. According to a new analysis of the history of the Milky Way, the best time and place for the emergence of life isn't here, or now, but over 6 bil", "url": "https://www.sciencealert.com/when-was-the-best-time-and-place-to-live-in-the-milky-way-not-where-we-are-apparently", "urlToImage": "https://www.sciencealert.com/images/2021-03/processed/milky-way-bulge_1024.jpg", "publishedAt": "2021-03-08T05:19:44Z", "content": "More and more, it seems that the existence and persistence of life on Earth is the result of sheer luck. According to a new analysis of the history of the Milky Way, the best time and place for the e… [+5280 chars]"}, {"source": {"id": null, "name": "Shepherdgazette.com"}, "author": null, "title": "First Proof of Tectonic Exercise on an Exoplanet - The Shepherd of the Hills Gazette", "description": "This artist’s illustration represents the possible interior dynamics of the super-Earth exoplanet LHS 3844b. The planet’s interior properties and the", "url": "https://shepherdgazette.com/first-proof-of-tectonic-exercise-on-an-exoplanet/", "urlToImage": "https://shepherdgazette.com/wp-content/uploads/2021/03/lhs-3844b-an-exoplanet-with-hemispheric-tectonics-720x720.jpg", "publishedAt": "2021-03-08T02:18:41Z", "content": "This artists illustration represents the possible interior dynamics of the super-Earth exoplanet LHS 3844b. The planets interior properties and the strong stellar irradiation might lead to a hemisphe… [+2974 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Atom and a Clever Trick Reveals the Long-Kept Secrets of the Solar System - SciTechDaily", "description": "Using the extinct niobium-​92 atom, ETH researchers have been able to date events in the early solar system with greater precision than before. The study concludes that supernova explosions must have taken place in the birth environment of our sun. If an atom…", "url": "https://scitechdaily.com/extinct-atom-and-a-clever-trick-reveals-the-long-kept-secrets-of-the-solar-system/", "urlToImage": "https://scitechdaily.com/images/Unstable-Atom-92Nb.jpg", "publishedAt": "2021-03-08T00:42:33Z", "content": "The unstable atom 92Nb, which has long since disappeared, provides information about the beginnings of our solar system. Credit: Makiko K. Haba\r\nUsing the extinct niobium-​92 atom, ETH researchers ha… [+3528 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Bill Whitaker", "title": "NASA's new race to put a woman on the moon - 60 Minutes - CBS News", "description": "Nearly a half-century after the last Apollo astronaut stepped foot on the moon, NASA is working to send its first woman to the lunar surface. Bill Whitaker reports.", "url": "https://www.cbsnews.com/news/moon-nasa-efforts-return-60-minutes-2021-03-07/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/03/07/5736a0be-0854-4523-9a34-5cf0f495b7fb/thumbnail/1200x630/7babe070bd258e82106c815d6c09fa9e/moonarticle.jpg", "publishedAt": "2021-03-07T23:59:00Z", "content": "Twelve American men have walked on the moon. The last Apollo astronaut left his footprint there in December 1972. Now, a half-century later, NASA is planning to send people back to the moon. The new … [+11266 chars]"}, {"source": {"id": null, "name": "Theburnin.com"}, "author": null, "title": "Rapid 3D printing method could be key to making organs | The Burn-In - The Burn-In", "description": "Researchers from the University of Buffalo have developed a new rapid 3D printing method that could be the key to making human organs.", "url": "https://www.theburnin.com/technology/rapid-3d-printing-method-organs-2021-03-07/", "urlToImage": "https://www.theburnin.com/wp-content/uploads/2021/03/rsz_istock-1038989298-1.jpg", "publishedAt": "2021-03-07T23:57:50Z", "content": "Over the years, 3D printing has found more and more real-world uses across a variety of industries. Although it is most commonly used to print rigid, non-changing parts and structures, researchers be… [+3328 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Brittany Vincent", "title": "NASA's Perseverance Rover Makes Its First Martian Moves (News ) - PCMag AU", "description": "The car-sized rover moved a total of 21 feet across the surface of Mars as part of a mobility test.", "url": "https://au.pcmag.com/news/85977/nasas-perseverance-rover-makes-its-first-martian-moves", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/n/nasas-pers/nasas-perseverance-rover-makes-its-first-martian-moves_44dm.1200.jpg", "publishedAt": "2021-03-07T22:18:21Z", "content": "(Image: NASA)\r\nNASA's Perseverance rover officially landed on Mars in February. Now that it's there, it's been taking some time to explore.\r\nOn March 4, NASA reported that the car-sized rover began m… [+1321 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "https://www.facebook.com/profile.php?id=100022982110913", "title": "TWIRL 3: Rocket Lab to attempt launch of delayed mission - Neowin", "description": "There are four planned rocket launches this week, two from SpaceX, one from Rocket Lab, and another from the Chinese National Space Administration. Rocket Lab's mission was delayed from last week.", "url": "https://www.neowin.net/news/twirl-3-rocket-lab-to-attempt-launch-of-delayed-mission/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2021/03/1615147213_1613946023_special_rocket_story.jpg", "publishedAt": "2021-03-07T20:16:02Z", "content": "Last week was quite good for SpaceX with it almost successfully landing its Starship rocket during a test, unfortunately, it caught fire and exploded on the pad. Rocket Lab also had to delay its “The… [+2048 chars]"}, {"source": {"id": null, "name": "Fci Academy"}, "author": "Nancy Gilson, The Columbus Dispatch", "title": "Book review: 'The Code Breaker' is a fascinating look at a genetics discovery - The Columbus Dispatch", "description": "'The Code Breaker' is a captivating exploration of geneticist Jennifer Doudna's life, and her life-changing scientific discovery.", "url": "https://www.dispatch.com/story/entertainment/books/2021/03/07/books-code-breaker-fascinating-look-nobel-winners-genetic-discovery/6840829002/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/02/26/NCOD/c6fd6500-555f-47b3-8322-7fa8f6930dc0-code.jpg?auto=webp&crop=328,185,x0,y174&format=pjpg&width=1200", "publishedAt": "2021-03-07T13:26:52Z", "content": "When Jennifer Doudna and Emmanuelle Charpentier won the 2020 Nobel Prize in Chemistry, they became only the sixth and seventh women to do so; the first being Marie Curie in 1911.\r\nThe Nobel acknowled… [+4122 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Kelly Kizer Whitt", "title": "Earth’s oxygen will be gone in 1 billion years - EarthSky", "description": "A billion years from now, as the sun heats up, the warmer atmosphere will break down carbon dioxide, killing off plant life, which in turn will shut off Earth's source of oxygen.", "url": "https://earthsky.org/earth/earths-oxygen-gone-1-billion-years-life-extinguished", "urlToImage": "https://earthsky.org/upl/2021/03/Earth-atmosphere-feb-26-2021-NASA-ISS-sq-300x300.jpg", "publishedAt": "2021-03-07T12:31:34Z", "content": "The oxygen currently in Earth’s atmosphere will be gone in a billion years, say scientists. This image of Earth’s atmosphere was taken from the International Space Station on February 26, 2021. Image… [+5729 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Chelsea Gohd", "title": "Mount Etna's fiery eruptions seen from space (satellite photos) - Livescience.com", "description": "Thar she blows!", "url": "https://www.livescience.com/mount-etna-volcano-eruption-2021-satellite-photos.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WrjKvwQDtAc6kkp7iYhroj-1200-80.jpg", "publishedAt": "2021-03-07T12:00:00Z", "content": "Mount Etna erupts, as seen from space on Feb. 18, 2021.  (Image credit: Landsat data from the U.S. Geological Survey)\r\nMount Etna has been spewing lava across Sicily for weeks during a series of erup… [+3266 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Video \"Perseverance\" robot moves to the surface of Mars for the first time - SwordsToday.ie", "description": "The U.S. space agency \"NASA\" announced on Friday that the probe \"Perseverance\" had succeeded in traveling a few meters on Mars for the first time since it", "url": "https://swordstoday.ie/video-perseverance-robot-moves-to-the-surface-of-mars-for-the-first-time/", "urlToImage": null, "publishedAt": "2021-03-07T07:56:58Z", "content": "The U.S. space agency “NASA” announced on Friday that the probe “Perseverance” had succeeded in traveling a few meters on Mars for the first time since it landed on the surface two weeks ago.\r\nThe si… [+2480 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Found: A Planet Close To Us With A Day That Lasts Forever And An Eternal Night Lit Up By Exploding Volcanoes - Forbes", "description": "The first evidence of global tectonic activity on a planet outside our Solar System.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/03/06/found-a-planet-close-to-us-with-a-day-that-lasts-forever-and-an-eternal-night-lit-up-by-exploding-volcanoes/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6040a9a00aab0d1751d3d0dc%2F0x0.jpg%3FcropX1%3D293%26cropX2%3D2486%26cropY1%3D254%26cropY2%3D1488", "publishedAt": "2021-03-07T03:00:00Z", "content": "This artists illustration represents the possible interior dynamics of the super-Earth exoplanet ... [+] LHS 3844b. The planet's interior properties and the strong stellar irradiation might lead to a… [+5720 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Viral: Massive flock of starlings form perfect bird shape as they fly over an Irish lake [WATCH] - Times Now", "description": "Crombie added that he had to take between 400 to 500 shots before finally capturing the perfect pictures.", "url": "https://www.timesnownews.com/the-buzz/article/viral-massive-flock-of-starlings-form-perfect-bird-shape-as-they-fly-over-an-irish-lake-watch/729096", "urlToImage": "https://imgk.timesnownews.com/story/Bird2.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-07T02:05:07Z", "content": "It was something that was too surreal and otherwordly to believe at first sight. Yet, it is all too real.\r\nPictures may confuse us but they share truths that are more simple, profound, and awe-inspir… [+1963 chars]"}, {"source": {"id": null, "name": "Herald Sun"}, "author": null, "title": "How virtual reality gave family precious time together - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-03-06T09:01:14Z", "content": null}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA's Perseverance Rover Transmits to Earth from the Surface of Mars - UPI.com", "description": "NASA's Mars Perseverance rover acquired this image using its Right Mastcam-Z camera. Mastcam-Z is a pair of cameras located high on the rover's mast. This image was acquired on February 24, 2021 (Sol 3) at the local mean solar time of 15:24:44. A key objectiv…", "url": "https://www.upi.com/News_Photos/view/upi/9d6b24f3b9fb9a2a77e5751cdb2c1611/NASAs-Perseverance-Rover-Transmits-to-Earth-from-the-Surface-of-Mars/", "urlToImage": "https://cdnph.upi.com/pv/upi/9d6b24f3b9fb9a2a77e5751cdb2c1611/NASA-MARS-PERSEVERANCE.jpg", "publishedAt": "2021-02-25T03:56:33Z", "content": "NASA's Mars Perseverance rover acquired this image using its Right Mastcam-Z camera. Mastcam-Z is a pair of cameras located high on the rover's mast. This image was acquired on February 24, 2021 (Sol… [+374 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Arab world basks in the glory of UAE Mars mission triumph - Arab News", "description": "DUBAI: For months, the Hope probe’s journey to Mars had been tracked eagerly by the Arab news media. In the UAE, hoardings depicting the unmanned spacecraft (known in Arabic as Al-Amal) have been positioned along highways as part of the country’s 50th anniver…", "url": "https://www.arabnews.com/node/1806701", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/10/2466686-1441476290.jpg", "publishedAt": "2021-02-10T01:29:01Z", "content": "ROME / MEXICO CITY: Pope Francis, the head of the Roman Catholic Church, will become the first pontiff ever to set foot in Iraq, where he hopes to encourage the dwindling Christian community to remai… [+7142 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": "Leena Sharma", "title": "Half of coral population of Great Barrier Reef is over - Micky News", "description": "The largest coral reef in the world, the Great Barrier Reef, known for its diverse coral population and beauty, has been depleting in the past three decades. Mo", "url": "https://micky.com.au/half-of-coral-population-of-great-barrier-reef-is-over/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/10/shutterstock_1707128332-1.jpg", "publishedAt": "2020-10-15T19:44:24Z", "content": "In a study produced by the Royal Society, it is propounded that the primary cause of this depletion has been climate change and the rising temperature and sea levels.\r\nHow does it affect the Australi… [+2409 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "Staff Correspondent", "title": "Einstein's theory of relativity vindicated by star orbiting massive black hole - Prothom Alo English", "description": "Observations of light coming from a star zipping in orbit around the humongous black hole at the center of our galaxy have provided fresh evidence backing Albert Einstein's 1915 theory of general relativity, astronomers said on Thursday.", "url": "https://en.prothomalo.com/science-technology/Einstein-s-theory-of-relativity-vindicated-by-star", "urlToImage": "https://images.prothomalo.com/prothomalo-english/2021-01/c3dbed49-9972-49c7-83ed-ef4927b04b9f/english_site_og_image.png", "publishedAt": "2020-03-02T22:24:48Z", "content": "They found that the behavior of the star's light as it escaped the extreme gravitational pull exerted by the black hole, with 4 million times the sun's mass, conformed to Einstein's theory's predicti… [+173 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Mother of all photobombs? Twitter erupts as space station sneaks into snap of the eclipse - Arab News", "description": "DUBAI: As millions across the US gathered to watch an eclipse of the sun on Monday, one photographer noticed something unexpected — an International Space Station photobombed the shot. Millions of Americans gazed in wonder at the cosmic spectacle, with the be…", "url": "https://www.arabnews.com/node/1148891", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/08/22/975971-1708758572.jpg", "publishedAt": "2019-08-28T11:26:09Z", "content": "LONDON: An Egyptian swimmer has broken the world record for the highest jump from water with a monofin.\r\nOmar Sayed Shaaban, 21, from Ismailia recorded a 2 meter 30 centimeter jump, breaking the prev… [+2077 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "The Associated Press", "title": "Stephen Hawking: Extraordinary life of the man who explained the universe - Arab News", "description": "PARIS: In his final years, the only thing connecting the brilliant physicist to the outside world was a couple of inches of frayed nerve in his cheek. As slowly as a word per minute, Stephen Hawking used the twitching of the muscle under his right eye to grin…", "url": "https://www.arabnews.com/node/1266671", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/03/15/1130251-2034869809.jpg", "publishedAt": "2019-08-28T01:53:40Z", "content": "KABUL: Afghan Vice President Amrullah Saleh on Monday took on a defiant tone as he reacted to a letter from US Secretary of State Antony Blinken to President Ashraf Ghani, which included an urgent pr… [+5355 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Trump says NASA should stop talking about going back to the Moon - Arab News", "description": "WASHINGTON: US President Donald Trump tweeted on Friday that NASA should stop talking about going back to the Moon, which caused confusion since his administration aims to restart Moon landings by 2024. “For all the money we are spending, NASA should NOT be t…", "url": "https://www.arabnews.com/node/1507781", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/06/08/1614336-937970345.jpg", "publishedAt": "2019-08-26T16:06:14Z", "content": "KABUL: Afghan Vice President Amrullah Saleh on Monday took on a defiant tone as he reacted to a letter from US Secretary of State Antony Blinken to President Ashraf Ghani, which included an urgent pr… [+5355 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Robin MILLARD | AFP", "title": "Hawking's final book offers brief answers to big questions - Arab News", "description": "LONDON: Stephen Hawking’s final work, which tackles issues from the existence of God to the potential for time travel, was launched on Monday by his children, who helped complete the book after the British astrophysics giant’s death. Hawking was forever being…", "url": "https://www.arabnews.com/node/1388206", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2018/10/15/1340321-2010394020.jpg", "publishedAt": "2019-06-17T12:56:37Z", "content": "DUBAI: Conversations around female intimate health have long been taboo or non-existent in Arab cultures. But a new crop of female doctors and healthcare practitioners on social media are aiming to d… [+3440 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Watch: Giant mystery sea creature washes up on Indonesian beach - Arab News", "description": "DUBAI: A 15-meter unidentified sea creature washed up on a remote beach in Indonesia this week, causing a stir among locals who flocked to the scene. The creature was found on Tuesday night on the northern shoreline of Seram Island in the province of Maluku, …", "url": "https://www.arabnews.com/node/1098451", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/05/12/910201-1728948142.jpg", "publishedAt": "2018-08-28T07:51:57Z", "content": "LONDON: An Egyptian swimmer has broken the world record for the highest jump from water with a monofin.\r\nOmar Sayed Shaaban, 21, from Ismailia recorded a 2 meter 30 centimeter jump, breaking the prev… [+2077 chars]"}, {"source": {"id": null, "name": "Billboard"}, "author": "Associated Press", "title": "Colleagues, Stars Hail Stephen Hawking at Cambridge Funeral - Billboard", "description": "Some 500 invited guests were gathering for the private funeral of famed British scientist Stephen Hawking.", "url": "https://www.billboard.com/articles/news/8277341/colleagues-stars-hail-stephen-hawking-at-cambridge-funeral", "urlToImage": "https://static.billboard.com/files/media/01-Stephen-Hawking-billboard-1548-compressed.jpg", "publishedAt": "2018-03-31T14:48:05Z", "content": "Some 500 invited guests were gathering for the private funeral of famed British scientist Stephen Hawking.\r\nCrowds of them came to the University Church of St. Mary the Great in the English town of C… [+387 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": "https://volcanodiscovery.de/", "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 4 Mar 2021: Etna volcano, Pacaya, Fuego, Popocatépetl, Dukono, Krísuvík, Sabancaya, Pinatubo\r\n 16:00 PM | BY: VN\r\nEtna (Sicily, Italy): Less than 2 days after the previous lava fount… [+5729 chars]"}]}