{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Really Small Black Holes Could Be Out There, Devouring Neutron Stars From Within - ScienceAlert", "description": "Tiny, all-but-undetectable primordial black holes could be one of the mysterious sources of mass that contributes to dark matter. There are significant limits to their lifespan in open space, but in recent years, astrophysicists have asked: what if t", "url": "https://www.sciencealert.com/tiny-black-holes-could-form-inside-neutron-stars-and-devour-them-from-within", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/black-hole-neutron_1024.jpg", "publishedAt": "2021-02-23T06:19:22Z", "content": "Tiny, all-but-undetectable primordial black holes could be one of the mysterious sources of mass that contributes to dark matter. There are significant limits to their lifespan in open space, but in … [+3915 chars]"}, {"source": {"id": null, "name": "Spatialsource.com.au"}, "author": "Charles Pauka", "title": "NASA video lets you join Perseverance on Mars - Spatial Source", "description": "The video from NASA’s Perseverance rover chronicles the final minutes of its entry, descent, and landing.", "url": "https://www.spatialsource.com.au/latest-news/nasa-video-lets-you-join-perseverance-on-mars", "urlToImage": "https://s3-ap-southeast-1.amazonaws.com/www.spatialsource.com.au/wp-content/uploads/2021/02/23150849/NASA-Perseverence-rover.jpg", "publishedAt": "2021-02-23T04:16:36Z", "content": "This high-resolution still image is part of a video taken by several cameras as NASAs Perseverance rover touched down on Mars on Feb. 18, 2021. A camera aboard the descent stage captured this shot. A… [+8778 chars]"}, {"source": {"id": null, "name": "Uwa.edu.au"}, "author": null, "title": "Big galaxies steal star-forming gas from their neighbours - University News: The University of Western Australia", "description": "Astronomers have discovered that small satellite galaxies contain less molecular gas at their centres than larger galaxies.", "url": "https://www.uwa.edu.au/news/article/2021/february/big-galaxies-steal-star-forming-gas-from-their-smaller-neighbours", "urlToImage": "https://www.uwa.edu.au/news/-/media/Project/UWA/UWA/Newsroom/Card-image/2021/Galaxy-stripping-Card-template---944x522.jpg", "publishedAt": "2021-02-23T03:47:44Z", "content": "Large galaxies are known to strip the gas that occupies the space between the stars of smaller satellite galaxies.\r\nIn research published today, astronomers have discovered that these small satellite… [+3258 chars]"}, {"source": {"id": null, "name": "Armidale Express"}, "author": "Dr Mary McMillan", "title": "Science Matters || Are you worried about long-term effects of chemicals in hair dye? - Armidale Express", "description": "While you may think of hair colouring as just one of the trappings of vanity, there is actually some quite interesting chemistry behind my colours.", "url": "https://www.armidaleexpress.com.au/story/7136635/science-matters-are-you-worried-about-long-term-effects-of-chemicals-in-hair-dye/", "urlToImage": "https://www.armidaleexpress.com.au/images/transform/v1/crop/frm/JV4n4a6iwKJ9DNUAb9ehsn/384b7c90-55fc-4c1a-b909-6287aca2162f.jpg/r891_720_6055_3638_w1200_h678_fmax.jpg", "publishedAt": "2021-02-23T01:00:00Z", "content": ""}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists use patients' own stem cells to restore function after spinal cord injury - News-Medical.Net", "description": "Intravenous injection of bone marrow derived stem cells (MSCs) in patients with spinal cord injuries led to significant improvement in motor functions, researchers from Yale University and Japan report Feb. 18 in the Journal of Clinical Neurology and Neurosur…", "url": "https://www.news-medical.net/news/20210222/Scientists-use-patients-own-stem-cells-to-restore-function-after-spinal-cord-injury.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/shutterstock_499282837_f18bafe030744de991560feceed98d20-620x480.jpg", "publishedAt": "2021-02-22T23:38:00Z", "content": "Intravenous injection of bone marrow derived stem cells (MSCs) in patients with spinal cord injuries led to significant improvement in motor functions, researchers from Yale University and Japan repo… [+2316 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Incredible sky map doesn't show stars – but thousands of black holes - Yahoo News Australia", "description": "An international team of astronomers has mapped the location of 25,000 supermassive black holes – in a map which looks eerily like a starlit sky.", "url": "https://au.news.yahoo.com/sky-map-black-holes-170611679.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/deb18260-752f-11eb-ba9f-301f8dbc0c66", "publishedAt": "2021-02-22T18:45:00Z", "content": "Watch: This Astonishing Image of Space Shows 25,000 Supermassive Black Holes\r\nA lot of galaxies have \"supermassive\" black holes huge monsters with masses up to 10 billion times that of our Sun at the… [+2347 chars]"}, {"source": {"id": null, "name": "Katherinetimes.com.au"}, "author": "Michael Ramsey", "title": "WA rock art dates back 17000 years - Katherine Times", "description": "Australia's oldest known rock shelter painting has been dated at 17,000 years old in a finding that may unlock greater understanding of Indigenous cultural hi...", "url": "https://www.katherinetimes.com.au/story/7138204/wa-rock-art-dates-back-17000-years/", "urlToImage": "https://www.katherinetimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/496a71f4-689d-4222-89bb-4274b6856074.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-22T16:05:14Z", "content": ""}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Study Describes Key Stage in the Beginning of Great Glaciations - AZoCleantech", "description": "A key stage at the start of the great glaciations has been described for the first time by a new study in which the Andalusian Earth Sciences Institute (IACT) (CSIC-UGR) was involved.", "url": "https://www.azocleantech.com/news.aspx?newsID=28897", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28897_16139954849379370.jpg", "publishedAt": "2021-02-22T16:05:00Z", "content": "Written by AZoCleantechFeb 22 2021\r\nA key stage at the start of the great glaciations has been described for the first time by a new study in which the Andalusian Earth Sciences Institute (IACT) (CSI… [+5435 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "Ghost particle that slammed into Antarctica traced back to black hole feast - CNET", "description": "A black hole gobbled up a star in deep space and flung a high-energy subatomic bullet at the Earth. Don't worry, the planet's doing fine.", "url": "https://www.cnet.com/news/ghost-particle-that-crashed-into-antarctica-traced-back-to-star-shredded-by-black-hole/", "urlToImage": "https://cnet2.cbsistatic.com/img/XhEsqeKJf3NZmQBdQnltLE8BTO4=/1200x630/2021/02/22/48e1d4d3-66d3-424b-9a7a-866f6dbc5c90/desy-blackhole-starshred.jpg", "publishedAt": "2021-02-22T16:00:18Z", "content": "A star being ripped to shreds after it approaches a black hole. Scientists have detected a neutrino -- the \"ghost particle\" -- from such an event for the first time.\r\nDESY, Science Communication Lab\r… [+5165 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Monica Grady", "title": "Can the laws of physics disprove God? - The Conversation UK", "description": "If God could break the laws of physics,  why haven't we seen any evidence of the laws ever being broken in the universe?", "url": "https://theconversation.com/can-the-laws-of-physics-disprove-god-146638", "urlToImage": "https://images.theconversation.com/files/368289/original/file-20201109-23-s91zxo.jpg?ixlib=rb-1.1.0&rect=262%2C13%2C3994%2C1994&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-22T14:20:23Z", "content": "I still believed in God (I am now an atheist) when I heard the following question at a seminar, first posed by Einstein, and was stunned by its elegance and depth: If there is a God who created the e… [+10923 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alasdair MacKenzie and Andreas Kolb", "title": "The human genome at 20: How biology's most-hyped breakthrough led to anticlimax and arrests - Phys.org", "description": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence  had been completed, he hailed the breakthrough as \"the most important, most wondrous map ever produced by humankind.\" The scientific achievement…", "url": "https://phys.org/news/2021-02-human-genome-biology-most-hyped-breakthrough.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thehumangeno.jpg", "publishedAt": "2021-02-22T14:14:27Z", "content": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence had been completed, he hailed the breakthrough as \"the most important, most wondrous … [+8115 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Stephanie Mlot", "title": "FAA Ends Investigations Into Recent SpaceX Starship Crashes - PCMag AU", "description": "Elon Musk believes the SN10 prototype has a 'good chance of flying this week.'", "url": "https://au.pcmag.com/news/85741/faa-ends-investigations-into-recent-spacex-starship-crashes", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/f/faa-ends-i/faa-ends-investigations-into-recent-spacex-starship-crashes_mqt4.1200.jpg", "publishedAt": "2021-02-22T13:07:39Z", "content": "Starship High-Altitude Flight Test (Photo via SpaceX)\r\nThe Federal Aviation Administration has concluded investigations into two recent SpaceX Starship tests, potentially paving the way for a new fli… [+2040 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Perseverance is what it takes to explore Mars life potential - MENAFN.COM", "description": "'Maybe by mid-to-end of the 2030s we can start pushing out of the Earth-Moon system and land astronauts on Mars, these words of Nasa acting administrator Steve Jurczyk achieves a special significance in the light of the ultra-dramatic safe landing of the US s…", "url": "https://menafn.com/1101637588/Perseverance-is-what-it-takes-to-explore-Mars-life-potential", "urlToImage": "https://menafn.com/updates/pr/2021-02/21/GT_f7ad782b-aimage_story.jpg", "publishedAt": "2021-02-22T04:16:13Z", "content": "(MENAFN - Gulf Times) 'Maybe by mid-to-end of the 2030s we can start pushing out of the Earth-Moon system and land astronauts on Mars, these words of Nasa acting administrator Steve Jurczyk achieves … [+4164 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Biggest Black Hole Turns Out to Be an Even Heftier Lad Than We Thought - Gizmodo Australia", "description": "The heaviest stellar black hole — formed from the collapse of a star — turns out to be even heavier than we all thought. Huge!", "url": "https://www.gizmodo.com.au/2021/02/biggest-black-hole-even-heftier-lad-than-we-thought/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/22/GettyImages-594381975.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-22T03:35:00Z", "content": "When one of us (Ilya Mandel) started grad school at the California Institute of Technology 20 years ago, he was greeted with a series of bets hanging on the wall outside the office of his PhD advisor… [+5979 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "New research suggests a polar flip could be catastrophic - BGR", "description": "Earth’s magnetic poles are constantly on the move, but they haven’t drifted far enough to actually flip in the modern age. Researchers know that Earth’s poles have flipped in the past, but opinion has been split over what effects such an event might have on t…", "url": "https://bgr.com/2021/02/21/pole-flip-earth-magnetic-fields/", "urlToImage": "https://bgr.com/wp-content/uploads/2019/02/earth.jpg?quality=70&strip=all", "publishedAt": "2021-02-21T15:23:00Z", "content": "<ul><li>Earth’s magnetic poles are constantly on the move, but they haven’t drifted far enough to actually flip in the modern age. </li><li>Researchers know that Earth’s poles have flipped in the pas… [+3514 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Vampire squid fossil 'lost' during the Hungarian Revolution rediscovered - Livescience.com", "description": "A new fossil reveals that vampire squid have been trawling the deep for a long time.", "url": "https://www.livescience.com/vampire-squid-lost-fossil.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uA846krpUNta6Maitqo8fC-1200-80.jpg", "publishedAt": "2021-02-21T14:37:35Z", "content": "Vampire squid have been lurking in the dark corners of the ocean for 30 million years, a new analysis of a long-lost fossil finds. \r\nModern-day vampire squid\r\n (Vampyroteuthis infernalis) can thrive … [+4906 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "WATCH: Soyuz spacecraft carrying the UAE's first astronaut Hazza Al-Mansoori dock with International Space Station - Arabnews", "description": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the Baikonur Cosmodrome in Kazakhstan. Hazza Al-Mansoori from t…", "url": "https://www.arabnews.com/node/1559686", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/09/25/1770396-1560966155.jpg", "publishedAt": "2019-09-25T11:56:25Z", "content": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the… [+4358 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "Scientists find 38 million pieces of trash on Pacific island - Arab News", "description": "NEW ZEALAND: When researchers traveled to a tiny, uninhabited island in the middle of the Pacific Ocean, they were astonished to find an estimated 38 million pieces of trash washed up on the beaches. Almost all of the garbage they found on Henderson Island wa…", "url": "https://www.arabnews.com/node/1100406", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/05/16/912576-76095870.png", "publishedAt": "2019-08-27T01:33:48Z", "content": "COLOMBO: Pakistani Prime Minister Imran Khans visit to Sri Lanka will open a new chapter in bilateral relations, officials told Arab News on Monday.\r\nKhan is due to arrive at Bandaranaike Internation… [+3514 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "Trillion-ton iceberg breaks off Antarctica - Arab News", "description": "LONDON: One of the biggest icebergs on record has broken away from Antarctica, scientists said on Wednesday, creating an extra hazard for ships around the continent as it breaks up. The 1 trillion-ton iceberg, measuring 5,800 sq km, calved away from the Larse…", "url": "https://www.arabnews.com/node/1128386", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/07/12/949781-1711133755.jpg", "publishedAt": "2018-08-27T21:30:20Z", "content": null}]}