{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Entrepreneur"}, "author": "Entrepreneur en Español", "title": "Why the asteroid Psyche 16 is worth more than the entire global economy of planet Earth - mySanAntonio.com", "description": "For a few months, the United States Space Agency (NASA) has a history of ups and downs...", "url": "https://www.entrepreneur.com/article/379769", "urlToImage": "https://s.hdnux.com/photos/01/21/31/00/21336091/3/rawImage.jpg", "publishedAt": "2021-08-09T20:31:31Z", "content": "For a few months, the United States Space Agency (NASA) has a history of ups and downs with the asteroid Psyche 16 . Last April it was announced that the organism programmed a mission to said cosmic … [+3753 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "‘Cigars’ Might Account For Strange Solar Strength As Sun Shoots Flares - Forbes", "description": "We may have finally cracked a ‘convective conundrum’ that is plaguing our efforts to figure out the strength of solar storms.", "url": "https://www.forbes.com/sites/elizabethhowell1/2021/08/09/cigars-might-account-for-strange-solar-strength-as-sun-shoots-flares/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60f81a3909d23ceaa76b55da%2F0x0.jpg", "publishedAt": "2021-08-09T20:00:00Z", "content": "Astronomers at the Solar &amp; Heliospheric Observatory (SOHO) captured this image of a solar prominence ... [+] erupting from the surface of the Sun on October 25, 2002. Two large prominences were s… [+3557 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Unlocking the AI algorithm 'black box' - new machine learning technology to find out what makes plants and humans tick - Science Daily", "description": "We all have an internal clock but what makes us tick? Scientists have developed new artificial intelligence (AI) and machine learning (ML) technology to understand how gene expression regulates an organism's circadian clock.", "url": "https://www.sciencedaily.com/releases/2021/08/210809144052.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-09T19:59:32Z", "content": "The inner 24-hour cycles -- or circadian rhythms -- are key to maintaining human, plant and animal health, which could provide valuable insight into how broken clocks impact health.Circadian rhythms,… [+6567 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Some past sea levels may not have been as high as thought, says study of rising and sinking landmasses - Phys.org", "description": "One of the current mysteries of climate science surrounds the widely accepted evidence that during the planet's most recent past natural warm period, about 128,000 to 117,000 years ago, global sea levels peaked as high as 6 to 9 meters (20 or 30 feet) higher …", "url": "https://phys.org/news/2021-08-sea-high-thought-landmasses.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/some-past-sea-levels-m.jpg", "publishedAt": "2021-08-09T19:00:01Z", "content": "One of the current mysteries of climate science surrounds the widely accepted evidence that during the planet's most recent past natural warm period, about 128,000 to 117,000 years ago, global sea le… [+9154 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Cathy Van Extel", "title": "The discovery of pterosaur fossil shows prehistoric reptile was close to 'a real-life dragon' - ABC News", "description": "Scientists have discovered a new species of a prehistoric flying reptile in outback Queensland describing it as the closest thing we have to Australia's own dragon.", "url": "https://www.abc.net.au/news/2021-08-10/pterosaur-flying-reptile-fossil-dinosaur-australia-dragon/100356798", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e53390761a6e762f66dd29b60ce751b8?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2021-08-09T19:00:00Z", "content": "Scientists have discovered a new species of a prehistoric flying reptile in outback Queensland, describing it as the closest thing we have to Australia's very own dragon.\r\nThe pterosaur, named Thapun… [+5366 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "With a single photo, SpaceX sent a not-so-subtle message to FAA regulators - Ars Technica", "description": "Holding back Starship means holding back this progress, Musk was saying.", "url": "https://arstechnica.com/science/2021/08/with-a-single-photo-spacex-sent-a-not-so-subtle-message-to-faa-regulators/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/08/E8J2IurVcAE0Zrr-760x380.jpg", "publishedAt": "2021-08-09T17:29:38Z", "content": "Enlarge/ Workers perform a fit check with Starship (above) and the Super Heavy booster.\r\n275 with 145 posters participating\r\nNearly a century ago, humans built skyward for the first time at an unprec… [+4847 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://jpl.nasa.gov/", "title": "NASA, International Panel Provide a New Window on Rising Seas - Jet Propulsion Laboratory", "description": "NASA's Jet Propulsion Laboratory, the leading center for robotic exploration of the solar system.", "url": "https://www.jpl.nasa.gov/news/nasa-international-panel-provide-a-new-window-on-rising-seas", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1-High-tide-flood-VA-sea-grant.jpg", "publishedAt": "2021-08-09T17:19:11Z", "content": "Along with providing snapshots of rising sea levels in the decades to come, the tool enables users to focus on the effects of different processes that drive sea level rise. Those processes include th… [+2463 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Christian Davenport", "title": "Boeing Starliner launch problems more widespread than previously reported - The Washington Post", "description": "Boeing still does not know what caused the problem, which forced yet another delay in a program that has been plagued by serious issues for years.", "url": "https://www.washingtonpost.com/technology/2021/08/09/boeing-starliner-launch-delay-valves/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MXX73QXVHEI6XJRWDDFMLGUY3Q.jpg&w=1440", "publishedAt": "2021-08-09T16:54:34Z", "content": "Boeing is developing Starliner under a contract with NASA to fly the space agencys astronauts to and from the International Space Station. Elon Musks SpaceX, the other company that holds the commerci… [+4252 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "NASA EGS, Jacobs power up Artemis 1 vehicle to begin system checkouts in the VAB - NASASpaceFlight.com - NASASpaceflight.com", "description": "After stacking the stages of the Space Launch System (SLS) rocket for NASA’s Artemis 1…", "url": "https://www.nasaspaceflight.com/2021/08/artemis-1-power-up/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/02/SLS-engine-closeup-NSF.png", "publishedAt": "2021-08-09T16:19:16Z", "content": "After stacking the stages of the Space Launch System (SLS) rocket for NASA’s Artemis 1 mission in June and July, EGS and TOSC powered up the Core Stage for the first time in the Vehicle Assembly Buil… [+13522 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Department of Energy, Office of Science", "title": "James Kneller: Then and Now / 2011 Early Career Award Winner - Newswise", "description": "At North Carolina State University, associate professor James Kneller studies neutrinos emitted from exploding stars.", "url": "https://www.newswise.com/doescience/james-kneller-then-and-now-2011-early-career-award-winner", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2021-08-09T16:00:00Z", "content": "WHAT DID THE 2011 EARLY CAREER AWARD ALLOW YOU TO DO?\r\nI study neutrinos in exploding stars or supernovae. Neutrinos are very elusive on Earth. But in a supernova, any change to the neutrino will cha… [+5867 chars]"}, {"source": {"id": null, "name": "SpaceFlight Insider"}, "author": "Theresa Cross", "title": "NG-16 Cygnus to launch supplies to International Space Station - SpaceFlight Insider", "description": "Northrop Grumman and NASA are set to fly the 16th contracted Cygnus (NG-16) commercial resupply mission to the International Space Station.", "url": "https://www.spaceflightinsider.com/organizations/northrop-grumman/ng-16-cygnus-to-launch-supplies-to-international-space-station/", "urlToImage": "https://www.spaceflightinsider.com/wp-content/uploads/2021/08/WFF-2021-054-003_large.jpg", "publishedAt": "2021-08-09T15:49:28Z", "content": "The Antares rocket with the NG-16 Cygnus spacecraft encapsulated on top. Credit: NASA\r\nNorthrop Grumman and NASA are set to fly the 16th contracted Cygnus commercial resupply mission to the Internati… [+4573 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Spot Giant X-Ray Rings around Stellar-Mass Black Hole | Astronomy - Sci-News.com", "description": "Astronomers have detected a set of eight X-ray rings around a low-mass black hole in V404 Cygni, a binary system located about 7,800 light-years away in the constellation of Cygnus.", "url": "http://www.sci-news.com/astronomy/v404-cygni-x-ray-rings-09940.html", "urlToImage": "http://cdn.sci-news.com/images/2021/08/image_9940f-V404-Cygni-Rings.jpg", "publishedAt": "2021-08-09T15:42:08Z", "content": "Astronomers using NASAs Chandra X-ray Observatory and Neil Gehrels Swift Observatory have detected a set of eight X-ray rings around a low-mass black hole in V404 Cygni, a binary system located about… [+3440 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "A wonderful moment in the history of astronomy - the first capture of light emanating from a black hole - The Press Stories", "description": "For the first time, scientists have detected light emanating from a black hole, and CNN writes that it executes a prediction based on Albert Einstein's", "url": "https://presstories.com/2021/08/09/a-wonderful-moment-in-the-history-of-astronomy-the-first-capture-of-light-emanating-from-a-black-hole/", "urlToImage": "https://presstories.com/wp-content/uploads/2021/08/A-wonderful-moment-in-the-history-of-astronomy-the.jpg", "publishedAt": "2021-08-09T15:23:34Z", "content": "For the first time, scientists have detected light emanating from a black hole, and CNN writes that it executes a prediction based on Albert Einstein’s general theory of relativity.\r\nStanford Univers… [+1761 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Aaron Anderson", "title": "In fight against invasive carp, scientists explore new frontier: Track the babies - Phys.org", "description": "For decades, four invasive species of carp have been devouring plants, gorging on plankton and endangering an interconnected community of fish, plants and mollusks beneath the murky brown water of the Missouri River.", "url": "https://phys.org/news/2021-08-invasive-carp-scientists-explore-frontier.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/commoncarp.jpg", "publishedAt": "2021-08-09T15:13:55Z", "content": "For decades, four invasive species of carp have been devouring plants, gorging on plankton and endangering an interconnected community of fish, plants and mollusks beneath the murky brown water of th… [+8015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Cool' stars may not be so unique - Phys.org", "description": "Stars scattered throughout the cosmos look different, but they may be more alike than once thought, according to Rice University researchers.", "url": "https://phys.org/news/2021-08-cool-stars-unique.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/cool-kids-in-the-cosmo.jpg", "publishedAt": "2021-08-09T15:12:23Z", "content": "Stars scattered throughout the cosmos look different, but they may be more alike than once thought, according to Rice University researchers.\r\nNew modeling work by Rice scientists shows that \"cool\" s… [+6515 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Switched on IR-active organic pigments - Phys.org", "description": "In photosynthesis and organic photovoltaics, pigment molecules convert light into electrical charge. A team of chemists have now produced an unusual organic pigment, which is \"switched on\" by an electrical charge to become a potent dye that absorbs light in t…", "url": "https://phys.org/news/2021-08-ir-active-pigments.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/tiedye.jpg", "publishedAt": "2021-08-09T15:11:17Z", "content": "In photosynthesis and organic photovoltaics, pigment molecules convert light into electrical charge. A team of chemists have now produced an unusual organic pigment, which is \"switched on\" by an elec… [+3306 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Emmerich", "title": "Qubit in a crystal lattice of boron nitride is a suitable sensor - Phys.org", "description": "An artificially created spin defect (qubit) in a crystal lattice of boron nitride is suitable as a sensor enabling the measurement of different changes in its local environment. The qubit is a boron vacancy located in a two-dimensional layer of hexagonal boro…", "url": "https://phys.org/news/2021-08-qubit-crystal-lattice-boron-nitride.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/qubits-under-pressure.jpg", "publishedAt": "2021-08-09T15:10:33Z", "content": "An artificially created spin defect (qubit) in a crystal lattice of boron nitride is suitable as a sensor enabling the measurement of different changes in its local environment. The qubit is a boron … [+3629 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Heavy Metal Guided Imaging Technique Helps in Definitive Analysis of Molecules - AZoOptics.com", "description": "Coordination compounds exhibit molecular structures comprising either one or multiple metal atoms at the center, encircled by non-metal atoms. Their appealing chemical and physical properties that find remarkable uses in materials science are mostly based on …", "url": "https://www.azooptics.com/News.aspx?newsID=26938", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_26938_16285132919549234.jpg", "publishedAt": "2021-08-09T14:17:00Z", "content": "Coordination compounds exhibit molecular structures comprising either one or multiple metal atoms in the center, encircled by non-metal atoms. Their appealing chemical and physical properties with in… [+3992 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Researchers Develop Efficient Electrodes by Mimicking Bamboo Membranes - AZoM", "description": "The aim of Professor Ziqi Sun was to develop a project to mimic the optical and structural properties of natural objects like fish scales, seashells, and fly eyes, to build a sustainable energy solution. Sun was motivated to execute this project during his wa…", "url": "https://www.azom.com/news.aspx?newsID=56618", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_56618_16285085926415014.jpg", "publishedAt": "2021-08-09T14:09:00Z", "content": "The aim of Professor Ziqi Sun was to develop a project to mimic the optical and structural properties of natural objects like fish scales, seashells, and fly eyes, to build a sustainable energy solut… [+4581 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "Photos show electrons from galaxies about a billion light-years away creating 2 'dancing ghosts' in the sky - Business Insider", "description": "Scientists were \"baffled\" by the shape of the clouds, which is unlike anything seen before with these types of galaxies, one expert told Insider.", "url": "https://www.businessinsider.com/photos-dancing-ghosts-illusion-galaxies-billion-light-years-daway-2021-8", "urlToImage": "https://i.insider.com/611111252a24d00018625515?width=1200&format=jpeg", "publishedAt": "2021-08-09T13:34:12Z", "content": "Researchers have discovered a cosmic phenomenon that looks like two people dancing in deep space, according to a study published last week.\r\nThe structure, named PKS 2130-538 and nicknamed the \"danci… [+3142 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Amanda Morris", "title": "Neurons that respond to touch are less picky than expected - Medical Xpress", "description": "Researchers used to believe that individual primary touch-sensitive neatly responded to specific types of touch. Now a Northwestern University study finds that touch-sensitive neurons communicate touch in a much messier and jumbled manner.", "url": "https://medicalxpress.com/news/2021-08-neurons-picky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/neuron.jpg", "publishedAt": "2021-08-09T12:22:44Z", "content": "Researchers used to believe that individual primary touch-sensitive neatly responded to specific types of touch. Now a Northwestern University study finds that touch-sensitive neurons communicate tou… [+5810 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Gearing up for third Sentinel-2 satellite - Phys.org", "description": "With the first Copernicus Sentinel-2 satellite in orbit since 2015 and the second since 2017, engineers are busy preparing the mission's follow-on pair to eventually pick up the baton to supply images for a myriad of applications from food security to monitor…", "url": "https://phys.org/news/2021-08-gearing-sentinel-satellite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/gearing-up-for-third-s.jpg", "publishedAt": "2021-08-09T12:10:29Z", "content": "With the first Copernicus Sentinel-2 satellite in orbit since 2015 and the second since 2017, engineers are busy preparing the mission's follow-on pair to eventually pick up the baton to supply image… [+3983 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "A Mineral Unknown On Earth Could Be The Most Abundant Mineral On Mars - Forbes", "description": "A mineral unknown on Earth could be the most abundant mineral on Mars, according to a discovery made analyzing the chemical composition of a meteorite.", "url": "https://www.forbes.com/sites/davidbressan/2021/08/09/a-mineral-unknown-on-earth-could-be-the-most-abundant-mineral-on-mars/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F61110f6aa162e3d471419c50%2F0x0.jpg", "publishedAt": "2021-08-09T12:02:12Z", "content": "Cutaway illustration of the planet Mars, detailing the solid inner core and surrounding mantle.\r\nFuture Publishing via Getty Images\r\nA mineral unknown on Earth could be the most abundant mineral on M… [+2439 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "How nature has inspired scientists' most powerful technologies - The Next Web", "description": "Watson and Crick, Schrödinger and Einstein all made theoretical breakthroughs that have changed the world’s understanding of science.\r\n\r\nToday big, game-changing ideas are less common. ...", "url": "https://thenextweb.com/news/nature-inspired-scientists-most-powerful-technologies-syndication", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F08%2FSyndihed.jpg&signature=5cac8c2f6577100b6bca7155d2cfea8c", "publishedAt": "2021-08-09T11:54:00Z", "content": "Watson and Crick, Schrödinger and Einstein all made theoretical breakthroughs that have changed the worlds understanding of science.\r\nToday big, game-changing ideas are less common. New and improved … [+6860 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Shang Gao", "title": "Machine learning plus insights from genetic research shows the workings of cells - Phys.org", "description": "We combined a machine learning algorithm with knowledge gleaned from hundreds of biological experiments to develop a technique that allows biomedical researchers to figure out the functions of the proteins that turn genes on and off in cells, called transcrip…", "url": "https://phys.org/news/2021-08-machine-insights-genetic-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/machine-learning-plus.jpg", "publishedAt": "2021-08-09T11:45:30Z", "content": "We combined a machine learning algorithm with knowledge gleaned from hundreds of biological experiments to develop a technique that allows biomedical researchers to figure out the functions of the pr… [+3919 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Did nature or nurture shape the Milky Way's most common planets? - Phys.org", "description": "A Carnegie-led survey of exoplanet candidates identified by NASA's Transiting Exoplanets Satellite Survey  (TESS) is laying the groundwork to help astronomers understand how the Milky Way's most common planets formed and evolved, and determine why our solar s…", "url": "https://phys.org/news/2021-08-nature-nurture-milky-common-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/did-nature-or-nurture.jpg", "publishedAt": "2021-08-09T11:40:06Z", "content": "A Carnegie-led survey of exoplanet candidates identified by NASA's Transiting Exoplanets Satellite Survey (TESS) is laying the groundwork to help astronomers understand how the Milky Way's most commo… [+4819 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Stephanie Mlot", "title": "NASA Seeks Crew Members for Year-Long Simulated Mars Mission - PCMag AU", "description": "Four people will live and work in a 1,700-square-foot 3D-printed module in Texas.", "url": "https://au.pcmag.com/news/88708/nasa-seeks-crew-members-for-year-long-simulated-mars-mission", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/n/nasa-seeks/nasa-seeks-crew-members-for-year-long-simulated-mars-mission_k4s3.1200.jpg", "publishedAt": "2021-08-09T11:29:29Z", "content": "NASA is recruiting folks for a year-long experiment in an Earth-bound habitat built to simulate life on a distant world. The series of missions, known as Crew Health and Performance Exploration Analo… [+1927 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mara Johnson-Groh", "title": "Origin of dinosaur-ending asteroid possibly found. And it's dark. - Livescience.com", "description": "Scientists figured out what slammed into Earth and killed the dinosaurs 66 million years ago: a giant dark primitive asteroid from the outer reaches of the solar system's main asteroid belt.", "url": "https://www.livescience.com/dinosaur-killing-asteroid-origin-dark.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/US3vqKhyVfGNa5hJTZTQrP-1200-80.jpg", "publishedAt": "2021-08-09T11:23:24Z", "content": "A giant asteroid collided with Earth on the Yucatan Peninsula some 66 million years ago, as shown in this illustration. (Image credit: MARK GARLICK/SCIENCE PHOTO LIBRARY via Getty Images)\r\nAbout 66 m… [+4505 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Doris Elin Urrutia", "title": "Stellar pulses are transformed into a celestial symphony - Space.com", "description": "This subfield of astronomy is called asteroseismology.", "url": "https://www.space.com/red-giant-sound-waves-celestial-symphony", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ByGQsWee8x8xtAPhMvMe84-1200-80.png", "publishedAt": "2021-08-09T10:55:36Z", "content": "A new NASA video showcases the whirring symphony of stars in our cosmic neighborhood. \r\nAlthough it usually hunts for alien worlds, or exoplanets\r\n in the nearby universe, one NASA mission is also ca… [+3387 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Jupiter 'energy crisis' caused by auroras, scientists find in new study - Space.com", "description": "Jupiter's mysterious \"energy crisis\" that has puzzled astronomers for 50 years could be caused by auroras, new observations suggest.", "url": "https://www.space.com/jupiter-auroras-cause-mystery-heating", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ptGfAuZCaNFUTrZ8j4HxwS-1200-80.png", "publishedAt": "2021-08-09T10:53:08Z", "content": "Jupiter's mysterious \"energy crisis\" that has puzzled astronomers for 50 years could be caused by auroras, new observations suggest.\r\nThe largest planet in our solar system has long been known to be … [+5767 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Satsuki Then", "title": "Rocket Lab to send NASA’s CAPSTONE mission to the moon - SlashGear", "description": "Rocket Lab is a company that uses small rockets to place light payloads into orbit using the Electron launch vehicle. The company has announced that it will be launching a mission for NASA to the m…", "url": "https://www.slashgear.com/rocket-lab-to-send-nasas-capstone-mission-to-the-moon-09685765/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/08/half-moon.jpg", "publishedAt": "2021-08-09T10:03:00Z", "content": "Rocket Lab is a company that uses small rockets to place light payloads into orbit using the Electron launch vehicle. The company has announced that it will be launching a mission for NASA to the moo… [+1845 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumedha Tripathi", "title": "A Man Joined The Navy So He Could Prove That The Earth Is Flat - India Times", "description": "A man talked about a stupid life decision his colleague made to prove a very weird point. This man who is also a naval officer shared on Reddit how a colleague of his who he was working with told him he joined the Navy to get onto the open seas and finally ge…", "url": "https://www.indiatimes.com/trending/wtf/man-joins-navy-to-prove-earth-is-flat-546815.html", "urlToImage": "https://im.indiatimes.in/content/2021/Aug/photo-1552977133-d7002d15dfac_6110e00b94030.jpg", "publishedAt": "2021-08-09T09:15:45Z", "content": "A man talked about a stupid life decision his colleague made to prove a very weird point. \r\nThis man who is also a naval officer sharedon Reddit how a colleague of his who he was working with told hi… [+1701 chars]"}, {"source": {"id": null, "name": "Christiantoday.com"}, "author": "Jennifer Lee", "title": "Evidence uncovered of earthquake mentioned in the Bible - ChristianToday", "description": "Archaeologists have found evidence of an earthquake that occurred during the period of the Kingdom of Judah and which is recorded in the Bible.", "url": "https://christiantoday.com/article/evidence.uncovered.of.earthquake.mentioned.in.the.bible/137221.htm", "urlToImage": "https://ctd-thechristianpost.netdna-ssl.com/en/full/80424/dr-joe-uziel-and-ortal-chalaf.jpg?p=137221&w=760&l=40&t=43", "publishedAt": "2021-08-09T09:03:05Z", "content": "Dr Joe Uziel and Ortal Chalaf from the Israel Antiquities Authority.(Photo: Israel Antiquities Authority)\r\nArchaeologists have found evidence of an earthquake that occurred during the period of the K… [+2075 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Northrop Grumman's Cygnus cargo spacecraft launching tomorrow - Devdiscourse", "description": "This is Northrop Grumman's 16th commercial resupply services mission to the International Space Station and each resupply mission delivers scientific investigations in the areas of biology and biotechnology, Earth and space science, physical sciences, and tec…", "url": "https://www.devdiscourse.com/article/science-environment/1685860-northrop-grummans-cygnus-cargo-spacecraft-launching-tomorrow", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_08_2021_14_19_04_6294975.jpg?width=920&format=jpeg", "publishedAt": "2021-08-09T08:49:37Z", "content": "Northrop Grumman's Cygnus cargo spacecraft is set to launch tomorrow (Tuesday), August 10, at 5:56pm ET, on the company's Antares rocket from NASA's Wallops Flight Facility in Wallops Island, Virgini… [+1377 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Largest gas filament discovered in our Milky Way - Tech Explorist", "description": "It appears to be so far the furthest and largest giant filament in the galaxy.", "url": "https://www.techexplorist.com/largest-gas-filament-discovered-milky-way/40542/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/08/milky-way-galaxy.jpg", "publishedAt": "2021-08-09T06:11:35Z", "content": "Milky Way, our home galaxy, is a typical barred spiral galaxy about 1150,000 to 200,000 light-years across, about 2,000 light-years deep. It is believed to have more than 400 billion stars.\r\nThrougho… [+1667 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": "Rhiannon Tuffield", "title": "Daniel Andrews admits source of current outbreak may never be known - The Australian", "description": "Victorian Premier Daniel Andrews has admitted the state may never figure out the origin of the current Covid outbreaks, as authorities attempt to dampen virus spot fires.", "url": "https://www.theaustralian.com.au/breaking-news/daniel-andrews-admits-source-of-current-outbreak-may-never-be-known/news-story/51700f2457381426d0c1e7c558326b82", "urlToImage": "https://cdn.newsapi.com.au/image/v1/f95574968e66a1b78a52b00d631cfd47", "publishedAt": "2021-08-09T06:01:00Z", "content": "Victorian Premier Daniel Andrews has admitted the state may never figure out the origin of the current Covid outbreaks, as authorities attempt to dampen virus spot fires.\r\nVictoria recorded 11 new lo… [+2670 chars]"}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "Astro Restoration Project pieces together space shuttle astronomy payload - collectSPACE.com", "description": "In the same year that the Hubble Space Telescope was deployed, NASA launched the first of two space shuttle missions dedicated to the study of astronomy and astrophysics. Now, the Astro payload is being recovered and restored for display.", "url": "http://www.collectspace.com/news/news-080921a-astro-restoration-project.html", "urlToImage": "http://www.collectspace.com/images/news-080921a-fb.jpg", "publishedAt": "2021-08-09T05:08:45Z", "content": "August 9, 2021\r\n — In the same year the Hubble Space Telescope was deployed, NASA launched the first of two space shuttle missions dedicated to the study of astronomy and astrophysics. Now, three dec… [+5112 chars]"}, {"source": {"id": null, "name": "Racenet"}, "author": "Gilbert Gardiner", "title": "Apprentice jockey Heidi Gillie hopes to inspire next generation of riders with healthy lifestyle choices - NEWS.com.au", "description": "Apprentice jockey Heidi Gillie hopes to inspire next generation of riders with healthy lifestyle choices", "url": "https://www.racenet.com.au/news/apprentice-jockey-heidi-gillie-hopes-to-inspire-next-generation-of-riders-with-healthy-lifestyle-choices-20210808", "urlToImage": "https://cdn.newsapi.com.au/image/v1/46dbdc5aaf9bdb8adbc59b783b4680a2?width=1280", "publishedAt": "2021-08-09T03:46:25Z", "content": "Bareback pony races without a bridle on a dirt road in gumboots made Heidi Gillie hard to miss.But screaming past a neighbour’s dairy farm in Winslow, 20 km north of Warrnambool, as a teenager would … [+3083 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Colin Stuart", "title": "Space Junk: Is it a disaster waiting to happen? - BBC Science Focus Magazine", "description": "Experts are calling for urgent action before debris floating in orbit around the Earth triggers a runaway cascade of collisions known as the Kessler Syndrome.", "url": "https://www.sciencefocus.com/news/space-junk-is-it-a-disaster-waiting-to-happen/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2021/08/GettyImages-953160162-e574908.jpg?quality=90&crop=7px,52px,1187px,510px&resize=960,413", "publishedAt": "2021-08-09T03:00:29Z", "content": "In May 2021, a hole was found in a robotic arm aboard the International Space Station (ISS). The suspected culprit was a piece of rogue space junk. While thankfully no astronauts were injured, it has… [+4632 chars]"}, {"source": {"id": null, "name": "Theislanderonline.com.au"}, "author": "Stan Gorton", "title": "Monitoring of fire recovery nest boxes off to good start - The Islander", "description": "More pygmy possums and bats are being found in nesting boxes in and around Kangaroo Island fire ground.", "url": "https://www.theislanderonline.com.au/story/7377418/monitoring-of-fire-recovery-nest-boxes-off-to-good-start/", "urlToImage": "https://www.theislanderonline.com.au/images/transform/v1/crop/frm/YBh6smpfqc8LAq7KVtmah/de2bfd24-ea0c-47fd-a2cd-2af1d68161b3.jpg/r3_102_1022_678_w1200_h678_fmax.jpg", "publishedAt": "2021-08-09T02:27:00Z", "content": "More pygmy possums and bats are being found in nesting boxes in and around Kangaroo Island fire grounds.\r\nAnd local property owners involved in the KI Conservation Landowners Association are the ones… [+2587 chars]"}, {"source": {"id": null, "name": "Sky News Australia"}, "author": null, "title": "Victoria records 11 new cases of COVID-19 - Sky News Australia", "description": "<p>Victoria COVID-19 Taskforce Commander Jeroen Weimar says the state has recorded 11 new cases of the virus, bringing the total for the cluster to 56 infections.\n\n&ldquo;With the 56 active cases in this particular outbreak, there are five people currently in…", "url": "https://www.skynews.com.au/australia-news/victoria-records-11-new-cases-of-covid19/video/3beb4f94f34a36a8567872cce8dda5cc", "urlToImage": "https://content.api.news/v3/images/bin/60aad7f178cff691f3b1ef1bfbdf43e1", "publishedAt": "2021-08-09T02:17:42Z", "content": "Victoria COVID-19 Taskforce Commander Jeroen Weimar says the state has recorded 11 new cases of the virus, bringing the total for the cluster to 56 infections.\r\n“With the 56 active cases in this part… [+474 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "Life on the Red Planet? NASA is looking for 4 people to live inside their 3D-printed Mars module for a year - msnNOW", "description": "As NASA prepares to plan how humans would survive on the Red Planet, the space agency seeks 4 people to live in conditions similar to those on Mars.", "url": "https://www.usatoday.com/story/news/nation/2021/08/08/nasa-mars-module-3-d-printed-dune-alpha-module-rooms/5533828001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/08/09/USAT/3379050c-264e-46c3-9e5b-5e01e9aaf893-AP_Playing_Mars.jpg?auto=webp&crop=2800,1575,x150,y0&format=pjpg&width=1200", "publishedAt": "2021-08-09T02:03:44Z", "content": "It has long been a goal to get humans on Mars, and it will soon become a reality – sort of. \r\nAs the space agency prepares to plan how humans would survive on the Red Planet, NASA is looking for four… [+1893 chars]"}, {"source": {"id": null, "name": "AVweb"}, "author": null, "title": "Space Station Did 540-Degree Roll - AVweb", "description": "The upset of the International Space Station a week ago was a lot more dramatic than was first revealed and there’s now a call for an independent investigation of the incident. As we reported last week the ISS was knocked off its normal attitude when a Russia…", "url": "https://www.avweb.com/aviation-news/space-station-did-540-degree-roll/", "urlToImage": "https://s30121.pcdn.co/wp-content/uploads/2021/08/International_Space_Station_after_undocking_of_STS-132.jpg", "publishedAt": "2021-08-09T00:31:35Z", "content": "The upset of the International Space Station a week ago was a lot more dramatic than was first revealed and theres now a call for an independent investigation of the incident. As we reported last wee… [+1791 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA, Boeing Starliner launch to ISS on hold as spacecraft investigation continues - CNET", "description": "Boeing looked ready for a second attempt at getting to the space station this summer but a valve issue forced a scrub.", "url": "https://www.cnet.com/how-to/nasa-boeing-starliner-launch-to-iss-on-hold-as-spacecraft-investigation-continues/", "urlToImage": "https://www.cnet.com/a/img/gzs1F-zDKx1iPawD1kmwtQ97b0Q=/1200x630/2020/12/26/7f89aa26-6229-4d99-a9ea-186a5b345391/317188-33-cst-flip-fr01-1024x576.jpg", "publishedAt": "2021-08-09T00:11:57Z", "content": "Boeing CST-100 Starliner spacecraft sits atop a ULA Atlas V rocket in July 2021.\r\nBoeing/John Grant\r\nBoeing is hoping to launch its Starliner crew capsule for a second time in an attempt to dock with… [+4158 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Elizabeth Rayne", "title": "Could shadows on the Moon tell us where to find hidden water? - SYFY WIRE", "description": "Craters might be the obvious places to look for water on the Moon, but there are unexpected places that have been hiding in plain sight.", "url": "https://www.syfy.com/syfywire/could-shadows-on-the-moon-tell-us-where-to-find-hidden-water", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/1_surface-shadows-apollo-16.jpg", "publishedAt": "2021-08-08T23:44:06Z", "content": "Craters might be the obvious places to look for water on the Moon, but there are unexpected places that have been hiding in plain sight.\r\nThe Man in the Moon became a thing, immortalized by Georges M… [+3710 chars]"}, {"source": {"id": null, "name": "iTech Post"}, "author": "Alexandrine Ford", "title": "NASA Mars Simulation Room: How to Apply, Join Project to Live in 3D-Printed Martian Home! - iTech Post", "description": "Humans living on Mars may not be a distant idea for long. NASA is holding applications for its Mars simulation mission aimed towards simulating a year-long mission on the Red Planet. Find out if you have what it takes to apply for the mission.", "url": "https://www.itechpost.com/articles/106624/20210808/nasa-mars-simulation-room-apply-join-project-live-3d-printed.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/101185/nasa-mars-simulation-room-how-to-apply-join-project-to-live-in-3d-printed-martian-home.jpg", "publishedAt": "2021-08-08T22:46:00Z", "content": "Living on Mars may not be in the distant future any longer.\r\nNASA's Crew Health and Performance Exploration Analog, or CHAPEA, is a series of analog missions that will simulate one-year stays on the … [+3657 chars]"}, {"source": {"id": null, "name": "NBC 10 Philadelphia"}, "author": "Logan Reardon", "title": "French Astronaut Plays Saxophone From Outer Space During Closing Ceremony - NBC Southern California", "description": "A French astronaut played a saxophone from space during the Tokyo Olympics Closing Ceremony to mark the transition to the 2024 Paris Olympics.", "url": "https://www.nbcphiladelphia.com/news/sports/tokyo-summer-olympics/french-astronaut-plays-saxophone-from-outer-space-during-closing-ceremony/2919873/", "urlToImage": "https://media.nbcphiladelphia.com/2021/08/Screen-Shot-2021-08-08-at-8.46.03-AM-2-e1628428849465.png?resize=1200%2C675&quality=85&strip=all", "publishedAt": "2021-08-08T20:33:27Z", "content": "Performing your country's national anthem at the closing ceremony is a distinguished honor. But for France's Thomas Pesquet, it was even more special.\r\nPesquet, an astronaut currently in outer space,… [+778 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Former Employee Slams NASA For Not Taking Safety Seriously - Futurism", "description": "James Oberg, a former engineer at NASA’s Mission Control Center, penned an op-ed criticizing what he describes as an “eroding” safety culture.", "url": "https://futurism.com/the-byte/nasa-employee-safety-seriously", "urlToImage": "https://wp-assets.futurism.com/2021/08/space-station-incident-worse-nasa-admitted-1-1.jpg", "publishedAt": "2021-08-08T19:23:47Z", "content": "He says there's a \"cultural rot\" leading to shoddy safety standards. \r\nStronger Safety Measures\r\nIn the wake of the near disaster that occurred last week when the International Space Station (ISS) mo… [+2150 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Cristian Antonescu", "title": "The Smallest Exoplanet Ever Discovered Was Recently Found - Optic Flux", "description": "Exoplanets are pretty much everywhere out there in the vastness of the Cosmos. Almost every shiny star that we see in the night sky should have exoplanets revolving around it. But since findings exoplanets with powerful telescopes isn’t something new, finding…", "url": "https://www.opticflux.com/the-smallest-exoplanet-ever-discovered-was-recently-found/9765/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/08/night-4833149_1920.jpg", "publishedAt": "2021-08-08T18:45:20Z", "content": "Exoplanets are pretty much everywhere out there in the vastness of the Cosmos. Almost every shiny star that we see in the night sky should have exoplanets revolving around it. But since findings exop… [+1642 chars]"}, {"source": {"id": null, "name": "FOX 35 Orlando"}, "author": "FOX 35 Orlando", "title": "NASA to hire people to pretend to live on Mars for a year - FOX 13 Tampa Bay", "description": "The mission will try to stimulate problems that astronauts might encounter getting to and living on the Red Planet.", "url": "https://www.fox35orlando.com/news/nasa-to-hire-people-to-pretend-to-live-on-mars-for-a-year", "urlToImage": "https://images.foxtv.com/static.fox35orlando.com/www.fox35orlando.com/content/uploads/2021/02/1280/720/Mars-square-1.jpg?ve=1&tl=1", "publishedAt": "2021-08-08T18:34:45Z", "content": "NASA says they are hiring people to pretend to live on Mars.\r\nFour people will live in ‘Mars Dune Alpha Habitat’ for a year. That is inside the Johnson Space Center in Houston.\r\nThe mission will try … [+449 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Venom contributed to - Malaysia Sun", "description": "Venom contributed to the extraordinary diversity of insects and fishes the most species-rich invertebrate and vertebrate groups in the animal kingdom accordin", "url": "https://www.bignewsnetwork.com/news/270632325/venom-contributed-to", "urlToImage": "https://cdn.bignewsnetwork.com/ani1628431235.jpg", "publishedAt": "2021-08-08T13:55:00Z", "content": "Swansea [UK], August 8 (ANI): Venom contributed to the extraordinary diversity of insects and fishes, the most species-rich invertebrate and vertebrate groups in the animal kingdom, according to the … [+3335 chars]"}, {"source": {"id": null, "name": "Technologytimes.pk"}, "author": null, "title": "Dark Matter: One Last Push To Crack The Biggest Secret In The Universe - - Technology Times Pakistan", "description": "Dark matter accounts for around 85% of all the universe’s mass but we have not been able to detect it so far – despite building more", "url": "https://www.technologytimes.pk/2021/08/08/dark-matter-one-last-push-to-crack-the-biggest-secret-in-the-universe/", "urlToImage": "https://www.technologytimes.pk/wp-content/uploads/2021/08/Dark-matter-one-last-push-to-crack-the-biggest-secret-in-the-universe.png", "publishedAt": "2021-08-08T13:49:49Z", "content": "Dark matter accounts for around 85% of all the universes mass but we have not been able to detect it so far despite building more and more powerful detectors, said physicist Professor Chamkaur Ghag o… [+5452 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Ben Turner", "title": "NASA has glimpsed our galaxy's fate in three-way galactic brawl - Space.com", "description": "The jousting galaxies are snatching stars from each other as they spiral closer.", "url": "https://www.space.com/three-galaxies-tug-of-war", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BKR9skRxwvHS3iXX7jS5xm-1200-80.jpeg", "publishedAt": "2021-08-08T12:34:15Z", "content": "A stunning Hubble Space Telescope image of three galaxies tearing each other apart has given astronomers an early glimpse into the Milky Ways fate.\r\nLocated 389 light-years\r\n away from Earth\r\n in the… [+2436 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "An all-sky red giant star symphony - EarthSky", "description": "The TESS planet-finder and Gaia space observatory have given us tickets to a red giant star symphony, now playing in", "url": "https://earthsky.org/space/an-all-sky-red-giant-star-symphony/", "urlToImage": "https://earthsky.org/upl/2021/08/red-giant-symphony-artist-e1628362062769.png", "publishedAt": "2021-08-08T12:01:29Z", "content": "Red giant star symphony\r\nNASA released the video above on August 4, 2021. It plays the rhythms of three red giant stars in the direction of the constellation Draco the Dragon. These stars are just a … [+6026 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "NASA celebrates Juno's 10 birthday by extending the life of its mission - Firstpost", "description": "After extending its mission in June 2018, NASA again extended Juno's mission this year till September 2025", "url": "https://www.firstpost.com/tech/science/nasa-celebrates-junos-10-birthday-by-extending-the-life-of-its-mission-9872451.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/09/juno.jpg", "publishedAt": "2021-08-08T11:04:51Z", "content": "FP TrendingAug 08, 2021 16:34:51 IST\r\nThe space probe by the National Aeronautics and Space Administration (NASA), Juno completed a decade of its launch on Thursday, 5 August. It was the year 2011 wh… [+1651 chars]"}, {"source": {"id": null, "name": "Newsnetnebraska.org"}, "author": "Karen Hines", "title": "A huge structure has been discovered in our galaxy, but we don't know what it is - News Net Nebraska", "description": "It is not easy to study the galaxy from our location within the Milky Way, which is why scientists often find themselves in \"difficulty\" with discoveries.", "url": "https://www.newsnetnebraska.org/a-huge-structure-has-been-discovered-in-our-galaxy-but-we-dont-know-what-it-is/", "urlToImage": null, "publishedAt": "2021-08-08T05:23:24Z", "content": "It is not easy to study the galaxy from our location within the Milky Way, which is why scientists often find themselves in “difficulty” with discoveries. For example a new structure called catelIt w… [+1510 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "New study sheds light on mysterious dimming of supergiant star - CGTN", "description": "", "url": "https://news.cgtn.com/news/2021-08-08/New-study-sheds-light-on-mysterious-dimming-of-supergiant-star-12yeGnlpYBO/index.html", "urlToImage": "https://news.cgtn.com/news/2021-08-08/New-study-sheds-light-on-mysterious-dimming-of-supergiant-star-12yeGnlpYBO/img/86d6b778e67145ef9917415599d3bcbe/86d6b778e67145ef9917415599d3bcbe-250.png", "publishedAt": "2021-08-08T01:48:26Z", "content": "A new study led by Chinese astronomers has shed light on the mysterious dimming of Betelgeuse, the brightest reddish star located in the shoulder of the Orion constellation.\r\nFrom October 2019 to Feb… [+1174 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Angela Dewan", "title": "Destabilizing currents in the Atllantic could have serious impacts on our weather: scientists - CTV News", "description": "A crucial system of currents in the Atlantic Ocean that helps control temperatures in the Northern Hemisphere and has implications for the entire planet's weather systems is showing signs of instability due to human-made climate change, scientists say.", "url": "https://www.ctvnews.ca/climate-and-environment/destabilizing-currents-in-the-atlantic-could-have-serious-impacts-on-our-weather-scientists-1.5538653", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5538663.1628376630!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-08-07T22:52:12Z", "content": "A crucial system of currents in the Atlantic Ocean that helps control temperatures in the Northern Hemisphere and has implications for the entire planet's weather systems is showing signs of instabil… [+4231 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "BREAKTHROUGH: Aussie scientists capture first moments of exploding giant star 100 TIMES bigger than the sun - 7NEWS.com.au", "description": "Supernovas create the elements that make up our universe - this is the first time anybody has had such a close look.", "url": "https://7news.com.au/technology/space/star-100-times-bigger-than-sun-explodes-c-3602215", "urlToImage": "https://images.7news.com.au/publication/C-3602215/f6cc0ebb006d9bd8509814e3ab102e5f91d0e22f-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2021-08-05T06:07:36Z", "content": "Australian astronomers have captured never-before-seen photos of an exploding giant star, 100 times bigger than the sun.\r\nThe imagery of the supernova shows a powerful burst of light as a shockwave t… [+1701 chars]"}]}