{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "ASTRONAUT DISCUSSES LIFE ABOARD THE SPACE STATION WITH WASHINGTON STATE GOVENOR - NASA Video", "description": "Aboard the International Space Station, NASA Expedition 66 Flight Engineer Kayla Barron discussed living and working in space during an in-flight interview D...", "url": "https://www.youtube.com/watch?v=4PBLkyhEgdE", "urlToImage": "https://i.ytimg.com/vi/4PBLkyhEgdE/maxresdefault.jpg", "publishedAt": "2021-12-21T18:03:42Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Inside The Modern Marvel That Could Reshape Our Understanding Of The Universe - NBC News", "description": "The James Webb Space Telescope is set to reshape our understanding of the universe. The successor to the Hubble telescope has taken more than 30 years, almos...", "url": "https://www.youtube.com/watch?v=OwCLbJ3EXDo", "urlToImage": "https://i.ytimg.com/vi/OwCLbJ3EXDo/maxresdefault.jpg", "publishedAt": "2021-12-21T18:00:07Z", "content": null}, {"source": {"id": null, "name": "Bordermail.com.au"}, "author": "Marcia Dunn", "title": "SpaceX to deliver Xmas to space station - The Border Mail", "description": "SpaceX launched Christmas gifts, goodies and supplies to the International Space Station and got a present in return: the company's 100th successful rocket la...", "url": "https://www.bordermail.com.au/story/7560958/spacex-to-deliver-xmas-to-space-station/", "urlToImage": "https://www.bordermail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/f301d05b-e583-4e11-8b74-3abbbb0f0ae6.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-12-21T17:56:24Z", "content": ""}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jennifer Chu", "title": "Engineers test an idea for a new hovering rover - Phys.org", "description": "Aerospace engineers at MIT are testing a new concept for a hovering rover that levitates by harnessing the moon's natural charge.", "url": "https://phys.org/news/2021-12-idea-rover.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/engineers-test-an-idea.jpg", "publishedAt": "2021-12-21T16:02:48Z", "content": "Aerospace engineers at MIT are testing a new concept for a hovering rover that levitates by harnessing the moon's natural charge.\r\nBecause they lack an atmosphere, the moon and other airless bodies s… [+7151 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Fion Waisum Ma", "title": "Dinosaur embryo discovery: rare fossil suggests dinosaurs had similar pre-hatching posture to modern birds - The Conversation UK", "description": "The little dinosaur is curled up inside its shell the same way birds do before hatching, shedding new light on the link between the behaviour of dinosaurs and modern birds.", "url": "https://theconversation.com/dinosaur-embryo-discovery-rare-fossil-suggests-dinosaurs-had-similar-pre-hatching-posture-to-modern-birds-174040", "urlToImage": "https://images.theconversation.com/files/438507/original/file-20211220-129369-6gd4rf.jpg?ixlib=rb-1.1.0&rect=35%2C341%2C4000%2C2000&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-12-21T16:02:45Z", "content": "Dinosaur embryos are key to our understanding of how dinosaurs developed. But theyre also very rare. While remains of dinosaur embryos have been discovered occasionally over recent decades, most of t… [+3994 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "Floating 'aerobats' could be the best way to explore the cloud tops of Venus - Phys.org", "description": "According to multiple lines of evidence, Venus was once a much different planet than it is today. But roughly 500 million years ago, a massive resurfacing event triggered a runaway greenhouse effect that led to the poisonous and hellish environment we see the…", "url": "https://phys.org/news/2021-12-aerobats-explore-cloud-tops-venus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/floating-aerobats-coul.jpg", "publishedAt": "2021-12-21T13:35:35Z", "content": "According to multiple lines of evidence, Venus was once a much different planet than it is today. But roughly 500 million years ago, a massive resurfacing event triggered a runaway greenhouse effect … [+8481 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Imaginary numbers could be needed to describe reality, new studies find - Livescience.com", "description": "Theories based only on real numbers are incapable of explaining the results of this new experiment.", "url": "https://www.livescience.com/imaginary-numbers-needed-to-describe-reality", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NnJg9UzuJ726ueezCuuu5F-1200-80.jpg", "publishedAt": "2021-12-21T13:35:00Z", "content": "Imaginary numbers\r\n are necessary to accurately describe reality, two new studies have suggested.\r\nImaginary numbers are what you get when you take the square root of a negative number, and they have… [+4965 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Earth is spinning FASTER now than it was 50 years ago, scientists say - Daily Mail", "description": "Now, UK National Physical Laboratory scientist, Peter Whibberley, has warned that if the rotation rate increases further, a negative leap second may be needed.", "url": "https://www.dailymail.co.uk/sciencetech/article-10332345/Earth-spinning-FASTER-50-years-ago-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/12/21/13/52062037-0-image-a-20_1640091838831.jpg", "publishedAt": "2021-12-21T13:17:07Z", "content": "Earth is spinning faster than it was half a century ago, and if it continues speeding up scientists say they may have to remove a second from the atomic clock. \r\nThe speed our planet rotates on its a… [+6957 chars]"}, {"source": {"id": null, "name": "Uconn.edu"}, "author": null, "title": "Looking at Factors that Accelerate Mass Extinction in the Fossil Record as Climate Changes - UConn Today - UConn Today", "description": "Finding clues to the present in what happened 372 million years ago", "url": "https://today.uconn.edu/2021/12/looking-at-factors-that-accelerate-mass-extinction-in-the-fossil-record-as-climate-changes/", "urlToImage": "https://uconn-today-universityofconn.netdna-ssl.com/wp-content/uploads/2021/12/Floweria_chemungensis-1024x683.jpg", "publishedAt": "2021-12-21T12:30:44Z", "content": "The Late Devonian mass extinction (roughly 372 million years ago) was one of five mass extinctions in Earth’s history, with roughly 75% of all species disappearing over its course. It happened in two… [+5272 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Astronomers detect signature of magnetic field on an exoplanet - newsconcerns", "description": "Hubble’s observations of an extended region of charged carbon particles that surround the exoplanet HAT-P-11b and streaming away in a long tail are best explained by magnetic field, th", "url": "https://newsconcerns.com/astronomers-detect-signature-of-magnetic-field-on-an-exoplanet/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/astronomers-detect-sig.jpg", "publishedAt": "2021-12-21T12:26:18Z", "content": "Researchers have identified the first signature of a magnetic field surrounding a planet outside of our solar system. Earth’s magnetic field acts as a shield against energetic particles from the sun … [+6256 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "What it looks like to land on Mars and other space discoveries in 2021 - CNN", "description": "Mars was explored in depth by three separate missions this year, while other scientists found a wealth of new planets, took images of black holes, spied the violent side of the universe, took a tour of our solar system, and more.", "url": "https://www.cnn.com/2021/12/21/world/space-discoveries-2021-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211007141803-03-perseverance-rover-river-delta-super-tease.jpg", "publishedAt": "2021-12-21T11:14:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jason Dasey", "title": "Giant millipede fossil found on UK beach by accident reveals 'world's biggest bug', weighing 50kg - ABC News", "description": "A 50 kilogram millipede fossil is unearthed when a block of sandstone is crushed open at Northumberland, in England's north-east, revealing a meat-eating creature that was 2.5m long and lived more than 100 million years before the dinosaurs.", "url": "https://www.abc.net.au/news/2021-12-21/largest-ever-millipede-fossil-found-on-uk-beach-by-accident/100718026", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/ad262ee908e31bc37207954cd6794300?impolicy=wcms_crop_resize&cropH=2592&cropW=4608&xPos=0&yPos=78&width=862&height=485", "publishedAt": "2021-12-21T10:32:48Z", "content": "It may have been \"a complete fluke\", but some United Kingdom scientists believe the discovery of a giant fossil at an English beach has unearthed the world's biggest-ever bug.\r\n<ul><li>The millipede … [+3111 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Donna Lu", "title": "‘Exhilarating’ experiment: Australian students send bacteria into space to make yoghurt - The Guardian", "description": "Home-brewed yoghurt on International Space Station may be just a small leap for a group of budding scientists", "url": "https://amp.theguardian.com/education/2021/dec/21/exhilarating-experiment-australian-students-send-bacteria-into-space-to-brew-yoghurt", "urlToImage": null, "publishedAt": "2021-12-21T08:55:00Z", "content": "ScienceHome-brewed yoghurt on International Space Station may be just a small leap for a group of budding scientists\r\nAustralian high school students are sending bacteria into space in an experiment … [+3704 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Monica Grady", "title": "Material from asteroid Ryugu starts to give up secrets of early Solar System - The Conversation UK", "description": "We may be on the brink of discovering whether water and organic material, which enabled life on Earth, came from asteroids.", "url": "https://theconversation.com/material-from-asteroid-ryugu-starts-to-give-up-secrets-of-early-solar-system-173884", "urlToImage": "https://images.theconversation.com/files/438219/original/file-20211217-27-surhp3.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-12-21T07:53:49Z", "content": "Just over a year ago, material from the Japanese Hayabusa 2 mission to Asteroid (162173) Ryugu arrived back on Earth . And this week, the first twopapers reporting analysis of the material have been … [+6041 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Are black holes and dark matter the same? — ScienceDaily - newsconcerns", "description": "Proposing an alternative model for how the universe came to be, a team of astrophysicists suggests that all black holes -- from those as tiny as a pin head to those covering billions of miles -- were created instantly after the Big Bang and account f", "url": "https://newsconcerns.com/are-black-holes-and-dark-matter-the-same-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-21T06:50:19Z", "content": "Proposing an alternative model for how the universe came to be, a team of astrophysicists suggests that all black holes — from those as tiny as a pin head to those covering billions of miles — were c… [+4986 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Air bubbles in Antarctic ice point to a cause of oxygen decline - newsconcerns", "description": "Yuzhen Yan in Antarctica in December 2015. Credit: Yuzhen Yan                        An unknown culprit has been removing oxygen from our atmosphere for at least 800,000 years, and an", "url": "https://newsconcerns.com/air-bubbles-in-antarctic-ice-point-to-a-cause-of-oxygen-decline/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/air-bubbles-in-antarct.jpg", "publishedAt": "2021-12-21T05:54:21Z", "content": "An unknown culprit has been removing oxygen from our atmosphere for at least 800,000 years, and an analysis of air bubbles preserved in Antarctic ice for up to 1.5 million years has revealed the like… [+4518 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "NASA reveals launch date for its first space tourism mission to ISS - Digital Trends", "description": "NASA this week announced the target date for the launch of its first space tourism mission to the International Space Station.", "url": "https://www.digitaltrends.com/news/nasa-reveals-date-for-its-first-space-tourism-mission-to-iss/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/ecrjc7wu0aehv66.jpg", "publishedAt": "2021-12-21T05:45:08Z", "content": "NASA is aiming to launch its first space tourism mission to the International Space Station (ISS) on February 28, 2022.\r\nThe mission is being organized by Texas-based Axiom Space and will use SpaceXs… [+2903 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Frozen tardigrade becomes first ‘quantum entangled’ animal in history, researchers claim - newsconcerns", "description": "Tardigrades — those microscopic, plump-bodied critters lovingly known as \"moss piglets\" — have been put through the ringer for science. The amazingly durable creatures have been shot out of guns, bathed in boiling-hot water, exposed to intense ultrav", "url": "https://newsconcerns.com/frozen-tardigrade-becomes-first-quantum-entangled-animal-in-history-researchers-claim/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mD3rTewiiFydzx3Utj4rJm-1200-80.jpg", "publishedAt": "2021-12-21T02:52:18Z", "content": "Tardigrades those microscopic, plump-bodied critters lovingly known as “moss piglets” have been put through the ringer for science. The amazingly durable creatures have been shot out of guns\r\n, bathe… [+5430 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Amy Thompson", "title": "Russian cosmonaut Anna Kikina will fly on SpaceX's Crew-5 mission to the International Space Station - Space.com", "description": "NASA and the Russian space agency Roscosmos are finalizing an agreement to launch the first cosmonaut on a SpaceX Crew Dragon spacecraft, agency officials confirmed on Monday (Dec. 20).", "url": "https://www.space.com/cosmonaut-anna-kikina-spacex-crew-5-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GLPyFM78GqUmDVaGvz8KJW-1200-80.jpg", "publishedAt": "2021-12-21T01:13:19Z", "content": "CAPE CANAVERAL, Fla. — NASA and the Russian space agency Roscosmos are finalizing an agreement to launch the first cosmonaut on a SpaceX Crew Dragon spacecraft, agency officials confirmed on Monday (… [+3348 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals chromosome-level changes that relate to drug resistance in melanoma - News-Medical.Net", "description": "Precision therapies targeting melanoma and other cancers have improved patient survival, but tumors often stop responding to drugs, and recent studies point to changes in DNA – both inside and outside chromosomes – as a driving factor in tumor genesis as well…", "url": "https://www.news-medical.net/news/20211220/Study-reveals-chromosome-level-changes-that-relate-to-drug-resistance-in-melanoma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Chromosome-620x480.jpg", "publishedAt": "2021-12-20T23:47:00Z", "content": "Precision therapies targeting melanoma and other cancers have improved patient survival, but tumors often stop responding to drugs, and recent studies point to changes in DNA – both inside and outsid… [+7116 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Delays Launch of Its Megarocket in Wake of Testing Glitch - Gizmodo Australia", "description": "A misbehaving engine computer means the inaugural launch of NASA’s Space Launch System, planned to be the most powerful rocket...", "url": "https://www.gizmodo.com.au/2021/12/nasa-delays-megarocket-launch/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/12/21/c311eab9295c806c1e9151f9fe265e4c.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2021-12-20T23:25:00Z", "content": "A misbehaving engine computer means the inaugural launch of NASAs Space Launch System, planned to be the most powerful rocket in the world, wont happen in February 2022 as planned.\r\nThe fully stacked… [+2933 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Darrell Etherington", "title": "Max Q: SpaceX launches two Falcon 9s in one day for the first time - Yahoo Lifestyle Australia", "description": "SpaceX launched another batch of its Starling satellites from its launch facility at Vandenberg Space Force Base on Saturday morning, then followed that up...", "url": "https://au.lifestyle.yahoo.com/max-q-spacex-launches-two-230020999.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/pE26N_kAskPLVRkdf4Hx0Q--~B/aD01MzQ7dz05NDY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/245488196d431ca2ab9e4bec08189bd0", "publishedAt": "2021-12-20T23:00:20Z", "content": "Hi, and welcome to Max Q, it's your former newsletter writer now returned while Aria is out. We just wrapped our TC Sessions: Space 2021 event, but as is often the case in the space biz, things aren'… [+3142 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Shoots and roots respond differently to climate change — ScienceDaily - newsconcerns", "description": "A new synthesis conducted by a group of international scientists including Madhav P. Thakur from the University of Bern reveals mismatches between above- and belowground plant phenology due to climate change. These findings are important to understan", "url": "https://newsconcerns.com/shoots-and-roots-respond-differently-to-climate-change-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-20T22:26:16Z", "content": "A new synthesis conducted by a group of international scientists including Madhav P. Thakur from the University of Bern reveals mismatches between above- and belowground plant phenology due to climat… [+5177 chars]"}, {"source": {"id": null, "name": "My Modern Met"}, "author": null, "title": "NASA's Incredible Time-Lapse Footage from Within the Sun's Corona - My Modern Met", "description": "Sit back and take a trip to the Sun.", "url": "https://mymodernmet.com/?p=473841", "urlToImage": "https://mymodernmet.com/wp/wp-content/uploads/2021/12/parker-timelapse-thumbnail.jpg", "publishedAt": "2021-12-20T21:46:03Z", "content": "NASA's Parker Solar Probe recently made history by flying into the Sun's atmosphere. By “touching the Sun,” the spacecraft is bringing us a plethora of new information about this central part of our … [+2637 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Karen Zamora", "title": "Finally, scientists have found a true millipede - KMUW", "description": "Scientists have finally found a millipede that lives up to its name. Eumillipes persephone has 1,306 legs — that's more than any other animal — and is the only known millipede to exceed 1,000 legs.", "url": "https://www.npr.org/2021/12/20/1066017155/finally-scientists-have-found-a-true-millipede", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2021-12-20T21:33:40Z", "content": "Scientists have finally found a millipede that lives up to its name. Eumillipes persephone has 1,306 legs that's more than any other animal and is the only known millipede to exceed 1,000 legs.AILSA … [+3098 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "‘Extraordinary’ Mammoth Graveyard Discovered in England - Gizmodo Australia", "description": "Evidence of steppe mammoths, gigantic elk, brown bears, and other ice age animals have been pulled from an English quarry,...", "url": "https://www.gizmodo.com.au/2021/12/extraordinary-mammoth-graveyard-discovered-in-england/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/12/21/abf1be728c3c1b857dc153882ea5aa5c-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2021-12-20T20:56:00Z", "content": "Evidence of steppe mammoths, gigantic elk, brown bears, and other ice age animals have been pulled from an English quarry, in what experts are calling a significant discovery.\r\nFinding mammoth bones … [+3648 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Bigger, more powerful successor to the Hubble Telescope to take to the skies - The bharat express news", "description": "CAPE CANAVERAL, Fla. (TBEN) - The successor to the Hubble Space Telescope is a time-traveling wonder, capable of peering a hair's breadth of the dawn of", "url": "https://www.thebharatexpressnews.com/bigger-more-powerful-successor-to-the-hubble-telescope-to-take-to-the-skies/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.4g1P_volqrEf.ZnA97qZA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://s.yimg.com/uu/api/res/1.2/OChcK.4xCh.GykWgvTG8iA--~B/aD0yNjYyO3c9NDAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/13a9b4b38133e49ce9d48f17baae4eac", "publishedAt": "2021-12-20T18:32:43Z", "content": "CAPE CANAVERAL, Fla. (TBEN) – The successor to the Hubble Space Telescope is a time-traveling wonder, capable of peering a hair’s breadth of the dawn of the universe. And he’s finally on the verge of… [+5893 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "John Loeffler", "title": "Earth's 'black box' will be ready to observe our demise due to climate catastrophe - TechRadar", "description": "New project will record climate data (and news accounts of our inaction)", "url": "https://www.techradar.com/news/earths-black-box-will-be-ready-to-observe-our-demise-due-to-climate-catastrophe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bBDJ6P7HuGXkPBKjUkftLh-1200-80.jpg", "publishedAt": "2021-12-20T18:23:07Z", "content": "A new collaborative project in Tasmania is planning to build a \"black box\" for the planet, observing and recording data on the worsening climate crisis -- as well as our efforts to avert climate chan… [+4126 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Jupiter moon sounds like a dial-up modem in eerie NASA audio - CNET", "description": "Is that a dial-up modem or a celestial body?", "url": "https://www.cnet.com/news/eerie-nasa-audio-lets-you-hear-what-jupiter-moon-ganymede-sounds-like/", "urlToImage": "https://www.cnet.com/a/img/DElwQuO0xOta12rbkmmUg6BAHV4=/1200x630/2021/07/16/dcbb338b-e090-4c51-bc21-8884bf3693b5/ganymedeflybystill.jpg", "publishedAt": "2021-12-20T18:03:56Z", "content": "Ganymede poses in a still from a NASA Juno flyby animation.\r\nVideo screenshot by Amanda Kooser/CNET\r\nWhat does a moon sound like? NASA has an answer thanks to the Juno spacecraft. Juno took a swing b… [+1880 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Toxic microbes caused the largest metazoan extinction in Earth’s history - Tech Explorist", "description": "Toxic microbe burps caused mass extinction.", "url": "https://www.techexplorist.com/toxic-microbes-caused-largest-metazoan-extinction-earths-history/43389/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/12/landscape.jpeg", "publishedAt": "2021-12-20T17:37:16Z", "content": "Extreme warming at the end-Permian induced profound changes in marine biogeochemical cycling and animal habitability. These changes led to the largest metazoan extinction in Earth’s history. However,… [+3455 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "New technique that images every pigment cell of a whole zebrafish - Tech Explorist", "description": "New technique visualizes every pigment cell of zebrafish in 3D.", "url": "https://www.techexplorist.com/new-technique-images-every-pigment-cell-whole-zebrafish/43384/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/12/melanin-in-a-zebrafish.jpg", "publishedAt": "2021-12-20T17:13:39Z", "content": "The zebrafish (Danio rerio) is an important vertebrate model organism. One of the most readily observable phenotypes in the zebrafish is its distinctive pigmentation patterning, which, in wild-type a… [+1553 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "3D printed nanomagnets unveil a world of patterns in the magnetic field - Phys.org", "description": "Scientists have used state-of-the-art 3D printing and microscopy to provide a new glimpse of what happens when taking magnets to three-dimensions on the nanoscale—1000 times smaller than a human hair.", "url": "https://phys.org/news/2021-12-3d-nanomagnets-unveil-world-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/3d-printed-nanomagnets.jpg", "publishedAt": "2021-12-20T16:00:06Z", "content": "Scientists have used state-of-the-art 3D printing and microscopy to provide a new glimpse of what happens when taking magnets to three-dimensions on the nanoscale1000 times smaller than a human hair.… [+5226 chars]"}, {"source": {"id": null, "name": "Kalkine Media"}, "author": null, "title": "What is special about NASA’s new James Webb telescope? - Kalkine Media", "description": "Highlights\r\n\r\nNASA’s James Webb Space Telescope is an orbiting observatory set to launch at 07:20 am EST on Dec 24, 2021. \r\nThe telescope w...", "url": "https://kalkinemedia.com/news/world-news/what-is-special-about-nasas-new-james-webb-telescope", "urlToImage": "https://cdn.kalkinemedia.com/image/0854993d1eb243e380c18d3f3063070d/image.jpg", "publishedAt": "2021-12-20T15:50:56Z", "content": "NASA’s James Webb Space Telescope (JWST), an orbiting infrared observatory, is set for launch at 07:20 am EST on Dec 24, 2021. The telescope has superior capabilities and is expected to help extend t… [+2914 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Exploring factors impacting the sensitivity of amorphous oxide semiconductors to externally induced impurities - Phys.org", "description": "In recent years, electronics engineers have been trying to broaden the pool of available semiconducting materials, to enable the development of a wider range of devices. One emerging class of semiconductors are amorphous oxide semiconductors (AOSs), which are…", "url": "https://phys.org/news/2021-12-exploring-factors-impacting-sensitivity-amorphous.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/exploring-factors-impa.jpg", "publishedAt": "2021-12-20T15:30:01Z", "content": "In recent years, electronics engineers have been trying to broaden the pool of available semiconducting materials, to enable the development of a wider range of devices. One emerging class of semicon… [+5767 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "New Artificial Photosynthesis Device Component with Better Longevity and Stability - AZoCleantech", "description": "A group of researchers has built a new artificial photosynthesis device component with extraordinary longevity and stability as it selectively turns sunlight and carbon dioxide into two favorable sources of renewable fuels — hydrogen and ethylene.", "url": "https://www.azocleantech.com/news.aspx?newsID=30884", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_30884_16400018319638256.jpg", "publishedAt": "2021-12-20T15:22:00Z", "content": "A group of researchers has built a new artificial photosynthesis device component with extraordinary longevity and stability as it selectively turns sunlight and carbon dioxide into two favorable sou… [+6131 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Katleen Gabriels", "title": "Phosphorus nanoribbons improve solar cells' efficiency - Innovation Origins", "description": "Solar cells increase their efficiency with phosphorene nanoribbons, a study shows.", "url": "https://innovationorigins.com/en/selected/phosphorus-nanoribbons-improve-solar-cells-efficiency/", "urlToImage": "https://innovationorigins.com/app/uploads/2021/12/alternative-gb0345035a_1920.jpg", "publishedAt": "2021-12-20T13:30:00Z", "content": "Researchers have incorporated phosphorene nanoribbons into new types of solar cells, dramatically improving their efficiency.\r\nPhosphorene nanoribbons (PNRs) are ribbon-like strands of the 2D materia… [+3452 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "Orbiter discovers 'significant amounts of water' in Grand Canyon-like area of Mars - USA TODAY", "description": "An orbiter from the European Space Agency detected an area of water about the size of the Netherlands underneath Mars' surface.", "url": "https://www.usatoday.com/story/news/world/2021/12/20/mars-water-under-grand-canyon/8962396002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/df6c728a4846a8a537bf332523df1f99093c2fb9/c=0-1153-7000-5108/local/-/media/2018/03/20/USATODAY/usatsports/xxx_xx90_mars_1030_95197447.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2021-12-20T12:25:47Z", "content": "A researcher orbiter circling around Mars has discovered \"significant amounts of water\" underneath the surface of an area on the red planet similar to the Grand Canyon, according to the European Spac… [+3690 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Human cells rocket into space to explore the secrets of ageing - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://dsf.newscorpaustralia.com/theaustralian/subscription/", "urlToImage": null, "publishedAt": "2021-12-20T08:25:00Z", "content": null}, {"source": {"id": null, "name": "9News"}, "author": "CNN", "title": "Critical ice shelf holding back 'Doomsday glacier' could shatter sooner than thought - 9News", "description": "<p>The glacier, which equals the size of Florida or Great Britain, already accounts for about 4 per cent of annual global sea level rise.</p>", "url": "https://www.9news.com.au/wild-weather/thwaites-glacier-critical-ice-shelf-holding-back-doomsday-glacier-could-shatter-in-next-five-years-scientists-warn/f31d57d1-8e67-4390-a2ec-375e6ded83ff", "urlToImage": "https://imageresizer.static9.net.au/q3BZYhAC_aBM35j8XZlVBXK8KnQ=/3x0:3644x2048/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F8958d081-966b-4c85-bd15-60c32381ea70", "publishedAt": "2021-12-20T05:19:53Z", "content": "Property News: House prices in some school catchments explode by up to $367,000 - domain.com.au"}]}