{"status": "ok", "totalResults": 44, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A New Measurement of Quantum Space-Time Has Found Nothing Going On - ScienceAlert", "description": "In the very smallest measured units of space and time in the Universe, not a lot is going on. In a new search for quantum fluctuations of space-time on Planck scales, physicists have found that everything is smooth.", "url": "https://www.sciencealert.com/a-new-measurement-of-quantum-space-time-has-found-nothing-going-on", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/holometer_1024.jpg", "publishedAt": "2021-02-16T22:09:52Z", "content": "In the very smallest measured units of space and time in the Universe, not a lot is going on. In a new search for quantum fluctuations of space-time on Planck scales, physicists have found that every… [+4394 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Updates Coverage of Space Station Cargo Ship Docking - NASA", "description": "In response to a winter storm currently affecting NASA personnel and broadcast capabilities in Texas, NASA is adjusting coverage of the arrival and docking of a Russian cargo spacecraft to the International Space Station.", "url": "https://www.nasa.gov/press-release/nasa-updates-coverage-of-international-space-station-cargo-ship-docking/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/40577160923_5af05a505e_k.jpg", "publishedAt": "2021-02-16T21:32:15Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Chris James", "title": "'7 minutes of terror': a look at the technology Perseverance will need to survive landing on Mars - The Conversation US", "description": "Perseverance follows in the tracks of Curiosity. The latter's touchdown on Martian soil in 2012 marked the first successful use of several pioneering space technologies.", "url": "https://theconversation.com/7-minutes-of-terror-a-look-at-the-technology-perseverance-will-need-to-survive-landing-on-mars-155046", "urlToImage": "https://images.theconversation.com/files/384379/original/file-20210216-19-4u9nb.jpg?ixlib=rb-1.1.0&rect=0%2C643%2C10240%2C5120&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-16T18:50:00Z", "content": "This month has been a busy one for Mars exploration. Several countries sent missions to the red planet in June last year, taking advantage of a launch window. Most have now arrived after their eight-… [+7342 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Highest-Resolution Images of DNA Reveal It’s Surprisingly Jiggly - Gizmodo Australia", "description": "Scientists have captured the highest-resolution images ever taken of DNA, revealing previously unseen twisting and squirming behaviours. Deoxyribonucleic acid, otherwise known as DNA, can be surprisingly active when crammed and contorted inside a cell, accord…", "url": "https://www.gizmodo.com.au/2021/02/highest-resolution-images-of-dna-reveal-its-surprisingly-jiggly/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/17/zazxetcihwb2ulh3xwmo.gif?ar=16%3A9&fit=crop&q=65&w=1280&fm=jpg", "publishedAt": "2021-02-16T18:35:00Z", "content": "Scientists have captured the highest-resolution images ever taken of DNA, revealing previously unseen twisting and squirming behaviours.\r\nDeoxyribonucleic acid, otherwise known as DNA, can be surpris… [+2859 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jonathan O'Callaghan", "title": "Something Crashed Into Jupiter Last Year - And A NASA Spacecraft Saw It Happen - Forbes", "description": "NASA’s Juno spacecraft likely witnessed the moment an asteroid or comet slammed into Jupiter and disintegrated in its atmosphere, according to a team of researchers.", "url": "https://www.forbes.com/sites/jonathanocallaghan/2021/02/16/something-crashed-into-jupiter-last-yearand-a-nasa-spacecraft-saw-it-happen/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F602c0a8924667be94be1a8f4%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D1399%26cropY1%3D61%26cropY2%3D994", "publishedAt": "2021-02-16T18:16:40Z", "content": "Jupiter, seen by Juno in May 2019.\r\nKevin M. Gill/NASA/JPL-Caltech/SwRI/MSSS\r\nNASAs Juno spacecraft likely witnessed the moment an asteroid or comet slammed into Jupiter and disintegrated in its atmo… [+3333 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Kagome graphene promises exciting properties - Science Daily", "description": "For the first time, physicists have produced a graphene compound consisting of carbon atoms and a small number of nitrogen atoms in a regular grid of hexagons and triangles. This honeycomb-structured ''kagome lattice'' behaves as a semiconductor and may also …", "url": "https://www.sciencedaily.com/releases/2021/02/210216100134.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-16T17:37:02Z", "content": "For the first time, physicists from the University of Basel have produced a graphene compound consisting of carbon atoms and a small number of nitrogen atoms in a regular grid of hexagons and triangl… [+3785 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Graphene 'nano-origami' creates tiniest microchips yet: Nanomaterial developments could lead to computers and phones running thousands of times faster - Science Daily", "description": "Experimental physicists have developed the smallest microchips ever - 100 times smaller than conventional microchips. They believe that this next generation of microchips could lead to computers and phones running thousands of times faster.", "url": "https://www.sciencedaily.com/releases/2021/02/210216100141.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-16T17:27:29Z", "content": "The tiniest microchips yet can be made from graphene and other 2D-materials, using a form of 'nano-origami', physicists at the University of Sussex have found.This is the first time any researchers h… [+1809 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Planet Nine at edge of solar system ‘could be an illusion’, new research suggests - Yahoo News Australia", "description": "New research has dealt a blow to the idea that a huge planet which has never been seen by human eyes could be lurking unseen at the edge of our solar system.", "url": "https://au.news.yahoo.com/planet-nine-solar-system-illusion-172655707.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/d5467e60-707a-11eb-8adb-6b6c1754f612", "publishedAt": "2021-02-16T17:26:00Z", "content": "Is there a huge hidden planet at the edge of the solar system (NASA)\r\nNew research has dealt a blow to the idea that a huge planet which has never been seen by human eyes\r\n could be lurking unseen at… [+2775 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Astra approved! But do we have a boomer problem? - ABC News", "description": "The Oxford AstraZeneca vaccine has been approved for use in Australia, but it comes with fine print around who should get it. In its approval, the Therapeutic Goods Administration noted that the \"decision to immunise an elderly patient should be decided on a …", "url": "https://www.abc.net.au/radio/programs/coronacast/astra-approved-but-do-we-have-a-boomer-problem/13161284", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=4", "publishedAt": "2021-02-16T17:01:00Z", "content": "The Oxford AstraZeneca vaccine has been approved for use in Australia, but it comes with fine print around who should get it.\r\nIn its approval, the Therapeutic Goods Administration noted that the \"de… [+434 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Annabelle Williams", "title": "SpaceX successfully launched more Starlink internet satellites, but lost a rocket booster in the process. - Business Insider Australia", "description": "The rocket booster was supposed to land on a ship waiting in the Atlantic Ocean.", "url": "https://www.businessinsider.com.au/spacex-starlink-internet-falcon-9-launch-elon-musk-2021-2", "urlToImage": "https://i.insider.com/5fac69db7f8f4200182a6699?format=jpeg", "publishedAt": "2021-02-16T16:49:31Z", "content": "Despite a successful launch of 60 satellites, SpaceX’s Falcon 9 rocket’s booster did not successfully complete its landing on Monday.\r\nThe launch marked the sixth flight for Falcon 9 as it set out to… [+2054 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Sponges, Other Animals Discovered Deep Beneath Antarctic Ice Shelves - AZoCleantech", "description": "A new study published recently in the Frontiers in Marine Science journal reports that there is more life than predicted far beneath the Antarctic ice shelves.", "url": "https://www.azocleantech.com/news.aspx?newsID=28869", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28869_16134758482006176.jpg", "publishedAt": "2021-02-16T15:57:00Z", "content": "Written by AZoCleantechFeb 16 2021\r\nA new study published recently in the Frontiers in Marine Science journal reports that there is more life than predicted far beneath the Antarctic ice shelves.\r\nBr… [+4006 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Climate Change Could Have Helped Dinosaurs Migrate from South America to Greenland - AZoCleantech", "description": "A new article has refined the estimates of when herbivorous or plant-eating dinosaurs could have crossed North America on a northerly journey to reach Greenland, and pointed out an interesting climatic occurrence that could have aided these animals along the …", "url": "https://www.azocleantech.com/news.aspx?newsID=28870", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28870_16134761332029929.jpg", "publishedAt": "2021-02-16T15:41:00Z", "content": "Written by AZoCleantechFeb 16 2021\r\nA new article has refined the estimates of when herbivorous or plant eating dinosaurs could have crossed North America on a northerly journey to reach Greenland, a… [+5549 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Matthew S. Williams", "title": "Growing Plants in Alien Soil: How Will Future Missions Feed Astronauts - Interesting Engineering", "description": "Our species is determined to make extraterrestrial agriculture sustainable. No matter what.", "url": "https://interestingengineering.com/growing-plants-in-alien-soil-how-will-future-missions-feed-astronauts", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Lg6EyJ7M6N/sizes/space-agri-header_md.jpg", "publishedAt": "2021-02-16T15:19:29Z", "content": "In three years, NASA will be sending astronauts back to the Moon for the first time since the Apollo Era. Known as Artemis III, this mission is currently scheduled to launch in October of 2024 as par… [+21982 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "First humans in Tasmania must have seen spectacular auroras: Laschamp excursion occurred in Australia and seen by first humans - Science Daily", "description": "A small sub-alpine lake in western Tasmania has helped establish that 41,000 years ago Australia experienced the Laschamp geomagnetic excursion and that Tasmanian, Aboriginals, would've seen it.", "url": "https://www.sciencedaily.com/releases/2021/02/210216092853.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-16T15:08:01Z", "content": "Drilling a 270,000-year old core from a Tasmanian lake has provided the first Australian record of a major global event where the Earth's magnetic field 'switched '- and the opportunity to establish … [+3150 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How icebergs really melt—and what this could mean for climate change - Phys.org", "description": "Icebergs are melting faster than current models describe, according to a new study by mathematicians at the University of Sydney. The researchers have proposed a new model to more accurately represent the melt speed of icebergs into oceans.", "url": "https://phys.org/news/2021-02-icebergs-meltand-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/howicebergsr.jpg", "publishedAt": "2021-02-16T14:48:48Z", "content": "Icebergs are melting faster than current models describe, according to a new study by mathematicians at the University of Sydney. The researchers have proposed a new model to more accurately represen… [+4557 chars]"}, {"source": {"id": null, "name": "Somag News"}, "author": null, "title": "Hubble detects group of black holes at the center of galaxy - Somag News", "description": "Among black hole hunters, a group has dedicated itself to looking for specific types: singularities of intermediate size between the", "url": "https://www.somagnews.com/hubble-detects-group-of-black-holes-at-the-center-of-galaxy/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2021/02/Hubble.jpg", "publishedAt": "2021-02-16T13:55:00Z", "content": "Among black hole hunters, a group has dedicated itself to looking for specific types: singularities of intermediate size between the supermassives that roar within the galaxies (such as Sagittarius A… [+1915 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Planetary scientists discover evidence for a reduced atmosphere on ancient Mars - Phys.org", "description": "Both Earth and Mars currently have oxidising atmospheres, which is why iron-rich materials in daily life develop rust (a common name for iron oxide) during the oxidation reaction of iron and oxygen. The Earth has had an oxidising atmosphere for approximately …", "url": "https://phys.org/news/2021-02-planetary-scientists-evidence-atmosphere-ancient.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/602bc596d2f78.jpg", "publishedAt": "2021-02-16T13:20:07Z", "content": "Both Earth and Mars currently have oxidising atmospheres, which is why iron-rich materials in daily life develop rust (a common name for iron oxide) during the oxidation reaction of iron and oxygen. … [+5076 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Top scientists, advances in analytical chemistry recognized - News-Medical.net", "description": "Each year, Pittcon provides a venue where scientists who have made outstanding contributions to analytical chemistry and applied spectroscopy are honored.", "url": "https://www.news-medical.net/news/20210216/Top-scientists-advances-in-analytical-chemistry-recognized.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Laboratory_Research_-_Scientific_Glassware_For_Chemical_Background_-_Romolo_Tavani_M1_c5c6e43443d24cab91db0c5950382163-620x480.jpg", "publishedAt": "2021-02-16T13:18:00Z", "content": "Each year, Pittcon provides a venue where scientists who have made outstanding contributions to analytical chemistry and applied spectroscopy are honored. This year, Pittcon will collaborate virtuall… [+3345 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Metcalfe", "title": "Original 'Stonehenge' discovered, confirming a legend of the wizard Merlin - Livescience.com", "description": "", "url": "https://www.livescience.com/original-stonehenge-discovered-in-wales.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V39JDPxtQR4u2CWV5bLpom-1200-80.jpg", "publishedAt": "2021-02-16T12:00:00Z", "content": "The earliest megalithic circle at Stonehenge was first built in the west of Wales more than 5,000 years ago, before its stones were dug up and dragged over 140 miles (225 kilometers) to its present s… [+7551 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Climate change likely drove the extinction of North America's largest animals - EurekAlert", "description": "A new study published in <i>Nature Communications</i> suggests that the extinction of North America's largest mammals was not driven by overhunting by rapidly expanding human populations following their entrance into the Americas. Instead, the findings, based…", "url": "https://www.eurekalert.org/pub_releases/2021-02/mpif-ccl021221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/256254_web.jpg", "publishedAt": "2021-02-16T10:04:25Z", "content": "IMAGE: The study's findings suggest that decreasing hemispheric temperatures and associated ecological changes were the primary drivers of the Late Quaternary megafauna extinctions in North America.\r… [+7243 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "COVID battle heads into space in UQ, Boeing ISS project - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-16T08:40:00Z", "content": null}, {"source": {"id": null, "name": "WJSU"}, "author": "Matthew S. Schwartz", "title": "New Theory Suggests Dinosaur-Killing Impact Came From Edge Of Solar System - WJSU", "description": "For decades, the prevailing theory about the extinction of the dinosaurs was that an asteroid from the belt between Mars and Jupiter slammed into the", "url": "https://www.wjsu.org/post/new-theory-suggests-dinosaur-killing-impact-came-edge-solar-system", "urlToImage": "https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202102/968229034.jpg", "publishedAt": "2021-02-16T07:10:52Z", "content": "For decades, the prevailing theory about the extinction of the dinosaurs was that an asteroid from the belt between Mars and Jupiter slammed into the planet, causing cataclysmic devastation that wipe… [+1989 chars]"}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "We found the first Australian evidence of a major shift in Earth’s magnetic poles. It may help us predict the next - Australian Times", "description": "But at 14,000 years old, the records from these lakes are much younger than the Laschamp excursion. Four decades later, our work at Lake Selina with modern techniques has revealed the exciting potential for similar research at other Australian lakes.", "url": "https://www.australiantimes.co.uk/news/we-found-the-first-australian-evidence-of-a-major-shift-in-earths-magnetic-poles-it-may-help-us-predict-the-next/", "urlToImage": "https://storage.googleapis.com/cdn.australiantimes.co.uk/wp-content/uploads/2021/02/f2cdd30d-australian-evidence.jpg", "publishedAt": "2021-02-16T06:27:00Z", "content": "Agathe Lise-Pronovost, University of Melbourne\r\nAbout 41,000 years ago, something remarkable happened: Earths magnetic field flipped and, for a temporary period, magnetic north was south and magnetic… [+5780 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Josh Dutton", "title": "Stomach-churning find after teen rushed to emergency room - Yahoo News Australia", "description": "The teenage girl had been pulling out her own hair and eating it resulting in an incredible find inside her stomach.", "url": "https://au.news.yahoo.com/stomach-churning-teen-rushed-to-emergency-room-061111135.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/740fcf80-7006-11eb-bf7d-166538985b43", "publishedAt": "2021-02-16T06:11:00Z", "content": "WARNING GRAPHIC IMAGES: Doctors have made a stomach-churning find in a teenage girl who was rushed to the emergency room.\r\nThe girl, 17, passed out and had to be taken to hospital after experiencing … [+1040 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Birds keep a layer of soft, fluffy down feathers to regulate body temperature - News-Medical.net", "description": "Feathers are a sleek, intricate evolutionary innovation that makes flight possible for birds, but in addition to their stiff, aerodynamic feathers used for flight, birds also keep a layer of soft, fluffy down feathers between their bodies and their outermost …", "url": "https://www.news-medical.net/news/20210215/Birds-keep-a-layer-of-soft-fluffy-down-feathers-to-regulate-body-temperature.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Black_and_White_Sneezy_Cold_Guy_-_Rynio_Productions_d9ab890b0c744a1389d404dd606049d9-620x480.jpg", "publishedAt": "2021-02-16T04:51:00Z", "content": "Feathers are a sleek, intricate evolutionary innovation that makes flight possible for birds, but in addition to their stiff, aerodynamic feathers used for flight, birds also keep a layer of soft, fl… [+5291 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "The Hope Probe Just Sent Back Another Stunning Picture of Mars - Gizmodo Australia", "description": "The United Arab Emirates' Hope probe has successfully arrived at Mars and sent back its first stunning image of the red planet.", "url": "https://www.gizmodo.com.au/2021/02/the-hope-probe-just-sent-back-another-stunning-picture-of-mars/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/16/UAE-Hope-mars.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-16T01:01:00Z", "content": "Mars is having a busy month with three missions scheduled to arrive at the red planet this February. The first of these is the United Arab Emirates’ Hope probe which has sent recently sent back its f… [+2104 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Planet Nine Might Be a Giant Illusion, Scientists Say, And Here's Why - ScienceAlert", "description": "A hypothetical mystery planet thought to be responsible for strange orbits in the outer Solar System just got dealt one of its biggest blows yet.", "url": "https://www.sciencealert.com/new-paper-extreme-solar-system-objects-contain-no-evidence-of-planet-nine", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/planet-nine_1024.jpg", "publishedAt": "2021-02-15T22:16:16Z", "content": "A hypothetical mystery planet thought to be responsible for strange orbits in the outer Solar System just got dealt one of its biggest blows yet.\r\nAccording to a comprehensive analysis of extremely d… [+5128 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cory Weinberg", "title": "Video. The meteor crosses the Australian sky on Valentine's Day - The Press Stories", "description": "A meteorite crashed near Melbourne on the evening of February 14, taking over the second largest city in Australia The candle is better than dinner.", "url": "https://presstories.com/2021/02/15/video-the-meteor-crosses-the-australian-sky-on-valentines-day/", "urlToImage": null, "publishedAt": "2021-02-15T20:36:15Z", "content": "A meteorite crashed near Melbourne on the evening of February 14, taking over the second largest city in AustraliaThe candle is better than dinner. Sunday evening, Melbourne residents We were able to… [+934 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "CO2 dip may have helped dinosaurs walk from South America to Greenland - Phys.org", "description": "A new paper refines estimates of when herbivorous dinosaurs must have traversed North America on a northerly trek to reach Greenland, and points out an intriguing climatic phenomenon that may have helped them along the journey.", "url": "https://phys.org/news/2021-02-co2-dip-dinosaurs-south-america.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/co2dipmayhav.jpg", "publishedAt": "2021-02-15T20:00:02Z", "content": "A new paper refines estimates of when herbivorous dinosaurs must have traversed North America on a northerly trek to reach Greenland, and points out an intriguing climatic phenomenon that may have he… [+4999 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "Melting dusty ice may have carved Martian gullies - Phys.org", "description": "By analyzing the occurrences of exposed dusty ice on Mars using data from NASA's Mars Reconnaissance Orbiter, ASU planetary scientists Aditya Khuller and Philip Christensen have found the lowest latitude detection of dusty water ice on Mars.", "url": "https://phys.org/news/2021-02-dusty-ice-martian-gullies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/meltingdusty.jpg", "publishedAt": "2021-02-15T19:39:08Z", "content": "By analyzing the occurrences of exposed dusty ice on Mars using data from NASA's Mars Reconnaissance Orbiter, ASU planetary scientists Aditya Khuller and Philip Christensen have found the lowest lati… [+3718 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Astronomers confirm most distant object in our solar system, which takes 1,000 years to go round the sun - Yahoo News Australia", "description": "A 250-mile wide object lurking at the edge of our solar system, 132 times further from the sun than Earth is the most distant object found so far in our...", "url": "https://au.news.yahoo.com/distant-solar-system-farfarout-173432533.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/97e74f80-6fb3-11eb-b57f-4605c96289a6", "publishedAt": "2021-02-15T17:39:29Z", "content": "Watch: The furthest object in the solar system has just been confirmed and its FarFarOut there\r\nA 250-mile wide object lurking 132 times further from the sun than Earth is the most distant object fou… [+3241 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Nature: Wasps watch over neighbouring nests in 'surprising act of selflessness' - Daily Mail", "description": "Researchers from the UK studied some 20,000 baby Neotropical paper wasps and their carers from 91 different colonies in Panama, including near the canal.", "url": "https://www.dailymail.co.uk/sciencetech/article-9262739/Nature-Wasps-watch-neighbouring-nests-surprising-act-selflessness.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/15/16/39318046-0-image-a-7_1613405112116.jpg", "publishedAt": "2021-02-15T16:38:00Z", "content": "In what experts have called a 'surprising act of selflessness', some wasp colonies lend their spare workers to babysit in neighbouring nests, a study has found.\r\nResearchers from the UK studied some … [+5932 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Jamie Harris", "title": "Tiniest microchip made by kinking graphene - The Canberra Times", "description": "Physicists claim to have made the smallest microchips ever which could help computers and smartphones run thousands of times faster. Researchers from the Univ...", "url": "https://www.canberratimes.com.au/story/7128102/tiniest-microchip-made-by-kinking-graphene/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/47d6d9af-ed2c-4d9f-9110-2032672dba81.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-15T11:21:32Z", "content": ""}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Light used to detect quantum information stored in 100000 nuclear quantum bits - Science Codex", "description": null, "url": "https://www.sciencecodex.com/light-used-detect-quantum-information-stored-100000-nuclear-quantum-bits-666959", "urlToImage": null, "publishedAt": "2021-02-15T05:00:00Z", "content": "Researchers have found a way to use light and a single electron to communicate with a cloud of quantum bits and sense their behaviour, making it possible to detect a single quantum bit in a dense clo… [+4647 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Avian insights into human ciliopathies - Science Codex", "description": null, "url": "https://sciencecodex.com/avian-insights-human-ciliopathies-666951", "urlToImage": "https://media.eurekalert.org/multimedia_prod/pub/web/255830_web.jpg", "publishedAt": "2021-02-15T05:00:00Z", "content": "Ciliopathies are genetic disorders caused by defects in the structure and function of cilia, microtubule-based organelles present on the surface of almost every cell in the human body which play cruc… [+2691 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": null, "title": "Russia to Carry Out Over 10 Space Launches From Baikonur Cosmodrome in 2021 - Sputnik International", "description": "MOSCOW, February 15 (Sputnik) - Russia is going to carry out more than 10 launches of Soyuz-2 carrier rockets from the Baikonur cosmodrome this year, Ruslan...", "url": "https://sputniknews.com/russia/202102151082079348-russia-to-carry-out-over-10-space-launches-from-baikonur-cosmodrome-in-2021/", "urlToImage": "https://cdn2.img.sputniknews.com/images/07e5/02/0f/1082079737.jpg", "publishedAt": "2021-02-15T04:39:00Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Agathe Lise-Pronovost", "title": "We found the first Australian evidence of a major shift in Earth's magnetic poles. It may help us predict the next - The Conversation AU", "description": "Researchers have found the first Australian evidence of this global event, during which people on Earth would have witnessed a multitude of spectacular auroras.", "url": "https://theconversation.com/we-found-the-first-australian-evidence-of-a-major-shift-in-earths-magnetic-poles-it-may-help-us-predict-the-next-155040", "urlToImage": "https://images.theconversation.com/files/384156/original/file-20210215-21-1bbrzt.jpg?ixlib=rb-1.1.0&rect=20%2C37%2C2227%2C1085&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-15T04:00:00Z", "content": "About 41,000 years ago, something remarkable happened: Earths magnetic field flipped and, for a temporary period, magnetic north was south and magnetic south was north. \r\nPalaeomagnetists refer to th… [+5730 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance rover Mars landing: How to watch live this week - CNET", "description": "NASA's latest Mars rover will try for a dramatic touchdown on the red planet this Thursday. We've got everything you need to know.", "url": "https://www.cnet.com/news/nasa-perseverance-rover-mars-landing-how-to-watch-live-this-week/", "urlToImage": "https://cnet1.cbsistatic.com/img/_m4uufR0NTpQa4dLCt2C6I8ZJO8=/1200x630/2021/01/15/da1300d1-8a78-4dcd-9c50-c20fc017a88d/pia24318-08-powereddescent-2000.jpg", "publishedAt": "2021-02-15T00:36:00Z", "content": "NASA will use a \"sky crane\" to gently lower Perseverance to the surface of Mars.\r\nNASA\r\nWhen it comes to space happenings, there are few as tense, exciting and high stakes as landing a vehicle on ano… [+5317 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Alex Chapman", "title": "Space news: NASA monitors 2001 FO32 asteroid tracking towards Earth - 7NEWS.com.au", "description": "The asteroid has been described as 'potentially dangerous’ by NASA.", "url": "https://7news.com.au/technology/space/asteroid-the-size-of-the-golden-gate-bridge-hurtling-towards-earth-c-2146978", "urlToImage": "https://images.7news.com.au/publication/C-2146978/59ef04ddbe2bf01b709b8617e77dd0c41028fb22-16x9-x0y0w4850h2728.jpg?imwidth=1024", "publishedAt": "2021-02-12T22:55:41Z", "content": "An asteroid the size of Californias famous Golden Gate Bridge is hurtling towards Earth and will make a close pass next month.\r\nThe space rock, officially called 231937 (2001 FO32), will come within … [+812 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "GAZA CITY: The Fatah breakaway Dahlan movement is returning to the Gaza Strip after a 14-year absence.\r\nThe movement is led by Mohammed Dahlan, who has lived in the UAE since a dispute with President… [+5109 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "SpaceX Completes Starship SN8's High-Altitude Flight Test, Crashes on Landing - UPI.com", "description": "SpaceX successfully launched its Starship SN-8 test rocket on December 9, 2020, before it crash-landed in a massive fireball on its launch pad. The test flight was the first high-altitude attempt for the vehicle, which lifted off at 5:45 pm. EST from its laun…", "url": "https://www.upi.com/News_Photos/view/upi/62861511d9a7ee164a1ca1c27e509086/SpaceX-Completes-Starship-SN8s-High-Altitude-Flight-Test-Crashes-on-Landing/", "urlToImage": "https://cdnph.upi.com/pv/upi/62861511d9a7ee164a1ca1c27e509086/SPACEX-STARSHIP-TEST.jpg", "publishedAt": "2020-12-11T01:53:40Z", "content": "SpaceX successfully launched its Starship SN-8 test rocket on December 9, 2020, before it crash-landed in a massive fireball on its launch pad. The test flight was the first high-altitude attempt for… [+339 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA and SpaceX Prepare for the Launch of the Crew-1 Mission - UPI.com", "description": "NASA astronauts Victor Glover, front left, Mike Hopkins, front right, Shannon Walker, back left, and Japan Aerospace Exploration Agency (JAXA) astronaut Soichi Noguchi, back right, wearing SpaceX spacesuits, are seen as they walk out of the Neil  A. Armstrong…", "url": "https://www.upi.com/News_Photos/view/upi/b9b1838a6814f4e67bae6c1ac677f47c/NASA-and-SpaceX-Prepare-for-the-Launch-of-the-Crew-1-Mission/", "urlToImage": "https://cdnph.upi.com/pv/upi/b9b1838a6814f4e67bae6c1ac677f47c/NASA-SPACEX-CREW.jpg", "publishedAt": "2020-11-13T02:23:32Z", "content": "NASA astronauts Victor Glover, front left, Mike Hopkins, front right, Shannon Walker, back left, and Japan Aerospace Exploration Agency (JAXA) astronaut Soichi Noguchi, back right, wearing SpaceX spa… [+746 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Russian, North American astronauts to return to earth - Arab News", "description": "ALMATY, Kazakhstan: The first crew to blast off to the International Space Station following a launch accident that deepened doubts over Russia’s space program is set to return to earth Tuesday. NASA astronaut Anne McClain, veteran cosmonaut Oleg Kononenko of…", "url": "https://www.arabnews.com/node/1515801", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/06/25/1638371-32666330.jpg", "publishedAt": "2019-08-27T05:35:12Z", "content": "NDJAMENA: Chad on Monday called for international support to help the beleaguered Sahel as five nations and ally France began a summit on the future of their anti-extremist campaign.\r\nLeaders of the … [+3259 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "First plants on moon, China says it has done the job - Hindustan Times", "description": "Pictures sent back January 12 showed plant shoots growing well nine days after the experiment was initiated, Chongqing University, which led the biological project, said in a briefing .", "url": "https://www.hindustantimes.com/world-news/china-says-it-has-grown-the-first-plants-on-the-moon/story-zcLzR3BdZ3MXlZW1LK06wL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2019/01/16/Pictures/_3418370c-194e-11e9-b6e9-9c4bb39de67f.png", "publishedAt": "2019-01-16T05:16:36Z", "content": "Chinese scientists say they have grown the first plants on the moon as part of the countrys lunar mission.\r\nPictures sent back Jan. 12 showed plant shoots growing well nine days after the experiment … [+1428 chars]"}]}