{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Pathogen-repellent wrap shown to shed viruses as well as bacteria - Phys.org", "description": "New research by the inventors of a promising pathogen-repellent wrap has confirmed that it sheds not only bacteria, as previously proven, but also viruses, boosting its potential usefulness for interrupting the transmission of infections.", "url": "https://phys.org/news/2022-02-pathogen-repellent-shown-viruses-bacteria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/2-microbe.jpg", "publishedAt": "2022-02-28T18:10:05Z", "content": "New research by the inventors of a promising pathogen-repellent wrap has confirmed that it sheds not only bacteria, as previously proven, but also viruses, boosting its potential usefulness for inter… [+3472 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "The Unfolding Story of a Kilonova Told in X-rays - NASA", "description": "An artist’s conception illustrates the aftermath of a \"kilonova,\" a powerful event that happens when two neutron stars merge.", "url": "https://www.nasa.gov/mission_pages/chandra/images/the-unfolding-story-of-a-kilonova-told-in-x-rays.html", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/gw170817_0.jpg", "publishedAt": "2022-02-28T18:06:48Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Tiny robots made in Mexico to explore moon in scientific first - Reuters", "description": "Five tiny robots designed and made in Mexico will blast off for the moon later this year, part of a first-of-its-kind scientific mission that envisions the two-wheeled bots scrambling across the lunar surface while taking sophisticated measurements.", "url": "https://www.reuters.com/lifestyle/science/tiny-robots-made-mexico-explore-moon-scientific-first-2022-02-25/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=75", "publishedAt": "2022-02-28T17:59:00Z", "content": "MEXICO CITY, Feb 25 (Reuters) - Five tiny robots designed and made in Mexico will blast off for the moon later this year, part of a first-of-its-kind scientific mission that envisions the two-wheeled… [+2273 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Metasurface-based antenna turns ambient radio waves into electric power - Phys.org", "description": "Researchers have developed a new metasurface-based antenna that represents an important step toward making it practical to harvest energy from radio waves, such as the ones used in cell phone networks or Bluetooth connections. This technology could potentiall…", "url": "https://phys.org/news/2022-02-metasurface-based-antenna-ambient-radio-electric.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/metasurface-based-ante.jpg", "publishedAt": "2022-02-28T17:55:47Z", "content": "Researchers have developed a new metasurface-based antenna that represents an important step toward making it practical to harvest energy from radio waves, such as the ones used in cell phone network… [+4309 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hydrogels containing a hygroscopic salt can harvest freshwater from dry air - Phys.org", "description": "Hydrogels have an astonishing ability to swell and take on water. In daily life, they are used in dressings, nappies, and more to lock moisture away. A team of researchers has now found another use: quickly extracting large amounts of freshwater from air usin…", "url": "https://phys.org/news/2022-02-hydrogels-hygroscopic-salt-harvest-freshwater.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/hydrogels-containing-a.jpg", "publishedAt": "2022-02-28T17:44:43Z", "content": "Hydrogels have an astonishing ability to swell and take on water. In daily life, they are used in dressings, nappies, and more to lock moisture away. A team of researchers has now found another use: … [+3400 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Rover Spots Unreal Mars 'Flower' Formation - CNET", "description": "There are no coral reefs or fossilized flowers on Mars, but there's a lookalike.", "url": "https://www.cnet.com/news/nasa-rover-spots-unreal-mars-flower-formation/", "urlToImage": "https://www.cnet.com/a/img/HYOA1JGFYp1Sr47EqMWEMfL9Lv0=/1200x630/2022/02/28/cf4f920f-b73c-4e25-bc2d-a20d9ba348d3/curiositymahliminerals.jpg", "publishedAt": "2022-02-28T17:22:00Z", "content": "These tiny mineral formations give us a close-up look at the details of the surface of Mars as seen by NASA's Curiosity rover.\r\nNASA/JPL-Caltech/MSSS\r\nThis story is part of Welcome to Mars, our serie… [+1704 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Rare gold coin found in Hungary shows assassinated Roman emperor - Livescience.com", "description": "The emperor died at age 22.", "url": "https://www.livescience.com/rare-roman-gold-coin-hungary", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6KeRHoALHcsCxzKMyuNhWU-1200-80.jpg", "publishedAt": "2022-02-28T17:20:52Z", "content": "Excavators in Hungary have discovered a \"very rare\" gold Roman coin that features the face of a murdered Roman emperor.\r\nThe third-century coin depicts Emperor Volusianus, who co-ruled the Roman Empi… [+3152 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "“The birds and the bees.” Meaning and origin of the phrase - Verve Times", "description": "The phrase \"the birds and the bees\" is a term used to explain the mechanics of reproduction to younger children, relying on the imagery of bees pollinating and eggs hatching to substitute for a more technical explanation of sexual intercourse. It is", "url": "https://vervetimes.com/the-birds-and-the-bees-meaning-and-origin-of-the-phrase/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/W7peurGbrr4cx3sjanqeg7-1200-80.jpg", "publishedAt": "2022-02-28T16:56:50Z", "content": "The phrase “the birds and the bees” is a term used to explain the mechanics of reproduction to younger children, relying on the imagery of bees pollinating and eggs hatching to substitute for a more … [+3736 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Social networking for fossils shows community impacts of mass extinctions — ScienceDaily - Verve Times", "description": "By applying an algorithm akin to what Facebook uses to make friend suggestions, researchers have identified communities of ancient life in the fossil record and tracked how their numbers changed through each of the planet's mass extinctions.As expect", "url": "https://vervetimes.com/social-networking-for-fossils-shows-community-impacts-of-mass-extinctions-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-28T16:44:02Z", "content": "By applying an algorithm akin to what Facebook uses to make friend suggestions, researchers have identified communities of ancient life in the fossil record and tracked how their numbers changed thro… [+4646 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Four Years On, New Experiment Sees No Sign of ‘Cosmic Dawn’ - Quanta Magazine", "description": "When astronomers tried to confirm a signal from the birth of the first stars after the Big Bang, they saw nothing.", "url": "https://www.quantamagazine.org/in-new-experiment-astronomers-see-no-sign-of-cosmic-dawn-20220228/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/02/Reionization_1200_social.jpg", "publishedAt": "2022-02-28T16:02:38Z", "content": "When hydrogen atoms first formed, they absorbed and then emitted ambient 21-centimeter radiation at equal rates, which made the clouds of hydrogen that filled the primordial universe effectively invi… [+4716 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Liz Langley", "title": "Animal blood comes in a rainbow of colors—here’s why - National Geographic", "description": "From milky blue to lime green, organisms have evolved different types of blood—and ways to move oxygen around the body.", "url": "https://www.nationalgeographic.com/animals/article/animal-blood-comes-in-a-rainbow-of-colors", "urlToImage": "https://i.natgeofe.com/n/b703676e-8261-4016-bcf0-c9651f2a584b/h_15488790_16x9.jpg?w=1200", "publishedAt": "2022-02-28T15:39:02Z", "content": "Whether its a tiny snail or a massive whale, most living organisms rely on blood flowing through their bodies to stay alive.\r\nThis precious fluid fights infection, delivers nutrients and gases to org… [+6465 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Mystery solved about the origin of the 30000-year-old Venus of Willendorf: New research method shows that the material likely comes from northern Italy - Science Daily", "description": "The almost 11 cm high figurine from Willendorf is one of the most important examples of early art in Europe. It is made of a rock called 'oolite' which is not found in or around Willendorf. Anthropologist, geologists and prehistorians have now found out, with…", "url": "https://www.sciencedaily.com/releases/2022/02/220228095503.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-28T15:33:11Z", "content": "The almost 11 cm high figurine from Willendorf is one of the most important examples of early art in Europe. It is made of a rock called \"oolite\" which is not found in or around Willendorf. A researc… [+5873 chars]"}, {"source": {"id": null, "name": "Martha Stewart"}, "author": "Madeline Buiano", "title": "The Biggest Family Tree Ever Recorded Dates as Far Back as 100000 Years Ago - Martha Stewart", "description": "Researchers from the University of Oxford's Big Data Institute combined both ancient and modern DNA to gain a better understanding of human history and evolution.", "url": "https://www.marthastewart.com/8231918/biggest-family-tree-recorded-february-2022", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F34%2F2022%2F02%2F28%2Ffamily-tree-banches-getty-0222-2000.jpg", "publishedAt": "2022-02-28T15:27:54Z", "content": "If you've ever made a family tree, there's a good chance you were able to track your lineage across several generations and at least a hundred years. While that might seem interesting enough, imagine… [+2341 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A slow-motion section of the San Andreas fault may not be so harmless after all - Phys.org", "description": "Most people have heard about the San Andreas Fault. It's the 800-mile-long monster that cleaves California from south to north, as two tectonic plates slowly grind against each other, threatening to produce big earthquakes.", "url": "https://phys.org/news/2022-02-slow-motion-section-san-andreas-fault.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/a-slow-motion-section.jpg", "publishedAt": "2022-02-28T15:23:22Z", "content": "Most people have heard about the San Andreas Fault. It's the 800-mile-long monster that cleaves California from south to north, as two tectonic plates slowly grind against each other, threatening to … [+9115 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Two Years After ‘Biggest Explosion Ever’, Space Still Has Huge Hole - The bharat express news", "description": "As Putin puts Russian nuclear forces on 'special alert' in a standoff that could wipe out all life on Earth, it's clear the world still hasn't learned any", "url": "https://www.thebharatexpressnews.com/two-years-after-biggest-explosion-ever-space-still-has-huge-hole/", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article26349108.ece/ALTERNATES/s615b/0_3000.jpg", "publishedAt": "2022-02-28T14:46:04Z", "content": "As Putin puts Russian nuclear forces on ‘special alert’ in a standoff that could wipe out all life on Earth, it’s clear the world still hasn’t learned any lessons from the biggest explosion of all ti… [+1832 chars]"}, {"source": {"id": null, "name": "imaging resource"}, "author": "Jeremy Gray", "title": "A pair of galaxies collide to form a brilliant 'space triangle' in a new Hubble Space Telescope image - imaging resource", "description": "Last week, NASA shared a stunning new photo captured by the venerable Hubble Space Telescope. The image showcases an ongoing head-on collision between two galaxies and a beautiful triangular-shaped frenzy of newly-born stars. The…", "url": "https://www.imaging-resource.com/news/2022/02/28/a-pair-of-galaxies-collide-to-form-a-brilliant-space-triangle", "urlToImage": null, "publishedAt": "2022-02-28T14:45:00Z", "content": "Last week, NASA shared a stunning new photo captured by the venerable Hubble Space Telescope. The image showcases an ongoing head-on collision between two galaxies and a beautiful triangular-shaped f… [+2430 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Space junk heading for Moon will add to 60+ years of lunar debris - Nature.com", "description": "In an upcoming collision, a spent rocket booster will be the first long-circulating piece of human-made debris to smash into the lunar surface.", "url": "https://www.nature.com/articles/d41586-022-00542-4", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-00542-4/d41586-022-00542-4_20170154.jpg", "publishedAt": "2022-02-28T14:39:03Z", "content": "Fifty-eight missions have previously rained debris onto the Moons surface.NASA/Science Photo Library\r\nOn 4 March, humanity will set a record for littering when an old rocket booster smashes into the … [+5915 chars]"}, {"source": {"id": null, "name": "Buckinhamshire Free Press"}, "author": "Noora Mykkanen", "title": "Bucks stargaze campaign amid worsening light pollution - Bucks Free Press", "description": "Countryside charity calls everyone in Bucks to take up stargazing for one night this week.", "url": "https://www.bucksfreepress.co.uk/news/19957752.bucks-stargaze-campaign-amid-worsening-light-pollution/", "urlToImage": "https://www.bucksfreepress.co.uk/resources/images/13520980/", "publishedAt": "2022-02-28T14:24:09Z", "content": "Countryside charity calls everyone in Bucks to take up stargazing for one night between February 26 and March 6 as part of Start Count to identify the worst areas for light pollution.\r\nIn many parts … [+1677 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "NASA's new bird-like drones could go on to explore Venus' atmosphere - Interesting Engineering", "description": "As part of NASA's Innovative Advanced Concepts (NIAC) program, a concept for an inflatable bird-like drone has officially received some funding.", "url": "https://interestingengineering.com/nasas-new-drones-venus-atmosphere", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/4N61WR2ROJ/sizes/nasa-bird-like-drone_md.jpg", "publishedAt": "2022-02-28T13:20:00Z", "content": "NASA has recently announced a series of futuristic space technology concepts that they have selected for further development. The concepts range widely in design and purpose but do include an interes… [+3506 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "A Killer Asteroid Projected To Hit The Earth In 2023 Will Not Actually Hit It At All, According To New Report - Wonderful Engineering", "description": "Advertisement On any given day, there are numerous things moving around the universe in our huge solar system and the much larger universe. We estimate that there are only roughly 25,000 comets that pose a threat, which seems like a huge amount. However, give…", "url": "https://wonderfulengineering.com/a-killer-asteroid-projected-to-hit-the-earth-in-2023-will-not-actually-hit-it-at-all-according-to-new-report/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/02/RS3511_526446689-hig.jpg", "publishedAt": "2022-02-28T12:21:17Z", "content": "On any given day, there are numerous things moving around the universe in our huge solar system and the much larger universe. We estimate that there are only roughly 25,000 comets that pose a threat,… [+1927 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA - Space.com", "description": "The press conference starts at 11 a.m. EST (1600 GMT) on Monday (Feb. 28).", "url": "https://www.space.com/axiom-space-nasa-ax-1-iss-mission-preflight-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CHBsuLvnePa5o43cWnMjuH-1200-80.jpg", "publishedAt": "2022-02-28T11:19:36Z", "content": "NASA, SpaceX and Houston company Axiom Space\r\n will discuss a landmark private space mission today (Feb. 28), and you can watch it live.\r\nAxiom Space plans to launch Ax-1\r\n, the first all-private cre… [+2439 chars]"}, {"source": {"id": null, "name": "Evening Standard"}, "author": "Tirstan Kirk", "title": "Barrister in battle to fell trees that cause son’s coughing fits - Evening Standard", "description": "A part-time judge has decried “Kafkaesque” bureaucracy in a battle to chop down two trees that he says cause coughing fits and sleepless nights for his young son.", "url": "https://www.standard.co.uk/news/london/little-venice-westminster-city-council-battle-fell-trees-coughing-b985032.html", "urlToImage": "https://static.standard.co.uk/2022/02/28/11/newFile-2.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2022-02-28T11:16:04Z", "content": "A part-time judge has decried Kafkaesque bureaucracy in a battle to chop down two trees that he says cause coughing fits and sleepless nights for his young son.\r\nSam Robinson QC wants to fell the sil… [+1759 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Gene that allows humans to feel touch plays role in sense of smell: Study - Devdiscourse", "description": "The gene that makes us get drawn to the wonderful smell of rose is also responsible for the sense of prick we feel when we accidentally touch the thorns. Researchers from SMU (Southern Methodist University) have determined that a gene linked to feeling touch …", "url": "https://www.devdiscourse.com/article/science-environment/1941275-gene-that-allows-humans-to-feel-touch-plays-role-in-sense-of-smell-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2022_10_48_41_4560334.jpg?width=920&format=jpeg", "publishedAt": "2022-02-28T10:48:43Z", "content": "The gene that makes us get drawn to the wonderful smell of rose is also responsible for the sense of prick we feel when we accidentally touch the thorns. Researchers from SMU (Southern Methodist Univ… [+5523 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ameya Paleja", "title": "NASA's Nancy Grace Roman Space Telescope could snap the first image of Jupiter-like world - Interesting Engineering", "description": "Scheduled for a 2027 launch, this will be the first telescope to capture images in visible light. Better than any observatory we have launched so far.", "url": "https://interestingengineering.com/nasa-roman-mission-jupiter-like-world", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/qrwBQVJW65/sizes/ngrt-1920_md.png", "publishedAt": "2022-02-28T10:35:00Z", "content": "NASA's next Space Telescope is currently under construction and already has a mission in waiting, the capture of the first-ever image of a Jupiter-like world in the Upsilon Andromedae d, the space ag… [+2906 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Wudan Yan", "title": "Researchers See ‘Future of an Entire Species’ in Ultrasound Technique - The New York Times", "description": "To bring abalone back from the edge of extinction, scientists need to find improved ways of coaxing the snails into reproducing.", "url": "https://www.nytimes.com/2022/02/28/science/abalone-ultrasound-reproduction.html", "urlToImage": "https://static01.nyt.com/images/2022/02/24/science/24sci-abalone/24sci-abalone-facebookJumbo.jpg", "publishedAt": "2022-02-28T10:00:18Z", "content": "That kind of gives you an idea of whether or not the animal may spawn, said Josh Bouma, the abalone program director of the Restoration Fund in Washington State, who heads the captive breeding progra… [+1533 chars]"}, {"source": {"id": null, "name": "Southernmarylandchronicle.com"}, "author": "Staff", "title": "Scientists reveal 4.4 million galaxies in a new map - The Southern Maryland Chronicle", "description": "Durham University astronomers collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low-Frequency Array (LOFAR), a pan-European radio telescope.   The map reveals an astonishingly detailed radio im…", "url": "http://southernmarylandchronicle.com/2022/02/28/scientists-reveal-4-4-million-galaxies-in-a-new-map/", "urlToImage": "https://i0.wp.com/southernmarylandchronicle.com/wp-content/uploads/2022/02/fmbkcfuxwaavelh_resize_md.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2022-02-28T10:00:00Z", "content": "Durham University astronomers collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low-Frequency Array (LOFAR), a pan-European radio tel… [+2325 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Find Two Supermassive Black Holes Spiraling Toward a Cataclysmic Collision - SciTechDaily", "description": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging. Supermassive black holes millions to billions of times the mass of our Sun lie at the heart …", "url": "https://scitechdaily.com/astronomers-find-two-supermassive-black-holes-spiraling-toward-a-cataclysmic-collision/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Spinning-Disk.gif", "publishedAt": "2022-02-28T09:18:45Z", "content": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging.\r\nSupermassive black holes millio… [+4492 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "What would happen if a solar storm hit Earth - Sprout Wired", "description": "An impressive and unique image of the biggest Solar flare already captured Solar Orbiter Probe, the result of a joint...", "url": "https://www.sproutwired.com/what-would-happen-if-a-solar-storm-hit-earth/", "urlToImage": null, "publishedAt": "2022-02-28T08:32:12Z", "content": "An impressive and unique image of the biggest Solar flare already captured Solar Orbiter Probe, the result of a joint project between ESA (European Space Agency) and NASA (US National Aeronautics and… [+2390 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sohini Sengupta", "title": "Nasa shares viral pic of Saturn's rings. Can you spot Earth in the background? - Hindustan Times", "description": "This photo that was shared by the official Twitter handle by of NASA, shows how tiny the Earth looks from a huge distance right below the rings of Saturn. | Trending", "url": "https://www.hindustantimes.com/trending/nasa-tweets-a-photo-of-blue-dot-earth-below-saturn-s-rings-see-pic-reactions-101646036199066.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/28/1600x900/Nasa_tweets_a_photo_of_blue_dot_Earth_below_Saturn_rings_See_pic_reactions_1646036570804_1646036576703.png", "publishedAt": "2022-02-28T08:24:25Z", "content": "If you are interested in space, then you may have followed the National Aeronautics and Space Administration or NASA on social media. Their social media handles are often used in order to post some b… [+1761 chars]"}, {"source": {"id": null, "name": "Fiji Times"}, "author": "", "title": "Tonga volcanic explosion – A geographer's point of view - Fiji Times", "description": null, "url": "https://www.fijitimes.com/tonga-volcanic-explosion-a-geographers-point-of-view/", "urlToImage": "https://www.fijitimes.com/wp-content/uploads/2022/01/Tonga-volcanic-eruption-mushroom.jpg", "publishedAt": "2022-02-28T08:04:56Z", "content": "In the South Pacific, Tonga is situated 30 kilometres south of Fonuafoou, a submerged volcanic island.\r\nTonga’s main island lies around 60 kilometres north of the site of the most recent volcanic eru… [+5453 chars]"}, {"source": {"id": null, "name": "Devhardware.com"}, "author": "Izer", "title": "The New Space Race to the Moon Is Really the Go to Mars and Beyond - Dev Hardware", "description": "meIn 1961, US President John F. Kennedy said his nation would be the first to land on the moon. This ambitious goal would later be achieved when two NASA", "url": "https://www.devhardware.com/the-new-space-race-to-the-moon-is-really-the-go-to-mars-and-beyond/", "urlToImage": "https://www.devhardware.com/wp-content/uploads/2022/02/The-New-Space-Race-to-the-Moon-Is-Really-the.jpeg", "publishedAt": "2022-02-28T08:00:51Z", "content": "meIn 1961, US President John F. Kennedy said his nation would be the first to land on the moon. This ambitious goal would later be achieved when two NASA astronauts wobbly strides across the lunar su… [+9707 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Hidden Turbulence in The Atmosphere of The Sun Revealed by New AI Model - ScienceAlert", "description": "Hidden turbulent motion that takes place inside the atmosphere of the Sun can be accurately predicted by a newly developed neural network.", "url": "https://www.sciencealert.com/a-neural-network-can-find-hidden-turbulence-in-the-atmosphere-of-the-sun", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/solar-granules_1024.jpg", "publishedAt": "2022-02-28T06:14:10Z", "content": "Hidden turbulent motion that takes place inside the atmosphere of the Sun can be accurately predicted by a newly developed neural network.\r\nFed only temperature and vertical motion data collected fro… [+3425 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Clearest View Yet Of Hot Jupiter's Dark Side Obtained. Does 'Exotic Rain' Occur On The Exoplanet? - ABP Live", "description": "Astronomers from Massachusetts Institute of Technology (MIT), Cambridge have obtained the clearest view yet of the perpetual dark side of an exoplanet which is 'tidally locked' to its star.", "url": "https://news.abplive.com/science/clearest-view-yet-dark-side-hot-jupiter-obtained-for-first-time-nasa-exotic-rain-may-occur-on-the-exoplanet-wasp-121b-1515837", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/02/27/622911002c5d2eb597602de8543aaabc_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-02-28T06:03:07Z", "content": "New Delhi: Astronomers from Massachusetts Institute of Technology (MIT), Cambridge have obtained the clearest view yet of the perpetual dark side of an exoplanet which is \"tidally locked\" to its star… [+7207 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Lunar Alignment February 2022 LIVE – Tips for viewing Mars TONIGHT and what other planets you can see without a telescope - BollyInside", "description": "Even though the moon does not become blue in color, the phrase “blue moon” has gained popularity in recent years to denote the second full moon in a", "url": "https://www.bollyinside.com/news/lunar-alignment-february-2022-live-tips-for-viewing-mars-tonight-and-what-other-planets-you-can-see-without-a-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T05:58:22Z", "content": "Even though the moon does not become blue in color, the phrase blue moon has gained popularity in recent years to denote the second full moon in a calendar month. The black moon in April is the polar… [+761 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "SpaceX launches batch of Starlink satellites from California - The Week", "description": "SpaceX has close to 2,000 Starlink satellites orbiting Earth", "url": "https://www.theweek.in/news/sci-tech/2022/02/28/spacex-launches-batch-of-starlink-satellites-from-california.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/images/2022/1/1/SpaceX-Falcon-9-rocket-lifting-off-from-Cape-Canaveral-ap.jpg", "publishedAt": "2022-02-28T05:48:00Z", "content": "A SpaceX Falcon 9 rocket blasted off from California on Friday and carried 50 more satellites into orbit for the Starlink internet constellation.\r\nA SpaceX webcast showed the rockets upper stage depl… [+622 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "The new NIAC Awards are out! New Spacesuits, Breathing Martian air, Advanced Telescopes, and More - Universe Today", "description": "The NASA Institute for Advanced Concepts (NIAC) has been a significant funder of pie in the sky research for a long time now.  From extrasolar object interceptors to beaming power into a lunar crater, we love reporting about NIAC funded concepts here at UT.  …", "url": "https://www.universetoday.com/154740/the-new-niac-awards-are-out-new-spacesuits-breathing-martian-air-advanced-telescopes-and-more/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/02/6379.jpg", "publishedAt": "2022-02-28T04:16:17Z", "content": "The NASA Institute for Advanced Concepts (NIAC) has been a significant funder of pie in the sky research for a long time now.  From extrasolar object interceptors to beaming power into a lunar crater… [+3217 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Astronaut marks 100 days on ISS with cool Cupola pic - Digital Trends", "description": "German astronaut Matthias Maurer has marked his 100th day aboard the space station by sharing a photo of himself inside the orbiting outpost’s Cupola module.", "url": "https://www.digitaltrends.com/news/astronaut-marks-100-days-on-iss-with-cool-cupola-pic/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/maurer-cupola-iss.jpg", "publishedAt": "2022-02-28T02:45:10Z", "content": "German astronaut Matthias Maurer has marked his 100th day aboard the International Space Station (ISS) by sharing a photo of himself inside the orbiting outposts Cupola module.\r\nThe European Space Ag… [+2770 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3524864", "title": "Canberra well placed to play a role in global asteroid detection - UNSW Newsroom", "description": "A UNSW researcher says we can improve our ability to detect dangerous asteroids from the Southern Hemisphere.", "url": "https://newsroom.unsw.edu.au/news/science-tech/canberra-well-placed-play-role-global-asteroid-detection", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/an_illustration_of_an_asteroid_above_earth_2.jpeg", "publishedAt": "2022-02-27T23:57:00Z", "content": "A UNSW researcher says we can improve our ability to detect dangerous asteroids from the Southern Hemisphere.NASAs Near-Earth Object Observation Program painstakingly documents all asteroid sightings… [+3035 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "Whatever Happened To The Kepler Space Telescope? - SlashGear", "description": "You&#039;ve probably heard about Kepler, but may not have realized the mission reached its end years ago. What happened and where is the space telescope today?", "url": "https://www.slashgear.com/781810/whatever-happened-to-the-kepler-space-telescope/", "urlToImage": "https://www.slashgear.com/img/gallery/whatever-happened-to-the-kepler-space-telescope/l-intro-1646001468.jpg", "publishedAt": "2022-02-27T22:41:00Z", "content": "If you've ever read about exoplanets that is, planets outside our solar system you've likely come across a particular name: Kepler. You'll find exoplanets with names like Kepler-452b or Kepler-4b, an… [+1420 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Moon meets Mercury and Saturn early Monday morning - Balkan Travellers", "description": "You may be able to watch the moon block with resonance Saturn transient Mercury Monday (February 28), but it will be quite a challenge.The three worlds", "url": "https://www.balkantravellers.com/moon-meets-mercury-and-saturn-early-monday-morning/", "urlToImage": null, "publishedAt": "2022-02-27T17:56:00Z", "content": "You may be able to watch the moon block with resonance Saturn transient Mercury Monday (February 28), but it will be quite a challenge.\r\nThe three worlds will gather near the southeast horizon as the… [+2488 chars]"}, {"source": {"id": null, "name": "Resilience"}, "author": null, "title": "The Mars obsession: Are two planets better than one to ensure human survival? - Resilience", "description": "Those who offer Mars as part of a \"two-planet solution\" for the long-term survival of the human race are only distracting us from facing our very real problems on Earth.", "url": "https://www.resilience.org/stories/2022-02-27/the-mars-obsession-are-two-planets-better-than-one-to-ensure-human-survival/", "urlToImage": "https://www.resilience.org/wp-content/uploads/2022/02/mars_colony.jpg", "publishedAt": "2022-02-27T17:46:40Z", "content": "One of the rationales suggested for going to Mars is that given all the vagaries of the universe, human culture would have a better chance of surviving far into the future if humans settled on two (o… [+8204 chars]"}, {"source": {"id": null, "name": "WFTV Orlando"}, "author": "Sarah Wilson", "title": "2 new bus tours coming to Kennedy Space Center Visitor Complex - WFTV Orlando", "description": "Kennedy Space Center Visitor Complex is launching two new bus tours.", "url": "https://www.wftv.com/news/local/brevard-county/2-new-bus-tours-coming-kennedy-space-center-visitor-complex/PNDOI4A345ESJKGTHZY53TOLQA/", "urlToImage": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/hI3gP_Gjfk-WRjCbFg742iBWRDU=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/OKHFKCBVZBHMVHZU5T4H2FZP64.jpg", "publishedAt": "2022-02-27T16:55:29Z", "content": null}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "James Webb mirror alignment continues successfully: NASA - The Tribune India", "description": "Space agency NASA has announced that James Webb continued on its path to becoming a focused observatory as the team has successfully worked through the second and third out of seven total phases of mirror alignment.", "url": "https://www.tribuneindia.com/news/science-technology/james-webb-mirror-alignment-continues-successfully-nasa-373631", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_355181650.jpeg", "publishedAt": "2022-02-27T16:42:00Z", "content": "New York, February 27\r\nSpace agency NASA has announced that James Webb continued on its path to becoming a focused observatory as the team has successfully worked through the second and third out of … [+1903 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Updates on Artemis I Mission, Test Fires RS-25 Rocket Engine [Video] - SciTechDaily", "description": "An update on our Artemis I mission, test firing an Artemis rocket engine, and a resupply mission delivers to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be/tPzByYNUPNE Video Transcript: An update on our Artemi…", "url": "https://scitechdaily.com/nasa-updates-on-artemis-i-mission-test-fires-rs-25-rocket-engine-video/", "urlToImage": "https://scitechdaily.com/images/Artemis-I-Inside-High-Bay-3-VAB.jpg", "publishedAt": "2022-02-27T16:37:27Z", "content": "Inside High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida, the work platforms have been retracted from around the Artemis I Space Launch System. Credit: NASA/Frank … [+3310 chars]"}, {"source": {"id": null, "name": "Los Angeles Times"}, "author": "vmunck", "title": "Column: The retirement of the ISS means the end of an era - Los Angeles Times", "description": "The majority of those in my generation were born after the launch of the International Space Station, meaning that we’ve never known a world without it.", "url": "https://highschool.latimes.com/yorba-linda-high-school/column-the-retirement-of-the-iss-means-the-end-of-an-era/", "urlToImage": "https://i0.wp.com/highschool.latimes.com/wp-content/uploads/2022/02/ezgif.com-gif-maker.jpg?fit=361%2C239&ssl=1", "publishedAt": "2022-02-27T16:04:42Z", "content": "Its with great disappointment that I report to you the soon death of the International Space Station. NASA announced.By 2031, the ISS will be crashed into Point Nemo, which is a specific location in … [+2766 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "John Drucker", "title": "What Is NIRSpec? The James Webb Telescope Instrument Explained - Global Circulate", "description": "NIRSpec is a type of spectrograph which works in the near-infrared spectrum, at 0.6 to 5 microns, which is just past the wavelength of red visible light (via NASA). The special thing about NIRSpec is that it can observe many objects at", "url": "https://globalcirculate.com/what-is-nirspec-the-james-webb-telescope-instrument-explained/", "urlToImage": "https://www.slashgear.com/img/gallery/what-is-nirspec-the-james-webb-telescope-instrument-explained/l-intro-1645810496.jpg", "publishedAt": "2022-02-27T13:25:48Z", "content": "NIRSpec is a type of spectrograph which works in the near-infrared spectrum, at 0.6 to 5 microns, which is just past the wavelength of red visible light (via NASA). The special thing about NIRSpec is… [+1122 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Largest shock wave in the universe is '60 times larger than the Milky Way,' new study finds - Livescience.com", "description": "The wave has been blasting through space at near-light-speed for 200 million years.", "url": "https://www.livescience.com/merging-galaxy-cluster-abell-3667-shock-wave", "urlToImage": "https://cdn.mos.cms.futurecdn.net/49uHcvrRSVXcZYPQi2xfw9-1200-80.jpeg", "publishedAt": "2022-02-27T12:00:00Z", "content": "What happens when two of the largest objects in the universe collide?\r\nSimple, says a new study: They create one of the largest shock waves in the universe.\r\nLocated about 730 million light-years\r\n f… [+2312 chars]"}, {"source": {"id": null, "name": "Motley Fool"}, "author": "Rich Smith", "title": "Lockheed Martin Will Be the World's Biggest Rocket Company -- on Mars - Motley Fool", "description": "A trio of NASA contract wins help keep the aerospace giant relevant in space exploration.", "url": "https://www.fool.com/investing/2022/02/27/lockheed-is-worlds-biggest-rocket-company-on-mars/", "urlToImage": "https://g.foolcdn.com/editorial/images/667568/illustration-of-rocket-launching-over-a-red-planet-with-the-word-mars-below-in-green-font.jpg", "publishedAt": "2022-02-27T11:53:00Z", "content": "When it comes to space launch, it often feels like SpaceX makes all the headlines.\r\nSpaceX is the only company routinely launching rockets to orbit and then landing them back on Earth. It's the only … [+3762 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Parker Solar Probe touches Sun yet again; cruises past the corona at over 5L kmph - Republic World", "description": "NASA said that the spacecraft faced temperatures up to 760 degrees Celsius as it was just over 85 lakh kilometres away from the solar surface.", "url": "https://www.republicworld.com/science/space/parker-solar-probe-touches-sun-yet-again-cruises-past-the-corona-at-over-5l-kmph-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/y9ydna8cntnfqx7v_1645960594.jpeg", "publishedAt": "2022-02-27T11:30:00Z", "content": "The Parker Solar Probe touched the sun yet again as it cruised through the corona on February 25. Moving at a speed of 5,79,363 kilometres per hour, the spacecraft faced temperatures up to 760 degree… [+1949 chars]"}, {"source": {"id": null, "name": "Heraldtimesonline.com"}, "author": "Hal Kibbey, The Herald-Times", "title": "Star Trak: 'Morning star' Venus first to appear in March night skies - The Herald-Times", "description": "Equinox on March 20 heralds the beginning of spring for the Northern Hemisphere.", "url": "https://www.heraldtimesonline.com/story/news/local/2022/02/27/venus-first-planet-visible-march-night-skies-indiana/6928838001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/08/13/NEAG/d8032a46-b32e-457c-a948-593f1a05ae59-Looking_Up_8-14_Venus.JPG?auto=webp&crop=839,472,x0,y187&format=pjpg&width=1200", "publishedAt": "2022-02-27T11:00:43Z", "content": "Venus will be the first planet to appear in the morning sky during March, rising two hours before the sun and dazzling 20 degrees high in the southeast a half hour before dawn.\r\nA half hour later Mar… [+2440 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Denise Chow", "title": "Millions of Years of Animal Migration Hold Clues to the Mystery of ‘Lost Continent' - NBC 6 South Florida", "description": "A \"lost\" continent that once connected Asia to southern Europe may have formed an ancient passageway that helped animals migrate west, according to new research.", "url": "https://www.nbcnews.com/science/science-news/millions-years-animal-migration-hold-clues-mystery-lost-continent-rcna17336", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220223-Fossil-in-the-field-al-1032-ca45b7.jpg", "publishedAt": "2022-02-27T10:54:01Z", "content": "During the Eocene Epoch, which spanned 55 million to 34 million years ago, Europe and Asia were home to distinctly different types of mammals. At the end of the Eocene, however, there was a dramatic … [+2807 chars]"}, {"source": {"id": null, "name": "Lankatimes.com"}, "author": "Izer", "title": "A brand new, inexpensive catalyst that accelerates the production of oxygen from water - Lanka Times", "description": "by David L. Chandler, Massachusetts Institute of Technology February 26, 2022 The illustration depicts an electrochemical reaction, which splits water", "url": "https://www.lankatimes.com/a-brand-new-inexpensive-catalyst-that-accelerates-the-production-of-oxygen-from-water/", "urlToImage": "https://www.lankatimes.com/wp-content/uploads/2022/02/A-brand-new-inexpensive-catalyst-that-accelerates-the-production-of.jpg", "publishedAt": "2022-02-27T09:41:47Z", "content": "byDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022The illustration depicts an electrochemical reaction, which splits water molecules (right, with an oxygen atom in red, and t… [+6278 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA missed dangerous solar flares! But India's Chandrayaan 2 finds it - HT Tech", "description": "In an amazing turn of events, even though NASA missed a dangerous solar flares, India's ISRO detected it, courtesy Chandrayaan 2 orbiter.", "url": "https://tech.hindustantimes.com/tech/news/nasa-missed-dangerous-solar-flares-but-india-s-chandrayaan-2-finds-it-71645949704241.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/27/1600x900/SUn_flares_NASA_pic_1645287521356_1645949771052.jpg", "publishedAt": "2022-02-27T08:17:11Z", "content": "Even as ISRO is preparing for the launch of Chandrayaan 3, its predecessor Chandrayaan 2 is delivering extremely valuable inputs, which can even save the Earth from some dangerous events. This time, … [+2944 chars]"}, {"source": {"id": null, "name": "Tasmania Examiner"}, "author": "Joshua Peach", "title": "SpaceX satellite launch puts on show for Northern Tasmanians - Moree Champion", "description": "Resident's across Northern Tasmania who looked skyward witnessed a rare sight on Saturday night.", "url": "https://www.examiner.com.au/story/7636824/spacex-satellite-launch-puts-on-show-for-northern-tasmanians/", "urlToImage": "https://www.examiner.com.au/images/transform/v1/crop/frm/150375628/0569c160-3719-4356-a15f-0f39e6e71cb9.jpg/r0_23_1346_783_w1200_h678_fmax.jpg", "publishedAt": "2022-02-27T07:00:00Z", "content": ""}, {"source": {"id": null, "name": "Beam.land"}, "author": "Izer", "title": "For the first time, a Tatooine-like planet has been discovered via a wobbling star - BEAM Media", "description": "Not all planetary systems are the same. There in the Big, Vast Galaxy, a number of different formations have been observed, some of which are very", "url": "https://beam.land/for-the-first-time-a-tatooine-like-planet-has-been-discovered-via-a-wobbling-star/", "urlToImage": null, "publishedAt": "2022-02-27T00:27:13Z", "content": "Not all planetary systems are the same. There in the Big, Vast Galaxy, a number of different formations have been observed, some of which are very different from our home system. These include extras… [+4671 chars]"}, {"source": {"id": null, "name": "Mindmatters.ai"}, "author": null, "title": "Former Astronaut Names Planet He Thinks Most Likely To Have Life - Walter Bradley Center for Natural and Artificial Intelligence", "description": "Chris Hadfield points to Kepler-442b as Earth-like but some researchers defend the possibility of life even on tidally locked planets, in “edge” zones.", "url": "https://mindmatters.ai/2022/02/former-astronaut-names-planet-he-thinks-most-likely-to-have-life/", "urlToImage": "https://mindmatters.ai/wp-content/uploads/sites/2/2022/02/extremely-detailed-and-realistic-high-resolution-3d-image-of-an-exoplanet-shot-from-space-elements-of-this-image-are-furnished-by-nasa-stockpack-adobe-stock-scaled.jpg", "publishedAt": "2022-02-27T00:24:35Z", "content": "Former astronaut Chris Hadfield, with nearly 5000 known exoplanets to choose from, names Kepler-442b, 1200 light years from Earth, as an excellent one for the James Webb Space Telescope to have a loo… [+2916 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "Erasing The Distance: New Laser Propulsion System Will Get You To Mars In 45 Days - Optic Flux", "description": "McGill University academics and engineers claim to have developed a new laser-propelled spaceship capable of transporting passengers from Earth to Mars in a little over six weeks. As per NASA's estimations, the possible journey time for mankind to reach Mars …", "url": "https://www.opticflux.com/erasing-the-distance-new-laser-propulsion-system-will-get-you-to-mars-in-45-days/16232/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/04/mars-china.jpg", "publishedAt": "2022-02-26T22:05:41Z", "content": "McGill University academics and engineers claim to have developed a new laser-propelled spaceship capable of transporting passengers from Earth to Mars in a little over six weeks.\r\nAs per NASA’s esti… [+1666 chars]"}, {"source": {"id": null, "name": "Overtells.com"}, "author": "Izer", "title": "Scientists are realizing that a recurring, mysterious fast radio burst from space looks strangely familiar - OverTells Gaming", "description": "Scientists got a strange sense of déjà vu when they took a closer look at a mysterious series of bright flashes in a galaxy just 12 million light-years", "url": "https://overtells.com/scientists-are-realizing-that-a-recurring-mysterious-fast-radio-burst-from-space-looks-strangely-familiar/", "urlToImage": "https://overtells.com/wp-content/uploads/2022/02/Scientists-are-realizing-that-a-recurring-mysterious-fast-radio-burst.png", "publishedAt": "2022-02-26T20:23:50Z", "content": "Scientists got a strange sense of déjà vu when they took a closer look at a mysterious series of bright flashes in a galaxy just 12 million light-years away.\r\nThe flashes, known as a frequent fast ra… [+4054 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Abby Lee Hood", "title": "2013 Meteor May Have Been Involved in Creating the Moon - Futurism", "description": "The Chelyabinsk meteorite that exploded in the Russian sky back in 2013 could actually have been involved in the creation of Earth's Moon.", "url": "https://futurism.com/the-byte/meteor-russia-moon", "urlToImage": "https://wp-assets.futurism.com/2022/02/meteor-russia-moon.png", "publishedAt": "2022-02-26T19:34:35Z", "content": "That must've been a powerful explosion.\r\nMoon Rocks\r\nThe Chelyabinsk meteor that exploded in the Russian sky back in 2013 could actually have been involved in the creation of Earths Moon, according t… [+2446 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Long-term space travel can 'rewire' astronauts' brains | smart news - BollyInside", "description": "Astronauts in the study were in space for an average of five and a half months. Their brains showed fluid shifts—our brains are about 80 percent water—and", "url": "https://www.bollyinside.com/news/long-term-space-travel-can-rewire-astronauts-brains-smart-news", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-26T19:18:24Z", "content": "Astronauts in the study were in space for an average of five and a half months. Their brains showed fluid shiftsour brains are about 80 percent waterand an increase of gray and white matter in the br… [+3323 chars]"}, {"source": {"id": null, "name": "Myv949.com"}, "author": "Birmingham Times", "title": "Wormwood Extract Shows Promise For A Longer Lifespan - myv949.com", "description": "By Martin M Barillas A new study shows that a common natural plant extract may lead to greater metabolic health and longer lifespans. Researchers at Louisiana State University fed the leaves of Artemisia scoparia &mdash; a species of wormwood common in Asia a…", "url": "https://myv949.com/2022/02/26/wormwood-extract-shows-promise-for-a-longer-lifespan/", "urlToImage": "https://www.birminghamtimes.com/wp-content/uploads/2022/02/feat_0d7ec1a1-a1d5-4ffc-85f1-a57580bb2047-150x150.jpeg", "publishedAt": "2022-02-26T18:05:02Z", "content": "A new study shows that a common natural plant extract may lead to greater metabolic health and longer lifespans.\r\nResearchers at Louisiana State University fed the leaves of Artemisia scoparia — a sp… [+4099 chars]"}, {"source": {"id": null, "name": "Teslanorth.com"}, "author": "Nehal Malik", "title": "SpaceX Accuses Viasat of Trying to Access Starlink Tech Through the FCC - TeslaNorth.com - Tesla North", "description": "In an Thursday filing with the U.S. Federal Communications Commission (FCC), SpaceX defended its proposal for the deployment of second-generation Starlink satellites and accused competitor ... Read more", "url": "https://teslanorth.com/2022/02/26/spacex-accuses-viasat-of-trying-to-access-starlink-tech-through-the-fcc/", "urlToImage": "https://cdn.teslanorth.com/wp-content/uploads/2020/07/starlink-terminal-sunset-2.jpg", "publishedAt": "2022-02-26T17:23:29Z", "content": "In an Thursday filing with the U.S. Federal Communications Commission (FCC), SpaceX defended its proposal for the deployment of second-generation Starlink satellites and accused competitor Viasat of … [+3850 chars]"}]}