{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "WebMD"}, "author": "HealthDay", "title": "Faster-Spreading COVID Variant Expanding in US - WebMD", "description": "The faster-spreading COVID-19 variant first detected in the United Kingdom is on its way to becoming the dominant form of the virus in the United States.", "url": "https://www.webmd.com/lung/news/20210402/faster-spreading-covid-variant-expanding-in-us", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/virus_3d_render_blue_02_other/1800x1200_virus_3d_render_blue_02_other.jpg", "publishedAt": "2021-04-02T14:02:59Z", "content": "FRIDAY, April 2, 2021 (HealthDay News) -- The faster-spreading COVID-19 variant first detected in the United Kingdom is on its way to becoming the dominant form of the virus in the United States.\r\nA … [+2434 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "NASA and ESA release spectacular updated Hubble image of Veil Nebula (PHOTO) - RT", "description": "Using new techniques, scientists have released a breathtaking updated image of the Veil Nebula, the beautiful remains of a supernova which took place 10,000 years ago.", "url": "https://www.rt.com/news/519930-updated-hubble-image-veil-nebula/", "urlToImage": "https://cdni.rt.com/files/2021.04/article/6066f88a2030270cb866026e.jpg", "publishedAt": "2021-04-02T12:37:00Z", "content": "The supernova remnant is called the Cygnus Loop and is the result of the death of a star 20 times the mass of the Sun, which exploded some 2,100 light-years away. The hollowed-out remains of the star… [+1555 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Michael Dahlstrom", "title": "Concern after wildlife refuge 'showered with rocket parts' - Yahoo News Australia", "description": "A tweet about the environmental impact of a SpaceX rocket test went viral before the author was \"encouraged\" to delete it.", "url": "https://au.news.yahoo.com/concern-after-wildlife-refuge-showered-with-rocket-parts-115609011.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-04/ae2bd620-934f-11eb-bdff-e79687cf88c9", "publishedAt": "2021-04-02T11:56:09Z", "content": "As SpaceX reached towards space during a rocket attempt, back on Earth a social media post about its impact on wildlife research went viral.\r\nAfter the unmanned Starship prototype rocket SN11 explode… [+3247 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising Evidence for PeVatrons, the Milky Way’s Most Powerful Particle Accelerators - SciTechDaily", "description": "The Tibet ASγ experiment, a China-Japan joint research project on cosmic-ray observation, has discovered ultra-high-energy diffuse gamma rays from the Milky Way galaxy. The highest energy detected is estimated to be unprecedentedly high, nearly 1 Peta electro…", "url": "https://scitechdaily.com/surprising-evidence-for-pevatrons-the-milky-ways-most-powerful-particle-accelerators/", "urlToImage": "https://scitechdaily.com/images/Ultra-High-Energy-Gamma-Ray-Distribution.jpg", "publishedAt": "2021-04-02T11:47:22Z", "content": "Figure 1. Distribution of the ultra-high-energy gamma rays (yellow points) detected by the Tibet ASγ experiment in the galactic coordinate system. They are obviously concentrated along the galactic d… [+4960 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Evidence of Antarctic glacier's tipping point confirmed for first time - Phys.org", "description": "Researchers have confirmed for the first time that Pine Island Glacier in West Antarctica could cross tipping points, leading to a rapid and irreversible retreat which would have significant consequences for global sea level.", "url": "https://phys.org/news/2021-04-evidence-antarctic-glacier.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/evidenceofan.jpg", "publishedAt": "2021-04-02T08:05:34Z", "content": "Researchers have confirmed for the first time that Pine Island Glacier in West Antarctica could cross tipping points, leading to a rapid and irreversible retreat which would have significant conseque… [+4558 chars]"}, {"source": {"id": null, "name": "Blue Mountains Gazette"}, "author": "Jennie Curtin", "title": "Winmalee students to speak to astronauts - Blue Mountains Gazette", "description": "Ground control: Winmalee to space.", "url": "https://www.bluemountainsgazette.com.au/story/7193292/winmalee-ground-control/", "urlToImage": "https://www.bluemountainsgazette.com.au/images/transform/v1/crop/frm/8bGEiHWLyUjrk3bpemiXyX/06b5ea18-483c-4208-9603-002cfd7b8de6.jpeg/r0_1162_3024_2871_w1200_h678_fmax.jpg", "publishedAt": "2021-04-02T04:14:00Z", "content": "Winmalee Public will become ground control later this month when eight students talk to an astronaut on the International Space Station.\r\n Head in the stars: Back row, Erin DeBono, Charlotte Webster,… [+2493 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Controversial test flight aimed at cooling the planet cancelled - The Jakarta Post - Jakarta Post", "description": "A team of Harvard scientists had been planning to launch a high-altitude balloon from the Esrange Space Station in the Swedish town of Kiruna, to test whether it could in future carry equipment to release solar radiation-reflecting particles into the Earth's …", "url": "http://www.thejakartapost.com/life/2021/04/02/controversial-test-flight-aimed-at-cooling-the-planet-cancelled-.html", "urlToImage": "https://img.jakpost.net/c/2021/04/02/2021_04_02_111957_1617332805._large.jpg", "publishedAt": "2021-04-02T03:45:00Z", "content": "US and European scientists have called off a controversial balloon test flight that was to take place in Sweden's far north in June, part of a disputed solar geoengineering experiment to artificially… [+1610 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "OSIRIS-REx to make final close approach to asteroid before heading back to Earth - SpaceNews", "description": "NASA’s OSIRIS-REx spacecraft will make one final close approach to the asteroid it collected samples from next week before heading back to Earth.", "url": "https://spacenews.com/?p=112877", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/04/orex-flyby.jpg", "publishedAt": "2021-04-02T02:13:28Z", "content": "WASHINGTON NASAs OSIRIS-REx spacecraft will make one final close approach to the asteroid it collected samples from next week before heading back to Earth.\r\nOn April 7, the spacecraft will pass 3.7 k… [+3045 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Julia Musto", "title": "Rare space selfie from Mars rover - Whitsunday Times", "description": "NASA Perseverance Mars rover shares selfie from surface", "url": "https://www.news.com.au/technology/science/space/nasa-perseverance-mars-rover-shares-selfie-from-surface/news-story/34825ecb13bb191e7b424c4b660632be", "urlToImage": "https://cdn.newsapi.com.au/image/v1/007bc9bfc01aa4102c9d239338fa9cdf?width=1280", "publishedAt": "2021-04-02T00:09:00Z", "content": "NASAs Jet Propulsion Laboratory (JPL) released a stunning selfie taken by the Curiosity Mars rover on Tuesday. In a tweet, the Curiosity team explained the image was captured near the impressive rock… [+2297 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Solar storm that appeared like 'a great fire' in 1582 could hit Earth AGAIN, experts warn - Daily Mail", "description": "Eye-witness accounts of a 'great fire' that appeared in 1582 have been uncovered. Experts say it was a once-in-a-century occurrence, which suggest our modern-day planet could be hit this century.", "url": "https://www.dailymail.co.uk/sciencetech/article-9428993/Solar-storm-appeared-like-great-fire-1582-hit-Earth-experts-warn.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/02/00/41244894-0-image-a-49_1617320843953.jpg", "publishedAt": "2021-04-01T23:52:34Z", "content": "A great fire appeared in the sky over dozens of cities across Europe and Asia in 1582 and eye-witness accounts of this solar storm have recently  been uncovered.\r\nScientists at Cornell University fou… [+4768 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jeremy Blum", "title": "New Dinosaur Whose Name Means 'One Who Causes Fear' Discovered In Argentina - HuffPost", "description": "Llukalkan aliocranianus appears to have been a top predator in its time, with hearing capabilities potentially exceeding those of similar dinosaurs.", "url": "https://www.huffpost.com/entry/llukalkan-aliocranianus-one-who-causes-fear_n_606631e6c5b67785b7779677", "urlToImage": "https://img.huffingtonpost.com/asset/6066367d240000e7322605e0.jpg?ops=1778_1000", "publishedAt": "2021-04-01T23:49:00Z", "content": "Paleontologists have discovered a new dinosaur species in Argentina, dubbing it Llukalkan aliocranianus. Llukalkan means the one who causes fear in the Mapuche language, and aliocranianus is Latin fo… [+1780 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Hubble's Renewed Image of The Veil Nebula Will Take Your Breath Away - ScienceAlert", "description": "Stars die in fire and fury.", "url": "https://www.sciencealert.com/hubble-s-reprocessed-image-of-the-veil-nebula-will-take-your-breath-away", "urlToImage": "https://www.sciencealert.com/images/2021-03/processed/veil-nebula_1024.jpg", "publishedAt": "2021-04-01T23:00:59Z", "content": "Stars die in fire and fury.\r\nThey tremble and shake, erupting their viscera out into space; when the star explodes and the violence is done, a gorgeously glowing cloud of star guts remains.\r\nSuch an … [+2596 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "The secret to a rat’s sense of touch? It’s all in how the whiskers bend - Ars Technica", "description": "Scientists develop first mechanical simulation of whisker/follicle interactions.", "url": "https://arstechnica.com/science/2021/04/the-secret-to-a-rats-sense-of-touch-its-all-in-how-the-whiskers-bend/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/03/whiskerTOP-760x380.jpg", "publishedAt": "2021-04-01T22:12:35Z", "content": "Enlarge/ Northwestern University scientists have developed the first mechanical simulation of a rat whisker inside its follicle, to better understand how that sensory input is communicated to the bra… [+7081 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "U.S. pesticide use falls but harms pollinators more, study finds - NBC News", "description": "American farmers are using smaller amounts of better targeted pesticides, but these are harming pollinators, aquatic insects and some plants far more.", "url": "https://www.nbcnews.com/science/environment/us-pesticide-use-falls-harms-pollinators-study-finds-rcna582", "urlToImage": "https://media1.s-nbcnews.com/j/rockcms/2021-04/791/210401-pesticide-se-528p-fda2d2_b859076e27ee5d2b4037aefa9119e4c5e664eed5.nbcnews-fp-1200-630.jpg", "publishedAt": "2021-04-01T21:31:29Z", "content": "American farmers are using smaller amounts of better targeted pesticides, but these are harming pollinators, aquatic insects and some plants far more than decades ago, a new study finds.\r\nToxicity le… [+2809 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA astronauts set to repark Crew Dragon on the ISS: How to watch - CNET", "description": "Four astronauts will don their flight suits to relocate Crew Dragon Resilience from port to port.", "url": "https://www.cnet.com/news/nasa-astronauts-set-to-repark-crew-dragon-on-the-iss-how-to-watch/", "urlToImage": "https://www.cnet.com/a/img/B4AX_vVdajMjXsy8HiXvCubThZ8=/1200x630/2021/04/01/61049d3a-ad56-458d-a9d2-25902f1f1357/crew1crewdragon.jpg", "publishedAt": "2021-04-01T21:25:30Z", "content": "Crew Dragon seen docked to the Harmony module on the ISS.\r\nNASA\r\nAnyone who's ever lived in a street-sweeping fine zone knows all about having to repark a car. Astronauts on the International Space S… [+2461 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Scientists Finally Know How an Ancient Reptile Lived With Such an Absurdly Long Neck - ScienceAlert", "description": "Make a crocodile out of taffy. Take its head and tug on it until its neck extends a good few meters from its body. If you squint, this could be what one odd-looking Triassic reptile called Tanystropheus looked like. More or less.", "url": "https://www.sciencealert.com/scientists-finally-know-how-this-ancient-reptile-lived-with-such-an-absurdly-long-neck", "urlToImage": "https://www.sciencealert.com/images/2020-08/processed/longobardicus_long_neck_reptile_1024.jpg", "publishedAt": "2021-04-01T21:03:04Z", "content": "Make a crocodile out of taffy. Take its head and tug on it until its neck extends a good few meters from its body. If you squint, this could be what one odd-looking Triassic reptile called Tanystroph… [+4810 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Lego's NASA Space Shuttle Discovery set with Hubble is a space geek's dream (review) - Space.com", "description": "", "url": "https://www.space.com/lego-nasa-space-shuttle-discovery-hubble-set-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4GRuU2Ru4BX65zmrT7UWGh-1200-80.jpg", "publishedAt": "2021-04-01T20:18:27Z", "content": "I'm a millennial who wasn't even born when the space shuttle first flew, but as a kid of the early 1980s I was lucky enough to follow many of its missions until NASA retired the fleet in 2011.\r\nNatur… [+8535 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "NASA just released the first direct evidence that humans are causing climate change - ZME Science", "description": "It was clear humans were warming the planet for some time -- now we have official confirmation.", "url": "https://www.zmescience.com/science/direct-evidence-climate-change-human-made-053252/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2021/04/radiativeforcing_3.gif", "publishedAt": "2021-04-01T19:46:13Z", "content": "A simplified animation of Earth’s planetary energy balance: A planets energy budget is balanced between incoming (yellow) and outgoing radiation (red). Credit: NASA.\r\nBy now it should be no surprise … [+4294 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A new state of light: Physicists observe new phase in Bose-Einstein condensate of light particles - Science Daily", "description": "A single 'super photon' made up of many thousands of individual light particles: About ten years ago, researchers produced such an extreme aggregate state for the first time. Researchers report of a new, previously unknown phase transition in the optical Bose…", "url": "https://www.sciencedaily.com/releases/2021/04/210401151258.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-01T19:35:49Z", "content": "A single \"super photon\" made up of many thousands of individual light particles: About ten years ago, researchers at the University of Bonn produced such an extreme aggregate state for the first time… [+3839 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Chris Davies", "title": "NASA’s Europa Clipper hits huge milestone in hunt for life on Jupiter’s moon - SlashGear", "description": "NASA has big hopes for Jupiter’s moon Europa, and the American space agency has just dotted the i’s and crossed the t’s on the spacecraft that will fly out there to see if it can …", "url": "https://www.slashgear.com/nasas-europa-clipper-hits-huge-milestone-in-hunt-for-life-on-jupiters-moon-01666680/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/04/nasa-europa-clipper-spacecraft.jpg", "publishedAt": "2021-04-01T19:24:00Z", "content": "NASA has big hopes for Jupiter’s moon Europa, and the American space agency has just dotted the i’s and crossed the t’s on the spacecraft that will fly out there to see if it can actually support lif… [+4780 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "http://www.facebook.com/paulmattsutter", "title": "There are Ocean Currents Under the ice on Enceladus - Universe Today", "description": "Underneath its shell of ice, the globe-spanning ocean of Enceladus isn’t sitting still. Instead, it might possibly host massive ocean currents, driven by changes in salinity. Ocean world By all rights, the tiny world of Enceladus, the sixth-largest moon of Sa…", "url": "https://www.universetoday.com/150749/there-are-ocean-currents-under-the-ice-on-enceladus/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2012/03/N00185291.jpg", "publishedAt": "2021-04-01T19:05:35Z", "content": "Underneath its shell of ice, the globe-spanning ocean of Enceladus isn’t sitting still. Instead, it might possibly host massive ocean currents, driven by changes in salinity.\r\nOcean world\r\nBy all rig… [+2564 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "Past ice melts may have caused seas to rise 10 times faster than today: study - Macau Business", "description": "Ice sheet melting at the end of the last ice age may have caused sea levels to rise at 10 times the current rate, a study published Thursday", "url": "https://www.macaubusiness.com/past-ice-melts-may-have-caused-seas-to-rise-10-times-faster-than-today-study/", "urlToImage": null, "publishedAt": "2021-04-01T18:33:35Z", "content": "Ice sheet melting at the end of the last ice age may have caused sea levels to rise at 10 times the current rate, a study published Thursday by a team led by scientists from Britain’s Durham Universi… [+2593 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How the Chicxulub impactor gave rise to modern rainforests - Phys.org", "description": "Tropical rainforests today are biodiversity hotspots and play an important role in the world's climate systems. A new study published today in Science sheds light on the origins of modern rainforests and may help scientists understand how rainforests will res…", "url": "https://phys.org/news/2021-04-chicxulub-impactor-gave-modern-rainforests.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/flowers.jpg", "publishedAt": "2021-04-01T18:00:50Z", "content": "Tropical rainforests today are biodiversity hotspots and play an important role in the world's climate systems. A new study published today in Science sheds light on the origins of modern rainforests… [+6386 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "2D materials combine, becoming polarized and giving rise to photovoltaic effect - Phys.org", "description": "For the first time, researchers have discovered a way to obtain polarity and photovoltaic behavior from certain nonphotovoltaic, atomically flat (2D) materials. The key lies in the special way in which the materials are arranged. The resulting effect is diffe…", "url": "https://phys.org/news/2021-04-2d-materials-combine-polarized-photovoltaic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/polarizedpho.jpg", "publishedAt": "2021-04-01T18:00:11Z", "content": "For the first time, researchers have discovered a way to obtain polarity and photovoltaic behavior from certain nonphotovoltaic, atomically flat (2D) materials. The key lies in the special way in whi… [+3092 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Distant, spiralling stars give clues to the forces that bind sub-atomic particles - Nanowerk", "description": "Space scientists have found a new way to probe the internal structure of neutron stars, giving clues about the makeup of matter at an atomic level.", "url": "https://www.nanowerk.com/news2/space/newsid=57693.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57693.jpg", "publishedAt": "2021-04-01T17:34:26Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Extinction at the end-Cretaceous and the origin of modern Neotropical rainforests - Science Magazine", "description": "The origin of modern rainforests can be traced to the aftermath of the bolide impact at the end of the Cretaceous. Carvalho et al. used fossilized pollen and leaves to characterize the changes that took place in northern South American forests at this time (s…", "url": "https://science.sciencemag.org/content/372/6537/63.full", "urlToImage": "https://science.sciencemag.org/content/372/6537/63/F1.large.jpg", "publishedAt": "2021-04-01T17:33:54Z", "content": "By Mónica R. Carvalho, Carlos Jaramillo, Felipe de la Parra, Dayenari Caballero-Rodríguez, Fabiany Herrera, Scott Wing, Benjamin L. Turner, Carlos DApolito, Millerlandy Romero-Báez, Paula Narváez, Ca… [+210 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Amazing Scientists (Photo) - UNIAN - SwordsToday.ie", "description": "Scientists still do not know what causes X-rays on the planet.X-ray uranium seems unusual / NASA / CXO / University College London / W. DonAstronomers", "url": "https://swordstoday.ie/amazing-scientists-photo-unian/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/04/Amazing-Scientists-Photo-UNIAN.09710717376591327.jpeg", "publishedAt": "2021-04-01T17:14:14Z", "content": "Scientists still do not know what causes X-rays on the planet.X-ray uranium seems unusual / NASA / CXO / University College London / W. Don\r\nAstronomers have discovered X-rays emitted by Uranus.\r\nPar… [+809 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Sensors Collect Crucial Mars Landing Data with Arrival of Perseverance - NASA", "description": "Sensors Collect Crucial Data on Mars Landings with Arrival of Perseverance", "url": "https://www.nasa.gov/feature/sensors-collect-crucial-data-on-mars-landings-with-arrival-of-perseverance/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/rdc_00000005_000_000958.png", "publishedAt": "2021-04-01T16:38:49Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brittany Enos", "title": "NASA OSIRIS-REx's final asteroid observation run - Phys.org", "description": "NASA's OSIRIS-REx mission is on the brink of discovering the extent of the mess it made on asteroid Bennu's surface during last fall's sample collection event. On Apr. 7, the OSIRIS-REx spacecraft will get one last close encounter with Bennu as it performs a …", "url": "https://phys.org/news/2021-04-nasa-osiris-rex-asteroid.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/nasaosirisre.jpg", "publishedAt": "2021-04-01T16:29:40Z", "content": "NASA's OSIRIS-REx mission is on the brink of discovering the extent of the mess it made on asteroid Bennu's surface during last fall's sample collection event. On Apr. 7, the OSIRIS-REx spacecraft wi… [+3736 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Nasa is building a spacecraft to reach an asteroid worth $10 quintillion - The Independent", "description": "The rock is floating in the asteroid belt between Mars and Jupiter", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/nasa-asteroid-psyche-spacecraft-quintillion-b1825714.html", "urlToImage": "https://static.independent.co.uk/2021/04/01/16/Untitled.png?width=1200&auto=webp&quality=75", "publishedAt": "2021-04-01T15:53:48Z", "content": "Nasa has officially begun the final assembly of its Psyche spacecraft, which will explore an asteroid of the same name worth $10 quintillion.\r\nThe space agency shared images and video of the craft be… [+4342 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Marsquake! NASA’s InSight Detects Two Sizable Quakes on Mars - SciTechDaily", "description": "NASA’s InSight lander used a scoop on its robotic arm to begin trickling soil over the cable connecting its seismometer to the spacecraft on March 14, 2021, the 816th Martian day, or sol of the mission. Scientists hope insulating it from the wind will make it…", "url": "https://scitechdaily.com/mars-quake-nasas-insight-detects-two-sizable-quakes-on-mars/", "urlToImage": "https://scitechdaily.com/images/NASA-Mars-InSight-Deploys-Instruments-scaled.jpg", "publishedAt": "2021-04-01T15:49:25Z", "content": "NASA’s InSight lander used a scoop on its robotic arm to begin trickling soil over the cable connecting its seismometer to the spacecraft on March 14, 2021, the 816th Martian day, or sol of the missi… [+5957 chars]"}, {"source": {"id": null, "name": "Ecotextile.com"}, "author": "John Mowbray", "title": "Exclusive: Chemical cocktail found in face masks - Ecotextile News", "description": "Exclusive: Chemical cocktail found in face masks", "url": "https://www.ecotextile.com/2021040127603/dyes-chemicals-news/exclusive-chemical-cocktail-found-in-face-masks.html", "urlToImage": "https://www.ecotextile.com/images/stories/2021/April/Mask-Landscape.jpg", "publishedAt": "2021-04-01T13:00:01Z", "content": "Top German scientists have found that wearing certain types of face masks for long periods of time could result in potentially hazardous chemicals and harmful microplastics being inhaled deep into hu… [+7331 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "NASA's Roman mission predicted to find 100,000 transiting planets - Phys.org", "description": "NASA's Nancy Grace Roman Space Telescope will create enormous cosmic panoramas, helping us answer questions about the evolution of our universe. Astronomers also expect the mission to find thousands of planets using two different techniques as it surveys a wi…", "url": "https://phys.org/news/2021-04-nasa-roman-mission-transiting-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-nasasromanmi.jpg", "publishedAt": "2021-04-01T12:31:48Z", "content": "NASA's Nancy Grace Roman Space Telescope will create enormous cosmic panoramas, helping us answer questions about the evolution of our universe. Astronomers also expect the mission to find thousands … [+6389 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Early Humans Collected Crystals 105,000 Years Ago - Forbes", "description": "Early humans collected calcite crystals in a rock-shelter at the edge of the Kalahari Desert, South Africa, 105,000 years ago.", "url": "https://www.forbes.com/sites/davidbressan/2021/04/01/early-humans-collected-crystals-105000-years-ago/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6065a06df540bc214674517f%2F0x0.jpg", "publishedAt": "2021-04-01T12:30:33Z", "content": "Some of the calcite crystals found at Ga-Mohana, a rockshelter site in the Kalahari Desert, South ... [+] Africa, deliberately deposited here by humans 105,000 years ago.\r\nWilkins et al. 2021\r\nThe na… [+2351 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Physics in the pandemic: 'We've been surprised at how easy it's become to do high-level experiments from our homes' – Physics World - physicsworld.com", "description": "After COVID made crowded control rooms hazardous, Ben Penaflor and colleagues at the DIII-D National Fusion Facility developed work-arounds", "url": "https://physicsworld.com/physics-in-the-pandemic-weve-been-surprised-at-how-easy-its-become-to-do-high-level-experiments-from-our-homes/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2021/03/Ben-Penaflor_small.png", "publishedAt": "2021-04-01T12:04:52Z", "content": "Ben Penaflor is computer systems manager at General Atomics, which operates the DIII-D National Fusion Facility in San Diego, California, for the US Department of Energy. This post is part of a serie… [+7955 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Theresa Wiegert", "title": "A new Goldilocks black hole | Space - EarthSky", "description": "Astronomers have detected a", "url": "https://earthsky.org/space/intermediate-black-hole-gravitational-lens-gamma-ray-burst", "urlToImage": "https://earthsky.org/upl/2021/03/Intermediate_Black_Hole_Goldilocks_UofMelbourne_March_2021-300x167.jpg", "publishedAt": "2021-04-01T12:01:29Z", "content": "Intermediate-mass black holes, larger than the ones formed from individual stars – but smaller than the supermassive ones at the centers of galaxies – should theoretically exist. Now astronomers say … [+6209 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "Iron Age warriors were buried lying on feather-stuffed cushions, near a headless owl - Livescience.com", "description": "\"Beauty sleep was also taken care of in death.\"", "url": "https://www.livescience.com/iron-age-warriors-feather-beds.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EMM56ebC9ApAsSWrBxn8aG-1200-80.jpg", "publishedAt": "2021-04-01T11:03:00Z", "content": "In an Iron Age cemetery in what is now Sweden, two warriors who died during the seventh century A.D. were lavishly buried in boats with an unexpectedly luxurious touch: soft bedding stuffed with feat… [+4792 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Anna Funk", "title": "Self-healing “Xenobots” mean a future with living machines - Inverse", "description": "Scientists pair machine learning with developmental biology to create self-assembling cellular bots.", "url": "https://www.inverse.com/innovation/xenobots-are-living-machines", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/3/31/445d914b-3798-425f-b41b-86aae38924f0-xenobots2.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-04-01T11:00:25Z", "content": "One hundred years ago\r\n, it was easy to tell when something was a machine. Machines were hard and clanky, metallic, and pretty heavy, as developmental biologist Michael Levin tells Inverse.\r\nBut late… [+8073 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Alyssa Carson: 20-year-old sets her sights to be first person on Mars - ABC News", "description": "Lots of kids dream about becoming an astronaut. Alyssa Caron's actually doing it.", "url": "https://www.abc.net.au/triplej/programs/hack/alyssa-carson-on-a-misson-to-mars/13286824", "urlToImage": "https://www.abc.net.au/cm/rimage/13286846-16x9-large.jpg?v=3", "publishedAt": "2021-04-01T06:39:51Z", "content": "Lots of kids dream of becoming an astronaut, but Alyssa Carson is actually doing it. \r\nAlyssa Carson has loved space since she was a little kid. Now, aged just 20, she's set her sights on becoming th… [+2425 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "PCMag", "title": "First All-Civilian Space Mission Selects Its Final Crew Members - Mashable India", "description": "The final two members of a four-person crew scheduled for a historic mission to space later this year have been announced. Christopher Sembroski and Sian Proctor will join previously announced team members Hayley Arceneaux and Jared Isaacman on the world's fi…", "url": "https://in.mashable.com/science/21295/first-all-civilian-space-mission-selects-its-final-crew-members", "urlToImage": "https://sm.mashable.com/t/mashable_in/news/f/first-all-/first-all-civilian-space-mission-selects-its-final-crew-memb_ky6u.1200.png", "publishedAt": "2021-04-01T06:00:00Z", "content": "The final two members of a four-person crew scheduled for a historic mission to space later this year have been announced. Christopher Sembroski and Sian Proctor will join previously announced team m… [+3034 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "We Just Got Closer to Truly Determining Who Were The World's First Animals - ScienceAlert", "description": "The tree of animal life had to begin somewhere. Finding that original branch amongst such a tangled canopy is harder than it sounds, though.", "url": "https://www.sciencealert.com/sponges-are-back-on-the-table-as-the-oldest-branch-in-the-animal-kingdom", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/spongesoldest_1024.jpg", "publishedAt": "2021-04-01T05:53:28Z", "content": "The tree of animal life had to begin somewhere. Finding that original branch amongst such a tangled canopy is harder than it sounds, though.\r\nA new analysis of genomic data suggests that one phylum i… [+5450 chars]"}, {"source": {"id": null, "name": "Observer"}, "author": "Rodney Stevens, RODNEY STEVENS, rodney.stevens@news.com.au", "title": "Poo pellets potential key koala survival link - Morning Bulletin", "description": "Scientists have spent a year studying koala poo, which could hold a key to preserving the iconic species.", "url": "https://www.gladstoneobserver.com.au/news/poo-pellets-potential-key-koala-survival-link/4230001/", "urlToImage": "https://media.apnarm.net.au/media/images/2021/04/01/v3imagesbin519d74b47adf6c4c580d68418a0f8052-9e3xju1ymmcxzhkh4w2_ct1880x930.jpg", "publishedAt": "2021-04-01T05:00:00Z", "content": "The key to the survival of Australias globally iconic koala species may be found in its faeces, a Central Queensland scientist has found.\r\nThe critical revelation could determine how long future gene… [+2796 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Mathew Dickerson", "title": "Puncture-proof tyres inspired by Mars mission, a cyclist's saviour - The Canberra Times", "description": "The SMART Tire Company has been created with the blessing of NASA to create tyres for earth vehicles.", "url": "https://www.canberratimes.com.au/story/7192890/puncture-proof-tyres-inspired-by-mars-mission-a-cyclists-saviour/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/jess.wallace/aa59d0f2-d7ee-427e-bd04-dc9492e3dc43.jpg/r0_1128_2800_2710_w1200_h678_fmax.jpg", "publishedAt": "2021-04-01T04:10:11Z", "content": "NASA needed a tyre that could deform when it ran over objects. Picture: Shutterstock."}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "NASA says humans are breaking with the Earth's natural ecological balance - The Press Stories", "description": "A new study by NASA says that human activity is to blame for the environmental imbalances that produce too much energy on Earth. The earth renews its", "url": "https://presstories.com/2021/04/01/nasa-says-humans-are-breaking-with-the-earths-natural-ecological-balance/", "urlToImage": "https://presstories.com/wp-content/uploads/2021/04/NASA-says-humans-are-breaking-with-the-Earths-natural-ecological.jpg", "publishedAt": "2021-04-01T00:49:42Z", "content": "A new study by NASA says that human activity is to blame for the environmental imbalances that produce too much energy on Earth.\r\nThe earth renews its energy resources as part of its natural cycles. … [+2587 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "An Enormous 'Radio Jellyfish' Just Rose From The Dead in The Night Sky - ScienceAlert", "description": "This jellyfish-like cloud is a million light-years wide, but barely visible. It may be a 'phoenix' risen from the dead.", "url": "https://www.livescience.com/radio-jellyfish-galaxy-cluster-phoenix.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9PDLxYUyDLW5JcGsa63rd9-1200-80.png", "publishedAt": "2021-03-31T23:45:36Z", "content": "Galaxy clusters are the largest structures in the universe bound together by gravity\r\n. They can contain thousands of galaxies, enormous oceans of hot gas, invisible islands of dark matter\r\n and some… [+3297 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Lakes on Greenland Ice Sheet can drain huge amounts of water, even in winter - Phys.org", "description": "Using satellite data to 'see in the dark', researchers have shown for the first time that lakes on the Greenland Ice Sheet drain during winter, a finding with implications for the speed at which the world's second-largest ice sheet flows to the ocean.", "url": "https://phys.org/news/2021-03-lakes-greenland-ice-sheet-huge.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/lakesongreen.jpg", "publishedAt": "2021-03-31T23:00:01Z", "content": "Using satellite data to 'see in the dark', researchers have shown for the first time that lakes on the Greenland Ice Sheet drain during winter, a finding with implications for the speed at which the … [+5565 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Maybe Mars Didn’t Lose its Water After All. It’s Still Trapped on the Planet - Universe Today", "description": "Roughly 4 billion years ago, Mars looked a lot different than it does today. For starters, its atmosphere was thicker and warmer, and liquid water flowed across its surface. This included rivers, standing lakes, and even a deep ocean that covered much of the …", "url": "https://www.universetoday.com/150695/maybe-mars-didnt-lose-its-water-after-all-its-still-trapped-on-the-planet/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/Wet-Mars-This-is-an-artistu2019s-impression-of-habitable-Mars-Daein-Ballard-CC-BY-SA-3.0.jpg", "publishedAt": "2021-03-31T22:17:32Z", "content": "Roughly 4 billion years ago, Mars looked a lot different than it does today. For starters, its atmosphere was thicker and warmer, and liquid water flowed across its surface. This included rivers, sta… [+6674 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New Type of Paleolake Spotted on Mars | Planetary Science, Space Exploration - Sci-News.com", "description": "A 54-km- (33.5-mile) diameter Noachian-aged crater with neither inlet nor outlet channels is distinct from previously documented crater basin lakes on the planet, according to new research from Brown University.", "url": "http://www.sci-news.com/space/closed-source-drainage-basin-crater-mars-09509.html", "urlToImage": "http://cdn.sci-news.com/images/2021/03/image_9509-Mars-Paleolake.jpg", "publishedAt": "2021-03-31T19:46:42Z", "content": "A 54-km- (33.5-mile) diameter Noachian-aged crater with neither inlet nor outlet channels is distinct from previously documented crater basin lakes on the planet, according to new research from Brown… [+3725 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doyle Rice", "title": "'The one who causes fear:' Newly discovered species of dinosaur was a terrifying beast - USA TODAY", "description": "A newly discovered species of dinosaur in Argentina has been named the \"one who causes fear\" by the scientists who found a well-preserved skull.", "url": "https://www.usatoday.com/story/news/nation/2021/03/31/dinosaur-discovery-new-species-the-one-who-causes-fear/4823612001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/03/31/USAT/7c0ace8d-2875-448f-b391-75ff27d66dbc-260375_web.jpg?crop=1439,810,x0,y102&width=1600&height=800&fit=bounds", "publishedAt": "2021-03-31T19:26:20Z", "content": "Paleontologists discovered the fossilized remains of a 98 million-year-old titanosaur in Argentina. Titanosaurs a group of large sauropod dinosaurs.\r\nVideo Elephant\r\nStory Highlights\r\n<ul><li>These g… [+3498 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Kayla Wiles", "title": "A common shoulder injury could heal faster, thanks to this first-of-a-kind tissue implant - Medical Xpress", "description": "For sports fans, nothing beats seeing their favorite athletes compete at the top of their game. But a shoulder injury such as a badly torn rotator cuff threatens to pause or end the career of any athlete in sports ranging from football, basketball and basebal…", "url": "https://medicalxpress.com/news/2021-03-common-shoulder-injury-faster-first-of-a-kind.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/acommonshoul.jpg", "publishedAt": "2021-03-31T19:00:17Z", "content": "For sports fans, nothing beats seeing their favorite athletes compete at the top of their game. But a shoulder injury such as a badly torn rotator cuff threatens to pause or end the career of any ath… [+6159 chars]"}, {"source": {"id": null, "name": "Riverineherald.com.au"}, "author": null, "title": "AI helps unlock ancient rock art mysteries - Riverine Herald", "description": "", "url": "https://www.riverineherald.com.au/national/2021/04/01/4069696/ai-helps-unlock-ancient-rock-art-mysteries", "urlToImage": "https://res.cloudinary.com/cognitives/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_675,q_auto,w_1200/rtrsll01gtqtd1qtse4x", "publishedAt": "2021-03-31T16:49:48Z", "content": "Scientists are using artificial intelligence to study ancient Australian rock art to learn how the Aboriginal artists' styles developed over thousands of years.The painted motifs are not only weather… [+2202 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New study sows doubt about the composition of 70 percent of our universe - Science Daily", "description": "Researchers the world over have long believed that 70 percent of the universe is composed of dark energy, a substance that makes it possible for the universe to expand at an ever-increasing rate. But in a new study, researchers tested a model which suggests t…", "url": "https://www.sciencedaily.com/releases/2021/03/210331103624.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-31T16:38:55Z", "content": "Until now, researchers have believed that dark energy accounted for nearly 70 percent of the ever-accelerating, expanding universe.For many years, this mechanism has been associated with the so-calle… [+3114 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Damian Carrington", "title": "Damage from invasive species 'trebling every decade' - The Guardian", "description": "Mosquitoes, rats and termites among species that have hitched ride on trade routes, causing at least $1.3tn of damage", "url": "https://amp.theguardian.com/environment/2021/mar/31/damage-from-alien-species-invasions-trebling-every-decade", "urlToImage": null, "publishedAt": "2021-03-31T16:13:00Z", "content": "Invasive speciesMosquitoes, rats and termites among species that have hitched ride on trade routes, causing at least $1.3tn of damage\r\nThe costs of damage caused by invasions of alien species across … [+4563 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Supermoons, Pink moon, and next full moon for 2021 - 7NEWS.com.au", "description": "Full moons always make for dramatic skywatching, but so-called “supermoons” are even more special because they appear a bit bigger and brighter than a typical full moon.", "url": "https://7news.com.au/technology/space/supermoon-and-full-moon-for-2021-c-1778764", "urlToImage": "https://images.s.7news.com.au/publication/C-1778764/33f8239d89e837019d80594d739b0a2b512ea7fa-16x9-x0y99w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T23:21:50Z", "content": "Full moons always make for dramatic skywatching, but so-called supermoons are even more special because they appear a bit bigger and brighter than a typical full moon.\r\nIts a full moon that coincides… [+2827 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "mars 4k images show surface of the red planet in space as you've never seen it before - 7NEWS.com.au", "description": "A quick glimpse and you think you're seeing pictures of the American desert, or somewhere outback. But you are way off.", "url": "https://7news.com.au/technology/space/mars-as-youve-never-seen-it-before-c-1189849", "urlToImage": "https://images.s.7news.com.au/publication/C-1189849/b13f02d17e75f3466944cdf07e897d847894f7fe-16x9-x39y0w1772h997.jpg?imwidth=1024", "publishedAt": "2020-07-24T21:06:44Z", "content": "For the first time, the landscape of Mars has been captured in stunning 4K resolution.\r\nThat is the highest quality that has ever been recorded. And the results are simply breathtaking.\r\nWatch the in… [+1280 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "ISS crew evacuated from Soyuz-MS15 on landing - TASS", "description": "The crew has returned to Earth due to the novel coronavirus pandemic", "url": "https://tass.com/science/1146089", "urlToImage": "https://phototass2.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200417/1263015.jpg", "publishedAt": "2020-04-17T06:20:00Z", "content": "MOSCOW, April 17. /TASS/. Roscosmos cosmonaut Oleg Skripochka and NASA astronauts Andrew Morgan and Jessica Meir have been evacuated from the Soyuz MS-15 manned spacecraft, which landed earlier in Ka… [+717 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Russian, American two-man crew blasts off to ISS - Arab News", "description": "BAIKONUR, Kazakhstan: A Russian and an American blasted off from the Baikonur cosmodrome in Kazakhstan on Thursday, the first two-person launch to the International Space Station in over a decade.The Soyuz MS-04 spacecraft carrying veteran Russian cosmonaut F…", "url": "https://www.arabnews.com/node/1087716", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/04/20/897096-677938539.jpg", "publishedAt": "2019-08-29T02:28:54Z", "content": "ROME: The president of the Union of Islamic Communities of Italy (UCOII) has expressed his warmest wishes to the countrys Catholics for a serene and peaceful Easter.\r\nYassine Lafram, who on Friday vi… [+1051 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Kerry SHERIDAN | AFP", "title": "Before Mars landing, a nail-biting 'six and a half minutes of terror' - Arab News", "description": "TAMPA, US: A spacecraft that cost nearly a billion dollars is on course to make a perilous landing Monday on Mars, if it can survive a high-speed approach and the scorching heat of entering the Red Planet’s atmosphere, a process NASA has nicknamed “six and a …", "url": "https://www.arabnews.com/node/1410096", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/11/24/1378521-650711683.jpg", "publishedAt": "2019-08-26T17:08:11Z", "content": "NEW DELHI: With less than a week to go before regional elections in the southern Indian state of Kerala, experts and political analysts say millions of migrant workers who have returned from the Gulf… [+5433 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Tasmanian tiger doomed long before humans came along - Arab News", "description": "SYDNEY: The Tasmanian tiger was doomed long before humans began hunting the enigmatic marsupial, scientists said Tuesday, with DNA sequencing showing it was in poor genetic health for thousands of years before its extinction. Scientists genetically mapped the…", "url": "https://www.arabnews.com/node/1207691", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/12/12/1052031-1341624965.jpg", "publishedAt": "2019-08-26T13:13:23Z", "content": "ANKARA: The Turkish government faced a tough challenge over the weekend after a video of Kursat Ayvatoglu, a member of the ruling Justice and Development Party (AKP), was publicized on social media w… [+4356 chars]"}]}