{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Science Times"}, "author": "Isabella Beltran", "title": "Fusion Rocket Thruster: A Concept Developed By a Female Physicists that Could Send Us to Mars - Science Times", "description": "Dr. Fatima Ebrahimi, a physicist at PPPL, has discovered a unique concept of a fusion rocket launcher that will make space travel shorter.", "url": "https://www.sciencetimes.com/articles/29463/20210203/fusion-rocket-thruster-concept-developed-female-physicists-send-mars.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/31832/pppl-physicist-fatima-ebrahimi-in-front-of-an-artists-conception-of-a-fusion-rocket.jpg", "publishedAt": "2021-02-03T05:11:23Z", "content": "A unique concept developed by Dr. Fatima Ebrahimi, a physicist at the US Department of Energy's Princeton Plasma Physics Laboratory could enable future spacecraft to travel to distant planets like Ma… [+3252 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "9News Staff", "title": "Dinosaurs used neck frills to flirt, study suggests - 9News", "description": "<p>Many dinosaurs had distinctive bony frills around their necks - the best-known being the distinctive Triceratops.</p>", "url": "https://www.9news.com.au/world/dinosaurs-used-neck-frills-to-flirt-research-suggests/1be7808c-be67-4e4a-8fda-e6d831918f78", "urlToImage": "https://imageresizer.static9.net.au/m_URQOMAPErlZJwaSYGjbET0y1M=/27x0:1100x604/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F6d88131e-4c1c-4b04-94b6-cde699fca853", "publishedAt": "2021-02-03T01:49:00Z", "content": "Property News: Is your home affecting your mental health? - domain.com.au"}, {"source": {"id": null, "name": "9News"}, "author": "Richard Wood", "title": "Photos taken 30 years apart reveal alarming retreat of giant glacier - 9News", "description": "<p>Photographs taken by a father and son in 1989 and 2020 have revealed how one of Europe&#x27;s largest glacier has shrunk by 400sqkms due to climate change.</p>", "url": "https://www.9news.com.au/world/alarming-photos-show-iceland-glacier-shrinking-climate-change/65e00e76-9937-4c54-8e20-29f204a8e3d6", "urlToImage": "https://imageresizer.static9.net.au/ztDh7KOEjUz2G9_hGFcn_GN20Zc=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F3905d2b2-2515-4313-8e5e-f78eac2d879a", "publishedAt": "2021-02-03T01:40:00Z", "content": "Property News: How to transform your home without renovating - domain.com.au"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Warmer climate may make new mutations more harmful - Phys.org", "description": "A warmer global climate can cause mutations to have more severe consequences for the health of organisms through their detrimental effect on protein function. This may have major repercussions on organisms' ability to adapt to, and survive in, the altered hab…", "url": "https://phys.org/news/2021-02-warmer-climate-mutations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/warmerclimat.jpg", "publishedAt": "2021-02-03T01:10:01Z", "content": "A warmer global climate can cause mutations to have more severe consequences for the health of organisms through their detrimental effect on protein function. This may have major repercussions on org… [+3361 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Renata Gortan", "title": "Your microbe could be the key to unlocking anxiety - Body and Soul", "description": "Your microbe could be the key to unlocking anxiety", "url": "https://www.bodyandsoul.com.au/mind-body/the-gutbrain-axis-is-real/news-story/22edc5c9a1e1247a52cb182c4e1bdcea", "urlToImage": "https://cdn.newsapi.com.au/image/v1/82428de2da83c45b5fd4f5f5628cf20c", "publishedAt": "2021-02-03T00:13:55Z", "content": "In the last few years, the gut microbiome has become big news. We know that the trillions of bacteria that make up the body's gut microbes can affect everything from digestion to the immune system. A… [+2117 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Biofuel Rocket Launch Is a First In Aerospace - Freethink", "description": "Startup bluShift has successfully launched a biofuel rocket, proving that biofuels could be the future of more sustainable spaceflight.", "url": "https://www.freethink.com/articles/biofuel-rocket", "urlToImage": "https://www.freethink.com/media/pages/articles/biofuel-rocket/2628149311-1612301392/biofuel-rocket-opengraph-1200x630.jpg", "publishedAt": "2021-02-02T23:00:00Z", "content": "With one rocket launch, aerospace startup bluShift just achieved two firsts. \r\nNot only was its Stardust 1.0 the first rocket to lift off from the startup's home state of Maine, but it was also the f… [+5061 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Russia’s Soyuz-2.1b carrier rocket orbits military satellite — Defense ministry - TASS", "description": "The entire mission was held in normal regime, with no emergencies taking place", "url": "https://tass.com/science/1252001", "urlToImage": "https://phototass2.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20210203/1301915.jpg", "publishedAt": "2021-02-02T22:32:20Z", "content": "MOSCOW, February 3. /TASS/. Russia’s Soyuz-2.1b carrier rocket successfully delivered a Russian military satellite to the orbit on Tuesday, the Russian Defense Ministry said.\r\n\"The Soyuz-2.1B medium … [+898 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "COVID-19 lockdowns temporarily raised global temperatures, research shows: Reductions in aerosol emissions had slight warming impact, study finds - Science Daily", "description": "The lockdowns and reduced societal activity related to the COVID-19 pandemic affected emissions of pollutants in ways that slightly warmed the planet for several months last year, according to new research. The counterintuitive finding highlights the influenc…", "url": "https://www.sciencedaily.com/releases/2021/02/210202164535.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-02T22:10:59Z", "content": "The lockdowns and reduced societal activity related to the COVID-19 pandemic affected emissions of pollutants in ways that slightly warmed the planet for several months last year, according to new re… [+4126 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "China's Tianwen-1 Mars mission in photos - Space.com", "description": "", "url": "https://www.space.com/china-tianwen-1-mars-mission-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ULwxadeUXbq2qhWFniBetk-1200-80.jpg", "publishedAt": "2021-02-02T21:34:00Z", "content": "Image 6 of 30\r\n(Image credit: NASA/JPL/University of Arizona)\r\nA portion of Mars' Utopia Planitia impact basin, as photographed by the HiRISE camera aboard NASA's Mars Reconnaissance Orbiter. China's… [+3480 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michelle Klampe", "title": "Sea ice kept oxygen from reaching deep ocean during last ice age - Phys.org", "description": "Extensive sea ice covered the world's oceans during the last ice age, which prevented oxygen from penetrating into the deep ocean waters, complicating the relationship between oxygen and carbon, a new study has found.", "url": "https://phys.org/news/2021-02-sea-ice-oxygen-deep-ocean.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/seaice.jpg", "publishedAt": "2021-02-02T21:13:26Z", "content": "Extensive sea ice covered the world's oceans during the last ice age, which prevented oxygen from penetrating into the deep ocean waters, complicating the relationship between oxygen and carbon, a ne… [+3578 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Physicists Observe Backreaction in Analogue Black Hole Experiment | Astronomy, Physics - Sci-News.com", "description": "Physicists from the University of Nottingham and the University of Cambridge have for the first time demonstrated that the evolution of black holes resulting from the fields surrounding them can be simulated in a lab experiment.", "url": "http://www.sci-news.com/astronomy/backreaction-analogue-black-hole-experiment-09310.html", "urlToImage": "http://cdn.sci-news.com/images/2021/02/image_9310-Black-Hole-Backreaction.jpg", "publishedAt": "2021-02-02T20:08:05Z", "content": "Physicists from the University of Nottingham and the University of Cambridge have for the first time demonstrated that the evolution of black holes resulting from the fields surrounding them can be s… [+2760 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "NASA Ready to Start Building Its Asteroid-Bound Psyche Spacecraft - Futurism", "description": "\"This is the most intense part of everything that happens on the ground.\"", "url": "https://futurism.com/the-byte/nasa-ready-build-asteroid-bound-psyche-spacecraft", "urlToImage": "https://wp-assets.futurism.com/2021/02/psyche-768x403.jpg", "publishedAt": "2021-02-02T20:03:45Z", "content": "Psyche Out\r\nNASAs Psyche mission, an uncrewed expedition to an unusual asteroid of the same name, is entering the final stages of preparation.\r\nAfter years of testing and development for the scientif… [+1729 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Scientists Explain Why Food Still Sticks to Your Stupid Non-Stick Pan - Gizmodo Australia", "description": "An investigation into the way oils behave on hot, flat surfaces has uncovered the process responsible for foods sticking to non-stick frying pans. I love the opening line to this new paper, published today in Physics of Fluids: “Here, the phenomenon of food s…", "url": "https://www.gizmodo.com.au/2021/02/scientists-explain-why-food-still-sticks-to-your-stupid-non-stick-pan/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/03/lywjvw2thzplqnq2ec3d.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-02-02T17:40:00Z", "content": "An investigation into the way oils behave on hot, flat surfaces has uncovered the process responsible for foods sticking to non-stick frying pans.\r\nI love the opening line to this new paper, publishe… [+3214 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Immense hydrocarbon cycle discovered in world's ocean - Science Daily", "description": "Hydrocarbons and petroleum are almost synonymous in environmental science. After all, oil reserves account for nearly all the hydrocarbons we encounter. But the few hydrocarbons that trace their origin to biological sources may play a larger ecological role t…", "url": "https://www.sciencedaily.com/releases/2021/02/210202101047.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-02T17:05:10Z", "content": "Hydrocarbons and petroleum are almost synonymous in environmental science. After all, oil reserves account for nearly all the hydrocarbons we encounter. But the few hydrocarbons that trace their orig… [+8636 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Kelsie Sandoval", "title": "In the 3 months before a break-up, couples start speaking differently, researchers find - Business Insider Australia", "description": "If your partner starts to make minor changes in their word choice, a breakup might be around the corner, a new study finds.", "url": "https://www.businessinsider.com.au/signs-of-an-impending-break-up-couples-use-different-words-2021-2", "urlToImage": "https://i.insider.com/60184dd56dfbe10018e011d7", "publishedAt": "2021-02-02T16:44:39Z", "content": "<ul><li>\r\nResearchers found that if your partner starts using words like “I” or “we” more than usual, this may be a warning sign of a looming breakup.\r\n</li><li>\r\nAs people increasingly post about th… [+3588 chars]"}, {"source": {"id": null, "name": "The Takeout"}, "author": "Lillian Stone", "title": "NASA will pay $500,000 to whoever can figure out how to grow fresh food in space - The Takeout", "description": "Your idea could go where no salad has gone before.", "url": "https://thetakeout.com/nasa-deep-space-food-challenge-1846181220", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/qimrc4k65e2h3rgpcumw.jpg", "publishedAt": "2021-02-02T16:44:00Z", "content": "Being an astronaut sounds really stressful. You have to fly the spacecraft straight so you dont run into space junk, you have to make sure a hostile alien doesnt burst through your torso, and you hav… [+1483 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Climate change in South Africa could cost up to 20% of GDP - Open Access Government", "description": "Climate change in South Africa can be seen in economic productivity and labour availability - but what could it cost the population in the future?", "url": "https://www.openaccessgovernment.org/climate-change-in-south-africa/102813/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/02/dreamstime_xxl_150654155.jpg", "publishedAt": "2021-02-02T16:15:00Z", "content": "The CMCC Foundation and RFF-CMCC European Institute on Economics and the Environment (EIEE) and Athens University of Economics and Business, recently published in their investigation into how climate… [+4130 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Experts warn of brewing space mining war among US, China and Russia - MINING.COM - MINING.com", "description": "China and Russia are joining forces to keep America's increasing attempts to dominate extra-terrestrial commerce at bay.", "url": "https://www.mining.com/experts-warn-of-brewing-space-mining-war-among-us-china-and-russia/", "urlToImage": "https://www.mining.com/wp-content/uploads/2021/02/brewing-space-mining-war.jpg", "publishedAt": "2021-02-02T15:57:31Z", "content": "It also proposed global legal framework for mining on the moon, called the Artemis Accords, encouraging citizens to mine the Earths natural satellite and other celestial bodies with commercial purpos… [+7163 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "\"Genetic SD-card\": Scientists obtained new methods to improve the genome editing system - EurekAlert", "description": "Researchers  take a step in the development of genome editing technology. Currently it is possible to deliver genetic material of different sizes and structures to organs and tissues. This is the key to eliminating DNA defects and treating more patients.", "url": "https://www.eurekalert.org/pub_releases/2021-02/ptgs-ss020221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/255170_web.jpg", "publishedAt": "2021-02-02T15:26:25Z", "content": "IMAGE: Researchers take a step in the development of genome editing technology\r\n view more \r\nCredit: Peter the Great St.Petersburg Polytechnic University\r\nResearchers from Peter the Great St.Petersbu… [+2800 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "NTU Singapore team develops portable device that creates 3D images of skin in 10 minutes - EurekAlert", "description": "A team from Nanyang Technological University, Singapore (NTU Singapore) has developed a portable device that produces high-resolution 3D images of human skin within 10 minutes.", "url": "https://www.eurekalert.org/pub_releases/2021-02/ntu-nst020121.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/255156_web.jpg", "publishedAt": "2021-02-02T15:07:21Z", "content": "IMAGE: (Left to Right) Members of the NTU research team include Assistant Professor Grzegorz Lisak from NTU's School of Civil and Environmental Engineering, PhD student Yi-Heng Cheong, the study's fi… [+5679 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "The Youngest Known Magnetar Is Even Weirder That Previously Thought - IFLScience", "description": "Humanity has discovered just 31 magnetic neutron stars, or magnetars, stellar objects with incredible magnetism. New observations of one of these stars rep", "url": "https://www.iflscience.com/space/the-youngest-known-magnetar-is-even-weirder-that-previously-thought/", "urlToImage": "https://cdn.iflscience.com/images/86fb4ece-b5ad-5b24-bd76-6314c49dd3f5/default-1612269999-magnetar-j1818.jpg", "publishedAt": "2021-02-02T15:05:00Z", "content": "Humanity has discovered just 31 magnetic neutron stars, or magnetars, stellar objects with incredible magnetism. New observations of one of these stars report some bizarre never-before-seen behaviors… [+2344 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Tiny 3-D structures enhance solar cell efficiency - Phys.org", "description": "A new method for constructing special solar cells could significantly increase their efficiency. Not only are the cells made up of thin layers, they also consist of specifically arranged nanoblocks. This has been shown in a new study by an international resea…", "url": "https://phys.org/news/2021-02-tiny-d-solar-cell-efficiency.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/tiny3dstruct.jpg", "publishedAt": "2021-02-02T15:02:06Z", "content": "A new method for constructing special solar cells could significantly increase their efficiency. Not only are the cells made up of thin layers, they also consist of specifically arranged nanoblocks. … [+3299 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Engineering light availability for crop production—a solution for coming challenges? - Phys.org", "description": "What if we could increase a plant's productivity by modifying the light to which it is exposed? This could increase the yield of important food and biofuel crops and also combat climate change by sequestering atmospheric carbon.", "url": "https://phys.org/news/2021-02-availability-crop-productiona-solution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/engineeringl.jpg", "publishedAt": "2021-02-02T14:47:35Z", "content": "What if we could increase a plant's productivity by modifying the light to which it is exposed? This could increase the yield of important food and biofuel crops and also combat climate change by seq… [+4656 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Specific bacteria in the gut prompt mother mice to neglect their pups: Researchers make unexpected discoveries about how a particular microbe influences animal behavior - Science Daily", "description": "As scientists learn more about the microorganisms that colonize the body -- collectively called the microbiota -- one area of intense interest is the effect that these microbes can have on the brain. A new study has identified a strain of E. coli bacteria tha…", "url": "https://www.sciencedaily.com/releases/2021/02/210202085414.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-02T14:33:12Z", "content": "As scientists learn more about the microorganisms that colonize the body -- collectively called the microbiota -- one area of intense interest is the effect that these microbes can have on the brain.… [+3939 chars]"}, {"source": {"id": null, "name": "BroBible"}, "author": "Douglas Charles", "title": "The Biggest ‘Potentially Hazardous’ Asteroid To Pass Earth In 2021 Is Coming Our Way At 76,980 MPH - BroBible", "description": "You might want to mark your calender on March 21, 2021 because at around 11:03 a.m. ET a gigantic asteroid, 231937 (2001 FO32), is going to go skimming by Earth at a speed of about 21 miles per sec…", "url": "https://brobible.com/culture/article/potentially-hazardous-asteroid-231937-2001-fo32/", "urlToImage": "https://brobible.com/wp-content/uploads/2021/02/Biggest-Potentially-Hazardous-Asteroid-To-Pass-Earth-2021-231937-2001-FO32.jpg", "publishedAt": "2021-02-02T14:18:00Z", "content": "pixabay\r\nYou might want to mark your calender on March 21, 2021 because at around 11:03 a.m. ET a gigantic asteroid, 231937 (2001 FO32), is going to go skimming by Earth at a speed of about 21 miles … [+3292 chars]"}, {"source": {"id": null, "name": "Technocodex.com"}, "author": "Mohammed Mujtaba khan", "title": "An Evolutionary Timeline of Homo Sapiens | Science - TechnoCodex", "description": "SMITHSONIANMAG.COM |        Feb. 2, 2021, 8 a.m.                          The lengthy evolutionary journey that created fashionable people started with a single step—or extra precisely—with the flexibility to stroll on two legs. One of", "url": "https://technocodex.com/an-evolutionary-timeline-of-homo-sapiens-science/", "urlToImage": "https://thumbs-prod.si-cdn.com/bt6HAVvMAZP9o0y4sHyBrkh1t9Y=/fit-in/1600x0/https://public-media.si-cdn.com/filer/fd/49/fd49352d-e06d-4214-9065-4a9299d47747/skull-arc-frontal_web_social.jpg", "publishedAt": "2021-02-02T13:29:00Z", "content": "SMITHSONIANMAG.COM |Feb. 2, 2021, 8 a.m.The lengthy evolutionary journey that created fashionable people started with a single stepor extra preciselywith the flexibility to stroll on two legs. One of… [+18720 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tim Doherty", "title": "Humans force wild animals into tight spots, or send them far from home. We calculated just how big the impact is - Phys.org", "description": "The COVID pandemic has shown us that disruptions to the way we move around, complete daily activities and interact with each other can shatter our wellbeing.", "url": "https://phys.org/news/2021-02-humans-wild-animals-tight-home.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/humansforcew.jpg", "publishedAt": "2021-02-02T13:10:05Z", "content": "The COVID pandemic has shown us that disruptions to the way we move around, complete daily activities and interact with each other can shatter our wellbeing.\r\nThis doesn't apply only to humans. Wildl… [+6874 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The secrets of 3000 galaxies laid bare - EurekAlert", "description": "The complex mechanics determining how galaxies spin, grow, cluster and die have been revealed following the release of all the data gathered during a massive seven-year Australian-led astronomy research project.", "url": "https://www.eurekalert.org/pub_releases/2021-02/acoe-tso020121.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/255035_web.jpg", "publishedAt": "2021-02-02T13:03:55Z", "content": "The complex mechanics determining how galaxies spin, grow, cluster and die have been revealed following the release of all the data gathered during a massive seven-year Australian-led astronomy resea… [+4366 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Mariella Moon", "title": "NASA astronauts complete multi-year project to upgrade batteries on the ISS - Yahoo News Australia", "description": "The International Space Station Program approved the development of lithium-ion batteries to replace the station’s aging power storage system back in 2011...", "url": "https://au.news.yahoo.com/nasa-complete-upgrade-batteries-iss-125015025.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/d55c2330-654b-11eb-b7ff-db202ac4337a", "publishedAt": "2021-02-02T12:50:00Z", "content": "When NASA astronauts Mike Hopkins and Victor Glover went on a spacewalk on February 1st, they wrapped up a multi-year effort to replace the aging nickel hydrogen batteries on the ISS with new lithium… [+1884 chars]"}, {"source": {"id": null, "name": "InsideHook"}, "author": "Tobias Carroll", "title": "A Pair of High Schoolers Just Discovered Four Exoplanets - InsideHook", "description": "Two high school students, working as part of a mentorship program, discovered four exoplanets in a distant solar system.", "url": "https://www.insidehook.com/daily_brief/science/pair-high-schoolers-just-discovered-four-exoplanets", "urlToImage": "https://www.insidehook.com/wp-content/uploads/2021/02/exoplanets.jpg?resize=1200,800", "publishedAt": "2021-02-02T12:33:22Z", "content": "What was your time in high school like? Did you, for instance, discover any stars or planets? If you answered in the negative, then Jasmine Wright and Kartik Pinglé 18 and 16, respectively might have… [+1484 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "International Space Station sheds light on blue jets from thunderstorms – Physics World - physicsworld.com", "description": "Phenomenon unleashes waves of ionization in the upper atmosphere", "url": "https://physicsworld.com/international-space-station-sheds-light-on-blue-jets-from-thunderstorms/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2021/02/Thunderstorm_seen_from_Space_Station.jpg", "publishedAt": "2021-02-02T10:57:08Z", "content": "View from above: photograph of blue jets taken by ESA astronaut Andreas Mogensen on board the International Space Station in 2015. (Courtesy: ESA/NASA)\r\nIntense blue jets that form during thunderstor… [+2981 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "\"Quantum Brain\" Brings New Era of Computing Closer - Technology Networks", "description": "An intelligent material that learns by physically changing itself, similar to how the human brain works, could be the foundation of a completely new generation of computers.", "url": "https://www.technologynetworks.com/informatics/news/quantum-brain-brings-new-era-of-computing-closer-345129", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/quantum-brain-brings-new-era-of-computing-closer-345129.jpg?cb=20210202", "publishedAt": "2021-02-02T09:20:14Z", "content": "An intelligent material that learns by physically changing itself, similar to how the human brain works, could be the foundation of a completely new generation of computers. Radboud physicists workin… [+4079 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Synthetic biology can help create complex embryo - News-Medical.Net", "description": "Richard Feynman, one of the most respected physicists of the twentieth century, said \"What I cannot create, I do not understand\". Not surprisingly, many physicists and mathematicians have observed fundamental biological processes with the aim of precisely ide…", "url": "https://www.news-medical.net/news/20210202/Synthetic-biology-can-help-create-complex-embryo.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/6/Chem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2021-02-02T05:25:00Z", "content": "Richard Feynman, one of the most respected physicists of the twentieth century, said \"What I cannot create, I do not understand\". Not surprisingly, many physicists and mathematicians have observed fu… [+3717 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Andrew Prentice", "title": "NASA probes a Queensland primary school after a 'meteorite' crashes into the playground - Daily Mail", "description": "A fallen 'meteorite' in Far North Queensland attracted plenty of attention on Monday - including representatives from the NASA head office in America.", "url": "https://www.dailymail.co.uk/news/article-9212777/NASA-probes-Queensland-primary-school-meteorite-crashes-playground.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/02/04/38766932-0-image-a-31_1612238747020.jpg", "publishedAt": "2021-02-02T04:42:00Z", "content": "Representatives from NASA recently had their eye on a remote school in Far North Queensland amid claims of a fallen meteorite on Monday.\r\nHowever, the astronomy experts were left red-faced after the … [+1622 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "NASA wants to search a Mars moon for signs of the planet’s atmosphere - BGR", "description": "Mars used to have a thick, robust atmosphere, or at least that’s what scientists think they know about the history of the Red Planet. Solar wind — the outflow of particles from the Sun — is thought to have stripped away the planet’s atmosphere over the course…", "url": "https://bgr.com/2021/02/01/mars-atmosphere-nature-phobos-moon/", "urlToImage": "https://bgr.com/wp-content/uploads/2018/11/boringmars.png", "publishedAt": "2021-02-02T04:20:00Z", "content": "<ul><li>Mars used to have a thick, robust atmosphere, or at least that’s what scientists think they know about the history of the Red Planet. </li><li>Solar wind — the outflow of particles from the S… [+3148 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Are There ‘Eyeless Creatures’ On Enceladus? Why We Need To Probe The Dark Ocean Of Saturn’s ‘Snowball’ Moon - Forbes", "description": "The water-rich cold moon that’s a hot target in the search for life in the Solar System.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/02/01/is-there-life-on-saturns-snowball-moon-why-tiny-enceladus-should-be-a-top-target-for-nasa/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6012a27a1bca403da12c3580%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D4421%26cropY1%3D892%26cropY2%3D3840", "publishedAt": "2021-02-02T03:00:00Z", "content": "Photograph of Enceladus, the sixth-largest moon of Saturn. Dated 2015. (Photo by: Universal History ... [+] Archive/Universal Images Group via Getty Images)\r\nUniversal Images Group via Getty Images\r\n… [+7210 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Marcia Dunn", "title": "Inspiration4: billionaire funds SpaceX flight for himself, three ‘everyday’ people - Brisbane Times", "description": "Jared Isaacman also announced that he aims to use the private trip to raise $US200 million ($265 million) for St Jude Children’s Research Hospital, with half coming from his own pocket.", "url": "https://www.smh.com.au/world/north-america/inspiration4-billionaire-funds-spacex-flight-for-himself-three-everyday-people-20210202-p56yq2.html", "urlToImage": "https://static.ffx.io/images/$zoom_1.103125%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_34/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/43c9cd90dff946524cd31319a2aafc0a84ab4c11", "publishedAt": "2021-02-02T01:00:00Z", "content": "I truly want us to live in a world 50 or 100 years from now where people are jumping in their rockets like the Jetsons and there are families bouncing around on the moon with their kid in a spacesuit… [+4120 chars]"}, {"source": {"id": null, "name": "Australian Mining"}, "author": "Nickolas Zakharia", "title": "Mineral from Mars found in Antarctic ice - Australian Mining", "description": "Researchers in Antarctica have stumbled upon traces of jarosite, a mineral commonly found on Mars, which might confirm theories suggesting there is water on the red planet.", "url": "https://www.australianmining.com.au/news/mineral-from-mars-found-in-antarctic-ice/", "urlToImage": "https://www.australianmining.com.au/wp-content/uploads/2021/02/Antarctic-ice-shows-traces-of-Martian-mineral.jpg", "publishedAt": "2021-02-01T23:45:00Z", "content": "Jarosite. Image: Rob Lavinsky, Wikimedia Commons.\r\nResearchers in Antarctica have stumbled upon traces of jarosite, a mineral commonly found on Mars, which might confirm theories suggesting there is … [+2231 chars]"}, {"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "SpaceX announces first-ever all-civilian space flight crew - CNN Philippines", "description": "Jared Isaacman, an entrepreneur behind a payment processing startup, is funding a multimillion trip to space aboard a SpaceX Crew Dragon capsule, which could be the first-ever orbital flight crewed entirely by non-astronauts.", "url": "http://www.cnnphilippines.com/world/2021/2/2/SpaceX-first-ever-all-civilian-space-flight-crew.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/2/2/SpaceX_CNNPH.jpg/jcr:content/SpaceX_CNNPH.jpg", "publishedAt": "2021-02-01T23:26:45Z", "content": "(CNN)  Jared Isaacman, an entrepreneur behind a payment processing startup, is funding a multimillion trip to space aboard a SpaceX Crew Dragon capsule, which could be the first-ever orbital flight c… [+3268 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Astronomers Found an Ancient Galaxy with a Halo of Dark Matter - Gizmodo Australia", "description": "Some 163,000 light-years from the Milky Way is a much smaller, much more ancient galaxy: Tucana II, so named for the tropical bird-resembling constellation in which it sits. Sitting at the periphery of our galaxy’s gravitational pull, Tucana II provides resea…", "url": "https://www.gizmodo.com.au/2021/02/astronomers-found-an-ancient-galaxy-with-a-halo-of-dark-matter/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/02/jcpnl50oyqlgwf5eyz8h.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nr=20", "publishedAt": "2021-02-01T22:30:00Z", "content": "Some 163,000 light-years from the Milky Way is a much smaller, much more ancient galaxy: Tucana II, so named for the tropical bird-resembling constellation in which it sits. Sitting at the periphery … [+2922 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Jeff Spry", "title": "Drink up! How new research finds Moon's water replenished by Earth's magnetic field - SYFY WIRE", "description": "Even though Apollo astronaut Buzz Aldrin described the dry, barren regolith of the Moon as \"magnificent desolation,\" it turns out that our lone satellite actually has an abundance of lunar water locked away in its soils and rocks, especially at its lightless …", "url": "https://www.syfy.com/syfywire/moons-water-replenished-by-earths-magnetic-field", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/2021/02/moon-water.jpg?offset-x=0", "publishedAt": "2021-02-01T21:12:07Z", "content": "Even though Apollo astronaut Buzz Aldrin described the dry, barren regolith of the Moon as \"magnificent desolation,\" it turns out that our lone satellite actually has an abundance of lunar water lock… [+3068 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Geologists produce new timeline of Earth's Paleozoic climate changes - Phys.org", "description": "The temperature of a planet is linked with the diversity of life that it can support. MIT geologists have now reconstructed a timeline of the Earth's temperature during the early Paleozoic era, between 510 and 440 million years ago—a pivotal period when anima…", "url": "https://phys.org/news/2021-02-geologists-timeline-earth-paleozoic-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/geologistspr.jpg", "publishedAt": "2021-02-01T20:00:02Z", "content": "The temperature of a planet is linked with the diversity of life that it can support. MIT geologists have now reconstructed a timeline of the Earth's temperature during the early Paleozoic era, betwe… [+6704 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Solving complex physics problems at lightning speed - Newswise", "description": "A calculation so complex that it takes twenty years to complete on a powerful desktop computer can now be done in one hour on a regular laptop.", "url": "https://www.newswise.com/articles/solving-complex-physics-problems-at-lightning-speed", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2021-02-01T19:20:00Z", "content": "Newswise — A calculation so complex that it takes twenty years to complete on a powerful desktop computer can now be done in one hour on a regular laptop. Physicist Andreas Ekström at Chalmers Univer… [+4338 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Incredible radar image of the moon was actually taken from Earth - Yahoo News Australia", "description": "A new transmitter fitted to the world’s largest steerable radio telescope captured an image of the Apollo 15 landing site by bouncing radio waves off the...", "url": "https://au.news.yahoo.com/radar-image-moon-earth-183959183.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hyOdulHXGZztNsvHmwSE_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0yMDAw/https://s.yimg.com/os/creatr-uploaded-images/2021-02/84f8f6f0-64bc-11eb-8baf-1e5847a060e6", "publishedAt": "2021-02-01T18:39:00Z", "content": "The radar image of where Apollo 15 landed in 1971. The snake-like feature is Hadley Rille, a remnant of ancient volcanic activity, probably a collapsed lava tube. (NRAO/GBO/Raytheon/NSF/AUI)\r\nA new t… [+2564 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Discovery could lead to self-propelled robots - Phys.org", "description": "Army-funded researchers discovered how to make materials capable of self-propulsion, allowing materials to move without motors or hands.", "url": "https://phys.org/news/2021-02-discovery-self-propelled-robots.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/discoverycou.jpg", "publishedAt": "2021-02-01T17:53:16Z", "content": "Army-funded researchers discovered how to make materials capable of self-propulsion, allowing materials to move without motors or hands.\r\nResearchers at the University of Massachusetts Amherst discov… [+3736 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Avery", "title": "Discarded 1966 rocket booster stuck in Earth's orbit is set to break free this week - Daily Mail", "description": "The discarded Centaur rocket booster from the 1966 Surveyor 2 has been trapped in Earth's orbit since last year, but is now set to break free after Feb.2 and continue traveling around the sun.", "url": "https://www.dailymail.co.uk/sciencetech/article-9210705/Discarded-1966-rocket-booster-stuck-Earths-orbit-set-break-free-week.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/01/18/38746992-0-image-a-2_1612203913249.jpg", "publishedAt": "2021-02-01T17:42:00Z", "content": "Earths 'second moon' will make one final pass this week before floating out into space forever.\r\nAstronomers first spotted an unknown object with an incoming trajectory in September 2020 and initiall… [+5812 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "More Evidence That Neanderthals Were ‘Absorbed’ by Humans, Not Wiped Out - Gizmodo Australia", "description": "Prehistoric teeth found over 100 years ago are some of the best evidence yet for hybridised communities of Neanderthals and modern humans. We know that Neanderthals and early modern humans interbred — our DNA tells us so — but fossil evidence in this regard i…", "url": "https://www.gizmodo.com.au/2021/02/more-evidence-that-neanderthals-were-absorbed-by-humans-not-wiped-out/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/02/02/q1yzb1hg0oexvzlo7uq1.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nr=20", "publishedAt": "2021-02-01T17:10:00Z", "content": "Prehistoric teeth found over 100 years ago are some of the best evidence yet for hybridised communities of Neanderthals and modern humans.\r\nWe know that Neanderthals and early modern humans interbred… [+5122 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Chu | MIT News Office", "title": "Physicists create tunable superconductivity in twisted graphene “nanosandwich” - MIT News", "description": "MIT physicists have created tunable superconductivity in “magic-angle” trilayer graphene. The structure may reveal conditions necessary for high-temperature superconductivity. The work was led by researchers in the Jarillo-Herrero research group.", "url": "https://news.mit.edu/2021/physicists-create-tunable-superconductivity-twisted-graphene-nanosandwich-0201", "urlToImage": "https://news.mit.edu/sites/default/files/images/202102/MIT-Trilayer-Twist-01-press.jpg", "publishedAt": "2021-02-01T17:00:00Z", "content": "When two sheets of graphene are stacked atop each other at just the right angle, the layered structure morphs into an unconventional superconductor, allowing electric currents to pass through without… [+6907 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "High school students deemed 'youngest astronomers ever' find four exoplanets 200-light-years away - Daily Mail", "description": "Kartik Pinglé, 16, and Jasmine Wright, 18, have discovered four new exoplanets some 200-light-years away. Three are 'sub-Neptunes' and the fourth is a 'super-Earth' in the habitable zone.", "url": "https://www.dailymail.co.uk/sciencetech/article-9210715/High-school-students-deemed-youngest-astronomers-four-exoplanets-200-light-years-away.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/01/16/38744066-0-image-a-16_1612197698002.jpg", "publishedAt": "2021-02-01T16:26:00Z", "content": "Two high school students have identified four new exoplanets about 200-light-years from Earth, deeming them 'the youngest astronomers' to make such a discovery.\r\nKartik Pinglé, 16, and Jasmine Wright… [+3014 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Water disinfection with ozone - Phys.org", "description": "While chlorine and ultraviolet light are the standard means of disinfecting water, ozone is equally effective in killing germs. To date, ozone has only been used as an oxidation agent for treating water in large plants. Now, however, a project consortium from…", "url": "https://phys.org/news/2021-02-disinfection-ozone.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/waterdisinfe.jpg", "publishedAt": "2021-02-01T16:00:03Z", "content": "While chlorine and ultraviolet light are the standard means of disinfecting water, ozone is equally effective in killing germs. To date, ozone has only been used as an oxidation agent for treating wa… [+5423 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Sea Shepherd Launches New Campaign: Operation Driftnet - The Maritime Executive", "description": "Sea Shepherd?s Flagship, the Steve Irwin, is en route to the Indian Ocean to confront a fleet of fishing vessels that is using driftnets; a form of", "url": "https://www.maritime-executive.com/article/sea-shepherd-launches-new-campaign-operation-driftnet", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Animals/Cropped/sea%20shepherd%20driftnet%2016x9.jpg", "publishedAt": "2021-02-01T15:09:00Z", "content": "By\r\nThe Maritime Executive \r\n03-15-2016 11:56:09 \r\nSea Shepherd’s Flagship, the Steve Irwin, is en route to the Indian Ocean to confront a fleet of fishing vessels that is using driftnets; a form of … [+1376 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Emma Hart", "title": "We’re teaching robots to evolve autonomously – so they can adapt to life alone on distant planets - The Conversation US", "description": "The robots are 'born' via 3D printer, and recycle themselves upon their 'death'.", "url": "https://theconversation.com/were-teaching-robots-to-evolve-autonomously-so-they-can-adapt-to-life-alone-on-distant-planets-153159", "urlToImage": "https://images.theconversation.com/files/381713/original/file-20210201-21-1u1chcy.jpg?ixlib=rb-1.1.0&rect=0%2C194%2C2942%2C1469&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-01T15:05:00Z", "content": "Its been suggested that an advance party of robots will be needed if humans are ever to settle on other planets. Sent ahead to create conditions favourable for humankind, these robots will need to be… [+6125 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Technology Could Dramatically Lower Cost of Electron Sources – For Night Vision, Particle Accelerators and More - SciTechDaily", "description": "Rice University and Los Alamos National Laboratory make low-cost, scalable photocathodes from halide perovskites. Rice University engineers have discovered technology that could slash the cost of semiconductor electron sources, key components in devices rangi…", "url": "https://scitechdaily.com/new-technology-could-dramatically-lower-cost-of-electron-sources-for-night-vision-particle-accelerators-and-more/", "urlToImage": "https://scitechdaily.com/images/Perovskite-Photocathode.jpg", "publishedAt": "2021-02-01T15:04:23Z", "content": "Artist’s representation of a halide perovskite photocathode. Researchers at Rice University and Los Alamos National Laboratory found halide perovskite semiconductors (silver) treated with a thin laye… [+7341 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "A new plasma thruster could speed space travel - SlashGear", "description": "A researcher from the US Department of Energy’s Princeton Plasma Physics Laboratory named Fatima Ebrahimi has developed a new type of thruster that could help humans explore space in the futu…", "url": "https://www.slashgear.com/a-new-plasma-thruster-could-speed-space-travel-01657539/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/02/solar-thruster.jpg", "publishedAt": "2021-02-01T14:06:39Z", "content": "A researcher from the US Department of Energy’s Princeton Plasma Physics Laboratory named Fatima Ebrahimi has developed a new type of thruster that could help humans explore space in the future. The … [+1877 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Leo Rodriguez, Shanshan Rodriguez", "title": "Could a human enter a black hole to study it? - The Conversation US", "description": "If you are a sci-fi junkie you've probably wondered what would happen if you were unlucky enough to fall into a black hole.  How well you'd fare all depends on the type of black hole.", "url": "https://theconversation.com/could-a-human-enter-a-black-hole-to-study-it-153364", "urlToImage": "https://images.theconversation.com/files/381286/original/file-20210129-19-1ly38eg.png?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-01T13:09:00Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to CuriousKidsUS@theconversation.com.\r\nCould a human enter a black hole to study it? P… [+5617 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "NASA delays award of moon lander contracts - MENAFN.COM", "description": "p>Washington, Feb 1 (IANS) NASA has quietly delayed its plan to award two high-profile crewed lunar lander contracts from late February to April 30.</p><p>According to the space agency, the delay is designed to give it more time to evaluate the bidders' propo…", "url": "https://menafn.com/1101527141/NASA-delays-award-of-moon-lander-contracts", "urlToImage": "https://menafn.com/updates/pr/2021-02/01/I_6ee818ee-dimage_story.jpg", "publishedAt": "2021-02-01T12:05:47Z", "content": "(MENAFN - IANS) p&gt;Washington, Feb 1 (IANS) NASA has quietly delayed its plan to award two high-profile crewed lunar lander contracts from late February to April 30.\r\nAccording to the space agency,… [+2492 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Why do wombats have cube-shaped poop? - Livescience.com", "description": "It's not due to the shape of their \"backdoor.\"", "url": "https://www.livescience.com/why-wombats-have-cubed-poop.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cqPmoLVfWvky4RWtXCLX4L-1200-80.jpg", "publishedAt": "2021-02-01T12:00:00Z", "content": "When nature calls, wombats\r\n poop out a masterpiece a pile of cubed-shaped BMs, the only animal known to do so. And now, scientists may finally know how wombats pull off this feat, according to a new… [+3884 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Hubble Snaps Beautiful Image of UGC 3885 | Astronomy - Sci-News.com", "description": "Astronomers using the NASA/ESA Hubble Space Telescope have captured a striking new photo of the spiral galaxy UGC 3885.", "url": "http://www.sci-news.com/astronomy/hubble-image-ugc-3885-09304.html", "urlToImage": "http://cdn.sci-news.com/images/2021/02/image_9304-UGC-3885.jpg", "publishedAt": "2021-02-01T10:22:59Z", "content": "Astronomers using the NASA/ESA Hubble Space Telescope have captured a striking new photo of the spiral galaxy UGC 3885.\r\nThis Hubble image shows UGC 3885, a spiral galaxy some 180 million light-years… [+1220 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Seth Grace", "title": "'Blue light' on the Pacific island of Nauru seen from the space station. Space | Technology | International Space Station -ISS | Science | Science news | Malayalam technology news - Sprout Wired", "description": "Blue light was found to flow above the clouds capable of affecting the Earth's greenhouse gases. This important discovery was made using ASIM established", "url": "https://www.sproutwired.com/blue-light-on-the-pacific-island-of-nauru-seen-from-the-space-station-space-technology-international-space-station-iss-science-science-news-malayalam-technology-news/", "urlToImage": null, "publishedAt": "2021-02-01T05:47:50Z", "content": "Blue light was found to flow above the clouds capable of affecting the Earth’s greenhouse gases. This important discovery was made using ASIM established by the European Space Agency. Blue lightning … [+3023 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "NASA plans second SLS Green Run test - SatelliteProME.com", "description": "A second Hot-Fire test gives the agency a chance to conduct three special gimbaling experiments that weren’t completed in the first attempt.", "url": "https://satelliteprome.com/news/nasa-plans-second-sls-green-run-test/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2021/01/NASA.jpg", "publishedAt": "2021-01-31T09:42:07Z", "content": "A second Hot-Fire test gives the agency a chance to conduct three special gimbaling experiments that werent completed in the first attempt.\r\nNASA has announced the decision to redo the Green Run Hot-… [+1384 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Supermoons, Pink moon, and next full moon for 2021 - 7NEWS.com.au", "description": "Full moons always make for dramatic skywatching, but so-called “supermoons” are even more special because they appear a bit bigger and brighter than a typical full moon.", "url": "https://7news.com.au/technology/space/supermoon-and-full-moon-for-2021-c-1778764", "urlToImage": "https://images.7news.com.au/publication/C-1778764/33f8239d89e837019d80594d739b0a2b512ea7fa-16x9-x0y99w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T23:21:50Z", "content": "Full moons always make for dramatic skywatching, but so-called supermoons are even more special because they appear a bit bigger and brighter than a typical full moon.\r\nIts a full moon that coincides… [+2827 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Space news: Asteroid 501647 (2014 SD224) to pass Earth - 7NEWS.com.au", "description": "The space rock is travelling about 10 kilometres per second.", "url": "https://7news.com.au/technology/space/giant-asteroid-to-pass-earth-on-christmas-day-c-1747386", "urlToImage": "https://images.7news.com.au/publication/C-1747386/e12709dd4f23f99b89c25d8fa4a62fe770574398-16x9-x0y188w2000h1125.jpg?imwidth=1024", "publishedAt": "2020-12-10T21:21:42Z", "content": "Santa Claus wont be the only one flying above Earth on Christmas Day.\r\nAn asteroid measuring about 123 metres in size will whiz past our planet according to NASA.\r\nThe huge space rock is officially k… [+922 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "mars 4k images show surface of the red planet in space as you've never seen it before - 7NEWS.com.au", "description": "A quick glimpse and you think you're seeing pictures of the American desert, or somewhere outback. But you are way off.", "url": "https://7news.com.au/technology/space/mars-as-youve-never-seen-it-before-c-1189849", "urlToImage": "https://images.7news.com.au/publication/C-1189849/b13f02d17e75f3466944cdf07e897d847894f7fe-16x9-x39y0w1772h997.jpg?imwidth=1024", "publishedAt": "2020-07-24T21:06:44Z", "content": "For the first time, the landscape of Mars has been captured in stunning 4K resolution.\r\nThat is the highest quality that has ever been recorded. And the results are simply breathtaking.\r\nWatch the in… [+1280 chars]"}, {"source": {"id": null, "name": "Triple M"}, "author": "The Triple M Team", "title": "WA Whale Shark Study A World-First - Triple M", "description": "Happy #WorldOceansDay", "url": "https://www.triplem.com.au/story/wa-whale-shark-study-a-world-first-96813", "urlToImage": "https://cdn-img.scalabs.com.au/ieYpga76NqmvtWWLDqxhCw8rtACEq5ZF6q_vFugVoBc/aHR0cHM6Ly9zdy10/cmlwbGVtLXByZC5z/Y2FkaWdpdGFsLmlv/L21lZGlhLzQ5ODc2/L3dlYnBuZXQtcmVz/aXplaW1hZ2UtMjQu/anBnP3ByZXNldD1t/cnByZXZhcnRpY2xl", "publishedAt": "2018-12-18T12:44:44Z", "content": "Scientists up at Ningaloo Reef are conducting a groundbreaking new study to learn more about whale sharks.\r\nThe whale sharks migration through the coral coast draws thousands of visitors every year, … [+979 chars]"}]}