{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New personalized test to detect leukemia relapse sooner and avoid false negative results - News-Medical.Net", "description": "Researchers have developed a new protocol for monitoring acute lymphoblastic leukemia (ALL), the most common cancer in children, to inform more effective treatment strategies and detect disease recurrence.", "url": "https://www.news-medical.net/news/20220207/New-personalized-test-to-detect-leukemia-relapse-sooner-and-avoid-false-negative-results.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-02-07T23:37:00Z", "content": "Researchers have developed a new protocol for monitoring acute lymphoblastic leukemia (ALL), the most common cancer in children, to inform more effective treatment strategies and detect disease recur… [+4188 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "NASA Selects Developer for Rocket to Retrieve First Samples From Mars - NASA Jet Propulsion Laboratory", "description": "The award brings NASA a step closer to the first robotic round trip to bring samples safely to Earth through the Mars Sample Return Program.", "url": "https://www.jpl.nasa.gov/news/nasa-selects-developer-for-rocket-to-retrieve-first-samples-from-mars", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/jpegPIA24870.jpg", "publishedAt": "2022-02-07T22:33:43Z", "content": "Once it reaches Mars orbit, the container would be captured by an ESA (European Space Agency) Earth Return Orbiter spacecraft outfitted with NASAs Capture, Containment, and Return System payload. The… [+2305 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The frogs of Baja California: Scientists assess amphibian disease - Science Daily", "description": "Biologists from Southern and Baja California have published the first major account of the amphibian disease chytridiomycosis in the Mediterranean region of Baja California. Their results indicate that the disease is more prevalent on the peninsula than in si…", "url": "https://www.sciencedaily.com/releases/2022/02/220207124842.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T22:05:16Z", "content": "There's a pandemic sweeping across the globe. No, not COVID, a different one. For decades, a brutal fungal infection has been decimating amphibians worldwide.\"We call it a panzootic,\" said Andrea Ada… [+6916 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How do pathogens learn to be pathogens? Partnerships between microbes leading to human disease - Science Daily", "description": "New research discovered that the fungus Rhizopus fights back against soil predators and human immune cells by partnering with a bacteria called Ralstonia in a two-way partnership.", "url": "https://www.sciencedaily.com/releases/2022/02/220207135837.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T22:05:15Z", "content": "New research discovered that the fungus Rhizopus fights back against soil predators and human immune cells by partnering with a bacteria called Ralstonia in a two way partnership.The microscopic worl… [+2627 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Chimps Might Use Insects as First Aid, Scientists Find - Gizmodo Australia", "description": "Researchers have documented a remarkable behaviour among wild chimpanzees: chimps applying insects to wounds on themselves or others, perhaps as...", "url": "https://www.gizmodo.com.au/2022/02/chimps-might-use-insects-as-first-aid-scientists-find/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/08/b3185785975b3c193bd61393e135f4cf.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-07T22:05:00Z", "content": "Researchers have documented a remarkable behaviour among wild chimpanzees: chimps applying insects to wounds on themselves or others, perhaps as a sort of first aid. Little is still known about the p… [+2722 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Mars Could Have Been wet for Much Longer Than Previously Believed - Universe Today", "description": "According to new NASA-sponsored research, Mars may have had an ocean as recent as 3 billion years ago (500 million years longer than expected).", "url": "https://www.universetoday.com/154383/mars-could-have-been-wet-for-much-longer-than-previously-believed/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/04/AncientMars.jpg", "publishedAt": "2022-02-07T21:44:06Z", "content": "Billions of years ago, Mars was a much different place than it is today. During the same period when life was first emerging on Earth, Mars had a thicker atmosphere, warmer surface temperatures, and … [+6601 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sandi Miller", "title": "Scientists discover a mysterious transition in an electronic crystal - Phys.org", "description": "When temperature changes, many materials undergo a phase transition, such as liquid water to ice, or a metal to a superconductor. Sometimes, a so-called hysteresis loop accompanies such a phase change, so that the transition temperatures are different dependi…", "url": "https://phys.org/news/2022-02-scientists-mysterious-transition-electronic-crystal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/scientists-discover-a-2.jpg", "publishedAt": "2022-02-07T21:37:22Z", "content": "When temperature changes, many materials undergo a phase transition, such as liquid water to ice, or a metal to a superconductor. Sometimes, a so-called hysteresis loop accompanies such a phase chang… [+6110 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Charlotte Hsu", "title": "As tectonic plates pull apart, what drives the formation of rifts? - Phys.org", "description": "At the boundaries between tectonic plates, narrow rifts can form as Earth's crust slowly pulls apart.", "url": "https://phys.org/news/2022-02-tectonic-plates-formation-rifts.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-as-tectonic-plat.jpg", "publishedAt": "2022-02-07T21:34:56Z", "content": "At the boundaries between tectonic plates, narrow rifts can form as Earth's crust slowly pulls apart.\r\nBut how, exactly, does this rifting happen?\r\nDoes pressure from magma rising from below ground f… [+3708 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Astronomer Captures Image of SpaceX Booster That's on Track to Hit the Moon - Gizmodo Australia", "description": "Well here’s something you don’t see everyday: A discarded Falcon 9 second stage booster that’s going to slam into the...", "url": "https://www.gizmodo.com.au/2022/02/astronomer-captures-image-of-spacex-booster-thats-on-track-to-hit-the-moon/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/08/d200fc80ec6f7bea695eb6def85e9e6f.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nrs=30", "publishedAt": "2022-02-07T21:15:00Z", "content": "Well heres something you dont see everyday: A discarded Falcon 9 second stage booster thats going to slam into the Moon. This inevitable impact, predicted for March 4, wont be visible from Earth, but… [+1979 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "NASA's Mars Lander Believed to Be Dying After Furious Dust Storm - Futurism", "description": "After accruing even more dust during a recent storm, NASA scientists believe that the InSight Mars lander may finally be on its last legs.", "url": "https://futurism.com/the-byte/nasa-mars-lander-dying", "urlToImage": "https://wp-assets.futurism.com/2022/02/nasa-mars-lander-dying.jpg", "publishedAt": "2022-02-07T21:12:44Z", "content": "Oh no!\r\nGrim Reaper\r\nAfter accruing even more dust during a recent storm, NASA scientists believe that the InSight Mars lander may finally be on its last legs.\r\nSpaceNewsreports that although the InS… [+2992 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Anna Varela - Georgia State", "title": "Theory may solve mystery of how huge stars got so far from home - Futurity: Research News", "description": "Researchers may have cracked the case of massive stars that are further from their birthplaces than should be possible based on their life spans.", "url": "https://www.futurity.org/massive-stars-milky-way-disk-2692892/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/02/stars-1600.jpg", "publishedAt": "2022-02-07T20:58:13Z", "content": "Astronomers have found an explanation for the strange occurrence of massive stars located far from their birthplace in the disk of our Milky Way galaxy.\r\nStars more massive than the sun have very hot… [+3749 chars]"}, {"source": {"id": null, "name": "The Irish News"}, "author": "", "title": "Bronze Age immigration to Orkney 'mostly women', scientists discover - The Irish News", "description": "A DNA study of ancient remains on Orkney revealed that most Bronze Age immigrants were women, leaving the islands with a unique male genetic line.", "url": "https://www.irishnews.com/magazine/science/2022/02/07/news/bronze-age-immigration-to-orkney-mostly-women-scientists-discover-2582680/", "urlToImage": "http://www.irishnews.com/picturesarchive/irishnews/irishnews/2022/02/07/211051833-542ede45-73c5-4ca8-8c2a-68a1cf1f7fc9.jpg", "publishedAt": "2022-02-07T20:34:44Z", "content": "Orkney experienced mass immigration during the dawn of the Bronze Age that was led mostly by women, new scientific research suggests.\r\nGenetic studies of ancient DNA from human remains found on the i… [+2661 chars]"}, {"source": {"id": null, "name": "CBS 4 Indianapolis"}, "author": "Jacob Burbrink - Digital Investigative Reporter and Producer", "title": "Greensburg students get answers from ISS astronaut - WTTV CBS4Indy", "description": "GREENSBURG, Ind. — Some elementary students here in Indiana got the chance of a lifetime Monday. They got to ask questions to astronauts. North Decatur Elementary School in Greensburg is one of just a few schools nationwide getting the chance to talk to astro…", "url": "https://cbs4indy.com/news/greensburg-students-get-answers-from-iss-astronaut/", "urlToImage": "https://cbs4indy.com/wp-content/uploads/sites/22/2022/02/NASA-North-Decatur-ININDOF1ENC002_mxf_00.25.27.18.jpg?w=1280", "publishedAt": "2022-02-07T20:16:38Z", "content": "GREENSBURG, Ind. — Some elementary students here in Indiana got the chance of a lifetime Monday. They got to ask questions to astronauts.\r\nNorth Decatur Elementary School in Greensburg is one of just… [+2520 chars]"}, {"source": {"id": null, "name": "The Naked Scientists"}, "author": "https://en-gb.facebook.com/thenakedscientists/", "title": "Dark side of the moon for the James Webb? - The Naked Scientists", "description": "Would the lunar surface make a good observatory? And how do tides work?", "url": "https://www.thenakedscientists.com/podcasts/ask-naked-scientists/dark-side-moon-james-webb", "urlToImage": "https://www.thenakedscientists.com/sites/default/files/styles/social-media-large/public/media/media/images/JW.jpg?itok=0104gsog", "publishedAt": "2022-02-07T19:32:18Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Chris Lee", "title": "Atomic cloud key to controlling a quantum state without measuring it - Ars Technica", "description": "Cloud of atoms acts as the heart of a controller for quantum cooling system.", "url": "https://arstechnica.com/science/2022/02/atomic-cloud-key-to-controlling-a-quantum-state-without-measuring-it/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/cond2021_04_01hr-scaled-760x380.jpg", "publishedAt": "2022-02-07T19:17:29Z", "content": "Enlarge/ The atoms (center foreground) alter a laser so it extracts energy from a membrane (blue).\r\n9 with 8 posters participating\r\nWay back when I was still working in the lab, there was a lot of bu… [+3469 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Gene regulation in mammals offers clues connecting pregnancy and cancer metastasis: Regulatory sequences in the genomes of mammals, including cows, pigs, horses, and humans, help explain how normal tissue is invaded by cancer - Science Daily", "description": "In many mammals including humans, the placenta invades the wall of the uterus during pregnancy in the same way that cancer cells invade surrounding tissues. Using genomic sequences and gene expression information, researchers were able to predict specific sig…", "url": "https://www.sciencedaily.com/releases/2022/02/220207135831.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T19:13:10Z", "content": "Researchers from UConn Heath and Yale University have made new advances connecting the evolution of pregnancy and cancer metastasis.Publishing in the Proceedings of the National Academy of Sciences, … [+3629 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Large new titanosaurian dinosaur from the Pyrenees: The skeleton of Abditosaurus kuehnei is the most complete titanosaur fossil discovered so far in Europe - Science Daily", "description": "Researchers have described the new species of titanosaur dinosaur Abditosaurus kuehnei from the remains excavated at the Orcau-1 site, in the southern Pyrenees (Catalonia, Spain). The semiarticulated 70.5-million-year-old skeleton is the most complete specime…", "url": "https://www.sciencedaily.com/releases/2022/02/220207124822.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T18:35:24Z", "content": "Researchers from the Institut Català de Paleontologia Miquel Crusafont (ICP), the Conca Dellà Museum (MCD), the Universitat Autònoma de Barcelona (UAB), the University of Zaragoza (UNIZAR) and the NO… [+6020 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "SpaceX is investigating a key Crew Dragon component ahead of Crew-4 flight - Inverse", "description": "SpaceX's human-carrying capsule has a surprise issue with its parachutes. Here's what it could mean for Crew Dragon Crew-4 and the upcoming Axiom Space mission.", "url": "https://www.inverse.com/innovation/spacex-data-point", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/2/7/45a105b5-5225-4bc4-b100-50b71a7e419e-getty-1235276077.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-07T18:25:08Z", "content": "SpaceX has stumbled\r\n across a surprising piece of information and it could help it tweak how its astronauts return to Earth.\r\nDuring a press briefing last week, as reported by SpaceNews, NASA and Sp… [+3712 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Weston Blasi", "title": "What to know about the Astra rocket launch from Cape Canaveral on Monday - MarketWatch", "description": "Astra was attempting to join SpaceX, Blue Origin and Virgin Galactic as companies that have recently launched vehicles into space.", "url": "https://www.marketwatch.com/story/what-to-know-about-the-astra-rocket-launch-from-cape-canaveral-on-monday-11644257007", "urlToImage": "https://images.mktw.net/im-481255/social", "publishedAt": "2022-02-07T18:03:00Z", "content": "For years NASA was main organization who would routinely launch aircraft into space. That is certainly no longer the case.During the last few years, other companies including Elon Musks SpaceX, Amazo… [+1810 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Nanowires under tension create the basis for ultrafast transistors - Science Daily", "description": "Nanowires have a unique property: These ultra-thin wires can sustain very high elastic strains without damaging the crystal structure of the material. A team of researchers has now succeeded in experimentally demonstrating that electron mobility in nanowires …", "url": "https://www.sciencedaily.com/releases/2022/02/220207112656.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T17:50:43Z", "content": "Smaller chips, faster computers, less energy consumption. Novel concepts based on semiconductor nanowires are expected to make transistors in microelectronic circuits better and more efficient. Elect… [+4981 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Youngest pair of asteroids ever discovered in solar system spotted by astronomers - WION", "description": "Astronomers have spotted the youngest pair of asteroids ever discovered in the solar system.", "url": "https://www.wionews.com/science/youngest-pair-of-asteroids-ever-discovered-in-solar-system-spotted-by-astronomers-451332", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/02/07/239207-untitled-design-24.jpg", "publishedAt": "2022-02-07T17:43:22Z", "content": "Astronomers have spotted the youngest pair of asteroids ever discovered in the solar system.\r\nSplit off from their parent body merely 300 years ago, they possess properties that are hard to explain d… [+1768 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers use tiny magnetic swirls to generate true random numbers - Phys.org", "description": "Whether for use in cybersecurity, gaming or scientific simulation, the world needs true random numbers, but generating them is harder than one might think. But a group of Brown University physicists has developed a technique that can potentially generate mill…", "url": "https://phys.org/news/2022-02-tiny-magnetic-swirls-true-random.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/researchers-use-tiny-m.jpg", "publishedAt": "2022-02-07T17:38:22Z", "content": "Whether for use in cybersecurity, gaming or scientific simulation, the world needs true random numbers, but generating them is harder than one might think. But a group of Brown University physicists … [+5641 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "NASA Officially Approves First SpaceX Tourists to Visit Space Station - Futurism", "description": "NASA just approved a SpaceX project to launch its first fully-private astronaut mission to the International Space Station.", "url": "https://futurism.com/the-byte/nasa-private-iss-mission", "urlToImage": "https://wp-assets.futurism.com/2022/02/nasa-private-iss-mission.jpg", "publishedAt": "2022-02-07T17:26:38Z", "content": "It's happening!\r\nFirst Class\r\nNASA just approved a crew of four private astronauts to fly up to the International Space Station with Axiom Space and SpaceX, on the first American mission of its kind.… [+2217 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "This SpaceX video of a Falcon 9 rocket stage separation during launch is just amazing - Space.com", "description": "The video was captured during a Jan. 31 launch of an Italian satellite.", "url": "https://www.space.com/spacex-falcon-9-rocket-launch-tracking-camera-video-csg-2", "urlToImage": "https://cdn.mos.cms.futurecdn.net/htH2zySeBfFsDvx2t5uDz6-1200-80.jpg", "publishedAt": "2022-02-07T17:24:54Z", "content": "A new SpaceX video has captured a striking view of two critical moments in any rocket launch: stage separation for its booster and nose cone jettison. \r\nThe video, which SpaceX released on YouTube Sa… [+2952 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "NASA asteroid detector 'looks up' to scan entire sky every 24 hours - Livescience.com", "description": "The addition of two southern hemisphere telescopes will enable ATLAS to do full sky scans.", "url": "https://www.livescience.com/nasa-upgrades-atlas-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gTXdLAyjyieQAWPgxjZ5h3-1200-80.jpg", "publishedAt": "2022-02-07T16:22:20Z", "content": "NASA's asteroid\r\n monitoring system has been upgraded so that it can scan the entire night sky once every 24 hours for potentially hazardous space rocks that are heading our way. \r\nThe Asteroid Terre… [+3941 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "David Rothery", "title": "Asteroid sharing Earth's orbit discovered — could it help future space missions? - Space.com", "description": "Could we mine Earth's newly discovered companion?", "url": "https://www.space.com/earth-trojan-asteroid-help-space-missions", "urlToImage": "https://cdn.mos.cms.futurecdn.net/geFKbEEV2PG3Je5DenDgU7-1200-80.jpg", "publishedAt": "2022-02-07T16:00:11Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nDavid Rothery, Professor of Planetary Geoscienc… [+5380 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cocktail of two chemicals could help slow down age-related muscular decline - News-Medical.net", "description": "Researchers from Tokyo Metropolitan University have shown that a mixture of 5-aminolevulinic acid(5-ALA) hydrochloride and sodium ferrous citrate (SFC) helps slow down aging-related muscular decline in fruit flies, leading to a slower decline in locomotor act…", "url": "https://www.news-medical.net/news/20220207/Cocktail-of-two-chemicals-could-help-slow-down-age-related-muscular-decline.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/shutterstock_1028141632_649cad8889c647fc8d0bd83bf7503e08-620x480.jpg", "publishedAt": "2022-02-07T14:33:00Z", "content": "Researchers from Tokyo Metropolitan University have shown that a mixture of 5-aminolevulinic acid(5-ALA) hydrochloride and sodium ferrous citrate (SFC) helps slow down aging-related muscular decline … [+3140 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Dying Stars may Hatch New Planets, According to Novel Study - Optic Flux", "description": "Planets do not take much longer to form after stars have formed. For example, the Sun formed 4.6 billion years ago, and the Earth about 4.5 billion years ago. However, scientists now say it is not necessarily the only possibility. They say planets can form ev…", "url": "https://www.opticflux.com/dying-stars-may-hatch-new-planets-according-to-novel-study/15499/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/1447860396-planet-1.jpg", "publishedAt": "2022-02-07T14:02:14Z", "content": "Planets do not take much longer to form after stars have formed. For example, the Sun formed 4.6 billion years ago, and the Earth about 4.5 billion years ago.\r\nHowever, scientists now say it is not n… [+1877 chars]"}, {"source": {"id": null, "name": "Tasnim News Agency"}, "author": "Tasnim News Agency", "title": "Firestorm Caused by A Comet Triggered An Ice Age nearly 13,000 Years Ago - Tasnim News Agency", "description": "TEHRAN (Tasnim) – At a point some 12,800 years ago, a tenth of Earth's surface suddenly became covered in roaring fires.", "url": "https://www.tasnimnews.com/en/news/2022/02/07/2658756/firestorm-caused-by-a-comet-triggered-an-ice-age-nearly-13-000-years-ago", "urlToImage": "/Static/img/tasnim-main-logo.jpg", "publishedAt": "2022-02-07T14:00:00Z", "content": "The firestorm rivalled the one that wiped out the dinosaurs, and it was likely caused by fragments of a comet that would have measured around 100 kilometers (62 miles) across.\r\nAs dust clouds smother… [+3029 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Adam McMaster, Andrew Norton", "title": "Astronomers think they've just spotted an 'invisible' black hole for the first time - The Conversation UK", "description": "Some black holes are isolated in space and therefore near impossible to detect.", "url": "https://theconversation.com/astronomers-think-theyve-just-spotted-an-invisible-black-hole-for-the-first-time-176602", "urlToImage": "https://images.theconversation.com/files/444789/original/file-20220207-17-1opuin2.jpg?ixlib=rb-1.1.0&rect=0%2C289%2C4608%2C2304&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-07T13:58:52Z", "content": "Astronomers famously snapped the first ever direct image of a black hole in 2019, thanks to material glowing in its presence. But many black holes are actually near impossible to detect. Now another … [+5345 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Researchers Discover How Bacteria Adapt to New Environment - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. It is a known fact that bacteria are extremely resourceful when it comes to adapting to a given environment. Now, a team of researchers have discovered a new trick that bacteria use: a kind of sponge tha…", "url": "https://www.latestly.com/agency-news/science-news-researchers-discover-how-bacteria-adapt-to-new-environment-3337305.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/bacteria2022020712142820220207133036-588x441.jpg", "publishedAt": "2022-02-07T13:50:27Z", "content": "Wurzburg [Germany], February 7 (ANI): It is a known fact that bacteria are extremely resourceful when it comes to adapting to a given environment. Now, a team of researchers have discovered a new tri… [+5056 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Ice age mammoth, woolly rhino and hyena bones uncovered in English town - Livescience.com", "description": "The bones were found during a construction project.", "url": "https://www.livescience.com/ice-age-animal-remains-found-in-devon-england", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5hfbZXaspTz9xJcUV8KQvj-1200-80.jpg", "publishedAt": "2022-02-07T13:37:33Z", "content": "The bones of a woolly mammoth, woolly rhinoceros, hyena and wolf recently discovered in an English town are thought to date to the last Ice Age\r\n. \r\nThe animal remains turned up during the constructi… [+3096 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Researchers create strong synthetic enamel similar to natural tooth covering - Phys.org", "description": "A team of researchers from Beihang University, the Peking University School and Hospital of Stomatology and the Michigan Institute of Translational Nanotechnology has developed a synthetic enamel with properties similar to natural tooth enamel. In their paper…", "url": "https://phys.org/news/2022-02-strong-synthetic-enamel-similar-natural.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-create-str.jpg", "publishedAt": "2022-02-07T13:30:01Z", "content": "A team of researchers from Beihang University, the Peking University School and Hospital of Stomatology and the Michigan Institute of Translational Nanotechnology has developed a synthetic enamel wit… [+2483 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Increasing the accuracy of atomic force calculations with the space-warp coordinate transformation - Phys.org", "description": "Atomic forces are primarily responsible for the motion of atoms and their versatile arrangement patterns, which is unique for different types of materials. Atomic simulation methods are a popular choice for the calculation of these forces, the understanding o…", "url": "https://phys.org/news/2022-02-accuracy-atomic-space-warp.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/increasing-the-accurac.jpg", "publishedAt": "2022-02-07T12:38:49Z", "content": "Atomic forces are primarily responsible for the motion of atoms and their versatile arrangement patterns, which is unique for different types of materials. Atomic simulation methods are a popular cho… [+4891 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "A brain circuit tied to emotion may lead to better treatments for Parkinson's disease - HPPR", "description": "The symptoms of Parkinson's disease can vanish briefly in the face of stress or a strong emotion. Now scientists are searching for a treatment based on this phenomenon, a form of the placebo effect.", "url": "https://www.npr.org/sections/health-shots/2022/02/07/1076359099/a-brain-circuit-tied-to-emotion-may-lead-to-better-treatments-for-parkinsons-dis", "urlToImage": "https://media.npr.org/assets/img/2022/01/31/parkinsons-boxing-1_wide-15722682b08f7828274bbb938b8074a201d330b1.jpg?s=1400", "publishedAt": "2022-02-07T12:35:31Z", "content": "Paul has lived with Parkinson's disease for more than a decade. Although he has difficulty rising out of a chair, he was able to leap up to keep his young grandson from falling down a flight of stair… [+9753 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX shares incredible footage of its Falcon 9 rocket soaring at 6,000 kmph; WATCH - Republic World", "description": "SpaceX, which is aiming for 52 launches in 2022, shared the video from the COSMO-SkyMed Second Generation FM2 satellite launch from February 1.", "url": "https://www.republicworld.com/science/space/spacex-shares-incredible-footage-of-its-falcon-9-rocket-soaring-at-6000-kmph-watch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/x4xw3sg4gqsiavoc_1644234953.jpeg", "publishedAt": "2022-02-07T12:07:00Z", "content": "SpaceX has an aim to conduct one Falcon 9 launch every week as it is eyeing to break its own record of 31 successful liftoffs last year. The company has had a great start to 2022 and has conducted se… [+1637 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "'Supermountains' Three Times Length Of Himalayas May Have Driven Evolutionary Outbursts - IFLScience", "description": "At the base of the highest mountains, rocks are formed unlike those created under any other conditions. Twice during Earth's history, giant mountain ranges", "url": "https://www.iflscience.com/environment/supermountains-three-times-length-of-himalayas-may-have-driven-evolutionary-outbursts/", "urlToImage": "https://cdn.iflscience.com/images/bc4addd7-2d28-52ee-8d52-6095a317b535/default-1644234273-cover-image.jpg", "publishedAt": "2022-02-07T11:51:00Z", "content": "At the base of the highest mountains, rocks are formed unlike those created under any other conditions. Twice during Earth's history, giant mountain ranges high enough to produce these rocks stretche… [+4103 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Too Many Disk Galaxies Than Theory Allows: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. The Standard Model of Cosmology has described how the universe came into being according to the view of most physicists. Now, researchers at the University of Bonn studied the evolution of galaxies withi…", "url": "https://www.latestly.com/agency-news/science-news-too-many-disk-galaxies-than-theory-allows-study-3336765.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/galaxy2022020708173720220207112939-588x441.jpg", "publishedAt": "2022-02-07T11:48:23Z", "content": "Bonn [Germany], February 7 (ANI): The Standard Model of Cosmology has described how the universe came into being according to the view of most physicists. Now, researchers at the University of Bonn s… [+4246 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "International Astronomical Union launches new center to fight satellite megaconstellation threat - Space.com", "description": "There is nowhere to hide from megaconstellation interference.", "url": "https://www.space.com/iau-center-protect-astronomy-megaconstellation-threat", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Vyf55EDFpqBEgkk42GfW4Y-1200-80.jpg", "publishedAt": "2022-02-07T11:00:31Z", "content": "The International Astronomical Union (IAU) has launched a new center to fight the threat of satellite megaconstellations, which it now describes as worse than urban light pollution. \r\nThe Center for … [+4987 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble spots interacting galaxy pair with monumentally energetic cores - Devdiscourse", "description": "Arp 282 is composed of the Seyfert galaxy NGC 169 (bottom) and the galaxy IC 1559 (top) located in the constellation Andromeda. Seyfert galaxies are an extremely energetic class of galaxies known as active galactic nuclei (AGNs), an extraordinarily active cor…", "url": "https://www.devdiscourse.com/article/science-environment/1913076-hubble-spots-interacting-galaxy-pair-with-monumentally-energetic-cores", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_02_2022_16_20_50_111228.jpg?width=920&format=jpeg", "publishedAt": "2022-02-07T10:59:39Z", "content": "The NASA/ESA Hubble Space Telescope has captured a spectacular image of Arp 282, an interacting galaxy pair with monumentally energetic cores. The image was shared by the European Space Agency on Mon… [+1665 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Our galaxy Milky Way is large enough to contain 100 billion planets - Interesting Engineering", "description": "The Earth and our entire solar system are located inside the Milky Way galaxy along with billions of other stars, suns, and planets.", "url": "https://interestingengineering.com/milky-way-galaxy", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Ne6Nk4j3w5/sizes/milkyway_md.jpg", "publishedAt": "2022-02-07T09:51:45Z", "content": "If you get a chance to go night camping at a place like Arches National Park in the US, Bodmin Moor in the UK, or one of the other certified International Dark Sky Parks, don’t you miss it, because a… [+7721 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Ellie Abraham", "title": "Scientists reveal that Earth could avoid 'planet killer' asteroid by using nukes - indy100", "description": "It’s the topic of many disaster movies, but scientists have revealed that we may be able to save Earth from a planet-destroying asteroid using nuclear technology.Scientists from the University of California have been working on the way in which mankind may be…", "url": "https://www.indy100.com/science-tech/scientists-asteroid-nuclear-weapons-earth", "urlToImage": "https://www.indy100.com/media-library/nasa-launches-rocket-to-deflect-asteroid-in-first-planetary-defence-test.jpg?id=28060879&width=1200&coordinates=0%2C176%2C0%2C177&height=600", "publishedAt": "2022-02-07T09:27:02Z", "content": "Its the topic of many disaster movies, but scientists have revealed that we may be able to save Earth from a planet-destroying asteroid using nuclear technology.\r\nScientists from the University of Ca… [+2902 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Viktoria Urban", "title": "NASA and SpaceX provide update on Crew-4 mission - SpaceWatch.Global", "description": "Edinburgh, 7 February 2022. - NASA and SpaceX provided an update on the preparations of the Crew-4 mission to the International Space Station (ISS) with NASA astronauts Kjell Lindgren, Robert Hines, J", "url": "https://spacewatch.global/2022/02/nasa-and-spacex-provide-update-on-crew-4-mission/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2022/02/nhq202009150003_medium.jpeg", "publishedAt": "2022-02-07T09:08:55Z", "content": "NASA crew members of the SpaceX Crew-4 mission to the International Space Station. Pictured from left are NASA astronauts Kjell Lindgren and Bob Hines. Credit: NASA\r\nEdinburgh, 7 February 2022. – NAS… [+996 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "See the Milky Way's center as we've never seen it before - Big Think", "description": "As viewed by the MeerKAT telescope, this radio view of the Milky Way blows away every other way we've ever seen our home galaxy.", "url": "https://bigthink.com/starts-with-a-bang/milky-way-center/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/02/galaxy-center-overall.jpg", "publishedAt": "2022-02-07T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "IndianWeb2", "title": "Europe Space Agency Creating Robotic Space Servicing Vehicle Capable of Servicing and Re-Fuelling of Satellites in Orbit - IndianWeb2.com", "description": "ESA’s proposed e.Deorbit mission, shown left, using a robotic arm to catch a derelict satellite. [Image credits  ESA–David Ducros, 2016/ www...", "url": "https://www.indianweb2.com/2022/02/europe-space-agency-creating-robotic.html", "urlToImage": "https://blogger.googleusercontent.com/img/a/AVvXsEiIMlfONyxDMmoNR4USRzoPwxJK4MQxBsDnik2JQmfxKdklx2asYSLKAFak0kaFJuP0_dfEQ76LVmqXk71Y4fz_QU_lK6InMVuM_gJXMHAxiKT9kJnzQ7qTzmCJLdtB4zqB86o8kQxfcz2BBCY0YhUqLskUoXFcs4s5qdrwvBUHSBs5A2rq8i_1Sduf=w833-h521", "publishedAt": "2022-02-07T06:54:00Z", "content": "European Space Agency (ESA) is working on a project of making a space servicing vehicle equipped with robotic arm that can perform satellites-servicing tasks like refueling, refurbishing, and boostin… [+2262 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "1.3-km-wide asteroid headed towards Earth, Nasa classifies it 'potentially hazardous' - India Today", "description": "Once the asteroid comes close to Earth on March 4, its next such close approach is scheduled in March 2043.", "url": "https://www.indiatoday.in/science/story/1-3-km-wide-asteroid-headed-towards-earth-nasa-classifies-it-potentially-hazardous-1909755-2022-02-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202202/Asteroid_4-647x363.jpeg?UneOUbcHQ33mDOfAMhrP.zK9IaNurF.S", "publishedAt": "2022-02-07T06:45:25Z", "content": null}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "NASA photo reveals special training for astronaut lunar missions - Digital Trends", "description": "An eerie image released by NASA reveals how the space agency is gearing up for astronaut training for its upcoming lunar missions.", "url": "https://www.digitaltrends.com/news/nasa-photo-shows-special-training-for-crewed-moon-trip/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/nasa-moonwalk-south-pole.jpg", "publishedAt": "2022-02-07T06:20:52Z", "content": "An eerie image released by NASA reveals how the space agency is gearing up for some rather unique astronaut training.\r\nCaptured from inside a giant tank of water at NASAs Neutral Buoyancy Laboratory … [+2489 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Webb Space Telescope Successfully Sees Its First Glimmer of Light - Gizmodo Australia", "description": "A major milestone has been achieved in the deployment of the James Webb Space Telescope, with an onboard instrument detecting...", "url": "https://www.gizmodo.com.au/2022/02/webb-space-telescope-successfully-sees-its-first-glimmer-of-light/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/05/89e711291c8067bb7800cf6a4eff1fbf.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-07T05:38:00Z", "content": "A major milestone has been achieved in the deployment of the James Webb Space Telescope, with an onboard instrument detecting its first photons from a distant star. This means engineers can now begin… [+3461 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Erin Blackmore", "title": "Alien hammer-head flatworm threatening nature's biodiversity is named after pandemic - Independent.ie", "description": "There&rsquo;s no shortage of creepy, crawly stuff to be found in soil and organisms such as worms, snails and slugs are essential to the planet&rsquo;s health.", "url": "https://www.independent.ie/world-news/alien-hammer-head-flatworm-threatening-natures-biodiversity-is-named-after-pandemic-41319568.html", "urlToImage": "https://www.independent.ie/world-news/3db0f/41319567.ece/AUTOCROP/w1240h700/New%20Covid%20flatwom", "publishedAt": "2022-02-07T02:30:00Z", "content": "Theres no shortage of creepy, crawly stuff to be found in soil and organisms such as worms, snails and slugs are essential to the planets health.\r\nBut flatworms, a subset of creepy creatures that fee… [+996 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Researchers Have Set A New Record By Preserving Quantum States For More Than 5 Seconds - Wonderful Engineering", "description": "Advertisement Researchers are constantly dealing with how to read the information held in qubits. Quantum science involves many practical applications including hackerproof communication networks or quantum computers that can accelerate new drug discovery. Su…", "url": "https://wonderfulengineering.com/researchers-have-set-a-new-record-by-preserving-quantum-states-for-more-than-5-seconds/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/02/1-stars.jpg", "publishedAt": "2022-02-06T19:01:16Z", "content": "Researchers are constantly dealing with how to read the information held in qubits. Quantum science involves many practical applications including hackerproof communication networks or quantum comput… [+2146 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Belinda Smith", "title": "The International Space Station will meet its end in 2031. Where will it crash and what will take its place? - ABC News", "description": "The clock is ticking for the International Space Station, which will meet its watery demise in roughly nine years' time. Why is it being intentionally crashed into the ocean and what will replace it?", "url": "https://www.abc.net.au/news/science/2022-02-07/international-space-station-deorbit-retire-spacecraft-cemetery/100802664", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/74d1d7a5bf3d999b4f750fd167fc53bf?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2022-02-06T18:30:00Z", "content": "The clock is ticking for the International Space Station, with NASA last week declaring plans to let it plummet back to Earth in 2031.\r\nThe iconic piece of space infrastructure will be nudged out of … [+7446 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Tabahriti", "title": "SpaceX has so many Starlink satellites they're increasingly photobombing astronomers' images, study says - Business Insider Africa", "description": "SpaceXs satellites are increasingly photobombing astronomical images, a study has found.", "url": "https://africa.businessinsider.com/news/spacex-has-so-many-starlink-satellites-theyre-increasingly-photobombing-astronomers/52rxl6f#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/9jIktkuTURBXy8xZjA2ZDVmMi05N2I2LTQ4MDYtYTkwMC1kNGFiOWNhODMyM2EuanBlZ5GTBc0EsM0Cdg", "publishedAt": "2022-02-06T15:51:47Z", "content": "There has been a huge increase in the number of astronomers' images corrupted by streaks of reflected sunlight caused by SpaceX's satellites, a new study has found.\r\nAccording to the study, which was… [+1684 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "The abyssal world: the last terra incognita of the Earth surface - Space Daily", "description": "Bremen, Germany (SPX) Feb 07, 2022 - \r\nThe deep-ocean floor is the least explored ecosystem on the planet, despite covering more than 60% of the Earth surface. Largely unknown life in abyssal sediments, from benthic animals to microbes,", "url": "https://www.spacedaily.com/reports/The_abyssal_world_the_last_terra_incognita_of_the_Earth_surface_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/deep-sea-abyssal-oceanic-regions-gorgonians-black-corals-1960-m-atlantic-ocean-hg.jpg", "publishedAt": "2022-02-06T13:43:45Z", "content": "The deep-ocean floor is the least explored ecosystem on the planet, despite covering more than 60% of the Earth surface. Largely unknown life in abyssal sediments, from benthic animals to microbes, h… [+6188 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "The French island of Maiao stands out in the Pacific Ocean - Earth.com", "description": "Today's Image of the Day from NASA Earth Observatory features the small island of Maiao, an overseas territory of France in the Pacific Ocean", "url": "https://www.earth.com/image/the-french-island-of-maiao-stands-out-in-the-pacific-ocean/", "urlToImage": "https://cff2.earth.com/uploads/2022/02/06050858/iss065e156801_lrg2-scaled.jpg", "publishedAt": "2022-02-06T12:15:00Z", "content": "Today’s Image of the Day from NASA Earth Observatory features the small island of Maiao, an overseas territory of France in the Pacific Ocean. The atoll of completely surrounded by a coral reef, whic… [+837 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Study reveals hostile conditions on Earth as life evolved - Tech Explorist", "description": "Ozone (O3), making up a tiny proportion of Earth's atmosphere by weight, is one of Earth's most essential molecules for life. Without a substantial", "url": "https://www.techexplorist.com/study-reveals-hostile-conditions-earth-life-evolved/44021/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/01/earth-space.jpg", "publishedAt": "2022-02-06T12:03:17Z", "content": "Ozone (O3), making up a tiny proportion of Earth’s atmosphere by weight, is one of Earth’s most essential molecules for life. Without a substantial stratospheric O3 layer, the surface would receive h… [+3919 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kiona N. Smith", "title": "The oldest hominin fossil ever found in the Levant - Ars Technica", "description": "The fossil hints that early members of our genus expanded out of Africa in waves.", "url": "https://arstechnica.com/science/2022/02/1-5-million-year-old-vertebra-hints-at-a-story-of-early-human-migration/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/UBEIDIYA-SITE-700x380.png", "publishedAt": "2022-02-06T12:00:06Z", "content": "7 with 5 posters participating\r\nWhen the first members of our species ventured out of Africa, they walked into a world that earlier hominins, such as Homo erectus, had first explored a million years … [+4420 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brittney J. Miller", "title": "What's the oldest mountain range in the world? (How about the youngest?) - Livescience.com", "description": "Not all mountain ranges are ancient, geologically speaking.", "url": "https://www.livescience.com/oldest-youngest-mountain-ranges", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RTuWrNMXFN8qrVZsCWYJxM-1200-80.jpg", "publishedAt": "2022-02-06T12:00:03Z", "content": "Mountains may look ancient — but some are mere toddlers, while others are great-grandaddies, geologically speaking. So, what is the oldest mountain range? And what about the youngest? \r\nIn general, t… [+4634 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Researchers Identified the Source of Supermassive Black Hole Flares to be Magnetic \"Reconnection\" around the Event Horizon. - Optic Flux", "description": "Largest-ever simulations point to flickering caused by magnetic reconnection.' Breaking and reconnecting magnetic field lines at the event horizon unleash the energy from a black hole's magnetic field, speeding particles that cause intense flares, according t…", "url": "https://www.opticflux.com/researchers-identified-the-source-of-supermassive-black-hole-flares-to-be-magnetic-reconnection-around-the-event-horizon/15441/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/Supermassive-Black-Hole-Flare-768x432.gif", "publishedAt": "2022-02-06T10:45:34Z", "content": "Largest-ever simulations point to flickering caused by magnetic reconnection.’\r\nBreaking and reconnecting magnetic field lines at the event horizon unleash the energy from a black hole’s magnetic fie… [+5762 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "‘I didn’t even know this was humanly possible’: the woman who can descend into the sea on one breath - The Guardian", "description": "Scientists once thought humans could swim to a maximum depth of 30m on a single breath. Amber Bourke has gone deeper than 70m and physiology alone can’t explain why", "url": "https://amp.theguardian.com/society/2022/feb/06/i-didnt-even-know-this-was-humanly-possible-the-woman-who-can-descend-into-the-sea-on-one-breath", "urlToImage": null, "publishedAt": "2022-02-06T06:15:00Z", "content": "Meet the superhumansScientists once thought humans could swim to a maximum depth of 30m on a single breath. Amber Bourke has gone deeper than 70m and physiology alone cant explain why\r\nTen years ago,… [+7050 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "How a Magnetic 'Tug-of-War' With Io's Volcanic Eruptions Creates Jupiter's Auroras - ScienceAlert", "description": "NASA's Juno spacecraft and the Hubble Space Telescope helped researchers chart the electric currents driving Jupiter's aurora.", "url": "https://www.businessinsider.com/space-lava-from-moon-volcanoes-creates-jupiters-powerful-aurora-lights-2022-2", "urlToImage": "https://i.insider.com/61fd63ebb8178a001866ca0e?width=1200&format=jpeg", "publishedAt": "2022-02-05T23:02:04Z", "content": "Jupiter's auroras the lights that dance around its poles are the most distinct in our solar system and over a thousand times brighter than Earth's aurora. Now, a new study confirms that these otherwo… [+3546 chars]"}]}