{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "NASA contest asks K-12 students to create Moon-digging robots - Yahoo Finance Australia", "description": "NASA is running a contest that challenges K-12 students to design a robot that can excavate the Moon.", "url": "https://au.finance.yahoo.com/news/nasa-moon-digging-robot-student-challenge-194200366.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/x6RI9ELcc.T.iKAfF9uG7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2021-10/82126a10-31d6-11ec-b7ff-05f0378ab573", "publishedAt": "2021-10-20T19:49:11Z", "content": "NASA doesn't just want adults learning how to work with lunar soil. The space agency has launched a Lunabotics Junior contest that tasks K-12 students in the US with designing (but not manufacturing)… [+935 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "We Asked a NASA Scientist: What if an Asteroid Were Going to Hit Earth? - NASA", "description": "There are no known threats to Earth, but NASA asteroid expert Dr. Kelly Fast says it’s important to find the asteroids before they find us. That’s why NASA’s...", "url": "https://www.youtube.com/watch?v=NwSISlnoy9w", "urlToImage": "https://i.ytimg.com/vi/NwSISlnoy9w/maxresdefault.jpg", "publishedAt": "2021-10-20T17:09:21Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "NASA shares its vision for the future of space travel in exciting sci-fi video - Daily Mail", "description": "NASA's vision of space travel would be to send tourists to exotic places around the solar system and beyond, where they can do exciting activities like kayaking on the waters of Titan.", "url": "https://www.dailymail.co.uk/sciencetech/article-10112157/NASA-shares-vision-future-space-travel-exciting-sci-fi-video.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/20/17/49423335-0-image-a-65_1634745881420.jpg", "publishedAt": "2021-10-20T16:15:26Z", "content": "As space tourism moves from science fiction to science fact, NASA is looking further into the future to when civilians will go far beyond Earths orbit to visit distant worlds.\r\nThe American space age… [+4007 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA spacecraft Lucy to visit eight asteroids - AP Archive", "description": "(15 Oct 2021) LEAD IN:NASA is on an asteroid roll as it gets set to launch a series of spacecraft to visit and even bash some of the solar system's most enti...", "url": "https://www.youtube.com/watch?v=s6i8q5_gEoI", "urlToImage": "https://i.ytimg.com/vi/s6i8q5_gEoI/hqdefault.jpg", "publishedAt": "2021-10-20T16:00:38Z", "content": null}, {"source": {"id": null, "name": "Dubboonlinenews.com.au"}, "author": "Online News Publisher", "title": "Uranus in the infrared - News Net Nebraska - Dubbo Online News", "description": "The AIRTV telescope (Infrared telescope attachment) Della NASA immortalized Uranus Like we haven’t seen it...", "url": "https://dubboonlinenews.com.au/uranus-in-the-infrared-news-net-nebraska/", "urlToImage": "https://sdrjix3pzmib.compat.objectstorage.ap-sydney-1.oraclecloud.com/dubboonlinenews-com-au/uploads/2021/01/aon_default-696x346-1.jpg", "publishedAt": "2021-10-20T15:56:40Z", "content": "The AIRTV telescope (Infrared telescope attachment) Della NASA immortalized UranusLike we havent seen it before. The created image shows the entire globe of the planet in the infrared spectrum that s… [+102 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Astronomers detect signs of an atmosphere stripped from a planet in a giant impact - Nanowerk", "description": "Astronomers have discovered evidence of a giant impact in the nearby HD 17255 star system, in which an Earth-sized terrestrial planet and a smaller impactor likely collided at least 200,000 years ago, stripping off part of one planet's atmosphere.", "url": "https://www.nanowerk.com/news2/space/newsid=58963.php", "urlToImage": "https://www.nanowerk.com/news2/space/id58963.jpg", "publishedAt": "2021-10-20T15:27:45Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Confirmed: Vikings Reached the Americas Long Before Columbus - Gizmodo Australia", "description": "Vikings were active at a Newfoundland settlement nearly 500 years before Christopher Columbus crossed the Atlantic, new research suggests. On...", "url": "https://www.gizmodo.com.au/2021/10/confirmed-vikings-reached-the-americas-long-before-columbus/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/10/21/56afb7430196045e808009229355df11.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2021-10-20T15:00:00Z", "content": "Vikings were active at a Newfoundland settlement nearly 500 years before Christopher Columbus crossed the Atlantic, new research suggests.\r\nOn the northernmost tip of the northernmost peninsula of Ne… [+4465 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alison Gold", "title": "Studying the edge of the sun's magnetic bubble - Phys.org", "description": "Our corner of the universe, the solar system, is nestled inside the Milky Way galaxy, home to more than 100 billion stars. The solar system is encased in a bubble called the heliosphere, which separates us from the vast galaxy beyond—and some of its harsh spa…", "url": "https://phys.org/news/2021-10-edge-sun-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/studying-the-edge-of-t.jpg", "publishedAt": "2021-10-20T13:16:47Z", "content": "Our corner of the universe, the solar system, is nestled inside the Milky Way galaxy, home to more than 100 billion stars. The solar system is encased in a bubble called the heliosphere, which separa… [+7804 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Astronomers discover twin sub-Neptune exoplanets orbiting nearby star - Phys.org", "description": "By analyzing the data from the TESS-Keck Survey (TKS), an international team of astronomers reports the detection of two almost identically sized sub-Neptune exoplanets orbiting a nearby star. The newly found alien worlds, designated HD 63935 b and HD 63935 c…", "url": "https://phys.org/news/2021-10-astronomers-twin-sub-neptune-exoplanets-orbiting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/astronomers-discover-t-1.jpg", "publishedAt": "2021-10-20T13:10:04Z", "content": "By analyzing the data from the TESS-Keck Survey (TKS), an international team of astronomers reports the detection of two almost identically sized sub-Neptune exoplanets orbiting a nearby star. The ne… [+3125 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Image: Auroras viewed from orbit - Phys.org", "description": "Auroras make for great Halloween décor over Earth, though ESA astronaut Thomas Pesquet snapped these green smoky swirls of plasma from the International Space Station in August. Also pictured are the Soyuz MS-18 \"Yuri Gagarin\" (left) and the new Nauka module …", "url": "https://phys.org/news/2021-10-image-auroras-viewed-orbit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/image-auroras-viewed-f.jpg", "publishedAt": "2021-10-20T13:01:06Z", "content": "Auroras make for great Halloween décor over Earth, though ESA astronaut Thomas Pesquet snapped these green smoky swirls of plasma from the International Space Station in August. Also pictured are the… [+2367 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Doris Elin Urrutia", "title": "NASA has selected new space telescope project to study Milky Way's evolution - Space.com", "description": "The most violent and powerful events in the universe produce gamma-ray bursts.", "url": "https://www.space.com/nasa-selects-cosi-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ynu47Dkzzh7nuzo7gQT4bM-1200-80.jpg", "publishedAt": "2021-10-20T11:18:16Z", "content": "NASA has picked a new telescope to head into space, where it will peer out in search of the most powerful light emissions made in the universe.\r\nRadio, visible light and X-rays are all part of the el… [+1770 chars]"}, {"source": {"id": null, "name": "Burnieonlinenews.com.au"}, "author": "Online News Publisher", "title": "Medical studies focus more on men than women. Do the reasons for that stack up? - SBS - Burnie Online News", "description": "ANALYSIS: Despite making up half the population, females are often excluded from scientific research. While it may seem like...", "url": "https://burnieonlinenews.com.au/medical-studies-focus-more-on-men-than-women-do-the-reasons-for-that-stack-up-sbs/", "urlToImage": "https://sdrjix3pzmib.compat.objectstorage.ap-sydney-1.oraclecloud.com/burnieonlinenews-com-au/uploads/2021/10/a8d01f89-38ee-552d-b5c5-a3d8f09a95b2.jpg", "publishedAt": "2021-10-20T10:03:16Z", "content": "There are just over 13 million females in Australia right now, making up a little more than half the country’s population, at 50.2%.But for decades, when it comes to medical research and understandin… [+95 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Functional Spermatid-Like Cells Generated From Primate Stem Cells - Technology Networks", "description": "A new study published in <i>Fertility and Sterility Science</i>, is the first to show that functional sperm cells can be made in a dish using primate embryonic stem cells.", "url": "https://www.technologynetworks.com/cell-science/news/functional-spermatid-like-cells-generated-from-primate-stem-cells-354900", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/functional-spermatid-like-cells-generated-from-primate-stem-cells-354900.jpg?cb=20211020", "publishedAt": "2021-10-20T08:30:33Z", "content": "With global rates of male infertility continuing to rise, a new study in spermatogonial stem cell research led by researchers at the University of Georgia provides hope for future clinical therapies.… [+2497 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "Darmstadt, we have a problem – ESA reveals its INTEGRAL space telescope was three hours from likely death - The Register", "description": "Gamma ray-spotting 'scope was spinning uncontrollably and unable to make 'leccy until dramatic rescue", "url": "https://www.theregister.com/2021/10/20/esa_reveals_space_telescope_integral/", "urlToImage": "https://regmedia.co.uk/2020/06/15/integral.jpg", "publishedAt": "2021-10-20T08:17:00Z", "content": "The European Space Agency (ESA) revealed on Monday that its 19-year-old International Gamma-Ray Astrophysics Laboratory (INTEGRAL) had a near-death experience last month when failure of a small yet s… [+2630 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Simulating chaotic interactions of three black holes - Phys.org", "description": "Dutch student Arend Moerman (Leiden University, the Netherlands) has defended his thesis research on the simulation of chaotic interactions of three black holes. The simulations, which he carried out together with researchers from Leiden and Oxford, show that…", "url": "https://phys.org/news/2021-10-simulating-chaotic-interactions-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/dutch-student-receives.jpg", "publishedAt": "2021-10-20T07:00:02Z", "content": "Dutch student Arend Moerman (Leiden University, the Netherlands) has defended his thesis research on the simulation of chaotic interactions of three black holes. The simulations, which he carried out… [+2807 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Saumya Kalia", "title": "Earth Had a Dangerous Axis Tilt 84 Million Years Ago, Shows Research - The Swaddle", "description": "\"Whole portions of the planet could be plunged into darkness or thrown into direct sunlight for months at a time\" in an extreme axial tilt.", "url": "https://theswaddle.com/earth-had-a-dangerous-axis-tilt-84-million-years-ago-shows-research/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2021/10/earth-title-editorial.png", "publishedAt": "2021-10-20T06:40:42Z", "content": "Scientists know Earth tilts from time to time on its axis. But just how often this has happened, and what this means, remains a longstanding geological debate. Evidence found in Italy shows the Earth… [+3726 chars]"}, {"source": {"id": null, "name": "Clarepeople.com"}, "author": "cpadmin", "title": "How important is the carbon cycle for life on other planets? – The Clare People - The Clare People", "description": "As the number of discovered exoplanets increases, so does the need to determine which of these distant worlds have the ideal conditions to support life as we know it. According to a new study publishe", "url": "https://www.clarepeople.com/9017-how-important-is-the-carbon-cycle-for-life-on-other-planets/", "urlToImage": "https://www.clarepeople.com/wp-content/uploads/2021/10/9017-how-important-is-the-carbon-cycle-for-life-on-other-planets-780x470.jpeg", "publishedAt": "2021-10-20T02:15:23Z", "content": "As the number of discovered exoplanets increases, so does the need to determine which of these distant worlds have the ideal conditions to support life as we know it. According to a new study publish… [+3835 chars]"}, {"source": {"id": null, "name": "Theglobalherald.com"}, "author": "News Desk", "title": "Open mic on Mars: How newly recorded sounds help us better understand the Red Planet - The Global Herald - The Global Herald", "description": "Global News published this video item, entitled \"Open mic on Mars: How newly recorded sounds help us better understand the Red Planet\" - below is their", "url": "https://theglobalherald.com/news/open-mic-on-mars-how-newly-recorded-sounds-help-us-better-understand-the-red-planet/", "urlToImage": "https://theglobalherald.com/wp-content/uploads/2021/10/DF0HJmXU8lo.jpg", "publishedAt": "2021-10-20T02:00:10Z", "content": "Global News published this video item, entitled Open mic on Mars: How newly recorded sounds help us better understand the Red Planet below is their description.Got a comment? Leave your thoughts in t… [+81 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Space Mining: Scientists Discover Two Asteroids Whose Precious Metals Would Exceed Global Reserves - Forbes", "description": "\"Mini Psyches\"—mysterious metal-rich near-earth asteroids—have been discovered. They could one day be mined.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/10/19/the-age-of-space-mining-just-got-closer-as-scientists-discover-two-asteroids-whose-precious-metals-would-exceed-global-reserves/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60c1ca775161e3707042b66b%2F0x0.jpg%3FcropX1%3D211%26cropX2%3D1882%26cropY1%3D229%26cropY2%3D1169", "publishedAt": "2021-10-20T02:00:00Z", "content": "16 Psyche, the large metallic asteroid ideal for space mining. \r\ngetty\r\nWe know the age of private space travel is here, but what about the wider commercial space industry? Space mining has been talk… [+3261 chars]"}, {"source": {"id": null, "name": "Clarepeople.com"}, "author": "cpadmin", "title": "Dwarf galaxy star may be a primordial hypernova explosion “fossil” – The Clare People - The Clare People", "description": "About , 5 billion years ago, the first stars of the universe formed. These stars are members of the so-called “Population III” and, although we haven't found any of them yet, a study led by Ása Skulad", "url": "https://www.clarepeople.com/8945-dwarf-galaxy-star-may-be-a-primordial-hypernova-explosion-fossil/", "urlToImage": "https://www.clarepeople.com/wp-content/uploads/2021/10/8945-dwarf-galaxy-star-may-be-a-primordial-hypernova-explosion-fossil-780x470.png", "publishedAt": "2021-10-19T22:12:51Z", "content": "About , 5 billion years ago, the first stars of the universe formed. These stars are members of the so-called Population III and, although we haven’t found any of them yet, a study led by Ása Skuladó… [+2769 chars]"}, {"source": {"id": null, "name": "Devonportonlinenews.com.au"}, "author": "Online News Publisher", "title": "Scientists Create Maps of Titan's Hydrocarbon Rivers and Tributaries - Sci-News.com - Devonport Online News", "description": "Planetary researchers have mapped all observable fluvial features on Saturn’s hazy moon Titan visible in the images from NASA’s...", "url": "https://devonportonlinenews.com.au/scientists-create-maps-of-titans-hydrocarbon-rivers-and-tributaries-sci-news-com/", "urlToImage": "https://sdrjix3pzmib.compat.objectstorage.ap-sydney-1.oraclecloud.com/devonportonlinenews-com-au/uploads/2021/10/01d8a826-ba6e-5a2d-866c-f8678c7df9ac.jpg", "publishedAt": "2021-10-19T22:11:34Z", "content": "Planetary researchers have mapped all observable fluvial features on Saturns hazy moon Titan excluding those in the highly incised labyrinth terrains visible in the images from NASAs Cassini mission.… [+97 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "China's Chang'e-5 mission offers new insights into evolution of Moon | - Macau Business", "description": "International, MNA | Chinese researchers have studied the lunar samples brought back by the Chang'e-5 mission and dated the youngest rock on the Moon at around", "url": "https://www.macaubusiness.com/chinas-change-5-mission-offers-new-insights-into-evolution-of-moon/", "urlToImage": null, "publishedAt": "2021-10-19T21:49:02Z", "content": "Chinese researchers have studied the lunar samples brought back by the Chang’e-5 mission and dated the youngest rock on the Moon at around 2 billion years in age, extending the “life” of lunar volcan… [+7174 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Aria Alamalhodaei", "title": "NASA and Boeing confirm Starliner won’t fly until first half of 2022 as valve investigation continues - Yahoo Finance Australia", "description": "NASA and Boeing provided an update on the beleaguered Starliner capsule Tuesday, confirming that the earliest the spacecraft will fly will be sometime during...", "url": "https://au.finance.yahoo.com/news/nasa-boeing-confirm-starliner-won-205223713.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/w5Zc.zm2dYfCWy9s6N_JNw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/uu/api/res/1.2/j3U7K1_vV5T56iNki6.X3w--~B/aD0yMTYwO3c9Mzg0MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/2badd510ae4216ab39f033dabe33fdff", "publishedAt": "2021-10-19T20:56:44Z", "content": "NASA and Boeing provided an update on the beleaguered Starliner capsule Tuesday, confirming that the earliest the spacecraft will fly will be sometime during the first half of next year. Starliner wa… [+2102 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Molecular interfaces as building blocks for innovative sensors and data storage devices - Phys.org", "description": "Molecular interfaces formed between metals and molecular compounds have enormous potential as building blocks for future opto-electronics and spin-electronics devices. Transition metal phthalocyanine and porphyrin complexes are promising components for such i…", "url": "https://phys.org/news/2021-10-molecular-interfaces-blocks-sensors-storage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/molecular-interfaces-f.jpg", "publishedAt": "2021-10-19T20:32:56Z", "content": "Molecular interfaces formed between metals and molecular compounds have enormous potential as building blocks for future opto-electronics and spin-electronics devices. Transition metal phthalocyanine… [+4310 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "8-year-old Alagoas may become the world's youngest asteroid hunter - 10/19-2021 - science - brytfmonline.com", "description": "At the age of two, Nicole Oliveira Simio, of Alagoas, asked her mother for a...", "url": "https://www.brytfmonline.com/8-year-old-alagoas-may-become-the-worlds-youngest-asteroid-hunter-10-19-2021-science/", "urlToImage": null, "publishedAt": "2021-10-19T18:43:55Z", "content": "At the age of two, Nicole Oliveira Simio, of Alagoas, asked her mother for a star, but she was not just a toy star, but wanted the one she saw in the sky, the family recalls.\r\nThe universe’s fascinat… [+4137 chars]"}, {"source": {"id": null, "name": "News-Daily.com"}, "author": "Ashley Strickland, CNN", "title": "A ray gun-like device helps scientists see plants in a different light - News-Daily.com", "description": "Scientists are aiming little ray gun-like devices, called leaf clips, at plants in an attempt to better understand biodiversity as environments respond to the climate crisis.", "url": "https://www.news-daily.com/news/a-ray-gun-like-device-helps-scientists-see-plants-in-a-different-light/article_02a192ac-bd5b-5e08-b962-5b60091929fb.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/custom/image/c66199c4-9f43-11e5-bb6f-171943133c1c.jpg", "publishedAt": "2021-10-19T18:33:25Z", "content": "Scientists are aiming little ray gun-like devices, called leaf clips, at plants in an attempt to better understand biodiversity as environments respond to the climate crisis.\r\nNot unlike the tricorde… [+5598 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Have Found a Way To “See” Single Cells Using Sound - SciTechDaily", "description": "If you are a researcher who wants to see how just a few cells in an organism are behaving, it is no simple task. The human body contains approximately 37 trillion cells; the fruit fly flitting around the overripe bananas on your counter might have 50,000 cell…", "url": "https://scitechdaily.com/scientists-have-found-a-way-to-see-single-cells-using-sound/", "urlToImage": "https://scitechdaily.com/images/Seeing-Single-Cells-With-Sound.jpg", "publishedAt": "2021-10-19T18:31:31Z", "content": "ByCalifornia Institute of TechnologyOctober 19, 2021\r\nCredit: Barth van Rossum for Caltech\r\nIf you are a researcher who wants to see how just a few cells in an organism are behaving, it is no simple … [+7257 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Weizmann Institute of Science joins giant Mag - EurekAlert", "description": "The Giant Magellan Telescope welcomes the Weizmann Institute of Science into its international consortium, joining thirteen members from five countries.", "url": "https://www.eurekalert.org/news-releases/931968", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/814a50c0-6ef4-49e1-8de0-10fabccdfb79/Rendition/thumbnail/Content/Public", "publishedAt": "2021-10-19T18:03:41Z", "content": "video: The Giant Magellan Telescope welcomes the Weizmann Institute of Science into its international consortium, joining thirteen universities and research institutions from five different countries… [+4283 chars]"}, {"source": {"id": null, "name": "SETI Institute"}, "author": null, "title": "Percy Images Confirm Jezero Crater as Ancient Lake - SETI Institute", "description": "It feels like just yesterday that I spent several hours covering the landing of the Perseverance rover on Mars with my colleagues over at the SETI Institute. In fact, Percy touched down way back in February, over seven months ago. And at the same time, we’ve …", "url": "https://www.seti.org/percy-images-confirm-jezero-crater-ancient-lake", "urlToImage": "https://www.seti.org/sites/default/files/2021-10/Mars-1024px.jpg", "publishedAt": "2021-10-19T17:46:44Z", "content": "It feels like just yesterday that I spent several hours covering the landing of the Perseverance rover on Mars with my colleagues over at the SETI Institute. In fact, Percy touched down way back in F… [+2559 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Jessica Hall", "title": "All Is Not Well With NASA's Lucy Spacecraft - ExtremeTech", "description": "An unwelcome October surprise from an unexpected quadrant: NASA's Lucy spacecraft is having trouble -- but it's already been launched.", "url": "https://www.extremetech.com/extreme/328353-all-is-not-well-with-nasas-lucy-spacecraft", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2021/10/Lucy-in-the-sky-with-rocks-1-640x354.jpg", "publishedAt": "2021-10-19T17:39:00Z", "content": "NASAs Goddard Space Flight Center/Conceptual Image Lab/Adriana Gutierrez\r\nNASA’s Lucy spacecraft is having difficulties with its solar panels. The spacecraft launched on Oct. 16th without incident, a… [+3519 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Humans Are Actually Terrible at Navigating Cities, Study of Over 14,000 People Shows - ScienceAlert", "description": "We design cities. We live in them. We work in them, and we have fun in them. But boy howdy are we bad at getting around them.", "url": "https://www.sciencealert.com/humans-are-actually-terrible-at-navigating-cities", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/man-city_1024.jpg", "publishedAt": "2021-10-19T17:01:45Z", "content": "We design cities. We live in them. We work in them, and we have fun in them. But boy howdy are we bad at getting around them.\r\nAccording to mobile phone data from over 14,000 people living their dail… [+4295 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Solar System May Be Surrounded by Tunnel-Like Magnetic Structure, Astronomers Say - Sci-News.com", "description": "The North Polar Spur and the Fan Region are two bright, large-scale radio structures that are seen on opposite sides of the sky.", "url": "http://www.sci-news.com/astronomy/solar-system-tunnel-like-magnetic-structure-10178.html", "urlToImage": "http://cdn.sci-news.com/images/2021/10/image_10178_1-Solar-System-Tunnel.jpg", "publishedAt": "2021-10-19T15:53:09Z", "content": "The North Polar Spur and the Fan Region are two bright, large-scale radio structures that are seen on opposite sides of the sky. According to new research, they are actually connected and are made of… [+2448 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Paul Rincon - Science editor, BBC News website", "title": "Orion: Nasa's Moon ship ready to be attached to rocket - Yahoo News Australia", "description": "The Orion spacecraft is ready to be placed on top of a rocket that will send it towards the Moon.", "url": "https://news.yahoo.com/orion-nasas-moon-ship-ready-150625007.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QP0hi2uespTbIveWIYhXRg--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/256b6cf7a4ee14d3720938e456994bc7", "publishedAt": "2021-10-19T15:17:07Z", "content": "Nasa's next-generation spaceship is ready to be attached to a rocket that should send it to the Moon this year or in early 2022.\r\nOn Monday, the Orion spacecraft was moved between buildings at Florid… [+1769 chars]"}, {"source": {"id": null, "name": "WJSU"}, "author": "Joe Hernandez", "title": "The Orionid Meteor Shower peaks this week, but it might not be much of a show - WJSU", "description": "The Orionid meteor shower, which appears in the night sky around this time each year, is predicted to peak Thursday morning, according to NASA. But don&", "url": "https://www.wjsu.org/post/orionid-meteor-shower-peaks-week-it-might-not-be-much-show", "urlToImage": "https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202110/1047260444.jpg", "publishedAt": "2021-10-19T14:10:11Z", "content": "The Orionid meteor shower, which appears in the night sky around this time each year, is predicted to peak Thursday morning, according to NASA.\r\nBut don't get your hopes up for a cosmic show just yet… [+1338 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Science is Looking at Ways to Self-Heal Cellphones - AZoNano", "description": "Almost all cellphone users experience a cracked screen at some point. This bothersome issue can be disappointing and is expensive to fix.", "url": "https://www.azonano.com/news.aspx?newsID=38194", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38194_16346473296545117.jpg", "publishedAt": "2021-10-19T13:49:00Z", "content": "Almost all cellphone users experience a cracked screen at some point. This frustrating issue can be disappointing and is expensive to fix.\r\nTwinkal Patel: “Our goal is to not compromise the toughness… [+3178 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Harry Cliff", "title": "New physics: latest results from Cern further boost tantalising evidence - The Conversation UK", "description": "Particle physicists might be on the brink of a major breakthrough.", "url": "https://theconversation.com/new-physics-latest-results-from-cern-further-boost-tantalising-evidence-170133", "urlToImage": "https://images.theconversation.com/files/426951/original/file-20211018-57123-1i3a8rx.jpg?ixlib=rb-1.1.0&rect=0%2C174%2C1599%2C799&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-10-19T11:04:14Z", "content": "The Large Hadron Collider (LHC) sparked worldwide excitement in March as particle physicists reported tantalising evidence for new physics - potentially a new force of nature. Now, our new result, ye… [+6217 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Researchers determine optimum pressure to improve the performance of lithium metal batteries - Nanowerk", "description": "A team of materials scientists  and chemists has determined the proper stack pressure that lithium metal batteries need to be subjected to during battery operation in order to produce optimal performance.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=58944.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id58944.jpg", "publishedAt": "2021-10-19T07:30:38Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Astronomers see white dwarf 'switch on and off' for first time - Nanowerk", "description": "Astronomers have used a planet-hunting satellite to see a white dwarf abruptly switching on and off for the first time.", "url": "https://www.nanowerk.com/news2/space/newsid=58940.php", "urlToImage": "https://www.nanowerk.com/news2/space/id58940.jpg", "publishedAt": "2021-10-19T06:54:33Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers May Have Just Found Evidence of The Very First Stars in Our Universe - ScienceAlert", "description": "Back when the Universe was young – around 13.7 billion years ago – the first stars formed in the soupy darkness, setting the cosmos alight.", "url": "https://www.sciencealert.com/astronomers-may-have-just-found-evidence-of-the-first-stars-in-the-universe", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/sculptor_1024.jpg", "publishedAt": "2021-10-19T06:27:21Z", "content": "Back when the Universe was young around 13.7 billion years ago the first stars formed in the soupy darkness, setting the cosmos alight.\r\nWe've yet to find any of these very first stars, known as Popu… [+4133 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "The meteorite fell on the woman's bed while she was asleep - The Press Stories", "description": "The meteorite fell on the woman's bed while she was asleep The Press Stories", "url": "https://presstories.com/2021/10/19/the-meteorite-fell-on-the-womans-bed-while-she-was-asleep/", "urlToImage": null, "publishedAt": "2021-10-19T06:09:28Z", "content": "A woman in Canada is said to have been awakened by a meteorite falling through the roof and falling into bed while she was asleep.\r\nAccording to The New York TimesRuth Hamilton, 66, was sleeping well… [+2268 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Anuj Pant", "title": "Dog-sized sea scorpions roamed ancient sea floors in south China as ‘top predators’, study shows - Yahoo Singapore News", "description": "The creature was a large arthropod with a ‘sharp weapon’", "url": "https://www.independent.co.uk/news/science/south-china-dog-sized-scorpions-b1940838.html", "urlToImage": "https://static.independent.co.uk/2021/10/19/06/W020211009417671943767.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-10-19T06:04:20Z", "content": "Large sea scorpions, roughly the size of dogs, could have been one of the top predators to roam the sea floor of south China more than 400 million years ago, a study has found.\r\nThe remains of the se… [+2529 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Tara Conlan", "title": "Earth’s demise could rid galaxy of meaning, warns Brian Cox ahead of Cop26 - The Guardian", "description": "Unique events that led to civilisation mean its demise could ‘eliminate meaning in galaxy for ever’", "url": "https://amp.theguardian.com/science/2021/oct/19/earths-demise-could-rid-galaxy-of-meaning-warns-brian-cox-ahead-of-cop26", "urlToImage": "https://i.guim.co.uk/img/media/0cb7080cb3af2650de38e024e97a1952c9d057ce/0_323_4928_2957/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0f81f86a586dfa448dd0d84e6e31e0c", "publishedAt": "2021-10-19T05:01:00Z", "content": "Humans might be the only intelligent beings in our galaxy, so destroying our civilisation could be a galactic disaster, Prof Brian Cox has warned leaders in the run-up to Cop26.\r\nSpeaking at the laun… [+3622 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers reveal the mechanism of artificial chromosome formation in C. elegans' embryos - News-Medical.net", "description": "A research team led by Dr Karen Wing Yee YUEN, Associate Professor from the School of Biological Sciences at the University of Hong Kong (HKU), revealed the mechanism of artificial chromosome (AC) formation in the embryos of the model organism Caenorhabditis …", "url": "https://www.news-medical.net/news/20211018/Researchers-reveal-the-mechanism-of-artificial-chromosome-formation-in-C-elegans-embryos.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gene-620x480.jpg", "publishedAt": "2021-10-19T02:45:00Z", "content": "A research team led by Dr Karen Wing Yee YUEN, Associate Professor from the School of Biological Sciences at the University of Hong Kong (HKU), revealed the mechanism of artificial chromosome (AC) fo… [+6854 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "This asteroid was closer to Earth than the Moon — and you didn’t even notice - Play Crazy Game", "description": "An asteroid passed through Earth's orbit last Sunday (17) and was a little closer than most space rocks approaching our planet. They generally remain farther away than the Moon, but asteroid 2021 TG14 has passed 250,000 km — our natural satellite orbits the E…", "url": "https://playcrazygame.com/2021/10/19/this-asteroid-was-closer-to-earth-than-the-moon-and-you-didnt-even-notice/", "urlToImage": "https://t.ctcdn.com.br/Tg_3kdwOpxRl9jL7B7Id7AeRa-A=/720x405/smart/i459681.jpeg", "publishedAt": "2021-10-19T00:40:41Z", "content": "An asteroid passed through Earth’s orbit last Sunday (17) and was a little closer than most space rocks approaching our planet. They generally remain farther away than the Moon, but asteroid 2021 TG1… [+1501 chars]"}, {"source": {"id": null, "name": "Our Community Now at Maryland"}, "author": null, "title": "Powerful new technique allows scientists to study how proteins change shape inside cells - Our Community Now at Maryland", "description": "Understanding how proteins bend, twist, and shape-shift as they go about their work in cells is enormously important for understanding normal biology and diseases. But a deep understanding of protein dynamics has generally been elusive due to the lack of good…", "url": "https://ourcommunitynow.com/wellness/powerful-new-technique-allows-scientists-to-study-how-proteins-change-shape-inside-cells", "urlToImage": "https://s3.amazonaws.com/ocn-media/785e2cf5-2100-44c2-9755-e164068a8fb1.jpeg", "publishedAt": "2021-10-19T00:12:25Z", "content": null}, {"source": {"id": null, "name": "The Times"}, "author": "Paul Simons", "title": "No solar power needed for homegrown northern lights - The Times", "description": "Auroras have lit up night skies recently in northern Scotland, where they are called “the merry dancers”, and photos on BBC Weather Watchers showed magical gree", "url": "https://www.thetimes.co.uk/article/no-solar-power-needed-for-homegrown-northern-lights-sg8tczlft", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F9e5eca20-3027-11ec-820f-e2be9b2cb5fd.jpg?crop=5400%2C3037%2C0%2C281&resize=1200", "publishedAt": "2021-10-18T23:01:00Z", "content": "Auroras have lit up night skies recently in northern Scotland, where they are called the merry dancers, and photos on BBC Weather Watchers showed magical green and purple displays, with beams of ligh… [+551 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "Look: NASA photo reveals unusual supernova event - Inverse", "description": "A new image by Chandra reveals a rare supernova remanent created by a white dwarf accumulating material from another star until it explodes.", "url": "https://www.inverse.com/science/look-nasa-photo-reveals-unusual-supernova-event", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/10/18/350ddc6e-5454-43a4-8e0e-da9daf15694c-c4c4bdc6-b542-410c-a995-99574007db8b-g344.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-10-18T23:00:25Z", "content": "The universe often behaves in human-like ways. \r\nGluttonous stars can swallow too much material and end up exploding in a rather dramatic fashion.\r\nNASAs Chandra X-ray observatory recently caught a g… [+3109 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "The US is developing a lunar internet. NASA wants to embrace the moon with Wi-Fi - The Goa Spotlight", "description": "", "url": "https://thegoaspotlight.com/2021/10/18/the-us-is-developing-a-lunar-internet-nasa-wants-to-embrace-the-moon-with-wi-fi/", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_russian/07AA/production/_121126910_4e7d5c4b-6541-4a1d-bcbe-8dc4ff808c18.jpg", "publishedAt": "2021-10-18T22:10:37Z", "content": "8 hours ago\r\nPhoto author, NASA\r\nPhoto caption, American astronauts not only plan to return to the moon, but also do it with fundamentally new equipment.\r\nThe exploration of the moon is one of the pr… [+3320 chars]"}, {"source": {"id": null, "name": "Ferret.com.au"}, "author": null, "title": "Australia to rove with NASA to the Moon - Ferret", "description": "Australia will follow NASA to the Moon, with an Australian made rover set to be included in a future mission, backed by $50 million in government funding.", "url": "https://www.ferret.com.au/?p=31076", "urlToImage": "https://www.ferret.com.au/wp-content/uploads/2021/10/49D598DE-0DED-4137-9D55-5B5614E7F436_4_5005_c.jpeg", "publishedAt": "2021-10-18T22:08:34Z", "content": "Australia will accompany NASA to the Moon, with an Australian made rover set to be included in a future mission. This will be backed by $50 million in funding from the federal governments Trailblazer… [+3325 chars]"}, {"source": {"id": null, "name": "Devonportonlinenews.com.au"}, "author": "Online News Publisher", "title": "Humans are crappy navigators because the brain is lazy, new research finds - Techradar - Devonport Online News", "description": "Brains don't care about the shortest path, just the easiest to follow", "url": "https://devonportonlinenews.com.au/humans-are-crappy-navigators-because-the-brain-is-lazy-new-research-finds-techradar/", "urlToImage": "https://sdrjix3pzmib.compat.objectstorage.ap-sydney-1.oraclecloud.com/devonportonlinenews-com-au/uploads/2021/10/eea197bb-de76-5805-a0b1-d7375286c4e0.jpg", "publishedAt": "2021-10-18T21:02:42Z", "content": "There’s a good reason why humans had to invent maps to find the shortest path between two points: our brains couldn’t be bothered to figure it out on its own.New research from the Massachusetts Insti… [+95 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Argonne-led research team highlighted in spec - EurekAlert", "description": "A team led by Argonne and UChicago have published an article in Nature Reviews Materials that lays out a blueprint for solid-state spin defects in materials for use in qubits.", "url": "https://www.eurekalert.org/news-releases/931984", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2021-10-18T20:48:45Z", "content": "A set of guidelines that describes the use and development of a promising class of quantum materials is featured on the cover of this month’s Nature Review Materials.\r\nIn an article featured on the c… [+5977 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "NASA, Roscosmos work together to define brief failure at International Space Station - TASS", "description": "Within 30 minutes, flight controllers regained attitude control of the space station, which is now in a stable configuration", "url": "https://tass.com/science/1350345", "urlToImage": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20211016/1336731.jpg", "publishedAt": "2021-10-16T00:31:36Z", "content": "NEW YORK, October 16. /TASS/. The US National Aeronautics and Space Administration (NASA) and Russia’s space agency Roscosmos work closely to find the cause behind a brief incident with the Internati… [+3077 chars]"}]}