{"status": "ok", "totalResults": 49, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Significant insights into the development of the vertebrate head - Tech Explorist", "description": "Cranial neural crest-derived cells (CNCCs) are a vertebrate-specific population, often referred to as the fourth germ layer. They have extraordinary", "url": "https://www.techexplorist.com/significant-insights-development-vertebrate-head/44002/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/01/adult_CNCC_head.jpg", "publishedAt": "2022-01-11T05:54:30Z", "content": "Cranial neural crest-derived cells (CNCCs) are a vertebrate-specific population, often referred to as the fourth germ layer. They have extraordinary potential to form diverse cell types. In addition … [+3395 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": "", "title": "Aussie researchers unearth trove of invaluable fossils - Xinhua", "description": "", "url": "http://www.xinhuanet.com/english/asiapacific/20220111/f020196a4e3e4c7abf00b7c39b1f62e9/c.html", "urlToImage": null, "publishedAt": "2022-01-11T03:19:00Z", "content": "SYDNEY, Jan. 11 (Xinhua) -- A team of Australian and international palaeontologists has discovered thousands of fossilized animals and plants including previously unknown species.\r\n The team's findin… [+2140 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "The discovery could offer a route to smaller, faster electronic devices — ScienceDaily - newsconcerns", "description": "In the particle world, sometimes two is better than one. Take, for instance, electron pairs. When two electrons are bound together, they can glide through a material without friction, giving the material special superconducting properties. Such paire", "url": "https://newsconcerns.com/the-discovery-could-offer-a-route-to-smaller-faster-electronic-devices-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-11T02:43:27Z", "content": "In the particle world, sometimes two is better than one. Take, for instance, electron pairs. When two electrons are bound together, they can glide through a material without friction, giving the mate… [+6417 chars]"}, {"source": {"id": null, "name": "Greekreporter.com"}, "author": null, "title": "The Ten Most Fascinating Discoveries About Human Ancestors in 2021 - Greek Reporter", "description": "The ten most fascinating things discovered about our human ancestors were not difficult to decide this past year, which was a banner year.", "url": "https://greekreporter.com/2022/01/11/discoveries-human-ancestors-2021/", "urlToImage": "https://greekreporter.com/wp-content/uploads/2022/01/Hominid-brains-credit-Ponce-de-Leon-Zollikofer-University-of-Zurich.jpeg", "publishedAt": "2022-01-11T02:30:22Z", "content": "Brains of some of our human ancestors, recreated according to the shape of skulls that were discovered in Georgia in 2021. Credit: M. Ponce de Leon/Ch. Zollikofer/University of Zurich\r\nThe ten most f… [+9486 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers create a DNA-based fluorescent nanoantenna to monitor the motions of proteins - News-Medical.net", "description": "Researchers at Université de Montréal have created a nanoantenna to monitor the motions of proteins. Reported this week in Nature Methods, the device is a new method to monitor the structural change of proteins over time – and may go a long way to helping sci…", "url": "https://www.news-medical.net/news/20220110/Researchers-create-a-DNA-based-fluorescent-nanoantenna-to-monitor-the-motions-of-proteins.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/78486183-620x480.jpg", "publishedAt": "2022-01-11T02:17:00Z", "content": "Researchers at Université de Montréal have created a nanoantenna to monitor the motions of proteins. Reported this week in Nature Methods, the device is a new method to monitor the structural change … [+3447 chars]"}, {"source": {"id": null, "name": "KQED"}, "author": null, "title": "Thousands of Asteroids Orbit Near Earth. NASA's Next-Gen Spotter Helps Protect Us - KQED", "description": "The new mission to spot near-Earth asteroids brings in more information about their orbits and picks up some tasks humans have had to do.", "url": "https://www.kqed.org/science/1978197/thousands-of-asteroids-orbit-near-earth-nasas-next-gen-spotter-helps-protect-us", "urlToImage": "https://ww2.kqed.org/app/uploads/sites/35/2022/01/2200Neos-CNEOS-jpl.jpg", "publishedAt": "2022-01-11T02:09:12Z", "content": "For example, it could not account for changes in an asteroid’s trajectory from influences such as heating effects by sunlight; these are nongravitational influences that cause small but constant devi… [+4183 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "‘Mini’ monster black hole could hold clues to giant’s growth - newsconcerns", "description": "Credit: X-ray: NASA/CXC/Dartmouth Coll./J. Parker & R. Hickox; Optical/IR: Pan-STARRS                        The discovery of a supermassive black hole in a relatively small galaxy", "url": "https://newsconcerns.com/mini-monster-black-hole-could-hold-clues-to-giants-growth/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/mrk-462-mini-monster-b.jpg", "publishedAt": "2022-01-11T01:47:31Z", "content": "The discovery of a supermassive black hole in a relatively small galaxy could help astronomers unravel the mystery surrounding how the very biggest black holes grow.\r\nResearchers used NASA’s Chandra … [+4198 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "Axiom Space: Launch schedule and timeline for private space station - Inverse", "description": "Axiom Space has bold plans to send private citizens into space, as a stepping stone to developing a complete private space station.", "url": "https://www.inverse.com/innovation/axiom-space-details", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/1/10/610def1d-c5a4-4391-8527-9f963a57dff5-2021-02-10_axiom_2-crew_quarter_interior.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-01-11T01:00:25Z", "content": "Axiom Space could\r\n create the successor to humanitys most iconic space station. The Houston-based firm plans to fly civilians on a series of private missions to the International Space Station. Thes… [+6517 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://jpl.nasa.gov/", "title": "Radar Observations of Asteroid 4660 Nereus - Jet Propulsion Laboratory", "description": "NASA's Jet Propulsion Laboratory, the leading center for robotic exploration of the solar system.", "url": "https://www.jpl.nasa.gov/images/pia24566-radar-observations-of-asteroid-4660-nereus", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/images/jpegPIA24566.width-1024.jpg", "publishedAt": "2022-01-11T00:56:51Z", "content": "Click here for animation\r\nThese images and animation represent NASA radar observations of 4660 Nereus on Dec. 10, 2021, before the asteroid's close approach on Dec. 11, when it came within 2.5 millio… [+2092 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "BTC Peers", "title": "Cabot Guns Unveils its Latest Creation: A $250,000 One-of-a-kind Moonshoot Pistol and Mints NFT on OpenSea By BTC Peers - Investing.com", "description": "Cabot Guns Unveils its Latest Creation: A $250,000 One-of-a-kind Moonshoot Pistol and Mints NFT on OpenSea", "url": "https://www.investing.com/news/cryptocurrency-news/cabot-guns-unveils-its-latest-creation-a-250000-oneofakind-moonshoot-pistol-and-mints-nft-on-opensea-2735244", "urlToImage": "https://i-invdn-com.investing.com/news/Cryptocurrencies_800x533_L_1556444856.jpg", "publishedAt": "2022-01-10T23:30:00Z", "content": "The Moonshoot portrays a unique view of the solar system from the angle of the lunar surface, following the careful placement of lunar meteorite, small diamonds, rubies, sapphires, and gold inlay. Th… [+1398 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Researchers find low oxygen and sulfide in the oceans played greater role in ancient mass exteinction - newsconcerns", "description": "Seth Young's research group collecting and describing limestone samples from a field site in the Roberts Mountains, Nevada. Credit: Anders Lindskog/Florida State University", "url": "https://newsconcerns.com/researchers-find-low-oxygen-and-sulfide-in-the-oceans-played-greater-role-in-ancient-mass-exteinction/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-find-low-o.jpg", "publishedAt": "2022-01-10T23:27:33Z", "content": "Florida State University researchers have new insight into the complicated puzzle of environmental conditions that characterized the Late Ordovician Mass Extinction (LOME), which killed about 85% of … [+4827 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "TAMMY SEWELL", "title": "Astronomers capture surprising images of the Flame Nebula - OI Canadian", "description": "Mysterious and surprising audio: this is what a nebula sounds like 1:02 (CNN) - The Flame Nebula is one of the many wonders to be found in the constellation Orion, and astronomers have now caught a ne", "url": "https://oicanadian.com/astronomers-capture-surprising-images-of-the-flame-nebula/", "urlToImage": "https://cnnespanol.cnn.com/wp-content/uploads/2022/01/220106132829-02-flame-nebula-exlarge-169.jpg?quality=100&strip=info", "publishedAt": "2022-01-10T23:10:36Z", "content": "Mysterious and surprising audio: this is what a nebula sounds like 1:02\r\n(CNN) – The Flame Nebula is one of the many wonders to be found in the constellation Orion, and astronomers have now caught a … [+2790 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "B. David Zarley", "title": "Astronomers have found the biggest group of rogue planets yet - Freethink", "description": "Using ground telescopes and satellite observations taken over decades, researchers have identified the largest number of wandering rogue planets yet.", "url": "https://www.freethink.com/space/rogue-planets-2", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/01/the-biggest-group-of-rogue-planets-yet_Web.jpg?resize=1200,630", "publishedAt": "2022-01-10T23:00:00Z", "content": "Rogue planets wander the spaceways, untethered from any star celestial bodies comparable to planets like those in our own solar system, but lost in interstellar space.\r\nNow, a team of astronomers has… [+4061 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "The Early Earth was Really Horrible for Life - Universe Today", "description": "Earth may have been exposed to more UV in the past than thought. That radiation is deadly to life, but also may have spurred evolution on.", "url": "https://www.universetoday.com/153972/the-early-earth-was-really-horrible-for-life/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/07/The_Earth_seen_from_Apollo_17.jpg", "publishedAt": "2022-01-10T21:24:29Z", "content": "Earth has had a long and complex history since its formation roughly 4.5 billion years ago. Initially, it was a molten ball, but eventually, it cooled and became differentiated. The Moon formed from … [+8326 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Steve Nadis", "title": "Researcher develops new tool for understanding hard computational problems that appear intractable - Phys.org", "description": "The notion that some computational problems in math and computer science can be hard should come as no surprise. There is, in fact, an entire class of problems deemed impossible to solve algorithmically. Just below this class lie slightly \"easier\" problems th…", "url": "https://phys.org/news/2022-01-tool-hard-problems-intractable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/tackling-hard-computat.jpg", "publishedAt": "2022-01-10T20:55:34Z", "content": "The notion that some computational problems in math and computer science can be hard should come as no surprise. There is, in fact, an entire class of problems deemed impossible to solve algorithmica… [+8445 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carey Sargent", "title": "Equivariant representations for molecular Hamiltonians and N-center atomic-scale properties - Phys.org", "description": "In the fields of chemistry and materials, most successful, widely used machine learning schemes introduced over the last decade aim to model molecular energies or interatomic potentials. Accordingly, the representations used to map atomic configurations into …", "url": "https://phys.org/news/2022-01-equivariant-representations-molecular-hamiltonians-n-center.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/equivariant-representa.jpg", "publishedAt": "2022-01-10T20:45:30Z", "content": "In the fields of chemistry and materials, most successful, widely used machine learning schemes introduced over the last decade aim to model molecular energies or interatomic potentials. Accordingly,… [+6134 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists reveal ultrafast melting dynamics in matter heated to extreme temperatures - Phys.org", "description": "Ordinary matter behaves very differently when subjected to extreme temperatures and pressures, such as that inside stellar and planetary cores. Conventional rules of condensed matter physics and plasma physics are not applicable in such scenarios. In particul…", "url": "https://phys.org/news/2022-01-scientists-reveal-ultrafast-dynamics-extreme.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/scientists-from-the-gi.jpg", "publishedAt": "2022-01-10T20:39:57Z", "content": "Ordinary matter behaves very differently when subjected to extreme temperatures and pressures, such as that inside stellar and planetary cores. Conventional rules of condensed matter physics and plas… [+3503 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Will this new superpower molecule revolutionize science? - Science Daily", "description": "Researchers report the creation of an artificial molecule with superpowers. It has the potential to revolutionize nanotechnology -- and it also explains one of Nature's intriguing enigmas; why do we have a right hand and a left hand? The researchers describe …", "url": "https://www.sciencedaily.com/releases/2022/01/220110103257.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-10T19:08:25Z", "content": "When scientists discovered DNA and learned how to control it, not only science but society was revolutionized. Today researchers and the medical industry routinely create artificial DNA structures fo… [+3617 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "This ‘Nearby’ Star’s Eruption Could Endanger The Future of Life on Earth - Wonderful Engineering", "description": "Advertisement The sun is a predictable and stable star as it is good for the planets like ours that lie in the so-called Goldilocks zone where temperatures are not too hot or not too cold for the evolution of human-like life to take place.  The sun’s core exc…", "url": "https://wonderfulengineering.com/this-nearby-stars-eruption-could-endanger-the-future-of-life-on-earth/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2021/12/https___blogs-images.forbes.com_startswithabang_files_2019_03_NASA-Dana-Berry.jpg", "publishedAt": "2022-01-10T18:59:58Z", "content": "The sun is a predictable and stable star as it is good for the planets like ours that lie in the so-called Goldilocks zone where temperatures are not too hot or not too cold for the evolution of huma… [+2915 chars]"}, {"source": {"id": null, "name": "Watchtime.com"}, "author": "https://www.facebook.com/rruegger", "title": "A Horological Tribute to the Master of Light: Vacheron Constantin Les Cabinotiers Westminster Sonnerie - Tribute to Johannes Vermeer - Watchtime.com", "description": "Vermeer’s most famous painting is now part of a bespoke single-piece edition. The Les Cabinotiers Westminster Sonnerie from Vacheron Constantin is powered by a new 806-part manual winding movement, regulated by a tourbillon and comprising grande and petite so…", "url": "https://www.watchtime.com/featured/a-horological-tribute-to-the-master-of-light-vacheron-constantin-les-cabinotiers-westminster-sonnerie-tribute-to-johannes-vermeer/", "urlToImage": "https://www.watchtime.com/wp-content/uploads/2022/01/Vacheron_Constantin_Les_Cabinotiers_Vermeer_FI.jpg", "publishedAt": "2022-01-10T17:53:22Z", "content": "Vermeers most famous painting is now part of a bespoke single-piece edition. The Les Cabinotiers Westminster Sonnerie from Vacheron Constantin is powered by a new 806-part manual winding movement, re… [+8723 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Astronomers identify potential clue to reinonization of universe — ScienceDaily - newsconcerns", "description": "About 400,000 years after the universe was created began a period called \"The Epoch of Reionization.\"During this time, the once hotter universe began to cool and matter clumped together, forming the first stars and galaxies. As these stars and galaxi", "url": "https://newsconcerns.com/astronomers-identify-potential-clue-to-reinonization-of-universe-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-10T17:09:31Z", "content": "About 400,000 years after the universe was created began a period called “The Epoch of Reionization.”During this time, the once hotter universe began to cool and matter clumped together, forming the … [+1873 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Unexpected benefits from food competitors: When laying their eggs, female hawkmoths rather share a host plant with competitors in order to escape from parasitic wasps - Science Daily", "description": "A research team has found that gravid tobacco hawkmoths (Manduca sexta) show an unusual preference for Datura plants that are already infested with leaf beetles when laying their eggs. The beetles and their larvae actually compete with tobacco hornworms, the …", "url": "https://www.sciencedaily.com/releases/2022/01/220110114143.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-10T17:06:09Z", "content": "By choosing the best possible oviposition site, many insects set the course for the best possible development of their offspring: There should be enough food available and the larvae that hatch from … [+4810 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Dolphins Have a Fully Functional Clitoris, Study Finds - Gizmodo Australia", "description": "Humans and dolphins have even more in common than we might have thought, new research suggests. Biologists say they’ve found...", "url": "https://www.gizmodo.com.au/2022/01/dolphins-have-a-fully-functional-clitoris-study-finds/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/11/4eb6bba98595fe59f54c29380d77e996-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-01-10T16:23:00Z", "content": "Humans and dolphins have even more in common than we might have thought, new research suggests. Biologists say theyve found clear anatomical evidence that female dolphins have a fully functional clit… [+4251 chars]"}, {"source": {"id": null, "name": "Retailcrowd.co.uk"}, "author": "Truman Colon", "title": "Hungarian astronomer discovered the first comet of the year - Retail Crowd", "description": "The first comet of 2022 was discovered in Hungary, MTI writes. Luminary Krisztián Sárneczky, an...", "url": "https://www.retailcrowd.co.uk/hungarian-astronomer-discovered-the-first-comet-of-the-year-2/", "urlToImage": "https://s.24.hu/app/uploads/2022/01/gettyimages-978042836-e1641823675778-1024x576.jpg", "publishedAt": "2022-01-10T16:12:04Z", "content": "The first comet of 2022 was discovered in Hungary, MTI writes. Luminary Krisztián Sárneczky, an employee of the ELKH Center for Astronomy and Earth Sciences (CSFK) noted that the expert had found hun… [+3188 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Catalyst surface analysed at atomic resolution - Science Daily", "description": "A research team has visualized the three-dimensional structure of the surface of catalyst nanoparticles at atomic resolution. This structure plays a decisive role in the activity and stability of the particles. The detailed insights were achieved with a combi…", "url": "https://www.sciencedaily.com/releases/2022/01/220110103227.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-10T16:00:16Z", "content": "Researchers from the Ruhr-Universität Bochum, the University of Duisburg-Essen and the Max Planck Institute for Chemical Energy Conversion in Mülheim an der Ruhr cooperated on the project as part of … [+2120 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Sonia Fernandez-UCSB", "title": "Send tardigrades on 'wafercraft' into interstellar space? - Futurity: Research News", "description": "Scientists are contemplating launching tiny lifeforms like tardigrades into interstellar space. After traveling in suspended animation, they'd awaken at the destination.", "url": "https://www.futurity.org/tardigrades-interstellar-space-2679932-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/01/tardigrade_space_1600.jpg", "publishedAt": "2022-01-10T15:56:02Z", "content": "Scientists are contemplating launching tiny lifeforms like tardigrades into interstellar space.\r\n“The Apollo moon voyages were among the most momentous events in my life and contemplating them still … [+9269 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ryan Randall", "title": "Breakthrough metals research has implications for the metal casting industry - Phys.org", "description": "Florida Tech professor emeritus Martin Glicksman's latest metals/materials science research has implications for the metal casting industry, but it also has a profound personal connection inspired by two late colleagues.", "url": "https://phys.org/news/2022-01-breakthrough-metals-implications-metal-industry.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/breakthrough-metals-re.jpg", "publishedAt": "2022-01-10T15:23:13Z", "content": "Florida Tech professor emeritus Martin Glicksman's latest metals/materials science research has implications for the metal casting industry, but it also has a profound personal connection inspired by… [+4748 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Simulated Image Shows How Roman Could Expand on Hubble's Deepest View - NASA", "description": "A team of astrophysicists has created a simulated image that shows how the Nancy Grace Roman Space Telescope could conduct a mega-exposure similar to but far larger than Hubble’s celebrated Ultra Deep Field Image.", "url": "https://www.nasa.gov/feature/goddard/2022/simulated-image-shows-how-nasa-s-roman-could-expand-on-hubble-s-deepest-view/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/roman_sim_udf-3k.jpg", "publishedAt": "2022-01-10T15:06:01Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "This is Milky Way galaxy`s latest collision - WION", "description": "The universe has so many things going on that it is impossible to keep track of them all. Though we have taken leaps in developing new technology and are on the cusp of using the most powerful telescope ever built (James Webb), it is not possible to simultane…", "url": "https://www.wionews.com/science/this-is-milky-way-galaxys-latest-collision-443672", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/06/18/145479-milky-way.jpg", "publishedAt": "2022-01-10T14:41:03Z", "content": "The universe has so many things going on that it is impossible to keep track of them all. Though we have taken leaps in developing new technology and are on the cusp of using the most powerful telesc… [+1373 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "An asteroid 3 times as tall as the Empire State Building will whiz by Earth next week - Inverse", "description": "Asteroid (7482) 1994 PC1 will fly by Earth on January 18 at a distance of 1.2 million miles.", "url": "https://www.inverse.com/science/1994-pc1-flyby-2022", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/1/4/ae2055ec-f8f8-480c-8f03-9923251a63ba-asteroide7482sormano-1.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-01-10T14:01:25Z", "content": "A huge asteroid\r\n is about to have a close, but perfectly safe, encounter with Earth.\r\nAsteroid (7482) 1994 PC1 is 1.1 kilometers in diameter thats two and a half times as tall as the Empire State Bu… [+3203 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble captures new image of a calm galaxy in constellation Aries - Devdiscourse", "description": "Read more about Hubble captures new image of a calm galaxy in constellation Aries on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1877781-hubble-captures-new-image-of-a-calm-galaxy-in-constellation-aries", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2022_17_52_22_0573829.jpg?width=920&format=jpeg", "publishedAt": "2022-01-10T13:48:10Z", "content": "A new image from the NASA/ESA Hubble Space Telescope captures the spectacular galaxy NGC 976 that lies around 150 million light-years from the Milky Way galaxy in the constellation Aries. Created usi… [+1753 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Deanna Hence", "title": "How the Earth's tilt creates short, cold January days - The Conversation AU", "description": "The winter solstice is past, but bundle up – January is when winter really arrives in many parts of the Northern Hemisphere.", "url": "https://theconversation.com/how-the-earths-tilt-creates-short-cold-january-days-173403", "urlToImage": "https://images.theconversation.com/files/439145/original/file-20220102-17-1b3kzl8.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C4163%2C2078&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-10T13:36:59Z", "content": "Above the equator, winter officially begins in December. But in many areas, January is when it really takes hold. Atmospheric scientist Deanna Hence explains the weather and climate factors that comb… [+6232 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "How much water is in Earth’s atmosphere? - Verve Times", "description": "Earth is often dubbed the \"blue planet\" due to its plentiful supply of water. Unlike on other bodies in the solar system — and likely beyond on exoplanets — liquid water is abundant on Earth, and its presence has allowed millions upon millions of spe", "url": "https://vervetimes.com/how-much-water-is-in-earths-atmosphere/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/k6698egXLw75t2kaZ5NJGg-1200-80.jpg", "publishedAt": "2022-01-10T12:43:45Z", "content": "Earth is often dubbed the “blue planet” due to its plentiful supply of water. Unlike on other bodies in the solar system and likely beyond on exoplanets\r\n liquid water is abundant on Earth\r\n, and its… [+4965 chars]"}, {"source": {"id": null, "name": "Marketresearchtelecast.com"}, "author": null, "title": "China plans missions to the south pole of the Moon - Market Research Telecast", "description": "The Chinese government has approved the fourth phase of its lunar exploration program, including the construction of a research station on the Moon over the…", "url": "https://marketresearchtelecast.com/china-plans-missions-to-the-south-pole-of-the-moon/240436/", "urlToImage": "https://marketresearchtelecast.com/wp-content/uploads/2022/01/China-plans-missions-to-the-south-pole-of-the-Moon.jpg", "publishedAt": "2022-01-10T11:32:40Z", "content": "The Chinese government has approved the fourth phase of its lunar exploration program, including the construction of a research station on the Moon over the next decade. Wu Yanhua, deputy director of… [+2451 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Stephanie Mlot", "title": "Debris Stops NASA's Perseverance Rover Collecting Rock Samples - PCMag AU", "description": "NASA must figure out how to safely remove a few pebbles from hundreds of millions of miles away.", "url": "https://au.pcmag.com/news/91817/debris-stops-nasas-perseverance-rover-collecting-rock-samples", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/d/debris-sto/debris-stops-nasas-perseverance-rover-collecting-rock-sample_z7w6.1200.jpg", "publishedAt": "2022-01-10T11:30:00Z", "content": "NASA's Perseverance rover called home for help after attempting to collect its latest Martian rock samples.\r\nFollowing a failed attempt in August, the device managed a month later to secure a core on… [+1950 chars]"}, {"source": {"id": null, "name": "DIYphotography"}, "author": "https://www.facebook.com/dunjadjudjic/", "title": "This magical photo of crescent moon was taken from the ISS with a Nikon D5 - DIYphotography", "description": "The ISS astronauts are good at many things, and photography is certainly one of them. NASA recently published a magical photo of a crescent moon, taken up there from the ISS using a Nikon D5. In the photo, you can see the crescent Moon hovering above an orbit…", "url": "https://www.diyphotography.net/this-magical-photo-of-crescent-moon-was-taken-from-the-iss-with-a-nikon-d5/", "urlToImage": "https://www.diyphotography.net/wp-content/uploads/2022/01/nasa-crescent-moon-iss-nikon-d5a-scaled.jpg", "publishedAt": "2022-01-10T11:18:59Z", "content": "The ISS astronauts are good at many things, and photography is certainly one of them. NASA recently published a magical photo of a crescent moon, taken up there from the ISS using a Nikon D5.\r\nIn the… [+1085 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Extremely metal-poor star stream discovered in Milky Way - Tech Explorist", "description": "The remnants of a star cluster whose stars share a uniquely low fraction of heavy elements.", "url": "https://www.techexplorist.com/extremely-metal-poor-star-stream-discovered-milky-way/43978/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/01/milky-way-illustration.jpg", "publishedAt": "2022-01-10T10:59:23Z", "content": "Stellar ejecta gradually enriches the gas out of which subsequent stars form. This creates the least chemically enhanced stellar systems direct fossils of structures formed in the early Universe.\r\nAn… [+3385 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Miguel Brown", "title": "Does the Gravitational Pull of the Sun and Moon Really Affect Activity on Earth? - Nature World News", "description": "The two orbs humans' glimpse in the horizon throughout the daytime and nighttime, have a greater impact on Planet's creatures and vegetation than anyone might well realize.", "url": "https://www.natureworldnews.com/articles/48831/20220110/gravitational-pull-sun-moon-activity-on-earth.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/57550/young-people-look-at-the-rare-sight-of-the-setting-sun.jpg", "publishedAt": "2022-01-10T10:50:16Z", "content": "The two orbs humans' glimpse in the horizon throughout the daytime and nighttime, have a greater impact on Planet's creatures and vegetation than anyone might well realize.\r\nGravitational Pull Affect… [+3764 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Steve Dent", "title": "Scientists observe a red supergiant going supernova for the first time - Yahoo Finance Australia", "description": "Astronomers have captured a red supergiant supernova explosion for the first time, gathering crucial new information about these dramatic events.", "url": "https://au.finance.yahoo.com/news/scientists-see-a-red-giant-star-go-supernova-for-the-first-time-104442583.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Vi08ylIzi0hr2xYtXk_CUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2022-01/86b61ff0-71fd-11ec-b7f7-531432b7a0da", "publishedAt": "2022-01-10T10:44:42Z", "content": "Despite the massive number of stars in the sky, spotting one in the throes of a supernova is still an incredibly rare event. Now, astronomers have captured a red supergiant before, during and after a… [+2138 chars]"}, {"source": {"id": null, "name": "CTech"}, "author": "Yafit Ovadia", "title": "TAU launches satellite to protect space systems against radiation | Ctech - CTech", "description": "The “COTS-Capsule” within the TauSat-3 is one of the 43 experiments that the next Israeli astronaut will test on his mission to the International Space Station next month, after it successfully docked on Sunday", "url": "https://www.calcalistech.com/ctech/articles/0,7340,L-3926853,00.html", "urlToImage": "https://images1.calcalist.co.il/PicServer3/2022/01/10/1160561/1-nanosat_tau-l.jpg", "publishedAt": "2022-01-10T09:45:33Z", "content": "Tel Aviv University recently launched the TauSat-3 satellite to space, which is designed to test a new technology for protecting space systems from cosmic radiation, after successfully reaching the I… [+2850 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Why a comet’s head is green, but its tail is not - The Indian Express", "description": "To solve the mystery the team re-created what is happening in their laboratory with the help of lasers.", "url": "https://indianexpress.com/article/technology/science/comets-head-green-tail-not-7715561/", "urlToImage": "https://images.indianexpress.com/2022/01/COMET-COLORS.jpg", "publishedAt": "2022-01-10T07:03:41Z", "content": "The head of a comet often glows green; the tail mostly does not. That includes Comet Leonard, which made its closest pass to the sun on Monday and is heading away again.\r\nA team of scientists have no… [+3546 chars]"}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": "", "title": "James Webb Space Telescope fully deployed in space - The Mercury", "description": "NASA’s next-generation telescope has fully deployed in space en route to its final destination where it will be able to peer into the depths of the cosmos and glimpse galaxies billions of light years away. \n\nThe James Webb Space Telescope, the largest ever bu…", "url": "https://www.themercury.com.au/business/james-webb-space-telescope-fully-deployed-in-space/video/c52a6180031f7b86e428b53f2f78ecb6?nk=98a382b007cdbb1d6b3dfcb58e2af6bb-1641804624", "urlToImage": "https://content.api.news/v3/images/bin/5d4d794ded3f0e607be8259099ad56b8", "publishedAt": "2022-01-10T06:46:08Z", "content": "NASA’s next-generation telescope has fully deployed in space en route to its final destination where it will be able to peer into the depths of the cosmos and glimpse galaxies billions of light years… [+422 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "Rover solves 'mystery hut' lunar puzzle - ecns", "description": "China's Yutu 2 lunar rover has traveled more than a kilometer on the moon and is still working well, according to the China National Space Administration.", "url": "http://www.ecns.cn/news/2022-01-10/detail-ihauqxpy8106819.shtml", "urlToImage": "http://i2.chinanews.com.cn/simg/hpic/2022/01-10/pic1-39108633.jpeg", "publishedAt": "2022-01-10T02:01:34Z", "content": "Yutu 2, the lander and rover of the Chang'e 4 probe, captured an obscure but intriguing image about 80 meters from its location during the mission's 36th lunar day, according to Our Space, a Chinese … [+3316 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Now we Know why Spaceflight Affects Your Eyes - Universe Today", "description": "70% of astronauts who spend time on the International Space Station (ISS) experience swelling at the back of their eyes, causing blurriness and impaired eyesight both in space and when they return to Earth. Sometimes, it’s permanent. Understanding the way mic…", "url": "https://www.universetoday.com/153959/now-we-know-why-spaceflight-affects-your-eyes/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/01/2560px-ISS-56_Serena_Aunon-Chancellor_with_a_Fundoscope_in_the_Destiny_lab-1024x683.jpg", "publishedAt": "2022-01-09T21:46:47Z", "content": "70% of astronauts who spend time on the International Space Station (ISS) experience swelling at the back of their eyes, causing blurriness and impaired eyesight both in space and when they return to… [+3980 chars]"}, {"source": {"id": null, "name": "Theubj.com"}, "author": "Hitesh Rane", "title": "A Black Hole Erupted 12 Million Light-Years Away From Earth! - Ukraine Business Journal", "description": "Volcanic eruptions are as superb to look as they are harming to people living around the spring of spouting magma.", "url": "https://theubj.com/tech/27187/a-black-hole-erupted-12-million-light-years-away-from-earth/", "urlToImage": "https://i2.wp.com/theubj.com/wp-content/uploads/2022/01/tde-launched-jet-nrao-artist-home_0.jpg?fit=1400%2C788&ssl=1", "publishedAt": "2022-01-09T16:56:37Z", "content": "Volcanic eruptions are as superb to look as they are harming to people living around the spring of spouting magma. If a trademark quirk on Earth can be so awesome, the thing may be said with regards … [+1544 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Eccentric Exoplanet Discovered: Sub-Neptune Planet Orbiting in “Habitable Zone” of Red Dwarf Star - SciTechDaily", "description": "Led by the University of Bern, an international research team has discovered a sub-Neptune exoplanet orbiting a red dwarf star. The discovery was also made thanks to observations performed by the SAINT-EX observatory in Mexico. SAINT-EX is run by a consortium…", "url": "https://scitechdaily.com/eccentric-exoplanet-discovered-sub-neptune-planet-orbiting-in-habitable-zone-of-red-dwarf-star/", "urlToImage": "https://scitechdaily.com/images/Planets-Orbiting-Red-Dwarf-Star-scaled.jpg", "publishedAt": "2022-01-09T14:45:24Z", "content": "ByUniversity of BernJanuary 9, 2022\r\nArtist’s impression of planets orbiting a red dwarf. Credit: Mark Garlick\r\nLed by the University of Bern, an international research team has discovered a sub-Nept… [+7861 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Detailed Footage Finally Reveals What Triggers Lightning - newsconcerns", "description": "So Dwyer and his team turned to the Low Frequency Array (LOFAR), a network of thousands of small radio telescopes mostly in the Netherlands. LOFAR usually gazes at distant galaxies and exploding stars. But according to Dwyer, “it just so happens to w", "url": "https://newsconcerns.com/detailed-footage-finally-reveals-what-triggers-lightning/", "urlToImage": "https://media.wired.com/photos/61d8c77554280e488a4ba747/191:100/w_1280,c_limit/Science_Quanta_Lightning_1238x826_Lede_Video.jpg", "publishedAt": "2022-01-09T13:22:31Z", "content": "So Dwyer and his team turned to the Low Frequency Array (LOFAR), a network of thousands of small radio telescopes mostly in the Netherlands. LOFAR usually gazes at distant galaxies and exploding star… [+3387 chars]"}, {"source": {"id": null, "name": "Newsnationusa.com"}, "author": "Noah hilton", "title": "‘Zombie cells’ point to shorter life on Mars - News Nation USA", "description": "As humans age, cells in the body increasingly enter a state of permanent torpor. Neither alive nor dead, these “zombie cells” prevent the body from replacing the non-functioning cells but they also ar", "url": "https://newsnationusa.com/news/world/australia/zombie-cells-point-to-shorter-life-on-mars/", "urlToImage": "https://static.ffx.io/images/$zoom_0.2716,$multiply_0.7554,$ratio_1.777778,$width_1059,$x_0,$y_0/t_crop_custom/q_86,f_auto/t_theage_no_label_no_age_social_wm/1f95bdbca661912f50788925298c8cf1a56bef76", "publishedAt": "2022-01-09T11:42:32Z", "content": "As humans age, cells in the body increasingly enter a state of permanent torpor. Neither alive nor dead, these zombie cells prevent the body from replacing the non-functioning cells but they also are… [+3128 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "$14 Billion dollar telescope successfully reaches orbit in space | 7NEWS - 7NEWS Australia", "description": "For all the gloom of a pandemic, astronomers around the world are feeling euphoria and relief tonight. The giant space telescope that promises to peer back t...", "url": "https://www.youtube.com/watch?v=aaarCuFAyUs", "urlToImage": "https://i.ytimg.com/vi/aaarCuFAyUs/hqdefault.jpg", "publishedAt": "2022-01-09T08:56:49Z", "content": null}]}