{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Gold-phosphorus nanosheets catalyzes natural gas to greener energy selectively - Phys.org", "description": "Advances in hydraulic fracturing technology have enabled discovery of large reserves of natural gas which primarily contains methane, and which is mainly burned directly, potentially causing global warming. Upgrading methane to greener energy such as methanol…", "url": "https://phys.org/news/2021-03-gold-phosphorus-nanosheets-catalyzes-natural-gas.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/goldphosphor.jpg", "publishedAt": "2021-03-02T17:50:14Z", "content": "Advances in hydraulic fracturing technology have enabled discovery of large reserves of natural gas which primarily contains methane, and which is mainly burned directly, potentially causing global w… [+2412 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "José Tadeu Arantes", "title": "Model describes interactions between light and mechanical vibration in microcavities - Phys.org", "description": "Optomechanical microcavities are extremely small structures with diameters of less than 10 micrometers (about a tenth of a human hair) inside which light and mechanical vibrations are confined. Thanks to their small size and to efficient microfabrication tech…", "url": "https://phys.org/news/2021-03-interactions-mechanical-vibration-microcavities.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/modeldescrib.jpg", "publishedAt": "2021-03-02T17:45:30Z", "content": "Optomechanical microcavities are extremely small structures with diameters of less than 10 micrometers (about a tenth of a human hair) inside which light and mechanical vibrations are confined. Thank… [+5376 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Vittoria D'alessio", "title": "Photon-photon polaritons: the intriguing particles that emerge when two photons couple - Phys.org", "description": "Scientists at the University of Bath in the UK have found a way to bind together two photons of different colors, paving the way for important advancements in quantum-electrodynamics—the field of science that describes how light and matter interact. In time, …", "url": "https://phys.org/news/2021-03-photon-photon-polaritons-intriguing-particles-emerge.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/photonphoton.jpg", "publishedAt": "2021-03-02T17:40:40Z", "content": "Scientists at the University of Bath in the UK have found a way to bind together two photons of different colors, paving the way for important advancements in quantum-electrodynamicsthe field of scie… [+4325 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Monica Haider", "title": "NASA Names DC Headquarters After Mary Jackson, STEM Leader And NASA’s First Black Female Engineer - Forbes", "description": "NASA named its D.C. headquarters after Mary Jackson, a pioneer in math and engineering who became NASA's first Black woman engineer. Jackson worked during and after segregation and fought for equality for other women at NASA. Other notable women in STEM also …", "url": "https://www.forbes.com/sites/monicahaider/2021/03/02/nasa-names-dc-headquarters-after-mary-jackson-stem-leader-and-nasas-first-black-female-engineer/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F603e763c297958111d674607%2F0x0.jpg", "publishedAt": "2021-03-02T17:38:50Z", "content": "View of Mary Jackson working at NASA's Langley Research Center in Hampton, Virginia, 1980. (Photo by ... [+] Bob Nye/NASA/Interim Archives/Getty Images)\r\nGetty Images\r\nNASAs Washington D.C. headquart… [+5073 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Chemistry goes under cover - EurekAlert", "description": "Scientists have discovered that physically confined spaces can make for more efficient chemical reactions.", "url": "https://www.eurekalert.org/pub_releases/2021-03/dnl-cgu030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257901_web.jpg", "publishedAt": "2021-03-02T17:27:32Z", "content": "IMAGE: An illustration of physically confined spaces in a porous bilayer silica film on a metal catalyst that can be used for chemical reactions. Silicon atoms are indicated by the orange...\r\n view m… [+13304 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Igor Bonifacic", "title": "The CPU from Apple's iMac G3 is powering NASA's Perseverance rover - Yahoo Finance Australia", "description": "When NASA's Perseverance guided itself to the surface of Mars on February 18th, it did so with the help of the same processor that powered the 1998 iMac G3.", "url": "https://au.finance.yahoo.com/news/nasa-perseverance-powerpc-750-171516292.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9fkbSOCo1qtXlZ0SERyveQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzcz/https://s.yimg.com/os/creatr-uploaded-images/2021-03/b14c4200-7b7f-11eb-b79b-283e8166d0dc", "publishedAt": "2021-03-02T17:25:39Z", "content": "Pompano Beach, Florida, March 02, 2021 (GLOBE NEWSWIRE) -- Brownies Marine Group, Inc. (OTCQB: BWMG), a leading developer, manufacturer and distributor of tankless dive equipment and high pressure ai… [+3655 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysicist's 2004 Theory Confirmed: Why the Sun's Chemical Composition Varies - SciTechDaily", "description": "About 17 years ago, J. Martin Laming, an astrophysicist at the U.S. Naval Research Laboratory, theorized why the chemical composition of the Sun’s tenuous outermost layer differs from that lower down. His theory has recently been validated by combined observa…", "url": "https://scitechdaily.com/astrophysicists-2004-theory-confirmed-why-the-suns-chemical-composition-varies/", "urlToImage": "https://scitechdaily.com/images/Solar-Corona-During-Total-Solar-Eclipse.jpg", "publishedAt": "2021-03-02T17:22:10Z", "content": "The solar corona viewed in white light during the total solar eclipse on August 21, 2017 from Mitchell, Oregon. The moon blocks out the central part of the Sun, allowing the tenuous outer regions to … [+4154 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New study finds atmospheric rivers increase snow mass in West Antarctica - EurekAlert", "description": "A new study published today in the journal <i>Geophysical Research Letters</i> used NASA's ice-measuring laser satellite to identify atmospheric river storms as a key driver of increased snowfall in West Antarctica during the 2019 austral winter.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uoc--nsf030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257910_web.jpg", "publishedAt": "2021-03-02T17:13:18Z", "content": "IMAGE: Thwaites Glacier in 2019. Credit: Kiya Riverman\r\n view more \r\nCredit: Kiya Riverman\r\nA new study published today in the journal Geophysical Research Letters used NASA's ice-measuring laser sat… [+5339 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Harvard study challenges lateral-to-sagittal shift in mammal spine evolution - EurekAlert", "description": "The study challenges the lateral-to-sagittal hypothesis by looking at the vertebrae of modern reptiles, mammals, and the extinct nonmammalian synapsids to determine how their vertebrae changed over time and its effect on how these creatures likely moved.", "url": "https://www.eurekalert.org/pub_releases/2021-03/hu-hsc030221.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257876_web.jpg", "publishedAt": "2021-03-02T17:02:29Z", "content": "IMAGE: Photograph of a skeleton of the early non-mammalian synapsid (ancient mammal relative) Edaphosaurus on display at the Field Museum of Natural History.\r\n view more \r\nCredit: Ken Angielczyk\r\nWhe… [+5736 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Discover Glow-in-the-Dark Sharks - Futurism", "description": "The kitefin shark is now the largest-known luminous underwater creature.", "url": "https://futurism.com/the-byte/scientists-discover-glow-in-the-dark-sharks", "urlToImage": "https://wp-assets.futurism.com/2021/03/scientists-discover-glow-in-the-dark-sharks.jpg", "publishedAt": "2021-03-02T16:36:55Z", "content": "An amazing discovery: the first glowing sharks known to science.\r\nGlow-In-the-Shark\r\nA team of researchers in New Zealand have discovered yet another mystery lurking in the deepest, mostly unexplored… [+1826 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Origin of life: The chicken-and-the-egg problem - Science Daily", "description": "A team has shown that slight alterations in transfer-RNA molecules (tRNAs) allow them to self-assemble into a functional unit that can replicate information exponentially. tRNAs are key elements in the evolution of early life-forms.", "url": "https://www.sciencedaily.com/releases/2021/03/210302094102.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-02T16:12:48Z", "content": "A Ludwig-Maximilians-Universitaet (LMU) in Munich team has shown that slight alterations in transfer-RNA molecules (tRNAs) allow them to self-assemble into a functional unit that can replicate inform… [+6285 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Great Pacific Garbage Patch has 'connecting pathway with East Asia' that may feed it debris - Daily Mail", "description": "Scientists may have solved what is feeding a floating landfill twice the size of Texas, known as Great Pacific Garbage Patch. The team found a transition channel that connects it with Asia.", "url": "https://www.dailymail.co.uk/sciencetech/article-9317071/The-Great-Pacific-Garbage-Patch-connecting-pathway-Asia-feeding-debris.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/02/16/39954504-0-image-a-14_1614702789886.jpg", "publishedAt": "2021-03-02T16:09:35Z", "content": "The North Pacific is home to an enormous swirl of plastic waste twice the size of Texas known as the Great Pacific Garbage Patch, but how the trash made its way to the region has been a mystery among… [+6368 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Here's how insects coax plants into making galls - EurekAlert", "description": "Scientists have identified proteins in aphid saliva that can alter plant development. These proteins drive abnormal growths called galls, which give insects a protected place to feed and reproduce.", "url": "https://www.eurekalert.org/pub_releases/2021-03/hhmi-hhi022321.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257259_web.jpg", "publishedAt": "2021-03-02T16:03:09Z", "content": "IMAGE: Hormaphis cornu aphids feed on witch hazel leaves and coax the plants into making galls.\r\n view more \r\nCredit: David Stern\r\nInsects can reprogram plant growth, transforming ordinary plant part… [+4612 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Matthew Warke", "title": "A lack of oxygen will wipe out life on Earth in a billion years - The Conversation UK", "description": "This discovery will shape the hunt for life on exoplanets.", "url": "https://theconversation.com/a-lack-of-oxygen-will-wipe-out-life-on-earth-in-a-billion-years-156241", "urlToImage": "https://images.theconversation.com/files/387012/original/file-20210301-12-pyj8jo.jpg?ixlib=rb-1.1.0&rect=333%2C0%2C4577%2C2286&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-03-02T15:50:45Z", "content": "Earth will not be able to support and sustain life forever. Our oxygen-rich atmosphere may only last another billion years, according to a new study in Nature Geoscience. \r\nAs our Sun ages, it is bec… [+4805 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Derya Ozdemir", "title": "Farming Fish on the Moon Could Feed Astronauts - Interesting Engineering", "description": "The eggs of two fish species survived Russia's Soyuz spacecraft's launch conditions. Get the details here.", "url": "https://interestingengineering.com/farming-fish-on-the-moon-could-feed-astronauts", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/MRw4Vj3BG1/sizes/farming-fish-on-moon_md.jpg", "publishedAt": "2021-03-02T15:46:48Z", "content": "Moon-tea, McMoon, and moon cakes might become the space favorites one day -- but figuring out what and how we will eat as we travel through interstellar space still remains an issue. In order to desi… [+2153 chars]"}, {"source": {"id": null, "name": "ComputerWeekly.com"}, "author": "Karl Flinders", "title": "Goldman Sachs CEO comments highlight need for home working balance - ComputerWeekly.com", "description": "The remote working revolution has been prominent in the banking sector and organisations have a balancing act to perform post-pandemic", "url": "https://www.computerweekly.com/news/252497150/Goldman-Sachs-CEO-comments-highlight-need-for-home-working-balance", "urlToImage": "https://cdn.ttgtmedia.com/visuals/ComputerWeekly/Hero Images/1E-remote-working-hero.jpg", "publishedAt": "2021-03-02T15:40:53Z", "content": "The working-from-home policies and cultures being embedded in the banking sector during the Covid-19 pandemic may not become the new normal that everyone expects.\r\nDespite the success of home working… [+5230 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Rare Australian bee rediscovered after nearly a century - Livescience.com", "description": "It hadn't been seen since 1923 and was thought to be extinct.", "url": "https://www.livescience.com/rare-australian-bee-rediscovered.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3vwFCjUViY4zzD7FYeCyHE-1200-80.jpg", "publishedAt": "2021-03-02T15:35:00Z", "content": "An extremely rare species of bee that hasn't been seen for nearly a century and was thought to be extinct has been rediscovered by a lone researcher in Australia.\r\nThis rare \"masked\" bee, known as Ph… [+3736 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Milky Way –“A Living, Dynamic Museum of Ancient Merging Relics, River-like Streams of Stars” - The Daily Galaxy --Great Discoveries Channel", "description": "The Milky Way is a living, dynamic museum of ancient merging relics, river-like streams of stars stripped from dwarf satellite galaxies that flow through the galaxy revealing its history and structure that allow astronomers to better understand how galaxies i…", "url": "https://dailygalaxy.com/2021/03/the-milky-way-a-living-dynamic-museum-of-ancient-merging-relics-river-like-streams-of-stars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2021/03/191749_web-1-1024x619-1-1024x619-1-e1614698354718.jpg", "publishedAt": "2021-03-02T15:33:45Z", "content": "The Milky Way is a living, dynamic museum of ancient merging relics, river-like streams of stars stripped from dwarf satellite galaxies that flow through the galaxy revealing its history and structur… [+3422 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Japanese scientists are creating realistic steak meat in a petri dish - Open Access Government", "description": "A team at the University of Tokyo are creating steak meat in a petri dish, which could soon become the most realistic tasting biosynthetic meat available", "url": "https://www.openaccessgovernment.org/meat-in-a-petri-dish/105115/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/03/dreamstime_xxl_155276896-scaled.jpg", "publishedAt": "2021-03-02T15:17:48Z", "content": "As the world continues to increase in population, the way that meat is produced is becoming increasingly unsustainable. The tropical rain belt is moving steadily and creating uncertain farming condit… [+3193 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "International Space Station Images Trace Bird Migrations - NASA", "description": "The Avian Migration Aerial Surface Space project, or AMASS, takes advantage of thousands of images captured by astronauts to give people an appreciation of the migrations many birds undertake across the planet.", "url": "https://www.nasa.gov/mission_pages/station/research/news/amass-ceo/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/2_earth-from-the-international-space-station.jpg", "publishedAt": "2021-03-02T15:09:13Z", "content": null}, {"source": {"id": null, "name": "Den of Geek US"}, "author": null, "title": "Link Tank: Why You Need to Watch This Black Hole Documentary on Apple TV - Den of Geek", "description": "Black Hole: The Edge of All We Know on Apple TV, how WandaVision deals with grief, a review of Minari, and more in today's Link Tank!", "url": "https://www.denofgeek.com/culture/link-tank-why-watch-black-hole-documentary-apple-tv/", "urlToImage": "https://www.denofgeek.com/wp-content/uploads/2021/03/V4q7tR2uNk9f3Nqfeds2Yn.jpg?fit=2000%2C1125", "publishedAt": "2021-03-02T15:00:12Z", "content": "“Between 1551 and 1558, Swiss doctor and naturalist Conrad Gessner published his magnum opus, the five-volume, 4500-page Historiae animalium, which became the period’s most widely read natural histor… [+748 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Study shows conversations rarely end when people want them to end - Phys.org", "description": "A team of researchers from Harvard University, the University of Pennsylvania's Wharton School and the University of Virginia has found that conversations between people usually do not end when either partner in the conversation wants them to end. In their pa…", "url": "https://phys.org/news/2021-03-conversations-rarely-people.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-conversation.jpg", "publishedAt": "2021-03-02T15:00:02Z", "content": "A team of researchers from Harvard University, the University of Pennsylvania's Wharton School and the University of Virginia has found that conversations between people usually do not end when eithe… [+2708 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Photonics discovery portends dramatic efficiencies in silicon chips - Phys.org", "description": "A team led by Vanderbilt engineers has achieved the ability to transmit two different types of optical signals across a single chip at the same time.", "url": "https://phys.org/news/2021-03-photonics-discovery-portends-efficiencies-silicon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/photonicsdis.jpg", "publishedAt": "2021-03-02T14:55:32Z", "content": "A team led by Vanderbilt engineers has achieved the ability to transmit two different types of optical signals across a single chip at the same time.\r\nThe breakthrough heralds a potentially dramatic … [+3766 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Queenie Hoi Shan Chan", "title": "Scientists have found dust from the asteroid that wiped out the dinosaurs inside the crater it left - The Conversation UK", "description": "A new study found iridium, an element found in asteroids, in the rocks of the Chicxulub impact crater.", "url": "https://theconversation.com/scientists-have-found-dust-from-the-asteroid-that-wiped-out-the-dinosaurs-inside-the-crater-it-left-156232", "urlToImage": "https://images.theconversation.com/files/387199/original/file-20210302-15-1mk088s.jpg?ixlib=rb-1.1.0&rect=314%2C775%2C6423%2C3206&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-03-02T14:27:24Z", "content": "More than 99% of all organisms that have ever lived on Earth are now extinct. Most of these just died out quietly. However, in Earths history there have been five major mass extinction events known a… [+4863 chars]"}, {"source": {"id": null, "name": "Wbfo.org"}, "author": "Nell Greenfieldboyce", "title": "Reading A Letter That's Been Sealed For More Than 300 Years—Without Opening It - WBFO", "description": "An unopened letter that was mailed back in 1697 but never delivered has been read by researchers who have developed a way to virtually &quot;unfold&quot;", "url": "https://news.wbfo.org/post/reading-letter-thats-been-sealed-more-300-years-without-opening-it", "urlToImage": "//https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202103/972791311.png", "publishedAt": "2021-03-02T14:13:09Z", "content": "An unopened letter that was mailed back in 1697 but never delivered has been read by researchers who have developed a way to virtually \"unfold\" sealed letter packets without having to actually break … [+5477 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Big step toward small wires - Phys.org", "description": "Researchers from Fudan University in Shanghai, Japan's National Institute for Materials Science and QUT's Centre for Materials Science have published the study, \"Stable single atomic silver wires assembling into a circuitry-connectable nanoarray,\" in the jour…", "url": "https://phys.org/news/2021-03-big-small-wires.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/bigsteptowar.jpg", "publishedAt": "2021-03-02T13:51:10Z", "content": "Researchers from Fudan University in Shanghai, Japan's National Institute for Materials Science and QUT's Centre for Materials Science have published the study, \"Stable single atomic silver wires ass… [+3762 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "NASA's James Webb Space Telescope completes final functional tests to prepare for launch - Phys.org", "description": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams successfully completed two important milestones that confirmed t…", "url": "https://phys.org/news/2021-03-nasa-james-webb-space-telescope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/nasasjameswe.jpg", "publishedAt": "2021-03-02T13:10:05Z", "content": "February marked significant progress for NASA's James Webb Space Telescope, which completed its final functional performance tests at Northrop Grumman in Redondo Beach, California. Testing teams succ… [+6041 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ecology literature dominated by men in a handful of countries - Phys.org", "description": "Publishing in peer-reviewed scientific journals is crucial for the development of a researcher's career. The scientists that publish the most often in the most prestigious journals generally acquire greater renown, as well as higher responsibilities. However,…", "url": "https://phys.org/news/2021-03-ecology-literature-dominated-men-countries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/men.jpg", "publishedAt": "2021-03-02T12:52:25Z", "content": "Publishing in peer-reviewed scientific journals is crucial for the development of a researcher's career. The scientists that publish the most often in the most prestigious journals generally acquire … [+1711 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Observations of First Black Hole Ever Detected Leads to Questions About the Universe's Most Mysterious Objects - SciTechDaily", "description": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to question what they know about the Universe's most mysterious ob…", "url": "https://scitechdaily.com/new-observations-of-first-black-hole-ever-detected-leads-to-questions-about-the-universes-most-mysterious-objects/", "urlToImage": "https://scitechdaily.com/images/Cygnus-X-1-System.gif", "publishedAt": "2021-03-02T12:34:58Z", "content": "Cygnus X-1, a binary star system first discovered in 1964, comprises one of the closest black holes to Earth. New observations of this black hole, the first ever detected, have led astronomers to que… [+5569 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tim Childers", "title": "Lab-grown black hole behaves just like Stephen Hawking said it would - Livescience.com", "description": "", "url": "https://www.livescience.com/black-hole-analog-confirms-hawking.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vw9j4BpfTqhS4SovcAiUtV-1200-80.jpg", "publishedAt": "2021-03-02T12:23:51Z", "content": "In 1974, Stephen Hawking theorized that the universe's darkest gravitational behemoths, black holes, were not the pitch-black star swallowers astronomers imagined, but they spontaneously emitted ligh… [+5004 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Niiler", "title": "Can Technology Open Spaceflight to Disabled Astronauts? - WIRED", "description": "The European Space Agency wants to make sure its new astronaut class is more diverse. But it will take redesigned gear to make space accessible to everybody.", "url": "https://www.wired.com/story/can-technology-open-spaceflight-to-disabled-astronauts/", "urlToImage": "https://media.wired.com/photos/603d2a7a2d6b6299017ee0d4/191:100/w_1280,c_limit/Science_disabledastronauts_348873main_fd7-repair_full.jpg", "publishedAt": "2021-03-02T12:00:00Z", "content": "What would it be like to have a spaceship with a truly diverse crewnot the mix of alien species seen in so many sci-fi series, but human beings with all kinds of bodies? The European Space Agency ann… [+3769 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "‘Little Foot’ fossil sheds further light on human origins - The New Daily", "description": "The fossil of an early human forerunner that inhabited South Africa 3.67 million years ago is shedding light on human origins.", "url": "https://thenewdaily.com.au/life/2021/03/02/little-foot-fossil-human-origins/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2021/03/1614684366-Little-Foot-fossil-2017-960x600.jpg", "publishedAt": "2021-03-02T11:45:02Z", "content": "Sophisticated scanning technology is revealing intriguing secrets about Little Foot, the fossil of an early human forerunner that inhabited South Africa 3.67 million years ago during a critical junct… [+4001 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Amy Barrett, PA Science", "title": "'Space hurricane' observed above the North Pole - BBC Focus Magazine", "description": "The space hurricane was detected in the Earth's upper atmosphere and 'rained electrons' over the North Pole for nearly eight hours.", "url": "https://www.sciencefocus.com/news/space-hurricane-observed-above-the-north-pole/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2021/03/space-hurricane-hero-781275c.png?quality=90&resize=960,413", "publishedAt": "2021-03-02T11:00:33Z", "content": "Scientists say they have confirmed the existence of space hurricanes after analysing a 1,000km-wide swirling mass of plasma spotted hundreds of kilometres above the North Pole.\r\nThe space hurricane, … [+3357 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": null, "title": "Türkiye’nin Ay Yolculuğu Hedefinde En Büyük Destek 3D Yazıcıdan Çıkacak - RaillyNews", "description": "Turkey's Journey to the Moon 3D Printer from the Destination Biggest Support to Exit | Local and national 3D printer manufacturer Zaxe General Manager Emre Akinci, Turkey, to reach the moon until 2023 in the National Space Program Plan", "url": "https://raillynews.com/2021/03/In-turkiyenin-month-journey-from-3D-printers-will-hit-the-target-most-big-support/", "urlToImage": "https://i2.wp.com/rayhaber.com/wp-content/uploads/2021/03/turkiyenin-ay-yolculugu-hedefinde-en-buyuk-destek-3d-yazicidan-cikacak.jpg?fit=1424%2C800&ssl=1", "publishedAt": "2021-03-02T10:13:34Z", "content": "the biggest support from other printers will hit the target turkiyenin month journey\r\nLocal and national 3D printer manufacturer Zaxe General Manager Emre Akinci, Turkey said it would be the biggest … [+5817 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kristen Minogue", "title": "Stressed-out young oysters may grow less meat on their shells - Phys.org", "description": "Early exposure to tough conditions—particularly warmer waters and nightly swings of low oxygen—could leave lasting scars on oysters' ability to grow meaty tissue. A team of biologists at the Smithsonian Environmental Research Center (SERC) reported the discov…", "url": "https://phys.org/news/2021-03-stressed-out-young-oysters-meat-shells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-stressedouty.jpg", "publishedAt": "2021-03-02T08:29:16Z", "content": "Early exposure to tough conditionsparticularly warmer waters and nightly swings of low oxygencould leave lasting scars on oysters' ability to grow meaty tissue. A team of biologists at the Smithsonia… [+6140 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Modern Oasis of Jubbah: A Long-Ago Lake Amid the Dunes - SciTechDaily", "description": "The modern oasis of Jubbah sits within the wind shadow of historic mountains and the basin of an ancient lakebed. Long-sustained westerly winds shaped the dunes surrounding the Saudi Arabian oasis of Jubbah in this photograph shot by an astronaut from the Int…", "url": "https://scitechdaily.com/modern-oasis-of-jubbah-a-long-ago-lake-amid-the-dunes/", "urlToImage": "https://scitechdaily.com/images/Jubbah-2020-scaled.jpg", "publishedAt": "2021-03-02T06:31:00Z", "content": "November 26, 2020\r\nThe modern oasis of Jubbah sits within the wind shadow of historic mountains and the basin of an ancient lakebed.\r\nLong-sustained westerly winds shaped the dunes surrounding the Sa… [+2738 chars]"}, {"source": {"id": null, "name": "Dailycal.org"}, "author": "Jasper Kenzo Sundeen", "title": "Researchers find new species, evidence of early primates during late Cretaceous Period - Daily Californian", "description": "In 2003, Greg Wilson Mantilla was examining fossils from Hell Creek, Montana, ultimately resulting in the identification of a new species, Purgatorius mckeeveri.", "url": "https://www.dailycal.org/2021/03/01/researchers-find-new-species-evidence-of-early-primates-during-late-cretaceous-period/", "urlToImage": "https://i0.wp.com/www.dailycal.org/assets/uploads/2021/03/primates_Diane-Clemens-Knott_courtesy-768x495.jpg", "publishedAt": "2021-03-02T06:04:23Z", "content": "In 2003, Greg Wilson Mantilla, who at the time was a Doctor of Philosophy candidate at UC Berkeley, was examining fossils from excavations in Hell Creek, Montana, which had been directed by his advis… [+2765 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "9News Staff", "title": "Strange striped patterns in Russia snow baffle NASA scientists - 9News", "description": "<p>A satellite has captured strange rippled lines across parts of Russia&#x27;s arctic, leaving scientists confused as to what they are.</p>", "url": "https://www.9news.com.au/wild-weather/russia-stripe-patterns-photographed-by-satellite-leave-nasa-scientists-baffled/e0e9ca3e-eaf4-49b6-8e8d-a3801778f27b", "urlToImage": "https://imageresizer.static9.net.au/m6pknW4UhMFmfADh13vlZijWWvk=/0x37:720x442/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Ff7201559-7cc1-4879-acc6-d972aea125d5", "publishedAt": "2021-03-02T05:08:34Z", "content": "Auto news: Old Datsun sells for $1.1 million, breaks auction records in Japan - caradvice.com.au"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The time is ripe! An innovative contactless method for the timely harvest of soft fruits: Scientists develop convenient technique to measure ripeness using laser-induced plasma shockwaves and the ensuing vibrations on the fruit's surface - Science Daily", "description": "In agriculture, there are many mechanical methods to indirectly measure a fruit's ripeness through its firmness. However, most fall short for soft fruits, which do not exhibit the same types of measurable vibration as harder ones. Now, scientists have develop…", "url": "https://www.sciencedaily.com/releases/2021/03/210301211620.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-02T02:31:42Z", "content": "Most people are probably familiar with the unpleasant feeling of eating overripe or underripe fruit. Those who work in agriculture are tasked with ensuring a timely harvest so that ripeness is at an … [+3822 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "AAP", "title": "Oldest titanosaur unearthed in Argentina - The West Australian", "description": "Scientists in Argentina have discovered the oldest known titanosaur species, Ninjatitan zapatai, that lived 140 million years ago during the Cretaceous Period.", "url": "https://thewest.com.au/technology/oldest-titanosaur-unearthed-in-argentina-ng-s-2051677", "urlToImage": "https://images.thewest.com.au/publication/S-2051677/1614651275533_Argentina_Dinosaur_16-9_20489336_2051677_2021030213038e1b1be0a-08c6-44c3-b958-3951a2ebb670.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2021-03-02T02:13:00Z", "content": "Scientists have unearthed in Argentina's Patagonian wilderness fossils of what may be the oldest-known member of the dinosaur group that includes the largest land animals in Earth's history.\r\nResearc… [+1766 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "news.com.au", "title": "How to watch Jupiter, Mercury in conjunction on March 5 - The Cairns Post", "description": "How to watch Jupiter, Mercury in conjunction on March 5", "url": "https://www.news.com.au/technology/science/space/how-to-watch-jupiter-mercury-in-conjunction-on-march-5/news-story/648425ddb99e2cd73c7d3db6d294a070", "urlToImage": "https://cdn.newsapi.com.au/image/v1/e8b8b22500649df7c648e53d393ce2a4?width=1280", "publishedAt": "2021-03-02T01:58:00Z", "content": "Southern hemisphere skywatchers are in for a treat this week with the best chances of seeing the conjunction of Mercury and Jupiter.Conjunctions occur when a planet’s orbit of the sun aligns with ano… [+1281 chars]"}, {"source": {"id": null, "name": "kvor"}, "author": null, "title": "Building of First Space Hotel to Begin in 2025 - kvor", "description": "Building of First Space Hotel to Begin in 2025", "url": "https://www.kvor.com/news/building-of-first-space-hotel-to-begin-in-2025/", "urlToImage": null, "publishedAt": "2021-03-02T00:16:42Z", "content": "Construction is due to begin in 2025 on the world’s first “space hotel” in low Earth orbit that will include restaurants, a movie theater, spa and rooms for some 400 guests, the Daily Mail reported o… [+1147 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "When should you end a conversation? Probably sooner than you think - Science Magazine", "description": "Study finds most chats don’t end when people want them to", "url": "https://www.sciencemag.org/news/2021/03/when-should-you-end-conversation-probably-sooner-you-think", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/conversation_1280p.jpg?itok=KgoOShN2", "publishedAt": "2021-03-01T20:45:00Z", "content": "By Cathleen OGradyMar. 1, 2021 , 3:45 PM\r\nWhile studying for his masters degree at the University of Oxford, Adam Mastroianni confronted a fear common to many party goers: Would he get stuck in a con… [+4115 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "4D bioengineering materials bend, curve like natural tissue - Newswise", "description": "Researchers have developed new 4D hydrogels — 3D materials that have the ability to change shape over time in response to stimuli — that can morph multiple", "url": "https://www.newswise.com/articles/4d-bioengineering-materials-bend-curve-like-natural-tissue", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/03/1/multishapechange1.png&width=100&height=100", "publishedAt": "2021-03-01T18:40:00Z", "content": "Newswise — Tissue engineering has long-depended on geometrically static scaffolds seeded with cells in the lab to create new tissues and even organs. The scaffolding material — usually a biodegradabl… [+3013 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Neanderthals had the capacity to perceive and produce human speech - Science Daily", "description": "Neanderthals -- the closest ancestor to modern humans -- possessed the ability to perceive and produce human speech, according to a new study.", "url": "https://www.sciencedaily.com/releases/2021/03/210301112358.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T18:25:25Z", "content": "Neanderthals -- the closest ancestor to modern humans -- possessed the ability to perceive and produce human speech, according to a new study published by an international multidisciplinary team of r… [+4768 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Global warming poses threat to food chains - Science Daily", "description": "Rising temperatures could reduce the efficiency of food chains and threaten the survival of larger animals, new research shows.", "url": "https://www.sciencedaily.com/releases/2021/03/210301112403.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T18:21:52Z", "content": "Rising temperatures could reduce the efficiency of food chains and threaten the survival of larger animals, new research shows.Scientists measured the transfer of energy from single-celled algae (phy… [+2092 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": null, "title": "Wrasses dazzle: How fairy wrasses got their flamboyant colours - Phys.Org", "description": "With their exuberant colors, fiery personalities and captivating courtship displays, the fairy wrasses are one of the most beloved coral reef fish. Despite this, the evolutionary history of its genus was not well understood—until ...", "url": "https://phys.org/visualstories/2021-03-wrasses-dazzle-fairy-flamboyant-colours.amp", "urlToImage": null, "publishedAt": "2021-03-01T17:06:54Z", "content": "Fairy wrasses diverged in form and color after repeated sea level rises and falls during the last ice age, finds a new study. Published in top journal Systematic Biology, it employed a novel genome-w… [+511 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Second Order Optical Merons, or Light Pretending to Be a Ferromagnet - SciTechDaily", "description": "Scientists have demonstrated how to structure light such that its polarization behaves like a collective of spins in a ferromagnet forming half-skyrmions (also known as merons). To achieve this, the light was trapped in a thin liquid crystal layer between two…", "url": "https://scitechdaily.com/second-order-optical-merons-or-light-pretending-to-be-a-ferromagnet/", "urlToImage": "https://scitechdaily.com/images/Light-Spin-Texture.jpg", "publishedAt": "2021-03-01T16:47:39Z", "content": "Spin texture of a second-order half-skyrmion (meron) on the surface of a birefringent cavity. Credit: Physics UW, M. Krol\r\nScientists have demonstrated how to structure light such that its polarizati… [+4293 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Warming impairs trophic transfer efficiency in a long-term field experiment - Nature.com", "description": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic level makes it up to the next1–3. Recent theory suggests thi…", "url": "https://www.nature.com/articles/s41586-021-03352-2", "urlToImage": "", "publishedAt": "2021-03-01T16:17:48Z", "content": "In natural ecosystems, the efficiency of energy transfer from resources to consumers determines the biomass structure of food webs. As a general rule, about 10% of the energy produced in one trophic … [+1237 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Melissa Gaskill", "title": "International Space Station archives fuel new scientific discoveries - Phys.org", "description": "When scientists complete an experiment aboard the International Space Station, the ramifications of that work have just begun. NASA carries on a legacy of decades of biological research data, fueling new discoveries long after studies wrap up in space.", "url": "https://phys.org/news/2021-03-international-space-station-archives-fuel.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-internationa.jpg", "publishedAt": "2021-03-01T15:56:17Z", "content": "When scientists complete an experiment aboard the International Space Station, the ramifications of that work have just begun. NASA carries on a legacy of decades of biological research data, fueling… [+6255 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Bispecific antibodies targeting mutant RAS neoantigens - Science", "description": "RAS oncogene mutations are common in various cancers, controlling their growth and survival. Targeting mutant RAS proteins with antibodies has been unsuccessful due to low surface expression, even when targeting mutant RAS peptides presented via HLA on the su…", "url": "https://immunology.sciencemag.org/content/6/57/eabd5515.full", "urlToImage": "https://immunology.sciencemag.org/content/6/57/eabd5515/F1.large.jpg", "publishedAt": "2021-03-01T15:51:18Z", "content": "INTRODUCTION\r\nSelective killing of cancer cells is challenging because cancer cells and their normal counterparts are so similar. At the genetic level, the most important differences between cancer c… [+12122 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "The $450 question: Should journals pay peer reviewers? - Science Magazine", "description": "Payment advocates expect quicker, better reviews but opponents fear unsustainable costs", "url": "https://www.sciencemag.org/news/2021/03/450-question-should-journals-pay-peer-reviewers", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/money_1280p.jpg?itok=r2CygPAX", "publishedAt": "2021-03-01T15:45:00Z", "content": "By Jeffrey BrainardMar. 1, 2021 , 10:45 AM\r\nFor many busy working scientists, receiving yet another invitation from an academic journal to peer review yet another manuscript can trigger groans. The w… [+7999 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New skills of Graphene: Tunable lattice vibrations - Science Daily", "description": "Technological innovation in the last century was mainly based on the control of electrons or photons. Now, in the emerging research field of phononics, phonons or vibrations of the crystal lattice attract attention. A team showed a graphene-based phononic cry…", "url": "https://www.sciencedaily.com/releases/2021/03/210301095942.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T15:23:31Z", "content": "Without electronics and photonics, there would be no computers, smartphones, sensors, or information and communication technologies. In the coming years, the new field of phononics may further expand… [+2533 chars]"}, {"source": {"id": null, "name": "Digital Camera World"}, "author": "Louise Carey", "title": "Every camera on the Mars Perseverance rover from NASA explained - Digital Camera World", "description": "The Mars Perseverance rover from NASA has a total of 23 cameras – and here's what they all do", "url": "https://www.digitalcameraworld.com/uk/news/these-are-all-the-cameras-on-nasas-mars-perseverance-rover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pxaQAe8Pmt39w9cQfMGts9-1200-80.jpg", "publishedAt": "2021-03-01T14:15:19Z", "content": "The landing of the Perseverance rover on Mars is one of the most exciting events to happen for space enthusiasts in quite a while. The Perseverance rover will be searching for ancient life, collectin… [+5799 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Physicist's AI Algorithm Could Prove Our Reality Is Just A Simulation - India Times", "description": "We've accustomed ourselves to AI algorithms making accurate predictions to enhance the comforts and convenience of our life. But just what exactly is life and this reality we all experience? Could it all be one big simulation, like they showed in the movie Th…", "url": "https://www.indiatimes.com/technology/science-and-future/physicist-hong-qin-ai-algorithm-could-prove-our-reality-is-just-a-simulation-535379.html", "urlToImage": "https://im.indiatimes.in/content/2021/Mar/Facebook-Thumbnail_603cf2acdfe91.jpg", "publishedAt": "2021-03-01T14:03:16Z", "content": "We've accustomed ourselves to AI algorithms making accurate predictions to enhance the comforts and convenience of our life. But just what exactly is life and this reality we all experience? Could it… [+3386 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "ESA is working on a mission to explore caves on the moon - Phys.org", "description": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes necessary to support a moon base. ESA is also contributing both m…", "url": "https://phys.org/news/2021-03-esa-mission-explore-caves-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/esaisworking.jpg", "publishedAt": "2021-03-01T13:35:17Z", "content": "Infrastructure is going to be one of the biggest components of any permanent human settlement on the moon. NASA Artemis missions are focused directly on building up the facilities and processes neces… [+3716 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "Josef Aschbacher is new ESA Director General - Space Ref", "description": "Josef Aschbacher is new ESA Director General - SpaceRef", "url": "http://spaceref.com/news/viewpr.html?pid=57069", "urlToImage": null, "publishedAt": "2021-03-01T12:49:12Z", "content": "Josef Aschbacher is new ESA Director General\r\nPress Release\r\n From: European Space AgencyPosted: Monday, March 1, 2021 \r\nAs of today, 1 March 2021, ESA has a new Director General: Dr Josef Aschbacher… [+524 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Planetary defense experts use infamous asteroid Apophis to practice spotting dangerous space rocks - Space.com", "description": "Apophis definitely won't hit Earth this month, but scientists are pretending it might.", "url": "https://www.space.com/apophis-2021-flyby-for-planetary-defense-practice", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZN2MLRSc92EHh25Y2W5ebm-1200-80.gif", "publishedAt": "2021-03-01T12:02:44Z", "content": "Earth's most recent brush with asteroid danger was eight years ago, when a space rock the size of a six-story building came seemingly out of nowhere, injuring 1,200 people when it exploded over Chely… [+10146 chars]"}, {"source": {"id": null, "name": "Sciencenordic.com"}, "author": "Tobias Kvist Stripp", "title": "Research and social media: A dangerous cocktail or winged messenger? - ScienceNordic", "description": "OPINION: Social media plays a huge part in the process of scientific publication. Is this a good or a bad thing? How do we ensure, that science stays trustworthy under the influence of social media?", "url": "https://sciencenordic.com/a/1820056", "urlToImage": "https://image.sciencenordic.com/1821879.jpg?imageId=1821879&panow=100&panoh=60.169491525424&panox=0&panoy=39.830508474576&heightw=34.48275862069&heighth=100&heightx=0&heighty=0&width=1200&height=630", "publishedAt": "2021-03-01T10:11:21Z", "content": "Research is usually considered trustworthy. Many would probably argue that research published in scientific papers is as close as we can get to truthful knowledge about the world.\r\nWe usually do not … [+10346 chars]"}, {"source": {"id": null, "name": "Farmonline.com.au"}, "author": "", "title": "The lies the lyrebird tells to keep his girl - North Queensland Register", "description": "Male lyrebirds mimic outside threats from other birds when a female attempts to leave a male's dancing arena without mating.", "url": "https://www.farmonline.com.au/story/7144970/the-lies-the-lyrebird-tells-to-keep-his-girl/", "urlToImage": "https://www.farmonline.com.au/images/transform/v1/crop/frm/32XghFRykTWK8psrWNhdBMC/e945f8db-3295-4c3a-8793-7c42eef14663.jpg/r53_37_996_570_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T07:00:00Z", "content": "Researchers at Western Sydney University in partnership with Cornell University, the University of Wollongong and the Australian National University, have found male superb lyrebirds can create an as… [+1841 chars]"}, {"source": {"id": null, "name": "Armidale Express"}, "author": "Jacinta Dickins", "title": "New England North West towns including Armidale and Tamworth named as COVID-19 vaccination satellite sites - Armidale Express", "description": "These 12 towns in the region will be satellite sites for the vaccination rollout.", "url": "https://www.armidaleexpress.com.au/story/7147684/new-england-covid-19-vaccination-sites-revealed/", "urlToImage": "https://www.armidaleexpress.com.au/images/transform/v1/crop/frm/JV4n4a6iwKJ9DNUAb9ehsn/3c2ae18c-d75e-4844-b2f8-26fe032dbe28.jpg/r9_376_4021_2643_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T06:00:00Z", "content": ""}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "7NEWS", "title": "European stargazers hear ‘sonic boom’ as flaming meteor lights up sky - 7NEWS.com.au", "description": "The speeding ball of fire was seen by witnesses from the south of England all the way to Ireland.", "url": "https://7news.com.au/technology/meteor/european-stargazers-hear-sonic-boom-as-flaming-meteor-lights-up-sky-c-2263679", "urlToImage": "https://images.7news.com.au/publication/C-2263679/d997857e625d2bedae130bfe27aea72ee5f3c5fc-16x9-x0y60w712h400.jpg?imwidth=1024", "publishedAt": "2021-03-01T05:40:10Z", "content": "British and Irish stargazers were pleasantly surprised on Sunday night when a flaming meteor shot through the sky.\r\nAs seen in the video above, the meteor sped through the night around 10pm (Monday 9… [+1653 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Argentinian titanosaur may be oldest yet: Study - Al Jazeera English", "description": "The 20-metre lizard, discovered in Argentina in 2014, roamed what is now Patagonia some 140 million years ago.", "url": "https://www.aljazeera.com/news/2021/3/1/argentine-titanosaur-may-be-oldest-yet-study", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/000_736K5.jpg?resize=1200%2C630", "publishedAt": "2021-03-01T03:08:42Z", "content": "A colossal dinosaur dug up in Argentina could be the oldest titanosaur ever found, having roamed what is now Patagonia some 140 million years ago at the beginning of the Cretaceous period, scientists… [+1088 chars]"}, {"source": {"id": null, "name": "Australian Mining"}, "author": "Henry Ballard", "title": "Pilbara rock the key to life on Mars - Australian Mining", "description": "The search for life on Mars has taken a huge step forward, with NASA’s Mars rover Perseverance touching down on the red planet.", "url": "https://www.australianmining.com.au/news/pilbara-rock-the-key-to-life-on-mars/", "urlToImage": "https://www.australianmining.com.au/wp-content/uploads/2021/02/nasa-mars.jpg", "publishedAt": "2021-03-01T00:21:37Z", "content": "The first image NASA's Perseverance Rover took on Mars. Image credit: NASA/JPL-Caltech.\r\nThe search for life on Mars has taken a huge step forward, with NASAs Mars rover Perseverance touching down on… [+1927 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jon Fingas", "title": "Scientists sequence 64 human genomes to better reflect genetic diversity - Yahoo News Australia", "description": "Scientists have sequenced 64 full human genomes to better understand genetic diversity in the species.", "url": "https://au.news.yahoo.com/sequence-64-human-genomes-genetic-diversity-195605887.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/cuq4BRX0ck9df.K6GLo.Dg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMTI1/https://s.yimg.com/os/creatr-uploaded-images/2021-02/71ea0fe0-79f7-11eb-a732-012e236670a5", "publishedAt": "2021-02-28T20:14:46Z", "content": "The Human Genome Project shed light on our species in 2001, but it was a patchwork of different humans' genes that didn't really reflect humanity's genetic makeup. Flash forward 20 years, however, an… [+1192 chars]"}]}