{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Death spiral: A black hole spins on its side - EurekAlert", "description": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding challenges current theoretical models of black hole formati…", "url": "https://www.eurekalert.org/news-releases/944699", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/512ead11-00f4-4ef2-bbbf-03f12b64d5b0/Rendition/thumbnail/Content/Public", "publishedAt": "2022-02-26T02:04:34Z", "content": "image: Artist impression of the X-ray binary system MAXI J1820+070 containing a black hole (small black dot at the center of the gaseous disk) and a companion star. A narrow jet is directed along the… [+3671 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Nasa simulation of the universe will guide future Webb telescope observations - The Independent", "description": "To learn how to search the sky for never before seen distant galaxies, scientists will practice in virtual cosmos", "url": "https://www.independent.co.uk/space/nasa-james-webb-space-telescope-hubble-space-telescope-simulations-b2023748.html", "urlToImage": "https://static.independent.co.uk/2022/02/25/22/Hubble%20Ultra%20Deep%20Field%202014.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-02-26T00:58:57Z", "content": "When fully operational this summer, the James Webb Space Telescope will train its record-breaking optics on the distant darkness in the hope of imaging objects never seen before the very first stars … [+2427 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Nasa’s next big space telescope could see Jupiter-sized exoplanets - The Independent", "description": "The Nancy Grace Roman Space Telescope will offer a new window on exoplanets — in visible light.", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/space/nasa-space-telescope-jupiter-exoplanets-b2023774.html", "urlToImage": "https://static.independent.co.uk/2022/02/26/00/Nasa%20Exoplanet.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-02-26T00:44:56Z", "content": "Even as the James Webb Space Telescope inches closer to beginning its science mission, experts are already thinking about the next big space telescope, Nasas Nancy Grace Roman telescope.\r\nIn a Thursd… [+1883 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Non-invasive ultrasonography to evaluate gonad reproductive condition in abalones - News-Medical.Net", "description": "The world's abalone are threatened, endangered or otherwise vulnerable in nearly every corner of the planet. While captive breeding efforts are underway for some species, these giant sea snails are notoriously difficult to spawn.", "url": "https://www.news-medical.net/news/20220225/Non-invasive-ultrasonography-to-evaluate-gonad-reproductive-condition-in-abalones.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/6/Chem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2022-02-25T23:24:00Z", "content": "The world's abalone are threatened, endangered or otherwise vulnerable in nearly every corner of the planet. While captive breeding efforts are underway for some species, these giant sea snails are n… [+4212 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Argentina scientists unearth dinosaur with ‘puny arms’ and hard head - The Guardian", "description": "Dinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey", "url": "https://amp.theguardian.com/science/2022/feb/25/argentina-dinosaur-fossil-skull-guemesia-ochoai", "urlToImage": null, "publishedAt": "2022-02-25T23:24:00Z", "content": "DinosaursDinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey\r\nFri 25 Feb 2022 22.56 GMT\r\nScientists in Argentina have unearthed the remains of … [+2420 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels ̵... - Verve Times", "description": "An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels for transportation. But this reaction has to be facilitated by a catalyst material, and today's", "url": "https://vervetimes.com/the-material-could-replace-rare-metals-and-lead-to-more-economical-production-of-carbon-neutral-fuels-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-25T23:10:12Z", "content": "An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels for transportation. But this reaction has to… [+5374 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "2 Supermassive Black Holes Are Locked in The Tightest Orbit We've Seen Yet - ScienceAlert", "description": "A dance of death is taking place at the heart of a galaxy in the distant Universe.", "url": "https://www.sciencealert.com/two-supermassive-black-holes-have-been-found-locked-in-the-tightest-orbit-yet", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/binary-supermassive-black-hole_1024.jpg", "publishedAt": "2022-02-25T23:01:06Z", "content": "A dance of death is taking place at the heart of a galaxy in the distant Universe.\r\nSome 10 billion light-years away, two supermassive black holes are locked in an orbit so tight that they will colli… [+4362 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "USRA Remembers Dr. Judith Pipher, Former Vice Chair of USRA Board of Trustees - PRNewswire", "description": "/PRNewswire/ -- It is with great sadness that USRA reports the passing of Dr. Judith L. Pipher, former Vice Chair of the USRA Board of Trustees, Professor...", "url": "https://www.prnewswire.com/news-releases/usra-remembers-dr-judith-pipher-former-vice-chair-of-usra-board-of-trustees-301490954.html", "urlToImage": "https://mma.prnewswire.com/media/808782/USRA___Logo.jpg?p=facebook", "publishedAt": "2022-02-25T22:51:00Z", "content": "COLUMBIA, Md., Feb. 25, 2022 /PRNewswire/ -- It is with great sadness that USRA reports the passing of Dr. Judith L. Pipher, former Vice Chair of the USRA Board of Trustees, Professor Emerita at Univ… [+2435 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Breakthrough discovery in light interactions with nanoparticles paves the way for advances in optical computing - Phys.org", "description": "Computers are an indispensable part of our daily lives, and the need for ones that can work faster, solve complex problems more efficiently, and leave smaller environmental footprints by minimizing the required energy for computation is increasingly urgent. R…", "url": "https://phys.org/news/2022-02-breakthrough-discovery-interactions-nanoparticles-paves.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/research-team-makes-br.jpg", "publishedAt": "2022-02-25T22:07:37Z", "content": "Computers are an indispensable part of our daily lives, and the need for ones that can work faster, solve complex problems more efficiently, and leave smaller environmental footprints by minimizing t… [+3061 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Graphene sensor rapidly detects opioid metabolites in wastewater - Phys.org", "description": "The unique properties of the atom-thick sheet of carbon, known as graphene, enabled a new penny-sized, multiplexed bio-sensor that's the first to detect opioid byproducts in wastewater, a team of researchers from Boston College, Boston University, and Giner L…", "url": "https://phys.org/news/2022-02-graphene-sensor-rapidly-opioid-metabolites.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/graphene-sensor-rapidl.jpg", "publishedAt": "2022-02-25T22:05:36Z", "content": "The unique properties of the atom-thick sheet of carbon, known as graphene, enabled a new penny-sized, multiplexed bio-sensor that's the first to detect opioid byproducts in wastewater, a team of res… [+6152 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "A good day to die: doom for the dinosaurs came in springtime - Geo News", "description": "Well-preserved fish fossils unearthed at the site are providing a deeper understanding of one of the worst days in the history of life on Earth, said scientists", "url": "https://www.geo.tv/latest/401620-a-good-day-to-die-doom-for-the-dinosaurs-came-in-springtime", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2022-02-26/401620_025110_updates.jpg", "publishedAt": "2022-02-25T21:46:15Z", "content": "<ul><li>The ensuing mass extinction erased about three-quarters of Earth's species.</li><li>The researchers determined that it was springtime at the fossil site called the Tanis deposit.</li><li>Spri… [+4174 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "Hubble Captures 'Space Triangle' Created by Colliding Galaxies - PetaPixel", "description": "The birth of stars caused by a galactic collision.", "url": "https://petapixel.com/2022/02/25/hubble-captures-space-triangle-created-by-colliding-galaxies/", "urlToImage": "https://petapixel.com/assets/uploads/2022/02/Hubble-Captures-Space-Triangle-of-Colliding-Galaxies.jpg", "publishedAt": "2022-02-25T21:23:55Z", "content": "Hubble has captured a stunning photo of two interacting galaxies that likely passed through one another, which caused them to ignite in a “frenzy of starbirth.” \r\nCollectively Called Arp 143\r\nThis he… [+3613 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Asexual reproduction can negatively impact evolution • Earth.com - Earth.com", "description": "Asexual reproduction can negatively impact evolution • Earth.com", "url": "https://www.earth.com/news/asexual-reproduction-can-negatively-impact-evolution/", "urlToImage": "https://cff2.earth.com/uploads/2022/02/25135820/Stick-insect-scaled.jpg", "publishedAt": "2022-02-25T21:10:08Z", "content": "In the animal kingdom, offspring are produced via two main reproductive pathways: sexual, through the fertilization between male and female gametes, and asexual, when offspring emerge through a singl… [+1962 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "James Webb Space Telescope Delivers Splendid Star Image as Mirrors Align - CNET", "description": "NASA reports Webb's critical mirror alignment process is coming along beautifully.", "url": "https://www.cnet.com/news/james-webb-space-telescope-delivers-splendid-star-image-as-mirrors-align/", "urlToImage": "https://www.cnet.com/a/img/cu1w09Z1X-2_xe-YVwZJyQN7KUQ=/1200x630/2022/02/25/029fdb32-d938-4d1c-b121-ed5cd8b7dd14/webbpostimagestacking.jpg", "publishedAt": "2022-02-25T21:04:00Z", "content": "The \"image stacking\" phase of the Webb telescope alignment involves the creation of a single unified image out of multiple images. This is 18 segments stacked to show a single star.\r\nNASA/STScI\r\nWhen… [+2088 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "SpaceX makes its case for space sustainability with latest Starlink launch - SpaceNews", "description": "SpaceX launched another set of Starlink satellites Feb. 25 as the company argues its satellite constellation is consistent with space sustainability.", "url": "https://spacenews.com/spacex-makes-its-case-for-space-sustainability-with-latest-starlink-launch/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/02/f9-starlink-20220225.jpg", "publishedAt": "2022-02-25T20:48:38Z", "content": "WASHINGTON SpaceX launched another set of Starlink satellites Feb. 25 as the company argues its satellite constellation is consistent with the safe and sustainable use of low Earth orbit.\r\nA Falcon 9… [+3926 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Biggest bacterium ever discovered amazes scientists with its complexity - Livescience.com", "description": "A newfound bacterium is bigger than a fruit fly.", "url": "https://www.livescience.com/biggest-bacterium-ever-discovered-complex", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nQNbSjhpzr54VkHpTHAXQZ-1200-80.jpg", "publishedAt": "2022-02-25T20:02:10Z", "content": "Scientists discovered an absolutely massive bacterium that can be seen without the aid of a microscope and lurks among the mangroves of Grande-Terre in the Caribbean, Science magazine reported\r\n.\r\nTh… [+2439 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "SpaceX Mars City: New study solves a major problem with living off-Earth - Inverse", "description": "New research reveals that electrolysis does work at lower gravitational levels. The findings could support the idea that humans could travel to Mars, use the planet's resources to refuel, and return home.", "url": "https://www.inverse.com/innovation/mars-city-moon-electrolysis", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2020/1/29/abfc9008-c87b-49c0-b3a0-6f77ef794ad9-shutterstock-731611657.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-25T20:00:25Z", "content": "Humanity could establish\r\nbases on other planets and guarantee their supply of oxygen using new techniques discovered here on Earth. \r\nThe discovery \r\n Research published earlier this month reveals t… [+3939 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Vivian Omotori", "title": "UK Space Agency to co-host Summit for Space Sustainability - TDPel Media", "description": "The UK Space Agency will co-host a global summit to agree new ways of ensuring a safe, sustainable and secure space environment, including tackling space", "url": "https://tdpelmedia.com/uk-space-agency-to-co-host-summit-for-space-sustainability", "urlToImage": "https://tdpelmedia.com/wp-content/uploads/2022/02/fig-25-02-2022_19-00-33.jpg", "publishedAt": "2022-02-25T19:29:22Z", "content": "Skip to content\r\nThe UK Space Agency will co-host a global summit to agree new ways of ensuring a safe, sustainable and secure space environment, including tackling space debris which threatens the s… [+4246 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "An Exoplanet is Definitely Orbiting Two Stars - Universe Today", "description": "Remember that iconic scene in Star Wars, where a young Skywalker steps out onto the surface of Tatooine and watches the setting of two suns? As it turns out, this may be what it is like for lifeforms on the exoplanet known as Kepler-16, a rocky planet that or…", "url": "https://www.universetoday.com/154667/an-exoplanet-is-definitely-orbiting-two-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/02/587854main_Kepler16_planetpov_art_full.jpg", "publishedAt": "2022-02-25T18:41:38Z", "content": "Remember that iconic scene in Star Wars, where a young Skywalker steps out onto the surface of Tatooine and watches the setting of two suns? As it turns out, this may be what it is like for lifeforms… [+4683 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "A Rocket Booster Is About to Hit the Moon, But No One Is Sure Where It Came From - Mental Floss", "description": "The booster is set to collide with the moon in days, but no one seems to be taking responsibility for it.", "url": "https://www.mentalfloss.com/article/655655/rocket-booster-about-crash-moon", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1124,w_2000,x_0,y_188/v1645810087/shape/mentalfloss/655655-just_super-gettyimages-1191166008.jpg?itok=7ETvPsjh", "publishedAt": "2022-02-25T18:36:30Z", "content": "The far side of the moon is set to receive an impact next montha spent rocket booster. But no one appears ready to take responsibility for it.\r\nAccording to Reuters, the rocket booster is due to hit … [+1187 chars]"}, {"source": {"id": null, "name": "Mindmatters.ai"}, "author": null, "title": "Single Neurons Perform Complex Math — Even in Fruit Flies - Walter Bradley Center for Natural and Artificial Intelligence", "description": "The fly’s specialized neurons either multiply or divide incoming signals in order to pinpoint the location of a sound or the direction of movement.", "url": "https://mindmatters.ai/2022/02/single-neurons-perform-complex-math-even-in-fruit-flies/", "urlToImage": "https://mindmatters.ai/wp-content/uploads/sites/2/2022/02/super-macro-shot-tiny-fruit-flies-on-the-top-of-a-banana-skin-stockpack-adobe-stock-scaled.jpg", "publishedAt": "2022-02-25T18:29:17Z", "content": "We may not think of our neurons as performing complex calculations but they must do so in order to determine where sound is coming from or where a moving object is headed. For a long while, how they … [+4442 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "New Quantum Gravity Sensor Can Look Under Earth's Surface in Unprecedented Detail - ScienceAlert", "description": "Scientists would be able to discover much more about what lies underground if our planet could be sliced open and viewed as a cross-section – but as that's not really possible, they have to rely on a variety of other methods instead.", "url": "https://www.sciencealert.com/quantum-gravity-sensor-enables-us-to-look-under-earth-s-surface-in-scientific-first", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/AbstractBlueWavesOnADarkBackground_1024.jpg", "publishedAt": "2022-02-25T17:00:46Z", "content": "Scientists would be able to discover much more about what lies underground if our planet could be sliced open and viewed as a cross-section but as that's not really possible, they have to rely on a v… [+3454 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "What brain-eating amoebae can tell us about the diversity of life on earth and evolutionary history - Science Daily", "description": "Researchers recently announced that an amoeba called Naegleria has evolved more distinct sets of tubulins, used for specific cellular processes, than previously thought. Their insight has a host of implications, which range from developing treatments for brai…", "url": "https://www.sciencedaily.com/releases/2022/02/220225085843.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-25T16:48:39Z", "content": "An international team of researchers, led by the University of Massachusetts Amherst, recently announced in the journal Current Biology that an amoeba called Naegleria has evolved more distinct sets … [+4381 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Using lasers and a long-term experiment to investigate how deer change a forest canopy - Phys.org", "description": "University of Minnesota researchers are using high-frequency lasers to learn more about how deer populations influence forest landscapes. From the far northern forests of Canada, through the temperate forests of the U.S. Midwest, to the tropical forests of Co…", "url": "https://phys.org/news/2022-02-lasers-long-term-deer-forest-canopy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/using-lasers-and-a-lon.jpg", "publishedAt": "2022-02-25T16:15:51Z", "content": "University of Minnesota researchers are using high-frequency lasers to learn more about how deer populations influence forest landscapes. From the far northern forests of Canada, through the temperat… [+4303 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The rise and fall of the riskiest asteroid in a decade - Phys.org", "description": "Initial observations of an asteroid dubbed \"2022 AE1\" showed a potential Earth impact on 4 July 2023—not enough time to attempt deflection and large enough to do real damage to a local area should it strike.", "url": "https://phys.org/news/2022-02-fall-riskiest-asteroid-decade.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-rise-and-fall-of-t.jpg", "publishedAt": "2022-02-25T15:40:08Z", "content": "Initial observations of an asteroid dubbed \"2022 AE1\" showed a potential Earth impact on 4 July 2023not enough time to attempt deflection and large enough to do real damage to a local area should it … [+7681 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New simulations refine axion mass, refocusing dark matter search: Using adaptive mesh refinement, supercomputer simulation narrows axion mass range - Science Daily", "description": "Axions are today's most popular candidate for dark matter, and numerous experiments are trying to detect them in microwave cavities where the axion should rarely convert into an electromagnetic wave. But a new simulation of the production of axions in the ear…", "url": "https://www.sciencedaily.com/releases/2022/02/220225085845.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-25T15:03:08Z", "content": "Physicists searching -- unsuccessfully -- for today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axion… [+10916 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Elizabeth Howell", "title": "A new fast radio burst challenges what astronomers thought they knew about them - Inverse", "description": "A galaxy of old stars could tell a new tale — a fast radio burst coming from a galaxy of old stars, rather than new ones as previously seen.", "url": "https://www.inverse.com/science/fast-radio-burst-source", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/2/24/790f111c-eaa7-4668-8131-2cc8d7004539-frb-magnetar-m81-16-9-medium-res-1024x576.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-25T15:00:27Z", "content": "Scientists traced\r\n a mysterious fast radio burst (FRB) to a strange location: a galaxy filled with old stars, instead of the zones of young stars where such events were found before.\r\nThe high-resol… [+4928 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New approach enables faster characterization of CRISPR immune systems - Phys.org", "description": "For many diseases, the tools of medicine are reaching their limits. CRISPR technologies open new avenues for diagnostics and therapies, although the natural source of CRISPR remains largely untapped. Scientists from the Helmholtz Institute for RNA-based Infec…", "url": "https://phys.org/news/2022-02-approach-enables-faster-characterization-crispr.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-approach-enables-f.jpg", "publishedAt": "2022-02-25T14:10:02Z", "content": "For many diseases, the tools of medicine are reaching their limits. CRISPR technologies open new avenues for diagnostics and therapies, although the natural source of CRISPR remains largely untapped.… [+3648 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Uniting with the enemy: How microbes protect against pathogens in plants - Phys.org", "description": "Researchers at the Max Planck Institute for Biology Tübingen have discovered how benign strains of Pseudomonas protect against their harmful bacterial relatives. The study, now published in Nature Ecology & Evolution, shows that the coexistence of beneficial …", "url": "https://phys.org/news/2022-02-enemy-microbes-pathogens.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/uniting-with-the-enemy.jpg", "publishedAt": "2022-02-25T14:10:01Z", "content": "Researchers at the Max Planck Institute for Biology Tübingen have discovered how benign strains of Pseudomonas protect against their harmful bacterial relatives. The study, now published in Nature Ec… [+3772 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "What It Would Take to Bring the ISS Back to Earth in One Piece - Verve Times", "description": "To keep the ISS orbiting until 2031, the space agencies that maintain it need to periodically do something to counteract this drag force. The ISS doesn’t have its own rocket engines, so it needs a reboost, or a push from a resupply craft. A reboost n", "url": "https://vervetimes.com/what-it-would-take-to-bring-the-iss-back-to-earth-in-one-piece/", "urlToImage": "https://media.wired.com/photos/6217b284e15f63f9560fa157/191:100/w_1280,c_limit/Science_iss066e080453.jpg", "publishedAt": "2022-02-25T13:46:15Z", "content": "To keep the ISS orbiting until 2031, the space agencies that maintain it need to periodically do something to counteract this drag force. The ISS doesnt have its own rocket engines, so it needs a reb… [+2540 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "New Imaging Method to Measure Quality of 3D-Printed Metal Components - AZoM", "description": "Researchers from Nanyang Technological University, Singapore (NTU Singapore) have formulated a fast and economical imaging technique that can examine the structure of three-dimensional (3D)-printed metal parts and provide insights into the material’s quality.", "url": "https://www.azom.com/news.aspx?newsID=58362", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_58362_16457871538406167.png", "publishedAt": "2022-02-25T13:37:00Z", "content": "Researchers from Nanyang Technological University, Singapore (NTU Singapore) have formulated a fast and economical imaging technique that can examine the structure of three-dimensional (3D)-printed m… [+4975 chars]"}, {"source": {"id": null, "name": "Resources.org"}, "author": null, "title": "In Pursuit of a Sustainable Space Environment: Economic Issues in Regulating Space - Resources Magazine", "description": "Molly Macauley’s 1993 analysis of space debris anticipated, by many years, a problem that now receives routine press attention. Because of related uncertainties and complex benefit-cost considerations, related regulations must be considered carefully.", "url": "https://www.resources.org/archives/in-pursuit-of-a-sustainable-space-environment-economic-issues-in-regulating-space/", "urlToImage": "https://media.rff.org/images/Space_Shuttle.width-600.png", "publishedAt": "2022-02-25T13:09:23Z", "content": "Command-and-control regulation, in which government would specify the technologies and methods to be used in mitigating debris, would attain these benefits. However, if the general experience with co… [+2595 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Nina Strochlic", "title": "This 4,000-year-old skull just received a new face - National Geographic", "description": "Buried during the Stone Age, this woman once roamed the forests of northern Sweden. Now archaeologists have reconstructed her face.", "url": "https://www.nationalgeographic.com/history/article/this-4000-year-old-skull-just-received-a-new-face", "urlToImage": "https://i.natgeofe.com/n/5e302a3d-5209-46bf-a3ee-47835012b6c4/Lagmansoren_IMG_6350_16x9.jpg?w=1200", "publishedAt": "2022-02-25T12:28:16Z", "content": "For 4,000 years, a woman lay undisturbed in a stone-lined grave amid the forests of northeastern Sweden. She had likely followed animal migrations through the trees and along the Indalsälven river. W… [+5135 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA's daring Parker Solar Probe spacecraft zips past the sun again today - Space.com", "description": "It will zoom close to 5 million miles from the sun's surface.", "url": "https://www.space.com/parker-solar-probe-close-approach-february-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uHo6oES2T6nxjgNwJek8vV-1200-80.jpg", "publishedAt": "2022-02-25T12:16:07Z", "content": "The Parker Solar Probe is ready to make its 11th close flyby of the sun during its quest to understand how our neighboring star works.\r\nThe plucky spacecraft, heavily shielded against the sun's radia… [+2403 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "A hot Jupiter exoplanet's dark side revealed - EarthSky", "description": null, "url": "https://earthsky.org/space/hot-jupiter-exoplanet-dark-side-wasp-121b/", "urlToImage": null, "publishedAt": "2022-02-25T12:11:20Z", "content": "Artist’s concept of WASP-121 b, a hot Jupiter whose dark side hosts iron clouds, titanium rain, and violent winds. Image via Engine House VFX/ MIT.\r\nAstronomers have gotten their best view yet of the… [+5561 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Ajay Narendra, Ayse Yilmaz-Heusinger, Ioannis Pisokas", "title": "The insect brain: we froze ants and beetles to learn how they remember their way home - The Conversation UK", "description": "Insects such as ants and beetles use ingenious processes in their brains to work out how far they’ve travelled and in what direction - we’ve now discovered how they remember their way home.", "url": "https://theconversation.com/the-insect-brain-we-froze-ants-and-beetles-to-learn-how-they-remember-their-way-home-177763", "urlToImage": "https://images.theconversation.com/files/448520/original/file-20220225-19-o70xdv.jpg?ixlib=rb-1.1.0&rect=160%2C0%2C860%2C430&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-25T11:51:00Z", "content": "We humans are versatile and accomplished navigators, but insects might have navigation skills that are even better. For them, its literally a matter of life and death and thats why we decided to free… [+5549 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Station Gears Up for Spacewalks While Conducting Cancer Research - SciTechDaily", "description": "Spacewalk preparations and cancer research were among the activities scheduled aboard the International Space Station on Thursday. The Expedition 66 crew also unpacked a U.S. cargo craft and explored using virtual reality while exercising. NASA astronauts Raj…", "url": "https://scitechdaily.com/space-station-gears-up-for-spacewalks-while-conducting-cancer-research/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronaut-Drew-Feustel-ISS-Crop.jpg", "publishedAt": "2022-02-25T10:46:45Z", "content": "NASA astronaut Drew Feustel is pictured tethered to the International Space Station just outside of the Quest airlock during a spacewalk he conducted with fellow NASA astronaut Ricky Arnold (out of f… [+2270 chars]"}, {"source": {"id": null, "name": "Azertag.az"}, "author": null, "title": "Mystery of Tutankhamun's meteorite 'space dagger' finally solved - AZERTAC News", "description": "The mystery surrounding ancient Egyptian pharaoh Tutankhamun’s resplendent dagger has finally been solved. Archaeologists have finally solved a mystery surrounding a dagger that belonged to King Tutankhamun 3400 years ago. A fresh analysis", "url": "https://azertag.az/en/xeber/Mystery_of_Tutankhamuns_meteorite_space_dagger_finally_solved-2029238", "urlToImage": "https://azertag.az/files/2022/1/1200x630/16457858301981350509_1200x630.jpeg", "publishedAt": "2022-02-25T10:44:23Z", "content": "Baku, February 25, AZERTAC\r\nThe mystery surrounding ancient Egyptian pharaoh Tutankhamun’s resplendent dagger has finally been solved.\r\nArchaeologists have finally solved a mystery surrounding a dagg… [+1764 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Hidden mechanical weaknesses within lava domes provided by buried high-porosity hydrothermal alteration zones | Scientific Reports - Nature.com", "description": "Scientific Reports - Hidden mechanical weaknesses within lava domes provided by buried high-porosity hydrothermal alteration zones", "url": "https://www.nature.com/articles/s41598-022-06765-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-06765-9/MediaObjects/41598_2022_6765_Fig1_HTML.png", "publishedAt": "2022-02-25T10:38:25Z", "content": "<li>Norton, G. E. et al. Pyroclastic flow and explosive activity at Soufrière Hills Volcano, Montserrat, during a period of virtually no magma extrusion (March 1998 to November 1999). Geol. Soc. Lond… [+17969 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "New No-Free-Lunch theorem for quantum neural networks gives hope for quantum speedup — ScienceDaily - Verve Times", "description": "The field of machine learning on quantum computers got a boost from new research removing a potential roadblock to the practical implementation of quantum neural networks. While theorists had previously believed an exponentially large training set wo", "url": "https://vervetimes.com/new-no-free-lunch-theorem-for-quantum-neural-networks-gives-hope-for-quantum-speedup-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-25T05:11:04Z", "content": "The field of machine learning on quantum computers got a boost from new research removing a potential roadblock to the practical implementation of quantum neural networks. While theorists had previou… [+2300 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Outlines Final Steps Before Launch of Artemis 1, First in New Lunar Program - Gizmodo Australia", "description": "In a press conference Thursday, NASA described the final steps in anticipation of the Artemis 1 uncrewed test flight, which...", "url": "https://www.gizmodo.com.au/2022/02/nasa-outlines-final-steps-before-launch-of-artemis-1-first-in-new-lunar-program/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/25/5b00f315566ad156fe58984e08e24183.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-25T04:54:00Z", "content": "In a press conference Thursday, NASA described the final steps in anticipation of the Artemis 1 uncrewed test flight, which set to occur this spring. The immediate focus is on a wet dress rehearsal o… [+2991 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "TAMMY SEWELL", "title": "They find the remains of a prehistoric crocodile that devoured a dinosaur before dying - OI Canadian", "description": "When dying, the crocodile's stomach still held some undigested remains of its last supper, a dinosaur. 95 million years ago, a prehistoric crocodile that roamed the swamps of what is now Australia hun", "url": "https://oicanadian.com/they-find-the-remains-of-a-prehistoric-crocodile-that-devoured-a-dinosaur-before-dying/", "urlToImage": "https://dam.ngenespanol.com/wp-content/uploads/2022/02/cocodrilo-prehistórico-dinosaurio.jpeg", "publishedAt": "2022-02-25T04:39:51Z", "content": "95 million years ago, a prehistoric crocodile that roamed the swamps of what is now Australia hunted down a small dinosaur and after a brief struggle, managed to devour it in a couple of bites.\r\nThe … [+2394 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Discovery of new building blocks of life on Ceres suggests a geologically active dwarf planet - BollyInside", "description": "The new findings are not the first evidence of organic material on Ceres. Scientists working on Nasa’s Dawn mission, which visited Ceres, first announced", "url": "https://www.bollyinside.com/news/discovery-of-new-building-blocks-of-life-on-ceres-suggests-a-geologically-active-dwarf-planet", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-25T04:18:22Z", "content": "The new findings are not the first evidence of organic material on Ceres. Scientists working on Nasas Dawn mission, which visited Ceres, first announced the discovery of organic materials in 2017, an… [+2597 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UH researchers develop 3D imaging technique t - EurekAlert", "description": "As the world lessens its dependence on fossil fuels, industries and manufacturers are turning to lithium-ion batteries to power the machines that make modern life possible. These batteries power electric vehicles, mobile phones, drones, vacuum cleaning robots…", "url": "https://www.eurekalert.org/news-releases/944637", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-25T02:00:59Z", "content": "As the world lessens its dependence on fossil fuels, industries and manufacturers are turning to lithium-ion batteries to power the machines that make modern life possible. These batteries power elec… [+2619 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Mycorrhizal fungi promote greater tree species diversity - Science Daily", "description": "Researchers have found that mycorrhizas promote greater tree species diversity in North American forests.", "url": "https://www.sciencedaily.com/releases/2022/02/220224112647.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-25T01:35:48Z", "content": "Fungi, specifically those that are \"mycorrhizal,\" are natural allies of the forest because they improve tree nutrient acquisition. But which of the mycorrhizal feeding strategies yields the greatest … [+5081 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "江巍", "title": "Moon rover discovers glass - Chinadaily.com.cn - Chinadaily USA", "description": "After finding a \"mystery hut\" that turned out to be a rabbit-shaped rock, China's Yutu 2 lunar rover has once again spotted interesting things on our celestial neighbor－two glass spheres.", "url": "https://www.chinadaily.com.cn/a/202202/25/WS62182e2aa310cdd39bc88d31.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202202/25/6218325da310cdd3d830133d.png", "publishedAt": "2022-02-25T01:17:00Z", "content": "\"Globules\" images Yutu 2 collects. [Photo/China National Space Administration] \r\nYutu 2 collects images of \"globules\" likely created during meteor impacts\r\nAfter finding a \"mystery hut\" that turned o… [+2962 chars]"}, {"source": {"id": null, "name": "Katherinetimes.com.au"}, "author": null, "title": "Blue octocoral unique to Sunshine Coast - Katherine Times", "description": "Vibrant blue octocorals found in the intertidal pools at Caloundra on the Sunshine Coast are a completely new species of cnidarian, scientists have found. Cni...", "url": "https://www.katherinetimes.com.au/story/7635401/blue-octocoral-unique-to-sunshine-coast/", "urlToImage": "https://www.katherinetimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/f21dba29-42ea-457e-96ba-6edcfb3212b5.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2022-02-25T01:13:54Z", "content": ""}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Seeing' non-uniformities in 2D materials may lead to new medical sensors - Science Daily", "description": "A novel and better approach at detecting non-uniformities in the optical properties of two-dimensional materials could potentially open the door to new uses for these materials.", "url": "https://www.sciencedaily.com/releases/2022/02/220224180317.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-24T23:50:40Z", "content": "A novel and better approach at detecting non-uniformities in the optical properties of two-dimensional materials could potentially open the door to new uses for these materials, such as for drug dete… [+7230 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Charlotte Edwards", "title": "‘Interstellar sails’ that propel spacecraft to speed of light using LASERS could take us to distant pla... - The Sun", "description": "", "url": "https://www.the-sun.com/tech/4763140/interstellar-sails-spacecraft-lasers/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/02/NINTCHDBPICT000714388836.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-24T22:31:00Z", "content": "SPACECRAFT with sails could be propelled by lasers to the closest habitable planet to Earth.\r\nThat's according to new calculations from researchers who think small spacecraft could be our best chance… [+2537 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Newly devised human family tree reveals the 'genealogy of everyone' - Nippon.com", "description": "By Will Dunham               WASHINGTON (Reuters) -     From bustling Tokyo to the Isle of Man in the Irish Se…", "url": "https://www.nippon.com/en/news/reu20220225KBN2KT399/", "urlToImage": "https://www.nippon.com/en/ncommon/contents/news/1595539/1595539.jpg", "publishedAt": "2022-02-24T21:28:37Z", "content": "<ul><li>Home</li><li>News</li><li>Newly devised human family tree reveals the 'genealogy of everyone'</li></ul>Newsfrom Japan\r\nFeb 25, 2022By Will Dunham\r\nWASHINGTON (Reuters) - From bustling Tokyo t… [+4371 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "TAMMY SEWELL", "title": "Puzzled astronomers! Lonely black hole found - OI Canadian", "description": "Matheus Manente Meteored Brazil Yesterday 4 minutes Scientists have spotted a lone black hole for the first time, and it looks like they're numerous. The solar system could be in danger. (image: Gerd", "url": "https://oicanadian.com/puzzled-astronomers-lonely-black-hole-found/", "urlToImage": "https://services.meteored.com/img/article/astronomos-ficam-perplexos-ao-encontrar-buraco-negro-solitario-1645072846663_1280.jpg", "publishedAt": "2022-02-24T20:10:48Z", "content": "Matheus Manente Meteored Brazil\r\nYesterday\r\n4 minutes\r\nScientists have spotted a lone black hole for the first time, and it looks like they’re numerous. The solar system could be in danger. (image: G… [+2937 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Student's device enables researchers to easily track elusive insects - Science Daily", "description": "With some home security software and a little ingenuity, researchers have developed an inexpensive device that will allow them to study the behavior and activity of insects in regions of the world where they're most diverse.", "url": "https://www.sciencedaily.com/releases/2022/02/220224120640.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-24T20:08:08Z", "content": "With some home security software and a little ingenuity, researchers have developed an inexpensive device that will allow them to study the behavior and activity of insects in regions of the world wh… [+5451 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "http://www.facebook.com/thegoodnewsnetwork", "title": "Sound Waves Convert Stem Cells Into Bone in Regenerative Breakthrough - Good News Network", "description": "Researchers have used sound waves to turn stem cells into bone cells, in a tissue engineering advance that could one day help patients regrow bone.", "url": "https://www.goodnewsnetwork.org/stem-cells-sound-waves-bones-rmit/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2022/02/A-microscope-image-of-stem-cells-turning-into-bone-cells-–-green-indicates-collagen-which-the-cells-produce-as-a-by-product-of-the-process-rmit-released.jpg", "publishedAt": "2022-02-24T16:05:19Z", "content": "The innovative stem cell treatment from RMIT researchers offers a smart way forward for overcoming some of the fields biggest challenges, through the precision power of high-frequency sound waves.\r\nT… [+2705 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Fight or flight? How birds are helping to reveal the mysteries of evolution - Newswise", "description": "New research from the University of Massachusetts Amherst uncovers the negative link between flightworthiness and fight-worthiness in birds.", "url": "https://www.newswise.com/articles/fight-or-flight-how-birds-are-helping-to-reveal-the-mysteries-of-evolution", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-02-24T16:05:00Z", "content": "Newswise — AMHERST, Mass. – New research from the University of Massachusetts Amherst uncovers the negative link between flightworthiness and fight-worthiness in birds. Evolutionary pressure demanded… [+2704 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Ytterbium Largely Originates from Supernova Explosion, Research Says - AZoQuantum", "description": "A research group headed by Lund University in Sweden has given a vital clue to the origin of the element Ytterbium present in the Milky Way, by revealing that the element mainly originates from supernova explosions.", "url": "https://www.azoquantum.com/News.aspx?newsID=8804", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_8804_16456998387449760.jpg", "publishedAt": "2022-02-24T14:20:00Z", "content": "A research group headed by Lund University in Sweden has given a vital clue to the origin of the element Ytterbium present in the Milky Way, by revealing that the element mainly originates from super… [+2826 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Superhuge shockwave bigger than Milky Way galaxy is travelling through space - WION", "description": "Galaxies are huge. Really huge. Our Milky Way galaxy is so huge that it would take light (at 300,000 kilometres per second) would take 100,000 years to travel from one end of the galaxy to the other.", "url": "https://www.wionews.com/science/superhuge-shockwave-bigger-than-milky-way-galaxy-is-travelling-through-space-456082", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/02/24/243100-shockwave.jpg", "publishedAt": "2022-02-24T12:45:00Z", "content": "Galaxies are huge. Really huge. Our Milky Way galaxy is so huge that it would take light (at 300,000 kilometres per second) would take 100,000 years to travel from one end of the galaxy to the other.… [+1045 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "Artificial neurons 'close' Venus flytrap - ecns", "description": "The latest research has found that an artificial neuron could be connected to the cells of a Venus flytrap and induce its leaves to close.", "url": "http://www.ecns.cn/news/cns-wire/2022-02-24/detail-ihavwrts3795820.shtml", "urlToImage": "", "publishedAt": "2022-02-24T07:11:04Z", "content": "(ECNS) -- The latest research has found that an artificial neuron could be connected to the cells of a Venus flytrap and induce its leaves to close.\r\nSimone Fabiano at Linköping University in Norrköp… [+1151 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Water filtration membranes morph like cells - Verve Times", "description": "A multidisciplinary team of researchers from the U.of I. are the first to observe and model nanoscale morphogenesis – a process common in nature – in synthetic materials. Co-authors of", "url": "https://vervetimes.com/water-filtration-membranes-morph-like-cells/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/water-filtration-membr.jpg", "publishedAt": "2022-02-24T03:19:09Z", "content": "A multidisciplinary team of researchers from the U.of I. are the first to observe and model nanoscale morphogenesis a process common in nature in synthetic materials. Co-authors of the study, from le… [+4659 chars]"}]}