{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Massive Asteroid Impact Crater in Greenland Occurred a Few Million Years After Dinosaurs Went Extinct - SciTechDaily", "description": "Danish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater buried under a kilometer of Greenlandic ice. The dating ends speculation that the meteorite impacted after the appearance of humans and opens up a new…", "url": "https://scitechdaily.com/massive-asteroid-impact-crater-in-greenland-occurred-a-few-million-years-after-dinosaurs-went-extinct/", "urlToImage": "https://scitechdaily.com/images/Fieldwork-Edge-of-Greenland-Ice-Sheet-in-2019-scaled.jpg", "publishedAt": "2022-03-10T04:47:56Z", "content": "Photo from fieldwork at the edge of the Greenland Ice Sheet in 2019. Credit: Pierre Beck\r\nDanish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater … [+5564 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA admits it may be time to study sex in space ahead of Mars missions - Daily Mail", "description": "Understanding sex, and how it will work in a low gravity environment, is essential, according to the academics from Concordia University in Montreal, Canada.", "url": "https://www.dailymail.co.uk/sciencetech/article-10595151/NASA-admits-time-study-sex-space-ahead-Mars-missions.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/18/55155043-0-image-a-33_1646852368512.jpg", "publishedAt": "2022-03-09T20:24:05Z", "content": "NASA says it is considering studying sex in space, as it is 'crucial' for future long-haul missions to the Moon and Mars, that could see astronauts away from Earth for years.\r\nThis was said in respon… [+12526 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists plan to bring back extinct Christmas Island rat by gene-editing DNA - Daily Mail", "description": "It could be possible to bring back the extinct Christmas Island rat using the CRISPR gene editing technique, according to Dr Tom Gilbert at the University of Copenhagen.", "url": "https://www.dailymail.co.uk/sciencetech/article-10594185/Scientists-plan-bring-extinct-Christmas-Island-rat.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/16/55144063-0-image-a-20_1646843199986.jpg", "publishedAt": "2022-03-09T16:37:57Z", "content": "Scientists have revealed plans to bring back the extinct Christmas Island rat, 119 years after it was wiped out. \r\nIn a new paper, an international team of academics outline how the use of CRISPR a g… [+9348 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The evolution, evolvability and engineering of gene regulatory DNA - Nature.com", "description": "A framework for studying&nbsp;and engineering gene regulatory DNA&nbsp;sequences, based on deep neural sequence-to-expression models trained&nbsp;on&nbsp;large-scale libraries of random DNA, provides insight into the evolution, evolvability and fitness landsc…", "url": "https://www.nature.com/articles/s41586-022-04506-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-04506-6/MediaObjects/41586_2022_4506_Fig1_HTML.png", "publishedAt": "2022-03-09T16:29:36Z", "content": "<li>Wittkopp, P. J. &amp; Kalay, G. Cis-regulatory elements: molecular mechanisms and evolutionary processes underlying divergence. Nat. Rev. Genet.13, 5969 (2011).\r\nPubMed \r\nGoogle Scholar \r\n</li><l… [+22736 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Meteor streaks through Jupiter's atmosphere as NASA spacecraft watches - Space.com", "description": "When a rogue meteor careened through the atmosphere of Jupiter last year, it caught the attention of NASA's Juno spacecraft in orbit around the giant planet.", "url": "https://www.space.com/jupiter-meteor-spotted-by-juno-spacecraft", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Syy37LfqFLhgQa3pjiBkBT-1200-80.jpg", "publishedAt": "2022-03-09T15:00:26Z", "content": "When a rogue meteor careened through the atmosphere of Jupiter\r\n last year, it caught the attention of NASA's Juno spacecraft in orbit around the giant planet.\r\nThe brief and sudden flash in Jupiter'… [+3736 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gigantic Bubbles at Center of Milky Way Caused by Powerful Jet of Energy From Supermassive Black Hole - SciTechDaily", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy. Since then, astronomers have debated their origin. Now, a study including University of Michigan research suggests the bubbles are…", "url": "https://scitechdaily.com/gigantic-bubbles-at-center-of-milky-way-caused-by-powerful-jet-of-energy-from-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Gigantic-Bubbles.jpg", "publishedAt": "2022-03-09T10:42:06Z", "content": "The NASA visualization team created a superposition of an image of the Milky Way, taken by the European Space Agency’s Gaia space observatory, and a visualization of the simulations of the eRosita an… [+6681 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Planet forming 444 light years away contains large organic molecule - Daily Mail", "description": "Astronomers discovered the chemical, known as dimethyl ether, a key building block of life, inside the planet forming disk around the young star IRS 48.", "url": "https://www.dailymail.co.uk/sciencetech/article-10590041/Planet-forming-444-light-years-away-contains-large-organic-molecule.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/15/55099607-0-image-a-23_1646753409661.jpg", "publishedAt": "2022-03-08T16:33:43Z", "content": "A ring of dust, gas and ice 444 light years from the Earth has been found to contain a large organic molecule, that could one day go on to form life.\r\nAstronomers discovered the chemical, known as di… [+8599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Junk Just Crashed Into the Far Side of the Moon at 5,800 MPH - SciTechDaily", "description": "Observers have been tracking a chunk of space junk, waiting for it to strike the Moon. It should’ve hit the far side of the Moon, and hopefully, orbiters will have images of the impact site, though that might take a while. The origins of the junk are in dispu…", "url": "https://scitechdaily.com/space-junk-just-crashed-into-the-far-side-of-the-moon-at-5800-mph/", "urlToImage": "https://scitechdaily.com/images/Rocket-Booster-Crash-Moon.gif", "publishedAt": "2022-03-08T09:37:36Z", "content": "Artist’s animation of a rocket booster crashing into the moon.\r\nObservers have been tracking a chunk of space junk, waiting for it to strike the Moon. It should’ve hit the far side of the Moon, and h… [+8669 chars]"}]}