{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Richard Luscombe", "title": "Sharks use Earth’s magnetic field as ‘GPS’ guidance system, study says - The Guardian", "description": "Florida scientists use juvenile bonnetheads for research and say findings applicable to other ocean-going sharks", "url": "https://amp.theguardian.com/environment/2021/may/17/sharks-earth-magnetic-field-gps-guidance-system", "urlToImage": null, "publishedAt": "2021-05-17T06:00:00Z", "content": "Sharks<ul><li>Florida scientists use juvenile bonnetheads for research</li><li>Authors say findings applicable to other ocean-going sharks</li></ul>\r\nScientists in Florida have concluded that sharks … [+4004 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Zircons Date Onset of Plate Tectonics to 3.6 Billion Years Ago – Event Crucial to Making Earth Hospitable to Life - SciTechDaily", "description": "Earth's Oldest Minerals Date Onset of Plate Tectonics to 3.6 Billion Years Ago Ancient zircons from the jack hills of western Australia hone date of an event that was crucial to making the planet hospitable to life. Scientists led by Michael Ackerson, a resea…", "url": "https://scitechdaily.com/ancient-zircons-date-onset-of-plate-tectonics-to-3-6-billion-years-ago-event-crucial-to-making-earth-hospitable-to-life/", "urlToImage": "https://scitechdaily.com/images/Polished-Slice-of-a-Rock-Collected-From-Jack-Hills-of-Western-Australia.jpg", "publishedAt": "2021-05-16T20:26:58Z", "content": "Zircons studied by the research team, photographed using cathodoluminescence, a technique that allowed the team to visualize the interiors of the crystals using a specialized scanning electron micros… [+9413 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Robotic Navigation Tech – That Helped NASA's Perseverance Rover Land on Mars – Will Explore the Deep Ocean - SciTechDaily", "description": "Terrain-relative navigation helped Perseverance land – and Ingenuity fly – autonomously on Mars. Now it’s time to test a similar system while exploring another frontier. On May 14, the National Oceanic and Atmospheric Administration (NOAA) ship Okeanos Explor…", "url": "https://scitechdaily.com/robotic-navigation-tech-that-helped-nasas-perseverance-rover-land-on-mars-will-explore-the-deep-ocean/", "urlToImage": "https://scitechdaily.com/images/Orpheus-Submersible.jpg", "publishedAt": "2021-05-16T11:30:47Z", "content": "The Orpheus submersible robot is being developed by Woods Hole Oceanographic Institute and JPL to explore the deep ocean autonomously. Orpheus uses vision-based navigation that works in a similar way… [+5984 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Tiny traces of DNA found in cave dust may unlock secret life of Neanderthals - The Guardian", "description": "Advanced technique used to recover genetic material may help solve the mystery of early man", "url": "https://amp.theguardian.com/science/2021/may/16/tiny-traces-of-dna-found-in-cave-dust-may-unlock-secret-life-of-neanderthals", "urlToImage": null, "publishedAt": "2021-05-16T08:45:00Z", "content": "ArchaeologyAdvanced technique used to recover genetic material may help solve the mystery of early man\r\nSun 16 May 2021 09.45 BST\r\nScientists have pinpointed major changes in Europes Neanderthal popu… [+4937 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Could ‘engineered’ coral save the planet’s reefs from destruction? - The Guardian", "description": "London Zoo’s latest exhibition shows how scientists hope to halt the devastation caused by overheated oceans", "url": "https://amp.theguardian.com/environment/2021/may/16/could-engineered-coral-save-the-planets-reefs-from-destruction", "urlToImage": null, "publishedAt": "2021-05-16T07:28:00Z", "content": "CoralLondon Zoos latest exhibition shows how scientists hope to halt the devastation caused by overheated oceans\r\nSun 16 May 2021 08.15 BST\r\nThis weekend, conservationists will put the final touches … [+5857 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sam Hancock", "title": "Rare plutonium from space found in deep-sea crust - The Independent", "description": "Element likely found its way to Earth following multiple supernovae explosions, Sam Hancock finds", "url": "https://www.independent.co.uk/independentpremium/space-rare-deep-sea-crust-b1848148.html", "urlToImage": "https://static.independent.co.uk/2021/05/15/16/newFile-1.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-05-15T20:58:08Z", "content": "A rare radioactive plutonium isotope dating back millions of years has been found embedded in Earths crust, helping experts to understand how heavy metals form in the stars.\r\nNew research published i… [+358 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "New study says mammals can breathe through *checks notes* their butts? - BGR", "description": "I breathe through my nose and, when I have a cold, my mouth. You probably do the same. It works well and it’s kept me alive for over 35 years, so I really can’t complain. But what if we were totally missing out on a novel way of breathing that nobody ever tol…", "url": "https://bgr.com/science/butt-oxygen-supplementation-study-5925720/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/10/BGRpic-Recovered-Recovered-4.jpg?quality=70&strip=all", "publishedAt": "2021-05-15T17:35:00Z", "content": "I breathe through my nose and, when I have a cold, my mouth. You probably do the same. It works well and it’s kept me alive for over 35 years, so I really can’t complain. But what if we were totally … [+3020 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Mihir Neal", "title": "Rocket Lab to make second splashdown recovery attempt on Electron's 20th mission - NASASpaceFlight.com - NASASpaceflight.com", "description": "Rocket Lab is preparing for its twentieth launch of an Electron rocket, named “Running Out…", "url": "https://www.nasaspaceflight.com/2021/05/rocket-lab-second-recovery-electron/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/05/49D0DECF-0F9D-488C-8FE0-991B3CE710F9.jpeg", "publishedAt": "2021-05-14T19:43:21Z", "content": "Rocket Lab is preparing for its twentieth launch of an Electron rocket, named “Running Out of Toes,” carrying two Earth-observation satellites for BlackSky’s global monitoring constellation. The comp… [+10378 chars]"}]}