{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Adrian Beil & Thomas Burghardt", "title": "Methalox race likely to be won in 2022, but winner not yet clear - NASASpaceFlight.com - NASASpaceflight.com", "description": "Right now, several methane-fueled rockets are in a race to orbit. With Starship from SpaceX,…", "url": "https://www.nasaspaceflight.com/2022/03/methalox-race-to-orbit/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/03/DSC_2085_2-wmarked-526x350.jpg", "publishedAt": "2022-03-13T15:07:16Z", "content": "Right now, several methane-fueled rockets are in a race to orbit. With Starship from SpaceX, Vulcan from United Launch Alliance (ULA), and Neutron from Rocket Lab, all of the most active US launch pr… [+8495 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "An asteroid the size of a bus flies by Earth today and you can watch it live online - Space.com", "description": "See live views of the asteroid 2022 ES3 at 2:30 p.m. EDT (1830 GMT) via the Virtual Telescope Project.", "url": "https://www.space.com/asteroid-2022-es3-earth-flyby-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zjc6GdLjdfxAqhmeg2sfgU-1200-80.png", "publishedAt": "2022-03-13T12:00:11Z", "content": "You can watch a big asteroid make a safe flyby of Earth today (March 13) from any spot with good internet access.\r\nWeather permitting, the Virtual Telescope Project will livestream telescope views of… [+2769 chars]"}, {"source": {"id": null, "name": "Daily Record"}, "author": "Jamie Kay, Mya Bollan", "title": "Solar storm warning as 'strong triple threat' to hit Earth as soon as Monday - Daily Record", "description": "Experts say that there is a 20 per cent chance of the storm impacting the UK.", "url": "https://www.dailyrecord.co.uk/lifestyle/solar-storm-warning-strong-triple-26455286", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article26455310.ece/ALTERNATES/s1200/0_JS213769324.jpg", "publishedAt": "2022-03-13T11:41:49Z", "content": "A solar storm is set to hit Earth this month, according to experts. \r\nPhysicists have now predicted the exact time that the phenomena will impact our planet with the storm likely to happen in next co… [+1712 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Two Massive Blobs in Earth's Mantle Baffle Scientists With Their Surprising Properties - SciTechDaily", "description": "Earth is layered like an onion, with a thin outer crust, a thick viscous mantle, a fluid outer core, and a solid inner core. Within the mantle, there are two massive blob-like structures, roughly on opposite sides of the planet. The blobs, more formally refer…", "url": "https://scitechdaily.com/two-massive-blobs-in-earths-mantle-baffle-scientists-with-their-surprising-properties/", "urlToImage": "https://scitechdaily.com/images/Blob-in-Earths-Mantle.jpg", "publishedAt": "2022-03-12T21:11:02Z", "content": "A 3D view of the blob in Earth’s mantle beneath Africa, shown by the red-yellow-orange colors. The cyan color represents the core-mantle boundary, blue signifies the surface, and the transparent gray… [+3599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Gigantic Crawler on the Move As Rollout of Mega Moon Rocket Inches Closer - SciTechDaily", "description": "Yesterday, engineers and technicians at NASA’s Kennedy Space Center in Florida drove Crawler Transporter-2, which will carry NASA’s Moon rocket to the launch pad, to the doors of the Vehicle Assembly Building (VAB). Soon, the 6.6-million-pound crawler will go…", "url": "https://scitechdaily.com/nasa-gigantic-crawler-on-the-move-as-rollout-of-mega-moon-rocket-inches-closer/", "urlToImage": "https://scitechdaily.com/images/NASA-Crawler-Transporter-2-Artemis-I.jpg", "publishedAt": "2022-03-12T16:39:41Z", "content": "Engineers and technicians at NASA’s Kennedy Space Center in Florida drove Crawler Transporter-2 on March 11, 2022 to the doors of the Vehicle Assembly Building (VAB). Soon, it will go inside the VAB … [+3594 chars]"}]}