{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Amy Thompson", "title": "SpaceX just launched a Falcon 9 rocket on a record 9th flight and stuck the landing - Space.com", "description": "It launched 60 Starlink internet satellites into orbit.", "url": "https://www.space.com/spacex-starlink-21-internet-satellites-launch-rocket-landing-success", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BUA2WGKghhyZjTSdEWXkaQ-1200-80.jpg", "publishedAt": "2021-03-14T10:52:23Z", "content": "CAPE CANAVERAL, Fla. A SpaceX Falcon 9 rocket launched a new batch of 60 Starlink internet satellites into orbit early Sunday (March 14) and nailed its landing at sea to top off a record-setting miss… [+8404 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Brian P. D. Hannon, Stacy Liberatore", "title": "NASA team using Navajo language to name Mars land features seen by Perseverance rover - Daily Mail", "description": "The team operating Nasa's Perseverance rover has started cataloging geological formations on the surface of Mars with names from the Navajo language.", "url": "https://www.dailymail.co.uk/news/article-9358979/NASA-team-using-Navajo-language-Mars-land-features-seen-Perseverance-rover.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/13/23/40433746-0-image-a-18_1615679396798.jpg", "publishedAt": "2021-03-13T23:52:29Z", "content": "The team operating NASA's Perseverance rover has started cataloging geological formations on the surface of Mars with names from the Navajo language.\r\nThe names are a nod to the project's large conti… [+6425 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "A Planet Lost Its Atmosphere, So Its Volcanoes Made It a New One - Universe Today", "description": "A red-dwarf star called Gliese 1132 or GJ 1132 for short (astronomers and their fun nicknames!) smolders on some 41 light-years from the sun in the southern constellation Vela, just a few degrees away from the southern cross. In 2015, astronomers using the ME…", "url": "https://www.universetoday.com/150527/a-planet-lost-its-atmosphere-so-its-volcanoes-made-it-a-new-one/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/STScI-H-p2113a-m-2000x1125-1.jpg", "publishedAt": "2021-03-13T00:00:15Z", "content": "A red-dwarf star called Gliese 1132 or GJ 1132 for short (astronomers and their fun nicknames!) smolders on some 41 light-years from the sun in the southern constellation Vela, just a few degrees awa… [+4720 chars]"}]}