{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "China plans to open its space station to tourism within a decade - Daily Mail", "description": "While there are no specific details for the future of space tourism in China, it is likely that people without formal astronaut training could be launched 'relatively soon'.", "url": "https://www.dailymail.co.uk/sciencetech/article-10640665/China-plans-open-space-station-tourism-decade.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/17/54317911-0-China_plans_to_complete_its_Tiangong_space_station_by_the_end_of-a-25_1647971125639.jpg", "publishedAt": "2022-03-22T18:56:35Z", "content": "China plans to open its new space station up to 'tourism' within the next decade - sparking what the country hopes is a race to compete with the likes of private American space tourists such as Jeff … [+10391 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Jacqui Goddard", "title": "New discoveries take number of known exoplanets past 5000 - The Times", "description": "Three decades after the first discovery of a planet beyond our solar system, astronomers have now confirmed the existence of more than 5,000, bringing closer th", "url": "https://www.thetimes.co.uk/article/new-discoveries-take-number-of-known-exoplanets-past-5-000-bff597wq2", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Ff709a620-a9f5-11ec-b5dd-c16e85f55725.jpg?crop=2159%2C1214%2C0%2C112&resize=1200", "publishedAt": "2022-03-22T16:00:00Z", "content": "Three decades after the first discovery of a planet beyond our solar system, astronomers have now confirmed the existence of more than 5,000, bringing closer the prospect of one day discovering life … [+579 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A research study analyzes the characteristics of Apophis, the asteroid that will approach Earth in 2029 - Phys.org", "description": "The study, in which the Universidad Carlos III de Madrid (UC3M) and the Universidad Estatal Paulista Júlio de Mesquita Filho (Júlio de Mesquita Filho Paulista State University) (UNESP) of Brazil are participating, analyzes the surface and dynamics of Apophis,…", "url": "https://phys.org/news/2022-03-characteristics-apophis-asteroid-approach-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/3-asteroid.jpg", "publishedAt": "2022-03-22T15:31:04Z", "content": "The study, in which the Universidad Carlos III de Madrid (UC3M) and the Universidad Estatal Paulista Júlio de Mesquita Filho (Júlio de Mesquita Filho Paulista State University) (UNESP) of Brazil are … [+4627 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious ORCs in Space Revealed Using the World's Most Powerful Radio Telescopes - SciTechDaily", "description": "Astronomy’s newest mystery objects, odd radio circles or ORCs, have been pulled into sharp focus by an international team of astronomers using the world’s most capable radio telescopes. First revealed by the ASKAP radio telescope, owned and operated by Austra…", "url": "https://scitechdaily.com/mysterious-orcs-in-space-revealed-using-the-worlds-most-powerful-radio-telescopes/", "urlToImage": "https://scitechdaily.com/images/Odd-Radio-Circles-Artists-Impression-scaled.jpg", "publishedAt": "2022-03-22T09:55:32Z", "content": "Artist’s impression of odd radio circles. It is thought to take the rings 1 billion years to reach the size we see them today. The rings are so big (millions of light years across), they’ve expanded … [+5886 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Begins Multi-Instrument Alignment - SciTechDaily", "description": "After meeting the major milestone of aligning the telescope to NIRCam, the Webb team is starting to extend the telescope alignment to the guider (the Fine Guidance Sensor, or FGS) and the other three science instruments. This six-week-long process is called m…", "url": "https://scitechdaily.com/webb-space-telescope-begins-multi-instrument-alignment/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-03-22T04:29:37Z", "content": "NASA’s James Webb Space Telescope. Credit: NASA Goddard Space Flight Center and Northrup Grumman\r\nAfter meeting the major milestone of aligning the telescope to NIRCam, the Webb team is starting to e… [+3005 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Source of fast radio bursts surprises astronomers – Physics World - physicsworld.com", "description": "Discovery suggests ancient stars can collapse to create magnetars", "url": "https://physicsworld.com/a/source-of-fast-radio-bursts-surprises-astronomers/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/03/Sam-Jarman-Fast-radio-bursts-article.jpg", "publishedAt": "2022-03-21T17:41:41Z", "content": "Older than expected: artists impression of a magnetar in a cluster of ancient stars (in red) close to the spiral galaxy M81.\r\nThe source of fast radio bursts (FRBs) first detected in 2020 is likely t… [+2900 chars]"}]}