{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Richard Luscombe", "title": "Elon Musk welcomes SpaceX crew home with $50m donation to charity - The Guardian", "description": "Four-person crew asked for the public’s help in reaching fundraising target of $200m for the children’s charity St Jude", "url": "https://amp.theguardian.com/science/2021/sep/19/elon-musk-spacex-donation-charity-st-jude", "urlToImage": null, "publishedAt": "2021-09-19T13:19:00Z", "content": "SpaceX capsule carrying space tourists splashes down off Florida coast video\r\nSpaceXFour-person crew asked for the publics help in reaching fundraising target of $200m for the childrens charity St Ju… [+3512 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "We May Know Where the Dinosaur-Killing Asteroid Came From. How Does That Help Us? - autoevolution", "description": "About 66 million years ago, give or take a period of time too great for us humans to understand, a 6.2 miles (10 km) asteroid came crashing down somewhere in the Yucatan Peninsula in Mexico. Upon impact, the rock detonated with the power of about 100 million …", "url": "https://www.autoevolution.com/news/we-may-know-where-the-dinosaur-killing-asteroid-came-from-how-does-that-help-us-169711.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/we-may-know-where-the-dinosaur-killing-asteroid-came-from-how-does-that-help-us-169711_1.jpg", "publishedAt": "2021-09-19T09:06:00Z", "content": "After the impact, the Earth was still standing, but the effects of the blast killed most of Earth’s species, including the dominant one at the time, the dinosaurs.Now, this extinction-level event has… [+3566 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Kate Whitfield", "title": "Autumn equinox 2021 - the key date that marks end of summer and start of autumn - Daily Express", "description": "AUTUMN is about to begin in the UK, with the days slowly getting shorter and the nights turning chiller. So when is the equinox?", "url": "https://www.express.co.uk/news/science/1492279/autumn-date-equinox-2021", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1492279.jpg", "publishedAt": "2021-09-19T07:15:00Z", "content": "The autumn equinox - also known as the September equinox - occurs when the earth’s equator passes the centre of the sun. This means the north and south poles aren’t tilted towards or away from the su… [+1397 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Mass Extinction Events Can Turn Freshwater Into Toxic Soup, And It's Already Happening - ScienceAlert", "description": "Apart from the global catastrophe that killed off most of the dinosaurs, some experts think almost all the mass extinctions in Earth's history were followed by a proliferation of microbes in rivers and lakes.", "url": "https://www.sciencealert.com/mass-extinction-events-can-turn-freshwater-into-toxic-soup-and-that-s-bad-news-for-today", "urlToImage": "https://www.sciencealert.com/images/2021-09/processed/freshwatertoxicsoup_1024.jpg", "publishedAt": "2021-09-19T05:03:45Z", "content": "Apart from the global catastrophe that killed off most of the dinosaurs, some experts think almost all the mass extinctions in Earth's history were followed by a proliferation of microbes in rivers a… [+4655 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Three astronauts land safely after China’s longest crewed space mission to date - Digital Trends", "description": "Three Chinese astronauts have returned safely from space following a three-month stay at the new Tiangong space station which is currently under construction.", "url": "https://www.digitaltrends.com/news/chinese-astronauts-shenzhou-12-landing/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/1310193435_16318662411371n1.jpg", "publishedAt": "2021-09-18T20:39:58Z", "content": "Three Chinese astronauts have returned safely from space following a three-month stay at the new Tiangong space station which is currently under construction. Tang Hongbo, Nie Haisheng, and Liu Bomin… [+2218 chars]"}, {"source": {"id": null, "name": "VolcanoDiscovery"}, "author": null, "title": "Volcanoes Today - summary of volcanic activity world-wide - VolcanoDiscovery", "description": "Volcanoes Today - summary of volcanic activity world-wide", "url": "https://www.volcanodiscovery.com/volcanoes/today.html", "urlToImage": null, "publishedAt": "2016-05-30T19:22:45Z", "content": "Volcanoes Today, 19 Sep 2021: Fuego volcano, Karymsky, Reventador, La Palma, Sakurajima, Nevado del Ruiz, Sabancaya, Suwanose-jima\r\n 20:00 PM | BY: VN\r\nLa Palma (Canary Islands (Spain)): More and mor… [+8597 chars]"}]}