{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Perseverance Celebrates First Year on Mars by Learning to Run – NASA's Mars Exploration Program - NASA Mars Exploration", "description": "The rover has racked up a series of accomplishments, including new distance records, as it reaches the end of the first of several planned science campaigns on the Red Planet.", "url": "https://mars.nasa.gov/news/9134/nasas-perseverance-celebrates-first-year-on-mars-by-learning-to-run/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/9134_1-PIA24428-web.jpg", "publishedAt": "2022-02-18T16:56:32Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Ancient bird with a 'movable chin' roamed China 120 million years ago - Daily Mail", "description": "Scientists analysed fossils unearthed near the Great Wall of China to reveal that the creature had a bony appendage at the tip of its lower jaw which it was not only able to move but also feel through.", "url": "https://www.dailymail.co.uk/sciencetech/article-10527381/Ancient-bird-movable-chin-roamed-China-120-million-years-ago.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/18/13/54361471-0-image-a-53_1645190110621.jpg", "publishedAt": "2022-02-18T14:10:21Z", "content": "A bizarre-looking ancient bird that had a 'movable chin' to help it root for food 120 million years ago has been identified.\r\nScientists analysed fossils unearthed near the Great Wall of China to rev… [+7739 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "NASA's Curiosity rover captures footage of the Martian sky with clouds of carbon dioxide ice - Daily Mail", "description": "Martian clouds are very faint in the atmosphere, so special imaging techniques have been used by NASA's Jet Propulsion Laboratory, in Pasadena, California, to create the footage.", "url": "https://www.dailymail.co.uk/sciencetech/article-10526939/NASAs-Curiosity-rover-captures-footage-Martian-sky-clouds-carbon-dioxide-ice.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/18/11/54358473-0-image-a-2_1645185161720.jpg", "publishedAt": "2022-02-18T11:42:52Z", "content": "Mesmerising footage of the Martian sky showing clouds drifting overhead has been captured by NASA's Curiosity rover.\r\nBut rather than being made of water like on Earth, these are composed of carbon d… [+6423 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Asteroid named Elektra is found to have three companion moons - Daily Mail", "description": "The asteroid 130 Elektra, which was first discovered between Jupiter and Mars in 1873, has a third moon which has been detected by the National Astronomical Research Institute of Thailand.", "url": "https://www.dailymail.co.uk/sciencetech/article-10526735/Asteroid-named-Elektra-three-companion-moons.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/18/09/54353519-0-image-a-2_1645175467678.jpg", "publishedAt": "2022-02-18T09:51:31Z", "content": "An asteroid that was discovered in the 19th century has now been identified as the first quadruple system ever detected.\r\nNamed 130 Elektra, astronomers have found that the 160 mile-wide space rock h… [+4694 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Where on Earth Did the Water Come From? - SciTechDaily", "description": "Earth’s supply of water is incredibly important for its ability to sustain life, but where did that water come from? Was it present when Earth formed or was it delivered later by meteorites or comets from outer space? The source of Earth’s water has been a lo…", "url": "https://scitechdaily.com/where-on-earth-did-the-water-come-from/", "urlToImage": "https://scitechdaily.com/images/Earth-Moon-Impact.jpg", "publishedAt": "2022-02-18T09:25:11Z", "content": "Evidence from the analysis of lunar samples suggest that although the Earth and moon formed from a giant impact, they mostly retained their primordial abundances of volatile elements, including water… [+3377 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Astronaut brains re-wire themselves during long-duration spaceflight - Daily Mail", "description": "An international team, led by the University of Antwerp in Belgium, studied the brains of Russian cosmonauts who had been in space for an average of 172 days.", "url": "https://www.dailymail.co.uk/sciencetech/article-10524663/Astronaut-brains-wire-long-duration-spaceflight.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/17/19/54328923-0-image-a-26_1645126534700.jpg", "publishedAt": "2022-02-18T05:00:46Z", "content": "The brains of astronauts are 'rewired' during long-duration space flight to help them adapt the unusual environment, according to a new study.\r\nAn international team, led by the University of Antwerp… [+7990 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Patrick Greenfield", "title": "Fish love songs and fighting talk: underwater sound library to reveal language of the deep - The Guardian", "description": "Scientists plan a vast global store of aquatic noises to help monitor marine life, identify species – and even uncover regional dialects", "url": "https://amp.theguardian.com/environment/2022/feb/17/underwater-sound-library-to-reveal-language-of-the-deep-aoe", "urlToImage": null, "publishedAt": "2022-02-17T15:00:00Z", "content": "The age of extinctionScientists plan a vast global store of aquatic noises to help monitor marine life, identify species and even uncover regional dialects\r\nFrom the boing of a minke whale to the dru… [+3696 chars]"}, {"source": {"id": null, "name": "Daily Record"}, "author": "Naina Bhardwaj", "title": "Incredible images show area of Mars after Scottish beauty spot by NASA scientists - Daily Record", "description": "David Brown, a Formartine Area Ranger in Ellon, wrote to Dr. Abigail Fraeman, a research scientist at the Mars Science Laboratory.", "url": "https://www.dailyrecord.co.uk/news/scottish-news/nasa-mars-scottish-beauty-spot-26256429", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article26256504.ece/ALTERNATES/s1200/274112767_243135064672770_7951250657917435755_n.jpg", "publishedAt": "2022-02-17T12:26:08Z", "content": "Incredible images have shown an area of Mars which has been named after a Scottish beauty spot by NASA scientists. \r\n David Brown, a Formartine Area Ranger in Ellon, wrote to Dr. Abigail Fraeman, a r… [+3327 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "J Oliver Conroy", "title": "Inside the Mars simulation project, where volunteers put their bodies on the line - The Guardian", "description": "To study life on the red planet, people from around the world volunteer to live with strangers in the middle of nowhere", "url": "https://amp.theguardian.com/science/2022/feb/17/mars-utah-simulation-volunteers", "urlToImage": "https://i.guim.co.uk/img/media/c71390ff58d0725113a074671561836963cc5374/0_81_1920_1152/master/1920.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f01a8c31ef54245003d00c491d0d5366", "publishedAt": "2022-02-17T09:00:00Z", "content": "The Mars weather is beautiful today, and an astronaut is about to suffocate to death under the cloudless blue sky.\r\nThe trouble starts after three crew members leave the safety of the Hab, their pres… [+13887 chars]"}]}