{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Hayley Arceneaux: Cancer survivor joins first all-civilian space mission - BBC News", "description": "The SpaceX mission will make Hayley Arceneaux the first person with a prosthesis to visit space.", "url": "https://www.bbc.co.uk/news/world-us-canada-56159726", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/EE39/production/_117158906_approved-210210_hopeseat_057.jpg", "publishedAt": "2021-02-22T21:39:36Z", "content": "By Joshua NevettBBC News\r\nimage copyrightSt Jude Children's Research Hospital\r\nimage captionHayley Arceneaux, a cancer survivor, will achieve a number of firsts when she goes to space this year\r\nThe … [+5109 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Natalie Grover", "title": "Nasa releases video of Perseverance rover landing on Mars - The Guardian", "description": "Space agency also reveals audio recorded by Perseverance on surface of red planet", "url": "https://amp.theguardian.com/science/2021/feb/22/nasa-releases-video-of-perseverance-rover-landing-on-mars", "urlToImage": null, "publishedAt": "2021-02-22T21:06:00Z", "content": "Footage of Perseverance rover landing on Mars released by Nasa video\r\nMarsSpace agency also reveals audio recorded by Perseverance on surface of red planet\r\nMon 22 Feb 2021 20.21 GMT\r\nNasa has unveil… [+5293 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "Dust Storms on Mars Might Glow with Tiny Sparks, Study Shows - IGN - IGN", "description": "As if dust storms weren't ominous enough already, on Mars, they might glow due to electricity, according to a new study.", "url": "https://www.ign.com/articles/dust-storms-on-mars-might-glow-with-tiny-sparks-study-shows", "urlToImage": "https://assets1.ignimgs.com/2021/02/22/pia15959-orig-1614014502641.jpg?width=1280", "publishedAt": "2021-02-22T17:30:07Z", "content": "Like something out of a Mad Max movie, a new study shows that dust storms on Mars might glow with tiny sparks.A new abstract published by a group of scientists that simulated the low-pressure atmosph… [+2555 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "For The First Time, We've Detected a 'Ghost Particle' Coming From a Shredded Star - ScienceAlert", "description": "A star completely torn apart when it ventured too close to a black hole has given science a rare gift. For the first time, scientists have detected a high-energy neutrino that was flung out into space during one of these violent events.", "url": "https://www.sciencealert.com/for-the-first-time-we-ve-seen-a-ghost-particle-spewed-out-from-a-shredded-star", "urlToImage": "https://www.sciencealert.com/images/2021-02/black-hole-star-neutrino_1024.gif", "publishedAt": "2021-02-22T16:03:36Z", "content": "A star completely torn apart when it ventured too close to a black hole has given science a rare gift. For the first time, scientists have detected a high-energy neutrino that was flung out into spac… [+5398 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The Milky Way may be swarming with planets with oceans and continents like here on Earth - Phys.org", "description": "Astronomers have long been looking into the vast universe in hopes of discovering alien civilisations. But for a planet to have life, liquid water must be present. The likelihood of that scenario has seemed impossible to calculate because it has been the assu…", "url": "https://phys.org/news/2021-02-milky-swarming-planets-oceans-continents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/themilkywaym.jpg", "publishedAt": "2021-02-22T16:01:37Z", "content": "Astronomers have long been looking into the vast universe in hopes of discovering alien civilisations. But for a planet to have life, liquid water must be present. The likelihood of that scenario has… [+4720 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Neuroscience: Artificial 'brain in a dish' is created that matures 'just like a human brain' - Daily Mail", "description": "Extensive genetic analyses of the so-called 'organoids' - which were allowed to grow in experimental dishes for up to 20 months - was conducted by US researchers.", "url": "https://www.dailymail.co.uk/sciencetech/article-9287071/Neuroscience-Artificial-brain-dish-created-matures-just-like-human-brain.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/22/15/39626166-0-image-a-5_1614008410655.jpg", "publishedAt": "2021-02-22T16:00:55Z", "content": "A 'brain in a dish' grown from stem cells in the lab can develop 'just like a human brain' and may help shed light on conditions like Alzheimer's and schizophrenia.\r\nResearchers from the US conducted… [+4936 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Monica Grady", "title": "Can the laws of physics disprove God? - The Conversation UK", "description": "If God could break the laws of physics,  why haven't we seen any evidence of the laws ever being broken in the universe?", "url": "https://theconversation.com/can-the-laws-of-physics-disprove-god-146638", "urlToImage": "https://images.theconversation.com/files/368289/original/file-20201109-23-s91zxo.jpg?ixlib=rb-1.1.0&rect=262%2C13%2C3994%2C1994&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-22T14:20:23Z", "content": "I still believed in God (I am now an atheist) when I heard the following question at a seminar, first posed by Einstein, and was stunned by its elegance and depth: If there is a God who created the e… [+10923 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Life from Earth could temporarily survive on Mars - Phys.org", "description": "Some microbes on Earth could temporarily survive on the surface of Mars, finds a new study by NASA and German Aerospace Center scientists. The researchers tested the endurance of microorganisms to Martian conditions by launching them into the Earth's stratosp…", "url": "https://phys.org/news/2021-02-life-earth-temporarily-survive-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/lifefromeart.jpg", "publishedAt": "2021-02-22T07:46:41Z", "content": "Some microbes on Earth could temporarily survive on the surface of Mars, finds a new study by NASA and German Aerospace Center scientists. The researchers tested the endurance of microorganisms to Ma… [+3681 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/jon-fingas", "title": "FAA ends investigations into SpaceX's recent Starship launches - Engadget", "description": "The FAA has ended its investigations into SpaceX's Starship SN8 and SN9 launches, clearing a path for future rockets.", "url": "https://www.engadget.com/faa-ends-spacex-starship-sn8-sn9-investiations-220025441.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/YV6zVqVtGvyC9HgB5b2s9g--~B/aD0xMDY3O3c9MTYwMDthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2021-02/c1a38f50-748b-11eb-b3dc-5f42f84cc23c.cf.jpg", "publishedAt": "2021-02-21T22:04:12Z", "content": "The regulatory drama around SpaceX's recent Starship launches has simmered down. CNN's Jackie Wattles and The Verge have learned that the FAA ended its investigations into the SN8 and SN9 launches. S… [+962 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "NASA warns of STADIUM-SIZED asteroid headed towards Earth - RT", "description": "The US space agency is warning of a salvo of space rocks headed for Earth, ranging in size from a paltry 10 meters in diameter all the way up to a positively petrifying 213.", "url": "https://www.rt.com/news/516215-stadium-sized-asteroid-nasa-warning/", "urlToImage": "https://cdni.rt.com/files/2021.02/article/60329285203027166b3c3349.jpg", "publishedAt": "2021-02-21T17:25:00Z", "content": "When not keeping a close eye on its Perseverance rover, which touched down on Mars this week, NASA is busy monitoring the sky for potential threats to life on Earth – namely asteroids. And this week … [+1488 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comments on: NASA's Ingenuity Helicopter Reports In From Mars - SciTechDaily", "description": "The technology demonstration has phoned home from where it is attached to the belly of NASA’s Perseverance rover. Mission controllers at NASA’s Jet Propulsion Laboratory in Southern California have received the first status report from the Ingenuity Mars Heli…", "url": "https://scitechdaily.com/nasas-ingenuity-helicopter-reports-in-from-mars/", "urlToImage": "https://scitechdaily.com/images/NASAs-Ingenuity-Mars-Helicopter-Crop.jpg", "publishedAt": "2021-02-21T03:57:05Z", "content": "In this illustration, NASA’s Ingenuity Mars Helicopter stands on the Red Planet’s surface as NASA’s Perseverance rover (partially visible on the left) rolls away. Credit: NASA/JPL-Caltech\r\nThe techno… [+4489 chars]"}]}