{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New DNA Research Shows Humans Did Not Cause Woolly Mammoths To Go Extinct – Climate Change Did - SciTechDaily", "description": "New DNA research shows the world got too wet for the giant animals to survive. For five million years, woolly mammoths roamed the earth until they vanished for good nearly 4,000 years ago – and scientists have finally proved why. The hairy cousins of today’s …", "url": "https://scitechdaily.com/new-dna-research-shows-humans-did-not-cause-woolly-mammoths-to-go-extinct-climate-change-did/", "urlToImage": "https://scitechdaily.com/images/Trio-of-Woolly-Mammoths-scaled.jpg", "publishedAt": "2021-10-24T03:35:35Z", "content": "BySt John's College, University of CambridgeOctober 23, 2021\r\nA trio of woolly mammoths trudges over snow covered hills. Behind them, mountains with snow covered peaks rise above dark green forests o… [+8177 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Vast “Magnetic Tunnel” May Surround Earth and Our Entire Solar System - SciTechDaily", "description": "A University of Toronto astronomer’s research suggests the solar system is surrounded by a magnetic tunnel that can be seen in radio waves. Jennifer West, a research associate at the Dunlap Institute for Astronomy & Astrophysics, is making a scientific case t…", "url": "https://scitechdaily.com/a-vast-magnetic-tunnel-may-surround-earth-and-our-entire-solar-system/", "urlToImage": "https://scitechdaily.com/images/Space-Tunnel-Concept.gif", "publishedAt": "2021-10-23T19:11:20Z", "content": "Space tunnel artist’s concept.\r\nA University of Toronto astronomer’s research suggests the solar system is surrounded by a magnetic tunnel that can be seen in radio waves.\r\nJennifer West, a research … [+4872 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Infant Planet – One of the Youngest Exoplanets Ever Observed - SciTechDaily", "description": "One of the youngest planets ever found around a distant infant star has been discovered by an international team of scientists led by University of Hawai?i at Manoa faculty, students, and alumni. Thousands of planets have been discovered around other stars, b…", "url": "https://scitechdaily.com/astronomers-discover-infant-planet-one-of-the-youngest-exoplanets-ever-observed/", "urlToImage": "https://scitechdaily.com/images/Planet-2M0437.jpg", "publishedAt": "2021-10-23T09:58:21Z", "content": "ByUniversity of Hawaii at ManoaOctober 23, 2021\r\nDiscovery image of the planet 2M0437, which lies about 100 times the Earth-Sun distance from its parent star. The image was taken with the Subaru Tele… [+3405 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Nasa announces uncrewed flights around the Moon to begin in February 2022 - The Guardian", "description": "The Orion capsule will be launched on the Space Launch System, paving the way for the resumption of people to walk on Earth’s satellite again", "url": "https://amp.theguardian.com/science/2021/oct/23/nasa-announces-uncrewed-flights-around-the-moon-to-begin-in-february-2022", "urlToImage": null, "publishedAt": "2021-10-23T02:59:00Z", "content": "NasaThe Orion capsule will be launched on the Space Launch System, paving the way for the resumption of people to walk on Earths satellite again\r\nSat 23 Oct 2021 03.58 BST\r\nNasa has announced plans t… [+1801 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Data suggests oil giants are not looking very hard to find ways to reduce their carbon footprint - Phys.org", "description": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journal Science highlighting the lack of effort by the world's lar…", "url": "https://phys.org/news/2021-10-oil-giants-hard-ways-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/data-suggests-oil-gian.jpg", "publishedAt": "2021-10-22T14:30:01Z", "content": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journa… [+2880 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Astronomers spot a star 60 million light years from Earth dying and going supernova in REAL-TIME - Daily Mail", "description": "Astronomers have  witnessed for the first time a star dying and going supernova, using the Hubble Space Telescope and NASA's TESS telescope.", "url": "https://www.dailymail.co.uk/sciencetech/article-10120483/Astronomers-spot-star-60-million-light-years-Earth-dying-going-supernova-REAL-TIME.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/22/14/49511605-0-image-a-43_1634910174432.jpg", "publishedAt": "2021-10-22T14:06:52Z", "content": "Astronomers using the Hubble Space Telescope and other space-peering instruments have witnessed for the first time a star dying 60 million light-years away and going supernova in 'real-time,' which m… [+5574 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Human brain DECREASED in size 3,000 years ago when ancient beings started formed social groups - Daily Mail", "description": "The decrease was identified during thee Holocene era when human began to form social groups instead of living individually. This allowed them to share information instead of storing it.", "url": "https://www.dailymail.co.uk/sciencetech/article-10120349/Human-brain-DECREASED-size-3-000-years-ago-ancient-beings-started-formed-social-groups.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/22/14/49511483-0-image-a-7_1634909576869.jpg", "publishedAt": "2021-10-22T13:46:01Z", "content": "The size of the human brain has changed numerous times throughout human history, but the vital organ decreased approximately 3,000 years ago due to a rise of social circles, a new study finds.    \r\nA… [+5911 chars]"}]}