{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Nasa announces uncrewed flights around the Moon to begin in February 2022 - The Guardian", "description": "The Orion capsule will be launched on the Space Launch System, paving the way for the resumption of people to walk on Earth’s satellite again", "url": "https://amp.theguardian.com/science/2021/oct/23/nasa-announces-uncrewed-flights-around-the-moon-to-begin-in-february-2022", "urlToImage": null, "publishedAt": "2021-10-23T02:59:00Z", "content": "NasaThe Orion capsule will be launched on the Space Launch System, paving the way for the resumption of people to walk on Earths satellite again\r\nSat 23 Oct 2021 03.58 BST\r\nNasa has announced plans t… [+1801 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jacob Paul", "title": "War fears soar as NASA claims it needs nuclear rockets to rival China in space - Daily Express", "description": "NASA has prompted fears of a conflict after pleading with the US Government to invest in nuclear-powered spacecraft to speed ahead of rivals in the space race.", "url": "https://www.express.co.uk/news/science/1510292/world-war-three-news-space-race-mars-nasa", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1510292.jpg", "publishedAt": "2021-10-23T00:00:00Z", "content": null}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Orionid Meteor shower 2021: when to see it peak, and other dates to watch out for in the UK - Telegraph.co.uk", "description": "Meteor showers come and go throughout the year, but when can you watch the extra special Orionid meteor shower?", "url": "https://www.telegraph.co.uk/science/2021/10/22/orionid-meteor-shower-2021-when-time-peak-uk-date-watch/", "urlToImage": "https://www.telegraph.co.uk/content/dam/science/2019/09/02/TELEMMGLPICT000183801946-xlarge_trans_NvBQzQNjv4BqhasgUMiR-rxiRxu9qBoVLdUcsNjZWwQQAqx2KspIOLE.jpeg?imwidth=1200", "publishedAt": "2021-10-22T18:13:02Z", "content": "Mark your calendars for 21 and 22 October as a special display should hopefully be making its way to us. Many people will try to catch a glimpse of the Orionid meteor shower, which is due to hit its … [+4678 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Earth Bombardment Model: How Asteroid and Comet Strikes May Have Delayed Evolution of the Atmosphere - SciTechDaily", "description": "Study finds collisions that stalled oxygen growth on planet more common than thought. Between 2.5 and 4 billion years ago, a time known as the Archean eon, Earth’s weather could often be described as cloudy with a chance of asteroid. Back then, it was not unc…", "url": "https://scitechdaily.com/new-earth-bombardment-model-how-asteroid-and-comet-strikes-may-have-delayed-evolution-of-the-atmosphere/", "urlToImage": "https://scitechdaily.com/images/Planetary-Bombardment-Model.gif", "publishedAt": "2021-10-22T17:24:46Z", "content": "A Southwest Research Institute-led team updated planetary bombardment models with the latest geologic information and then applied those models to understand how impacts may have affected oxygen leve… [+5472 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Data suggests oil giants are not looking very hard to find ways to reduce their carbon footprint - Phys.org", "description": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journal Science highlighting the lack of effort by the world's lar…", "url": "https://phys.org/news/2021-10-oil-giants-hard-ways-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/data-suggests-oil-gian.jpg", "publishedAt": "2021-10-22T14:30:01Z", "content": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journa… [+2880 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Astronomers spot a star 60 million light years from Earth dying and going supernova in REAL-TIME - Daily Mail", "description": "Astronomers have  witnessed for the first time a star dying and going supernova, using the Hubble Space Telescope and NASA's TESS telescope.", "url": "https://www.dailymail.co.uk/sciencetech/article-10120483/Astronomers-spot-star-60-million-light-years-Earth-dying-going-supernova-REAL-TIME.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/22/14/49511605-0-image-a-43_1634910174432.jpg", "publishedAt": "2021-10-22T14:06:52Z", "content": "Astronomers using the Hubble Space Telescope and other space-peering instruments have witnessed for the first time a star dying 60 million light-years away and going supernova in 'real-time,' which m… [+5574 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Human brain DECREASED in size 3,000 years ago when ancient beings started formed social groups - Daily Mail", "description": "The decrease was identified during thee Holocene era when human began to form social groups instead of living individually. This allowed them to share information instead of storing it.", "url": "https://www.dailymail.co.uk/sciencetech/article-10120349/Human-brain-DECREASED-size-3-000-years-ago-ancient-beings-started-formed-social-groups.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/22/14/49511483-0-image-a-7_1634909576869.jpg", "publishedAt": "2021-10-22T13:46:01Z", "content": "The size of the human brain has changed numerous times throughout human history, but the vital organ decreased approximately 3,000 years ago due to a rise of social circles, a new study finds.    \r\nA… [+5911 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Charlotte Edwards", "title": "Stunning red ‘Hunter’s Moon’ graces night skies across the globe to signal start of Autumn... - The Sun", "description": "", "url": "https://www.thesun.co.uk/news/16501378/hunters-moon-photos-red/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/10/COMP-SKC-RED-HUNTERS-MOON.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-10-22T10:19:00Z", "content": "A HUNTER'S Moon brightened the night sky last night and in the early hours of this morning.\r\nThe Full Moon helped to create some stunning photographs and observers even spotted a reddish hue to it.\r\n… [+2051 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Mark Waghorn", "title": "Over 100 dinosaur eggs discovered in Argentina - The Independent", "description": "Some shells still contain embryos inside", "url": "https://www.independent.co.uk/news/science/argentina-dinosaur-eggs-discovery-embryos-b1943313.html", "urlToImage": "https://static.independent.co.uk/2021/10/22/09/eggs-ellent-fin-744380.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-10-22T08:29:17Z", "content": "More than 100 eggs have been dug up at a dinosaur graveyard in Argentina providing the worlds first evidence of herd behaviour.\r\nScans show they belong to the same species - a primitive long necked h… [+4492 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Richard Littlejohn", "title": "RICHARD LITTLEJOHN: It's Boris Johnson's next Jolly Green Jape... bring back the woolly mammoths! - Daily Mail", "description": "RICHARD LITTLEJOHN: Why is a Tory Government determined to make us colder and poorer? Boris Johnson's Green Manalishi manifesto is the longest economic suicide note in history.", "url": "https://www.dailymail.co.uk/debate/article-10117927/RICHARD-LITTLEJOHN-Boris-Johnsons-Jolly-Green-Jape-bring-woolly-mammoths.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/21/22/49485561-0-image-a-2_1634851297909.jpg", "publishedAt": "2021-10-21T21:00:47Z", "content": "Climate change, not humans, killed off the woolly mammoth, according to a new study from Cambridge University published this week.\r\nExtinction of the species was sparked by rising temperatures at the… [+7895 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "Hardened Wood Steak Knife Is Three Times As Sharp As A Steel One - IFLScience", "description": "When we think of knives we usually picture steel or ceramic, but researchers have developed a way to make strong knives from wood. The material in question", "url": "https://www.iflscience.com/technology/hardened-wood-steak-knife-is-three-times-as-sharp-as-a-steel-one/", "urlToImage": "https://cdn.iflscience.com/images/f0cca963-fadc-5352-aeec-c3d440e5c1ed/default-1634824673-still-from-the-video-of-the-knife-at-work-image-credit-bo-chen-cc-by-sa.jpg", "publishedAt": "2021-10-21T16:13:00Z", "content": "When we think of knives we usually picture steel or ceramic, but researchers have developed a way to make strong knives from wood. The material in question is called hardened wood. Material scientist… [+2429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "New MOND theory able to account for cosmic microwave background - Phys.org", "description": "A pair of researchers at the Czech Academy of Sciences has been shaking up the astrophysics community with a new modified Newtonian dynamics (MOND) theory that tosses out the concept of dark matter and instead backs up theories that suggest there is a type of…", "url": "https://phys.org/news/2021-10-mond-theory-account-cosmic-microwave.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/new-mond-theory-able-t.jpg", "publishedAt": "2021-10-21T13:50:01Z", "content": "A pair of researchers at the Czech Academy of Sciences has been shaking up the astrophysics community with a new modified Newtonian dynamics (MOND) theory that tosses out the concept of dark matter a… [+2499 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Boeing's Starliner capsule corroded due to high humidity levels, NASA explains, and the spaceship won't fly this year - The Register", "description": "Meanwhile Elon's running orbital tourist trips and ISS crew missions", "url": "https://www.theregister.com/2021/10/21/boeings_starliner_fail/", "urlToImage": "https://regmedia.co.uk/2019/12/23/starliner_landed.jpg", "publishedAt": "2021-10-21T10:14:00Z", "content": "Boeings CST-100 Starliner capsule, designed to carry astronauts to and from the International Space Station, will not fly until the first half of next year at the earliest, as the manufacturing giant… [+1982 chars]"}]}