{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hologram Experts Can Now Create Real-Life Images That Move in the Air – Like a “A 3D Printer for Light” - SciTechDaily", "description": "Using lasers to create the displays of science fiction, inspired by Star Wars and Star Trek. They may be tiny weapons, but BYU’s holography research group has figured out how to create lightsabers — green for Yoda and red for Darth Vader, naturally — with act…", "url": "https://scitechdaily.com/hologram-experts-can-now-create-real-life-images-that-move-in-the-air-like-a-a-3d-printer-for-light/", "urlToImage": "https://scitechdaily.com/images/Tiny-Spacecraft-Laser-Battle.jpg", "publishedAt": "2021-05-09T19:10:11Z", "content": "A tiny Starship Enterprise fires on a tiny Klingon Battle cruiser with real animated images created in thin air. Credit: BYU\r\nUsing lasers to create the displays of science fiction, inspired by Star … [+3461 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Aliki Kraterou", "title": "Stargazing Brits report seeing ‘line of lights’ across sky as Elon Musk’s Starlink satellite soars over UK... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/14896625/brits-report-line-lights-sky-elon-musks-starlink-satellite/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/05/crop-14896849-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-05-08T22:22:00Z", "content": "STARGAZING Brits have reported seeing a \"line of lights\" across the sky as Elon Musk's Starlink satellite soars over the UK.\r\nConfused skywatchers, who \"had never seen anything like it,\" took it to T… [+3607 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ingenuity Mars helicopter completes first one-way trip - Phys.org", "description": "NASA's Ingenuity Mars Helicopter completed its fifth flight on the Red Planet today with its first one-way journey from Wright Brothers Field to an airfield 423 feet (129 meters) to the south. After arrival above its new airfield, Ingenuity climbed to an alti…", "url": "https://phys.org/news/2021-05-ingenuity-mars-helicopter-one-way.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/ingenuity-mars-helicop-1.jpg", "publishedAt": "2021-05-08T10:24:16Z", "content": "NASA's Ingenuity Mars Helicopter completed its fifth flight on the Red Planet today with its first one-way journey from Wright Brothers Field to an airfield 423 feet (129 meters) to the south. After … [+3848 chars]"}]}