{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "David Keys", "title": "Revealed: the Neanderthal secrets hidden in a Channel Islands cave - The Independent", "description": "How a handful of 45,000-year-old teeth may shed new light on humanity’s story", "url": "https://www.independent.co.uk/news/science/archaeology/neanderthal-humans-channel-islands-jersey-cave-b1795457.html", "urlToImage": "https://static.independent.co.uk/2021/01/31/15/Picture3.jpg", "publishedAt": "2021-02-01T07:43:00Z", "content": "UK-based scientists have discovered the strongest physical evidence ever found for Neanderthal humans interbreeding with our own species, anatomically modern humans (AMH).\r\nFor the past 10 years rese… [+5634 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Alex Moshakis", "title": "Professor Avi Loeb: 'It would be arrogant to think we're alone in the universe' - The Guardian", "description": "When Harvard professor Avi Loeb discovered possible signs of extraterrestrial activity, it caused a scandal in the research community. Is fear and conservatism stopping science from considering plausible evidence that there are aliens out there?", "url": "https://amp.theguardian.com/science/2021/jan/31/professor-avi-loeb-it-would-be-arrogant-to-think-were-alone-in-the-universe-", "urlToImage": null, "publishedAt": "2021-01-31T08:00:00Z", "content": "Alien lifeWhen Harvard professor Avi Loeb discovered possible signs of extraterrestrial activity, it caused a scandal in the research community. Is fear and conservatism stopping science from conside… [+14197 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "Satellites orbiting Earth are increasing like crazy — how do we prevent them from crashing? - The Next Web", "description": "In recent years, satellites have become smaller, cheaper, and easier to make with commercial off the shelf parts. Some even weigh as little as one gram. This means more people can afford ...", "url": "https://thenextweb.com/space/2021/01/31/satellites-orbiting-earth-are-increasing-like-crazy-how-do-we-prevent-them-from-crashing-syndication/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F01%2F1-copy-65.jpg&signature=47f3d4403c6a261478b2498c0fd99458", "publishedAt": "2021-01-31T07:00:01Z", "content": "In recent years, satellites have become smaller, cheaper, and easier to make with commercial off the shelf parts. Some even weigh as little as one gram. This means more people can afford to send them… [+6087 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Antarctica bombshell: Mars mineral found trapped in polar ice can link Earth to Red Planet - Daily Express", "description": "ANTARCTICA researchers boring into the icy continent have stumbled upon particles of jarosite - a mineral so rare it is more likely to be found on Mars. Scientists now believe the discovery could draw a link between the Earth and Red Planet.", "url": "https://www.express.co.uk/news/science/1391287/antarctica-news-mars-mineral-jarosite-polar-ice-earth-red-planet-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1391287.jpg", "publishedAt": "2021-01-30T18:58:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Is there life on Mars? Not if we destroy it with poor space hygiene - The Guardian", "description": "As countries begin an age of Martian exploration, planetary protection advocates insist we must be careful of interplanetary contamination", "url": "https://amp.theguardian.com/science/2021/jan/30/mars-life-perseverance-rover-nasa-planetary-protection", "urlToImage": null, "publishedAt": "2021-01-30T17:00:00Z", "content": "MarsAs countries begin an age of Martian exploration, planetary protection advocates insist we must be careful of interplanetary contamination\r\nNext month, three new spacecraft arrive at Mars. Two re… [+11604 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "“Ancient Scar” –Massive Impact Crater Casts Doubt that Venus had Earthlike Continental Plates (Weekend Feature - The Daily Galaxy --Great Discoveries Channel", "description": "A new finding about Venus highlights the unique place that Earth, and its system of global plate tectonics, has among its planetary neighbors. Research by Yale astronomers in 2020 suggested that Venus may have had an Earth-like environment billions of years a…", "url": "https://dailygalaxy.com/2021/01/ancient-scar-massive-impact-crater-casts-doubt-that-venus-had-earthlike-continental-plates-weekend-feature/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2021/01/12661100-3x4-xlarge-e1612021882488.jpg", "publishedAt": "2021-01-30T16:05:18Z", "content": "A new finding about Venus highlights the unique place that Earth, and its system of global plate tectonics, has among its planetary neighbors. Research by Yale astronomers in 2020 suggested that Venu… [+4478 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Four Exoplanets – Including a Super-Earth Planet – Discovered by High School Students - SciTechDaily", "description": "The high schoolers turned scientists published their findings this week, thanks to a research mentorship program at the Center for Astrophysics; Harvard and Smithsonian. They may be the youngest astronomers to make a discovery yet. This week, 16-year-old Kart…", "url": "https://scitechdaily.com/four-exoplanets-including-a-super-earth-planet-discovered-by-high-school-students/", "urlToImage": "https://scitechdaily.com/images/Exoplanets-Orbiting-Star-TOI-1233-scaled.jpg", "publishedAt": "2021-01-30T15:37:45Z", "content": "A five-planet system around TOI-1233 includes a super-Earth (foreground) that could help solve mysteries of planet formation. The four innermost planets were discovered by high schoolers Kartik Pingl… [+5857 chars]"}]}