{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Axiom Ax-1: First Private Astronaut Mission to Space Station Launches Today – How To Watch Live - SciTechDaily", "description": "NASA and Axiom Space will provide coverage of launch and select mission activities for Axiom Mission 1 (Ax-1), the first private astronaut mission to the International Space Station. Liftoff is scheduled at 11:17 a.m. EDT Friday, April 8, from Launch Complex …", "url": "https://scitechdaily.com/axiom-ax-1-first-private-astronaut-mission-to-space-station-launches-today-how-to-watch-live/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Crew-Dragon-Spacecraft-Approaches-International-Space-Station-scaled.jpg", "publishedAt": "2022-04-08T08:40:04Z", "content": "In this illustration, a SpaceX Crew Dragon spacecraft approaches the International Space Station for docking. Credit: NASA/SpaceX\r\nNASA and Axiom Space will provide coverage of launch and select miss… [+6544 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "‘Extraordinary’ W boson particle finding contradicts understanding of how universe works - The Guardian", "description": "New measurement of fundamental particle of physics after decade-long study challenges theoretical rulebook in scientific ‘mystery’", "url": "https://amp.theguardian.com/science/2022/apr/08/extraordinary-w-boson-particle-finding-contradicts-understanding-of-how-universe-works", "urlToImage": null, "publishedAt": "2022-04-08T02:14:00Z", "content": "ScienceNew measurement of fundamental particle of physics after decade-long study challenges theoretical rulebook in scientific mystery\r\nAgence France-Presse in Paris\r\nAfter a decade of meticulous me… [+4475 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Maryam Zakir-Hussain", "title": "Scientists ‘find fossil of dinosaur that died on day of asteroid strike’ - The Independent", "description": "Discovery of fossilised leg may finally prove that asteroid wiped out dinosaurs on Earth", "url": "https://www.independent.co.uk/climate-change/news/tanis-dinosaur-fossil-asteroid-strike-b2052811.html", "urlToImage": "https://static.independent.co.uk/2022/04/07/11/tanis%20leg.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-04-07T17:27:47Z", "content": "A fossil has been discovered that scientists believe belongs to a dinosaur killed on the day of an asteroid strike 66 million years ago. \r\nDinosaurs are thought to have been wiped out by the asteroid… [+1971 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Raining Vaporized Rock: Hubble Probes Bizarre Weather Conditions on Sizzling Worlds - SciTechDaily", "description": "Sizzling Worlds Vaporize Most of the Dust in Their Atmospheres \"When you're hot, you're hot!\" crooned country singer Jerry Reed in a top 1971 pop music song. Hubble astronomers might change the lyrics to: \"when you're hot, you're super-hot!\" This comes from s…", "url": "https://scitechdaily.com/raining-vaporized-rock-hubble-probes-bizarre-weather-conditions-on-sizzling-worlds/", "urlToImage": "https://scitechdaily.com/images/Ultra-Hot-Jupiter-Sized-Exoplanet-Illustration-scaled.jpg", "publishedAt": "2022-04-07T04:27:00Z", "content": "This is an artist’s illustration of the planet KELT-20b which orbits a blue-white star. The giant planet is so close to its star (5 million miles) the torrent of ultraviolet radiation from the star h… [+7160 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Shivali Best", "title": "Astronomers discover the most distant galaxy EVER found - 13.5 billion light years from Earth - Daily Mail", "description": "Astronomers from the University of Tokyo have discovered the most distant galaxy ever found, a whopping 13.5 billion light years from Earth.", "url": "https://www.dailymail.co.uk/sciencetech/article-10694631/Astronomers-observe-distant-galaxy-spotted-study.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/07/10/56318223-0-Zoomed_in_image_of_the_galaxy_Harikane_et_al_PA_-a-62_1649323698634.jpg", "publishedAt": "2022-04-07T04:04:57Z", "content": "Astronomers have discovered the most distant galaxy ever found, a whopping 13.5 billion light years from Earth. \r\nNamed HD1, scientists are speculating what exactly it is, and what it could look like… [+5151 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Alejandro Alcantarilla", "title": "SpaceX retires old Starship vehicles, puts new ones to the test - NASASpaceFlight.com - NASASpaceflight.com", "description": "SpaceX is continuing to make progress with its prototype Starship vehicles, with Booster 7 undergoing…", "url": "https://www.nasaspaceflight.com/2022/04/spacex-retires-vehicles-new-test/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/04/A1-wmarked.jpg", "publishedAt": "2022-04-06T13:12:07Z", "content": "SpaceX is continuing to make progress with its prototype Starship vehicles, with Booster 7 undergoing a full cryoproofing test on Monday night.\r\nThe move to the latest iteration of Super Heavy marks … [+7772 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "New Hubble photo shows galaxy's bright supermassive black hole cloaked in dust - Space.com", "description": "NASA's Hubble Space Telescope captured a stunning new view of a galaxy, which, when viewed from the side, looks like any normal spiral galaxy, but it actually harbors an incredibly bright active galactic nucleus at its core.", "url": "https://www.space.com/galaxy-active-black-hole-hidden-hubble-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8TZTwHPzZNhmBRqKQy8FDg-1200-80.jpg", "publishedAt": "2022-04-06T10:00:28Z", "content": "NASA's venerable space telescope has captured a stunning new view of a galaxy with an active black hole obscured by tendrils of dark dust.\r\nThe spiral galaxy\r\n, known as NGC 7172, is located about 11… [+1743 chars]"}]}