{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Nathan Hyde", "title": "Scientists crack origin of mysterious signal from another galaxy 12m light years away - The Mirror", "description": "Astronomers analysing a series of unpredictable bright flashes 12 million light years away, which each send out as much energy as the sun gives out in a day, have made a breakthrough", "url": "https://www.mirror.co.uk/news/world-news/scientists-crack-origin-mysterious-signal-26339883", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26339896.ece/ALTERNATES/s1200/0_Spiral-Galaxy-M81-viewed-from-the-Hubble-Space-Telescope.jpg", "publishedAt": "2022-02-27T01:50:41Z", "content": "Scientists believe they have figured out the origin of mysterious deep space signals from 12 million light years away.\r\nThe team of astronomers has been analysing a series of bright flashes, known as… [+2147 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Identify Real-Life Planet With Two Suns – Like “Tatooine” From Star Wars - SciTechDaily", "description": "Study proves ground-based telescopes can search for planets with two suns. Astronomers have used a new technique to confirm a real-life Tatooine, the fictional planet with two suns that was home to Luke Skywalker in “Star Wars.” The planet, Kepler-16b, is abo…", "url": "https://scitechdaily.com/astronomers-identify-real-life-planet-with-two-suns-like-tatooine-from-star-wars/", "urlToImage": "https://scitechdaily.com/images/Kepler-16b-1-scaled.jpg", "publishedAt": "2022-02-26T11:43:04Z", "content": "Artist’s impression of Kepler-16b, the first planet known to definitively orbit two stars – what’s called a circumbinary planet. The planet, which can be seen in the foreground, was discovered by NAS… [+4663 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Laura Sharman", "title": "NASA says asteroid four times as big as the Shard is days away from Earth fly-by - The Mirror", "description": "The asteroid, which NASA says is up to 3,940ft wide, is almost four times bigger than the Eiffel Tower and the Shard and is heading past Earth in just days", "url": "https://www.mirror.co.uk/news/uk-news/nasa-says-asteroid-four-times-26329381", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26330063.ece/ALTERNATES/s1200/0_GettyImages-160936205.jpg", "publishedAt": "2022-02-26T07:35:57Z", "content": "A colossal asteroid is expected to shoot past Earth in just days, according to reports from NASA. \r\nAstronomers believe that the rock, known as 138971 (2001 CB21), is potentially hazardous and measur… [+2816 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Argentina scientists unearth dinosaur with ‘puny arms’ and hard head - The Guardian", "description": "Dinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey", "url": "https://amp.theguardian.com/science/2022/feb/25/argentina-dinosaur-fossil-skull-guemesia-ochoai", "urlToImage": null, "publishedAt": "2022-02-25T23:24:00Z", "content": "DinosaursDinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey\r\nFri 25 Feb 2022 22.56 GMT\r\nScientists in Argentina have unearthed the remains of … [+2420 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "Webb turns those 18 separate star images into a single unified star. Next comes even better focus. - Universe Today", "description": "It’s coming together! Engineers for the James Webb Space Telescope have now completed two more phases of the seven-step, three-month-long mirror alignment process. This week, the team made more adjustments to the mirror segments along with updating the alignm…", "url": "https://www.universetoday.com/154683/webb-turns-those-18-separate-star-images-into-a-single-unified-star-next-comes-even-better-focus/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/02/PostImageStacking-1024x1024-1.jpeg", "publishedAt": "2022-02-25T18:10:38Z", "content": "Its coming together! Engineers for the James Webb Space Telescope have now completed two more phases of the seven-step, three-month-long mirror alignment process. This week, the team made more adjust… [+4342 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Jona Jaupi", "title": "Two supermassive black holes will smash into each other and warp space and time, scientists warn... - The Sun", "description": "", "url": "https://www.the-sun.com/tech/4771686/two-supermassive-black-holes-space-time/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/02/la-black-hole-comp.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-25T17:30:00Z", "content": "TWO massive black holes will merge in 10,000 years, in a collision that will send ripples across the universe, a new study finds.\r\nThe research, led by a team of astronomers from CalTech, found that … [+2763 chars]"}]}