{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Mysterious dark matter ‘ghost’ particle may have finally been detected, ending decades-long search - RT", "description": "In a breakthrough that could help unravel several of the most perplexing mysteries of the universe, scientists believe they have detected traces of a hypothetical dark matter particle.", "url": "https://www.rt.com/news/512849-dark-matter-particle-axion/", "urlToImage": "https://cdni.rt.com/files/2021.01/article/60056f4020302765bf7fc7e5.jpg", "publishedAt": "2021-01-18T11:27:00Z", "content": "All the matter in the universe is made up of many different kinds of particles. The most common are protons, neutrons and electrons. However, a team of theoretical physicists believe they have uncove… [+1892 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Aaron Perine", "title": "Scientists Are Hoping to Turn Mars Green - ComicBook.com", "description": "Scientists are hoping to turn Mars green one day according to a new study in Icarus. The journal details Basically NASA is helping scientists learn how they might be able to start up food production or more on the red planet. In-Situ Resource Utilization, bas…", "url": "https://comicbook.com/irl/news/mars-green-scientists-hoping-turn/", "urlToImage": "https://media.comicbook.com/2020/12/mars-nasa-1250542-1280x0.jpeg", "publishedAt": "2021-01-18T05:11:00Z", "content": "Scientists are hoping to turn Mars green one day according to a new study in Icarus. The journal details Basically NASA is helping scientists learn how they might be able to start up food production … [+2202 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tom Fish", "title": "NASA SLS test fire: Artemis 1 ‘mega rocket’ aborts Green Run hot fire - Daily Express", "description": "NASA has ended a critical engine test early for a core stage of its cutting-edge rocket Space Launch System (SLS), the space agency has announced.", "url": "https://www.express.co.uk/news/science/1385073/nasa-sls-test-fire-artemis-1-mega-rocket-aborts-green-run-hot-fire-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1385073.jpg", "publishedAt": "2021-01-17T09:10:00Z", "content": null}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "ISS Needs More Solar Panels, Boeing Jumps In to Help - autoevolution", "description": "It was not that long ago that the fate of the International Space Station (ISS) hung in the balance, as its operators were scrambling to find funding to keep it running. In the short term, that problem has been solved, and the ISS is now looking to expand.", "url": "https://www.autoevolution.com/news/iss-needs-more-solar-panels-boeing-jumps-in-to-help-154602.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/iss-needs-more-solar-panels-boeing-jumps-in-to-help-154602-7.jpg", "publishedAt": "2021-01-17T08:43:00Z", "content": "And by expansion we don’t mean an increase in housing capabilities, but an increase in the amount of power supply generated. As most of you already know, the station generates its electricity by mean… [+1461 chars]"}, {"source": {"id": null, "name": "Glasgow Live"}, "author": "Craig Williams", "title": "International Space Station to be visible in skies above Glasgow next week - Glasgow Live", "description": "Hopefully we'll get some decent weather to be able to appreciate the largest man-made object in space as it glides across the sky!", "url": "https://www.glasgowlive.co.uk/news/glasgow-news/iss-visible-glasgow-uk-scotland-19635109", "urlToImage": "https://i2-prod.glasgowlive.co.uk/incoming/article18302978.ece/ALTERNATES/s1200/0_PAULjpeg.jpg", "publishedAt": "2021-01-16T14:52:00Z", "content": "Back in May last year, stargazers in Glasgow were afforded the incredible chance to wave at a NASA astronaut and two Russian cosmonauts as the International Space Station (ISS) passed brightly in the… [+1254 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tom Fish", "title": "Dinosaur discovery: Fossils found in Argentina may have belonged to largest land animal - Daily Express", "description": "DINOSAUR fossils unearthed in South America may belong to the largest land animal that scientists have ever found - so far.", "url": "https://www.express.co.uk/news/science/1384880/dinosaur-discovery-ancient-bones-argentinosaurus-largest-ever-land-animal-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1384880.jpg", "publishedAt": "2021-01-16T12:38:00Z", "content": null}]}