{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Donna Lu", "title": "Black carbon pollution from tourism and research increasing Antarctic snowmelt, study says - The Guardian", "description": "Black carbon pollution, which is generated by burning fossil fuels, causes snow to darken, absorb more solar energy and melt faster", "url": "https://amp.theguardian.com/world/2022/feb/22/black-carbon-pollution-from-tourism-and-research-increasing-antarctic-snowmelt-study-says", "urlToImage": null, "publishedAt": "2022-02-22T16:02:00Z", "content": "AntarcticaPollution generated by burning fossil fuels causes snow to darken, absorb more solar energy and melt faster\r\nBlack carbon pollution from tourism and research activities in Antarctica is lik… [+4525 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Harry Pettit", "title": "Mystery surrounding Tutankhamun’s ‘space dagger’ made of metal from a METEORITE finally solved... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/17730824/mystery-tutankhamuns-space-dagger-meteorite-solved/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/02/KH-COMP-TUTANKHAMUN.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-22T16:02:00Z", "content": "ARCHAEOLOGISTS have finally solved a mystery surrounding a dagger that belonged to King Tutankhamun 3,400 years ago.\r\nA fresh analysis of the weapon discovered in the pharaoh's tomb in 1922 reveals t… [+4544 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Might Be Able To Detect Other Civilizations by Their Air Pollution - SciTechDaily", "description": "The James Webb Space Telescope (JWST), launched last December, has been slowly powering up its instruments and unfurling its sunshield, and is now in the process of aligning its mirrors in preparation for operation. Within a few months, the most powerful spac…", "url": "https://scitechdaily.com/webb-space-telescope-might-be-able-to-detect-other-civilizations-by-their-air-pollution/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Orbiting-Red-Dwarf-Star.jpg", "publishedAt": "2022-02-22T14:52:21Z", "content": "This artist’s impression shows a rocky exoplanet with a wispy, cloudy atmosphere orbiting a red dwarf star. Credit: L. Hustak and J. Olmsted (STScI)\r\nThe James Webb Space Telescope (JWST), launched l… [+5103 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Lost continent of Balkanatolia is rediscovered after 40 million years - Daily Mail", "description": "The ancient continent covers the present-day Balkans and Anatolia and has been dubbed Balkanatolia by a team of researchers led by the French National Centre for Scientific Research.", "url": "https://www.dailymail.co.uk/sciencetech/article-10538307/Lost-continent-Balkanatolia-rediscovered-40-million-years.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/22/11/54498741-0-image-a-2_1645528796187.jpg", "publishedAt": "2022-02-22T12:36:45Z", "content": "An ancient forgotten continent that was wedged between Europe, Africa and Asia has been rediscovered.\r\nIt covers the present-day Balkans and Anatolia and has been dubbed Balkanatolia by researchers. … [+6538 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A “Hot Jupiter’s” Dark Side Is Revealed: Iron Clouds, Titanium Rain, and Extreme Winds - SciTechDaily", "description": "The planet’s night side likely hosts iron clouds, titanium rain, and winds that dwarf Earth’s jetstream. MIT astronomers have obtained the clearest view yet of the perpetual dark side of an exoplanet that is “tidally locked” to its star. Their observations, c…", "url": "https://scitechdaily.com/a-hot-jupiters-dark-side-is-revealed-iron-clouds-titanium-rain-and-extreme-winds/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-WASP-121-b-scaled.jpg", "publishedAt": "2022-02-22T10:32:48Z", "content": "An artists’s impression of WASP-121 b. Credit: Mikal Evans\r\nThe planet’s night side likely hosts iron clouds, titanium rain, and winds that dwarf Earth’s jetstream.\r\nMIT astronomers have obtained the… [+6623 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Greenland's Ice Sheet is melting from the bottom up - Daily Mail", "description": "This effect is by far the largest heat source beneath the world's second-largest ice sheet, \na University of Cambridge-led study found, leading to phenomenally high rates of melting at its base.", "url": "https://www.dailymail.co.uk/sciencetech/article-10535831/Greenlands-Ice-Sheet-melting-bottom-up.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/21/19/54472361-0-image-a-21_1645472152965.jpg", "publishedAt": "2022-02-21T20:00:46Z", "content": "Greenland's Ice Sheet is melting from the bottom up and is now the largest single contributor to global sea level rise, a new study has warned. \r\nResearchers have observed 'unprecedented' rates of me… [+9217 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "ESA's Solar Orbiter captures a huge eruption from the Sun - Daily Mail", "description": "The burst of radiation erupted from the side of the Sun facing away from Earth and extended millions of miles into space, the European Space Agency said.", "url": "https://www.dailymail.co.uk/sciencetech/article-10535265/ESAs-Solar-Orbiter-captures-huge-eruption-Sun.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/21/14/54463319-0-image-a-53_1645455558711.jpg", "publishedAt": "2022-02-21T15:41:45Z", "content": "A huge eruption from the sun has been caught on camera by the European Space Agency's (ESA) Solar Orbiter probe.\r\nIt is the largest such eruption ever observed in a single image with the full solar d… [+7090 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "93 million-year-old croc discovered with baby dino still in its belly - Metro.co.uk", "description": "Experts reckon the ancient croc would have been around 8 feet long when it died.", "url": "https://metro.co.uk/2022/02/21/93-million-year-old-croc-discovered-with-baby-dinosaur-in-its-stomach-16142944/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/02/SEI_89326484-1_1645458039.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-02-21T15:36:00Z", "content": "An artists impression of the Confractosuchus Sauroktonos hunting a dinosaur millions of years ago (Provider: Facebook/Australian Age of Dinosaurs)\r\nThe fossil of a 93 million-year-old crocodile has b… [+2869 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Universe's largest known galaxy is discovered measuring around 16.3 MILLION light-years long - Daily Mail", "description": "Alcyoneus, which is 3 billion light-years away from Earth, may help shed light on how radio galaxies form and why they are so big, according to experts led by Leiden Observatory in the Netherlands.", "url": "https://www.dailymail.co.uk/sciencetech/article-10534831/Universes-largest-known-galaxy-discovered-measuring-16-3-MILLION-light-years-long.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/21/13/54459441-0-image-a-19_1645448449261.jpg", "publishedAt": "2022-02-21T13:22:26Z", "content": "The largest known galaxy has been discovered by astronomers  measuring in at a whopping 153 times the size of our own Milky Way.\r\nNamed Alcyoneus, the galaxy is around 3 billion light-years away from… [+6702 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Unprecedented view of supermassive black hole could change our understanding of galaxies, researchers say - The Independent", "description": "A new study confirms a unifying theory of supermassive black hole behavior, and could help explain how galaxies form.", "url": "https://www.independent.co.uk/space/supermassive-black-hole-cosmic-dust-b2019435.html", "urlToImage": "https://static.independent.co.uk/2021/12/13/12/supermassive-black-hole-g345a09d29_1920.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-02-21T04:35:11Z", "content": "Supermassive black holes at the center of many galaxies might look more like pancakes than doughnuts,  pancakes smoking as the black holes at their center burn their inner edges.\r\nThats how Universit… [+4446 chars]"}]}