{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "New propulsion system could enable jets to reach speeds up to Mach 17 - Daily Mail", "description": "The system has a chamber with a 30-degree angle ramp that sits near the propellent mixing chamber. It stabilizes the detonation wave and uses it as a power source for jets.", "url": "https://www.dailymail.co.uk/sciencetech/article-9563897/New-propulsion-enable-jets-reach-speeds-Mach-17.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/11/00/42820452-0-image-a-15_1620688050819.jpg", "publishedAt": "2021-05-10T23:09:42Z", "content": "New technology could bring hypersonic flight into a reality by enabling jets to reach up to Mach 17 without releasing an out of control detonation.\r\nScientists at the University of Central Florida de… [+3755 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Nasa spacecraft leaves asteroid Bennu with a belly full of space rock samples - The Guardian", "description": "Osiris-Rex has been flying around the ancient asteroid since 2018 and collected nearly a pound of rubble last fall", "url": "https://amp.theguardian.com/science/2021/may/10/nasa-spacecraft-asteroid-bennu-space-rock-samples", "urlToImage": null, "publishedAt": "2021-05-10T23:06:00Z", "content": "NasaOsiris-Rex has been flying around the ancient asteroid since 2018 and collected nearly a pound of rubble last fall\r\nTue 11 May 2021 00.06 BST\r\nWith rubble from an asteroid tucked inside, a Nasa s… [+3900 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Model Saturn’s Interior – Thick Layer of Helium Rain May Influence the Planet’s Magnetic Field - SciTechDaily", "description": "Researchers simulate conditions necessary for planet’s unique magnetic field. New Johns Hopkins University simulations offer an intriguing look into Saturn’s interior, suggesting that a thick layer of helium rain influences the planet’s magnetic field. The mo…", "url": "https://scitechdaily.com/scientists-model-saturns-interior-thick-layer-of-helium-rain-may-influence-the-planets-magnetic-field/", "urlToImage": "https://scitechdaily.com/images/Saturns-Magnetic-Field.jpg", "publishedAt": "2021-05-10T18:30:38Z", "content": "The magnetic field of Saturn seen at the surface. Credit: Ankit Barik/Johns Hopkins University\r\nResearchers simulate conditions necessary for planet’s unique magnetic field.\r\nNew Johns Hopkins Univer… [+2893 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Griffin", "title": "Nasa spacecraft hears ‘hum’ outside our solar system - The Independent", "description": "A Nasa spacecraft is picking up a strange “hum” outside of our solar system.", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/space/nasa-voyager-1-space-hum-b1845015.html", "urlToImage": "https://static.independent.co.uk/2020/12/04/17/voyager.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-05-10T15:41:53Z", "content": "A Nasa spacecraft is picking up a strange hum outside of our solar system.\r\nVoyager 1 is the most distant human-made object ever, as one of a pair of spacecraft launched towards the edge of the solar… [+3239 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Scientists use single-particle hologram to create lightsabers and photon torpedos - The Independent", "description": "Small versions of the Starship Enterprise and a Klingon Battle Cruiser fired real-life holographic lasers at each other", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/holograms-lightsaber-photon-torpedos-b1844880.html", "urlToImage": "https://static.independent.co.uk/2021/05/10/16/newFile-2.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-05-10T15:19:30Z", "content": "Holograms that move and float in the air have been developed by a university research group and used to make lightsabers with real luminous beams.\r\nThe holograms are called optical trap displays, cre… [+2190 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "China's huge rocket that fell from space highlights debris risk of uncontrolled reentries - Space.com", "description": "", "url": "https://www.space.com/china-rocket-body-fall-implications", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LHJaU6ZXEVMxArhvWD7JFk-1200-80.jpg", "publishedAt": "2021-05-10T13:46:15Z", "content": "After a huge Chinese rocket plummeted\r\n apparently into the ocean late Saturday (May 8), NASA's new administrator condemned the country's use of launch technology that makes uncontrolled reentries fr… [+5065 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Scientists discover ‘living fossil’ thought to have been extinct for 273mn years on ocean floor near Japan - RT", "description": "Two symbiotic marine lifeforms who somehow evaded the prying eyes of human scientists and ‘disappeared’ from the fossil record over a quarter of a billion years ago have been found thriving offshore of Japan.", "url": "https://www.rt.com/news/523369-extinct-living-fossil-rediscovered-japan/", "urlToImage": "https://cdni.rt.com/files/2021.05/article/60990353203027208f002935.jpg", "publishedAt": "2021-05-10T10:59:00Z", "content": "The creatures in question are non-skeletal corals and crinoids, or sea lilies, who were found proliferating on the floor of the Pacific Ocean, 100 meters (330 feet) below the surface, off the coasts … [+1702 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Gareth Dorrian, Ian Whittaker", "title": "A new era of spaceflight? Promising advances in rocket propulsion - The Conversation UK", "description": "Three private companies have recently been commissioned to develop nuclear fission thermal rockets for use in orbit around the Moon.", "url": "https://theconversation.com/a-new-era-of-spaceflight-promising-advances-in-rocket-propulsion-160396", "urlToImage": "https://images.theconversation.com/files/399443/original/file-20210507-15-16ltxng.jpg?ixlib=rb-1.1.0&rect=0%2C206%2C3039%2C1517&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-05-10T09:23:38Z", "content": "The US Defense Advanced Research Projects Agency (Darpa) has recently commissioned three private companies, Blue Origin, Lockheed Martin and General Atomics, to develop nuclear fission thermal rocket… [+6539 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Twin Supernovae Open Up New Possibilities for Precision Cosmology - SciTechDaily", "description": "Cosmologists have found a way to double the accuracy of measuring distances to supernova explosions – one of their tried-and-true tools for studying the mysterious dark energy that is making the universe expand faster and faster. The results from the Nearby S…", "url": "https://scitechdaily.com/twin-supernovae-open-up-new-possibilities-for-precision-cosmology/", "urlToImage": "https://scitechdaily.com/images/Supernova-Explosion.gif", "publishedAt": "2021-05-09T23:31:09Z", "content": "Cosmologists have found a way to double the accuracy of measuring distances to supernova explosions – one of their tried-and-true tools for studying the mysterious dark energy that is making the univ… [+9909 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Lizzie Deane", "title": "Space-obsessed Elizabeth will become first child to send object to the Moon - Daily Mail", "description": "Space-obsessed Elizabeth Norman, 7, will become the first child to send an object to the Moon later this year when a sticker with her social media name is included in a time capsule taken to space.", "url": "https://www.dailymail.co.uk/news/article-9560051/Space-obsessed-Elizabeth-child-send-object-Moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/09/22/42771586-0-image-a-53_1620594606543.jpg", "publishedAt": "2021-05-09T21:38:19Z", "content": "It's an out-of-this-world ambition which is set to come true.\r\nSpace-obsessed seven-year-old Elizabeth Norman will become the first child to send an object to the Moon later this year.\r\nA sticker wit… [+2057 chars]"}]}