{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Express"}, "author": "Jacob Paul", "title": "Solar storm warning as ‘double whammy’ flare to batter Earth TONIGHT - Daily Express", "description": "TWO incoming solar storms heading straight for Earth tonight that could put the stunning Northern Lights on display may also disrupt global communications and cause power outages.", "url": "https://www.express.co.uk/news/science/1516068/solar-storm-warning-double-whammy-strike-earth-tonight-power-outage", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1516068.jpg", "publishedAt": "2021-11-03T17:30:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Signs of WATER are detected in a galaxy 12.88 billion light years from Earth - Daily Mail", "description": "It was found in SPT0311-58, a massive galaxy dating to when the universe was just 780 million years old, according to University of Illinois astronomers.", "url": "https://www.dailymail.co.uk/sciencetech/article-10161053/Signs-WATER-detected-galaxy-12-88-billion-light-years-Earth.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/03/14/50007721-0-image-a-22_1635948169234.jpg", "publishedAt": "2021-11-03T16:54:38Z", "content": "Signs of water have been detected in a galaxy 12.8 billion light years from the Earth, making it the most distant, and earliest discovered so far, astronomers claim.\r\nA number of molecules were found… [+6489 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "NASA's Curiosity rover has discovered organic molecules such as ammonia on Mars - Daily Mail", "description": "NASA's Curiosity rover discovered benzoic acid and ammonia in dirt collected from Mars. Both of which are found to occur naturally in plants and animals, including humans.", "url": "https://www.dailymail.co.uk/sciencetech/article-10161413/NASAs-Curiosity-rover-discovered-organic-molecules-ammonia-Mars.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/03/16/50013085-0-image-a-34_1635956467694.jpg", "publishedAt": "2021-11-03T16:41:25Z", "content": "NASA's Curiosity rover has discovered previously unknown organic molecules, ammonia and benzoic acid, on Mars that could be possible indicators of ancient life.\r\nThe findings stem from a new techniqu… [+5694 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "NASA has discovered a 'superbubble' in the middle of a nebula 170,000 light-years from Earth - Daily Mail", "description": "NASA's Hubble Space Telescope has discovered a 'superbubble,' an area without stars, inside a nebula that is more than 170,000 light-years away from Earth.", "url": "https://www.dailymail.co.uk/sciencetech/article-10161437/NASA-discovered-superbubble-middle-nebula-170-000-light-years-Earth.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/03/15/50011675-0-image-a-83_1635954633100.jpg", "publishedAt": "2021-11-03T16:28:13Z", "content": "NASA's Hubble Space Telescope still isn't working, but scientists combing through its data have discovered a 'superbubble' in the middle of a nebula in deep space that could have been formed by massi… [+5211 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "We Asked a NASA Expert: When Was the Last Time an Asteroid Hit Earth? - NASA", "description": "When was the last time an asteroid hit Earth? Small asteroids and other tiny particles bombard our planet daily, but almost all of them burn up safely in the...", "url": "https://www.youtube.com/watch?v=yxoua8dWoIE", "urlToImage": "https://i.ytimg.com/vi/yxoua8dWoIE/maxresdefault.jpg", "publishedAt": "2021-11-03T16:18:50Z", "content": null}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Where *isn't* Planet 9? - SYFY WIRE", "description": "For a few years now, some astronomers have been looking for another planet in the solar system, one much larger than Earth that orbits the Sun far beyond Neptune. Not-so-tongue-in-cheekily, they've been calling it Planet 9.", "url": "https://www.syfy.com/syfy-wire/bad-astronomy-search-for-planet-nine-still-continues", "urlToImage": "https://www.syfy.com/sites/syfy/files/art_roberthurt_planet9.jpg", "publishedAt": "2021-11-03T13:00:19Z", "content": "For a few years now, some astronomers have been looking for another planet in the solar system, one much larger than Earth that orbits the Sun far beyond Neptune. Not-so-tongue-in-cheekily, they've b… [+5241 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Mysterious comet has been having multiple large outbursts - Phys.org", "description": "Amateur and professional astronomers have found that the comet 29P/Schwassmann-Wachmann has been experiencing an unusually large outburst recently. Normally, it has little outbursts spread throughout the year.", "url": "https://phys.org/news/2021-11-mysterious-comet-multiple-large-outbursts.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/mysterious-comet-has-b.jpg", "publishedAt": "2021-11-03T12:40:01Z", "content": "Amateur and professional astronomers have found that the comet 29P/Schwassmann-Wachmann has been experiencing an unusually large outburst recently. Normally, it has little outbursts spread throughout… [+2554 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Shards of glass strewn across the Atacama Desert 'were likely created by an ancient exploding comet' - Daily Mail", "description": "The pieces of dark green or black glass, which came to scientists' attention a decade ago, are clustered in a corridor stretching 50 miles across Chile's Atacama Desert, experts at Brown University said.", "url": "https://www.dailymail.co.uk/sciencetech/article-10160505/Shards-glass-strewn-Atacama-Desert-likely-created-ancient-exploding-comet.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/03/11/50001937-0-image-a-44_1635939845286.jpg", "publishedAt": "2021-11-03T12:18:22Z", "content": "Mysterious shards of glass strewn across Chile's Atacama Desert were likely created by an ancient exploding comet, a study has claimed.\r\nThe pieces of dark green or black glass, which came to scienti… [+8048 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Increased Global Flood Risk Due to Intense Frequency of Extreme Ice Melting in Greenland - SciTechDaily", "description": "Global warming has caused extreme ice melting events in Greenland to become more frequent and more intense over the past 40 years according to new research, raising sea levels and flood risk worldwide. Over the past decade alone, 3.5 trillion tonnes of ice ha…", "url": "https://scitechdaily.com/increased-global-flood-risk-due-to-intense-frequency-of-extreme-ice-melting-in-greenland/", "urlToImage": "https://scitechdaily.com/images/Surface-Meltwater-Flowing-in-Greenland-scaled.jpg", "publishedAt": "2021-11-03T02:36:56Z", "content": "Surface meltwater flowing towards the ocean through a channel in Greenland. Credit: Ian Joughin\r\nGlobal warming has caused extreme ice melting events in Greenland to become more frequent and more int… [+5054 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Strain", "title": "Gravitational 'kick' may explain the strange shape at the center of Andromeda - Phys.org", "description": "When two galaxies collide, the supermassive black holes at their cores release a devastating gravitational \"kick,\" similar to the recoil from a shotgun. New research led by CU Boulder suggests that this kick may be so powerful it can knock millions of stars i…", "url": "https://phys.org/news/2021-11-gravitational-strange-center-andromeda.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/gravitational-kick-may.jpg", "publishedAt": "2021-11-02T17:33:08Z", "content": "When two galaxies collide, the supermassive black holes at their cores release a devastating gravitational \"kick,\" similar to the recoil from a shotgun. New research led by CU Boulder suggests that t… [+5373 chars]"}, {"source": {"id": null, "name": "Pnas.org"}, "author": null, "title": "Microchromosomes are building blocks of bird, reptile, and mammal chromosomes - pnas.org", "description": "Genomes of birds and reptiles, but not mammals, consist of a few large chromosomes and many tiny microchromosomes. Microchromosomes are gene-rich and highly conserved among birds and reptiles and share homology with one or more of the tiny chromosomes of an i…", "url": "https://www.pnas.org/content/118/45/e2112494118", "urlToImage": "https://www.pnas.org/content/118/45/e2112494118/F1.large.jpg", "publishedAt": "2021-11-01T19:43:37Z", "content": "Abstract\r\nMicrochromosomes, once considered unimportant shreds of the chicken genome, are gene-rich elements with a high GC content and few transposable elements. Their origin has been debated for de… [+22040 chars]"}]}