{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Snakes Diversified Explosively After Mass Extinction Where Dinosaurs Were Wiped Out - SciTechDaily", "description": "Modern snakes evolved from ancestors that lived side by side with the dinosaurs and that likely fed mainly on insects and lizards. Then a miles-wide asteroid wiped out nearly all the dinosaurs and roughly three-quarters of the planet's plant and animal specie…", "url": "https://scitechdaily.com/snakes-diversified-explosively-after-mass-extinction-where-dinosaurs-were-wiped-out/", "urlToImage": "https://scitechdaily.com/images/Snake-Diversity-Explosion.gif", "publishedAt": "2021-10-15T11:42:00Z", "content": "ByUniversity of MichiganOctober 15, 2021\r\nA sampling of snake diversity. Clockwise from upper left: rainbow boa (Epicrates cenchria), image credit Pascal Title, U-M Museum of Zoology; Amazon basin tr… [+10139 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Nuking an incoming asteroid COULD actually work, study shows - Daily Mail", "description": "A megaton nuke, exploding near the surface of an asteroid would destroy it without leaving thousands of fragments, a team from Johns Hopkins University in Baltimore, Maryland found.", "url": "https://www.dailymail.co.uk/sciencetech/article-10095597/Nuking-incoming-asteroid-actually-work-study-shows.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/15/11/49210037-0-image-a-11_1634293354803.jpg", "publishedAt": "2021-10-15T10:41:45Z", "content": "Firing a nuclear warhead at a small asteroid on a collision course with the Earth could stop 99 per cent of it hitting the planet, according to a new study. \r\nEvery two years the Center for Near Eart… [+7802 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Wild New Paper Claims Earth May Be Surrounded by a Giant Magnetic Tunnel - ScienceAlert", "description": "Mysterious structures in the sky that have puzzled astronomers for decades might finally have an explanation – and it's quite something.", "url": "https://www.sciencealert.com/earth-may-be-surrounded-by-a-giant-magnetic-tunnel", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/radio-tunnel_1024.jpg", "publishedAt": "2021-10-15T05:48:53Z", "content": "Mysterious structures in the sky that have puzzled astronomers for decades might finally have an explanation and it's quite something.\r\nThe North Polar Spur and the Fan Region, on opposite sides of t… [+4189 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Nasa prepares to launch Lucy mission to distant asteroids - The Guardian", "description": "Six-year voyage to Trojans could reveal vital information on history of solar system", "url": "https://amp.theguardian.com/science/2021/oct/15/nasa-launch-lucy-mission-distant-asteroids", "urlToImage": null, "publishedAt": "2021-10-15T05:00:00Z", "content": "SpacewatchSix-year voyage to Trojans could reveal vital information on history of solar system\r\nNasa is gearing up to launch the Lucy mission on Saturday for a voyage that could revolutionise our kno… [+1565 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Hubble finds persistent water vapor on one half of Europa that some experts believe is home to life - Daily Mail", "description": "The Hubble Space Telescope has confirmed that Jupiter's ice moon, Europa, has persistent water vapor on just one hemisphere - the trailing hemisphere.", "url": "https://www.dailymail.co.uk/sciencetech/article-10093647/Hubble-finds-persistent-water-vapor-one-half-Europa-experts-believe-home-life.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/14/21/49186919-0-image-a-32_1634243831572.jpg", "publishedAt": "2021-10-14T21:19:42Z", "content": "The Hubble Space Telescope has confirmed that Jupiter's ice moon Europa the subject of intense speculation that it could harbor alien life has persistent water vapor.\r\nStrangely enough, however, it's… [+5152 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Badham", "title": "Team demonstrates great promise of all-inorganic perovskite solar cells for improving solar cell efficiency - Phys.org", "description": "Hybrid organic-inorganic perovskites have already demonstrated high photovoltaic efficiencies of greater than 25%. The prevailing wisdom in the field is that the organic (carbon- and hydrogen-containing) molecules in the material are crucial to achieving this…", "url": "https://phys.org/news/2021-10-team-great-all-inorganic-perovskite-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/team-demonstrates-grea.jpg", "publishedAt": "2021-10-14T18:51:18Z", "content": "Hybrid organic-inorganic perovskites have already demonstrated high photovoltaic efficiencies of greater than 25%. The prevailing wisdom in the field is that the organic (carbon- and hydrogen-contain… [+3657 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Findings Suggest Venus Never Had Oceans, Conditions Needed for Life - SciTechDaily", "description": "Astrophysicists led by the UNIGE and the NCCR PlanetS have investigated the past of Venus to find out whether Earth’s sister planet once had oceans. The planet Venus can be seen as the Earth’s evil twin. At first sight, it is of comparable mass and size as ou…", "url": "https://scitechdaily.com/new-findings-suggest-venus-never-had-oceans-conditions-needed-for-life/", "urlToImage": "https://scitechdaily.com/images/Venus-Nightside-Glow.jpg", "publishedAt": "2021-10-14T16:42:36Z", "content": "ByUniversity of GenevaOctober 14, 2021\r\nThis image, which shows the night side of Venus glowing in thermal infrared, was captured by Japan’s Akatsuki spacecraft. Credit: JAXA/ISAS/DARTS/Damia Bouic\r\n… [+5992 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "Over 1600 Fast Radio Bursts Caught Coming From A Single Source In Just 47 Days - IFLScience", "description": "FRB 121102 is the most famous of all fast radio bursts, and it's just deepened the mystery of these cosmic explosions. FRBs are mysterious emissions of rad", "url": "https://www.iflscience.com/space/over-1600-fast-radio-bursts-caught-coming-from-a-single-source-in-just-47-days/", "urlToImage": "https://cdn.iflscience.com/images/ff17ec7c-1d89-5066-a577-846553435df4/default-1634211182-artist-impression-of-fast-observing-a-pulse-from-frb-121102-image-credit-naoc.jpg", "publishedAt": "2021-10-14T16:09:00Z", "content": "FRB 121102 is the most famous of all fast radio bursts, and it's just deepened the mystery of these cosmic explosions. FRBs are mysterious emissions of radio waves that release the equivalent energy … [+2806 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Live now: Watch the 2021 International Mars Society Convention online this week - Space.com", "description": "The fully virtual meeting starts Thursday, Oct. 14, and is free of charge.", "url": "https://www.space.com/mars-society-convention-2021-online-webcasts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zGbRqir5v4vHynv4Df6VWR-1200-80.jpg", "publishedAt": "2021-10-14T15:59:33Z", "content": "The 24th Annual International Mars Society Convention begins Thursday (Oct. 14), and you can watch the whole thing online for free.\r\nThe Mars Society, a space advocacy group supporting the human expl… [+2678 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Saturn's moon Titan has San Andreas Fault-like tectonic plates: study - Daily Mail", "description": "Scientists believe Saturn's moon Titan has a fault similar to the San Andreas Fault in California and it's likely active. If true, it could break up the icy surface and be a precursor to life, according to a new study.", "url": "https://www.dailymail.co.uk/sciencetech/article-10092161/Saturns-moon-Titan-San-Andreas-Fault-like-tectonic-plates-researchers-discover.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/14/15/49171765-0-image-a-38_1634221211187.jpg", "publishedAt": "2021-10-14T14:53:18Z", "content": "Scientists believe Saturn's moon Titan has a fault similar to California's San Andreas Fault and this tectonic action is most likely active.\r\nIf this is accurate, it could break up the icy surface an… [+7547 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Meteorite crashes through roof of Canada woman’s home and on to bed - The Guardian", "description": "‘I’ve never been so scared in my life,’ says Ruth Hamilton after meteorite shower above a western Canadian region", "url": "https://amp.theguardian.com/world/2021/oct/14/canada-meteorite-crashes-through-roof-bed", "urlToImage": null, "publishedAt": "2021-10-14T13:28:00Z", "content": "CanadaIve never been so scared in my life, says Ruth Hamilton after meteorite shower above a western Canadian region\r\nGuardian staff and agencies\r\nThu 14 Oct 2021 14.28 BST\r\nA woman in Canada awoke i… [+1678 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Over 1,000 fast radio bursts over a 47-day span are detected coming from a galaxy in deep space - Daily Mail", "description": "Researchers have discovered more than 1,600 Fast Radio Bursts that shot out from FRB 121102 over a span of 47 days, more than all the recorded FRBs combined.", "url": "https://www.dailymail.co.uk/sciencetech/article-10088851/Over-1-000-fast-radio-bursts-47-day-span-detected-coming-galaxy-deep-space.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/13/18/49132809-0-image-a-22_1634145760194.jpg", "publishedAt": "2021-10-13T18:31:18Z", "content": "An international group of researchers have discovered that more than 1,600 Fast Radio Bursts (FRBs) were released from FRB 121102 over a span of 47 days in 2019, more than all the recorded brief flas… [+4752 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Dimitri Veras", "title": "We've spotted a planet surviving its dying star – here's what it tells us about end of our Solar System - The Conversation US", "description": "For the first time ever, astronomers have astrophysical evidence that Jupiter and many other planets will survive the death of the Sun.", "url": "https://theconversation.com/weve-spotted-a-planet-surviving-its-dying-star-heres-what-it-tells-us-about-end-of-our-solar-system-169514", "urlToImage": "https://images.theconversation.com/files/425717/original/file-20211011-20-ki73i8.jpg?ixlib=rb-1.1.0&rect=35%2C377%2C4000%2C2000&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-10-13T15:22:27Z", "content": "How will the Solar System die? Its a hugely important question that researchers have speculated a lot about, using our knowledge of physics to create complex theoretical models. We know that the Sun … [+5749 chars]"}]}