{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Tory Shepherd", "title": "‘Waiting for a ghost’: the search for dark matter 1km under an Australian town - The Guardian Australia", "description": "To study the stuff of the universe, you have to block it out, and that is exactly what a bold project in regional Victoria is trying to do", "url": "https://amp.theguardian.com/australia-news/2021/oct/10/waiting-for-a-ghost-the-search-for-dark-matter-1km-under-an-australian-town", "urlToImage": null, "publishedAt": "2021-10-10T09:10:00Z", "content": "Australia newsTo study the stuff of the universe, you have to block it out, and that is exactly what a bold project in regional Victoria is trying to do\r\nDark matter is flowing through you, right now… [+7384 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "As Martian spacecraft experience solar conjunction, Perseverance confirms Jezero Crater's watery past - NASASpaceFlight.com - NASASpaceflight.com", "description": "On October 2, 2021, all actively operating spacecraft at Mars ceased major communication with Earth…", "url": "https://www.nasaspaceflight.com/2021/10/solar-conjunction-percy-science/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/10/26253_PIA24836-Perseverance-Selfie-at-Rochette-Horizontal-V2-web.jpg", "publishedAt": "2021-10-09T20:38:42Z", "content": "On October 2, 2021, all actively operating spacecraft at Mars ceased major communication with Earth as the planet entered its solar conjunction — an event wherein Mars crosses behind the Sun, limitin… [+8125 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Hubble snaps image of two galaxies that are merging to become one - Digital Trends", "description": "The image from the Hubble Space Telescope this week shows two galaxies which are merging into one as the force of their gravities pulls them together.", "url": "https://www.digitaltrends.com/news/hubble-arp-91-merger/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/a-dangerous-dance.jpg", "publishedAt": "2021-10-09T17:13:34Z", "content": "The image from the Hubble Space Telescope this week shows two galaxies that are merging into one as the force of their gravities pulls them together. The two galaxies, NGC 5953 and NGC 5954, are so c… [+2220 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Richard Luscombe", "title": "UK takes on Elon Musk in the broadband space race - The Guardian", "description": "A heavily criticised investment in OneWeb could bring the government a first bite at the lucrative satellite internet market", "url": "https://amp.theguardian.com/business/2021/oct/09/uk-takes-on-elon-musk-in-the-broadband-space-race", "urlToImage": null, "publishedAt": "2021-10-09T15:00:00Z", "content": "Technology sectorA heavily criticised investment in OneWeb could bring the government a first bite at the lucrative satellite internet market\r\nThey are invisible to the naked eye, but can leave a str… [+7696 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Georgina Laud", "title": "Draconid meteor shower: How to watch tonight's meteor shower - key times to watch skies - Daily Express", "description": "A METEOR SHOWER will grace the night sky today, with eagle-eyed Brits able to watch the peak of the Draconid meteor shower tonight.", "url": "https://www.express.co.uk/news/science/1503218/Draconids-meteor-shower-tonight-how-to-watch-live-shooting-stars-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1503218.jpg", "publishedAt": "2021-10-08T19:58:00Z", "content": "Up to 10 shooting stars an hour will blitz through the skies tonight as the Draconid meteor shower lights up Friday's night sky. The Draconids occur every year over several days - this year between O… [+852 chars]"}]}