{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "The first helicopter on Mars phones home and confirms it is operating as expected - Daily Mail", "description": "NASA mission control  in Southern California received the first status report from Ingenuity late on Friday via the space-based Mars Reconnaissance Orbiter.", "url": "https://www.dailymail.co.uk/sciencetech/article-9286123/The-helicopter-Mars-phones-home-confirms-operating-expected.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/22/09/39218116-0-The_first_act_of_Perseverance_which_has_been_based_on_the_bluepr-a-17_1613987282524.jpg", "publishedAt": "2021-02-22T09:57:47Z", "content": "The helicopter sent to Mars by NASA to explore the Red Planet from the sky has 'phoned home' and is working great, according to the space agency.\r\nNamed Ingenuity, it rode to Mars strapped to the bel… [+7967 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "NASA warns of STADIUM-SIZED asteroid headed towards Earth - RT", "description": "The US space agency is warning of a salvo of space rocks headed for Earth, ranging in size from a paltry 10 meters in diameter all the way up to a positively petrifying 213.", "url": "https://www.rt.com/news/516215-stadium-sized-asteroid-nasa-warning/", "urlToImage": "https://cdni.rt.com/files/2021.02/article/60329285203027166b3c3349.jpg", "publishedAt": "2021-02-21T17:25:00Z", "content": "When not keeping a close eye on its Perseverance rover, which touched down on Mars this week, NASA is busy monitoring the sky for potential threats to life on Earth – namely asteroids. And this week … [+1488 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comments on: NASA's Ingenuity Helicopter Reports In From Mars - SciTechDaily", "description": "The technology demonstration has phoned home from where it is attached to the belly of NASA’s Perseverance rover. Mission controllers at NASA’s Jet Propulsion Laboratory in Southern California have received the first status report from the Ingenuity Mars Heli…", "url": "https://scitechdaily.com/nasas-ingenuity-helicopter-reports-in-from-mars/", "urlToImage": "https://scitechdaily.com/images/NASAs-Ingenuity-Mars-Helicopter-Crop.jpg", "publishedAt": "2021-02-21T03:57:05Z", "content": "In this illustration, NASA’s Ingenuity Mars Helicopter stands on the Red Planet’s surface as NASA’s Perseverance rover (partially visible on the left) rolls away. Credit: NASA/JPL-Caltech\r\nThe techno… [+4489 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Make a Weird Discovery: A Concentration of Smaller Black Holes Lurking Where They Expected a Single Massive Black Hole - SciTechDaily", "description": "Astronomers found something they weren't expecting at the heart of the globular cluster NGC 6397: a concentration of smaller black holes lurking there instead of one massive black hole. Globular clusters are extremely dense stellar systems, which host stars t…", "url": "https://scitechdaily.com/astronomers-make-a-weird-discovery-a-concentration-of-smaller-black-holes-lurking-where-they-expected-a-single-massive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Concentration-in-NGC-6397.gif", "publishedAt": "2021-02-21T03:50:09Z", "content": "This is an artist’s impression created to visualize the concentration of black holes at the center of NGC 6397. In reality, the small black holes here are far too small for the direct observing capac… [+5587 chars]"}]}