{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Micronovae: A New Kind of Thermonuclear Stellar Explosion - SciTechDaily", "description": "A team of astronomers, with the help of the European Southern Observatory’s Very Large Telescope (ESO’s VLT), have observed a new type of stellar explosion — a micronova. These outbursts happen on the surface of certain stars, and can each burn through around…", "url": "https://scitechdaily.com/astronomers-discover-micronovae-a-new-kind-of-thermonuclear-stellar-explosion/", "urlToImage": "https://scitechdaily.com/images/Micronova.gif", "publishedAt": "2022-04-21T09:27:07Z", "content": "A team of astronomers, with the help of the European Southern Observatorys Very Large Telescope (ESOs VLT), have observed a new type of stellar explosion a micronova. These outbursts happen on the su… [+8541 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Shivali Best", "title": "NASA's Perseverance rover captures stunning footage of a solar eclipse from Mars - Daily Mail", "description": "NASA's Perseverance rover, which has been on Mars since February 2021, captured the footage with its next-generation Mastcam-Z camera on April 2.", "url": "https://www.dailymail.co.uk/sciencetech/article-10738581/NASAs-Perseverance-rover-captures-stunning-footage-solar-eclipse-Mars.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/21/10/56870717-0-image-a-401_1650531614657.jpg", "publishedAt": "2022-04-21T09:20:57Z", "content": "Seeing a solar eclipse is something that features on many people's bucket lists and now NASA has gone one step further, revealing what the phenomenon looks like from Mars.\r\nThe space agency's Perseve… [+4382 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "The Sun Just Unleashed the Strongest Solar Flare in Nearly Five Years - CNET", "description": "The worst of this one will miss us, but it is a hint of what's to come.", "url": "https://www.cnet.com/science/space/the-sun-just-unleashed-the-strongest-solar-flare-in-nearly-five-years/", "urlToImage": "https://www.cnet.com/a/img/resize/25743fec5d8643ece3714948e28a5e88a93c2e26/2022/04/20/955c9390-a557-4b68-8f5e-ffb7147ff7d0/0357utc-04-20-2022-x2pt2-flare-131-4k-1024x1024.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-04-20T22:17:00Z", "content": "NASA's Solar Dynamics Observatory captured this image of a solar flare, which can be seen in the lower right. \r\nNASA/SDO\r\nThe sun unleashed a powerful side flare late Tuesday. The eruption came from … [+2461 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Celebrating Hubble's 32nd Birthday: A Magnificent View of an Unusual Collection of Five Galaxies - SciTechDaily", "description": "NASA is celebrating the Hubble Space Telescope's 32nd birthday with a spectacular look at The Hickson Compact Group 40, an unusual close-knit collection of five galaxies. This menagerie includes three spiral-shaped galaxies, an elliptical galaxy, and a lentic…", "url": "https://scitechdaily.com/celebrating-hubbles-32nd-birthday-a-magnificent-view-of-an-unusual-collection-of-five-galaxies/", "urlToImage": "https://scitechdaily.com/images/Hubble-Hickson-Compact-Group-40-scaled.jpg", "publishedAt": "2022-04-20T18:41:34Z", "content": "NASA is celebrating the Hubble Space Telescopes 32nd birthday with a spectacular look at The Hickson Compact Group 40, an unusual close-knit collection of five galaxies.\r\nThis menagerie includes thre… [+4709 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Rhys Blakely", "title": "Prehistoric king of the skies had a plumage to match - The Times", "description": "Long before birds existed, the skies were ruled by giant airborne reptiles. According to a new fossil, not only did these creatures beat the birds to flight — t", "url": "https://www.thetimes.co.uk/article/prehistoric-king-of-the-skies-had-a-plumage-to-match-hnq220zng", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F5e783302-c0fe-11ec-8413-422ef6319ad0.jpg?crop=1600%2C900%2C0%2C0&resize=1200", "publishedAt": "2022-04-20T15:00:00Z", "content": "Long before birds existed, the skies were ruled by giant airborne reptiles. According to a new fossil, not only did these creatures beat the birds to flight they also pre-empted their plumage.Debate … [+3546 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Katie Spalding", "title": "You Can Tell If Someone Doesn't Have A Mind's Eye By Looking At Their Pupils - IFLScience", "description": "Let's do a thought experiment: imagine a ball sitting on a table. Now imagine some person comes in and pushes that ball, making it roll across the surface", "url": "https://www.iflscience.com/brain/you-can-tell-if-someone-doesnt-have-a-minds-eye-by-looking-at-their-pupils/", "urlToImage": "https://cdn.iflscience.com/images/fad2acef-1559-5e1f-9195-b6b449e52cf2/default-1650457633-cover-image.jpg", "publishedAt": "2022-04-20T13:55:00Z", "content": "Let's do a thought experiment: imagine a ball sitting on a table. Now imagine some person comes in and pushes that ball, making it roll across the surface of the table until it reaches the edge and f… [+5458 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Anthropologist Believes Ancient Human Species Could Still Be Alive In The Forests Of Flores Island - IFLScience", "description": "In 2003, archaeologists looking for evidence of the migration of modern humans from Asia to Australia stumbled across a small, fairly complete skeleton of", "url": "https://www.iflscience.com/plants-and-animals/anthropologist-believes-ancient-human-species-could-still-be-alive-on-flores-island/", "urlToImage": "https://cdn.iflscience.com/images/e5c8c029-6613-5c08-b6e0-0a4f3e0b149b/default-1650450357-flores-where-one-anthropologist-believes-an-ancient-human-may-lurk.jpg", "publishedAt": "2022-04-20T11:09:00Z", "content": "In 2003, archaeologists looking for evidence of the migration of modern humans from Asia to Australia stumbled across a small, fairly complete skeleton of an extinct human species on the Indonesian i… [+2644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why Venus rotates, slowly, despite sun's powerful grip: Planet's atmosphere explains the gravity of the situation - Phys.org", "description": "If not for the soupy, fast-moving atmosphere on Venus, Earth's sister planet would likely not rotate. Instead, Venus would be locked in place, always facing the sun the way the same side of the moon always faces Earth.", "url": "https://phys.org/news/2022-04-venus-rotates-slowly-sun-powerful.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-venus-rotates-slow.jpg", "publishedAt": "2022-04-20T10:25:47Z", "content": "If not for the soupy, fast-moving atmosphere on Venus, Earth's sister planet would likely not rotate. Instead, Venus would be locked in place, always facing the sun the way the same side of the moon … [+3863 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Curtis", "title": "Hunt is on for fallen meteorite after massive fireball is seen streaking over the west of England - Daily Mail", "description": "Scientists from the UK Fireball Alliance (UKFAll) believe that fragments of the meteorite landed somewhere south of the market town of Shrewsbury.", "url": "https://www.dailymail.co.uk/sciencetech/article-10734583/Hunt-fallen-meteorite-massive-fireball-seen-streaking-west-England.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/20/08/56821021-0-image-a-13_1650441374402.jpg", "publishedAt": "2022-04-20T08:56:48Z", "content": "A spectacular fireball seen streaking over the west of England last Wednesday night may have dropped a meteorite in Shropshire, scientists claim.\r\nScientists from the UK Fireball Alliance (UKFAll) be… [+6939 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Want to Send a NASA Probe to Uranus as a Major Research Priority - ScienceAlert", "description": "Uranus has been sadly neglected. Probes have visited Mars, Venus, Saturn, Jupiter, and Mercury. Heck, even Jupiter's moons are getting their own spacecraft. But the ice giants Uranus and Neptune, in the distant reaches of our Solar System, have not h", "url": "https://www.sciencealert.com/scientists-want-to-send-a-probe-to-uranus", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/uranus-imaged-by-voyager_1024.jpg", "publishedAt": "2022-04-20T06:59:05Z", "content": "Uranus has been sadly neglected. Probes have visited Mars, Venus, Saturn, Jupiter, and Mercury. Heck, even Jupiter's moons are getting their own spacecraft. But the ice giants Uranus and Neptune, in … [+5299 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Jupiter’s moon Europa may have water where life could exist, say scientists - The Guardian", "description": "Surface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter", "url": "https://amp.theguardian.com/science/2022/apr/19/jupiters-moon-europa-may-have-water-life-could-exist", "urlToImage": null, "publishedAt": "2022-04-19T15:27:00Z", "content": "JupiterSurface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter\r\nSubterranean pools of salty water may be commonplace on Jupiters m… [+4410 chars]"}]}