{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Aamna Mohdin", "title": "'I was horried': the starkly varied police responses to Sarah Everard vigils - The Guardian", "description": "Some events had minimal police presence and no clashes but arrests in London and Brighton unify women in anger", "url": "https://amp.theguardian.com/uk-news/2021/mar/14/varying-police-responses-to-sarah-everard-vigils-ignite-national-movement", "urlToImage": null, "publishedAt": "2021-03-14T18:36:00Z", "content": "UK newsSome events had minimal police presence and no clashes but arrests in London and Brighton unify women in anger\r\nThere was a solemn silence in Nottingham at a vigil held in memory of Sarah Ever… [+6541 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rory Tingle", "title": "'Fly my pretties, fly': Elon Musk hails the launch of another 60 Starlink satellites - Daily Mail", "description": "Video showed a Falcon 9 rocket taking off at 6.01am Sunday from the Kennedy Space Center, with the satellites located in its nose cone, prompting Musk to tweet, 'Fly my pretties, fly.'", "url": "https://www.dailymail.co.uk/news/article-9360747/Fly-pretties-fly-Elon-Musk-hails-launch-60-Starlink-satellites.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/14/16/40455606-0-image-a-84_1615741075971.jpg", "publishedAt": "2021-03-14T17:12:48Z", "content": "Elon Musk has launched another 60 Starlink satellites into the Earth's orbit as part of his plan to create a new global superfast Internet system. \r\nVideo showed a Falcon 9 rocket taking off at 6.01a… [+6977 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Isabella Nikolic", "title": "Child genius, 15, becomes youngest ever to be awarded fellowship by Royal Society of the Arts - Daily Mail", "description": "Monty Lord, from Preston, Lancashire, has now had his name etched alongside others including Charles Dickens, Stephen Hawking and David Attenborough.", "url": "https://www.dailymail.co.uk/news/article-9360563/Child-genius-15-youngest-awarded-fellowship-Royal-Society-Arts.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/14/14/40452088-0-image-a-14_1615731077573.jpg", "publishedAt": "2021-03-14T14:37:55Z", "content": "A 15-year-old child genius has become the youngest person ever to be awarded a fellowship by the Royal Society of the Arts.  \r\nMonty Lord, from Preston, Lancashire, has now had his name etched alongs… [+4124 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Brian P. D. Hannon, Stacy Liberatore", "title": "NASA team using Navajo language to name Mars land features seen by Perseverance rover - Daily Mail", "description": "The team operating Nasa's Perseverance rover has started cataloging geological formations on the surface of Mars with names from the Navajo language.", "url": "https://www.dailymail.co.uk/news/article-9358979/NASA-team-using-Navajo-language-Mars-land-features-seen-Perseverance-rover.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/13/23/40433746-0-image-a-18_1615679396798.jpg", "publishedAt": "2021-03-13T23:52:29Z", "content": "The team operating NASA's Perseverance rover has started cataloging geological formations on the surface of Mars with names from the Navajo language.\r\nThe names are a nod to the project's large conti… [+6425 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "A Planet Lost Its Atmosphere, So Its Volcanoes Made It a New One - Universe Today", "description": "A red-dwarf star called Gliese 1132 or GJ 1132 for short (astronomers and their fun nicknames!) smolders on some 41 light-years from the sun in the southern constellation Vela, just a few degrees away from the southern cross. In 2015, astronomers using the ME…", "url": "https://www.universetoday.com/150527/a-planet-lost-its-atmosphere-so-its-volcanoes-made-it-a-new-one/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/STScI-H-p2113a-m-2000x1125-1.jpg", "publishedAt": "2021-03-13T00:00:15Z", "content": "A red-dwarf star called Gliese 1132 or GJ 1132 for short (astronomers and their fun nicknames!) smolders on some 41 light-years from the sun in the southern constellation Vela, just a few degrees awa… [+4720 chars]"}]}