{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "New mysterious planet possibly spotted in solar system - RT", "description": "An object lurking in the outer region of our solar system may well be the elusive Planet 9, a leading British astronomer has suggested after digging through the telescope archives of 250,000 point sources.", "url": "https://www.rt.com/news/540624-planet-nine-existence-study/", "urlToImage": "https://cdni.rt.com/files/2021.11/article/61964afb2030275f7532ad7a.jpg", "publishedAt": "2021-11-18T12:59:00Z", "content": "Possible evidence of a mysterious planet up to 10 times bigger than Earth, with a distant orbit around the Sun, has been unveiled by professor of astrophysics at Imperial College of London, Michael R… [+2506 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "New study helps to understand cosmological lithium problem - Phys.Org", "description": "An international research team has recently updated the 7Li(d,n)24He reaction rate based on latest experimental data, which removes the significant ambiguity in the cosmological lithium (Li) problem from the perspective of nuclear physics.", "url": "https://phys.org/news/2021-11-cosmological-lithium-problem.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/new-study-helps-to-und.jpg", "publishedAt": "2021-11-18T12:38:48Z", "content": "An international research team has recently updated the 7Li(d,n)24He reaction rate based on latest experimental data, which removes the significant ambiguity in the cosmological lithium (Li) problem … [+2400 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Future Mars colonists could revolt against mission control on Earth, new study warns - The Independent", "description": "The settlers could become ‘detached’ from mission control due to time delays in communication, as well as prolonged isolation and monotony", "url": "https://www.independent.co.uk/space/mars-colonists-revolt-mission-control-earth-b1959997.html", "urlToImage": "https://static.independent.co.uk/2021/10/19/15/PRI204344642.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-11-18T11:32:26Z", "content": "Future Martian settlers will grow increasingly autonomous and could slowly stop sharing information with mission control, according to a study of colonists simulated in an extra-terrestrial environme… [+2998 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Longest partial lunar eclipse of the CENTURY will take place tomorrow morning - Daily Mail", "description": "It will be best viewed from North America, with Hawaii experiencing the full 97 per cent coverage, and much of the continent able to experience the entire event.", "url": "https://www.dailymail.co.uk/sciencetech/article-10216173/Longest-partial-lunar-eclipse-CENTURY-place-tomorrow-morning.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/18/10/50649813-0-image-a-2_1637229779329.jpg", "publishedAt": "2021-11-18T10:03:16Z", "content": "For three and a half hours tomorrow morning, some parts of the world will see most of the moon change colour, turning red as it passes through the Earth's shadow.\r\nThis will be the longest partial lu… [+11465 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "It's fake ooze, don't fall for fake ooze: Alien fossils found on Mars might just be simple chemistry, uni pair warn - The Register", "description": "Similar mistakes have been made in the past, after all", "url": "https://www.theregister.com/2021/11/18/martian_fossil_mistakes/", "urlToImage": "https://regmedia.co.uk/2021/03/08/perseverance_nasa_driving_selfie.jpg", "publishedAt": "2021-11-18T07:29:00Z", "content": "Scientists should remain skeptical if they study rock samples drilled by NASAs Perseverance rover for evidence of alien life lest they be fooled by fake fossils, academics in the UK have warned.\r\nIts… [+4352 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Tristan Greene", "title": "How the laws of physics could prevent AI from gaining sentience - TNW", "description": "A renowned theoretical computer science expert recently released an astonishing physics pre-print paper that tosses fuel on the fiery debate over... whether humans could use wormholes ...", "url": "https://thenextweb.com/news/laws-of-physics-could-prevent-ai-from-gaining-sentience", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F11%2Fwormhole_clocks.jpg&signature=4ae82fcaa0d8c872f2010b152cb44adf", "publishedAt": "2021-11-17T20:08:00Z", "content": "A renowned theoretical computer science expert recently released an astonishing physics pre-print paper that tosses fuel on the fiery debate over whether humans could use wormholes to traverse the un… [+5957 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Indian astronomers find exoplanet larger than gas giant Jupiter - RT", "description": "An exoplanet some 70% the mass of Jupiter and about 1.4 times its size has been discovered by astronomers at India’s Physical Research Laboratory (PRL). The behemoth is 752 light years away from Earth, and has an incredible orbit.", "url": "https://www.rt.com/news/540566-new-exoplanet-discovered-india/", "urlToImage": "https://cdni.rt.com/files/2021.11/article/6195540485f540324a44b497.JPG", "publishedAt": "2021-11-17T19:18:00Z", "content": "The new discovery was revealed by the Indian Space Research Organization on Tuesday in a statement saying the country’s PRL Advanced Radial-velocity Abu-sky Search (PARAS) had measured the movements … [+1733 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA visualisation reveals where spacecraft including the ISS, Landsat 9 and Aqua are in real-time - Daily Mail", "description": "The Eyes on the Earth tool is created by NASA Jet Propulsion Laboratory in California, and shows Earth-observing satellites in real time, as well as the data they are collecting.", "url": "https://www.dailymail.co.uk/sciencetech/article-10213077/NASA-visualisation-reveals-spacecraft-including-ISS-Landsat-9-Aqua-real-time.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/17/18/50619407-0-image-a-37_1637172112278.jpg", "publishedAt": "2021-11-17T18:01:27Z", "content": "NASA has updated a 3D real-time tool that lets you track Earth-observing satellites such as the recently launched Landsat 9, as well as the ISS and Aqua.\r\n Eyes on the Earth is created by the NASA Je… [+4323 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Uranus' icy moons may be hiding buried oceans, scientists say - Daily Mail", "description": "It would 'not be at all surprising' if Titania (pictured) and Oberon - Uranus' largest moons - have liquid oceans under their icy surfaces, says a University of California, Santa Cruz scientist.", "url": "https://www.dailymail.co.uk/sciencetech/article-10213377/Uranus-icy-moons-hiding-buried-oceans-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/17/17/50618419-0-image-a-29_1637170630748.jpg", "publishedAt": "2021-11-17T17:48:01Z", "content": "The two largest moons of Uranus, the seventh planet in our solar system, may be hiding buried oceans, a new study suggests. \r\nUranus has 27 known moons, of which Titania and Oberon are the largest an… [+4804 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "We Need To Prepare For Interplanetary Biosecurity - IFLScience", "description": "The Earth needs to be ready for invasion from other planets, scientists have warned, but the danger is not so much intelligent, malevolent aliens coming to", "url": "https://www.iflscience.com/space/we-need-to-prepare-for-international-biosecurity/", "urlToImage": "https://cdn.iflscience.com/images/fe8ebe47-db5f-575d-803f-08e6b586bcd2/default-1637169900-biosecurity.jpg", "publishedAt": "2021-11-17T17:27:00Z", "content": "The Earth needs to be ready for invasion from other planets, scientists have warned, but the danger is not so much intelligent, malevolent aliens coming to conquer us. Instead, the danger we face is … [+2706 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Katy Evans", "title": "Perseverance's Latest Mars Rock Sample Contains Curious 'Greenish' Mineral - IFLScience", "description": "Having long broken its record of firsts on Mars, the Perseverance rover, still pootling around sciencing the sh*t out of the Red Planet, has just locked an", "url": "https://www.iflscience.com/space/perseverances-latest-mars-rock-sample-contains-curious-greenish-mineral/", "urlToImage": "https://cdn.iflscience.com/images/f598d30f-62db-5bd3-ad35-43f01378406f/default-1637167819-cover-image.jpg", "publishedAt": "2021-11-17T17:18:00Z", "content": "Having long broken its record of firsts on Mars, the Perseverance rover, still pootling around sciencing the sh*t out of the Red Planet, has just locked and loaded its third sample to send home to Ea… [+2138 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Astronomers will launch a telescope to search for habitable planets around Alpha Centauri - Daily Mail", "description": "Known as the Toliman mission, the project led by the University of Sydney will launch in 2023 and scan Alpha Centauri AB for worlds in the habitable zone, where liquid water can flow on the surface.", "url": "https://www.dailymail.co.uk/sciencetech/article-10212287/Astronomers-launch-telescope-search-habitable-planets-Alpha-Centauri.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/17/15/50612457-0-image-a-17_1637162773962.jpg", "publishedAt": "2021-11-17T15:10:25Z", "content": "The search for 'another Earth' has been a staple of science fiction for decades, and now a group of astronomers hope to discover one on our galactic doorstep.\r\nAlpha Centauri is a triple star system … [+11012 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Merging neutron stars create more gold than collisions involving black holes – Physics World - physicsworld.com", "description": "Study suggests that kilonova events are more effective at r-process nucleosynthesis", "url": "https://physicsworld.com/merging-neutron-stars-create-more-gold-than-collisions-involving-black-holes/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2018/04/gw170817.png", "publishedAt": "2021-11-17T14:24:17Z", "content": "Biggish bang: artist's impression of a neutron-star merger (Courtesy: NASA)\r\nThe amounts of heavy elements such as gold created when black holes merge with neutron stars have been calculated and comp… [+4015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomical object found by amateur identified as new dwarf galaxy - Phys.Org", "description": "Astrophysicists at the University of Surrey and the Instituto de Astrofísica de Andalucía have identified a speck in the sky found by an amateur astronomer as a ground-breaking new dwarf galaxy called Pisces VII/ Tri III.", "url": "https://phys.org/news/2021-11-astronomical-amateur-dwarf-galaxy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/astronomical-object-fo.jpg", "publishedAt": "2021-11-17T12:57:33Z", "content": "Astrophysicists at the University of Surrey and the Instituto de Astrofísica de Andalucía have identified a speck in the sky found by an amateur astronomer as a ground-breaking new dwarf galaxy calle… [+3146 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Finger snap: Tip of the digit that is 'clicked' reaches the palm in just seven MILLISECONDS - Daily Mail", "description": "Finger snapping is the fastest acceleration the human body is able to produce, Georgia Institute of Technology-led experts determined after measuring a variety of finger snaps.", "url": "https://www.dailymail.co.uk/sciencetech/article-10211695/Finger-snap-Tip-digit-clicked-reaches-palm-just-seven-MILLISECONDS.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/17/12/50606145-0-image-a-56_1637152239215.jpg", "publishedAt": "2021-11-17T12:30:51Z", "content": "Whether you're disintegrating half of all life in the universe like Marvel's Thanos, or just doing your best Addams Family impression, here's something to think about: finger snapping is the fastest … [+13460 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Charlie Pittock", "title": "Earthquake and volcano warning amid melting ice sheets: ‘Earth is going to bite back’ - Daily Express", "description": "EARTHQUAKES and volcanic activity could be reawakened by the melting of large glaciers pressing down on the Earth's crust.", "url": "https://www.express.co.uk/news/science/1522617/earthquake-warning-volcano-isostatic-rebound-science-news-volcanic-activity-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1522617.jpg", "publishedAt": "2021-11-17T08:51:00Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Subatomic Particles Falling From The Sky Are Exposing The Inner Secrets of Volcanoes - ScienceAlert", "description": "Muons are tiny particles that penetrate matter. By measuring how well muons pass through certain parts of a volcano, experts can map the magma inside.", "url": "https://www.businessinsider.com/muons-help-map-magma-inside-volcanoes-predict-eruptions-2021-11", "urlToImage": "https://i.insider.com/618d662634224a00111fed97?width=1200&format=jpeg", "publishedAt": "2021-11-17T01:10:29Z", "content": "Muons are everywhere. Unbeknownst to you, several hundred strike your head every second. These subatomic particles created when cosmic rays enter the Earth's atmosphere are harmless and quickly decay… [+4220 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "Orion spacecraft production continues for Artemis 2 and 3 - NASASpaceFlight.com - NASASpaceflight.com", "description": "The arrival of the second Orion European Service Module (ESM) at the Kennedy Space Center…", "url": "https://www.nasaspaceflight.com/2021/11/orion-spacecraft-production/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/11/Artemis-1-Orion-Lunar-Pass.jpg", "publishedAt": "2021-11-16T19:05:08Z", "content": "The arrival of the second Orion European Service Module (ESM) at the Kennedy Space Center (KSC) in October signified the beginning of months of final assembly of the first crewed Orion spacecraft tha… [+11682 chars]"}]}