{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "NASA's James Webb Telescope teases with one more preview of an enticing star - Interesting Engineering", "description": "NASA released an image of an exciting star. Despite its mirror segments not yet being lined up, the telescope has released an image of an exciting star.", "url": "https://interestingengineering.com/nasa-james-webb-telescope-enticing-star", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/JYG0WqmoO1/sizes/webb-image_md.jpg", "publishedAt": "2022-02-28T15:14:00Z", "content": "It's just been three months since NASA's James Webb telescope started its journey and it's already showing results.\r\nDespite its mirror segments not yet being lined up, the telescope has released an … [+2061 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Anugraha Sundaravelu", "title": "Asteroid four times as big as the Shard set to cross paths with Earth - Metro.co.uk", "description": "The asteroid has been classed by astronomers as 'potentially hazardous'.", "url": "https://metro.co.uk/2022/02/28/asteroid-four-times-as-big-as-the-shard-will-cross-paths-with-earth-16188740/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/02/SEC_90766334_1646062716.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-02-28T12:48:00Z", "content": "Nasa classifies asteroids that come within less than 7.5 million km of Earth as potentially hazardous. (Picture: Getty)\r\nAn asteroid four times as big as the Shard is just days away from safely cross… [+2029 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Updates on Artemis I Mission, Test Fires RS-25 Rocket Engine [Video] - SciTechDaily", "description": "An update on our Artemis I mission, test firing an Artemis rocket engine, and a resupply mission delivers to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be/tPzByYNUPNE Video Transcript: An update on our Artemi…", "url": "https://scitechdaily.com/nasa-updates-on-artemis-i-mission-test-fires-rs-25-rocket-engine-video/", "urlToImage": "https://scitechdaily.com/images/Artemis-I-Inside-High-Bay-3-VAB.jpg", "publishedAt": "2022-02-27T16:37:27Z", "content": "Inside High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida, the work platforms have been retracted from around the Artemis I Space Launch System. Credit: NASA/Frank … [+3310 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}]}