{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Draughty window or door? Now it can be seen from space - The Guardian", "description": "Infrared satellites made by British company will use thermal imaging to pinpoint heat loss", "url": "https://amp.theguardian.com/environment/2022/feb/20/draughty-window-or-door-now-it-can-be-seen-from-space", "urlToImage": null, "publishedAt": "2022-02-20T06:00:00Z", "content": "Climate crisisInfrared satellites made by British company will use thermal imaging to pinpoint heat loss\r\nSun 20 Feb 2022 06.00 GMT\r\nA flotilla of British-built heat-sensing satellites is to be launc… [+4081 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Massive Solar Eruption Captured by Solar Orbiter Spacecraft - SciTechDaily", "description": "The ESA/NASA Solar Orbiter spacecraft has captured the largest solar prominence eruption ever observed in a single image together with the full solar disc. Solar prominences are large structures of tangled magnetic field lines that keep dense concentrations o…", "url": "https://scitechdaily.com/massive-solar-eruption-captured-by-solar-orbiter-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Solar-Orbiter-SOHO-Giant-Solar-Eruption.gif", "publishedAt": "2022-02-19T18:53:54Z", "content": "Solar Orbiter and SOHO’s view of a giant eruption – close up. Credit: Solar Orbiter/EUI and SOHO/LASCO teams, ESA &amp; NASA\r\nThe ESA/NASA Solar Orbiter spacecraft has captured the largest solar prom… [+3476 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "The largest known galaxy was just discovered, and you won’t believe how massive it is - BGR", "description": "Scientists have discovered the largest known galaxy to man and they believe it has a supermassive black hole at the center.", "url": "https://bgr.com/science/the-largest-known-galaxy-was-just-discovered-and-you-wont-believe-how-massive-it-is/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/12/AdobeStock_472168634.jpeg?quality=82&strip=all", "publishedAt": "2022-02-19T17:05:00Z", "content": "Scientists have discovered the largest known galaxy ever. The new discovery is located around 3 billion light-years away. The galaxy, which is named Alcyoneus, is a giant radio galaxy. The galaxy is … [+2896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Racking Up Accomplishments: NASA's Perseverance Rover Celebrates First Year on Mars by Learning To Run - SciTechDaily", "description": "The rover has racked up a series of accomplishments, including new distance records, as it reaches the end of the first of several planned science campaigns on the Red Planet. NASA’s Perseverance rover has notched up a slew of firsts since touching down on Ma…", "url": "https://scitechdaily.com/racking-up-accomplishments-nasas-perseverance-rover-celebrates-first-year-on-mars-by-learning-to-run/", "urlToImage": "https://scitechdaily.com/images/Mars-Perseverance-Landing.gif", "publishedAt": "2022-02-19T14:39:35Z", "content": "Animation of NASA’s Mars Perseverance Rover landing on Mars. Credit: NASA/JPL-Caltech\r\nThe rover has racked up a series of accomplishments, including new distance records, as it reaches the end of th… [+6179 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alise Fisher", "title": "Webb team brings 18 dots of starlight into hexagonal formation - Phys.org", "description": "The James Webb Space Telescope team continues to make progress in aligning the observatory's mirrors. Engineers have completed the first stage in this process, called \"Segment Image Identification.\" The resulting image shows that the team has moved each of We…", "url": "https://phys.org/news/2022-02-webb-team-dots-starlight-hexagonal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/webb-team-brings-18-do.jpg", "publishedAt": "2022-02-19T09:32:12Z", "content": "The James Webb Space Telescope team continues to make progress in aligning the observatory's mirrors. Engineers have completed the first stage in this process, called \"Segment Image Identification.\" … [+1600 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Astronauts snap stunning views of February's Full Snow Moon from space (photos) - Space.com", "description": "Astronauts on the International Space Station captured stunning views of February's Full Snow Moon this week.", "url": "https://www.space.com/february-full-snow-moon-astronaut-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cmEb8NWF6jQWbAympkJ3P5-1200-80.jpg", "publishedAt": "2022-02-18T19:29:28Z", "content": "Astronauts on the International Space Station (ISS) captured stunning views of February's Full Snow Moon this week.\r\nFull moons occur when the moon is on the opposite side of the Earth from the sun, … [+2364 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Bizarre rock spotted on Mars is being compared to a sex toy - Metro.co.uk", "description": "The strangly-shaped stone was pictured by Nasa's Curiosity rover this week.", "url": "https://metro.co.uk/2022/02/18/bizarre-rock-spotted-on-mars-is-being-compared-to-a-sex-toy-16127965/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/02/Nasa-Mars-rock-1-68af_1645182833.jpeg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-02-18T11:13:00Z", "content": "The unusual rock spotted on the Martian surface (Credits: Nasa/Twitter/@PaulHammond51)\r\nOne of the most amusing side-effects of space exploration is the hot takes that follow on from any interesting … [+3123 chars]"}]}