{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Sputnik International"}, "author": "Svetlana Ekimenko", "title": "Asteroid 'Taller Than Dubai Skyscraper, Wider than The Vatican' to Skim Past Earth - Sputnik International", "description": "NASA had earlier warned that a kilometre-plus wide, potentially hazardous asteroid would be passing near Earth in early March. The agency’s Jet Propulsion Laboratory (JPL) considers any asteroid of at least 150 metres in diameter passing...", "url": "https://sputniknews.com/20220226/asteroid-taller-than-dubai-skyscraper-wider-than-the-vatican-to-skim-past-earth-1093387124.html", "urlToImage": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1093387124.jpg?10793747951645862244", "publishedAt": "2022-02-26T07:58:01Z", "content": "https://sputniknews.com/20220226/asteroid-taller-than-dubai-skyscraper-wider-than-the-vatican-to-skim-past-earth-1093387124.html\r\nAsteroid 'Taller Than Dubai Skyscraper, Wider than The Vatican' to Sk… [+6487 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Argentina scientists unearth dinosaur with ‘puny arms’ and hard head - The Guardian", "description": "Dinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey", "url": "https://amp.theguardian.com/science/2022/feb/25/argentina-dinosaur-fossil-skull-guemesia-ochoai", "urlToImage": null, "publishedAt": "2022-02-25T23:24:00Z", "content": "DinosaursDinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey\r\nFri 25 Feb 2022 22.56 GMT\r\nScientists in Argentina have unearthed the remains of … [+2420 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Chelyabinsk meteor may have been involved in the impact that formed the moon - Daily Mail", "description": "Researchers led by the University of Cambridge think it may have been been part of an ancient collision that broke off a chunk of baby Earth to form the moon 4.5 billion years ago.", "url": "https://www.dailymail.co.uk/sciencetech/article-10551265/Chelyabinsk-meteor-involved-impact-formed-moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/25/18/54662579-0-image-a-23_1645815547765.jpg", "publishedAt": "2022-02-25T18:53:11Z", "content": "The Chelyabinsk meteor that exploded over Russia in 2013 may also have been involved in the massive impact that formed the moon, a new study suggests.\r\nResearchers led by the University of Cambridge … [+5407 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Death Spiral: A Black Hole Spins on Its Side – “Completely Unexpected” - SciTechDaily", "description": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding challenges current theoretical models of black hole formati…", "url": "https://scitechdaily.com/death-spiral-a-black-hole-spins-on-its-side-completely-unexpected/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Binary-System-MAXI-J1820-070.gif", "publishedAt": "2022-02-25T18:15:38Z", "content": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding… [+4163 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope is nearly halfway through its mirror alignment stages - Space.com", "description": "NASA recently completed the third of seven planned steps to align the 18 hexagonal segments of Webb's mirror, marking nearly the halfway point in a complex, weeks-long process.", "url": "https://www.space.com/jwst-nearly-halfway-through-mirror-alignment", "urlToImage": "https://cdn.mos.cms.futurecdn.net/THnUxu2cNZXezoXKDRqBHX-1200-80.gif", "publishedAt": "2022-02-25T17:34:51Z", "content": "Stars are getting sharper in the James Webb Space Telescope's field of view.\r\nThe team recently completed the third of seven planned steps to align the 18 hexagonal segments of Webb's mirror, marking… [+2978 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Jamie Harris", "title": "Space sleuths can’t work out what weird ‘bowling pin’ object is on Mars... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/17770341/mars-weird-object-spotted-nasa-space/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/02/crop-17771433.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-25T14:28:00Z", "content": "SPACE fans have been left baffled by something on Mars shaped like a bowling pin.\r\nThe odd object was captured by Nasa's Curiosity Rover earlier this month but observers have been scratching their he… [+1691 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "QUARTER of the northern sky is mapped, revealing 4.4 million objects in astonishing detail - Daily Mail", "description": "An international team of astronomers have been using the low Frequency Array (LOFAR), a pan-European radio telescope, to capture details of the universe.", "url": "https://www.dailymail.co.uk/sciencetech/article-10549017/QUARTER-northern-sky-mapped-revealing-4-4-million-objects-astonishing-detail.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/25/09/54639619-0-image-a-2_1645779670155.jpg", "publishedAt": "2022-02-25T10:00:46Z", "content": "More than a quarter of the northern sky above the Earth has been mapped, revealing details of 4.4 million objects ranging from galaxies to black holes. \r\nAn international team of astronomers have bee… [+5517 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New simulations refine axion mass, refocusing dark matter search - Phys.org", "description": "Physicists searching—unsuccessfully—for today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were produced shortly after the Big Bang 13.6 billion years ago.", "url": "https://phys.org/news/2022-02-simulations-refine-axion-mass-refocusing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-simulations-refine.jpg", "publishedAt": "2022-02-25T10:00:09Z", "content": "Physicists searchingunsuccessfullyfor today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were p… [+11546 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Largest ever human family tree: 27 million ancestors - Science Daily", "description": "Researchers have taken a major step towards mapping the entirety of genetic relationships among humans: a single genealogy that traces the ancestry of all of us.", "url": "https://www.sciencedaily.com/releases/2022/02/220224140841.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-24T23:43:57Z", "content": "Researchers from the University of Oxford's Big Data Institute have taken a major step towards mapping the entirety of genetic relationships among humans: a single genealogy that traces the ancestry … [+3887 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Vishwam Sankaran", "title": "New mysterious material discovered on dark side of the Moon - The Independent", "description": "Globules could be promising resources to produce glasses in-situ on moon for future lunar bases, scientists say", "url": "https://www.independent.co.uk/space/moon-rover-discovery-lunar-surface-b2022414.html", "urlToImage": "https://static.independent.co.uk/2022/02/24/07/Screenshot%202022-02-24%20at%201.03.38%20PM.png?quality=75&width=1200&auto=webp", "publishedAt": "2022-02-24T14:25:07Z", "content": "Chinas Yutu-2 rover has discovered several mysterious, translucent glass globules on the far side of the moon, which scientists say are unlike any mineral they had previously discovered on the lunar … [+2370 chars]"}]}