{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Alex Moshakis", "title": "Professor Avi Loeb: 'It would be arrogant to think we're alone in the universe' - The Guardian", "description": "When Harvard professor Avi Loeb discovered possible signs of extraterrestrial activity, it caused a scandal in the research community. Is fear and conservatism stopping science from considering plausible evidence that there are aliens out there?", "url": "https://amp.theguardian.com/science/2021/jan/31/professor-avi-loeb-it-would-be-arrogant-to-think-were-alone-in-the-universe-", "urlToImage": null, "publishedAt": "2021-01-31T08:00:00Z", "content": "Alien lifeWhen Harvard professor Avi Loeb discovered possible signs of extraterrestrial activity, it caused a scandal in the research community. Is fear and conservatism stopping science from conside… [+14197 chars]"}, {"source": {"id": null, "name": "LBC"}, "author": "Nick Hardinges", "title": "Four-year-old girl discovers dinosaur footprint on Welsh beach - LBC", "description": "A four-year-old girl has discovered a 220 million-year-old dinosaur footprint on a beach in South Wales.", "url": "https://www.lbc.co.uk/news/four-year-old-girl-discovers-dinosaur-footprint-wales-beach-barry/", "urlToImage": "https://images.lbc.co.uk/images/216115?width=1200&crop=16_9&signature=-oEFECm8zrN0b_9pSM4iAeuSTW8=", "publishedAt": "2021-01-30T21:59:00Z", "content": "30 January 2021, 21:59\r\nThe dinosaur footprint is believed to be 220 million years old.\r\nPicture: \r\nPA\r\nA four-year-old girl has discovered a 220 million-year-old dinosaur footprint on a beach in Sou… [+1951 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Antarctica bombshell: Mars mineral found trapped in polar ice can link Earth to Red Planet - Daily Express", "description": "ANTARCTICA researchers boring into the icy continent have stumbled upon particles of jarosite - a mineral so rare it is more likely to be found on Mars. Scientists now believe the discovery could draw a link between the Earth and Red Planet.", "url": "https://www.express.co.uk/news/science/1391287/antarctica-news-mars-mineral-jarosite-polar-ice-earth-red-planet-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1391287.jpg", "publishedAt": "2021-01-30T18:58:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Is there life on Mars? Not if we destroy it with poor space hygiene - The Guardian", "description": "As countries begin an age of Martian exploration, planetary protection advocates insist we must be careful of interplanetary contamination", "url": "https://amp.theguardian.com/science/2021/jan/30/mars-life-perseverance-rover-nasa-planetary-protection", "urlToImage": null, "publishedAt": "2021-01-30T17:00:00Z", "content": "MarsAs countries begin an age of Martian exploration, planetary protection advocates insist we must be careful of interplanetary contamination\r\nNext month, three new spacecraft arrive at Mars. Two re… [+11604 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Four Exoplanets – Including a Super-Earth Planet – Discovered by High School Students - SciTechDaily", "description": "The high schoolers turned scientists published their findings this week, thanks to a research mentorship program at the Center for Astrophysics; Harvard and Smithsonian. They may be the youngest astronomers to make a discovery yet. This week, 16-year-old Kart…", "url": "https://scitechdaily.com/four-exoplanets-including-a-super-earth-planet-discovered-by-high-school-students/", "urlToImage": "https://scitechdaily.com/images/Exoplanets-Orbiting-Star-TOI-1233-scaled.jpg", "publishedAt": "2021-01-30T15:37:45Z", "content": "A five-planet system around TOI-1233 includes a super-Earth (foreground) that could help solve mysteries of planet formation. The four innermost planets were discovered by high schoolers Kartik Pingl… [+5857 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brandon Specktor", "title": "Earth is about to lose its second moon, forever - Space.com", "description": "Godspeed, SO 2020. Enjoy your journey around the sun.", "url": "https://www.space.com/farewell-minimoon-so-2020", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LM2yuoxdGNc3VYNddhDRs5-1200-80.gif", "publishedAt": "2021-01-30T12:13:00Z", "content": "Earth's second moon will make a close approach to the planet next week before drifting off into space, never to be seen again.\r\n\"What second moon,\" you ask? Astronomers call it2020 SO\r\n a small objec… [+2387 chars]"}, {"source": {"id": null, "name": "Kent Online"}, "author": "Sean McPolin", "title": "Elon Musk's SpaceX Starlink broadband to be tested out by Sittingbourne man - Kent Online", "description": "A Kent man has become one of a select few people in the UK to test out billionaire Elon Musk's new satellite broadband service Starlink.", "url": "https://www.kentonline.co.uk/sittingbourne/news/kent-man-one-of-a-handful-to-trial-elon-musks-7bn-broadband-service-241611/", "urlToImage": "https://www.kentonline.co.uk/_media/img/DW1UHZF8S5B3O9XB25HM.jpg", "publishedAt": "2021-01-30T06:00:00Z", "content": "A Kent man has become one of a \"handful\" of people in the UK to test out billionaire Elon Musk's new satellite broadband service.\r\nSpaceX Starlink was created in the hope of providing internet to rem… [+2780 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "NASA to conduct 2nd 'hot fire' test with SLS megarocket in February - Space.com", "description": "Second time's the charm.", "url": "https://www.space.com/nasa-sls-megarocket-second-hot-fire-test", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V44PnEHCu7tFRbgLcr2CXn-1200-80.jpg", "publishedAt": "2021-01-29T23:32:00Z", "content": "NASA will conduct a second critical engine test for its first Space Launch System megarocket in February after the first attempt ended earlier than planned this month.\r\n\"NASA plans to conduct a secon… [+3020 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Female physicist invents fusion rocket that may take humans to Mars - Daily Mail", "description": "Dr. Fatima Ebrahimi designed a fusion rocket that uses magnetic fields to shoot plasma particles from a craft, which could  take humans to Mars 10 times  faster than current devices.", "url": "https://www.dailymail.co.uk/sciencetech/article-9202081/Female-physicist-invents-new-fusion-rocket-humans-Mars.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/29/16/38641386-0-image-a-17_1611939152918.jpg", "publishedAt": "2021-01-29T16:46:00Z", "content": "Dr. Fatima Ebrahimi has invented a new fusion rocket that could one day take humans to Mars\r\nDr. Fatima Ebrahimi, who works for the US Department of Energy's Princeton Plasma Physics Laboratory (PPPL… [+4016 chars]"}]}