{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Updates on Artemis I Mission, Test Fires RS-25 Rocket Engine [Video] - SciTechDaily", "description": "An update on our Artemis I mission, test firing an Artemis rocket engine, and a resupply mission delivers to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be/tPzByYNUPNE Video Transcript: An update on our Artemi…", "url": "https://scitechdaily.com/nasa-updates-on-artemis-i-mission-test-fires-rs-25-rocket-engine-video/", "urlToImage": "https://scitechdaily.com/images/Artemis-I-Inside-High-Bay-3-VAB.jpg", "publishedAt": "2022-02-27T16:37:27Z", "content": "Inside High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida, the work platforms have been retracted from around the Artemis I Space Launch System. Credit: NASA/Frank … [+3310 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Nathan Hyde", "title": "Scientists crack origin of mysterious signal from another galaxy 12m light years away - The Mirror", "description": "Astronomers analysing a series of unpredictable bright flashes 12 million light years away, which each send out as much energy as the sun gives out in a day, have made a breakthrough", "url": "https://www.mirror.co.uk/news/world-news/scientists-crack-origin-mysterious-signal-26339883", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26339896.ece/ALTERNATES/s1200/0_Spiral-Galaxy-M81-viewed-from-the-Hubble-Space-Telescope.jpg", "publishedAt": "2022-02-27T01:50:41Z", "content": "Scientists believe they have figured out the origin of mysterious deep space signals from 12 million light years away.\r\nThe team of astronomers has been analysing a series of bright flashes, known as… [+2147 chars]"}]}