{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "ARIES Nainital Develops Optical Spectrograph to Locate Faint Light from Distant Celestial Objects | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The spectroscope, the largest of its kind among the existing astronomical spectrographs in the country, has been successfully commissioned on the 3.6-m Devasthal Optical Telescope (DOT), the largest in the country and Asia, near Nainital, Uttarakhand. - Artic…", "url": "https://weather.com/en-IN/india/space/news/2021-03-05-aries-nainital-develops-optical-spectrograph-to-locate-faint-light", "urlToImage": "https://s.w-x.co/in-supernovaexplosion_0.jpg", "publishedAt": "2021-03-05T04:30:41Z", "content": "Indian scientists have indigenously designed and developed a low-cost optical spectrograph that can locate sources of faint light from distant quasars and galaxies, regions around supermassive black-… [+2595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Path to NASA started way back watching Star Trek as a child, Indian-American Swati Mohan tells Biden - The Indian Express", "description": "Mohan, who emigrated from India to the US when she was only a year old, said her path actually started way back when she was a child, watching popular TV show Star Trek.", "url": "https://indianexpress.com/article/world/path-to-nasa-started-way-back-watching-star-trek-as-a-child-indian-american-swati-mohan-tells-biden-7214930/", "urlToImage": "https://images.indianexpress.com/2021/03/Swati-Mohan-2.jpg", "publishedAt": "2021-03-05T03:22:12Z", "content": "Indian-American aerospace engineer Swati Mohan, who played a key role in the successful landing of NASA’s Perseverance rover on the Martian surface, told President Joe Biden on Thursday that her path… [+4401 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "China's Mars Probe Tianwen-1 Captures High-Resolution Photos of Red Planet - News18", "description": "China's national space agency published two panchromatic view and one colour images of Mars captured by the country's Tianwen-1 probe, which is currently orbiting the Red planet.", "url": "https://www.news18.com/news/buzz/chinas-mars-probe-tianwen-1-captures-high-resolution-photos-of-red-planet-3499883.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1614909077_untitled-design.png", "publishedAt": "2021-03-05T01:51:00Z", "content": "tianwen-1 Probe news18It’s not just Peserverence or ESA’s ExoMars orbiter, China’s Tianwen-1 Probe is also beaming back images of the red planet. \r\nChina’s national space agency on Thursday published… [+2557 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Newly discovered millipede, Nannaria hokie, lives at Virginia Tech - Science Daily", "description": "Hearing the words \"new species discovered\" may conjure images of deep caves, uncharted rainforests, or hidden oases in the desert. But the reality is that thousands of new species are discovered each year by enterprising scientists all over the world. Many of…", "url": "https://www.sciencedaily.com/releases/2021/03/210304133505.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-04T20:14:30Z", "content": "Hearing the words \"new species discovered\" may conjure images of deep caves, uncharted rainforests, or hidden oases in the desert.But the reality is that thousands of new species are discovered each … [+5531 chars]"}, {"source": {"id": null, "name": "Nintendo-power.com"}, "author": "Ebenezer Robbins", "title": "Physics World: Supervenus near us - Nintendo-Power", "description": "Meanwhile, astronomers have discovered many solar rocks - similar to the inner planets of our solar system - in distant stars. However, little is known", "url": "https://nintendo-power.com/physics-world-supervenus-near-us/", "urlToImage": null, "publishedAt": "2021-03-04T19:26:43Z", "content": "Meanwhile, astronomers have discovered many solar rocks – similar to the inner planets of our solar system – in distant stars. However, little is known about these strange worlds. The newly discovere… [+3243 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Raleigh McElvery | Department of Biology", "title": "Eyeless roundworms sense color - MIT News", "description": "MIT researchers have discovered that roundworms sense color in order to assess the risk of feasting on potentially dangerous bacteria that secrete blue toxins.", "url": "https://news.mit.edu/2021/eyeless-roundworms-sense-color-0304", "urlToImage": "https://news.mit.edu/sites/default/files/images/202103/C-elegans-on-agar-plate-seeing-color-00.png", "publishedAt": "2021-03-04T19:00:00Z", "content": "Roundworms dont have eyes or the light-absorbing molecules required to see. Yet, new research shows they can somehow sense color. The study, published on March 5 in the journal Science, suggests worm… [+5647 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Sandhya Ramesh", "title": "Scientists observe ‘space hurricane’ over North Pole that spanned 1,000 km, swirled for 8 hrs - ThePrint", "description": "Hurricane in Earth's upper atmospheric layers caused by same phenomenon that results in the colourful aurorae, popularly known as Northern Lights when it occurs at North Pole.", "url": "https://theprint.in/science/scientists-observe-space-hurricane-over-north-pole-that-spanned-1000-km-swirled-for-8-hrs/615648/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/03/Space-hurricane.jpg", "publishedAt": "2021-03-04T17:55:52Z", "content": "Bengaluru: The first ever observation of a space hurricane on Earths upper layers of atmosphere has been announced by scientists at the University of Reading, in collaboration with the Shandong Unive… [+4053 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "NASA’s 'Giant Space Sunflower' Hubble Successor Telescope is Ready for Big Launch - News18", "description": "The new space telescope called the James Webb Space Telescope (JWST) or simply ‘Webb,’ is designed and funded by NASA, the European Space Agency (ESA) and the Canadian Space Agency (CSA).", "url": "https://www.news18.com/news/buzz/nasas-giant-space-sunflower-hubble-successor-telescope-is-ready-for-big-launch-3498497.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1614874063_webb.jpeg", "publishedAt": "2021-03-04T16:10:00Z", "content": "The National Aeronautics and Space Administrations (NASA) Hubble Space telescopes much-awaited successor is almost ready for a launch. The James Webb Space Telescope (JWST) or simply Webb, which was … [+1991 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "Mantis Shrimp-Inspired Optical Sensor for Hyperspectral, Polarimetric Imaging - AZoSensors", "description": "Scientists have taken cues from the eyes of mantis shrimp to design a new type of optical sensor that is quite small to fit on a smartphone but can also perform polarimetric and hyperspectral imaging.", "url": "https://www.azosensors.com/news.aspx?newsID=14388", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_14388_16148653280953083.jpg", "publishedAt": "2021-03-04T16:09:00Z", "content": "Written by AZoSensorsMar 4 2021\r\nScientists have taken cues from the eyes of mantis shrimp to design a new type of optical sensor that is small enough to fit on a smartphone but can also perform pola… [+5413 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Researchers Succeed in Injecting Nanodiamonds Directly to the Cell Interior - AZoNano", "description": "Several researchers have strangely tried to place very small diamonds within living cells. This is because nanodiamonds are constantly bright and can offer a better understanding of the inner life of cells over a long period.", "url": "https://www.azonano.com/news.aspx?newsID=37815", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ThumbForNews_37815_16148649447359424.png", "publishedAt": "2021-03-04T15:45:00Z", "content": "Written by AZoNanoMar 4 2021\r\nSeveral researchers have strangely tried to place very small diamonds within living cells. This is because nanodiamonds are constantly bright and can offer a better unde… [+2953 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Protein discovery could help enable eco-friendly fungicides - EurekAlert", "description": "New research reveals an essential step in scientists' quest to create targeted, RNA-based, more eco-friendly fungicides that protect food crops.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uoc--pdc030421.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/258114_web.jpg", "publishedAt": "2021-03-04T15:33:45Z", "content": "IMAGE: Strawberry infected with gray mold, a fungal disease that primarily affects ripening or damaged fruit.\r\n view more \r\nCredit: Nicole Ward Gauthier/University of Kentucky\r\nNew research reveals a… [+3489 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "Scientists find organic material and water on asteroid for the first time - Republic TV", "description": "Scientists discovered organic material and water on tiny ‘grain’ of Itokava collected by the JAXA mission with ESA's participation in JAXA’s Hayabusa mission.", "url": "https://www.republicworld.com/world-news/global-event-news/scientists-find-organic-material-and-water-on-asteroid-for-the-first-time.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ib4qzsphhcgq3mu3_1614865666.jpeg?tr=f-jpeg", "publishedAt": "2021-03-04T15:19:00Z", "content": "In a breakthrough discovery, scientists have detected water and organic matter on the surface of an asteroid dubbed as Itokava. The study was documented in the journal Scientific Reports. The sample … [+2763 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "A COSMIC Approach to Nanoscale Science: World-Leading Resolution of Nanomaterials - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/a-cosmic-approach-to-nanoscale-science-world-leading-resolution-of-nanomaterials/", "urlToImage": null, "publishedAt": "2021-03-04T15:18:16Z", "content": "Instrument at Berkeley Labs Advanced Light Source achieves world-leading resolution of nanomaterials.\r\nCOSMIC, a multipurpose X-ray instrument at Lawrence Berkeley National Laboratorys (Berkeley Labs… [+12565 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Starlink internet to reach India in 2022: Here's what the Rs 7,200 pre-order deposit gets you - Firstpost", "description": "The service will be launched in most, if not all regions of India, in 2022, and now open to preorders for a refundable USD 99 deposit.", "url": "https://www.firstpost.com/tech/science/starlink-internet-to-reach-india-in-2022-heres-what-the-inr-7200-preorder-deposit-gets-you-9377121.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/03/Elon-Musk-Starlink-Satellite-Internet-Coming-to-India_Starlink.jpg", "publishedAt": "2021-03-04T12:57:14Z", "content": "tech2 News StaffMar 04, 2021 18:27:14 IST\r\nThe world has waited with bated breath for the Starlink satellite broadband service to go live. There were rumours about a likely launch in India soon, whic… [+2682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Air pollution fell sharply during lockdown - Phys.org", "description": "The far-reaching mobility restrictions at the beginning of the COVID pandemic in March 2020 created a unique situation for atmospheric sciences: \"During the 2020 lockdown, we were able to directly investigate the actual effects of drastic traffic restrictions…", "url": "https://phys.org/news/2021-03-air-pollution-fell-sharply-lockdown.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/4-airpollution.jpg", "publishedAt": "2021-03-04T12:55:39Z", "content": "The far-reaching mobility restrictions at the beginning of the COVID pandemic in March 2020 created a unique situation for atmospheric sciences: \"During the 2020 lockdown, we were able to directly in… [+3657 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "Indian scientists develop low-cost spectrograph that can locate faint light from distant celestial objects - Jagran Josh", "description": "The spectrograph can detect faint light from distant quasars and galaxies, regions around supermassive black-holes and cosmic explosions.", "url": "https://www.jagranjosh.com/current-affairs/indian-scientists-develop-lowcost-spectrograph-that-can-locate-faint-light-from-distant-celestial-objects-1614858186-1", "urlToImage": "https://img.jagranjosh.com/images/2021/March/432021/made_in_india_spectrograph.jpg", "publishedAt": "2021-03-04T11:54:00Z", "content": "In a significant development, Indian Scientists have indigenously designed and developed a low-cost optical spectrograph, which is capable of locating sources of faint light from distant celestial ob… [+2675 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists confirmed the existence of the Earth’s innermost inner core - Tech Explorist", "description": "Scientists from The Australian National University (ANU) have confirmed the existence of the Earth's \"innermost inner core\". They found evidence that may indicate a change in the structure of iron, which suggests perhaps two separate cooling events in Earth's…", "url": "https://www.techexplorist.com/scientists-confirmed-existence-earth-innermost-inner-core/38129/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/03/earth-blue-planet-globe-planet-41953.jpeg", "publishedAt": "2021-03-04T11:40:19Z", "content": "It has been thought that the Earth has four main layers: the crust, the mantle, the outer core, and the inner core. Almost a decade ago, a couple proposed the idea of the presence of another distinct… [+1247 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Photon-photon polaritons: Binding two photons of different colours together - Tech Explorist", "description": "Scientists exploring the interactions between light particles, photons, and matter find that optical microresonators host quasiparticles made by two photons.", "url": "https://www.techexplorist.com/photon-photon-polaritons-binding-two-photons-different-colours-together/38108/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/03/Photon-photon-polaritons.jpg", "publishedAt": "2021-03-04T11:40:19Z", "content": "The concept of momentum and energy (and therefore mass) is easy for most people, especially when it comes to solid objects. Most of them are not aware that non-material objects, such as light waves, … [+3091 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Aanchal Nigam", "title": "Scientists discover origin of suns solar storms; can disrupt satellites on Earth: Study - Republic TV", "description": "In groundbreaking discovery, scientists have determined origin of dangerous solar storms that could even help them forecast devastating eruptions from the Sun.", "url": "https://www.republicworld.com/technology-news/science/scientists-discover-origin-of-suns-solar-storms-can-disrupt-satellites-on-earth-study.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/fg0hhpm2m8ykrqzq_1614848395.jpeg?tr=f-jpeg", "publishedAt": "2021-03-04T10:32:00Z", "content": "In a breakthrough discovery, scientists have determined the origin of dangerous solar storms that could even help them forecast the devastating eruptions from the Sun. Solar storms are basically the … [+2589 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Long March-8 rocket likely to try out vertical landing in 2021: Chinese developer - Global Times", "description": "Development for a fusion version of China’s potentially reusable medium-sized launch vehicle, the Long March-8, has been initiated, and it is hoped that the new rocket will carry out key technology demonstration tests for vertical take-off and vertical landin…", "url": "https://www.globaltimes.cn/page/202103/1217312.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2020/2020-12-16/bd06c840-598e-488e-9d12-5a5e15c8f405.jpeg", "publishedAt": "2021-03-04T09:10:00Z", "content": "Jiang Jie Photo: Courtesy of CALT\r\nDevelopment for a fusion version of China's potentially reusable medium-sized launch vehicle, the Long March-8, has been initiated, and it is hoped that the new roc… [+3854 chars]"}, {"source": {"id": null, "name": "Sixthtone.com"}, "author": "Sixth Tone", "title": "Chinese Scientists Unveil Fish-Like Robot for Deep-Sea Exploration - Sixth Tone", "description": "The robot was successfully tested under extreme temperature and pressure in the Mariana Trench.", "url": "https://www.sixthtone.com/news/1006916/chinese-scientists-unveil-fish-like-robot-for-deep-sea-exploration", "urlToImage": "http://image5.sixthtone.com/image/5/35/697.jpg", "publishedAt": "2021-03-04T08:34:15Z", "content": "Watch out, giant squids and anglerfish: There may be a new, artificial addition to Earths deep-sea ecosystems.\r\nA research team led by scientists from Zhejiang University in eastern China have design… [+2426 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Nasa's Mars rover Perseverance runs on chip first used in 1998 Apple iMac - India Today", "description": "Nasa's Mars rover Perseverance is using the same processor that was first used in Apple's iMac computers in 1998. The processor is capable of withstanding intense radiation and temperatures.", "url": "https://www.indiatoday.in/science/story/nasa-s-mars-rover-perseverance-runs-chip-first-1998-apple-imac-1775518-2021-03-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202103/000_93B9DL-647x363.jpeg?3LGr2_Ds4CDzn75rqnNbivckhdy8QCAj", "publishedAt": "2021-03-04T08:11:10Z", "content": "The National Aeronautics and Space Administration's (Nasa) Mars rover, Perseverance is using the same processor that was first used in colourful Apple's iMac computers in the late 1990s.\r\nAccording t… [+2465 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "DJ finds out baby Zebrafish `groove` to MC Hammer hit song - WION", "description": "Being a 90s baby or 90s kid and wearing this fact on the sleeve is all in vogue. Well yeah, the decade was unique. Although the majority of millennials cant get enough of 90s music, 90s life and whatnot, something that happened bang at the start of the decade…", "url": "https://www.wionews.com/science/dj-finds-out-baby-zebrafish-groove-to-mc-hammer-hit-song-367859", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/03/04/185544-thumb00000.jpg", "publishedAt": "2021-03-04T06:26:19Z", "content": "Being a 90s baby or 90s kid and wearing this fact on the sleeve is all in vogue. Well yeah, the decade was unique. Although the majority of millennials can't get enough of 90s music, 90s life and wha… [+1895 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New microcomb could help discover exoplanets and detect diseases - EurekAlert", "description": "Tiny photonic devices could be used to find new exoplanets, monitor our health, and make the internet more energy efficient. Researchers from Chalmers University of Technology, Sweden, now present a game changing microcomb that could bring advanced applicatio…", "url": "https://www.eurekalert.org/pub_releases/2021-03/cuot-nmc030321.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/258015_web.jpg", "publishedAt": "2021-03-04T05:02:09Z", "content": "IMAGE: PhD Student Óskar Bjarki Helgason demonstrates the chip and the experimental setup for generating the game changing microcomb.\r\n view more \r\nCredit: Photo: Mia Halleröd Palmgren, Collage: Yen … [+6083 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Wikipedia maintained high-quality COVID-19 coverage during first pandemic wave - News-Medical.Net", "description": "Researchers in Israel have demonstrated that Wikipedia's coverage of the coronavirus disease 2019 (COVID-19) pandemic continued to be based on respected media and academic sources, despite a surge in coverage as the pandemic grew during the first wave.", "url": "https://www.news-medical.net/news/20210303/Wikipedia-maintained-high-quality-COVID-19-coverage-during-first-pandemic-wave.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/shutterstock_746561179.jpg", "publishedAt": "2021-03-04T04:15:00Z", "content": "Researchers in Israel have demonstrated that Wikipedia's coverage of the coronavirus disease 2019 (COVID-19) pandemic continued to be based on respected media and academic sources, despite a surge in… [+5520 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Researchers achieve inhibition of ice for cryopreservation - BollyInside", "description": "As we experience in our daily life, jiaozi frozen in a home refrigerator tastes less delicious than instant frozen sold at the supermarket. The formation", "url": "https://www.bollyinside.com/news/researchers-achieve-inhibition-of-ice-for-cryopreservation/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/03/Researchers-achieve-inhibition-of-ice-for-cryopreservation.jpg", "publishedAt": "2021-03-04T02:00:40Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Eddie Irizarry", "title": "A flyby this week of infamous asteroid Apophis - EarthSky", "description": "Near-Earth asteroid Apophis will have its closest sweep past Earth prior to its exceedingly close 2029 pass, on March 5-6, 2021. Why astronomers are watching, plus info here on how to view the asteroid online.", "url": "https://earthsky.org/space/asteroid-99942-apophis-encounters-2029-2036-2068", "urlToImage": "https://earthsky.org/upl/2020/11/asteroid-apophis-orbit-animation-800-300x225.gif", "publishedAt": "2021-03-04T00:55:06Z", "content": "The Virtual Telescope Project, based in Rome, Italy, captured asteroid (99942) Apophis on March 2, 2021. The asteroid shows as a dot – while the stars around it show as streaks – because the telescop… [+10835 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "NASA: Hubble telescope discovers amazing \"animals\" in space ... Video - The Press Stories", "description": "https://cdnarabic1.img.sputniknews.com/i/logo-itemprop.pngArabic - Sputnik News, Comments and", "url": "https://presstories.com/2021/03/04/nasa-hubble-telescope-discovers-amazing-animals-in-space-video/", "urlToImage": null, "publishedAt": "2021-03-03T23:27:22Z", "content": "https://cdnarabic1.img.sputniknews.com/i/logo-itemprop.png\r\nArabic – Sputnik News, Comments and Radio\r\nhttps://cdnarabic2.img.sputniknews.com/i/logo.png\r\nSputnik\r\nhttps://cdnarabic2.img.sputniknews.c… [+1083 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "SpaceX Starship SN10 launch: How to watch rocket prototype fly today - CNET", "description": "Elon Musk's Mars rocket lit up for a second on Wednesday but didn't get off the ground. A second launch attempt is coming.", "url": "https://www.cnet.com/news/spacex-starship-sn10-launch-how-to-watch-rocket-prototype-fly-today/", "urlToImage": "https://cnet2.cbsistatic.com/img/vxm8TANrcrdsxKZoH3lI07JiskA=/1200x630/2021/02/17/9ae0e4e1-56a6-4e3d-b99d-61e4a113f6a7/50906488116-c44db82fc1-k.jpg", "publishedAt": "2021-03-03T21:14:28Z", "content": "Starship SN9 in flight.\r\nSpaceX\r\nThe SpaceX Starship rocket prototype, SN10, ignited its engines for a split second on Wednesday afternoon, but an issue with the launch procedure triggered an automat… [+3453 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "NASA scientists complete 1st global survey of freshwater fluctuation - EurekAlert", "description": "To investigate humans' impact on freshwater resources, scientists have now conducted the first global accounting of fluctuating water levels in Earth's lakes and reservoirs -- including ones previously too small to measure from space.", "url": "https://www.eurekalert.org/pub_releases/2021-03/nsfc-nsc030321.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/258088_web.jpg", "publishedAt": "2021-03-03T21:10:33Z", "content": "IMAGE: Lake Mead, along the Colorado River.\r\n view more \r\nCredit: National Park Service\r\nTo investigate humans' impact on freshwater resources, scientists have now conducted the first global accounti… [+4535 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Golf is better than tai chi for improving balance and mobility in people with Parkinson's disease - Daily Mail", "description": "Volunteers with Parkinson's in the US were asked to either practice their golf swing or take Tai Chi lessons for ten weeks and have their mobility tested before and after the session.", "url": "https://www.dailymail.co.uk/sciencetech/article-9321827/Golf-better-tai-chi-improving-balance-mobility-people-Parkinsons-disease.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/03/03/17/40003320-0-image-a-31_1614792042127.jpg", "publishedAt": "2021-03-03T21:00:46Z", "content": "Playing a round of golf is better for improving and maintaining balance and mobility in Parkinson's sufferers than doing tai chi, a new study revealed. \r\nResearchers from Massachusetts General Hospit… [+3934 chars]"}, {"source": {"id": null, "name": "Labmate Online"}, "author": "International Labmate", "title": "Liquid Metals provide Effective Transport System Labmate Online - Labmate Online", "description": "A new method for creating hollow nanoparticles using liquid metals has been devised by chemists from ITMO University (St Petersburg). Hollow nanocapsules are widely used for various purposes, from...", "url": "https://www.labmate-online.com/news/news-and-views/5/itmo-university/liquid-metals-provide-effective-transport-system/54606", "urlToImage": "https://www.labmate-online.com/assets/file_store/pr_files/54606/thumbnails/images/600w_ilmic--ITMO-univ-liquid-metal-(2).jpg", "publishedAt": "2021-03-03T20:45:46Z", "content": "A new method for creating hollow nanoparticles using liquid metals has been devised by chemists from ITMO University (St Petersburg). Hollow nanocapsules are widely used for various purposes, from ta… [+1790 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "Spacewalking astronauts prepare station for new solar wings - SatelliteProME.com", "description": "Rubins and Glover tackled the struts for the first two solar panels, set to launch in June.", "url": "https://satelliteprome.com/news/spacewalking-astronauts-prepare-station-for-new-solar-wings/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2021/03/Spacewalking.jpg", "publishedAt": "2021-03-03T19:12:03Z", "content": "Rubins and Glover tackled the struts for the first two solar panels, set to launch in June.\r\nNASA astronauts Kate Rubins and Victor Glover concluded their spacewalk on February 28 at 1:16 PM EST, aft… [+2167 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Earth has life span of nearly 1bn years more: Study - DTNext", "description": "The future life span of Earth's oxygen-rich atmosphere is approximately one billion years, a new study reveals.", "url": "http://www.dtnext.in/Lifestyle/Technology/2021/03/03231532/1278520/Earth-has-life-span-of-nearly-1bn-years-more-Study.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Mar/202103032315317924_Earth-has-life-span-of-nearly-1bn-years-more-Study_SECVPF.gif", "publishedAt": "2021-03-03T17:51:57Z", "content": "The future life span of Earth's oxygen-rich atmosphere is approximately one billion years, a new study reveals.\r\nTokyo:According to the study, published in the journal Nature Geoscience, Earth's surf… [+2193 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "UM today | In fact, they sweat the little things - BollyInside", "description": "March 3, 2021 - A newly funded particle physics experiment may be able to examine the structure of individual electrons - particles that have so far been", "url": "https://www.bollyinside.com/news/um-today-in-fact-they-sweat-the-little-things/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/03/UM-today-In-fact-they-sweat-the-little-things.jpg", "publishedAt": "2021-03-03T17:29:03Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "“Unprecedented” New Form of Symbiosis Discovered - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/unprecedented-new-form-of-symbiosis-discovered/", "urlToImage": null, "publishedAt": "2021-03-03T17:18:13Z", "content": "Energy-providing bacterial endosymbiont enables its unicellular eukaryotic host to breathe nitrate, demonstrating that unicellular eukaryotes may acquire endosymbionts to complement or replace functi… [+7839 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "As NASA finishes final tests of James Webb Space Telescope, here`s a look at its supreme capabilities - WION", "description": "NASAs James Webb Space Telescope, set to be the largest of its kind concluded its final functional tests at Redondo Beach in California on March 1.The James Webb Space Telescope is part of an international programme led by the National Aeronautics and Space A…", "url": "https://www.wionews.com/science/as-nasa-finishes-final-tests-of-james-webb-space-telescope-heres-a-look-at-its-supreme-capabilities-367733", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/03/03/185339-untitled-design-6.jpg, 2017 shows the primary mirror of NASA’s James Webb Space Telescope inside a cleanroom at NASA’s Johnson Space Center in Houston,Texas\" typeof=\"foaf:Image\" />", "publishedAt": "2021-03-03T14:50:31Z", "content": "NASA's James Webb Space Telescope, set to be the largest of its kind concluded its final functional tests at Redondo Beach in California on March 1.\r\nThe James Webb Space Telescope is part of an inte… [+1900 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Elon Musk-led SpaceX set to launch Starship SN10 on March 3 - Moneycontrol.com", "description": "SpaceX CEO Elon Musk confirmed the news on Twitter.", "url": "https://www.moneycontrol.com/news/business/elon-musk-led-spacex-set-to-launch-starship-sn10-on-march-3-6600301.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Elon-Musk-3-653x435.jpg", "publishedAt": "2021-03-03T14:01:00Z", "content": "Billionaire entrepreneur Elon Musk has said SpaceX's Starship SN10 will attempt a launch on March 3.\r\nTaking to Twitter to share the news, the SpaceX CEO also mentioned the time of the launch:Starshi… [+887 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Marianne Guenot", "title": "Cuttlefish passed a version of the marshmallow test, a cognitive study for humans designed to test self-contro - Business Insider India", "description": "Cuttlefish can show the same amount of self-control as bigger-brained animals, a test found.The cephalopods resisted taking food immediately to get a better", "url": "https://www.businessinsider.in/science/news/cuttlefish-passed-a-version-of-the-marshmallow-test-a-cognitive-study-for-humans-designed-to-test-self-control/articleshow/81314221.cms", "urlToImage": "https://www.businessinsider.in/photo/81314221/cuttlefish-passed-a-version-of-the-marshmallow-test-a-cognitive-study-for-humans-designed-to-test-self-control.jpg?imgsize=453516", "publishedAt": "2021-03-03T13:50:00Z", "content": "Cuttlefish can be as good at controlling their urges as animals like chimpanzees, crows and parrots, researchers have said. \r\nIn a new study published Wednesday, scientists put six cuttlefish in cond… [+2489 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PTI", "title": "Indigenously developed spectrograph commissioned on Devasthal Optical Telescope - Yahoo India News", "description": "<p>New Delhi, Mar 3 (PTI) Indian scientists have indigenously designed and developed a low-cost optical spectrograph that can locate sources of faint light...", "url": "https://in.news.yahoo.com/indigenously-developed-spectrograph-commissioned-devasthal-130409211.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-03-03T13:04:09Z", "content": "New Delhi, Mar 3 (PTI) Indian scientists have indigenously designed and developed a low-cost optical spectrograph that can locate sources of faint light from distant quasars and galaxies in a very yo… [+2762 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "NASA's Earth Observatory Captures Transition of Central Siberian Plateau Through Seasons, Stunning Photo ... - News18", "description": "Our planet houses several unique landscapes, some of which change colour with every season.", "url": "https://www.news18.com/news/buzz/nasas-earth-observatory-captures-transition-of-central-siberian-plateau-through-seasons-stunning-photo-is-viral-3494522.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1614776190_untitled-design-2021-03-03t182553.266.jpg", "publishedAt": "2021-03-03T12:57:14Z", "content": "Our planet houses several unique landscapes, some of which change colour with every season. A recent post shared by the National Aeronautics and Space Administrations Earth Observatory has highlighte… [+2333 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Aziz Khan", "title": "To Make Science More Inclusive, Eradicate Terms With Racial Connotations - The Wire Science", "description": "'Blacklist' and 'Whitelist' are commonly used terms in science and technology — with blacklists being the problematic entities.", "url": "https://science.thewire.in/education/eradicating-terms-with-racial-connotations-to-make-science-inclusive/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/03/03161111/800px-Argonne_lab_education.jpg", "publishedAt": "2021-03-03T10:31:21Z", "content": "Following the Black Lives Matter protests the scientific community has spoken against the systematic racism in science and called for action to make science more diverse and inclusive. Yet, the growi… [+2421 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Diets of early lizards and snakes were more varied and advanced, study - Tech Explorist", "description": "New research has revealed that the diets of early lizards and snakes, which lived alongside dinosaurs around 100 million years ago, were more varied and advanced than previously thought.", "url": "https://www.techexplorist.com/diets-early-lizards-snakes-varied-advanced/38115/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/03/different-tooth-types.jpg", "publishedAt": "2021-03-03T10:17:25Z", "content": "Squamates (lizards and snakes) are highly successful modern vertebrates, with over 10,000 species. With a long history, dating back to at least 240 million years ago- they show increasing species ric… [+2897 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Will Dunham", "title": "Fossil of Australopithecus 'Little Foot' Sheds Light on Human Origins - The Wire Science", "description": "Using synchrotron X-ray imaging for fossils, scientists examined the the upper part of Little Foot's brain case and her lower jaw.", "url": "https://science.thewire.in/the-sciences/fossils-of-little-foot-sheds-light-on-human-origins/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/03/03145125/2021-03-02T084657Z_1_LYNXNPEH210G5_RTROPTP_4_SCIENCE-AUSTRALOPITHECUS-scaled.jpg", "publishedAt": "2021-03-03T09:30:42Z", "content": "The skeleton of Little Foot in Oxford, Britain. Photo: Diamond Light Source Ltd/Handout via Reuters\r\nSophisticated scanning technology is revealing intriguing secrets about Little Foot, the remarkabl… [+3778 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Arab world basks in the glory of UAE Mars mission triumph - Arab News", "description": "DUBAI: For months, the Hope probe’s journey to Mars had been tracked eagerly by the Arab news media. In the UAE, hoardings depicting the unmanned spacecraft (known in Arabic as Al-Amal) have been positioned along highways as part of the country’s 50th anniver…", "url": "https://www.arabnews.com/node/1806701", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/10/2466686-1441476290.jpg", "publishedAt": "2021-02-10T01:29:01Z", "content": "ROME / MEXICO CITY: Pope Francis, the head of the Roman Catholic Church, will become the first pontiff ever to set foot in Iraq, where he hopes to encourage the dwindling Christian community to remai… [+7142 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "What We Are Reading Today: Extraterrestrial by Avi Loeb - Arab News", "description": "Extraterrestrial is a provocative and fascinating book written by American theoretical physicist and Harvard University astronomer Avi Loeb. In Extraterrestrial, Loeb takes readers inside the thrilling story of the first interstellar visitor to be spotted in …", "url": "https://www.arabnews.com/node/1805446", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/07/2463056-822604459.png", "publishedAt": "2021-02-07T20:31:49Z", "content": "David Nasaws magnificent, definitive biography of William Randolph Hearst is based on newly released private and business papers and interviews. \r\nFor the first time, documentation of Hearsts interac… [+925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "New smartphone-based Covid-19 test gives results in less than 30 minutes - ETHealthworld.com", "description": "Scientists have developed a novel technology for a CRISPR-based Covid-19 diagnostic test that uses a smartphone camera to provide accurate results in under 30 minutes", "url": "https://health.economictimes.indiatimes.com/news/health-it/new-smartphone-based-covid-19-test-gives-results-in-less-than-30-minutes/79608188", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79608188,imgsize-299380,width-800,height-434,overlay-ethealthworld/new-smartphone-based-covid-19-test-gives-results-in-less-than-30-minutes.jpg", "publishedAt": "2020-12-07T12:01:00Z", "content": "WASHINGTON: Scientists have developed a novel technology for a CRISPR-based Covid-19 diagnostic test that uses a smartphone camera to provide accurate results in under 30 minutes.According to the res… [+2174 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "Google-owned DeepMind AI solves 50-year-old 'protein folding problem' - ETCIO.com", "description": "Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes proteins fold into.", "url": "https://cio.economictimes.indiatimes.com/news/next-gen-technologies/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem/79522424", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79522424,imgsize-10287,width-800,height-434,overlay-etcio/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem.jpg", "publishedAt": "2020-12-02T03:20:27Z", "content": "London: Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes protein… [+1804 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "China launches its first unmanned mission to Mars - Arab News", "description": "WENCHANG, China: China successfully launched an unmanned probe to Mars on Thursday in its first independent mission to another planet, in a display of its technological prowess and ambition to join an elite club of space-faring nations. China’s largest carrie…", "url": "https://www.arabnews.com/node/1709661", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/07/25/2201701-2021696939.jpg", "publishedAt": "2020-07-25T03:31:47Z", "content": "DHAKA/KARACHI, Pakistan: The National Bank of Pakistan (NBP) is closing one of its Bangladesh branches after failing to recover nearly 98 percent of its loans from debtors, the banks country head has… [+4024 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Press Trust of India | Posted by Anubha Rohatgi", "title": "Isro’s MOM captures image of the Mars’ biggest moon Phobos - Hindustan Times", "description": "According to ISRO, “the violent phase that Phobos has encountered is seen in the large section gouged out from a past collision (Stickney crater) and bouncing ejecta.”", "url": "https://www.hindustantimes.com/science/isro-s-mom-captures-image-of-the-mars-biggest-moon-phobos/story-xcpjoRm3PXMk12zuQdm7gL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/07/03/Pictures/_553f1bec-bd50-11ea-b1db-f4c281a9a9e5.png", "publishedAt": "2020-07-03T17:17:03Z", "content": "The Mars Colour Camera (MCC) onboard ISROs Mars Orbiter Mission has captured the image of Phobos, the closest and biggest moon of Mars.\r\n The image was taken on July 1 when MOM was about 7,200 km fro… [+1560 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "NASA develops high-pressure ventilator to fight COVID-19 - ETHealthworld.com", "description": "The device, called VITAL (Ventilator Intervention Technology Accessible Locally), passed a critical test this week at the Icahn School of Medicine in New York, an epicentre of COVID-19 in the US, NASA said.", "url": "https://health.economictimes.indiatimes.com/news/medical-devices/nasa-develops-high-pressure-ventilator-to-fight-covid-19/75352450", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-75352450,imgsize-68463,width-800,height-434,overlay-ethealthworld/nasa-develops-high-pressure-ventilator-to-fight-covid-19.jpg", "publishedAt": "2020-04-24T12:46:22Z", "content": "WASHINGTON: NASA engineers have developed a new, easy-to-build high-pressure ventilator tailored specifically to treat COVID-19 patients.The device, called VITAL (Ventilator Intervention Technology A… [+2608 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Auto", "title": "Novel CO2 capturing tech may cut vehicle emissions by 90% - ETAuto.com", "description": "The whole process takes place within a capsule placed above the driver's cabin.", "url": "https://auto.economictimes.indiatimes.com/news/auto-technology/novel-co2-capturing-tech-may-cut-vehicle-emissions-by-90/72962390", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-72962390,imgsize-7963,width-800,height-434,overlay-etauto/novel-co2-capturing-tech-may-cut-vehicle-emissions-by-90.jpg", "publishedAt": "2019-12-25T02:52:24Z", "content": "Only 10 per cent of the CO2 emissions cannot be recycled, and the researchers propose to offset that using biomass.\r\nGeneva: Scientists have developed a new technology that could cut carbon dioxide e… [+2438 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Mysterious circular DNA linked to pediatric cancer: Study - ETHealthworld.com", "description": "Chromosomes are threadlike structures of DNA and protein found in the nucleus of most living cells, and carry genetic information in the form of genes.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/mysterious-circular-dna-linked-to-pediatric-cancer-study/72830004", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-72830004,imgsize-99349,width-800,height-434,overlay-ethealthworld/mysterious-circular-dna-linked-to-pediatric-cancer-study.jpg", "publishedAt": "2019-12-17T08:41:33Z", "content": "London: Mysterious rings of DNA known as extrachromosomal circular DNA may contribute to cancer development in children, according to a study which may lead to better diagnosis methods for pediatric … [+3090 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Novel artificial leaf produces clean gas from sunlight - ETEnergyworld.com", "description": "The carbon-neutral device can directly produce the gas -- called syngas -- in a sustainable and simple way from carbon dioxide and water, setting a new benchmark in the field of solar fuels.", "url": "https://energy.economictimes.indiatimes.com/news/renewable/innovation-novel-artificial-leaf-produces-clean-gas-from-sunlight/71707755", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-71707755,imgsize-63632,width-800,height-434,overlay-etenergyworld/innovation-novel-artificial-leaf-produces-clean-gas-from-sunlight.jpg", "publishedAt": "2019-10-22T13:24:28Z", "content": "London: Scientists have developed an 'artificial leaf' device that uses sunlight to produce a widely-used gas currently made from fossil fuels, and could be used to create a sustainable liquid fuel a… [+2099 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "By SETH BORENSTEIN | AP", "title": "Antarctica is losing ice 6 times faster today than in 1980s - Arab News", "description": "WASHINGTON: Antarctica is melting more than six times faster than it did in the 1980s, a new study shows.Scientists used aerial photographs, satellite measurements and computer models to track how fast the southern-most continent has been melting since 1979 i…", "url": "https://www.arabnews.com/node/1435551", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2019/01/14/1429831-1422044349.jpg", "publishedAt": "2019-08-28T08:39:01Z", "content": "DHAKA/KARACHI, Pakistan: The National Bank of Pakistan (NBP) is closing one of its Bangladesh branches after failing to recover nearly 98 percent of its loans from debtors, the banks country head has… [+4024 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "The Associated Press", "title": "Stephen Hawking: Extraordinary life of the man who explained the universe - Arab News", "description": "PARIS: In his final years, the only thing connecting the brilliant physicist to the outside world was a couple of inches of frayed nerve in his cheek. As slowly as a word per minute, Stephen Hawking used the twitching of the muscle under his right eye to grin…", "url": "https://www.arabnews.com/node/1266671", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/03/15/1130251-2034869809.jpg", "publishedAt": "2019-08-28T01:53:40Z", "content": "DHAKA/KARACHI, Pakistan: The National Bank of Pakistan (NBP) is closing one of its Bangladesh branches after failing to recover nearly 98 percent of its loans from debtors, the banks country head has… [+4024 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "Scientists find 38 million pieces of trash on Pacific island - Arab News", "description": "NEW ZEALAND: When researchers traveled to a tiny, uninhabited island in the middle of the Pacific Ocean, they were astonished to find an estimated 38 million pieces of trash washed up on the beaches. Almost all of the garbage they found on Henderson Island wa…", "url": "https://www.arabnews.com/node/1100406", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/05/16/912576-76095870.png", "publishedAt": "2019-08-27T01:33:48Z", "content": "LONDON: The number of white terror suspects arrested in Britain has outstripped that of any other race for the third year in a row.\r\nOfficial reports show that 89 white people were arrested on terror… [+1441 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Press Trust of India", "title": "NASA names gamma constellations after The Hulk and Godzilla - Hindustan Times", "description": "The constellations, constructed with sources visible through its gamma-ray telescope, were devised to celebrate the completion of 10 years of operations of the Fermi Gamma-ray Space Telescope.", "url": "https://www.hindustantimes.com/science/nasa-names-gamma-constellations-after-the-hulk-and-godzilla/story-otPXnABYR47TpVOV9fotPL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/10/22/Pictures/_db2867a4-d5cb-11e8-b06f-edb2612a0442.JPG", "publishedAt": "2018-10-22T07:31:52Z", "content": "NASA scientists have devised a new set of 21 modern gamma-ray constellations and named them after fictional characters such as the Hulk and Godzilla.\r\nThe constellations, constructed with sources vis… [+2441 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "‘Indians are so good at mathematics and physics’: When Stephen Hawking came to India - Hindustan Times", "description": "Scientist Stephen Hawking made a 16-day trip to India in 2001, visiting Mumbai and New Delhi. During the visit, he met then president KR Narayanan.", "url": "https://www.hindustantimes.com/india-news/indians-are-so-good-at-mathematics-and-physics-when-stephen-hawking-came-to-india/story-qeRRbpPJK15LCHsNEKWiLK.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/03/14/Pictures/britain-hawking-trump_3eb814b4-2766-11e8-a8dd-98cd3615fcfa.jpg", "publishedAt": "2018-03-14T09:23:04Z", "content": "It was January 2001 when British physicist Stephen Hawking came to India for the first time, later describing the 16-day long tour as magnificent.\r\nIn the first leg of the tour in Mumbai, Hawking add… [+1346 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Nasa’s Curiosity finds purple rocks on Mars, could be hint to watery past - Hindustan Times", "description": "Nasa officials have called this a suggestion to a greater degree of diversity in the geological composition of the region, and a hint as to what caused Mars to lose most of its water, Sputnik news agency reported on Friday.", "url": "https://www.hindustantimes.com/world-news/nasa-s-curiosity-finds-purple-rocks-on-mars-could-be-hint-to-watery-past/story-xRwQRXVxELD4Al8VgtkOgM.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2016/12/30/Pictures/_89a8e198-ce6f-11e6-a1a7-f672457d0d7f.jpg", "publishedAt": "2018-01-23T13:13:31Z", "content": "Recent photographs taken by Nasas Curiosity rover have revealed purple rocks on the surface of the Red Planet. \r\nNasa officials have called this a suggestion to a greater degree of diversity in the g… [+1407 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "Watch live Thursday: SpaceX to launch 60 Starlink satellites - Space.com", "description": "", "url": "https://www.space.com/17933-nasa-television-webcasts-live-space-tv.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FXsfXJaqX7ffQeqUxUXJSU-1200-80.jpg", "publishedAt": "2017-06-06T20:02:55Z", "content": "Update for 1 p.m. ET: SpaceX has postponed the launch of its Starlink 17 mission from Tuesday (March 2) to Thursday (March 4) due to weather. A new launch window has yet to be announced.\r\nNow targeti… [+4067 chars]"}]}