{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Sonia Singh", "title": "Video | \"Surreal Feeling of It Still Needs To Sink In\": Indian-American NASA Scientist On Mars Audio - NDTV", "description": "The US space agency NASA has released the first audio from Mars, a faint crackling recording of wind captured by the Perseverance rover. A microphone did not work during the rover's descent to the surface, but it was able to capture audio once it landed on Ma…", "url": "https://www.ndtv.com/video/exclusive/news/nasa-scientist-dswati-mohan-surreal-feeling-of-it-still-needs-to-sink-in-indian-american-nasa-scient-576799", "urlToImage": "https://c.ndtvimg.com/2021-02/8r4veqpo_swatimohan_160x120_23_February_21.jpg", "publishedAt": "2021-02-23T15:00:16Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "'Ghostly' neutrino from star-shredding black hole reveals cosmic particle accelerator of epic proportions - Space.com", "description": "", "url": "https://www.space.com/neutrino-from-star-shredding-black-hole-particle-accelerator", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2YfARXerUQ6PTvpahaAXXU-1200-80.jpg", "publishedAt": "2021-02-23T12:01:12Z", "content": "A ghostly particle that smashed into Antarctica in 2019 has been traced back to a black hole tearing apart a star while acting like a giant cosmic particle accelerator, a new study finds.\r\nScientists… [+5651 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Elon Musk says there is a 'good chance' SpaceX's Starship SN10 will launch this week - Daily Mail", "description": "SpaceX could launch its latest Starship prototype, SN10, this week following the FAA close an investigation into the root cause of the SN9 explosion earlier this month.", "url": "https://www.dailymail.co.uk/sciencetech/article-9288797/Elon-Musk-says-good-chance-SpaceXs-Starship-SN10-launch-week.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/22/23/39642480-0-image-a-2_1614037683838.jpg", "publishedAt": "2021-02-22T23:48:16Z", "content": "The Federal Aviation Administration (FAA) has closed its investigation on SpaceX's exploding Startship SN9 prototype 'clearing the way for the SN10 test flight.'\r\nThe investigation focused on ensurin… [+3262 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Kait Sanchez", "title": "SpaceX announces second crew member of its all-civilian space mission - The Verge", "description": "The second member of the SpaceX Inspiration4 mission will be Hayley Arceneaux, a physician assistant at St. Jude who survived bone cancer. She could be both the youngest American and the first person with a prosthetic body part to go to space.", "url": "https://www.theverge.com/2021/2/22/22295905/spacex-second-crew-member-inspiration4-civilian-space-mission", "urlToImage": "https://cdn.vox-cdn.com/thumbor/76AZu9_qB8HK_dsiO-s5OO7U8Js=/0x13:1200x641/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22321360/Hayley_Arceneaux.jpg", "publishedAt": "2021-02-22T21:29:51Z", "content": "Cancer survivor Hayley Arceneaux will be the first person in space with a prosthetic body part\r\nHayley Arceneaux\r\nImage: St. Jude\r\nHayley Arceneaux, a physician assistant at St. Jude Childrens Resear… [+1323 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alasdair MacKenzie and Andreas Kolb", "title": "The human genome at 20: How biology's most-hyped breakthrough led to anticlimax and arrests - Phys.org", "description": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence  had been completed, he hailed the breakthrough as \"the most important, most wondrous map ever produced by humankind.\" The scientific achievement…", "url": "https://phys.org/news/2021-02-human-genome-biology-most-hyped-breakthrough.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thehumangeno.jpg", "publishedAt": "2021-02-22T14:14:27Z", "content": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence had been completed, he hailed the breakthrough as \"the most important, most wondrous … [+8115 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tim Childers", "title": "Astronomers find the fastest spinning black hole to date - Livescience.com", "description": "", "url": "https://www.livescience.com/first-black-hole-detected-fastest-spinning.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dXbNLrCdeGFheedYmy5vce-1200-80.jpg", "publishedAt": "2021-02-22T14:09:03Z", "content": "Six decades after its discovery, the first black hole ever detected is still causing astronomers to scratch their heads. It turns out that the cosmic behemoth at the heart of the Cygnus X-1 system is… [+3891 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Elon Musk, Steve Jobs and Warren Buffet Have Some Leadership Tips to Make You Better Employer - News18", "description": "The meteoric rise in wealth of the world’s billionaires is simply attributed to their own strengths and knowledge.", "url": "https://www.news18.com/news/buzz/elon-musk-steve-jobs-and-warren-buffet-have-some-leadership-tips-to-make-you-better-employer-3460766.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1613989242_tips.jpeg", "publishedAt": "2021-02-22T10:21:23Z", "content": "The meteoric rise in wealth of the worlds billionaires is simply attributed to their own strengths and knowledge. But the fact is that there is a whole arsenal of people behind them, helping the comp… [+2052 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Vishal Mathur", "title": "The Connection Between Your Android Phone, Qualcomm Snapdragon Chips And Mars - News18", "description": "If you thought your new Android smartphone isn’t already cutting edge, you’d be very wrong.", "url": "https://www.news18.com/news/tech/the-connection-between-your-android-phone-qualcomm-snapdragon-chips-and-mars-3460670.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1613972775_ingenuity-mars-helicopter.png", "publishedAt": "2021-02-22T05:50:11Z", "content": "If you thought your new Android smartphone isnt already cutting edge, youd be very wrong. In fact, chances are, your new Android phone, particularly if youve splurged on a flagship phone, is more pow… [+2518 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "WATCH: Soyuz spacecraft carrying the UAE's first astronaut Hazza Al-Mansoori dock with International Space Station - Arabnews", "description": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the Baikonur Cosmodrome in Kazakhstan. Hazza Al-Mansoori from t…", "url": "https://www.arabnews.com/node/1559686", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/09/25/1770396-1560966155.jpg", "publishedAt": "2019-09-25T11:56:25Z", "content": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the… [+4358 chars]"}]}