{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "It is Not Just Earth, the Universe is Also Seeing a Steady Rise in Temperature, Finds New Research - News18", "description": "The researchers have observed that the temperature has reached around 2 million degrees Kelvin today which is roughly 4 million degrees Fahrenheit.", "url": "https://www.news18.com/news/buzz/it-is-not-just-earth-the-universe-is-also-seeing-a-steady-rise-in-temperature-finds-new-research-3073073.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/09/1600852795_untitled-design-5.png", "publishedAt": "2020-11-12T08:56:37Z", "content": "It is not just our planet that is getting hotter but the entire universe that is observing a rise in temperature. A new study by the Ohio State University Center for Cosmology and AstroParticle Physi… [+1870 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "Newly discovered asteroid to fly safely by Earth next week: Chinese astronomer - ecns", "description": "An asteroid discovered by Chinese astronomers will make a near-Earth pass next week, posing no threat to the planet, sources with the Purple Mountain Observatory of the Chinese Academy of Sciences said Thursday.", "url": "http://www.ecns.cn/news/2020-11-12/detail-ihacwpkx9604524.shtml", "urlToImage": "", "publishedAt": "2020-11-12T07:43:00Z", "content": "An asteroid discovered by Chinese astronomers will make a near-Earth pass next week, posing no threat to the planet, sources with the Purple Mountain Observatory of the Chinese Academy of Sciences sa… [+1099 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Associated Press", "title": "NASA’s Perseverance Rover Needs More Time, Money to Bring Back Mars Rock Samples: Independent Panel - Gadgets 360", "description": "NASA is underestimating the amount of time and money it will take to bring Mars rocks back to Earth in the coming decade, an independent panel said.", "url": "https://gadgets.ndtv.com/science/news/nasa-perseverance-mars-rock-samples-bringing-back-earth-more-time-money-needed-independent-panel-report-2324233", "urlToImage": "https://i.gadgets360cdn.com/large/mars_ascent_vehicle_nasa_1605165547922.jpg", "publishedAt": "2020-11-12T07:25:08Z", "content": "NASA is underestimating the amount of time and money it will take to bring Mars rocks back to Earth in the coming decade, an independent panel said Tuesday.\r\nThe review board suggested that NASA and … [+1844 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "After taking a nap, China's Chang'e-4 probe resumes work for 24th lunar day - Firstpost", "description": "The lander woke up at 12.42 am IST (3.12 am Beijing time) on Tuesday while the rover Yutu-2 woke up at 7.47 am IST (10.17 am Beijing time) on Monday.", "url": "https://www.firstpost.com/tech/science/after-taking-a-nap-chinas-change-4-probe-resumes-work-for-24th-lunar-day-9007241.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/01/Screen-Shot-2019-01-05-at-8.01.44-AM-1.jpg", "publishedAt": "2020-11-12T07:06:00Z", "content": "FP TrendingNov 12, 2020 12:36:00 IST\r\nThe lander and rover of the Chang'e-4 probe have resumed work for the 24th lunar day on the far side of the moon.\r\nChinese News Agency Xinhua cited Lunar Explora… [+1871 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "Invisible Air Rivers in The Sky Have Been Leaving Giant Holes in Antarctic Ice - ScienceAlert", "description": "It appeared in 1973, seemingly out of nowhere: a hole in the sea ice off the coast of Antarctica. But this was no ordinary hole. It was so big it could swallow California.", "url": "https://www.sciencealert.com/invisible-rivers-of-air-flowing-in-the-sky-are-leaving-giant-holes-in-antarctic-ice", "urlToImage": "https://www.sciencealert.com/images/2020-11/processed/010-polynya_1024.jpg", "publishedAt": "2020-11-12T06:44:50Z", "content": "It appeared in 1973, seemingly out of nowhere: a hole in the sea ice off the coast of Antarctica. But this was no ordinary hole. It was so big it could swallow California.\r\nThe mysterious opening rem… [+2779 chars]"}, {"source": {"id": null, "name": "ClickLancashire"}, "author": null, "title": "Leonid meteor shower to peak in November 2020 across Norfolk and Waveney - ClickLancashire", "description": "", "url": "https://clicklancashire.com/2020/11/12/leonid-meteor-shower-to-peak-in-november-2020-across.html", "urlToImage": null, "publishedAt": "2020-11-12T06:36:24Z", "content": "According to NASA, a comet called the Swift-Tuttle passes by earth and once it passes, leaves a trail of debris that we pass through every year between the 17th of July to the 24 of August, thus crea… [+2003 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Circadian rhythms drive beta cell regeneration - Tech Explorist", "description": "Scientists observed that this regeneration mechanism was under the influence of circadian rhythms - the molecular clocks regulating metabolic functions according to a 24-hour cycle of alternating day-night.", "url": "https://www.techexplorist.com/circadian-rhythms-drive-beta-cell-regeneration/36099/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/11/pancreatic-islets.jpg", "publishedAt": "2020-11-12T06:32:00Z", "content": "The cell regeneration phenomenon describes the process in which functional cells start proliferating to compensate for the loss. The perfect examples are skin, liver, the organs that repair themselve… [+3150 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "First Ever Space Selfie, Rare Photo of Neil Armstrong on Moon Are Now Up For Auction - News18", "description": "The sale’s top lot is an unreleased photograph of Neil Armstrong, taken during the Apollo 11 mission in 1969 when he became the first human to set foot on the moon.", "url": "https://www.news18.com/news/buzz/first-ever-space-selfie-rare-photo-of-neil-armstrong-on-moon-are-now-up-for-auction-3072317.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605161642_untitled-design-4.png", "publishedAt": "2020-11-12T06:19:15Z", "content": "A rare photograph of U.S. astronaut Neil Armstrong on the surface of the moon is among thousands of space photographs in a collection up for auction at Christies.\r\nThe more than 2,400 photographs doc… [+2647 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "These microbes can help in future Martins and Moon People Mine Metals. - Sprout Wired", "description": "Micro-organisms can be friends of future colonists who live elsewhere in the lunar, Mars or solar system and want to establish self-sufficient homes.Space", "url": "https://www.sproutwired.com/these-microbes-can-help-in-future-martins-and-moon-people-mine-metals/", "urlToImage": null, "publishedAt": "2020-11-12T05:27:31Z", "content": "On the space station Luca Permitiano, a European space agency astronaut, Placed some of them in a centrifuge at the speed of mimicking the gravity of Mars or Earth. Other specimens experienced the em… [+1293 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Secrets of the Past: Huge Ancient Lake Bed Discovered Deep Beneath the Greenland Ice Sheet - SciTechDaily", "description": "Inaccessible for now, unique site may hold secrets of past. Scientists have detected what they say are the sediments of a huge ancient lake bed sealed more than a mile under the ice of northwest Greenland – the first-ever discovery of such a sub-glacial featu…", "url": "https://scitechdaily.com/secrets-of-the-past-huge-ancient-lake-bed-discovered-deep-beneath-the-greenland-ice-sheet/", "urlToImage": "https://scitechdaily.com/images/Huge-Ancient-Lake-Basin-Below-Greenland-Ice-Crop.jpg", "publishedAt": "2020-11-12T04:53:59Z", "content": "The largely featureless surface of the Greenland ice sheet, as seen from the window of a P3 aircraft carrying geophysical instruments aimed at detecting geologic features underneath. Credit: Kirsty T… [+6786 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Scientists recalculate that Asteroid Apophis is speeding up, might hit Earth in 2068 - Firstpost", "description": "This reassessment has shown that there is a tiny probability - 1 in 1,50,000 - that the asteroid will impact the Earth.", "url": "https://www.firstpost.com/tech/science/scientists-recalculate-that-asteroid-apophis-is-speeding-up-might-hit-earth-in-2068-9006731.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/11/asteroid-3628185_1280-1.jpg", "publishedAt": "2020-11-12T04:30:47Z", "content": "FP TrendingNov 12, 2020 10:00:47 IST\r\nThe near-Earth asteroid Apophis rose to prominence after its discovery in 2004 as initial calculations of its orbit had indicated that there was a 2.7 percent ch… [+1933 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "Astronomers spot rare fast radio burst in our own Galaxy - The Rahnuma Daily", "description": "New York, Nov 4 (IANS) A group of astronomers has for the first time detected a powerful fast radio burst (FRB) coming from a source in our own Galaxy, the Milky Way, which is 30,000 light-years away. On April 27 this year, two space observatories — the Neil …", "url": "https://www.therahnuma.com/astronomers-spot-rare-fast-radio-burst-in-our-own-galaxy/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2019/12/f68a2e41271341e72c465a956ef56367.jpg", "publishedAt": "2020-11-12T01:26:05Z", "content": "Lying around 20,000 light-years from us in the constellation of Scorpius (The Scorpion), Terzan 1, pictured here, is one of about 150 globular clusters belonging to our galaxy, the Milky Way. (Photo … [+2376 chars]"}, {"source": {"id": null, "name": "Spaceflight Now"}, "author": null, "title": "NASA chief warns of gap after retirement of International Space Station - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2020/11/11/nasa-chief-warns-of-gap-after-retirement-of-international-space-station/", "urlToImage": null, "publishedAt": "2020-11-12T00:50:03Z", "content": "File photo from the International Space Station as the outpost flew over the Nile River delta n Egypt in August 2019. Credit: NASA\r\nThe International Space Station is likely to continue operating for… [+9430 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Turning heat into electric power with efficient organic thermoelectric material - Science Daily", "description": "Thermoelectric materials can turn a temperature difference into electricity. Organic thermoelectric materials could be used to power wearable electronics or sensors; however, the power output is still very low. An international team has now produced an n-type…", "url": "https://www.sciencedaily.com/releases/2020/11/201111122840.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2020-11-11T23:22:42Z", "content": "Thermoelectric materials can turn a temperature difference into electricity. Organic thermoelectric materials could be used to power wearable electronics or sensors; however, the power output is stil… [+4035 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Eerie Footage Captures Elusive Deep-Sea Squid Near Australia For The First Time - ScienceAlert", "description": "The bigfin squid (Magnapinna) is one of the most elusive creatures that we know.", "url": "https://www.sciencealert.com/creepy-rare-squids-have-been-filmed-off-the-coast-of-australia-for-the-first-time", "urlToImage": "https://www.sciencealert.com/images/2020-11/processed/bigfin_squid_cover_pic_1024.jpg", "publishedAt": "2020-11-11T22:25:50Z", "content": "The bigfin squid (Magnapinna) is one of the most elusive creatures that we know.\r\nIt dwells in the permanently dark depths of the ocean and is an extremely rare sight, with only around a dozen confir… [+5215 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Microbes' mystery DNA helps defeat viruses—and has genome-editing potential - Science Magazine", "description": "Sparking thoughts of CRISPR’s beginnings, the genetic elements called retrons can only edit single-cell organisms so far", "url": "https://www.sciencemag.org/news/2020/11/microbes-mystery-dna-helps-defeat-viruses-and-has-genome-editing-potential", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/phage_1280p.jpg?itok=KfESQ8Gb", "publishedAt": "2020-11-11T21:45:00Z", "content": "Phage viruses land on a bacterium to insert their genes, but it may be able to fight back with odd genetic weapons called retrons.\r\nEye of Science/Science Source \r\nBy Elizabeth PennisiNov. 11, 2020 ,… [+6849 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers trap electrons to create elusive crystal - Phys.org", "description": "Like restless children posing for a family portrait, electrons won't hold still long enough to stay in any kind of fixed arrangement.", "url": "https://phys.org/news/2020-11-electrons-elusive-crystal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-electron.jpg", "publishedAt": "2020-11-11T20:42:19Z", "content": "Like restless children posing for a family portrait, electrons won't hold still long enough to stay in any kind of fixed arrangement.\r\nCornell researchers stacked two-dimensional semiconductors to cr… [+4427 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "NASA certifies SpaceX Crew Dragon to carry astronauts - The Rahnuma Daily", "description": "Washington, Nov 11 (IANS) After years of design, development, and testing NASA has finally certified SpaceX to carry astronauts to and from the International Space Station (ISS) on its Crew Dragon spaceship. The Crew Dragon, including the Falcon 9 rocket and …", "url": "https://www.therahnuma.com/nasa-certifies-spacex-crew-dragon-to-carry-astronauts/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2020/05/8098f5815e289d675bf85988075c1ea4.jpg", "publishedAt": "2020-11-11T19:15:36Z", "content": "NASA astronauts Robert Behnken (right) and Douglas Hurley at NASAâ\u0080\u0099s Kennedy Space Center in Florida on May 23 as they prepare to be transported to Launch Complex 39A during a full dress rehearsal a… [+2294 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "First sightings of lek and courtship behavior in wrinkle-faced bats - Phys.org", "description": "Wrinkle-faced bats not only have the most convoluted faces of any bat species, the males also have a flap of furry white skin they can pull over their lower faces, not unlike the face masks people wear. In a new report published in PLOS ONE, Smithsonian resea…", "url": "https://phys.org/news/2020-11-sightings-lek-courtship-behavior-wrinkle-faced.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/thesemaskeds.jpeg", "publishedAt": "2020-11-11T19:00:18Z", "content": "Wrinkle-faced bats not only have the most convoluted faces of any bat species, the males also have a flap of furry white skin they can pull over their lower faces, not unlike the face masks people we… [+6477 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Atmospheric rivers help create massive holes in Antarctic sea ice - Phys.org", "description": "Warm, moist rivers of air in Antarctica play a key role in creating massive holes in sea ice in the Weddell Sea and may influence ocean conditions around the vast continent as well as climate change, according to Rutgers co-authored research.", "url": "https://phys.org/news/2020-11-atmospheric-rivers-massive-holes-antarctic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/2-atmosphericr.jpg", "publishedAt": "2020-11-11T19:00:03Z", "content": "Warm, moist rivers of air in Antarctica play a key role in creating massive holes in sea ice in the Weddell Sea and may influence ocean conditions around the vast continent as well as climate change,… [+3453 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Strain", "title": "Tree rings may hold clues to impacts of distant supernovas on Earth - Phys.org", "description": "Massive explosions of energy happening thousands of light-years from Earth may have left traces in our planet's biology and geology, according to new research by University of Colorado Boulder geoscientist Robert Brakenridge.", "url": "https://phys.org/news/2020-11-tree-clues-impacts-distant-supernovas.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/treeringsmay.jpg", "publishedAt": "2020-11-11T18:42:41Z", "content": "Massive explosions of energy happening thousands of light-years from Earth may have left traces in our planet's biology and geology, according to new research by University of Colorado Boulder geosci… [+5581 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Born to be young? Prenatal thyroid hormones influence 'biological age' at birth - Phys.org", "description": "The environment provided by the mother during embryo development has major consequences on later-life health and lifespan. This can arise through effects on cellular aging which is often estimated with the length of telomeres. Telomeres are the protective end…", "url": "https://phys.org/news/2020-11-born-young-prenatal-thyroid-hormones.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/5fabf5cebb24e.jpg", "publishedAt": "2020-11-11T18:21:23Z", "content": "The environment provided by the mother during embryo development has major consequences on later-life health and lifespan. This can arise through effects on cellular aging which is often estimated wi… [+2859 chars]"}, {"source": {"id": null, "name": "Bcfocus.com"}, "author": "bcfadmin", "title": "Akash Ganga Mein Grahon By Jeevan: Life is possible on 300 million planets in the galaxy, water signs are possible: NASA – NASA says the Milky Way could have 300 million habitable planets - BCFocus", "description": "WashingtonThe US space agency NASA's Kepler Space Telescope mission ended in 2018. In this mission, which lasted eight years before fuel ran out, 30 million of these planets were identified in our ski", "url": "https://bcfocus.com/akash-ganga-mein-grahon-by-jeevan-life-is-possible-on-300-million-planets-in-the-galaxy-water-signs-are-possible-nasa-nasa-says-the-milky-way-could-have-300-million-habitable-planets/", "urlToImage": "https://bcfocus.com/wp-content/uploads/2020/11/1605118152_pic-780x470.jpg", "publishedAt": "2020-11-11T18:20:41Z", "content": "WashingtonThe US space agency NASA’s Kepler Space Telescope mission ended in 2018. In this mission, which lasted eight years before fuel ran out, 30 million of these planets were identified in our sk… [+1167 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": null, "title": "We knew platypuses were incredible. Now we know they glow, too - National Geographic", "description": "The fur of the platypus glows under a blacklight—a finding that raises questions about its role in these strange mammals.", "url": "https://www.nationalgeographic.com/animals/2020/11/glowing-platypus/", "urlToImage": "https://www.nationalgeographic.com/content/dam/animals/2020/11/glowing-platypus/ventral-uv-filtr_img_8248.ngsversion.1605118699094.adapt.1900.1.jpg", "publishedAt": "2020-11-11T17:59:48Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Modelling microswimmers for drug delivery - EurekAlert", "description": "An international group of theoretical physicists led by Abdallah Daddi-Moussa-Ider from Düsseldorf, Germany, has modelled the motion of microscopic, motile bodies - either powered micro-machines or living cells - in viscous liquid drops, using the Navier-Stok…", "url": "https://www.eurekalert.org/pub_releases/2020-11/s-mmf111120.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2020-11-11T17:23:38Z", "content": "Many types of motile cells, such as the bacteria in our guts and spermatozoa in the female reproductive tracts, need to propel themselves through confined spaces filled with viscous liquid. In recent… [+2400 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A comparative genomics multitool for scientific discovery and conservation - Nature.com", "description": "A whole-genome alignment of 240&nbsp;phylogenetically diverse species of eutherian mammal—including 131&nbsp;previously uncharacterized species—from the Zoonomia Project provides data that support biological discovery, medical research and conservation.", "url": "https://www.nature.com/articles/s41586-020-2876-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-020-2876-6/MediaObjects/41586_2020_2876_Fig1_HTML.png", "publishedAt": "2020-11-11T16:16:16Z", "content": "<li></li>\r\n1.Claussnitzer, M. et al. A brief history of human disease genetics. Nature577, 179189 (2020).\r\nADS \r\n CAS \r\n PubMed \r\n PubMed Central \r\nGoogle Scholar \r\n<li></li>\r\n2.Hiller, M. et al. A f… [+13877 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Physicists Pin Down Nuclear Reaction From Moments After the Big Bang - Quanta Magazine", "description": "The newly-measured rate of a key nuclear fusion process from the Big Bang matches the picture of the universe 380,000 years later.", "url": "https://www.quantamagazine.org/physicists-pin-down-nuclear-reaction-from-moments-after-the-big-bang-20201111/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2020/11/Nucleosynthesis_1200_Social.jpg", "publishedAt": "2020-11-11T16:01:19Z", "content": "In a secluded laboratory buried under a mountain in Italy, physicists have re-created a nuclear reaction that happened between two and three minutes after the Big Bang.\r\nTheir measurement of the reac… [+7568 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Can the EmDrive actually work for space travel? - Space.com", "description": "Don't get your hopes up.", "url": "https://www.space.com/can-emdrive-space-propulsion-concept-work", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qsMDhU5dxAKQ9SiPYNEH5Z-1200-80.jpg", "publishedAt": "2020-11-11T16:01:00Z", "content": "Paul M. Sutter is an astrophysicist at SUNY Stony Brook and the Flatiron Institute, host of Ask a Spacemanand Space Radio, and author of How to Die in Space\r\n. He contributed this article to Space.co… [+5842 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Noise and light alter bird nesting habits and success - Phys.org", "description": "Looking for a bird's-eye view of human impact? A new study published in the journal Nature provides the most comprehensive picture yet of how human noise and light pollution affect birds throughout North America, including how these factors may interact with …", "url": "https://phys.org/news/2020-11-noise-bird-habits-success.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/noiseandligh.jpg", "publishedAt": "2020-11-11T16:00:01Z", "content": "Looking for a bird's-eye view of human impact? A new study published in the journal Nature provides the most comprehensive picture yet of how human noise and light pollution affect birds throughout N… [+5428 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Watch SpaceX Fire Up the Mighty Engines of Starship SN8 - Futurism", "description": "The platform seems to have taken a hit.", "url": "https://futurism.com/the-byte/spacex-fire-up-engines-starship-sn8", "urlToImage": "https://wp-assets.futurism.com/2020/11/spacex-fire-up-engines-starship-sn8-768x403.jpg", "publishedAt": "2020-11-11T15:53:42Z", "content": "Starship Fireworks\r\nSpaceX fired up the three rocket engines of its Starship SN8 prototype for the second time last night at its testing facilities in Boca Chica, Texas.\r\nThe event was a powerful bla… [+1255 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "'Fireballs' will be visible with the Northern Taurid Meteor Shower - KTNV Channel 13 Las Vegas", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9VzRqd0dHaEVEWEnSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-11T15:23:34Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "NASA gets review board's nod for Mars sample return project - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=770633", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-11-11T15:13:54Z", "content": "Washington, Nov 11 (IANS): An independent review report has indicated that NASA is now ready to undertake its Mars Sample Return (MSR) campaign to bring pristine samples from the red planet to Earth … [+1904 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Robin Bell", "title": "Announcing the 2020 AGU Union Medal, Award, and Prize Recipients - Eos", "description": "AGU will formally recognize this year’s recipients in December at an online celebration during Fall Meeting 2020.", "url": "https://eos.org/agu-news/announcing-the-2020-agu-union-medal-award-and-prize-recipients", "urlToImage": "https://eos.org/wp-content/uploads/2020/09/agu-honors-shaping-the-future-of-science.png", "publishedAt": "2020-11-11T14:54:41Z", "content": "On behalf of the Earth and space sciences community, we congratulate the 36 individuals receiving the highest honors bestowed by AGU for their excellence in scientific research, education, communicat… [+4586 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "How 20 years on space station benefit people on Earth - National Herald", "description": "Technologies developed for and aboard the International Space Station have benefited people on the ground, from improving workouts to helping us get a good night’s sleep, NASA said", "url": "https://www.nationalheraldindia.com/international/how-20-years-on-space-station-benefit-people-on-earth", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-11%2F1a3cce96-1759-4c47-b003-fe7b197dbff0%2FIAns.jpg?rect=0%2C149%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-11T13:00:00Z", "content": "The plant habitat was designed in part by a company called OSRAM, whose Phytofy RL system uses a similar network of lights for plant research on Earth and is now commercially available for researcher… [+1234 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Researchers accelerate organoid development using algorithm - Drug Target Review", "description": "The semi-automated process enabled researchers to make retinal organoid production and selection nearly four times faster.", "url": "https://www.drugtargetreview.com/news/76048/researchers-accelerate-organoid-development-and-selection-using-algorithm/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/algorithm-accelerating-organoid-development.jpg", "publishedAt": "2020-11-11T12:40:27Z", "content": "Posted: 11 November 2020 | Hannah Balfour (Drug Target Review) | No comments yet\r\nThe semi-automated process enabled researchers to make retinal organoid production and selection nearly four times fa… [+4114 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "'Sound of Hell': NASA's Video of Screaming Eye of Helix Nebula Will Give You the Chills - News18", "description": "In its caption, the NASA explained saying that the Helix Nebula is 655 light-years away from the earth, and three light-years across. The eerie sound that is heard in the post comes from the dying sun-like star’s life.", "url": "https://www.news18.com/news/buzz/sound-of-hell-nasas-video-of-screaming-eye-of-helix-nebula-will-give-you-the-chills-3069830.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605093920_untitled-design-2020-11-11t165304.648.png", "publishedAt": "2020-11-11T12:11:00Z", "content": "The ever-mysterious and fascinating space never fails to surprise us mere humans and a recent post by American space agency National Aeronautics and Space Administration (NASA) has done it yet again.… [+1638 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Glowing Moon: Jupiter's Icy Moon Europa can Illuminate on its Own in Dark, Finds NASA Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "As per the authors of the study, this glow is due to the high level of radiation emitted by Jupiter. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2020-11-11-jupiters-icy-moon-europa-can-illuminate-on-its-own-in-dark", "urlToImage": "https://s.w-x.co/in-europa_0.jpg", "publishedAt": "2020-11-11T12:02:15Z", "content": "Europaone of Jupiters 79 moonshas already shown glimmers of its potential to support life. Scientists have already deciphered that beneath its frozen crust there is a vast ocean, which could host som… [+4242 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Prabhjote Gill", "title": "Two tiny asteroids to zoom past Earth this Diwali — likely without any fireworks - Business Insider India", "description": "Two tiny asteroids are set to make their close approach to Earth on November 14, Diwali. Asteroid 2020 TB9 is the smaller of the two with an average diameter", "url": "https://www.businessinsider.in/science/space/news/two-tiny-asteroids-to-zoom-past-earth-on-diwali-2020/articleshow/79170635.cms", "urlToImage": "https://www.businessinsider.in/photo/79170635/two-tiny-asteroids-to-zoom-past-earth-on-diwali-2020.jpg?imgsize=80339", "publishedAt": "2020-11-11T10:56:00Z", "content": "This Diwali as humans figure out how to celebrate Diwali amid the coronavirus pandemic and the social distancing, two asteroids will be visiting from outer space. Asteroid 2020 TB9 and 2020 ST1 are e… [+1978 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists can now scoop contents of individual cells from their local environment - Phys.org", "description": "Scientists can now select individual cells from a population that grows on the surface of a laboratory dish and study their molecular contents. Developed by University of Toronto researchers, the new tool will enable a deeper study of stem cells and other rar…", "url": "https://phys.org/news/2020-11-scientists-scoop-contents-individual-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/17-scientistsca.jpg", "publishedAt": "2020-11-11T10:00:01Z", "content": "Scientists can now select individual cells from a population that grows on the surface of a laboratory dish and study their molecular contents. Developed by University of Toronto researchers, the new… [+4804 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Scientists identify coronavirus COVID-19 virus `hidden` new gene - Zee News", "description": "Researchers have identified a new  hidden  gene in SARS-CoV-2, the virus responsible for Covid-19, that may have contributed to its unique biology and pandemic potential.", "url": "https://zeenews.india.com/science/scientists-identify-coronavirus-covid-19-virus-hidden-new-gene-2324115.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/11/898704-doctors-corona.jpg", "publishedAt": "2020-11-11T09:44:37Z", "content": "New York: Researchers have identified a new \"hidden\" gene in SARS-CoV-2, the virus responsible for Covid-19, that may have contributed to its unique biology and pandemic potential.\r\nIn a virus that o… [+2659 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Heart Organoids Mimic the Early Stages of Embryonic Heart Development - Technology Networks", "description": "Bioengineers at EPFL have used organoids to mimic the early development of the heart in the mouse embryo. The work is another step towards future bioartificial organs for research and transplants.", "url": "https://www.technologynetworks.com/cell-science/news/heart-organoids-mimic-the-early-stages-of-embryonic-heart-development-342656", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/heart-organoids-mimic-the-early-stages-of-embryonic-heart-development-342656.jpg?cb=20201111", "publishedAt": "2020-11-11T08:55:16Z", "content": "There was a time when the idea of growing organs in the lab was the stuff of science fiction. Today, stem cell biology and tissue engineering are turning fiction into reality with the advent of organ… [+3512 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Hubble Space Telescope captures Comet ISON speeding towards Sun at 77,000 kmph — watch video - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvc2NpZW5jZS9odWJibGUtc3BhY2UtdGVsZXNjb3BlLWNhcHR1cmVzLWNvbWV0LWlzb24tc3BlZWRpbmctdG93YXJkcy1zdW4tYXQtNzcwMDAta21waC13YXRjaC12aWRlby8yMTI2MzA3L9IBmgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvc2NpZW5jZS9odWJibGUtc3BhY2UtdGVsZXNjb3BlLWNhcHR1cmVzLWNvbWV0LWlzb24tc3BlZWRpbmctdG93YXJkcy1zdW4tYXQtNzcwMDAta21waC13YXRjaC12aWRlby8yMTI2MzA3L2xpdGUv?oc=5", "urlToImage": null, "publishedAt": "2020-11-11T08:23:00Z", "content": null}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Researchers 3D print biomedical parts with supersonic speed - Nanowerk", "description": "Forget glue, screws, heat or other traditional bonding methods. Researchers have developed a 3D printing technique that creates cellular metallic materials by smashing together powder particles at supersonic speed.", "url": "https://www.nanowerk.com/news2/gadget/newsid=56600.php", "urlToImage": "https://www.nanowerk.com/news2/gadget/id56600.jpg", "publishedAt": "2020-11-11T07:58:22Z", "content": null}, {"source": {"id": null, "name": "Graphene-Info"}, "author": "Roni Peleg", "title": "Researchers design ultra-thick 3D graphene frameworks for high-performance flexible micro-supercapacitors - Graphene-Info", "description": null, "url": "https://www.graphene-info.com/researchers-design-ultra-thick-3d-graphene-frameworks-high-performance-flexible", "urlToImage": null, "publishedAt": "2020-11-11T07:48:10Z", "content": "A group of researchers, led by Prof. WANG Zhenyang from the Institute of Solid State Physics of the Hefei Institutes of Physical Science (HFIPS), has reported a novel graphene-based method to prepare… [+1590 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Markus Payer", "title": "NASA-ESA's Mars Sample Return mission on track, report says - SpaceWatch.Global", "description": "Luxembourg, 11 November 2020. - NASA is on track to bring samples from Mars to Earth, the U.S. space agency said, citing a report from the Mars Sample Return (MSR) Independent Review Board (IRB). Foll", "url": "https://spacewatch.global/2020/11/nasa-esas-mars-sample-return-mission-on-track-report-says/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2020/11/pia23496_-_mav_launch-660x330.jpg", "publishedAt": "2020-11-11T07:01:56Z", "content": "Graphic: ESA\r\nLuxembourg, 11 November 2020. – NASA is on track to bring samples from Mars to Earth, the U.S. space agency said, citing a report from the Mars Sample Return (MSR) Independent Review Bo… [+1676 chars]"}, {"source": {"id": null, "name": "Chemicalmarketreports.com"}, "author": "Ketan Mahajan", "title": "Asteroid Apophis Orbit Disrupted Due Sunlight, To Make Close Approach To Earth In 2029 - Chemical Market Reports", "description": "The orbit of asteroid Apophis has been disrupted. The disruption is believed to be caused due to the rising heat. Astronomers have termed the phenomenon as the Yarkovsky effect", "url": "https://chemicalmarketreports.com/2020/11/11/asteroid-apophis-orbit-disrupted-due-sunlight-to-make-close-approach-to-earth-in-2029/", "urlToImage": null, "publishedAt": "2020-11-11T06:39:00Z", "content": "The orbit of asteroid Apophis has been disrupted. The disruption is believed to be caused due to the rising heat. Astronomers have termed the phenomenon as the Yarkovsky effect. It can change the pat… [+1745 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Study reveals the secrets to designing brain-like devices - Tech Explorist", "description": "Scientists from the University of Chicago have predicted new design rules for developing devices that mimic what occurs in our brain's neurons and synapses.", "url": "https://www.techexplorist.com/study-reveals-secrets-designing-brain-like-devices/36080/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2020/11/Ball-and-stick.jpg", "publishedAt": "2020-11-11T06:13:00Z", "content": "In the last decade, the new paradigm of neuromorphic computing has emerged. Neuromorphic computing implements aspects of biological neural networks as analog or digital copies on electronic circuits.… [+2791 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "NASA chief not ready to continue under Biden: Report - The Statesman", "description": "When President Donald Trump nominated the former Republican Congressman to lead NASA in 2017, many lawmakers opposed the idea of a politician heading the US space agency.", "url": "https://www.thestatesman.com/world/nasa-chief-not-ready-continue-biden-report-1502934726.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/11/UN.jpg", "publishedAt": "2020-11-11T05:46:36Z", "content": "NASA administrator Jim Bridenstine has no intention to continue in his current position even if asked by the Joe Biden administration, said a media report.\r\nIn an interview to AerospaceDaily, Bridens… [+1240 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Tips for making nanographene - EurekAlert", "description": "Nanographene is a material that is anticipated to radically improve solar cells, fuel cells, LEDs and more. Typically the synthesis of this material has been imprecise and difficult to control. For the first time, researchers have discovered a simple way to g…", "url": "https://www.eurekalert.org/pub_releases/2020-11/uot-tfm110820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/248167_web.jpg", "publishedAt": "2020-11-11T05:02:47Z", "content": "IMAGE: The copper probe can manipulate matter at the atomic scale.\r\n view more \r\nCredit: © 2020 Shiotari et al.\r\nNanographene is a material that is anticipated to radically improve solar cells, fuel … [+4935 chars]"}, {"source": {"id": null, "name": "Theguardian.comworld"}, "author": "Eleanor Ainge Roy", "title": "New species of extinct monk seal identified from fossils in New Zealand - The Guardian", "description": "Previously unknown animal - that has been named after a sea in Lord of the Rings - radically changes scientists’ understanding of how seals evolved", "url": "https://amp.theguardian.comworld/2020/nov/11/new-species-of-extinct-monk-seal-identified-from-fossils-in-new-zealand", "urlToImage": "https://i.guim.co.uk/img/media/b098e06b3b4ac66c6a11e513d302a8e93eed72e3/0_219_4093_2456/master/4093.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a7348afa980cdabca9953b466f78c660", "publishedAt": "2020-11-11T03:16:00Z", "content": "Fossils found in New Zealand have led to the discovery of a previously unidentified species of extinct monk seal, which biologists say is the biggest breakthrough in seal evolution in seven decades.\r… [+2462 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "This Extinct Human Ancestor Evolved to Cope With Climate Change, But Didn't Survive - ScienceAlert", "description": "The discovery of a 2-million-year-old skull in a South African cave is changing what we think we know about one of humanity's primitive ancestors, scientists report in a new study.", "url": "https://www.sciencealert.com/this-ancient-human-ancestor-evolved-in-response-to-climate-change-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2020-11/processed/010-robustus-0_1024.jpg", "publishedAt": "2020-11-10T22:07:05Z", "content": "The discovery of a 2-million-year-old skull in a South African cave is changing what we think we know about one of humanity's primitive ancestors, scientists report in a new study.\r\nBut the newly une… [+3702 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Universe is Getting Hotter, Says New Study | Astronomy - Sci-News.com", "description": "The mean temperature of gas across the Universe has increased more than 10 times over the last 10 billion years and reached about 2 million Kelvin today, according to new research published in the Astrophysical Journal.", "url": "http://www.sci-news.com/astronomy/universe-getting-hotter-09037.html", "urlToImage": "http://cdn.sci-news.com/images/2020/11/image_9037f-Hotter-Universe.jpg", "publishedAt": "2020-11-10T20:26:41Z", "content": "The mean temperature of gas across the Universe has increased more than 10 times over the last 10 billion years and reached about 2 million Kelvin today, according to new research published in the As… [+2653 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Samuel Osborne", "title": "Remains of new species of flying lizard found in museum drawer - The Independent", "description": "Specimens were believed to be fossils of shark spines", "url": "https://www.independent.co.uk/news/science/archaeology/new-species-flying-lizard-museum-drawer-brighton-pterosaur-b1720680.html", "urlToImage": "https://static.independent.co.uk/2020/11/10/19/newFile-1.jpg", "publishedAt": "2020-11-10T19:35:00Z", "content": "A fossil belonging to a new species of flying lizard has been discovered among a century-old collection at a museum in Brighton.\r\nPhD student Roy Smith found the mystery species of pterosaur among fo… [+1973 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "ActiveItZone", "title": "Looking for life beyond our earth, becoming a multiplanetry species - Rising Kashmir", "description": "“I believe that the long term future of the human race must be space and that it represents an important life insurance for our future survival, as it could prevent the disappearance of humanity by colonizing other planets”..Stephen Hawking", "url": "http://risingkashmir.com/home/news_description/368584/Looking-for-life-beyond-our-earth-becoming-a-multiplanetry-species", "urlToImage": "http://risingkashmir.com/uploads/news_image/news_368584_1.jpg", "publishedAt": "2020-11-10T18:46:04Z", "content": "Ms. Nusrat Jan\r\nSince the dawn of space science man has\r\nbeen looking for his probable cosmic relatives, with each passing day human\r\nrace is becoming more curious and knowledgeable about the univers… [+8236 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Water Present on All Rocky Planets, Martian Meteorite Study Suggests | Planetary Science, Space Exploration - Sci-News.com", "description": "Water may emerge in connection with the formation of terrestrial planets, according to a new analysis of a Martian meteorite called North West Africa (NWA) 7533.", "url": "http://www.sci-news.com/space/water-rocky-planets-09036.html", "urlToImage": "http://cdn.sci-news.com/images/2015/03/image_2568_2-Mars-Ocean.jpg", "publishedAt": "2020-11-10T18:33:42Z", "content": "Water may emerge in connection with the formation of terrestrial planets, according to a new analysis of a Martian meteorite called North West Africa (NWA) 7533.\r\nAn artists impression of the young M… [+2663 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "Senate committee’s budget for lunar landers falls short of NASA request - The Verge", "description": "On November 10th, the Senate Appropriates Committee released its 12 funding bills for the federal government for next year, providing $1 billion to NASA to help fund the development of new lunar landers. It’s roughly $2.4 billion short of what NASA had reques…", "url": "https://www.theverge.com/2020/11/10/21558572/nasa-senate-appropriations-artemis-program-moon-landers", "urlToImage": "https://cdn.vox-cdn.com/thumbor/Y5mdOKmcoLAmpzFJa8aWtzeXajk=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22026866/hls_eva_apr2020__2_.jpg", "publishedAt": "2020-11-10T18:31:12Z", "content": "NASA is going to get some funding for landers, just not the full amount it asked for\r\nSenate appropriators are proposing to allocate $1 billion to NASA next year for the construction of new lunar lan… [+3953 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Nathaniel Scharping", "title": "A Dark Matter Detector Based on a Wind Chime Seems Just Weird Enough to Work - Gizmodo", "description": "Dark matter physicists may have one of the most frustrating jobs in science. Their work deals with something that must, by almost all models of the universe, exist. But we’ve never found any direct evidence for dark matter. Where other scientists can capture …", "url": "https://gizmodo.com/a-dark-matter-detector-based-on-a-wind-chime-seems-just-1845631934", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/h7xoj3apo5j6lt7vfcy4.png", "publishedAt": "2020-11-10T17:55:00Z", "content": "Dark matter physicists may have one of the most frustrating jobs in science. Their work deals with something that must, by almost all models of the universe, exist. But weve never found any direct ev… [+8377 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kevin Krajick", "title": "Scientists have discovered an ancient lake bed deep beneath the Greenland ice - Phys.org", "description": "Scientists have detected what they say are the sediments of a huge ancient lake bed sealed more than a mile under the ice of northwest Greenland—the first-ever discovery of such a sub-glacial feature anywhere in the world. Apparently formed at a time when the…", "url": "https://phys.org/news/2020-11-scientists-ancient-lake-bed-deep.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/17-scientistsha.jpg", "publishedAt": "2020-11-10T16:57:57Z", "content": "Scientists have detected what they say are the sediments of a huge ancient lake bed sealed more than a mile under the ice of northwest Greenlandthe first-ever discovery of such a sub-glacial feature … [+6443 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Bacteria from Earth could potentially be used to mine on the moon or Mars - CNN International", "description": "Experiments performed on the International Space Station have suggested that bacteria from Earth could be used to extract useful minerals on the moon or Mars.", "url": "https://www.cnn.com/2020/11/10/world/microbes-mining-in-space-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201110105643-02-microbes-mining-in-space-super-tease.jpg", "publishedAt": "2020-11-10T16:14:47Z", "content": null}, {"source": {"id": null, "name": "Medgadget"}, "author": "Conn Hastings", "title": "Implantable Biodegradable Sensor Measures Gases Inside The Body - Medgadget", "description": null, "url": "https://www.medgadget.com/2020/11/implantable-biodegradable-sensor-measures-gases-in-the-body.html", "urlToImage": "https://www.medgadget.com/wp-content/uploads/2020/11/gas-array-sensor-device.jpg", "publishedAt": "2020-11-10T15:47:34Z", "content": "Researchers at Penn State have developed an implantable sensor that can measure levels of NO and NO2 gases in the body, both of which are medically relevant. Consisting of silicon and magnesium, the … [+2481 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Laser beams give neuroscientists new insights about brain’s 'inner GPS' system in mice study - Firstpost", "description": "This is the first demonstration of being able to retrieve memories of our environment using 'place cell' activation.", "url": "https://www.firstpost.com/tech/science/laser-beams-give-neuroscientists-new-insights-about-brains-inner-gps-system-in-mice-study-9000301.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/05/Brain-Human.jpg", "publishedAt": "2020-11-10T15:12:26Z", "content": "FP TrendingNov 10, 2020 20:42:26 IST\r\nScientists have found a way to mentally teleport mice to a different location by stimulating a neuron in their brain. The team used laser beams in order to react… [+1848 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists develop AI-powered 'electronic nose' to sniff out meat freshness - EurekAlert", "description": "Scientists led by NTU Singapore have invented an artificial olfactory system that mimics the mammalian nose to assess the freshness of meat accurately. The 'electronic nose' comprises a 'barcode' that changes colour over time in reaction to the gases produced…", "url": "https://www.eurekalert.org/pub_releases/2020-11/ntu-sda110920.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/248335_web.jpg", "publishedAt": "2020-11-10T14:48:19Z", "content": "A team of scientists led by Nanyang Technological University, Singapore (NTU Singapore) has invented an artificial olfactory system that mimics the mammalian nose to assess the freshness of meat accu… [+8557 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Iconic Arecibo Observatory in Puerto Rico Faces Severe Damage as Second Cable Breaks in 3 Months - News18", "description": "Francis Cordova, the director of the observatory, asserted that no one got hurt in either of the accidents.", "url": "https://www.news18.com/news/buzz/iconic-arecibo-observatory-in-puerto-rico-faces-severe-damage-as-second-cable-breaks-in-3-months-3066692.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605017552_arecibo.jpeg", "publishedAt": "2020-11-10T14:13:32Z", "content": "In a worrisome repetition of an accident at the Arecibo Observatory in Puerto Rico, another cable has broken away. This is the second such incident this year, causing even more damage to one of the m… [+2492 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Vishal Tiwari", "title": "Sounds like screaming woman: Sonification video of Helix Nebula scares netizens - Republic World", "description": "Even though there is no sound in space, Helix Nebula, which is approximately 655 light-years away from Earth, has been given a sound through sonification.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/sounds-like-screaming-woman-sonification-video-of-helix-nebula-scares-netizens.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/wfyvgkqox9fncmyd_1605016006.jpeg?tr=f-jpeg", "publishedAt": "2020-11-10T14:01:00Z", "content": "Ever wondered what stars or other space elements would sound like if they had music? If not, then listen to the latest sonification of Helix Nebula that NASA's Hubble has shared on its social media h… [+2885 chars]"}, {"source": {"id": null, "name": "FreshPlaza.com"}, "author": null, "title": "Micro and nanoplastics not absorbed by plant cells, but do attach to the root cap - FreshPlaza.com", "description": "Like a toxic Trojan horse, microplastics can act as hot pockets of contaminant transport. But, can microplastics get into plant cells? Recent research shows that they can't. \nOver the last decade,…", "url": "https://www.freshplaza.com/article/9266675/micro-and-nanoplastics-not-absorbed-by-plant-cells-but-do-attach-to-the-root-cap/", "urlToImage": "https://www.freshplaza.com/remote.axd?https://agfstorage.blob.core.windows.net/misc/HD_com/2020/11/10/pixels.png?preset=OgImage", "publishedAt": "2020-11-10T13:00:01Z", "content": "Like a toxic Trojan horse, microplastics can act as hot pockets of contaminant transport. But, can microplastics get into plant cells? Recent research shows that they can't. \r\nOver the last decade, s… [+3253 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PTI", "title": "Indian astronomers worked closely with Nobel Laureate Andrea Ghez on TMT project: DST - Yahoo India News", "description": "New Delhi, Nov 10 (PTI) Indian astronomers had worked closely with Nobel Laureate Andrea Ghez on the design of back-end instruments and possible science...", "url": "https://in.news.yahoo.com/indian-astronomers-worked-closely-nobel-123321392.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-11-10T12:33:00Z", "content": "New Delhi, Nov 10 (PTI) Indian astronomers had worked closely with Nobel Laureate Andrea Ghez on the design of back-end instruments and possible science prospects of the Thirty Meter Telescope (TMT) … [+1898 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Chang'e-4 probe resumes work for 24th lunar day - CGTN", "description": "The lander and rover of the Chang'e-4 probe have resumed work for the 24th lunar day on the far side of the moon.", "url": "https://news.cgtn.com/news/2020-11-10/China-s-Chang-e-4-probe-resumes-work-for-24th-lunar-day-VjchNMaEHC/index.html", "urlToImage": "https://news.cgtn.com/news/2020-11-10/China-s-Chang-e-4-probe-resumes-work-for-24th-lunar-day-VjchNMaEHC/img/4e16e27b6ff84f2f8b38c0aac3747bd5/4e16e27b6ff84f2f8b38c0aac3747bd5-750.jpeg", "publishedAt": "2020-11-10T12:25:37Z", "content": "The lander and rover of the Chang'e-4 probe have resumed work for the 24th lunar day on the far side of the moon. \r\nThe lander woke up at 3:12 a.m. Tuesday, Beijing Time, and the rover Yutu-2, or Jad… [+708 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Making 3-D nanosuperconductors with DNA - Tech Explorist", "description": "Complex 3-D nanoscale architectures based on DNA self-assembly can conduct electricity without resistance and may provide a platform for fabricating quantum computing and sensing devices.", "url": "https://www.techexplorist.com/making-3-d-nanosuperconductors-dna/36073/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2020/11/3-D-superconducting-materials.jpg", "publishedAt": "2020-11-10T12:03:00Z", "content": "Three-dimensional (3-D) nanostructured materials can conduct electricity without resistance. According to scientists, it could be used in a range of quantum devices.\r\nSuch 3-D superconducting nanostr… [+5453 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Asteroid Bennu's interior could be like 'crème-filled chocolate egg flying through space', say scientists - India Today", "description": "The interior of the diamond-shaped asteroid Bennu could be \"weaker and less dense than its outer layers -- like a crème-filled chocolate egg flying through space\", scientists from the University of Colorado Boulder said earlier.", "url": "https://www.indiatoday.in/science/story/asteroid-bennu-s-hollow-like-cr-me-filled-chocolate-egg-space-scientists-nasa-1739724-2020-11-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202011/checkpoivfgr-647x363.jpeg?KKzrRmFcJt9KcScIOHcyXOmmhU3DsPIh", "publishedAt": "2020-11-10T09:59:43Z", "content": "Asteroid Bennu, the samples of which were collected by Nasa spacecraft OSIRIS-REx in a historic mission, might be hollow. According to scientists from the University of Colorado Boulder, the interior… [+4644 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Hubble telescope captures space cascade - The Times Hub", "description": "The Hubble telescope recorded a space cascade on camera. Some of its stars are six times hotter than the surface of the Sun. Image via:", "url": "https://thetimeshub.in/hubble-telescope-captures-space-cascade/11175/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2020/11/0990b1bf6c54a391d2c5180792df604a.png", "publishedAt": "2020-11-10T04:50:21Z", "content": "The Hubble telescope recorded a space cascade on camera. Some of its stars are six times hotter than the surface of the Sun.\r\nImage via: pxhere.comAccording to NASA, UGCA 193 is a galaxy in the const… [+582 chars]"}]}