{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Chandrayaan-2 Orbiter Makes First-of-Its-Kind Observations on Global Distribution of Argon-40 in the Moon's Exosphere | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Chandrayaan-2's findings of Ar-40 up to the mid-latitude Lunar regions play a significant role in bridging the gap in the knowledge of the element's presence on the Moon. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-09-chandrayaan-2-orbiter-detects-argon-40-in-the-moons-exosphere", "urlToImage": "https://s.w-x.co/in-chandrayaan-2%281%29.jpg", "publishedAt": "2022-03-09T06:08:26Z", "content": "It has been nearly three years since the Indian Space Research Organisations (ISRO) lunar exploration mission Chandrayaan-2 took off from the Earth. While the Vikram Lander crash-landed on the Moon, … [+3523 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Rohitha Naraharisetty", "title": "Scientists Say an Abandoned Rocketship Has Crashed Into the Moon - The Swaddle", "description": "The collision, which is a historical first, may have formed a large crater on the moon’s surface and raises concerns about space junk.", "url": "https://theswaddle.com/scientists-say-an-abandoned-rocketship-has-crashed-into-the-moon/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/03/Rocketship_Editorial.jpg", "publishedAt": "2022-03-09T04:59:33Z", "content": "For the first time in history, a rocketship may have crashed into the far side of the Moon’s surface. It is a particularly concerning event to track — rocket parts are abandoned in space after rocket… [+2371 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "JHU-created material could lead to stronger, lighter and safer helmets and vehicles - EurekAlert", "description": "A team of Johns Hopkins University researchers created shock-absorbing material that protects like a metal, but is lighter, stronger, reusable. The new foam-like material could be a game-changer for helmets, body armor, and automobile and aerospace parts.", "url": "https://www.eurekalert.org/news-releases/945823", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/3a6d6eef-cb08-4c69-9c17-4a1bfc19c7f9/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-09T02:04:44Z", "content": "video: Liquid crystal elastomer structure tested in drop tester machine.view more \r\nCredit: Johns Hopkins University\r\nA team of Johns Hopkins University researchers created shock-absorbing material t… [+2435 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "Sharks Sleep in What Ways? Scientists make a breakthrough with both eyes open. ⋆ Ceng News - Ceng News", "description": "Scientists have discovered that sharks can sleep with both eyes open on occasion.Sharks don't sleep or rest like mammals, according", "url": "https://www.cengnews.com/news/sharks-sleep-in-what-ways-scientists-make-a-breakthrough-with-both-eyes-open-310860.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1646785086_sharks.jpg", "publishedAt": "2022-03-09T00:19:07Z", "content": "Scientists have discovered that sharks can sleep with both eyes open on occasion.\r\nSharks don’t sleep or rest like mammals, according to scientists. To keep oxygen-filled water flowing over their gil… [+2288 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX to launch 48 Starlink satellites, land rocket Wednesday morning: Watch live - Space.com", "description": "Liftoff is scheduled for 8:45 a.m. EST (13:45 GMT).", "url": "https://www.space.com/spacex-launch-48-starlink-satellites-march-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Kfg2vYY5VC7FVnqbyiqEj3-1200-80.jpg", "publishedAt": "2022-03-09T00:09:11Z", "content": "SpaceX will launch four dozen Starlink\r\n internet satellites and land the returning rocket on Wednesday (March 9), and you can watch the action live.\r\nA two-stage Falcon 9\r\n rocket topped with 48 Sta… [+2521 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Life in the Freezer: First Evidence of Fundamental Growth Limitations in Antarctic Fish - SciTechDaily", "description": "Antarctic fish have adapted over millennia to survive in the freezing temperatures of the Southern Ocean. However, in doing so, they have lost their ability to grow at rates seen in their warmer water cousins, even when they are now held at the same water tem…", "url": "https://scitechdaily.com/life-in-the-freezer-first-evidence-of-fundamental-growth-limitations-in-antarctic-fish/", "urlToImage": "https://scitechdaily.com/images/Antarctic-Spiny-Plunderfish.jpg", "publishedAt": "2022-03-09T00:00:47Z", "content": "The Antarctic spiny plunderfish (Harpagifer antarcticus). Credit: Lloyd Peck, British Antarctic Survey\r\nAntarctic fish have adapted over millennia to survive in the freezing temperatures of the South… [+3904 chars]"}, {"source": {"id": null, "name": "Globelynews.com"}, "author": "Wendy Whitman Cobb", "title": "UAE Mars Mission Seeks to Bring Hope to More Places Than the Red Planet - Globely News", "description": "Abu Dhabi's Mars Mission could enable a new generation of space exploration.", "url": "https://globelynews.com/middle-east/uae-mars-mission-project-hope/", "urlToImage": "https://i0.wp.com/globelynews.com/wp-content/uploads/2019/05/Omran_Sharaf_at_Hope_Scientific_Mission_Announcement_Event-e1561572802143.jpg?resize=1000%2C563&ssl=1", "publishedAt": "2022-03-08T22:36:10Z", "content": "On July 14, a new Mars-bound spacecraft will launch from Japan. While several Mars missions are planned to launch over the next month, what makes this different is whos launching it: the United Arab … [+4682 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Sound can stimulate blind retina to transmit signals to the brain via an ultrasonic retinal prosthesis - Medical Xpress", "description": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of millions of people worldwide. Although the rods and cones which a…", "url": "https://medicalxpress.com/news/2022-03-retina-transmit-brain-ultrasonic-retinal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/retina.jpg", "publishedAt": "2022-03-08T21:27:18Z", "content": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of milli… [+6117 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Check out 20 years of iconic images courtesy of NASA's Hubble telescope - TechSpot", "description": "The workhorse that is the Hubble Space Telescope has provided humanity with jaw-dropping images of our solar system and the universe at large for more than 30...", "url": "https://www.techspot.com/news/93698-check-out-20-years-iconic-images-courtesy-nasa.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-08-image-36.jpg", "publishedAt": "2022-03-08T20:58:00Z", "content": "In brief: NASA is celebrating the 20th anniversary of the installation of the Advanced Camera for Surveys on the Hubble Space Telescope by looking back at some of the more than 125,000 pictures captu… [+2686 chars]"}, {"source": {"id": null, "name": "InsideHook"}, "author": "Tanner Garrity", "title": "Does NASA Have the Ability to Shoot Down a Life-Threatening Asteroid? - InsideHook", "description": "If \"Don't Look Up\" happens in real life, NASA does have some options for dangerous asteroids and comets that approach Earth.", "url": "https://www.insidehook.com/daily_brief/science/nasa-shoot-down-asteroids", "urlToImage": "https://www.insidehook.com/wp-content/uploads/2022/03/hero-1.jpg?w=1200", "publishedAt": "2022-03-08T20:44:13Z", "content": "Considering that in the last two years we’ve seen six million people die from a global virus, a mob of Americans attack the Capitol Building and the first major land war in Europe since the end of Wo… [+4429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Meet the project manager working to develop the rocket that will bring Mars samples to Earth - Phys.org", "description": "Right now, some 182 million miles (293 million kilometers) separate the red clay of Alabama from the dusty red planet Mars. But groundbreaking flight hardware developed at NASA's Marshall Space Flight Center in Huntsville, Alabama, will soon close that distan…", "url": "https://phys.org/news/2022-03-rocket-mars-samples-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasas-angie-jackman-wo.jpg", "publishedAt": "2022-03-08T19:49:09Z", "content": "Right now, some 182 million miles (293 million kilometers) separate the red clay of Alabama from the dusty red planet Mars. But groundbreaking flight hardware developed at NASA's Marshall Space Fligh… [+4668 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Well-preserved fossils could be a consequence of past global climate change - Phys.org", "description": "Climate change can affect life on Earth. According to new research, it can also affect the dead.", "url": "https://phys.org/news/2022-03-well-preserved-fossils-consequence-global-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/well-preserved-fossils-3.jpg", "publishedAt": "2022-03-08T19:46:44Z", "content": "Climate change can affect life on Earth. According to new research, it can also affect the dead.\r\nA study of exceptionally preserved fossils led by a graduate student at The University of Texas at Au… [+4187 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA's Mars rover Perseverance snags 7th Red Planet rock sample - Space.com", "description": "Perseverance will grab one more sample from its current site and then head toward an ancient river delta.", "url": "https://www.space.com/mars-rover-perseverance-collects-7th-sample", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wdpjD42nrdoFR5fbZFy9VY-1200-80.jpeg", "publishedAt": "2022-03-08T19:45:26Z", "content": "NASA's Perseverance rover now has seven Mars rock samples in its collection.\r\nThe car-sized robot drilled into another Martian rock and socked away the resulting core, mission team members announced … [+2534 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "NASA's NICER telescope sees hot spots merge on a magnetar - Science Daily", "description": "For the first time, NASA's Neutron star Interior Composition Explorer (NICER) has observed the merging of multimillion-degree X-ray spots on the surface of a magnetar, a supermagnetized stellar core no larger than a city.", "url": "https://www.sciencedaily.com/releases/2022/03/220308130555.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T18:30:42Z", "content": "For the first time, NASA's Neutron star Interior Composition Explorer (NICER) has observed the merging of multimillion-degree X-ray spots on the surface of a magnetar, a supermagnetized stellar core … [+4201 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Researchers Name Fossilized Vampire Squid After Joe Biden - Gizmodo", "description": "Syllipsimopodi bideni has a surprising 10 arms, unlike the eight found on modern vampire squid.", "url": "https://gizmodo.com/researchers-name-fossilized-vampire-squid-after-joe-bid-1848621813", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8c4ad807784747fe87b626ebb4067bca.jpg", "publishedAt": "2022-03-08T17:37:00Z", "content": "A team of paleontologists has announced the discovery of a 328-million-year-old cephalopod with 10 arms. Its an ancestor of modern octopuses and vampire squids and offers exciting insights into when … [+4071 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Spiders hunt in PACKS of hundreds, using web vibrations to coordinate attacks - Daily Mail", "description": "A species of spider called Anelosimus eximius takes down its prey in packs using specialised web vibrations, researchers at CNRS in Paris report.", "url": "https://www.dailymail.co.uk/sciencetech/article-10590411/Spiders-hunt-PACKS-hundreds-using-web-vibrations-coordinate-attacks.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/16/55103275-0-image-a-58_1646757735475.jpg", "publishedAt": "2022-03-08T17:12:23Z", "content": "It's usually the lion that's known for hunting in packs, using coordinated movements to ambush its unfortunate prey. \r\nBut a new study shows how a species of spider, called Anelosimus eximius, simila… [+8417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "First Photos From Moon Set For Auction In Denmark - NDTV", "description": "The first NASA photographs taken on the Moon, including the first shot of an \"Earthrise\" and Buzz Aldrin walking on the surface, will be auctioned off in Copenhagen on Wednesday.", "url": "https://www.ndtv.com/world-news/first-photos-from-moon-set-for-auction-in-denmark-2811491", "urlToImage": "https://c.ndtvimg.com/2022-03/ohg1dq0g_nasa-moon-photo-afp-650_625x300_08_March_22.jpg", "publishedAt": "2022-03-08T16:44:54Z", "content": "Moon photos on auction: Several of the photos are on public display for the first time.\r\nCopenhagen: The first NASA photographs taken on the Moon, including the first shot of an \"Earthrise\" and Buzz … [+2157 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Engineering NASA's Return to the Moon - NASA", "description": "These engineers developed and tested Space Launch System software that will tell the rocket how to operate for the first 8 minutes of Artemis during launch and ascent.", "url": "https://www.nasa.gov/image-feature/engineering-nasa-s-return-to-the-moon/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ceb_2369.jpg", "publishedAt": "2022-03-08T16:31:10Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Tiny ‘skyscrapers’ help bacteria convert sunlight into electricity - India Education Diary", "description": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise ‘nano-housing’ where sun-loving bacteria can grow quickly. The researchers were then able to extract the bacteria’s waste electrons, left over from photo", "url": "https://indiaeducationdiary.in/university-of-cambridge-tiny-skyscrapers-help-bacteria-convert-sunlight-into-electricity/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-03-08T16:21:03Z", "content": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise nano-housing where sun-loving bacteria can grow quickly. The researchers were then able to extract the… [+3824 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Massive bubbles at center of Milky Way caused by supermassive black hole - Phys.org", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy.", "url": "https://phys.org/news/2022-03-massive-center-milky-supermassive-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/massive-bubbles-at-cen.jpg", "publishedAt": "2022-03-08T16:20:01Z", "content": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy.\r\nSince then, astronomers have debated their origin. Now, a study inclu… [+6559 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Understanding the language of the eyes - Phys.org", "description": "What is the significance of the sclera of our eyes? A question which researchers have been interested in for some time now. Recently a research team led by comparative psychologist Dr. Fuhimiro Kano has succeeded in deciphering the mystery: The white of the e…", "url": "https://phys.org/news/2022-03-language-eyes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/eyes.jpg", "publishedAt": "2022-03-08T16:10:01Z", "content": "What is the significance of the sclera of our eyes? A question which researchers have been interested in for some time now. Recently a research team led by comparative psychologist Dr. Fuhimiro Kano … [+3497 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Traces of life in the Earth's deep mantle - Science Daily", "description": "The rapid development of fauna 540 million years ago has permanently changed the Earth - deep into its lower mantle. A team has now found traces of this development in rocks from this zone.", "url": "https://www.sciencedaily.com/releases/2022/03/220308102802.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T16:09:07Z", "content": "The rapid development of fauna 540 million years ago has permanently changed the Earth -- deep into its lower mantle. A team led by ETH researcher Andrea Giuliani found traces of this development in … [+3933 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Animals evolved the ability to GALLOP 472 million years ago, study claims - Daily Mail", "description": "The ability to perform 'asymmetrical gaits' dates back before the first animals arrived on land 210 million years ago, reports an expert at College of Charleston in South Carolina.", "url": "https://www.dailymail.co.uk/sciencetech/article-10589925/Animals-evolved-ability-GALLOP-472-million-years-ago-study-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/15/55098369-0-image-a-37_1646751760395.jpg", "publishedAt": "2022-03-08T15:46:36Z", "content": "Animals evolved the ability to gallop 472 million years ago around 260 million years before they emerged onto land, a new study claims.\r\nResearchers have analysed existing scientific literature on th… [+7393 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "New class of killer T cells may prevent autoimmune diseases - Science", "description": "Study identifies human counterparts to mouse cells that quell rogue immune response", "url": "https://www.science.org/content/article/new-class-killer-t-cells-may-prevent-autoimmune-diseases", "urlToImage": "https://www.science.org/do/10.1126/science.adb1862/abs/_20220307_on_humantcells_ss1353709.jpg", "publishedAt": "2022-03-08T15:08:00Z", "content": "The price for a vigilant immune system that can pounce on tumor cells or pathogens is occasional friendly fire—an autoimmune attack. Scientists have now identified a new type of human T cell that que… [+5168 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Mars rover reveals new features on the red planet - CGTN", "description": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist on Monday.", "url": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/img/3fdec88f93ed474187756d7b39fed3bb/3fdec88f93ed474187756d7b39fed3bb-750.png", "publishedAt": "2022-03-08T15:00:57Z", "content": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist o… [+1163 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "This extinct ten-armed fossil may be earliest known ancestor of vampire squid - Ars Technica", "description": "Syllipsimopodi bideni named to honor US President Joe Biden's commitment to science.", "url": "https://arstechnica.com/science/2022/03/this-extinct-ten-armed-fossil-may-be-earliest-known-ancestor-of-vampire-squid/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/squid1ROTATE-760x380.jpg", "publishedAt": "2022-03-08T13:43:49Z", "content": "Enlarge/ An artistic reconstruction of the newly described 328-million-year-old vampyropod, Syllipsimopodi bideni.\r\n24 with 20 posters participating\r\nPaleontologists believe they have discovered a ne… [+4819 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "Now, you can send your name to Space - Telangana Today", "description": "Hyderabad: If it has been your dream to fly to Space, then there is one way to at least partially fulfill it. Now, you can send your name to Space – all thanks to a new initiative by the National Aeronautics and Space Administration (NASA). All you have to do…", "url": "https://telanganatoday.com/now-you-can-send-your-name-to-space", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/Boarding-pass.jpg", "publishedAt": "2022-03-08T13:11:58Z", "content": null}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA's Solar Orbiter set to make its first-ever closest approach to sun on March 26 - Republic World", "description": "ESA's orbiter is currently around 75 million kilometres away from the Sun which is the same distance it achieved during its close pass to the sun in June 2020.", "url": "https://www.republicworld.com/science/space/esas-solar-orbiter-set-to-make-its-first-ever-closest-approach-to-sun-on-march-26-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/rwigyjaomdp85uca_1646741365.jpeg", "publishedAt": "2022-03-08T12:17:00Z", "content": "Forging ahead in the footsteps of its counterpart, NASA's Parker solar probe, the solar orbiter built by the European Space Agency (ESA) is all set to make its closest approach to the sun.\r\nThe space… [+1673 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Jupiter's moon Ganymede spotted casting shadow on gas giant in stunning new Juno pic - Republic World", "description": "Jupiter's moon Ganymede can be found casting a giant shadow on the gas giant, a phenomenon which was snapped by Juno during its 20th flyby in May 2019.", "url": "https://www.republicworld.com/science/space/jupiters-moon-ganymede-spotted-casting-shadow-on-gas-giant-in-stunning-new-juno-pic-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/sxqivvfsfllloqju_1646739305.jpeg", "publishedAt": "2022-03-08T11:55:00Z", "content": "The Juno spacecraft, which has been hovering around Jupiter for over five years, has proven to be a treasure trove in terms of data about the gas giants and its many moons. In a recent development, a… [+2013 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "It seemed like the most dangerous asteroid in a decade, but it definitely won't hit Earth - Space.com", "description": "The asteroid threatened to hit Earth next year, not giving enough time for a deflection mission.", "url": "https://www.space.com/most-dangerous-asteroid-in-decade-miss-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vPsFVcbBycuGt9qYUSV6Ca-1200-80.jpg", "publishedAt": "2022-03-08T11:00:14Z", "content": "A recently discovered asteroid seemed to be on a trajectory to hit Earth next year, but orbit recalculation eventually revealed it will miss our planet. \r\nThe 230-feet-wide (70 meters) asteroid\r\n 202… [+3014 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists significantly improved micro-computed tomography - Tech Explorist", "description": "Advances in micro-computed tomography.", "url": "https://www.techexplorist.com/scientists-significantly-improved-micro-computed-tomography/45154/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/micro-computed-tomography-scanner.jpg", "publishedAt": "2022-03-08T10:57:30Z", "content": "Also known as microtomography, Micro-computed tomography (Micro-CT) is a 3D imaging technique that generates 3D images of the internal structure of samples with small dimensions. It is generally used… [+3475 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's Psyche spacecraft gets equipped with solar arrays that can power 4 houses - Republic World", "description": "NASA's Psyche spacecraft, which is set to launch in August 2022, has been equipped with massive solar arrays that would power it to steer through outer space.", "url": "https://www.republicworld.com/science/space/nasas-psyche-spacecraft-gets-equipped-with-solar-arrays-that-can-power-4-houses-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jicxvuiqyzsizbej_1646734729.jpeg", "publishedAt": "2022-03-08T10:44:00Z", "content": "NASA's Psyche spacecraft, which is set to launch later this year, has been equipped with massive solar arrays that would power it to steer through outer space. The latest development has pushed the s… [+1928 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Hibernating Marmots Able To Halt Aging Process - Technology Networks", "description": "During hibernation, yellow-bellied marmots undergo metabolic suppression, which  allows them to save energy. At the same time, epigenetic aging stops.", "url": "https://www.technologynetworks.com/neuroscience/news/hibernating-marmots-able-to-halt-aging-process-359344", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359344/hibernating-marmots-able-to-halt-aging-process-359344-640x360.jpg?cb=20220308", "publishedAt": "2022-03-08T09:54:21Z", "content": "What if you were told there was a completely natural way to stop your body from aging? The trick: Youd have to hibernate from September to May each year.\r\nThats what a team of UCLA biologists and col… [+5180 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Physicists publish on X-ray lasers taking pictures of complex molecules — ScienceDaily - Verve Times", "description": "Kansas State University physicists Daniel Rolles and Artem Rudenko, and their graduate student, Xiang Li, are part of an international research team that has published the article \"X-ray multiphoton-induced Coulomb explosion images complex single mol", "url": "https://vervetimes.com/physicists-publish-on-x-ray-lasers-taking-pictures-of-complex-molecules-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T09:48:32Z", "content": "Kansas State University physicists Daniel Rolles and Artem Rudenko, and their graduate student, Xiang Li, are part of an international research team that has published the article “X-ray multiphoton-… [+4076 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/TechExplorist/", "title": "Astronomers discover the largest molecule yet in a planet-forming disc - Tech Explorist", "description": "Using the Atacama Large Millimeter/submillimeter Array (ALMA) in Chile, researchers at Leiden Observatory in the Netherlands have for the first time", "url": "https://www.techexplorist.com/astronomers-discover-largest-molecule-yet-planet-forming-disc/45147/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/Dimethyl-ether-IRS-48-star-scaled.jpg", "publishedAt": "2022-03-08T09:33:22Z", "content": "Using the Atacama Large Millimeter/submillimeter Array (ALMA) in Chile, researchers at Leiden Observatory in the Netherlands have for the first time detected dimethyl ether in a planet-forming disc. … [+5368 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Curiosity rover spotted a beautiful “flower” on Mars - The Times Hub", "description": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens. Despite the fact that this object is very similar to terrestrial coral, it is …", "url": "https://thetimeshub.in/curiosity-rover-spotted-a-beautiful-flower-on-mars", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/03/rover-curiosity-zafiksiroval-krasivyj-cvetok-na-marse-28e0336.jpg", "publishedAt": "2022-03-08T09:30:05Z", "content": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens.\r\nDespite the fact … [+1380 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "US Wants To Send A Satellite To Patrol The Space Around Moon - Indiatimes.com", "description": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military capabilities to monitor the space beyond between Earth and Mo…", "url": "https://www.indiatimes.com/technology/science-and-future/us-satellite-to-patrol-moon-563914.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage11-copy_6227156dc6715.jpg", "publishedAt": "2022-03-08T08:39:21Z", "content": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military c… [+1864 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Biologists observe a molecular 'hand-off' that plays a key role in reproduction - Phys.org", "description": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.", "url": "https://phys.org/news/2022-03-biologists-molecular-hand-off-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sperm.jpg", "publishedAt": "2022-03-08T07:44:09Z", "content": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.\r\nNearly 20% of couples in the United States fail to conceive n… [+4042 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "This SUV-sized spacecraft will find if Jupiter's icy Moon Europa has conditions for life - India Today", "description": "When fully assembled, this spacecraft will be as large as an SUV with solar arrays long enough to span a basketball court.", "url": "https://www.indiatoday.in/science/story/nasa-europa-clipper-mission-jupiter-conditions-for-life-1922035-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Europa_Clipper-647x363.jpeg?J_nbAYnhe1NLTFQselNG4aTyBqX9tNBO", "publishedAt": "2022-03-08T05:14:20Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Scientists open 50-year-old sample from Moon to study lunar conditions before sending humans back - India Today", "description": "The samples had remained locked so far after it was collected and sealed in the vacuum of the Moon by Apollo 17 astronauts.", "url": "https://www.indiatoday.in/science/story/nasa-moon-mission-artemis-lunar-surface-sample-minerals-1922016-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Moon_sample-647x363.jpeg?6oAyMogHkHJXasb.xOtz_XBWdVmxNz3V", "publishedAt": "2022-03-08T04:44:08Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study identifies two types of brain cells involved in organizing discrete memories - News-Medical.Net", "description": "Researchers have identified two types of cells in our brains that are involved in organizing discrete memories based on when they occurred.", "url": "https://www.news-medical.net/news/20220307/Study-identifies-two-types-of-brain-cells-involved-in-organizing-discrete-memories.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-03-08T03:49:00Z", "content": "Researchers have identified two types of cells in our brains that are involved in organizing discrete memories based on when they occurred. This finding improves our understanding of how the human br… [+6591 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "Statesman News Service", "title": "Indian scientists inch closer to unraveling mystery behind high temperature in solar atmosphere - The Statesman", "description": "The scientists found that the jets are kept intact against instabilities by the magnetic field in the Sun, and by the polymer chains in the polymeric solution respectively.", "url": "https://www.thestatesman.com/technology/indian-scientists-inch-closer-unraveling-mystery-behind-high-temperature-solar-atmosphere-1503050570.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/10/d3860d993330207befb10bf23b02d879.jpg", "publishedAt": "2022-03-08T02:23:32Z", "content": "In a major step towards unraveling the mystery behind the heating up of the solar atmosphere, Indian scientists have decoded the science behind the jets of plasma, the fourth state of matter consisti… [+3754 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Increasing frequency of El Niño events expected by 2040 - Science Daily", "description": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.", "url": "https://www.sciencedaily.com/releases/2022/03/220307113147.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T01:42:58Z", "content": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.El Niño -- the unusual warming of surface waters in the eastern tropical Pacific Ocean … [+1925 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Physicists discover method for emulating nonlinear quantum electrodynamics in a laboratory setting - Science Daily", "description": "On the big screen, in video games and in our imaginations, lightsabers flare and catch when they clash together. That clashing, or interference, happens only in fiction -- and in places with enormous magnetic and electric fields, which happens in nature only …", "url": "https://www.sciencedaily.com/releases/2022/03/220307162024.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-07T22:16:27Z", "content": "On the big screen, in video games and in our imaginations, lightsabers flare and catch when they clash together. In reality, as in a laser light show, the beams of light go through each other, creati… [+2424 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kelsey Simpkins", "title": "Expedition to highest active volcano seeks to unearth clues about life on other worlds - Phys.org", "description": "A harsh sun shines down through a cloudless sky, across a vast and unforgiving landscape. It's covered in gray rock, giant ice sculptures and expansive fields of spiky, yellow and orange bushes. In the distance, intimidating mountain peaks dominate the desola…", "url": "https://phys.org/news/2022-03-highest-volcano-unearth-clues-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/expedition-to-highest.jpg", "publishedAt": "2022-03-07T21:32:35Z", "content": "A harsh sun shines down through a cloudless sky, across a vast and unforgiving landscape. It's covered in gray rock, giant ice sculptures and expansive fields of spiky, yellow and orange bushes. In t… [+7331 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Rain Jordan", "title": "Tuataras: Fossil Discovery Reveals Secrets About the Mysterious Reptile - Nature World News", "description": "These spiny reptiles, however, are not lizards. Instead, they are the last survivors of the Rhynchocephalians, an enigmatic and ancient order of reptiles that mainly perished during their heyday in the Jurassic period.", "url": "https://www.natureworldnews.com/articles/49776/20220307/tuataras-fossil-discovery-reveals-secrets-mysterious-reptile.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/58588/tuatara.jpg", "publishedAt": "2022-03-07T19:24:08Z", "content": "Tuatara in New Zealand resembles dismal iguanas. These spiny reptiles, however, are not lizards. Instead, they are the last survivors of the Rhynchocephalians, an enigmatic and ancient order of repti… [+4337 chars]"}, {"source": {"id": null, "name": "Nsf.gov"}, "author": null, "title": "Astronomers find second known Earth Trojan asteroid | NSF - National Science Foundation", "description": "Newly discovered 2020 XL5 dwarfs other known Earth Trojan asteroid", "url": "https://www.nsf.gov/discoveries/disc_summ.jsp?cntn_id=304600", "urlToImage": "https://www.nsf.gov/news/mmg/media/images/trojan_asteroid_f.jpg", "publishedAt": "2022-03-07T18:57:17Z", "content": "Research NewsNewly discovered 2020 XL5 dwarfs other known Earth Trojan asteroid\r\nAstronomers confirm second Earth Trojan asteroid\r\nMarch 7, 2022\r\nAn international team of astronomers observed 2020 XL… [+1962 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Rain Jordan", "title": "Experts Warn How Powerful Solar Storms Can Possible Destroy Satellites - Nature World News", "description": "SpaceX deployed 49 satellites as part of Elon Musk's Starlink internet project on Feb. 4, 2022, with most of them burning up in the atmosphere days later. A geomagnetic storm induced by the Sun was the cause of this more than $50 million disaster.", "url": "https://www.natureworldnews.com/articles/49775/20220307/experts-warn-powerful-solar-storms-possible-destroy-satellites.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/57882/solar-storm.jpg", "publishedAt": "2022-03-07T18:52:36Z", "content": "SpaceX deployed 49 satellites as part of Elon Musk's Starlink internet project on Feb. 4, 2022, with most of them burning up in the atmosphere days later. A geomagnetic storm induced by the Sun was t… [+6104 chars]"}, {"source": {"id": null, "name": "Nsf.gov"}, "author": null, "title": "Cyanide gas and the chemistry of evolving life - National Science Foundation", "description": "Cyanide could have enabled metabolic reactions, creating carbon-based compounds", "url": "https://www.nsf.gov/discoveries/disc_summ.jsp?cntn_id=304599", "urlToImage": "https://www.nsf.gov/news/mmg/media/images/cyanide_earlyearth_f.jpg", "publishedAt": "2022-03-07T18:23:26Z", "content": "Research NewsCyanide could have enabled metabolic reactions, creating carbon-based compounds\r\nChemists theorize that cyanide gas reactions on early Earth enabled life.\r\nMarch 7, 2022\r\nBillions of yea… [+1974 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Tiny worms make complex decisions, too: Scientists surprised to discover flexible decision-making capabilities in a worm with just 302 neurons - Science Daily", "description": "How does an animal make decisions? Scientists have spent decades trying to answer this question by focusing on the cells and connections of the brain that might be involved. Scientists are taking a different approach -- analyzing behavior, not neurons. They w…", "url": "https://www.sciencedaily.com/releases/2022/03/220307113024.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-07T17:08:08Z", "content": "How does an animal make decisions? Scientists have spent decades trying to answer this question by focusing on the cells and connections of the brain that might be involved. Salk scientists are takin… [+3058 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers take 'heartbeat' of black hole - Phys.org", "description": "A black hole gets a large corona before it emits jets. This is revealed, among other things, by the heartbeat graph that an international team of astronomers has made of a black hole and a star orbiting around each other. The team, led by Mariano Méndez from …", "url": "https://phys.org/news/2022-03-astronomers-heartbeat-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-take-heart-1.jpg", "publishedAt": "2022-03-07T16:19:37Z", "content": "A black hole gets a large corona before it emits jets. This is revealed, among other things, by the heartbeat graph that an international team of astronomers has made of a black hole and a star orbit… [+3352 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Exploring when a protein's prone to wander - Phys.org", "description": "Exactly how proteins interact with solid surfaces is a concern for health care manufacturers who design drugs, make biosensors or develop anti-fouling materials.", "url": "https://phys.org/news/2022-03-exploring-protein-prone.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/closer-look-helps-rice.jpg", "publishedAt": "2022-03-07T16:00:38Z", "content": "Exactly how proteins interact with solid surfaces is a concern for health care manufacturers who design drugs, make biosensors or develop anti-fouling materials.\r\nThe mechanisms that control these in… [+4178 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "How to save the International Space Station and prevent the dreaded “gap” - Ars Technica", "description": "Unity in space remains in the best interest of the international partners.", "url": "https://arstechnica.com/science/2022/03/how-to-save-the-international-space-station-and-prevent-the-dreaded-gap/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/51814201006_e93b98b15e_k-1-760x380.jpg", "publishedAt": "2022-03-07T15:28:58Z", "content": "Enlarge/ The International Space Station is pictured from the SpaceX Crew Dragon Endeavour during a fly around of the orbiting lab that took place following its undocking on Nov. 8, 2021. \r\n151 with … [+6515 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kara Headley", "title": "New insight on the source/sink balance of cyanobacteria - Phys.org", "description": "A new study from the Michigan State University-DOE Plant Research Laboratory (PRL) brings fresh insight on the source/sink balance of cyanobacteria and paves the way for further advancements in photosynthetic microbes for potential applications.", "url": "https://phys.org/news/2022-03-insight-sourcesink-cyanobacteria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cyanobacteria-balancin.jpg", "publishedAt": "2022-03-07T15:04:13Z", "content": "A new study from the Michigan State University-DOE Plant Research Laboratory (PRL) brings fresh insight on the source/sink balance of cyanobacteria and paves the way for further advancements in photo… [+3311 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble captures energetic outburst from infant star - Devdiscourse", "description": "Read more about Hubble captures energetic outburst from infant star on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1952465-hubble-captures-energetic-outburst-from-infant-star", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_03_2022_20_01_44_0229428.jpg?width=920&format=jpeg", "publishedAt": "2022-03-07T14:33:05Z", "content": "The NASA/ESA Hubble Space Telescope has captured a stunning image of an energetic outburst from a very young star, resulting in a colourful wispy structure called Herbig–Haro objects.\r\nThe image shar… [+1707 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "New Study Confirms CO2 Can Be Stored Below Ocean Floor Sediments - AZoCleantech", "description": "Climate change is one of the most unrelenting challenges that humanity needs to handle.", "url": "https://www.azocleantech.com/news.aspx?newsID=31275", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31275_16466524647984810.jpg", "publishedAt": "2022-03-07T13:55:00Z", "content": "Climate change is one of the most unrelenting challenges that humanity is facing. To fight its potentially disastrous effects, researchers are looking for innovative technologies that could help the … [+5348 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Astronomers scan 800 pulsars to see if any of them have planets - Verve Times", "description": "This illustration shows a pulsar with its magnetic field lines shown in blue. The beams emitting from the poles are what washes over our detectors as the dead star spins. Credit: NASA", "url": "https://vervetimes.com/astronomers-scan-800-pulsars-to-see-if-any-of-them-have-planets/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-scan-800-p.jpg", "publishedAt": "2022-03-07T12:59:03Z", "content": "This illustration shows a pulsar with its magnetic field lines shown in blue. The beams emitting from the poles are what washes over our detectors as the dead star spins. Credit: NASA\r\nAstronomers di… [+12460 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "James Webb Telescope to Study Cold Mysterious Belt of Solar System - NewsClick", "description": "The telescope will study the Kuiper Belt’s icy bodies to gather information about the universe’s origin as far as possible.", "url": "https://www.newsclick.in/James-Webb-Telescope-Study-Cold-Mysterious-Belt-Solar-System", "urlToImage": "https://www.newsclick.in/sites/default/files/2022-03/mysterios.jpg", "publishedAt": "2022-03-07T12:43:40Z", "content": "The latest, advanced and most powerful space observatory, the James Webb Space Telescope, is on a mission to gather information about the origin of the universe as far as possible. The telescope, equ… [+3173 chars]"}, {"source": {"id": null, "name": "Solidstatelightingdesign.com"}, "author": "Izer", "title": "China wants its new astronaut launch rocket to be reusable - Solid State Lighting Design", "description": "China is planning a next-generation Crew Launch Vehicle to carry out missions to its space station and the moon to have a reusable first stage.The new", "url": "https://www.solidstatelightingdesign.com/china-wants-its-new-astronaut-launch-rocket-to-be-reusable/", "urlToImage": "https://www.solidstatelightingdesign.com/wp-content/uploads/2022/03/China-wants-its-new-astronaut-launch-rocket-to-be-reusable.jpg", "publishedAt": "2022-03-07T12:41:43Z", "content": "China is planning a next-generation Crew Launch Vehicle to carry out missions to its space station and the moon to have a reusable first stage.\r\nThe new rocket will allow for a reusable launch option… [+3477 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Moon and Mars superoxides for oxygen farming - Phys.org", "description": "The dusty faces of the moon and Mars conceal unseen hazards for future explorers. Areas of highly oxidizing material could be sufficiently reactive that they would produce chemical burns on astronauts' unprotected skin or lungs. Taking inspiration from a pion…", "url": "https://phys.org/news/2022-03-moon-mars-superoxides-oxygen-farming.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/moon-and-mars-superoxi.jpg", "publishedAt": "2022-03-07T12:38:57Z", "content": "The dusty faces of the moon and Mars conceal unseen hazards for future explorers. Areas of highly oxidizing material could be sufficiently reactive that they would produce chemical burns on astronaut… [+5108 chars]"}, {"source": {"id": null, "name": "Newsnetnebraska.org"}, "author": "Karen Hines", "title": "Is space around Earth really a \"landfill\"? From the piece of the rocket that landed on the moon to the millions of debris in the \"cemetery\" orbits. Battston: \"Dangers to satellites\" - News Net Nebraska", "description": "Trento. left for Years to roam between Earth and the the moonand ended up crashing...", "url": "https://www.newsnetnebraska.org/is-space-around-earth-really-a-landfill-from-the-piece-of-the-rocket-that-landed-on-the-moon-to-the-millions-of-debris-in-the-cemetery-orbits-battston-dangers-to-satellites/", "urlToImage": null, "publishedAt": "2022-03-07T10:48:26Z", "content": "Trento. left for Years to roam between Earth and the the moonand ended up crashing in recent days (at least after expectations Scientists) against the Our satellite: It might be part of a file booste… [+6193 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How the Placement of a Gene Affects Its Expression - Technology Networks", "description": "Genomes are made up of thousands of individual pieces – genes – which are expressed at different levels. Researchers at EMBL have shed light on how the placement of a gene affects its expression, as well as that of its neighbours.", "url": "https://www.technologynetworks.com/genomics/news/how-the-placement-of-a-gene-affects-its-expression-359307", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359307/how-the-placement-of-a-gene-affects-its-expression-359307-640x360.jpg?cb=20220307", "publishedAt": "2022-03-07T10:22:38Z", "content": "The celebrated physicist Richard Feynman is credited with the quote, What I cannot create, I do not understand. As well as informing Feynmans approach to theoretical physics, its a good way of descri… [+6633 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "T-Rex Should be Divided into Three Species, Say These Researchers - News18", "description": "The study, led by paleontologist Gregory Paul, points out that the variations of about three dozen fossils indicated that two additional species deserved separate recognition.", "url": "https://www.news18.com/news/buzz/t-rex-should-be-divided-into-three-species-say-these-researchers-4845917.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-2022-03-07t154732.914-164664833316x9.jpg", "publishedAt": "2022-03-07T10:21:59Z", "content": "Tyrannosaurus, more popularly known as T-Rex, is possibly one of the most recognisable dinosaur species. The giant skeletons of this ancient animal that walked the surface of earth millions of years … [+2124 chars]"}, {"source": {"id": null, "name": "Pro-gamer.co.uk"}, "author": "Nicola Dixon", "title": "Watch this cool highlights video of ULA’s Atlas V launch - ProGamer", "description": "Following final week’s launch of a next-generation climate satellite tv for pc for the Nationwide Oceanic and Atmospheric Administration (NOAA), ... Read moreWatch this cool highlights video of ULA’s Atlas V launch", "url": "https://www.pro-gamer.co.uk/watch-this-cool-highlights-video-of-ulas-atlas-v-launch/", "urlToImage": null, "publishedAt": "2022-03-07T09:09:30Z", "content": "Following final weeks launch of a next-generation climate satellite tv for pc for the Nationwide Oceanic and Atmospheric Administration (NOAA), United Launch Alliance (ULA) has shared a cool video of… [+1693 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "What is a kilonova whose remains have just been revealed for the first time? - Tech News Inc", "description": "By studying the signal of GW170817 from the merger of two neutron stars and the result, among other things, in a kilonova, a team of astronomers indicates", "url": "https://technewsinc.com/what-is-a-kilonova-whose-remains-have-just-been-revealed-for-the-first-time/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/f/f/4/ff4d3cf12c_50187061_etoile-neutrons-collision.jpg", "publishedAt": "2022-03-07T08:31:40Z", "content": "By studying the signal of GW170817 from the merger of two neutron stars and the result, among other things, in a kilonova, a team of astronomers indicates the unique nature of this phenomenon, includ… [+3576 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA expands research into mining lunar ice, minerals to sustain humans on the moon - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-03-07T07:00:06Z", "content": ""}, {"source": {"id": null, "name": "Stardate.org"}, "author": null, "title": "Passing the Test | StarDate Online - Stardate.org", "description": "The more scientists try to break down Albert Einstein’s theory of gravity, the stronger it looks. An experiment that kept an eye on a pair of extreme dead stars, for example, confirmed several of its predictions.The theory is General Relativity. Einstein pres…", "url": "https://stardate.org/radio/program/2022-03-07", "urlToImage": null, "publishedAt": "2022-03-07T06:30:16Z", "content": "The more scientists try to break down Albert Einsteins theory of gravity, the stronger it looks. An experiment that kept an eye on a pair of extreme dead stars, for example, confirmed several of its … [+1246 chars]"}]}