{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Kepler telescope glimpses a free-floating planet population - Space Bollyinside - BollyInside", "description": "During this two-month campaign, Kepler monitored a crowded field of millions of stars near the centre of our Galaxy every 30 minutes in order to find rare", "url": "https://www.bollyinside.com/news/the-kepler-telescope-glimpses-a-free-floating-planet-population", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-06T01:31:34Z", "content": "During this two-month campaign, Kepler monitored a crowded field of millions of stars near the centre of our Galaxy every 30 minutes in order to find rare gravitational microlensing events. The study… [+3107 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Mars helicopter ingenuity successfully completes 9th, most challenging flight - NASA - United News of India", "description": "Washington, Jul 6 (UNI/Sputnik) The Ingenuity Mars helicopter has successfully completed its ninth and most challenging mission so far, NASA''s Jet Propulsion Laboratory reported on Monday.", "url": "http://www.uniindia.com/~/mars-helicopter-ingenuity-successfully-completes-9th-most-challenging-flight--nasa/World/news/2440935.html", "urlToImage": "", "publishedAt": "2021-07-06T00:37:00Z", "content": "More News06 Jul 2021 | 7:07 AMParis, Jul 6 (UNI/Sputnik) The French Senate on Monday voted to adopt the changed version of the draft article of the constitution on climate change, effectively removin… [+1060 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The university reaches the stars with a new master's program - Space Bollyinside - BollyInside", "description": "The interdisciplinary programme starts in September and will give students an informed understanding of planetary atmospheres and landforms, space", "url": "https://www.bollyinside.com/news/the-university-reaches-the-stars-with-a-new-masters-program", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-05T22:33:12Z", "content": "The interdisciplinary programme starts in September and will give students an informed understanding of planetary atmospheres and landforms, space environment and remote sensing, as well as data anal… [+2849 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Technology that restores touch to damaged nerves - SwordsToday.ie", "description": "New technology from the University of Tel Aviv will help people who have lost touch to the nerves of various organs due to amputation or injury. The", "url": "https://swordstoday.ie/technology-that-restores-touch-to-damaged-nerves/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/07/Technology-that-restores-touch-to-damaged-nerves.jpg", "publishedAt": "2021-07-05T22:07:30Z", "content": "New technology from the University of Tel Aviv will help people who have lost touch to the nerves of various organs due to amputation or injury. The technology tested in the model animal includes a s… [+4084 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Is the trout on the moon? | science | news - Space Bollyinside - BollyInside", "description": "For his part, UQTR researcher and freshwater fish specialist Pierre Magnan also noted the moon’s effect on the behavior of trout (or “trout,” as it is", "url": "https://www.bollyinside.com/news/is-the-trout-on-the-moon-science-news", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-05T21:53:22Z", "content": "For his part, UQTR researcher and freshwater fish specialist Pierre Magnan also noted the moons effect on the behavior of trout (or trout, as it is often called). Be careful, he cautions, this is sti… [+3088 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA Appoints Vanessa Wyche and Janet Petro to Leadership Positions at Johnson and Kennedy Space Centers - Space Bollyinside - BollyInside", "description": "“I’m humbled and honored to be chosen to lead the more than 10,000 employees at Johnson Space Center, who work each day to enhance scientific and", "url": "https://www.bollyinside.com/news/nasa-appoints-vanessa-wyche-and-janet-petro-to-leadership-positions-at-johnson-and-kennedy-space-centers", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-05T21:39:02Z", "content": "Im humbled and honored to be chosen to lead the more than 10,000 employees at Johnson Space Center, who work each day to enhance scientific and technological knowledge via space exploration to benefi… [+3868 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Cristian Antonescu", "title": "Star Cluster Contains Oversized Black Hole Population - Optic Flux", "description": "Astronomers already knew that Palomar 5 is a unique star cluster, and it’s located over 75,000 light-years away from Earth. While trying to understand the source of the cluster’s unique features, an international team of scientists led by the University of Ba…", "url": "https://www.opticflux.com/star-cluster-contains-oversized-black-hole-population/8342/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/02/black-holes-1.jpg", "publishedAt": "2021-07-05T20:27:53Z", "content": "Astronomers already knew that Palomar 5 is a unique star cluster, and its located over 75,000 light-years away from Earth. While trying to understand the source of the clusters unique features, an in… [+1590 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "UAE’s Hope Mars Mission captures new photos of Mars' auroras, shares images - Hindustan Times", "description": "While taking pictures of the auroras was not part of the core observations planned for the Hope probe, its high-altitude orbit has enabled it to capture a global view of the night side of Mars too. | World News", "url": "https://www.hindustantimes.com/world-news/uaes-hope-mars-mission-captures-new-photos-of-mars-auroras-shares-images-101625508154120.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/05/1600x900/Artist’s_impression_Mars’_discrete_aurora_02_93ae2db495_1625508493352_1625508506102.png", "publishedAt": "2021-07-05T18:14:34Z", "content": "The United Arab Emirates (UAE) Mars probe has captured never-before-imaged pictures of auroras around the Red Planet and the countrys space agency shared those photographs. These three images of atom… [+2535 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Lakes under Mars’ South Pole may not be real - Times of India", "description": "US News: NEW YORK: Subsurface lakes found under Mars' south pole, using data from the European Space Agency's Mars Express orbiter, may not really be lakes at .", "url": "https://timesofindia.indiatimes.com/world/us/lakes-under-mars-south-pole-may-not-be-real/articleshow/84152934.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-84152996,width-1070,height-580,imgsize-15144,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-07-05T17:52:00Z", "content": "Lakes under Mars South Pole may not be real"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Göttingen: Ancestors decorated bones over 50,000 years ago - India Education Diary", "description": "Discovery from Unicorn Cave in Lower Saxony sheds new light on ancestors' cognitive abilitiesSince the discovery of the first fossil remains in the 19th century, the image of the Neanderthal has been one of a primitive hominin. People have known for", "url": "https://indiaeducationdiary.in/university-of-gottingen-ancestors-decorated-bones-over-50000-years-ago/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/11/Gottingen-University-1024x559.jpg", "publishedAt": "2021-07-05T17:35:39Z", "content": "Discovery from Unicorn Cave in Lower Saxony sheds new light on ancestors’ cognitive abilities\r\nSince the discovery of the first fossil remains in the 19th century, the image of the Neanderthal has be… [+4171 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "Explorers Club Kicks Off 2021 Global Exploration Summit - IT News Online", "description": "Explorers Club Kicks Off 2021 Global Exploration Summit", "url": "http://www.itnewsonline.com/PRNewswire/Explorers-Club-Kicks-Off-2021-Global-Exploration-Summit/766195", "urlToImage": null, "publishedAt": "2021-07-05T16:27:14Z", "content": null}, {"source": {"id": null, "name": "Republic World"}, "author": "Kamal Joshi", "title": "‘Orphan cloud’ bigger than the entire Milky Way discovered in galaxy ‘no-man’s land’ - Republic World", "description": "The University of Alabama in Huntsville (UAH) found a lonely cloud bigger than the Milky Way. The massive cloud was discovered in Leo Cluster (Abell 1367).", "url": "https://www.republicworld.com/technology-news/science/orphan-cloud-bigger-than-the-entire-milky-way-discovered-in-galaxy-no-mans-land.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/pjxro57jja7pl8j4_1625497593.jpeg", "publishedAt": "2021-07-05T16:06:00Z", "content": "Scientists recently discovered a lonely cloud bigger than the Milky Way. Yeah! you heard it right. The University of Alabama in Huntsville (UAH) found the orphan cloud in a \"no man's land\" for galaxi… [+1626 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Solving the Mystery of Mercury’s Massive Iron Core - AZoQuantum", "description": "New research has determined that the Sun’s powerful magnetic field influenced Mercury’s core, thus showing how stars exert control over the composition of their planets. Despite being one of the solar system’s smallest planets, Mercury has been found to posse…", "url": "https://www.azoquantum.com/News.aspx?newsID=8201", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_8201_16254987164715432.jpg", "publishedAt": "2021-07-05T15:27:00Z", "content": "New research has determined that the Sun’s powerful magnetic field influenced Mercury’s core, thus showing how stars exert control over the composition of their planets. Despite being one of the sola… [+6540 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Sahil Mirani", "title": "NASA set to launch the Dynamo-2 mission to study and understand the atmospheric dynamo - Republic World", "description": "NASA has now confirmed that they will launch their Dynamo-2 mission rockets on July 6. Here is all the information to understand the latest NASA mission. Read", "url": "https://www.republicworld.com/technology-news/science/nasa-set-to-launch-the-dynamo-2-mission-to-study-and-understand-the-atmospheric-dynamo.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/n6wdxe44pds79ccp_1625496525.jpeg", "publishedAt": "2021-07-05T15:24:00Z", "content": "NASA has been constantly working on teaming up with a satellite so that this collaboration can help the scientists to study the giant electric current in Earths ionosphere. NASA is now planning to se… [+2208 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "Teens Work Out How To Fake “Positive” COVID Test Results In Viral TikTok Videos - IFLScience", "description": "A stunt that recently went viral on TikTok, inspiring a multitude of 'how-to' videos, has landed a teen in hot water after he shared a tip on how to get a", "url": "https://www.iflscience.com/health-and-medicine/teens-work-out-how-to-fake-positive-covid-test-results-in-viral-tiktok-videos/", "urlToImage": "https://cdn.iflscience.com/images/e97bf66d-21cf-5664-8ee4-cb7852d66bb8/default-1625485327-tiktokker-with-false-positive-covid-test-trick-says-trend-is-just-having-fun.jpg", "publishedAt": "2021-07-05T15:10:00Z", "content": "A stunt that recently went viral on TikTok, inspiring a multitude of \"how-to\" videos, has landed a teen in hot water after he shared a tip on how to get a COVID-19 lateral flow test give you a false … [+3237 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Ingenuity Mars Helicopter will soon make its ninth flight - Space Bollyinside - BollyInside", "description": "Fortunately for NASA and the Ingenuity team, the helicopter was able to land safely, completing its sixth test flight. A later investigation concluded", "url": "https://www.bollyinside.com/news/ingenuity-mars-helicopter-will-soon-make-its-ninth-flight", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-05T15:01:04Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Climate crisis causing male dragonflies to lose wing ‘bling’, study finds - The Guardian", "description": "Black patterns used to attract mates can cause the insects to overheat in hotter climates", "url": "https://amp.theguardian.com/environment/2021/jul/06/climate-crisis-causing-male-dragonflies-to-lose-wing-bling-study-finds", "urlToImage": null, "publishedAt": "2021-07-05T15:00:00Z", "content": "Climate changeBlack patterns used to attract mates can cause the insects to overheat in hotter climates\r\nMale dragonflies are losing the bling wing decorations that they use to entice the females as … [+4676 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "This beetle can walk upside down on the underside of a pool of water - Livescience.com", "description": "This is the first time ever that an animal has been documented performing this bizarre trick. The researchers who discovered it think studying it could lead to advancements in robotics.", "url": "https://www.livescience.com/beetle-walks-underside-surface.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jmRvPXatXyZGZc48qWVabJ-1200-80.png", "publishedAt": "2021-07-05T14:22:05Z", "content": "Walking on water is a common enough feat for insects. Water striders, for instance, are famous for exploiting surface tension to achieve it. But a totally surreal video reveals a beetle that has take… [+3450 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "A tiny satellite with a solar sail could be built rapidly to catch interstellar objects - Daily Mail", "description": "A tiny satellite could be built in short order to catch and study other interstellar objects, according to a new study. The combination of a cube satellite and lightsail could rendezvous with the object.", "url": "https://www.dailymail.co.uk/sciencetech/article-9757233/A-tiny-satellite-solar-sail-built-rapidly-catch-interstellar-objects.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/07/05/15/45059115-0-image-a-4_1625494217316.jpg", "publishedAt": "2021-07-05T14:20:39Z", "content": "Experts have tried to figure out what 'Oumuamua - the mysterious object that flew into our solar system from outside of it - is, since it was discovered in 2017. \r\nAnd now a new study suggests a tiny… [+6378 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "Astronauts Conduct First Spacewalk on China's Space Station - NewsClick", "description": "In June, three astronauts aboard the Shenzhou-12 spacecraft were blasted off to the space station which they reached after a journey of over seven hours.", "url": "https://www.newsclick.in/astronauts-conduct-first-spacewalk-china-space-station", "urlToImage": "https://www.newsclick.in/sites/default/files/2021-07/ast%5Bronauts2.jpg", "publishedAt": "2021-07-05T13:29:52Z", "content": "In April this year, China successfully placed the Tiangong space station into orbit and now, for the first time, two astronauts walked outside the space station for nearly seven hours. Liu Boming and… [+3628 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Personal input in surveys can't be replaced by big data - ANI News", "description": "Munich [Germany], July 5 (ANI): Methods that focus on observations made by individuals can be useful when the analysis of digital data reaches its limits. In the context of the COVID-19 pandemic, a method called human social sensing might elicit information t…", "url": "https://www.aninews.in/news/lifestyle/quirky/personal-input-in-surveys-cant-be-replaced-by-big-data20210705183803", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Capture.JPGet45urtreerereeeeeeeeeerr-thumbnail-154x87-70.jpg", "publishedAt": "2021-07-05T13:08:00Z", "content": "Munich [Germany], July 5 (ANI): Methods that focus on observations made by individuals can be useful when the analysis of digital data reaches its limits. In the context of the COVID-19 pandemic, a m… [+3136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "NASA’s latest post on suppermassive black hole ‘tsunami’ leaves netizens intrigued - The Indian Express", "description": "With the help of computer simulations, researchers came up with a model of the tsunami-like structures and shared it on their official Instagram account. The picture is now making rounds on the internet, leaving many intrigued.", "url": "https://indianexpress.com/article/trending/trending-globally/nasa-supermassive-black-hole-tsunami-instagram-7389876/", "urlToImage": "https://images.indianexpress.com/2021/07/Trending-Card-5-1.jpg", "publishedAt": "2021-07-05T13:05:52Z", "content": "The National Aeronautics and Space Administration recently found tsunami-like eruptions in space from supermassive black holes. With the help of computer simulations, researchers came up with a model… [+692 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Explosion on Sun equivalent to millions of hydrogen bombs causes biggest solar flare in 4 years - WION", "description": "The centre of our planetary system and the source of all energy on Earth, our gigantic Sun recently made its celestial presence felt with what is being called the biggest solar flare in four years. The flare in question erupted from a sunspot called “AR2838” …", "url": "https://www.wionews.com/science/explosion-on-sun-equivalent-to-millions-of-hydrogen-bombs-causes-biggest-solar-flare-in-4-years-396003", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/07/05/201113-oof-4.jpg, 2014 shows an active region on the sun as it emitted a mid-level solar flare, peaking at 4:47 am EST on November 5, 2014\" typeof=\"foaf:Image\" />", "publishedAt": "2021-07-05T13:00:41Z", "content": "The centre of our planetary system and the source of all energy on Earth, our gigantic Sun recently made its celestial presence felt with what is being called the biggest solar flare in four years. T… [+1932 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Marie Claire Dorking", "title": "Plastic planet: How ocean waste has 'changed earth forever' - Yahoo Entertainment", "description": "Scientists say the impact plastic is having on the environment has now reached a tipping point.", "url": "https://www.yahoo.com/entertainment/plastic-in-oceans-changed-planet-forever-124711633.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/fnWWE_QT1b.djf9d1MeqBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-uploaded-images/2021-07/cf0cdeb0-dd88-11eb-b47f-016f838238dc", "publishedAt": "2021-07-05T12:47:11Z", "content": "New research has revealed the plastic in our oceans may have changed the planet forever. (Getty Images)\r\nWe all know that plastic = bad. But do we realise quite how bad? The plastic in our oceans may… [+7476 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "The smallest and most massive white dwarf ever discovered - Tech Explorist", "description": "The white dwarf is so massive that it might collapse.", "url": "https://www.techexplorist.com/smallest-most-massive-white-dwarf-ever-discovered/39939/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/07/white-dwarf.jpg", "publishedAt": "2021-07-05T12:02:55Z", "content": "Astronomers have recently discovered an incredibly dense white dwarf: about the size of a moon with a mass similar to the Sun. This newly discovered white dwarf is the smallest and most massive white… [+2337 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Tübingen: The inner beauty of the hailstone - India Education Diary", "description": "Hailstorms recently sparked memories of the devastating storm of 2013. At that time, damage amounting to billions was caused, the damage from the most recent storms is still being recorded. Despite all the annoyance that hailstones mean for people, t", "url": "https://indiaeducationdiary.in/university-of-tubingen-the-inner-beauty-of-the-hailstone/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/01/Library-University-of-Tubingen-Germany-1024x768.jpg", "publishedAt": "2021-07-05T11:50:38Z", "content": "Hailstorms recently sparked memories of the devastating storm of 2013. At that time, damage amounting to billions was caused, the damage from the most recent storms is still being recorded. Despite a… [+2293 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "How NASA`s DART mission aims to crash an unmanned spacecraft against asteroid in `defensive test` - WION", "description": "NASAs superlative new project known as Double Asteroid Redirection Test (DART) aims to demonstrate the kinetic impactor technique to change the motion of an asteroid in space heading towards the Earth.", "url": "https://www.wionews.com/science/how-nasas-dart-mission-aims-to-crash-an-unmanned-spacecraft-against-asteroid-in-defensive-test-395963", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/02/08/181728-untitled-design-2.jpg", "publishedAt": "2021-07-05T11:47:38Z", "content": "NASA's superlative new project known as Double Asteroid Redirection Test (DART) aims to demonstrate the kinetic impactor technique to change the motion of an asteroid in space heading towards the Ear… [+1755 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "ETH Zürich researchers have observed a crystal composed exclusively of electrons - SlashGear", "description": "A team of researchers at ETH Zürich was able to observe a unique crystal. Scientists at ETH Zürich have announced that they have successfully observed a crystal made up completely of electrons. The…", "url": "https://www.slashgear.com/eth-zurich-researchers-have-observed-a-crystal-composed-exclusively-of-electrons-05681053/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/07/eth-wigner-crystal.jpg", "publishedAt": "2021-07-05T11:09:00Z", "content": "A team of researchers at ETH Zürich was able to observe a unique crystal. Scientists at ETH Zürich have announced that they have successfully observed a crystal made up completely of electrons. The c… [+1814 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Europe tests parachutes responsible for slowing down its rover entering Mars at 21,000 kmph - India Today", "description": "The parachute will be responsible for slowing down the spacecraft after it successfully passes through the Martian atmosphere before landing on the surface.", "url": "https://www.indiatoday.in/science/story/exomars-mission-european-space-agency-parachute-drop-test-1824114-2021-07-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/Parachute-647x363.jpeg?jx.ZsZvBHyYnfKj7qq2ArFag4_XVLixQ", "publishedAt": "2021-07-05T10:52:26Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aswathi Pacha", "title": "New beetle species discovered in fossilised poop of dinosaur ancestor - The Indian Express", "description": "It was over two meters long including a long tail and neck, weighed perhaps between 15 and 20 kilos, and was a slender agile animal.", "url": "https://indianexpress.com/article/technology/science/new-beetle-species-discovered-in-fossilised-poop-of-dinosaur-ancestor/", "urlToImage": "https://images.indianexpress.com/2021/07/new_beetle-species.jpg", "publishedAt": "2021-07-05T10:46:18Z", "content": "Researchers have discovered a 230-million-year-old beetle species by scanning a specimen of fossilised feces, or coprolites in Poland.  The findings were published last week in Current Biology.\r\nMart… [+2424 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "NASA Hubble Shares Image Of Fireworks Galaxy ‘Caldwell 12’ To Celebrate Fourth Of July! - Mashable India", "description": "The National Aeronautics and Space Administration (NASA) recently shared an image of a spiral galaxy Caldwell 12 that’s nicknamed the “Fireworks Galaxy”. The image has been shared by NASA Hubble’s official Instagram account and has received over 95,000 likes …", "url": "https://in.mashable.com/science/23314/nasa-hubble-shares-image-of-fireworks-galaxy-caldwell-12-to-celebrate-fourth", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/27870/27870_c83a.jpg", "publishedAt": "2021-07-05T10:19:32Z", "content": "The National Aeronautics and Space Administration (NASA) recently shared an image of a spiral galaxy Caldwell 12 thats nicknamed the Fireworks Galaxy. The image has been shared by NASA Hubbles offici… [+1814 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Tackling the Dangers of Air Pollution in the Construction Industry - AZoM", "description": "AZoM speaks to David Moulton, UK Managing Director at Camfil, about the company's air filtration solutions and how they help to provide a safer working environment for those in the construction industry.", "url": "https://www.azom.com/article.aspx?ArticleID=20545", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/Article_Images/ImageForArticle_20545_16254701085081499.jpg", "publishedAt": "2021-07-05T09:28:00Z", "content": "AZoM speaks to David Moulton, UK Managing Director at Camfil, about the company's air filtration solutions and how they help to provide a safer working environment for those in the construction indus… [+6388 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Lucy Harding", "title": "We solved the mystery of why some fish are warm-blooded - The Conversation UK", "description": "Warm-blooded fish can swim 1.6 times faster than their cold-blooded relatives.", "url": "https://theconversation.com/we-solved-the-mystery-of-why-some-fish-are-warm-blooded-163774", "urlToImage": "https://images.theconversation.com/files/409349/original/file-20210701-23-17arsjf.jpg?ixlib=rb-1.1.0&rect=131%2C685%2C3615%2C1804&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-07-05T09:17:21Z", "content": "For over 50 years now, scientists have known that, despite their reputation, not all fish are cold-blooded. Some shark and tuna species, the white shark and the Atlantic bluefin tuna, have evolved th… [+3455 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "Airbus-built European Robotic Arm ready for Space - Geospatial World", "description": "Airbus space engineers have installed ESA’s European Robotic Arm (ERA) onto the Russian Multipurpose Laboratory Module (MLM) and it is now ready for its flight to the International Space Station (ISS). Together with this module, known as ‘Nauka’, ERA and its …", "url": "http://data.wordlift.io/wl01287/post/airbus-built_european_robotic_arm_ready_for_space", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2020/11/airbus_2.png", "publishedAt": "2021-07-05T09:08:21Z", "content": "Airbus space engineers have installed ESAs European Robotic Arm (ERA) onto the Russian Multipurpose Laboratory Module (MLM) and it is now ready for its flight to the International Space Station (ISS)… [+2248 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Lunar Exploration as a Service: From landers to spacesuits, NASA is renting rather than owning - SpaceNews", "description": "NASA’s Human Landing System program is the biggest bet the agency has made on the commercial space industry since the commercial crew program a decade ago.", "url": "https://spacenews.com/?p=116130", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/06/SpaceX-Starship-HLS-lander-on-moon.jpg", "publishedAt": "2021-07-05T09:01:56Z", "content": "NASAs Human Landing System (HLS) program is the biggest bet the agency has made on the commercial space industry since the commercial crew program a decade ago. NASA decided to procure landing servic… [+11268 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "NASA’s Perseverance Rover Is Self-Driving On Mars With Enhanced Auto-Navigation System - Mashable India", "description": "NASA’s Perseverance rover is exploring the red planet with a new auto-navigation system that lets it drive by itself.", "url": "https://in.mashable.com/science/23311/nasas-perseverance-rover-is-self-driving-on-mars-with-enhanced-auto-navigation-system", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/27867/27867_nzn6.jpg", "publishedAt": "2021-07-05T07:30:39Z", "content": "It has recently come to light that NASAs Perseverance rover is exploring the red planet with a new auto-navigation system that lets it drive by itself. NASA announced that its Perseverance rover is b… [+1945 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Revealing the actual shape of the Universe using AI - Tech Explorist", "description": "A powerful new tool for analyzing big data from current and planned astronomy surveys.", "url": "https://www.techexplorist.com/revealing-actual-shape-of-the-universe-using-ai/39924/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/07/AI-driven-data-analysis.jpg", "publishedAt": "2021-07-05T06:40:14Z", "content": "What is the shape of our Universe?\r\nAs indicated by Einstein’s theory of General Relativity, space itself can be curved by mass. Thus, the density of the Universe- how much mass it has spread over it… [+2412 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler", "title": "After 140 Years, Biologists Have 'Resurrected' The Genus of These Weird Yellow Cells - ScienceAlert", "description": "Deep in the tissues of sea anemones, corals, and jellyfish are strange yellow cells which are genetically distinct from the marine animals.", "url": "https://www.sciencealert.com/in-1882-a-scientist-found-some-weird-yellow-cells-now-researchers-have-resurrected-their-genus", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/tejp_a_1914863_f0002_oc-cropped-again_1024.jpg", "publishedAt": "2021-07-05T06:37:48Z", "content": "Deep in the tissues of sea anemones, corals, and jellyfish are strange yellow cells which are genetically distinct from the marine animals.\r\nMore than a century after these cells were first assigned … [+2858 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Away from Earth, this 20-year-long experiment peeks into an invisible world living among us - India Today", "description": "The experiment aims to look into the workings of some of the complex phenomena such as how objects melt, waves form in fluids and currents change at the atomic level.", "url": "https://www.indiatoday.in/science/story/space-station-research-plasma-crystal-fusion-energy-physics-1823965-2021-07-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/Atom-647x363.jpeg?L_0s9qk.DLoyRcEyk633FmdOsn7tj591", "publishedAt": "2021-07-05T06:07:55Z", "content": null}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Kellen Beck", "title": "On Mars, Dust Gets Everywhere And Can Ruin Everything - Mashable India", "description": "The red planet? More like the dust planet.", "url": "https://in.mashable.com/science/23289/on-mars-dust-gets-everywhere-and-can-ruin-everything", "urlToImage": "https://sm.mashable.com/t/mashable_in/article/o/on-mars-du/on-mars-dust-gets-everywhere-and-can-ruin-everything_z643.1200.jpg", "publishedAt": "2021-07-05T05:40:00Z", "content": "Mars is dusty. Like, really dusty. And that dust may suffocate NASAs InSight mission.\r\nInSightInSight\r\n sits on the surface of Mars measuring marsquakes and observing the local weather, powering itse… [+5685 chars]"}, {"source": {"id": null, "name": "Aviationanalysis.net"}, "author": "Theodore Meeks", "title": "This will be the largest radio telescope network in the world - Aviation Analysis Wing", "description": "With infrastructure in South Africa and another in Australia, The SKAO Network of Radio Telescopes aims to be the largest network ever created إنشاؤه by", "url": "https://www.aviationanalysis.net/this-will-be-the-largest-radio-telescope-network-in-the-world/", "urlToImage": "https://www.aviationanalysis.net/wp-content/uploads/2021/07/This-will-be-the-largest-radio-telescope-network-in-the.jpg", "publishedAt": "2021-07-05T05:14:57Z", "content": "With infrastructure in South Africa and another in Australia, The SKAO Network of Radio Telescopes aims to be the largest network ever created by human. Thus, the “deeper” network of radio telescopes… [+1723 chars]"}, {"source": {"id": null, "name": "Sundayvision.co.ug"}, "author": "Leo Adkins", "title": "Earth will reach its minimum speed on July 5 - Sunday Vision", "description": "this then 5 July 2021, our planet Earth It will pass the point farthest from the sun in its orbit, reaching a minimum speed, an astronomical phenomenon", "url": "https://www.sundayvision.co.ug/earth-will-reach-its-minimum-speed-on-july-5/", "urlToImage": "https://tvazteca.brightspotcdn.com/dims4/default/913774e/2147483647/strip/true/crop/1200x630%200%20135/resize/1200x630!/quality/90/?url=https://tvazteca.brightspotcdn.com/c0/8f/455d81254c6292887f34d9779f52/tierra-velocidad-minima-5-de-julio.jpg", "publishedAt": "2021-07-05T03:46:37Z", "content": "this then 5 July 2021, our planet Earth\r\n It will pass the point farthest from the sun in its orbit, reaching a minimum speed, an astronomical phenomenon known as avioThis is tested annually between … [+2640 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Decoding electron dynamics - Chemie.de", "description": "Electron motion in atoms and molecules is of fundamental importance to many physical, biological, and chemical processes. Exploring electron dynamics within atoms and molecules is essential for un ...", "url": "https://www.chemeurope.com/en/news/1171778/decoding-electron-dynamics.html", "urlToImage": "https://rs1.chemie.de/images//157299-75.jpg", "publishedAt": "2021-07-05T03:33:13Z", "content": "Electron motion in atoms and molecules is of fundamental importance to many physical, biological, and chemical processes. Exploring electron dynamics within atoms and molecules is essential for under… [+3989 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Aubrey Clarke", "title": "Did Scientists Just See A Black Hole Swallowing a Neutron Star for the 1st Time? - Science Times", "description": "Researchers observed two new gravitational wave events in January 2020, within a span of just 10 days.", "url": "https://www.sciencetimes.com/articles/32078/20210704/did-scientists-just-see-a-black-hole-swallowing-a-neutron-star-for-the-1st-time.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/34462/galaxy-merger.jpeg", "publishedAt": "2021-07-05T02:50:47Z", "content": "Nothing, not even light, can escape the gravitational pull of black holes. Now, astronomers have discovered black holes devouring the remains of big stars on two independent occasions for the first t… [+4263 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "China's Mars rover sends 1st selfie, 'touring' group photos - IANS", "description": "The first batch of scientific images of the rover, the panoramic view of the landing site, the topography of Mars were released by the China National Space Administration (CNSA) on Friday, calling it", "url": "https://ianslive.in/news/china_s_mars_rover_sends_1st_selfie_touring_group_photos-792528/SCIENCE-AND-TECHNOLOGY/36", "urlToImage": "https://ianslive.in/upload/2021/June/12/r-1623474903202106121045032375_l.jpg", "publishedAt": "2021-07-05T00:54:17Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nBeijing, June 12 (IANS) China has revealed new images from its Zhurong rover on Mars, including a beautiful selfie of the rover next to its landing platform.\r\nThe first … [+1628 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s Falcon 9 rocket is dominating global orbital launches in 2021 - Teslarati", "description": "Less than three days after SpaceX completed its 20th successful Falcon 9 launch of 2021, a small Long March 2D rocket carried the country of China past the same 20-flight milestone. Excluding SpaceX and China, the rest of the world combined completed its 20th…", "url": "https://www.teslarati.com/spacex-falcon-9-rocket-global-orbital-launch-leader/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2021/07/Transporter-2-Falcon-9-B1060-063021-Richard-Angle-launch-3-crop-c-1024x534.jpg", "publishedAt": "2021-07-04T22:18:55Z", "content": "Less than three days after SpaceX completed its 20th successful Falcon 9 launch of 2021, a small Long March 2D rocket carried the country of China past the same 20-flight milestone.\r\nExcluding SpaceX… [+2553 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/jon-fingas", "title": "Astronauts show how CRISPR gene editing works in space - Engadget", "description": "Astronauts have successfully used CRISPR gene editing in space for the first time, paving the way for studies of how space travel affects the human body..", "url": "https://www.engadget.com/crispr-gene-editing-in-space-212255225.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/b8bc6d20-dd0a-11eb-b7ab-a19aa3446e58", "publishedAt": "2021-07-04T21:25:46Z", "content": "CRISPR gene editing is no longer confined to Earth. Astronaut Christina Koch and scientists have successfully demonstrated CRISPR-Cas9 in space for the first time, using it as part of a new technique… [+911 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "How to watch departure of SpaceX Cargo Dragon from Space Station this week - Digital Trends", "description": "This Tuesday, a SpaceX Cargo Dragon capsule will depart from the International Space Station, carrying 5,000 lbs of cargo. Here's how to watch.", "url": "https://www.digitaltrends.com/news/spacex-cargo-dragon-iss-departure-livestream/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/gmt156_11_38_for-esa_thomas-pesquet_sx22-approach-and-docking-50-500mm-cupola.jpg", "publishedAt": "2021-07-04T17:30:53Z", "content": "This Tuesday, a SpaceX Cargo Dragon capsule will depart from the International Space Station (ISS), carrying 5,000 pounds of scientific research and other cargo back to Earth. This includes the resul… [+2193 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "What’s up with the methane on Mars? Curiosity is finding out - Digital Trends", "description": "A new study hopes to unravel the mystery of methane on Mars by examining the differences in methane levels between Martian day and night.", "url": "https://www.digitaltrends.com/news/mars-methane-day-night/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/pia24173.jpg", "publishedAt": "2021-07-04T16:37:28Z", "content": "NASA’s Curiosity Mars rover took this selfie at a location nicknamed “Mary Anning” after a 19th century English paleontologist.NASA/JPL-Caltech/MSSS\r\nSomething complicated is going on with the presen… [+2852 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kiona N. Smith", "title": "Is the “Dragon Man” skull actually from a new hominin species? - Ars Technica", "description": "Homo longi's place in our extended family tree is far from settled.", "url": "https://arstechnica.com/science/2021/07/is-the-dragon-man-skull-actually-from-a-new-hominin-species/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/07/Harbin-left-and-Dali-rt-skulls-679x380.jpg", "publishedAt": "2021-07-04T14:00:34Z", "content": "Enlarge/ The Harbin skull (left) and the Dali skull (right).\r\n44 with 35 posters participating\r\nThe reported discovery of a new hominin species from China created a lot of buzz last week. Its discove… [+10154 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Mining brines from dormant volcanoes could provide the metals needed for a sustainable future - MINING.COM - MINING.com", "description": "Oxford researchers say it is possible to extract copper, gold, zinc, silver and lithium from brines trapped in porous rocks at depths of 2 kilometres below dormant volcanoes.", "url": "https://www.mining.com/mining-brines-from-dormant-volcanoes-could-provide-the-metals-needed-for-a-sustainable-future/", "urlToImage": "https://www.mining.com/wp-content/uploads/2021/07/Mining-brines-from-dormant-volcanoes-could-provide-the-metals-needed-for-a-sustainable-future.jpeg", "publishedAt": "2021-07-04T13:30:45Z", "content": "According to the team led by petrologist Jon Blundy, this trapped, subterranean brine is a potential ‘liquid ore’ containing a slew of valuable metals, including gold, lithium and several million ton… [+3417 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "NASA shares image of ‘tsunami in space' as gases escape supermassive black hole - Republic World", "description": "Strong winds driven by X-ray radiations storm out of the central region of blackhole in what’s called an ‘outflow’ that appear like the tsunami, explains NASA.", "url": "https://www.republicworld.com/technology-news/science/nasa-shares-image-of-tsunami-in-space-as-gases-escape-supermassive-black-hole.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/q6r6fk5fop7vhdp2_1625395276.jpeg", "publishedAt": "2021-07-04T11:11:00Z", "content": "In a rare discovery, scientists have found tsunami-like eruptions in space, a phenomenon that generally triggers drumbeat of waves that displace the oceanic water here on the Earth. Using the compute… [+3868 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The City of David and the sharks' teeth mystery - Phys.org", "description": "Scientists have found an unexplained cache of fossilized shark teeth in an area where there should be none—in a 2900 year old site in the City of David in Jerusalem. This is at least 80 km from where these fossils would be expected to be found. There is no co…", "url": "https://phys.org/news/2021-07-city-david-sharks-teeth-mystery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/the-city-of-david-and.jpg", "publishedAt": "2021-07-04T09:27:50Z", "content": "Scientists have found an unexplained cache of fossilized shark teeth in an area where there should be nonein a 2900 year old site in the City of David in Jerusalem. This is at least 80 km from where … [+5250 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Why science can’t resist the allure of Venus: new missions to Earth’s nearest planetary neighbour - The Guardian", "description": "With a surface hot enough to melt lead, Venus has been left alone by space agencies for a decade. Now we are about to learn more about its climate – and the chances of life on other planets", "url": "https://amp.theguardian.com/science/2021/jul/04/why-science-cant-resist-the-allure-of-venus-new-missions-to-earths-nearest-planetary-neighbour", "urlToImage": null, "publishedAt": "2021-07-04T08:00:00Z", "content": "VenusWith a surface hot enough to melt lead, Venus has been left alone by space agencies for a decade. Now we are about to learn more about its climate and the chances of life on other planets\r\nA fle… [+7548 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": "magictr", "title": "Earth's cryosphere is shrinking 87,000 km2 per year - The Saxon", "description": "Earth’s cryosphere is shrinking 87,000 km2 per year. EP The global cryosphere, all areas of frozen water on Earth, shrank by approximately 87,000 square kilometers", "url": "https://thesaxon.org/earths-cryosphere-is-shrinking-87000-km2-per-year/54070/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2021/07/earths-cryosphere-is-shrinking-87000-km2-per-year-1616d1b.jpg", "publishedAt": "2021-07-04T07:56:57Z", "content": "Earth’s cryosphere is shrinking 87,000 km2 per year.EP\r\nThe global cryosphere, all areas of frozen water on Earth, shrank by approximately 87,000 square kilometers per year on average between 1979 an… [+3141 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA rockets team up with satellites to study electric generator - WION", "description": "NASA will be launching two sounding rockets under its Dynamo-2 mission to team up with a satellite. This will help in studying the giant electric current in Earth’s ionosphere.", "url": "https://www.wionews.com/science/nasa-rockets-team-up-with-satellites-to-study-electric-generator-395696", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/09/30/162472-untitled-design-1.jpg, 2020\" typeof=\"foaf:Image\" />", "publishedAt": "2021-07-04T07:44:40Z", "content": "NASA will be launching two sounding rockets under its Dynamo-2 mission to team up with a satellite. This will help in studying the giant electric current in Earths ionosphere. \r\nScheduled to be launc… [+2323 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Here's how artificial intelligence helping astronomers learn about the universe - Hindustan Times", "description": "A research by Ashley Spindler from the department of Astrophysics, University of Hertfordshire, has thrown light on this, as reported by news agency PTI.", "url": "https://www.hindustantimes.com/science/heres-how-artificial-intelligence-helping-astronomers-learn-about-the-universe-101625382199966.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/04/1600x900/spherex_1612789356206_1612789361421_1625383959338.jpg", "publishedAt": "2021-07-04T07:44:27Z", "content": "Some of the biggest challenges of the next generation of astronomy lie in studying all the data. To take on the challenges, astronomers are turning to machine learning and artificial intelligence (AI… [+2981 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Mouse Believed to Have Gone Extinct 150 Years Ago Discovered in Australia - News18", "description": "In a recent discovery, scientists have chanced upon a species of mouse native to Australia that was thought to have extinct 150 years ago.", "url": "https://www.news18.com/news/buzz/mouse-believed-to-have-gone-extinct-150-years-ago-discovered-in-australia-3924161.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1621928603_rtx3ae7f.jpg", "publishedAt": "2021-07-04T07:14:50Z", "content": "In a recent discovery, scientists have chanced upon a species of mouse native to Australia that was thought to have extinct 150 years ago. The native species, Gould’s mice have been found to live on … [+2397 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "How Do Kids Figure Out What Words Mean? New Computer Model Has Answers - ScienceAlert", "description": "Scientists are continually discovering more about how we pick up language from the earliest ages, and a new study looks specifically at how very young children integrate different sources of information to learn new words.", "url": "https://www.sciencealert.com/new-model-may-give-us-a-better-idea-of-how-kids-pick-up-new-words", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/frog-tab-1_1024.jpg", "publishedAt": "2021-07-04T05:03:45Z", "content": "Scientists are continually discovering more about how we pick up language from the earliest ages, and a new study looks specifically at how very young children integrate different sources of informat… [+3703 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Manned mission from China to Mars with plans to build a permanently inhabited base - Space Bollyinside - BollyInside", "description": "China’s main rocket maker told in a space exploration conference that they planned for crew missions in 2033, 2035, 2037, 2040, and goes on. Prior to", "url": "https://www.bollyinside.com/news/manned-mission-from-china-to-mars-with-plans-to-build-a-permanently-inhabited-base", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-04T04:41:30Z", "content": "Chinas main rocket maker told in a space exploration conference that they planned for crew missions in 2033, 2035, 2037, 2040, and goes on. Prior to sending crew, robots will be sent to Mars to study… [+2282 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Footprints of last dinosaurs walked 110M years ago in UK found - National Herald", "description": "A team of researchers in the UK has discovered footprints from at least six different species of dinosaur -- the very last dinosaurs to walk on the UK soil 110 million years ago", "url": "https://www.nationalheraldindia.com/international/footprints-of-last-dinosaurs-walked-110m-years-ago-in-uk-found", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-06%2F0b1171ea-b2a4-49ea-8f45-856a41a74c15%2FDIno.jpg?rect=0%2C91%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-07-04T02:33:00Z", "content": "\"They were walking around close to where the White Cliffs of Dover are now - next time you're on a ferry and you see those magnificent cliffs just imagine that!\"\r\nThe footprints are from a variety of… [+712 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "China National Space Administration - Hackaday", "description": null, "url": "https://hackaday.com/tag/china-national-space-administration/", "urlToImage": "https://hackaday.com/wp-content/uploads/2020/07/hackaday-logo-with-text-opengraph-default-image.jpg", "publishedAt": "2021-06-30T14:01:38Z", "content": "China’s space program has big goals and is already starting to achieve them. Recently, the China National Space Administration has landed its first rover on Mars, and begun to explore the surface of … [+284 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "Google-owned DeepMind AI solves 50-year-old 'protein folding problem' - ETCIO.com", "description": "Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes proteins fold into.", "url": "https://cio.economictimes.indiatimes.com/news/next-gen-technologies/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem/79522424", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79522424,imgsize-10287,width-800,height-434,overlay-etcio/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem.jpg", "publishedAt": "2020-12-02T03:20:27Z", "content": "London: Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes protein… [+1804 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "Musk closer to beam cheaper Internet with new Starlink launch - ETCIO.com", "description": "SpaceX has so far delivered more than 700 of its internet-beaming satellites into space.", "url": "https://cio.economictimes.indiatimes.com/news/internet/musk-closer-to-beam-cheaper-internet-with-new-starlink-launch/77923726", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-77923726,imgsize-430792,width-800,height-434,overlay-etcio/musk-closer-to-beam-cheaper-internet-with-new-starlink-launch.jpg", "publishedAt": "2020-09-04T05:38:19Z", "content": "Florida: Elon Musk-run SpaceX on Thursday successfully sent 60 Starlink satellites into orbit aboard a Falcon 9 rocket.The two-stage Falcon 9 rocket successfully lifted off with the 12th Starlink bat… [+1476 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "India prepares quest to find a trillion-dollar nuclear fuel on the Moon - ETEnergyworld.com", "description": "This mission would solidify India’s place among the fleet of explorers racing to the moon, Mars and beyond for scientific, commercial or military gains.", "url": "https://energy.economictimes.indiatimes.com/news/power/india-prepares-quest-to-find-a-trillion-dollar-nuclear-fuel-on-the-moon/64772337", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-64772337,imgsize-53284,width-800,height-434,overlay-etenergyworld/india-prepares-quest-to-find-a-trillion-dollar-nuclear-fuel-on-the-moon.jpg", "publishedAt": "2018-06-28T02:04:24Z", "content": "New Delhi: by Anurag KotokyIndias space program wants to go where no nation has gone before - to the south side of the moon. And once it gets there, it will study the potential for mining a source of… [+5739 chars]"}]}