{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Tale of Two Telescopes: Science Operations - NASA Video", "description": "To document the Hubble Space Telescope 30th anniversary, scientists and engineers who work on both Hubble and WFIRST talk about the two telescopes' impact on...", "url": "https://www.youtube.com/watch?v=HqEqe8e2EyM", "urlToImage": "https://i.ytimg.com/vi/HqEqe8e2EyM/hqdefault.jpg", "publishedAt": "2020-04-21T17:50:01Z", "content": "To document the Hubble Space Telescope 30th anniversary, scientists and engineers who work on both Hubble and WFIRST talk about the two telescopes' impact on the past, present and future of science in episode one of our new video series, \"A Tale of Two Telesc… [+381 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Neha", "title": "Hubble probes alien comet’s chemical makeup - The Siasat Daily", "description": "Washington D.C.: Interstellar comet 2I/Borisov is providing a glimpse of another star system's planetary building blocks, using new observations from NASA's Hubble Space Telescope. Borisov is the first known comet to originate from a different star system tha…", "url": "https://www.siasat.com/hubble-probes-alien-comets-chemical-makeup-1877600/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/comet.jpg", "publishedAt": "2020-04-21T17:12:00Z", "content": "Washington D.C.: Interstellar comet 2I/Borisov is providing a glimpse of another star system’s planetary building blocks, using new observations from NASA’s Hubble Space Telescope.\r\nBorisov is the first known comet to originate from a different star system th… [+5883 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Astronomers Think Milky Way Might Be Catapulting Stars To The Outer Halo - Mashable India", "description": "A simulation developed by the scientists at the University of California, Irvine has shown that the Milky Way galaxy might be catapulting stars to its outer reaches.", "url": "https://in.mashable.com/science/13348/astronomers-think-milky-way-might-be-catapulting-stars-to-the-outer-halo", "urlToImage": "https://sm.mashable.com/t/mashable_in/photo/default/astronomers-have-estimated-a-region-of-milky-way-to-be-10-bi_skmq.1200.jpg", "publishedAt": "2020-04-21T16:56:00Z", "content": "A simulation developed by the scientists at the University of California, Irvine (UCI) has shown that the Milky Way galaxy might be catapulting stars to its outer reaches. The stars are being forced out of place outwards into the stellar halo due to supernova… [+1941 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "SpaceX returns to the launch pad, and there are a few things to watch for - Ars Technica", "description": "Third time had better be the charm.", "url": "https://arstechnica.com/science/2020/04/spacex-returns-to-the-launch-pad-and-there-are-a-few-things-to-watch-for/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/04/48052224733_0d5e7f3626_k-760x380.jpg", "publishedAt": "2020-04-21T16:29:00Z", "content": "Enlarge/ This first-stage booster previously landed three times. Can it make four on Wednesday's launch attempt?\r\n45 with 25 posters participating\r\nSpaceX has targeted Wednesday afternoon for the next launch of its Falcon 9 rocket from a pad at Kennedy Space … [+2698 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Will Dunham", "title": "Scientists observe celestial smash-up around nearby star - Reuters India", "description": "Scientists have observed what appears to be the aftermath of a violent collision between two planetary building blocks orbiting a large and luminous star, a glimpse of the type of carnage that may have been commonplace early in our solar system's history.", "url": "https://in.reuters.com/article/us-space-exploration-collision-idINKCN2232J8", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-04-21T16:27:38Z", "content": "WASHINGTON (Reuters) - Scientists have observed what appears to be the aftermath of a violent collision between two planetary building blocks orbiting a large and luminous star, a glimpse of the type of carnage that may have been commonplace early in our sola… [+2521 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Brain-Inspired Organic Memory Devices for Flexible, Wearable, Personalized Computing - SciTechDaily", "description": "Brain-inspired electronics with organic memristors offer an energy and cost-efficient platform for various AI and IoT applications. The advent of artificial intelligence, machine learning and the internet of things is expected to change modern electronics and…", "url": "https://scitechdaily.com/brain-inspired-organic-memory-devices-for-flexible-wearable-personalized-computing/", "urlToImage": "https://scitechdaily.com/images/Brain-Inspired-Organic-Memory-Device-scaled.jpg", "publishedAt": "2020-04-21T15:00:02Z", "content": "The device structure at a molecular level. The gold nanoparticles on the bottom electrode enhance the field enabling an ultra-low energy operation of the molecular device. Credit: Sreetosh Goswami, Sreebrata Goswami and Thirumalai Venky Venkatesan\r\nBrain-insp… [+2952 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sebastian Kettley", "title": "Asteroid video: Astronomer films the 4KM Asteroid OR2 due to pass Earth this month - Express.co.uk", "description": "AN ASTEROID nearly half-as-tall as Mount Everest was filmed flying through space at speeds of more than 19,000mph (30,577kmh).", "url": "https://www.express.co.uk/news/science/1271923/Asteroid-news-4KM-asteroid-OR2-video-NASA-NEO-close-approach", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1271923.jpg", "publishedAt": "2020-04-21T14:58:00Z", "content": null}, {"source": {"id": null, "name": "Dailypost.co.uk"}, "author": "Lydia Morris", "title": "Two women die after contracting Covid-19 at North Wales hospital - Daily Post", "description": "The elderly women from Rhos on Sea and Prestatyn caught coronavirus at Glan Clwyd where they were recuperating from falls", "url": "https://www.dailypost.co.uk/news/north-wales-news/two-women-die-after-contracting-18121109", "urlToImage": "https://i2-prod.dailypost.co.uk/news/north-wales-news/article18123287.ece/ALTERNATES/s1200/0_Glan-Clwyd-Hospital-Bodelwyddan-Pictured-General-view-of-the-main-entrance.jpg", "publishedAt": "2020-04-21T14:13:49Z", "content": "Two elderly women, admitted to hospital after suffering falls, contracted coronavirus and died.\r\n Eileen Jean Owen, 94, of Cambrian Drive, Rhos-on-Sea died on April 13 after catching Covid-19 at Ysbyty Glan Clwyd. \r\n Margaret Byron, 86  died at the same hospi… [+2006 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Lyrids Meteor Shower Are Here To Light Up The Night Sky! - Mashable India", "description": "This year’s annual meteor shower spectacle has already begun but it will be peaking this week on Wednesday in India between the night of 22-23 April.", "url": "https://in.mashable.com/science/13344/lyrids-meteor-shower-are-here-to-light-up-the-night-sky", "urlToImage": "https://sm.mashable.com/t/mashable_in/photo/default/meteorshower-cover_q5gt.1200.jpg", "publishedAt": "2020-04-21T13:58:00Z", "content": "The Lyrids are an annual meteor shower that was first witnessed over 2,700 years ago, making them the oldest recorded meteor showers. Since then, the meteor showers have been observed around the second half of April every year.\r\nWatch the skies &amp; time tra… [+2805 chars]"}, {"source": {"id": null, "name": "Theiet.org"}, "author": "E&T editorial staff", "title": "Polymer that degrades under ultraviolet light could solve ocean plastic pollution - E&T Magazine", "description": "A new polymer that degrades under ultraviolet radiation has been developed by Cornell University scientists and could help to deal with plastic pollution.", "url": "https://eandt.theiet.org/content/articles/2020/04/polymer-that-degrades-under-ultraviolet-light-could-solve-ocean-plastic-pollution/", "urlToImage": "https://eandt.theiet.org/media/5996/plastic-waste.jpg?crop=0,0.5078125,0,0&cropmode=percentage&width=1200&height=450&rnd=131684409310000000", "publishedAt": "2020-04-21T12:42:33Z", "content": "A new polymer that degrades under ultraviolet radiation has been developed by Cornell University scientists and could help to deal with plastic pollution.\r\n Commercial fishing contributes to about half of all floating plastic waste that ends up in the oceans.… [+1869 chars]"}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "Hemani Sheth", "title": "Newly discovered six-planet solar system can help scientists understand early days of our universe - BusinessLine", "description": "The solar system consists of a “super-earth” and five mini-Neptunes", "url": "https://www.thehindubusinessline.com/news/science/newly-discovered-six-planet-solar-system-can-help-scientists-understand-early-days-of-our-universe/article31396630.ece", "urlToImage": "https://www.thehindubusinessline.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2020-04-21T11:47:57Z", "content": "Scientists have discovered a six planet solar system orbiting around the star HD 158259, 88 light-years away that can help researchers better understand the gravitational influence and the formation of planets. \r\nThe solar system consists of a super-earth and… [+1364 chars]"}, {"source": {"id": null, "name": "Gloucestershirelive.co.uk"}, "author": "Robin Jenkins", "title": "The 12-year-old boy moving people to tears with his musical tribute to NHS heroes - Gloucestershire Live", "description": "Connor Edwards, from Milkwall, near Coleford in the Forest of Dean, shows his appreciation for health workers fighting the coronavirus by playing his cornet after the Thursday night clapping in his street", "url": "https://www.gloucestershirelive.co.uk/news/gloucester-news/12-year-old-boy-moving-4063628", "urlToImage": "https://i2-prod.gloucestershirelive.co.uk/incoming/article4063632.ece/ALTERNATES/s1200/2_210420connor_01jpeg.jpg", "publishedAt": "2020-04-21T09:45:32Z", "content": "A Forest of Dean boy is moving people to tears with his musical tribute to NHS heroes.\r\nAfter people clap their hands outside their homes every Thursday in appreciation of health workers fighting the coronavirus, Connor Edwards does a bit extra by playing his… [+1301 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "First gravitational wave caught from binary black hole merger with unequal masses - Tech Explorist", "description": "Scientists have published a remarkable signal unlike any of those seen before: GW190412 is the first observation of a binary black hole merger where the two black holes have distinctly different masses of about 8 and 30 times that of our Sun.", "url": "https://www.techexplorist.com/first-gravitational-wave-caught-binary-black-hole-merger-unequal-masses/31730/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/Binary-black-hole.jpg", "publishedAt": "2020-04-21T07:35:07Z", "content": "In a first, a group of space experts has identified gravitational waves emerging from the merger of two Binary Black Holes (BBH) with significantly unequal masses.\r\nGW190412 is the first observation of a binary black hole merger where the two black holes have… [+2371 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Will Dunham", "title": "Ancient Marine Crocodiles Adapted Like Whales to Ocean Life – Only Earlier - The Wire", "description": "Research published on Monday detailed changes in the inner ear’s vestibular system – responsible for the sense of balance and equilibrium – in the marine crocs called thalattosuchians.", "url": "https://science.thewire.in/environment/ancient-marine-crocodiles-adapted-like-whales-to-ocean-life-only-earlier/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/04/21123358/Steneosaurus_NT_small.jpg", "publishedAt": "2020-04-21T07:15:00Z", "content": "Washington: A wondrous lineage of crocodile relatives that developed into fast-swimming seagoing predators at a time when dinosaurs dominated the land adapted to life in the open ocean with a pivotal evolutionary modification also present in whales.\r\nBut the … [+2700 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Study may explain Source of Nitrogen in Earth's atmosphere - EdexLive", "description": "Nitrogen makes up approximately 78 percent of the air we breathe. But scientists have never fully understood how it came to be present in the atmospheres around Earth and other planets", "url": "https://www.edexlive.com/news/2020/apr/21/study-may-explain-source-of-nitrogen-in-earths-atmosphere-11452.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2019/2/4/w600X390/SCIENTIST.jpg", "publishedAt": "2020-04-21T06:46:28Z", "content": "New research by scientists may help solve the question of whether our atmosphere was formed by gases naturally emitted by the Earth's interior -- through events like volcanic eruptions or due to comets colliding into the Earth soon after it formed.\r\nNitrogen … [+1242 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Testing Perseverance's Center of Gravity - JPLraw", "description": "NASA's next rover is rotated on special test fixture in preparation for its upcoming summertime launch to Mars. Video taken at Kennedy Space Center, Florida,...", "url": "https://www.youtube.com/watch?v=4P9il_a-bkw", "urlToImage": "https://i.ytimg.com/vi/4P9il_a-bkw/maxresdefault.jpg", "publishedAt": "2020-04-20T20:20:06Z", "content": "NASA's next rover is rotated on special test fixture in preparation for its upcoming summertime launch to Mars. Video taken at Kennedy Space Center, Florida, on April 6, 2020. For more about the mission, visit https://mars.nasa.gov/mars2020\r\nCredit: NASA-JPL/… [+6 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Coronavirus the musical: U.S. scientists turn virus into melody to aid research - Investing.com", "description": "Coronavirus the musical: U.S. scientists turn virus into melody to aid research", "url": "https://www.investing.com/news/coronavirus/coronavirus-the-musical-us-scientists-turn-virus-into-melody-to-aid-research-2145478", "urlToImage": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEG3J1TX_L.jpg", "publishedAt": "2020-04-20T18:40:00Z", "content": "(Reuters) - From tinkling harmonies as the virus disarms cells to clashing and stormy as it replicates, U.S. scientists have translated the novel coronavirus' spiked protein structure to music in an effort to better understand the pathogen. \r\nProfessor Markus… [+2078 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Largest Group of Earth Scientists on Earth - NASA Goddard", "description": "NASA's Goddard Space Flight Center has the largest collection of Earth scientists on the planet. Their job is to be the nation's trusted source of comprehens...", "url": "https://www.youtube.com/watch?v=opjOMXqjWdI", "urlToImage": "https://i.ytimg.com/vi/opjOMXqjWdI/hqdefault.jpg", "publishedAt": "2020-04-20T17:59:46Z", "content": "NASA's Goddard Space Flight Center has the largest collection of Earth scientists on the planet. Their job is to be the nation's trusted source of comprehensive environmental information about the current state and the future of Earth. They build, design, lau… [+1156 chars]"}, {"source": {"id": null, "name": "Techexplorist.com"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists developed electronics that advance neuromorphic computing - Tech Explorist", "description": "Scientists have demonstrated a type of diffusive memristor, fabricated from the protein nanowires harvested from the bacterium Geobacter sulfurreducens, that functions at the biological voltages of 40-100 mV.", "url": "https://www.techexplorist.com/scientists-developed-electronics-advance-neuromorphic-computing/31708/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2020/04/Protein-nanowires.jpg", "publishedAt": "2020-04-20T17:13:00Z", "content": "A team at the University of Massachusetts Amherst, have demonstrated a type of diffusive memristor, fabricated from the protein nanowires harvested from the bacterium Geobacter sulfurreducens, that functions at the biological voltages of 40-100mV.\r\nThe greate… [+2759 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "Origin of Brain Network Crucial for Language Pushed Back 20 Million Years - Newsweek", "description": "\"It is like finding a new fossil of a long-lost ancestor,\" researcher Chris Petkov said.", "url": "https://www.newsweek.com/origin-human-brain-network-language-20-million-years-scientists-1498967", "urlToImage": "https://d.newsweek.com/en/full/1582998/brain-synapses.jpg", "publishedAt": "2020-04-20T16:38:18Z", "content": "Researchers have shed new light on the language pathway in the human brain, suggesting that its origins lie around 25 million years agotwenty million years earlier than previously thought.\r\nBrain pathways, or neural pathways, are circuits of interconnected ne… [+5561 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Watch this rare, calming video of baby humpback whales nursing - CNET", "description": "Suction-cup cameras are helping scientists peek into the secret lives of whales.", "url": "https://www.cnet.com/news/watch-this-rare-calming-video-of-baby-humpback-whales-nursing/", "urlToImage": "https://cnet1.cbsistatic.com/img/VPqHixIEllb5K-Q9v4IC8onw4_g=/2020/04/20/c16fbd28-a35e-4cd6-a181-684e62aa202d/whaletagging-cropped.jpg", "publishedAt": "2020-04-20T15:49:00Z", "content": "A humpback whale and a calf with a suction cup tag visible (NOAA permit #21476).\r\nUH Mnoa Marine Mammal Research Program\r\nTag. You're it! A team led by researchers at the University of Hawaii at Manoa has found a non-invasive way to study the elusive nursing … [+1652 chars]"}, {"source": {"id": null, "name": "Inceptivemind.com"}, "author": "https://www.facebook.com/malewar.amit", "title": "NASA, SpaceX to launch first manned Crew Dragon flight on May 27 - Inceptive Mind", "description": "The date and time are officially set: NASA and SpaceX will send their first manned Crew Dragon flight on May 27, 2020, at 4:32 p.m. EDT.", "url": "https://www.inceptivemind.com/nasa-spacex-launch-first-manned-crew-dragon-flight-may-27/12813/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2020/04/SpaceX-crew-dragon-launch.jpg", "publishedAt": "2020-04-20T13:57:37Z", "content": "The SpaceX’s first manned Crew Dragon spacecraft will take off at 4:32 p.m. EDT May 27, from the very famous Launch Complex 39A of the Kennedy space center in Florida. It will be the first American human spaceflight on an American rocket from American soil to… [+2028 chars]"}, {"source": {"id": null, "name": "Analyticsinsight.net"}, "author": "Preetipadma", "title": "Quantum Connectivity: A Trump Card for Secure Internet Networking - Analytics Insight", "description": "Although we are yet to witness the future of data transmission, quantum internet can modify a lot of things. From being our key to data security to tasks that demand higher degrees of coordination, communication, and synchronization.", "url": "https://www.analyticsinsight.net/quantum-connectivity-trump-card-secure-internet-networking/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2020/04/quantum.png", "publishedAt": "2020-04-20T11:28:43Z", "content": "A team of Chinese researchers has been able to link quantum memories extending up to 22 km of optic fiber using two-photon interference techniques and to 50 km using single-photon interference. Thus beating the previous record by more than 40 times over. This… [+3316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Wood, CNN", "title": "The missing link in the study of black holes? Africa Millimetre Telescope could unlock new secrets - CNN", "description": "In Namibia, the Africa Millimetre Telescope could could unlock secrets about black holes.", "url": "https://www.cnn.com/2020/04/20/world/namibia-africa-millimetre-telescope-spc-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200413104629-black-holes-super-tease.jpg", "publishedAt": "2020-04-20T08:55:00Z", "content": "Namibia (CNN)Black holes, which trap light and warp the very fabric of space, remain one of the great mysteries of science. But astronomers are hoping that a telescope in Africa could help unlock their secrets.\r\nEli Kasai is an optical astronomer at the Unive… [+3657 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "Jupiter looks like a modern art portrait in these JunoCam images - The Indian Express", "description": "NASA released a colour-enhanced picture of the Jupiter's atmosphere taken by the Juno spacecraft's JunoCam on April 10, 2020.", "url": "https://indianexpress.com/article/technology/science/nasa-jupiter-atmosphere-pictures-juno-spacraft-6370642/", "urlToImage": "https://images.indianexpress.com/2020/04/JUno-759.jpg?w=759", "publishedAt": "2020-04-20T08:06:13Z", "content": "By: Tech Desk | New Delhi | \r\nPublished: April 20, 2020 1:32:23 pm\r\nJuno captured this at its 26th flyby. (Image data: NASA/JPL-Caltech/SwRI/MSSS | Image processing by Kevin M. Gill)As the largest planet orbiting the Sun, Jupiter holds the reputation of being… [+2371 chars]"}, {"source": {"id": null, "name": "Editorials99.com"}, "author": null, "title": "Dead Kepler Telescope finds Earth-like Planet 300 light years away - Editorials 99", "description": "Long dead NASA’s Kepler Space Telescope has discovered a earth-like planet that revolves around its star in Goldilocks zone and has the possibility of harnessing life. Scientists are excited to further Digg what might be hidden on the planet which end might e…", "url": "https://editorials99.com/nasa-discovered-new-earth-like-habitable-exoplanet-from-kepler-space-telescopes-lost-data/", "urlToImage": null, "publishedAt": "2020-04-20T00:58:44Z", "content": "Long dead NASA’s Kepler Space Telescope has discovered a earth-like planet that revolves around its star in Goldilocks zone and has the possibility of harnessing life. Scientists are excited to further Digg what might be hidden on the planet which end might e… [+2158 chars]"}, {"source": {"id": null, "name": "Futurism.com"}, "author": null, "title": "New Research: Space Travel Causes Astronauts' Brains to Expand - Futurism", "description": "\"White matter expansion in fact is responsible for the largest increase in combined brain and cerebrospinal fluid volumes postflight.\"", "url": "https://futurism.com/neoscope/space-travel-astronauts-brains-expand", "urlToImage": "https://wp-assets.futurism.com/2020/04/Space-Travel-Causes-Astronauts-Brains-Expand-768x403.jpg", "publishedAt": "2020-04-19T06:25:11Z", "content": "A new study suggests that spending a long time in space is causing the volume of astronauts brains to expand.\r\nA majority of crew members aboard the International Space Station (ISS) seem to experience swelling of the optic nerve, along with a surplus of flui… [+2318 chars]"}, {"source": {"id": null, "name": "Travelandleisure.com"}, "author": "Cailey Rizzo", "title": "An Asteroid the Size of a House Will Fly by Earth Today - Travel+Leisure", "description": "It poses no threat of danger to the Earth.", "url": "https://www.travelandleisure.com/trip-ideas/space-astronomy/asteroid-2020-gh2-passing-earth", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F28%2F2020%2F04%2F15%2Fasteroid-2020-gh2-trajectory-tout.jpg", "publishedAt": "2020-04-18T17:01:53Z", "content": "A newly-discovered asteroid is projected to fly safely by Earth on Wednesday.\r\nDiscovered April 11, Asteroid 2020 GH2 is anywhere from 43 to 70 feet wide or about the size of a single-family house, according to Space.com. The asteroid is projected to pass by … [+1478 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "SpaceX's first crewed flight to the ISS will take place on May 27 - Best gaming pro", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vYmVzdGdhbWluZ3Byby5jb20vc3BhY2V4cy1maXJzdC1jcmV3ZWQtZmxpZ2h0LXRvLXRoZS1pc3Mtd2lsbC10YWtlLXBsYWNlLW9uLW1heS0yNy_SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-04-18T04:21:39Z", "content": null}, {"source": {"id": null, "name": "Kxan36news.com"}, "author": null, "title": "The brightest recorded supernova in history - The KXAN 36 News", "description": null, "url": "http://www.kxan36news.com/the-brightest-recorded-supernova-in-history", "urlToImage": null, "publishedAt": "2020-04-14T08:38:15Z", "content": "Scientists at Birmingham University in the UK have recorded the brightest supernova in history, as reported in an article published in the journal Nature Astronomy.\r\nAstronomers believe that a supernova SN2016aps may be the model of pulsating pair-instability… [+1034 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Many Space Agencies including NASA Add Stringent Measures To Protect Astronauts From Coronavirus - http://www.newsgram.com/", "description": "As COVID-19 pandemic keeps governments on their toes, NASA and other space agencies have added stringent measures to prevent the spread.", "url": "https://www.newsgram.com/space-agencies-nasa-measures-protect-astronauts-coronavirus/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/03/NASA-Logo2.jpg", "publishedAt": "2020-03-15T12:09:02Z", "content": "Two U.S. astronauts say its hard to comprehend the changes on Earth that have occurred due to the coronavirus pandemic, as they prepare to return from the International Space Station.\r\nThe astronauts, Andrew Morgan and Jessica Meir, have been in space for mor… [+3641 chars]"}, {"source": {"id": null, "name": "Newsgram.com"}, "author": null, "title": "Astronomers Discover More Than Hundred Minor Planets Located at far Reaches of Social System - http://www.newsgram.com/", "description": "Astronomers have discovered more than 100 new trans-Neptunian objects (TNOs), minor planets located in the far reaches of the solar system.", "url": "https://www.newsgram.com/astronomers-discover-minor-planets-social-system/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2020/03/Planets.jpg", "publishedAt": "2020-03-12T12:14:36Z", "content": "Astronomers have discovered more than 100 new trans-Neptunian objects (TNOs), minor planets located in the far reaches of the solar system.\r\nFor the study, published in The Astrophysical Journal Supplement Series, the researchers used data from Dark Energy Su… [+2526 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "SpaceX aces emergency landing simulation, ready to fly astronauts to ISS by April 2020 - Firstpost", "description": "The test is crucial to qualify the capsule to fly humans to the ISS which might by mid-2020.", "url": "https://www.firstpost.com/tech/news-analysis/spacex-aces-emergency-landing-simulation-ready-to-fly-astronauts-to-iss-by-april-2020-7929591.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/EOfei8lUYAAjOZN.jpg", "publishedAt": "2020-01-20T04:23:19Z", "content": "ReutersJan 20, 2020 09:52:41 IST\r\nElon Musk's SpaceX simulated a successful emergency landing on Sunday in a dramatic test of a crucial abort system on an unmanned astronaut capsule, laying the foundation for its mission to fly NASA astronauts for the first t… [+3729 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Will the Future Run on Moon Power? India's Space Agency Bets Yes. - IndustryWeek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigAFodHRwczovL3d3dy5pbmR1c3RyeXdlZWsuY29tL3RlY2hub2xvZ3ktYW5kLWlpb3QvYXJ0aWNsZS8yMjAyNTg3Mi93aWxsLXRoZS1mdXR1cmUtcnVuLW9uLW1vb24tcG93ZXItaW5kaWFzLXNwYWNlLWFnZW5jeS1iZXRzLXllc9IBAA?oc=5", "urlToImage": null, "publishedAt": "2019-12-13T23:25:34Z", "content": null}, {"source": {"id": null, "name": "Newsgram.com"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "NASA releases its latest Global maps of Earth at Night, provides clearest patterns of Human Settlement across the Planet - http://www.newsgram.com/", "description": "NASA has released its latest global maps of Earth at night, providing the \"clearest yet composite\" view of patterns of human settlement across our planet.", "url": "https://www.newsgram.com/nasa-releases-its-latest-global-maps-of-earth-at-night-provides-clearest-patterns-of-human-settlement-across-the-planet/", "urlToImage": "https://d345cba086ha3o.cloudfront.net/wp-content/uploads/2016/11/earth.jpg", "publishedAt": "2017-06-13T14:36:47Z", "content": "BY FRANK F. ISLAM\r\nAs the coronavirus pandemic dominates global news in the United States, progress toward the next presidential election scheduled to be held on November 3 moves slowly forward. President Donald Trump had no real opposition in the Republican … [+6074 chars]"}]}