{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Rachel Lopez", "title": "3, 2, 1... Liftoff! Could you score a ticket to space? - Hindustan Times", "description": "Private missions are blasting off into orbit and will soon take on paying customers as well. It helps to be stratospherically rich. Here’s what else makes the cut.", "url": "https://www.hindustantimes.com/lifestyle/art-culture/3-2-1-liftoff-could-you-score-a-ticket-to-space-101625826394368.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/09/1600x900/12a83548-de4c-11eb-ab2f-effefc8ce6e6_1625826391802.jpeg", "publishedAt": "2021-07-09T10:26:34Z", "content": "Richard Branson will make history on Sunday. His Virgin Galactic VSS Unity rocket will blast off into space, becoming the first private company to ferry two pilots and four mission specialists (inclu… [+5061 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Curiosity Mars Rover Reveals New Understanding of Rock Record, Evidence of Possible Signs of Ancient Life - SciTechDaily", "description": "A new paper enriches scientists’ understanding of where the rock record preserved or destroyed evidence of Mars’ past and possible signs of ancient life. Today, Mars is a planet of extremes – it’s bitterly cold, has high radiation, and is bone-dry. But billio…", "url": "https://scitechdaily.com/nasas-curiosity-mars-rover-reveals-new-understanding-of-rock-record-evidence-of-possible-signs-of-ancient-life/", "urlToImage": "https://scitechdaily.com/images/Curiositys-Dusty-Selfie-scaled.jpg", "publishedAt": "2021-07-09T09:41:00Z", "content": "A self-portrait of NASA’s Curiosity rover taken on Sol 2082 (June 15, 2018). A Martian dust storm has reduced sunlight and visibility at the rover’s location in Gale Crater. Credit: NASA/JPL-Caltech/… [+7027 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Mukul Sharma", "title": "Hidden network of lakes discovered beneath Antarctica's ice sheets due to global warming - Jagran English", "description": "According to a study published in Geophysical Research Letters  Antarctica s water system contains more than 130 active lakes  and how they will turn out in future may depend on rising global temperatures", "url": "https://english.jagran.com/trending/hidden-network-of-lakes-discovered-beneath-antarcticas-ice-sheets-due-to-global-warming-10028992", "urlToImage": "https://imgeng.jagran.com/images/2021/jul/Antarctica_NASA_earth1625820917854.jpeg", "publishedAt": "2021-07-09T08:52:17Z", "content": "New Delhi | Jagran Trending Desk: Amid surge in extreme weather events primarily led by rising global temperatures, a complex system of lakes underneath the melting ice sheets of Antarctica has been … [+1897 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Human brain, body shape changed due to climate, study shows environment's role in evolution - India Today", "description": "Researchers studied 300 human fossils of the Homo genus and combined it with climate models to identify its role in human evolution.", "url": "https://www.indiatoday.in/science/story/human-brain-body-shape-changed-due-to-climate-study-shows-environment-s-role-in-evolution-1825973-2021-07-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/evolution-647x363.jpeg?LjGgnyVaTUFmjJ.PQOM_oJmn3fTDVOej", "publishedAt": "2021-07-09T08:28:55Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Gadgets 360 Newsdesk", "title": "NASA Shares Photos of Final Mission Launch of Its Space Shuttle Programme From a Decade Ago - Gadgets 360", "description": "NASA shared images of a mission from a decade ago on its Twitter and Instagram handles. It was on this day back in 2011 that space shuttle Atlantis lifted off from the John F. Kennedy Space Center in Florida. Check out the photos here.", "url": "https://gadgets.ndtv.com/science/news/nasa-atlantis-space-shuttle-programme-last-launch-international-space-station-iss-instagram-july-2011-2482758", "urlToImage": "https://i.gadgets360cdn.com/large/nasa_atlantis_instagram_1625816038527.jpg", "publishedAt": "2021-07-09T07:38:08Z", "content": "NASA on a regular basis shares pictures on its social media handles of missions currently underway. But occasionally, it takes us down the memory lane too. On Thursday, July 8, the American space age… [+2478 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "David Yong, Australian National University and Gary Da Costa, Australian National University", "title": "We found a new type of stellar explosion that could explain a 13-billion-year-old mystery of the Milky Way’s elements - Yahoo India News", "description": "Canberra (Australia), Jul 9 (The Conversation) Until recently it was thought neutron star mergers were the only way heavy elements (heavier than Zinc) could ...", "url": "https://in.news.yahoo.com/found-type-stellar-explosion-could-071853447.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-07-09T07:18:53Z", "content": "Canberra (Australia), Jul 9 (The Conversation) Until recently it was thought neutron star mergers were the only way heavy elements (heavier than Zinc) could be produced. These mergers involve the mas… [+4068 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Methane detected in Saturn's moon plumes may have biological origin: Could Enceladus host alien life? - Times Now", "description": "Researchers have concluded that no known geochemical process can explain the amount of methane seen spewing out from Saturn's moon.", "url": "https://www.timesnownews.com/technology-science/article/methane-detected-in-saturns-moon-plumes-could-have-biological-origin-could-enceladus-host-alien-life/782498", "urlToImage": "https://imgk.timesnownews.com/story/iStock-910211626.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-07-09T07:00:00Z", "content": "<ul><li>Given that we can't exactly scoot over to Enceladus, the researchers turned to complex and painstaking mathematical modelling to evaluate the probability that the methane on Enceladus was for… [+3796 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Hubble telescope suffers its worst glitch in a decade as Nasa struggles to find a fix - India Today", "description": "The Hubble telescope has been in a safe-mode configuration for three weeks now after its onboard computer glitch that shut down science operations.", "url": "https://www.indiatoday.in/science/story/hubble-space-telescope-fault-payload-computer-glitch-nasa-james-webb-esa-1825912-2021-07-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/Hubble_ST1_0-647x363.jpeg?PbhEgAsNQS7IPFMQD.llhMbK9QfYyZAC", "publishedAt": "2021-07-09T06:29:59Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Winchcombe meteorite gets official classification, here is all you need to know - WION", "description": "", "url": "https://www.wionews.com/science/winchcombe-meteorite-gets-official-classification-here-is-all-you-need-to-know-396877", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/03/09/186272-meteorite-right-size.jpg", "publishedAt": "2021-07-09T05:37:30Z", "content": "The rocky material that fell to Earth in a fireball over the Cotswold town of Winchcombe in February has had its classification formally accepted.\r\nAs per UK scientists, the object dates back to the … [+1610 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Multiple rogue land mass planets have been discovered drifting through the Milky Way - Space Bollyinside - BollyInside", "description": "UT video explaining gravitational lensing, which microlensing is a smaller example of. They are difficult because microlensing is exhibited by tiny", "url": "https://www.bollyinside.com/news/multiple-rogue-land-mass-planets-have-been-discovered-drifting-through-the-milky-way", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-09T02:56:09Z", "content": "UT video explaining gravitational lensing, which microlensing is a smaller example of. They are difficult because microlensing is exhibited by tiny fluctuations in the light of stars when an object p… [+2806 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This One Planetary Feature May Be Crucial For The Rise of Complex Life in The Universe - ScienceAlert", "description": "The way a planet is tilted on its rotational axis with respect to its orbital plane around a star - what we know as 'axial tilt' - could be key to the emergence of complex life.", "url": "https://www.sciencealert.com/an-axial-tilt-may-be-crucial-to-the-emergence-of-complex-life-in-the-universe", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/globe-tilt_1024.jpg", "publishedAt": "2021-07-09T02:43:43Z", "content": "The way a planet is tilted on its rotational axis with respect to its orbital plane around a star - what we know as 'axial tilt' - could be key to the emergence of complex life.\r\nAccording to a new s… [+4612 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Face Pareidolia: Here's Why We Spot Human Expressions in Non-living Objects - News18", "description": "Face Pareidolia is what scientists call our brains’ error of seeing human faces in inanimate objects, in the moon, in the clouds, in a flower and an old wall seamed by rain.", "url": "https://www.news18.com/news/buzz/face-pareidolia-heres-why-we-spot-human-expressions-in-non-living-objects-3940733.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/06/1623669058_news-18-4.jpg", "publishedAt": "2021-07-09T01:44:04Z", "content": "Face Pareidolia is what scientists call our brains error of seeing human faces in inanimate objects, in the moon, in the clouds, in a flower and an old wall seamed by rain. However, what a human brai… [+1836 chars]"}, {"source": {"id": null, "name": "Reportdoor.com"}, "author": null, "title": "Researchers Create Smart Toilets That Will Analyze Urine & Feces Samples To Diagnose Gastrointestinal Diseases - Report Door", "description": "In 2021, your toilet may be able to diagnose “gastrointestinal diseases.”At Stanford University, researchers have “created a prototype toilet that uses an", "url": "https://www.reportdoor.com/researchers-create-smart-toilets-that-will-analyze-urine-feces-samples-to-diagnose-gastrointestinal-diseases/", "urlToImage": "https://reportdoor.com/wp-content/themes/The%20Shade%20Room/assets/images/lozad-placeholder-white.jpg", "publishedAt": "2021-07-09T00:56:30Z", "content": "In 2021, your toilet may be able to diagnose gastrointestinal diseases.\r\nAt Stanford University, researchers have created a prototype toilet that uses an artificial intelligence-trained camera to tra… [+1145 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "First study of nickelate's magnetism finds a strong kinship with cuprate superconductors - Science Daily", "description": "Are new nickelate superconductors close kin to the original high-temperature superconductors, the cuprates? The first study of their magnetic properties says the answer is yes. Scientists have found important similarities but also subtle differences between t…", "url": "https://www.sciencedaily.com/releases/2021/07/210708170340.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-09T00:37:45Z", "content": "Ever since the 1986 discovery that copper oxide materials, or cuprates, could carry electrical current with no loss at unexpectedly high temperatures, scientists have been looking for other unconvent… [+4802 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The pressure is off and high temperature superconductivity remains: Development of a new pressure-quench technique demonstrates superconductivity in iron selenide crystals sans pressure - Science Daily", "description": "Using a new pressure quenching (PQ) technique at high temperatures to induce superconductivity in iron selenide (FeSe) crystals, superconductivity was achieved -- and sustained -- without pressure.", "url": "https://www.sciencedaily.com/releases/2021/07/210708170334.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-09T00:23:01Z", "content": "In a critical next step toward room-temperature superconductivity at ambient pressure, Paul Chu, Founding Director and Chief Scientist at the Texas Center for Superconductivity at the University of H… [+5905 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Ultraviolet light from Mars' aurora finds Emirati in orbit - SwordsToday.ie", "description": "The spacecraft orbiting Mars has captured the still-visible space light on the Red Planet. The Emirati achieves expectationsArriving in early February,", "url": "https://swordstoday.ie/ultraviolet-light-from-mars-aurora-finds-emirati-in-orbit/", "urlToImage": null, "publishedAt": "2021-07-08T22:16:53Z", "content": "The spacecraft orbiting Mars has captured the still-visible space light on the Red Planet. \r\nThe Emirati achieves expectationsArriving in early February, Mars saw the glow of the Aurora Boralis in th… [+2930 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The rise of 'ARPA-everything' and what it means for science - Nature.com", "description": "Science agencies such as ARPA-Health hope to replicate the success of the US Defense Advanced Research Projects Agency, but researchers question whether they will thrive.", "url": "https://www.nature.com/articles/d41586-021-01878-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-01878-z/d41586-021-01878-z_19343578.jpg", "publishedAt": "2021-07-08T21:33:17Z", "content": "Funding from ARPA-Energy has led to the creation of companies such as solar manufacturing firm 1366 Technologies (now CubicPV). Here, a technician shows off a solar cell at a demonstration plant in 2… [+10306 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Star cluster overrun with black holes may dissolve into space, study finds - Space.com", "description": "In a few billion years, there may be no stars left in the Palomar 5 cluster.", "url": "https://www.space.com/black-holes-overrun-star-cluster-palomar-5-star-cluster", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Cci6jRMyfpWWAXMM2L8LdQ-1200-80.jpg", "publishedAt": "2021-07-08T21:19:01Z", "content": "A cluster composed of thousands of stars may dissolve to become a mob of dozens of black holes in a billion years, a new study finds.\r\nThis dark fate may arise from the actions of a few black holes t… [+6371 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "An antioxidative stress regulator protects muscle tissue in space, mouse study shows: Researchers find that a master regulator of the oxidative stress response affects muscle composition during space flight - Science Daily", "description": "Researchers have found that nuclear factor E2-related factor 2, a master regulator of the oxidative stress response, affects muscle composition in microgravity. Targeting this protein could help protect against muscle changes during space flight, and could al…", "url": "https://www.sciencedaily.com/releases/2021/07/210708111457.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-08T21:10:44Z", "content": "Most kids dream of growing up to be astronauts; but the downside of spending extended amounts of time in low gravity is that astronauts' muscles tend to shrink and weaken through disuse. Now, researc… [+2825 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Issam Ahmed", "title": "Scientists learn how otters stay hotter - Phys.org", "description": "Sea otters are a hardy lot.", "url": "https://phys.org/news/2021-07-scientists-otters-hotter.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/a-sea-otter-sits-on-a.jpg", "publishedAt": "2021-07-08T20:34:20Z", "content": "Sea otters are a hardy lot.\r\nThe smallest of all marine mammals with the thickest fur of the animal kingdom, they can hold their breath for up to eight minutes while they dive for prey like clams and… [+3622 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Changes in our planet's orbit may have allowed life to survive during the ice ages \"Snowball Earth\" | Geosciences, Planetary Sciences, Space Exploration - Space Bollyinside - BollyInside", "description": "Professor Mitchell and colleagues ventured into the South Australian outback where they targeted kilometer-thick units of glacial rocks formed about 700", "url": "https://www.bollyinside.com/news/changes-in-our-planets-orbit-may-have-allowed-life-to-survive-during-the-ice-ages-snowball-earth-geosciences-planetary-sciences-space-exploration", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-08T19:43:20Z", "content": "Professor Mitchell and colleagues ventured into the South Australian outback where they targeted kilometer-thick units of glacial rocks formed about 700 million years ago. At this time, Australia was… [+1944 chars]"}, {"source": {"id": null, "name": "NBC Southern California"}, "author": "Maggie More", "title": "Study: Surge in Coastal Flooding Likely in 2030s Due to Climate Change, Lunar Cycle - NBC Southern California", "description": "Coastal cities across the U.S. are likely to see high-tide floods starting in the mid-2030s as rising sea levels align with the lunar cycle, NASA says.", "url": "https://www.nbclosangeles.com/news/local/study-surge-in-coastal-flooding-likely-in-2030s-due-to-climate-change-lunar-cycle/2634141/", "urlToImage": "https://media.nbclosangeles.com/2021/07/hawaii-flooding-large.png?crop=0px%2C0px%2C0px%2C0px&resize=1200%2C675&quality=85&strip=all", "publishedAt": "2021-07-08T18:22:25Z", "content": "Coastal cities across the U.S. are likely to see high-tide floods starting in the mid 2030s, according to a new NASA study, as rising sea levels due to climate change align with the lunar cycle for d… [+4445 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Etienne Farcot", "title": "Why do cauliflowers look so odd? We've cracked the maths behind their 'fractal' shape - The Conversation UK", "description": "Cauliflowers are unique, and now we know why.", "url": "https://theconversation.com/why-do-cauliflowers-look-so-odd-weve-cracked-the-maths-behind-their-fractal-shape-164121", "urlToImage": "https://images.theconversation.com/files/410456/original/file-20210708-21-ont71o.jpg?ixlib=rb-1.1.0&rect=0%2C529%2C5615%2C2808&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-07-08T18:09:17Z", "content": "Have you ever stared at a cauliflower before preparing it and got lost in its stunningly beautiful pattern? Probably not, if you are in your right mind, but I reassure you its worth a try. What youll… [+5927 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Gut microbiome heritability is nearly universal but environmentally contingent - Science Magazine", "description": "Commensal bacteria are found throughout an organism, but it is not known whether associations between gut bacteria and their host are heritable. Grieneisen et al. examined changes in the microbiomes of 585 wild baboons from fecal samples collected over 14 yea…", "url": "https://science.sciencemag.org/content/373/6551/181.full", "urlToImage": "https://science.sciencemag.org/content/373/6551/181/F1.large.jpg", "publishedAt": "2021-07-08T18:03:43Z", "content": "By Laura Grieneisen, Mauna Dasari, Trevor J. Gould, Johannes R. Björk, Jean-Christophe Grenier, Vania Yotova, David Jansen, Neil Gottel, Jacob B. Gordon, Niki H. Learn, Laurence R. Gesquiere, Tim L. … [+189 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "For The First Time, Scientists Have Connected a Superconductor to a Semiconductor - ScienceAlert", "description": "Scientists have succeeded in combining two exciting material types together for the very first time: an ultrathin semiconductor just a single atom thick; and a superconductor, capable of conducting electricity with zero resistance.", "url": "https://www.sciencealert.com/scientists-just-overcame-a-major-hurdle-to-conducting-electricity-with-zero-resistance", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/Screen_Shot_2021-07-08_at_4.05.42_pm_1024.png", "publishedAt": "2021-07-08T18:03:07Z", "content": "Scientists have succeeded in combining two exciting material types together for the very first time: an ultrathin semiconductor just a single atom thick; and a superconductor, capable of conducting e… [+3981 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Mars helicopter pulls off 'nail-biter' ninth flight over rough terrain - CNET", "description": "Ingenuity's \"nerve-wracking\" flight pushed the little chopper to its limits.", "url": "https://www.cnet.com/news/nasa-mars-helicopter-pulls-off-nail-biter-ninth-flight-over-rough-terrain/", "urlToImage": "https://www.cnet.com/a/img/2eCJVHBFlnpUrgTmUrt7-MX4LGU=/1200x630/2021/07/05/a22dbf9e-ddba-4dfb-b5f9-e4bc7a31f50f/igenuityflight9.jpg", "publishedAt": "2021-07-08T17:21:00Z", "content": "Ingenuity saw its own shadow during its ninth flight.\r\nNASA/JPL-Caltech\r\nWhen NASA sent the Ingenuity helicopter to Mars, it was gamble. Now it's pushing its limits, flying fast and reaching new heig… [+2724 chars]"}, {"source": {"id": null, "name": "TheNewsTrace"}, "author": null, "title": "'Large Bounce' For NASA's Mars Helicopter Heralds New Undertaking Strengthen Function - TheNewsTrace", "description": "Full of rocks and sand dunes, the Séítah space on Mars used to be too treacherous for NASA’s Perseverance rover to power over. So Ingenuity, the small helicopter accompanying the rover, flew over the world on Monday and snapped some footage of crucial spot at…", "url": "https://thenewstrace.com/large-bounce-for-nasas-mars-helicopter-heralds-new-undertaking-strengthen-function/164464/", "urlToImage": "http://thenewstrace.com/wp-content/uploads/2021/07/1400x1609.jpeg", "publishedAt": "2021-07-08T16:47:03Z", "content": "Full of rocks and sand dunes, the Séítah space on Mars used to be too treacherous for NASAs Perseverance rover to power over. So Ingenuity, the small helicopter accompanying the rover, flew over the … [+6383 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Winchcombe meteorite gets official classification - BBC News", "description": "The UK's most famous space rock receives its \"birth certificate\" from the Meteoritical Society.", "url": "https://www.bbc.com/news/science-environment-57763422", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/14DFB/production/_118499458_p09hj948.jpg", "publishedAt": "2021-07-08T16:16:03Z", "content": "Jonathan AmosScience correspondent@BBCAmoson Twitter\r\nimage captionThe national collection at the NHM holds in total 548g of stones and powder\r\nThe Winchcombe meteorite is now official.\r\nThe rocky ma… [+4805 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Scientists use satellite imagery to predict underwater volcano eruptions - Open Access Government", "description": "A new study by Hiroshima university uses satellite imagery to predict underwater volcano eruptions - using sea discolouration as a measurement of danger", "url": "https://www.openaccessgovernment.org/underwater-volcano-eruptions/115099/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/07/dreamstime_xl_30743771-scaled.jpg", "publishedAt": "2021-07-08T16:07:20Z", "content": "Although predicting when a volcano will erupt can be difficult as each behaves differently, scientists are on the lookout for these tell-tale signs: heightened seismic activity, expansion of magma po… [+1640 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Thousands of galaxies classified in the blink of an eye - Phys.org", "description": "Astronomers have designed and trained a computer program that can classify tens of thousands of galaxies in just a few seconds, a task that usually takes months to accomplish.", "url": "https://phys.org/news/2021-07-thousands-galaxies-eye.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thousands-of-galaxies.jpg", "publishedAt": "2021-07-08T15:21:14Z", "content": "Astronomers have designed and trained a computer program that can classify tens of thousands of galaxies in just a few seconds, a task that usually takes months to accomplish.\r\nIn research published … [+3722 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists prove Turing patterns manifest at nanoscale - Phys.org", "description": "What connection could possibly exist between the stripes on tropical fish and crystal growth? The answer is the way in which order emerges from randomness through Turing patterns, according to what a research team led by Dr. Fuseya of the University of Electr…", "url": "https://phys.org/news/2021-07-scientists-turing-patterns-manifest-nanoscale.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/of-the-same-stripe-tur.jpg", "publishedAt": "2021-07-08T15:00:11Z", "content": "What connection could possibly exist between the stripes on tropical fish and crystal growth? The answer is the way in which order emerges from randomness through Turing patterns, according to what a… [+5003 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "astronauts are working on China's new space station - here's what to expect »Stuff - Space Bollyinside - BollyInside", "description": "Much like the former Russian space station Mir and the International Space Station, the entire project is too large to be put into orbit in one launch.", "url": "https://www.bollyinside.com/news/astronauts-are-working-on-chinas-new-space-station-heres-what-to-expect-stuff", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-08T14:59:25Z", "content": "Much like the former Russian space station Mir and the International Space Station, the entire project is too large to be put into orbit in one launch. Tianhe, weighing 22.5 tonnes, was lofted to an … [+4553 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "From Venus meeting Mars to Thunder moon: Celestial events in July to keep an eye out for - Firstpost", "description": "To end the month with a bang, the moon will reach its third-quarter phase and the moonless nights will be the best time for deep-sky gazing.", "url": "https://www.firstpost.com/tech/science/from-venus-meeting-mars-to-thunder-moon-celestial-events-in-july-to-keep-an-eye-out-for-9790221.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/07/stefan-stefancik-G2ifDHnHZ6Y-unsplash-1.jpg", "publishedAt": "2021-07-08T14:46:33Z", "content": "FP TrendingJul 08, 2021 20:16:33 IST\r\nThis month stargazers are in for a treat since there is a long list of exciting events lined up for you. It will include meteors showers, Venus being spotted aft… [+3704 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Study Analyzes the Impact of Atmospheric Acidity on Ocean Ecology - AZoCleantech", "description": "New research led by the University of East Anglia (UEA) reveals the disruption in the ecological balance of the oceans, caused due to increased acidity in the atmosphere.", "url": "https://www.azocleantech.com/news.aspx?newsID=29780", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29780_16257537711434770.jpg", "publishedAt": "2021-07-08T14:16:00Z", "content": "New research led by the University of East Anglia (UEA) reveals the disruption in the ecological balance of the oceans, caused due to increased acidity in the atmosphere.\r\nImage Credit: Shutterstock.… [+4367 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carol Rasmussen", "title": "Study projects a surge in coastal flooding starting in 2030s - Phys.org", "description": "In the mid-2030s, every U.S. coast will experience rapidly increasing high-tide floods, when a lunar cycle will amplify rising sea levels caused by climate change.", "url": "https://phys.org/news/2021-07-surge-coastal-2030s.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/study-projects-a-surge.jpg", "publishedAt": "2021-07-08T14:00:02Z", "content": "In the mid-2030s, every U.S. coast will experience rapidly increasing high-tide floods, when a lunar cycle will amplify rising sea levels caused by climate change.\r\nHigh-tide floodsalso called nuisan… [+5819 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Apoorva Kaul", "title": "Alvarezsaur dinosaurs rapidly shrank in size after ant-based diet: Study - Republic World", "description": "Alvarezsaur dinosaurs shrank from the size of ostriches to the size of chickens about 100 million years ago when they started eating ant-based diet.", "url": "https://www.republicworld.com/technology-news/science/alvarezsaur-dinosaurs-rapidly-shrank-in-size-after-ant-based-diet-study.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/2goqebtxlnag4jy7_1625742938.jpeg", "publishedAt": "2021-07-08T13:32:00Z", "content": "Dinosaurs are generally believed to be huge, but a new study has revealed that the alvarezsaur dinosaurs had reduced in size. Alvarezsaur dinosaurs shrank from the size of ostriches to the size of ch… [+2169 chars]"}, {"source": {"id": null, "name": "Marketresearchtelecast.com"}, "author": null, "title": "The gun that stops bleeding in 5 minutes of stab wounds - Market Research Telecast", "description": "According to statistics, from March 2018 to March 2019, 259 people were killed in the UK using a sharp instrument, including knives and broken bottles. A victim of a stabbing may bleed to death in ... Read more", "url": "https://marketresearchtelecast.com/the-gun-that-stops-bleeding-in-5-minutes-of-stab-wounds/96992/", "urlToImage": "https://marketresearchtelecast.com/wp-content/uploads/2021/07/1625750337_The-gun-that-stops-bleeding-in-5-minutes-of-stab.jpg", "publishedAt": "2021-07-08T13:18:56Z", "content": "According to statistics, from March 2018 to March 2019, 259 people were killed in the UK using a sharp instrument, including knives and broken bottles. A victim of a stabbing may bleed to death in ju… [+3440 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Sulfur Intervention Induced Solar Geoengineering to Reduce Greenland Icecap Melting - AZoCleantech", "description": "The idea of injecting sulfur into the stratosphere to decrease solar radiation and curb the melting of the Greenland ice cap seems to be an interesting proposal but it also has risks involved.", "url": "https://www.azocleantech.com/news.aspx?newsID=29781", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29781_16257534381311195.jpg", "publishedAt": "2021-07-08T13:13:00Z", "content": "The idea of injecting sulfur into the stratosphere to decrease solar radiation and curb the melting of the Greenland ice cap seems to be an interesting proposal but it also has risks involved.\r\nImage… [+3711 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumedha Tripathi", "title": "Chinese Researchers Propose To Deflect 'Armageddon’ Asteroids With Rockets - India Times", "description": "Chinese researchers are already planning for the future and want to be well prepared for it.These researchers from Beijing want to send more than 20 of China's largest rockets to space to practice turning away a huge asteroid. They believe that this technique…", "url": "https://www.indiatimes.com/trending/environment/chinese-researchers-propose-to-avert-armageddon-544553.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jul/1551426783-GettyImages-460715403-960x540_60e6f56c74efb.jpg", "publishedAt": "2021-07-08T13:10:52Z", "content": "Chinese researchers are already planning for the future and want to be well prepared for it.\r\nThese researchers from Beijing want to send more than 20 of China's largest rockets to space to practice … [+2280 chars]"}, {"source": {"id": null, "name": "Rbth.com"}, "author": "Yekaterina Sinelschikova", "title": "Who was found in Russian permafrost - Malaysia Sun", "description": "Yakutia can be described as a scientist’s favorite “refrigerator”: animals that are tens of thousands years old are discovered there almost every year. A spoiler: some of them have even come back to life!", "url": "https://www.rbth.com/science-and-tech/333986-who-found-russian-permafrost?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS", "urlToImage": "https://cdni.rbth.com/rbthmedia/images/2021.07/article/60e6e62485600a43ee34c9a5.jpg", "publishedAt": "2021-07-08T12:55:00Z", "content": "24,000-year-old rotifers \r\nIn June 2021, it was reported that Russian scientists had discovered a rotifer that was at least 24,000 years old. Furthermore, they managed to revive it and it even began … [+7163 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matthew Hutson", "title": "Infrared cameras and artificial intelligence uncover the physics of boiling - Phys.org", "description": "Boiling is not just for heating up dinner. It's also for cooling things down. Turning liquid into gas removes energy from hot surfaces, and keeps everything from nuclear power plants to powerful computer chips from overheating. But when surfaces grow too hot,…", "url": "https://phys.org/news/2021-07-infrared-cameras-artificial-intelligence-uncover.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/infrared-cameras-and-a.jpg", "publishedAt": "2021-07-08T12:19:58Z", "content": "Boiling is not just for heating up dinner. It's also for cooling things down. Turning liquid into gas removes energy from hot surfaces, and keeps everything from nuclear power plants to powerful comp… [+5998 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Dawn Levy", "title": "Tiny but mighty precipitates toughen a structural alloy - Phys.org", "description": "Scientists at the Department of Energy's Oak Ridge National Laboratory and the University of Tennessee, Knoxville, have found a way to simultaneously increase the strength and ductility of an alloy by introducing tiny precipitates into its matrix and tuning t…", "url": "https://phys.org/news/2021-07-tiny-mighty-precipitates-toughen-alloy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/tiny-but-mighty-precip.jpg", "publishedAt": "2021-07-08T11:33:32Z", "content": "Scientists at the Department of Energy's Oak Ridge National Laboratory and the University of Tennessee, Knoxville, have found a way to simultaneously increase the strength and ductility of an alloy b… [+7033 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Mini-Neptune's atmosphere ripe for study - EarthSky", "description": "A newly-discovered mini-Neptune's atmosphere is ideal for study by space telescopes.", "url": "https://earthsky.org/space/mini-neptunes-atmosphere-ripe-for-study/", "urlToImage": "https://earthsky.org/upl/2021/06/TOI-1231-b-exoplanet-artist-concept.jpg", "publishedAt": "2021-07-08T11:09:48Z", "content": "Artist’s concept of TOI-1231 b shows a mini-Neptune-sized world that has a deep atmosphere ideal for further study by space telescopes. Image via NASA/ JPL-Caltech/ UNM.\r\nIn June, scientists at NASAs… [+7507 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Katrina Miller", "title": "Mystery Solved: How Plant Cells Know When to Stop Growing - WIRED", "description": "The discovery could have a profound effect on cell research for many species of plants and animals, as well as the future of crops.", "url": "https://www.wired.com/story/mystery-solved-how-plant-cells-know-when-to-stop-growing/", "urlToImage": "https://media.wired.com/photos/60e4f1903082cb0dcce32baf/191:100/w_1280,c_limit/Science_cellgrowth_GettyImages-139809434.jpg", "publishedAt": "2021-07-08T11:00:00Z", "content": "Its been a longstanding enigma in biology: How do cells know how big they are? \r\nThe answer, it turns out, was hidden inside Robert Sablowskis computer files, collecting virtual dust since 2013. I ha… [+3412 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Kepler seems to have detected a lot of rogue planets drifting through the galaxy - Space Bollyinside - BollyInside", "description": "But not all exoplanets stay put. Some get gravitationally kicked away from their parent star, to wander the galaxy, cold and alone. These are less easy to", "url": "https://www.bollyinside.com/news/kepler-seems-to-have-detected-a-lot-of-rogue-planets-drifting-through-the-galaxy", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-08T10:45:58Z", "content": "But not all exoplanets stay put. Some get gravitationally kicked away from their parent star, to wander the galaxy, cold and alone. These are less easy to detect but, after careful combing through da… [+2971 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Three launches in four days: China's space programme gains new pace, returns to pre-Covid level - India Today", "description": "China is picking up pace with its numerous missions to its under-construction Tinagong Space Station and plans to establish a lunar base with Russia.", "url": "https://www.indiatoday.in/science/story/china-space-programme-launches-tinagong-space-station-mars-mission-xi-jinping-1825468-2021-07-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/Shenzou_0-647x363.jpeg?NmOCxBGh6aDgZqleuDxoohPcA5Dmc1PD", "publishedAt": "2021-07-08T08:37:05Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Classifying tens of thousands of galaxies in just a few seconds - Tech Explorist", "description": "A task that usually takes months to accomplish.", "url": "https://www.techexplorist.com/classifying-tens-thousands-galaxies-just-few-seconds/39977/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/07/power-of-CNN.jpg", "publishedAt": "2021-07-08T08:34:26Z", "content": "The distribution of galaxies in space is not random; instead, they are grouped in gravitationally bound clusters.\r\nThe shapes of galaxies give a clue to the age and types of stars within the galaxy. … [+2263 chars]"}, {"source": {"id": null, "name": "Eletimes.com"}, "author": "https://www.facebook.com/eletimes", "title": "Cutting Through Noise For Better Solar Cells - ELE Times", "description": "As society moves towards a renewable energy future, it's crucial that solar panels convert light into electricity as efficiently as possible", "url": "https://www.eletimes.com/cutting-through-noise-for-better-solar-cells", "urlToImage": "https://www.eletimes.com/wp-content/uploads/2021/07/Solar-1.jpg", "publishedAt": "2021-07-08T06:29:32Z", "content": "As society moves towards a renewable energy future, it’s crucial that solar panels convert light into electricity as efficiently as possible. Some state-of-the-art solar cells are close to the theore… [+6588 chars]"}, {"source": {"id": null, "name": "HYPEBEAST"}, "author": "Joyce Li", "title": "Elon Musk SpaceX Launch First Billboard Space - HYPEBEAST", "description": "SpaceX plans to upstage advertising in the Super Bowl and Formula One Grand Prix.", "url": "https://hypebeast.com/2021/7/elon-musk-spacex-geometric-energy-corporation-first-space-billboard", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2021%2F07%2Felon-musk-spacex-geometric-energy-corporation-first-space-billboard-tw.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2021-07-08T05:53:10Z", "content": "Earlier this month, Elon Musk has announced a new venture that saw his SpaceX organization partner with Canadian engineering firm Geometric Energy Corporation (GEC) to bring “Space Art” to the Moon. … [+1401 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "Powerful Class X solar flare hits Earth for the first time in 4 years (video) - The Press Stories", "description": "This phenomenon is powerful enough to cause a short wave radio obscurity in the Atlantic Ocean. On July 3, the Sun released the 10th class eruption, the", "url": "https://presstories.com/2021/07/08/powerful-class-x-solar-flare-hits-earth-for-the-first-time-in-4-years-video/", "urlToImage": null, "publishedAt": "2021-07-08T05:51:04Z", "content": "This phenomenon is powerful enough to cause a short wave radio obscurity in the Atlantic Ocean.\r\nOn July 3, the Sun released the 10th class eruption, the most powerful eruption ever seen since Septem… [+2238 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Auroras on Mars captured with the clearest view yet, enchanting scientists - Space Bollyinside - BollyInside", "description": "Image: Mars Aurora (Emirates Mars Mission) Auroras occur when charged particles from space interact with atoms in the atmosphere, energizing them and", "url": "https://www.bollyinside.com/news/auroras-on-mars-captured-with-the-clearest-view-yet-enchanting-scientists", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-08T02:54:35Z", "content": "Image: Mars Aurora (Emirates Mars Mission) Auroras occur when charged particles from space interact with atoms in the atmosphere, energizing them and causing them to glow. On Earth, this plays out as… [+2419 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Sandhya Ramesh", "title": "This unusual star cluster with two tails is set to dissolve as 100% black holes, in 1 bn yrs - ThePrint", "description": "Palomar 5 is a globular cluster or a group of stars that are gravitationally bound in a spherical shape. It orbits our Milky Way galaxy.", "url": "https://theprint.in/science/this-unusual-star-cluster-with-two-tails-is-set-to-dissolve-as-100-black-holes-in-1-bn-yrs/691363/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/07/GlobularClusterNASA.jpg", "publishedAt": "2021-07-08T02:05:48Z", "content": "Bengaluru: Orbiting in the outer halo of the Milky Way is an unusual and unique globular cluster of stars known as Palomar 5.\r\nThis star cluster is characterised by two unique and mysterious features… [+3967 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Ask an Astronaut: What question would you ask the astronauts aboard the International Space Station? - Space Bollyinside - BollyInside", "description": "Max Defender 8 Meteorologists Amanda Holly and Rebecca Barry will join WFLA Now’s J.B. Biunno for the interview with McArthur and Kimbrough. You can watch", "url": "https://www.bollyinside.com/news/ask-an-astronaut-what-question-would-you-ask-the-astronauts-aboard-the-international-space-station", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-08T02:04:58Z", "content": "Max Defender 8 Meteorologists Amanda Holly and Rebecca Barry will join WFLA Nows J.B. Biunno for the interview with McArthur and Kimbrough. You can watch it in an upcoming episodes of Tracking The Tr… [+2478 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Owen Jarus", "title": "Thousands of Ancient Islamic Tombs Found Mysteriously Arranged in 'Galactic' Patterns - ScienceAlert", "description": "They were set up a little like galaxies in the universe.", "url": "https://www.livescience.com/medieval-islamic-tombs-hidden-pattern-cosmology.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8GxfNcoNgYeqZkXSTQSDHX-1200-80.jpg", "publishedAt": "2021-07-08T00:45:00Z", "content": "A landscape view of qubba tombs around an area known as Jebel Maman. (Image credit: Stefano Costanzo, CC-BY 4.0)\r\nThousands of medieval Islamic tombs in eastern Sudan were arranged in hard-to-detect … [+4755 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The heart of a lunar sensor - Space Bollyinside - BollyInside", "description": "This spectrometer is being delivered to NASA today as part of the PITMS instrument for its launch to the Moon later this year. EMS is based on an ‘ion", "url": "https://www.bollyinside.com/news/the-heart-of-a-lunar-sensor", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-07T19:22:45Z", "content": "This spectrometer is being delivered to NASA today as part of the PITMS instrument for its launch to the Moon later this year. EMS is based on an ion trap, an ingenious detector device that allows re… [+2601 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "European robotic arm (ERA) ready for the space station [Video] - Space Bollyinside - BollyInside", "description": "ERA is 100% made-in-Europe. A consortium of European companies led by Airbus Defence and Space Netherlands designed and assembled it for ESA. The robotic", "url": "https://www.bollyinside.com/news/european-robotic-arm-era-ready-for-the-space-station-video", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-07T18:19:15Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Damage-tolerant 3D-printed ceramics via conformal coating - Science Advances", "description": "Ceramic materials, despite their high strength and modulus, are limited in many structural applications due to inherent brittleness and low toughness. Nevertheless, ceramic-based structures, in nature, overcome this limitation using bottom-up complex hierarch…", "url": "https://advances.sciencemag.org/content/7/28/eabc5028.full", "urlToImage": "https://advances.sciencemag.org/content/7/28/eabc5028/F1.large.jpg", "publishedAt": "2021-07-07T18:17:33Z", "content": "INTRODUCTION\r\nCeramic materials are widely used in structural applications because of their outstanding environmental resistance, low density, and high strength properties. Also, the remarkable bioco… [+26231 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Gareth Dorrian, The Conversation", "title": "Tiangong: Chinese astronauts are working on the country’s first space station - Scroll.in", "description": "Once complete, it will be capable of hosting three astronauts for extended stays in space and will support spacewalks and experiments.", "url": "https://scroll.in/article/999463/tiangong-chinese-astronauts-are-working-on-the-countrys-first-space-station", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/161191-muktqhszhn-1625572330.jpg", "publishedAt": "2021-07-07T18:00:00Z", "content": "Three astronauts on Chinas new space station have just performed the countrys first spacewalk and are busy configuring the module for future crews. Named Tiangong (heavenly palace), the station is th… [+5517 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Developing new techniques to build biomaterials - Science Daily", "description": "Scientists have developed an approach that could help in the design of a new generation of synthetic biomaterials made from proteins. The biomaterials could eventually have applications in joint repair or wound healing as well as other fields of healthcare an…", "url": "https://www.sciencedaily.com/releases/2021/07/210706132819.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-07T17:55:22Z", "content": "Scientists at the University of Leeds have developed an approach that could help in the design of a new generation of synthetic biomaterials made from proteins.The biomaterials could eventually have … [+3247 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Next generation cytogenetics is on its way - Phys.org", "description": "Dutch-French research shows that Optical Genome Mapping (OGM) detects abnormalities in chromosomes and DNA very quickly, effectively and accurately. Sometimes even better than all existing techniques together, as they describe in two proof-of-concept studies …", "url": "https://phys.org/news/2021-07-cytogenetics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/chromosome.jpg", "publishedAt": "2021-07-07T16:23:14Z", "content": "Dutch-French research shows that Optical Genome Mapping (OGM) detects abnormalities in chromosomes and DNA very quickly, effectively and accurately. Sometimes even better than all existing techniques… [+6275 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Chris Davies", "title": "This huge X-class solar flare shows why NASA’s Sun study is so vital - SlashGear", "description": "NASA’s Solar Dynamics Observatory has caught a huge flare erupting from the Sun, a 10 million degree Fahrenheit eruption potent enough to disrupt GPS and more. The SDO – which launched …", "url": "https://www.slashgear.com/this-huge-x-class-solar-flare-shows-why-nasas-sun-study-is-so-vital-07681502/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/07/solar-flare-nasa.jpg", "publishedAt": "2021-07-07T14:56:00Z", "content": "NASA’s Solar Dynamics Observatory has caught a huge flare erupting from the Sun, a 10 million degree Fahrenheit eruption potent enough to disrupt GPS and more. The SDO – which launched in 2010 – cont… [+2950 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Satellite Galaxies can Form New Stars Even if They Come Close to Parent Galaxies - AZoQuantum", "description": "In the past, a majority of the researchers believed that once a satellite galaxy passes very near to its higher mass parent galaxy, its star formation would cease since the bigger galaxy would absorb all the gas from it, making it short of material required t…", "url": "https://www.azoquantum.com/News.aspx?newsID=8203", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_8203_16256604840628166.jpg", "publishedAt": "2021-07-07T14:44:00Z", "content": "In the past, a majority of the researchers believed that once a satellite galaxy passes very near to its higher mass parent galaxy, its star formation would cease since the bigger galaxy would absorb… [+3638 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "New satellite data techniques reveal coastal sea level rise - Space Bollyinside - BollyInside", "description": "Using the Baltic Sea as a target for the research, this new processing technique, which shows regional differences in sea-level rise, drastically improves", "url": "https://www.bollyinside.com/news/new-satellite-data-techniques-reveal-coastal-sea-level-rise", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-07-07T13:15:25Z", "content": "Using the Baltic Sea as a target for the research, this new processing technique, which shows regional differences in sea-level rise, drastically improves and extends previous sea-level trend maps. T… [+5073 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Researchers Fix Superconducting Contacts in Ultrathin Semiconductor - AZoNano", "description": "Scientists from the University of Basel have fitted superconducting contacts in an ultrathin semiconductor, for the first time.", "url": "https://www.azonano.com/news.aspx?newsID=38067", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38067_16256607075166696.jpg", "publishedAt": "2021-07-07T12:52:00Z", "content": "Scientists from the University of Basel have fitted superconducting contacts in an ultrathin semiconductor, for the first time.\r\nThe monolayer of molybdenum disulfide (MoS₂) is sandwiched between two… [+4650 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Intern", "title": "Supermassive black wholes may generate Tsunami in galaxy, says NASA - Zee News", "description": "We all are well aware of the natural disasters that occur on the earth, especially Tsunami. Earthquakes and underwater volcanic eruptions displace enough ocean water to create a Tsunami. But earth is not the only place in the universe that is hit by the huge …", "url": "https://zeenews.india.com/world/supermassive-black-wholes-may-generate-tsunami-in-galaxy-says-nasa-2374556.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/07/07/949678-tsunamiblackhole.jpg", "publishedAt": "2021-07-07T12:16:50Z", "content": "Washington: We all are well aware of the natural disasters that occur on the earth, especially Tsunami. Earthquakes and underwater volcanic eruptions displace enough ocean water to create a Tsunami. … [+1937 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ohio State University suggests vampire bats live in more fluid and open communities - India Education Diary", "description": "Female vampire bats establish an egalitarian community within a roost rather than a society based on a clear hierarchy of dominance that is often seen in animal groups, a new study suggests.Researchers observed more than 1,000 competitions for food a", "url": "https://indiaeducationdiary.in/ohio-state-university-suggests-vampire-bats-live-in-more-fluid-and-open-communities/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/ohio-1024x683.jpg", "publishedAt": "2021-07-07T11:53:42Z", "content": "Female vampire bats establish an egalitarian community within a roost rather than a society based on a clear hierarchy of dominance that is often seen in animal groups, a new study suggests.\r\nResearc… [+4969 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Geneva University team discovers inherited memories of a chromosomal site - India Education Diary", "description": "Most biological traits are inherited through genes, but there are exceptions to this rule. Two teams from the University of Geneva (UNIGE) have been investigating the location of centromeres – specific sites on chromosomes that are essential for cell", "url": "https://indiaeducationdiary.in/geneva-university-team-discovers-inherited-memories-of-a-chromosomal-site/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/geneva-1024x427.jpg", "publishedAt": "2021-07-07T11:45:55Z", "content": "Most biological traits are inherited through genes, but there are exceptions to this rule. Two teams from the University of Geneva (UNIGE) have been investigating the location of centromeres specific… [+3579 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Climate Change: Dragonfly Are Losing Their Shine And May Slowly Be Lost Forever - India Times", "description": "Dragonflies are definitely one of the most beautiful insects out there. As kids, most of us remember imagining them as tiny flying helicopters, with a shiny green lustre that made them stand out. However, now, due to climate change, this lustre is fading away…", "url": "https://www.indiatimes.com/technology/science-and-future/climate-change-dragonfly-shine-loss-544430.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jul/Facebook-Image-14_60e5693235674.jpg", "publishedAt": "2021-07-07T09:34:23Z", "content": "Dragonflies are definitely one of the most beautiful insects out there. As kids, most of us remember imagining them as tiny flying helicopters, with a shiny green lustre that made them stand out. How… [+1973 chars]"}]}