{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Sahil Mirani", "title": "How many people are on the ISS? Interesting facts about the International Space Station - Republic World", "description": "How many people are on the ISS is a commonly asked question amongst the users. So to help them out, we have listed some information about ISS right here. Read", "url": "https://www.republicworld.com/technology-news/science/how-many-people-are-on-the-iss-interesting-facts-about-the-international-space-station.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/vpljn4fgbpp5suc3_1619160047.jpeg?tr=f-jpeg", "publishedAt": "2021-04-23T08:13:00Z", "content": "ISS has been a popular topic since SpaceX has confirmed a launch to the station lately. Because of this a number of users have been asking some specific questions like how many people are on the ISS.… [+2239 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Watch Video: NASA’s Ingenuity Mars Helicopter Successfully Makes Second Flight On Mars! - Mashable India", "description": "Ingenuity mini-helicopter successfully completed its second Mars flight on April 22 where it was airborne for 51.9 seconds - a much longer duration than its first flight that took place on April 19.", "url": "https://in.mashable.com/science/21790/watch-video-nasas-ingenuity-mars-helicopter-successfully-makes-second-flight-on-mars", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/26368/26368_dxmq.jpg", "publishedAt": "2021-04-23T07:00:24Z", "content": "It was on April 19, 2021 when NASAs Ingenuity Mars mini-helicopter successfully took its first controlled flight on Mars. And now the Ingenuity mini-helicopter successfully completed its second Mars … [+2080 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Space junk animation shows how Earth’s satellites dodge dangerous debris - Digital Trends", "description": "Space junk is an increasing problem and poses a threat to active satellites and even human life. Here's what one space agency is doing to deal with it.", "url": "https://www.digitaltrends.com/news/how-earths-satellites-dodge-dangerous-space-debris/", "urlToImage": "https://img.dtcn.com/image/digitaltrends/space_debris_around_earth-1200x630-c-ar1.91.jpg", "publishedAt": "2021-04-23T04:30:05Z", "content": "Space junk is defined as an old satellite that has either stopped working or been shut down at the end of its mission. The debris also consists of fragments that result from a collision with a satell… [+2784 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "A black hole dubbed 'the Unicorn' may be galaxy's smallest one - Moneycontrol", "description": "The researchers said the black hole is roughly three times the mass of our sun, testing the lower limits of size for these extraordinarily dense objects that possess gravitational pulls so strong not even light can escape.", "url": "https://www.moneycontrol.com/news/world/a-black-hole-dubbed-the-unicorn-may-be-galaxys-smallest-one-6805591.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/Blackhole-770x433.jpg", "publishedAt": "2021-04-23T04:06:14Z", "content": "Scientists have discovered what may be the smallest-known black hole in the Milky Way galaxy and the closest to our solar system - an object so curious that they nicknamed it 'the Unicorn.'\r\nThe rese… [+3195 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SpaceX To Launch Crewed Flight To ISS Today After Losing Day To Bad Weather - NDTV", "description": "SpaceX is set to launch its third crew to the International Space Station early Friday (local time), reusing a rocket and crew capsule in a human mission for the first time.", "url": "https://www.ndtv.com/world-news/spacex-set-to-launch-crewed-flight-to-international-space-station-today-after-losing-day-to-bad-weather-2419989", "urlToImage": "https://c.ndtvimg.com/2020-11/ghkmi7bk_spacex-falcon-9-rocket_625x300_14_November_20.jpg", "publishedAt": "2021-04-23T02:55:32Z", "content": "Crew-2 mission will reuse capsule from Demo-2, the Falcon 9 booster deployed for uncrewed Demo-1 mission\r\nUnited States: SpaceX is set to launch its third crew to the International Space Station earl… [+4397 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Astronomers Trace Wild 22-Million-Year Journey of a Meteorite That Crashed to Earth - ScienceAlert", "description": "The asteroid 2018 LA crashed into Earth in the Kalahari Desert on 2 June 2018 – and now scientists have been able to trace it back 22 million years to the place where it originated from.", "url": "https://www.sciencealert.com/astronomers-trace-22-million-year-journey-of-a-meteorite-that-crashed-to-earth", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/skymap-1_1024.jpg", "publishedAt": "2021-04-23T02:04:39Z", "content": "The asteroid2018 LA crashed into Earth in the Kalahari Desert on 2 June 2018 and now scientists have been able to trace it back 22 million years to the place where it originated from.\r\nThis is the fi… [+3420 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Meet the 'blobs', the unusual space companions of French astronaut Thomas Pesquet - Space Bollyinside - BollyInside", "description": "Blob, or physarum polycephalum, its scientific name, is a living species difficult to classify: it is neither animal, plant, nor fungus. Composed of a", "url": "https://www.bollyinside.com/news/meet-the-blobs-the-unusual-space-companions-of-french-astronaut-thomas-pesquet", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-22T18:32:46Z", "content": "Blob, or physarum polycephalum, its scientific name, is a living species difficult to classify: it is neither animal, plant, nor fungus. Composed of a single cell and several nuclei, it is one of the… [+2612 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "April 22 was Earth Day — Let's protect our Mother Earth, keep it green - Daily Pioneer", "description": "Sometimes, we see whitish broadband like a white glowing path across the sky on a clear starry night. It is a cluster of millions of stars. This band is the Milky Way galaxy. Our solar system is a part of this galaxy. In ancient India, it was imagined to be a…", "url": "https://www.dailypioneer.com/2021/state-editions/april-22-was-earth-day-----let---s-protect-our-mother-earth--keep-it-green.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2021-04-22T18:31:34Z", "content": "Sometimes, we see whitish broadband like a white glowing path across the sky on a clear starry night. It is a cluster of millions of stars. This band is the Milky Way galaxy. Our solar system is a pa… [+4353 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Cooperative male dolphins can tell who's on their team - India Education Diary", "description": "When it comes to friendships and rivalries, male dolphins know who the good team players are. New findings, published in Nature Communications by University of Bristol researchers, reveal that male dolphins form a social concept of team membership ba", "url": "https://indiaeducationdiary.in/university-of-bristol-cooperative-male-dolphins-can-tell-whos-on-their-team/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2-1024x309.png", "publishedAt": "2021-04-22T18:09:37Z", "content": "When it comes to friendships and rivalries, male dolphins know who the good team players are. New findings, published in Nature Communications by University of Bristol researchers, reveal that male d… [+1964 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "Record-breaking flare spotted on Sun's nearest neighbour - The Shillong Times", "description": "New York, April 22 : Scientists have spotted the largest flare ever recorded from the sun's nearest neighbour, the star Proxima Centauri.Proxima Centauri is a small but mighty star. It sits just four light-years or more than 20 trillion miles from ou", "url": "https://theshillongtimes.com/2021/04/23/record-breaking-flare-spotted-on-suns-nearest-neighbour/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2021/04/Sun.jpg", "publishedAt": "2021-04-22T15:42:39Z", "content": "New York, April 22 : Scientists have spotted the largest flare ever recorded from the sun’s nearest neighbour, the star Proxima Centauri.Proxima Centauri is a small but mighty star. It sits just four… [+1970 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Jeff Spry", "title": "Sorry, Jurassic Park chase fans! New study finds T-Rex wasn't known for its sprinting skills - SYFY WIRE", "description": "By now we've all committed to memory the wild scene in 1993's Jurassic Park where a rampaging Tyrannosaurus rex is chasing down a gas-powered Jeep on Isla Nublar, with the vehicle's side mirror indicating that \"objects in mirror are closer than they appear.\"", "url": "https://www.syfy.com/syfywire/new-study-shows-t-rex-wasnt-known-for-sprinting-skills", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/2021/04/trex.jpg?offset-x=0", "publishedAt": "2021-04-22T13:41:38Z", "content": "By now we've all committed to memory the wild scene in 1993's Jurassic Park where a rampaging Tyrannosaurus rex is chasing down a gas-powered Jeep on Isla Nublar, with the vehicle's side mirror indic… [+3464 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Elon Musk trolled on Earth Day with Mars Sucks billboard outside SpaceX headquarters - India Today", "description": "A Los Angeles creative agency Activista placed a billboard outside SpaceX’s California headquarters which reads “Mars Sucks.” It criticises Musk’s plans on colonising Mars and notes that the earth should be prioritised.", "url": "https://www.indiatoday.in/technology/news/story/elon-musk-trolled-on-earth-day-with-mars-sucks-billboard-outside-spacex-headquarters-1793913-2021-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202104/Screenshot_2021-04-14_at_5.51._0-647x363.png?5ENEqGZj1BiM_hIQJQlor0.eVf4LV48K", "publishedAt": "2021-04-22T11:28:16Z", "content": "Space X and Tesla CEO Elon Musks plans to colonise Mars are not unknown to his followers. Back in 2016, Musk at a conference had noted that the planned InterplanetaryTransport System (ITS) will be ma… [+2571 chars]"}, {"source": {"id": null, "name": "Sify News"}, "author": "IANS", "title": "Record-breaking flare spotted on Sun's nearest neighbour - Sify News", "description": "New York, April 22 (IANS) Scientists have spotted the largest flare ever recorded from the suns nearest neighbour, the star Proxima Centauri.", "url": "https://www.sify.com/news/record-breaking-flare-spotted-on-suns-nearest-neighbour-news-education-vewllEbiabjfg.html", "urlToImage": "https://www.sify.com/images/news-183x123.jpg", "publishedAt": "2021-04-22T11:11:40Z", "content": "It's also a \"red dwarf,\" the name for a class of stars that are unusually petite and dim, explained Meredith MacGregor, astrophysicist at the University of Colorado Boulder.\r\nFor the new study, publi… [+1664 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Roberto Molar Candanosa", "title": "Earth's cryosphere is vital for everyone - Phys.org", "description": "Everything on our planet—the land, the water, the air, people—is connected by the various chemical, physical and biological processes that make up what we call the Earth system.", "url": "https://phys.org/news/2021-04-earth-cryosphere-vital.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/earthscryosp.jpg", "publishedAt": "2021-04-22T07:25:45Z", "content": "Everything on our planetthe land, the water, the air, peopleis connected by the various chemical, physical and biological processes that make up what we call the Earth system.\r\nOne of the key compone… [+7558 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler & ScienceAlert Staff", "title": "A New Search Has Begun For Moon Trees, The Glorious Legacy of Apollo 14 - ScienceAlert", "description": "Update (22 April 2021): Since we first wrote about the Moon Trees, interest in these wonderful living relics of the Apollo era has renewed. Now, the Royal Astronomical Society and the UK Space Agency have begun a quest to search for these trees acros", "url": "https://www.sciencealert.com/people-are-on-the-search-for-moon-trees-the-glorious-legacy-of-apollo-14", "urlToImage": "https://www.sciencealert.com/images/2019-07/processed/MoonSeedTreeWithBuidingCrop_1024.jpg", "publishedAt": "2021-04-22T04:43:49Z", "content": "Update (22 April 2021): Since we first wrote about the Moon Trees, interest in these wonderful living relics of the Apollo era has renewed. Now, the Royal Astronomical Society and the UK Space Agency… [+3709 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Watch 2 supermassive black holes dance around each other in a mesmerizing NASA animation - Business Insider", "description": "Black holes are encircled by a glowing disk of hot gas. When one black hole approaches another, its strong gravity can bend the other's light.", "url": "https://www.businessinsider.com/nasa-animation-supermassive-black-holes-orbiting-2021-4", "urlToImage": "https://i.insider.com/608051dc74da0300181e2fd1?width=1200&format=jpeg", "publishedAt": "2021-04-21T21:57:20Z", "content": "At the heart of every galaxy lies a black hole, where gravity is so strong that nothing can escape its boundary. Sometimes when two galaxies merge, their black holes get caught in lock-step, perpetua… [+2886 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Avery", "title": "'Safety nets' built by army ants could help engineers design self-healing robot swarms - Daily Mail", "description": "Army ants are blind and have no designated leader but researchers report the voracious foragers can build complex 'safety nets' that prevent workers carrying prey from falling off steep terrain.", "url": "https://www.dailymail.co.uk/sciencetech/article-9497121/Safety-nets-built-army-ants-help-engineers-design-self-healing-robot-swarms.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/21/22/42055800-0-image-a-23_1619040840213.jpg", "publishedAt": "2021-04-21T21:37:25Z", "content": "Teamwork isn't just a human characteristic: Colonies of army ants will form living 'scaffolding' to protect members from falling.\r\nThe insects are blind and have no designated leader but, according t… [+4551 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Bubble with titanium triggers titanic explosions - Phys.org", "description": "Scientists have found fragments of titanium blasting out of a famous supernova. This discovery, made with NASA's Chandra X-ray Observatory, could be a major step in pinpointing exactly how some giant stars explode.", "url": "https://phys.org/news/2021-04-titanium-triggers-titanic-explosions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-bubblewithti.jpg", "publishedAt": "2021-04-21T16:12:30Z", "content": "Scientists have found fragments of titanium blasting out of a famous supernova. This discovery, made with NASA's Chandra X-ray Observatory, could be a major step in pinpointing exactly how some giant… [+5312 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Humungous flare from sun's nearest neighbor breaks records - Nanowerk", "description": "Astronomers observed a record-setting flare from the star Proxima Centauri - a burst of energy roughly 100 times more powerful than any similar event seen from Earth's sun.", "url": "https://www.nanowerk.com/news2/space/newsid=57829.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57829.jpg", "publishedAt": "2021-04-21T16:08:13Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "First truly biodegradable PLASTICS that break down with heat and water within weeks developed - Daily Mail", "description": "Researchers embedded polyester-eating enzymes, protected by a special polymer wrapping, into polyester plastics as they were made.", "url": "https://www.dailymail.co.uk/sciencetech/article-9495407/Environment-truly-biodegradable-PLASTICS-developed-break-just-heat-water.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/21/15/42041652-0-image-a-58_1619016824339.jpg", "publishedAt": "2021-04-21T15:00:46Z", "content": "The first truly biodegradable plastics that break down in just a few weeks when exposed to heat and water have been developed by scientists.\r\nMost so-called 'compostable' plastics today are made of a… [+8556 chars]"}, {"source": {"id": null, "name": "Science X"}, "author": "Nathan James Enriquez", "title": "Fat-footed tyrannosaur parents couldn't keep up with their skinnier offspring, fossil footprints reveal - Science X", "description": "Tyrannosaurus rex is perhaps the most famous of all dinosaurs. It and its closest kin, a group referred to as \"tyrannosaurs,\" have been embedded in popular culture as powerful and mobile predators.", "url": "https://sciencex.com/news/2021-04-fat-footed-tyrannosaur-parents-couldnt-skinnier.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/fatfootedtyr.jpg", "publishedAt": "2021-04-21T13:22:19Z", "content": "Tyrannosaurus rex is perhaps the most famous of all dinosaurs. It and its closest kin, a group referred to as \"tyrannosaurs,\" have been embedded in popular culture as powerful and mobile predators.\r\n… [+5982 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Pearl Maria D'Souza", "title": "Deep Neural Networks can be made more human-like by training with large datasets: IISc study - EdexLive", "description": "They studied 13 different perceptual effects and found that Convolutional or deep neural networks that have their object representations match coarsely with the brain are still outperformed by humans", "url": "https://www.edexlive.com/news/2021/apr/21/deep-neural-networks-can-be-made-more-human-like-by-training-with-large-datasets-iisc-study-19956.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/4/21/w600X390/iiscs.jpg", "publishedAt": "2021-04-21T13:10:00Z", "content": "Researchers from the Indian Institute of Science (IISc) in their study have found crucial qualitative differences between the human brain and Deep Neural Networks, and these gaps can be filled by tra… [+2434 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Astronomers find an exoplanet where an exoplanet shouldn’t be - SYFY WIRE", "description": "Over 4,000 exoplanets — alien planets orbiting other stars — have been found by astronomers so far. There are a variety of ways to find them, most of which use indirect methods, but one of the coolest is quite direct: Getting actual images of the planets near…", "url": "https://www.syfy.com/syfywire/astronomers-find-an-exoplanet-where-an-exoplanet-shouldnt-be", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/art_hot_young_gasgiant.jpg?offset-y=0", "publishedAt": "2021-04-21T13:00:00Z", "content": "Over 4,000 exoplanets alien planets orbiting other stars have been found by astronomers so far.\r\nThere are a variety of ways to find them, most of which use indirect methods, but one of the coolest i… [+5431 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New conductive polymer ink opens for next-generation printed electronics: A high-conductivity n-type polymeric ink for printed electronics - Science Daily", "description": "Researchers have developed a stable high-conductivity polymer ink. The advance paves the way for innovative printed electronics with high energy efficiency.", "url": "https://www.sciencedaily.com/releases/2021/04/210421082849.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-21T12:53:11Z", "content": "Researchers at Linköping University, Sweden, have developed a stable high-conductivity polymer ink. The advance paves the way for innovative printed electronics with high energy efficiency. The resul… [+2780 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Saumya Agrawal", "title": "Shocking! Shark drags fisherman overboard and capsizes his boat - WATCH - Times Now", "description": "A dramatic footage of the confrontation which has gone viral shows the shark keenly pursuing the bait with its teeth bared, while Graham fights for control of his fishing rod. Watch:", "url": "https://www.timesnownews.com/the-buzz/article/shocking-shark-drags-fisherman-overboard-and-capsizes-his-boat-watch/747885", "urlToImage": "https://imgk.timesnownews.com/story/Shark_drags_fisherman_overboard.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-04-21T12:41:14Z", "content": "A shark dragged a fisherman underwater and capsized his boat off the Irish coast using pure brute strength. Graham Smith was plunged into the water after his kayak overturned.\r\nHe battled a \"very cle… [+1751 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Outback radio telescope discovers dense, spinning, dead star - Phys.org", "description": "Astronomers have discovered a pulsar—a dense and rapidly spinning neutron star sending radio waves into the cosmos—using a low-frequency radio telescope in outback Australia.", "url": "https://phys.org/news/2021-04-outback-radio-telescope-dense-dead.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/outbackradio.jpg", "publishedAt": "2021-04-21T11:54:11Z", "content": "Astronomers have discovered a pulsara dense and rapidly spinning neutron star sending radio waves into the cosmosusing a low-frequency radio telescope in outback Australia.\r\nThe pulsar was detected w… [+3354 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Dezell Turner", "title": "Hide and seek: How NASA's Lucy mission team discovered Eurybates' satellite - Phys.org", "description": "On Jan. 9, 2020, NASA's Lucy mission officially announced that it would be visiting not seven, but eight asteroids. As it turns out, Eurybates, one of the asteroids along Lucy's path, has a small satellite.", "url": "https://phys.org/news/2021-04-nasa-lucy-mission-team-eurybates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/hideandseekh.gif", "publishedAt": "2021-04-21T11:49:48Z", "content": "On Jan. 9, 2020, NASA's Lucy mission officially announced that it would be visiting not seven, but eight asteroids. As it turns out, Eurybates, one of the asteroids along Lucy's path, has a small sat… [+9309 chars]"}, {"source": {"id": null, "name": "Wales Online"}, "author": "Erin Santillo", "title": "Pink supermoon coming this month – here's how to see it - Hull Live", "description": "The timings, weather forecast and history of the rare astronomical phenomenon", "url": "https://www.walesonline.co.uk/whats-on/whats-on-news/pink-supermoon-coming-month--20432532", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18197519.ece/ALTERNATES/s1200/0_Pink-Supermoon.jpg", "publishedAt": "2021-04-21T10:10:20Z", "content": "Stargazers are in for a treat this coming week as a so-called 'pink supermoon' is set to appear.\r\nApril's full moon will be the biggest and brightest of 2021 as it approaches the closest point to Ear… [+2289 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Scientists in Chile discover remains of plant-eating dinosaur amid world´s driest desert - The Tribune", "description": "", "url": "https://www.tribuneindia.com/news/schools/scientists-in-chile-discover-remains-of-plant-eating-dinosaur-amid-world%c2%b4s-driest-desert-242181", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/4/2021_4$largeimg_1539140389.jpg", "publishedAt": "2021-04-21T09:14:00Z", "content": "Scientists in Chile's parched Atacama desert, the world's driest, have discovered the remains of a previously unknown species of dinosaur that millions of years ago lived among lush greenery in what … [+1321 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "How to watch SpaceX launch astronauts to the ISS early Thursday - Digital Trends", "description": "NASA and SpaceX will once again be working together to launch four astronauts to the International Space Station. We've got the details on how to watch.", "url": "https://www.digitaltrends.com/news/spacex-nasa-crew-2-how-to-watch/", "urlToImage": "https://img.dtcn.com/image/digitaltrends/51084589487_1ebbc1f7c7_k1-1200x630-c-ar1.91.jpg", "publishedAt": "2021-04-21T09:02:04Z", "content": "This week, NASA and SpaceX will once again be working together to launch four astronauts on a journey to the International Space Station. NASA will be livestreaming the event, so you can follow along… [+2420 chars]"}]}