{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Appearance, social norms keep students from turning on their Zoom cameras, find researchers - EdexLive", "description": "In the survey, the team found that among underrepresented minorities, 38 per cent said they were concerned about other people being seen behind them", "url": "https://www.edexlive.com/news/2021/jan/20/appearance-social-norms-keep-students-from-turning-on-their-zoom-cameras-find-researchers-17445.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/4/25/w600X390/zoom_afp.jpg", "publishedAt": "2021-01-20T12:23:00Z", "content": "Ever thought why some students do not turn on their video cameras during online classes on Zoom? Because they may be more concerned about their privacy or how they look, researchers said in a new stu… [+1902 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Scientists investigate planetary nebulae using Hubble Space Telescope - Open Access Government", "description": "Images from the Hubble Space Telescope are giving astronomers the chance to further investigate planetary nebulae - like the Jewel Bug Nebula (NGC 7027)", "url": "https://www.openaccessgovernment.org/investigate-planetary-nebulae/101876/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/01/dreamstime_xxl_44364214.jpg", "publishedAt": "2021-01-20T11:25:00Z", "content": "Recently, astronomers collectively agreed that the universe is around 14 billion years old. As telescope data and theoretical models are further studied, more revelations keep coming from the space f… [+3566 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "NASA’s Chandra X-Ray Observatory Telescope Captures Stunning Image Of A Supernova - Mashable India", "description": "NASA recently shared an image of a supernova captured by the Chandra X-ray Observatory telescope.", "url": "https://in.mashable.com/science/19686/nasas-chandra-x-ray-observatory-telescope-captures-stunning-image-of-a-supernova", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/24110/24110_c7ut.jpg", "publishedAt": "2021-01-20T11:15:00Z", "content": "The National Aeronautics and Space Administration (NASA) recently shared an image of a supernova captured by the Chandra X-ray Observatory telescope. NASA shared the fascinating image of the supernov… [+1492 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "A new view of small sun structures - Tech Explorist", "description": "Scientists have combined NASA data and cutting-edge image processing to gain new insight into the small sun structures that create the Sun’s flow of high-speed solar wind.", "url": "https://www.techexplorist.com/new-view-small-sun-structures/37408/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/Sun.jpg", "publishedAt": "2021-01-20T11:09:00Z", "content": "By combining NASA data and advanced image processing, scientists offer new insight into the solar structures that create the Sun’s flow of high-speed solar wind. This first gander at moderately small… [+3153 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Bristol: All-purpose dinosaur opening reconstructed for the first time - India Education Diary", "description": "For the first time ever, a team of scientists, led by the University of Bristol, have described in detail a dinosaur’s cloacal or vent – the all-purpose opening used for defecation, urination and b…", "url": "https://indiaeducationdiary.in/university-of-bristol-all-purpose-dinosaur-opening-reconstructed-for-the-first-time/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/University_of_Bristol_logo-4.png?fit=1200%2C362&ssl=1", "publishedAt": "2021-01-20T10:24:00Z", "content": "For the first time ever, a team of scientists, led by the University of Bristol, have described in detail a dinosaurs cloacal or vent the all-purpose opening used for defecation, urination and breedi… [+2701 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarthak Dogra", "title": "Largest Animal Ever To Walk On Earth Has Probably Been Found In Argentina - India Times", "description": "A new pile of bones has been discovered by scientists in Argentina which are now being believed to have belonged to the largest dinosaur that ever lived. With this assumption, the dinosaur would also have been the largest land animal to have ever lived.      …", "url": "https://www.indiatimes.com/technology/science-and-future/largest-animal-dinosaur-on-earth-has-probably-been-discovered-in-argentina-532406.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jan/Sauropod_6007f8a271d26.jpg", "publishedAt": "2021-01-20T09:45:18Z", "content": "A new pile of bones has been discovered by scientists in Argentina which are now being believed to have belonged to the largest dinosaur that ever lived. With this assumption, the dinosaur would also… [+1965 chars]"}, {"source": {"id": null, "name": "Magazinebuzz.com"}, "author": "Bianca Dennis", "title": "A 100-million-year-old beetle fossil sheds light on the ancient insect family - Magazine Buzz", "description": "Close-up view of the well-preserved Cretophengodes azari beetle, a light-producing fossil beetle coated in amber. Chenyang Kai A beetle trapped in amber", "url": "https://magazinebuzz.com/a-100-million-year-old-beetle-fossil-sheds-light-on-the-ancient-insect-family/", "urlToImage": "https://magazinebuzz.com/wp-content/uploads/2021/01/A-100-million-year-old-beetle-fossil-sheds-light-on-the-ancient-insect.jpg", "publishedAt": "2021-01-20T08:56:00Z", "content": "Close-up view of the well-preserved Cretophengodes azari beetle, a light-producing fossil beetle coated in amber.\r\n Chenyang Kai\r\nA beetle trapped in amber for more than 100 million years provides sc… [+1534 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leah Burrows", "title": "Researchers develop a mathematical model to explain the complex architecture of termite mounds - Phys.org", "description": "Following a series of studies on termite mound physiology and morphogenesis over the past decade, researchers at the Harvard John A. Paulson School of Engineering and Applied Sciences have now developed a mathematical model to help explain how termites constr…", "url": "https://phys.org/news/2021-01-mathematical-complex-architecture-termite-mounds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/constructing.jpg", "publishedAt": "2021-01-20T08:44:24Z", "content": "Following a series of studies on termite mound physiology and morphogenesis over the past decade, researchers at the Harvard John A. Paulson School of Engineering and Applied Sciences have now develo… [+3678 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Viktor Rozsa", "title": "Do simulations represent the real world at the atomic scale? - Phys.org", "description": "Computer simulations hold tremendous promise to accelerate the molecular engineering of green energy technologies, such as new systems for electrical energy storage and solar energy usage, as well as carbon dioxide capture from the environment. However, the p…", "url": "https://phys.org/news/2021-01-simulations-real-world-atomic-scale.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/dosimulation.jpg", "publishedAt": "2021-01-20T08:38:43Z", "content": "Computer simulations hold tremendous promise to accelerate the molecular engineering of green energy technologies, such as new systems for electrical energy storage and solar energy usage, as well as… [+5714 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Western Australia: Scientists discover the oldest starfish-like fossil - India Education Diary", "description": "Scientists from The University of Western Australia have uncovered the oldest starfish-like fossil, Cantabrigiaster Fezouataensis, which is the first ancestor of all starfish in the world. The foss…", "url": "https://indiaeducationdiary.in/university-of-western-australia-scientists-discover-the-oldest-starfish-like-fossil/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-01-20T08:03:00Z", "content": "Scientists from The University of Western Australia have uncovered the oldest starfish-like fossil, Cantabrigiaster Fezouataensis, which is the first ancestor of all starfish in the world. \r\nThe foss… [+1768 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Cape Town: Gigantic galaxies discovered with the MeerKAT telescope - India Education Diary", "description": "Two giant radio galaxies – among the largest single objects in the universe, which were thought to be quite rare – have been discovered with South Africa’s powerful MeerKAT telescope. The discovery…", "url": "https://indiaeducationdiary.in/university-of-cape-town-gigantic-galaxies-discovered-with-the-meerkat-telescope/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-01-20T07:26:00Z", "content": "Two giant radio galaxies among the largest single objects in the universe, which were thought to be quite rare have been discovered with South Africas powerful MeerKAT telescope. The discovery has be… [+4882 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "What Is The Most Common Type Of Planet In The Universe? - Forbes", "description": "What we've seen isn't necessarily what we get, but the most common world doesn't look like ours.", "url": "https://www.forbes.com/sites/startswithabang/2021/01/20/what-is-the-most-common-type-of-planet-in-the-universe/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F57ced6114bbe6f6781c49917%2F0x0.jpg", "publishedAt": "2021-01-20T07:00:00Z", "content": "The exoplanet Proxima b, as shown in this artist's illustration, is thought to be inhospitable to ... [+] life due to the atmosphere-stripping behavior of its star. It should be an 'eyeball' world, w… [+16837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Assoicated Press", "title": "NASA’s Halted Rocket Test Could Stall Moon Shot, Redo Possible - Gadgets 360", "description": "NASA is considering a second firing of its Moon rocket engines after a critical test came up short over the weekend, a move that could bump the first flight in the Artemis lunar-landing program into next year.", "url": "https://gadgets.ndtv.com/science/news/nasa-moon-rocket-test-halted-stall-artemis-lunar-landing-2355194", "urlToImage": "https://i.gadgets360cdn.com/large/nasa_sls_twitter_1611124187412.jpg", "publishedAt": "2021-01-20T06:38:40Z", "content": "NASA is considering a second firing of its Moon rocket engines after a critical test came up short over the weekend, a move that could bump the first flight in the Artemis lunar-landing programme int… [+2790 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "MIT scientists proposed a way to grow certain plant tissues in lab - Tech Explorist", "description": "MIT researchers grow structures made of wood-like plant cells in a lab, hinting at the possibility of more efficient biomaterials production.", "url": "https://www.techexplorist.com/way-grow-certain-plant-tissues-lab/37397/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/grow-plant-based-materials.jpg", "publishedAt": "2021-01-20T06:12:00Z", "content": "MIT scientists’ new work offers a possible starting point for novel approaches to biomaterials production that ease the environmental burden of forestry and agriculture. They have developed a new way… [+3426 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarthak Dogra", "title": "Scientific Study Explains Why Some People Can Hear Spirits Of The Dead - India Times", "description": "In a recent study, researchers might have gained new insights into the reason why some people believe that they can ‘hear the dead’. The research is based on the largest-of-its-kind survey of the general population and such specialist mediums.                …", "url": "https://www.indiatimes.com/technology/science-and-future/scientific-study-people-hearing-spirit-of-dead-clairaudient-532350.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jan/Facebook-Thumbnail_6007c03d609bf.jpg", "publishedAt": "2021-01-20T05:35:36Z", "content": "In a recent study, researchers might have gained new insights into the reason why some people believe that they can hear the dead. The research is based on the largest-of-its-kind survey of the gener… [+2051 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Watch this astronaut prepare for his stay at the space station - Digital Trends", "description": "Astronaut Matthias Maurer will soon be taking his first space trip, flying to the ISS aboard SpaceX's Crew Dragon capsule. See how his training is going ...", "url": "https://www.digitaltrends.com/news/watch-this-astronaut-prepare-for-his-stay-at-the-space-station/", "urlToImage": "https://icdn4.digitaltrends.com/image/digitaltrends/astronaut-training-space-station-1200x630-c-ar1.91.jpg", "publishedAt": "2021-01-20T04:00:00Z", "content": "Astronaut Matthias Maurer has been training for his first space mission for the last five years.\r\nIn the fall, the 50-year-old German will finally get his chance to take a rocket ride as he travels t… [+2072 chars]"}, {"source": {"id": null, "name": "Magazinebuzz.com"}, "author": "Bianca Dennis", "title": "The perfect steak? Researchers make lab-grown meat even better-tasting and marbled made to order - Magazine Buzz", "description": "Hamilton, Ontario - Usually when you go to a steakhouse, the waiter asks you how you want the meat to be cooked. McMaster University researchers say they", "url": "https://magazinebuzz.com/the-perfect-steak-researchers-make-lab-grown-meat-even-better-tasting-and-marbled-made-to-order/", "urlToImage": "https://magazinebuzz.com/wp-content/uploads/2021/01/The-perfect-steak-Researchers-make-lab-grown-meat-even-better-tasting-and.jpg", "publishedAt": "2021-01-20T00:55:00Z", "content": "Hamilton, Ontario – Usually when you go to a steakhouse, the waiter asks you how you want the meat to be cooked. McMaster University researchers say they may soon ask how you want the steak to be “fi… [+2737 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Not all elected officials from KS, MO going to Biden's inauguration - KMBC 9", "description": "Some but not all members of Congress from the Kansas City area are going to be at Wednesday's inauguration.Subscribe to KMBC on YouTube now for more: http://...", "url": "https://www.youtube.com/watch?v=QGwhWIkeyoQ", "urlToImage": "https://i.ytimg.com/vi/QGwhWIkeyoQ/maxresdefault.jpg", "publishedAt": "2021-01-20T00:49:27Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Andy Tomaswick, Universe Today", "title": "Solar Wind Is Strangely Drawn to Earth's North Pole, And Scientists Don't Know Why - ScienceAlert", "description": "Likely the most well-known result of the Earth's magnetic field are the Aurora Borealis and Australis (Northern and Southern Lights). When charged particles from the solar wind run into the Earth's magnetic field, they can occasionally elicit sp", "url": "https://www.sciencealert.com/solar-wind-is-more-attracted-to-the-earth-s-north-pole-than-south-and-we-don-t-know-why", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/010-solar-wind_1024.jpg", "publishedAt": "2021-01-20T00:28:57Z", "content": "Likely the most well-known result of the Earth's magnetic field are the Aurora Borealis and Australis (Northern and Southern Lights). When charged particles from the solar wind run into the Earth's m… [+1750 chars]"}, {"source": {"id": null, "name": "Haveeru.com.mv"}, "author": "Max Grant", "title": "Cosmic giants create a new era in astronomy - haveeruonline", "description": "Some galaxies depart from their epicenter and expand beyond the galaxy via intercalactic media. In some cases, these jets, detected on radio frequencies,", "url": "https://www.haveeru.com.mv/cosmic-giants-create-a-new-era-in-astronomy/", "urlToImage": null, "publishedAt": "2021-01-19T23:38:44Z", "content": "Some galaxies depart from their epicenter and expand beyond the galaxy via intercalactic media. In some cases, these jets, detected on radio frequencies, stretch hundreds of thousands or even million… [+4016 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "Astronomers Discover 'Super Earth' That Is Almost as Old as the Universe - IGN - IGN", "description": "Astronomers have discovered a new Super Earth planet that's nearly as old as the universe itself.", "url": "https://www.ign.com/articles/super-earth-star-exoplanet-milky-way-astronomers-earth", "urlToImage": "https://assets1.ignimgs.com/2021/01/19/super-earth-1611084811608.jpg?width=1280", "publishedAt": "2021-01-19T22:22:59Z", "content": "Astronomers have discovered a new Super-Earth planet that's nearly as old as the universe itself, but despite what the name might indicate, the words \"Super Earth\" only speak to the exoplanet's size … [+2752 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Warped Egg Yolks Are Helping Scientists Understand How to Prevent Brain Injuries - ScienceAlert", "description": "Every day you walk around with your brain gently bobbing about inside your skull. Much like a soft egg yolk floating in a cloud of clear egg whites.", "url": "https://www.sciencealert.com/how-does-an-egg-yolk-deform-on-impact-the-answer-might-help-prevent-brain-injuries", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/010-egg-deformation_1024.jpg", "publishedAt": "2021-01-19T22:11:04Z", "content": "Every day you walk around with your brain gently bobbing about inside your skull. Much like a soft egg yolk floating in a cloud of clear egg whites.\r\nAll it takes is a sudden jolt or strike, and your… [+4629 chars]"}, {"source": {"id": null, "name": "Nerdist"}, "author": null, "title": "NASA Detects First FM Radio Signal from Jupiter Moon Ganymede - Nerdist", "description": "NASA's Juno spacecraft has discovered an FM radio burst from Jupiter's gigantic moon Ganymede for the first time ever.", "url": "https://nerdist.com/article/nasa-detects-fm-radio-signal-jupiter-moon-ganymede/", "urlToImage": "https://nerdist.com/wp-content/uploads/2021/01/NASA-Juno-FM-Radiof-feature-image-01192020.jpg", "publishedAt": "2021-01-19T21:33:18Z", "content": "NASA’s Juno spacecraft has detected, for the first time, an FM radio signal coming from the moon Ganymede. And while it’s certainly not aliens producing the signal, the finding still helps to fill ou… [+1807 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Dinosaur bones 'were flung to the moon when an asteroid hit Earth' - Daily Mail", "description": "Dinosaur bones are 'probably' on the moon, according to scientists who speculate the asteroid that hit the Earth 66 million years ago sent debris into space that carried along bits of dinosaurs.", "url": "https://www.dailymail.co.uk/sciencetech/article-9164967/Dinosaur-bones-flung-moon-asteroid-smashed-Earth-scientists-claim.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/19/21/38217282-0-image-a-46_1611090466549.jpg", "publishedAt": "2021-01-19T21:13:00Z", "content": "Although Neil Armstrong was the first human to step foot on the moon in 1967, dinosaurs may have beat him to it 66 million years prior or at least pieces of the prehistoric creatures did.\r\nThe claim … [+4702 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Scientist calls fossilized assassin bug private parts 'a rare treat' - CNET", "description": "A stunningly well-preserved 50-million-year-old fossil is giving insights into insect history.", "url": "https://www.cnet.com/news/scientist-calls-fossilized-assassin-bug-private-parts-a-rare-treat/", "urlToImage": "https://cnet3.cbsistatic.com/img/PZuDzCukUNM5gNYokPpxoJTe_jU=/1200x630/2021/01/18/594dd721-9a69-43d3-be17-22a066ce7dd1/assassingbuglarge.jpg", "publishedAt": "2021-01-19T18:53:00Z", "content": "Found in Colorado, this fossil is a species now called Aphelicophontes danjuddi. A small beetle also appears with the larger assassin bug.\r\nDaniel Swanson/Palaeontological Association\r\nPerhaps the ph… [+1606 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Mystery particle may explain extreme X-rays shooting from the 'Magnificent 7' stars - Livescience.com", "description": "Never-before-seen particles called axions could be behind the mysterious X-rays.", "url": "https://www.livescience.com/neutron-star-axion-particles.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zyw4jokMbX8eomNyT4ZA2E-1200-80.jpg", "publishedAt": "2021-01-19T18:10:00Z", "content": "More than 400 light-years from Earth, there is a cluster of young neutron stars that are too hot for their age. These stars, known as the \"Magnificent Seven,\" emit a stream of ultra-high-energy X-ray… [+4144 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Abbott’s Binax Misses Some Covid Cases, Making Repeat Tests Key - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=8803d3b0-5afd-11eb-bec5-f9509bb74ada&url=L25ld3MvYXJ0aWNsZXMvMjAyMS0wMS0xOS9hYmJvdHQtcy1iaW5heC1taXNzZXMtc29tZS1jb3ZpZC1jYXNlcy1tYWtpbmctcmVwZWF0LXRlc3RzLWtleT9zcm5kPXByb2dub3Npcw==", "urlToImage": null, "publishedAt": "2021-01-19T18:00:00Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Mystery of Martian glaciers revealed - Nanowerk", "description": "Research shows Mars had as many as six to 20 ice ages during the past 300-800 million years.", "url": "https://www.nanowerk.com/news2/space/newsid=57056.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57056.jpg", "publishedAt": "2021-01-19T16:58:30Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Heavy.com"}, "author": "The Conversation", "title": "How to Stay Safe With a New COVID-19 Variant on the Loose - Heavy.com", "description": "The new COVID-19 coronavirus variant has been estimated to be 50% more transmissible. It's already been detected in at least 20 US states.", "url": "https://heavy.com/news/new-fast-spreading-coronavirus-covid19-variant", "urlToImage": "https://heavy.com/wp-content/uploads/2021/01/49557550836_c9a8b05db4_o-e1611074983168.jpg?quality=65&strip=all&w=780", "publishedAt": "2021-01-19T16:51:00Z", "content": "National Institute of Allergies and Infectious Diseases\r\nThe new SARS-CoV-2 variants increased transmissibility is believed to come from a change in the spike protein, visible here in yellow under an… [+5670 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Alcohols exhibit quantum effects - EurekAlert", "description": "Skoltech scientists and their colleagues from the Russian Quantum Center revealed a significant role of nuclear quantum effects in the polarization of alcohol in an external electric field.  The new research provides insight into the properties of liquid diel…", "url": "https://www.eurekalert.org/pub_releases/2021-01/sios-aeq011921.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-01-19T16:22:50Z", "content": "Skoltech scientists and their colleagues from the Russian Quantum Center revealed a significant role of nuclear quantum effects in the polarization of alcohol in an external electric field. Their res… [+2656 chars]"}, {"source": {"id": null, "name": "AiThority"}, "author": "AIT News Desk", "title": "Satellogic and SpaceX Announce Multiple Launch Agreement - AiThority", "description": "First mission, scheduled for mid-2021, will further expand Satellogic’s industry-leading in-orbit capacitySatellogic, the first company to develop a scalable Earth observation platform with the ability to remap the entire planet at both high-frequenc", "url": "https://aithority.com/technology/analytics/satellogic-and-spacex-announce-multiple-launch-agreement/", "urlToImage": "https://aithority.com/wp-content/uploads/2021/01/Satellogic-and-SpaceX-Announce-Multiple-Launch-Agreement.jpg", "publishedAt": "2021-01-19T16:22:35Z", "content": "First mission, scheduled for mid-2021, will further expand Satellogics industry-leading in-orbit capacity\r\nSatellogic, the first company to develop a scalable Earth observation platform with the abil… [+3936 chars]"}, {"source": {"id": null, "name": "International Business Times, Singapore Edition"}, "author": "https://www.ibtimes.sg/reporters/poulami-nag", "title": "NASA 's Chandra X-ray Snaps Breathtaking Photo of Supernova, Social Media Users Excited - International Business Times, Singapore Edition", "description": "NASA's Supernova image created a euphoria on the social media platform with more than 20,246 likes on the post.", "url": "https://www.ibtimes.sg/nasa-s-chandra-x-ray-snaps-breathtaking-photo-supernova-social-media-users-excited-55006", "urlToImage": "https://data.ibtimes.sg/en/full/40746/supernova.jpg", "publishedAt": "2021-01-19T16:08:06Z", "content": "American space agency National Aeronautics and Space Administration (NASA) managed to capture a historic moment after it snapped a bright source of light at the center of supernova RCW 103 remnant in… [+2371 chars]"}, {"source": {"id": null, "name": "Robohub.org"}, "author": "Guido de Croon", "title": "Self-supervised learning of visual appearance solves fundamental problems of optical flow - Robohub", "description": "Self-supervised learning of visual appearance solves fundamental problems of optical flow", "url": "https://robohub.org/self-supervised-learning-of-visual-appearance-solves-fundamental-problems-of-optical-flow/", "urlToImage": "https://robohub.org/wp-content/uploads/2021/01/thumbnail_video_transparent_background_featured-1024x683.jpeg", "publishedAt": "2021-01-19T16:02:00Z", "content": "Flying insects as inspiration to AI for small drones\r\nHow do honeybees land on flowers or avoid obstacles? One would expect such questions to be mostly of interest to biologists. However, the rise of… [+8984 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Spinning egg yolks hint at how concussions warp the brain - Livescience.com", "description": "", "url": "https://www.livescience.com/egg-yolk-concussion-study.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oEB6dVLXc3aTwqUFgURmfS-1200-80.png", "publishedAt": "2021-01-19T16:01:00Z", "content": "How do you study concussions without cracking any skulls? Try using an egg scrambler.\r\nIn a new study, published Jan. 19 in the journal Physics of Fluids\r\n, scientists drew inspiration from how egg\r\n… [+5377 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Yasmin Anwar-UC Berkeley", "title": "Your wandering mind is a 'feature,' not a bug - Futurity: Research News", "description": "Researchers have a way to show whether our minds are focused, fixated, or wandering. They've found that a wandering mind might actually be helpful, too.", "url": "https://www.futurity.org/wandering-minds-brains-eeg-focus-2503142/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2021/01/mind-wandering-focus-1600.jpg", "publishedAt": "2021-01-19T15:51:12Z", "content": "Researchers have come up with a way to track the flow of our internal thought processes and signal whether our minds are focused, fixated, or wandering.\r\nUsing an electroencephalogram (EEG) to measur… [+4698 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "New Wastewater Treatment Process Degrades Microplastics at Source - AZoCleantech", "description": "At the Institut national de la recherche scientifique (INRS), a research group under Professor Patrick Drogui has created a new process for the electrolytic treatment of wastewater that breaks down microplastics at the source.", "url": "https://www.azocleantech.com/news.aspx?newsID=28682", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_28682_16110568748838679.png", "publishedAt": "2021-01-19T15:39:00Z", "content": "Written by AZoCleantechJan 19 2021\r\nAt the Institut national de la recherche scientifique (INRS), a research group under Professor Patrick Drogui has created a new process for the electrolytic treatm… [+3656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Missing: One black hole with 10 billion solar masses - The Indian Express", "description": "In the past few decades, it has become part of astronomical lore that at the center of every galaxy lurks a giant black hole into which the equivalent of millions or even billions of suns have disappeared. The bigger the galaxy, the more massive the black hol…", "url": "https://indianexpress.com/article/technology/science/black-hole-galaxy-astronomy-7153203/", "urlToImage": "https://images.indianexpress.com/2021/01/NASA-Black-hole.jpg", "publishedAt": "2021-01-19T15:28:03Z", "content": "Written by Dennis Overbye\r\nAstronomers are searching the cosmic lost-and-found for one of the biggest, baddest black holes thought to exist. So far they havent found it.\r\nIn the past few decades, it … [+9648 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Team EastMojo", "title": "Star sisters: String of stars in Milky Way born at the same time move together - EastMojo", "description": "Examination of Theia 456 finds its nearly 500 stars were born at the same time", "url": "https://www.eastmojo.com/world/2021/01/19/star-sisters-string-of-stars-in-milky-way-born-at-the-same-time-move-together", "urlToImage": "https://gumlet.assettype.com/eastmojo%2F2021-01%2F38a9b09a-06de-424f-93dd-e6aa0e5df21c%2Fandrews_stellar_stream.jpeg?rect=0%2C5%2C640%2C336&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-01-19T12:45:00Z", "content": "While researchers have long known that stars form in groups, most known clusters are spherical in shape. Only recently have astrophysicists started to find new patterns in the sky. They believe long … [+1584 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA releases videos of space taken from International Space Station - FOX59 News", "description": "NASA releases videos of space taken from International Space Station.", "url": "https://www.youtube.com/watch?v=fZQ_y8MifpU", "urlToImage": "https://i.ytimg.com/vi/fZQ_y8MifpU/maxresdefault.jpg", "publishedAt": "2021-01-19T12:18:49Z", "content": null}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "New tissue engineering process brings lab-grown organs one step closer - Drug Target Review", "description": "Researchers have developed a new technique that that could one day enable us to grow fully functional human organs in the laboratory.", "url": "https://www.drugtargetreview.com/news/81080/new-tissue-engineering-process-brings-lab-grown-organs-one-step-closer/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/laboratory-grown-organs.jpg", "publishedAt": "2021-01-19T12:17:35Z", "content": "Posted: 19 January 2021 | Hannah Balfour (Drug Target Review) | No comments yet\r\nResearchers have developed a new technique that that could one day enable us to grow fully functional human organs in … [+4596 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Four asteroids headed Earth`s way on day of Joe Biden`s inauguration as US president - WION", "description": "Joe Biden is set to take over presidential duties in the United States starting January 20. Besides pro-Trump rioters, celestial objects may now be in his way.", "url": "https://www.wionews.com/world/four-asteroids-headed-earths-way-on-day-of-joe-bidens-inauguration-as-us-president-357734", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/01/19/179108-httpsattachmentsofficenetowabharatsharma40zeemediaesselgroupcomservicesvcsgetreferenceattachmentattachmentidaamkagvmnjcwyzbiltyyytytngy0ny1hzgqzltm0otu2nwu3nmjlnqbgaaaaaabxcl4cu4u2toquomfode3abwa3p62.jpg", "publishedAt": "2021-01-19T12:10:50Z", "content": "Joe Biden is set to take over presidential duties in the United States starting January 20. Besides pro-Trump rioters, celestial objects may now be in his way.\r\nOver the next few days, a series of as… [+1544 chars]"}, {"source": {"id": null, "name": "ChronicleLive"}, "author": "Jonathan Walker", "title": "One in eight people in the North East has had coronavirus - Chronicle Live", "description": "New data shows how many people have antibodies, suggesting they were infected in the past", "url": "https://www.chroniclelive.co.uk/news/north-east-news/one-eight-people-north-east-19653562", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article19644918.ece/ALTERNATES/s1200/0_Coronavirus-Mon-Jan-18-2021.jpg", "publishedAt": "2021-01-19T12:00:00Z", "content": "One in eight people in the North East have had coronavirus, new figures show.\r\nData from the Office for National Statistics shows that 12.5% of people of people in the North East tested positive for … [+1874 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Scientists Discover The Most Distant Quasar Accompanied By The Oldest Black Hole Ever! - Mashable India", "description": "It has recently come to light that astronomers have discovered the oldest supermassive black hole (SMBH) ever along with the most distant quasar.", "url": "https://in.mashable.com/science/19665/scientists-discover-the-most-distant-quasar-accompanied-by-the-oldest-black-hole-ever", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/24090/24090_2yv9.jpg", "publishedAt": "2021-01-19T11:40:00Z", "content": "It has recently come to light that astronomers have discovered the oldest supermassive black hole (SMBH) ever along with the most distant quasar. The discovery of this black hole was announced during… [+1911 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Tiny, mineral grains could explain a fundamental tectonic force - Tech Explorist", "description": "A new study suggests that tiny, mineral grains — squeezed and mixed over millions of years — set in motion the chain of events that plunge massive tectonic plates deep into the Earth’s interior.", "url": "https://www.techexplorist.com/tiny-mineral-grains-explain-fundamental-tectonic-force/37389/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/Mylonite.jpg", "publishedAt": "2021-01-19T10:02:00Z", "content": "Subduction happens when one tectonic plate slides under another plate and then sinks into the Earth’s mantle. Its role in geological and measures is huge: It is the main engine for tectonic motion. I… [+1798 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tom Fish", "title": "Meteor video: Watch fireball streak over Sydney - ‘Most insane thing I’ve ever seen’ - Daily Express", "description": "METEOR experts have examined dashcam footage of fireball incinerating unusually high-up in the heavens over Australia.", "url": "https://www.express.co.uk/news/science/1385890/meteor-video-watch-fireball-sydney-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1385890.jpg", "publishedAt": "2021-01-19T08:41:00Z", "content": null}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "SpaceX Starlink launch: How to watch Falcon 9 drop 60 satellites into orbit Wednesday - CNET", "description": "If you think this is becoming routine, think again. This will be the first attempt to reuse a rocket booster eight times.", "url": "https://www.cnet.com/how-to/spacex-starlink-launch-how-to-watch-falcon-9-drop-60-satellites-into-orbit-wednesday/", "urlToImage": "https://cnet1.cbsistatic.com/img/s6IucyNECMIgERWHkLLTlEREJAs=/1200x630/2020/08/31/0832de2e-1f48-442f-ac4f-5f5c1539285d/egxpl5rucaatfpr.jpg", "publishedAt": "2021-01-19T08:24:00Z", "content": "A Falcon 9 blasts off on Aug. 30.\r\nSpaceX\r\nSpaceX will launch a batch of 60 satellites from the Kennedy Space Center in Florida on Wednesday, in what will be the first Starlink launch for the year an… [+1370 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Researchers May Have Heard The ‘Humming Sound’ Of The Universe For The First Time Ever! - Mashable India", "description": "Scientists at NANOGrav have detected, what seems to be, the ‘resonant hum’ (also referred to as the ‘gravitational wave background’) of the universe for the first time.", "url": "https://in.mashable.com/science/19659/researchers-may-have-heard-the-humming-sound-of-the-universe-for-the-first-time-ever", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/24081/24081_u5nj.jpg", "publishedAt": "2021-01-19T08:15:00Z", "content": "Scientists at the North American Nanohertz Observatory for Gravitational Waves (NANOGrav) have detected, what seems to be, the resonant hum (also referred to as the gravitational wave background) of … [+1799 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Nasa shares Chandra X-ray image of dazzling supernova - India Today", "description": "Nasa shared an image of a supernova captured by the Chandra X-ray Observatory and said the telescope captured a bright source of light at the center of the supernova.", "url": "https://www.indiatoday.in/science/story/nasa-shares-chandra-x-ray-image-of-dazzling-supernova-1760535-2021-01-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/1_770_0-647x363.jpeg?0sBXROQCwCkkSQlG.vQoep2XiC_w4vxZ", "publishedAt": "2021-01-19T08:03:53Z", "content": "The National Aeronautics and Space Administration (Nasa) has shared a dazzling image of a supernova captured by the Chandra X-ray Observatory telescope. Nasa shared the image of the supernova on its … [+1032 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "Was the Earth really spinning faster in 2020? - Tech News Inc", "description": "Some scientists claim that the planet Earth rotated faster during the year 2020. However, others advocate relativity and believe that this is a natural", "url": "https://technewsinc.com/was-the-earth-really-spinning-faster-in-2020/", "urlToImage": "https://images.bfmtv.com/VNxqEqPqG8kObNLfUZHWF0EJAYg=/0x0:2048x1152/2048x0/images/La-planete-Terre-537691.jpg", "publishedAt": "2021-01-19T06:46:49Z", "content": "Some scientists claim that the planet Earth rotated faster during the year 2020. However, others advocate relativity and believe that this is a natural phenomenon, not a trend.\r\nMany scientists agree… [+3410 chars]"}, {"source": {"id": null, "name": "Get Reading"}, "author": "Shazad Hussain", "title": "New walk-in Covid-19 testing facility to open at Prospect Park in Reading - Berkshire Live", "description": "Only those who pre-book an appointment can take a test at the site", "url": "https://www.getreading.co.uk/news/reading-berkshire-news/covid-test-site-prospect-reading-19650093", "urlToImage": "https://i2-prod.getreading.co.uk/incoming/article19650374.ece/ALTERNATES/s1200/0_CaptureJPG.jpg", "publishedAt": "2021-01-19T05:05:08Z", "content": "A new walk-in Covid-19 testing facility is opening in Reading's Prospect Park on Friday.\r\nThe site is designed for people to walk-in and take a test meaning it is pedestrian access only - people will… [+2219 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "We Just Found Two Mysterious Galaxies 62 Times Bigger Than Our Milky Way, Say Scientists - Forbes", "description": "“Giant radio galaxies” could be more common than we thought.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/01/18/we-just-found-two-mysterious-galaxies-62-times-bigger-than-our-milky-way-say-scientists/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60055a8ad185100d1c8da293%2F0x0.jpg", "publishedAt": "2021-01-19T03:00:00Z", "content": "The two giant radio galaxies found with the MeerKAT telescope. In the background is the sky as seen ... [+] in optical light. Overlaid in red is the radio light from the enormous radio galaxies, as s… [+3484 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "End of the world: Astronomers name solar threat that will turn Earth into 'lifeless rock' - Daily Express", "description": "THE end of the world will come at the hands of our dying Sun, which astronomers have announced will one day expand into a so-called red giant and boil the Earth alive, rendering the planet a 'lifeless rock'.", "url": "https://www.express.co.uk/news/science/1385739/end-of-the-world-sun-red-giant-boil-earth-space-news-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1385739.jpg", "publishedAt": "2021-01-18T21:11:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Fossils: 98 million-year-old dino unearthed in Argentina may have been the largest land animal ever - Daily Mail", "description": "Local palaeontologists found the remains - which include 24 vertebrae from the creatures tail and some adjacent bones  - in the Neuquén Province in 2012.", "url": "https://www.dailymail.co.uk/sciencetech/article-9160381/Fossils-98-million-year-old-dino-unearthed-Argentina-largest-land-animal-ever.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/18/19/38165014-0-image-a-190_1610998880240.jpg", "publishedAt": "2021-01-18T20:06:00Z", "content": "The fossilised bones of a dinosaur unearthed in Argentina that would have stomped the earth 98 million years ago may have been the largest land animal ever.\r\nLocal palaeontologists found the remains … [+4677 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Latch, load and release: Elastic motion makes click beetles click, study finds - Phys.org", "description": "Click beetles can propel themselves more than 20 body lengths into the air, and they do so without using their legs. While the jump's motion has been studied in depth, the physical mechanisms that enable the beetles' signature clicking maneuver have not. A ne…", "url": "https://phys.org/news/2021-01-latch-elastic-motion-click-beetles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/latchloadand.jpg", "publishedAt": "2021-01-18T20:00:13Z", "content": "Click beetles can propel themselves more than 20 body lengths into the air, and they do so without using their legs. While the jump's motion has been studied in depth, the physical mechanisms that en… [+4211 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Team EastMojo", "title": "Did you see the image of a Neutron star shared by NASA? - EastMojo", "description": "The photo, posted two days ago has already received over 20,000 likes and more than 50 comments", "url": "https://www.eastmojo.com/world/2021/01/18/did-you-see-the-image-of-a-neutron-star-shared-by-nasa", "urlToImage": "https://gumlet.assettype.com/eastmojo%2F2021-01%2F25ec97e1-51d2-4b3f-9e0f-97dd5f88d058%2FWhatsApp_Image_2021_01_18_at_7_42_22_PM.jpeg?rect=0%2C70%2C1280%2C672&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-01-18T18:08:16Z", "content": "National Aeronautics and Space Administration (NASA) recently shared a picture of a neutron star at the centre of a supernova remnant.\r\nSharing the photo on Instagram, NASA's Chandra X-ray Observator… [+635 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Researchers claim to have solved the ‘sheepdog mystery’ - Hindustan Times", "description": "There is the riddle of the Bermuda Triangle. The unresolved identity of Jack the Ripper. The enigma of how the universe developed beyond a quark-gluon soup following the Big Bang. And then there is the sheepdog mystery.", "url": "https://www.hindustantimes.com/world/researchers-claim-to-have-solved-the-sheepdog-mystery/story-kPqb1DIdQwKLVo0gA6MO5H.html", "urlToImage": "https://images.hindustantimes.com/default/550x309.jpg", "publishedAt": "2021-01-18T17:28:00Z", "content": "There is the riddle of the Bermuda Triangle. The unresolved identity of Jack the Ripper. The enigma of how the universe developed beyond a quark-gluon soup following the Big Bang. And then there is t… [+1689 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Mysterious ‘ghost particle’ might have been spotted in rays from dead star - Yahoo India News", "description": "The ‘axion’ particle could help scientists unravel some of the mysteries of the universe, including ‘dark matter’, the researchers believe.", "url": "https://in.news.yahoo.com/ghost-particle-axion-dark-matter-170411300.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-01/b8f64160-59ae-11eb-bf6f-da585f522a75", "publishedAt": "2021-01-18T17:04:00Z", "content": "Is the 'ghost' particle lurking in neutron stars? (Nasa)\r\nA mysterious ghost particle that scientists have been hunting for decades may have been found in X-rays beaming from dead stars.\r\nThe axion p… [+3939 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Hubble Reveals Colors of the “Lost Galaxy” in Supreme Detail - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiVGh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9odWJibGUtcmV2ZWFscy1jb2xvcnMtb2YtdGhlLWxvc3QtZ2FsYXh5LWluLXN1cHJlbWUtZGV0YWlsL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2021-01-18T16:18:17Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "NASA Marks 3,000 Days of Curiosity Rover on Mars with a Note of Its Many Discoveries - News18", "description": "The National Aeronautics and Space Administration’s (NASA's) rover, Curiosity, has completed 3,000 Martian days, or sols, on the red planet.", "url": "https://www.news18.com/news/buzz/nasa-marks-3000-days-of-curiosity-rover-on-mars-with-a-note-of-its-many-discoveries-3308405.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1606041034_untitled-design-2020-11-22t155527.696.png", "publishedAt": "2021-01-18T16:17:01Z", "content": "The National Aeronautics and Space Administrations (NASA's) rover, Curiosity, has completed 3,000 Martian days, or sols, on the red planet. Curiosity reached Mars on August 6, 2012. On the completion… [+2221 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Scientists may have detected 'hum' of the universe for the first time - DNA India", "description": "Some known noise sources could be ruled out to understand the sound but they needed more data to determine if it was indeed from gravitational waves.", "url": "https://www.dnaindia.com/science/report-scientists-may-have-detected-hum-of-the-universe-for-the-first-time-2868944", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/01/18/950791-resonant-hum-of-universe-detected.jpg", "publishedAt": "2021-01-18T15:48:00Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Eliminating microplastics in wastewater directly at the source: A research team from INRS has developed a process for the electrolytic treatment of wastewater that degrades microplastics at the source - Science Daily", "description": "A research team has developed a process for the electrolytic treatment of wastewater that degrades microplastics at the source.", "url": "https://www.sciencedaily.com/releases/2021/01/210118103456.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-18T15:42:06Z", "content": "A research team from the Institut national de la recherche scientifique (INRS) has developed a process for the electrolytic treatment of wastewater that degrades microplastics at the source. The resu… [+2603 chars]"}, {"source": {"id": null, "name": "Spaceflight Now"}, "author": null, "title": "Boeing making progress on Starliner software for test flight in March - Spaceflight Now", "description": null, "url": "https://spaceflightnow.com/2021/01/18/boeing-making-progress-on-starliner-software-for-test-flight-in-march/", "urlToImage": null, "publishedAt": "2021-01-18T15:16:47Z", "content": "The crew module Boeing’s second Starliner spacecraft is lifted Jan. 13 inside the Commercial Crew and Cargo Processing Facility at NASA’s Kennedy Space Center in Florida. Credit: Boeing/John Proferes… [+8356 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Danish Ansari", "title": "Did NASA find new planet? An abandoned gas-giant planet with 3 star system - Republic World", "description": "Did NASA find a new planet? NASA has discovered a planet called KOI-5Ab which is believed to be a gas giant planet similar to Jupiter or Saturn. Get details.", "url": "https://www.republicworld.com/technology-news/science/did-nasa-find-new-planet-an-abandoned-gas-giant-planet-with-3-star-system.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/xzfxceurqmncbrec_1610962850.jpeg?tr=f-jpeg", "publishedAt": "2021-01-18T14:43:00Z", "content": "NASA has led a number of major space exploration efforts over the years and it appears that it made yet another astounding discovery that was hidden for years. The American space agency discovered a … [+2166 chars]"}, {"source": {"id": null, "name": "One Green Planet"}, "author": "Eliza Erskine", "title": "Record Ocean Temperatures in 2020 - One Green Planet", "description": "A new report has found that oceans reached record temperatures in 2020. This heat has exacerbated extreme weather impacts from climate change", "url": "https://www.onegreenplanet.org/environment/record-ocean-temperatures-in-2020/", "urlToImage": "https://149366112.v2.pressablecdn.com/wp-content/uploads/2021/01/shutterstock_534308260-1165x800.jpg", "publishedAt": "2021-01-18T14:30:18Z", "content": "A new report has found that oceans reached record temperatures in 2020. This heat has exacerbated extreme weather impacts from climate change, according to scientists. The research was published in t… [+2329 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Frogs living near roaring waterfalls wave hello to attract mates - Daily Mail", "description": "Video footage reveals a male glass frog specimen showing off with a casual flap of the hand, a wave of its foot and a friendly nod of the head in the hope of being noticed.", "url": "https://www.dailymail.co.uk/sciencetech/article-9159439/Frogs-living-near-roaring-waterfalls-wave-hello-attract-mates.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/18/11/38147268-0-image-a-20_1610970629003.jpg", "publishedAt": "2021-01-18T14:10:00Z", "content": "Frogs living near noisy waterfalls in South America wave to attract mates, a new study reveals. \r\nIn field studies, a US expert studied the glass frog (Sachatamia orejuela), which is found on slipper… [+6263 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "Space Launch System Hot Fire Test Failed, NASA Looking Into Why - autoevolution", "description": "This Saturday, the most powerful rocket humans have ever built, the Space Launch System (SLS), was to conduct a hot fire test, the last in a longer series meant to validate the workhorse of the Artemis program. For reasons yet unknown, the test failed.", "url": "https://www.autoevolution.com/news/space-launch-system-hot-fire-test-failed-nasa-looking-into-why-154660.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/space-launch-system-hot-fire-test-failed-nasa-looking-into-why-154660-7.jpg", "publishedAt": "2021-01-18T14:07:00Z", "content": "The plan called for 700,000 gallons of cryogenic fuel to be loaded into the tanks of the rocket, and for the four RS-25 engines of the core stage to be fired at the same time. The test was supposed t… [+1723 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "'Super Earth': NASA mission discovers 10 billion-year-old exoplanet 50% larger than our own - India Today", "description": "While exoplanet TOI-561b is a rocky, terrestrial planet with the same density as Earth, experts have reason to believe that it is far too hot to support life.", "url": "https://www.indiatoday.in/science/story/-super-earth-nasa-mission-discovers-10-billion-year-old-exoplanet-50-larger-than-our-own-1760305-2021-01-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/Exoplanet-647x363.png?v_tmTA1ubSmBTTchogn6Q90MZtsrTYAi", "publishedAt": "2021-01-18T13:34:13Z", "content": "NASA's TESS mission (Transiting Exoplanet Survey Satellite) has discovered a hot and rocky planet that is about 50 per cent larger than Earth and has three times the mass but surprisingly, the same d… [+2318 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Yash Tripathi", "title": "Russian Astronaut Kud-Sverchkovs Instagram video from ISS shows Orange Halo around Earth - Republic World", "description": "A Russian Astronaut, Sergey Kud-Sverchkov recently shared an Instagram video from ISS which actually shows an Orange Halo around Earth. Read more to find out.", "url": "https://www.republicworld.com/technology-news/science/russian-astronaut-kud-sverchkovs-instagram-video-from-iss-shows-orange-halo-around-earth.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/mjyvxueqacqib08c_1610973381.jpeg?tr=f-jpeg", "publishedAt": "2021-01-18T12:53:00Z", "content": "Sergei Kud-Sverchkov, a Russian Astronaut, has shared an interesting video from the space. The video highlights how it may feel like to witness the sunrise as an astronaut. Kud-Sverchkov wrote in the… [+2118 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Hint of alien life on Venus? Scientists announce detection of rare gas phosphine - Hindustan Times", "description": "Scientists discovered a rare gas called phosphine in Venus' atmosphere. The gas could be a possible sign of life - tiny microbes living in Venus' clouds. The amount of phosphine detected was relatively large, raising more questions about the source. Phosphine…", "url": "https://www.hindustantimes.com/videos/world-news/hint-of-alien-life-on-venus-scientists-announce-detection-of-rare-gas-phosphine/video-YAwCBXazG3k6D5kwEmtaxO.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/09/15/Pictures/_000e4e66-f713-11ea-b176-a0f9c333dcf8.jpg", "publishedAt": "2020-09-15T05:23:48Z", "content": "Scientists discovered a rare gas called phosphine in Venus' atmosphere. The gas could be a possible sign of life - tiny microbes living in Venus' clouds. The amount of phosphine detected was relative… [+437 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Stephen Hawking's greatest contributions to science - Hindustan Times", "description": "Renowned physicist Stephen Hawking passed away on 14 March at the age of 76 in his home in Cambridge. Hawking was one of the longest survivors of Lou Gehrig's disease which had confined him to a wheelchair at the age of 21. But that did not stop him as he wen…", "url": "https://www.hindustantimes.com/videos/world-news/stephen-hawking-s-greatest-contributions-to-science/video-QpOIeemVQxwiSk3rFFHJ9J.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2018/03/14/Pictures/_ceb609a2-277c-11e8-9f95-06a811d7e716.png", "publishedAt": "2018-03-14T11:45:00Z", "content": "Renowned physicist Stephen Hawking passed away on 14 March at the age of 76 in his home in Cambridge. Hawking was one of the longest survivors of Lou Gehrig's disease which had confined him to a whee… [+345 chars]"}]}