{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New personalized test to detect leukemia relapse sooner and avoid false negative results - News-Medical.Net", "description": "Researchers have developed a new protocol for monitoring acute lymphoblastic leukemia (ALL), the most common cancer in children, to inform more effective treatment strategies and detect disease recurrence.", "url": "https://www.news-medical.net/news/20220207/New-personalized-test-to-detect-leukemia-relapse-sooner-and-avoid-false-negative-results.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-02-07T23:37:00Z", "content": "Researchers have developed a new protocol for monitoring acute lymphoblastic leukemia (ALL), the most common cancer in children, to inform more effective treatment strategies and detect disease recur… [+4188 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Mars Could Have Been wet for Much Longer Than Previously Believed - Universe Today", "description": "According to new NASA-sponsored research, Mars may have had an ocean as recent as 3 billion years ago (500 million years longer than expected).", "url": "https://www.universetoday.com/154383/mars-could-have-been-wet-for-much-longer-than-previously-believed/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/04/AncientMars.jpg", "publishedAt": "2022-02-07T21:44:06Z", "content": "Billions of years ago, Mars was a much different place than it is today. During the same period when life was first emerging on Earth, Mars had a thicker atmosphere, warmer surface temperatures, and … [+6601 chars]"}, {"source": {"id": null, "name": "JNS.org"}, "author": null, "title": "Chickpea seeds headed to International Space Station for use in mini-greenhouse - JNS.org", "description": "It’s part of a project called “Space Hummus,” which will test hydroponic techniques for plant growth in zero gravity.", "url": "https://www.jns.org/chickpea-seeds-headed-to-international-space-station-for-use-in-mini-greenhouse/", "urlToImage": "https://cdn.jns.org/uploads/2022/02/Chickpeas-Space-Hummus-Project-1.jpg", "publishedAt": "2022-02-07T21:18:22Z", "content": "(February 7, 2022 / JNS) Israeli chickpea seeds will be among the supplies and equipment sent to the International Space Station (ISS) later this month for a series of experiments aimed at controllin… [+2841 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Astronomer Captures Image of SpaceX Booster That's on Track to Hit the Moon - Gizmodo", "description": "Our final view of the doomed booster will be made available tomorrow during a live webcast.", "url": "https://gizmodo.com/last-view-of-spacex-booster-crash-into-the-moon-1848494674", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/d200fc80ec6f7bea695eb6def85e9e6f.jpg", "publishedAt": "2022-02-07T21:15:00Z", "content": "Well heres something you dont see everyday: A discarded Falcon 9 second stage booster thats going to slam into the Moon. This inevitable impact, predicted for March 4, wont be visible from Earth, but… [+2082 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Anna Varela - Georgia State", "title": "Theory may solve mystery of how huge stars got so far from home - Futurity: Research News", "description": "Researchers may have cracked the case of massive stars that are further from their birthplaces than should be possible based on their life spans.", "url": "https://www.futurity.org/massive-stars-milky-way-disk-2692892/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/02/stars-1600.jpg", "publishedAt": "2022-02-07T20:58:13Z", "content": "Astronomers have found an explanation for the strange occurrence of massive stars located far from their birthplace in the disk of our Milky Way galaxy.\r\nStars more massive than the sun have very hot… [+3749 chars]"}, {"source": {"id": null, "name": "The Irish News"}, "author": "", "title": "Bronze Age immigration to Orkney 'mostly women', scientists discover - The Irish News", "description": "A DNA study of ancient remains on Orkney revealed that most Bronze Age immigrants were women, leaving the islands with a unique male genetic line.", "url": "https://www.irishnews.com/magazine/science/2022/02/07/news/bronze-age-immigration-to-orkney-mostly-women-scientists-discover-2582680/", "urlToImage": "http://www.irishnews.com/picturesarchive/irishnews/irishnews/2022/02/07/211051833-542ede45-73c5-4ca8-8c2a-68a1cf1f7fc9.jpg", "publishedAt": "2022-02-07T20:34:44Z", "content": "Orkney experienced mass immigration during the dawn of the Bronze Age that was led mostly by women, new scientific research suggests.\r\nGenetic studies of ancient DNA from human remains found on the i… [+2661 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Ariana Baio", "title": "Trojan asteroid discovered that will follow Earth for 4000 years - indy100", "description": "Scientists have discovered a rare Trojan asteroid that will follow Earth's orbit for the next 4,000 years. This finding comes after nearly a decade of work trying to prove its existence. According to Nature Communications, a team of astronomers at the Univers…", "url": "https://www.indy100.com/science-tech/trojan-asteroid-follow-earth-4000-years", "urlToImage": "https://www.indy100.com/media-library/astronomers-find-a-new-trojan-asteroid-sharing-earths-orbit.jpg?id=29284130&width=1200&coordinates=0%2C19%2C0%2C19&height=600", "publishedAt": "2022-02-07T20:04:09Z", "content": "Scientists have discovered a rare Trojan asteroid that will follow Earth's orbit for the next 4,000 years. This finding comes after nearly a decade of work trying to prove its existence. \r\nAccording … [+1717 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Chris Lee", "title": "Atomic cloud key to controlling a quantum state without measuring it - Ars Technica", "description": "Cloud of atoms acts as the heart of a controller for quantum cooling system.", "url": "https://arstechnica.com/science/2022/02/atomic-cloud-key-to-controlling-a-quantum-state-without-measuring-it/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/cond2021_04_01hr-scaled-760x380.jpg", "publishedAt": "2022-02-07T19:17:29Z", "content": "Enlarge/ The atoms (center foreground) alter a laser so it extracts energy from a membrane (blue).\r\n9 with 8 posters participating\r\nWay back when I was still working in the lab, there was a lot of bu… [+3469 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Gene regulation in mammals offers clues connecting pregnancy and cancer metastasis: Regulatory sequences in the genomes of mammals, including cows, pigs, horses, and humans, help explain how normal tissue is invaded by cancer - Science Daily", "description": "In many mammals including humans, the placenta invades the wall of the uterus during pregnancy in the same way that cancer cells invade surrounding tissues. Using genomic sequences and gene expression information, researchers were able to predict specific sig…", "url": "https://www.sciencedaily.com/releases/2022/02/220207135831.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T19:13:10Z", "content": "Researchers from UConn Heath and Yale University have made new advances connecting the evolution of pregnancy and cancer metastasis.Publishing in the Proceedings of the National Academy of Sciences, … [+3629 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "White House seeks to clean up space debris - BollyInside", "description": "Anytime two objects traveling at about five miles a second collide, the impact could look like a scene straight out of a movie. In real life, no people in", "url": "https://www.bollyinside.com/news/white-house-seeks-to-clean-up-space-debris", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-07T18:38:26Z", "content": "Anytime two objects traveling at about five miles a second collide, the impact could look like a scene straight out of a movie. In real life, no people in space have ever been hit, but the Internatio… [+2006 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Large new titanosaurian dinosaur from the Pyrenees: The skeleton of Abditosaurus kuehnei is the most complete titanosaur fossil discovered so far in Europe - Science Daily", "description": "Researchers have described the new species of titanosaur dinosaur Abditosaurus kuehnei from the remains excavated at the Orcau-1 site, in the southern Pyrenees (Catalonia, Spain). The semiarticulated 70.5-million-year-old skeleton is the most complete specime…", "url": "https://www.sciencedaily.com/releases/2022/02/220207124822.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T18:35:24Z", "content": "Researchers from the Institut Català de Paleontologia Miquel Crusafont (ICP), the Conca Dellà Museum (MCD), the Universitat Autònoma de Barcelona (UAB), the University of Zaragoza (UNIZAR) and the NO… [+6020 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "SpaceX is investigating a key Crew Dragon component ahead of Crew-4 flight - Inverse", "description": "SpaceX's human-carrying capsule has a surprise issue with its parachutes. Here's what it could mean for Crew Dragon Crew-4 and the upcoming Axiom Space mission.", "url": "https://www.inverse.com/innovation/spacex-data-point", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/2/7/45a105b5-5225-4bc4-b100-50b71a7e419e-getty-1235276077.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-07T18:25:08Z", "content": "SpaceX has stumbled\r\n across a surprising piece of information and it could help it tweak how its astronauts return to Earth.\r\nDuring a press briefing last week, as reported by SpaceNews, NASA and Sp… [+3712 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Nanowires under tension create the basis for ultrafast transistors — ScienceDaily - The News Motion", "description": "Smaller chips, faster computers, less energy consumption. Novel concepts based on semiconductor nanowires are expected to make transistors in microelectronic circuits better and more efficient. Electron mobility plays a key role in this: The faster e", "url": "https://thenewsmotion.com/nanowires-under-tension-create-the-basis-for-ultrafast-transistors-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-07T18:22:06Z", "content": "Smaller chips, faster computers, less energy consumption. Novel concepts based on semiconductor nanowires are expected to make transistors in microelectronic circuits better and more efficient. Elect… [+4979 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Weston Blasi", "title": "What to know about the Astra rocket launch from Cape Canaveral on Monday - MarketWatch", "description": "Astra was attempting to join SpaceX, Blue Origin and Virgin Galactic as companies that have recently launched vehicles into space.", "url": "https://www.marketwatch.com/story/what-to-know-about-the-astra-rocket-launch-from-cape-canaveral-on-monday-11644257007", "urlToImage": "https://images.mktw.net/im-481255/social", "publishedAt": "2022-02-07T18:03:00Z", "content": "For years NASA was main organization who would routinely launch aircraft into space. That is certainly no longer the case.During the last few years, other companies including Elon Musks SpaceX, Amazo… [+1810 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "On my birthday, what did NASA see? Find the photo Hubble took on your birthday. ⋆ Ceng News - Ceng News", "description": "On TikTok, a NASA tool that allows users to look for images taken by the Hubble Space Telescope on their", "url": "https://www.cengnews.com/news/on-my-birthday-what-did-nasa-see-find-the-photo-hubble-took-on-your-birthday-246575.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/02/1644255720_hubble-birthday-scaled.jpg", "publishedAt": "2022-02-07T17:43:53Z", "content": "On TikTok, a NASA tool that allows users to look for images taken by the Hubble Space Telescope on their birthdays has become an unexpected hit.\r\nIn 2020, NASA will launch the app to commemorate the … [+4380 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Youngest pair of asteroids ever discovered in solar system spotted by astronomers - WION", "description": "Astronomers have spotted the youngest pair of asteroids ever discovered in the solar system.", "url": "https://www.wionews.com/science/youngest-pair-of-asteroids-ever-discovered-in-solar-system-spotted-by-astronomers-451332", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/02/07/239207-untitled-design-24.jpg", "publishedAt": "2022-02-07T17:43:22Z", "content": "Astronomers have spotted the youngest pair of asteroids ever discovered in the solar system.\r\nSplit off from their parent body merely 300 years ago, they possess properties that are hard to explain d… [+1768 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers use tiny magnetic swirls to generate true random numbers - Phys.org", "description": "Whether for use in cybersecurity, gaming or scientific simulation, the world needs true random numbers, but generating them is harder than one might think. But a group of Brown University physicists has developed a technique that can potentially generate mill…", "url": "https://phys.org/news/2022-02-tiny-magnetic-swirls-true-random.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/researchers-use-tiny-m.jpg", "publishedAt": "2022-02-07T17:38:22Z", "content": "Whether for use in cybersecurity, gaming or scientific simulation, the world needs true random numbers, but generating them is harder than one might think. But a group of Brown University physicists … [+5641 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "This SpaceX video of a Falcon 9 rocket stage separation during launch is just amazing - Space.com", "description": "The video was captured during a Jan. 31 launch of an Italian satellite.", "url": "https://www.space.com/spacex-falcon-9-rocket-launch-tracking-camera-video-csg-2", "urlToImage": "https://cdn.mos.cms.futurecdn.net/htH2zySeBfFsDvx2t5uDz6-1200-80.jpg", "publishedAt": "2022-02-07T17:24:54Z", "content": "A new SpaceX video has captured a striking view of two critical moments in any rocket launch: stage separation for its booster and nose cone jettison. \r\nThe video, which SpaceX released on YouTube Sa… [+2952 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "NASA asteroid detector 'looks up' to scan entire sky every 24 hours - Livescience.com", "description": "The addition of two southern hemisphere telescopes will enable ATLAS to do full sky scans.", "url": "https://www.livescience.com/nasa-upgrades-atlas-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gTXdLAyjyieQAWPgxjZ5h3-1200-80.jpg", "publishedAt": "2022-02-07T16:22:20Z", "content": "NASA's asteroid\r\n monitoring system has been upgraded so that it can scan the entire night sky once every 24 hours for potentially hazardous space rocks that are heading our way. \r\nThe Asteroid Terre… [+3941 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Hubble Telescope captures incredible image of two interacting galaxies; ESA calls it rare - Republic World", "description": "The Hubble Telescope snapped the object named Arp 282, which is an interacting galaxy pair composed of the Seyfert galaxy NGC 169 & the galaxy IC 1559.", "url": "https://www.republicworld.com/science/space/hubble-telescope-captures-incredible-image-of-two-interacting-galaxies-esa-calls-it-rare-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/njiy9huk62h2asuk_1644246862.jpeg", "publishedAt": "2022-02-07T15:25:00Z", "content": "The Hubble Space Telescope, which has been circling the Earth for the last three decades, has served as our cosmic eye to spot unbelievably far objects deep in interstellar space. The instrument, des… [+1985 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Key amino acid in heme production helps fight aging in muscles - Phys.org", "description": "Researchers from Tokyo Metropolitan University have shown that a mixture of 5-aminolevulinic acid (5-ALA) hydrochloride and sodium ferrous citrate (SFC) helps slow down aging-related muscular decline in fruit flies, leading to a slower decline in locomotor ac…", "url": "https://phys.org/news/2022-02-key-amino-acid-heme-production.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/key-amino-acid-in-heme.jpg", "publishedAt": "2022-02-07T15:18:59Z", "content": "Researchers from Tokyo Metropolitan University have shown that a mixture of 5-aminolevulinic acid (5-ALA) hydrochloride and sodium ferrous citrate (SFC) helps slow down aging-related muscular decline… [+3343 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Claire Andreoli", "title": "Image: Hubble revisits a galactic oddball - Phys.org", "description": "The dwarf galaxy NGC 1705 featured in this image from the NASA/ESA Hubble Space Telescope lies in the southern constellation Pictor, approximately 17 million light-years from Earth. NGC 1705 is a cosmic oddball—it is small, irregularly shaped, and has recentl…", "url": "https://phys.org/news/2022-02-image-hubble-revisits-galactic-oddball.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/image-hubble-revisits.jpg", "publishedAt": "2022-02-07T15:14:40Z", "content": "The dwarf galaxy NGC 1705 featured in this image from the NASA/ESA Hubble Space Telescope lies in the southern constellation Pictor, approximately 17 million light-years from Earth. NGC 1705 is a cos… [+1749 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Asteroid warning: NASA says 1.3 kilometer wide space rock heading towards earth - IBTimes India", "description": "This asteroid named 138971 (2001 CB21) is currently traveling at a mindblowing speed of 43,236 kilometers per hour.", "url": "https://www.ibtimes.co.in/asteroid-warning-nasa-says-1-3-kilometer-wide-asteroid-heading-towards-earth-845503", "urlToImage": "https://data1.ibtimes.co.in/en/full/733985/nasa-working-asteroid-deflecting-machine.jpg", "publishedAt": "2022-02-07T15:02:15Z", "content": "Around 66 million years ago, a giant asteroid hit planet earth with its full fury and resulted in the extinction of dinosaurs. Since then, no such event has happened, and it played a crucial role in … [+1758 chars]"}, {"source": {"id": null, "name": "Tasnim News Agency"}, "author": "Tasnim News Agency", "title": "Firestorm Caused by A Comet Triggered An Ice Age nearly 13,000 Years Ago - Tasnim News Agency", "description": "TEHRAN (Tasnim) – At a point some 12,800 years ago, a tenth of Earth's surface suddenly became covered in roaring fires.", "url": "https://www.tasnimnews.com/en/news/2022/02/07/2658756/firestorm-caused-by-a-comet-triggered-an-ice-age-nearly-13-000-years-ago", "urlToImage": "/Static/img/tasnim-main-logo.jpg", "publishedAt": "2022-02-07T14:00:00Z", "content": "The firestorm rivalled the one that wiped out the dinosaurs, and it was likely caused by fragments of a comet that would have measured around 100 kilometers (62 miles) across.\r\nAs dust clouds smother… [+3029 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "James Webb Space Telescope Spies its First Star - ExtremeTech", "description": "Webb has finally done the one thing telescopes are supposed to do: it detected photons.", "url": "https://www.extremetech.com/?p=331365", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/01/jwst-render-640x360.jpg", "publishedAt": "2022-02-07T14:00:00Z", "content": "When NASA’s James Webb Space Telescope (JWST) was on the ground, it seemed like all we ever heard was bad news — delays, redesigns, cost overruns. Ever since the launch though, all the team’s hard wo… [+2435 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Ice age mammoth, woolly rhino and hyena bones uncovered in English town - Livescience.com", "description": "The bones were found during a construction project.", "url": "https://www.livescience.com/ice-age-animal-remains-found-in-devon-england", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5hfbZXaspTz9xJcUV8KQvj-1200-80.jpg", "publishedAt": "2022-02-07T13:37:33Z", "content": "The bones of a woolly mammoth, woolly rhinoceros, hyena and wolf recently discovered in an English town are thought to date to the last Ice Age\r\n. \r\nThe animal remains turned up during the constructi… [+3096 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers discover how bacteria adapt to new environment - Devdiscourse", "description": "It is a known fact that bacteria are extremely resourceful when it comes to adapting to a given environment. Now, a team of researchers have discovered a new trick that bacteria use", "url": "https://www.devdiscourse.com/article/science-environment/1913361-researchers-discover-how-bacteria-adapt-to-new-environment", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_02_2022_13_36_40_2860948.jpg?width=920&format=jpeg", "publishedAt": "2022-02-07T13:36:41Z", "content": "It is a known fact that bacteria are extremely resourceful when it comes to adapting to a given environment. Now, a team of researchers have discovered a new trick that bacteria use: a kind of sponge… [+4578 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "NASA Offers $1 Million to Best Idea for Growing Space Food - Optic Flux", "description": "NASA's Deep Space Food Challenge is awarding $1 million to public members who can show inventive solutions to the challenge of feeding astronauts on long-term missions. The Issue Astronauts aboard the International Space Station (ISS) generally consume canned…", "url": "https://www.opticflux.com/nasa-offers-1-million-to-best-idea-for-growing-space-food/15496/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/space-food_Web.webp", "publishedAt": "2022-02-07T13:31:40Z", "content": "NASA’s Deep Space Food Challenge is awarding $1 million to public members who can show inventive solutions to the challenge of feeding astronauts on long-term missions.\r\nThe Issue\r\nAstronauts aboard … [+1911 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Researchers create strong synthetic enamel similar to natural tooth covering - Phys.org", "description": "A team of researchers from Beihang University, the Peking University School and Hospital of Stomatology and the Michigan Institute of Translational Nanotechnology has developed a synthetic enamel with properties similar to natural tooth enamel. In their paper…", "url": "https://phys.org/news/2022-02-strong-synthetic-enamel-similar-natural.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-create-str.jpg", "publishedAt": "2022-02-07T13:30:01Z", "content": "A team of researchers from Beihang University, the Peking University School and Hospital of Stomatology and the Michigan Institute of Translational Nanotechnology has developed a synthetic enamel wit… [+2483 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Increasing the accuracy of atomic force calculations with the space-warp coordinate transformation - Phys.org", "description": "Atomic forces are primarily responsible for the motion of atoms and their versatile arrangement patterns, which is unique for different types of materials. Atomic simulation methods are a popular choice for the calculation of these forces, the understanding o…", "url": "https://phys.org/news/2022-02-accuracy-atomic-space-warp.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/increasing-the-accurac.jpg", "publishedAt": "2022-02-07T12:38:49Z", "content": "Atomic forces are primarily responsible for the motion of atoms and their versatile arrangement patterns, which is unique for different types of materials. Atomic simulation methods are a popular cho… [+4891 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX shares incredible footage of its Falcon 9 rocket soaring at 6,000 kmph; WATCH - Republic World", "description": "SpaceX, which is aiming for 52 launches in 2022, shared the video from the COSMO-SkyMed Second Generation FM2 satellite launch from February 1.", "url": "https://www.republicworld.com/science/space/spacex-shares-incredible-footage-of-its-falcon-9-rocket-soaring-at-6000-kmph-watch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/x4xw3sg4gqsiavoc_1644234953.jpeg", "publishedAt": "2022-02-07T12:07:00Z", "content": "SpaceX has an aim to conduct one Falcon 9 launch every week as it is eyeing to break its own record of 31 successful liftoffs last year. The company has had a great start to 2022 and has conducted se… [+1637 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Biologists discovered new information about the tiny propellers on earth - Tech Explorist", "description": "Exeter biologists investigate smallest propeller on earth.", "url": "https://www.techexplorist.com/new-information-tiny-propellers-earth/44594/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/02/M.-villous-archaellum.jpg", "publishedAt": "2022-02-07T11:52:35Z", "content": "Like bacteria, Archaea are ubiquitous microorganisms that successfully colonize diverse environments. They are found in a vast range of habitats. But there is a slight difference between bacteria and… [+2426 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Too Many Disk Galaxies Than Theory Allows: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. The Standard Model of Cosmology has described how the universe came into being according to the view of most physicists. Now, researchers at the University of Bonn studied the evolution of galaxies withi…", "url": "https://www.latestly.com/agency-news/science-news-too-many-disk-galaxies-than-theory-allows-study-3336765.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/galaxy2022020708173720220207112939-588x441.jpg", "publishedAt": "2022-02-07T11:48:23Z", "content": "Bonn [Germany], February 7 (ANI): The Standard Model of Cosmology has described how the universe came into being according to the view of most physicists. Now, researchers at the University of Bonn s… [+4246 chars]"}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "mohammad Mujtaba Khan", "title": "Emirates News Agency – Emirates Mars Mission shares second tranche of Hope Probe’s scientific data ... - ToysMatrix", "description": "DUBAI, 7th February, 2022 (WAM) -- The Emirates Mars Mission, the first interplanetary mission undertaken by an Arab nation, has released the seco", "url": "https://toysmatrix.com/emirates-news-agency-emirates-mars-mission-shares-second-tranche-of-hope-probes-scientific-data-with-world/", "urlToImage": "http://assets.wam.ae/uploads/2022/02/thumbnail-1297197579637503495.jpg", "publishedAt": "2022-02-07T11:34:07Z", "content": "DUBAI, 7th February, 2022 (WAM) — The Emirates Mars Mission, the first interplanetary mission undertaken by an Arab nation, has released the second tranche of observations to a global audience of sci… [+4842 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Huge Mountain Ranges As High As the Himalayas Key to Evolution of Early Life on Earth: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Researchers at the Australian National University (ANU) tracked the formation of these super-mountains throughout Earth's history using traces of zircon with low lutetium content. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2022-02-07-huge-mountain-ranges-key-to-evolution-of-early-life-on-earth", "urlToImage": "https://s.w-x.co/in-mount_everest.jpg", "publishedAt": "2022-02-07T11:10:21Z", "content": "Giant mountain ranges at least as high as the Himalayas and stretching up to 8,000 kilometres across entire supercontinents played a crucial role in the evolution of early life on Earth, according to… [+2849 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Choi", "title": "Rogue black hole spotted on its own for the first time - Space.com", "description": "The isolated stellar-mass black hole is the first of its kind ever detected, scientists say.", "url": "https://www.space.com/rogue-black-hole-isolated-discovery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V6yAEuQQwk6akhK9gTuMWP-1200-80.jpg", "publishedAt": "2022-02-07T11:00:08Z", "content": "Astronomers may have for the first time detected and measured the mass of an isolated stellar-mass black hole, a new study finds.\r\nPrevious research suggested that when giant stars more than 20 times… [+4870 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA Astronauts to Call Indiana, Texas, Virginia Students from Space - India Education Diary", "description": "Students across the country will have three opportunities to hear from NASA astronauts aboard the International Space Station. The Earth-to-space calls will air live Monday, Feb. 7, Wednesday, Feb. 9, and Friday, Feb. 11, on NASA Television, the NASA", "url": "https://indiaeducationdiary.in/nasa-astronauts-to-call-indiana-texas-virginia-students-from-space/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/iss066e077280_0.jpg", "publishedAt": "2022-02-07T10:22:00Z", "content": "Students across the country will have three opportunities to hear from NASA astronauts aboard the International Space Station. The Earth-to-space calls will air live Monday, Feb. 7, Wednesday, Feb. 9… [+2676 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Our galaxy Milky Way is large enough to contain 100 billion planets - Interesting Engineering", "description": "The Earth and our entire solar system are located inside the Milky Way galaxy along with billions of other stars, suns, and planets.", "url": "https://interestingengineering.com/milky-way-galaxy", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Ne6Nk4j3w5/sizes/milkyway_md.jpg", "publishedAt": "2022-02-07T09:51:45Z", "content": "If you get a chance to go night camping at a place like Arches National Park in the US, Bodmin Moor in the UK, or one of the other certified International Dark Sky Parks, don’t you miss it, because a… [+7721 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "How NASA plans to retire International Space Station by sending it to a watery grave - Firstpost", "description": "The International Space Station (ISS) has orbited Earth for over two decades now, making possible scientific discoveries that wouldn’t have been possible without this lab in the sky with an international crew of astronauts onboard.", "url": "https://www.firstpost.com/tech/news-analysis/how-nasa-plans-to-retire-international-space-station-by-sending-it-to-a-watery-grave-10355371.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/02/ISS-NASA.jpg", "publishedAt": "2022-02-07T09:35:45Z", "content": "FP StaffFeb 07, 2022 15:05:45 IST\r\nThe International Space Station (ISS) has orbited Earth for over two decades now, making possible scientific discoveries that wouldnt have been possible without thi… [+4049 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Ellie Abraham", "title": "Scientists reveal that Earth could avoid 'planet killer' asteroid by using nukes - indy100", "description": "It’s the topic of many disaster movies, but scientists have revealed that we may be able to save Earth from a planet-destroying asteroid using nuclear technology.Scientists from the University of California have been working on the way in which mankind may be…", "url": "https://www.indy100.com/science-tech/scientists-asteroid-nuclear-weapons-earth", "urlToImage": "https://www.indy100.com/media-library/nasa-launches-rocket-to-deflect-asteroid-in-first-planetary-defence-test.jpg?id=28060879&width=1200&coordinates=0%2C176%2C0%2C177&height=600", "publishedAt": "2022-02-07T09:27:02Z", "content": "Its the topic of many disaster movies, but scientists have revealed that we may be able to save Earth from a planet-destroying asteroid using nuclear technology.\r\nScientists from the University of Ca… [+2902 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Viktoria Urban", "title": "NASA and SpaceX provide update on Crew-4 mission - SpaceWatch.Global", "description": "Edinburgh, 7 February 2022. - NASA and SpaceX provided an update on the preparations of the Crew-4 mission to the International Space Station (ISS) with NASA astronauts Kjell Lindgren, Robert Hines, J", "url": "https://spacewatch.global/2022/02/nasa-and-spacex-provide-update-on-crew-4-mission/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2022/02/nhq202009150003_medium.jpeg", "publishedAt": "2022-02-07T09:08:55Z", "content": "NASA crew members of the SpaceX Crew-4 mission to the International Space Station. Pictured from left are NASA astronauts Kjell Lindgren and Bob Hines. Credit: NASA\r\nEdinburgh, 7 February 2022. – NAS… [+996 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Gadgets 360 Newsdesk", "title": "Can Dying Stars Give Birth to New Planets? Here’s What Scientists Have to Say - Gadgets 360", "description": "Scientists now say it is not necessarily the only possibility. They say planets can form even if a star is nearing its death, long after the star was formed. Dying stars leading to the formation of planets is a completely new theory. If confirmed, this findin…", "url": "https://gadgets.ndtv.com/science/news/dying-stars-new-planet-birth-form-origin-study-possible-protoplanetary-disc-2753485", "urlToImage": "https://i.gadgets360cdn.com/large/planet_space_stock_freepik_1644217793552.jpg", "publishedAt": "2022-02-07T07:13:01Z", "content": "Planets do not take much longer to form after stars have formed. For example, the Sun formed 4.6 billion years ago and the Earth about 4.5 billion years ago. However, scientists now say it is not nec… [+1782 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "See the Milky Way's center as we've never seen it before - Big Think", "description": "As viewed by the MeerKAT telescope, this radio view of the Milky Way blows away every other way we've ever seen our home galaxy.", "url": "https://bigthink.com/starts-with-a-bang/milky-way-center/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/02/galaxy-center-overall.jpg", "publishedAt": "2022-02-07T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "IndianWeb2", "title": "Europe Space Agency Creating Robotic Space Servicing Vehicle Capable of Servicing and Re-Fuelling of Satellites in Orbit - IndianWeb2.com", "description": "ESA’s proposed e.Deorbit mission, shown left, using a robotic arm to catch a derelict satellite. [Image credits  ESA–David Ducros, 2016/ www...", "url": "https://www.indianweb2.com/2022/02/europe-space-agency-creating-robotic.html", "urlToImage": "https://blogger.googleusercontent.com/img/a/AVvXsEiIMlfONyxDMmoNR4USRzoPwxJK4MQxBsDnik2JQmfxKdklx2asYSLKAFak0kaFJuP0_dfEQ76LVmqXk71Y4fz_QU_lK6InMVuM_gJXMHAxiKT9kJnzQ7qTzmCJLdtB4zqB86o8kQxfcz2BBCY0YhUqLskUoXFcs4s5qdrwvBUHSBs5A2rq8i_1Sduf=w833-h521", "publishedAt": "2022-02-07T06:54:00Z", "content": "European Space Agency (ESA) is working on a project of making a space servicing vehicle equipped with robotic arm that can perform satellites-servicing tasks like refueling, refurbishing, and boostin… [+2262 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "NASA photo reveals special training for astronaut lunar missions - Digital Trends", "description": "An eerie image released by NASA reveals how the space agency is gearing up for astronaut training for its upcoming lunar missions.", "url": "https://www.digitaltrends.com/news/nasa-photo-shows-special-training-for-crewed-moon-trip/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/nasa-moonwalk-south-pole.jpg", "publishedAt": "2022-02-07T06:20:52Z", "content": "An eerie image released by NASA reveals how the space agency is gearing up for some rather unique astronaut training.\r\nCaptured from inside a giant tank of water at NASAs Neutral Buoyancy Laboratory … [+2489 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Marcia Sekhose", "title": "Astronomers are getting concerned about the growing number of Starlink and other satellites - Business Insider India", "description": "The growing number of Starlink and other satellites are becoming a concern for satellites. The bright light streaks left by these satellites can affect astronomical", "url": "https://www.businessinsider.in/science/space/news/astronomers-form-centre-to-address-growing-number-of-starlink-and-other-satellites/articleshow/89397341.cms", "urlToImage": "https://www.businessinsider.in/photo/89397341/astronomers-form-centre-to-address-growing-number-of-starlink-and-other-satellites.jpg?imgsize=55038", "publishedAt": "2022-02-07T04:56:00Z", "content": "SpaceX launched 49 more satellites last week to join the growing constellation of over 1,800 satellites. The Elon Musk-owned company has the approval to set up a total of 12,000 \r\nStarlink satellites… [+2167 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Space Coast Daily", "title": "THIS WEEK @NASA: 300 Days and Counting Aboard ISS, Artemis I Status Update - SpaceCoastDaily.com", "description": "A milestone for a NASA astronaut, a plan for the future of the space station, and moving a step closer to an historic mission to the station … a few of the stories to tell you about – This Week at NASA! [...]", "url": "https://spacecoastdaily.com/2022/02/this-week-nasa-300-days-and-counting-aboard-iss-artemis-i-status-update/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2022/02/this-week-at-nasa-600-4.jpg", "publishedAt": "2022-02-06T19:07:30Z", "content": "Home » THIS WEEK @NASA: 300 Days and Counting Aboard ISS, Artemis I Status UpdateBy Space Coast Daily  //  February 6, 2022 \r\nABOVE VIDEO:A milestone for a NASA astronaut, a plan for the future of th… [+3064 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Vineeth Venugopal", "title": "Lesser known facts about the moon missions | by Vineeth Venugopal | Feb, 2022 - Medium", "description": "The first trees to have been to the moon, among others. “Lesser known facts about the moon missions” is published by Vineeth Venugopal.", "url": "https://medium.com/@vinven7/lesser-known-facts-about-the-moon-missions-c2aca8545b32", "urlToImage": "https://miro.medium.com/max/1200/0*I_VuBzh0telXBDO7", "publishedAt": "2022-02-06T17:13:33Z", "content": "Photo by NASA on Unsplash\r\nWho were the first people to witness an earthrise from the moon?\r\nThe answer is not Neil Armstrong he was the first person to WALK on the moon.\r\nThe first three people to s… [+72 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Zahra Tayeb", "title": "NASA hails a 'significant milestone' for building a 'low-Earth orbit economy' as it approves the crew for Axio - Business Insider India", "description": "NASA and its international partners approved the crew members for Axiom Space 2022 mission. The crew cleared medical examinations and is scheduled to launch", "url": "https://www.businessinsider.in/science/space/news/nasa-hails-a-significant-milestone-for-building-a-low-earth-orbit-economy-as-it-approves-the-crew-for-axiom-spaces-first-private-mission-to-the-iss/articleshow/89389979.cms", "urlToImage": "https://www.businessinsider.in/photo/89389979/nasa-hails-a-significant-milestone-for-building-a-low-earth-orbit-economy-as-it-approves-the-crew-for-axiom-spaces-first-private-mission-to-the-iss.jpg?imgsize=113744", "publishedAt": "2022-02-06T16:17:00Z", "content": "NASA and its international partners approved the astronaut crew for Axiom Space's first private mission to the International Space Station\r\n (ISS), which the agency called a \"\"significant milestone\" … [+1770 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Sam Tabahriti", "title": "SpaceX has so many Starlink satellites they're increasingly photobombing astronomers' images, a study says - Business Insider India", "description": "SpaceX's satellites are increasingly photobombing astronomical images, a study has found. It identified a 35-fold increase in the twilight images corrupted", "url": "https://www.businessinsider.in/tech/news/spacex-has-so-many-starlink-satellites-theyre-increasingly-photobombing-astronomers-images-a-study-says/articleshow/89389799.cms", "urlToImage": "https://www.businessinsider.in/photo/89389799/spacex-has-so-many-starlink-satellites-theyre-increasingly-photobombing-astronomers-images-a-study-says.jpg?imgsize=162344", "publishedAt": "2022-02-06T15:50:00Z", "content": "There has been a huge increase in the number of astronomers' images corrupted by streaks of reflected sunlight caused by SpaceX's satellites, a new study has found.\r\nAccording to the study, which was… [+1681 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "The abyssal world: the last terra incognita of the Earth surface - Space Daily", "description": "Bremen, Germany (SPX) Feb 07, 2022 - \r\nThe deep-ocean floor is the least explored ecosystem on the planet, despite covering more than 60% of the Earth surface. Largely unknown life in abyssal sediments, from benthic animals to microbes,", "url": "https://www.spacedaily.com/reports/The_abyssal_world_the_last_terra_incognita_of_the_Earth_surface_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/deep-sea-abyssal-oceanic-regions-gorgonians-black-corals-1960-m-atlantic-ocean-hg.jpg", "publishedAt": "2022-02-06T13:43:45Z", "content": "The deep-ocean floor is the least explored ecosystem on the planet, despite covering more than 60% of the Earth surface. Largely unknown life in abyssal sediments, from benthic animals to microbes, h… [+6188 chars]"}, {"source": {"id": null, "name": "D1softballnews.com"}, "author": "Kim Lee", "title": "The Earth’s core cools down more than expected: will we become like Mars? – Corriere.it - D1SoftballNews.com", "description": "from Paolo Virtuani New study on the conductivity of a mineral at the boundary between mantle and liquid outer core. The faster heat flow will lead to the early termination ... Read more", "url": "https://d1softballnews.com/the-earths-core-cools-down-more-than-expected-will-we-become-like-mars-corriere-it/", "urlToImage": "https://d1softballnews.com/wp-content/uploads/2021/08/colorlogo.png", "publishedAt": "2022-02-06T13:21:24Z", "content": "from Paolo Virtuani New study on the conductivity of a mineral at the boundary between mantle and liquid outer core. The faster heat flow will lead to the early termination of tectonic movements. Oth… [+2479 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Study reveals hostile conditions on Earth as life evolved - Tech Explorist", "description": "Ozone (O3), making up a tiny proportion of Earth's atmosphere by weight, is one of Earth's most essential molecules for life. Without a substantial", "url": "https://www.techexplorist.com/study-reveals-hostile-conditions-earth-life-evolved/44021/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/01/earth-space.jpg", "publishedAt": "2022-02-06T12:03:17Z", "content": "Ozone (O3), making up a tiny proportion of Earth’s atmosphere by weight, is one of Earth’s most essential molecules for life. Without a substantial stratospheric O3 layer, the surface would receive h… [+3919 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kiona N. Smith", "title": "The oldest hominin fossil ever found in the Levant - Ars Technica", "description": "The fossil hints that early members of our genus expanded out of Africa in waves.", "url": "https://arstechnica.com/science/2022/02/1-5-million-year-old-vertebra-hints-at-a-story-of-early-human-migration/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/UBEIDIYA-SITE-700x380.png", "publishedAt": "2022-02-06T12:00:06Z", "content": "7 with 5 posters participating\r\nWhen the first members of our species ventured out of Africa, they walked into a world that earlier hominins, such as Homo erectus, had first explored a million years … [+4420 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brittney J. Miller", "title": "What's the oldest mountain range in the world? (How about the youngest?) - Livescience.com", "description": "Not all mountain ranges are ancient, geologically speaking.", "url": "https://www.livescience.com/oldest-youngest-mountain-ranges", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RTuWrNMXFN8qrVZsCWYJxM-1200-80.jpg", "publishedAt": "2022-02-06T12:00:03Z", "content": "Mountains may look ancient — but some are mere toddlers, while others are great-grandaddies, geologically speaking. So, what is the oldest mountain range? And what about the youngest? \r\nIn general, t… [+4634 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "IANS", "title": "Life-supporting Moons can only form around small planets: Study - Times Now", "description": "While Earth's moon is large for the planet's size, a new study has now found that our planet was just the right size to form such a large, life-enabling moon.", "url": "https://www.timesnownews.com/technology-science/article/life-supporting-moons-can-only-form-around-small-planets-study/856399", "urlToImage": "https://imgk.timesnownews.com/story/moon.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-06T11:58:02Z", "content": "New York: While Earth's moon is large for the planet's size, a new study has now found that our planet was just the right size to form such a large, life-enabling moon.\r\nThe study, by researchers fro… [+2078 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Tonia Nissen", "title": "Researchers Identified the Source of Supermassive Black Hole Flares to be Magnetic \"Reconnection\" around the Event Horizon. - Optic Flux", "description": "Largest-ever simulations point to flickering caused by magnetic reconnection.' Breaking and reconnecting magnetic field lines at the event horizon unleash the energy from a black hole's magnetic field, speeding particles that cause intense flares, according t…", "url": "https://www.opticflux.com/researchers-identified-the-source-of-supermassive-black-hole-flares-to-be-magnetic-reconnection-around-the-event-horizon/15441/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/Supermassive-Black-Hole-Flare-768x432.gif", "publishedAt": "2022-02-06T10:45:34Z", "content": "Largest-ever simulations point to flickering caused by magnetic reconnection.’\r\nBreaking and reconnecting magnetic field lines at the event horizon unleash the energy from a black hole’s magnetic fie… [+5762 chars]"}, {"source": {"id": null, "name": "Mydroll.com"}, "author": "Jimmy Anderson", "title": "Future Mars helicopter flights could make the air glow blue - My Droll", "description": "With the great success of the Mars helicopter Ingenuity, we could be seeing plenty more aircraft exploring other planets in the future. And a recent study has highlighted a delightful possibility: That the blades of drones cutting through the thi", "url": "https://mydroll.com/future-mars-helicopter-flights-could-make-the-air-glow-blue/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/helicopter_mars_glow2_0031.jpg", "publishedAt": "2022-02-06T02:12:31Z", "content": "With the great success of the Mars helicopter Ingenuity, we could be seeing plenty more aircraft exploring other planets in the future. And a recent study has highlighted a delightful possibility: Th… [+2448 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "How a Magnetic 'Tug-of-War' With Io's Volcanic Eruptions Creates Jupiter's Auroras - ScienceAlert", "description": "NASA's Juno spacecraft and the Hubble Space Telescope helped researchers chart the electric currents driving Jupiter's aurora.", "url": "https://www.businessinsider.com/space-lava-from-moon-volcanoes-creates-jupiters-powerful-aurora-lights-2022-2", "urlToImage": "https://i.insider.com/61fd63ebb8178a001866ca0e?width=1200&format=jpeg", "publishedAt": "2022-02-05T23:02:04Z", "content": "Jupiter's auroras the lights that dance around its poles are the most distinct in our solar system and over a thousand times brighter than Earth's aurora. Now, a new study confirms that these otherwo… [+3546 chars]"}]}