{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "NASA shares a dazzling shot of ‘cosmic jewellery’, netizens in awe - The Indian Express", "description": "Shared on the official Instagram account for NASA’s Hubble Space Telescope, the post features an image of the Necklace Nebula located around 15,000 light-years away.", "url": "https://indianexpress.com/article/trending/trending-globally/nasa-necklace-nebula-hubble-telescope-7204459/", "urlToImage": "https://images.indianexpress.com/2021/02/NASA-feature.jpg", "publishedAt": "2021-02-25T11:31:41Z", "content": "The National Aeronautics and Space Administration on February 25 shared an image of cosmic jewellery on Instagram, leaving netizens in awe.\r\nShared on the official Instagram account for NASAs Hubble … [+570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Incredible’: 360 degree visualisation from Mars’ surface goes viral but it’s not what it’s seems - The Indian Express", "description": "Although in the long description, the artist added: \"The sky does not represent the real sky from Mars\", it failed to get noticed by most people, as it went viral.", "url": "https://indianexpress.com/article/trending/trending-globally/artists-360-degree-visualisation-from-mars-goes-viral-angers-many-online-7204169/", "urlToImage": "https://images.indianexpress.com/2021/02/mars-360-artistic-visualisation.jpg", "publishedAt": "2021-02-25T10:49:57Z", "content": "As NASA’s Perseverance rover successfully landed on Mars, it has created a huge buzz online among space enthusiasts, who can’t wait to catch images of the Red Planet. Now, a 360 degree visualisation … [+2976 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "NASA Chandra Shares Beautiful Image Of A Colorful Supernova! - Mashable India", "description": "NASA Chandra official Instagram page recently shared a twinkling colourful image of a supernova remnant with a bright blue-white spot at the center.", "url": "https://in.mashable.com/science/20529/nasa-chandra-shares-beautiful-image-of-a-colorful-supernova", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/25001/25001_yvt1.jpg", "publishedAt": "2021-02-25T10:30:25Z", "content": "Are you ready to marvel at yet another stunning image of our wonderful universe? NASA Chandra official Instagram page recently shared a twinkling colourful image of a supernova remnant with a bright … [+1616 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Scientists catch precise moment of impact as meteoroid explodes in Jupiter's atmosphere - Firstpost", "description": "The observation is from a 17 millisecond snapshot in time, and researchers aren't sure what happened to the bright flash outside that time frame.", "url": "https://www.firstpost.com/tech/science/scientists-catch-precise-moment-of-impact-as-meteoroid-explodes-in-jupiters-atmosphere-9345561.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/06/NASA-Juno-Jupiter-3.jpg", "publishedAt": "2021-02-25T10:26:22Z", "content": "FP TrendingFeb 25, 2021 16:05:11 IST\r\nUsing NASA's Juno spacecraft to check Jupiter's auroras, researchers were able to view a very bright meteoroid explosion last year. The Ultraviolet Spectrograph … [+2458 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Keith Randall", "title": "A 4.4 million-year-old skeleton could reveal how early humans began to walk upright - Phys.org", "description": "Evolutionary expert Charles Darwin and others recognized a close evolutionary relationship between humans, chimps and gorillas based on their shared anatomies, raising some big questions: how are humans related to other primates, and exactly how did early hum…", "url": "https://phys.org/news/2021-02-million-year-old-skeleton-reveal-early-humans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-a44millionye.jpg", "publishedAt": "2021-02-25T08:09:55Z", "content": "Evolutionary expert Charles Darwin and others recognized a close evolutionary relationship between humans, chimps and gorillas based on their shared anatomies, raising some big questions: how are hum… [+4080 chars]"}, {"source": {"id": null, "name": "BOOM"}, "author": "AFP", "title": "NASAs Parker Solar Probe Did Not Take This Photo Of The Sun - BOOM", "description": "The photo was actually taken from Earth by an independent astrophotographer and it is not the...", "url": "https://www.boomlive.in/world/fake-news-nasa-parker-solar-probe-photo-of-sun-12122", "urlToImage": "https://www.boomlive.in/h-upload/2021/02/25/942602-nasa-parker-solar-probe-image-of-sun.jpg", "publishedAt": "2021-02-25T07:14:55Z", "content": "An image has been shared thousands of times on social media with claims that it shows \"the closest image of the Sun\", captured by US space agency NASA's Parker Solar Probe. The claims are false: the … [+4307 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Boeing slates Starliner check flight to ISS; SpaceX readies Crew-2 mission - The Times Hub", "description": "Technicians observe Boeing’s Starliner crew module being positioned on prime of the service module within the Industrial Crew and Cargo Processing Facility at NASA’s Kennedy Area Middle in Florida on Jan. 14, 2021. The Starliner spacecraft is being ready for …", "url": "https://thetimeshub.in/boeing-slates-starliner-check-flight-to-iss-spacex-readies-crew-2-mission/9678/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/boeing-slates-starliner-check-flight-to-iss-spacex-readies-crew-2-mission-7511a79-300x200.jpg", "publishedAt": "2021-02-25T06:48:06Z", "content": "Technicians observe Boeings Starliner crew module being positioned on prime of the service module within the Industrial Crew and Cargo Processing Facility at NASAs Kennedy Area Middle in Florida on J… [+7093 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Most cancers survivor to affix first all-private spaceflight on SpaceX’s Dragon - The Times Hub", "description": "A doctor assistant at St. Jude Youngsters’s Analysis Hospital will be a part of the primary all-private area mission in a fundraising effort for the Memphis-based charitable facility. The mission, referred to as Inspiration4, is scheduled for launch aboard a …", "url": "https://thetimeshub.in/most-cancers-survivor-to-affix-first-all-private-spaceflight-on-spacexs-dragon/9661/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/most-cancers-survivor-to-affix-first-all-private-spaceflight-on-spacexs-dragon-9596128-300x250.jpg", "publishedAt": "2021-02-25T06:47:02Z", "content": "A doctor assistant at St. Jude Youngsterss Analysis Hospital will be a part of the primary all-private area mission in a fundraising effort for the Memphis-based charitable facility.\r\nThe mission, re… [+5675 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA International Space Station astronauts prepare for a spacewalk - BollyInside", "description": "The spacewalks will be the 235th and 236th in the history of the International Space Station. ST. PETERSBURG, Fla. - Three Expedition 64 crew will make", "url": "https://www.bollyinside.com/news/nasa-international-space-station-astronauts-prepare-for-a-spacewalk/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/02/NASA-International-Space-Station-astronauts-prepare-for-a-spacewalk.jpg", "publishedAt": "2021-02-25T04:59:32Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comments on: See World's First Video of a Space-Time Crystal - SciTechDaily", "description": "Periodic pattern consisting of magnons is formed at room temperature. A team of researchers has succeeded in creating a micrometer-sized space-time crystal consisting of magnons at room temperature. With the help of an ultra-precise X-ray microscope, they wer…", "url": "https://scitechdaily.com/see-worlds-first-video-of-a-space-time-crystal/", "urlToImage": "https://scitechdaily.com/images/Space-Time-Crystal.gif", "publishedAt": "2021-02-25T03:49:20Z", "content": "Periodic pattern consisting of magnons is formed at room temperature.\r\nA team of researchers has succeeded in creating a micrometer-sized space-time crystal consisting of magnons at room temperature.… [+5033 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "A Major Ocean Current Could Be on The Verge of a Devastating 'Tipping Point' - ScienceAlert", "description": "The Atlantic Meridional Overturning Circulation (AMOC) sea currents are vital in transporting heat from the tropics to the Northern Hemisphere, but new research suggests climate change might knock the AMOC out of action much sooner than we anticipate", "url": "https://www.sciencealert.com/a-major-ocean-current-might-be-on-the-verge-of-a-climate-change-tipping-point", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/atlantic_meridional_circulation_still_nasa_1024.jpg", "publishedAt": "2021-02-25T00:46:12Z", "content": "The Atlantic Meridional Overturning Circulation (AMOC) sea currents are vital in transporting heat from the tropics to the Northern Hemisphere, but new research suggests climate change might knock th… [+3498 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Thousands of virtual universes created to solve the mystery of the Big Bang - SwordsToday.ie", "description": "Home page > News > Agenda1Sharing 24/02, 16:08Share on Facebook Share on TwitterAdd to your favorites.Remove from your favorites. Scientists are trying to", "url": "https://swordstoday.ie/thousands-of-virtual-universes-created-to-solve-the-mystery-of-the-big-bang/", "urlToImage": "https://news.google.com/images/logo/onedio-o-logo.png", "publishedAt": "2021-02-24T23:25:31Z", "content": null}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Cheryl Hines", "title": "Space, Tianwen-1 enters the parking orbit of Mars - SwordsToday.ie", "description": "Beijing, February 1 (Adcronos / Xinhua)After a complex orbital plot and a mission that began last July, the Chinese Tianwen-1 probe entered Mars' parking", "url": "https://swordstoday.ie/space-tianwen-1-enters-the-parking-orbit-of-mars/", "urlToImage": null, "publishedAt": "2021-02-24T23:12:55Z", "content": "Beijing, February 1 (Adcronos / Xinhua)\r\nAfter a complex orbital plot and a mission that began last July, the Chinese Tianwen-1 probe entered Mars’ parking orbit. The Chinese National Space Agency (C… [+1014 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "'Earliest primate fossils documented shed light on rise of mammals' - THE WEEK", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/international/2021/02/25/lst2-science-primates-oldest-fossil.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2021-02-24T22:25:18Z", "content": "Washington, Feb 25 (PTI) Scientists have documented the earliest-known fossil evidence of primates, an advance which sheds light on how life on land recovered after the extinction event 66 million ye… [+2329 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Apollo rock samples capture key moments in the Moon's early history, study find - Phys.org", "description": "Volcanic rock samples collected during NASA's Apollo missions bear the isotopic signature of key events in the early evolution of the Moon, a new analysis found. Those events include the formation of the Moon's iron core, as well as the crystallization of the…", "url": "https://phys.org/news/2021-02-apollo-samples-capture-key-moments.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/1-moon.jpg", "publishedAt": "2021-02-24T21:27:02Z", "content": "Volcanic rock samples collected during NASA's Apollo missions bear the isotopic signature of key events in the early evolution of the Moon, a new analysis found. Those events include the formation of… [+4751 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA launches satellite designed and built by MSU students - BollyInside", "description": "BOZEMAN - The culmination of years of work, a small satellite designed and built by students at Montana State University is expected to launch on Saturday", "url": "https://www.bollyinside.com/news/nasa-launches-satellite-designed-and-built-by-msu-students/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/02/NASA-launches-satellite-designed-and-built-by-MSU-students.jpg", "publishedAt": "2021-02-24T19:19:47Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Iridium in undersea crater confirms asteroid wiped out the dinosaurs – Physics World - physicsworld.com", "description": "Rock cores from Chicxulub crater contain elements associated with Cretaceous–Paleogene extinction event", "url": "https://physicsworld.com/a/iridium-in-undersea-crater-confirms-asteroid-wiped-out-the-dinosaurs/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2021/02/Hamish-24-Feb-2021.jpg", "publishedAt": "2021-02-24T19:01:51Z", "content": "Asteroid dust: Sean Gulick of the University of Texas at Austin (right), and Joanna Morgan at Imperial College London examine cores retrieved from the crater during the 2016 research mission led by t… [+3600 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Magnesium-based micromotors used to improve rheumatoid arthritis symptoms - News-Medical.Net", "description": "Rheumatoid arthritis is a chronic inflammatory disorder marked by joint pain, swelling and damage. Although medications, such as steroids, anti-inflammatory drugs and immunosuppressants, can help slow joint destruction and relieve pain, they have side effects…", "url": "https://www.news-medical.net/news/20210224/Magnesium-based-micromotors-used-to-improve-rheumatoid-arthritis-symptoms.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/shutterstock_390538711_6b3c40fdd32742caa54307db3553cab1-620x480.jpg", "publishedAt": "2021-02-24T17:10:00Z", "content": "Rheumatoid arthritis is a chronic inflammatory disorder marked by joint pain, swelling and damage. Although medications, such as steroids, anti-inflammatory drugs and immunosuppressants, can help slo… [+2035 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou", "title": "NASA delays 2nd planned hot fire test for Artemis I core stage - Orlando Sentinel", "description": "NASA’s plans to send the most powerful rocket ever to the moon is still waiting for its largest piece to make it to Kennedy Space Center. That won’t happen though until officials sign off on the 212-foot-tall core stage that awaits another test fire of its fo…", "url": "https://www.orlandosentinel.com/space/os-bz-nasa-core-stage-2nd-hot-fire-delay-20210224-okjxq3zpizdtvi3jj2nxv6pjeq-story.html", "urlToImage": "https://www.orlandosentinel.com/resizer/PVj9ktzG9FgQFCOVAxSaR2voFog=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/2CDYJFKJLK5PR5OFXNYNYC2R4A.aspx", "publishedAt": "2021-02-24T17:07:49Z", "content": null}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "First sign of an invisible star that can explain the enigma of dark matter - The Times Hub", "description": "A gravitational wave signal generated more than 7,000 million years ago – the largest that has been captured to date – has become one of the most controversial and exciting phenomena in physics today, because with the laws of the universe in hand In May 2019 …", "url": "https://thetimeshub.in/first-sign-of-an-invisible-star-that-can-explain-the-enigma-of-dark-matter/9005/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/first-sign-of-an-invisible-star-that-can-explain-the-enigma-of-dark-matter-adb4b9f-300x227.jpg", "publishedAt": "2021-02-24T16:53:49Z", "content": "A gravitational wave signal generated more than 7,000 million years ago – the largest that has been captured to date – has become one of the most controversial and exciting phenomena in physics today… [+7085 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Exercise generates immune cells in bone - Nature.com", "description": "Mechanosensing stem-cell niche promotes lymphocyte production.", "url": "https://www.nature.com/articles/d41586-021-00419-y", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-00419-y/d41586-021-00419-y_18880568.png", "publishedAt": "2021-02-24T16:17:15Z", "content": "It is pretty crowded in the bone marrow. Many types of stem and progenitor cell, including progenitors of immune cells, coexist side-by-side1,2 and are supported by nearby cells that generate special… [+7002 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Paul Alivisatos and Michael Grätzel win the Frontiers of Knowledge Award in Basic Sciences - EurekAlert", "description": "The BBVA Foundation Frontiers of Knowledge Award in the Basic Sciences category has gone in this thirteenth edition to Paul Alivisatos (University of California, Berkeley, United States) and Michael Grätzel (Ecole Polytechnique Fédérale de Lausanne, Switzerla…", "url": "https://www.eurekalert.org/pub_releases/2021-02/bf-paa022421.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257306_web.jpg", "publishedAt": "2021-02-24T15:09:32Z", "content": "IMAGE: Michael Grätzel, winner of the BBVA Foundation Frontiers of Knowledge Award in Basic Sciences.\r\n view more \r\nCredit: BBVA FOUNDATION\r\nThe BBVA Foundation Frontiers of Knowledge Award in the Ba… [+15493 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Finds That Supermassive Black Holes Could Form From Dark Matter - SciTechDaily", "description": "A new theoretical study has proposed a novel mechanism for the creation of supermassive black holes from dark matter. The international team find that rather than the conventional formation scenarios involving ‘normal’ matter, supermassive black holes could i…", "url": "https://scitechdaily.com/new-research-finds-that-supermassive-black-holes-could-form-from-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Warped-World.gif", "publishedAt": "2021-02-24T14:56:42Z", "content": "Turbulent disk of gas churning around a black hole. Credit: NASA’s Goddard Space Flight Center/Jeremy Schnittman\r\nA new theoretical study has proposed a novel mechanism for the creation of supermassi… [+3732 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Hundreds of skeletons fill this remote Himalayan lake. How did they get there? - Livescience.com", "description": "", "url": "https://www.livescience.com/roopkund-skeleton-lake-mystery.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6hEV2nrosZ4YRZTDpYYoRZ-1200-80.jpg", "publishedAt": "2021-02-24T13:32:21Z", "content": "High in the Himalayas, a four-to-five-day trek from the nearest village, sits an unassuming glacial lake called Roopkund. The spot is beautiful, a dollop of jewel-toned water amid rough gravel and sc… [+6467 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Pregnant women being infected at higher rate; JPMorgan's blockchain payments test is out of world and more - Devdiscourse", "description": "Pregnant women infected by COVID-19 at higher rate JPMorgan's blockchain payments test is literally out of this world  Stuck in space with bills to pay?\r\nJPMorgan Chase & Co has recently tested blockchain payments between satellites orbiting the earth, execut…", "url": "https://www.devdiscourse.com/article/science-environment/1471625-science-news-roundup-pregnant-women-being-infected-at-higher-rate-jpmorgans-blockchain-payments-test-is-out-of-world-and-m", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_29_17_3321446.png?width=920&format=jpeg", "publishedAt": "2021-02-24T13:00:20Z", "content": "Following is a summary of current science news briefs.\r\nPregnant women being infected at higher rates; COVID-19 from UK variant lasting longer\r\nThe following is a roundup of some of the latest scient… [+1599 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers detect cold gas pipelines feeding early, massive galaxies - Phys.org", "description": "To come into being, galaxies need a steady diet of cold gases to undergo gravitational collapse. The larger the galaxy, the more cold gas it needs to coalesce and to grow.", "url": "https://phys.org/news/2021-02-cold-gas-pipelines-early-massive.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/35-researchersd.jpg", "publishedAt": "2021-02-24T13:00:02Z", "content": "To come into being, galaxies need a steady diet of cold gases to undergo gravitational collapse. The larger the galaxy, the more cold gas it needs to coalesce and to grow.\r\nMassive galaxies found in … [+3987 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Jaunty Jupiter: Some Fascinating Images of the Gas Giant Captured by NASA's Juno Spacecraft (PHOTOS) | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "These images were recently processed by citizen scientist Tanya Oleksuik, who created the colour-enhanced pictures from the JunoCam camera data. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2021-02-24-fascinating-images-of-the-gas-giant-captured-by-nasas-juno", "urlToImage": "https://s.w-x.co/in-jupiter_1.jpg", "publishedAt": "2021-02-24T12:52:37Z", "content": "The National Aeronautics and Space Administration's (NASA) Juno spacecraft has delivered some new, stunning images of the stormy Jupiter. \r\nThe image above, which showcases a partial view of the plan… [+1840 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Like People, Moths Desire Dim Crimson Mild for a Romantic Night time - The Times Hub", "description": "People normally dim the sunshine and have the nice and cozy mild turned on for a extra romantic night time with their partner— and moths occur to do the identical in that regard. This analysis Frontier in Genetics printed confirmed that dim purple mild enhanc…", "url": "https://thetimeshub.in/like-people-moths-desire-dim-crimson-mild-for-a-romantic-night-time/8805/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/like-people-moths-desire-dim-crimson-mild-for-a-romantic-night-time-72454ae-300x196.jpg", "publishedAt": "2021-02-24T12:48:59Z", "content": "People normally dim the sunshine and have the nice and cozy mild turned on for a extra romantic night time with their partner and moths occur to do the identical in that regard.\r\nThis analysis Fronti… [+3771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Look Up The Night Sky As If You Are Standing On Mars, With NASA Perseverance Rover - India Times", "description": "Perseverance rover is up and running on Mars. it recently shared its entire landing from the parachute being deployed to touchdown on Mars in a rather exhilarating series of videos. And while it is on the planet, looking for hints of life on the planet, it al…", "url": "https://www.indiatimes.com/technology/news/360-degree-panorama-of-mars-nasa-perseverance-rover-535052.html", "urlToImage": "https://im.indiatimes.in/content/2021/Feb/Facebook-Image---2021-02-24T160850960_60362d2245bb2.jpg", "publishedAt": "2021-02-24T12:11:34Z", "content": "Perseverance rover is up and running on Mars. it recently shared its entire landing from the parachute being deployed to touchdown on Mars in a rather exhilarating series of videos. \r\nAnd while it is… [+1948 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Dogs came to North America with earliest humans, study says - WION", "description": "Scientists said Wednesday they had discovered the oldest remains of a domestic dog in the Americas dating back more than 10,000 years, suggesting the animals accompanied the first waves of human settlers.", "url": "https://www.wionews.com/world/dogs-came-to-north-america-with-earliest-humans-study-says-365902", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/02/24/184211-dogs-in-n-america.jpg", "publishedAt": "2021-02-24T11:31:57Z", "content": "Scientists said Wednesday they had discovered the oldest remains of a domestic dog in the Americas dating back more than 10,000 years, suggesting the animals accompanied the first waves of human sett… [+2775 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jumping Frost Crystals: Electrostatic De-icing Effect Could Be a Game-Changer for Aircraft and HVAC Industries - SciTechDaily", "description": "If you have ever gotten up on a winter morning and thrown yourself into the arduous task of scraping frost from a windshield, a Virginia Tech lab is engaging science that could make your life much easier. In research funded by the National Science Foundation,…", "url": "https://scitechdaily.com/jumping-frost-crystals-electrostatic-de-icing-effect-could-be-a-game-changer-for-aircraft-and-hvac-industries/", "urlToImage": "https://scitechdaily.com/images/Electrostatic-Charge-Breaks-Frost.jpg", "publishedAt": "2021-02-24T11:00:30Z", "content": "Frost breaks off and “jumps” upward due to an electrostatic charge. Credit: Virginia Tech\r\nIf you have ever gotten up on a winter morning and thrown yourself into the arduous task of scraping frost f… [+2387 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Hamish Hector", "title": "New Oculus Quest update will stop you from tripping over your couch - Techradar", "description": "You might want to sit down for this", "url": "https://www.techradar.com/news/new-oculus-quest-update-will-stop-you-from-tripping-over-your-couch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XZSUv5odywUk6T9Yi2rKFX-1200-80.jpg", "publishedAt": "2021-02-24T10:52:44Z", "content": "Oculus Quest is getting a new feature that lets you mark out your couch in VR. Not only could it help stop you from bumping into your chair, but it should make it easier than ever to switch in and ou… [+1461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabha Ghosh", "title": "Explained: With NASA’s Perseverance and China’s Tianwen-1, a flurry of missions to Mars - The Indian Express", "description": "Early on Friday India time, NASA’s Perseverance rover is scheduled to touch down on Mars. Last week, the UAE’s Hope mission entered Martian orbit, and was followed closely by a Chinese mission. The flotilla of missions represents the spread of planetary explo…", "url": "https://indianexpress.com/article/explained/nasa-mars-mission-perseverance-tianwen-1-elon-musk-7191694/", "urlToImage": "https://images.indianexpress.com/2021/02/Mars.jpg", "publishedAt": "2021-02-24T08:05:26Z", "content": "Going to Mars is non-trivial, since both planets revolve around the Sun and are hence in constant motion relative to each other. Earth and Mars are at their closest distance relative to each other ev… [+7523 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Harvard astronomer is convinced that an alien vessel visited Earth in 2017 - Times Now", "description": "Abraham 'Avi' Loeb, an Israeli-American theoretical physicist and a professor at Harvard, is convinced that an alien vessel visited Earth in 2017", "url": "https://www.timesnownews.com/the-buzz/article/harvard-astronomer-is-convinced-that-an-alien-vessel-visited-earth-in/724298", "urlToImage": "https://imgk.timesnownews.com/story/ET.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-24T04:34:19Z", "content": "There are many alien theories floating around on the internet at any given time. There are dedicated blogs, forums, and websites that discuss theories and claims about alien and UFO 'sightings'.\r\nThi… [+2265 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New gene-editing tool enables programming of sequential cuts over time - News-Medical.net", "description": "Researchers from the University of Illinois Chicago have discovered a new gene-editing technique that allows for the programming of sequential cuts -- or edits -- over time.", "url": "https://www.news-medical.net/news/20210223/New-gene-editing-tool-enables-programming-of-sequential-cuts-over-time.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gene-620x480.jpg", "publishedAt": "2021-02-23T23:16:00Z", "content": "Researchers from the University of Illinois Chicago have discovered a new gene-editing technique that allows for the programming of sequential cuts -- or edits -- over time.\r\nCRISPR is a gene-editing… [+2447 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "New SpaceX Starship prototype SN10 rocket could fly as soon as Thursday - CNET", "description": "The latest version of Elon Musk's Mars rocket is on the launch pad in Texas.", "url": "https://www.cnet.com/news/new-spacex-starship-prototype-sn10-rocket-could-fly-as-soon-as-thursday/", "urlToImage": "https://cnet2.cbsistatic.com/img/vxm8TANrcrdsxKZoH3lI07JiskA=/1200x630/2021/02/17/9ae0e4e1-56a6-4e3d-b99d-61e4a113f6a7/50906488116-c44db82fc1-k.jpg", "publishedAt": "2021-02-23T21:35:00Z", "content": "SN10 and its predecessor SN9 on the launch pad in Boca Chica, Texas, in early February.\r\nSpaceX\r\nJust a few weeks after its predecessor SN9 flew high and then crash-landed on Texas' Gulf Coast, SN10 … [+2615 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Pregnant women being infected at higher rates; Mars rover sends home movie of daredevil descent to landing on red planet and more - Devdiscourse", "description": "Pregnant women infected by COVID-19 at higher rate Chinese state fund invests in gene firm BGI  The Chinese government has made an investment in BGI Genomics Co, a listed Chinese company that has supplied millions of COVID-19 tests globally as the gene firm s…", "url": "https://www.devdiscourse.com/article/science-environment/1470777-science-news-roundup-pregnant-women-being-infected-at-higher-rates-mars-rover-sends-home-movie-of-daredevil-descent-to-lan", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_09_2020_18_21_51_0502987.jpg?width=920&format=jpeg", "publishedAt": "2021-02-23T20:58:13Z", "content": "Following is a summary of current science news briefs.\r\nPregnant women being infected at higher rates; COVID-19 from UK variant lasting longer\r\nThe following is a roundup of some of the latest scient… [+1768 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Milky Way May Be Swarming With Planets That Have Continents and Oceans Like Earth - SciTechDaily", "description": "According to a new study from the University of Copenhagen, Earth, Venus, and Mars were created from small dust particles containing ice and carbon. The discovery opens up the possibility that the Milky Way may be filled with aquatic planets. Astronomers have…", "url": "https://scitechdaily.com/the-milky-way-may-be-swarming-with-planets-that-have-continents-and-oceans-like-earth/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Earth-Like-Planets.jpg", "publishedAt": "2021-02-23T19:56:15Z", "content": "“All planets in the Milky Way may be formed by the same building blocks, meaning that planets with the same amount of water and carbon as Earth,” says Professor Anders Johansen. Credit: NASA, ESA and… [+4918 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Amel Semmache", "title": "Youngest American to go into space is also a cancer survivor - Phys.org", "description": "By the end of the year, Hayley Arceneaux will be the youngest American in space and one of the first tourists to enter orbit unaccompanied by professional astronauts.", "url": "https://phys.org/news/2021-02-youngest-american-space-cancer-survivor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-thisundatedp.jpg", "publishedAt": "2021-02-23T18:34:41Z", "content": "By the end of the year, Hayley Arceneaux will be the youngest American in space and one of the first tourists to enter orbit unaccompanied by professional astronauts.\r\nIt is a feat made all the more … [+3816 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Researchers reveal 'good bacteria' in breast milk changes over time - DTNext", "description": "The cocktail of beneficial bacteria passed from mother to infant through breast milk changes significantly over time and could act as a daily booster shot for infant immunity and metabolism, according to the findings of new research.", "url": "http://www.dtnext.in/Lifestyle/Wellbeing/2021/02/23233729/1277189/Researchers-reveal-good-bacteria-in-breast-milk-changes-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Feb/202102232337287975_Researchers-reveal-good-bacteria-in-breast-milk-changes_SECVPF.gif", "publishedAt": "2021-02-23T18:23:59Z", "content": "The cocktail of beneficial bacteria passed from mother to infant through breast milk changes significantly over time and could act as a daily booster shot for infant immunity and metabolism, accordin… [+2460 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sharon Parmet", "title": "Researchers invent new gene-editing tool - Phys.org", "description": "Researchers from the University of Illinois Chicago have discovered a new gene-editing technique that allows for the programming of sequential cuts—or edits—over time.", "url": "https://phys.org/news/2021-02-gene-editing-tool.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/8-dna.jpg", "publishedAt": "2021-02-23T18:07:35Z", "content": "Researchers from the University of Illinois Chicago have discovered a new gene-editing technique that allows for the programming of sequential cutsor editsover time.\r\nCRISPR is a gene-editing tool th… [+2799 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "How Long Will Space Junk Take to Burn Up? Here’s a Handy Chart - Universe Today", "description": "If the Roman Empire had been able to launch a satellite in a relatively high Low Earth Orbit – say about 1,200 km (750 miles) in altitude – only now would that satellite be close to falling back to Earth. And if the dinosaurs had launched a satellite into the…", "url": "https://www.universetoday.com/150233/how-long-will-spacejunk-take-to-burn-up-heres-a-handy-chart/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2018/10/research20180927_t.jpg", "publishedAt": "2021-02-23T17:12:04Z", "content": "If the Roman Empire had been able to launch a satellite in a relatively high Low Earth Orbit say about 1,200 km (750 miles) in altitude only now would that satellite be close to falling back to Earth… [+2631 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Technology News: New “metalens” shifts focus without tilting or moving - SelectScience", "description": "The design may enable miniature zoom lenses for drones, cellphones, or night-vision goggles", "url": "https://www.selectscience.net/technology-news/new-metalens-shifts-focus-without-tilting-or-moving/?artID=53963", "urlToImage": "http://www.selectscience.net/images/articles/9370_metalens_PR_image.jpg", "publishedAt": "2021-02-23T16:41:16Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Hebrew University finds first evidence of delayed radio flares after star is destroyed by black hole - EurekAlert", "description": "A team of researchers from the Hebrew University of Jerusalem has discovered the first evidence of radio flares emitted only long after a star is destroyed by a black hole.", "url": "https://www.eurekalert.org/pub_releases/2021-02/thuo-eph022321.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257162_web.jpg", "publishedAt": "2021-02-23T15:46:42Z", "content": "IMAGE: Figure 1\r\n view more \r\nCredit: Hebrew University\r\nA team of researchers from the Hebrew University of Jerusalem (HUJI) led by Dr. Assaf Horesh have discovered the first evidence of radio flare… [+2651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Sonia Singh", "title": "Video | \"Surreal Feeling of It Still Needs To Sink In\": Indian-American NASA Scientist On Mars Audio - NDTV", "description": "<B>New Delhi:</B> The US space agency NASA has released the first audio from Mars, a faint crackling recording of wind captured by the Perseverance rover. A microphone did not work during the rover's descent to the surface, but it was able to capture audio on…", "url": "https://www.ndtv.com/video/exclusive/news/nasa-scientist-swati-mohan-surreal-feeling-of-it-still-needs-to-sink-in-indian-american-nasa-scienti-576799", "urlToImage": "https://c.ndtvimg.com/2021-02/8r4veqpo_swatimohan_160x120_23_February_21.jpg", "publishedAt": "2021-02-23T15:00:16Z", "content": "New Delhi: The US space agency NASA has released the first audio from Mars, a faint crackling recording of wind captured by the Perseverance rover. A microphone did not work during the rover's descen… [+15742 chars]"}, {"source": {"id": null, "name": "FREE NEWS"}, "author": "John Kessler", "title": "The satellites of Mars found a common ancestor - FREE NEWS", "description": "Scientists from Switzerland have presented a new study, where they studied some of the orbital features and the unusual location of Deimos and Phobos", "url": "https://freenews.live/the-satellites-of-mars-found-a-common-ancestor/", "urlToImage": "https://freenews.live/wp-content/uploads/2021/02/mars-satellite.jpg", "publishedAt": "2021-02-23T15:00:03Z", "content": "Scientists from Switzerland have presented a new study, where they studied some of the orbital features and the unusual location of Deimos and Phobos. They concluded that these celestial bodies were … [+1754 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Western Australia: Big galaxies steal star-forming gas from their neighbours - India Education Diary", "description": "In research published today, astronomers have discovered that these small satellite galaxies also contain less ‘molecular’ gas at their centres.Molecular gas is found in giant clouds in the centres of galaxies and is the building material for new sta", "url": "https://indiaeducationdiary.in/university-of-western-australia-big-galaxies-steal-star-forming-gas-from-their-neighbours/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-11-3.png", "publishedAt": "2021-02-23T14:58:34Z", "content": "In research published today, astronomers have discovered that these small satellite galaxies also contain less molecular gas at their centres.\r\nMolecular gas is found in giant clouds in the centres o… [+3105 chars]"}, {"source": {"id": null, "name": "Londondailypost.com"}, "author": "Natalie Roberts", "title": "Why Doped Graphene Is the Key to Neutrino Energy Solutions | LondonDailyPost.com - London Daily Post", "description": "Long doubted or even ridiculed for his steadfast belief in the energy-production potential of neutrinos, Neutrino Energy Group founder and", "url": "https://londondailypost.com/why-doped-graphene-is-the-key-to-neutrino-energy-solutions/", "urlToImage": "https://londondailypost.com/wp-content/uploads/2021/02/Neutrino-Energy-Article-Image.jpg", "publishedAt": "2021-02-23T14:52:03Z", "content": "While there are important differences, the same basic principles apply in the case of doped graphene and neutrinos. Each neutrino that strikes the unique graphene-based nanomaterial developed by the … [+3107 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Climate change: West Antarctica's Getz glaciers flowing faster - BBC News", "description": "Satellites record the speed-up of glaciers along a 1,000km stretch of Antarctic coastline.", "url": "https://www.bbc.com/news/science-environment-56171302", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7ED2/production/_117166423_whatsubject.jpg", "publishedAt": "2021-02-23T14:48:39Z", "content": "Jonathan AmosScience correspondent@BBCAmoson Twitter\r\nimage copyrightPierre Dutrieux/BAS\r\nimage captionThe glaciers' floating fronts join to form a single, continuous platform, or shelf\r\nWherever you… [+3434 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA supply ship arrives at ISS | Voice of America - BollyInside", "description": "A NASA unmanned supply ship docked at the International Space Station (ISS) on Monday carrying more than 3,600 kilograms of research equipment and", "url": "https://www.bollyinside.com/news/nasa-supply-ship-arrives-at-iss-voice-of-america/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/02/NASA-supply-ship-arrives-at-ISS-Voice-of-America.jpg", "publishedAt": "2021-02-23T14:47:06Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ancient art reveals extinct goose - Phys.org", "description": "As a University of Queensland researcher examined a 4600-year-old Egyptian painting last year, a speckled goose caught his eye.", "url": "https://phys.org/news/2021-02-ancient-art-reveals-extinct-goose.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/ancientartre.jpg", "publishedAt": "2021-02-23T14:12:49Z", "content": "As a University of Queensland researcher examined a 4600-year-old Egyptian painting last year, a speckled goose caught his eye.\r\nUQ scientist Dr. Anthony Romilio said the strange but beautiful bird w… [+3189 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Talking on hand-held phones correlates with high-risk driving: Study - HT Auto", "description": "The study reveals that using hand-help phones while driving can correlate with activities such as overtaking on the inside of the car ahead, speeding, driving without a valid license and driving while intoxicated.", "url": "https://auto.hindustantimes.com/auto/news/talking-on-hand-held-phones-correlates-with-high-risk-driving-study-41614081860843.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/02/23/600x338/mobile-1209058_1920_1606277545697_1614085303439.jpg", "publishedAt": "2021-02-23T13:03:06Z", "content": "Often people tend to use their mobile phones while driving, especially the novice drivers. But these people, who are found speaking on hand-held phones, are prone to have high-risk driving behaviours… [+2099 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Hazza Al-Mansoori returns to Earth after historic UAE space mission - Arabnews", "description": "DUBAI: Emirati astronaut Hazza Al-Mansoori landed safely on Earth on Thursday after eight days in orbit on the International Space Station, and immediately wrapped himself in the UAE flag. Al-Mansoori, 35, touched down in the Kazakh steppes with US astronaut …", "url": "https://www.arabnews.com/node/1563406", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/10/03/1783116-893478520.jpg", "publishedAt": "2019-10-03T05:45:56Z", "content": "On Nov. 18, 2020, Greek Prime Minister Kyriakos Mitsotakis visited Abu Dhabi for the second time in a few months to meet with Crown Prince Mohammed bin Zayed.\r\nThe meeting proved historic. Greece and… [+4605 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "WATCH: Soyuz spacecraft carrying the UAE's first astronaut Hazza Al-Mansoori dock with International Space Station - Arabnews", "description": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the Baikonur Cosmodrome in Kazakhstan. Hazza Al-Mansoori from t…", "url": "https://www.arabnews.com/node/1559686", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/09/25/1770396-1560966155.jpg", "publishedAt": "2019-09-25T11:56:25Z", "content": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the… [+4358 chars]"}]}