{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Japan developing wooden satellites to cut space junk - BBC News", "description": "A Japanese forestry firm has partnered with Kyoto University in what would be a world first.", "url": "https://www.bbc.com/news/business-55463366", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16C49/production/_116275239_woodensatellite.jpg", "publishedAt": "2020-12-29T01:38:00Z", "content": "By Justin HarperBusiness reporter, BBC News\r\nimage copyrightSUMITOMO FORESTRY \r\nimage captionJapan plans a 2023 launch of the world's first satellite made out of wood.\r\nA Japanese company and Kyoto U… [+2765 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "Here's how lucky we are to live on Earth – BGR - BGR", "description": "Scientists have spent an incredible amount of manpower attempting to determine what conditions support life, and why Earth is so perfect for living things. Now, a researcher simulated 100,000 planets to try to determine how lucky we are that Earth has remaine…", "url": "https://bgr.com/2020/12/28/life-on-earth-odds-data/", "urlToImage": "https://bgr.com/wp-content/uploads/2019/02/earth.jpg?quality=70&strip=all", "publishedAt": "2020-12-29T01:25:07Z", "content": "<ul><li>Scientists have spent an incredible amount of manpower attempting to determine what conditions support life, and why Earth is so perfect for living things. </li><li>Now, a researcher simulate… [+3960 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Space images: The best of 2020 - BBC News", "description": "There was stunning cosmic imagery to feast on over the past year - here's our pick of the offerings.", "url": "https://www.bbc.com/news/science-environment-55057865", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0B34/production/_116286820_body.jpg", "publishedAt": "2020-12-29T00:48:00Z", "content": "By Paul RinconScience editor, BBC News website\r\nThere was stunning cosmic imagery to feast on in 2020, from Hubble's 30th birthday image to footage of a daring sample grab on an asteroid. Here's our … [+5333 chars]"}, {"source": {"id": null, "name": "Azadhindnews.com"}, "author": "https://www.facebook.com/arup.mandal.5", "title": "Nasa's Mars rover and the 'seven minutes of terror' - Azad Hind News", "description": "The US space agency (Nasa) has released an animation showing how its one-tonne Perseverance rover will land on Mars on 18 February. The robot is being sent to a crater called Jezero where it will search for evidence of past life. But to undertake this science…", "url": "https://www.azadhindnews.com/world-news/usa/nasas-mars-rover-and-the-seven-minutes-of-terror/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/W6UMM68dG9ZQDLt05VkoNQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTEwNjYuMTY4MDMyNzg2ODg1Mw--/https://media.zenfs.com/en-gb/bbc_us_articles_995/3ae652dc5f7d6f8db13faf0e3736f27f", "publishedAt": "2020-12-29T00:17:00Z", "content": "The US space agency (Nasa) has released an animation showing how its one-tonne Perseverance rover will land on Mars on 18 February.\r\nThe robot is being sent to a crater called Jezero where it will se… [+3255 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Feast your eyes on the space rocks Japan’s Hayabusa 2 mission harvested from asteroid Ryugu - TechCrunch", "description": "Japan’s ambitious second asteroid return mission, Hayabusa 2, has collected a wealth of material from its destination, Ryugu, which astronomers and other interested parties are almost certainly champing at the bit to play with. Though they may look like ordin…", "url": "http://techcrunch.com/2020/12/28/feast-your-eyes-on-the-space-rocks-japans-hayabusa-2-mission-brought-back-from-asteroid-ryugu/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/12/hayabusa-header.jpg?w=617", "publishedAt": "2020-12-28T22:52:34Z", "content": "Japan’s ambitious second asteroid return mission, Hayabusa 2, has collected a wealth of material from its destination, Ryugu, which astronomers and other interested parties are almost certainly champ… [+2416 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "A Massive Radioactive Jet From the Early Universe Has Been Spotted - Gizmodo", "description": "When the universe was a fledgling billion years old, a galaxy spewed a ginormous, fast-moving jet of radiation and plasma into the cosmos.", "url": "https://gizmodo.com/a-massive-radioactive-jet-from-the-early-universe-has-b-1845957727", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/c5uq1trmimsmuaeyinhk.jpg", "publishedAt": "2020-12-28T22:51:00Z", "content": "When the universe was a fledgling billion years old, a galaxy spewed a ginormous, fast-moving jet of radiation and plasma into the cosmos. Nearly 13 billion years later, that jet is visible to humans… [+3126 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "South Korea's 'Artificial Sun' Just Set a New World Record For High-Temperature Plasma - ScienceAlert", "description": "Scientists have just set a new world record for high-temperature sustained plasma with the Korea Superconducting Tokamak Advanced Research (KSTAR) device, reaching an ion temperature of above 100 million degrees Celsius (180 million degrees Fahrenhei", "url": "https://www.sciencealert.com/south-korea-s-artificial-sun-just-set-a-new-world-record-for-high-temperature-plasma", "urlToImage": "https://www.sciencealert.com/images/2020-12/processed/kstar-1_1024.jpg", "publishedAt": "2020-12-28T22:03:12Z", "content": "Scientists have just set a new world record for high-temperature sustained plasma with the Korea Superconducting Tokamak Advanced Research (KSTAR) device, reaching an ion temperature of above 100 mil… [+3670 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Clues to Missing Components of the Universe From Ripples in Space-Time - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9jbHVlcy10by1taXNzaW5nLWNvbXBvbmVudHMtb2YtdGhlLXVuaXZlcnNlLWZyb20tcmlwcGxlcy1pbi1zcGFjZS10aW1lL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-12-28T21:18:32Z", "content": null}, {"source": {"id": null, "name": "The News Pocket"}, "author": "Alice Jacob", "title": "'Unbearable loneliness': Vulnerable sufferers who shielded inform of their plight - The News Pocket", "description": "Terminally unwell people who were questioned to shield all through the pandemic have unveiled the \"unbearable\" loneliness they have endured in their final", "url": "https://thenewspocket.com/unbearable-loneliness-vulnerable-sufferers-who-shielded-inform-of-their-plight", "urlToImage": "https://www.belfasttelegraph.co.uk/news/northern-ireland/d6ac2/39908531.ece/AUTOCROP/w1240h700/2020-12-29_new_66106536_I1.JPG", "publishedAt": "2020-12-28T20:35:37Z", "content": "Terminally unwell people who were questioned to shield all through the pandemic have unveiled the “unbearable” loneliness they have endured in their final months. study of persons deemed clinically r… [+4508 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Gut cells sound the alarm when parasites invade - EurekAlert", "description": "When the parasite Cryptosporidium enters the body, it's cells in the intestines that first recognize the invader, triggering an early immune response, according to a new study led by a team from the University of Pennsylvania. A leading cause of diarrheal dis…", "url": "https://www.eurekalert.org/pub_releases/2020-12/uop-gcs122320.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2020-12-28T20:02:31Z", "content": "To effectively combat an infection, the body first has to sense it's been invaded, then the affected tissue must send out signals to corral resources to fight the intruder. Knowing more about these e… [+7007 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Thamarasee Jeewandara", "title": "The evolution of single amyloid fibrils into microcrystals - Phys.org", "description": "Amyloids refer to abnormal fibrous extracellular and proteinaceous deposits found in organs and tissues that form insoluble constructs that are resistant to degradation. Their formation can accompany disease, where each disease is characterized by a specific …", "url": "https://phys.org/news/2020-12-evolution-amyloid-fibrils-microcrystals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/13-theevolution.jpg", "publishedAt": "2020-12-28T19:50:01Z", "content": "Amyloids refer to abnormal fibrous extracellular and proteinaceous deposits found in organs and tissues that form insoluble constructs that are resistant to degradation. Their formation can accompany… [+7764 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Periodic and phase-locked modulation in the pulsar PSR B1929+10 investigated with FAST - Phys.org", "description": "Using the Five-hundred-meter Aperture Spherical radio Telescope (FAST), astronomers from the Chinese Academy of Sciences (CAS) and elsewhere have conducted single-pulse observations of a pulsar known as PSR B1929+10. Results of the monitoring campaign shed mo…", "url": "https://phys.org/news/2020-12-periodic-phase-locked-modulation-pulsar-psr.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/1-periodicandp.jpg", "publishedAt": "2020-12-28T19:00:01Z", "content": "Using the Five-hundred-meter Aperture Spherical radio Telescope (FAST), astronomers from the Chinese Academy of Sciences (CAS) and elsewhere have conducted single-pulse observations of a pulsar known… [+3822 chars]"}, {"source": {"id": null, "name": "Intelligentliving.co"}, "author": "Andrea D. Steffen", "title": "This Material Stores Solar Energy. The Process Works Without Electronic Components. - Intelligent Living", "description": "The world’s transition from fossil fuels to renewables to tackle climate change will require energy storage techniques because the sun isn’t always shining, and the wind isn’t always blowing. It’s a hot topic among research teams nowadays – from studying ener…", "url": "https://www.intelligentliving.co/material-stores-solar-energy/", "urlToImage": "https://i2.wp.com/www.intelligentliving.co/wp-content/uploads/2020/12/Henning-Sorby-from-Pixabay.jpg?fit=1920%2C1130&ssl=1", "publishedAt": "2020-12-28T18:25:00Z", "content": "The world’s transition from fossil fuels to renewables to tackle climate change will require energy storage techniques because the sun isn’t always shining, and the wind isn’t always blowing. It’s a … [+3831 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Primordial black holes and the search for dark matter from the multiverse - Phys.org", "description": "The Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU) is home to many interdisciplinary projects which benefit from the synergy of a wide range of expertise available at the institute. One such project is the study of black holes th…", "url": "https://phys.org/news/2020-12-primordial-black-holes-dark-multiverse.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/primordialbl.jpg", "publishedAt": "2020-12-28T18:14:39Z", "content": "The Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU) is home to many interdisciplinary projects which benefit from the synergy of a wide range of expertise available at th… [+5317 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Peter Evans, The Conversation", "title": "Four ways in which quantum physics can challenge your reality - Scroll.in", "description": "Working out the basic nature of reality according to quantum mechanics is a little bit like an impossible Sudoku.", "url": "https://scroll.in/article/982337/four-ways-in-which-quantum-physics-can-challenge-your-reality", "urlToImage": "https://d1u4oo4rb13yy8.cloudfront.net/book/79494-ggdmpugplg-1516284022.jpg", "publishedAt": "2020-12-28T18:00:00Z", "content": "Imagine opening the weekend paper and looking through the puzzle pages for the Sudoku. You spend your morning working through this logic puzzle, only to realise by the last few squares there is no co… [+4588 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "Solar Orbiter makes its first Venus flyby - The Shillong Times", "description": "The joint US-European Solar Orbiter spacecraft has completed its first of many gravity assist flybys of Venus, to start bringing it closer to the Sun and tilting its orbit in order to observe our star from different perspectives.The spacecraft's clos", "url": "https://theshillongtimes.com/2020/12/29/solar-orbiter-makes-its-first-venus-flyby/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2020/12/Solar.jpg", "publishedAt": "2020-12-28T17:51:00Z", "content": "The joint US-European Solar Orbiter spacecraft has completed its first of many gravity assist flybys of Venus, to start bringing it closer to the Sun and tilting its orbit in order to observe our sta… [+1461 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "2020 in Space: Ten Out of the World Happenings That Kept Astronomy Enthusiasts on Their Toes This Year | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "In case you missed any of these mind-blowing space stories of 2020, then here is a reckoner! - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2020-12-28-2020-in-space-ten-out-of-the-world-news-that-kept-astronomy", "urlToImage": "https://s.w-x.co/in-venus1.jpg", "publishedAt": "2020-12-28T17:34:16Z", "content": "From developing multiple vaccines for a pandemic to retrieving samples from outer worlds2020 was undoubtedly a year of science! Despite unimaginable human suffering, humanity witnessed some unforgett… [+11768 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Groups of bacteria can work together to better protect crops and improve their growth - EurekAlert", "description": "Certain bacteria, known as plant-growth-promoting bacteria (PGPB), can improve plant health or protect them from pathogens and are used commercially to help crops. To further improve agricultural yields, it is helpful to identify factors that can improve PGPB…", "url": "https://eurekalert.org/pub_releases/2020-12/aps-gob122820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252503_web.jpg", "publishedAt": "2020-12-28T17:15:49Z", "content": "IMAGE: Scientist Susanna Harris in the lab.\r\n view more \r\nCredit: Noam Eckshtain-Levi, Susanna Leigh Harris, Reizo Quilat Roscios, and Elizabeth Anne Shank\r\nCertain bacteria, known as plant-growth-pr… [+3038 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "Young Students Send Questions to Astronauts Aboard Space Station - Space Ref", "description": "Young Students Send Questions to Astronauts Aboard Space Station - SpaceRef", "url": "http://www.spaceref.com/news/viewpr.html?pid=56762", "urlToImage": null, "publishedAt": "2020-12-28T17:04:25Z", "content": "Young Students Send Questions to Astronauts Aboard Space Station\r\nPress Release\r\n From: NASA HQPosted: Monday, December 28, 2020 \r\nStudents from across the country will have an opportunity this week … [+2262 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Self-learning algorithms can help analyze biological image data - News-Medical.net", "description": "Imaging techniques enable a detailed look inside an organism. But interpreting the data is time-consuming and requires a great deal of experience.", "url": "https://www.news-medical.net/news/20201228/Self-learning-algorithms-can-help-analyze-biological-image-data.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2020-12-28T17:00:00Z", "content": "Imaging techniques enable a detailed look inside an organism. But interpreting the data is time-consuming and requires a great deal of experience. Artificial neural networks open up new possibilities… [+4637 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Watch| NASA captures video of galaxies that ‘appear to be locked in a cosmic dance’ - Moneycontrol.com", "description": "Posting the video, NASA’s Hubble Space Telescope account said that the \"galaxies appear to be locked in a cosmic dance.\"", "url": "https://www.moneycontrol.com/news/trends/watch-nasa-captures-video-of-galaxies-that-appear-to-be-locked-in-a-cosmic-dance-6279441.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/12/pjimage-7-1-770x433.jpg", "publishedAt": "2020-12-28T16:51:00Z", "content": "NASA recently took to its official Instagram account to post a mesmerising video of two galaxies intertwined in the constellation Hydra. Posting the video, NASAs Hubble Space Telescope account said t… [+381 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Discovery Supports a Surprising New View of How Life on Earth Originated - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9kaXNjb3Zlcnktc3VwcG9ydHMtYS1zdXJwcmlzaW5nLW5ldy12aWV3LW9mLWhvdy1saWZlLW9uLWVhcnRoLW9yaWdpbmF0ZWQv0gEA?oc=5", "urlToImage": null, "publishedAt": "2020-12-28T16:45:33Z", "content": null}, {"source": {"id": null, "name": "Inverse"}, "author": "Evan Meredith", "title": "Inverse Daily: The \"final stage\" influencer - Inverse", "description": "As the Covid-19 vaccine rollout progresses, we need about 75 percent of the country to get vaccinated to end the pandemic.", "url": "https://www.inverse.com/science/inverse-daily-the-final-stage-influencer", "urlToImage": "https://imgix.bustle.com/uploads/image/2020/12/28/12e44371-60d8-4a20-843e-fb82eec2b68a-1a6ff12d-b9fd-4a27-9a20-7a37b3943c4c-gettyimages-1230125095.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-12-28T16:00:00Z", "content": "Welcome back\r\n to a new week of Inverse Daily! We've missed you.\r\nAs 2020 comes to a close, we've got exciting plans to revisit some of our favorite stories of the year. Stay tuned later this week fo… [+5181 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Edinburgh's Study on Deep-sea project charts future course of Atlantic Ocean - India Education Diary", "description": "A landmark project to study the Atlantic Ocean’s vast depths has laid the foundations for efforts to safeguard the ocean for future generations.The most in-depth assessment of deep-sea ecosystems t…", "url": "https://indiaeducationdiary.in/university-of-edinburghs-study-on-deep-sea-project-charts-future-course-of-atlantic-ocean/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-12-28T15:52:00Z", "content": "A landmark project to study the Atlantic Oceans vast depths has laid the foundations for efforts to safeguard the ocean for future generations.\r\nThe most in-depth assessment of deep-sea ecosystems to… [+3051 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "The Space News We’ll Be Watching in 2021 - Gizmodo", "description": "Blast off to adventure in the amazing year 2021! No doubt, we’re expecting a ton of cool and exciting space-related happenings next year, with these stories being among the most highly anticipated.", "url": "https://gizmodo.com/the-space-news-we-ll-be-watching-in-2021-1845842911", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/iwbzdv9vikry9el0h73f.jpg", "publishedAt": "2020-12-28T15:25:00Z", "content": "Blast off to adventure in the amazing year 2021! No doubt, were expecting a ton of cool and exciting space-related happenings next year, with these stories being among the most highly anticipated.\r\nT… [+10569 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Industry collaboration leads to important milestone in the creation of a quantum computer - EurekAlert", "description": "One of the obstacles for progress in the quest for a working quantum computer has been that the working devices that go into a quantum computer and perform the actual calculations, the qubits, have hitherto been made by universities and in small numbers. But …", "url": "https://www.eurekalert.org/pub_releases/2020-12/fos--icl122820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252494_web.jpg", "publishedAt": "2020-12-28T15:12:51Z", "content": "IMAGE: (a) Scanning electron image of one of the Foundry-fabricated quantum dot devices. Four quantum dots can be formed in the silicon (dark grey), using four independent control wires (light grey).… [+6060 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Faster, greener way of producing carbon spheres - EurekAlert", "description": "A fast, green and one-step method for producing porous carbon spheres, which are a vital component for carbon capture technology and for new ways of storing renewable energy, has been developed by Swansea University researchers.\r\n\r\nThe method produces spheres…", "url": "https://www.eurekalert.org/pub_releases/2020-12/su-fgw122820.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252493_web.jpg", "publishedAt": "2020-12-28T14:56:37Z", "content": "IMAGE: Carbon spheres - microscope images\r\nA fast, green and one-step method for producing porous carbon spheres, which are a vital component for carbon capture technology and for new ways of storing… [+6091 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Discovery boosts theory that life on Earth arose from RNA-DNA mix - Phys.org", "description": "Chemists at Scripps Research have made a discovery that supports a surprising new view of how life originated on our planet.", "url": "https://phys.org/news/2020-12-discovery-boosts-theory-life-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/rna.jpg", "publishedAt": "2020-12-28T14:21:00Z", "content": "Chemists at Scripps Research have made a discovery that supports a surprising new view of how life originated on our planet.\r\nIn a study published in the chemistry journal Angewandte Chemie, they dem… [+4966 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rachael Rettner", "title": "The strangest medical cases of 2020 - Livescience.com", "description": "A number of intriguing medical cases caught our eye this year.", "url": "https://www.livescience.com/strangest-medical-cases-2020.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4uhfxdKcyLka3rg5pwbZUM-1200-80.jpg", "publishedAt": "2020-12-28T14:18:00Z", "content": "From a man with green urine to a teenager with a sewing pin in his heart, a number of intriguing medical cases caught our eye this year.\r\nThese \"case reports,\" which describe the conditions of indivi… [+12273 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Siobhan Roberts", "title": "The Lasting Lessons of John Conway’s Game of Life - The New York Times", "description": "Fifty years on, the mathematician’s best known (and, to him, least favorite) creation confirms that “uncertainty is the only certainty.”", "url": "https://www.nytimes.com/2020/12/28/science/math-conway-game-of-life.html", "urlToImage": "https://static01.nyt.com/images/2020/12/29/science/00SCI-CONWAY1/00SCI-CONWAY1-facebookJumbo-v2.jpg", "publishedAt": "2020-12-28T14:18:00Z", "content": "Life swiftly eclipsed Dr. Conways many other mathematical accomplishments, and he came to regard his missive to Mr. Gardner as the fatal letter.\r\nThe Game of Life motivated the use of cellular automa… [+1281 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Two 'Space Architects' Just Completed 60 Days inside a Foldable 'Moon Shelter' - News18", "description": "Two architects have lived 60 days in a shelter that simulated harsh moon-like conditions.", "url": "https://www.news18.com/news/buzz/two-space-architects-just-completed-60-days-inside-a-foldable-moon-shelter-3222140.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/12/1609160309_moon.jpeg", "publishedAt": "2020-12-28T12:59:02Z", "content": "Two architects have lived 60 days in a shelter that simulated harsh moon-like conditions. The shelter named Lunark is situated in Greenland.\r\nThe two space architects named Sebastian Aristotelis and … [+2201 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Vlad Radu", "title": "A Closer Look at the Hennessey Venom F5's 1817-Horsepower LS-Based 'Fury' V8 - autoevolution", "description": "The American tuner has made a name for itself by transforming regular vehicles into high-performance works of automotive art. Additionally, it has also been busy developing one of the fastest road-legal hypercars ever made, the Venom F5, which is powered by a…", "url": "https://www.autoevolution.com/news/a-closer-look-at-the-hennessey-venom-f5-s-1817-horsepower-ls-based-fury-v8-153658.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/a-closer-look-at-hennesseys-mind-blowing-1817-horsepower-ls-based-fury-v8-153658-7.jpg", "publishedAt": "2020-12-28T12:39:00Z", "content": "One of Hennessey’s most successful vehicles was the Venom GT, a modified Lotus Exige powered by a beefed-up version of GM’s LS7 small-block V8 that produces 1,244 hp. It set a Guinness World Record f… [+3010 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Sidney Fussell", "title": "How Your Digital Trails Wind Up in the Police’s Hands - WIRED", "description": "Phone calls. Web searches. Location tracks. Smart speaker requests. They’ve become crucial tools for law enforcement, while users often are unaware.", "url": "https://www.wired.com/story/your-digital-trails-polices-hands/", "urlToImage": "https://media.wired.com/photos/5fe3a501d9bc1faf2d4229b9/191:100/w_1280,c_limit/Business-Digital-Trail-Police.jpg", "publishedAt": "2020-12-28T12:00:00Z", "content": "Michael Williams every move was being tracked without his knowledgeeven before the fire. In August, Williams, an associate of R&amp;B star and alleged rapist R. Kelly, allegedly used explosives to de… [+3898 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "The coolest ancient weapons discovered in 2020 - Livescience.com", "description": "Archaeologists unearthed amazing swords, daggers and other weaponry this year.", "url": "https://www.livescience.com/ancient-weapons-swords-found-in-2020.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/e7yszp3mhR3eRCzTXJ5Fsd-1200-80.jpg", "publishedAt": "2020-12-28T12:00:00Z", "content": "Ancient swords, elaborate daggers, even early artillery 2020 turned up a number of intriguing ancient weapons that tell the story of the violence of the past. These discoveries cover hundreds of thou… [+7579 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Mystery behind diamond-studded meteorite that hit Sudan in 2008 revealed - The Indian Express", "description": "A sample of 50 grams analysed by a team under an infrared microscope has found that the meteorite had a unique mineral makeup, including 'amphibole' which requires prolonged exposure to water in order to develop.", "url": "https://indianexpress.com/article/technology/science/meteorite-sudan-2008-giant-asteroid-water-minerals-7122812/", "urlToImage": "https://images.indianexpress.com/2020/12/sudan-meteorite.jpg", "publishedAt": "2020-12-28T11:37:06Z", "content": "The mystery behind a diamond-studded meteorite that exploded over Sudan in 2008 has been somewhat revealed as per researchers at Southwest Research Institute based in Texas, US. The study suggests th… [+2250 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Ripples in space-time could provide clues to missing components of the universe - Phys.org", "description": "There's something a little off about our theory of the universe. Almost everything fits, but there's a fly in the cosmic ointment, a particle of sand in the infinite sandwich. Some scientists think the culprit might be gravity—and that subtle ripples in the f…", "url": "https://phys.org/news/2020-12-ripples-space-time-clues-components-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/ripplesinspa.gif", "publishedAt": "2020-12-28T11:18:31Z", "content": "There's something a little off about our theory of the universe. Almost everything fits, but there's a fly in the cosmic ointment, a particle of sand in the infinite sandwich. Some scientists think t… [+3927 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Jahnavi Gupta", "title": "Scientists unveil mystery behind drug resistance in cancer through ecDNA forms - Hindustan Times", "description": "Researchers from Sanger Center here claimed that the free-floating circular DNA fragments, found in cancer cells, generate drug resistance in cancer.", "url": "https://www.hindustantimes.com/science/scientists-unveil-mystery-behind-drug-resistance-in-cancer-through-ecdna-forms/story-HN9RcNXQ57Vx0AOzVkKeaM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/12/28/Pictures/_15da9e7c-48f6-11eb-b097-bed98ba4ca79.jpg", "publishedAt": "2020-12-28T10:25:00Z", "content": "Researchers from Sanger Center here claimed that the free-floating circular DNA fragments, found in cancer cells, generate drug resistance in cancer.\r\nPublished in the journal Nature, a study provide… [+3796 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Laura Sanders", "title": "Octopuses punch when they are hungry and angry, study reveals - Euronews", "description": "This study has found that octopuses, one of the most intelligent sea creatures, throw punches at other fish.", "url": "https://www.euronews.com/living/2020/12/28/octopuses-punch-when-they-are-hungry-and-angry-study-reveals", "urlToImage": "https://static.euronews.com/articles/stories/05/22/20/70/1000x563_cmsv2_c801aea8-2fdb-596c-af61-e86716673598-5222070.jpg", "publishedAt": "2020-12-28T10:07:30Z", "content": "New research has revealed that octopuses often throw punches when they’re hunting alongside other fish.\r\nThe eight-legged cephalopods are known to hunt collaboratively with groupers (large-mouthed, h… [+2280 chars]"}, {"source": {"id": null, "name": "112 International"}, "author": null, "title": "Santa Claus receives license for commercial flights to ISS - 112 International", "description": "He is now eligible to conduct space deliveries using his StarSleigh-1 space capsule powered by the Rudolph Rocket", "url": "https://112.international/society/santa-claus-receives-license-for-commercial-flights-to-iss-57683.html", "urlToImage": "https://img.112.international/original/2020/12/28/292702.jpg", "publishedAt": "2020-12-28T09:35:00Z", "content": "The Federal Aviation Administration (FAA) has decided to grant Santa Claus and his reindeer-powered sleigh special authority that would allow him to conduct air-cargo-delivery services directly to ro… [+895 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Steven Brown", "title": "War in space 'inevitable' as countries 'prepare' - expert issues terrifying warning - Daily Express", "description": "A WAR breaking out in space is 'inevitable' as threats of militarisation continues to rise, an expert has warned.", "url": "https://www.express.co.uk/news/world/1375939/world-war-3-news-space-war-Professor-Ram-Jakhu-china-usa-Russia-news", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1375939.jpg", "publishedAt": "2020-12-28T08:00:00Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "New easy route to travel through solar system discovered - THE WEEK", "description": "Spacecrafts can use the new superhighway system to reach planets", "url": "https://www.theweek.in/news/sci-tech/2020/12/28/new-easy-route-to-travel-through-solar-system-discovered.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/biztech/2018/April/nasa-tess-spacecraft-nasa.jpg", "publishedAt": "2020-12-28T06:55:13Z", "content": "Researchers have discovered a previously unknown superhighway network that can be used to travel through the Solar System much easier and faster.\r\nThe new route could be used to send spacecraft to th… [+1628 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Starwatch: wildly twinkling Sirius outshines the sun - The Guardian", "description": "Search out the brightest star in the night sky and its parent constellation", "url": "https://www.theguardian.com/science/2020/dec/28/starwatch-wildly-twinkling-sirius-outshines-the-sun", "urlToImage": "https://i.guim.co.uk/img/media/d84a70a5b09db38f8cc141e37fe10600a3ab372b/374_0_3209_1926/master/3209.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8cf44a75d1cf9481375fd53da4b78f9b", "publishedAt": "2020-12-28T06:00:00Z", "content": "Starwatch\r\nThe winter sky in the northern hemisphere is filled with delights. This week search out the brightest star in the night sky, and from there explore that stars parent constellation of Canis… [+792 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Kellen Beck", "title": "Samples From Ryugu Asteroid Revealed After Delivery To Earth - Mashable India", "description": "The Japan Aerospace Exploration Agency (JAXA) showed off a collection of samples from the asteroid Ryugu on Thursday following the return of the Hayabusa2 probe.\n\n\nThe curation work for the Ryugu sample is steadily progressing. On December 21, sample catcher …", "url": "https://in.mashable.com/science/19176/samples-from-ryugu-asteroid-revealed-after-delivery-to-earth", "urlToImage": "https://sm.mashable.com/t/mashable_in/news/s/samples-fr/samples-from-ryugu-asteroid-revealed-after-delivery-to-earth_zzmf.1200.png", "publishedAt": "2020-12-28T05:40:00Z", "content": "The Japan Aerospace Exploration Agency (JAXA) showed off a collection of samples from the asteroid Ryugu on Thursday following the return of the Hayabusa2 probe.\r\nThe curation work for the Ryugu samp… [+1374 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "2021 Will Bring In Four Eclipses And Two Of Them Will Be Visible In India - India Times", "description": "In 2021, there will be four eclipses, including one total solar eclipse and one total lunar eclipse. Two of these will be visible from India, Ujjain-based Jiwaji Observatory's Superintendent Dr Rajendraprakash Gupt said on Sunday.Mr Gupt told PTI that the fir…", "url": "https://www.indiatimes.com/trending/environment/2021-four-eclipses-530597.html", "urlToImage": "https://im.indiatimes.in/content/2020/Dec/eclipse-2_5fe96f34824f9.jpg", "publishedAt": "2020-12-28T05:33:06Z", "content": "In 2021, there will be four eclipses, including one total solar eclipse and one total lunar eclipse. Two of these will be visible from India, Ujjain-based Jiwaji Observatory's Superintendent Dr Rajen… [+1138 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Rebecca Sohn", "title": "8 History-Making Space Stories Of 2020 - Mashable India", "description": "It’s been a hard year on Earth. \nBut despite a global pandemic, scientists made huge strides in understanding the universe beyond our planet. They detected far-off signals, launched astronauts into orbit around the Earth, and sent probes to Mars, the moon, an…", "url": "https://in.mashable.com/science/19179/8-history-making-space-stories-of-2020", "urlToImage": "https://sm.mashable.com/t/mashable_in/fun/8/8-history-/8-history-making-space-stories-of-2020_3tee.1200.jpg", "publishedAt": "2020-12-28T04:50:00Z", "content": "Its been a hard year on Earth. \r\nBut despite a global pandemic, scientists made huge strides in understanding the universe beyond our planet. They detected far-off signals, launched astronauts into o… [+14533 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Are earthquakes to blame for Arctic warming? - Sentinelassam - The Sentinel Assam", "description": "The Arctic’s rapid warming could have been triggered by a series of great earthquakes, suggests new...", "url": "https://www.sentinelassam.com/international/are-earthquakes-to-blame-for-arctic-warming-518295", "urlToImage": "https://assets.sentinelassam.com/h-upload/2020/12/27/184585-earthquakes.jpg", "publishedAt": "2020-12-28T04:31:55Z", "content": "MOSCOW: The Arctic's rapid warming could have been triggered by a series of great earthquakes, suggests new research.\r\nIn the Arctic, one of the factors driving climate warming is the release of meth… [+1642 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Astrophysicists Discover Unfathomably Large Intergalactic Gas Filament - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9hc3Ryb3BoeXNpY2lzdHMtZGlzY292ZXItdW5mYXRob21hYmx5LWxhcmdlLWludGVyZ2FsYWN0aWMtZ2FzLWZpbGFtZW50L9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-12-27T23:41:41Z", "content": null}, {"source": {"id": null, "name": "Best gaming pro"}, "author": "Dinu das", "title": "The ashes of Scotty from Star Trek are aboard the International Space Station - Best gaming pro", "description": null, "url": "https://bestgamingpro.com/the-ashes-of-scotty-from-star-trek-are-aboard-the-international-space-station/", "urlToImage": null, "publishedAt": "2020-12-27T23:15:00Z", "content": "The ashes of the late James Doohan, who played chief engineer Montgomery Scott on the original Star Trek television series, have been aboard the International Space Station for 12 years and the Sunda… [+1547 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Katie Dowd", "title": "Have you seen a perfect halo around the moon recently? Here's why. - SFGate", "description": "If you've seen an angelic-looking moon in the Bay Area sky lately, there's a fun...", "url": "https://www.sfgate.com/science/article/california-halo-around-the-moon-what-causes-15830399.php", "urlToImage": "https://s.hdnux.com/photos/01/15/74/20/20431882/3/rawImage.jpg", "publishedAt": "2020-12-27T20:36:34Z", "content": "If you've seen an angelic-looking moon in the Bay Area sky lately, there's a fun scientific reason for the celestial sight.\"Light from the almost full moon is refracting through ice crystals in the h… [+1471 chars]"}, {"source": {"id": null, "name": "Telegraph India"}, "author": "Prasun Chaudhuri", "title": "Sci-Fly - Telegraph India", "description": "Despite A Raging Pandemic, 2020 Has Been An Exciting Year For Science", "url": "https://www.telegraphindia.com/science-tech/sci-fly-this-year-wasnt-a-total-write-off-for-science/cid/1801853", "urlToImage": "https://assets.telegraphindia.com/telegraph/2020/Dec/1607166080_covid-vaccine.jpg", "publishedAt": "2020-12-27T20:15:30Z", "content": "Despite a raging pandemic, 2020 has been an exciting year for science \r\nThis may have been the year the human race was forced into near-submission by a rampaging virus but it wasn’t a total write-off… [+5499 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Unique meteorite hints at parent asteroid lurking in our solar system - SlashGear", "description": "Researchers have been conducting a study on a mysterious meteorite that exploded over Sudan in 2008. The meteor was estimated by NASA to weigh about nine tons and to be nearly 13-foot in diameter w…", "url": "https://www.slashgear.com/unique-meteorite-hints-at-parent-asteroid-lurking-in-our-solar-system-27652587/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2020/12/asteroid.jpg", "publishedAt": "2020-12-27T15:18:42Z", "content": "Researchers have been conducting a study on a mysterious meteorite that exploded over Sudan in 2008. The meteor was estimated by NASA to weigh about nine tons and to be nearly 13-foot in diameter whe… [+1694 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "10 geological discoveries that absolutely rocked 2020 - Livescience.com", "description": "", "url": "https://www.livescience.com/geological-discoveries-2020.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TBEAyDNuBvqWq9awXAdPmH-1200-80.jpg", "publishedAt": "2020-12-27T14:53:00Z", "content": "This year, scientists uncovered some of the Earth's most well-kept secrets. They found hidden rivers, chunks of lost continents and remnants of ancient rainforests, and they delved into the planet's … [+7756 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Yasemin Saplakoglu", "title": "10 times science made a sucky year suck less - Livescience.com", "description": "Clapping seals, Great conjunction, COVID-19 vaccines, stink flirting...here's the amazing science of 2020.", "url": "https://www.livescience.com/10-times-science-made-sucky-year-suck-less.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cKf8r4ig2MMwUjh8pXMYQR-1200-80.jpg", "publishedAt": "2020-12-27T14:37:00Z", "content": "With a novel coronavirus devastating the world since the spring, the year 2020 has been difficult. Still, even in these hard times, some moments of joy crept through   and some of them were sparked b… [+9481 chars]"}, {"source": {"id": null, "name": "Shepherdgazette.com"}, "author": null, "title": "A 4G community on the Moon is unhealthy information for radio astronomy - The Shepherd of the Hills Gazette", "description": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &", "url": "https://shepherdgazette.com/a-4g-community-on-the-moon-is-unhealthy-information-for-radio-astronomy/", "urlToImage": "https://shepherdgazette.com/wp-content/uploads/2020/12/N654sppHtLsMqsNgVzKPLM.jpg", "publishedAt": "2020-12-27T14:19:01Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com’s Expert Voices: Op-Ed &amp; Insights. \r\nEmma Alexander, PhD Candidate in Astrophysics,… [+5475 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "The most distant galaxy is upending our model of the universe's history - Salon", "description": "A new study confirms GN-z11 is the oldest and most distant galaxy humans have ever sighted", "url": "https://www.salon.com/2020/12/27/the-newly-discovered-most-distant-galaxy-is-upending-our-model-of-the-universes-history/", "urlToImage": "https://media.salon.com/2020/12/galaxy-gn-z11-1223201.jpg", "publishedAt": "2020-12-27T13:00:00Z", "content": "Looking out into the universe with a telescope means looking back in time, as the speed of light is so slow that even the light of nearby stars in our own galaxy takes years or millennia to reach us.… [+5333 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Unknown Prehistoric 'Sea Dragon' Species Discovered By Fossil Hunter Near UK - India Times", "description": "The fossil of a mysterious marine reptile from 150 years ago has been discovered by scientists. It apparently belongs to a previously undiscovered species. The well-preserved reptile was found in a Late Jurassic deep marine deposit along the English Channel c…", "url": "https://www.indiatimes.com/trending/environment/prehistoric-sea-dragon-species-discovered-uk-530583.html", "urlToImage": "https://im.indiatimes.in/content/2020/Dec/etches-2_5fe876a745fb5.PNG", "publishedAt": "2020-12-27T11:45:30Z", "content": "The fossil of a mysterious marine reptile from 150 years ago has been discovered by scientists. It apparently belongs to a previously undiscovered species. \r\nThe well-preserved reptile was found in a… [+1882 chars]"}, {"source": {"id": null, "name": "Al-Bawaba"}, "author": null, "title": "Among the Stars: Qatar National Library Is Qatar’s Newest Astronomy Research Hub - Al-Bawaba", "description": "Qatar National Library will give Qatar’s astronomers and scientists access to world-leading robotic telescopes from the Las Cumbres Observatory (LCO) in", "url": "https://www.albawaba.com/business/pr/among-stars-qatar-national-library-qatar%E2%80%99s-newest-astronomy-research-hub-1401414", "urlToImage": "https://www.albawaba.com/sites/default/files/styles/default/public/2020-12/Qatar%20National%20Library%201.jpg?itok=cjx-PfxI", "publishedAt": "2020-12-27T10:56:00Z", "content": "Qatar National Library will give Qatars astronomers and scientists access to world-leading robotic telescopes from the Las Cumbres Observatory (LCO) in the US. \r\nThe agreement makes the Library one o… [+4721 chars]"}, {"source": {"id": null, "name": "CTech"}, "author": "Udi Etsion", "title": "Israeli satellite strays from path to prevent collision with NASA's Terra - CTech", "description": "In space’s worst nightmare, IAI received a warning from the ESA that Israel's Venus satellite was about to collide with NASA’s veteran environmental research satellite, averting disaster", "url": "https://www.calcalistech.com/ctech/articles/0,7340,L-3884137,00.html", "urlToImage": "https://images1.calcalist.co.il/PicServer3/2020/12/26/1046818/YE2112205-l.jpg", "publishedAt": "2020-12-27T09:05:36Z", "content": ""}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Watch: Ajmer man gifts plot of land on Moon to wife on wedding anniversary - Hindustan Times", "description": "Ajmer’s Dharmendra Anija gifted his wife, Sapna Anija, three acres of land on moon on their eight wedding anniversary. Dharmendra said that he bought the land on the celestial body as he wanted to do something special for his wife on their wedding anniversary…", "url": "https://www.hindustantimes.com/videos/india-news/ajmer-man-gifts-plot-of-land-on-moon-to-wife-on-wedding-anniversaryvideo/video-sn7TYWHjf52LtMmCz6AyQK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_444x250/HT/p2/2020/12/27/Pictures/_77d21c94-4811-11eb-a3fc-f9413025bbf2.jpg", "publishedAt": "2020-12-27T07:11:25Z", "content": "Updated: Dec 27, 2020 12:35 IST\r\nBy Hindustan Times\r\nAjmer’s Dharmendra Anija gifted his wife, Sapna Anija, three acres of land on moon on their eight wedding anniversary. Dharmendra said that he bou… [+583 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Ciaran McGrath", "title": "Animal intelligence breakthrough: Ravens as smart as great apes in 'surprising' new study - Daily Express", "description": "MANKIND has consistently underestimated the intelligence of ravens and other corvids, a scientist has said, after publishing the results of her startling new study which puts their cognitive ability on a par with great apes.", "url": "https://www.express.co.uk/news/science/1374871/animal-intelligence-ravens-birds-scientific-study-nature-animals", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1374871.jpg", "publishedAt": "2020-12-27T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Researchers identify over 109,000 impact craters on moon - Free Press Journal", "description": "An international team of researchers has identified over 109,000 previously unrecognised impact craters on the moon using machine learning methods.", "url": "https://www.freepressjournal.in/science/researchers-identify-over-109000-impact-craters-on-moon", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2020-12%2F0d880d5c-0d31-41f2-861e-c65939e1f325%2Fetc_2nd_lead_dec_26.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-12-27T05:10:00Z", "content": "Beijing: An international team of researchers has identified over 109,000 previously unrecognised impact craters on the moon using machine learning methods.\r\nThe study, led by researchers from Jilin … [+1326 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "The Extraordinary Robotic Sample-Gathering System of NASA's Perseverance Mars Rover - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMibGh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS90aGUtZXh0cmFvcmRpbmFyeS1yb2JvdGljLXNhbXBsZS1nYXRoZXJpbmctc3lzdGVtLW9mLW5hc2FzLXBlcnNldmVyYW5jZS1tYXJzLXJvdmVyL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-12-27T05:07:12Z", "content": null}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "One of the largest and most complete Einstein rings ever. Astronomers call this the \"molten circle\" - SwordsToday.ie", "description": "Very recently, a very rare astronomical event appeared in the headlines, and for good reason. It will take hundreds of years to see Jupiter and Saturn.", "url": "https://swordstoday.ie/one-of-the-largest-and-most-complete-einstein-rings-ever-astronomers-call-this-the-molten-circle/", "urlToImage": null, "publishedAt": "2020-12-27T04:12:00Z", "content": "Very recently, a very rare astronomical event appeared in the headlines, and for good reason. It will take hundreds of years to see Jupiter and Saturn. It’s close To each other again. However, now we… [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: When ISS astronauts celebrated Christmas in space and Santa paid them a visit - The Indian Express", "description": "Talking how the pandemic changed lives, they saluted human spirits and talked how they are celebrating Christmas, showing gifts they received through special delivery.", "url": "https://indianexpress.com/article/trending/trending-globally/how-iss-astronauts-celebrated-christmas-in-space-including-a-visit-from-santa-7120745/", "urlToImage": "https://images.indianexpress.com/2020/12/iss-christmas.jpg", "publishedAt": "2020-12-26T09:43:00Z", "content": "Though this year’s Christmas celebrations were muted across the globe owing to the pandemic, the festive cheer nonetheless managed to spread to the outer space. The astronauts at International Space … [+4346 chars]"}, {"source": {"id": null, "name": "Boston 25 News"}, "author": "", "title": "Photos: 'Christmas star' appears to shine in night sky as Saturn, Jupiter converge - Boston 25 News", "description": "Jupiter and Saturn merged in the night sky Monday, appearing closer to one another than they have since Galileo’s time in the 17th century.", "url": "https://www.boston25news.com/news/trending/photos-christmas/F6LP3EESRFDCJLFWDEUE5DTIBE/", "urlToImage": "https://www.boston25news.com/resizer/AkbnexTC4VZrFi1qwpcwGk1B6_g=/1200x628/cloudfront-us-east-1.images.arcpublishing.com/cmg/7BUQTDO3IZCE7L3PMMKQAG3PFU.jpg", "publishedAt": "2020-12-22T06:25:18Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Google-owned DeepMind AI solves 50-year-old 'protein folding problem' - ETTelecom.com", "description": "Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes proteins fold into.", "url": "https://telecom.economictimes.indiatimes.com/news/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem/79522062", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79522062,imgsize-10287,width-800,height-434,overlay-ettelecom/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem.jpg", "publishedAt": "2020-12-02T02:47:25Z", "content": "London: Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes protein… [+1880 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Elon Musk's SpaceX to press ahead with Starlink tests, delays commercial service - ETTelecom.com", "description": "SpaceX will continue beta testing its satellite-based broadband service Starlink into next year, the company said late Tuesday, indicating commercial service would not likely be offered in 2020 as previously planned.", "url": "https://telecom.economictimes.indiatimes.com/news/elon-musks-spacex-to-press-ahead-with-starlink-tests-delays-commercial-service/79419973", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79419973,imgsize-544445,width-800,height-434,overlay-ettelecom/elon-musk-s-spacex-to-press-ahead-with-starlink-tests-delays-commercial-service.jpg", "publishedAt": "2020-11-26T02:58:59Z", "content": "SpaceX. (file photo) \r\nBy Joey RouletteWASHINGTON: SpaceX will continue beta testing its satellite-based broadband serviceStarlink into next year, the company said late Tuesday, indicating commercial… [+1494 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "'Waterfall' of microbes in Antarctic sea floor leads to discovery of methane leak - ETEnergyworld.com", "description": "Marine ecologist Andrew Thurber first glimpsed what a colleague described as a \"microbial waterfall\" during a dive in the icy waters of the Ross Sea in 2012", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/waterfall-of-microbes-in-antarctic-sea-floor-leads-to-discovery-of-methane-leak/77118177", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-77118177,imgsize-142479,width-800,height-434,overlay-etenergyworld/waterfall-of-microbes-in-antarctic-sea-floor-leads-to-discovery-of-methane-leak.jpg", "publishedAt": "2020-07-23T01:18:31Z", "content": "BUENOS AIRES: Scientists have discovered an active methane seep from Antarctica's sea bed that could shed light on the potent greenhouse gas trapped beneath frozen continent.Marine ecologist Andrew T… [+3406 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Elon Musk will need more than 10,000 missiles to nuke Mars — Roscosmos - TASS", "description": "Earlier, Musk proposed an ambitious idea to terraform Mars by bombarding the planet’s poles with a large number of nuclear weapons", "url": "https://tass.com/science/1155417", "urlToImage": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20200512/1266233.jpg", "publishedAt": "2020-05-12T13:16:14Z", "content": "MOSCOW, May 12. /TASS/. Billionaire entrepreneur and SpaceX CEO Elon Musk’s plan to bombard the Martian polar caps to terraform the planet through release of carbon dioxide will require launching mor… [+1083 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "5 Fast Facts About the Spring Equinox - Mental Floss", "description": "The spring equinox occurs on March 19, 2020, at 11:49 p.m. Eastern Time—the earliest it has ever arrived in 124 years. Here's what you should know about it, including if you can balance an egg during the event.", "url": "https://www.mentalfloss.com/article/577353/spring-equinox-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2121,x_0,y_220/v1584620220/shape/mentalfloss/577353-gettyimages-624128826.jpg?itok=7IYjR8dN", "publishedAt": "2019-11-03T15:57:56Z", "content": "Spring starts on March 19the earliest it has ever arrived in 124 yearswhich means that warmer weather and longer days are just around the corner. To celebrate the spring equinox, here are some facts … [+2233 chars]"}]}