{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Debdutta Paul", "title": "A new approach to film atoms and molecules vibrating inside solids - Phys.org", "description": "Theoretical and experimental scientists have come together to watch solids vibrate.", "url": "https://phys.org/news/2021-01-approach-atoms-molecules-vibrating-solids.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/1-anewapproach.jpg", "publishedAt": "2021-01-11T18:16:48Z", "content": "Theoretical and experimental scientists have come together to watch solids vibrate.\r\nAtoms or molecules constitute everything around us. In many solids, like common salt or iron, they are neatly arra… [+5846 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "David Mikkelson", "title": "Giant Ancient Sharks Had Enormous Babies That Ate Their Siblings in the Womb - Snopes.com", "description": "Some sharks lay eggs, while others give birth to live young. In most sharks, however, the eggs hatch inside the mother.", "url": "https://www.snopes.com/news/2021/01/11/giant-ancient-sharks-had-enormous-babies-that-ate-their-siblings-in-the-womb/", "urlToImage": "https://www.snopes.com/tachyon/2021/01/ss_shark.jpg", "publishedAt": "2021-01-11T18:14:29Z", "content": "This article about baby sharks is republished here with permission from The Conversation. This content is shared here because the topic may interest Snopes readers; it does not, however, represent th… [+4464 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers acquire 3D images with LED room lighting and a smartphone - EurekAlert", "description": "In The Optical Society (OSA) journal <i>Optics Express</i>, the researchers demonstrate that 3D optical imaging can be performed with a cell phone and LEDs without requiring any complex manual processes to synchronize the camera with the lighting.", "url": "https://www.eurekalert.org/pub_releases/2021-01/tos-ra3011121.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/253173_web.jpg", "publishedAt": "2021-01-11T17:48:44Z", "content": "IMAGE: Researchers developed a way to use overhead LED lighting and a smartphone to create 3D images of a small figurine.\r\n view more \r\nCredit: Emma Le Francois, University of Strathclyde\r\nWASHINGTON… [+5985 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/TechExplorist/", "title": "This typical massive star-forming galaxy is about to die - Tech Explorist", "description": "This is the first time we have observed a typical massive star-forming galaxy in the distant Universe about to ‘die’.", "url": "https://www.techexplorist.com/this-typical-massive-star-forming-galaxy-is-about-to-die/37239/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/ID2299-galaxy.jpg", "publishedAt": "2021-01-11T17:33:00Z", "content": "Galaxies begin to die when they stop forming stars, but until now astronomers had never clearly glimpsed the start of this process in a far-away galaxy. Using the Atacama Large Millimeter/submillimet… [+4206 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "For The First Time, Astronomers May Have Heard The Background 'Hum' of The Universe - ScienceAlert", "description": "Based on what we know about gravitational waves, the Universe should be full of them. Every colliding pair of black holes or neutron stars, every core-collapse supernova - even the Big Bang itself - should have sent ripples ringing across spacetime.", "url": "https://www.sciencealert.com/we-may-have-just-caught-the-first-hint-of-the-background-hum-of-the-universe", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/processed/backgroundhum_1024.png", "publishedAt": "2021-01-11T17:30:56Z", "content": "Based on what we know about gravitational waves, the Universe should be full of them. Every colliding pair of black holes or neutron stars, every core-collapse supernova - even the Big Bang itself - … [+6192 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Computer scientists: We wouldn't be able to control super intelligent machines: New findings from theoretical computer science - Science Daily", "description": "We are fascinated by machines that can control cars, compose symphonies, or defeat people at chess, Go, or Jeopardy! While more progress is being made all the time in Artificial Intelligence (AI), some scientists and philosophers warn of the dangers of an unc…", "url": "https://www.sciencedaily.com/releases/2021/01/210111112218.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-11T17:11:30Z", "content": "We are fascinated by machines that can control cars, compose symphonies, or defeat people at chess, Go, or Jeopardy! While more progress is being made all the time in Artificial Intelligence (AI), so… [+3726 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "Last year is tied for hottest equal in history (and last decade was the hottest ever) - Yahoo Movies UK", "description": null, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_bf67ab3a-46cb-409d-8d88-bfa391f8328e", "urlToImage": null, "publishedAt": "2021-01-11T17:07:00Z", "content": "Yahoo is part of Verizon Media. We and our partners will store and/or access information on your device through the use of cookies and similar technologies, to display personalised ads and content, f… [+646 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Departure of SpaceX Cargo Dragon called off due to bad weather - ANI News", "description": "Washington [US], January 11 (ANI): The departure of the SpaceX Cargo Dragon spacecraft was called off on Monday due to bad weather conditions off the coast of Daytona Beach, Florida, USA.", "url": "https://www.aninews.in/news/world/us/departure-of-spacex-cargo-dragon-called-off-due-to-bad-weather20210111223333", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/nasa_jan_11-thumbnail-154x87-70.jpg", "publishedAt": "2021-01-11T17:03:00Z", "content": "Washington [US], January 11 (ANI): The departure of the SpaceXCargo Dragon spacecraft was called off on Monday due to bad weather conditions off the coast of Daytona Beach, Florida, USA.\"Today's depa… [+971 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "VLT Spots Star-Bursting Nuclear Ring in NGC 1097 | Astronomy - Sci-News.com", "description": "Using the Multi Unit Spectroscopic Explorer (MUSE) instrument on the Very Large Telescope (VLT) at ESO’s Paranal Observatory, astronomers have imaged a 5,000-light-year-wide star-bursting ring in the center of the barred spiral galaxy NGC 1097.", "url": "http://www.sci-news.com/astronomy/vlt-star-bursting-nuclear-ring-ngc-1097-09235.html", "urlToImage": "http://cdn.sci-news.com/images/2021/01/image_9235-NGC-1097.jpg", "publishedAt": "2021-01-11T17:00:40Z", "content": "Using the Multi Unit Spectroscopic Explorer (MUSE) instrument on the Very Large Telescope (VLT) at ESOs Paranal Observatory, astronomers have imaged a 5,000-light-year-wide star-bursting ring in the … [+1994 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New process more efficiently recycles excess CO2 into fuel, study finds - EurekAlert", "description": "For years, researchers have worked to repurpose excess atmospheric carbon dioxide into new chemicals, fuels and other products traditionally made from hydrocarbons harvested from fossil fuels. The recent push to mitigate the climactic effects of greenhouse ga…", "url": "https://www.eurekalert.org/pub_releases/2021-01/uoia-npm011121.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/253153_web.jpg", "publishedAt": "2021-01-11T16:45:27Z", "content": "IMAGE: Illinois researchers Andrew Gewirth, left, and Stephanie Chen designed a new copper-polymer electrode that can help recycle excess CO2 into ethylene, a useful carbon-based chemical that can be… [+3172 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Inspired by kombucha tea, engineers create 'living materials' - Science Daily", "description": "Engineers have developed a new way to generate tough, functional materials using a mix of bacteria and yeast similar to the 'kombucha mother' used to ferment tea. Using this mix, called a Syn-SCOBY (synthetic symbiotic culture of bacteria and yeast), they pro…", "url": "https://www.sciencedaily.com/releases/2021/01/210111112133.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-11T16:42:21Z", "content": "Engineers at MIT and Imperial College London have developed a new way to generate tough, functional materials using a mixture of bacteria and yeast similar to the \"kombucha mother\" used to ferment te… [+4313 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers perform largest-ever supersonic turbulence simulation - Phys.org", "description": "Early astronomers painstakingly studied the subtle movements of stars in the night sky to try and determine how our planet moves in relation to other celestial bodies. As technology has increased, so has the understanding of how the universe works and our rel…", "url": "https://phys.org/news/2021-01-largest-ever-supersonic-turbulence-simulation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/4-researchersu.jpg", "publishedAt": "2021-01-11T16:32:56Z", "content": "Early astronomers painstakingly studied the subtle movements of stars in the night sky to try and determine how our planet moves in relation to other celestial bodies. As technology has increased, so… [+7640 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "NASA extends Juno, turning spacecraft into an Io, Europa, and Ganymede explorer - Ars Technica", "description": "What's up with all those volcanoes on Io, anyway?", "url": "https://arstechnica.com/science/2021/01/nasa-extends-missions-to-jupiter-and-mars-expect-lots-of-jovian-moon-flybys/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/07/pia21382-760x380.png", "publishedAt": "2021-01-11T16:11:00Z", "content": "Enlarge/ NASAs Juno spacecraft soared directly over Jupiters south pole when JunoCam acquired this image on February 2, 2017.\r\n52 with 33 posters participating\r\nNASA has announced that it will extend… [+4547 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "More than just a sun tan: Ultraviolet light helps marine animals to tell the time of year - EurekAlert", "description": "Changes in daylength are a well-established annual timing cue for animal behavior and physiology. An international collaboration of scientists led by Kristin Tessmar-Raible at the Max Perutz Labs, a joint venture of the University of Vienna and the Medical Un…", "url": "https://www.eurekalert.org/pub_releases/2021-01/uov-mtj010821.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/253012_web.jpg", "publishedAt": "2021-01-11T16:06:29Z", "content": "IMAGE: Post-doc and co-author Enrique Arboleda retrieving light measurement data\r\n view more \r\nCredit: © Enrique Arboleda/Markus Hartl)\r\nMost organisms on earth depend on the energy from the sun. Sun… [+3383 chars]"}, {"source": {"id": null, "name": "Best gaming pro"}, "author": "Dinu das", "title": "NASA joins two Japan-led missions to study sun's atmosphere, solar wind and Earth's Aurora- Technology News, Firstpost - Best gaming pro", "description": null, "url": "https://bestgamingpro.com/nasa-joins-two-japan-led-missions-to-study-suns-atmosphere-solar-wind-and-earths-aurora-technology-news-firstpost/", "urlToImage": null, "publishedAt": "2021-01-11T15:51:21Z", "content": "FP TrendingJan 11, 2021 14:30:08 IST\r\nNASA has approved two heliophysics missions to explore the Sun, led by the Japanese space agency. The missions, apart from studying various phenomena related to … [+2158 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "'Super Bowl of Astronomy' kicks off online due to global pandemic - Space.com", "description": "", "url": "https://www.space.com/super-bowl-of-astronomy-aas237-2021", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bjZABXXPyskdwMUJsJwvfV-1200-80.jpg", "publishedAt": "2021-01-11T15:40:00Z", "content": "The American Astronomical Society (AAS) is making the most of online opportunities during its 237th meeting, which will fully take place virtually this week due to the coronavirus pandemic.\r\nThe self… [+5762 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "First human culture lasted 20,000 years longer than thought - Newswise", "description": "Fieldwork led by Dr Eleanor Scerri, head of the Pan-African Evolution Research Group at the Max Planck Institute for the Science of Human History in Germany and", "url": "https://www.newswise.com/articles/first-human-culture-lasted-20-000-years-longer-than-thought", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2021-01-11T15:40:00Z", "content": "Newswise — Fieldwork led by Dr Eleanor Scerri, head of the Pan-African Evolution Research Group at the Max Planck Institute for the Science of Human History in Germany and Dr Khady Niang of the Unive… [+5165 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Jeremy Wilks", "title": "Europe's space leaders seek to boost sector in light of Brexit, COVID and international competition - Euronews", "description": "Jan Wörner, Director-General of the European Space Agency, talks to Euronews about the challenges the space sector faces in 2021.", "url": "https://www.euronews.com/2021/01/11/europe-s-space-leaders-seek-to-boost-sector-in-light-of-brexit-covid-and-international-com", "urlToImage": "https://static.euronews.com/articles/stories/05/27/72/46/1000x563_cmsv2_f2bd509e-fb25-5b0f-a7f6-9bf05c02626a-5277246.jpg", "publishedAt": "2021-01-11T15:11:15Z", "content": "The European Space Conference in Brussels takes place this week, so Euronews spoke to European Space Agency Director General Jan Wörner about the challenges the sector faces in 2021.\r\nBrexit troubles… [+5495 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Towering ice arches in the Arctic are melting, putting 'Last Ice Area' at risk of vanishing - Livescience.com", "description": "The potential implications are alarming.", "url": "https://www.livescience.com/arctic-ice-arches-melting-fast.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ydWj2sFVouR3wDxU5kcPJY-1200-80.jpg", "publishedAt": "2021-01-11T14:35:00Z", "content": "The world's thickest and oldest sea ice is at risk of being lost as the towering ice arches holding it in place experience rapid melting, twice as fast as the rest of the Arctic. \r\nThe stretch of mul… [+3631 chars]"}, {"source": {"id": null, "name": "DIYphotography"}, "author": "https://www.facebook.com/dunjadjudjic/", "title": "NASA shares stunning close-up photo of a huge canyon on Mars - DIYphotography", "description": "The researchers at the University of Arizona captured some stunning photos of the largest canyon in our solar system. It’s the Valles Marineris canyon on Mars, which is around five times longer and four times deeper than the Grand Canyon in Arizona.   Valles …", "url": "https://www.diyphotography.net/nasa-shares-stunning-close-up-photo-of-a-huge-canyon-on-mars/", "urlToImage": "https://s23527.pcdn.co/wp-content/uploads/2021/01/ESP_034132_1750-745x559.jpg.optimal.jpg", "publishedAt": "2021-01-11T14:21:54Z", "content": "The researchers at the University of Arizona captured some stunning photos of the largest canyon in our solar system. Its the Valles Marineris canyon on Mars, which is around five times longer and fo… [+1410 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Eight binary millisecond pulsars examined by researchers - Phys.org", "description": "Using the Arecibo 305-m radio telescope, an international team of astronomers has investigated eight binary millisecond pulsars (MSPs). Results of this study, presented in a paper published December 30 on the arXiv pre-print server, provide important informat…", "url": "https://phys.org/news/2021-01-binary-millisecond-pulsars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/eightbinarym.jpg", "publishedAt": "2021-01-11T13:50:01Z", "content": "Using the Arecibo 305-m radio telescope, an international team of astronomers has investigated eight binary millisecond pulsars (MSPs). Results of this study, presented in a paper published December … [+3255 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Chandra X-ray Observatory gathers data on a magnetar discovered in 2020 - SlashGear", "description": "In 2020, astronomers discovered a new member of an exotic family of objects known as magnetars. More recently, the NASA Chandra X-ray Observatory has made observations that support the idea that th…", "url": "https://www.slashgear.com/chandra-x-ray-observatory-gathers-data-on-a-magnetar-discovered-in-2020-11654397/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/01/magnetar-chandra.jpg", "publishedAt": "2021-01-11T13:23:21Z", "content": "In 2020, astronomers discovered a new member of an exotic family of objects known as magnetars. More recently, the NASA Chandra X-ray Observatory has made observations that support the idea that the … [+2265 chars]"}, {"source": {"id": null, "name": "Somag News"}, "author": null, "title": "Scientists create enzyme that can remove CO2 - Somag News", "description": "Removing massive amounts of carbon dioxide (CO2) from the atmosphere is a challenge that, until the end of the century, must be", "url": "https://www.somagnews.com/scientists-create-enzyme-that-can-remove-co2/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2021/01/08194930268263.jpg", "publishedAt": "2021-01-11T12:59:00Z", "content": "Removing massive amounts of carbon dioxide (CO2) from the atmosphere is a challenge that, until the end of the century, must be overcome by humanity so that climate catastrophes do not make life on E… [+2463 chars]"}, {"source": {"id": null, "name": "Interlochenpublicradio.org"}, "author": "Mary Stewart Adams", "title": "The First New Moon of the New Year: this week on the Storyteller's Night Sky - Interlochen", "description": "The first New Moon of the New Year happens this week, overnight Tuesday to Wednesday, but not before shedding its old light into the lap of love as a way", "url": "https://www.interlochenpublicradio.org/post/first-new-moon-new-year-week-storytellers-night-sky", "urlToImage": "https://www.interlochenpublicradio.org/sites/wiaa/files/styles/medium/public/202101/img_4303_2.jpg", "publishedAt": "2021-01-11T12:39:45Z", "content": "The first New Moon of the New Year happens this week, overnight Tuesday to Wednesday, but not before shedding its old light into the lap of love as a way to make ready for what lies ahead.\r\nEarly Mon… [+1540 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Transition metal 'cocktail' helps make brand new superconductors - Phys.org", "description": "Researchers from Tokyo Metropolitan University mixed and designed a new, high-entropy alloy (HEA) superconductor, using extensive data on simple superconducting substances with a specific crystal structure. HEAs are known to preserve superconducting character…", "url": "https://phys.org/news/2021-01-transition-metal-cocktail-brand-superconductors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/transitionme.jpg", "publishedAt": "2021-01-11T12:28:42Z", "content": "Researchers from Tokyo Metropolitan University mixed and designed a new, high-entropy alloy (HEA) superconductor, using extensive data on simple superconducting substances with a specific crystal str… [+3931 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Study reveals big difference in how coral reef fish larvae are dispersed - Hindustan Times", "description": "How the larvae of colourful clownfish that live among coral reefs in the Philippines are dispersed varies widely, depending on the year and seasons - a Rutgers-led finding that could help scientists improve conservation of species.", "url": "https://www.hindustantimes.com/science/study-reveals-big-difference-in-how-coral-reef-fish-larvae-are-dispersed-101610365174669.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/11/550x309/noaa-5e__2v70LvI-unsplash_1610366212231_1610366217990.jpg", "publishedAt": "2021-01-11T11:58:37Z", "content": "How the larvae of colourful clownfish that live among coral reefs in the Philippines are dispersed varies widely, depending on the year and seasons - a Rutgers-led finding that could help scientists … [+2772 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Adilin Beatrice", "title": "The Future of Space Explorations is in the Hands of AI and Robotics - Analytics Insight", "description": "Artificial intelligence and robotics are influencing space exploration in many ways. Advanced technologies like machine learning and deep learning are also espoused with AI to help space missions.", "url": "https://www.analyticsinsight.net/the-future-of-space-explorations-is-in-the-hands-of-ai-and-robotics/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2021/01/The-Future-of-Space-Explorations-is-in-the-Hands-of-AI-and-Robotics.jpg", "publishedAt": "2021-01-11T10:58:44Z", "content": "Countries across the globe have been running on the race to explore space for a century now. Remarkably, there is no victory to it. As nations send more rockets and satellites to the outer space, the… [+5160 chars]"}, {"source": {"id": null, "name": "Sundayvision.co.ug"}, "author": "Mia Thompson", "title": "Earth's rotation accelerates in 2020, we may need a 'negative leap second' - Sunday Vision", "description": "Another strange thing about 2020: Planet acceleration. The speed of the planet's rotation often drifts slightly, depending on changes in winds, ocean", "url": "https://www.sundayvision.co.ug/earths-rotation-accelerates-in-2020-we-may-need-a-negative-leap-second/", "urlToImage": "https://www.sundayvision.co.ug/wp-content/uploads/2021/01/earths-rotation-accelerates-in-2.jpg", "publishedAt": "2021-01-11T10:52:50Z", "content": "Another strange thing about 2020: Planet acceleration.\r\nThe speed of the planet’s rotation often drifts slightly, depending on changes in winds, ocean currents, or rolls around Earth’s molten core. B… [+1082 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Ancient Armored Skin: Study Shows Why Crocodiles Look Nearly Same Since 200 Million Years Ago | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "As per researchers, the secret behind the crocodile’s persistent body shape for millions of years can be decoded through an evolutionary pattern known as punctuated equilibrium. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2021-01-11-crocodiles-today-look-same-as-millions-years-ago", "urlToImage": "https://s.w-x.co/in-crocodile_1.jpg", "publishedAt": "2021-01-11T10:42:50Z", "content": "If at all time travel was possible and you go back 200 million years, no doubt the Earth would feel like a completely different worldfilled with unfamiliar giants and unusual living creatures. Yet, i… [+4407 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Ameya Paleja", "title": "'Clever Approach': Scientists Create GM-Free Organisms Using Genetic Engineering - The Wire Science", "description": "At the heart of the technique is a genetic pathway called a lethal circuit.", "url": "https://science.thewire.in/the-sciences/gm-mosquitoes-lethal-circuit-genetic-engineering-xy-chromosomes/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/01/11094618/Screenshot-2021-01-11-at-9.45.02-AM.png", "publishedAt": "2021-01-11T10:29:00Z", "content": "An Aedes aegypti mosquito in Tanzania, 2009. Credit: Muhammad Mahdi Karim/Wikimedia Commons, GNU 1.2.\r\nA new year means new beginnings. But for the residents of Florida Keys, a small archipelago off … [+6770 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "NASA shares breathtaking view of ‘Fireworks Galaxy’ located 25.2 million light-years away - Republic World", "description": "Nearly 25.2 million light-years away, the NGC 6946 explodes a mysterious blast of intense X-ray light creating phenomenal fireworks since 1917, NASA explained.", "url": "https://www.republicworld.com/technology-news/science/nasa-shares-breathtaking-view-of-fireworks-galaxy-located-25-dot-2-million-light-years-away.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/yoahpsezl9orad99_1610357750.jpeg?tr=f-jpeg", "publishedAt": "2021-01-11T10:00:00Z", "content": "NASA on January 10 shared the breathtaking view of the spiral galaxy NGC 6946 dubbed as Fireworks Galaxy, situated 25.2 million light-years away from Earth. Taking to its official Twitter handle, the… [+2337 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "SpaceX launch: Starship SN9 looks ready to launch as early as Tuesday - Daily Express", "description": "SPACEX is gearing up for the first high-altitude launch of the Starship SN9 prototype. After a pre-flight static fire test last week, the rocket could be ready to launch as early as Tuesday.", "url": "https://www.express.co.uk/news/science/1382378/spacex-launch-starship-sn9-test-flight-spacex-latest-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1382378.jpg", "publishedAt": "2021-01-11T09:37:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NASA joins two Japan-led missions to study sun's atmosphere, solar wind and Earth’s Aurora - Firstpost", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiiwFodHRwczovL3d3dy5maXJzdHBvc3QuY29tL3RlY2gvc2NpZW5jZS9uYXNhLWpvaW5zLXR3by1qYXBhbi1sZWQtbWlzc2lvbnMtdG8tc3R1ZHktc3Vucy1hdG1vc3BoZXJlLXNvbGFyLXdpbmQtYW5kLWVhcnRocy1hdXJvcmEtOTE5MDk4MS5odG1s0gGPAWh0dHBzOi8vd3d3LmZpcnN0cG9zdC5jb20vdGVjaC9zY2llbmNlL25hc2Etam9pbnMtdHdvLWphcGFuLWxlZC1taXNzaW9ucy10by1zdHVkeS1zdW5zLWF0bW9zcGhlcmUtc29sYXItd2luZC1hbmQtZWFydGhzLWF1cm9yYS05MTkwOTgxLmh0bWwvYW1w?oc=5", "urlToImage": null, "publishedAt": "2021-01-11T09:00:08Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "A multicolor atlas of the brain - Tech Explorist", "description": "Scientists have engineered a coloring technique, known as NeuroPAL (a Neuronal Polychromatic Atlas of Landmarks), which makes it possible to identify every single neuron in the brain of a worm.", "url": "https://www.techexplorist.com/multicolor-atlas-brain/37230/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/NeuroPAL-worm.jpg", "publishedAt": "2021-01-11T08:41:00Z", "content": "Human brain consists of approximately 86 billion neurons or nerve cells. Although, there is still much we don’t know about how neurons work together to give rise to thought or behavior.\r\nComprehensiv… [+2421 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "ESA, Thales Alenia Space sign contract to build European module for upcoming Lunar Gateway - Firstpost", "description": "The module will have a small, pressurised workspace for the crew and large windows offering 360-degree views.", "url": "https://www.firstpost.com/tech/science/esa-thales-alenia-space-sign-contract-to-build-european-module-for-upcoming-lunar-gateway-9190811.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/Lunar-Gateway-Illustration_NASA.jpg", "publishedAt": "2021-01-11T08:18:54Z", "content": "FP TrendingJan 11, 2021 13:48:54 IST\r\nEuropean Space Agency (ESA) signed a contract with Thales Alenia Space to build the European module for the Lunar Gateway that will provide the new human explora… [+1428 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "https://www.facebook.com/malewar.amit", "title": "NASA’s SPHEREx space telescope is one step closer to launch - Inceptive Mind", "description": "NASA's SPHEREx space telescope will map the entire sky to study the rapid expansion of the universe after the big bang, the composition of young planetary systems, and the history of galaxies.", "url": "https://www.inceptivemind.com/nasa-spherex-space-telescope-one-step-closer-launch/17111/", "urlToImage": "https://cdn.inceptivemind.com/wp-content/uploads/2021/01/NASA-SPHEREx-telescope.jpg", "publishedAt": "2021-01-11T07:03:00Z", "content": "NASA has given approval for preliminary designs of the SPHEREx space spectrophotometric observatory project. The observatory will study distant galaxies, test theories of the expansion of the univers… [+2743 chars]"}, {"source": {"id": null, "name": "Allnewsbuzz.com"}, "author": null, "title": "NASA selected four small astrophysics missions for the study - All News Buzz", "description": "NASA has chosen four little astrophysics missions for additional study, in spite of the fact that the office alerts that not all may eventually be flown.\n\n\n\nNASA declared Jan. 7 it chose three smallsat missions and one high-altitude balloon mission as the fir…", "url": "https://www.allnewsbuzz.com/nasa-selected-four-small-astrophysics-missions-for-the-study/", "urlToImage": "https://www.allnewsbuzz.com/wp-content/uploads/2021/01/nasa-874480_960_720.jpg", "publishedAt": "2021-01-11T06:27:08Z", "content": "NASA has chosen four little astrophysics missions for additional study, in spite of the fact that the office alerts that not all may eventually be flown.\r\nNASA declared Jan. 7 it chose three smallsat… [+3091 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Did meteorites bring water to Earth? New evidence suggests so - India Today", "description": "A team of researchers have found evidence of relatively recent water movement in meteorites that collided with the Earth. Researchers studied isotopes in meteorites that landed on Earth over just the past century.", "url": "https://www.indiatoday.in/science/story/did-meteorites-bring-water-earth-new-evidence-suggests-1757853-2021-01-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/meteroite_0-647x363.jpeg?VeBC7fMtT_q.xReJuFi4ZoaaqDVOdtHU", "publishedAt": "2021-01-11T06:19:21Z", "content": "Many scientists believe that the water on Earth came from meteorites. However, this theory has been difficult to prove because the meteorites that reached the blue planet till date didn't contain wat… [+2736 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "“Too much of our technology is building walls instead of bridges… We need to take responsibility for our digital future” - BollyInside", "description": "Ever since Czech playwright Karel Čapek coined the word “robot” 100 years ago, we've come to expect machines to take over our lives. It has now happened.", "url": "https://www.bollyinside.com/news/technology/too-much-of-our-technology-is-building-walls-instead-of-bridges-we-need-to-take-responsibility-for-our-digital-future/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/01/Too-much-of-our-technology-is-building-walls-instead-of.jpg", "publishedAt": "2021-01-11T05:19:24Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+476 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Researchers discover an unexpected ancestor of the extinct Tasmanian tiger | ABC News - ABC News (Australia)", "description": "Researchers at Melbourne University have discovered a new link between Tasmanian tigers and wolves.The extinct animal has been found to be developmentally cl...", "url": "https://www.youtube.com/watch?v=RZUxwyTj0LM", "urlToImage": "https://i.ytimg.com/vi/RZUxwyTj0LM/maxresdefault.jpg", "publishedAt": "2021-01-11T02:30:04Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: A missing supermassive black hole that has left astronomers baffled - The Indian Express", "description": "Scientists have been looking for the black hole using NASA’s Chandra X-ray Observatory and Hubble Space Telescope, and have so far found no evidence that it is anywhere to be found.", "url": "https://indianexpress.com/article/explained/explained-a-missing-supermassive-black-hole-that-has-left-astronomers-baffled-7139778/", "urlToImage": "https://images.indianexpress.com/2021/01/black-hole-pixa-1200.jpg", "publishedAt": "2021-01-11T01:28:41Z", "content": "A supermassive black hole, which is estimated to weigh up to 100 billion times the mass of the Sun, is seemingly missing, leaving astronomers perplexed.\r\nScientists have been looking for the black ho… [+2697 chars]"}, {"source": {"id": null, "name": "Fintechzoom.com"}, "author": null, "title": "Home Depot - SMART looks to ultraviolet light as coronavirus blocker - Fintech Zoom", "description": "Home Depot - SMART looks to ultraviolet light as coronavirus blocker -", "url": "https://fintechzoom.com/fintech_news_home-depot/home-depot-smart-looks-to-ultraviolet-light-as-coronavirus-blocker/", "urlToImage": null, "publishedAt": "2021-01-10T22:34:33Z", "content": "Some Bay Area transit providers are testing a new weapon against the coronavirus: ultraviolet light.\r\nSonoma-Marin Area Rail Transit, or SMART, appears to be the first Bay Area transit provider that … [+3278 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Japan Aims to Launch World’s First Wooden Satellite - VOA Learning English", "description": "Japanese researchers say they are working to build the world’s first satellite made of wood. The goal is to reduce the amount of space junk orbiting the planet.", "url": "https://learningenglish.voanews.com/a/japan-aims-to-launch-world-s-first-wooden-satellite/5729120.html", "urlToImage": "https://gdb.voanews.com/217BB933-8A94-4A93-A27F-59C7D22A0261_w1200_r1.jpg", "publishedAt": "2021-01-10T22:02:00Z", "content": "Japanese researchers say they are working to build the worlds first satellite made of wood.\r\nThe goal is to help fight the problem of space junk. Space junk includes things like dead satellites, lost… [+3759 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "What happened shortly after the Big Bang? We only have theoretical information available - SwordsToday.ie", "description": "For the past century, astronomers and physicists have studied incredible information about our universe. It was formed 13.8 billion years ago At an event", "url": "https://swordstoday.ie/what-happened-shortly-after-the-big-bang-we-only-have-theoretical-information-available/", "urlToImage": null, "publishedAt": "2021-01-10T21:01:00Z", "content": "For the past century, astronomers and physicists have studied incredible information about our universe. It was formed 13.8 billion years ago At an event we call big Bang. Initially, the universe was… [+2186 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Early Solar System meteorites might explain how Earth got water - Engadget", "description": "Scientists have discovered that meteorites from the early Solar System held water until relatively recently, possibly contributing to life on Earth.", "url": "https://www.engadget.com/early-solar-system-meteorites-carried-water-recently-201556213.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2021-01%2F7fe1f650-537b-11eb-96fd-4e38a98a70da&client=amp-blogside-v2&signature=fabf359506c62fdac2fb1b158f23bd2e052cc8be", "publishedAt": "2021-01-10T20:16:35Z", "content": "Some of the oldest known meteorites might just explain how water came to Earth. Gizmodoreports that scientists have discovered evidence carbonaceous chondrites, a group of meteorites from the formati… [+532 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "India's Mars mission: China calls for 'joint efforts' to ensure peace in outer space - Hindustan Times", "description": "Outer space is shared by the entire mankind. Every country has the right to make peaceful exploration and use of outer space, Chinese foreign ministry spokesman Hong Lei told a media briefing when he was asked about India's Mars probe.", "url": "https://www.hindustantimes.com/world/india-s-mars-mission-china-calls-for-joint-efforts-to-ensure-peace-in-outer-space/story-K6QCmDza9H9qqvRUSIJaZI.html", "urlToImage": "https://images.hindustantimes.com/default/550x309.jpg", "publishedAt": "2021-01-10T18:10:00Z", "content": "As India on Tuesday stole the march over China by launching a mission to Mars, Beijing called for \"joint efforts\" to ensure peace in outer space.\r\nA rocket carrying the unmanned Mangalyaan orbiter li… [+2589 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "NASA shows off new images of massive Martian canyon - SlashGear", "description": "Anyone who’s ever visited the Grand Canyon in the United States knows how massive it is. The Grand Canyon certainly lives up to its name, but it’s got nothing on a canyon on the surface…", "url": "https://www.slashgear.com/nasa-shows-off-new-images-of-massive-martian-canyon-10654324/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/01/mars-canyon-1.jpg", "publishedAt": "2021-01-10T16:49:06Z", "content": "Anyone who’s ever visited the Grand Canyon in the United States knows how massive it is. The Grand Canyon certainly lives up to its name, but it’s got nothing on a canyon on the surface of Mars. NASA… [+1613 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Bacteria That Respires Rust Could Help To Protect the Environment From Toxic Metal - Technology Networks", "description": "Researchers show how microbes stand up to a toxic metal, opening the door for applications in recycling and remediation.", "url": "https://www.technologynetworks.com/applied-sciences/news/bacteria-that-respires-rust-could-help-to-protect-the-environment-from-toxic-metal-344433", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/bacteria-that-respires-rust-could-help-to-protect-the-environment-from-toxic-metal-344433.jpg?cb=20210111", "publishedAt": "2021-01-10T16:30:00Z", "content": "When Michigan State Universitys Gemma Reguera first proposed her new research project to the National Science Foundation, one grant reviewer responded that the idea was not environmentally relevant.\r… [+3761 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Bone fracture risk increases when enzymatic process decline - Malaysia Sun", "description": "According to the findings of new research the risk of a person bones getting fractured increases due to loss of enzymatic processes within the body.", "url": "https://www.bignewsnetwork.com/news/267494035/bone-fracture-risk-increases-when-enzymatic-process-decline", "urlToImage": "https://cdn.bignewsnetwork.com/ani1610295655.jpg", "publishedAt": "2021-01-10T16:19:00Z", "content": "Washington [US], January 10 (ANI): According to the findings of new research the risk of a person's bones getting fractured increases due to loss of enzymatic processes within the body.\r\nThis new ins… [+3333 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Delhi student wins laurels at NASA's App Development Challenge - Moneycontrol", "description": "NASA’s Communications and Navigation required participants to develop an app that could aid in mission planning and exploration activities of the Lunar South Pole.", "url": "https://www.moneycontrol.com/news/technology/delhi-student-wins-laurels-at-nasas-app-development-challenge-6327411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/09/nasa-2313267_1280-770x432-770x433.jpg", "publishedAt": "2021-01-10T15:32:00Z", "content": "Indian high school student Aryan Jain, along with six other youngsters from the US, has won the prestigious Artemis Next-Gen STEM Moon to Mars App Development Challenge organised by NASA. Jain is a s… [+970 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Zaynab Khojji", "title": "Nasal spray trialed for COVID-19 resistance - Arab News", "description": "LONDON: A Canadian nasal spray that has been proven to prevent COVID-19 infections is being trialed in Britain. The nitric oxide spray, developed by Vancouver-based SaNOtize, is designed to prevent the spread of the virus from the nose through to the respirat…", "url": "https://www.arabnews.com/node/1790311", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/01/10/2421456-1224586155.jpg", "publishedAt": "2021-01-10T15:09:22Z", "content": "CHICAGO: A man killed three people and wounded four others in a series of shootings over roughly four hours that started on Chicagos South Side and ended with his death in a shootout with police in a… [+2617 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "Mechanophores: Making Polymer Crystallization Processes Crystal Clear - India Education Diary", "description": "Scientists at the Tokyo Institute of Technology (Tokyo Tech) have come up with a new technique to evaluate the mechanical forces generated in polymer crystallization as they cool down from their mo…", "url": "https://indiaeducationdiary.in/mechanophores-making-polymer-crystallization-processes-crystal-clear/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-01-10T14:20:00Z", "content": "Scientists at the Tokyo Institute of Technology (Tokyo Tech) have come up with a new technique to evaluate the mechanical forces generated in polymer crystallization as they cool down from their molt… [+3837 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Miguel F. Morales", "title": "A “no math” (but seven-part) guide to modern quantum mechanics - Ars Technica", "description": "Welcome to \"The curious observer’s guide to quantum mechanics\"–featuring particle/wave duality.", "url": "https://arstechnica.com/science/2021/01/the-curious-observers-guide-to-quantum-mechanics/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/01/quantum-series-1-760x380.jpg", "publishedAt": "2021-01-10T14:00:00Z", "content": "Enlarge/ Quantum mechanics is complex, fold-your-brain stuff. But it can be explained.\r\n10 with 9 posters participating\r\nView more stories\r\nSome technical revolutions enter with drama and a bang, oth… [+7494 chars]"}, {"source": {"id": null, "name": "News Landed"}, "author": "https://www.facebook.com/Krish.bkm", "title": "Bats are preferring some habitats are in great Danger - News Landed", "description": "Further insights on the disease will help us save not only bats but also many other dwindling species from the brink of extinction.", "url": "https://newslanded.com/2021/01/10/bats-are-preferring-some-habitats-are-in-great-danger/", "urlToImage": "https://cdn.newslanded.com/wp-content/uploads/2021/01/bats2_h1.jpg", "publishedAt": "2021-01-10T12:44:00Z", "content": "Bats are become increasingly threatened since 2006 by a deadly disease called white-nose syndrome, a fungal disease that affects only these flying mammals. The disease has already caused a steep redu… [+2911 chars]"}, {"source": {"id": null, "name": "Magazinebuzz.com"}, "author": "Bianca Dennis", "title": "The mystery at the heart of the Milky Way galaxy: Years later astronomers hide above the clouds in the center of the galaxy - Magazine Buzz", "description": "The mystery at the heart of the Milky Way galaxy: Astronomers are still arguing about 70 years of mushroom clouds in the center of the galaxy ... Was it", "url": "https://magazinebuzz.com/the-mystery-at-the-heart-of-the-milky-way-galaxy-years-later-astronomers-hide-above-the-clouds-in-the-center-of-the-galaxy/", "urlToImage": "https://magazinebuzz.com/wp-content/uploads/2021/01/The-mystery-at-the-heart-of-the-Milky-Way-galaxy.jpg", "publishedAt": "2021-01-10T08:19:00Z", "content": "Yellow clouds tens of thousands of light-years up from the center of the Milky Way, and that have puzzled astrophysicists for more than 70 years, may have a final explanation.\r\nSpace experts discover… [+2533 chars]"}, {"source": {"id": null, "name": "Phone Mantra"}, "author": "saideep", "title": "NASA to extend Juno and InSight missions to study Jupiter and Mars - Phone Mantra", "description": "The US National Aeronautics and Space Administration (NASA) announced the expansion of scientific programs on two important missions to study the planets of the solar system.", "url": "https://phonemantra.com/nasa-to-extend-juno-and-insight-missions-to-study-jupiter-and-mars/", "urlToImage": "https://phonemantra.com/wp-content/uploads/2021/01/nasa1.jpg", "publishedAt": "2021-01-10T07:47:00Z", "content": "nasa1\r\nWe are talking about the Juno and InSight projects for the exploration of Jupiter and Mars, respectively. The Juno device was launched back in August 2011, and it reached the gas giant in July… [+1050 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Entangling electrons with heat - Tech Explorist", "description": "Quantum entanglement is key for next-generation computing and communications technology, researchers can now produce it using temperature differences.", "url": "https://www.techexplorist.com/entangling-electrons-heat/37218/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/electron-microscope.jpg", "publishedAt": "2021-01-10T07:42:00Z", "content": "Quantum entanglement is the foundation of the novel quantum advances. However, this concept has baffled numerous physicists throughout the years, including Albert Einstein, who stressed significantly… [+1656 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Mark B.", "title": "Researchers Report Progress on Greener, More Sustainable Hydrogen Extraction from Water - Science Times", "description": "A recent collaboration between Oregon State University's College of Engineering, Cornell University, and the Argonne National Laboratory has made significant progress in hydrogen extraction from water.", "url": "https://www.sciencetimes.com/articles/29019/20210110/researchers-report-progress-greener-more-sustainable-hydrogen-extraction-water.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/31381/new-hybrid-car-models-on-display-in-washington.jpg", "publishedAt": "2021-01-10T05:30:12Z", "content": "A recent collaboration between Oregon State University's College of Engineering, Cornell University, and the Argonne National Laboratory has made significant progress in hydrogen extraction from wate… [+3614 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "Mars orbiter raised further, mission on track - Hindustan Times", "description": "Isro’s Mars spacecraft successfully completed its second ‘orbit-raising maneuver’ today, three days after it successfully lifted clear of the Sriharikota spaceport.", "url": "https://www.hindustantimes.com/india/mars-orbiter-raised-further-mission-on-track/story-QBANUD5kTtVl0pIT1myV9N.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_640x362/HT/p1/2013/11/05/Incoming/Pictures/1147317_Wallpaper2.jpg", "publishedAt": "2021-01-10T03:38:12Z", "content": "Isros Mars spacecraft successfully completed its second orbit-raising maneuver today, three days after it successfully lifted clear of the Sriharikota spaceport.\r\nThe first orbit-raising maneuver, wh… [+900 chars]"}, {"source": {"id": null, "name": "TheNewsTrace"}, "author": null, "title": "NASA calculated that the asteroid that could hit Earth in 2022 has the power of 150 Hiroshima bombs - TheNewsTrace", "description": "An asteroid, classified as dangerous by NASA, could hit Earth in 2022 (Shutterstock) An explosion with the power of 150 Hiroshima bombs could leave an apocalyptic scenario on Earth in 2022. Much was made of the end of the world in 2012, but it seems that acco…", "url": "https://thenewstrace.com/nasa-calculated-that-the-asteroid-that-could-hit-earth-in-2022-has-the-power-of-150-hiroshima-bombs/127318/", "urlToImage": "https://thenewstrace.com/wp-content/uploads/2021/01/KDANOCTQQFFVJIQSYFVXVXTIVI.jpg", "publishedAt": "2021-01-10T00:47:05Z", "content": "An asteroid, classified as dangerous by NASA, could hit Earth in 2022 (Shutterstock)\r\nAn explosion with the power of 150 Hiroshima bombs could leave an apocalyptic scenario on Earth in 2022.\r\n Much w… [+3911 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Jellyfish Create 'Virtual Wall' To Enhance Performance - Eurasia Review", "description": "New research led by the University of South Florida has uncovered one of the reasons jellyfish have come to be known as the \"world's most efficient", "url": "https://www.eurasiareview.com/10012021-jellyfish-create-virtual-wall-to-enhance-performance/", "urlToImage": "https://www.eurasiareview.com/wp-content/uploads/2021/01/c-99.jpg", "publishedAt": "2021-01-10T00:18:00Z", "content": "New research led by the University of South Florida has uncovered one of the reasons jellyfish have come to be known as the “world’s most efficient swimmer.” Brad Gemmell, associate professor of inte… [+2097 chars]"}, {"source": {"id": null, "name": "FREE NEWS"}, "author": "John Kessler", "title": "The Complete Guide to DNA Origami for Beginners Published - FREE NEWS", "description": "Jacob Magikes and Alex Liddle, researchers at the National Institute of Standards and Technology (NIST) who have studied DNA origami for many years, put together the first comprehensive guide to this technique", "url": "https://freenews.live/the-complete-guide-to-dna-origami-for-beginners-published/", "urlToImage": "https://freenews.live/wp-content/uploads/2021/01/dna.jpg", "publishedAt": "2021-01-09T20:57:00Z", "content": "Jacob Magikes and Alex Liddle, researchers at the National Institute of Standards and Technology (NIST) who have studied DNA origami for many years, put together the first comprehensive guide to this… [+3167 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "UF wins contract with NASA to build LISA CMS space exploration technology - BollyInside", "description": "A team of mechanical and aerospace engineering students, professors and researchers at the University of Florida has been awarded a $ 12.5 million", "url": "https://www.bollyinside.com/news/technology/uf-wins-contract-with-nasa-to-build-lisa-cms-space-exploration-technology/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-01-09T19:49:44Z", "content": "A team of mechanical and aerospace engineering students, professors and researchers at the University of Florida has been awarded a $ 12.5 million contract from NASA to test and build a space explora… [+1016 chars]"}, {"source": {"id": null, "name": "Vaughantoday.ca"}, "author": "Maria Gill", "title": "Why was Stonehenge built? | Living Sciences - Vaughan Today", "description": "Stonehenge Perhaps the most famous are the vast circular monuments constructed of wood or stone dotting the British countryside. It is likely that a", "url": "https://www.vaughantoday.ca/why-was-stonehenge-built-living-sciences/", "urlToImage": null, "publishedAt": "2021-01-09T18:46:00Z", "content": "Stonehenge\r\n Perhaps the most famous are the vast circular monuments constructed of wood or stone dotting the British countryside. It is likely that a prehistoric monument was erected in what is now … [+3824 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "China’s Mars probe over 100 million kms away from Earth - Hindustan Times", "description": "As of Monday, the Mars probe had flown in space for 144 days and travelled more than 360 million km.", "url": "https://www.hindustantimes.com/science/china-s-mars-probe-over-100-million-kms-away-from-earth/story-mYeMpyE8KqLYpanHqjT9DI.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/12/15/Pictures/china-space-ambitions_a57a2d44-3eb6-11eb-bd1a-21d65ef31d5e.jpg", "publishedAt": "2020-12-15T09:23:56Z", "content": "Chinas first Mars exploration mission Tianwen-1 is currently more than 100 million km away from Earth and is functioning normally, the countrys space agency said on Tuesday.\r\n As of Monday, the Mars … [+1788 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "Face shields worn alone are not effective against Covid-19: Study - Hindustan Times", "description": "Face shields alone are not highly effective to prevent COVID-19 infection without masks, says a new study which assessed what happens to the airflow around these plastic screens when someone nearby sneezes.", "url": "https://www.hindustantimes.com/more-lifestyle/face-shields-worn-alone-are-not-effective-against-covid-19-study/story-wXX87NO5sgvfpLh3ja3F8M.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/12/09/Pictures/_864be23c-39f2-11eb-9eb7-2ef1b9eb750c.jpg", "publishedAt": "2020-12-09T07:49:53Z", "content": "Face shields alone are not highly effective to prevent COVID-19 infection without masks, says a new study which assessed what happens to the airflow around these plastic screens when someone nearby s… [+2538 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Chandrayaan-2 completes 1 year around moon, instruments performing well - Hindustan Times", "description": "India's second lunar mission Chandrayaan-2 has completed a year around the moon in the lunar orbit. The orbiter has completed 4,400 orbits around the moon and all its instruments are currently performing well. Chandrayaan-2 acquired images during 220 orbits c…", "url": "https://www.hindustantimes.com/videos/india-news/chandrayaan-2-completes-1-year-around-moon-instruments-performing-well/video-K8AI7GJUoXzqbRLLrN9rSL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/08/21/Pictures/_8c9d18a2-e387-11ea-a73d-37b3f13c5782.jpg", "publishedAt": "2020-08-21T08:28:37Z", "content": "India's second lunar mission Chandrayaan-2 has completed a year around the moon in the lunar orbit. The orbiter has completed 4,400 orbits around the moon and all its instruments are currently perfor… [+748 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "Here’s how smartphone use affects your parenting skills - Hindustan Times", "description": "While parents may worry that all the time they are spending on their phones may negatively affect their relationship with their children, a new study has found that to be unlikely.", "url": "https://www.hindustantimes.com/sex-and-relationships/here-s-how-smartphone-use-affects-your-parenting-skills/story-UijKKE2PDJqVUS09ta3jfP.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/07/08/Pictures/_e72264d2-c0fd-11ea-8992-80e4e5da9aac.jpg", "publishedAt": "2020-07-08T09:40:27Z", "content": "Parents may worry that spending time on their smartphones has a negative impact on their relationships with their children. However, a new comprehensive analysis, published in the Journal of Child Ps… [+1822 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Watch Earth from SpaceX capsule as NASA astronauts dock with Space Station - Hindustan Times", "description": "NASA astronauts treated everyone to a view of Earth from space. NASA's Bob Behnken and Doug Hurley took the video from a SpaceX Dragon capsule. The duo created history by going to space on a private craft for the first time. The SpaceX capsule successfully do…", "url": "https://www.hindustantimes.com/videos/world-news/watch-earth-from-spacex-capsule-as-nasa-astronauts-dock-with-space-station/video-U6YTytLfcZX3K0zRK5twGI.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2020/06/01/Pictures/_e708c6ea-a3c9-11ea-8a8f-b205fc4c21a8.jpg", "publishedAt": "2020-06-01T04:08:46Z", "content": "NASA astronauts treated everyone to a view of Earth from space. NASA's Bob Behnken and Doug Hurley took the video from a SpaceX Dragon capsule. The duo created history by going to space on a private … [+268 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "5 Fast Facts About the Spring Equinox - Mental Floss", "description": "The spring equinox occurs on March 19, 2020, at 11:49 p.m. Eastern Time—the earliest it has ever arrived in 124 years. Here's what you should know about it, including if you can balance an egg during the event.", "url": "https://www.mentalfloss.com/article/577353/spring-equinox-facts", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1194,w_2121,x_0,y_220/v1584620220/shape/mentalfloss/577353-gettyimages-624128826.jpg?itok=7IYjR8dN", "publishedAt": "2019-11-03T15:57:56Z", "content": "Spring starts on March 19the earliest it has ever arrived in 124 yearswhich means that warmer weather and longer days are just around the corner. To celebrate the spring equinox, here are some facts … [+2233 chars]"}]}