{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "India Today"}, "author": null, "title": "Meet the Usain Bolt of asteroids: This object takes just 113 Earth days to move around Sun - India Today", "description": "The asteroid is so close to the Sun’s massive gravitational field, it experiences the largest general relativity effects of any known Solar System object.", "url": "https://www.indiatoday.in/science/story/-meet-the-usain-bolt-of-asteroids-this-object-takes-just-113-earth-days-to-move-around-sun-1844717-2021-08-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202108/Asteroid_4-647x363.jpeg?Tz0wsUDy47TUKaCBmHIKq0HD2QtI8vh2", "publishedAt": "2021-08-24T10:33:18Z", "content": null}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "New way to predict astronauts' risk of radiation in space - Ahmedabad Mirror", "description": "#WASHINGTON\nScientists at NASA have developed a technique that can help predict astronauts&#39; risk of space radiation exposure during future exploration missions.\nThe researchers studied blood samples from 43 space station crew members to measure their leve…", "url": "https://ahmedabadmirror.com/new-way-to-predict-astronauts-risk-of-radiation-in-space/81805579.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1629745750405.jpg-org", "publishedAt": "2021-08-24T08:59:27Z", "content": "<ul><li>Agencies</li><li> 24-08-2021 02:15 PM</li></ul>\r\nOlder crew more exposed to chromosomal irregularities than the younger members\r\n#WASHINGTONScientists at NASA have developed a technique that … [+1846 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes Act as a Safety Valve for Earth’s Long-Term Climate – Stabilizing Surface Temperatures - SciTechDaily", "description": "Scientists at the University of Southampton have discovered that extensive chains of volcanoes have been responsible for both emitting and then removing atmospheric carbon dioxide (CO2) over geological time. This stabilized temperatures at Earth’s surface. Th…", "url": "https://scitechdaily.com/volcanoes-act-as-a-safety-valve-for-earths-long-term-climate-stabilizing-surface-temperatures/", "urlToImage": "https://scitechdaily.com/images/Kamchatka-Erosion.jpg", "publishedAt": "2021-08-24T08:26:56Z", "content": "Continental volcanic arcs such as this one in Kamchatka, Russia, are rapidly weathered, driving CO2 removal from the atmosphere over geological time. Credit: Tom Gernon, University of Southampton\r\nSc… [+5132 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "China`s Zhurong rover travels 1,000 metres on Mars surface, completes planned exploration - WION", "description": "According to Chinas Aerospace Science and Technology Corporation (CASC), the Zhurong rover travelled over 1,000 metres on the surface of Mars creating a new record.", "url": "https://www.wionews.com/science/chinas-zhurong-rover-travels-1000-metres-on-mars-surface-completes-planned-exploration-407968", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/08/24/208093-c11.jpg", "publishedAt": "2021-08-24T08:16:23Z", "content": "According to China's Aerospace Science and Technology Corporation (CASC), the Zhurong rover travelled over 1,000 metres on the surface of Mars creating a new record.\r\nThe rover marked the hundredth d… [+1523 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Human Kidneys Form Their Filtering Units - Technology Networks", "description": "Only nature possesses the complete set of blueprints for building a kidney. But scientists have conducted a comprehensive analysis of how kidneys form their filtering units, known as nephrons.", "url": "https://www.technologynetworks.com/cell-science/news/how-human-kidneys-form-their-filtering-units-352959", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/how-human-kidneys-form-their-filtering-units-352959.jpg?cb=20210824", "publishedAt": "2021-08-24T07:57:05Z", "content": "When it comes to building a kidney, only nature possesses the complete set of blueprints. But a USC-led team of scientists has managed to borrow some of natures pages through a comprehensive analysis… [+3634 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "Japan plans to bring back soil samples from Martian moon by 2029 - Jagran Josh", "description": "The Japan Aerospace Exploration Agency plans to launch an explorer in the year 2024 to land on the Martian Moon Phobos in order to collect 10 grams of", "url": "https://www.jagranjosh.com/current-affairs/japan-plans-to-bring-back-soil-samples-from-martian-moon-by-2029-1629786414-1", "urlToImage": "https://img.jagranjosh.com/images/2021/August/2482021/Mars_soil.jpg", "publishedAt": "2021-08-24T06:30:00Z", "content": "Japans space agency has been planning on bringing soil samples back from the Mars region ahead of the Chinese and the US missions now operating on Mars, in hopes of finding clues to the origin of Mar… [+3017 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "Fossil leaves may reveal climate in last era of dinosaurs - Republic World", "description": "Richard Barclay opens a metal drawer in archives of the Smithsonian Natural History Museum containing fossils that are nearly 100 million years old. Despite their age, these rocks aren’t fragile", "url": "https://www.republicworld.com/technology-news/science/fossil-leaves-may-reveal-climate-in-last-era-of-dinosaurs.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/hxzpmzbylp47ipxe_1629785686.jpeg", "publishedAt": "2021-08-24T06:15:00Z", "content": "Richard Barclay opens a metal drawer in archives of the Smithsonian Natural History Museum containing fossils that are nearly 100 million years old. Despite their age, these rocks aren’t fragile. The… [+5418 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Aubrey Clarke", "title": "Over 100 Trillion Objects at the Oort Cloud Icy Edge of the Solar System Are From Interstellar Space Like Comet 2I/Borisov - Science Times", "description": "Majority of comets and asteroids in our Solar System may have come from another star, implying that we live in a cosmic melting pot, experts say.", "url": "https://www.sciencetimes.com/articles/33020/20210824/oort-cloud-solar-system-interstellar-space-comet-2i-borisov.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/35390/oort-cloud.jpg", "publishedAt": "2021-08-24T05:30:07Z", "content": "Astronomers say the Oort Cloud at the fringe of our solar system might be packed with interstellar debris.\r\nThe latest study follows the arrival of Borisov. This snowball approached Earth in 2019 and… [+3214 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Brendan Zietsch", "title": "Why has same-sex sexual behaviour persisted during evolution? - The Conversation AU", "description": "Same-sex sexual behaviour presents a paradox: it’s influenced by genes, but how and why do these genes continue to be passed down the generations? One theory is they have reproductive benefits too.", "url": "https://theconversation.com/why-has-same-sex-sexual-behaviour-persisted-during-evolution-166571", "urlToImage": "https://images.theconversation.com/files/417530/original/file-20210824-15-5t2dsr.jpg?ixlib=rb-1.1.0&rect=0%2C618%2C4249%2C2121&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-08-24T04:37:57Z", "content": "Same-sex sexual behaviour may seem to present a Darwinian paradox. It provides no obvious reproductive or survival benefit, and yet same-sex sexual behaviour is fairly common around 2-10% of individu… [+4978 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Terminator ribbon lures satellites back to Earth faster towards their fiery doom - BollyInside", "description": "It has been theorized that if the risk of colliding with an object grows too high, Earth orbit may actually become inaccessible. Millennium Space Systems", "url": "https://www.bollyinside.com/news/the-terminator-ribbon-lures-satellites-back-to-earth-faster-towards-their-fiery-doom", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-08-24T03:14:18Z", "content": "It has been theorized that if the risk of colliding with an object grows too high, Earth orbit may actually become inaccessible. Millennium Space Systems has come up with a solution for the inactive … [+1530 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study discovers lagging chromosomes as one of the major causes of infertility - News-Medical.Net", "description": "Why do women over 35 have more difficulty getting pregnant? After discovering one of the causes of age-related female infertility, researchers at the University of Montreal Hospital Research Centre suggest that it will be possible in the future to improve the…", "url": "https://www.news-medical.net/news/20210823/Study-discovers-lagging-chromosomes-as-one-of-the-major-causes-of-infertility.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Infertility-620x480.jpg", "publishedAt": "2021-08-24T02:57:00Z", "content": "Why do women over 35 have more difficulty getting pregnant? After discovering one of the causes of age-related female infertility, researchers at the University of Montreal Hospital Research Centre (… [+1701 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Verona Public Library Event: Learn about the Mars Perseverance rover August 31 | Community - Space Bollyinside - BollyInside", "description": "If You Go What: Mars 2020: The Perseverance Rover When: 6:30-7:30 p.m. Tuesday, Aug. 31 During the program, Jentges will also talk about Ingenuity, a", "url": "https://www.bollyinside.com/news/verona-public-library-event-learn-about-the-mars-perseverance-rover-august-31-community", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-08-24T02:46:24Z", "content": "If You Go What: Mars 2020: The Perseverance Rover\r\nWhen: 6:30-7:30 p.m. Tuesday, Aug. 31 During the program, Jentges will also talk about Ingenuity, a helicopter that has successfully flown on Mars.\r… [+1053 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Rutgers professors talk about recent space launches and the commercialization of space exploration - BollyInside", "description": "Haym Benaroya, a professor in the Department of Mechanical and Aerospace Engineering, said the commercialization of space exploration has allowed for", "url": "https://www.bollyinside.com/news/rutgers-professors-talk-about-recent-space-launches-and-the-commercialization-of-space-exploration", "urlToImage": null, "publishedAt": "2021-08-24T01:53:00Z", "content": "Haym Benaroya, a professor in the Department of Mechanical and Aerospace Engineering, said the commercialization of space exploration has allowed for technological advancements to develop more effici… [+3238 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Urian B.", "title": "Radio Telescope Detects Thousands of New Unknown Radio Sources in Direction of Large Magellanic Cloud! - Tech Times", "description": "Radio telescopes have finally been able to detect thousands of unknown radio sources in direction of the Large Magellanic Cloud! Learn more!", "url": "https://www.techtimes.com/articles/264476/20210823/radio-telescope-detects-thousands-of-new-unknown-radio-sources-in-direction-of-large-magellanic-cloud.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/391209/radio-telescope-detects-thousands-of-new-unknown-radio-sources-in-direction-of-large-magellanic-cloud.jpg", "publishedAt": "2021-08-24T01:50:00Z", "content": "(Photo : Image from Unsplash Website) Radio Telescope Detects Thousands of New Unknown Radio Sources in Direction of Large Magellanic Cloud!\r\nA recent powerful radio telescope that was staring at a s… [+3333 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "T. Rex’s Huge Jaw Had Nerve Sensors To Make It an Even More Fearsome Predator - SciTechDaily", "description": "Tyrannosaurus rex’s ‘bite detectors’ better than any other dinosaur studied yet. Tyrannosaurus rex was not just a huge beast with a big bite, it had nerve sensors in the very tips of its jaw enabling it to better detect – and eat – its prey, a new study publi…", "url": "https://scitechdaily.com/t-rexs-huge-jaw-had-nerve-sensors-to-make-it-an-even-more-fearsome-predator/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-Mandible-Nerves.jpg", "publishedAt": "2021-08-24T01:00:03Z", "content": "Hypothesized distribution of nerves in the mandible of Tyrannosaurus (orange). Credit: Historical Biology – Complex neurovascular system in the dentary of Tyrannosaurus\r\nTyrannosaurus rex’s ‘bite det… [+3843 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "To understand future habitat needs for chimpanzees, look to the past: New study examines where chimpanzees found refuge from climate instability during the past 120000 years - Science Daily", "description": "A new study provides insight into where chimpanzees (Pan troglodytes) avoided climate instability during glacial and interglacial periods in Africa over the past 120,000 years.", "url": "https://www.sciencedaily.com/releases/2021/08/210823143623.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-24T00:54:41Z", "content": "A new study provides insight into where chimpanzees (Pan troglodytes) avoided climate instability during glacial and interglacial periods in Africa over the past 120,000 years. Using bioclimatic vari… [+3840 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Sustained fast rates of evolution explain how tetrapods evolved from fish - Science Daily", "description": "Biologists establish the origin date of the earliest tetrapods and discover they acquired several of the major new adaptive traits that enabled vertebrate life on land at accelerated evolutionary rates.", "url": "https://www.sciencedaily.com/releases/2021/08/210823125839.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-24T00:36:18Z", "content": "One of the biggest questions in evolution is when and how major groups of animals first evolved. The rise of tetrapods (all limbed vertebrates) from their fish relatives marks one of the most importa… [+5333 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Mars snow is dusty, and might even melt into liquid water - CNET", "description": "Dusty, dark Mars ice could suck up solar energy and maybe even get a little melty.", "url": "https://www.cnet.com/news/mars-snow-is-dusty-and-might-even-melt-into-liquid-water/", "urlToImage": "https://www.cnet.com/a/img/G3Puhg6KWo-M4IXmTdZWeZhvJAg=/1200x630/2021/08/23/eec8ed42-2cd7-4ccb-b035-d4e02f6e9118/253234main-sol-020-024-change-dodo-v3.jpg", "publishedAt": "2021-08-23T22:54:00Z", "content": "NASA's Phoenix lander snapped this view of frozen water in a scuffed surface of Mars in 2008.\r\nNASA/JPL-Caltech/University of Arizona/Texas A&amp;M University\r\nThis story is part of Welcome to Mars, … [+2637 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The doomed comet ATLAS had a long history with Earth - BollyInside", "description": "Quanzhi Ye, an astronomer at the University of Maryland, observed the comet using the Hubble Space Telescope. Ye and his colleagues used their", "url": "https://www.bollyinside.com/news/the-doomed-comet-atlas-had-a-long-history-with-earth", "urlToImage": null, "publishedAt": "2021-08-23T22:42:31Z", "content": "Quanzhi Ye, an astronomer at the University of Maryland, observed the comet using the Hubble Space Telescope. Ye and his colleagues used their observations to determine that comet ATLAS was actually … [+2890 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Rocket Lab’s Mars mission gets green light from NASA - TechCrunch", "description": "Rocket Lab is one step closer to going to Mars with NASA’s approval of the company’s Photon spacecraft for an upcoming science mission. If all continues according to plan the two craft will launch in 2024 and arrive on the red planet 11 months later to study …", "url": "http://techcrunch.com/2021/08/23/rocket-labs-mars-mission-gets-green-light-from-nasa/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/Rocket-Lab-Photon-Blue-Gold-ESCAPADE-Mission.jpg?w=624", "publishedAt": "2021-08-23T21:05:01Z", "content": "Rocket Lab is one step closer to going to Mars with NASA’s approval of the company’s Photon spacecraft for an upcoming science mission. If all continues according to plan the two craft will launch in… [+2155 chars]"}, {"source": {"id": null, "name": "Calgarynewsroom.com"}, "author": "Calgary News Reporter", "title": "Rapid global warming 55 million years ago shows us what the future might bring - Philippine Canadian Inquirer - CALGARY NEWS ROOM - CALGARY NEWS ROOM", "description": "Milo Barham, author providedThe frozen northeast of Greenland seems an unlikely place to glimpse our ever-warming world.  However, 50 million to 60 million years ago the region was a different place.Greenland then had a subtropical climate that lives", "url": "https://www.calgarynewsroom.com/rapid-global-warming-55-million-years-ago-shows-us-what-the-future-might-bring-philippine-canadian-inquirer/", "urlToImage": "https://images.theconversation.com/files/417021/original/file-20210819-17-1gtzwca.JPG?ixlib=rb-1.1.0&q=45&auto=format&w=754&fit=clip", "publishedAt": "2021-08-23T20:43:43Z", "content": "Milo Barham, author provided\r\nThe frozen northeast of Greenland seems an unlikely place to glimpse our ever-warming world. However, 50 million to 60 million years ago the region was a different place… [+6805 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Study: Ants create stable tunnels in nests, much like humans play Jenga - Ars Technica", "description": "Caltech scientists used X-ray imaging to capture physics of underground anthills.", "url": "https://arstechnica.com/science/2021/08/tiny-jenga-ants-can-sense-which-soil-grains-to-remove-when-digging-tunnels/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/08/anttunnelTOP-ROTATED-760x380.jpg", "publishedAt": "2021-08-23T20:29:43Z", "content": "Enlarge/ Two ants tunneling in green gel. A new Caltech study found that ants search for and remove loose grains of soil when digging their tunnels, much like humans remove loose blocks while playing… [+8735 chars]"}, {"source": {"id": null, "name": "Californianewstimes.com"}, "author": "julesmenten", "title": "What is multiverse theory? | Live Science - Californianewstimes.com", "description": "The Multiverse suggests that our universe may not be the only one with hundreds of billions of galaxies and nearly countless stars spanning tens of billions of light-years. Instead, there may be a com", "url": "https://californianewstimes.com/what-is-multiverse-theory-live-science/495712/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9JXpWhDRvxjBzEfzXjoHCX-1200-80.jpg", "publishedAt": "2021-08-23T20:10:43Z", "content": "The Multiverse suggests that our universe may not be the only one with hundreds of billions of galaxies and nearly countless stars spanning tens of billions of light-years. Instead, there may be a co… [+5617 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mathematicians build an algorithm to 'do the twist' - Phys.org", "description": "Mathematicians at the Center for Advanced Mathematics for Energy Research Applications (CAMERA) at Lawrence Berkeley National Laboratory (Berkeley Lab) have developed a mathematical algorithm to decipher the rotational dynamics of twisting particles in large …", "url": "https://phys.org/news/2021-08-mathematicians-algorithm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/berkeley-lab-mathemati.jpg", "publishedAt": "2021-08-23T19:58:03Z", "content": "Mathematicians at the Center for Advanced Mathematics for Energy Research Applications (CAMERA) at Lawrence Berkeley National Laboratory (Berkeley Lab) have developed a mathematical algorithm to deci… [+8258 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "Martian snow is dusty, could potentially melt, new study shows - Phys.org", "description": "Over the last two decades, scientists have found ice in many locations on Mars. Most Martian ice has been observed from orbital satellites like NASA's Mars Reconnaissance Orbiter. But determining the grain size and dust content of the ice from that far above …", "url": "https://phys.org/news/2021-08-martian-dusty-potentially.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/martian-snow-is-dusty.jpg", "publishedAt": "2021-08-23T19:18:47Z", "content": "Over the last two decades, scientists have found ice in many locations on Mars. Most Martian ice has been observed from orbital satellites like NASA's Mars Reconnaissance Orbiter. But determining the… [+2900 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Would we still have severe thunderstorms over North America if the Gulf of Mexico were filled in with land? - Phys.org", "description": "The eastern half of the U.S is one of the principal hot spots for severe thunderstorm activity, especially tornadoes, globally. The standard explanation for this outcome is the combination high terrain to the west and the Gulf of Mexico to the south.", "url": "https://phys.org/news/2021-08-severe-thunderstorms-north-america-gulf.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/would-we-still-have-se.jpg", "publishedAt": "2021-08-23T19:03:41Z", "content": "The eastern half of the U.S is one of the principal hot spots for severe thunderstorm activity, especially tornadoes, globally. The standard explanation for this outcome is the combination high terra… [+1925 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Bringing order to chaotic bubbles can make mining more sustainable - Phys.org", "description": "A new way to control the motion of bubbles from researchers at Columbia Engineering might one day help separate useful metals from useless dirt using much less energy and water than is currently needed.", "url": "https://phys.org/news/2021-08-chaotic-sustainable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/mine.jpg", "publishedAt": "2021-08-23T19:00:04Z", "content": "A new way to control the motion of bubbles from researchers at Columbia Engineering might one day help separate useful metals from useless dirt using much less energy and water than is currently need… [+2247 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Cambrian Comb Jellies Had More Complex Neuroanatomy than Living Species | Paleontology - Sci-News.com", "description": "Paleontologists have described two new species from the Cambrian period of Utah, which illuminate the early evolution of nervous and sensory features in ctenophores (comb jellies).", "url": "http://www.sci-news.com/paleontology/ctenorhabdotus-thalassostaphylos-09988.html", "urlToImage": "http://cdn.sci-news.com/images/2021/08/image_9988f-Ctenorhabdotus-Thalassostaphylos.jpg", "publishedAt": "2021-08-23T18:17:24Z", "content": "Paleontologists have described two new species from the Cambrian period of Utah, which illuminate the early evolution of nervous and sensory features in ctenophores (comb jellies).\r\nAn artists recons… [+3624 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Université de Genève (University of Geneva)", "title": "Understanding how elephants use their trunk - Newswise", "description": "The elephant proboscis (trunk) exhibits an extraordinary kinematic versatility as it can manipulate a single blade of grass but also carry loads up to 270 kilog", "url": "https://www.newswise.com/articles/understanding-how-elephants-use-their-trunk", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/08/23/6123e4ce8bd5e_ele.JPG&width=100&height=100", "publishedAt": "2021-08-23T18:15:00Z", "content": "Newswise — The elephant proboscis (trunk) exhibits an extraordinary kinematic versatility as it can manipulate a single blade of grass but also carry loads up to 270 kilograms. Using motion-capture t… [+4569 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Thousands of New Radio Signals Have Been Detected From Nearby Cosmic Sources - ScienceAlert", "description": "A powerful radio telescope staring at a satellite galaxy of the Milky Way has detected thousands of hitherto unknown radio sources.", "url": "https://www.sciencealert.com/thousands-of-never-seen-before-radio-signals-detected-in-the-large-magellanic-cloud", "urlToImage": "https://www.sciencealert.com/images/2021-08/processed/tarantula-nebula_1024.jpg", "publishedAt": "2021-08-23T18:03:14Z", "content": "A powerful radio telescope staring at a satellite galaxy of the Milky Way has detected thousands of hitherto unknown radio sources.\r\nIn the direction of the Large Magellanic Cloud, thousands of nearb… [+3800 chars]"}, {"source": {"id": null, "name": "News-Daily.com"}, "author": "Ashley Strickland, CNN", "title": "Doomed comet ATLAS had a long history with Earth - News-Daily.com", "description": "A Comet that intrigued astronomers with its first appearance in our sky at the very end of 2019, but it disintegrated into 30 tiny ice shards months later.", "url": "https://www.news-daily.com/news/doomed-comet-atlas-had-a-long-history-with-earth/article_652f51ae-3d4f-5081-9f04-866e9eb219d4.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/assets/v3/editorial/d/ce/dce96b8a-0ab6-5507-9175-5459d5178aad/6123df85a9663.image.jpg?resize=1120%2C630", "publishedAt": "2021-08-23T17:35:32Z", "content": "A Comet that intrigued astronomers with its first appearance in our sky at the very end of 2019, but it disintegrated into 30 tiny ice shards months later.\r\nNow, observations made while the comet, na… [+3490 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Grand Canyon's Gap In Time Closer To Being Explained - IFLScience", "description": "More than a billion years of geological history is missing from parts of the Grand Canyon and, some geologists believe, much of the rest of the world. A ne", "url": "https://www.iflscience.com/environment/grand-canyons-gap-in-time-a-legacy-of-continental-breakup/", "urlToImage": "https://cdn.iflscience.com/images/0737f3cc-02e3-5d5c-975b-5fd245ba243a/default-1629726914-great-unconformity.jpg", "publishedAt": "2021-08-23T16:10:00Z", "content": "More than a billion years of geological history is missing from parts of the Grand Canyon and, some geologists believe, much of the rest of the world. A new investigation of this mysterious gap in ti… [+3137 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Wandering Supermassive Black Holes May Be More Abundant than Previously Thought | Astronomy - Sci-News.com", "description": "New research led by astronomers from the Harvard & Smithsonian’s Center for Astrophysics shows that the current census of supermassive black holes is incomplete and that a substantial population of off-center wanderers likely exists.", "url": "http://www.sci-news.com/astronomy/wandering-supermassive-black-holes-09987.html", "urlToImage": "http://cdn.sci-news.com/images/2016/10/image_4257_2-Wandering-Black-Hole.jpg", "publishedAt": "2021-08-23T16:08:56Z", "content": "New research led by astronomers from the Harvard &amp; Smithsonians Center for Astrophysics shows that the current census of supermassive black holes is incomplete and that a substantial population o… [+4110 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The Hobbit's bite gets a stress test: Stone tools may have allowed Homo floresiensis to eat their meals with less chewing effort than earlier hominins. - Science Daily", "description": "If you've ever suffered from a sore jaw that popped or clicked when you chewed gum or crunched hard foods, you may be able to blame it on your extinct ancestors. That's according to a recent study of the chewing mechanics of an ancient human relative called H…", "url": "https://www.sciencedaily.com/releases/2021/08/210823110323.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-23T15:36:17Z", "content": "If you've ever suffered from a sore jaw that popped or clicked when you chewed gum or crunched hard foods, you may be able to blame it on your extinct ancestors.That's according to a Duke University-… [+4518 chars]"}, {"source": {"id": null, "name": "Eu.com"}, "author": null, "title": "Earth's magnetic field weakens every 200 million years, new study says - ROOM Space Journal", "description": "A new study using a special paleomagnetic analysis of ancient lava rocks from Scotland, adds further evidence to the idea that Earth's magnetic field weakens every 200 million years – a finding which could be connected to increased levels of uv radiation", "url": "https://room.eu.com/news/earths-magnetic-field-weakens-every-200-million-years-new-study-says", "urlToImage": "https://room.eu.com/images/contents/ESAEarthMagField.jpg", "publishedAt": "2021-08-23T15:15:16Z", "content": "An analysis of rock samples from ancient lava flows in Eastern Scotland has provided further evidence that Earths magnetic field weakens in strength approximately every 200 million years; a finding w… [+4200 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Maurits Kuypers", "title": "Imperial College develops living building blocks that can repair themselves - Innovation Origins", "description": "British researchers have genetically modified the Komagataeibacter rhaeticus bacterium to repair damage to certain types of materials.", "url": "https://innovationorigins.com/en/imperial-college-develops-living-building-blocks-that-can-repair-themselves/", "urlToImage": "https://innovationorigins.com/app/uploads/2021/08/newseventsimage_1629455848547_mainnews2012_x4-scaled.jpg", "publishedAt": "2021-08-23T15:00:00Z", "content": "Researchers at Imperial College London have developed living 3D building elements that are capable of repairing themselves if they are damaged. Imperial announced this in a press release and in a stu… [+1464 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Russian Cosmonaut Shares Incredible View From New ISS Module - Futurism", "description": "That's one breathtaking view.", "url": "https://futurism.com/the-byte/russian-cosmonaut-incredible-view", "urlToImage": "https://wp-assets.futurism.com/2021/08/russian-cosmonaut-incredible-view.jpg", "publishedAt": "2021-08-23T15:00:00Z", "content": "The docking may have been a disaster but the views are incredible.\r\nAmazing View\r\nRussian cosmonaut Oleg Novitskiy has shared an amazing video taken on board the International Space Stations latest a… [+1538 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Study explores short-term X-ray variability of the tidal disruption event Swift J1644+57 - Phys.org", "description": "Using XMM-Newton and Swift space telescopes, Chinese astronomers have inspected short-term X-ray variability of a tidal disruption event known as Swift J1644+57. Results of the study, published August 12 on the arXiv pre-print server, yield important informat…", "url": "https://phys.org/news/2021-08-explores-short-term-x-ray-variability-tidal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/study-explores-short-t.jpg", "publishedAt": "2021-08-23T14:20:01Z", "content": "Using XMM-Newton and Swift space telescopes, Chinese astronomers have inspected short-term X-ray variability of a tidal disruption event known as Swift J1644+57. Results of the study, published Augus… [+3761 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Whitney Slightham", "title": "Scientists distill cow's milk into nano-capsules for drug delivery - Phys.org", "description": "Exosomes are nano-sized biological capsules that cells produce to protect and courier delicate molecules throughout the body. The capsules are hardy enough to withstand enzymatic breakdown, as well as acidic and temperature fluctuations in the gut and bloodst…", "url": "https://phys.org/news/2021-08-scientists-distill-cow-nano-capsules-drug.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/distilling-cows-milk-i.jpg", "publishedAt": "2021-08-23T14:16:20Z", "content": "Exosomes are nano-sized biological capsules that cells produce to protect and courier delicate molecules throughout the body. The capsules are hardy enough to withstand enzymatic breakdown, as well a… [+4742 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance rover snaps Mars' dainty moon Deimos - CNET", "description": "That's no moon. Oh wait, it is a moon.", "url": "https://www.cnet.com/news/try-to-spot-dainty-mars-moon-deimos-in-this-wondrous-nasa-rover-shot/", "urlToImage": "https://www.cnet.com/a/img/yB74wCWB7f793qAu48v5vN_XLnw=/1200x630/2021/08/23/7f30a03e-ee6b-4355-abaa-6ae91fd67486/mars-perseverance-nlf-0173-0682322749-659ecm-n0061648ncam00514-01-295j.jpg", "publishedAt": "2021-08-23T14:11:35Z", "content": "Can you find Deimos in this image from Aug. 15, 2021? NASA's movie shows you where it is.\r\nNASA/JPL-Caltech\r\nThis story is part of Welcome to Mars, our series exploring the red planet.\r\nOn Earth, we … [+1779 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Radio Image of Andromeda Galaxy Is the Most-Detailed Ever Captured - SciTechDaily", "description": "Disk of galaxy identified as region where new stars are born. Scientists have published a new, detailed radio image of the Andromeda galaxy – the Milky Way’s sister galaxy – which will allow them to identify and study the regions of Andromeda where new stars …", "url": "https://scitechdaily.com/new-radio-image-of-andromeda-galaxy-is-the-most-detailed-ever-captured/", "urlToImage": "https://scitechdaily.com/images/Andromeda-Galaxy-Captured-at-6-6-GHz.jpg", "publishedAt": "2021-08-23T14:01:55Z", "content": "Radio image of Andromeda galaxy at 6.6 GHz (inset), captured using the Sardinia Radio Telescope in Italy. Credit: S. Fatigoni et al (2021)\r\nDisk of galaxy identified as region where new stars are bor… [+3926 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Dr. Ananya Mukherjee", "title": "We could power households from the scraps in our food waste bins – here's what is stopping us - The Conversation UK", "description": "Biogas is often overlooked as a source of renewable energy, but it could be a solution to dealing with the 9.5 million tonnes of food waste created by the UK every year.", "url": "https://theconversation.com/we-could-power-households-from-the-scraps-in-our-food-waste-bins-heres-what-is-stopping-us-165694", "urlToImage": "https://images.theconversation.com/files/416753/original/file-20210818-13-1v6610e.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C1920%2C960&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-08-23T13:58:21Z", "content": "Imagine if you could power your kettle using the energy generated from the vegetable cuttings quietly breaking down in your kitchens compost bin. That reality might not be so far off with the growth … [+4870 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Interstellar comets like Borisov may not be all that rare - Science Daily", "description": "Astronomers calculate that the Oort Cloud may be home to more visiting objects than objects that belong to our solar system.", "url": "https://www.sciencedaily.com/releases/2021/08/210823085635.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-23T13:50:45Z", "content": "In 2019, astronomers spotted something incredible in our backyard: a rogue comet from another star system. Named Borisov, the icy snowball traveled 110,000 miles per hour and marked the first and onl… [+4547 chars]"}, {"source": {"id": null, "name": "AeroTime News Hub"}, "author": null, "title": "The United Arab Emirates: the next space power? - AeroTime News Hub", "description": "While it may not have the experience of NASA, nor the means of China, the United Arab Emirates certainly has ambitious plans when it comes to space conquest.", "url": "https://www.aerotime.aero/28652-the-united-arab-emirates-the-next-space-power", "urlToImage": "https://www.aerotime.aero/upload/files/first_emirates_mars_mission_picture_from_mars_orbit.jpg", "publishedAt": "2021-08-23T13:50:00Z", "content": "While it may not have the experience of the United States, nor the means of China, the United Arab Emirates certainly has ambitious plans when it comes to space conquest.\r\nImpressive beginnings\r\nSinc… [+4985 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Earth’s Inner Heat And Climate Change Melting Antarctica’s Doomsday Glacier - India Times", "description": "The Thwaites Glacier in Antarctica, that’s more commonly known as the ‘Doomsday Glacier’ is getting a double blow of heat -- from rising temperatures due to climate change as well as due to Earth’s internal temperatures -- intensifying its melting and subject…", "url": "https://www.indiatimes.com/technology/news/climate-change-antarctica-doomsday-glacier-547815.html", "urlToImage": "https://im.indiatimes.in/content/2021/Aug/Facebook-Image---2021-08-23T165657274_6123864d69dfc.jpg", "publishedAt": "2021-08-23T13:40:08Z", "content": "The Thwaites Glacier in Antarctica, thats more commonly known as the Doomsday Glacier is getting a double blow of heat -- from rising temperatures due to climate change as well as due to Earths inter… [+2931 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Holly Tuten", "title": "Hunting a creature that hunts me: Collecting ticks for research - Phys.org", "description": "It's a sweltering summer afternoon. I'm pushing aside tree limbs and crunching leaves to get back to the trap that I baited two hours ago with dry ice to attract ticks. When I get closer, I can see a gossamer mist hovering over a bright white cloth in the dar…", "url": "https://phys.org/news/2021-08-creature.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/hunting-a-creature-tha.jpg", "publishedAt": "2021-08-23T13:00:56Z", "content": "It's a sweltering summer afternoon. I'm pushing aside tree limbs and crunching leaves to get back to the trap that I baited two hours ago with dry ice to attract ticks. When I get closer, I can see a… [+5593 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "The future of cosmology is 239,000 miles away — but closer than ever - Inverse", "description": "Using the Moon as the ultimate base for cosmic exploration, astronomers are hoping to get close-up images of the universe's mysteries.", "url": "https://www.inverse.com/science/moon-telescopes", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/8/5/ab736995-6adb-4941-80d4-c10974d0f271-slide6.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-08-23T13:00:25Z", "content": "The Moon isnt merely a symbol of our humanitys future in space. The Moon is the literal destination.\r\nThats the vision of Saptarshi Bandyopadhyay, a Robotics Technologist at NASAs Jet Propulsion Lab,… [+8020 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Eva Frederick", "title": "So-called 'junk' DNA plays a key role in speciation - Phys.org", "description": "More than 10 percent of our genome is made up of repetitive, seemingly nonsensical stretches of genetic material called satellite DNA that do not code for any proteins. In the past, some scientists have referred to this DNA as \"genomic junk.\"", "url": "https://phys.org/news/2021-08-so-called-junk-dna-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/so-called-junk-dna-pla.jpg", "publishedAt": "2021-08-23T12:35:38Z", "content": "More than 10 percent of our genome is made up of repetitive, seemingly nonsensical stretches of genetic material called satellite DNA that do not code for any proteins. In the past, some scientists h… [+7259 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sheetal Soni", "title": "WHO guidelines on human genome editing: Why countries need to follow them - Phys.org", "description": "The World Health Organisation (WHO) recently called on countries to stop any research that might lead to the birth of genetically edited human beings. The call was made with the release of the recommendations on human genome editing.", "url": "https://phys.org/news/2021-08-guidelines-human-genome-countries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/dna-2.jpg", "publishedAt": "2021-08-23T12:30:38Z", "content": "The World Health Organisation (WHO) recently called on countries to stop any research that might lead to the birth of genetically edited human beings. The call was made with the release of the recomm… [+6336 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Ajeet Kumar", "title": "Ex-NASA scientist proposes wild theory to prevent Earth burning when Sun begins expansion - Republic World", "description": "David Holz, a former NASA scientist, has proposed a theory to expand the distance of Earth from the Sun in order to preserve the blue planet and human species.", "url": "https://www.republicworld.com/technology-news/science/ex-nasa-scientist-proposes-wild-theory-to-prevent-earth-burning-when-sun-begins-expansion.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/aguv8n82k3poqd2e_1629715187.jpeg", "publishedAt": "2021-08-23T11:54:00Z", "content": "David Holz, a former NASA scientist, has proposed a theory to expand the distance of Earth from the Sun in order to preserve the blue planet and human species for at least 5 billion more years. Accor… [+3306 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IANS", "title": "Solar radiation could be behind tiny iron nanoparticles found on moon than previously thought: Study - IBTimes India", "description": "Solar radiation could be a more important source of tiny lunar iron nanoparticles than previously thought, scientists have found.", "url": "https://www.ibtimes.co.in/solar-radiation-could-be-behind-tiny-iron-nanoparticles-found-moon-previously-thought-study-840009", "urlToImage": "https://data1.ibtimes.co.in/en/full/762089/image-ganymede.jpg", "publishedAt": "2021-08-23T11:35:05Z", "content": "Covid Delta variant: Two vaccine shots may be ineffective, booster shots needed\r\nSolar radiation could be a more important source of tiny lunar iron nanoparticles than previously thought, scientists … [+1899 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Adam Mann", "title": "Mystery object in space could be a new arm of the Milky Way - Livescience.com", "description": "Scientists spot giant feature at edge of the galaxy.", "url": "https://www.livescience.com/new-arm-milky-way-cattail.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vd7PB2tyqzqCFXrhczaZDB-1200-80.jpg", "publishedAt": "2021-08-23T11:00:30Z", "content": "Astronomers have discovered an enormous new filament of gas and dust hanging at the outer edge of our galaxy. Nicknamed \"Cattail,\" the feature is not yet fully mapped, and the team who found it belie… [+3331 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "Traversable wormholes are possible under certain gravity conditions - Livescience.com", "description": "If you want to come back from a trip through a wormhole, you'll need some weird gravity.", "url": "https://www.livescience.com/traversable-wormholes-modified-gravity.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2hv4iV4WoSshqZKR5AxfEi-1200-80.jpg", "publishedAt": "2021-08-23T11:00:00Z", "content": "Traveling through a wormhole could be possible in certain gravity conditions. (Image credit: Shutterstock)\r\nInterested in scooting through a wormhole, the ultimate cheat-code through space and time? … [+6756 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Curtin University prepares to put Western Australia's first satellite into orbit - BollyInside", "description": "The Binar-1 is scheduled to take-off from Cape Canaveral, United States on August 28, as part of the SpaceX CRS-23 commercial resupply mission to the", "url": "https://www.bollyinside.com/news/curtin-university-prepares-to-put-western-australias-first-satellite-into-orbit", "urlToImage": null, "publishedAt": "2021-08-23T10:16:03Z", "content": "The Binar-1 is scheduled to take-off from Cape Canaveral, United States on August 28, as part of the SpaceX CRS-23 commercial resupply mission to the International Space Station. Following its launch… [+3275 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Scientists discover new technique that predicts astronauts' space radiation risk - EdexLive", "description": "The researchers studied blood samples from space station crew members to measure their levels of chromosome alterations from radiation and other factors", "url": "https://www.edexlive.com/news/2021/aug/23/scientists-discover-new-technique-that-predicts-astronauts-space-radiation-risk-23457.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/8/23/w600X390/space_radition_flickr.jpg", "publishedAt": "2021-08-23T09:41:00Z", "content": "Scientists at NASA have developed a technique that can help predict astronauts' risk of space radiation exposure during future exploration missions. The researchers studied blood samples from 43 spac… [+2439 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Source of the Northern Lights Is Also Depleting the Mesospheric Ozone Layer - Technology Networks", "description": "The same phenomenon that causes aurorae, the curtains of light often visible from polar regions of Earth, causes ozone layer depletion. This could have significance for global climate change and therefore, understanding this phenomenon is important. Now, a gr…", "url": "https://www.technologynetworks.com/applied-sciences/news/source-of-the-northern-lights-is-also-depleting-the-mesospheric-ozone-layer-352940", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/source-of-the-northern-lights-is-also-depleting-the-mesospheric-ozone-layer-352940.jpg?cb=20210823", "publishedAt": "2021-08-23T09:05:30Z", "content": "The same phenomenon that causes aurorae the magical curtains of green light often visible from the polar regions of the Earth causes mesospheric ozone layer depletion. This depletion could have signi… [+3361 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Marie Morales", "title": "Triantha Occidentalas: Flowering Plant Eats Insects Walking up Its Sticky Stalk - Science Times", "description": "Triantha occidentalas, a flowering wetland plant is found to be eating insects that walk up its sticky talk. The plant has the ability to ingest its prey’s nitrogen to survive in and endure a habitat.", "url": "https://www.sciencetimes.com/articles/33003/20210823/triantha-occidentalas-insects-walking-up-sticky-stalk-eaten-flowering-plant.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/35366/science-times-triantha-occidentalas-insects-walking-up-its-sticky-stalk-get-eaten-by-this-flowering-plant.jpg", "publishedAt": "2021-08-23T08:05:04Z", "content": "Triantha occidentalas won't bite. Although botanists say, if a tiny insect such as gnat or midge walks up to its sticky stalk, this flowering wetland plant that typically exists on Vancouver Island a… [+3645 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Hubble Snaps A Brilliant Image Of A Vivid Spiral Galaxy - Mashable India", "description": "Wow.", "url": "https://in.mashable.com/science/24251/hubble-snaps-a-brilliant-image-of-a-vivid-spiral-galaxy", "urlToImage": "https://sm.mashable.com/t/mashable_in/article/h/hubble-sna/hubble-snaps-a-brilliant-image-of-a-vivid-spiral-galaxy_cs13.1200.jpg", "publishedAt": "2021-08-23T04:00:00Z", "content": "The last time astronauts visited the school bus-sized Hubble telescope in space, they installed a new, reliable camera.\r\nTwelve years later, this \"workhouse\" camera (Hubbles Wide Field Camera 3), is … [+770 chars]"}, {"source": {"id": null, "name": "iTech Post"}, "author": "Czarina Grace", "title": "NASA Spacewalk Schedule, Live Stream and More: Watch Live as Astronauts Upgrade ISS Power System - iTech Post", "description": "NASA is scheduled to live stream two astronauts in their spacewalk to upgrade the International Space Station power system. Viewers can watch astronauts Mark Vande Hei and Akihiko Hoshide install new support brackets for an incoming solar array.", "url": "https://www.itechpost.com/articles/106787/20210822/nasa-spacewalk-schedule-live-stream-more-watch-astronauts-upgrade-iss.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/101378/nasa-spacewalk-schedule-live-stream-and-more-watch-live-as-astronauts-upgrade-iss-power-system.jpg", "publishedAt": "2021-08-23T03:21:27Z", "content": "NASA is scheduled to live stream two astronauts in their spacewalk to upgrade the International Space Station power system. Viewers can watch astronauts Mark Vande Hei and Akihiko Hoshide install new… [+3502 chars]"}, {"source": {"id": null, "name": "Presstories.com"}, "author": "Cary Douglas", "title": "Planetary Jupiter: Awesome video with a very rare event - The Press Stories", "description": "Jupiter has released an amazing video for all mankind, and it shows us a very rare phenomenon that has never been seen by many in the solar system. In", "url": "https://presstories.com/2021/08/23/planetary-jupiter-awesome-video-with-a-very-rare-event/", "urlToImage": "https://presstories.com/wp-content/uploads/2021/08/Planetary-Jupiter-Awesome-video-with-a-very-rare-event.jpg", "publishedAt": "2021-08-23T02:53:21Z", "content": "Jupiter has released an amazing video for all mankind, and it shows us a very rare phenomenon that has never been seen by many in the solar system. In particular, in the short video below, you see th… [+1393 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": "Naveen", "title": "Planetary scientists find evidence of solar-driven change on Moon - newkerala.com - New Kerala", "description": "Planetary scientists find evidence of solar-driven change on Moon", "url": "https://www.newkerala.com/news/2021/119647.htm", "urlToImage": null, "publishedAt": "2021-08-23T00:30:56Z", "content": "Washington, August 21: Tiny iron nanoparticles unlike any found naturally on Earth are nearly everywhere on the Moon--and scientists are trying to understand why. A new study led by scientists at Nor… [+3101 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Steph Panecasio", "title": "Puffy-cheeked prehistoric creature named after The Hobbit character - CNET", "description": "The early ancestors of horses, cows and other hoofed creatures could have big implications for the evolution of mammals.", "url": "https://www.cnet.com/news/puffy-cheeked-prehistoric-creature-named-after-the-hobbit-character/", "urlToImage": "https://www.cnet.com/a/img/Ooxs10Qn_FBZoWVYqq4LmNbbxGo=/1200x630/2021/08/18/e05730b5-31c6-4170-81e2-92eed35f7d19/tdos-beorn-jpg.jpg", "publishedAt": "2021-08-23T00:03:23Z", "content": "An artist's rendering of the Conacodon hettingeri, Miniconus jeanninae and Beornus honeyi. \r\nBanana Art Studio\r\nThe discovery of a previously unknown creature is even more fun when we can link it to … [+2508 chars]"}, {"source": {"id": null, "name": "WebWire"}, "author": null, "title": "NASA Sets Coverage, Invites Public to Virtually Join Next Cargo Launch - WebWire", "description": "NASA commercial cargo provider SpaceX is targeting Saturday, Aug. 28, at 3:37 a.m. EDT to launch its 23rd commercial resupply services mission to the  International Space Station. Liftoff will be from Launch Complex 39A at the agency\u0092s Kennedy Space Center in…", "url": "https://www.webwire.com/ViewPressRel.asp?aId=278149", "urlToImage": "https://photos.webwire.com/prmedia/7/278149/278149-1-m.jpg", "publishedAt": "2021-08-22T19:30:00Z", "content": "NASA commercial cargo provider SpaceX is targeting Saturday, Aug. 28, at 3:37 a.m. EDT to launch its 23rd commercial resupply services mission to the International Space Station. Liftoff will be from… [+5179 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Meet the diverse group of plant-eating dinosaurs that roamed Victoria 110 million years ago - Daily Excelsior", "description": "Melbourne, Aug 22: (The Conversation) During the Early Cretaceous period, 110 million to 107 million years ago, Australia was much further south than it", "url": "https://www.dailyexcelsior.com/meet-the-diverse-group-of-plant-eating-dinosaurs-that-roamed-victoria-110-million-years-ago/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2021/08/2-11.jpg", "publishedAt": "2021-08-22T19:29:38Z", "content": "Melbourne, Aug 22: (The Conversation) During the Early Cretaceous period, 110 million to 107 million years ago, Australia was much further south than it is today. Yet fossils from several sites on th… [+5782 chars]"}, {"source": {"id": null, "name": "Aviationanalysis.net"}, "author": "Theodore Meeks", "title": "Unknown external force in the large-scale structure, showing a broken arm in the galactic bow arm | TechNews - Aviation Analysis Wing", "description": "The Milky Way is our home, but since we're inside it, it might be the most unfamiliar of galaxies to observe. Recently, astronomers discovered for the", "url": "https://www.aviationanalysis.net/unknown-external-force-in-the-large-scale-structure-showing-a-broken-arm-in-the-galactic-bow-arm-technews/", "urlToImage": "https://www.aviationanalysis.net/wp-content/uploads/2021/01/One-lipstick-is-enough-The-new-YSL-smart-device-is.png", "publishedAt": "2021-08-22T15:49:45Z", "content": "The Milky Way is our home, but since we’re inside it, it might be the most unfamiliar of galaxies to observe. Recently, astronomers discovered for the first time in the Milky Way that the spiral arms… [+2746 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Here are some wacky ways to travel the solar system - Space Bollyinside - BollyInside", "description": "Space manifolds are described by scientists as being more or less highways though space, free fall lanes that could allow fast travel between planets.", "url": "https://www.bollyinside.com/news/here-are-some-wacky-ways-to-travel-the-solar-system", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-08-22T11:43:58Z", "content": "Space manifolds are described by scientists as being more or less highways though space, free fall lanes that could allow fast travel between planets. They are, in essence, invisible energy structure… [+1392 chars]"}, {"source": {"id": null, "name": "Lake County News"}, "author": "NATIONAL AERONAUTICS AND SPACE ADMINISTRATION", "title": "Space News: NASA's Curiosity Mars rover explores a changing landscape - Lake County News", "description": "A new video rings in the rover’s ninth year on Mars, letting viewers tour Curiosity’s location on a Martian mountain.", "url": "https://www.lakeconews.com/news/70083-space-news-nasa-s-curiosity-mars-rover-explores-a-changing-landscape", "urlToImage": "https://lakeconews.com/images/stories/2017/ads/OpenGraphImage5.png", "publishedAt": "2021-08-22T10:50:55Z", "content": "A new video rings in the rovers ninth year on Mars, letting viewers tour Curiositys location on a Martian mountain.\r\nImages of knobbly rocks and rounded hills are delighting scientists as NASAs Curio… [+2960 chars]"}]}