{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Did you know Mars rover`s giant parachute carried secret message and space enthusiasts cracked it within a... - Zee News", "description": "The huge parachute used by NASA s Perseverance rover to land on Mars contained a secret message, thanks to a puzzle lover on the spacecraft team. Systems engineer Ian Clark used a binary code to spell out ‘Dare Mighty Things’ in the orange and white strips of…", "url": "https://zeenews.india.com/world/did-you-know-mars-rovers-giant-parachute-carried-secret-message-and-space-enthusiasts-cracked-it-within-a-few-hours-2343965.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/02/24/919138-nasa-message.jpg", "publishedAt": "2021-02-24T01:37:53Z", "content": "Cape Canaveral: The huge parachute used by NASA's Perseverance rover to land on Mars contained a secret message, thanks to a puzzle lover on the spacecraft team.\r\nSystems engineer Ian Clark used a bi… [+2011 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Calla Cofield", "title": "Reclusive neutron star may have been found in famous supernova - Phys.org", "description": "What remains of the star that exploded just outside our galaxy in 1987? Debris has obscured scientists' view, but two of NASA's X-ray telescopes have revealed new clues.", "url": "https://phys.org/news/2021-02-reclusive-neutron-star-famous-supernova.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/reclusiveneu.jpg", "publishedAt": "2021-02-23T19:15:34Z", "content": "What remains of the star that exploded just outside our galaxy in 1987? Debris has obscured scientists' view, but two of NASA's X-ray telescopes have revealed new clues.\r\nSince astronomers captured t… [+6828 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Kittens supply clues to lethal diarrhea in youngsters - The Times Hub", "description": "Share this Article You might be free to share this text below the Attribution 4.0 Worldwide license. Kittens may very well be a mannequin for understanding infectious, generally lethal, diarrheal illness in each animals and youngsters, in response to new anal…", "url": "https://thetimeshub.in/kittens-supply-clues-to-lethal-diarrhea-in-youngsters/7967/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/kittens-supply-clues-to-lethal-diarrhea-in-youngsters-f3013f3-300x172.jpg", "publishedAt": "2021-02-23T19:10:50Z", "content": "Share this Article\r\nYou might be free to share this text below the Attribution 4.0 Worldwide license.\r\nKittens may very well be a mannequin for understanding infectious, generally lethal, diarrheal i… [+2763 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal 'good bacteria' in breast milk changes over time - ANI News", "description": "Montreal [Canada], February 23 (ANI): The cocktail of beneficial bacteria passed from mother to infant through breast milk changes significantly over time and could act as a daily booster shot for infant immunity and metabolism, according to the findings of n…", "url": "https://www.aninews.in/news/science/researchers-reveal-good-bacteria-in-breast-milk-changes-over-time20210223225615", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/infant-4025284_1280_yvm7KAq-thumbnail-154x87-70.jpg", "publishedAt": "2021-02-23T17:26:00Z", "content": "Montreal [Canada], February 23 (ANI): The cocktail of beneficial bacteria passed from mother to infant through breast milkchanges significantly over time and could act as a daily booster shot for inf… [+2480 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Microbes from Earth could temporarily survive on Mars: Study - DTNext", "description": "As NASA's Perseverance rover touched down on Mars last week, a new study by scientists at the US space agency and German Aerospace Centre has found that some microbes on Earth could temporarily survive on the surface of the Red Planet.", "url": "http://www.dtnext.in/Lifestyle/Technology/2021/02/23201239/1277160/Microbes-from-Earth-could-temporarily-survive-on-Mars-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Feb/202102232012394393_Microbes-from-Earth-could-temporarily-survive-on-Mars-Study_SECVPF.gif", "publishedAt": "2021-02-23T14:47:13Z", "content": "As NASA's Perseverance rover touched down on Mars last week, a new study by scientists at the US space agency and German Aerospace Centre has found that some microbes on Earth could temporarily survi… [+2361 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Hayley Arceneaux, a Cancer Survivor, Selected as Crew Member of First All-Civilian Space Mission | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "\"It's an incredible honour to join the Inspiration4 crew. This seat represents the hope that St. Jude gave me and continues to give families from around the world, who, like me, find hope when they walk through the doors of St. Jude,\" said Arceneaux. - Articl…", "url": "https://weather.com/en-IN/india/space/news/2021-02-23-hayley-arceneaux-selected-for-first-all-civilian-space-mission", "urlToImage": "https://s.w-x.co/in-hayley.jpg", "publishedAt": "2021-02-23T12:56:19Z", "content": "Hayley Arceneaux, a 29-year-old physician assistant, has been selected as the second crew member of Inspiration4the world's first all-civilian mission to space. She works at the St. Jude Children's R… [+2717 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bar­bara Von­ar­burg", "title": "Martian moons have a common ancestor - Phys.org", "description": "Mars's two moons, Phobos and Deimos, have puzzled researchers since their discovery in 1877. They are very small: Phobos's diameter of 22 kilometers is 160 times smaller than that of our moon, and Deimos is even smaller, with a diameter of only 12 kilometers.…", "url": "https://phys.org/news/2021-02-martian-moons-common-ancestor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/martianmoons.jpg", "publishedAt": "2021-02-23T12:40:03Z", "content": "Mars's two moons, Phobos and Deimos, have puzzled researchers since their discovery in 1877. They are very small: Phobos's diameter of 22 kilometers is 160 times smaller than that of our moon, and De… [+4985 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "Nanoracks launches two CubeSats on NG-15 Cygnus - Geospatial World", "description": "The NG-15 Cygnus spacecraft berthed with the International Space Station (ISS), carrying two CubeSats in the Nanoracks External Cygnus Deployer (E-NRCSD). The Cygnus arrived at the ISS after launching from Wallops Flight Facility Pad 0A on February 22, 2021 a…", "url": "http://data.wordlift.io/wl01287/post/nanoracks_launches_two_cubesats_on_ng-15_cygnus", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2021/02/download-97.png", "publishedAt": "2021-02-23T09:35:30Z", "content": "The NG-15 Cygnus spacecraft berthed with the International Space Station (ISS), carrying two CubeSats in the Nanoracks External Cygnus Deployer (E-NRCSD). The Cygnus arrived at the ISS after launchin… [+2006 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Debasish Chakraborty", "title": "Witness the extraordinarily alluring Earth through these photos taken from the International Space Station - Times Now", "description": "The crew of the International Space Station orbiting over 200 miles above the Earth have taken some stunning photos of the Blue Planet. Here are the pictures that you definitely don't want to miss.", "url": "https://www.timesnownews.com/the-buzz/article/witness-the-extraordinarily-alluring-earth-through-these-photos-taken-by-the-international-space-station/723880", "urlToImage": "https://imgk.timesnownews.com/story/p_l_a_n_e_t_E_A_R_T_H.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-23T07:54:00Z", "content": "In most of their movies based on an alien invasion, Hollywood has always managed to grab attention displaying how the Blue Planet glows like a blue sapphire against the darkness of space. Every inch … [+3754 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Morning Digest: NASA releases first audio from Mars, NRIs press for voting rights ahead of upcoming Assembly polls, and more - The Hindu", "description": "A select list of stories to read before you start your day.", "url": "https://www.thehindu.com/news/national/morning-digest-february-23-2021/article33907609.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/gh19k9/article33885979.ece/ALTERNATES/LANDSCAPE_615/1", "publishedAt": "2021-02-23T02:23:49Z", "content": "The U.S. space agency NASA on Monday released the first audio from Mars, a faint wind sound captured by the Perseverance rover. NASA also released the first video of the landing of the rover on the R… [+2620 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Neuroscience: Artificial 'brain in a dish' is created that matures 'just like a human brain' - Daily Mail", "description": "Extensive genetic analyses of the so-called 'organoids' - which were allowed to grow in experimental dishes for up to 20 months - was conducted by US researchers.", "url": "https://www.dailymail.co.uk/sciencetech/article-9287071/Neuroscience-Artificial-brain-dish-created-matures-just-like-human-brain.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/22/18/39632798-0-image-a-12_1614019867211.jpg", "publishedAt": "2021-02-22T16:00:55Z", "content": "A 'brain in a dish' grown from stem cells in the lab can develop 'just like a human brain' and may help shed light on conditions like Alzheimer's and schizophrenia.\r\nResearchers from the US conducted… [+5378 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alasdair MacKenzie and Andreas Kolb", "title": "The human genome at 20: How biology's most-hyped breakthrough led to anticlimax and arrests - Phys.org", "description": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence  had been completed, he hailed the breakthrough as \"the most important, most wondrous map ever produced by humankind.\" The scientific achievement…", "url": "https://phys.org/news/2021-02-human-genome-biology-most-hyped-breakthrough.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thehumangeno.jpg", "publishedAt": "2021-02-22T14:14:27Z", "content": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence had been completed, he hailed the breakthrough as \"the most important, most wondrous … [+8115 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "UK Teens Face Kidnapping Charges after Accidentally Stealing Car with Owner's Children Still Inside - News18", "description": "Getting your car stolen is scary enough, but if the car is stolen with your children inside? Simply horrific.", "url": "https://www.news18.com/news/buzz/uk-teens-face-kidnapping-charges-after-accidentally-stealing-car-with-owners-children-still-inside-3461954.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1613991696_car.jpeg", "publishedAt": "2021-02-22T11:02:38Z", "content": "Getting your car stolen is scary enough, but if the car is stolen with your children inside? Simply horrific. A family in Birmingham was caught in a moment of extreme distress when someone stole thei… [+1956 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "42,000 Year Old Tree Captured Evidence Of Earth’s Magnetic Field Flipping - India Times", "description": "A few years ago, workers digging to create a power plant in New Zealand discovered a 60-ton trunk from a kauri tree, and now according to researchers, it has captured the last collapse of Earth’s magnetic field.                         ScienceMagThe massive t…", "url": "https://www.indiatimes.com/technology/science-and-future/earth-magnetic-field-flip-42000-year-old-tree-534882.html", "urlToImage": "https://im.indiatimes.in/content/2021/Feb/Facebook-Image---2021-02-22T150119277_60337a04961c1.jpg", "publishedAt": "2021-02-22T10:16:02Z", "content": "A few years ago, workers digging to create a power plant in New Zealand discovered a 60-ton trunk from a kauri tree, and now according to researchers, it has captured the last collapse of Earths magn… [+3111 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Kellen Beck", "title": "Inside Perseverance Mission Control: A Surreal Experience That Brought Sci-Fi To Life - Mashable India", "description": "As Perseverance careened toward Mars Thursday, the live broadcast from inside mission control oozed tension. It felt like science fiction to Swati Mohan, who managed the rover's descent and kept the world updated on the spacecraft's status.\nMillions of people…", "url": "https://in.mashable.com/science/20454/inside-perseverance-mission-control-a-surreal-experience-that-brought-sci-fi-to-life", "urlToImage": "https://sm.mashable.com/t/mashable_in/feature/i/inside-per/inside-perseverance-mission-control-a-surreal-experience-tha_5avz.1200.png", "publishedAt": "2021-02-22T06:30:00Z", "content": "As Perseverance careened toward Mars Thursday, the live broadcast from inside mission control oozed tension. It felt like science fiction to Swati Mohan, who managed the rover's descent and kept the … [+5648 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}