{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": null, "name": "Beebom"}, "author": null, "title": "A Man-Made Probe by NASA ‘Touched the Sun’ for the First Time; Here’s What It Discovered! - Beebom", "description": "NASA's Parker Solar Probe recently \"touched the Sun\" for the first time in the history to discover new facts about the star's atmosphere.", "url": "https://beebom.com/man-made-nasa-probe-touched-sun-first-time-what-it-discovered/", "urlToImage": "https://beebom.com/wp-content/uploads/2021/12/shutterstock_309014654-min.jpg", "publishedAt": "2021-12-19T09:57:37Z", "content": "Scientists and space organizations have been wanting to study the Sun to learn about the star’s composition and its corona, which is another name for its atmosphere, for the longest time. Although re… [+2671 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Anadolu Agency", "title": "SpaceX launches Turkey's Turksat 5B satellite into space - Daily Sabah", "description": "Turkey&#039;s new telecommunication satellite was launched on Sunday by United States aerospace company SpaceX at 6:59 a.m. Turkish time (3:59 a.m....", "url": "https://www.dailysabah.com/business/tech/spacex-launches-turkeys-turksat-5b-satellite-into-space", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2021/12/19/thumbs/800x531/168361.jpg", "publishedAt": "2021-12-19T08:33:41Z", "content": "Turkey's new telecommunication satellite was launched on Sunday by United States aerospace company SpaceX at 6:59 a.m. Turkish time (3:59 a.m. GMT).\r\nTurksat 5B, which launched from Cape Canaveral Sp… [+1862 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Space Missions of 2021 That Took Our Appreciation for Cosmos to New Heights - News18", "description": "Now that our blue planet is bidding 2021 adieu by finishing its current cycle around the Sun, let us look at arguably the important space missions that happened this year.", "url": "https://www.news18.com/news/buzz/space-missions-of-2021-that-took-our-appreciation-for-cosmos-to-new-heights-4529528.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/space-missions-2021-163990103516x9.png", "publishedAt": "2021-12-19T08:07:49Z", "content": "2021 has been a remarkable year for space exploration which saw over a hundred space missions, most of which were successful. Of everything this year, humans achieved an unprecedented feat of flying … [+3424 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "James Webb Space Telescope to Leave for its New Home on Dec 24. What Caused Delay? - News18", "description": "James Webb space telescope project, begun in 1989, was originally expected to deploy the instrument -- which will be the largest and most powerful telescope ever to be launched into space -- in the early 2000s.", "url": "https://www.news18.com/news/buzz/james-webb-space-telescope-to-leave-for-its-new-home-on-dec-24-what-caused-delay-4570721.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/james-webb-telescope-launch-163989703016x9.png", "publishedAt": "2021-12-19T07:03:00Z", "content": "The much-delayed launch of the James Webb space telescope will go ahead on December 24, NASA and the company overseeing the launch confirmed on Saturday. The project, begun in 1989, was originally ex… [+2380 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Water on Mars: ESA’s ExoMars Discovers a Hidden Reservoir on the Grand Canyon - The Times Hub", "description": "December 19, 2021 A new study has revealed that Mars’ massive valley system, Valles Marineris, may hold water hidden beneath the surface. The European Space Agency (ESA) and the Cooperative ExoMars Trace Gas Orbiter of Roscosmos (TGO) have discovered large am…", "url": "https://thetimeshub.in/water-on-mars-esas-exomars-discovers-a-hidden-reservoir-on-the-grand-canyon", "urlToImage": null, "publishedAt": "2021-12-19T06:08:46Z", "content": "December 19, 2021 \r\nA new study has revealed that Mars’ massive valley system, Valles Marineris, may hold water hidden beneath the surface. The European Space Agency (ESA) and the Cooperative ExoMars… [+2689 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Huge “fossil” structures have been revealed at the far reaches of our galaxy - The Times Hub", "description": "December 19, 2021 From the point of view of the Earth in one of the spiral arms of the Milky Way, it is very difficult to reconstruct the structure of our galaxy. This is because measuring the distance to something in space when you don’t know its intrinsic b…", "url": "https://thetimeshub.in/huge-fossil-structures-have-been-revealed-at-the-far-reaches-of-our-galaxy", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/12/5560b94718f133a75b482dfded032374.jpg", "publishedAt": "2021-12-19T06:08:46Z", "content": "December 19, 2021 \r\nFrom the point of view of the Earth in one of the spiral arms of the Milky Way, it is very difficult to reconstruct the structure of our galaxy.\r\nThis is because measuring the dis… [+4059 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "Found in Australia — a ‘true’ millipede with more than 1,000 legs - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/found-in-australia-a-true-millipede-with-more-than-1000-legs/783736/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/12/mili.jpg", "publishedAt": "2021-12-19T03:40:22Z", "content": "A female Eumillipes persephone with 330 segments and 1,306 legs | Credit: The first true millipede 1,306 legs long, Paul E. Marek, Bruno A. Buzatto, William A. Shear, Jackson C. Means, Dennis G. Blac… [+7607 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "SpaceX launches 52 Starlink satellites from California base - India Today", "description": "The two-stage Falcon 9 rocket lifted off from coastal Vandenberg Space Force Base at 4.41 am and arced over the Pacific.", "url": "https://www.indiatoday.in/science/story/spacex-launches-52-starlink-satellites-from-california-base-1889475-2021-12-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202112/Falcon_9_rocket-647x363.jpeg?bIppsE0ZAgY6ir6AXt6fXkt0KUiOQSvU", "publishedAt": "2021-12-19T02:20:03Z", "content": null}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "NASA helicopter sets new record on Mars - The Times Hub", "description": "Photo: twitter.com/Comput_Planet Ingenuity on the surface of Mars The Ingenuity drone flew over the surface of the Red Planet for half an hour. The mark significantly exceeds the original plans of the developers. NASA's Ingenuity mini-helicopter flew over the…", "url": "https://thetimeshub.in/nasa-helicopter-sets-new-record-on-mars", "urlToImage": null, "publishedAt": "2021-12-19T00:13:13Z", "content": "Photo: twitter.com/Comput_Planet \r\nIngenuity on the surface of Mars \r\nNASA's Ingenuity mini-helicopter flew over the surface of Mars in a record time of 30 minutes and 48 seconds. As noted in the spa… [+1028 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Pascal Nalat", "title": "Look to the sky tonight as the Geminid meteor shower peaks with a spectacular display of ‘green fireballs.’ - Brinkwire", "description": "Look up tonight as the Geminid meteor shower peaks with a spectacular display of \"green fireballs.\" THE ANNUAL Geminid meteor shower has arrived, and", "url": "https://en.brinkwire.com/science/look-to-the-sky-tonight-as-the-geminid-meteor-shower-peaks-with-a-spectacular-display-of-green-fireballs/", "urlToImage": "https://en.brinkwire.com/nerede/uploads/newsimages1/geminid-meteor-shower-tonight-how-to-see-geminids-fireballs-1535427.jpg", "publishedAt": "2021-12-18T20:44:56Z", "content": "Look up tonight as the Geminid meteor shower peaks with a spectacular display of “green fireballs.”\r\nTHE ANNUAL Geminid meteor shower has arrived, and astronomers are anticipating seeing beautiful “g… [+2172 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Aparna Shandilya", "title": "Antarctica's Thwaites Glacier on edge of collapse; sea level may rise by 10ft in 10 yrs - Republic World", "description": "The Thwaites Glacier also known as \"doomsday\" glacier, in Antarctica, is on the verge of slipping into the ocean as the ice shelf holding it back could crack.", "url": "https://www.republicworld.com/technology-news/science/antarcticas-thwaites-glacier-on-edge-of-collapse-sea-level-may-rise-by-10ft-in-10-yrs.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ty7btjdijlglgpam_1639844941.jpeg", "publishedAt": "2021-12-18T18:38:00Z", "content": "The Thwaites Glacier also known as \"doomsday\" glacier, in Antarctica, is on the verge of slipping into the ocean as the ice shelf holding it back could crack, scientists warned. The Florida-sized gla… [+2856 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Did Scientists Discover a Warp Bubble? Broke spacetime, explained - BollyInside", "description": "The USS Enterprise starship is prepared to launch at warp speed into faraway galaxies at the drop of a hat, but scientists can’t figure out how to bring", "url": "https://www.bollyinside.com/news/did-scientists-discover-a-warp-bubble-broke-spacetime-explained", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-12-18T17:38:23Z", "content": "The USS Enterprise starship is prepared to launch at warp speed into faraway galaxies at the drop of a hat, but scientists cant figure out how to bring this technology to life.BrendanHunter/iStock Un… [+2821 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Elon Musk Shares Video of Starship Steering Its Mighty Engines - Futurism", "description": "Billionaire Tesla and SpaceX CEO Elon Musk shared a video on Twitter of the giant Starship and its steering engines, a sign production may be back on track.", "url": "https://futurism.com/the-byte/musk-starship-steering-engines", "urlToImage": "https://wp-assets.futurism.com/2021/12/musk-starship-steering-engines.jpg", "publishedAt": "2021-12-18T16:30:29Z", "content": "Talk about powerful.\r\nPower Steering\r\nSpaceXs brush with bankruptcy may be fading. CEO Elon Musk shared a video on Friday of the companys giant Starship flexing the steering system for its engines, a… [+1876 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Juno captures breathtaking images of Jupiter`s moon Ganymede - WION", "description": "NASAs Juno Mission has captured stunning images of Jupiters moon Ganymede.", "url": "https://www.wionews.com/science/nasas-juno-captures-breathtaking-images-of-jupiters-moon-ganymede-438006", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/18/227409-untitled-design-19.jpg", "publishedAt": "2021-12-18T15:22:41Z", "content": "NASA's Juno Mission has captured stunning images of Jupiter's moon Ganymede.\r\nJunos Ganymede Flyby has released a 50-second animation that provides an auditory as well as a visual glimpse at data col… [+1720 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "NASA’s Perseverance rover discovers organic chemicals on Mars - The Siasat Daily", "description": "Washington: Scientists at NASA's Perseverance Mars rover mission have discovered that rocks in the Jezero Crater on the Red Planet have interacted with water multiple times over the eons and that some contain organic molecules. The team discovered the organic…", "url": "https://www.siasat.com/nasas-perseverance-rover-discovers-organic-chemicals-on-mars-2243819/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/03/1200-900-NASA.jpg", "publishedAt": "2021-12-18T13:31:00Z", "content": "Washington: Scientists at NASA’s Perseverance Mars rover mission have discovered that rocks in the Jezero Crater on the Red Planet have interacted with water multiple times over the eons and that som… [+2855 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "41,000 years ago, auroras blazed near the equator - The News Motion", "description": "If you want to be dazzled by a spectacular northern lights display, your best bet is to skywatch near the North Pole. But that wasn't the case 41,000 years ago, when a disruption of Earth's magnetic field sent auroras wandering toward the equator.Dur", "url": "https://thenewsmotion.com/41000-years-ago-auroras-blazed-near-the-equator/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/u6TSqt8uEPkPfhLbmRDsta-1200-80.jpg", "publishedAt": "2021-12-18T12:22:40Z", "content": "If you want to be dazzled by a spectacular northern lights\r\n display, your best bet is to skywatch near the North Pole. But that wasn’t the case 41,000 years ago, when a disruption of Earth’s magneti… [+4764 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Veronica Tucker", "title": "Jupiter, Saturn and Venus are exactly aligned - space and astronomy - Tech News Inc", "description": "Jupiter, Saturn and Venus march in the sky, Fonte Inaf © ANSA / Ansa Jupiter, Saturn and Venus march in the sky, perfect alignment and the opportunity to", "url": "https://technewsinc.com/jupiter-saturn-and-venus-are-exactly-aligned-space-and-astronomy/", "urlToImage": "https://news.google.com/webimages/ch_620x438/2021/12/17/f7cc6237c9e36f26845a637a021473bd.JPG", "publishedAt": "2021-12-18T12:06:36Z", "content": "Jupiter, Saturn and Venus march in the sky, perfect alignment and the opportunity to return to see the sky. \r\nIn the past, planetary alignments were seen in ancient times as announcements of the end … [+1410 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "What The FAQ: Why is everyone talking about Comet Leonard? - EdexLive", "description": "In today's FAQ, we try to know more about the comet Leonard, when it will be seen and how far it is going to travel in this universe", "url": "https://www.edexlive.com/faq/2021/dec/18/what-the-faq-why-is-everyone-talking-about-comet-leonard-26345.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/12/18/w600X390/Dec_9_FAQ_Featured_Image1.png", "publishedAt": "2021-12-18T10:57:00Z", "content": "If you are one of those keen observers of the night sky or are an astronomy enthusiast, then you must be psyched about the most awaited Comet Leonard, formally known as C/2021 A1. \r\nAccording to scie… [+1457 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Black holes form voids: how is this possible - The Times Hub", "description": "Cluster RBS 797 in the optical and X-ray ranges/NASA Black holes are incredible compact objects. They obviously cannot be voids. But astronomers still recorded the voids that form black holes. Scientists have observed the galaxy cluster RBS 797, located 3.9 b…", "url": "https://thetimeshub.in/black-holes-form-voids-how-is-this-possible", "urlToImage": null, "publishedAt": "2021-12-18T10:13:55Z", "content": "Cluster RBS 797 in the optical and X-ray ranges/NASA \r\n Black holes are incredible compact objects. They obviously cannot be voids. But astronomers still recorded the voids that form black holes. \r\nS… [+1949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Two NASA Astronauts Receive Assignments for SpaceX Crew-6 Mission - SciTechDaily", "description": "NASA has assigned two crew members to launch on the agency’s SpaceX Crew-6 mission – the sixth crew rotation flight aboard a Crew Dragon spacecraft to the International Space Station. NASA astronauts Stephen Bowen and Woody Hoburg will serve as spacecraft com…", "url": "https://scitechdaily.com/two-nasa-astronauts-receive-assignments-for-spacex-crew-6-mission/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronauts-Stephen-Bowen-and-Woody-Hoburg..jpg", "publishedAt": "2021-12-18T10:06:27Z", "content": "ByNASADecember 18, 2021\r\nNASA crew members of the agency’s SpaceX Crew-6 mission to the International Space Station. Pictured from left are NASA astronauts Stephen Bowen and Woody Hoburg. Credit: NAS… [+4211 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Decreased fungicide application causes decline of resistant fungal pathogens indicating hidden in field fit... - The News Motion", "description": "Amino acid 198 mutation frequency based on the collection region and the pathogen host. Credit: Michael J. Bradshaw, Holly P. Bartholomew, Dylan Hendricks, Autumn Maust, and Wayne M. J", "url": "https://thenewsmotion.com/decreased-fungicide-application-causes-decline-of-resistant-fungal-pathogens-indicating-hidden-in-field-fitness-costs/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/decreased-fungicide-ap-1.jpg", "publishedAt": "2021-12-18T08:52:55Z", "content": "The use of fungicides to treat plant pathogens dates back 150 years, when a mixture of lime and copper sulfate, known as the “Bordeaux mixture,” was used to control fungal diseases in French vineyard… [+2663 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Helena Sutan", "title": "Gravity, mutations, and NASA’s “secret experiments”: is it possible to have sex in space? - Brinkwire", "description": "Gravity, mutations, and NASA's \"secret experiments\": is it possible to have sex in space? Experts say that having a healthy sex life is important for", "url": "https://en.brinkwire.com/sports/gravity-mutations-and-nasas-secret-experiments-is-it-possible-to-have-sex-in-space/", "urlToImage": "https://en.brinkwire.com/nerede/uploads/newsimages1/0_japanese-billionaire-maezawa-floats-inside-the-iss.jpg", "publishedAt": "2021-12-18T07:55:22Z", "content": "Gravity, mutations, and NASA’s “secret experiments”: is it possible to have sex in space?\r\nExperts say that having a healthy sex life is important for physical and mental health, but no one knows for… [+2384 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Secret embraces of stars revealed by Alma — ScienceDaily - The News Motion", "description": "Unlike our Sun, most stars live with a companion. Sometimes, two come so close that one engulfs the other -- with far-reaching consequences. When a team of astronomers led by Chalmers University of Technology, Sweden, used the telescope Alma to study", "url": "https://thenewsmotion.com/secret-embraces-of-stars-revealed-by-alma-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-18T07:42:35Z", "content": "Unlike our Sun, most stars live with a companion. Sometimes, two come so close that one engulfs the other — with far-reaching consequences. When a team of astronomers led by Chalmers University of Te… [+5612 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA, SpaceX conclude launch readiness review for 24th resupply mission - Devdiscourse", "description": "Read more about NASA, SpaceX conclude launch readiness review for 24th resupply mission on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/1852473-nasa-spacex-conclude-launch-readiness-review-for-24th-resupply-mission", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2021_12_32_00_3111981.jpg?width=920&format=jpeg", "publishedAt": "2021-12-18T07:02:00Z", "content": "NASA and SpaceX have completed the launch readiness review (LRR) for the upcoming 24th commercial resupply services mission to the International Space Station (ISS), the agency said on Friday.\r\nThe l… [+1138 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A planet the size of Mars orbiting very close to its host star - BollyInside", "description": "“We used the Habitable-zone Planet Finder, a high-precision astronomical spectrograph installed on the Hobby-Eberly Telescope at the McDonald Observatory", "url": "https://www.bollyinside.com/news/a-planet-the-size-of-mars-orbiting-very-close-to-its-host-star", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-12-18T05:58:27Z", "content": "We used the Habitable-zone Planet Finder, a high-precision astronomical spectrograph installed on the Hobby-Eberly Telescope at the McDonald Observatory in Texas to observe this system, said Suvrath … [+2360 chars]"}, {"source": {"id": null, "name": "Fossbytes"}, "author": null, "title": "What Is The International Space Station (ISS)? - Fossbytes", "description": "This is the space station that humans have continuously inhabited for over two decades.", "url": "https://fossbytes.com/what-is-the-international-space-station-iss/", "urlToImage": "https://fossbytes.com/wp-content/uploads/2021/12/international-space-station.jpg", "publishedAt": "2021-12-18T05:53:52Z", "content": null}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "“A new era for science”: for the first time, a piece of Mars will return to Earth - The Times Hub", "description": "December 18, 2021 Arrived on the red planet last february, NASA’s Perseverance rover has so far mainly tested its motor skills. His tests having been conclusive, he is preparing to carry out a mission of great importance: to collect Martian rock. The operatio…", "url": "https://thetimeshub.in/a-new-era-for-science-for-the-first-time-a-piece-of-mars-will-return-to-earth", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/12/9b6ae70858dd8dd0be8479c3932d1d4d.jpg", "publishedAt": "2021-12-18T03:30:05Z", "content": "December 18, 2021 \r\nArrived on the red planet last february, NASA’s Perseverance rover has so far mainly tested its motor skills. His tests having been conclusive, he is preparing to carry out a miss… [+3086 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Cameron Duke", "title": "Indestructible 'Black Box' will record our planet's demise in minute detail - Livescience.com", "description": "The disaster recorder aims to set us on a better path by watching our every move.", "url": "https://www.livescience.com/earth-black-box-records-planet-demise", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qckLwRFPWTzmtrFFLL2D4X-1200-80.jpg", "publishedAt": "2021-12-18T02:27:01Z", "content": "Every commercial flight you have ever taken has been recorded. Every tug on the yoke and every adjustment of the throttle has been dutifully logged by a little recording device tucked away in the tai… [+3670 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "Earthquake depth impacts potential tsunami threat - The News Motion", "description": "Graphic showing how a tsunami works. Credit: Ocean Institute, modified by NOAA/ NWS/ CGS                        Earthquakes of similar magnitude can cause tsunamis of greatly varying s", "url": "https://thenewsmotion.com/earthquake-depth-impacts-potential-tsunami-threat/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/earthquake-depth-impac.jpg", "publishedAt": "2021-12-18T00:42:45Z", "content": "Earthquakes of similar magnitude can cause tsunamis of greatly varying sizes. This commonly observed, but not well-understood phenomenon has hindered reliable warnings of local tsunamis.\r\nResearch le… [+3987 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Micromoon this weekend: what is it, when to see it - BollyInside", "description": "So we’ve heard of the supermoon, the blood Moon and the blue moon. But what is a micromoon? The micromoon is when a full moon coincides with apogee — the", "url": "https://www.bollyinside.com/news/micromoon-this-weekend-what-is-it-when-to-see-it", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-12-18T00:38:18Z", "content": "So weve heard of the supermoon, the blood Moon and the blue moon. But what is a micromoon? The micromoon is when a full moon coincides with apogee the point where the moons orbit is farthest away fro… [+994 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Lab-grown human brain cells learn to play video games faster than AI - The bharat express news", "description": "Scientists were able to grow human brain cells in a petri dish and taught them to play video games faster than an AI. Hundreds of thousands of lab-grown", "url": "https://www.thebharatexpressnews.com/lab-grown-human-brain-cells-learn-to-play-video-games-faster-than-ai/", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article25730300.ece/ALTERNATES/s615b/1_Screenshot-2021-12-17-220520.jpg", "publishedAt": "2021-12-17T23:01:12Z", "content": "Scientists were able to grow human brain cells in a petri dish and taught them to play video games faster than an AI.\r\n Hundreds of thousands of lab-grown human brain cells can now play classic retro… [+2612 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Stephen Hawking was RIGHT! New model shows primordial black holes could account for all dark matter - Daily Mail", "description": "Scientists took Stephen Hawking's theory and modified it to show a different model of how the universe formed, which shows primordial holes formed during the Bing Bang.", "url": "https://www.dailymail.co.uk/sciencetech/article-10322583/Stephen-Hawking-RIGHT-New-model-shows-primordial-black-holes-account-dark-matter.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/12/17/22/51939223-0-image-a-60_1639780107154.jpg", "publishedAt": "2021-12-17T22:35:56Z", "content": "In the 1974, Stephen Hawking and his PhD student Bernard Carr proposed primordial black holes, hypothetical black holes that existed soon after the Big Bang, could be the elusive dark matter first th… [+5450 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "The Moon is a Barren and Desolate, but Lunar Caves Could Offer Some Shelter From the Harsh Environment - Universe Today", "description": "New research shows that cave and pits on the Moon range considerably in terms of temperature, which is vital knowledge for the creation of future bases.", "url": "https://www.universetoday.com/153734/the-moon-is-a-barren-and-desolate-but-lunar-caves-could-offer-some-shelter-from-the-harsh-environment/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/12/king_16_fracture_pit_lroc_m128509025r2_copy.jpg", "publishedAt": "2021-12-17T22:29:12Z", "content": "The dream of building a permanent settlement on the Moon: a place where humans from all walks of life can come together and give rise to a new culture and identity. A place where vital scientific res… [+7540 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceCast Weekly - December 17, 2021 - NASA Video", "description": "SpaceCast Weekly is a NASA Television broadcast from the Johnson Space Center in Houston featuring stories about NASA’s work in human spaceflight, including ...", "url": "https://www.youtube.com/watch?v=qn_zFn8X1ek", "urlToImage": "https://i.ytimg.com/vi/qn_zFn8X1ek/maxresdefault.jpg", "publishedAt": "2021-12-17T18:56:10Z", "content": null}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "MarketScreener", "title": "artnet : Neanderthals, the Original Gardeners, Intentionally Altered the Landscape as Much as 125,000 Years Ago, a Study Finds - marketscreener.com", "description": "Archaeology\n      \n      \n        Neanderthals, the Original Gardeners, Intentionally Altered the Landscape as Much as 125,000 Years Ago, a Study Finds\n      \n      \n        In a thaw... | December 18,  2021", "url": "https://www.marketscreener.com/quote/stock/ARTNET-AG-9069063/news/artnet-Neanderthals-the-Original-Gardeners-Intentionally-Altered-the-Landscape-as-Much-as-125-00-37363542/", "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png", "publishedAt": "2021-12-17T18:49:14Z", "content": "Hunter-gatherers were making changes to the ecosystem as early as 125,000 years ago, according to a newly published study by researchers from Leiden University in the Netherlands and Johannes Gutenbe… [+1831 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Gloria Holmes", "title": "Revealing the origin of Earth's components through the formation of the lower mantle - Persia Digest", "description": "Where do the carbon, nitrogen, and water that made the Earth habitable come from? Even today, this question is still intensely debated. However, one chemical element in particular can help solve this puzzle, or at least advance the path of knowledge. This is …", "url": "https://persiadigest.com/revealing-the-origin-of-earths-components-through-the-formation-of-the-lower-mantle/", "urlToImage": "https://persiadigest.com/wp-content/uploads/2021/12/Revealing-the-origin-of-Earths-components-through-the-formation-of.jpg", "publishedAt": "2021-12-17T18:42:28Z", "content": "Where do the carbon, nitrogen, and water that made the Earth habitable come from? Even today, this question is still intensely debated. However, one chemical element in particular can help solve this… [+3835 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "See the ISS pass over Rome's Colosseum in 'once in a lifetime' image - CNET", "description": "A streak of light and an ancient monument meet in a stunning view from Italy.", "url": "https://www.cnet.com/news/see-the-iss-pass-over-the-rome-colosseum-in-once-in-a-lifetime-image/", "urlToImage": "https://www.cnet.com/a/img/juZ4KxtD2N4xGhpl0KVUg4uMIn8=/1200x630/2021/12/17/84762727-fcb9-4b15-8296-64554f3765d0/issrome.jpg", "publishedAt": "2021-12-17T18:41:00Z", "content": "The ISS transits over the Colosseum in Rome in this remarkable image captured on Dec. 6, 2021.\r\nGianluca Masi\r\nThe International Space Station is tricky to photograph from down on Earth. The station … [+1300 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The climate system relies on microscopic particles - Phys.org", "description": "The Earth's climate is an extremely complex system that is driven by the subtle balance of many different processes—a key one of which is the air-sea exchange of CO2. Monitoring the ocean's uptake of CO2 is key to our understanding of climate change, and scie…", "url": "https://phys.org/news/2021-12-climate-microscopic-particles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/phytoplankton.jpg", "publishedAt": "2021-12-17T17:46:02Z", "content": "The Earth's climate is an extremely complex system that is driven by the subtle balance of many different processesa key one of which is the air-sea exchange of CO2. Monitoring the ocean's uptake of … [+4862 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science@Nasa", "title": "Paving the way to thriving in space - Phys.org", "description": "In late December, SpaceX-24 will deliver a payload to the International Space Station. Three new experiments that will help scientists better understand specific biological and physical phenomena will be on board.", "url": "https://phys.org/news/2021-12-paving-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/paving-the-way-to-thri.jpg", "publishedAt": "2021-12-17T16:50:01Z", "content": "In late December, SpaceX-24 will deliver a payload to the International Space Station. Three new experiments that will help scientists better understand specific biological and physical phenomena wil… [+2629 chars]"}, {"source": {"id": null, "name": "Eu.com"}, "author": null, "title": "New study shows that 99.9% of the mass at the centre of our galaxy is due to black hole - ROOM Space Journal", "description": "After measuring more precisely than ever before the position and velocity of four stars, astronomers say that the mass in the centre of the Milky Way is almost entirely due to the Sgr A* black hole, leaving very little room for anything else.", "url": "https://room.eu.com/news/new-study-shows-that-999-of-the-mass-at-the-centre-of-our-galaxy-is-due-to-black-hole", "urlToImage": "https://room.eu.com/images/contents/SgrAWithStars.jpg", "publishedAt": "2021-12-17T14:35:20Z", "content": "By making the most precise measurements yet of the motions of stars around Sagittarius A*, the supermassive black hole at the centre of the Milky Way, astronomers have calculated that a staggering 99… [+3308 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "A sublime landscape: New model explains Pluto’s lumpy plains - Ars Technica", "description": "The convection thought to drive the area's geology may come from cooling, not heat.", "url": "https://arstechnica.com/science/2021/12/a-sublime-landscape-new-model-explains-plutos-lumpy-plains/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/12/nh-mountainousshorline-760x380.jpg", "publishedAt": "2021-12-17T13:21:41Z", "content": "Enlarge/ The polygons of Sputnik Planitium.\r\n14 with 11 posters participating\r\nExpectations for active geology on Pluto were pretty low prior to the arrival of the New Horizons probe. But the photos … [+4640 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "ESA successfully tested the largest parachute set to fly on Mars - BollyInside", "description": "“Both parachutes deployed and flew beautifully,” says Thierry Blancquaert, ESA Exomars program team leader. “We maximized the lessons learned from all", "url": "https://www.bollyinside.com/news/esa-successfully-tested-the-largest-parachute-set-to-fly-on-mars", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-12-17T12:38:25Z", "content": "Both parachutes deployed and flew beautifully, says Thierry Blancquaert, ESA Exomars program team leader. We maximized the lessons learned from all previous tests, and with this double success follow… [+2412 chars]"}]}