{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "Earth’s magnetic field broke down 42,000 years ago, triggering extinctions & climate crisis - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/earths-magnetic-field-broke-down-42000-years-ago-triggering-extinctions-climate-crisis/608655/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/02/magnetic-field.jpg", "publishedAt": "2021-02-21T03:32:06Z", "content": "New Australian study reveals turning point in Earth’s history\r\nRings on ancient trees in New Zealand have revealed that the Earth’s magnetic field temporarily broke down 42,000 years ago, sparking ma… [+6204 chars]"}, {"source": {"id": null, "name": "SocialNews.XYZ"}, "author": "https://www.facebook.com/socialnewsxyz/", "title": "ISS launch honors 'Hidden Figures' mathematician (Video) - Social News XYZ", "description": "A space station supply ship named after the Black NASA mathematician featured in the movie Hidden Figures rocketed into orbit Saturday, the 59th anniversary of John Glenn's historic launch. (Feb. 20) Subscribe for more Breaking... - Social News XYZ", "url": "https://www.socialnews.xyz/?p=3394714", "urlToImage": "https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2017/11/16/font_previewd.png?fit=487%2C70&quality=80&zoom=1&ssl=1", "publishedAt": "2021-02-20T20:46:34Z", "content": "A space station supply ship named after the Black NASA mathematician featured in the movie Hidden Figures rocketed into orbit Saturday, the 59th anniversary of John Glenn's historic launch. (Feb. 20)… [+385 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ani", "title": "Winter carnival kick starts in J&K’s Pahalgam to promote tourism, entrepreneurship - Yahoo India News", "description": "Pahalgam (J&K), Feb 20 (ANI): Two day winter carnival festival kick started in Jammu and Kashmir’s Pahalgam on February 20. Famous for its scenic beauty...", "url": "https://in.news.yahoo.com/winter-carnival-kick-starts-j-173014666.html", "urlToImage": "https://s.yimg.com/hd/cp-video-transcode/prod/2021-02/20/6031485bb2bd3f66c7062dc9/6031486b71e1bf0001c35a9c_1920x1080_FES_v1.jpg", "publishedAt": "2021-02-20T17:30:14Z", "content": "Pahalgam (J&amp;K), Feb 20 (ANI): Two day winter carnival festival kick started in Jammu and Kashmirs Pahalgam on February 20. Famous for its scenic beauty, Pahalgam is taking a step forward to promo… [+484 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Decode How Mars May Have Lost Its Atmosphere - NDTV", "description": "Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belief that planets need a protective magnetic field to block such harmful radiations in order to sustain life.", "url": "https://www.ndtv.com/india-news/scientists-decode-how-mars-may-have-lost-its-atmosphere-2374968", "urlToImage": "https://c.ndtvimg.com/2021-02/entffq_mars_625x300_14_February_21.jpg", "publishedAt": "2021-02-20T14:48:22Z", "content": "Scientists Decode How Mars May Have Lost Its Atmosphere\r\nNew Delhi: Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belie… [+2057 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "First black hole ever detected is more massive than we thought - Tech Explorist", "description": "The research shows the system known as Cygnus X-1 contains the most massive stellar-mass black hole ever detected without the use of gravitational waves.", "url": "https://www.techexplorist.com/first-black-hole-ever-detected-massive-thought/37878/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/Cygnus-X-1-system.jpg", "publishedAt": "2021-02-20T07:11:51Z", "content": "Cygnus X-1 is a stellar-mass black hole- one of the closest black holes to Earth. Discovered in 1964, the object gathered the attention of a famous scientific wager between physicists Stephen Hawking… [+2743 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robin A. Smith", "title": "Time-lapse reveals the hidden dance of roots - Phys.org", "description": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a camera on rice seeds sprouting in clear gel, taking a new p…", "url": "https://phys.org/news/2021-02-time-lapse-reveals-hidden-roots.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/plantroots.jpg", "publishedAt": "2021-02-19T22:23:29Z", "content": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a… [+4705 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Mapping solar magnetic fields from the photosphere to the base of the corona - Science Advances", "description": "Routine ultraviolet imaging of the Sun’s upper atmosphere shows the spectacular manifestation of solar activity; yet, we remain blind to its main driver, the magnetic field. Here, we report unprecedented spectropolarimetric observations of an active region pl…", "url": "https://advances.sciencemag.org/content/7/8/eabe8406.full", "urlToImage": "https://advances.sciencemag.org/content/7/8/eabe8406/F1.large.jpg", "publishedAt": "2021-02-19T18:56:42Z", "content": "INTRODUCTION\r\nThe chromosphere is a very important region of the solar atmosphere, with an extension of several thousand kilometers, located between the relatively cool surface layers of the photosph… [+16696 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}