{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "Curiosity Finds a Martian Flower - NASA Jet Propulsion Laboratory", "description": "Smaller than a penny, the flower-like rock artifact on the left was imaged by NASA's Curiosity Mars rover using its Mars Hand Lens Imager (MAHLI) camera on the end of its robotic arm.", "url": "https://www.jpl.nasa.gov/images/pia25077-curiosity-finds-a-martian-flower", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/images/jpegPIA25077.width-1024.jpg", "publishedAt": "2022-03-01T23:36:50Z", "content": "Smaller than a penny, the flower-like rock artifact on the left was imaged by NASA's Curiosity Mars rover using its Mars Hand Lens Imager (MAHLI) camera on the end of its robotic arm. The image was t… [+922 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Michael Sheetz", "title": "NASA's massive moon rocket will cost taxpayers billions more than projected, auditor warns Congress - CNBC", "description": "The cost per mission of NASA's lunar program Artemis has climbed to more than $4 billion, the agency's auditor told Congress.", "url": "https://www.cnbc.com/2022/03/01/nasa-auditor-warns-congress-artemis-missions-sls-rocket-billions-over-budget.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107022975-1646155064507-51503244051_4ed6d71d67_k.jpg?v=1646155582", "publishedAt": "2022-03-01T21:07:00Z", "content": "To the moon, indeed.\r\nNASA's auditor didn't mince words when he told lawmakers Tuesday that the space agency's lunar program is going to cost a ton more per mission than initial projections suggested… [+3956 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Ukraine gets Starlink internet terminals; Scientists propose Tyrannosaurus had three species, not just 'rex' and more - Devdiscourse", "description": "Fedorov's tweet included a picture of the back of a military-looking truck, loaded with terminals.  Modified T cells may help those on immunosuppressants; ECMO machines improve COVID survival  The following is a summary of some recent studies on COVID-19.", "url": "https://www.devdiscourse.com/article/science-environment/1944108-science-news-roundup-ukraine-gets-starlink-internet-terminals-scientists-propose-tyrannosaurus-had-three-species-not-just", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_03_2022_09_32_55_1991422.jpg?width=920&format=jpeg", "publishedAt": "2022-03-01T21:03:35Z", "content": "Following is a summary of current science news briefs.\r\nScientists propose Tyrannosaurus had three species, not just 'rex'\r\nA group of researchers is proposing that Tyrannosaurus, the most famous of … [+2960 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "Ultra-Windy Venus Powered By A Searing Hot Surface, Study Says - Forbes", "description": "The hellscape of Venus is creating some interesting effects in the planet’s upper atmosphere, a new study reports.", "url": "https://www.forbes.com/sites/elizabethhowell1/2022/03/01/ultra-windy-venus-powered-by-a-searing-hot-surface-study-says/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/61683652de997e1c12e044fa/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-03-01T21:00:52Z", "content": "A computer simulation of the surface of the planet Venus.\r\nGetty Images\r\nThe hellscape of Venus is creating some interesting effects in the planets upper atmosphere, a new study reports.\r\nSurface tem… [+2155 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Balkanatolia: Forgotten Continent Discovered by Team of Paleontologists and Geologists - SciTechDaily", "description": "Balkanatolia: The Forgotten Continent That Sheds Light on the Evolution of Mammals A team of geologists and paleontologists has discovered that, some 50 million years ago, there was a low-lying continent separating Europe from Asia that they have named Balkan…", "url": "https://scitechdaily.com/balkanatolia-forgotten-continent-discovered-by-team-of-paleontologists-and-geologists/", "urlToImage": "https://scitechdaily.com/images/Balkanatolia-Map.jpg", "publishedAt": "2022-03-01T19:40:08Z", "content": "Map showing Balkanatolia 40 million years ago and at the present day. Balkanatolia is a forgotten low-lying continent wedged between Europe, Africa, and Asia, already in existence 50 million years ag… [+5590 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "pathri rajasekhar", "title": "ISRO scientists study Solar Corona using Mars Orbiter Mission - Deccan Chronicle", "description": "The scientists utilised the solar conjunction event, when the Earth and Mars are on the opposite sides of the Sun", "url": "https://www.deccanchronicle.com/science/science/020322/isro-scientists-study-solar-corona-using-mars-orbiter-mission.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/c54036d054c7c8253415ffcdfe34e2a9058cc7a4-tc-img-preview.jpg", "publishedAt": "2022-03-01T19:30:00Z", "content": "Nellore: A team of scientists from different units of ISRO used ‘S-band’ radio signals from Mangalyaan, the Indian Mars orbiter, to study the solar corona —  the layer of the Sun that extends million… [+3138 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "A lot of plant genes actually come from bacteria. And this may explain the success of early land plants - ZME Science", "description": "Even the genes that make us shed tears when cutting onions are bacterial in origin.", "url": "https://www.zmescience.com/science/plant-genes-from-bacteria/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/03/evolution-of-land-plants-696x398-1.jpg", "publishedAt": "2022-03-01T19:15:14Z", "content": "The evolution of land plants (simplified). Around 500 million years ago land plants started to spread from water to land. Credit: IST Austria.\r\nWhen we think of gene transfer, the first thing that po… [+5607 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "NASA's NuSTAR makes illuminating discoveries with 'nuisance' light - Phys.org", "description": "For almost 10 years, NASA's NuSTAR (Nuclear Spectroscopic Telescope Array) X-ray space observatory has been studying some of the highest-energy objects in the universe, such as colliding dead stars and enormous black holes feasting on hot gas. During that tim…", "url": "https://phys.org/news/2022-03-nasa-nustar-illuminating-discoveries-nuisance.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasas-nustar-makes-ill.jpg", "publishedAt": "2022-03-01T18:25:07Z", "content": "For almost 10 years, NASA's NuSTAR (Nuclear Spectroscopic Telescope Array) X-ray space observatory has been studying some of the highest-energy objects in the universe, such as colliding dead stars a… [+6113 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Afterglow of a possible kilonova explosion creates a buzz - WION", "description": "Scientists are reporting a glow of X-Ray after a mega collision between two neutron stars. The strange glow is visible more than three years after the collision that resulted in what is called kilonova explosion. This X-Ray glow has been called \"uncharted ter…", "url": "https://www.wionews.com/science/afterglow-of-a-possible-kilonova-explosion-creates-a-buzz-457939", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/01/244432-kilonova.jpg", "publishedAt": "2022-03-01T18:15:47Z", "content": "Scientists are reporting a glow of X-Ray after a mega collision between two neutron stars. The strange glow is visible more than three years after the collision that resulted in what is called kilono… [+1353 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Ryan Dinsdale", "title": "Venus Drones, Sun-Powered Ships and More: NASA Announces Funding for Sci-Fi Like Projects - IGN - IGN", "description": "NASA has announced funding for research into 17 science fiction-esque projects aimed to advance the possibilities of space exploration, including drones to explore Venus, asteroid destroying technology, and more.", "url": "https://www.ign.com/articles/venus-drones-sun-powered-ships-nasa-announces-funding-for-sci-fi-like-projects", "urlToImage": "https://assets1.ignimgs.com/thumbs/userUploaded/2017/3/14/36190303nasa-astronautjpg-a80706-1280w-14891787979101280w-1489520117182.jpg?width=1280", "publishedAt": "2022-03-01T17:53:34Z", "content": "NASA has announced funding for research into 17 science fiction-esque projects aimed to advance the possibilities of space exploration, including drones to explore Venus, asteroid destroying technolo… [+3449 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "What's happening in the depths of distant worlds? - Phys.org", "description": "The physics and chemistry that take place deep inside our planet are fundamental to the existence of life as we know it. But what forces are at work in the interiors of distant worlds, and how do these conditions affect their potential for habitability?", "url": "https://phys.org/news/2022-03-depths-distant-worlds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/whats-happening-in-the.jpg", "publishedAt": "2022-03-01T17:51:50Z", "content": "The physics and chemistry that take place deep inside our planet are fundamental to the existence of life as we know it. But what forces are at work in the interiors of distant worlds, and how do the… [+4209 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "2 monster black holes are headed toward a collision that will rock the fabric of space-time - Livescience.com", "description": "The two black holes will merge about 10,000 years from now and ripple the fabric of space-time in the process.", "url": "https://www.livescience.com/supermassive-black-hole-merger", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S2U45A6mo2LaHsjdejVBkP-1200-80.jpeg", "publishedAt": "2022-03-01T17:50:14Z", "content": "Astronomers have discovered two supermassive black holes\r\n that are 99% of the way to a violent collision that will rock the very fabric of space-time\r\n.\r\nThe black holes, which share the name PKS 21… [+3469 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "Ingenuity Helicopter Reaches 20th Flight On Mars - Forbes", "description": "We’ve now flown on the Red Planet 20 times over.", "url": "https://www.forbes.com/sites/elizabethhowell1/2022/03/01/ingenuity-helicopter-reaches-20th-flight-on-mars/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/621e530b2cec38c680057f00/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-03-01T17:16:12Z", "content": "Ingenuity during its 20th flight on Mars on Feb. 25, 2022.\r\nNASA/JPL-Caltech\r\nWeve now flown on the Red Planet 20 times over.\r\nSoaring above the surface of Jezero Crater, the plucky Ingenuity drone h… [+2086 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope plans probe of massive star radiation - Space.com", "description": "The pressure blasts away gas and dust, greatly affecting the stars' local environment.", "url": "https://www.space.com/james-webb-space-telescope-massive-star-radiation-probe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eL8Dd3C4LKEw2wMRtvDrxd-1200-80.png", "publishedAt": "2022-03-01T16:56:48Z", "content": "The James Webb Space Telescope will zero in on a portion of the famous Orion Nebula, the closest region of mass star-formation to Earth, to learn more about how massive young stars shape their enviro… [+5851 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Surprising semiconductor properties revealed with innovative new method - Nanowerk", "description": "A research team probing the properties of a semiconductor combined with a novel thin oxide film have observed a surprising new source of conductivity from oxygen atoms trapped inside.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=59921.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id59921.jpg", "publishedAt": "2022-03-01T15:47:29Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Freiburg: New finding in astronomy: black hole spins on its side - India Education Diary", "description": "Scientist Prof. Dr. Svetlana Berdyugina, Professor of Astrophysics at the University of Freiburg and Director of the Leibniz Institute for Solar Physics (KIS), together with an international team of astronomers, has reliably measured for the first ti", "url": "https://indiaeducationdiary.in/university-of-freiburg-new-finding-in-astronomy-black-hole-spins-on-its-side/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/1519797914815-1-1024x683.jpg", "publishedAt": "2022-03-01T15:37:21Z", "content": "Scientist Prof. Dr. Svetlana Berdyugina, Professor of Astrophysics at the University of Freiburg and Director of the Leibniz Institute for Solar Physics (KIS), together with an international team of … [+2606 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Oliver Milman", "title": "Bees can play soccer – 10 little-known facts about insects - The Guardian", "description": "If the climate crisis leads to an insect die-off, human life will be less livable – and more boring", "url": "https://amp.theguardian.com/environment/2022/mar/01/insect-crisis-book-climate-bees-moths-roaches-flies-facts", "urlToImage": null, "publishedAt": "2022-03-01T15:06:00Z", "content": "Climate crisisIf the climate crisis leads to an insect die-off, human life will be less livable and more boring\r\nThe labyrinthine world of insects is in deep trouble. Scientists have uncovered startl… [+8795 chars]"}, {"source": {"id": null, "name": "seattlepi.com"}, "author": "Paul Hayne", "title": "A rocket is going to crash into the Moon – the accidental experiment will shed light on the physics of impacts in space - Seattle PI", "description": "(The Conversation is an independent and nonprofit source of news, analysis and commentary...", "url": "https://www.seattlepi.com/news/article/A-rocket-is-going-to-crash-into-the-Moon-the-16967637.php", "urlToImage": "https://www.seattlepi.com/img/pages/article/opengraph_default.png", "publishedAt": "2022-03-01T14:03:33Z", "content": "(The Conversation is an independent and nonprofit source of news, analysis and commentary from academic experts.)(THE CONVERSATION) On March 4, 2022, a lonely, spent rocket booster will smack into th… [+6737 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Researchers Discover Additional Use of Hydrogels: Extracting Freshwater from Air - AZoCleantech", "description": "Hydrogels exhibit an astonishing potential to swell and consume water. On a daily basis, they are utilized in nappies, dressings, and more to lock moisture away.", "url": "https://www.azocleantech.com/news.aspx?newsID=31234", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31234_16461347220194477.png", "publishedAt": "2022-03-01T13:55:00Z", "content": "Hydrogels exhibit an astonishing potential to swell and consume water. On a daily basis, they are utilized in nappies, dressings and more to lock moisture away.\r\nImage Credit: Angewandte Chemie\r\nAt p… [+3065 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Svetla Ben-Itzhak", "title": "An asteroid impact could wipe out an entire city – a space security expert explains NASA's plans to prevent a potential catastrophe - The Conversation US", "description": "NASA has only mapped 40% of the potentially dangerous asteroids that could crash into Earth. New projects will boost that number, and upcoming missions will test tech that could prevent collisions.", "url": "https://theconversation.com/an-asteroid-impact-could-wipe-out-an-entire-city-a-space-security-expert-explains-nasas-plans-to-prevent-a-potential-catastrophe-177023", "urlToImage": "https://images.theconversation.com/files/447109/original/file-20220217-25-11g19ha.jpg?ixlib=rb-1.1.0&rect=0%2C434%2C5155%2C2573&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-03-01T13:37:02Z", "content": "The Earth exists in a dangerous environment. Cosmic bodies, like asteroids and comets, are constantly zooming through space and often crash into our planet. Most of these are too small to pose a thre… [+7654 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Ukraine Invasion: Joint European-Russian Mars Rover Programme Likely to be Delayed, Says European Space Agency | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Condemning Russia's military invasion into Ukraine last week, the ESA noted that the delay in ExoMars mission is part of the recent sanctions on Russia. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-01-ukraine-invasion-european-russian-mars-rover-mission-delayed", "urlToImage": "https://s.w-x.co/in-mars_7_0.jpg", "publishedAt": "2022-03-01T13:12:07Z", "content": "In the wake of Russia's recent invasion of Ukraine, the joint European and Russian Mars rover programme is likely to be delayed, the European Space Agency (ESA) has said.\r\nThe ESA had been working cl… [+2137 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Tonga volcanic eruption unlikely to significantly affect climate or overwhelm long-term global warming trend: study - Global Times", "description": "A group of Chinese scientists concluded that the eruption of the Tonga volcano so far will not be strong enough to significantly affect the global climate or overwhelm the long-term global warming trend, based on their fresh analysis of the possible cooling e…", "url": "https://www.globaltimes.cn/page/202203/1253631.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-01-18/fdb05978-4375-48d3-a88d-9b492d310e8e.jpeg", "publishedAt": "2022-03-01T12:54:00Z", "content": "Photo taken on Jan.14, 2022 shows the eruption of Hunga Tonga-Hunga Ha'apai volcano in Tonga.(Photo Tonga Geological Services of the Government of Tonga/Xinhua)\r\nA group of Chinese scientists conclud… [+3244 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "New Scientific Tool 83% ‘Accurate’ in Predicting Life or Death of COVID-19 Patients - NewsClick", "description": "A computational tool developed by Yale University scientists can analyse huge amounts of cellular data with more precision.", "url": "https://www.newsclick.in/new-scientific-tool-83-per-accurate-predicting-life-death-COVID-19-patients", "urlToImage": "https://www.newsclick.in/sites/default/files/2022-03/covid19.jpg", "publishedAt": "2022-03-01T11:02:09Z", "content": "COVID-19 led to unprecedented research and exploration across the world. While scientists and researchers have uncovered many crucial aspects of the pathogenicity of the disease and also about the co… [+3972 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Noble false widow spider captures bat in the UK - Daily Mail", "description": "Pipistrelle bats living in a north Shropshire attic were found entangled on the spider's web below the entrance to the roost, researchers in Galway, Ireland, report.", "url": "https://www.dailymail.co.uk/sciencetech/article-10564225/Noble-false-widow-spider-captures-bat-UK.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/01/17/54815459-0-image-a-22_1646156524495.jpg", "publishedAt": "2022-03-01T10:50:01Z", "content": "A false widow spider has been documented eating a bat caught in its web in north Shropshire, in the first sighting of its kind. \r\nThe noble false widow (Steatoda nobilis) is an invasive species of sp… [+8419 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "This NASA astronaut is still due to return home on a Russian rocket - TweakTown", "description": "NASA astronaut Mark Vande Hei is scheduled to return to Earth from the ISS aboard a Russian Soyuz MS-19 spacecraft on March 30th.", "url": "https://www.tweaktown.com/news/84825/this-nasa-astronaut-is-still-due-to-return-home-on-russian-rocket/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84825_01_nasa-astronaut-is-currently-scheduled-to-fly-back-earth-in-russ_full.jpg", "publishedAt": "2022-03-01T10:42:02Z", "content": "NASA astronaut Mark Vande Hei will return home after almost a year-long spaceflight.\r\nVande Hei came aboard the International Space Station (ISS) on April 9th, 2021, and is scheduled to return to Ear… [+925 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Scientists Discovered The Worlds Largest Crater - The Hans India", "description": "Scientists Discover the Worlds Largest Known Crater from the Past 100,000 YearsThe largest impact...", "url": "https://www.thehansindia.com/offbeat/scientists-discovered-the-worlds-largest-crater-731424", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/03/01/1279343-ci.jpg", "publishedAt": "2022-03-01T10:27:25Z", "content": "ScientistsDiscover the World's Largest Known Crater from the Past 100,000 YearsThe largest impact crater on Earththat originated in the last 100,000 years is a crescent-shaped crater in Northeast Chi… [+2340 chars]"}, {"source": {"id": null, "name": "CTech"}, "author": null, "title": "Despite Russia-Ukraine tensions, Axiom Space mission is “ready to fly” | Ctech - CTech", "description": "“Ax-1 is really a path finder for new commercial opportunities in low-Earth orbit, and the research will lead to space exploration becoming fully commercial,” says Axiom Space Director", "url": "https://www.calcalistech.com/ctechnews/article/s1rlxuox9", "urlToImage": "https://images1.calcalist.co.il/picserver3/crop_images/2021/01/28/1055464/1055464_46_0_569_320_0_large.jpg", "publishedAt": "2022-03-01T10:24:00Z", "content": "12:24, 01.03.22 \r\nWith T-30 days to launch, next-Israeli astronaut Eytan Stibbe along with the rest of his Ax-1 crew are completing their final preparations for takeoff to the International Space Sta… [+3670 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shocking! Asteroid was set to HIT the Earth, says ESA; then THIS happened! - HT Tech", "description": "ESA was tracking an asteroid which was going to hit the Earth! Yes, you read that right. Then suddenly, this happened", "url": "https://tech.hindustantimes.com/tech/news/shocking-asteroid-was-set-to-hit-the-earth-says-esa-then-this-happened-71646126520069.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/01/1600x900/ygy_1637905928669_1646126642735.jpg", "publishedAt": "2022-03-01T09:26:56Z", "content": "In an incident that has left everyone bewildered, an asteroid, which was on course to hit the Earth, has now suddenly changed its course and thereby shocked astronomers. Apparently, the asteroid was … [+2431 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain", "title": "Researchers Control Venus Flytrap with Artificial Neurons - The Debrief", "description": "Swedish researchers have developed organic artificial neurons, aka nerve cells, capable of communicating directly with a biological system.", "url": "https://thedebrief.org/researchers-control-venus-flytrap-with-artificial-neurons/", "urlToImage": "https://thedebrief.org/wp-content/uploads/2022/02/venus-flytrap-g0f78d372b_1280-crop-RESIZE.jpg", "publishedAt": "2022-03-01T07:28:57Z", "content": "Swedish researchers have developed organic artificial neurons, aka nerve cells, capable of communicating directly with a biological system. In this case, the system the researchers interfaced with is… [+3367 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Bengaluru Researchers Disprove Claims Of Radio Signals From Universe's First Stars - Indiatimes.com", "description": "Researchers from Bengaluru’s Raman Research Institute (RRI) claim to have refuted the discovery of the birth of the first stars by Arizona State University and MIT researchers, according to a TOI report.                        NASAAlso Read: Indian Scientists…", "url": "https://www.indiatimes.com/technology/science-and-future/raman-institute-radio-signals-from-cosmic-dawn-by-asu-mit-563262.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/Facebook-Image---2022-03-01T113429435_621db9e5dc953.jpg", "publishedAt": "2022-03-01T06:30:31Z", "content": "Researchers from Bengalurus Raman Research Institute (RRI) claim to have refuted the discovery of the birth of the first stars by Arizona State University and MIT researchers, according to a TOI repo… [+2531 chars]"}, {"source": {"id": null, "name": "Distractify"}, "author": "Chris Barilla", "title": "What Happens if the ISS Crashes? Will Anyone Be Impacted? - Distractify", "description": "What happens if the ISS crashes down into Earth? The worry is increasing due to tense relations with Russia in 2022.", "url": "https://www.distractify.com/p/what-happens-if-the-iss-crashes", "urlToImage": "https://media.distractify.com/brand-img/SoNvSWJtK/1200x628/iss-1646070497017.jpg", "publishedAt": "2022-02-28T22:16:18Z", "content": "However, some questions have arisen about its future in 2022, namely due to the ongoing tensions between NATO allies and Russia over President Vladimir Putin's decision to invade neighboring Ukraine … [+1894 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "MRI Images Epigenetics in the Brain - Neuroscience News", "description": "Researchers have developed a new imaging approach that captures DNA methylation in the brain.", "url": "https://neurosciencenews.com/brain-epigenetics-mri-20118/", "urlToImage": "https://neurosciencenews.com/files/2022/02/mri-epigenetics-neurosinces-public.jpg", "publishedAt": "2022-02-28T21:40:27Z", "content": "Summary: Researchers have developed a new imaging approach that captures DNA methylation in the brain.\r\nSource: University of Illinois\r\nA multidisciplinary team at the University of Illinois Urbana-C… [+6739 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Promotes Howard Hu to Lead Orion Ahead of First Artemis Mission - NASA", "description": "NASA has selected Howard Hu as the Orion Program manager, based at the agency’s Johnson Space Center in Houston.", "url": "https://www.nasa.gov/press-release/nasa-promotes-howard-hu-to-lead-orion-ahead-of-first-artemis-mission/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/howard_hu_official_photo_jsc2022e010900.jpg", "publishedAt": "2022-02-28T20:35:36Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "China's moon rover spots 2 strange glass spheres on far side - Space.com", "description": "Still stranger, the glass is translucent.", "url": "https://www.space.com/china-moon-rover-finds-strange-glass-spheres", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hcvyS9csVEvKCGGPCYbCV9-1200-80.jpg", "publishedAt": "2022-02-28T19:51:01Z", "content": "China's Yutu 2 rover has made yet another curious discovery during its travels on the far side of the moon, this time turning up a pair of translucent glass globules.\r\nThe rover's panoramic camera sp… [+3210 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Cristian Antonescu", "title": "Astronomers Find Planet Revolving Around Two Stars Simultaneously - Optic Flux", "description": "Imagine a world where the 'Fear of the Dark' song by Iron Maiden doesn't have any meaning to you, as night doesn't exist anymore. Although that's a magnificent song that reveals the inner fear that many of us have, surely we would do fine without the presence…", "url": "https://www.opticflux.com/astronomers-find-planet-revolving-around-two-stars-simultaneously/16294/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/08/milky-way-1023340_1920.jpg", "publishedAt": "2022-02-28T19:07:16Z", "content": "Imagine a world where the ‘Fear of the Dark’ song by Iron Maiden doesn’t have any meaning to you, as night doesn’t exist anymore. Although that’s a magnificent song that reveals the inner fear that m… [+1676 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A Houston area company made an airlock for the space station. NASA is using it to dump garbage. - BollyInside", "description": "“Trash is a real problem,” said Brock Howe, the airlock’s project manager at Webster-based Nanoracks. PRIOR TO LAUNCH: How do you ship a brand-new airlock", "url": "https://www.bollyinside.com/news/a-houston-area-company-made-an-airlock-for-the-space-station-nasa-is-using-it-to-dump-garbage", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T17:38:24Z", "content": "Trash is a real problem, said Brock Howe, the airlocks project manager at Webster-based Nanoracks. PRIOR TO LAUNCH: How do you ship a brand-new airlock destined for the Space Station? Very carefully.… [+2694 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's new Venus-exploring drone idea is like out of a sci-fi story; know all about it - Republic World", "description": "NASA has unveiled a number of new ideas that include an inflatable bird-like drone for Venus, artificial gravity habitats, cave-exploring robots and more.", "url": "https://www.republicworld.com/science/space/nasas-new-venus-exploring-drone-idea-is-like-out-of-a-sci-fi-story-know-all-about-it-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/3qv2omydlxfxgjgw_1646061865.jpeg", "publishedAt": "2022-02-28T15:54:00Z", "content": "In the latest announcement of futuristic technologies for planetary exploration, NASA has unveiled the idea of an inflatable bird-like drone that could unlock the mysteries of Venus. While the idea c… [+2523 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Tom Sanders", "title": "Experts Claim That Pharoah Tutankanhmun's Dagger 'Came From Outer Space' - LADbible", "description": "The mysterious origins of King Tutankhamun’s iron dagger has been one of Ancient Egypt's biggest unsolved mysteries.", "url": "https://www.ladbible.com/news/pharaoh-tutenkhamun-ancient-egypt-dagger-iron-anatolia-space-20220228", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&dpr=1&url=https://eu-images.contentstack.com/v3/assets/bltcd74acc1d0a99f3a/blteb73054dd30307ca/621ce5ec196b9f7a8b1fa0d9/Screenshot_2022-02-28_at_14.11.15.png", "publishedAt": "2022-02-28T15:24:41Z", "content": "Scientists claim to have cracked an ancient mystery surrounding a dagger that belonged to King Tutankhamun over 3,400 years ago, saying that materials used to create the weapon may have come from out… [+2960 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pinpointing the Moon's South Pole - NASA Goddard", "description": "This video is a data visualization showing the location of the Moon’s South Pole. In the system of lunar latitude and longitude adopted by the Lunar Reconnai...", "url": "https://www.youtube.com/watch?v=HUMLpSknWj8", "urlToImage": "https://i.ytimg.com/vi/HUMLpSknWj8/hqdefault.jpg", "publishedAt": "2022-02-28T14:59:50Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sara Cody", "title": "ISS experiments to find solutions for cleaning up orbital debris and repairing damaged satellites - Phys.org", "description": "In 2002, the European Space Agency launched Envisat, the largest civilian satellite (at the time) to go to low Earth orbit (LEO). For a decade, it observed our planet and sent back valuable data on Earth's climate, tracking the decline of Arctic sea ice and m…", "url": "https://phys.org/news/2022-02-iss-solutions-orbital-debris-satellites.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/iss-experiments-demons.jpg", "publishedAt": "2022-02-28T13:16:11Z", "content": "In 2002, the European Space Agency launched Envisat, the largest civilian satellite (at the time) to go to low Earth orbit (LEO). For a decade, it observed our planet and sent back valuable data on E… [+10944 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA aims to snap 1st image of Jupiter-like planet using Nancy Grace Roman Space Telescope - Republic World", "description": "NASA is constructing a new observatory, Nancy Grace Roman Space Telescope, through which it aims to photograph worlds and dusty disks around nearby stars.", "url": "https://www.republicworld.com/science/space/nasa-aims-to-snap-1st-image-of-jupiter-like-planet-using-nancy-grace-roman-space-telescope-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/3eofabld02zswlam_1646051347.jpeg", "publishedAt": "2022-02-28T12:38:00Z", "content": "NASA is constructing a new observatory named the Nancy Grace Roman Space Telescope, through which it aims to photograph worlds and dusty disks around nearby stars. While the telescope is expected to … [+2309 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope stacks 18 starlights to produce one unified image; See here - Republic World", "description": "NASA said that Webb's mirrors are still working as 18 small and individual telescopes instead of one, something which calls for lining up of the mirror segments", "url": "https://www.republicworld.com/science/space/james-webb-space-telescope-stacks-18-starlights-to-produce-one-unified-image-see-here-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/goy6lsq8bydmggcn_1646047266.jpeg", "publishedAt": "2022-02-28T11:54:00Z", "content": "The James Webb Space Telescope has inched closer to being a completely focussed observatory as engineers have successfully completed the third phase of the mirror alignment process. In its latest ach… [+1887 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "'Pale blue dot': Spot Earth if you can in this iconic pic taken by NASA's Cassini probe - Republic World", "description": "NASA had said that the Cassini mission, launched in October 1997, was one of the most ambitious efforts in planetary space exploration ever. Know details here.", "url": "https://www.republicworld.com/science/space/pale-blue-dot-spot-earth-if-you-can-in-this-iconic-pic-taken-by-nasas-cassini-probe-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/1g2lc1jlp00zo14q_1646043900.jpeg", "publishedAt": "2022-02-28T10:52:00Z", "content": "NASAs Cassini mission was one of its most ambitious ones, wherein it sent a spacecraft past the biggest planet of our solar system, Jupiter, all the way to Saturn. During 13 long years of its operati… [+1930 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Gene that allows humans to feel touch plays role in sense of smell: Study - ANI News", "description": "Texas [US], February 28 (ANI): The gene that makes us get drawn to the wonderful smell of rose is also responsible for the sense of prick we feel when we accidentally touch the thorns. Researchers from SMU (Southern Methodist University) have determined that …", "url": "https://www.aninews.in/news/science/gene-that-allows-humans-to-feel-touch-plays-role-in-sense-of-smell-study20220228161230", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Rosseeeeeeee2022022809281220220228104219-thumbnail-154x87-70.jpg", "publishedAt": "2022-02-28T10:42:00Z", "content": "ANI | Updated: Feb 28, 2022 16:12 IST\r\nTexas [US], February 28 (ANI): The gene that makes us get drawn to the wonderful smell of rose is also responsible for the sense of prick we feel when we accide… [+5463 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA is \"evaluating\" a May launch for the Artemis I mission - BollyInside", "description": "“April’s not a possibility,” Tom Whitmeyer, NASA’s deputy associate administrator for exploration systems development, said in a briefing on Thursday, per", "url": "https://www.bollyinside.com/news/nasa-is-evaluating-a-may-launch-for-the-artemis-i-mission", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T10:18:23Z", "content": "Aprils not a possibility, Tom Whitmeyer, NASAs deputy associate administrator for exploration systems development, said in a briefing on Thursday, per CNET. Were still evaluating the tail end of May.… [+1034 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Examines Last Day of Dinosaurs - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Dinosaurs have been extinct for over 65 million years and yet, questions still surround as to how massive creatures like them became extinct to such an extent that not even a trace of them is left now. S…", "url": "https://www.latestly.com/agency-news/science-news-study-examines-last-day-of-dinosaurs-3416420.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/dinooooo_main2022022808300120220228085842-588x441.jpg", "publishedAt": "2022-02-28T09:12:24Z", "content": "Uppsala [Sweden], February 28 (ANI): Dinosaurs have been extinct for over 65 million years and yet, questions still surround as to how massive creatures like them became extinct to such an extent tha… [+4435 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Two distant galaxies appear to overlap in latest Hubble image - Devdiscourse", "description": "Read more about Two distant galaxies appear to overlap in latest Hubble image on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1941096-two-distant-galaxies-appear-to-overlap-in-latest-hubble-image", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2022_13_57_51_8175628.jpg?width=920&format=jpeg", "publishedAt": "2022-02-28T08:40:02Z", "content": "The twin galaxies NGC 4496A and NGC 4496B appear to overlap in a new image shared by the European Space Agency (ESA) and captured by the NASA/ESA Hubble Space Telescope.\r\nDespite their side-by-side a… [+1227 chars]"}, {"source": {"id": null, "name": "Beam.land"}, "author": "Izer", "title": "The New Space Race to the Moon Is Really the Go to Mars and Beyond - BEAM Media", "description": "meIn 1961, US President John F. Kennedy said his nation would be the first to land on the moon. This ambitious goal would later be achieved when two NASA", "url": "https://beam.land/the-new-space-race-to-the-moon-is-really-the-go-to-mars-and-beyond/", "urlToImage": "https://beam.land/wp-content/uploads/2022/02/The-New-Space-Race-to-the-Moon-Is-Really-the.jpeg", "publishedAt": "2022-02-28T08:32:21Z", "content": "meIn 1961, US President John F. Kennedy said his nation would be the first to land on the moon. This ambitious goal would later be achieved when two NASA astronauts wobbly strides across the lunar su… [+9716 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "What would happen if a solar storm hit Earth - Sprout Wired", "description": "An impressive and unique image of the biggest Solar flare already captured Solar Orbiter Probe, the result of a joint...", "url": "https://www.sproutwired.com/what-would-happen-if-a-solar-storm-hit-earth/", "urlToImage": null, "publishedAt": "2022-02-28T08:32:12Z", "content": "An impressive and unique image of the biggest Solar flare already captured Solar Orbiter Probe, the result of a joint project between ESA (European Space Agency) and NASA (US National Aeronautics and… [+2390 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "New Epigenetic Mark Found in Rotifer Was Captured from Bacteria 60 mya - Genetic Engineering & Biotechnology News", "description": "New findings show how a horizontally transferred gene can become part of a complex regulatory system maintained by selection over tens of millions of years of evolution.", "url": "https://www.genengnews.com/topics/omics/new-epigenetic-mark-identified-in-animal-was-captured-from-bacteria-60-million-years-ago/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/02/low-res-3-1.png", "publishedAt": "2022-02-28T08:00:03Z", "content": "DNA carries the blueprint for building bodies, but its a living document: Adjustments to the design can be made by epigenetic marks. In humans and other eukaryotes, two principal epigenetic marks are… [+7537 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "What happened to the Kepler space telescope? - BollyInside", "description": "Overall, even though it is now gone, the Kepler mission was a huge success that set the stage for the study of exoplanets that blossoms today. “As NASA’s", "url": "https://www.bollyinside.com/news/what-happened-to-the-kepler-space-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T07:18:21Z", "content": "Overall, even though it is now gone, the Kepler mission was a huge success that set the stage for the study of exoplanets that blossoms today. As NASAs first planet-hunting mission, Kepler has wildly… [+824 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists observed another mechanism driving Saturn’s Auroras - Tech Explorist", "description": "The study is based on observations made with the W. M. Keck Observatory on Maunakea, Hawaiʻi Island.", "url": "https://www.techexplorist.com/scientists-observed-another-mechanism-driving-saturns-auroras/45019/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/02/saturns-aurora.jpg", "publishedAt": "2022-02-28T06:53:01Z", "content": "Like Earth, auroras also happen to other planets. At Saturn, it’s all very different. As the planet’s atmosphere is dominated by hydrogen, Saturn’s auroral displays can only be seen in ultraviolet li… [+5182 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Hidden Turbulence in The Atmosphere of The Sun Revealed by New AI Model - ScienceAlert", "description": "Hidden turbulent motion that takes place inside the atmosphere of the Sun can be accurately predicted by a newly developed neural network.", "url": "https://www.sciencealert.com/a-neural-network-can-find-hidden-turbulence-in-the-atmosphere-of-the-sun", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/solar-granules_1024.jpg", "publishedAt": "2022-02-28T06:14:10Z", "content": "Hidden turbulent motion that takes place inside the atmosphere of the Sun can be accurately predicted by a newly developed neural network.\r\nFed only temperature and vertical motion data collected fro… [+3425 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Clearest View Yet Of Hot Jupiter's Dark Side Obtained. Does 'Exotic Rain' Occur On The Exoplanet? - ABP Live", "description": "Astronomers from Massachusetts Institute of Technology (MIT), Cambridge have obtained the clearest view yet of the perpetual dark side of an exoplanet which is 'tidally locked' to its star.", "url": "https://news.abplive.com/science/clearest-view-yet-dark-side-hot-jupiter-obtained-for-first-time-nasa-exotic-rain-may-occur-on-the-exoplanet-wasp-121b-1515837", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/02/27/622911002c5d2eb597602de8543aaabc_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-02-28T06:03:07Z", "content": "New Delhi: Astronomers from Massachusetts Institute of Technology (MIT), Cambridge have obtained the clearest view yet of the perpetual dark side of an exoplanet which is \"tidally locked\" to its star… [+7207 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Lunar Alignment February 2022 LIVE – Tips for viewing Mars TONIGHT and what other planets you can see without a telescope - BollyInside", "description": "Even though the moon does not become blue in color, the phrase “blue moon” has gained popularity in recent years to denote the second full moon in a", "url": "https://www.bollyinside.com/news/lunar-alignment-february-2022-live-tips-for-viewing-mars-tonight-and-what-other-planets-you-can-see-without-a-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T05:58:22Z", "content": "Even though the moon does not become blue in color, the phrase blue moon has gained popularity in recent years to denote the second full moon in a calendar month. The black moon in April is the polar… [+761 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "SpaceX launches batch of Starlink satellites from California - The Week", "description": "SpaceX has close to 2,000 Starlink satellites orbiting Earth", "url": "https://www.theweek.in/news/sci-tech/2022/02/28/spacex-launches-batch-of-starlink-satellites-from-california.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/images/2022/1/1/SpaceX-Falcon-9-rocket-lifting-off-from-Cape-Canaveral-ap.jpg", "publishedAt": "2022-02-28T05:48:00Z", "content": "A SpaceX Falcon 9 rocket blasted off from California on Friday and carried 50 more satellites into orbit for the Starlink internet constellation.\r\nA SpaceX webcast showed the rockets upper stage depl… [+622 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "How space weather affects radio communication and navigation satellites - BollyInside", "description": "Space weather refers to activities that occur in the upper layers of the Earth’s atmosphere at altitudes greater than 50 kilometres above the Earth’s", "url": "https://www.bollyinside.com/news/how-space-weather-affects-radio-communication-and-navigation-satellites", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T05:38:22Z", "content": "Space weather refers to activities that occur in the upper layers of the Earths atmosphere at altitudes greater than 50 kilometres above the Earths surface. Unlike typical terrestrial rain or snow, s… [+2497 chars]"}, {"source": {"id": null, "name": "Parkmapper.com"}, "author": "Ramona Carter", "title": "Moon meets Mercury and Saturn early Monday morning - ParkMapper", "description": "You may be able to watch the moon block with resonance Saturn transient Mercury Monday (February 28), but it will be quite a challenge.The three worlds", "url": "https://parkmapper.com/moon-meets-mercury-and-saturn-early-monday-morning/", "urlToImage": "https://parkmapper.com/wp-content/uploads/2022/02/Moon-meets-Mercury-and-Saturn-early-Monday-morning.jpg", "publishedAt": "2022-02-28T04:35:18Z", "content": "You may be able to watch the moon block with resonance Saturn transient Mercury Monday (February 28), but it will be quite a challenge.\r\nThe three worlds will gather near the southeast horizon as the… [+2488 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Mars obsession: are two planets better than one to ensure human survival? - BollyInside", "description": "The logic is simple. If humans have established cultures on two planets, the separation between the planets will generally keep a major catastrophe", "url": "https://www.bollyinside.com/news/the-mars-obsession-are-two-planets-better-than-one-to-ensure-human-survival", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-28T01:38:24Z", "content": "The logic is simple. If humans have established cultures on two planets, the separation between the planets will generally keep a major catastrophe including an extinction event on Earthsay, a highly… [+5784 chars]"}]}