{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Guinea baboons grunt with an accent - Phys.org", "description": "Musical masterworks such as the Queen of the Night's Aria from Mozart's The Magic Flute, are examples of the sounds trained human voices can produce. The precondition for vocal virtuosity as well as for any spoken word is vocal learning, the ability to imitat…", "url": "https://phys.org/news/2021-01-guinea-baboons-grunt-accent.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/guineababoon.jpg", "publishedAt": "2021-01-06T17:31:55Z", "content": "Musical masterworks such as the Queen of the Night's Aria from Mozart's The Magic Flute, are examples of the sounds trained human voices can produce. The precondition for vocal virtuosity as well as … [+3180 chars]"}, {"source": {"id": null, "name": "EcoWatch"}, "author": "Olivia Rosane", "title": "More Than Two Degrees of Climate Warming Is Already Locked In, New Study Finds - EcoWatch", "description": "", "url": "https://www.ecowatch.com/greenhouse-gases-paris-agreement-2649767807.html", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNTI2MDkwNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2OTQ3NjE4OH0.ejJnfEGPQ99m2VwY0ICyTA2ziA1WkvruOi1AszLawuE/img.jpg?width=1200&coordinates=0%2C37%2C0%2C38&height=600", "publishedAt": "2021-01-06T17:31:00Z", "content": "Existing greenhouse gases will eventually push the climate into more than two degrees of warming, according to a study published in Nature Climate Change on Monday. \r\nThat number puts the Paris agree… [+2719 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Old silicon learns new tricks - EurekAlert", "description": "Researchers from Nara Institute of Science and Technology fabricated regular arrays of iron-coated silicon crystals that are atomically smooth. The defect-free pyramidal composition of the crystals impart magnetic properties that will enhance the functionalit…", "url": "https://www.eurekalert.org/pub_releases/2021-01/nios-osl010421.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252596_web.jpg", "publishedAt": "2021-01-06T17:03:19Z", "content": "IMAGE: (a) Wide and (b) magnified images of the fabricated Si pyramids. Four slopes correspond to Si{111} facet surfaces.\r\n view more \r\nCredit: Ken Hattori\r\nIkoma, Japan - Ultrasmall integrated circu… [+3601 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers turn coal powder into graphite in microwave oven - EurekAlert", "description": "The University of Wyoming team created an environment in a microwave oven to successfully convert raw coal powder into nano-graphite, which is used as a lubricant and in items ranging from fire extinguishers to lithium ion batteries.", "url": "https://www.eurekalert.org/pub_releases/2021-01/uow-rtc010621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252843_web.jpg", "publishedAt": "2021-01-06T16:59:33Z", "content": "IMAGE: In a microwave oven, sparks are generated inside a glass vial containing coal powder and copper foil as part of an experiment by University of Wyoming researchers. They successfully converted.… [+3523 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Julie Brigham-Grette and Steve Petsch", "title": "The Arctic Hasn't Been This Warm for 3 Million Years - The Wire Science", "description": "Scientists have projected that the Arctic will be completely ice-free in summer within the next two decades.", "url": "https://science.thewire.in/environment/arctic-ocean-climate-warming/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/01/05155029/download.jpeg", "publishedAt": "2021-01-06T16:29:00Z", "content": "Chunks of ice float inside of meltwater pools on top of the Helheim glacier near Tasiilaq, Greenland, June 19, 2018. Photo: Reuters/Lucas Jackson\r\nEvery year, sea ice cover in the Arctic Ocean shrink… [+7930 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Control of osteoblast regeneration by a train of Erk activity waves - Nature.com", "description": "The rate of scale regeneration in zebrafish is controlled by the frequency of rhythmic travelling waves of Erk activity, which are broadcast from a central source to induce ring-like patterns of osteoblast tissue growth.", "url": "https://www.nature.com/articles/s41586-020-03085-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-020-03085-8/MediaObjects/41586_2020_3085_Fig1_HTML.png", "publishedAt": "2021-01-06T16:21:11Z", "content": "<li></li>\r\n1.Gelens, L., Anderson, G. A. &amp; Ferrell, J. E. Jr. Spatial trigger waves: positive feedback gets you a long way. Mol. Biol. Cell25, 34863493 (2014).\r\nPubMed \r\n PubMed Central \r\n Articl… [+9418 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Newly observed monovalent calcium ion displays unexpected metallicity and ferromagnetism - Phys.org", "description": "Calcium ions are present in rocks, bones, shells, biominerals, geological deposits, ocean sediments, and many other important materials. Calcium ions also play major roles in the retention of carbon dioxide in natural waters, water hardness, signal transducti…", "url": "https://phys.org/news/2021-01-newly-monovalent-calcium-ion-unexpected.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/2dcaclcrysta.jpg", "publishedAt": "2021-01-06T16:13:38Z", "content": "Calcium ions are present in rocks, bones, shells, biominerals, geological deposits, ocean sediments, and many other important materials. Calcium ions also play major roles in the retention of carbon … [+3980 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "When Uber and Lyft enter cities, vehicle ownership increases - EurekAlert", "description": "When ridesourcing companies Uber and Lyft show up in urban areas, vehicle registrations per capita increase by 0.7% on average, increasing even more in car-dependent cities. Researchers made this discovery by analyzing data from major US cities between 2011 t…", "url": "https://www.eurekalert.org/pub_releases/2021-01/cp-wua123020.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/252545_web.jpg", "publishedAt": "2021-01-06T16:02:24Z", "content": "IMAGE: This graphical abstract depicts findings for what happens when Uber and Lyft enter U.S. cities.\r\n view more \r\nCredit: Jeremy Michalek\r\nWhen ridesourcing companies Uber and Lyft show up in urba… [+3481 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Proteins engineered to form honeycomb structures can block uptake of receptors from the surface of cells - Phys.Org", "description": "A new class of protein material that interacts with living cells without being absorbed by them can influence cell signaling, a new study shows. The material does this by binding and sequestering cell surface receptors.", "url": "https://phys.org/news/2021-01-proteins-honeycomb-block-uptake-receptors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/designerprot.jpg", "publishedAt": "2021-01-06T16:00:03Z", "content": "A new class of protein material that interacts with living cells without being absorbed by them can influence cell signaling, a new study shows. The material does this by binding and sequestering cel… [+3778 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Astronomers Calculate Universe’s Age With Atacama Desert Telescope - Gizmodo", "description": "High up in Chile’s Atacama Desert, miles away from the dull glow of light pollution, the secluded Atacama Cosmology Telescope is in prime position to search the sky for answers.", "url": "https://gizmodo.com/astronomers-calculate-universe-s-age-with-atacama-deser-1845995635", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hvx3deunwgqrzenjikev.jpg", "publishedAt": "2021-01-06T15:40:00Z", "content": "High up in Chiles Atacama Desert, miles away from the dull glow of light pollution, the secluded Atacama Cosmology Telescope is in prime position to search the sky for answers. The question most rece… [+4792 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Last year reusable rockets entered the mainstream, and there’s no going back - Ars Technica", "description": "\"If Rocket Lab ever builds a new vehicle, it will fundamentally be reusable.\"", "url": "https://arstechnica.com/science/2021/01/last-year-reusable-rockets-entered-the-mainstream-and-theres-no-going-back/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/01/Sirius-XM-B1051-7-Dec-17-2020-2604-760x380.jpg", "publishedAt": "2021-01-06T15:11:00Z", "content": "40 with 32 posters participating\r\n<ul><li>\r\n On December 13, 2020, a Falcon 9 rocket launched the Sirius XM-7 mission. It was the seventh flight for this first stage. \r\n</li><li>\r\n This was the most … [+6860 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A bit too much: Reducing the bit width of Ising models for quantum annealing: Scientists find a way to make Ising models easier to implement physically for solving combinatorial optimization problems - Science Daily", "description": "Quantum annealers are devices that physically implement a quantum system called the 'Ising model' to solve combinatorial optimization problems. However, the coefficients of the Ising model often require a large bit width, making it difficult to implement phys…", "url": "https://www.sciencedaily.com/releases/2021/01/210106095318.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-06T15:03:55Z", "content": "Given a list of cities and the distances between each pair of cities, how do you determine the shortest route that visits each city exactly once and returns to the starting location? This famous prob… [+2873 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Study demonstrates the quenching of an antiferromagnet into high resistivity states - Phys.org", "description": "Antiferromagnetism is a type of magnetism in which parallel but opposing spins occur spontaneously within a material. Antiferromagnets, materials that exhibit antiferromagnetism, have advantageous characteristics that make them particularly promising for fabr…", "url": "https://phys.org/news/2021-01-quenching-antiferromagnet-high-resistivity-states.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/studydemonst.jpg", "publishedAt": "2021-01-06T15:00:01Z", "content": "Antiferromagnetism is a type of magnetism in which parallel but opposing spins occur spontaneously within a material. Antiferromagnets, materials that exhibit antiferromagnetism, have advantageous ch… [+4725 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "California Institute of Technology: A New NASA Space Telescope, SPHEREx, Is Moving Ahead - India Education Diary", "description": "The observatory will map the entire sky to study the rapid expansion of the universe after the big bang, the composition of young planetary systems, and the history of galaxies.NASA’s upcomin…", "url": "https://indiaeducationdiary.in/california-institute-of-technology-a-new-nasa-space-telescope-spherex-is-moving-ahead/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/7dd03851f5008957ef15a1a9ad35146a.jpg?fit=1200%2C387&ssl=1", "publishedAt": "2021-01-06T14:52:00Z", "content": "The observatory will map the entire sky to study the rapid expansion of the universe after the big bang, the composition of young planetary systems, and the history of galaxies.NASA’s upcoming space … [+5807 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Missions to Mars Become Prime Focus for All 2021 Space Explorations - News18", "description": "The year 2021 will usher in some exciting programmes for space exploration after 2020 saw the accomplishment of some major feats.", "url": "https://www.news18.com/news/buzz/missions-to-mars-become-prime-focus-for-all-2021-space-explorations-3253817.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1604219441_untitled-design-2020-11-01t135943.325.png", "publishedAt": "2021-01-06T14:35:25Z", "content": "The year 2021 will usher in some exciting programmes for space exploration after 2020 saw the accomplishment of some major feats. Countries like the United Arab Emirates, China, and the United States… [+4054 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Photos by NASA reveal stunning details of our solar system`s largest canyon - WION", "description": "The Grand Canyon in the US state of Arizona may be huge, but it doesn’t stand a chance against the Martian counterpart. The Valles Marineris Canyon on Mars runs along the equator for over 4023 kilometres (2500 miles). NASA claims that it is so vast that it wo…", "url": "https://www.wionews.com/science/photos-by-nasa-reveal-stunning-details-of-our-solar-systems-largest-canyon-354902", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/01/06/177339-untitled-design-2.jpg, 2017 shows many hills about 1 kilometer high in Juventae Chasma, which is located north of the main Valles Marineris canyon system on Mars. The floor of the canyon is covered by a sea of sand, but the hills rise above the sand.\" typeof=\"foaf:Image\" />", "publishedAt": "2021-01-06T14:31:12Z", "content": "The Grand Canyon in the US state of Arizona may be huge, but it doesnt stand a chance against the Martian counterpart. The Valles Marineris Canyon on Mars runs along the equator for over 4023 kilomet… [+1486 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Brain evolution may have allowed our cognitive process to extend to technology - Phys.org", "description": "Emiliano Bruner, a researcher at the Centro Nacional de Investigación sobre la Evolución Humana (CENIEH), has just published a review article on the evolution of the human brain during the Middle Pleistocene offering a perspective on paleoneurology and functi…", "url": "https://phys.org/news/2021-01-brain-evolution-cognitive-technology.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/5ff5ab0ff0627.jpg", "publishedAt": "2021-01-06T14:30:02Z", "content": "Emiliano Bruner, a researcher at the Centro Nacional de Investigación sobre la Evolución Humana (CENIEH), has just published a review article on the evolution of the human brain during the Middle Ple… [+1610 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lori Dajose", "title": "How an embryo tells time - Phys.org", "description": "It is estimated that the majority of pregnancies that fail do so within the first seven days after fertilization, before the embryo implants into the uterus. In this time period, a complicated cascade of events occurs with precise timing. One particularly imp…", "url": "https://phys.org/news/2021-01-embryo.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/howanembryot.jpg", "publishedAt": "2021-01-06T14:12:58Z", "content": "It is estimated that the majority of pregnancies that fail do so within the first seven days after fertilization, before the embryo implants into the uterus. In this time period, a complicated cascad… [+4800 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "In 774 AD, the Sun blasted Earth with the biggest storm in 10,000 years - SYFY WIRE", "description": "In the year 774 AD, an enormously powerful blast of matter and energy from space slammed into Earth. Nothing like it had been felt on this planet for 10,000 years. A mix of high-energy light and hugely accelerated subatomic particles, when this wave impacted …", "url": "https://www.syfy.com/syfywire/in-774-ad-the-sun-blasted-earth-with-the-biggest-storm-in-10000-years", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/soho_flare_28oct2003.jpg?offset-x=0&offset-y=49", "publishedAt": "2021-01-06T14:00:00Z", "content": "In the year 774 AD, an enormously powerful blast of matter and energy from space slammed into Earth.\r\nNothing like it had been felt on this planet for 10,000 years. A mix of high-energy light and hug… [+5465 chars]"}, {"source": {"id": null, "name": "Business Wire"}, "author": null, "title": "BlackSky Awarded IARPA Contract to Develop Platform for Global Construction Monitoring Using Next Generation Artificial Intelligence - Business Wire", "description": "BlackSky announced an award from the Intelligence Advanced Research Projects Activity for a multi-phase, multi-year research contract.", "url": "https://www.businesswire.com/news/home/20210106005111/en/BlackSky-Awarded-IARPA-Contract-to-Develop-Platform-for-Global-Construction-Monitoring-Using-Next-Generation-Artificial-Intelligence", "urlToImage": "https://mms.businesswire.com/media/20210106005111/en/850322/23/FlamingoBayReleasableWithWatermark.jpg", "publishedAt": "2021-01-06T12:55:00Z", "content": "HERNDON, Va.--(BUSINESS WIRE)--BlackSky, a leading provider of global monitoring services and geospatial insights, today announced an award from the Intelligence Advanced Research Projects Activity (… [+2300 chars]"}, {"source": {"id": null, "name": "Designboom"}, "author": null, "title": "scientists uncover a new state of matter: liquid glass - Designboom", "description": "", "url": "https://www.designboom.com/design/liquid-glass-new-state-of-matter-uncovered-by-scientists-01-06-2021/", "urlToImage": "https://www.designboom.com/wp-content/uploads/2021/01/liquid-glass-new-state-of-matter-uncovered-by-scientists-designboom-1200.jpg", "publishedAt": "2021-01-06T12:31:17Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How and what do bats hear? - Phys.org", "description": "A new study published in Proceedings of the Royal Society B provides the most comprehensive comparative assessment of bat hearing capacity to date and highlights the evolutionary pressures acting on their sensory perception. Scientists from the Museum für Nat…", "url": "https://phys.org/news/2021-01-how-and-what-do-bats.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/howandwhatdo.jpg", "publishedAt": "2021-01-06T12:18:31Z", "content": "A new study published in Proceedings of the Royal Society B provides the most comprehensive comparative assessment of bat hearing capacity to date and highlights the evolutionary pressures acting on … [+3600 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Are primordial black holes really giant gravitinos? - Space.com", "description": "It's a long shot of an idea, but when it comes to the early universe, it's the best we've got.", "url": "https://www.space.com/primordial-black-holes-giant-gravitinos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V4q7tR2uNk9f3Nqfeds2Yn-1200-80.jpg", "publishedAt": "2021-01-06T12:08:00Z", "content": "Paul M. Sutter\r\nis an astrophysicist atSUNY\r\nStony Brook and the Flatiron Institute, host ofAsk a Spaceman\r\nandSpace Radio\r\n, and author of How to Die in Space\r\n. He contributed this article to Space… [+6206 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Missing supermassive black hole at centre of distant galaxy baffles scientists - Sky News", "description": "Researchers detect something highly unusual about bright cluster galaxy A2261-BCG, which could be a \"recoiling\" black hole.", "url": "https://news.sky.com/story/missing-supermassive-black-hole-baffles-scientists-in-centre-of-distant-galaxy-12180505", "urlToImage": "https://e3.365dm.com/19/10/1600x900/skynews-black-hole-istock_4822136.jpg?20191031192605", "publishedAt": "2021-01-06T12:07:47Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Hikers find ghostly 'hair ice' clinging to trees in an Irish forest - Livescience.com", "description": "Hair ice has appeared on rotting trees all over the world, and fungus may be to blame.", "url": "https://www.livescience.com/hair-ice-ireland-fungus.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SUQdAJLEAbkxVTYkobZ57h-1200-80.jpg", "publishedAt": "2021-01-06T12:00:00Z", "content": "Hikers in Ireland were strolling among the frosty trees last week when they stumbled into what looked like an enchanted candy forest. White wisps of fluffy frost bloomed from tree branches like cotto… [+2092 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Alex Davies", "title": "The Autonomous-Car Chaos of the 2004 Darpa Grand Challenge - WIRED", "description": "The self-driving vehicles smashed, burned, flipped, and tipped. But the ambitious race through the Mojave launched an industry.", "url": "https://www.wired.com/story/autonomous-car-chaos-2004-darpa-grand-challenge/", "urlToImage": "https://media.wired.com/photos/5afa24a657c02d59cb85a7d2/191:100/w_1280,c_limit/RS12-3082799.jpg", "publishedAt": "2021-01-06T12:00:00Z", "content": "As Sandstorm turned the first corner and started to disappear into the open desert, its laser scanner detected a clear path ahead, and its detailed map data said it was time to hit the throttle. Sand… [+3734 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Aswathi Pacha", "title": "Best from science journals: How did asteroid Ryugu lose its water - The Hindu", "description": "Here are some of the most interesting research papers to have appeared in top science journals last week", "url": "https://www.thehindu.com/sci-tech/science/best-from-science-journals-how-did-asteroid-ryugu-lose-its-water/article33510991.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/la35ji/article33510990.ece/ALTERNATES/LANDSCAPE_615/JapanAsteroid53783jpg-30be5jpg", "publishedAt": "2021-01-06T11:22:55Z", "content": "(Subscribe to Science For All, our weekly newsletter, where we aim to take the jargon out of science and put the fun in. Click here.)\r\nOrigin of fertile soil in the Amazon\r\nPublished in Nature Commun… [+3128 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Why is Earth spinning faster than it has in 50 years? - WION", "description": "Our planet Earth may be spinning faster than it has in over 50 years!", "url": "https://www.wionews.com/science/why-is-earth-spinning-faster-than-it-has-in-50-years-354845", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/13/149565-untitled-design-2.jpg, 2017 shows on November 9, 1967, when the uncrewed Apollo 4 test flight made a great ellipse around Earth as a test of the translunar motors and of the high speed entry required of a crewed flight returning from the Moon. A 70mm camera was programmed to look out a window toward Earth, and take a series of photographs from &quot;high apogee.&quot; Seen looking west are coastal Brazil, the Atlantic Ocean, West Africa and Antarctica. This photograph was made as the Apollo 4\" typeof=\"foaf:Image\" />", "publishedAt": "2021-01-06T11:14:43Z", "content": "Our planet Earth may be spinning faster than it has in over 50 years!\r\nScientists believe that each day is shorter than 24 hours owing to the change in the speed of earths rotation, which has increas… [+1862 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Astronomers detected a new superflare of an ultracool star - Tech Explorist", "description": "Using Xinglong observatory's Ground-based Wide Angle Cameras (GWAC), astronomers from China and France have detected a new superflare of an ultracool star known as SDSS J013333.08+003223.7", "url": "https://www.techexplorist.com/astronomers-detected-new-superflare-ultracool-star/37136/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/GWAC-181229A.jpg", "publishedAt": "2021-01-06T10:47:00Z", "content": "Using Xinglong observatory’s Ground-based Wide Angle Cameras (GWAC), astronomers from China and France have found a new event called GWAC 181229A. They have detected a new superflare of an ultracool … [+2538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Two asteroids as big as Eiffel Tower to zoom past Earth today - The Indian Express", "description": "Asteroid 2021 AC Passing Earth Today: The 2008 AF4 is nearly 500 metres in diameter and if it was to hit Earth, its impact would be the equivalent of the largest nuclear bombs.", "url": "https://indianexpress.com/article/technology/science/asteroid-2008-af4-eiffel-tower-size-earth-approach-7135032/", "urlToImage": "https://images.indianexpress.com/2020/08/asteroid-fb.jpg", "publishedAt": "2021-01-06T10:01:22Z", "content": "We are just six days into 2021 and there are several asteroids approaching Earth already. National Aeronautics and Space Administration (NASA) has cautioned about six asteroids, including two which a… [+1663 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Neanderthal`s 41,000-year-old skeleton all set to resolve this long-standing mystery - WION", "description": "Neanderthals 41,000-year-old skeleton all set to resolve the long-standing mystery why the Stone Age hominins intentionally buried their dead.", "url": "https://www.wionews.com/world/neanderthals-41000-year-old-skeleton-all-set-to-resolve-this-long-standing-mystery-354774", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/10/01/162616-untitled-design-33.jpg", "publishedAt": "2021-01-06T07:36:29Z", "content": "Neanderthal's 41,000-year-old skeleton all set to resolve the long-standing mystery why the Stone Age hominins intentionally buried their dead.\r\nThe origin of funerary practices has important implica… [+1884 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "New technology to monitor near real-time drought conditions - Tech Explorist", "description": "UNIST scientists have unveiled a novel technology that can be used to monitor near real-time drought conditions by improving the accuracy of satellite-based soil moisture estimates and processing vast amounts of satellite imagery rapidly and accurately.", "url": "https://www.techexplorist.com/new-technology-monitor-near-real-time-drought-conditions/37130/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/Remote-Sensing-of-Environment.jpg", "publishedAt": "2021-01-06T06:23:00Z", "content": "Now it is possible to monitor near real-time drought conditions, thanks to a novel technology developed by UNIST scientists. Scientists improved the accuracy of satellite-based soil moisture estimate… [+2222 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists discover the oldest, most distant galaxy till date - WION", "description": "Astronomers have peered out into the vast expanse and discovered what they believe is the oldest, most distant galaxy till date.", "url": "https://www.wionews.com/science/scientists-discover-the-oldest-most-distant-galaxy-till-date-354750", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/01/06/177245-untitled-design-2.jpg, most distant galaxy till date\" typeof=\"foaf:Image\" />", "publishedAt": "2021-01-06T06:02:55Z", "content": "Astronomers have peered out into the vast expanse and discovered what they believe is the oldest, most distant galaxy till date.\r\nCalled GN-z11, the galaxy is 13.4 billion light-years or 134 nonillio… [+1788 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Auckland University study looks at dinosaurs’ roles in moving seeds - Devdiscourse", "description": "Evidence from fossils indicates that seeds consumed by dinosaurs could remain intact in their stomachs, suggesting a possible role in helping plants to spread in the prehistoric world.", "url": "https://www.devdiscourse.com/article/science-environment/1394933-auckland-university-study-looks-at-dinosaurs-roles-in-moving-seeds", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_14_43_01_8720318.jpg?width=920&format=jpeg", "publishedAt": "2021-01-06T03:05:43Z", "content": "It's an insight into ecosystems that existed more than 65 million years ago when dinosaurs roamed the earth.\r\nA new study from the University of Auckland looks at the animals' roles in moving seeds f… [+2421 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Edward Browne", "title": "Elon Musk hints next Starship launch could happen in WEEKS amid Mars mission pledge - Daily Express", "description": "ELON Musk has confirmed the next flight test of SpaceX's Mars-bound Starship rocket will take place within weeks.", "url": "https://www.express.co.uk/news/science/1380237/Elon-Musk-news-spacex-space-starship-launch-sn9-sn10-boca-chica-mars-mission-when-ont", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1380237.jpg", "publishedAt": "2021-01-06T02:35:00Z", "content": null}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Raghavendra Gadagkar", "title": "More Fun Than Fun: Battles of the Sexes Can Now Be Made to Order – or Vanish - The Wire Science", "description": "There is a way to have evolution made to order and witness natural selection – not just in a researcher's lifetime but in the span of a PhD. It requires thinking out of the box.", "url": "https://science.thewire.in/the-sciences/sexual-reproduction-natural-selection-competition-ng-prasad-raghavendra-gadagkar/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/01/06090224/Image5-Peop_e-and-Flies.png", "publishedAt": "2021-01-06T02:29:00Z", "content": "N.G. Prasad and Bodhisatta Nandy. Right top: Flies under experimental selection. Photos: Evolutionary Biology Lab/IISER Mohali. Right bottom: A female fruit fly. Photo: R. Vijaya Anand/IISER Mohali.\r… [+15639 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "陈子琰", "title": "Launch activity to accelerate - Chinadaily USA", "description": "China Aerospace Science and Technology Corp, the country's leading space contractor, says it plans to launch more than 40 missions this year, including some for the nation's space station program.", "url": "http://global.chinadaily.com.cn/a/202101/06/WS5ff50af7a31024ad0baa0b74.html", "urlToImage": "//img2.chinadaily.com.cn/images/202101/06/5ff50af7a31024adbdacbd51.jpeg", "publishedAt": "2021-01-06T01:42:22Z", "content": "China's unmanned Mars probe, Tianwen-1, blasts off on a Long March 5 rocket in Hainan, on July 23, 2020. [Photo/Xinhua] \r\nSpace station missions the highlight of Long March schedule for 2021\r\nChina A… [+2938 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "刘小卓", "title": "Space ambitions needed now more than ever - World - Chinadaily USA", "description": "One human endeavor that defied the challenges that 2020 threw at us was space exploration, and 2021 is set to be an equally exciting year in increasing our understanding of the final frontier.", "url": "https://www.chinadaily.com.cn/a/202101/06/WS5ff50e65a31024ad0baa0b91.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202101/06/5ff51e39a31024adbdaccf5b.jpeg", "publishedAt": "2021-01-06T01:12:00Z", "content": "China's unmanned Mars probe, Tianwen-1, blasts off on a Long March 5 rocket in Hainan, on July 23, 2020. [Photo/Xinhua] \r\nOne human endeavor that defied the challenges that 2020 threw at us was space… [+5207 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "NASA Sets Date for First Hot Fire Test of Space Launch System Core Stage - Space Ref", "description": "NASA Sets Date for First Hot Fire Test of Space Launch System Core Stage - SpaceRef", "url": "http://www.spaceref.com/news/viewpr.html?pid=56784", "urlToImage": null, "publishedAt": "2021-01-06T01:01:10Z", "content": "NASA Sets Date for First Hot Fire Test of Space Launch System Core Stage\r\nPress Release\r\n From: Aerojet RocketdynePosted: Tuesday, January 5, 2021 \r\nFour Aerojet Rocketdyne RS-25 engines are being ta… [+2587 chars]"}, {"source": {"id": null, "name": "Asiatatler.com"}, "author": "Relaxnews", "title": "Nomophobia Is An Emerging New Phobia That Leaves People Anxious Without Their Smartphones - Tatler Philippines", "description": "Have you ever tried switching off your smartphone for a whole day? Now an essential part of our daily lives, mobile phones have many obvious advantages ... so long as you don't end up becoming totally addicted to your device. A new study from researchers in A…", "url": "https://ph.asiatatler.com/life/nomophobia-is-an-emerging-new-phobia-that-leaves-people-anxious-without-their-smartphones", "urlToImage": "https://cdn.asiatatler.com/asiatatler/i/ph/2021/01/06085422-gettyimages-871a8807095511original_cover_1920x1280.jpg", "publishedAt": "2021-01-06T00:55:39Z", "content": null}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "ANI", "title": "Study finds how plants perceive and react to blue light - Free Press Journal", "description": "Researchers from the University of California, unveils the mystery behind how plants perceive and react to light across a wide spectrum.", "url": "https://www.freepressjournal.in/science/study-finds-how-plants-perceive-and-react-to-blue-light", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-01%2Fd3ac9347-74a2-4200-9045-3f7d626c490c%2Fetc_3rd_lead_jan_5.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-01-05T21:49:00Z", "content": "California: Researchers from the University of California, unveils the mystery behind how plants perceive and react to light across a wide spectrum.\r\nNew research published in Nature Communications B… [+2631 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Source of Sunquakes is Submerged beneath Solar Surface, Study Shows | Astronomy - Sci-News.com", "description": "Ultra-impulsive acoustic emission from a solar flare recently detected by NASA’s Solar Dynamics Observatory (SDO) indicated submersion of its source beneath the active region that hosted the flare.", "url": "http://www.sci-news.com/astronomy/source-sunquakes-submerged-solar-surface-09220.html", "urlToImage": "http://cdn.sci-news.com/images/2017/08/image_5092f-Solar-Core.jpg", "publishedAt": "2021-01-05T21:42:33Z", "content": "Ultra-impulsive acoustic emission from a solar flare recently detected by NASAs Solar Dynamics Observatory (SDO) indicated submersion of its source beneath the active region that hosted the flare.\r\nF… [+2968 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "A new project from NASA will help estimate the size of the supernova; Read more - SwordsToday.ie", "description": "Thanks to NASA's new data sonication program, Earth's animals can now understand the sound of the universe. NASA's Lunar X-Ray Center, which has been", "url": "https://swordstoday.ie/a-new-project-from-nasa-will-help-estimate-the-size-of-the-supernova-read-more/", "urlToImage": null, "publishedAt": "2021-01-05T20:46:00Z", "content": "Thanks to NASA’s new data sonication program, Earth’s animals can now understand the sound of the universe. NASA’s Lunar X-Ray Center, which has been photographing distant galaxies for 20 years, has … [+2410 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Viral mutations may cause another 'very, very bad' COVID-19 wave, scientists warn - Science Magazine", "description": "Growing evidence that U.K. variant spreads faster triggers calls for tighter control measures", "url": "https://www.sciencemag.org/news/2021/01/viral-mutations-may-cause-another-very-very-bad-covid-19-wave-scientists-warn", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/glasgow_1280p.jpg?itok=obBUnq7-", "publishedAt": "2021-01-05T20:05:00Z", "content": "Streets in downtown Glasgow were deserted on 5 January after the United Kingdom imposed a strict lockdown to curtail the spread of a new SARS-CoV-2 variant.\r\nANDY BUCHANAN/AFP via Getty Images \r\nBy K… [+6738 chars]"}, {"source": {"id": null, "name": "3D Printing Industry"}, "author": "Hayley Everett", "title": "Rutgers engineers 3D print octopus-inspired camouflage-ready robots - 3D Printing Industry", "description": "Researchers from Rutgers University have created light-sensitive 3D printed artificial ‘muscles’ that are capable of fluctuating their appearance and shape on-demand.  The robotic devices are based on a novel hydrogel, that’s inspired by the adaptable cells f…", "url": "https://3dprintingindustry.com/news/rutgers-engineers-3d-print-octopus-inspired-camouflage-ready-robots-181744/", "urlToImage": "https://3dprintingindustry.com/wp-content/uploads/2021/01/252669_web.jpg", "publishedAt": "2021-01-05T19:16:00Z", "content": "Researchers from Rutgers University have created light-sensitive 3D printed artificial muscles that are capable of fluctuating their appearance and shape on-demand. \r\nThe robotic devices are based on… [+5466 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Loss of critical enzymatic processes can increase bone fracture risk - News-Medical.net", "description": "A loss of enzymatic processes within the body can increase a person's risk of bone fracture. This new insight was recently published in eLife by an international team of scientists and engineers led by Deepak Vashishth, the director of the Center for Biotechn…", "url": "https://www.news-medical.net/news/20210105/Loss-of-critical-enzymatic-processes-can-increase-bone-fracture-risk.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Osteoporosis_stage_3_of_4_-_upper_limb_bones_-_3d_rendering_-_Crevis_M1_62ee9a3e223b497ca6798e45d894de93-620x480.jpg", "publishedAt": "2021-01-05T18:58:00Z", "content": "A loss of enzymatic processes within the body can increase a person's risk of bone fracture. This new insight was recently published in eLife by an international team of scientists and engineers led … [+3507 chars]"}, {"source": {"id": null, "name": "Aircosmosinternational.com"}, "author": null, "title": "French military satellite CSO 2 launched - Air & Cosmos - International", "description": "Arianespace launched at the end of 2020 French second military satellite CSO. His capabilities are classified.", "url": "https://aircosmosinternational.com/article/french-military-satellite-cso-2-launched-3053", "urlToImage": "https://fra1.digitaloceanspaces.com/rewyer-storage-003/4dc607ixno/media/ada2778decb26f4e556ad5fcdb328958ff35a22fe69cc168ce87c4c0a1ac87ae", "publishedAt": "2021-01-05T18:43:24Z", "content": "Europe's sharpest eyes\r\nCSO 1 was launched on December 19, 2018, using Soyouz STA/Fregat M launcher. Second CSO (Optical Space Component) military satellite into three was launched on December 29, 20… [+2222 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Sweat, bleach and gym air quality: Chemical reactions make new airborne chemicals - Science Daily", "description": "One sweaty, huffing, exercising person emits as many chemicals from their body as up to five sedentary people, according to a new study. And notably, those human emissions, including amino acids from sweat or acetone from breath, chemically combine with bleac…", "url": "https://www.sciencedaily.com/releases/2021/01/210105130110.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-05T18:14:48Z", "content": "One sweaty, huffing, exercising person emits as many chemicals from their body as up to five sedentary people, according to a new University of Colorado Boulder study. And notably, those human emissi… [+2624 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Methane-based rocket fuel 'can be made on MARS in one-step process' - Daily Mail", "description": "A new process could create a stable and continuous source of fuel on Mars. Physicists propose using zinc to cause a reaction in carbon dioxide to make methane-based rocket fuel.", "url": "https://www.dailymail.co.uk/sciencetech/article-9115415/Methane-based-rocket-fuel-MARS-one-step-process-physicist-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/05/17/37635708-0-image-a-30_1609869300513.jpg", "publishedAt": "2021-01-05T17:55:00Z", "content": "Physicists at the University of California, Irvine have set out solve a pressing problem for space travelers: How can astronauts have enough fuel to travel back to Earth from Mars?\r\nThe idea of makin… [+3261 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kevin Stacey", "title": "Remote sensing data sheds light on when and how asteroid Ryugu lost its water - Phys.org", "description": "Last month, Japan's Hayabusa2 mission brought home a cache of rocks collected from a near-Earth asteroid called Ryugu. While analysis of those returned samples is just getting underway, researchers are using data from the spacecraft's other instruments to rev…", "url": "https://phys.org/news/2021-01-remote-asteroid-ryugu-lost.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/remotesensin.jpg", "publishedAt": "2021-01-05T17:43:03Z", "content": "Last month, Japan's Hayabusa2 mission brought home a cache of rocks collected from a near-Earth asteroid called Ryugu. While analysis of those returned samples is just getting underway, researchers a… [+5624 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "First Glimpse of Polarons – Ephemeral Distortions – Forming in a Promising Next-Gen Energy Material - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9maXJzdC1nbGltcHNlLW9mLXBvbGFyb25zLWVwaGVtZXJhbC1kaXN0b3J0aW9ucy1mb3JtaW5nLWluLWEtcHJvbWlzaW5nLW5leHQtZ2VuLWVuZXJneS1tYXRlcmlhbC_SAQA?oc=5", "urlToImage": null, "publishedAt": "2021-01-05T17:02:26Z", "content": null}, {"source": {"id": null, "name": "Magazinebuzz.com"}, "author": "Bianca Dennis", "title": "The Harvard astronomer still believed that the interstellar object was a strange technology - Magazine Buzz", "description": "This site may earn affiliate commissions from the links on this page. Usage instructions. A prominent Harvard astronomer still spends much of his time", "url": "https://magazinebuzz.com/the-harvard-astronomer-still-believed-that-the-interstellar-object-was-a-strange-technology/", "urlToImage": "https://magazinebuzz.com/wp-content/uploads/2021/01/The-Harvard-astronomer-still-believed-that-the-interstellar-object-was.jpg", "publishedAt": "2021-01-05T16:04:00Z", "content": "This site may earn affiliate commissions from the links on this page. Usage instructions.\r\nA prominent Harvard astronomer still spends much of his time contemplating our first encounter with an alien… [+2928 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Invisible Solar Panels: How Tomorrow's Windows Will Generate Electricity - SciTechDaily", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vc2NpdGVjaGRhaWx5LmNvbS9pbnZpc2libGUtc29sYXItcGFuZWxzLWhvdy10b21vcnJvd3Mtd2luZG93cy13aWxsLWdlbmVyYXRlLWVsZWN0cmljaXR5L9IBAA?oc=5", "urlToImage": null, "publishedAt": "2021-01-05T15:51:03Z", "content": null}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "6 essential facts about Perseverance's trailblazing Mars mission - Inverse", "description": "The Perseverance rover is set to begin its journey on Mars in early February. The mission will lead to unprecedented discoveries.", "url": "https://www.inverse.com/science/perseverance-rover-mars-facts", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/1/4/ca55a6f8-cde6-4332-b697-229c3efaa9b8-pia23491-16.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-01-05T15:00:00Z", "content": "In July 2020\r\n, a robotic astrobiologist began a journey to a distant planet. NASA's Perseverance rover is currently en route to Mars set to land on the Red Planet by February 2021.\r\nThe mission is s… [+3238 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Five asteroids, including two larger than Eiffel Tower, will fly past Earth on January 6 - Moneycontrol.com", "description": "The biggest of the five asteroids that will fly past the Earth on January 6 is the asteroid 2008 AF4.", "url": "https://www.moneycontrol.com/news/science/five-asteroids-including-two-larger-than-eiffel-tower-will-fly-past-earth-on-january-6-6307651.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/12/RTS1TY6I-770x433.jpg", "publishedAt": "2021-01-05T14:38:00Z", "content": "Five asteroids, including two bigger than the Eiffel Tower, are set to fly past the Earth on January 6, NASAs Centre for Near-Earth Object Studies has said. The other three asteroids that will be app… [+1214 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "NASA shares stunning image of lonely neutron star spotted outside Milky Way; see pic - Republic World", "description": "NASA’s Chandra X-ray Observatory shared the breathtaking photograph of the newly identified lonely neutron star 200,000 light-years away from Earth.", "url": "https://www.republicworld.com/technology-news/science/nasa-shares-stunning-image-of-lonely-neutron-star-spotted-outside-milky-way-see-pic.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/bq9nc92uf4ngxnh7_1609854998.jpeg?tr=f-jpeg", "publishedAt": "2021-01-05T14:17:00Z", "content": "NASA on January 4 shared a captivating image of a ‘special’, lonely neutron star spotted outside of the Milky Way galaxy for the first tie ever on NASA’s Chandra X-ray Observatory and the European So… [+2674 chars]"}, {"source": {"id": null, "name": "Turkishpress.com"}, "author": null, "title": "New Turkish 5A satellite set for launch from US Thursday - Turkish Press", "description": "ISTANBUL A new Turkish communications satellite is set to be launched by technology company SpaceX late Thursday by a Falcon 9 rocket taking off from the", "url": "https://turkishpress.com/new-turkish-5a-satellite-set-for-launch-from-us-thursday/", "urlToImage": "https://i1.wp.com/cdn.turkishpress.com/2021/01/05064044/thumbs_b_c_9415358df08f637430d356596648ea58.jpg?fit=863%2C486&ssl=1", "publishedAt": "2021-01-05T11:32:00Z", "content": "ISTANBUL\r\nA new Turkish communications satellite is set to be launched by technology company SpaceX late Thursday by a Falcon 9 rocket taking off from the US East Coast.\r\nThe satellite set to take of… [+1092 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "The secret of working sunquakes might be hidden beneath the solar surface - Tech Explorist", "description": "A new study based on data provided by NASA’s Solar Dynamics Observatory (SDO) suggests that sunquakes are a result of something that lurks beneath the surface of the Sun.", "url": "https://www.techexplorist.com/the-secret-of-working-sunquakes-might-be-hidden-beneath-the-solar-surface/37119/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/sunquakes.jpg", "publishedAt": "2021-01-05T11:23:00Z", "content": "A sunquake is a short-lived seismic disturbance in the Sun’s interior seen with some solar flares and coronal mass ejections (CME) as propagating ripples on the surface. Like earthquakes, sunquakes h… [+2245 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Indian-Origin Scientist Helps Develop Technique to Identify Stressed Corals - News18", "description": "Scientists have developed a novel technique to identify heat-stressed corals.", "url": "https://www.news18.com/news/buzz/indian-origin-scientist-helps-develop-technique-to-identify-stressed-corals-3248825.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/12/1608039115_2020-12-14t081014z_1_lynxmpegbd0f6_rtroptp_4_climate-change-corals.jpg", "publishedAt": "2021-01-05T10:10:05Z", "content": "Scientists have developed a novel technique to identify heat-stressed corals. The new way found by researchers could prove helpful to marine biologists. The information can help the scientists pinpoi… [+2548 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Tom Fish", "title": "How long before Earth's core runs out of fuel? - Daily Express", "description": "EARTH'S core is the hidden heart of our planet, now known to be key in sustaining life on our world. This has led scientists to question how much longer Earth's core will stay hot.", "url": "https://www.express.co.uk/news/science/1379779/how-long-before-earth-core-runs-out-of-fuel-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1379779.jpg", "publishedAt": "2021-01-05T08:40:00Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Astronomers agreed that the universe is nearly 14 billion years old - Tech Explorist", "description": "New observations plus a bit of cosmic geometry suggest that the universe is 13.77 billion years old, give or take 40 million years.", "url": "https://www.techexplorist.com/astronomers-agreed-universe-nearly-14-billion-years-old/37108/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/solar-system-emergence-spitzer-telescope-telescope-41951.jpeg", "publishedAt": "2021-01-05T06:49:00Z", "content": "From a mountain high in Chiles Atacama Desert, astronomers with the National Science Foundations Atacama Cosmology Telescope (ACT) have taken a fresh look at the oldest light in the Universe. In addi… [+2593 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Researchers study a signal that is coming from the star Proxima Centauri - Firstpost", "description": "Proxima Centauri, which is a red dwarf star is orbited by two known planets, one of which is in the 'habitable zone' that could support Earth-like conditions.", "url": "https://www.firstpost.com/tech/science/researchers-study-a-signal-that-is-coming-from-the-star-proxima-centauri-9170221.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/Best_image_of_Alpha_Centauri_A_and_B-1.jpg", "publishedAt": "2021-01-05T04:59:25Z", "content": "FP TrendingJan 05, 2021 10:29:25 IST\r\nResearchers from Penn State University are examining a signal that was detected by a radio telescope pointed at Proxima Centauri. It is the Milky Way's neighbour… [+1910 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "China’s Tianwen-1 may enter Mars’ orbit next month - Free Press Journal", "description": "The China National Space Administration (CNSA) announced on Sunday that the country’s Mars probe Tianwen-1 has travelled more than 400 million km and is expected to enter the Red Planet’s orbit next month.", "url": "https://www.freepressjournal.in/science/chinas-tianwen-1-may-enter-mars-orbit-next-month", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-01%2Fd98d38d0-c496-49fc-9010-3f8b4b15a8f8%2Fetc_2nd_lead_dec_4.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-01-05T04:15:00Z", "content": "Beijing: The China National Space Administration (CNSA) announced on Sunday that the countrys Mars probe Tianwen-1 has travelled more than 400 million km and is expected to enter the Red Planets orbi… [+1695 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "How To Identify Heat-Stressed Corals - Eurasia Review", "description": "Researchers have found a novel way to identify heat-stressed corals, which could help scientists pinpoint the coral species that need protection from", "url": "https://www.eurasiareview.com/05012021-how-to-identify-heat-stressed-corals/", "urlToImage": "https://www.eurasiareview.com/wp-content/uploads/2021/01/c-38.jpg", "publishedAt": "2021-01-05T00:07:00Z", "content": "Researchers have found a novel way to identify heat-stressed corals, which could help scientists pinpoint the coral species that need protection from warming ocean waters linked to climate change, ac… [+2441 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Erika P.", "title": "Growing Plants In Space: Astronauts Eats First Radish Grown in Space - Science Times", "description": "Astronauts aboard the ISS are finally tasting their fruits of labor as they eat for the first time radish grown in space. Growing plants in space would help food production efforts for long-term space missions.", "url": "https://www.sciencetimes.com/articles/28908/20210104/growing-plants-space-astronauts-eats-first-radish-grown.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/31217/growing-plants-in-space-astronauts-eats-first-radish-grown-in-space.jpg", "publishedAt": "2021-01-05T00:00:00Z", "content": null}, {"source": {"id": null, "name": "Express"}, "author": "Sean Martin", "title": "Meteor shower tonight: Can I still see the Quadrantids? - Daily Express", "description": "THE Quadrantids Meteor Shower peaked over the weekend, lighting up the skies with hundreds of shooting stars. Can I still see the meteor shower?", "url": "https://www.express.co.uk/news/science/1379640/meteor-shower-tonight-quadrantids-2021-peak-nasa-space-asteroid-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1379640.jpg", "publishedAt": "2021-01-04T21:19:00Z", "content": null}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "First interstellar object discovered was alien technology, says Harvard professor - BollyInside", "description": "Despite the rejection of some members of the scientific community, a researcher at Harvard University comes up with the idea that the first interstellar", "url": "https://www.bollyinside.com/news/technology/first-interstellar-object-discovered-was-alien-technology-says-harvard-professor/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/01/First-interstellar-object-discovered-was-alien-technology-says-Harvard-professor.jpg", "publishedAt": "2021-01-04T20:12:23Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+476 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Brad Bergan", "title": "NASA Plays Supernova Sounds - On Musical Instruments? | IE - Interesting Engineering", "description": "NASA played supernova sounds with an orchestra! Check out Chandra's new-age vibes.", "url": "https://interestingengineering.com/nasa-plays-extremely-loud-supernova-sounds-with-musical-instruments", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Xy6xJAZKOr/sizes/nasa-plays-extremely-loud-supernova-sounds-with-musical-instruments_md.jpg", "publishedAt": "2021-01-04T19:07:53Z", "content": "Space is a place without audible sound — since it lacks the pressure of substances like air in an atmosphere to propagate. But NASA's \"data sonification\" program is unveiling the sounds extremely lou… [+3205 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Japan wants to launch a wooden satellite into outer space to reduce space junk - ZME Science", "description": "Eco-friendly satellites might be coming soon.", "url": "https://www.zmescience.com/space/japan-wood-satellite-03012021/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2020/12/https___s3-ap-northeast-1.amazonaws.com_psh-ex-ftnikkei-3937bb4_images_5_9_9_9_31399995-6-eng-GB_Cropped-1608754781photo.jpg", "publishedAt": "2021-01-04T17:08:51Z", "content": "The ‘space’ around our planet is riddled with more than 23,000 known man-made objects: from defunct satellites to nuts and bolts, they’re all zipping around our planet, posing a threat to working sat… [+2201 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": null, "title": "Mars’ı Keşfe Giden Tianwen-1, 400 Milyon Kilometreyi Geçti - RaillyNews", "description": "Tianwen-1 Exploring Mars Passed 400 Million Kilometers | The National Space Agency of China reported that the country's Mars research satellite Tianwen-1 has traveled more than 3 million kilometers as of Sunday, January 400, and", "url": "https://www.raillynews.com/2021/01/Tianwen%2C-who-went-to-marsi-exploring%2C-passed-1-400-million-kilometers/", "urlToImage": "https://i2.wp.com/rayhaber.com/wp-content/uploads/2021/01/marsi-kesfe-giden-tianwen-1-400-milyon-kilometreyi-gecti.jpg?fit=1424%2C800&ssl=1", "publishedAt": "2021-01-04T14:36:46Z", "content": "Tianwen to explore mars over a million kilometers\r\nThe National Space Agency of China announced that the country's Mars research satellite Tianwen-1 has traveled more than 3 million kilometers as of … [+1753 chars]"}]}