{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Cheap, nontoxic carbon nanodots poised to be quantum dots of the future - Nanowerk", "description": "A new study that uses ultrafast nanometric imaging found good and bad emitters among populations of carbon dots. This observation suggests that by selecting only super-emitters, carbon nanodots can be purified to replace toxic metal quantum dots in many appli…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57463.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57463.jpg", "publishedAt": "2021-03-08T21:37:40Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Bristol Post"}, "author": "Emma Grimshaw", "title": "Another UK 'fireball' meteor spotted in night sky one week after 'sonic boom' over South West - Bristol Live", "description": "Last week, hundreds of people took to social media to share videos and pictures of the fireball over the West Country", "url": "https://www.bristolpost.co.uk/news/bristol-news/another-uk-fireball-meteor-spotted-5087444", "urlToImage": "https://i2-prod.bristolpost.co.uk/incoming/article5056671.ece/ALTERNATES/s1200/1_TCR_BRI_010322meteorBRIJPG.jpg", "publishedAt": "2021-03-08T21:03:42Z", "content": "Two 'fireball' meteors have been spotted in the UK in consecutive weeks.\r\nIt's believed last Sunday's (February 28) huge space object crash landed just north of Cheltenham, after a 'sonic boom noise'… [+1206 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Pompeii of prehistoric plants' unlocks evolutionary secret: study - Phys.org", "description": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominate so much of the Earth today.", "url": "https://phys.org/news/2021-03-pompeii-prehistoric-evolutionary-secret.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/60462a8c7fae7.jpg", "publishedAt": "2021-03-08T20:00:03Z", "content": "Spectacular fossil plants preserved within a volcanic ash fall in China have shed light on an evolutionary race 300 million years ago, which was eventually won by the seed-bearing plants that dominat… [+3813 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Arecibo Observatory telescope cleanup could cost up to $50 million, NSF reports - Space.com", "description": "", "url": "https://www.space.com/arecibo-observatory-nsf-collapse-cleanup-costs", "urlToImage": "https://cdn.mos.cms.futurecdn.net/o6L6vKnvg2iVdo47D4qoW3-1200-80.jpg", "publishedAt": "2021-03-08T19:51:56Z", "content": "Cleaning up the collapsed radio telescope at the iconic Arecibo Observatory\r\n in Puerto Rico could cost between $30 million and $50 million, according to the National Science Foundation (NSF).\r\nThe c… [+2737 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Graham Readfearn", "title": "Keep your head: the self-decapitating sea slugs that regrow their bodies – hearts and all - The Guardian", "description": "The disembodied head of the sacoglossan sea slug feasts on algae while its old body decomposes, and a new one grows<br>", "url": "https://amp.theguardian.com/environment/2021/mar/08/keep-your-head-the-self-decapitating-sea-slugs-that-regrow-their-bodies-hearts-and-all", "urlToImage": null, "publishedAt": "2021-03-08T18:23:00Z", "content": "Marine lifeThe disembodied head of the sacoglossan sea slug feasts on algae while its old body decomposes, and a new one grows\r\nIf you can keep your head when all about you are losing theirs, then it… [+2906 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Sophisticated skin - EurekAlert", "description": "Squids' remarkable ability to tune both the color and the brightness of their iridescence comes down to a subtle but powerful mechanism.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uoc--ss030821.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-08T18:16:17Z", "content": "Squids have long been a source of fascination for humans, providing the stuff of legend, superstition and myth. And it's no wonder -- their odd appearances and strange intelligence, their mastery of … [+7534 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Establishing the origin of solar-mass black holes and the connection to dark matter - Science Daily", "description": "What is the origin of black holes and how is that question connected with another mystery, the nature of dark matter? Dark matter comprises the majority of matter in the Universe, but its nature remains unknown.", "url": "https://www.sciencedaily.com/releases/2021/03/210308111925.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-08T18:01:46Z", "content": "What is the origin of black holes and how is that question connected with another mystery, the nature of dark matter? Dark matter comprises the majority of matter in the Universe, but its nature rema… [+3476 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Activity in Brain’s Risk Circuits Can Forecast Changes in Stock Prices - SciTechDaily", "description": "Forecasting changes in stock prices may be possible with the help of brain activity in regions associated with how people feel before making investment choices. Scientists could accurately forecast market price changes based on the average brain activity amon…", "url": "https://scitechdaily.com/activity-in-brains-risk-circuits-can-forecast-changes-in-stock-prices/", "urlToImage": "https://scitechdaily.com/images/Brain-Activity-Foreshadows-Changes-in-Stock-Prices.jpg", "publishedAt": "2021-03-08T18:00:54Z", "content": "Whole brain confirmation that activity in predicted regions forecasts stock price direction and inflection. Top, Stock price direction: NAcc activity forecast stock price direction in experiment 1 (m… [+1747 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Aniel Strain", "title": "A giant, sizzling planet may be orbiting the star Vega - Phys.org", "description": "Astronomers have discovered new hints of a giant, scorching-hot planet orbiting Vega, one of the brightest stars in the night sky.", "url": "https://phys.org/news/2021-03-giant-sizzling-planet-orbiting-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/agiantsizzli.jpg", "publishedAt": "2021-03-08T17:58:38Z", "content": "Astronomers have discovered new hints of a giant, scorching-hot planet orbiting Vega, one of the brightest stars in the night sky.\r\nThe research, published this month in The Astrophysical Journal, wa… [+4721 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Atmospheric drying will lead to lower crop yields, shorter trees across the globe - Phys.org", "description": "A global observation of an ongoing atmospheric drying—known by scientists as a rise in vapor pressure deficit—has been observed worldwide since the early 2000s. In recent years, this concerning phenomenon has been on the rise, and is predicted to amplify even…", "url": "https://phys.org/news/2021-03-atmospheric-crop-yields-shorter-trees.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/atmosphericd.jpg", "publishedAt": "2021-03-08T17:51:07Z", "content": "A global observation of an ongoing atmospheric dryingknown by scientists as a rise in vapor pressure deficithas been observed worldwide since the early 2000s. In recent years, this concerning phenome… [+4494 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Precursors To Life Found On Both An Asteroid And A Comet - IFLScience", "description": "Vital ingredients for the presence of life have been independently identified on both an asteroid and a comet. The findings don’t necessarily build the cas", "url": "https://www.iflscience.com/space/precursors-to-life-found-on-both-an-asteroid-and-a-comet/", "urlToImage": "https://cdn.iflscience.com/images/fe4e8ad0-f2bd-52f2-bd4c-a485283fd6bb/default-1615214134-catalina.jpg", "publishedAt": "2021-03-08T17:39:00Z", "content": "Vital ingredients for the presence of life have been independently identified on both an asteroid and a comet. The findings dont necessarily build the case for panspermia  the idea life on Earth was … [+3615 chars]"}, {"source": {"id": null, "name": "Nintendo-power.com"}, "author": "Ebenezer Robbins", "title": "\"The end of the world is very long\" - Nintendo-Power", "description": "In his new book \"Towards the End of Time\" (Ed. Flamorian), Brian Green, a global expert on string theory and a professor at Columbia University in NY,", "url": "https://nintendo-power.com/the-end-of-the-world-is-very-long/", "urlToImage": null, "publishedAt": "2021-03-08T17:01:01Z", "content": "In his new book “Towards the End of Time” (Ed. Flamorian), Brian Green, a global expert on string theory and a professor at Columbia University in NY, tells us how it all started. After all, thats ho… [+10386 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "NASA is Considering a Radio Telescope on the Far Side of the Moon - Universe Today", "description": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView, would harvest building materials from the Lunar surface its…", "url": "https://www.universetoday.com/150417/nasa-is-considering-a-radio-telescope-on-the-far-side-of-the-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/03/lunar_deposition_rover_light_lr_.jpg", "publishedAt": "2021-03-08T16:52:00Z", "content": "The University of Colorado Boulder and Lunar Resources Inc. have just won NASA funding to study the possibility of building a radio telescope on the far side of the Moon. The project, called FarView,… [+7405 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Tom Hale", "title": "How Sherlock Holmes's 'Mind Palace' Trick Can Boost Your Memory, As Shown By Brain Scans - IFLScience", "description": "New research has shown that Sherlock Holmes’s method for recalling fine details, known as the “method of loci,” may really help to enhance peoples’ memory", "url": "https://www.iflscience.com/brain/how-sherlock-holmess-mind-palace-trick-can-boost-your-memory-as-shown-by-brain-scans/", "urlToImage": "https://cdn.iflscience.com/images/0cb9c3a1-f0de-5ec2-a041-78a798ba3e43/default-1615213612-memories.jpg", "publishedAt": "2021-03-08T16:44:00Z", "content": "New research has shown that Sherlock Holmess method for recalling fine details, known as the method of loci, may really help to enhance peoples memory skills. The new study also used brain scans to h… [+3482 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Someone to watch over AI and keep it honest - and it's not the public! - Newswise", "description": "The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI a", "url": "https://www.newswise.com/articles/someone-to-watch-over-ai-and-keep-it-honest-and-it-s-not-the-public", "urlToImage": "https://www.newswise.com/images/new-newswise-logo-square.jpg", "publishedAt": "2021-03-08T16:40:00Z", "content": "Newswise — The public doesn't need to know how Artificial Intelligence works to trust it. They just need to know that someone with the necessary skillset is examining AI and has the authority to mete… [+2953 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "This is the best place and time for life in the Milky Way (and it’s not where we live) - Yahoo India News", "description": "Researchers from Italy's INAF national astrophysics institute and University of Insubria reached the conclusion after analysing gamma-ray bursts and...", "url": "https://in.news.yahoo.com/safe-alien-life-milky-way-163950290.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/O816p6LH5IhBFhMZ84Co_g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0yMzM0/https://s.yimg.com/os/creatr-images/2018-12/bdbc6960-fae0-11e8-b76d-ba98d5dff638", "publishedAt": "2021-03-08T16:39:50Z", "content": "Supernova explosions and gamma-ray burst could wipe emerging life from planets (Stock image/Getty)\r\nThe safest place and time for life to flourish in our Milky Way galaxy is not on Earth or now, but … [+3300 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Consumer news", "title": "Global Warming Could Make Survival in Tropics Impossible: Study - HealthDay News", "description": "MONDAY, March 8, 2021 (HealthDay News) -- Limiting global warming to targets proposed in the Paris Agreement could keep tropical regions from reaching temperatures that are beyond human tolerability, a new study projects.Researchers estimate that if countries…", "url": "https://consumer.healthday.com/3-8-global-warming-could-make-survival-in-tropics-impossible-study-2650863504.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzYzMTg4Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY0ODMyNjY3NX0.EQ91_1Sn0cvMXPCOKfdIRE7RDdN0lHayJCzhdHLplmE/image.jpg?width=1200&coordinates=0%2C100%2C0%2C100&height=600", "publishedAt": "2021-03-08T16:18:45Z", "content": "MONDAY, March 8, 2021 (HealthDay News) -- Limiting global warming to targets proposed in the Paris Agreement could keep tropical regions from reaching temperatures that are beyond human tolerability,… [+4697 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Dharna Noor", "title": "Indoor Weed Farms Are Hotboxing the Planet - Gizmodo", "description": "As more states legalize weed, commercial production of it is increasing. These growing operations may not just be getting customers high—they may be getting the planet’s temperature higher, too.", "url": "https://earther.gizmodo.com/indoor-weed-farms-are-hotboxing-the-planet-1846429482", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/xdo301hntvcgscccbktj.jpg", "publishedAt": "2021-03-08T16:00:00Z", "content": "As more states legalize weed, commercial production of it is increasing. These growing operations may not just be getting customers highthey may be getting the planets temperature higher, too. \r\nA ne… [+4707 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jules Bernstein", "title": "Research shows we're surprisingly similar to Earth's first animals - Phys.org", "description": "The earliest multicellular organisms may have lacked heads, legs, or arms, but pieces of them remain inside of us today, new research shows.", "url": "https://phys.org/news/2021-03-surprisingly-similar-earth-animals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/8-researchshow.jpg", "publishedAt": "2021-03-08T15:30:10Z", "content": "The earliest multicellular organisms may have lacked heads, legs, or arms, but pieces of them remain inside of us today, new research shows.\r\nAccording to a UC Riverside study, 555-million-year-old o… [+3312 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Scientists Think Tectonic Activities Predicted in Exoplanet are Larger than Earth - News18", "description": "Tectonic activities are movements and distortions in a planet’s crust.", "url": "https://www.news18.com/news/buzz/scientists-think-tectonic-activities-predicted-in-exoplanet-are-larger-than-earth-3512225.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1612516948_untitled-design-2021-02-05t145021.419.png", "publishedAt": "2021-03-08T14:55:49Z", "content": "Tectonic activities are movements and distortions in a planets crust. Geologists on Earth study these activities to assess the evolution and future condition of the landmasses. Lava eruption, earthqu… [+1990 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Most distant source of radio emission discovered, holds clues about ancient universe - Down To Earth Magazine", "description": "It took 13 billion years for the quasar&rsquo;s light to reach earth", "url": "https://www.downtoearth.org.in/news/science-technology/most-distant-source-of-radio-emission-discovered-holds-clues-about-ancient-universe-75833", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2021-03-08/0.22695700_1615213083_eso1122a.jpg", "publishedAt": "2021-03-08T14:41:46Z", "content": "An international team of astronomers have discovered the most distant ‘radio-loud’ quasar with the help of European Southern Observatory’s Very Large Telescope (ESO’s VLT). It took 13 billion years f… [+2650 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Insights on how night shift work increases cancer risk - Science Daily", "description": "A recent study offers new clues as to why night shift workers are at increased risk of developing certain types of cancer compared to those who work regular daytime hours. Findings suggest that night shifts disrupt natural 24-hour rhythms in the activity of c…", "url": "https://www.sciencedaily.com/releases/2021/03/210308091744.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-08T14:31:59Z", "content": "New clues as to why night shift workers are at increased risk of developing certain types of cancer are presented in a new study conducted at Washington State University Health Sciences Spokane.Publi… [+6032 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": null, "title": "School Today Indian scientists develop low cost optical spectrograph - Telangana Today", "description": "The indigenous efforts to build complex instruments like ADFOSC in India is an important step to become ‘Aatmanirbhar’ in the field of astronomy and astrophysics, says ARIES.", "url": "https://telanganatoday.com/?p=609900", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2021/03/Devasthal-Optical-Telescope.jpg", "publishedAt": "2021-03-08T14:18:06Z", "content": "Indian scientists have indigenously designed and developed a low cost optical spectrograph that can locate sources of faint light from distant quasars and galaxies in a very young universe, regions a… [+3174 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Large supernova remnant detected by eROSITA - Phys.org", "description": "Using the extended Röntgen Survey Imaging Telescope Array (eROSITA) instrument onboard the Spektr-RG spacecraft, astronomers have detected in X-rays a new large supernova remnant (SNR). The newfound object, dubbed \"Hoinga,\" turns out to be one of the largest …", "url": "https://phys.org/news/2021-03-large-supernova-remnant-erosita.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/largesuperno.jpg", "publishedAt": "2021-03-08T14:00:02Z", "content": "Using the extended Röntgen Survey Imaging Telescope Array (eROSITA) instrument onboard the Spektr-RG spacecraft, astronomers have detected in X-rays a new large supernova remnant (SNR). The newfound … [+3224 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exporting Pollution: Strict Environmental Laws “Push” Firms to Pollute Elsewhere - SciTechDaily", "description": "Study highlights need for global cooperation on policies. Multinational companies headquartered in countries with tougher environmental policies tend to locate their polluting factories in countries with more lax regulations, a new study finds. While countrie…", "url": "https://scitechdaily.com/exporting-pollution-strict-environmental-laws-push-firms-to-pollute-elsewhere/", "urlToImage": "https://scitechdaily.com/images/Factory-Smoke-Pollution.jpg", "publishedAt": "2021-03-08T13:50:04Z", "content": "Study highlights need for global cooperation on policies.\r\nMultinational companies headquartered in countries with tougher environmental policies tend to locate their polluting factories in countries… [+3962 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earth has a hidden layer, and no one knows exactly what it is - Livescience.com", "description": "", "url": "https://www.livescience.com/new-earth-layer-solid-inner-core.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uHtqwrQcroA2RGYBdNwUfQ-1200-80.jpg", "publishedAt": "2021-03-08T13:49:51Z", "content": "Earth\r\n might have more layers than scientists thought.\r\nNew research finds that there may be a hidden layer inside the Earth's solid inner core an inner-inner core, if you will. The precise nature o… [+3974 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Isabelle Osterholt", "title": "Research illuminates embryonic stem cell fate - Phys.org", "description": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight into stem cell pluripotency and evolutionary developmental b…", "url": "https://phys.org/news/2021-03-illuminates-embryonic-stem-cell-fate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/chickeneggs.jpg", "publishedAt": "2021-03-08T13:48:23Z", "content": "USC postdoctoral researcher Xi Chen knows that you have to break a few eggs in order to grow chicken stem cells. His work on maintaining embryonic stem cells (ESC) from chicken eggs provides insight … [+3978 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "This 'Ninja Giant' is the oldest titanosaur on record - Livescience.com", "description": "", "url": "https://www.livescience.com/oldest-titanosaur-ninja-giant-argentina.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6VFMocyhu49Gi9Xro46vn7-1200-80.jpg", "publishedAt": "2021-03-08T13:21:03Z", "content": "A new long-neck dinosaur discovered in Argentina might be the oldest titanosaur ever discovered.\r\nThe dinosaur, dubbed Ninjatitan zapati, lived 140 million years ago, which is 20 million years before… [+3914 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "How Do Eyeless Worms Know To Avoid The Color Blue? - IFLScience", "description": "The roundworm Caenorhabditis elegans is among the most studied species on Earth, but it retains the capacity to surprise, or even astonish, scientists. The", "url": "https://www.iflscience.com/plants-and-animals/how-do-eyeless-worms-know-to-avoid-the-color-blue/", "urlToImage": "https://cdn.iflscience.com/images/05e2f48b-f05b-5dda-b7d6-ce026a99968b/default-1614956949-c-elegans-tangle.jpg", "publishedAt": "2021-03-08T12:51:00Z", "content": "The roundworm Caenorhabditis elegans is among the most studied species on Earth, but it retains the capacity to surprise, or even astonish, scientists. The most recent discovery is the worms can avoi… [+3136 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/saqib-shah", "title": "Comets may have seeded Earth with life-supporting carbon - Engadget", "description": "A snapshot of a comet carrying carbon as it zipped past Earth in 2016 is helping NASA learn more about the origins of life.", "url": "https://www.engadget.com/comets-may-have-seeded-earth-with-life-supporting-carbon-120129729.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/kbmvChzIPRqkSzFjBOP06w--~B/aD0xOTM0O3c9MzM3MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2021-03/5e3aef70-8003-11eb-8e8b-9fba022eb3bb.cf.jpg", "publishedAt": "2021-03-08T12:02:48Z", "content": "NASA's airborne telescope has made another major discovery just months after it confirmed the presence of water on the Moon's sunlit surfaces. SOFIA's latest find relates to the essence left by an ic… [+2546 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Niiler", "title": "The Tide Is High–and Getting Higher - WIRED", "description": "A trove of historic records show that dredging and sea level rise are making nuisance high tides worse along the US coasts.", "url": "https://www.wired.com/story/the-tide-is-high-and-getting-higher/", "urlToImage": "https://media.wired.com/photos/604299c5bc9d842459e763c0/191:100/w_1280,c_limit/Science_hightide_1228230075.jpg", "publishedAt": "2021-03-08T12:00:00Z", "content": "Living near the ocean is a dream for many people. But in recent years, the effects of climate change have made it a dicey proposition. Hurricanes have become more intense, leading to bigger storm sur… [+3871 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ellie Harrison", "title": "Harry and Meghan: Jada Pinkett Smith and Gabrielle Union among celebrities to react after Oprah interview - The Independent", "description": "Many stars defended the couple on social media", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/harry-meghan-oprah-interview-celebrity-reactions-b1813871.html", "urlToImage": "https://static.independent.co.uk/2021/03/08/08/meghan%20harry_.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-03-08T11:36:39Z", "content": "Gabrielle Union and Jada Pinkett Smith are among the celebrities who have reacted to Prince Harry and Meghan Markles interview with Oprah Winfrey.\r\nThe TV event, which aired in the US on CBS on Sunda… [+2113 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "Scientists Say: Egg and sperm - Science News for Students", "description": "An egg or a sperm cell contains half of the normal genes an organism needs. They fuse together to form a new individual.", "url": "https://www.sciencenewsforstudents.org/article/scientists-say-egg-and-sperm", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2021/03/1030_SS_egg_and_sperm_feat.jpg", "publishedAt": "2021-03-08T11:30:00Z", "content": "algae: Single-celled organisms, once considered plants (they arent). As aquatic organisms, they grow in water. Like green plants, they depend on sunlight to make their food.\r\nbirds: Warm-blooded anim… [+5009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA’s Hubble captures incredible image of big, blue, beautiful galaxy 100 million light-years away - The Indian Express", "description": "The NGC 2336 which was discovered more than a century ago in 1876 by German astronomer Wilhelm Tempel can be seen in a high-resolution image released by NASA", "url": "https://indianexpress.com/article/technology/science/nasa-hubble-ngc-2336-galaxy-image-7219409/", "urlToImage": "https://images.indianexpress.com/2021/03/ngc2336-galaxy-nasa.jpg", "publishedAt": "2021-03-08T10:25:18Z", "content": "National Aeronautics and Space Administration (NASA) on Monday shared the stunning image of a galaxy located approximately 100 million light-years away from us. The image shows the spiral arms of the… [+1433 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Sakshat Kolhatkar", "title": "Scientists at CARMENES discover Super Earth Gliese 486 b, 26 light years away from Earth - Republic TV", "description": "Scientists have discovered a new planet called Gliese 486 b which is being considered a super Earth-like planet. Scientists are excited about this finding.", "url": "https://www.republicworld.com/technology-news/science/scientists-at-carmenes-discover-super-earth-gliese-486-b-26-light-years-away-from-earth.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ryc7iie30urnwtvl_1615190511.jpeg?tr=f-jpeg", "publishedAt": "2021-03-08T10:18:00Z", "content": "Scientists have just discovered a giant super Earth-like planet at a distance of 26 light-years away from the Earth. Scientists feel this newly discovered planet will help them study the atmospheric … [+2523 chars]"}, {"source": {"id": null, "name": "VentureBeat"}, "author": "Kyle Wiggers", "title": "Nvidia and Harvard develop AI tool that speeds up genome analysis - VentureBeat", "description": "Nvidia and Harvard researchers say they've developed an AI tool that can dramatically speed up genome analysis.", "url": "https://venturebeat.com/2021/03/08/nvidia-and-harvard-develop-ai-tool-that-speeds-up-genome-analysis/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2018/02/shutterstock_400845934-e1572448996720.jpg?w=1200&strip=all", "publishedAt": "2021-03-08T10:00:33Z", "content": "Join Transform 2021 for the most important themes in enterprise AI &amp; Data. Learn more.\r\nResearchers affiliated with Nvidia and Harvard today detailed AtacWorks, a machine learning toolkit designe… [+3666 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Bharat Sharma", "title": "International Women's Day: Ladies who graced outer space and changed it forever - WION", "description": "As countries step up their attempts at controlling space while expanding exploration, at the helm of these pursuits have been women. On International Women's Day, we bring to you a list of many firsts - all courtesy of the talented and ambitious women who wan…", "url": "https://www.wionews.com/photos/international-womens-day-ladies-who-graced-outer-space-and-changed-it-forever-368853", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2021/03/08/186096-7.jpg, at the helm of these pursuits have been women. On International Women&#039;s Day, we bring to you a list of many firsts - all courtesy of the talented and ambitious women who want to make space open for all humans, regardless of their sex and gender. Take a look at women who changed history in space\" typeof=\"foaf:Image\" />", "publishedAt": "2021-03-08T09:09:58Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarthak Dogra", "title": "NASA Grows Radishes In Space In Pursuit Of Food For Future Astronauts - India Times", "description": "As space agencies aim for deep space human exploration in their future missions, major research is being done towards establishing a proper food source for the astronauts expected to live in space during the mission course. In the latest development towards t…", "url": "https://www.indiatimes.com/technology/science-and-future/nasa-grows-radishes-in-space-in-pursuit-of-food-for-future-astronauts-528766.html", "urlToImage": "https://im.indiatimes.in/content/2020/Dec/Space-Plants-FB_5fc68dab82fc1.jpg", "publishedAt": "2021-03-08T08:20:26Z", "content": "As space agencies aim for deep space human exploration in their future missions, major research is being done towards establishing a proper food source for the astronauts expected to live in space du… [+1840 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Original NASA Mars scientists spur girls to 'reach for the stars' - Thomson Reuters Foundation", "description": "Scientist Swati Mohan gripped the world's attention as she narrated the hazardous landing of the Perseverance on Mars", "url": "https://news.trust.org/item/20210308065718-mlqob", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/e74b3795-5da7-42e7-b05a-886508990deb/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-03-08T08:00:00Z", "content": "* More women are training to become space engineers\r\n* U.S. space agency is on a diversity push\r\n* Role models seen vital in spurring girls to study STEM\r\nBy Emma Batha\r\nLONDON, March 8 (Thomson Reut… [+4831 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Scientists detect 1,000 km space hurricane in Earth’s lower atmosphere over North Pole - Moneycontrol", "description": "This is significant because even though space hurricanes are known to occur, they have never before been detected.", "url": "https://www.moneycontrol.com/news/world/scientists-detect-1000-km-space-hurricane-in-earths-lower-atmosphere-over-north-pole-6618141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/08/Chandrayaan-2-Earth-pic-770x433.jpg", "publishedAt": "2021-03-08T07:59:00Z", "content": "An international team of scientists led by Shandong University in China has observed a 1,000-km wide space hurricane in Earths lower atmosphere or ionosphere over the North Pole.\r\nThis is significant… [+3388 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals physical phenomena relied by oocytes to grow big - News-Medical.net", "description": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.", "url": "https://www.news-medical.net/news/20210308/Study-reveals-physical-phenomena-relied-by-oocytes-to-grow-big.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_of_sperms_and_an_egg_cell-Sebastian_Kaulitzki-2000_61f390311d3c4b1abeec7aceca5ab548-620x480.jpg", "publishedAt": "2021-03-08T05:39:00Z", "content": "Egg cells are by far the largest cells produced by most organisms. In humans, they are several times larger than a typical body cell and about 10,000 times larger than sperm cells.\r\nThere's a reason … [+6401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Scientists may have discovered the first evidence for tectonic activity on exoplanet - The Indian Express", "description": "The LHS 3844b is an exoplanet that is tidally locked to its star which means that one side of it is permanently facing the star while the other faces the space.", "url": "https://indianexpress.com/article/technology/science/lhs-3844b-exoplanet-tectonic-activity-full-of-volcanoes-study-7218895/", "urlToImage": "https://images.indianexpress.com/2021/03/exoplanet-lhs3844b.jpg", "publishedAt": "2021-03-08T05:25:17Z", "content": "Since its discovery in 2018 by the National Aeronautics and Space Administration’s (NASA) Transiting Exoplanet Survey Satellite (TESS), astronomers have been studying the exoplanet named LHS 3844b. A… [+2917 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Alanis Hayal", "title": "Extinct Atom and a Clever Trick Reveals the Long-Kept Secrets of the Solar System - Brinkwire", "description": null, "url": "https://en.brinkwire.com/science/extinct-atom-and-a-clever-trick-reveals-the-long-kept-secrets-of-the-solar-system/", "urlToImage": null, "publishedAt": "2021-03-08T03:38:14Z", "content": "Using the extinct niobium-92 atom, ETH researchers have been able to date events in the early solar system with greater precision than before.\r\nThe study concludes that supernova explosions must have… [+3371 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Bill Whitaker", "title": "NASA's new race to put a woman on the moon - 60 Minutes - CBS News", "description": "Nearly a half-century after the last Apollo astronaut stepped foot on the moon, NASA is working to send its first woman to the lunar surface. Bill Whitaker reports.", "url": "https://www.cbsnews.com/news/moon-nasa-efforts-return-60-minutes-2021-03-07/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/03/07/5736a0be-0854-4523-9a34-5cf0f495b7fb/thumbnail/1200x630/7babe070bd258e82106c815d6c09fa9e/moonarticle.jpg", "publishedAt": "2021-03-07T23:59:00Z", "content": "Twelve American men have walked on the moon. The last Apollo astronaut left his footprint there in December 1972. Now, a half-century later, NASA is planning to send people back to the moon. The new … [+11266 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "https://www.facebook.com/profile.php?id=100022982110913", "title": "TWIRL 3: Rocket Lab to attempt launch of delayed mission - Neowin", "description": "There are four planned rocket launches this week, two from SpaceX, one from Rocket Lab, and another from the Chinese National Space Administration. Rocket Lab's mission was delayed from last week.", "url": "https://www.neowin.net/news/twirl-3-rocket-lab-to-attempt-launch-of-delayed-mission/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2021/03/1615147213_1613946023_special_rocket_story.jpg", "publishedAt": "2021-03-07T20:16:02Z", "content": "Last week was quite good for SpaceX with it almost successfully landing its Starship rocket during a test, unfortunately, it caught fire and exploded on the pad. Rocket Lab also had to delay its “The… [+2048 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Space Hurricane: “ Why March is a Wild Month for Space Weather - BollyInside", "description": "It's barely a week into March and there are already reports of bright auroras, coronal mass ejections and a so-called 'space hurricane'. It's hard to", "url": "https://www.bollyinside.com/news/space-hurricane-why-march-is-a-wild-month-for-space-weather/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/03/Space-Hurricane-Why-March-is-a-Wild-Month-for.jpg", "publishedAt": "2021-03-07T14:41:32Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comet Catalina’s Glowing Tail Indicates Comets Delivered Carbon to Rocky Planets - SciTechDaily", "description": "In early 2016, an icy visitor from the edge of our solar system hurtled past Earth. It briefly became visible to stargazers as Comet Catalina before it slingshot past the Sun to disappear forevermore out of the solar system. Among the many observatories that …", "url": "https://scitechdaily.com/comet-catalinas-glowing-tail-indicates-comets-delivered-carbon-to-rocky-planets/", "urlToImage": "https://scitechdaily.com/images/Oort-Cloud-Comet-Illustration-scaled.jpg", "publishedAt": "2021-03-07T13:27:54Z", "content": "Illustration of a comet from the Oort Cloud as it passes through the inner solar system with dust and gas evaporating into its tail. SOFIA’s observations of Comet Catalina reveal that it’s carbon-ric… [+4484 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Matthew Warke", "title": "A billion years from now, a lack of oxygen will wipe out life on Earth - Space.com", "description": "", "url": "https://www.space.com/billion-years-from-now-oxygen-lack-wipes-out-life-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vgsWfq9pcZ4zbhz2HvkoX-1200-80.jpg", "publishedAt": "2021-03-07T12:22:02Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nMatthew Warke, Research Fellow, School of Earth… [+5623 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "China's Tianwen-1 probe captures stunning images of Mars | See Pictures - India Today", "description": "Mars-bound Tianwen-1 probe has sent back high-resolution images of the Red Planet, China's national space agency CNSA said in a statement.", "url": "https://www.indiatoday.in/science/story/mars-red-planet-real-photos-images-china-chinese-probe-mission-tianwen1-cnsa-1776632-2021-03-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202103/Mars__CNSA_-647x363.jpeg?A3nL6INC.c7zgN4BEfojEzHJkUfyPvMl", "publishedAt": "2021-03-07T12:05:03Z", "content": "China's national space agency Sunday released stunning high-resolution images of Mars captured by its Tianwen-1 probe, which is currently orbiting the Red planet. Launched on July 23 of last year, Ti… [+2141 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Chelsea Gohd", "title": "Mount Etna's fiery eruptions seen from space (satellite photos) - Livescience.com", "description": "Thar she blows!", "url": "https://www.livescience.com/mount-etna-volcano-eruption-2021-satellite-photos.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WrjKvwQDtAc6kkp7iYhroj-1200-80.jpg", "publishedAt": "2021-03-07T12:00:00Z", "content": "Mount Etna erupts, as seen from space on Feb. 18, 2021.  (Image credit: Landsat data from the U.S. Geological Survey)\r\nMount Etna has been spewing lava across Sicily for weeks during a series of erup… [+3266 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Estimation of the transmissibility and impact of the B.1.1.7 line of SARS-CoV-2 in England - BollyInside", "description": "Abstract A new variant of SARS-CoV-2, VOC 202012/01 (lineage B.1.1.7), appeared in the south-east of England in November 2020 and is rapidly spreading", "url": "https://www.bollyinside.com/news/estimation-of-the-transmissibility-and-impact-of-the-b-1-1-7-line-of-sars-cov-2-in-england/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/03/Estimation-of-the-transmissibility-and-impact-of-the-B117-line.jpg", "publishedAt": "2021-03-07T10:02:34Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Video \"Perseverance\" robot moves to the surface of Mars for the first time - SwordsToday.ie", "description": "The U.S. space agency \"NASA\" announced on Friday that the probe \"Perseverance\" had succeeded in traveling a few meters on Mars for the first time since it", "url": "https://swordstoday.ie/video-perseverance-robot-moves-to-the-surface-of-mars-for-the-first-time/", "urlToImage": null, "publishedAt": "2021-03-07T07:56:58Z", "content": "The U.S. space agency “NASA” announced on Friday that the probe “Perseverance” had succeeded in traveling a few meters on Mars for the first time since it landed on the surface two weeks ago.\r\nThe si… [+2480 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "Space Fans In France Told To Look Out For An Apricot-Sized Meteor That Fell To Earth - India Times", "description": "Last weekend, an apricot-sized meteorite fell to Earth in France and now space fans are being urged to find it. The space rock is estimated to weigh 150 gm and was captured plunging through the atmosphere by cameras at an astronomy education facility in Maura…", "url": "https://www.indiatimes.com/trending/social-relevance/apricot-sized-meteorite-in-france-535768.html", "urlToImage": "https://im.indiatimes.in/content/2021/Mar/meteor_60446605b794b.jpg", "publishedAt": "2021-03-07T07:10:58Z", "content": "Last weekend, an apricot-sized meteorite fell to Earth in France and now space fans are being urged to find it. \r\nThe space rock is estimated to weigh 150 gm and was captured plunging through the atm… [+1693 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Viral: Massive flock of starlings form perfect bird shape as they fly over an Irish lake [WATCH] - Times Now", "description": "Crombie added that he had to take between 400 to 500 shots before finally capturing the perfect pictures.", "url": "https://www.timesnownews.com/the-buzz/article/viral-massive-flock-of-starlings-form-perfect-bird-shape-as-they-fly-over-an-irish-lake-watch/729096", "urlToImage": "https://imgk.timesnownews.com/story/Bird2.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-07T02:05:07Z", "content": "It was something that was too surreal and otherwordly to believe at first sight. Yet, it is all too real.\r\nPictures may confuse us but they share truths that are more simple, profound, and awe-inspir… [+1963 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Thomas Burghardt", "title": "Rocket Lab reveals reusable, medium-lift Neutron rocket - NASASpaceFlight.com - NASASpaceflight.com", "description": "To date, Rocket Lab has successfully introduced the first dedicated small satellite launch vehicle, Electron,…", "url": "https://www.nasaspaceflight.com/2021/03/rocket-lab-reveals-neutron/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/03/Neutron_Facts_LEO.png", "publishedAt": "2021-03-07T00:15:55Z", "content": "To date, Rocket Lab has successfully introduced the first dedicated small satellite launch vehicle, Electron, which CEO Peter Beck said would never be reusable. Then, the company successfully recover… [+8717 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "64 full human genomes sequenced at high-resolution - ETHealthworld.com", "description": "Two decades after the successful completion of the Human Genome Project, an international group of researchers has now sequenced 64 human genomes at high resolution.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/64-full-human-genomes-sequenced-at-high-resolution/81246349", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-81246349,imgsize-668855,width-800,height-434,overlay-ethealthworld/64-full-human-genomes-sequenced-at-high-resolution.jpg", "publishedAt": "2021-02-27T13:27:21Z", "content": "New York: Two decades after the successful completion of the Human Genome Project, an international group of researchers has now sequenced 64 human genomes at high resolution.This reference data incl… [+3476 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "China's space probe Tianwen-1 enters Mars orbit - Arab News", "description": "BEIJING: A Chinese spacecraft entered Mars orbit on Wednesday on a mission to land a rover and collect data on underground water and possible signs of ancient life, state media said. “China’s probe Tianwen-1 successfully entered the orbit around Mars on Wedne…", "url": "https://www.arabnews.com/node/1807001", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/10/2467526-441992435.jpg", "publishedAt": "2021-02-10T13:18:22Z", "content": "DUBAI: The first Arab space mission, the UAEs Hope probe, is expected to reach Mars orbit on Tuesday, making it the first of three spacecraft to arrive at the Red Planet this month.\r\nThe United Arab … [+1824 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "What We Are Reading Today: Extraterrestrial by Avi Loeb - Arab News", "description": "Extraterrestrial is a provocative and fascinating book written by American theoretical physicist and Harvard University astronomer Avi Loeb. In Extraterrestrial, Loeb takes readers inside the thrilling story of the first interstellar visitor to be spotted in …", "url": "https://www.arabnews.com/node/1805446", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/07/2463056-822604459.png", "publishedAt": "2021-02-07T20:31:49Z", "content": "DUBAI: US-Palestinian writer Susan Abulhawas book Against the Loveless World is among the finalists for the 2020 Athenaeum of Philadelphia Literary Award, organizers announced this week. \r\nSusan Abul… [+1447 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com| Edited by Mallika Soni", "title": "All you need to know about the Geminid meteor shower which is set to reach its annual peak - Hindustan Times", "description": "he Geminids are nearly 200 years old, according to known records and are considered one of the best meteor showers every year because the individual meteors are bright and fast.", "url": "https://www.hindustantimes.com/science/all-you-need-to-know-about-the-geminid-meteor-shower-which-is-set-to-reach-its-annual-peak/story-Swf0QORKgLCHxjmRiJZ1AL.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/12/13/Pictures/_a431eac2-3ce9-11eb-8fc8-15ab4209080e.png", "publishedAt": "2020-12-13T02:24:22Z", "content": "The famous Geminid meteor shower will sling bright shooting stars as the shower reaches its annual peak on the intervening night of December 13 and14 which also coincides with the new moon. The Gemin… [+1741 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "Innovation: Wireless device makes clean fuel from sunlight, water: Study - ETEnergyworld.com", "description": "The device, developed by a team from the University of Cambridge in the UK, is a significant step toward achieving artificial photosynthesis - a process mimicking the ability of plants to convert sunlight into energy", "url": "https://energy.economictimes.indiatimes.com/news/renewable/innovation-wireless-device-makes-clean-fuel-from-sunlight-water-study/77742750", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-77742750,imgsize-163305,width-800,height-434,overlay-etenergyworld/innovation-wireless-device-makes-clean-fuel-from-sunlight-water-study.jpg", "publishedAt": "2020-08-25T12:05:22Z", "content": "London: Researchers have developed a standalone device that converts sunlight, carbon dioxide and water into a carbon-neutral fuel, without requiring any additional components or electricity.The devi… [+2546 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com | Edited by Sparshita Saxena", "title": "Meet Sarah Al-Amiri, woman scientist in charge of leading UAE’s mission to Mars - Hindustan Times", "description": "Amiri expressed her nervousness and said that team has invested more than six years into the mission that primarily aims to find out more about the Red Planet.", "url": "https://www.hindustantimes.com/world-news/meet-sarah-al-amiri-woman-scientist-in-charge-of-leading-uae-s-mission-to-mars/story-l7ytAyxJMSzeHapRkS4MxI.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/07/14/Pictures/sarah-amiri_a35e8c06-c596-11ea-be81-f7b2e356804f.jpg", "publishedAt": "2020-07-14T05:58:41Z", "content": "The United Arab Emirates is planning to send a spacecraft to Mars and the reins of the Arab worlds first interplanetary mission is in the hands of a woman. In an interview with the BBC, scientist Sar… [+1572 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Did it keep its flavour? Stone-age ‘chewing-gum’ yields human DNA - Hindustan Times", "description": "The Stone-Age sample yielded enough information to determine the source’s sex, what she had last eaten and the germs in her mouth. It also told them she probably had dark hair, dark skin and blue eyes.", "url": "https://www.hindustantimes.com/more-lifestyle/did-it-keep-its-flavour-stone-age-chewing-gum-yields-human-dna/story-MG8cySWkEwExCNBsoNdDQK.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2019/12/18/Pictures/_9e1bf0e0-216c-11ea-95dc-bf2b3eebb1f0.jpg", "publishedAt": "2019-12-18T08:03:13Z", "content": "Danish scientists have managed to extract a complete human DNA sample from a piece of birch pitch more than 5,000 years old, used as a kind of chewing gum, a study revealed.\r\nThe Stone-Age sample yie… [+1386 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "The Associated Press", "title": "Stephen Hawking: Extraordinary life of the man who explained the universe - Arab News", "description": "PARIS: In his final years, the only thing connecting the brilliant physicist to the outside world was a couple of inches of frayed nerve in his cheek. As slowly as a word per minute, Stephen Hawking used the twitching of the muscle under his right eye to grin…", "url": "https://www.arabnews.com/node/1266671", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/03/15/1130251-2034869809.jpg", "publishedAt": "2019-08-28T01:53:40Z", "content": "KABUL: Afghan Vice President Amrullah Saleh on Monday took on a defiant tone as he reacted to a letter from US Secretary of State Antony Blinken to President Ashraf Ghani, which included an urgent pr… [+5355 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Agencies", "title": "Stephen Hawking: 10 memorable quotes from his books that will inspire you - Hindustan Times", "description": "Here is a short selection of his many famous observations from his books and interviews.", "url": "https://www.hindustantimes.com/books/stephen-hawking-10-memorable-quotes-from-his-books-that-will-inspire-you/story-7yDOcWNX4ogCFT5NNaj0oM.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2018/03/14/Pictures/files-britain-death-hawkings-science_e573c6b4-2747-11e8-933f-cd1ae5bb99b3.jpg", "publishedAt": "2018-03-14T05:57:18Z", "content": "Physicist and author Stephen Hawking, who has died aged 76, possessed an uncanny ability to come up with memorable phrases and sayings that summed up his world view. Here is a short selection of his … [+1617 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Proud moment for nation: PM Modi on launch of 104 satellites - Hindustan Times", "description": "Prime Minister Narendra Modi hailed on Wednesday scientists for the successful launch of 104 satellites on board a single rocket from the spaceport of Sriharikota.", "url": "https://www.hindustantimes.com/india-news/proud-moment-for-nation-pm-modi-on-launch-of-104-satellites/story-Q19yxprLRPh7DmMIZWjBqI.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/02/15/Pictures/india-space-science-satelite_7edf4fe2-f34d-11e6-800c-c780129a337a.jpg", "publishedAt": "2018-01-23T00:16:37Z", "content": "Prime Minister Narendra Modi hailed on Wednesday scientists for the successful launch of 104 satellites on board a single rocket from the spaceport of Sriharikota.\r\nISRO chief A S Kiran Kumar said at… [+598 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "In pics: Supermoon brightens up skies, two more to be witnessed in Jan 2018 - Hindustan Times", "description": "The Sunday’s supermoon is one in a three-part series, according to NASA. Another supermoon sighting is expected on January 1 and January 31, 2018.", "url": "https://www.hindustantimes.com/science/full-moon-kicks-off-supermoon-trilogy/story-ak5o5EKn1FRBbVrVVymA2H.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/12/03/Pictures/topshot-myanmar-astronomy_56f7062e-d84d-11e7-8802-68a15924f886.jpg", "publishedAt": "2018-01-22T18:36:26Z", "content": "Stargazers were in for a treat on Sunday as they caught a glimpse of the so-called supermoon when the Moon appeared bigger and brighter in the sky as it moved closer to Earth. \r\nThe moon appeared 30%… [+1025 chars]"}]}