{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Ben Panko", "title": "By changing their shape, some bacteria can grow more resilient to antibiotics - Phys.org", "description": "New research led by Carnegie Mellon University Assistant Professor of Physics Shiladitya Banerjee demonstrates how certain types of bacteria can adapt to long-term exposure to antibiotics by changing their shape. The work was published in the journal Nature P…", "url": "https://phys.org/news/2021-01-bacteria-resilient-antibiotics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/bychangingth.jpg", "publishedAt": "2021-01-29T18:02:19Z", "content": "New research led by Carnegie Mellon University Assistant Professor of Physics Shiladitya Banerjee demonstrates how certain types of bacteria can adapt to long-term exposure to antibiotics by changing… [+2930 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Female physicist invents fusion rocket that may take humans to Mars - Daily Mail", "description": "Dr. Fatima Ebrahimi designed a fusion rocket that uses magnetic fields to shoot plasma particles from a craft, which could  take humans to Mars 10 times  faster than current devices.", "url": "https://www.dailymail.co.uk/sciencetech/article-9202081/Female-physicist-invents-new-fusion-rocket-humans-Mars.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/29/16/38641386-0-image-a-17_1611939152918.jpg", "publishedAt": "2021-01-29T16:46:00Z", "content": "Dr. Fatima Ebrahimi has invented a new fusion rocket that could one day take humans to Mars\r\nDr. Fatima Ebrahimi, who works for the US Department of Energy's Princeton Plasma Physics Laboratory (PPPL… [+3900 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "Study identifies the main scientific challenges of undergound hydrogen storage in porous media - Tech Xplore", "description": "Large-scale storage of hydrogen remains largely untested but is essential if hydrogen is to realize its potential to make a significant contribution to achieving net-zero emissions. A new perspectives paper sets out the key scientific challenges and knowledge…", "url": "https://techxplore.com/news/2021-01-main-scientific-undergound-hydrogen-storage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/2-studyidentif.jpg", "publishedAt": "2021-01-29T16:45:28Z", "content": "Large-scale storage of hydrogen remains largely untested but is essential if hydrogen is to realize its potential to make a significant contribution to achieving net-zero emissions. A new perspective… [+4196 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "Ball Aerospace Completes Integration of NASA's IXPE Observatory, Begins Testing - IT News Online", "description": "Ball Aerospace Completes Integration of NASA's IXPE Observatory, Begins Testing", "url": "http://www.itnewsonline.com/PRNewswire/Ball-Aerospace-Completes-Integration-of-NASAs-IXPE-Observatory-Begins-Testing/729696", "urlToImage": null, "publishedAt": "2021-01-29T16:27:22Z", "content": null}, {"source": {"id": null, "name": "The Planetary Society"}, "author": null, "title": "A Martian smile and an Apollo anniversary - The Planetary Society", "description": "We’re gearing up for a Mars landing, and our chief advocate takes a look at crewed Moon programs past and future.", "url": "https://www.planetary.org/the-downlink/a-martian-smile-and-an-apollo-anniversary", "urlToImage": "https://planetary.s3.amazonaws.com/web/assets/email/newsletter/_1200x630_crop_center-center_82_none/hirise-smile.jpg?mtime=1611842769", "publishedAt": "2021-01-29T16:17:38Z", "content": "The worlds exoplanet missions continue to reveal a diversity of other worlds. First up: NASAs TESS and the European Space Agencys CHEOPS discovered a solar system with 5 planets locked in a rhythmic … [+1598 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "To study a rare butterfly, this scientist had to get vertical - Science Magazine", "description": "Studying Raetzer’s ringlet required climbing gear—and no fear of heights", "url": "https://www.sciencemag.org/news/2021/01/study-rare-butterfly-scientist-had-get-vertical", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/Butterflies_NID_1280x720.jpg?itok=3TQzU0xv", "publishedAt": "2021-01-29T16:15:00Z", "content": "High in the Swiss-Italian Alps, a researcher attempts to capture a rare Raetzers ringlet butterfly.\r\nAndrea Battisti \r\nBy Ezra LernerJan. 29, 2021 , 11:15 AM\r\nDesperate cliffs call for desperate meas… [+1686 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "TESS discovers four exoplanets orbiting a nearby sun-like star - India Education Diary", "description": "MIT researchers have discovered four new exoplanets orbiting a sun-like star just over 200 light-years from Earth. Because of the diversity of these planets and brightness of their star, this syste…", "url": "https://indiaeducationdiary.in/tess-discovers-four-exoplanets-orbiting-a-nearby-sun-like-star/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-01-29T16:05:00Z", "content": "MIT researchers have discovered four new exoplanets orbiting a sun-like star just over 200 light-years from Earth. Because of the diversity of these planets and brightness of their star, this system … [+4760 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Smartphone-Based COVID-19 Test Developed That Delivers Results in 10 Minutes - SciTechDaily", "description": "The method analyzes saliva samples and delivers results in about 10 minutes. Researchers at the University of Arizona are developing a COVID-19 testing method that uses a smartphone microscope to analyze saliva samples and deliver results in about 10 minutes.…", "url": "https://scitechdaily.com/smartphone-based-covid-19-test-developed-that-delivers-results-in-10-minutes/", "urlToImage": "https://scitechdaily.com/images/Smartphone-Microscope-Imaging.jpg", "publishedAt": "2021-01-29T16:00:37Z", "content": "University of Arizona researchers image a sample using a smartphone microscope. Credit: UArizona Biosensors Lab\r\nThe method analyzes saliva samples and delivers results in about 10 minutes.\r\nResearch… [+6606 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Astronaut Kate Rubins Advances DNA Sequencing in Space - NASA Johnson", "description": "More than four years ago, NASA astronaut Kate Rubins became the first person to sequence DNA in space. This past week, she moved space science forward with a...", "url": "https://www.youtube.com/watch?v=zqCE8WvxWYk", "urlToImage": "https://i.ytimg.com/vi/zqCE8WvxWYk/maxresdefault.jpg", "publishedAt": "2021-01-29T16:00:31Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Scientists solve a major climate mystery, confirming Earth is hotter than it's been in at least 120 centuries - Space.com", "description": "", "url": "https://www.space.com/scientists-solve-climate-mystery-holocene-temperature-conundrum", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SwJfq2zsmLWQS9hsaxpCHW-1200-80.png", "publishedAt": "2021-01-29T15:48:00Z", "content": "Scientists have resolved a controversial but key climate change mystery\r\n, bolstering climate models and confirming that Earth is hotter than it's been in at least 12,000 years, and perhaps even the … [+3401 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Past river activity in northern Africa reveals multiple Sahara greenings - EurekAlert", "description": "The analysis of sediment cores from the Mediterranean Sea combined with Earth system models tells the story of major environmental changes in North Africa over the last 160,000 years.", "url": "https://www.eurekalert.org/pub_releases/2021-01/ggph-pra012921.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/254932_web.jpg", "publishedAt": "2021-01-29T15:39:22Z", "content": "IMAGE: Engraving of Giraffes near Gobero in Niger, ca. 8,000 yrs old, witness green times in the desert.\r\n view more \r\nCredit: Mike Hettwer, 2006, www.hettwer.com\r\nLarge parts of today's Sahara Deser… [+3735 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Lisa Jucca", "title": "Breakingviews - Review: Mission economy may be mission impossible - Reuters", "description": "In September 1962, then President John F. Kennedy announced that the United States was launching an ambitious plan to land a man on the moon before the end of that decade. The visionary, state-led mission – prompted by Cold War competition – triggered a techn…", "url": "https://www.reuters.com/article/us-health-coronavirus-economy-breakingvi-idUSKBN29Y219", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210129&t=2&i=1549562790&r=LYNXMPEH0S168&w=800", "publishedAt": "2021-01-29T15:04:00Z", "content": "The Apollo 11 Lunar Module ascent stage, with astronauts Neil A. Armstrong and Edwin E. Aldrin Jr. aboard, is photographed from the Command and Service Modules in lunar orbit in this July, 1969 file … [+5757 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Reindeer lichens are having more sex than expected - Phys.org", "description": "In northern Canada, the forest floor is carpeted with reindeer lichens. They look like a moss made of tiny gray branches, but they're stranger than that: they're composite organisms, a fungus and algae living together as one. They're a major part of reindeer …", "url": "https://phys.org/news/2021-01-reindeer-lichens-sex.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/reindeerlich.jpg", "publishedAt": "2021-01-29T15:00:01Z", "content": "In northern Canada, the forest floor is carpeted with reindeer lichens. They look like a moss made of tiny gray branches, but they're stranger than that: they're composite organisms, a fungus and alg… [+7314 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Robert Baxter", "title": "Disappearing glaciers are threatening rare alpine plants with extinction - The Conversation UK", "description": "Glaciers support a unique community of plants, many of which are found nowhere else.", "url": "https://theconversation.com/disappearing-glaciers-are-threatening-rare-alpine-plants-with-extinction-154135", "urlToImage": "https://images.theconversation.com/files/381342/original/file-20210129-23-1pzc20.JPG?ixlib=rb-1.1.0&rect=0%2C765%2C4608%2C2304&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-01-29T14:25:00Z", "content": "High up on a mountain where winds are too fierce, temperatures too extreme and soils too poor for trees, some of the most unusual plants on Earth grow. In this harsh alpine zone where shade is scarce… [+4456 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "On Venus, the alleged phosphine may not be the same - SwordsToday.ie", "description": "One study suggests that the phosphine found in Venus' atmosphere may be just normal sulfur dioxide. Therefore, \"the greatest scientific discovery in", "url": "https://swordstoday.ie/on-venus-the-alleged-phosphine-may-not-be-the-same/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/01/On-Venus-the-alleged-phosphine-may-not-be-the-same.jpg", "publishedAt": "2021-01-29T14:02:00Z", "content": "One study suggests that the phosphine found in Venus’ atmosphere may be just normal sulfur dioxide. Therefore, “the greatest scientific discovery in history” will still have to wait.\r\nA team by mid-S… [+2972 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Sources of new ozone-damaging HCFCs traced back to origins - Phys.org", "description": "An international team of researchers has located the source of recently discovered ozone damaging HCFCs in the atmosphere. In their paper published in Proceedings of the National Academy of Sciences, the group describes using new tools in addition to those us…", "url": "https://phys.org/news/2021-01-sources-ozone-damaging-hcfcs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/sourcesofnew.jpg", "publishedAt": "2021-01-29T13:51:40Z", "content": "An international team of researchers has located the source of recently discovered ozone damaging HCFCs in the atmosphere. In their paper published in Proceedings of the National Academy of Sciences,… [+2695 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How lipids distribute proteins within cells - Phys.org", "description": "Researchers have observed how lipids distribute proteins within cells, a discovery that could open the door to understanding the causes of protein transport related diseases, such as cancer or neurodegenerative diseases.", "url": "https://phys.org/news/2021-01-lipids-proteins-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/howlipidsdis.jpg", "publishedAt": "2021-01-29T13:27:11Z", "content": "Researchers have observed how lipids distribute proteins within cells, a discovery that could open the door to understanding the causes of protein transport related diseases, such as cancer or neurod… [+5475 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "The Moon Could Get Water from 'Wind' in the Earth's Magnetosphere, Finds Study - News18", "description": "One of the most important aspects of space exploration is to discover whether or not there is any water on other planets.", "url": "https://www.news18.com/news/buzz/the-moon-could-get-water-from-wind-in-the-earths-magnetosphere-finds-study-3358700.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611924926_untitled-design-2021-01-29t182458.364.jpg", "publishedAt": "2021-01-29T12:56:11Z", "content": "One of the most important aspects of space exploration is to discover whether or not there is any water on other planets. While then search for water on planets is still on, the hydrogen-oxygen compo… [+2594 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "NASA Begins Building Orion Spacecraft that Will Return Humans to Moon - ExtremeTech", "description": "NASA's primary Orion contractor Lockheed Martin has just started work on one very important project: the first welds of the Orion capsule that will return humans to the moon.", "url": "https://www.extremetech.com/extreme/319565-nasa-begins-building-orion-spacecraft-that-will-return-humans-to-moon", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2021/01/artemis_iii_orion_weld_maf.jpg", "publishedAt": "2021-01-29T12:30:48Z", "content": "NASA is going back to the moon; at least that’s the plan. To get there, the agency has to develop a new generation of crewed spacecraft, including the Space Launch System (SLS) megarocket and the Ori… [+2150 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "The UAE's Hope mission is nearly to Mars, and scientists can't wait - Space.com", "description": "\"We're just counting down the final few days before we arrive to the Red Planet.\"", "url": "https://www.space.com/uae-mars-hope-mission-ready-for-arrival", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FRqpFcnobky4VWCH3VquG-1200-80.jpg", "publishedAt": "2021-01-29T12:00:00Z", "content": "With less than two weeks before the country's first-ever interplanetary mission slips into orbit around Mars, United Arab Emirates scientists can't wait for the Hope orbiter\r\n's arrival.\r\nThe UAE lau… [+4080 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "SpaceX vs NASA: who will get us to the Moon first? Here's how their latest rockets compare - Nanowerk", "description": "To enable flights to the Moon and beyond, both NASA and SpaceX are developing new heavy lift rockets: SpaceX's Starship and NASA's Space Launch System. But how do they differ and which one is more powerful?", "url": "https://www.nanowerk.com/news2/space/newsid=57167.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57167.jpg", "publishedAt": "2021-01-29T11:59:26Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "Scientists have jumpstarted the brains of two people who were in a coma - SlashGear", "description": "In 2016, a team from UCLA led by Martin Monti successfully jumpstarted the brain of a 25-year-old man who was recovering from a coma using ultrasound. At the time, Monti admitted that the team migh…", "url": "https://www.slashgear.com/scientists-have-jumpstarted-the-brains-of-two-people-who-were-in-a-coma-29657291/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/01/scientists-jump-brain.jpg", "publishedAt": "2021-01-29T11:03:45Z", "content": "In 2016, a team from UCLA led by Martin Monti successfully jumpstarted the brain of a 25-year-old man who was recovering from a coma using ultrasound. At the time, Monti admitted that the team might … [+2065 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists calculated the mass range for Dark Matter - Tech Explorist", "description": "Dark Matter particles must have a mass between 10-3 eV and 107 eV. That's a much tighter range than the 10-24 eV -- 1019 GeV spectrum which is generally theorised.", "url": "https://www.techexplorist.com/scientists-calculated-mass-range-dark-matter/37539/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/dark-matter.jpg", "publishedAt": "2021-01-29T10:16:00Z", "content": "A new study drastically narrows the scope of possible masses for Dark Matter particles. Scientists from the University of Sussex used the fact that gravity acts on Dark Matter just as it acts on the … [+2035 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rachel Lopez", "title": "Good morning, Starshine! Scroll through the universe with the most iconic images of space - Hindustan Times", "description": "As telescopes gets smarter and space voyages more adventurous, take a look at the best recent views of worlds beyond our own, and what it takes to create them.", "url": "https://www.hindustantimes.com/lifestyle/travel/good-morning-starshine-scroll-through-the-universe-with-the-most-iconic-images-of-space-101611914580683.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/29/550x309/fe7aa8fc-6214-11eb-96d8-f0c1ae38b38f_1611914579650.jpg", "publishedAt": "2021-01-29T10:03:00Z", "content": "Its a big year for astrophysicists. In October, NASA will launch the worlds largest, most powerful observatory into space. The James Webb Space Telescope, much delayed, much redesigned, has already c… [+13129 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "5 Surprising Discoveries From NASA’s Mars Curiosity Rover - Forbes", "description": "A look back at the Mars Curiosity rover’s science legacy thus far.", "url": "https://www.forbes.com/sites/brucedorminey/2021/01/29/5-surprising-discoveries-from-nasas-mars-curiosity-rover/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F6013ce0f5756f4d579d4bbc2%2F0x0.jpg", "publishedAt": "2021-01-29T09:18:12Z", "content": "Curiosity took this selfie at a location nicknamed \"Mary Anning\" after a 19th century English ... [+] paleontologist. Curiosity snagged three samples of drilled rock at this site on its way out of th… [+7325 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": null, "title": "The Full Moon Might Be Affecting Your Sleep and Menstrual Cycles, Studies Find - Vice Impact", "description": "While it may or may not give werewolves their power, the moon may be impacting when you go to bed and how long you sleep for.", "url": "https://www.vice.com/en/article/jgqkvk/full-moon-affects-sleep-menstrual-cycles", "urlToImage": "https://video-images.vice.com/articles/6013b152060c7e0095950cb2/lede/1611903472424-alexander-andrews-vgcerdhrc3e-unsplash.jpeg?image-resize-opts=Y3JvcD0xeHc6MC41NzU2eGg7MHh3LDAuMjE1OXhoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg", "publishedAt": "2021-01-29T07:13:00Z", "content": "Study co-author Leandro Casiraghi, postdoctoral scholar at the department of biology at the University of Washington, said that the moon emits brighter light after sunset on the days leading up to th… [+1326 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Torsten Kriening", "title": "ESA launches lab with German Research Centre for AI - SpaceWatch.Global", "description": "Paris, 29 January 2021. - You could call it", "url": "https://spacewatch.global/2021/01/esa-launches-lab-with-german-research-centre-for-ai/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2021/01/A_satellite_mega-constellation-660x330.jpg", "publishedAt": "2021-01-29T07:06:33Z", "content": "Paris, 29 January 2021. – You could call it “SpAIce”: The European Space Agency (ESA) and the German Research Centre for Artificial Intelligence (DFKI) are launching a research laboratory in Kaisersl… [+1090 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Russia's Dyatlov mountain mystery unraveled after many decades, unexplained deaths - Firstpost", "description": "A series of odd observations during the Dyatlov Pass incident have made it one of Russia's greatest mysteries. It remained classified until the 1970s.", "url": "https://www.firstpost.com/tech/science/russias-dyatlov-mountain-mystery-unraveled-after-many-decades-unexplained-deaths-9251951.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/Russia-reopened-investigation-into-the-60-year-old-Dyatlov-Pass-mystery-in-2019_AP.jpg", "publishedAt": "2021-01-29T06:42:40Z", "content": "Agence France-PresseJan 29, 2021 12:12:40 IST\r\nThe mysterious deaths of nine young hikers in the winter of 1959 at a remote pass in the Ural mountains has been an odd fascination for Russia for decad… [+3899 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Vanita Srivastava", "title": "Mangalyaan off Earth’s influence area tonight - Hindustan Times", "description": "The Indian Space Research Organisation is gearing itself for the critical event of moving Mangalyaan out of the Earth’s sphere of influence, a little after Saturday midnight. The Trans-Mars Injection, as it is called, will slingshot Mangalyaan into its helioc…", "url": "https://www.hindustantimes.com/india/mangalyaan-off-earth-s-influence-area-tonight/story-WUKc9EUvkTg6HAfmJoimkJ.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_640x362/HT/p1/2013/11/05/Incoming/Pictures/1147337_Wallpaper2.jpg", "publishedAt": "2021-01-29T03:09:47Z", "content": "The Indian Space Research Organisation is gearing itself for the critical event of moving Mangalyaan out of the Earths sphere of influence, a little after Saturday midnight.\r\nThe Trans-Mars Injection… [+1601 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists capture the moments of nascent crystal formation and growth: The crystals undergo stochastic fluctuation between crystalline and disordered states at the earliest stage of growth - Science Daily", "description": "Scientists used high-performance TEM to image the process of gold atoms assembling into nanocrystals. It was discovered that the atoms undergo a spontaneous transition between disordered and crystalline states.", "url": "https://www.sciencedaily.com/releases/2021/01/210128155641.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-29T01:46:20Z", "content": "Conversion of most materials into organized crystalline structure starts with the nucleation process. One everyday example that many people may be familiar with is the rapid crystalization of superco… [+4427 chars]"}, {"source": {"id": null, "name": "Haveeru.com.mv"}, "author": "Max Grant", "title": "The Chapez telescope reveals the cosmic exoplanet 'ballet' for the first time - haveeruonline", "description": "About 200 light-years from Earth, these five outer planets are in orbit, with chronological accuracy around their parent star. The European Space Agency's", "url": "https://www.haveeru.com.mv/the-chapez-telescope-reveals-the-cosmic-exoplanet-ballet-for-the-first-time/", "urlToImage": "https://news.google.com/img/sempre-editora/novo-portal/googlenews-otempo-mob.svg", "publishedAt": "2021-01-29T00:08:06Z", "content": "The European Space Agency’s Chapes Space Telescope (ESA) first revealed the cosmic “ballet” of five exoplanets, with differences in density calling into question the formation theories of these stars… [+2767 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Engine Test for NASA Artemis Moon Rocket - NASA", "description": "Watch an RS-25 engine that will help power our Space Launch System rocket on future missions to the Moon and Mars come alive at NASA's Stennis Space Center. ...", "url": "https://www.youtube.com/watch?v=gaJTDvOIXbk", "urlToImage": "https://i.ytimg.com/vi/gaJTDvOIXbk/maxresdefault.jpg", "publishedAt": "2021-01-28T23:07:30Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers reveal in-situ manipulation of active gold-titanium dioxide interface - Phys.org", "description": "An international joint research team from the Shanghai Advanced Research Institute of the Chinese Academy of Sciences, along with Zhejiang University and the Technical University of Denmark, reported an in-situ strategy to manipulate interfacial structure wit…", "url": "https://phys.org/news/2021-01-reveal-in-situ-gold-titanium-dioxide-interface.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/11-researchersr.jpg", "publishedAt": "2021-01-28T19:00:05Z", "content": "An international joint research team from the Shanghai Advanced Research Institute of the Chinese Academy of Sciences, along with Zhejiang University and the Technical University of Denmark, reported… [+2794 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Chemists settle battery debate, propel research forward - Nanowerk", "description": "Researchers used ultrabright x-rays to identify lithium hydride and a new form of lithium fluoride in the interphase of lithium metal anodes.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57158.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57158.jpg", "publishedAt": "2021-01-28T18:38:34Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": "Nadia Whitehead", "title": "High school students discover exoplanets during mentoring program - Harvard Gazette", "description": "At the Center for Astrophysics | Harvard & Smithsonian mentorship program, two students discovered four new exoplanets about 200-light-years away from Earth.", "url": "https://news.harvard.edu/gazette/story/2021/01/high-school-students-discover-exoplanets-during-mentoring-program/", "urlToImage": "https://news.harvard.edu/wp-content/uploads/2021/01/HD108236b_highres_2500-1120x630.jpg", "publishedAt": "2021-01-28T18:34:15Z", "content": "Our species has long been contemplating planets beyond our solar system and with multi-planetary systems, youre kind of hitting the jackpot, he said. The planets originated from the same disk of matt… [+1481 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Alexandru Micu", "title": "Saturn is tilted. The fault lies with its moons - ZME Science", "description": "Who doesn't get tilted every now and then, eh?", "url": "https://www.zmescience.com/science/saturn-is-tilted-the-fault-lies-with-its-moons/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2021/01/planet-67672_1920.jpg", "publishedAt": "2021-01-28T18:32:54Z", "content": "Even the greatest of us have to take those around us into account. Its true on a social level and, as new research shows, its true on an astronomical level as well.\r\nImage via Pixabay.\r\nPlanets and t… [+2879 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New concept for rocket thruster exploits the mechanism behind solar flares - Nanowerk", "description": "A new type of rocket thruster that could take humankind to Mars and beyond has been proposed by a physicist. The device would apply magnetic fields to cause particles of plasma to shoot out the back of a rocket and propel the craft forward.", "url": "https://www.nanowerk.com/news2/space/newsid=57155.php", "urlToImage": "https://www.nanowerk.com/news2/space/id57155.jpg", "publishedAt": "2021-01-28T18:17:03Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Thick lithosphere casts doubt on plate tectonics in Venus's geologically recent past - EurekAlert", "description": "A study of a giant impact crater on Venus suggests that its lithosphere was too thick to have had Earth-like plate tectonics, at least for much of the past billion years.", "url": "https://www.eurekalert.org/pub_releases/2021-01/bu-tlc012821.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/254855_web.jpg", "publishedAt": "2021-01-28T17:49:28Z", "content": "IMAGE: Mead crater, the largest impact basin on Venus, is encircled by two rocky rings, which provide valuable information about the planet's lithosphere.\r\n view more \r\nCredit: NASA\r\nPROVIDENCE, R.I.… [+4459 chars]"}, {"source": {"id": null, "name": "Royal Society of Chemistry"}, "author": null, "title": "Wombat research that's not to be sniffed at - Royal Society of Chemistry", "description": null, "url": "https://www.rsc.org/news-events/articles/2021/jan/wombat-poo/", "urlToImage": null, "publishedAt": "2021-01-28T17:35:46Z", "content": "Wombat intestines are approximately 10-metres long, ten-times the length of a typical wombat’s body.\r\nWhen humans eat, food items travel through the gut in a matter of a day or two. A wombat’s digest… [+1747 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "High Efficiency at Low Cost: New Catalyst Moves Seawater Desalination, Hydrogen Production Closer to Commercialization - SciTechDaily", "description": "Fast, one-step assembly at room temperature yields high efficiency at low cost. Seawater makes up about 96% of all water on earth, making it a tempting resource to meet the world’s growing need for clean drinking water and carbon-free energy. And scientists a…", "url": "https://scitechdaily.com/high-efficiency-at-low-cost-new-catalyst-moves-seawater-desalination-hydrogen-production-closer-to-commercialization/", "urlToImage": "https://scitechdaily.com/images/Seawater-Desalination-Hydrogen-Production-Concept.gif", "publishedAt": "2021-01-28T17:20:33Z", "content": "Fast, one-step assembly at room temperature yields high efficiency at low cost.\r\nSeawater makes up about 96% of all water on earth, making it a tempting resource to meet the world’s growing need for … [+3942 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Modeling study of ancient thumbs traces the history of hominin thumb dexterity - Phys.org", "description": "Despite long-standing ideas about the importance of thumb evolution in tool use and development, questions remain about exactly when human-like manual dexterity and efficient thumb use arose—and which hominin species was the first to have this ability. Now, r…", "url": "https://phys.org/news/2021-01-ancient-thumbs-history-hominin-thumb.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/60129d1d43f08.jpg", "publishedAt": "2021-01-28T16:43:26Z", "content": "Despite long-standing ideas about the importance of thumb evolution in tool use and development, questions remain about exactly when human-like manual dexterity and efficient thumb use aroseand which… [+5103 chars]"}, {"source": {"id": null, "name": "jacksonprogress-argus"}, "author": "Katie Hunt, CNN", "title": "Thumbs gave human ancestors a 'formidable' advantage | World/Nation | jacksonprogress-argus.com - jacksonprogress-argus", "description": "Whether we're texting or using tools, our hands -- perhaps more than any other body part -- are what equip us for modern life.", "url": "https://www.jacksonprogress-argus.com/news/world_nation/thumbs-gave-human-ancestors-a-formidable-advantage/article_47bd37f6-9558-51d1-8e60-2a948a5d9fe1.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg", "publishedAt": "2021-01-28T16:07:58Z", "content": "Whether we're texting or using tools, our hands -- perhaps more than any other body part -- are what equip us for modern life.\r\nThe killer app in the evolution of our hands was our opposable thumbs, … [+6425 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Risk of being scooped drives scientists to shoddy methods - Science Magazine", "description": "Model shows racing for results leads to lower standards", "url": "https://www.sciencemag.org/news/2021/01/risk-being-scooped-drives-scientists-shoddy-methods", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/race_1280p.jpg?itok=h16UuqRT", "publishedAt": "2021-01-28T16:00:00Z", "content": "In the race for a COVID-19 vaccine, second place still offers gloryunlike some scientific fields.\r\nKORA_SUN/SHUTTERSTOCK, ADAPTED BY C. SMITH/SCIENCE\r\nBy Cathleen OGradyJan. 28, 2021 , 11:00 AM\r\nLeon… [+4484 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Rules of resistance against transgene silencing - Phys.org", "description": "Clear rules for engineering transgenes that can be inserted and propagated over multiple generations of nematodes include ways to protect inserted genes from the organism's natural defenses against foreign DNA. Developed by KAUST researchers, the rules have i…", "url": "https://phys.org/news/2021-01-resistance-transgene-silencing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/6012b5dc8d194.jpg", "publishedAt": "2021-01-28T15:19:39Z", "content": "Clear rules for engineering transgenes that can be inserted and propagated over multiple generations of nematodes include ways to protect inserted genes from the organism's natural defenses against f… [+3348 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Jake Massey", "title": "Mangrove Tree Extract Could Help Tackle Baldness, Study Finds - LADbible", "description": "Researchers believe it can prevent hair loss and promote hair growth", "url": "https://www.ladbible.com/news/news-mangrove-tree-extract-could-help-tackle-baldness-study-finds-20210128", "urlToImage": "https://www.ladbible.com/cdn-cgi/image/width=808,quality=70,format=jpeg,fit=cover,dpr=1/https%3A%2F%2Fs3-images.ladbible.com%2Fs3%2Fcontent%2Fa00a4ca860121d22d233ad62827234e6.png", "publishedAt": "2021-01-28T14:05:00Z", "content": "Researchers in Thailand believe a mangrove tree extract could help to tackle baldness. \r\nThe extract, called Avicequinon C, was found to stop the body producing hormones that can result in hair loss.… [+3057 chars]"}, {"source": {"id": null, "name": "hortidaily.com"}, "author": null, "title": "Study on growing plants in space with quantum dot films - hortidaily.com", "description": "UbiQD, a New Mexico-based advanced materials company, announced today that it has published the results of the first phase of its NASA-funded plant trials in the open-access Nature Research…", "url": "https://www.hortidaily.com/article/9288548/study-on-growing-plants-in-space-with-quantum-dot-films/", "urlToImage": "https://www.hortidaily.com/remote.axd?https://agfstorage.blob.core.windows.net/misc/HD_com/2021/01/28/ubiq.jpg?preset=OgImage", "publishedAt": "2021-01-28T13:57:48Z", "content": "UbiQD, a New Mexico-based advanced materials company, announced today that it has published the results of the first phase of its NASA-funded plant trials in the open-access Nature Research journal, … [+1709 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Size of helium nucleus measured more precisely than ever before - Nanowerk", "description": "In experiments, an international research collaboration has measured the radius of the atomic nucleus of helium five times more precisely than ever before. With the aid of the new value, fundamental physical theories can be tested and natural constants can be…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57149.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57149.jpg", "publishedAt": "2021-01-28T13:13:07Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Paul Scott Anderson", "title": "Astronomers find possible exoplanet-in-the-making within its own whirlpool - EarthSky", "description": "Astronomers have discovered a possible newly-born planet forming within its own", "url": "https://earthsky.org/space/star-hd-163296-new-planet-seen-forming-within-whirlpool", "urlToImage": "https://earthsky.org/upl/2021/01/HD-163296-young-star-planet-forming-in-bright-vortex-Very-Large-Telescope-300x300.jpg", "publishedAt": "2021-01-28T12:56:37Z", "content": "View of the young star HD 163296, with the newly-discovered vortex or “whirlpool” of dust and pebbles circling around it. The researchers think a new planet is forming in the brightest region, where … [+6199 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Phosphine on Venus? It’s probably just sulfur dioxide - ZME Science", "description": "Life on Venus is as unlikely as ever.", "url": "https://www.zmescience.com/science/news-science/venus-phosphine-not-really-28012021/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2021/01/774_PIA00107_detail.jpg", "publishedAt": "2021-01-28T12:44:43Z", "content": "Enthusiasm over a Venusian compound associated with life has been quenched by a new study. It’s probably just sulfur dioxide, researchers now believe.\r\nA 3D perspective view of the surface of Venus. … [+4861 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Why picking the right location for Artemis base camp on Moon is a challenge for NASA - EdexLive", "description": "American astronauts in 2024 will take their first steps near the Moon's South Pole: the land of extreme light, extreme darkness, and frozen water", "url": "https://www.edexlive.com/news/2021/jan/28/why-picking-the-right-location-for-artemis-base-camp-on-moon-is-a-challenge-for-nasa-17741.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/1/8/w600X390/nasa-874480_960_720.jpg", "publishedAt": "2021-01-28T12:43:00Z", "content": "As NASA plans to land the first woman and next man on the Moon by 2024 with the Artemis programme, scientists and engineers are helping NASA determine the precise location of the Artemis Base Camp co… [+3301 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Breanna Bishop", "title": "Carbon at pressures 5 times that of the Earth's core breaks crystal formation record - Phys.org", "description": "Carbon, the fourth most abundant element in the universe, is a building block for all known life and a material that sits in the interior of carbon-rich exoplanets.", "url": "https://phys.org/news/2021-01-carbon-pressures-earth-core-crystal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/experimentsa.jpg", "publishedAt": "2021-01-28T12:32:42Z", "content": "Carbon, the fourth most abundant element in the universe, is a building block for all known life and a material that sits in the interior of carbon-rich exoplanets.\r\nDecades of intense investigation … [+3869 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Christian Borg", "title": "Understanding how genetic motifs conduct 'the music of life' - Phys.org", "description": "Our genetic codes control not only which proteins our cells produce, but also—to a great extent—in what quantity. This groundbreaking discovery, applicable to all biological life, was recently made by systems biologists at Chalmers University of Technology, S…", "url": "https://phys.org/news/2021-01-genetic-motifs-music-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/7-understandin.jpg", "publishedAt": "2021-01-28T12:00:33Z", "content": "Our genetic codes control not only which proteins our cells produce, but alsoto a great extentin what quantity. This groundbreaking discovery, applicable to all biological life, was recently made by … [+5508 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Dark matter not 'super heavy' or 'super light': In a first, scientists calculate its mass range - Down To Earth Magazine", "description": "Quantum gravity, a combination of Einstein&rsquo;s concepts of quantum physics and general relativity, was used in the research", "url": "https://www.downtoearth.org.in/news/science-technology/dark-matter-not-super-heavy-or-super-light-in-a-first-scientists-calculate-its-mass-range-75243", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2021-01-28/0.39848300_1611828140_wiki-dark-matter.jpg", "publishedAt": "2021-01-28T11:37:44Z", "content": "Quantum gravity, a combination of Einstein’s concepts of quantum physics and general relativity, was used in the researchAround 95 percent of the Universe is unknown to human beings. It is often refe… [+4699 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anupam Bordoloi", "title": "Red Planet most plausible site for human settlement: Isro - Hindustan Times", "description": "As India’s first mission to Mars, Mangalyaan, blasted off to space on Tuesday, a senior Isro scientist closely associated with the grand project said that the red planet is the most “plausible” site for human settlement if mankind ever needs a second home. An…", "url": "https://www.hindustantimes.com/india/red-planet-most-plausible-site-for-human-settlement-isro/story-oDnnKfCdaLgNiq8RvDfpqO.html", "urlToImage": "https://images.hindustantimes.com/rf/image_size_640x362/HT/p1/2013/11/05/Incoming/Pictures/1147333_Wallpaper2.jpg", "publishedAt": "2021-01-28T11:04:00Z", "content": "As Indias first mission to Mars, Mangalyaan, blasted off to space on Tuesday, a senior Isro scientist closely associated with the grand project said that the red planet is the most plausible site for… [+2320 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Madeleine Finlay", "title": "Covid-19: What can astronauts teach us about coping in lockdown? – podcast - The Guardian", "description": "With months Covid-19 restrictions ahead, how do we cope with the monotony, isolation and stress? Science Weekly gets inspiration from the people who put themselves through extremes", "url": "https://www.theguardian.com/science/audio/2021/jan/28/covid-19-what-can-astronauts-teach-us-about-coping-lockdown", "urlToImage": "https://i.guim.co.uk/img/media/af42da520a041bc7aff9ebad30b4c697f475c467/0_0_5000_3000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1d7f385de352e78069f75f084e109dbe", "publishedAt": "2021-01-28T10:25:00Z", "content": "As we head into yet another month of lockdown in the UK, with hospitals overwhelmed, how do we cope with the monotony, isolation, boredom and stress? Science Weekly gets inspiration from the people w… [+174 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "635 million-year-old fungi-like microfossil that bailed us out of an ice age discovered - Phys.org", "description": "When you think of fungi, what comes to mind may be a crucial ingredient in a recipe or their amazing ability to break down dead organic matter into vital nutrients. But new research by Shuhai Xiao, a professor of geosciences with the Virginia Tech College of …", "url": "https://phys.org/news/2021-01-million-year-old-fungi-like-microfossil-bailed-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/635millionye.jpg", "publishedAt": "2021-01-28T10:00:01Z", "content": "When you think of fungi, what comes to mind may be a crucial ingredient in a recipe or their amazing ability to break down dead organic matter into vital nutrients. But new research by Shuhai Xiao, a… [+7127 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Oceans warmed steadily over 12,000 years: study - Global Times", "description": "Earth's oceans have been warming consistently throughout the last 12,000 years, according to research published on Wednesday that authors said showed clearly humanity's profound effect on the climate.", "url": "https://www.globaltimes.cn/page/202101/1214251.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-01-28/ab526ad5-028a-43fa-86ce-4bf59baab66e.jpeg", "publishedAt": "2021-01-28T09:48:00Z", "content": "Earth's oceans have been warming consistently throughout the last 12,000 years, according to research published on Wednesday that authors said showed clearly humanity's profound effect on the climate… [+2651 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Why NASA Has Delayed Return Journey of Probe that Collected Historic Asteroid Bennu Sample - News18", "description": "National Aeronautics and Space Administration&rsquo;s (NASA) has announced that the return journey of its asteroid-sampling OSIRIS-REx probe is being delayed by two months.", "url": "https://www.news18.com/news/buzz/why-nasa-has-delayed-return-journey-of-probe-that-collected-historic-asteroid-bennu-sample-3354530.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611825019_untitled-design-2021-01-28t143833.825.png", "publishedAt": "2021-01-28T09:14:14Z", "content": "National Aeronautics and Space Administration’s (NASA) has announced that the return journey of its asteroid-sampling OSIRIS-REx probe is being delayed by two months. In a statement on Tuesday, the A… [+2643 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Georgia Nica", "title": "This Hot Jupiter Has No Clouds: What Should You Know - Optic Flux - Optic Flux", "description": "Recent exoplanet-hunting mission puts in the spotlight a quite odd cosmic body. Without clouds, but with a clear atmosphere, an exoplanet unveiled itself in front of the space telescopes’ eyes,...", "url": "http://www.opticflux.com/this-hot-jupiter-has-no-clouds-what-should-you-know/4561/", "urlToImage": "https://i0.wp.com/www.opticflux.com/wp-content/uploads/2021/01/lookalike-jupiter.jpg?fit=833%2C486", "publishedAt": "2021-01-28T09:10:59Z", "content": "Recent exoplanet-hunting mission puts in the spotlight a quite odd cosmic body. Without clouds, but with a clear atmosphere, an exoplanet unveiled itself in front of the space telescopes’ eyes, like … [+1954 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "May 2021 total lunar eclipse: Check-out important details - India Today", "description": "The first total lunar eclipse of 2021 will occur on May 26. The eclipse would begin at 2:17 pm in India and end at 7:19 pm. Here is all you need to know about the first Chandra Grahan of year.", "url": "https://www.indiatoday.in/information/story/may-2021-total-lunar-eclipse-check-out-important-details-1763349-2021-01-28", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/lunar-eclipse__2_-647x363.jpeg?VoD5LTYsnE2LFIsQj3bNIgYMfwA2.drN", "publishedAt": "2021-01-28T07:35:49Z", "content": "When does an eclipse take place? An eclipse takes place when one heavenly body such as a moon or planet moves into the shadow of another heavenly body. On Earth, we can experience two kinds of eclips… [+1435 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "NASA captures portraits of ‘Lost Galaxy’ in Virgo Constellation - Jagran Josh", "description": "Also known as NGC 4535, the Lost galaxy is one of the largest of the 2000 or so galaxies in the Virgo cluster and is located about 50 million", "url": "https://www.jagranjosh.com/current-affairs/nasa-captures-portraits-of-lost-galaxy-in-virgo-constellation-1611818354-1", "urlToImage": "https://img.jagranjosh.com/images/2021/January/2812021/Galaxy in Virgo constellation.jpg", "publishedAt": "2021-01-28T07:26:00Z", "content": "The Hubble Space Telescope of National Aeronautics and Space Administration- NASA has captured the stunning image of Lost Galaxy in the Virgo constellation.\r\nAlso known as NGC 4535, the galaxy is one… [+2027 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Phases of Moon May Influence Duration of Sleep, Menstrual Cycles, Scientists Say in New Study - News18", "description": "A new study suggests that the myth about the Moon influencing menstrual cycles and sleeping patterns may be true after all.", "url": "https://www.news18.com/news/buzz/phases-of-moon-may-influence-duration-of-sleep-menstrual-cycles-scientists-say-in-new-study-3353804.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611818317_untitled-design-2021-01-28t124633.047.png", "publishedAt": "2021-01-28T07:19:31Z", "content": "A new study suggests that the myth about the Moon influencing menstrual cycles and sleeping patterns may be true after all. According to a study conducted by scientists from the University of Washing… [+2585 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: Coronavirus variants escape effects of antibody drugs Scientists produce embryos in race to save northern white rhino from extinction - Devdiscourse", "description": "Drugs, vaccines less effective vs new virus variants; antibody cocktail may protect patients' contacts  The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the …", "url": "https://www.devdiscourse.com/article/science-environment/1424836-science-news-roundup-coronavirus-variants-escape-effects-of-antibody-drugs-scientists-produce-embryos-in-race-to-save-nort", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_08_2020_20_23_44_6331919.jpg?width=920&format=jpeg", "publishedAt": "2021-01-28T04:57:46Z", "content": "Following is a summary of current science news briefs.\r\nDrugs, vaccines less effective vs new virus variants; antibody cocktail may protect patients' contacts\r\nThe following is a roundup of some of t… [+2172 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "NASA shares images of ‘cosmic sparkle’ from a dwarf galaxy, leaves netizens in awe - The Indian Express", "description": "Shared on the official Instagram of NASA’s Hubble Space Telescope's, the picture is of I Zwicky 18, a dwarf, an irregular galaxy which is estimated to be 59 million light-years away.", "url": "https://indianexpress.com/article/trending/trending-globally/nasa-hubble-galaxy-picture-7163816/", "urlToImage": "https://images.indianexpress.com/2021/01/NASA-feature-1.jpg", "publishedAt": "2021-01-28T04:35:08Z", "content": "NASA recently graced the internet with a ‘cosmic sparkle’ from an irregular dwarf galaxy and netizens cannot seem to get enough of it.\r\nShared on the official Instagram of NASAs Hubble Space Telescop… [+535 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "NASA Pays Tribute to Fallen Heroes with Day of Remembrance - IT News Online", "description": "NASA Pays Tribute to Fallen Heroes with Day of Remembrance", "url": "http://www.itnewsonline.com/PRNewswire/NASA-Pays-Tribute-to-Fallen-Heroes-with-Day-of-Remembrance/729200", "urlToImage": null, "publishedAt": "2021-01-27T22:09:44Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Need a lift? SpaceX launches record spacecraft in cosmic rideshare program - ETTelecom.com", "description": "The Falcon 9 rocket lifted off at 10 a.m. EST from the Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida. It flew south along the eastern coast of Florida on its way to space, the company said.", "url": "https://telecom.economictimes.indiatimes.com/news/need-a-lift-spacex-launches-record-spacecraft-in-cosmic-rideshare-program/80441803", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-80441803,imgsize-30060,width-800,height-434,overlay-ettelecom/need-a-lift-spacex-launches-record-spacecraft-in-cosmic-rideshare-program.jpg", "publishedAt": "2021-01-25T02:54:52Z", "content": "By Helen CosterA veteran rocket from billionaire entrepreneur Elon Musk's SpaceX aerospace company launched 143 spacecraft into space on Sunday, a new record for the most spaceships deployed on a sin… [+1101 chars]"}]}