{"status": "ok", "totalResults": 40, "articles": [{"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "High resolution space debris imagery - BollyInside", "description": "PICTURE: From From left to right: Space debris modeled as a group of six reflective objects, a developed image of the debris regardless of the rotation of", "url": "https://www.bollyinside.com/news/high-resolution-space-debris-imagery/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/02/High-resolution-space-debris-imagery.jpg", "publishedAt": "2021-02-26T02:19:15Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Putting graphene in a spin - Nanowerk", "description": "Researchers induce artificial 'magnetic texture' in graphene, a quantum science advancement that could help lead to more powerful semiconductors, computers.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57387.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57387.jpg", "publishedAt": "2021-02-25T20:35:58Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Pinkstone", "title": "Climate change has weakened the Gulf Stream System 'close to tipping point' - Daily Mail", "description": "Known formally as the Atlantic Meridional Overturning Circulation (AMOC), it is the driving force which brings warm water from the Gulf of Mexico up to the UK.", "url": "https://www.dailymail.co.uk/sciencetech/article-9300711/The-Gulf-Stream-weakest-1-000-YEARS-climate-change.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/25/19/39772864-0-image-a-29_1614280670702.jpg", "publishedAt": "2021-02-25T19:25:22Z", "content": "Climate change has weakened the ocean current which drives the Gulf Stream to its lowest ebb for more than 1,000 years.\r\nKnown formally as the Atlantic Meridional Overturning Circulation (AMOC), it i… [+4667 chars]"}, {"source": {"id": null, "name": "Reportdoor.com"}, "author": null, "title": "How one of Google's massive undersea cables detects earthquakes - Report Door", "description": "The web of undersea cables that transmit data around the world could one day be used to track earthquakes and tsunamis, according to new research. During", "url": "https://www.reportdoor.com/how-one-of-googles-massive-undersea-cables-detects-earthquakes/", "urlToImage": null, "publishedAt": "2021-02-25T19:09:08Z", "content": "The web of undersea cables that transmit data around the world could one day be used to track earthquakes and tsunamis, according to new research. During a test run last year, one of Googles fiber-op… [+4030 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Milan Lenters", "title": "Electric Auke: 'Mining raw materials in space? Why not?' - Innovation Origins", "description": "Every other week, we ask sustainability expert Auke Hoekstra what is involved in making the Earth more sustainable.Today: can we mine the universe?", "url": "https://innovationorigins.com/electric-auke-mining-raw-materials-in-space-why-not/", "urlToImage": "https://innovationorigins.com/app/uploads/2019/12/Electric-Auke3.png", "publishedAt": "2021-02-25T19:08:06Z", "content": "Many a science-fiction writer has already ventured into the realms of mining raw materials in space. A futuristic fantasy? Auke doesn’t think so. “Maybe I’m being called a bit of a nutcase now, but I… [+5752 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Dinosaur 'teenage terrors' crowded out the competition - Devdiscourse", "description": "The Mesozoic Era was the geological time span often called the age of dinosaurs.  Juveniles of North American Cretaceous megatheropods like Tyrannosaurus and Albertosaurus were relatively light and agile, Schroeder noted, making them well-suited to hunt diffe…", "url": "https://www.devdiscourse.com/article/science-environment/1473910-dinosaur-teenage-terrors-crowded-out-the-competition", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_06_2019_18_30_34_8586054.jpg?width=920&format=jpeg", "publishedAt": "2021-02-25T19:00:28Z", "content": "As adults, huge meat-eating dinosaurs such as Tyrannosaurus rex - sometimes topping 9 tons in weight - ruled the Cretaceous Period landscape.\r\nBut even as juveniles, scientists said on Thursday, thes… [+2444 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Apollo rock samples capture key moments in the Moon's early history - Science Daily", "description": "Volcanic rock samples collected during NASA's Apollo missions bear the isotopic signature of key events in the early evolution of the Moon, a new analysis found. Those events include the formation of the Moon's iron core, as well as the crystallization of the…", "url": "https://www.sciencedaily.com/releases/2021/02/210225082514.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-25T18:53:58Z", "content": "Volcanic rock samples collected during NASA's Apollo missions bear the isotopic signature of key events in the early evolution of the Moon, a new analysis found. Those events include the formation of… [+4182 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Find Smoking Gun Evidence in Dinosaur-Killing Asteroid Case - Futurism", "description": "\"The circle is now finally complete.\"", "url": "https://futurism.com/the-byte/scientists-smoking-gun-evidence-dinosaur-killing-asteroid", "urlToImage": "https://wp-assets.futurism.com/2021/02/dino.jpg", "publishedAt": "2021-02-25T18:52:09Z", "content": "The cold case was reopened thanks to new evidence: asteroid dust inside the ancient impact crater.\r\nWhodunnit?\r\nDecades or tens of millions of years later, depending on how you look at it, scientists… [+1951 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Kate Duffy", "title": "SpaceX's Starlink: Everything you need to know about Elon Musk's internet service - Business Insider India", "description": "Starlink is SpaceX's broadband service that beams down internet from satellites launched into orbit. Since its launch in October, it has more than 10,000 users", "url": "https://www.businessinsider.in/tech/news/now-that-starlink-is-available-to-order-in-more-than-six-countries-heres-all-you-need-to-know-about-elon-musks-satellite-internet-service/articleshow/80896635.cms", "urlToImage": "https://www.businessinsider.in/photo/80896635/now-that-starlink-is-available-to-order-in-more-than-six-countries-heres-all-you-need-to-know-about-elon-musks-satellite-internet-service.jpg?imgsize=935624", "publishedAt": "2021-02-25T17:52:00Z", "content": "Elon Musk is inching ever closer to fulfiling his dream of creating super-fast internet around the world, which beams down from satellites in orbit to Earth.\r\nIn the past two weeks, SpaceX's Starlink… [+4654 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Human-caused North Atlantic right whale deaths are being undercounted: As recent sightings of entangled whales raise alarm, scientists say annual counts of right whale carcasses do a poor job of indicating true death toll - Science Daily", "description": "Scientists have found that known deaths of critically endangered North Atlantic right whales represent a fraction of the true death toll. This comes as the death of a calf and recent sightings of entangled right whales off the southeastern United States raise…", "url": "https://www.sciencedaily.com/releases/2021/02/210225082449.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-25T17:50:41Z", "content": "A study co-authored by scientists at the New England Aquarium has found that known deaths of critically endangered North Atlantic right whales represent a fraction of the true death toll. This comes … [+4185 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Freshwater outflow from Beaufort Sea could alter global climate patterns - EurekAlert", "description": "The Beaufort Sea, the Arctic Ocean's largest freshwater reservoir, has increased its freshwater content by 40 percent over the last two decades, putting global climate patterns at risk.", "url": "https://www.eurekalert.org/pub_releases/2021-02/danl-fof022521.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257491_web.jpg", "publishedAt": "2021-02-25T17:39:49Z", "content": "IMAGE: Dye tracer released from the Beaufort Gyre region of the western Artic Ocea n indicates freshwater transport through the Canadian Arctic Archipelago into the western Labrador Sea, causing fres… [+5034 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "People ‘hastened collapse and extinction’ of the woolly mammoth, says examine - The Times Hub", "description": "Woolly mammoths would have lived one other 4,000 years in some components of Eurasia if it weren’t for human hunters, in response to a brand new examine.  Australian consultants carried out pc simulations of woolly mammoth interactions with people and climate…", "url": "https://thetimeshub.in/people-hastened-collapse-and-extinction-of-the-woolly-mammoth-says-examine/10186/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/people-lsquohastened-collapse-and-extinction-of-the-woolly-mammoth-says-examine-4be9df1-300x219.jpg", "publishedAt": "2021-02-25T16:46:37Z", "content": "Woolly mammoths would have lived one other 4,000 years in some components of Eurasia if it werent for human hunters, in response to a brand new examine. \r\nAustralian consultants carried out pc simula… [+9142 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Data Limits Could Vanish With New Optical Antennas and “Rings of Light” - SciTechDaily", "description": "New research throws wide open the amount of information that can be simultaneously transmitted by a single light source. Researchers at the University of California, Berkeley, have found a new way to harness properties of light waves that can radically increa…", "url": "https://scitechdaily.com/data-limits-could-vanish-with-new-optical-antennas-and-rings-of-light/", "urlToImage": "https://scitechdaily.com/images/Multiplexing-Light-Sources-scaled.jpg", "publishedAt": "2021-02-25T16:00:17Z", "content": "Researchers at the University of California, Berkeley, have found a new way to harness properties of light waves that can radically increase the amount of data they carry. They demonstrated the emiss… [+5748 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Merger of Two Boson Stars Could Explain Existence of Dark Matter - AZoQuantum", "description": "An international research team has now demonstrated that the heaviest collision of black holes to be ever visualized and created by the gravitational-wave GW190521 could be more mysterious than previously believed—that is, the merger of a pair of boson stars.", "url": "https://www.azoquantum.com/News.aspx?newsID=7812", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_7812_16142522949771787.jpg", "publishedAt": "2021-02-25T15:57:00Z", "content": "Written by AZoQuantumFeb 25 2021\r\nAn international research team has now demonstrated that the heaviest collision of black holes to be ever visualized and created by the gravitational-wave GW190521 c… [+6876 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Skeleton Dating Back to 4.4 Million Years Ago Gives New Insights into Human's Locomotive Evolution - News18", "description": "The theory of human evolution postulates that modern homo sapiens’ ancestors were ancient apes.", "url": "https://www.news18.com/news/buzz/skeleton-dating-back-to-4-4-million-years-ago-gives-new-insights-into-humans-locomotive-evolution-3474101.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1614267282_untitled-design-20.jpg", "publishedAt": "2021-02-25T15:35:08Z", "content": "The theory of human evolution postulates that modern homo sapiens ancestors were ancient apes. Affirming this theory is the latest research that studied a well-preserved skeleton from four million ye… [+2631 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Pompeii: Scientists use lasers to remove stains on 2,000-year-old fresco in the House of the Ceii - Daily Mail", "description": "Poor maintenance since the house was dug up in 1913-14 saw the hunting fresco and others deteriorate, particularly at the bottom, which is more vulnerable to humidity.", "url": "https://www.dailymail.co.uk/sciencetech/article-9298729/Pompeii-Scientists-use-lasers-remove-stains-2-000-year-old-fresco-House-Ceii.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/25/11/39753734-0-image-a-42_1614252069688.jpg", "publishedAt": "2021-02-25T13:26:57Z", "content": "A stunning fresco in the garden of Pompeii's Casa dei Ceii (House of the Ceii) has been painstakingly laser-cleaned and touched up with new paint by expert restorers.\r\nThe artwork of hunting scenes w… [+9905 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "RepescaPlas needs to attain merchandise frommarine litte - The Times Hub", "description": "The RepescaPlas challenge has ended its third yr with a complete of 4,218 kg of marine litter recovered from the ports of Marín in Galicia, La Restinga in El Hierro and Gandia in Valencia by fishermen’s guilds and associations. As in earlier years, the gadget…", "url": "https://thetimeshub.in/repescaplas-needs-to-attain-merchandise-frommarine-litte/10040/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/repescaplas-needs-to-attain-merchandise-frommarine-litte-08af7ea-300x225.jpg", "publishedAt": "2021-02-25T12:48:25Z", "content": "The RepescaPlas challenge has ended its third yr with a complete of 4,218 kg of marine litter recovered from the ports of Marín in Galicia, La Restinga in El Hierro and Gandia in Valencia by fisherme… [+2487 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Earliest primate fossils documented by researchers that sheds light on the rise of mammals - EdexLive", "description": "The researchers, including those from the University of Washington in the US, analysed several fossils of Purgatorius -- the oldest genus in a group of the earliest-known primates called plesiadapifor", "url": "https://www.edexlive.com/news/2021/feb/25/earliest-primate-fossils-documented-by-researchers-that-sheds-light-on-the-riseof-mammals-18548.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/2/25/w600X390/frfr.jpg", "publishedAt": "2021-02-25T12:26:00Z", "content": "Scientists have documented the earliest-known fossil evidence of primates, an advance that sheds light on how life on land recovered after the extinction event 66 million years ago that wiped out the… [+2301 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Adam Mann", "title": "Ghost particle travels 750 million light-years, ends up buried under the Antarctic ice - Livescience.com", "description": "Why so late, little neutrino?", "url": "https://www.livescience.com/tidal-disruption-evnts-release-neutrino.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xVJjL2VwxNpMnpVskGbuKA-1200-80.jpg", "publishedAt": "2021-02-25T12:00:18Z", "content": "For the first time ever, scientists have received mysteriously delayed signals from two supermassive black holes that snacked on stars in their vicinity. \r\nIn the first case, a black hole weighing as… [+5795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "NASA shares a dazzling shot of ‘cosmic jewellery’, netizens in awe - The Indian Express", "description": "Shared on the official Instagram account for NASA’s Hubble Space Telescope, the post features an image of the Necklace Nebula located around 15,000 light-years away.", "url": "https://indianexpress.com/article/trending/trending-globally/nasa-necklace-nebula-hubble-telescope-7204459/", "urlToImage": "https://images.indianexpress.com/2021/02/NASA-feature.jpg", "publishedAt": "2021-02-25T11:31:41Z", "content": "The National Aeronautics and Space Administration on February 25 shared an image of cosmic jewellery on Instagram, leaving netizens in awe.\r\nShared on the official Instagram account for NASAs Hubble … [+570 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Are all the needles going to be that big?! - Global Times", "description": "People view monuments encouraging citizens to get the COVID-19 vaccine in Daegu City, South Korea, on Thursday. South Korea shipped its first doses of coronavirus vaccine on Wednesday, transferring AstraZeneca vaccines from a production facility in the countr…", "url": "https://www.globaltimes.cn/page/202102/1216585.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-02-25/a2b8b238-f7a0-4004-b169-b0426b333c76.jpeg", "publishedAt": "2021-02-25T10:38:00Z", "content": "People view monuments encouraging citizens to get the COVID-19 vaccine in Daegu City, South Korea, on Thursday. South Korea shipped its first doses of coronavirus vaccine on Wednesday, transferring A… [+165 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "NASA study: Life from Earth could survive on Mars, at least for a while - CNET", "description": "The mold that's hard to get out of your house could follow humans to the red planet.", "url": "https://www.cnet.com/news/nasa-study-life-from-earth-could-survive-on-mars-at-least-for-a-while/", "urlToImage": "https://cnet1.cbsistatic.com/img/4Joa7fdHLtEwT4PubenYBH-wp_Q=/1200x630/2020/07/29/178eaf95-a4aa-4e6e-b020-518649bfd4cd/elongated-cloud-on-mars-cropped.jpg", "publishedAt": "2021-02-24T23:30:04Z", "content": "Marsbox payload in the Earth's middle stratosphere. The shutter is open exposing the top layer samples to UV radiation.\r\nNASA\r\nThis story is part of Welcome to Mars, our series exploring the red plan… [+2574 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Cheryl Hines", "title": "Space, Tianwen-1 enters the parking orbit of Mars - SwordsToday.ie", "description": "Beijing, February 1 (Adcronos / Xinhua)After a complex orbital plot and a mission that began last July, the Chinese Tianwen-1 probe entered Mars' parking", "url": "https://swordstoday.ie/space-tianwen-1-enters-the-parking-orbit-of-mars/", "urlToImage": null, "publishedAt": "2021-02-24T23:12:55Z", "content": "Beijing, February 1 (Adcronos / Xinhua)\r\nAfter a complex orbital plot and a mission that began last July, the Chinese Tianwen-1 probe entered Mars’ parking orbit. The Chinese National Space Agency (C… [+1014 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "Earthly microbes could temporarily survive on Mars - THE WEEK", "description": "Understanding the endurance of microbes is vital for space travel", "url": "https://www.theweek.in/news/sci-tech/2021/02/25/earthly-microbes-could-temporarily-survive-on-mars.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/June/Frozen-water-on-the-Mars-nasa-shut.jpg", "publishedAt": "2021-02-24T22:48:16Z", "content": "Researchers have tested the endurance of microbes to Martian conditions by launching them into the Earth's stratosphere, as it closely represents key conditions on the Red Planet. This study by NASA … [+2796 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabha Ghosh", "title": "Explained: With NASA’s Perseverance and China’s Tianwen-1, a flurry of missions to Mars - The Indian Express", "description": "Early on Friday India time, NASA’s Perseverance rover is scheduled to touch down on Mars. Last week, the UAE’s Hope mission entered Martian orbit, and was followed closely by a Chinese mission. The flotilla of missions represents the spread of planetary explo…", "url": "https://indianexpress.com/article/explained/nasa-mars-mission-perseverance-tianwen-1-elon-musk-7191694/", "urlToImage": "https://images.indianexpress.com/2021/02/Mars.jpg", "publishedAt": "2021-02-24T20:04:12Z", "content": "Going to Mars is non-trivial, since both planets revolve around the Sun and are hence in constant motion relative to each other. Earth and Mars are at their closest distance relative to each other ev… [+7523 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "NASA's Perseverance Rover Gives High-Definition Panoramic View of Landing Site - Space Ref", "description": "NASA’s Perseverance Rover Gives High-Definition Panoramic View of Landing Site - SpaceRef", "url": "http://spaceref.com/news/viewpr.html?pid=57049", "urlToImage": null, "publishedAt": "2021-02-24T18:48:43Z", "content": "NASAs Perseverance Rover Gives High-Definition Panoramic View of Landing Site\r\nPress Release\r\n From: NASA HQPosted: Wednesday, February 24, 2021 \r\nNASAs Mars 2020 Perseverance rover got its first hig… [+4847 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Magnesium-based micromotors used to improve rheumatoid arthritis symptoms - News-Medical.Net", "description": "Rheumatoid arthritis is a chronic inflammatory disorder marked by joint pain, swelling and damage. Although medications, such as steroids, anti-inflammatory drugs and immunosuppressants, can help slow joint destruction and relieve pain, they have side effects…", "url": "https://www.news-medical.net/news/20210224/Magnesium-based-micromotors-used-to-improve-rheumatoid-arthritis-symptoms.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/shutterstock_390538711_6b3c40fdd32742caa54307db3553cab1-620x480.jpg", "publishedAt": "2021-02-24T17:10:00Z", "content": "Rheumatoid arthritis is a chronic inflammatory disorder marked by joint pain, swelling and damage. Although medications, such as steroids, anti-inflammatory drugs and immunosuppressants, can help slo… [+2035 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou", "title": "NASA delays 2nd planned hot fire test for Artemis I core stage - Orlando Sentinel", "description": "NASA’s plans to send the most powerful rocket ever to the moon is still waiting for its largest piece to make it to Kennedy Space Center. That won’t happen though until officials sign off on the 212-foot-tall core stage that awaits another test fire of its fo…", "url": "https://www.orlandosentinel.com/space/os-bz-nasa-core-stage-2nd-hot-fire-delay-20210224-okjxq3zpizdtvi3jj2nxv6pjeq-story.html", "urlToImage": "https://www.orlandosentinel.com/resizer/PVj9ktzG9FgQFCOVAxSaR2voFog=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/2CDYJFKJLK5PR5OFXNYNYC2R4A.aspx", "publishedAt": "2021-02-24T17:07:49Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Paul Alivisatos and Michael Grätzel win the Frontiers of Knowledge Award in Basic Sciences - EurekAlert", "description": "The BBVA Foundation Frontiers of Knowledge Award in the Basic Sciences category has gone in this thirteenth edition to Paul Alivisatos (University of California, Berkeley, United States) and Michael Grätzel (Ecole Polytechnique Fédérale de Lausanne, Switzerla…", "url": "https://www.eurekalert.org/pub_releases/2021-02/bf-paa022421.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/257306_web.jpg", "publishedAt": "2021-02-24T15:09:32Z", "content": "IMAGE: Michael Grätzel, winner of the BBVA Foundation Frontiers of Knowledge Award in Basic Sciences.\r\n view more \r\nCredit: BBVA FOUNDATION\r\nThe BBVA Foundation Frontiers of Knowledge Award in the Ba… [+15493 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Merging boson stars could explain massive black hole collision and prove existence of dark matter - Phys.org", "description": "An international team of scientists led by the Galician Institute of High Energy Physics (IGFAE) and the University of Aveiro shows that the heaviest black hole collision ever observed, produced by the gravitational-wave GW190521, might actually be something …", "url": "https://phys.org/news/2021-02-merging-boson-stars-massive-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/themergeroft.jpg", "publishedAt": "2021-02-24T15:00:02Z", "content": "An international team of scientists led by the Galician Institute of High Energy Physics (IGFAE) and the University of Aveiro shows that the heaviest black hole collision ever observed, produced by t… [+6460 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Jaunty Jupiter: Some Fascinating Images of the Gas Giant Captured by NASA's Juno Spacecraft (PHOTOS) | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "These images were recently processed by citizen scientist Tanya Oleksuik, who created the colour-enhanced pictures from the JunoCam camera data. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2021-02-24-fascinating-images-of-the-gas-giant-captured-by-nasas-juno", "urlToImage": "https://s.w-x.co/in-jupiter_1.jpg", "publishedAt": "2021-02-24T12:52:37Z", "content": "The National Aeronautics and Space Administration's (NASA) Juno spacecraft has delivered some new, stunning images of the stormy Jupiter. \r\nThe image above, which showcases a partial view of the plan… [+1840 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Like People, Moths Desire Dim Crimson Mild for a Romantic Night time - The Times Hub", "description": "People normally dim the sunshine and have the nice and cozy mild turned on for a extra romantic night time with their partner— and moths occur to do the identical in that regard. This analysis Frontier in Genetics printed confirmed that dim purple mild enhanc…", "url": "https://thetimeshub.in/like-people-moths-desire-dim-crimson-mild-for-a-romantic-night-time/8805/", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/02/like-people-moths-desire-dim-crimson-mild-for-a-romantic-night-time-72454ae-300x196.jpg", "publishedAt": "2021-02-24T12:48:59Z", "content": "People normally dim the sunshine and have the nice and cozy mild turned on for a extra romantic night time with their partner and moths occur to do the identical in that regard.\r\nThis analysis Fronti… [+3771 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Astronomers found the squashed stellar core that was left behind by a famous supernova - Tech Explorist", "description": "Since astronomers captured the bright explosion of a star on February 24, 1987, researchers have been searching for the squashed stellar core that should have been left behind. A group of astronomers using data from NASA space missions and ground-based telesc…", "url": "https://www.techexplorist.com/astronomers-found-the-squashed-stellar-core-that-was-left-behind-by-a-famous-supernova/37971/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/neutron-star.jpg", "publishedAt": "2021-02-24T12:34:36Z", "content": "In 1987, astronomers captured the first supernova named Supernova 1987A (or SN 1987A for short). Since then, astronomers are searching for the squashed stellar core that should have been left behind.… [+3988 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Dogs came to North America with earliest humans, study says - WION", "description": "Scientists said Wednesday they had discovered the oldest remains of a domestic dog in the Americas dating back more than 10,000 years, suggesting the animals accompanied the first waves of human settlers.", "url": "https://www.wionews.com/world/dogs-came-to-north-america-with-earliest-humans-study-says-365902", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/02/24/184211-dogs-in-n-america.jpg", "publishedAt": "2021-02-24T11:31:57Z", "content": "Scientists said Wednesday they had discovered the oldest remains of a domestic dog in the Americas dating back more than 10,000 years, suggesting the animals accompanied the first waves of human sett… [+2775 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jumping Frost Crystals: Electrostatic De-icing Effect Could Be a Game-Changer for Aircraft and HVAC Industries - SciTechDaily", "description": "If you have ever gotten up on a winter morning and thrown yourself into the arduous task of scraping frost from a windshield, a Virginia Tech lab is engaging science that could make your life much easier. In research funded by the National Science Foundation,…", "url": "https://scitechdaily.com/jumping-frost-crystals-electrostatic-de-icing-effect-could-be-a-game-changer-for-aircraft-and-hvac-industries/", "urlToImage": "https://scitechdaily.com/images/Electrostatic-Charge-Breaks-Frost.jpg", "publishedAt": "2021-02-24T11:00:30Z", "content": "Frost breaks off and “jumps” upward due to an electrostatic charge. Credit: Virginia Tech\r\nIf you have ever gotten up on a winter morning and thrown yourself into the arduous task of scraping frost f… [+2387 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Hamish Hector", "title": "New Oculus Quest update will stop you from tripping over your couch - Techradar", "description": "You might want to sit down for this", "url": "https://www.techradar.com/news/new-oculus-quest-update-will-stop-you-from-tripping-over-your-couch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XZSUv5odywUk6T9Yi2rKFX-1200-80.jpg", "publishedAt": "2021-02-24T10:52:44Z", "content": "Oculus Quest is getting a new feature that lets you mark out your couch in VR. Not only could it help stop you from bumping into your chair, but it should make it easier than ever to switch in and ou… [+1461 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Harvard astronomer is convinced that an alien vessel visited Earth in 2017 - Times Now", "description": "Abraham 'Avi' Loeb, an Israeli-American theoretical physicist and a professor at Harvard, is convinced that an alien vessel visited Earth in 2017", "url": "https://www.timesnownews.com/the-buzz/article/harvard-astronomer-is-convinced-that-an-alien-vessel-visited-earth-in/724298", "urlToImage": "https://imgk.timesnownews.com/story/ET.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-24T04:34:19Z", "content": "There are many alien theories floating around on the internet at any given time. There are dedicated blogs, forums, and websites that discuss theories and claims about alien and UFO 'sightings'.\r\nThi… [+2265 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "‘Ghostly’ neutrino from black hole shredding stars reveals cosmic particle accelerator of epic proportions - BollyInside", "description": "A ghostly particle that crashed in Antarctica in 2019 has been traced to a black hole tearing apart a star while acting as a giant cosmic particle", "url": "https://www.bollyinside.com/news/ghostly-neutrino-from-black-hole-shredding-stars-reveals-cosmic-particle-accelerator-of-epic-proportions/", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2021/02/Ghostly-neutrino-from-black-hole-shredding-stars-reveals-cosmic-particle.jpg", "publishedAt": "2021-02-24T01:42:58Z", "content": "Bollyinside.com provides you with the latest breaking news and videos from the global industries. Bollyinside is the place where you get news about Technology (Tech Review, Top Lists, Latest News Upd… [+523 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "WATCH: Soyuz spacecraft carrying the UAE's first astronaut Hazza Al-Mansoori dock with International Space Station - Arabnews", "description": "MISSION CONTROL, Moscow: The Soyuz MS-15 spacecraft carrying the first Emirati astronaut docked with the International Space Station on Wednesday after launching into space six hours earlier from the Baikonur Cosmodrome in Kazakhstan. Hazza Al-Mansoori from t…", "url": "https://www.arabnews.com/node/1559686", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/09/25/1770396-1560966155.jpg", "publishedAt": "2019-09-25T11:56:25Z", "content": "NEW YORK: In what might be his final briefing on Syria to the Security Council, the UNs humanitarian chief on Thursday once again warned of the dire situation in the country, and the terrible toll it… [+4575 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Novel device creates electricity from snowfall - ETEnergyworld.com", "description": "The device designed by researchers at the University of California, Los Angeles (UCLA) is inexpensive, small, thin and flexible like a sheet of plastic.", "url": "https://energy.economictimes.indiatimes.com/news/power/innovation-novel-device-creates-electricity-from-snowfall/68902736", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-68902736,imgsize-962319,width-800,height-434,overlay-etenergyworld/innovation-novel-device-creates-electricity-from-snowfall.jpg", "publishedAt": "2019-04-16T07:28:22Z", "content": "Los Angeles: Scientists have designed a first-of-its-kind 3D-printed device that can produce electricity from falling snow. The device designed by researchers at the University of California, Los Ang… [+2894 chars]"}]}