{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/andrew-tarantola", "title": "Hitting the Books: How NASA survived the Reagan era 'Dark Ages' - Engadget", "description": "The US has not always led from the front when it comes to interplanetary exploration.", "url": "https://www.engadget.com/hitting-the-books-the-mission-david-w-brown-harper-collins-193047204.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/oiSd2ehlanEvFMZEgL6q1Q--~B/aD0yODU5O3c9NDI3OTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2021-02/b00860c0-7302-11eb-bffe-cfb92c7a5832.cf.jpg", "publishedAt": "2021-02-20T16:32:33Z", "content": "This week, Americans celebrated the successful delivery of NASA's Perseverance rover to its destination on the Martian surface, marking the dawn of a new era of interplanetary exploration. However, w… [+9889 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Decode How Mars May Have Lost Its Atmosphere - NDTV", "description": "Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belief that planets need a protective magnetic field to block such harmful radiations in order to sustain life.", "url": "https://www.ndtv.com/india-news/scientists-decode-how-mars-may-have-lost-its-atmosphere-2374968", "urlToImage": "https://c.ndtvimg.com/2021-02/entffq_mars_625x300_14_February_21.jpg", "publishedAt": "2021-02-20T14:48:22Z", "content": "Scientists Decode How Mars May Have Lost Its Atmosphere\r\nNew Delhi: Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belie… [+2057 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Aria Bendix", "title": "Neanderthals died out after Earth's magnetic poles flipped, causing a climate crisis 42,000 years ago, a study - Business Insider India", "description": "Earth's magnetic poles flipped 42,000 years ago, which may have triggered a global climate crisis, a new study found. The resulting changes in temperatures", "url": "https://www.businessinsider.in/science/news/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says/articleshow/81127374.cms", "urlToImage": "https://www.businessinsider.in/photo/81127374/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says.jpg?imgsize=779366", "publishedAt": "2021-02-20T12:34:00Z", "content": "Earth\r\n saw a lot of commotion when its magnetic poles flipped 42,000 years ago. \r\nScientists have known about the flip since the late 1960s. Earth's magnetic poles aren't static - they're generated … [+5378 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "First black hole ever detected is more massive than we thought - Tech Explorist", "description": "The research shows the system known as Cygnus X-1 contains the most massive stellar-mass black hole ever detected without the use of gravitational waves.", "url": "https://www.techexplorist.com/first-black-hole-ever-detected-massive-thought/37878/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/Cygnus-X-1-system.jpg", "publishedAt": "2021-02-20T07:11:51Z", "content": "Cygnus X-1 is a stellar-mass black hole- one of the closest black holes to Earth. Discovered in 1964, the object gathered the attention of a famous scientific wager between physicists Stephen Hawking… [+2743 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robin A. Smith", "title": "Time-lapse reveals the hidden dance of roots - Phys.org", "description": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a camera on rice seeds sprouting in clear gel, taking a new p…", "url": "https://phys.org/news/2021-02-time-lapse-reveals-hidden-roots.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/plantroots.jpg", "publishedAt": "2021-02-19T22:23:29Z", "content": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a… [+4705 chars]"}, {"source": {"id": null, "name": "ChronicleLive"}, "author": "Kieran Murray", "title": "Roadmap out of lockdown is Government's 'last chance' to avoid NHS collapse - Chronicle Live", "description": "The British Medical Association has warned a cautious approach to lifting restrictions is the only way to stop the NHS being \"overwhelmed to be point of no return\"", "url": "https://www.chroniclelive.co.uk/news/uk-news/england-lockdown-warning-nhs-collapse-19869759", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article19869829.ece/ALTERNATES/s1200/0_How-Royal-Papworth-Hospital-Adapted-To-Battle-A-Pandemic.jpg", "publishedAt": "2021-02-19T08:00:00Z", "content": "A cautious and measured approach to easing lockdown is the Government's last chance to save the NHS from collapsing under the strain of another wave of Covid-19, a trade union has warned.\r\nPrime Mini… [+4570 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Sandhya Ramesh", "title": "World’s oldest DNA sequenced, belongs to million-year-old Siberian mammoth excavated in 1970s - ThePrint", "description": "The findings reveal clues into how other mammoths evolved and provide evolutionary evidence of interbreeding species creating new ones.", "url": "https://theprint.in/science/worlds-oldest-dna-sequenced-belongs-to-million-year-old-siberian-mammoth-excavated-in-1970s/607331/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/08/Woolly_mammoth.jpg", "publishedAt": "2021-02-19T02:54:55Z", "content": "Bengaluru: Scientists have managed to sequence the world’s oldest DNA recovered from one of three tooth specimens that belonged to million-year-old mammoths. The specimens came from three different m… [+4872 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}