{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Decode How Mars May Have Lost Its Atmosphere - NDTV", "description": "Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belief that planets need a protective magnetic field to block such harmful radiations in order to sustain life.", "url": "https://www.ndtv.com/india-news/scientists-decode-how-mars-may-have-lost-its-atmosphere-2374968", "urlToImage": "https://c.ndtvimg.com/2021-02/entffq_mars_625x300_14_February_21.jpg", "publishedAt": "2021-02-20T14:48:22Z", "content": "Scientists Decode How Mars May Have Lost Its Atmosphere\r\nNew Delhi: Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belie… [+2057 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Aria Bendix", "title": "Neanderthals died out after Earth's magnetic poles flipped, causing a climate crisis 42,000 years ago, a study - Business Insider India", "description": "Earth's magnetic poles flipped 42,000 years ago, which may have triggered a global climate crisis, a new study found. The resulting changes in temperatures", "url": "https://www.businessinsider.in/science/news/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says/articleshow/81127374.cms", "urlToImage": "https://www.businessinsider.in/photo/81127374/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says.jpg?imgsize=779366", "publishedAt": "2021-02-20T12:34:00Z", "content": "Earth\r\n saw a lot of commotion when its magnetic poles flipped 42,000 years ago. \r\nScientists have known about the flip since the late 1960s. Earth's magnetic poles aren't static - they're generated … [+5378 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "First black hole ever detected is more massive than we thought - Tech Explorist", "description": "The research shows the system known as Cygnus X-1 contains the most massive stellar-mass black hole ever detected without the use of gravitational waves.", "url": "https://www.techexplorist.com/first-black-hole-ever-detected-massive-thought/37878/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/Cygnus-X-1-system.jpg", "publishedAt": "2021-02-20T07:11:51Z", "content": "Cygnus X-1 is a stellar-mass black hole- one of the closest black holes to Earth. Discovered in 1964, the object gathered the attention of a famous scientific wager between physicists Stephen Hawking… [+2743 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Once Tied Between US and Russia, How the Space Race to Mars Now Has Multiple Nations Joining In - News18", "description": "NASA's Perseverance just landed on Mars - but it's already far behind multiple nations.", "url": "https://www.news18.com/news/buzz/once-tied-between-us-and-russia-how-the-space-race-to-mars-now-has-multiple-nations-joining-in-3454505.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1613726869_untitled-design-9.jpg", "publishedAt": "2021-02-20T05:04:40Z", "content": "NASA's Perseverance just landed on Mars - but it's already far behind multiple nations.\r\nFrom flybys to orbiters and landers, more than 40 missions have been launched to Mars to explore different asp… [+4244 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robin A. Smith", "title": "Time-lapse reveals the hidden dance of roots - Phys.org", "description": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a camera on rice seeds sprouting in clear gel, taking a new p…", "url": "https://phys.org/news/2021-02-time-lapse-reveals-hidden-roots.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/plantroots.jpg", "publishedAt": "2021-02-19T22:23:29Z", "content": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a… [+4705 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}