{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "NASA detects new Asteroid 2021 AF8 moving towards Earth at speed of 9 km per second - Zee News", "description": "", "url": "https://zeenews.india.com/space/nasa-detects-new-asteroid-2021-af8-moving-towards-earth-at-speed-of-9-km-per-second-2353165.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/04/06/927913-asteroid-earth-hi-1.jpg", "publishedAt": "2021-04-06T12:20:09Z", "content": "After the God of destruction, asteroid Apophis, and the largest asteroid in the year 2021, NASA has detected another asteroid heading towards the Earth with a much faster pace than the previous ones.… [+1666 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Raindrop Across Different Planets Can Guide Us to Find Life Beyond Our Solar System, Finds Study - News18", "description": "Humans have always fancied the idea of having a life on a different planet and the first thing we may need to know about is the availability of water and other habitations requirement.", "url": "https://www.news18.com/news/buzz/raindrop-across-different-planets-can-guide-us-to-find-life-beyond-our-solar-system-finds-study-3612101.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1617708566_rtx74cob.jpg", "publishedAt": "2021-04-06T11:32:04Z", "content": "Humans have always fancied the idea of having a life on a different planet and the first thing we may need to know about is the availability of water and other habitations requirement. In a recent st… [+1775 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "A safer way to deploy bacteria as environmental sensors - Nanowerk", "description": "Encapsulating modified bacteria in tough hydrogel spheres prevents them from spreading genes to other microbes.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57709.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57709.jpg", "publishedAt": "2021-04-06T10:30:51Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA Space Technology Inspired Exhibition Opened in Istanbul - Space Bollyinside - BollyInside", "description": "Anadol’s solo show Machine Memoirs: Space will be open through April 25 at Pilevneli Gallery in Istanbul. The exhibit presents “machine-based visual", "url": "https://www.bollyinside.com/news/nasa-space-technology-inspired-exhibition-opened-in-istanbul/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-06T10:12:23Z", "content": "Anadols solo show Machine Memoirs: Space will be open through April 25 at Pilevneli Gallery in Istanbul. The exhibit presents machine-based visual speculations about space, according to Pilevnelis we… [+1751 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Lightning strikes to spark more Arctic fires: study - Global Times", "description": "Lightning strikes inside the Arctic circle may double this century, sparking widespread tundra fires and increasing the risk of setting off the carbon time bomb held within permafrost, new research showed Monday.", "url": "https://www.globaltimes.cn/page/202104/1220344.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-04-06/ed2da32c-1551-4b07-817c-f663faa68fdf.jpeg", "publishedAt": "2021-04-06T10:08:00Z", "content": "Lightning strikes inside the Arctic circle may double this century, sparking widespread tundra fires and increasing the risk of setting off the carbon time bomb held within permafrost, new research s… [+1170 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA selects 9 scientists to participate in Korea's 2022 Lunar Pathfinder Orbiter mission - Space Bollyinside - BollyInside", "description": "KPLO is a joint mission between the KARI and NASA. Korea will manage the manufacturing and operation of the orbiter, while NASA will support the mission", "url": "https://www.bollyinside.com/news/nasa-selects-9-scientists-to-participate-in-koreas-2022-lunar-pathfinder-orbiter-mission/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-06T10:00:24Z", "content": "KPLO is a joint mission between the KARI and NASA. Korea will manage the manufacturing and operation of the orbiter, while NASA will support the mission with the development of one of the science pay… [+1999 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Separating beer waste into proteins for foods, and fiber for biofuels - EurekAlert", "description": "All brewers experience the same result of the beer-making process: leftover grain. Once all the flavor has been extracted from grains, what's left is a protein- and fiber-rich powder that is used in cattle feed or put in landfills. Scientists now report a new…", "url": "https://www.eurekalert.org/pub_releases/2021-04/acs-sbw032221.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-04-06T09:02:14Z", "content": "WASHINGTON, April 6, 2021 -- Home brewing enthusiasts and major manufacturers alike experience the same result of the beer-making process: mounds of leftover grain. Once all the flavor has been extra… [+7706 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Ingenuity Helicopter Survives First Night Alone On Mars - NDTV", "description": "NASA's Ingenuity mini-helicopter has survived its first night alone on the frigid surface of Mars, the US space agency said, hailing it as \"a major milestone\" for the tiny craft as it prepares for its first flight.", "url": "https://www.ndtv.com/world-news/nasas-ingenuity-helicopter-survives-first-night-alone-on-mars-2407243", "urlToImage": "https://c.ndtvimg.com/2021-04/kk2hotu8_nasas-ingenuity-helicopter-_625x300_06_April_21.jpg", "publishedAt": "2021-04-06T07:19:02Z", "content": "NASA's Ingenuity helicopter can be seen on Mars as viewed by the Perseverance rover.\r\nWashington, United States: NASA's Ingenuity mini-helicopter has survived its first night alone on the frigid surf… [+3138 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ethan Siegel", "title": "How Scientists Use Hydrogen Gas, In Space And On Earth, To Measure The Big Bang - Forbes", "description": "Even 13.8 billion years after the Big Bang, we can reconstruct the first 3 minutes.", "url": "https://www.forbes.com/sites/startswithabang/2021/04/06/how-scientists-use-hydrogen-gas-in-space-and-on-earth-to-measure-the-big-bang/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F57acd29b4bbe6f092f7270f6%2F0x0.jpg", "publishedAt": "2021-04-06T06:00:00Z", "content": "The absorption lines at a variety of redshifts show that the fundamental physics and sizes of atoms ... [+] have not changed throughout the Universe, even as the light has redshifted due to its expan… [+15930 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Sneha", "title": "Asteroid that eliminated dinosaur gave rise to Amazon rainforest - Free Press Journal", "description": "The asteroid impact that wiped out dinosaurs from Earth also gave birth to the Amazon rainforest, says a new study.", "url": "https://www.freepressjournal.in/science/asteroid-that-eliminated-dinosaur-gave-rise-to-amazon-rainforest", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-04%2Fb3181a4d-1421-49ba-9f8e-0c53b99f2f34%2Finfo_2nd_lead_april_5.jfif?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-04-06T05:10:34Z", "content": "New York: The asteroid impact that wiped out dinosaurs from Earth also gave birth to the Amazon rainforest, says a new study.\r\nIn an analysis of thousands of fossil pollen and leaves, the researchers… [+1612 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA TV to Air First US Commercial Crew Port Relocation on Space Station - India Education Diary", "description": "NASA’s SpaceX Crew-1 astronauts aboard the International Space Station will mark another first for commercial spaceflight Monday, April 5, when the four astronauts will relocate the Crew Dragon spacecraft to prepare for the arrival of new crew member", "url": "https://indiaeducationdiary.in/nasa-tv-to-air-first-us-commercial-crew-port-relocation-on-space-station/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/04/50902727167_f0845a77a0_k.jpeg", "publishedAt": "2021-04-06T03:05:58Z", "content": "NASAs SpaceX Crew-1 astronauts aboard the International Space Station will mark another first for commercial spaceflight Monday, April 5, when the four astronauts will relocate the Crew Dragon spacec… [+1660 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Rice Students to Hear from NASA Astronauts on Space Station - India Education Diary", "description": "Students from the Rice Space Institute will have an opportunity this week to hear from NASA astronauts aboard the International Space Station. The Earth-to-space call will air live at 10:10 a.m. EDT Thursday, April 8, on NASA Television, the NASA app", "url": "https://indiaeducationdiary.in/rice-students-to-hear-from-nasa-astronauts-on-space-station/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/04/NASA-1024x576.jpg", "publishedAt": "2021-04-06T02:58:20Z", "content": "Students from the Rice Space Institute will have an opportunity this week to hear from NASA astronauts aboard the International Space Station. The Earth-to-space call will air live at 10:10 a.m. EDT … [+1725 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Watch Next Space Station Crew Launch Live on NASA TV, NASA App - India Education Diary", "description": "Three space travelers, including NASA astronaut Mark Vande Hei, are poised to launch Friday, April 9, from the Baikonur Cosmodrome in Kazakhstan to the International Space Station. NASA Television, the agency’s website, and the NASA app will provide", "url": "https://indiaeducationdiary.in/watch-next-space-station-crew-launch-live-on-nasa-tv-nasa-app/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/04/NASA-1024x576.jpg", "publishedAt": "2021-04-06T02:58:20Z", "content": "Three space travelers, including NASA astronaut Mark Vande Hei, are poised to launch Friday, April 9, from the Baikonur Cosmodrome in Kazakhstan to the International Space Station. NASA Television, t… [+2091 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "China's Mars Probe Just Sent Haunting Photos of The Red Planet - ScienceAlert", "description": "China's Mars probe, Tianwen-1, has been hanging around Mars in a parking orbit for nearly two whole months now, preparing for its rover landing in May.", "url": "https://www.sciencealert.com/we-can-t-get-enough-of-tianwen-1-s-new-latest-photos-of-mars", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/mars-cresc-head_1024.jpg", "publishedAt": "2021-04-06T02:40:34Z", "content": "China's Mars probe, Tianwen-1, has been hanging around Mars in a parking orbit for nearly two whole months now, preparing for its rover landing in May.\r\nBut it's not just sitting there in orbit twidd… [+1933 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "NASA names Mars rover touchdown site after Octavia Butler - National Herald", "description": "NASA has named the landing site of its Perseverance Mars rover after the science fiction author Octavia Butler", "url": "https://www.nationalheraldindia.com/science-and-tech/nasa-names-mars-rover-touchdown-site-after-octavia-butler", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-02%2Fe8d7590e-8406-4cd0-93d2-c82b211aadc8%2F56471330_403.jpg?rect=0%2C0%2C940%2C494&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-04-06T02:08:00Z", "content": "The rover will characteriae the planet's geology and past climate, pave the way for human exploration of the Red Planet, and be the first mission to collect and cache Martian rock and regolith - brok… [+416 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New RNA-sequencing method can help detect numerous modified small RNAs - News-Medical.Net", "description": "A team led by a biomedical scientist at the University of California, Riverside, has developed a new RNA-sequencing method-- \"Panoramic RNA Display by Overcoming RNA Modification Aborted Sequencing,\" or PANDORA-seq -- that can help discover numerous modified …", "url": "https://www.news-medical.net/news/20210405/New-RNA-sequencing-method-can-help-detect-numerous-modified-small-RNAs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/3D_illustration._Colorful_DNA_molecule._Concept_image_of_a_structure_of_the_genetic_code.-ktsdesign_4c035abf42364e14ad194562cfbdb262-620x480.jpg", "publishedAt": "2021-04-06T00:28:00Z", "content": "A team led by a biomedical scientist at the University of California, Riverside, has developed a new RNA-sequencing method-- \"Panoramic RNA Display by Overcoming RNA Modification Aborted Sequencing,\"… [+5162 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Humans were apex predators for two million years, study finds: What did our ancestors eat during the stone age? Mostly meat - Science Daily", "description": "In a new study, researchers were able to reconstruct the nutrition of stone-age humans. The study's authors collected about 25 lines of evidence from about 400 scientific papers from different scientific disciplines, dealing with the focal question: Were ston…", "url": "https://www.sciencedaily.com/releases/2021/04/210405113606.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-05T23:21:59Z", "content": "Researchers at Tel Aviv University were able to reconstruct the nutrition of stone age humans. In a paper published in the American Journal of Physical Anthropology (Yearbook of Physical Anthropology… [+6763 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leah Burrows", "title": "Size of raindrops can help identify potentially habitable planets outside our solar system - Phys.org", "description": "One day, humankind may step foot on another habitable planet. That planet may look very different from Earth, but one thing will feel familiar—the rain.", "url": "https://phys.org/news/2021-04-size-raindrops-potentially-habitable-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/raindrops.jpg", "publishedAt": "2021-04-05T20:51:59Z", "content": "One day, humankind may step foot on another habitable planet. That planet may look very different from Earth, but one thing will feel familiarthe rain.\r\nIn a recent paper, Harvard researchers found t… [+3629 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "Elon Musk reveals what made SpaceX's Starship SN11 prototype explode - CNET", "description": "SpaceX has sent four prototypes of its eventual Mars rocket to big-booster heaven.", "url": "https://www.cnet.com/news/elon-musk-reveals-what-made-spacexs-starship-sn11-prototype-explode/", "urlToImage": "https://www.cnet.com/a/img/rj-5IIHwVS5QOvF9ql6hUjSWMcs=/1200x630/2021/04/05/79ba3b56-ccdd-4fa8-98b0-79edd7752d14/51006496043-f7e03ce21d-k.jpg", "publishedAt": "2021-04-05T19:53:00Z", "content": "Starship prototype SN10 comes in for a landing. \r\nSpaceX\r\nThe latest SpaceX Starship prototype, called SN11, met an explosive end last week like its three predecessors. But the conditions around the … [+2621 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Masks, good ventilation are more important than social distancing for reducing COVID spread - News-Medical.Net", "description": "A new study from the University of Central Florida suggests that masks and a good ventilation system are more important than social distancing for reducing the airborne spread of COVID-19 in classrooms.", "url": "https://www.news-medical.net/news/20210405/Masks-good-ventilation-are-more-important-than-social-distancing-for-reducing-COVID-spread.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2021-04-05T18:19:00Z", "content": "A new study from the University of Central Florida suggests that masks and a good ventilation system are more important than social distancing for reducing the airborne spread of COVID-19 in classroo… [+4910 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board editor in chief", "title": "X-ray crystallography identifies drugs to be repurposed for COVID-19 - The Science Board", "description": "A new large-scale study indicates x-ray crystallography can be used to find drugs that could be repurposed to target the SARS-CoV-2 main protease. In addition to identifying 37 potential drug candidates, the study, published in <em>Science</em> on April 2, re…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=2439", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_pro/2021_04_05_17_12_0051_2021_04_05_DESY_20210405171303.jpg", "publishedAt": "2021-04-05T17:31:04Z", "content": "Proteolytic cleavage of the SARS-CoV-2 polyprotein is primarily accomplished by the main protease. The enzyme contains a chymotrypsin-like fold appended with a C-terminal helical domain, and it harbo… [+5729 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "An astronomer has created video on Saturn`s spinning rings - WION", "description": "If there is any planet that first catches our fancy when we are young, it is Saturn. The distinct rings is what makes Saturn a mesmerising thing. Who wants spherical planets when you can throw a funky ring around one of them eh? These rings can be witnessed u…", "url": "https://www.wionews.com/science/an-astronomer-has-created-video-on-saturns-spinning-rings-375558", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/15/149869-5.jpg", "publishedAt": "2021-04-05T17:03:35Z", "content": "If there is any planet that first catches our fancy when we are young, it is Saturn. The distinct rings is what makes Saturn a mesmerising thing. Who wants spherical planets when you can throw a funk… [+1315 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Artificial photosynthesis devices that improve themselves with use - Nanowerk", "description": "In a finding that could help make artificial photosynthesis a practical method for producing hydrogen fuel, researchers have discovered why a water-splitting device made with cheap and abundant materials unexpectedly becomes more efficient during use.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57704.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57704.jpg", "publishedAt": "2021-04-05T15:30:41Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Here`s the interplanetary news you need to know: Earthquakes on planet Mars! - Zee News", "description": "Earthquakes are a common phenomenon on the Earth s surface. Do you know that Mars too observes disturbance on its crust layer on the outer surface?", "url": "https://zeenews.india.com/science-environment/heres-the-interplanetary-news-you-need-to-know-earthquakes-on-planet-mars-2352928.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/04/05/927684-madu3-6.jpg", "publishedAt": "2021-04-05T14:02:05Z", "content": "New Delhi: Earthquakes are a common phenomenon on the Earth's surface. Do you know that Mars too observes disturbance on its crust layer on the outer surface? In a recent development, the National Ae… [+2052 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The night sky, already illuminated by 10% due to satellites, will get even worse - Space Bollyinside - BollyInside", "description": "“We expected the sky brightness increase would be marginal if any, but our first theoretical estimates have proved extremely surprising and thus", "url": "https://www.bollyinside.com/news/the-night-sky-already-illuminated-by-10-due-to-satellites-will-get-even-worse/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-05T13:43:16Z", "content": "We expected the sky brightness increase would be marginal if any, but our first theoretical estimates have proved extremely surprising and thus encouraged us to report our results promptly, Miroslav … [+3115 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Using Chandra X-ray Observatory, astronomers detect X-ray emission from Uranus - Firstpost", "description": "One theory is that the Sun is behind the emission of the X-rays while another theory suggests that the rings are causing them.", "url": "https://www.firstpost.com/sports/using-chandra-x-ray-observatory-astronomers-detect-x-ray-emission-from-uranus-9498561.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/04/uranus-1.jpg", "publishedAt": "2021-04-05T13:06:23Z", "content": "One theory is that the Sun is behind the emission of the X-rays while another theory suggests that the rings are causing them. \r\n Astronomers have found that Uranus might be emitting X-rays using the… [+1693 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Justin Pot", "title": "How to split your working hours in Google Calendar - The Next Web", "description": "Welcome to TNW Basics, a collection of tips, guides, and advice on how to easily get the most out of your gadgets, apps, and other stuff.\r\nThe workday evolved in 2020, and tools are ...", "url": "https://thenextweb.com/basics/2021/04/05/how-to-split-your-working-hours-in-google-calendar-syndication/", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F04%2Fgoogle-calendar.jpg&signature=122f4b00025e8eae9cca671bb812423a", "publishedAt": "2021-04-05T13:00:04Z", "content": "Welcome to TNW Basics, a collection of tips, guides, and advice on how to easily get the most out of your gadgets, apps, and other stuff.\r\nThe workday evolved in 2020, and tools are adapting to accom… [+2370 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Ida Eriksen-U. Copenhagen", "title": "What if 70% of the universe isn't dark energy after all? - Futurity: Research News", "description": "The findings of a new paper suggest dark energy might not account for nearly 70% of the ever-accelerating, expanding universe.", "url": "https://www.futurity.org/dark-energy-dark-matter-universe-expansion-2543202-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2021/04/dark_matter_1600.jpg", "publishedAt": "2021-04-05T12:54:55Z", "content": "Researchers have tested a model that suggests the universe’s expansion is due to a dark substance with a kind of magnetic force, not dark energy.\r\nUntil now, researchers have believed that dark energ… [+3552 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "A Safe and Cheap Technology for the Disinfection of Packaged Eggs - AZoCleantech", "description": "Scientists from Russia have designed a secured, trustworthy, and cheap packed eggs surface disinfection technology. This technology helps destroy bacteria, such as salmonella, present on eggshells.", "url": "https://www.azocleantech.com/news.aspx?newsID=29188", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29188_1617627201191971.jpg", "publishedAt": "2021-04-05T12:52:00Z", "content": "Written by AZoCleantechApr 5 2021\r\nScientists from Russia have designed a safe and cheap packaged egg surface disinfection technology. This technology helps destroy bacteria, such as salmonella, pres… [+3369 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Spooky 'spiders on Mars' finally explained after two decades - Livescience.com", "description": "", "url": "https://www.livescience.com/spiders-on-mars-explained-dry-ice.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rnK6EamZfQVBXiQuBW6vFd-1200-80.jpg", "publishedAt": "2021-04-05T11:45:07Z", "content": "Ziggy played guitar\r\n, and scientists in the U.K. played with a big chunk of dry ice to try to figure out what's behind the strange alien patterns known as the \"spiders on Mars\r\n.\"\r\nThose patterns, v… [+3356 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA selects 9 scientists to join 2022 Korea Pathfinder Lunar Orbiter mission - Space.com", "description": "", "url": "https://www.space.com/nasa-joins-korea-pathfinder-lunar-orbiter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VXXNQUxipTnFJbsCQbncaj-1200-80.jpeg", "publishedAt": "2021-04-05T10:47:52Z", "content": "Nine U.S. scientists will join South Korea's first lunar orbiter mission launching next year. \r\nThe Korea Pathfinder Lunar Orbiter (KPLO) is scheduled to launch on a SpaceX Falcon 9 rocket\r\n in Augus… [+3613 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Where did Earth get its carbon from? - The Statesman", "description": "The team quashed the previously believed condensation model saying that the gas molecules that carry carbon would not be available to build the Earth because once carbon vaporises, it does not condense back into a solid state", "url": "https://www.thestatesman.com/how-to/earth-get-carbon-1502961038.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2017/08/1478075845-co2-getty.jpg", "publishedAt": "2021-04-05T07:26:18Z", "content": "Carbon survived an interstellar journey to reach the Earth, entirely avoiding vaporisation, as believed earlier, according to a new study.\r\nCarbon is the backbone of life on Earth. It is responsible … [+1588 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "The unsolved mystery of Uranus and Neptune - Tech Explorist", "description": "The strange magnetic fields of both planets are strongly tilted according to the planet's rotation axes and are significantly offset from the planet's physical center. The reason for this has been a longstanding mystery in planetary sciences.", "url": "https://www.techexplorist.com/unsolved-mystery-uranus-neptune/38593/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/04/Neptune-and-Uranus.jpg", "publishedAt": "2021-04-05T07:05:07Z", "content": "Probably because of their unique internal structures, the planets- Uranus and Neptune skewed magnetic field. Some scientists suggest that the planets derived such nondipolar magnetic fields from a sp… [+2505 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First James Webb Space Telescope General Observer Scientific Programs Selected - SciTechDaily", "description": "The General Observer scientific observations for the NASA/ESA/CSA James Webb Space Telescope’s first year of operation have been selected. Proposals from ESA member states comprise 33% of the total number of selected proposals and correspond to 30% of the ava…", "url": "https://scitechdaily.com/first-james-webb-space-telescope-general-observer-scientific-programs-selected/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Artists-Impression-scaled.jpg", "publishedAt": "2021-04-05T02:36:00Z", "content": "The James Webb Space Telescope is a space observatory to see further into the Universe than ever before. It is designed to answer outstanding questions about the Universe and to make breakthrough dis… [+3705 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "PTI", "title": "Revealed! Mars rover’s giant parachute carried secret message - National Herald", "description": "Only about six people knew about the encoded message before Thursday’s landing, Systems engineer Ian Clark revealed", "url": "https://www.nationalheraldindia.com/science-tech/revealed-mars-rovers-giant-parachute-carried-secret-message", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-02%2Fe8d7590e-8406-4cd0-93d2-c82b211aadc8%2F56471330_403.jpg?rect=0%2C0%2C940%2C494&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-04-05T02:20:00Z", "content": "Only about six people knew about the encoded message before Thursday's landing, according to Clark. They waited until the parachute images came back before putting out a teaser during a televised new… [+482 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Mars may be hiding most of its missing water underground: NASA-funded study - National Herald", "description": "Vast amounts of ancient water may have been trapped beneath the surface of Mars, according to a NASA-funded study", "url": "https://www.nationalheraldindia.com/international/mars-may-be-hiding-most-of-its-missing-water-underground-nasa-funded-study", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-03%2Fa6898986-0098-4c61-8c61-1c41ad8ed695%2FMars.jpg?rect=0%2C72%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-04-05T02:20:00Z", "content": "The study proposes that a combination of two mechanisms -- the trapping of water in minerals in the planet's crust and the loss of water to the atmosphere -- can explain the observed deuterium-to-hyd… [+1071 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "Aakar Patel", "title": "Who owns Mars—nations or companies? Why is there such a mad scramble to get there? - National Herald", "description": "Four missions to Mars are planned next year. And as the race hots up, questions of ownership will invariably crop up because the planet by far is the likeliest to be colonised by human beings", "url": "https://www.nationalheraldindia.com/science-and-tech/who-owns-marsnations-or-companies-why-is-there-such-a-mad-scramble-to-get-there", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2018-07%2F7cb82c83-b957-4193-92f5-429b09832d0e%2F44213392_403.jpg?rect=0%2C0%2C940%2C494&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-04-05T02:20:00Z", "content": "The other big issue of space travel is that of fuel, and there are rockets being designed today that will be powered by methane and liquid oxygen, both of which can be produced on Mars.\r\nThere are pe… [+1405 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "A Crescent Moon Skims The Giant Planets During ‘International Dark Sky Week’: What You Can See In The Night Sky This Week - Forbes", "description": "Your stargazing highlights for the week ahead include Jupiter and Saturn in conjunction with the Moon, good views of the planet Mars and a first chance to glimpse the Milky Way galaxy.", "url": "https://www.forbes.com/sites/jamiecartereurope/2021/04/04/a-crescent-moon-skims-the-giant-planets-during-international-dark-sky-week-what-you-can-see-in-the-night-sky-this-week/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1004957944%2F0x0.jpg", "publishedAt": "2021-04-05T02:00:00Z", "content": "A crescent moon and the planet Venus set behind an American flag at sunset on July 15, 2018 in ... [+] Bayonne, New Jersey. (Photo by Gary Hershorn/Getty Images)\r\nGetty Images\r\nEach Monday I pick out… [+5344 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "This \"hamster ball\" robot could explore moon caves - Space Bollyinside - BollyInside", "description": "Because they’re underground, the formations would shield astronauts from the space radiation, meteorites, temperature fluctuations, and other elements", "url": "https://www.bollyinside.com/news/this-hamster-ball-robot-could-explore-moon-caves/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-05T01:19:14Z", "content": "Because theyre underground, the formations would shield astronauts from the space radiation, meteorites, temperature fluctuations, and other elements that make the surface less than hospitable. They … [+1725 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "SpaceX rocket debris lands on man's farm in US - The Rahnuma Daily", "description": "San Francisco, April 3 (IANS) In a bizarre incident, a farm owner in the US was left in shock when a pressure vessel from a SpaceX Falcon 9 rocket fell on his property in Washington State, leaving a “4-inch dent in the soil.” In a normal course, most second s…", "url": "https://www.therahnuma.com/spacex-rocket-debris-lands-on-mans-farm-in-us/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2019/03/spacexcrew_20180803_bi0i1604-1-1-1024x683.jpg", "publishedAt": "2021-04-05T00:27:48Z", "content": "SpaceX rocket debris lands on man’s farm in US\r\nSan Francisco, April 3 (IANS) In a bizarre incident, a farm owner in the US was left in shock when a pressure vessel from a SpaceX Falcon 9 rocket fell… [+1794 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance Mars rover investigates 'odd' rock, zaps it with a laser - CNET", "description": "Scientists speculate the rock could be a meteorite or a far-flung chunk of Mars.", "url": "https://www.cnet.com/news/nasa-perseverance-mars-rover-looks-into-odd-rock-on-red-planet-zaps-it-with-laser/", "urlToImage": "https://www.cnet.com/a/img/NdWoVUtmIU96VMWdnBgzuSDoIjo=/1200x630/2021/03/31/c2ab3ad5-ca3d-438d-8e3e-522d5ccb969e/oddrock.jpg", "publishedAt": "2021-04-04T21:09:00Z", "content": "NASA's Perseverance rover snapped a view of this odd rock on March 28. If you look closely just to the right of center, you can see a series of tiny marks where the rover's laser zapped it.\r\nNASA/JPL… [+2403 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Sieeka Khan", "title": "Hubble Space Telescope Scientists Revealed a Reworked Image of the Veil Nebula - Tech Times", "description": "Hubble Telescope has released a beautiful image of the Veil Nebula, showcasing its threads and filaments of ionized gas.", "url": "https://www.techtimes.com/articles/258718/20210404/hubble-space-telescope-scientists-revealed-reworked-image-veil-nebula.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/382973/space.png", "publishedAt": "2021-04-04T15:56:35Z", "content": "The scientists working with the Hubble Space Telescope, which was launched into low Earth orbit in 1990, have released a reworked image of the beautiful Veil Nebula, showing threads of ionized gas wi… [+3359 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Sunlight Neutralizes COVID-19 8 Times Faster Than Assumed | IE - Interesting Engineering", "description": "The findings could give us a new way to tackle the virus.", "url": "https://interestingengineering.com/sunlight-neutralizes-sars-cov-2-8-times-faster-than-assumed", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/jvwv5ylW6x/sizes/sunlight_md.jpg", "publishedAt": "2021-04-04T12:56:35Z", "content": "Researchers from UC Santa Barbara, Oregon State University, University of Manchester and ETH Zurich are calling for a closer look at sunlight's ability to neutralize SARS-CoV-2 after finding that the… [+1665 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Jessica Meir to tell Caribou students what it was like to go into space and return to a pandemic - Space Bollyinside - BollyInside", "description": "Meir first journeyed into space in September 2019, and achieved her lifelong dream of going on a spacewalk in October of the same year. During that time,", "url": "https://www.bollyinside.com/news/jessica-meir-to-tell-caribou-students-what-it-was-like-to-go-into-space-and-return-to-a-pandemic/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-04T12:31:13Z", "content": "Meir first journeyed into space in September 2019, and achieved her lifelong dream of going on a spacewalk in October of the same year. During that time, she and fellow astronaut Christina Koch also … [+1222 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA's Perseverance Rover Transmits to Earth from the Surface of Mars - UPI.com", "description": "NASA's Mars Perseverance rover acquired this image using its Right Mastcam-Z camera. Mastcam-Z is a pair of cameras located high on the rover's mast. This image was acquired on February 24, 2021 (Sol 3) at the local mean solar time of 15:48:08. A key objectiv…", "url": "https://www.upi.com/News_Photos/view/upi/74540561926bef08ac8670d175a125e8/NASAs-Perseverance-Rover-Transmits-to-Earth-from-the-Surface-of-Mars/", "urlToImage": "https://cdnph.upi.com/pv/upi/74540561926bef08ac8670d175a125e8/NASA-MARS-PERSEVERANCE.jpg", "publishedAt": "2021-02-25T03:56:32Z", "content": "NASA's Mars Perseverance rover acquired this image using its Right Mastcam-Z camera. Mastcam-Z is a pair of cameras located high on the rover's mast. This image was acquired on February 24, 2021 (Sol… [+374 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "How the UAE's Mars mission can be the Arab world's springboard to the future - Arab News", "description": "SHARJAH: The successful entry of the UAE’s Hope probe into orbit around Mars is a historic event on the scientific, educational, and strategic levels. Indeed, for the first time ever, an Arab nation has gone beyond applied space science and technology (satell…", "url": "https://www.arabnews.com/node/1809966", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/15/2476111-2101005750.jpg", "publishedAt": "2021-02-15T20:35:45Z", "content": "SHARJAH: The successful entry of the UAEs Hope probe into orbit around Mars is a historic event on the scientific, educational, and strategic levels. Indeed, for the first time ever, an Arab nation h… [+7106 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "AFP", "title": "UAE’s ‘Hope’ probe enters Mars orbit in first for Arab world - Prothom Alo English", "description": "The United Arab Emirates’ “Hope” probe on Monday successfully entered Mars’ orbit, making history as the Arab world’s first interplanetary mission", "url": "https://en.prothomalo.com/science-technology/science/uaes-hope-probe-enters-mars-orbit-in-first-for-arab-world", "urlToImage": "https://images.prothomalo.com/prothomalo-english%2F2021-02%2F8d0835f3-b068-4540-b66b-339cd104b216%2F649389_01_02.jpg?overlay=&overlay_position=bottom&overlay_opacity=1&w=1200&h=627&auto=format%2Ccompress&ogImage=true&overlay_width_pct=1", "publishedAt": "2021-02-10T04:59:55Z", "content": "Bigger objective\r\nWhile the probe is designed to provide a comprehensive image of the planets weather dynamics, it is also a step towards a much more ambitious goalbuilding a human settlement on Mars… [+1079 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "By MARI YAMAGUCHI | AP", "title": "Japan awaits spacecraft return with asteroid soil samples - Arab News", "description": "TOKYO: Japan’s space agency said the Hayabusa2 spacecraft successfully separated a capsule and sent it toward Earth to deliver samples from a distant asteroid that could provide clues to the origin of the solar system and life on our planet. The Japan Aerospa…", "url": "https://www.arabnews.com/node/1772786", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/12/05/2373551-1553701125.jpg", "publishedAt": "2020-12-05T08:32:19Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AFP", "title": "Rare 'ring of fire' solar eclipse to dim Africa, Asia - Arab News", "description": "PARIS: Skywatchers along a narrow band from west Africa to the Arabian Peninsula, India and southern China will witness on Sunday the most dramatic “ring of fire” solar eclipse to shadow the Earth in years. Annular eclipses occur when the Moon — passing betwe…", "url": "https://www.arabnews.com/node/1692611", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/06/20/2154941-2039166004.jpg", "publishedAt": "2020-06-20T07:00:10Z", "content": "ANKARA: The Turkish government faced a tough challenge over the weekend after a video of Kursat Ayvatoglu, a member of the ruling Justice and Development Party (AKP), was publicized on social media w… [+4356 chars]"}, {"source": {"id": null, "name": "Mental Floss"}, "author": null, "title": "How to Watch SpaceX Demo2 Launch Live - Mental Floss", "description": "SpaceX is about to make company history when it launches its first crewed spacecraft for a mission to the International Space Station. Here are the best places to stream the event.", "url": "https://www.mentalfloss.com/article/624846/where-watch-spacex-demo2-launch-live", "urlToImage": "https://images2.minutemediacdn.com/image/upload/c_crop,h_1126,w_2000,x_0,y_52/v1590863778/shape/mentalfloss/624846-gettyimages-1235550243.jpg?itok=AcOGbgNx", "publishedAt": "2020-05-27T15:36:31Z", "content": "After scrubbing its original launch on May 27 due to bad weather, SpaceX will attempt to make history yet again today (May 30) when it launches its first crewed spacecraft from Cape Canaveral, Florid… [+1789 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "Armored dinosaur with spiky head unveiled at Utah museum - Arab News", "description": "SALT LAKE CITY: A dinosaur that was covered in bony armor from its spiky head to its clubbed tail has been unveiled at a museum in Utah. The species of ankylosaur was a squat plant-eater that roamed southern Utah on four legs about 76 million years ago, durin…", "url": "https://www.arabnews.com/node/1342626", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/07/21/1259096-1937326355.jpg", "publishedAt": "2019-08-28T21:04:20Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Mother of all photobombs? Twitter erupts as space station sneaks into snap of the eclipse - Arab News", "description": "DUBAI: As millions across the US gathered to watch an eclipse of the sun on Monday, one photographer noticed something unexpected — an International Space Station photobombed the shot. Millions of Americans gazed in wonder at the cosmic spectacle, with the be…", "url": "https://www.arabnews.com/node/1148891", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/08/22/975971-1708758572.jpg", "publishedAt": "2019-08-28T11:26:09Z", "content": "ANKARA: The Turkish government faced a tough challenge over the weekend after a video of Kursat Ayvatoglu, a member of the ruling Justice and Development Party (AKP), was publicized on social media w… [+4356 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Arab News", "title": "Tablet found in modern-day Iraq shows Babylonians, not Greeks, developed trigonometry - Arab News", "description": "DUBAI: A 3,700-year-old clay tablet analyzed by researchers in Australia has proven that Babylonians, not Greeks, developed trigonometry. The tablet, known as Plimpton 332, was found in the early 1900s in modern-day southern Iraq but experts at the University…", "url": "https://www.arabnews.com/node/1150966", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/08/26/978701-1866980556.jpg", "publishedAt": "2019-08-27T15:11:56Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "AP", "title": "160000 year-old remains of human relative found in Tibet - Arab News", "description": "NEW YORK: Nearly 40 years after it was found by a monk in a Chinese cave, a fossilized chunk of jawbone has been revealed as coming from a mysterious relative of the Neanderthals. Until now, the only known remains of these Denisovans were a few scraps of bone…", "url": "https://www.arabnews.com/node/1491231", "urlToImage": "https://www.arabnews.com/sites/default/files/2019/05/02/1563666-719660114.jpg", "publishedAt": "2019-08-26T21:58:48Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Mariette le Roux and Laurence Coustal | AFP", "title": "Plane-sized 'void' discovered in Great Pyramid: scientists - Arab News", "description": "PARIS: A passenger plane-sized “void” has been discovered in the middle of the Great Pyramid of Egypt, where it has lain secret and untouched for 4,500 years, scientists revealed on Thursday. The space is one of four cavities, along with the king and queen’s …", "url": "https://www.arabnews.com/node/1187191", "urlToImage": "https://www.arabnews.com/sites/default/files/2017/11/02/1025816-705365387.jpg", "publishedAt": "2019-08-26T19:16:53Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Purple bacteria may help harvest green fuel from wastewater - ETEnergyworld.com", "description": "The study showed that supplying electric current to purple phototrophic bacteria can recover nearly 100 per cent of carbon from any type of organic waste, while generating hydrogen gas for electricity production", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/innovation-purple-bacteria-may-help-harvest-green-fuel-from-wastewater/66619380", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-66619380,imgsize-62677,width-800,height-434,overlay-etenergyworld/innovation-purple-bacteria-may-help-harvest-green-fuel-from-wastewater.jpg", "publishedAt": "2018-11-14T10:14:21Z", "content": "London: A purple bacteria -- which store energy from light -- can help harvest hydrogen fuel from sewage, and recover carbon from any type of organic waste, scientists have found. Organic compounds i… [+2688 chars]"}, {"source": {"id": null, "name": "The Maritime Executive"}, "author": null, "title": "Rectangular Iceberg Goes Viral - The Maritime Executive", "description": "A scientist with NASAs Operation IceBridge survey program recently spotted a rectangular iceberg flo...", "url": "https://www.maritime-executive.com/article/rectangular-iceberg-goes-viral", "urlToImage": "https://www.maritime-executive.com/media/images/article/Photos/Ocean/square-iceberg.c2ce8f.jpg", "publishedAt": "2018-10-23T22:26:28Z", "content": "An unnamed, one-mile-square iceberg off the Larsen C shelf (NASA / Jeremy Harbeck)\r\nBy\r\nThe Maritime Executive \r\n10-23-2018 06:30:00 \r\nA scientist with NASA's Operation IceBridge survey program recen… [+1190 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "KERRY SHERIDAN | AFP", "title": "Rare 'super blood blue moon' visible on Jan 31 - Arab News", "description": "MIAMI: A cosmic event not seen in 36 years — a rare “super blood blue moon” — may be glimpsed January 31 in parts of western North America, Asia, the Middle East, Russia and Australia. The event is causing a buzz because it combines three unusual lunar events…", "url": "https://www.arabnews.com/node/1234506", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/01/28/1086121-1466084572.jpg", "publishedAt": "2018-08-27T15:49:34Z", "content": "NEW DELHI: Mahboob Radio Service, reads the faded panel on a small repair shop near the 16th-century Charminar mosque in the heart of the old town of Hyderabad.\r\nThe shop, which has been open since 1… [+2632 chars]"}, {"source": {"id": null, "name": "Billboard"}, "author": "Hilary Hughes", "title": "Elon Musk Says He's 'Inspired' by Kanye West at SXSW - Billboard", "description": null, "url": "https://www.billboard.com/articles/news/8240348/elon-musk-kanye-west-inspiration-sxsw", "urlToImage": "https://static.billboard.com/files/media/Elon-Musk-sxsw-2018-a-billboard-1548-compressed.jpg", "publishedAt": "2018-03-11T19:38:41Z", "content": "Elon Musk may be an innovator and icon for several South by Southwest festival attendees, but the engineer and tech magnate made it clear who he turns to for inspiration -- and it's one of the best i… [+403 chars]"}]}