{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "New algorithms combined with wearable sensors to track symptoms of Parkinson’s disease - Tech Explorist", "description": "EPFL scientists have developed algorithms that, combined with wearable sensors, could help clinicians to monitor the progression of Parkinson’s disease and assess the effects of medications commonly used by people with this neurodegenerative disorder.", "url": "https://www.techexplorist.com/new-algorithms-combined-wearable-sensors-track-symptoms-parkinsons-disease/38694/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/04/parkinson-disease.jpg", "publishedAt": "2021-04-13T15:41:53Z", "content": "Parkinson’s disease, a brain disorder that affects neurons in an area of the brain that controls movement, causing tremors, difficulty walking, and other motor problems. As the disease progresses, pe… [+2965 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Scientists Discover Third Liquid Phase in Atmospheric Aerosol Particles - AZoCleantech", "description": "A team of researchers has identified the occurrence of three liquid phases in aerosol particles, thus transforming the understanding of air pollutants found in the Earth’s atmosphere.", "url": "https://www.azocleantech.com/news.aspx?newsID=29223", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29223_16183154945559124.jpg", "publishedAt": "2021-04-13T15:14:00Z", "content": "Written by AZoCleantechApr 13 2021\r\nA team of researchers has identified the occurrence of three liquid phases in aerosol particles, thus transforming the understanding of air pollutants found in the… [+3669 chars]"}, {"source": {"id": null, "name": "Optics.org"}, "author": "SPIE Europe Ltd", "title": "Australia-led partners develop optics to deal with 'space junk' - Optics.org", "description": "ANU and RMIT researchers’ adaptive optics to direct guide star laser being developed by Electro Optic Systems.", "url": "https://optics.org/news/12/4/12", "urlToImage": null, "publishedAt": "2021-04-13T15:13:43Z", "content": "13 Apr 2021\r\nANU and RMIT researchers adaptive optics to direct guide star laser being developed by Electro Optic Systems.\r\nResearchers at The Australian National University (ANU) have harnessed a te… [+3137 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Petra Wiesmayer", "title": "Special light waves penetrate opaque materials - Innovation Origins", "description": "Researchers have succeeded in penetrating opaque material with special light waves as if the material did not even exist.", "url": "https://innovationorigins.com/special-light-waves-penetrate-opaque-materials/", "urlToImage": "https://innovationorigins.com/app/uploads/2021/04/newsimage348534.jpg", "publishedAt": "2021-04-13T15:00:00Z", "content": "It sounds almost like science fiction, but it is reality. With the help of very special light waves, so-called “scattering-invariant light modes,” opaque objects can be made transparent – at least fo… [+4852 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "A new way to find gigantic black holes paired up at the dawn of the Universe - SYFY WIRE", "description": "Using what's really a pretty dang clever new technique, astronomers have discovered what appear to be two double-quasars (and possibly a third pair as well) billions of light years from Earth. This may help constrain how many of these ferocious objects existe…", "url": "https://www.syfy.com/syfywire/a-new-way-to-find-gigantic-black-holes-paired-up-at-the-dawn-of-the-universe", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/double_quasar_art.jpg?offset-y=0", "publishedAt": "2021-04-13T13:00:00Z", "content": "Using what's really a pretty dang clever new technique, astronomers have discovered what appear to be two double-quasars (and possibly a third pair as well) billions of light years from Earth. This m… [+5458 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "New flying reptile that lived in China 160 years ago reveals the oldest opposed thumb - EdexLive", "description": "A team of international researchers has discovered the earliest-known example of an opposed thumb on a new tree-dwelling pterosaur species that lived in China 160 million years ago", "url": "https://www.edexlive.com/news/2021/apr/13/new-flying-reptile-that-lived-in-china-160-years-ago-reveals-the-oldest-opposed-thumb-19743.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2021/4/13/w600X390/download_1.jpg", "publishedAt": "2021-04-13T11:49:00Z", "content": "A team of international researchers has discovered the earliest-known example of an opposed thumb on a new tree-dwelling pterosaur species that lived in China 160 million years ago. Dubbed 'Monkeydac… [+1816 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "Why is Antarctica’s ‘Doomsday Glacier’ melting more rapidly than expected? All you need to know - Jagran Josh", "description": "The Thwaites glacier is also referred to as the Doomsday glacier. It got this name due to the risk it poses to the world once it melts.", "url": "https://www.jagranjosh.com/current-affairs/why-is-antarcticas-doomsday-glacier-melting-more-rapidly-than-expected-all-you-need-to-know-1618313720-1", "urlToImage": "https://img.jagranjosh.com/images/2021/April/1342021/Uncrewed_submersive_Ran.jpg", "publishedAt": "2021-04-13T11:39:00Z", "content": "Researchers at the Swedens University of Gothenburg in a study of the Thwaites Glacier, also known as the Doomsday Glacier, found that the glacier is melting away faster than previously anticipated.\r… [+2782 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The drive to define workers' rights in space - Space Bollyinside - BollyInside", "description": "Translating human rights to professional astronauts and other spaceflyers isn’t necessarily straightforward. Experts say the international community needs", "url": "https://www.bollyinside.com/news/the-drive-to-define-workers-rights-in-space/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-13T11:22:23Z", "content": "Translating human rights to professional astronauts and other spaceflyers isnt necessarily straightforward. Experts say the international community needs to start grappling with that now, decades bef… [+3116 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "OneIndia Correspondent", "title": "Farthest gamma-ray emitting active galaxy with narrow emission lines discovered - Oneindia", "description": "Astronomers have discovered a new active galaxy identified as the farthest gamma-ray emitting galaxy that has so far been stumbled upon. This active galaxy called the Narrow-Line Seyfert 1 (NLS1) galaxy, which is about 31 billion light-years away, opens up av…", "url": "https://www.oneindia.com/india/farthest-gamma-ray-emitting-active-galaxy-with-narrow-emission-lines-discovered-3244108.html", "urlToImage": "https://www.oneindia.com/img/1200x80/2021/04/gamma-ray-1618310224.jpg", "publishedAt": "2021-04-13T10:41:09Z", "content": "New Delhi, Apr 13: Astronomers have discovered a new active galaxy identified as the farthest gamma-ray emitting galaxy that has so far been stumbled upon. This active galaxy called the Narrow-Line S… [+3081 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Scientists create music from spider web structure, experts think it might allow humans to 'talk' to them - Times Now", "description": "In the next phase of the study, the team wants to learn how to communicate with spiders using their own language.", "url": "https://www.timesnownews.com/the-buzz/article/scientists-create-music-from-spider-web-structure-experts-think-it-might-allow-humans-to-talk-to-them/744650", "urlToImage": "https://imgk.timesnownews.com/story/SPID_3.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-04-13T10:33:32Z", "content": "You see it in your house sometimes or at an abandoned storehouse. It's something that is all around us and yet it leaves us intrigued every time we see them.\r\nSpider webs are indeed masterful works t… [+2009 chars]"}, {"source": {"id": null, "name": "Commentaryboxsports.com"}, "author": "Faye Welch", "title": "Black holes love to eat, but they have different table manners - Commentary Box Sports", "description": "This is evidenced by research conducted by astronomers from Groningen, Manchester and Pretoria using hypersensitive radio telescopes in a well-studied", "url": "https://commentaryboxsports.com/black-holes-love-to-eat-but-they-have-different-table-manners/", "urlToImage": null, "publishedAt": "2021-04-13T10:27:31Z", "content": "This is evidenced by research conducted by astronomers from Groningen, Manchester and Pretoria using hypersensitive radio telescopes in a well-studied part of the universe. They will soon publish the… [+1771 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Asteroid Size of a Truck Gave Earth, Satellites a Close Shave in Recent Fly-fly - News18", "description": "The rock named Asteroid 2021GW4 was well inside the ring where many artificial satellites orbit around the Earth at an altitude of 35,786 Km.", "url": "https://www.news18.com/news/buzz/asteroid-size-of-a-truck-gave-earth-satellites-a-close-shave-in-recent-fly-fly-3635678.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618302142_untitled-design-2021-04-13t134922.794.png", "publishedAt": "2021-04-13T08:35:04Z", "content": "A small piece of space rock came very close to Earth's orbit but passed on harmlessly at the end. According to Harvard astronomer Jonathan McDowell, the rock which was reported to be of the size of a… [+2355 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "'Are We All Lost Stars?' Over 5,000 Tonnes of Extraterrestrial Dust Lands on Earth Each Year - News18", "description": "According to a new study from the French National Center for Scientific Research (CNRS), every year, around 5,200 tonnes of galactic dust penetrates our atmosphere to land on planet Earth.", "url": "https://www.news18.com/news/buzz/are-we-all-lost-stars-over-5000-tonnes-of-extraterrestrial-dust-lands-on-earth-each-year-3635489.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1617107070_rtx8anqh.jpg", "publishedAt": "2021-04-13T07:57:58Z", "content": "According to a new study from the French National Center for Scientific Research (CNRS), every year, around 5,200 tonnes of galactic dust penetrates our atmosphere to land on planet Earth. Created by… [+1561 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "NASA releases images of electric blue dunes on Mars to mark 20 years of Odyssey - Livemint", "description": "These shots were captured by the Thermal Emission Imaging System instrument on the Odyssey orbiter which has sent back more than 1 million images since it began circling Mars.", "url": "https://www.livemint.com/science/news/nasa-releases-images-of-electric-blue-dunes-on-mars-to-mark-20-years-of-odyssey-11618286616804.html", "urlToImage": "https://images.livemint.com/img/2021/04/13/600x338/Blue_Dunes_1618286668003_1618286684449.jpg", "publishedAt": "2021-04-13T04:27:37Z", "content": "The National Aeronautics and Space Administration (NASA) recently shared an image of Mars in which the surface of the Red Planet is visible. Titled 'Blue Dunes of Red Planet', the picture combines sh… [+1148 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Mars helicopter Ingenuity: How to watch first flight unfold live - CNET", "description": "NASA hopes to make aviation history -- on another planet. Here's how to follow Ingenuity's first flight.", "url": "https://www.cnet.com/how-to/nasa-mars-helicopter-ingenuity-how-to-watch-first-flight-unfold-live/", "urlToImage": "https://www.cnet.com/a/img/an6cDxzL79kDVeD7NFx7tyNJF4s=/1200x630/2021/04/09/a6de0888-f6cc-42e4-84b5-c660dc8dcb54/ingenuityonmars.jpg", "publishedAt": "2021-04-13T03:34:52Z", "content": "NASA's experimental Ingenuity helicopter hopes to take flight on Mars.\r\nNASA/JPL-Caltech/ASU\r\nThis story is part of Welcome to Mars, our series exploring the red planet.\r\nLet's take a moment to marve… [+2318 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Odisha Student Team Designs Rover For NASA Human Rover Exploration Challenge 2021 - News18", "description": "Elon Musk may be \"going to the moon,\" soon, even if it is metaphorically, but students of a school in India may be driving the NASA's rover on the moon, literally.", "url": "https://www.news18.com/news/buzz/odisha-student-team-designs-rover-for-nasa-human-rover-exploration-challenge-2021-3634343.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618281085_untitled-design-23.jpg", "publishedAt": "2021-04-13T02:32:08Z", "content": "Elon Musk may be “going to the moon,” soon, even if it is metaphorically, but students of a school in India may be driving the NASA’s rover on the moon, literally. Students from the Cuttack-based Nav… [+2396 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "\"Post News Network\"", "title": "One-third of the Antarctic ice shelf is at risk of collapse; read details - OrissaPOST", "description": "London: As climate change is making temperatures soar, more than a third of the Antarctic’s ice shelf could be at risk of collapsing into the sea, and causing global sea-levels to rise, new research has shown. The study, led by a researcher at the University …", "url": "https://www.orissapost.com/one-third-of-the-antarctic-ice-shelf-is-at-risk-of-collapse-read-details/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2021/04/antarctica.jpg", "publishedAt": "2021-04-13T02:13:44Z", "content": "London: As climate change is making temperatures soar, more than a third of the Antarctic’s ice shelf could be at risk of collapsing into the sea, and causing global sea-levels to rise, new research … [+1950 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Brad Bergan", "title": "How Do We Build Cities on Mars? - Interesting Engineering", "description": "Nüwa could become the most advanced city on Mars! Check out how ABIBOO plans to build it.", "url": "https://interestingengineering.com/mars-abiboo-nuwa-city", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/4N61p9mKGJ/sizes/mars-abiboo-nuwa-city_md.jpg", "publishedAt": "2021-04-13T02:03:06Z", "content": "Centuries ago, Sir Isaac Newton said of his many discoveries that if he'd seen further, it was only \"by standing on the shoulders of giants.\" In the 21st century, space-faring companies and nations m… [+9459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: As Ingenuity gears up for flight on Mars, significance of helicopter’s mission - The Indian Express", "description": "If things go as planned, Ingenuity, a 1.8-kilogram rotorcraft, will become the first helicopter to fly on another planet.", "url": "https://indianexpress.com/article/explained/ingenuity-mars-significance-of-helicopters-mission-7270835/", "urlToImage": "https://images.indianexpress.com/2021/04/NASA-1200.jpg", "publishedAt": "2021-04-13T00:59:00Z", "content": "NASAs Ingenuity Helicopter, which was sent to Mars strapped to the Perseverance rover, will take its first experimental flight on the Red Planet on or after April 14, the space agency has announced. … [+1937 chars]"}, {"source": {"id": null, "name": "Nintendo-power.com"}, "author": "Ebenezer Robbins", "title": "\"For the first time, we can trace the evolution of climate in millions of years.\" - Nintendo-Power", "description": "When it landed on Mars last February, diligence stole the show from another rover: Curiosity. It has been almost ten years since the latter explored the", "url": "https://nintendo-power.com/for-the-first-time-we-can-trace-the-evolution-of-climate-in-millions-of-years/", "urlToImage": null, "publishedAt": "2021-04-12T23:16:07Z", "content": "When it landed on Mars last February, diligence stole the show from another rover: Curiosity. It has been almost ten years since the latter explored the Gale Valley. In the past, a Franco-American te… [+3319 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Hubble telescope clicks haunting image of a dying galaxy - WION", "description": "Death is a thing that cant be defeated. It comes for us and also for astronomical bodies. An image of a galaxy captured by NASAs Hubble space telescope looks so solemn that it is sure to make anyone looking at it just a little contemplative.", "url": "https://www.wionews.com/science/nasas-hubble-telescope-clicks-haunting-image-of-a-dying-galaxy-377173", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/04/13/191223-dying-galaxy.jpg", "publishedAt": "2021-04-12T21:51:40Z", "content": "Death is a thing that can't be defeated. It comes for us and also for astronomical bodies. An image of a galaxy captured by NASA's Hubble space telescope looks so solemn that it is sure to make anyon… [+1056 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Atmospheric travel: Scientists find microplastic everywhere | Cornell Chronicle - Cornell Chronicle", "description": "By sea or by land, microscopic shards of plastic are more ubiquitous than science had known, according to a new study led by researchers at Cornell and Utah State University.", "url": "https://news.cornell.edu/stories/2021/04/atmospheric-travel-scientists-find-microplastic-everywhere", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/2021-04/0412_brahney-dust-and-plstics2b.jpg?itok=-tF_ceKk", "publishedAt": "2021-04-12T19:35:56Z", "content": "Vast watery parcels of plastic made of soda bottle flotsam and shopping bag jetsam appear in our oceans as large floating islands. On roadways, plastic is often tossed, broken down into smaller piece… [+3578 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Life on Venus? First we need to know more about the molecules in the atmosphere - news - Space Bollyinside - BollyInside", "description": "So when an international team of scientists last year claimed to have detected phosphine in the atmosphere of Venus, it raised the tantalising prospect of", "url": "https://www.bollyinside.com/news/life-on-venus-first-we-need-to-know-more-about-the-molecules-in-the-atmosphere-news/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-12T19:29:12Z", "content": "So when an international team of scientists last year claimed to have detected phosphine in the atmosphere of Venus, it raised the tantalising prospect of the first evidence of life on another planet… [+2752 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Ian le Guillou, The Science Advisory Board contributing writer", "title": "A CRISPR on-off switch for genes controls expression without altering DNA - The Science Board", "description": "A new gene silencing tool allows scientists to switch genes on and off without altering genetic sequences. The tool, described in a paper published in <em>Cell</em> on April 9, uses a modified CRISPR-Cas9 system to introduce reversible epigenetic changes that…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=2476", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_pro/2021_04_12_15_13_2630_2021_04_12_epigenome_CRISPR_20210412155459.jpg", "publishedAt": "2021-04-12T18:23:31Z", "content": "The classic CRISPR-Cas9 system led to an explosion in gene editing studies since it was first developed almost a decade ago. It became quickly popular thanks to its ease of use compared to previous g… [+4827 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Unusual fossil reveals last meal of prehistoric pollinator - India Education Diary", "description": "The animal’s remains were unearthed by researchers at the University of Bristol and the Nanjing Institute of Geology and Palaeontology of the Chinese Academy of Sciences (NIGPAS) who were able to study its fossil faecal matter, which was composed sol", "url": "https://indiaeducationdiary.in/university-of-bristol-unusual-fossil-reveals-last-meal-of-prehistoric-pollinator/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2-1024x309.png", "publishedAt": "2021-04-12T18:15:32Z", "content": "The animals remains were unearthed by researchers at the University of Bristol and the Nanjing Institute of Geology and Palaeontology of the Chinese Academy of Sciences (NIGPAS) who were able to stud… [+3618 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "'Sink into your grief.' How one scientist confronts the emotional toll of climate change - Science Magazine", "description": "In new book, Kimberly Nicholas describes students “running into a house that is on fire”", "url": "https://www.sciencemag.org/news/2021/04/sink-your-grief-how-one-scientist-confronts-emotional-toll-climate-change", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/Kimberly%20Nichols-1280x720.jpg?itok=EOjx1_Q1", "publishedAt": "2021-04-12T17:55:00Z", "content": "Sustainability scientist Kimberly Nicholas says confronting climate change requires acknowledging values and feelings as well as advancing science and policy.\r\nJanet Nichols \r\nBy David MalakoffApr. 1… [+7278 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Stephen Johnson", "title": "The evolution of modern rainforests began with the dinosaur-killing asteroid - Big Think", "description": "The lush biodiversity of South America's rainforests is rooted in one of the most cataclysmic events that ever struck Earth.", "url": "https://bigthink.com/surprising-science/evolution-of-rainforests", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjAzNTExNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3NDE0NTc1MX0.MZCuIUsbmZFLQD32YE57qVJeTqBDsnNv80RPNgtmxoc/img.jpg?width=1200&coordinates=0%2C130%2C0%2C130&height=600", "publishedAt": "2021-04-12T17:04:35Z", "content": "<ul><li>One especially mysterious thing about the asteroid impact, which killed the dinosaurs, is how it transformed Earth's tropical rainforests.</li><li>A recent study analyzed ancient fossils coll… [+3292 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "The Methane-Eating Bacteria in Trees that Can Help Curb Greenhouse Gases - AZoCleantech", "description": "By Robert Lea Apr 12 2021 MagSpace / Shutterstock.com A newly discovered bacteria could help offset methane produced by trees and assist in a strategy that could ultimately combat climate change.", "url": "https://www.azocleantech.com/news.aspx?newsID=29222", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29222_16182448652935694.jpg", "publishedAt": "2021-04-12T16:29:00Z", "content": "MagSpace / Shutterstock.com\r\nA newly discovered bacteria could help offset methane produced by trees and assist in a strategy that could ultimately combat climate change.\r\nIt's common knowledge that … [+5714 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Anthony Cuthbertson", "title": "Full moon 2021: Pink supermoon in April will be biggest and brightest of the year - The Independent", "description": "This month’s full moon will be the first supermoon since last May", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/space/full-moon-april-supermoon-b1828601.html", "urlToImage": "https://static.independent.co.uk/2021/04/12/17/full%20moon%202021%20pink%20supermoon.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-04-12T16:26:01Z", "content": "Aprils full moon will be the biggest and brightest of the year, appearing as the first of only two supermoons in 2021.\r\nThe rare spectacle occurs when the moon is approaching its closest point to Ear… [+2023 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Avery", "title": "NASA unveils brilliant new version of Hubble telescope image of the Veil Nebula - Daily Mail", "description": "Using new processing techniques, NASA was able to present the Veil's gas filaments in greater detail. Twice ionized oxygen is seen in blue, while ionized hydrogen and nitrogen glow red.", "url": "https://www.dailymail.co.uk/sciencetech/article-9462435/NASA-unveils-brilliant-new-version-Hubble-telescope-image-Veil-Nebula.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/12/16/41659986-0-image-a-14_1618242142965.jpg", "publishedAt": "2021-04-12T16:25:46Z", "content": "NASA has released a enhanced image of the Veil Nebula that presents greater details of the filaments of ionized gas that give it its name.\r\nThe Hubble Space Telescope originally captured photos of th… [+3613 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "Scientists work out what rain is like on other planets (and it could help us find habitable worlds) - Yahoo India News", "description": "Researchers have found that raindrops are remarkably similar across different planets, even ones as drastically different as Earth and Jupiter.", "url": "https://in.news.yahoo.com/rain-planets-alien-161353436.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/x1pbcpkW6cU4HZAdEDrG4A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xNDE4/https://s.yimg.com/os/creatr-images/2019-06/45de0390-87bc-11e9-8eeb-29bb73895d98", "publishedAt": "2021-04-12T16:13:53Z", "content": "On Saturns moon Titan, it rains methane, or liquified natural gas and on Neptune, scientists suspect it rains pure carbon in the form of diamonds. (Getty)\r\nIf youve ever wondered what rain might feel… [+2656 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Researchers discover the science behind varying performance of different colored LEDs - Nanowerk", "description": "The findings pave the way for development of more efficient, next-gen LEDs covering the entire visible spectrum.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57762.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57762.jpg", "publishedAt": "2021-04-12T16:07:58Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "The indestructible light beam - Nanowerk", "description": "Scientists create special light waves that can penetrate even opaque materials as if the material was not even there.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=57758.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id57758.jpg", "publishedAt": "2021-04-12T15:36:42Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Sweden rejects pioneering test of solar geoengineering tech - Devdiscourse", "description": "(Clarifies scope of first planned test throughout) By Laurie Goering  LONDON, March 31 (Thomson Reuters Foundation) - Under pressure from indigenous people and environmental groups, Sweden's space agency on Wednesday called off a landmark first test of techno…", "url": "https://www.devdiscourse.com/article/science-environment/1531553-sweden-rejects-pioneering-test-of-solar-geoengineering-tech", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_29_23_945969.png?width=920&format=jpeg", "publishedAt": "2021-04-12T15:26:09Z", "content": "(Clarifies scope of first planned test throughout) By Laurie Goering\r\nLONDON, March 31 (Thomson Reuters Foundation) - Under pressure from indigenous people and environmental groups, Sweden's space ag… [+3566 chars]"}, {"source": {"id": null, "name": "Altenergymag.com"}, "author": null, "title": "Solar Tracker Estimated to be Pushed by way of Innovation & Industrialization - AltEnergyMag", "description": "Solar Tracker is an electromechanical assembly used for tracking the movement of the Sun during the course of day in order to improve the efficiency of the solar power generation system.", "url": "https://www.altenergymag.com/news/2021/04/12/solar-tracker-estimated-to-be-pushed-by-way-of-innovation-industrialization/34894", "urlToImage": "https://www.altenergymag.com/images/facebooknews.jpg", "publishedAt": "2021-04-12T15:23:23Z", "content": "Solar Tracker is an electromechanical assembly used for tracking the movement of the Sun during the course of day in order to improve the efficiency of the solar power generation system.There are man… [+2488 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "OSIRIS-REx Did One Last Close Flyby of Asteroid Bennu. It’s Almost Time to Come Home - Universe Today", "description": "After more than two years in orbit around asteroid Bennu, NASA’s OSIRIS-REx spacecraft is ready to come home. It’s bringing with it a pristine sample of space rocks that geologists here on Earth are eager to study up close. The sample will arrive in September…", "url": "https://www.universetoday.com/150847/osiris-rex-did-one-last-close-flyby-of-asteroid-bennu-its-almost-time-to-come-home/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/04/Osirisrextagprint2016.jpg", "publishedAt": "2021-04-12T13:39:18Z", "content": "After more than two years in orbit around asteroid Bennu, NASA’s OSIRIS-REx spacecraft is ready to come home. It’s bringing with it a pristine sample of space rocks that geologists here on Earth are … [+4411 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Chemical fingerprint of Osiris reveals that it formed far away from its star - Firstpost", "description": "Osiris is about two-thirds the size of Jupiter is the first exoplanet that is known to have an atmosphere.", "url": "https://www.firstpost.com/tech/science/chemical-fingerprint-of-osiris-reveals-that-it-formed-far-away-from-its-star-9520781.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/04/Osiris-HD-209458-b.jpg", "publishedAt": "2021-04-12T13:32:18Z", "content": "FP TrendingApr 12, 2021 19:02:18 IST\r\nA new study conducted by the researchers at the University of Warwick has uncovered information about the atmospheric composition of Osiris, an exoplanet that wa… [+1686 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Yukon Wolves Survived Ice-Age Extinction Thanks to Changes in Their Diet | Paleontology - Sci-News.com", "description": "Gray wolves (Canis lupus) from the Yukon Territory, Canada, survived the extinction at the end of the last Ice Age by adapting their diet over thousands of years -- from a primary reliance on horses (Equus sp.) during the Pleistocene, to moose (Alces alces) a…", "url": "http://www.sci-news.com/paleontology/yukon-wolves-diet-09542.html", "urlToImage": "http://cdn.sci-news.com/images/2021/04/image_9542f-Pleistocene-Gray-Wolves.jpg", "publishedAt": "2021-04-12T13:10:01Z", "content": "Gray wolves (Canis lupus) from the Yukon Territory, Canada, survived the extinction at the end of the last Ice Age by adapting their diet over thousands of years — from a primary reliance on horses (… [+2686 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Modern Human Brain Originated 1.7 Million Years Ago in Africa, New Study Reveals - News18", "description": "The first populations of the genus Homo, which emerged in Africa about 2.5 million years ago, walked straight up but they had brains similar to primitive ape, about half the size of ours.", "url": "https://www.news18.com/news/buzz/modern-human-brain-originated-1-7-million-years-ago-in-africa-new-study-reveals-3632921.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618230985_untitled-design-2021-04-12t180350.328.png", "publishedAt": "2021-04-12T12:40:16Z", "content": "One of the most intriguing questions we face is: When and where did the modern human brain evolve? The first populations of the genus Homo, which emerged in Africa about 2.5 million years ago, walked… [+1770 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "NASA Shares Interesting Facts About ‘Earth's Sister Planet’ Venus on National Siblings Day - News18", "description": "Venus, the second planet from the Sun, is often referred to as Earth's twin because both worlds share a similar size, surface composition and have an atmosphere with a complex weather system.", "url": "https://www.news18.com/news/buzz/nasa-shares-interesting-facts-about-earths-sister-planet-venus-on-national-siblings-day-3632561.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618229131_venus.png", "publishedAt": "2021-04-12T12:13:21Z", "content": "Venus, the second planet from the Sun, is often referred to as Earth’s twin because both worlds share a similar size, surface composition and have an atmosphere with a complex weather system to name … [+1916 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "Did we just discover new physics? These theoretical physicists don't think so - The Next Web", "description": "Fifteen years ago, physicists at Brookhaven National Laboratory discovered that muons were moving in unexpected ways that didn’t match theoretical predictions. Was their theory wrong?", "url": "https://thenextweb.com/news/did-we-just-discover-new-physics-theoretical-physicists-dont-think-so-syndication", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F04%2Fmuon.jpg&signature=6342f78f9ba3ec10021a5d2a692d822d", "publishedAt": "2021-04-12T10:14:00Z", "content": "When the results of an experiment dont match predictions made by the best theory of the day, something is off.\r\nFifteen years ago, physicists at Brookhaven National Laboratory discovered something pe… [+7372 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "NASA aims to land first woman, person of colour on Moon by 2024 under 'Artemis' mission - Hindustan Times", "description": "Under the 'Artemis' programme, sponsored by the Biden-Harris administration, Nasa plans to land a woman and a person of colour, both firsts for our time, on the Moon's surface by 2024.", "url": "https://www.hindustantimes.com/world-news/nasa-aims-to-land-first-woman-person-of-colour-on-moon-by-2024-101618214004696.html", "urlToImage": "https://images.hindustantimes.com/img/2021/04/12/1600x900/161821673986345607_1618216790277_1618216803110.png", "publishedAt": "2021-04-12T09:20:03Z", "content": "The National Aeronautics and Space Administration (NASA), the US space agency, has said that in addition to landing the first woman on the Moon, it also plans to send the first person of colour to th… [+2118 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Student astronomy team from Odisha designs rover to exhibit at NASA challenge - Hindustan Times", "description": "Ten young students have worked hard day and night for the last eight months during the COVID pandemic to make their rover, NaPSAT 1.0 (Navonmesh Prasar Student Astronomy Team) as perfect as possible.", "url": "https://www.hindustantimes.com/trending/student-astronomy-team-from-odisha-designs-rover-to-exhibit-at-nasa-challenge-101618213713546.html", "urlToImage": "https://images.hindustantimes.com/img/2021/04/12/1600x900/EyuENR9VEAAsHYk_1618213912973_1618213943554.jpg", "publishedAt": "2021-04-12T07:55:43Z", "content": "Cuttack-based Navonmesh Prasar Student Astronomy Team (NaPSAT), comprising of 10 school students, has designed a rover to be exhibited at NASA Human Rover Exploration Challenge 2021.\r\n\"The rover has … [+1019 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "SpaceX is installing Starlink Dish in an updated spacecraft prototype - brytfmonline.com", "description": "In the latest long string of twists and turns, SpaceX has asked the Federal Communications Commission (FCC) permission to operate a Starlink Internet", "url": "https://www.brytfmonline.com/spacex-is-installing-starlink-dish-in-an-updated-spacecraft-prototype/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2021/04/SpaceX-is-installing-Starlink-Dish-in-an-updated-spacecraft-prototype.jpg", "publishedAt": "2021-04-12T07:04:39Z", "content": "In the latest long string of twists and turns, SpaceX has asked the Federal Communications Commission (FCC) permission to operate a Starlink Internet antenna pinned to the Starship 15 (SN15) serial n… [+3579 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Earth receives tonnes of dust each year, thanks to asteroids - Free Press Journal", "description": "Every year, over 5,000 tonnes of extraterrestrial dust fall to Earth each year, scientists have determined. Our home planet encounters dust from comets and asteroids. These interplanetary dust particles pass through our atmosphere and give rise to shooting st…", "url": "https://www.freepressjournal.in/science/earth-receives-tonnes-of-dust-each-year-thanks-to-asteroids", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-04%2Fd2cfd658-9848-4be0-b539-739d6eb73cc2%2Fasteroid_Earth_1.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-04-12T05:43:28Z", "content": "London: Every year, over 5,000 tonnes of extraterrestrial dust fall to Earth each year, scientists have determined. Our home planet encounters dust from comets and asteroids. These interplanetary dus… [+2077 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Haunting New Hubble Photo Reveals The Wisps of a Dying Galaxy - ScienceAlert", "description": "From the smallest microbe to the mightiest oak, death is as true for above as it is for below, even for the mightiest galaxies.", "url": "https://www.sciencealert.com/haunting-new-image-from-hubble-shows-a-dying-galaxy", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/ngc-1947-header_1024.jpg", "publishedAt": "2021-04-12T05:37:39Z", "content": "From the smallest microbe to the mightiest oak, death is as true for above as it is for below, even for the mightiest galaxies.\r\nThe process, however, is not a quick one. A haunting new Hubble photo … [+2192 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Sanjana Kalyanpur", "title": "Did Earth have water even before the Big Bang? Heres what the new data has to say - Republic TV", "description": "Up until now, it was believed that water on Earth was formed after the asteroid's collision. Now a new study suggests that the Earth had always had water.", "url": "https://www.republicworld.com/technology-news/science/did-earth-have-water-even-before-the-big-bang-heres-what-the-new-data-has-to-say.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ch3xqyg1wngbtzps_1618202012.jpeg?tr=f-jpeg", "publishedAt": "2021-04-12T05:11:00Z", "content": "Up until now, most of us have learnt that the Earth got its water after asteroids rained down ice from the outer solar system. Now another jarring theory has come into being that suggests that the pl… [+2021 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "Australia's 'Black Summer' Fires Have Left a Shocking Effect on Earth's Atmosphere - ScienceAlert", "description": "The scorching destruction of Australia's Black Summer bushfires between 2019 and 2020 provided an ominous glimpse of fire's reach in our hotter, dryer world, and the impact of the unprecedented inferno is still being measured.", "url": "https://www.sciencealert.com/australia-s-bushfires-were-so-intense-they-heated-up-the-atmosphere-for-half-a-year", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/010-bushfires-1_1024.jpg", "publishedAt": "2021-04-12T02:50:11Z", "content": "The scorching destruction of Australia's Black Summer bushfires between 2019 and 2020 provided an ominous glimpse of fire's reach in our hotter, dryer world, and the impact of the unprecedented infer… [+2616 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Will Smith", "title": "Apollo 13 mission turns 51 years old; Remember the movie - Sprout Wired", "description": "Launched in space in April 1970, the mission did not achieve the expected success 11/04/2021 at 9:44 Today is not TBT Day, but good films should not be", "url": "https://www.sproutwired.com/apollo-13-mission-turns-51-years-old-remember-the-movie/", "urlToImage": null, "publishedAt": "2021-04-11T18:48:10Z", "content": "Today is not TBT Day, but good films should not be missed only on Thursdays. Idiom “Houston we have a problem“Something reminds you?”\r\nFull Apollo 13 launch on 11 April 51 years. a space mission US p… [+1523 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Mars had dry and wet eras and dried up for good 3 billion years ago - Space Bollyinside - BollyInside", "description": "A new study based on data from NASA‘s Curiosity Mars rover, which continues to explore Mount Sharp’s base on the Red Planet, suggests that Mars had drier", "url": "https://www.bollyinside.com/news/mars-had-dry-and-wet-eras-and-dried-up-for-good-3-billion-years-ago/", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2020/08/Kirti-Kulhari-on-being-a-married-actress.png", "publishedAt": "2021-04-11T17:43:52Z", "content": "A new study based on data from NASAs Curiosity Mars rover, which continues to explore Mount Sharps base on the Red Planet, suggests that Mars had drier and wetter eras before drying up entirely about… [+1647 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "LIVESTREAM OF INGENUITY HELICOPTER DATA ARRIVAL AND POST-FLIGHT BFG, Apr 15??, 2021, virtual - SpacePolicyOnline.com", "description": "Posted: April 6, 2021 5:07 pm ET | Last Updated: April 10, 2021 1:36 pm ET | Update, April 10:  NASA just announced a postponement of the first flight until no earlier than Wednesday, April 14, because of anomalous data returned during a test last night.  Ass…", "url": "https://spacepolicyonline.com/events/livestream-of-ingenuity-helicopter-data-arrival-and-post-flight-bfg-apr-12-2021-virtual/", "urlToImage": null, "publishedAt": "2021-04-11T05:38:17Z", "content": "Update, April 10:  NASA just announced a postponement of the first flight until no earlier than Wednesday, April 14, because of anomalous data returned during a test last night.  Assuming they follow… [+1054 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dennis Overbye", "title": "Breakthrough discovery of misbehaving muon challenges known laws of the physical universe- Technology News - Firstpost", "description": "Experiments with particles known as muons suggest that there are forms of matter and energy vital to the nature and evolution of the cosmos that are not yet known to science.", "url": "https://www.nytimes.com/2021/04/07/science/particle-physics-muon-fermilab-brookhaven.html", "urlToImage": "https://static01.nyt.com/images/2021/04/09/science/07FERMILAB2/07FERMILAB2-facebookJumbo-v2.jpg", "publishedAt": "2021-04-09T12:00:43Z", "content": "At Fermilab, a new campus devoted to studying muons was being built.\r\nThat opened up a world of possibility, Dr. Polly recalled in his biographical article. By this time, Dr. Polly was working at Fer… [+1410 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Russia’s Soyuz-2.1a rocket with manned spacecraft blasts off from Baikonur spaceport - TASS", "description": "The spacecraft will deliver Russian cosmonauts Oleg Novitsky and Pyotr Dubrov and NASA astronaut Mark Vande Hei to the International Space Station", "url": "https://tass.com/science/1275889", "urlToImage": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20210409/1309301.jpg", "publishedAt": "2021-04-09T07:54:26Z", "content": "BAIKONUR COSMODROME /Kazakhstan/, April 9. /TASS/. A Russian Soyuz-2.1a carrier rocket with a manned spacecraft named after Yuri Gagarin blasted off from the Baikonur Cosmodrome.\r\nThe carrier rocket … [+414 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Auto", "title": "Elon Musk targets telecom for next disruption with Starlink internet - ETAuto.com", "description": "SpaceX has told investors that Starlink is angling for a piece of a $1 trillion market made up of in-flight internet, maritime services, demand in China and India -- and rural customers.", "url": "https://auto.economictimes.indiatimes.com/news/industry/elon-musk-targets-telecom-for-next-disruption-with-starlink-internet/80421005", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-80421005,imgsize-601228,width-800,height-434,overlay-etauto/elon-musk-targets-telecom-for-next-disruption-with-starlink-internet.jpg", "publishedAt": "2021-01-23T09:11:27Z", "content": "Elon Musk became the worlds richest person this month by upending the global auto industry and disrupting aerospace heavyweights with reusable rockets. Now hes setting his sights on another business … [+6686 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "By MARI YAMAGUCHI | AP", "title": "Japan awaits spacecraft return with asteroid soil samples - Arab News", "description": "TOKYO: Japan’s space agency said the Hayabusa2 spacecraft successfully separated a capsule and sent it toward Earth to deliver samples from a distant asteroid that could provide clues to the origin of the solar system and life on our planet. The Japan Aerospa…", "url": "https://www.arabnews.com/node/1772786", "urlToImage": "https://www.arabnews.com/sites/default/files/2020/12/05/2373551-1553701125.jpg", "publishedAt": "2020-12-05T08:32:19Z", "content": "TOKYO: Japans space agency said the Hayabusa2 spacecraft successfully separated a capsule and sent it toward Earth to deliver samples from a distant asteroid that could provide clues to the origin of… [+3997 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "Google-owned DeepMind AI solves 50-year-old 'protein folding problem' - ETCIO.com", "description": "Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes proteins fold into.", "url": "https://cio.economictimes.indiatimes.com/news/next-gen-technologies/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem/79522424", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79522424,imgsize-10287,width-800,height-434,overlay-etcio/google-owned-deepmind-ai-solves-50-year-old-protein-folding-problem.jpg", "publishedAt": "2020-12-02T03:20:27Z", "content": "London: Researchers at Google-owned Artificial Intelligence company DeepMind have solved a 50-year-old grand challenge in biology known as the \"protein folding problem,\" revealing what shapes protein… [+1804 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "One step closer to understanding the human brain : Study - ETHealthworld.com", "description": "An international team of scientists led by researchers at Karolinska Institutet in Sweden has launched a comprehensive overview of all proteins expressed in the brain, published today in the journal Science.", "url": "https://health.economictimes.indiatimes.com/news/industry/one-step-closer-to-understanding-the-human-brain-study/74513929", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-74513929,imgsize-126472,width-800,height-434,overlay-ethealthworld/one-step-closer-to-understanding-the-human-brain-study.jpg", "publishedAt": "2020-03-06T12:21:20Z", "content": "Representative image \r\nAn international team of scientists led by researchers at Karolinska Institutet in Sweden has launched a comprehensive overview of all proteins expressed in the brain, publishe… [+3297 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18 Staff", "title": "Chandrayaan 2: NASA Finds ISRO's Vikram Lander on Moon - News18", "description": "Almost three months after India lost contact with Chandrayaan-2’s Vikram lander while attempting a soft landing on the Moon’s South Polar region, a NASA satellite orbiting the Moon has found the crashed lander, the US space agency has said.", "url": "https://www.news18.com/photogallery/india/chandrayaan-2-nasa-finds-isros-vikram-lander-on-lunar-surface-2227479.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/11/NASA-Finds-ISROs-Vikram-Lander-on-Lunar.jpg", "publishedAt": "2019-12-03T03:36:40Z", "content": "News18 » \r\nPhotos » \r\nChandrayaan 2: NASA Finds ISRO's Vikram Lander on Moon"}, {"source": {"id": null, "name": "Arab News"}, "author": "Kerry SHERIDAN | AFP", "title": "Before Mars landing, a nail-biting 'six and a half minutes of terror' - Arab News", "description": "TAMPA, US: A spacecraft that cost nearly a billion dollars is on course to make a perilous landing Monday on Mars, if it can survive a high-speed approach and the scorching heat of entering the Red Planet’s atmosphere, a process NASA has nicknamed “six and a …", "url": "https://www.arabnews.com/node/1410096", "urlToImage": "https://www.arabnews.com/sites/default/files/2018/11/24/1378521-650711683.jpg", "publishedAt": "2019-08-26T17:08:11Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Purple bacteria may help harvest green fuel from wastewater - ETEnergyworld.com", "description": "The study showed that supplying electric current to purple phototrophic bacteria can recover nearly 100 per cent of carbon from any type of organic waste, while generating hydrogen gas for electricity production", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/innovation-purple-bacteria-may-help-harvest-green-fuel-from-wastewater/66619380", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-66619380,imgsize-62677,width-800,height-434,overlay-etenergyworld/innovation-purple-bacteria-may-help-harvest-green-fuel-from-wastewater.jpg", "publishedAt": "2018-11-14T10:14:21Z", "content": "London: A purple bacteria -- which store energy from light -- can help harvest hydrogen fuel from sewage, and recover carbon from any type of organic waste, scientists have found. Organic compounds i… [+2688 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "How crazy is Elon Musk's hypersonic space rocket airline idea? - ETEnergyworld.com", "description": "How crazy is Elon Musk's hypersonic space rocket airline idea?", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/how-crazy-is-elon-musks-hypersonic-space-rocket-airline-idea/60898625", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-60898625,imgsize-265114,width-800,height-434,overlay-etenergyworld/how-crazy-is-elon-musk-s-hypersonic-space-rocket-airline-idea.jpg", "publishedAt": "2017-10-15T23:11:57Z", "content": "By Justin BachmanFor whatever reason, some of the worlds smartest and most eccentric people tend to be drawn toward airlines. Elon Musk is the latest, but with a twistrockets.\r\nTacked onto a detailed… [+2862 chars]"}]}