{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "SpaceX launches its first batch of 60 Starlink satellites for the new year - Firstpost", "description": "The landing was crucial as the winds in the landing zone where the recovery ship was stationed exceeded the safety window.", "url": "https://www.firstpost.com/tech/science/spacex-launches-its-first-batch-of-60-starlink-satellites-for-the-new-year-9228171.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/screencapture-pbs-twimg-media-EsL2cuZUwAEIM-N-2021-01-22-09_41_55-1.jpg", "publishedAt": "2021-01-22T04:17:42Z", "content": "FP TrendingJan 22, 2021 09:47:42 IST\r\nThe first batch of Starlink satellites of this year was launched to orbit on 20 January 2021. As per reports, a total of 60 satellites were launched as part of t… [+1934 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": null, "title": "The Oldest Carbonates In The Solar System - Astrobiology - Astrobiology News", "description": null, "url": "http://astrobiology.com/2021/01/the-oldest-carbonates-in-the-solar-system.html", "urlToImage": null, "publishedAt": "2021-01-22T04:14:00Z", "content": "A meteorite that fell in northern Germany in 2019 contains carbonates which are among the oldest in the solar system; it also evidences the earliest presence of liquid water on a minor planet. \r\nThe … [+3513 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Astrosat satellite spots 'dinosaurs of the universe' globular star cluster: Dept of Sci-tech - Firstpost", "description": "The team of scientists found about 34 UV-bright stars were found to be members of the globular cluster.", "url": "https://www.firstpost.com/tech/science/astrosat-satellite-spots-dinosaurs-of-the-universe-globular-star-cluster-dept-of-sci-tech-9228141.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/The_globular_star_cluster_NGC_6362-1.jpg", "publishedAt": "2021-01-22T03:52:32Z", "content": "Press Trust of IndiaJan 22, 2021 09:22:32 IST\r\nAstronomers, with the help of India's first multi-wavelength space satellite Astrosat, have spotted a massive intriguing globular cluster in the Milky W… [+2919 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Mitochondrial mutation increases the risk of diabetes in Japanese men - Science Daily", "description": "A new study of Type 2 diabetes (T2D) in Japanese populations has uncovered a previously uncharacterized genetic variant that puts male carriers at greater risk for the disease, as well as the mechanism by which it does so. The impact of the variant was most p…", "url": "https://www.sciencedaily.com/releases/2021/01/210121153806.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-22T03:45:20Z", "content": "A new study of Type 2 diabetes (T2D) in Japanese populations has uncovered a previously uncharacterized genetic variant that puts male carriers at greater risk for the disease, as well as the mechani… [+6749 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Detailed tumour profiling - Science Daily", "description": "As part of a clinical study, researchers are conducting a thorough and highly precise investigation into the molecular and functional properties of tumors. Their goal is to help physicians to better determine which treatment will best match every patient's ca…", "url": "https://www.sciencedaily.com/releases/2021/01/210121132254.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-22T03:28:24Z", "content": "Researchers from the University Hospitals in Zurich and Basel, ETH Zurich, University of Zurich and the pharmaceutical company Roche have set out to improve cancer diagnostics by developing a platfor… [+3750 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "German scientists make paralysed mice walk again - Malay Mail", "description": "BERLIN, Jan 22 — German researchers have enabled mice paralysed after spinal cord injuries to walk again, re-establishing a neural link hitherto considered irreparable in mammals by using a designer protein injected into the brain. Spinal cord injuries in hum…", "url": "https://www.malaymail.com/news/life/2021/01/22/german-scientists-make-paralysed-mice-walk-again/1942902", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-01/2201_SCIENCE-GERMANY-GENETHERAPY-PARALYSIS-seo.JPG", "publishedAt": "2021-01-22T01:44:28Z", "content": "A combination picture shows a paralysed mouse (left) and a former-paralysed one in a lab at Ruhr University, where scientists discovered a way to restore the ability to walk in mice that had been par… [+1653 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "6 Things to Know About NASA's Mars Helicopter on Its Way to Mars - NASA Mars Exploration", "description": "Ingenuity, a technology experiment, is preparing to attempt the first powered, controlled flight on the Red Planet.", "url": "https://mars.nasa.gov/news/8840/6-things-to-know-about-nasas-mars-helicopter-on-its-way-to-mars/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/8840_Mars-Helicopter-Ingenuity-7secs.gif", "publishedAt": "2021-01-22T00:57:56Z", "content": "Ingenuity, a technology experiment, is preparing to attempt the first powered, controlled flight on the Red Planet.\r\nWhen NASA’s Perseverance rover lands on Mars on Feb. 18, 2021, it will be carrying… [+8200 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": null, "title": "CASIS Research Announcement in Technology Advancements to Leverage the ISS - Space Ref", "description": "CASIS Research Announcement in Technology Advancements to Leverage the ISS - SpaceRef", "url": "http://spaceref.com/news/viewsr.html?pid=54463", "urlToImage": null, "publishedAt": "2021-01-22T00:40:44Z", "content": "CASIS Research Announcement in Technology Advancements to Leverage the ISS\r\nStatus Report\r\n From: NASA HQPosted: Thursday, January 21, 2021 \r\nThe Center for the Advancement of Science in Space (CASIS… [+999 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "Thanks to a new fossil discovery, we suddenly know a lot more about dinosaur sex - Salon", "description": "The dinosaur \"butt\" discovery is actually a cloaca, a cavity used for reproduction and waste disposal common among many vertebrates", "url": "https://www.salon.com/2021/01/21/thanks-to-a-new-fossil-discovery-we-suddenly-know-a-lot-more-about-dinosaur-sex/", "urlToImage": "https://media.salon.com/2021/01/dinosaur-rear-0121211.jpg", "publishedAt": "2021-01-21T23:59:00Z", "content": "No one predicted that January 2021 would be a banner month for dinosaur news. Last week an article in the scholarly journal Cretaceous Research revealed that dinosaur bones in Argentina may have belo… [+5035 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "Scientists Think These Ridiculous Bones May Belong to New Largest-Ever Dinosaur - ScienceAlert", "description": "Scientists have unearthed massive, 98-million-year-old fossils in southwest Argentina they say may have belonged to the largest dinosaur ever discovered.", "url": "https://www.sciencealert.com/scientists-claim-they-may-have-found-the-largest-dinosaur-ever-known", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/largest_dinosaur_new_paper_afp_cover_1024.jpg", "publishedAt": "2021-01-21T23:41:33Z", "content": "Scientists have unearthed massive, 98-million-year-old fossils in southwest Argentina they say may have belonged to the largest dinosaur ever discovered.\r\nHuman-sized pieces of fossilized bone belong… [+2079 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "U.S. is promptly welcomed back into the world's Paris climate treaty - Mashable", "description": "Back in the Paris Agreement.", "url": "https://mashable.com/article/paris-agreement-us-rejoin/", "urlToImage": "https://mondrian.mashable.com/2021%252F01%252F21%252F58%252F006a340145f24fdfa6d681f53b650d5e.83fc5.png%252F1200x630.png?signature=rdJF9wboMzjn8rr2XUqquL7TEvY=", "publishedAt": "2021-01-21T22:12:00Z", "content": "The U.S. is no longer acting like an insolent child peeing in a swimming pool. \r\nOn Nov. 4, 2020, the Trump administration quit the Paris Agreement, becoming the only nation to leave the world's most… [+3367 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "A Horrible Condition Turning Starfish Into Goo Has Finally Been Identified - ScienceAlert", "description": "In 2013, the lives of millions of sea stars were mysteriously extinguished. Limbs that were once strong, probing arms searching for sustenance, shrivelled and tore themselves away from the rest of their bodies and melted into a sickly goo.", "url": "https://www.sciencealert.com/the-horrible-condition-turning-starfish-into-goo-has-finally-been-identified", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/sea_star_granulated_getty_cover_1024.jpg", "publishedAt": "2021-01-21T22:11:59Z", "content": "In 2013, the lives of millions of sea stars were mysteriously extinguished. Limbs that were once strong, probing arms searching for sustenance, shrivelled and tore themselves away from the rest of th… [+4520 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Bringing atoms to a standstill: Researchers miniaturize laser cooling - Phys.org", "description": "It's cool to be small. Scientists at the National Institute of Standards and Technology (NIST) have miniaturized the optical components required to cool atoms down to a few thousandths of a degree above absolute zero, the first step in employing them on micro…", "url": "https://phys.org/news/2021-01-atoms-standstill-miniaturize-laser-cooling.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/bringingatom.jpg", "publishedAt": "2021-01-21T21:35:44Z", "content": "It's cool to be small. Scientists at the National Institute of Standards and Technology (NIST) have miniaturized the optical components required to cool atoms down to a few thousandths of a degree ab… [+5897 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Astronomers discover first cloudless, Jupiter-like planet - EurekAlert", "description": "Astronomers at the Center for Astrophysics | Harvard & Smithsonian have detected the first Jupiter-like planet without clouds or haze in its observable atmosphere. The findings were published this month in the Astrophysical Journal Letters.", "url": "https://www.eurekalert.org/pub_releases/2021-01/hcfa-adf012121.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/254231_web.jpg", "publishedAt": "2021-01-21T21:35:04Z", "content": "IMAGE: Artist illustration of WASP-62b, the first Jupiter-like planet detected without clouds or haze in its observable atmosphere. The illustration is drawn from the perspective of an observer nearb… [+3737 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Andrew Freedman", "title": "Southern Ocean waters are warming faster than thought, threatening Antarctic ice - Washington Post", "description": "Deep waters in the Southern Ocean are warming faster than previously known, which may speed the melting of parts of the Antarctica.", "url": "https://www.washingtonpost.com/weather/2021/01/21/southern-ocean-warming-antarctica/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MSWCUYCTHYI6VAGOG6UNIJTMBE.jpg&w=1440", "publishedAt": "2021-01-21T21:32:00Z", "content": "In addition, this vast ocean, part of which separates Australia and Antarctica and also circles the frozen continent, is where global ocean currents get started, as heat is exchanged between the ocea… [+5010 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Glennda Chui", "title": "Squeezing a rock-star material could make it stable enough for solar cells - Phys.org", "description": "Among the materials known as perovskites, one of the most exciting is a material that can convert sunlight to electricity as efficiently as today's commercial silicon solar cells and has the potential for being much cheaper and easier to manufacture.", "url": "https://phys.org/news/2021-01-rock-star-material-stable-solar-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/squeezingaro.jpg", "publishedAt": "2021-01-21T21:20:10Z", "content": "Among the materials known as perovskites, one of the most exciting is a material that can convert sunlight to electricity as efficiently as today's commercial silicon solar cells and has the potentia… [+4584 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "New Paper Says Black Holes Could Be as Large as an Entire Galaxy - Futurism", "description": "\"Dynamical arguments suggest that the maximum mass for a SLAB in our Universe is 100 billion billion solar masses, with a size comparable to that of the galaxy.\"", "url": "https://futurism.com/the-byte/black-holes-size-entire-galaxy", "urlToImage": "https://wp-assets.futurism.com/2021/01/black-holes-bigger-solar-system-could-hiding-throughout-universe-768x403.jpg", "publishedAt": "2021-01-21T21:14:37Z", "content": "Galaxy Size\r\nStep aside, supermassive black holes scientists say that there could be black holes the size of an entire galaxy.\r\nThe supermassive black holes go up to nearly 100 billion solar masses, … [+1881 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "You can see Uranus, Mars and the moon get close in a rare night sky sight tonight - Yahoo Eurosport UK", "description": null, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9d313997-f1a8-4387-ad18-e746a66b47e7", "urlToImage": null, "publishedAt": "2021-01-21T20:31:00Z", "content": "Yahoo is part of Verizon Media. We and our partners will store and/or access information on your device through the use of cookies and similar technologies, to display personalised ads and content, f… [+646 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Rocks show Mars once felt like Iceland: Crater study offers window on temperatures 3.5 billion years ago - Science Daily", "description": "A comparison of chemical and climate weathering of sedimentary rock in Mars' Gale Crater indicate the region's mean temperature billions of years ago was akin to current conditions on Iceland.", "url": "https://www.sciencedaily.com/releases/2021/01/210121131947.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-21T19:52:38Z", "content": "Once upon a time, seasons in Gale Crater probably felt something like those in Iceland. But nobody was there to bundle up more than 3 billion years ago.The ancient Martian crater is the focus of a st… [+5083 chars]"}, {"source": {"id": null, "name": "News-Daily.com"}, "author": "Ashley Strickland, CNN", "title": "Newly discovered giant galaxies dwarf the Milky Way - News-Daily.com", "description": "Our universe may be filled with unseen giants. Astronomers have discovered two giant radio galaxies, which are some of the largest-known objects in the universe. This revelation suggests that the", "url": "https://www.news-daily.com/news/world_nation/newly-discovered-giant-galaxies-dwarf-the-milky-way/article_9406864d-89dd-57a3-ae95-1534574a3c59.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/custom/image/c66199c4-9f43-11e5-bb6f-171943133c1c.jpg", "publishedAt": "2021-01-21T19:52:33Z", "content": "Our universe may be filled with unseen giants. Astronomers have discovered two giant radio galaxies, which are some of the largest-known objects in the universe. This revelation suggests that the eno… [+4323 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "World's largest lakes reveal climate change trends - Science Daily", "description": "Sixteen years of remote sensing data reveals that in Earth's largest freshwater lakes, climate change influences carbon fixation trends.", "url": "https://www.sciencedaily.com/releases/2021/01/210121131918.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-01-21T19:46:31Z", "content": "NASA-funded research on the 11 largest freshwater lakes in the world coupled field and satellite observations to provide a new understanding of how large bodies of water fix carbon, as well as how a … [+4892 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Catching cancer in the act - EurekAlert", "description": "Researchers have turned a CRISPR tool into a way to track the lineage of cancer cells in real time. Using this method, the researchers were able to identify the individual cells involved in metastasis and their offspring as they colonized distant tissues.", "url": "https://www.eurekalert.org/pub_releases/2021-01/wifb-cci011521.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/253927_web.jpg", "publishedAt": "2021-01-21T19:02:32Z", "content": "IMAGE: Each color represents a different location in the body. A very colorful tree shows a highly metastatic phenotype, where a cell's descendents jumped many times between different tissues. A tree… [+8857 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Harry Greene, Nicholas Casewell, Taline Kazandjian, Wolfgang Wüster", "title": "Spitting cobras may have evolved unique venom to defend from ancient humans - The Conversation UK", "description": "A toxin unique to spitting cobras means their venom causes more pain than other snakes.", "url": "https://theconversation.com/spitting-cobras-may-have-evolved-unique-venom-to-defend-from-ancient-humans-153570", "urlToImage": "https://images.theconversation.com/files/379529/original/file-20210119-23-13mrf32.jpg?ixlib=rb-1.1.0&rect=291%2C511%2C2899%2C1449&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-01-21T19:00:00Z", "content": "Cobras are fascinating and frightening creatures. These snakes are most well known for their characteristic defence mechanism called hooding, when the sides of their neck flare out in a dramatic disp… [+5451 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Bifurcation of planetary building blocks during Solar System formation - Science Magazine", "description": "Measurements of meteorites have shown that the inner and outer Solar System formed from two distinct reservoirs of material. Existing models have proposed that these were split by Jupiter forming first, which would open a gap in the protoplanetary disc. Licht…", "url": "https://science.sciencemag.org/content/371/6527/365.full", "urlToImage": "https://science.sciencemag.org/content/371/6527/365/F1.large.jpg", "publishedAt": "2021-01-21T18:47:21Z", "content": "Thank you for your interest in spreading the word about Science.\r\nNOTE: We only request your email address so that the person you are recommending the page to knows that you wanted them to see it, an… [+63 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "Mars has Been Through Many Ice Ages in the Last Billion Years - Universe Today", "description": "Did Mars undergo one long ice age in the last billion years? Or many ice ages? The planet's glaciers and rock deposits hold the answer.", "url": "https://www.universetoday.com/149712/mars-has-been-through-many-ice-ages-in-the-last-billion-years/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2017/03/ESP_025174_2245.jpg", "publishedAt": "2021-01-21T18:44:24Z", "content": "Like Earth, Mars has experienced periods of extreme glaciation or ice sheet coverage, which are known as ice ages. As these ice ages come and go, glaciers expand and contract along the planet’s surfa… [+8874 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A new nanomaterial for the war against counterfeits - Phys.org", "description": "Despite the anticounterfeiting devices attached to luxury handbags, marketable securities, and identification cards, counterfeit goods are on the rise. There is a demand for the next-generation anticounterfeiting technologies—that surpass the traditional ones…", "url": "https://phys.org/news/2021-01-nanomaterial-war-counterfeits.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/adisplaythat.jpg", "publishedAt": "2021-01-21T17:42:55Z", "content": "Despite the anticounterfeiting devices attached to luxury handbags, marketable securities, and identification cards, counterfeit goods are on the rise. There is a demand for the next-generation antic… [+3598 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Burial practices point to an interconnected early Medieval Europe - Phys.org", "description": "Early Medieval Europe is frequently viewed as a time of cultural stagnation, often given the misnomer of the 'Dark Ages'. However, analysis has revealed new ideas could spread rapidly as communities were interconnected, creating a surprisingly unified culture…", "url": "https://phys.org/news/2021-01-burial-interconnected-early-medieval-europe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/medieval.jpg", "publishedAt": "2021-01-21T17:41:02Z", "content": "Early Medieval Europe is frequently viewed as a time of cultural stagnation, often given the misnomer of the 'Dark Ages'. However, analysis has revealed new ideas could spread rapidly as communities … [+3147 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "What is V-R3x? | NASA - NASA", "description": "Swarming small satellites develop the next generation of communication and navigation tech.", "url": "https://www.nasa.gov/ames/v-r3x/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/v-r3x_evergreen1.jpg", "publishedAt": "2021-01-21T17:11:37Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Hundreds of never-before-seen life-forms live in this 6,000-foot-deep volcano's acid jets - Livescience.com", "description": "These extreme microbes like it hot… really hot.", "url": "https://www.livescience.com/extreme-microbes-underwater-volcano.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xYTHXKsueZgEGBULNebeMD-1200-80.jpg", "publishedAt": "2021-01-21T16:30:00Z", "content": "On Earth\r\n, some organisms like it hot, some like it cold, and others feel at home only among the scalding acid jets of an undersea volcano.\r\nThat latter group an ancient and eclectic bunch known as … [+2692 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New sensory neuron model enables easy generation of cells to fast-track pain research - News-Medical.net", "description": "Scientists have for the first time established a sensory neuron model able to mass-reproduce two key sensory neuron types involved in pain sensation, enabling the easy generation of large numbers of the cells to fast-track chronic pain research.", "url": "https://www.news-medical.net/news/20210121/New-sensory-neuron-model-enables-easy-generation-of-cells-to-fast-track-pain-research.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/synapse-620x480.jpg", "publishedAt": "2021-01-21T16:09:00Z", "content": "Scientists have for the first time established a sensory neuron model able to mass-reproduce two key sensory neuron types involved in pain sensation, enabling the easy generation of large numbers of … [+2234 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Giant worm's undersea lair discovered by fossil hunters in Taiwan - The Guardian", "description": "Scientists believe 2-metre-long burrow once housed predator that ambushed passing sea creatures", "url": "https://amp.theguardian.com/science/2021/jan/21/giant-worm-undersea-lair-discovered-fossil-hunters-taiwan", "urlToImage": null, "publishedAt": "2021-01-21T16:00:00Z", "content": "ScienceScientists believe 2-metre-long burrow once housed predator that ambushed passing sea creatures\r\nThe undersea lair of a giant worm that ambushed passing marine creatures 20m years ago has been… [+3706 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Fossil Dating Back to 480 Million Years Ago Found in Morocco Hints at World's Oldest-known Starfish - News18", "description": "Exploring the evolution of life on this planet isn’t the easiest job.", "url": "https://www.news18.com/news/buzz/fossil-dating-back-to-480-million-years-ago-found-in-morocco-hints-at-worlds-oldest-known-starfish-3321743.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611244222_untitled-design-8.jpg", "publishedAt": "2021-01-21T15:50:54Z", "content": "Exploring the evolution of life on this planet isnt the easiest job. Theres a lot about it that scientists still dont know as many life forms have gone extinct, taking away with them secrets about th… [+2560 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Robot 'jellyfish' to protect endangered coral reefs - Phys.org", "description": "A robot inspired by the shape and delicate underwater movements of a jellyfish, allowing it to safely explore endangered coral reefs, was unveiled by British scientists on Wednesday.", "url": "https://phys.org/news/2021-01-robot-jellyfish-endangered-coral-reefs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/600821862ddba.jpg", "publishedAt": "2021-01-21T15:42:05Z", "content": "A robot inspired by the shape and delicate underwater movements of a jellyfish, allowing it to safely explore endangered coral reefs, was unveiled by British scientists on Wednesday.\r\nAccording to re… [+3126 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Teamwork in a molecule - EurekAlert", "description": "Chemists at the Friedrich Schiller University Jena have demonstrated the value of 'teamwork' by successfully harnessing the interaction between two gallium atoms in a novel compound to split the particularly strong bond between fluorine and carbon. The galliu…", "url": "https://www.eurekalert.org/pub_releases/2021-01/fj-tia012021.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/254023_web.jpg", "publishedAt": "2021-01-21T15:11:31Z", "content": "IMAGE: Dr. Helmar Görls studies single crystals of novel compounds using a X-ray diffractometer at the Institute of Inorganic and Analytical Chemistry at Friedrich Schiller University in Jena, German… [+2359 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Intl collaboration with Chinese space agencies beneficial for all - CGTN", "description": "Space research is capable of sustaining growth for all nations and it is also a promising field for the prediction of natural disasters.", "url": "https://news.cgtn.com/news/2021-01-21/Intl-collaboration-with-Chinese-space-agencies-beneficial-for-all-XeNcvUNJRu/index.html", "urlToImage": "https://news.cgtn.com/news/2021-01-21/Intl-collaboration-with-Chinese-space-agencies-beneficial-for-all-XeNcvUNJRu/img/97ebdebe22ca4537b099d6a6f91682e0/97ebdebe22ca4537b099d6a6f91682e0-250.png", "publishedAt": "2021-01-21T15:05:12Z", "content": "Editor's note: Barry He is a London-based freelance columnist. The article reflects the author's opinions, and not necessarily the views of CGTN.\r\nNext month is an exciting month for international sp… [+4629 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Kiah Tasman", "title": "Pollinators: neonicotinoid pesticides stop bees and flies from getting a good night's sleep - The Conversation UK", "description": "Chemicals banned in the EU were recently granted an exemption for limited use in the UK.", "url": "https://theconversation.com/pollinators-neonicotinoid-pesticides-stop-bees-and-flies-from-getting-a-good-nights-sleep-153673", "urlToImage": "https://images.theconversation.com/files/379975/original/file-20210121-17-1pzg39p.jpg?ixlib=rb-1.1.0&rect=0%2C434%2C3543%2C1771&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-01-21T14:32:00Z", "content": "Neonicotinoids, the most commonly used pesticides in the world, were banned in the EU in 2018. More than 99,000 people petitioned the UK government to support the ban amid a wealth of scientific evid… [+5188 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Auckland: Male praying mantis fights to avoid being eaten - India Education Diary", "description": "Sexual reproduction in the insect world is often a risky business and never more so than when the risk of being eaten is high.Female praying mantis credit: Nathan BurkeBut a new study on South Afri…", "url": "https://indiaeducationdiary.in/university-of-auckland-male-praying-mantis-fights-to-avoid-being-eaten/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/uoa-1.png?fit=1000%2C330&ssl=1", "publishedAt": "2021-01-21T13:51:00Z", "content": "Sexual reproduction in the insect world is often a risky business and never more so than when the risk of being eaten is high.\r\nFemale praying mantis credit: Nathan BurkeBut a new study on South Afri… [+2892 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Madeleine Finlay, Ian Sample", "title": "What (non-Covid) science is coming up in 2021? – podcast - The Guardian", "description": "Science Weekly takes a look at what’s coming up in 2021, from space missions to climate crisis talks", "url": "https://www.theguardian.com/science/audio/2021/jan/21/what-non-covid-science-is-coming-up-in-2021-podcast", "urlToImage": "https://i.guim.co.uk/img/media/f599b802c2060fc5f53eeaf959a385a1532eb4f0/0_88_5309_3188/master/5309.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=707fb8a0c17c777bb74e9bbb973e34c4", "publishedAt": "2021-01-21T13:37:00Z", "content": "Ian Sample and producer Madeleine discuss what science, outside of the pandemic, theyll be looking out for in 2021. Joined by Prof Gillian Wright and the Guardians global environment editor Jonathan … [+138 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Morgan Rehnberg", "title": "Juno maps water ice across northern Ganymede - Phys.org", "description": "Jupiter's moon Ganymede is the largest planetary satellite in the solar system. It's also one of the most intriguing: Ganymede is the only moon with its own magnetic field, it is the most differentiated of all moons, and it likely possesses a subsurface ocean…", "url": "https://phys.org/news/2021-01-juno-ice-northern-ganymede.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/junomapswate.jpg", "publishedAt": "2021-01-21T12:41:51Z", "content": "Jupiter's moon Ganymede is the largest planetary satellite in the solar system. It's also one of the most intriguing: Ganymede is the only moon with its own magnetic field, it is the most differentia… [+2581 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Jacinta Delhaize", "title": "How a Discovery of Two Radio Galaxies Offers Fresh Insights Into the Universe - The Wire Science", "description": "Two giant radio galaxies – those that release huge beams, or ‘jets’, of radio light – have been discovered with South Africa’s powerful MeerKAT telescope.", "url": "https://science.thewire.in/uncategorised/meerkat-telescope-radio-galaxies-insights-universe/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/01/21131639/file-20210118-17-1ljd4mt.jpg", "publishedAt": "2021-01-21T12:29:00Z", "content": "The two giant radio galaxies found with the MeerKAT telescope. In the background is the sky as seen in optical light. Overlaid in red is the radio light from the enormous radio galaxies. Photo: I. He… [+6287 chars]"}, {"source": {"id": null, "name": "Sundayvision.co.ug"}, "author": "Mia Thompson", "title": "Weather: The International Space Station detects blue \"jets\" of lightning rising from thunderstorms - Sunday Vision", "description": "The International Space Station detects lightning blue 'jets' from thunderclouds that could affect greenhouse gas concentrations in the Earth's", "url": "https://www.sundayvision.co.ug/weather-the-international-space-station-detects-blue-jets-of-lightning-rising-from-thunderstorms/", "urlToImage": "https://www.sundayvision.co.ug/wp-content/uploads/2021/01/Weather-The-International-Space-Station-detects-blue-jets-of-lightning.jpg", "publishedAt": "2021-01-21T12:21:00Z", "content": "A study reports that blue “ jets ” of lightning blasting upward from thunderclouds were detected by an instrument on the International Space Station.\r\nThis phenomenon was measured by the European Spa… [+4169 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Weather: ISS detects blue 'jets' of lightning shooting upwards from thunder clouds - Daily Mail", "description": "Measured by the European Space Agency's Atmosphere-Space Interactions Monitor (ASIM), the phenomenon originated in a cloud top over the Pacific island of Naru.", "url": "https://www.dailymail.co.uk/sciencetech/article-9171469/Weather-ISS-detects-blue-jets-lightning-shooting-upwards-thunder-clouds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/01/21/10/38300360-0-image-a-21_1611225312254.jpg", "publishedAt": "2021-01-21T12:21:00Z", "content": "Blue 'jets' of lightning shooting upwards from thunderclouds have been detected by an instrument on board the International Space Station, a study has reported.\r\nMeasured by the European Space Agency… [+4127 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kasandra Brabaw", "title": "This tiny comet photobombed the total solar eclipse of 2020 - Space.com", "description": "An amature astonomer found the Kruetz sungrazer comet a day before it disintegrated when passing too close to the Sun.", "url": "https://www.space.com/new-comet-seen-during-2020-solar-eclipse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tN6iwg6feq3iNz2R3Nrj8A-1200-80.jpg", "publishedAt": "2021-01-21T12:14:00Z", "content": "A comet first spotted just the day before made an appearance as Chile and Argentina watched the total solar eclipse\r\n on Dec. 14, 2020. \r\nJust a tiny speck in the sky, the comet\r\n, dubbed C/2020 X3 (… [+1852 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NASA to conduct first hot fire test on Aerojet Rocketdyne RS-25 engines - Metal Additive Manufacturing magazine", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHA6Ly93d3cubWV0YWwtYW0uY29tL25hc2EtdG8tY29uZHVjdC1maXJzdC1ob3QtZmlyZS10ZXN0LW9uLWFlcm9qZXQtcm9ja2V0ZHluZS1ycy0yNS1lbmdpbmVzL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2021-01-21T11:38:03Z", "content": null}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Satellite images to assist in elephant conservation efforts in Africa - Firstpost", "description": "The scientists first developed the techniques at South Africa's Addo Elephant National Park.", "url": "https://www.firstpost.com/tech/science/satellite-images-to-assist-in-elephant-conservation-efforts-in-africa-9225671.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/elcarito-dZH8twytU94-unsplash-1.jpg", "publishedAt": "2021-01-21T11:36:58Z", "content": "Agence France-PresseJan 21, 2021 17:06:58 IST\r\nConservationists have started using satellite imagery to count elephants from space, a technique that British experts hope will help protect threatened … [+1885 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Not just Earth, Dinosaur remains can be found on Moon and Mars | Details inside - IBTimes India", "description": "The writer claimed that the asteroid that killed dinosaurs punched a hole of outer space vacuum in the atmosphere", "url": "https://www.ibtimes.co.in/not-just-earth-dinosaur-remains-can-be-found-moon-mars-details-inside-832359", "urlToImage": "https://data1.ibtimes.co.in/en/full/755942/dinosaur.jpg", "publishedAt": "2021-01-21T11:29:44Z", "content": "It was around 66 million years ago back that a giant asteroid hit the earth, resulting in the extinction of dinosaurs.\r\nAfter several years, when humans started excavating the blue planet, they disco… [+1954 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "MIT physicists have searched for axions in Betelgeuse - Tech Explorist", "description": "MIT physicists have searched for axions in Betelgeuse, a nearby star that is expected to burn out as a supernova soon, at least on astrophysical timescales.", "url": "https://www.techexplorist.com/mit-physicists-searched-axions-betelgeuse/37425/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/search-for-axions.jpg", "publishedAt": "2021-01-21T10:59:00Z", "content": "If axions exist, they must be produced within extreme environments, such as the cores of stars at a supernova’s precipice. When these stars heave axions out into the universe, the particles, experien… [+3553 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "China: First solar probe to be launched - MENAFN.COM", "description": "China's first solar probe, Advanced Space-based Solar Observatory (ASO-S), is planned to be initialed into space in the first six months of 2022, marking the country's first-ever mission to touch the sun.<br />\n<br />\nThe satellite will function in a sun-sync…", "url": "https://menafn.com/1101467686/China-First-solar-probe-to-be-launched&source=28", "urlToImage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_OilEnergy_7.jpg", "publishedAt": "2021-01-21T09:07:28Z", "content": "(MENAFN)China's first solar probe, Advanced Space-based Solar Observatory (ASO-S), is planned to be initialed into space in the first six months of 2022, marking the country's first-ever mission to \"… [+1103 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Tiziana Celine", "title": "Lab-Grown Plants: MIT Makes Better Alternatives to Forestry and Farming - Science Times", "description": "Scientists from the Massachusetts Institute of Technology are now working on lab-grown plants to ease the environmental toll of logging and agriculture.", "url": "https://www.sciencetimes.com/articles/29233/20210121/lab-grown-plants-mit-makes-better-alternatives-to-forestry-and-farming.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/23952/agriculture.jpg", "publishedAt": "2021-01-21T08:00:08Z", "content": "MIT researchers also created a modern system for developing plant tissues in a laboratory, such as how businesses and researchers approach laboratory-grown meat.\r\nIn a lab setting, the method will ge… [+3184 chars]"}, {"source": {"id": null, "name": "Telecompaper"}, "author": null, "title": "SpaceX launches 60 new Starlink satellites to orbit - Telecompaper", "description": "", "url": "https://www.telecompaper.com/news/spacex-launches-60-new-starlink-satellites-to-orbit--1369411", "urlToImage": "https://www.telecompaper.com/images/telecompaper_facebook.png", "publishedAt": "2021-01-21T07:53:00Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Titan’s largest sea is 1,000 feet deep near its center - Tech Explorist", "description": "Titan’s largest sea is at least 1,000 feet deep near its center – enough room for a potential robotic submarine to explore.", "url": "https://www.techexplorist.com/titan-largest-sea-1000-feet-deep-near-center/37419/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/Kraken-Mare.jpg", "publishedAt": "2021-01-21T06:52:00Z", "content": "Kraken Mare is the largest sea on the surface of Saturn’s moon Titan. It is a huge body of liquid ethane and methane near Titan’s north pole. The sea covers 154,000 square miles.\r\nCornell astronomers… [+2323 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "NASA chief steps down after Joe Biden assumes office - DNA India", "description": "Biden is expected to pick a woman the fill the role, which has been occupied by men since the agency's founding in 1958.", "url": "https://www.dnaindia.com/world/report-nasa-chief-steps-down-after-us-president-joe-biden-assumes-office-2869526", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/01/21/951428-nasa-chief.jpg", "publishedAt": "2021-01-21T05:37:00Z", "content": null}, {"source": {"id": null, "name": "Sundayvision.co.ug"}, "author": "Mia Thompson", "title": "The habitability of the Earth today appears mainly due to luck, as do millions of simulations - Sunday Vision", "description": "It took evolution 3 or 4 billion years ago To produce Homo sapiens. If the climate had completely failed only once in that time, evolution would have", "url": "https://www.sundayvision.co.ug/the-habitability-of-the-earth-today-appears-mainly-due-to-luck-as-do-millions-of-simulations/", "urlToImage": "https://news.google.com/images/2021-01/file-20210119-26-1cdmrfb.jpg", "publishedAt": "2021-01-21T04:29:34Z", "content": "It took evolution 3 or 4 billion years ago To produce Homo sapiens. If the climate had completely failed only once in that time, evolution would have completely stalled and we wouldn’t be here now. I… [+4956 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Pre-historic Europeans used bronze objects as currency: Study - The Straits Times", "description": "Bronze rings, ribs and axe blades were roughly standardised in shape and weight as an early form of \"euros\".. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/united-states/pre-historic-europeans-used-bronze-objects-as-currency-study", "urlToImage": "https://www.straitstimes.com/sites/default/files/styles/x_large/public/articles/2021/01/21/nz_bronzeage_210175.jpg?itok=IMtDTz17", "publishedAt": "2021-01-21T03:57:45Z", "content": "WASHINGTON (AFP) - Central Europeans of the Bronze Age used bronze rings, ribs and axe blades that were roughly standardised in their shape and weight as an early form of \"euros,\" according to a new … [+1993 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New starfish-like fossil reveals evolution in action - EurekAlert", "description": "Researchers from the University of Cambridge have discovered a fossil of the earliest starfish-like animal, which helps us understand the origins of the nimble-armed creature.", "url": "https://www.eurekalert.org/pub_releases/2021-01/uoc-nsf011921.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/253926_web.jpg", "publishedAt": "2021-01-21T00:04:22Z", "content": "IMAGE: Cantabrigiaster fezouataensis from the Lower Ordovician (Tremadocian) Fezouata Shale, Zagora Morocco\r\n view more \r\nCredit: Collections of the Claude Bernard University Lyon 1\r\nResearchers from… [+4806 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Anushka Pathania", "title": "Heavy Asteroid traffic to pass by Earth on Inauguration Day in USA, is it special? - Republic World", "description": "Heavy Asteroid traffic will pass by Earth on Inauguration Day in USA, is it special cosmic sign or is it normal? Here is more information about it.", "url": "https://www.republicworld.com/technology-news/science/heavy-asteroid-traffic-to-pass-by-earth-on-inauguration-day-in-usa-is-it-special.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/wzqywvec5sli2fw9_1611142166.jpeg?tr=f-jpeg", "publishedAt": "2021-01-20T15:13:00Z", "content": "NASA reveals that several asteroids will soon shoot past Earth. This cosmic fact has left numerous people fascinated as the asteroids near our planet would coincide with a historic transfer of power … [+2328 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Riya Baibhawi", "title": "NASA investigates into a galaxy that erupts every 114 days - Republic World", "description": "While the outer space is full of enigmatic phenomenon, one particular galaxy has left experts at National Aeronautics and Space Administration (NASA) puzzled.", "url": "https://www.republicworld.com/technology-news/science/nasa-investigates-into-a-galaxy-that-erupts-every-114-days.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/lfgkljjxma5b4cjc_1611153756.jpeg?tr=f-jpeg", "publishedAt": "2021-01-20T14:56:00Z", "content": "While the outer space is full of enigmatic phenomenon, one particular galaxy has left experts at National Aeronautics and Space Administration (NASA) puzzled. The space agency is now investigating in… [+2314 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "“Case of the Missing Neutron Star” –Anatomy of a Cosmic Explosion 1,700 Years Ago During Decline of Rome - The Daily Galaxy --Great Discoveries Channel", "description": "Cosmic sleuths are attempting to locate one of the estimated one billion neutron stars in the Milky Way–the collapsed core of a doomed supergiant star with the density of atomic nuclei–that was ejected from the blast of a supernova in the Small Magellanic Clo…", "url": "https://dailygalaxy.com/2021/01/case-of-the-missing-neutron-star-anatomy-of-a-cosmic-explosion-1700-years-ago-during-decline-of-rome/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2021/01/shutterstock_1009002379-scaled-e1611151534181.jpg", "publishedAt": "2021-01-20T14:33:38Z", "content": "Cosmic sleuths are attempting to locate one of the estimated one billion neutron stars in the Milky Way–the collapsed core of a doomed supergiant star with the density of atomic nuclei–that was eject… [+4029 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Fornax A galaxy investigated with AstroSat - Phys.org", "description": "Using the AstroSat spacecraft, Indian astronomers have performed an imaging and spectroscopic study of the Fornax A galaxy. Results of the study, published January 13 on the arXiv preprint server, provide more clues on the properties of the galaxy and ultravi…", "url": "https://phys.org/news/2021-01-fornax-galaxy-astrosat.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/galaxy.jpg", "publishedAt": "2021-01-20T14:00:02Z", "content": "Using the AstroSat spacecraft, Indian astronomers have performed an imaging and spectroscopic study of the Fornax A galaxy. Results of the study, published January 13 on the arXiv preprint server, pr… [+3474 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Transgenic zebrafish could pave way for alternative anti-cancer therapy - BSI bureau", "description": "Using the INSPIRE Faculty programme Dr Vimalraj and his research team is further working to develop transgenic zebrafish (which have exogenous genes added to their genome) model by use of the CRISPR/Cas9 gene-editing tool to further study the compensatory ang…", "url": "https://www.biospectrumindia.com/news/58/17965/transgenic-zebrafish-could-pave-way-for-alternative-anti-cancer-therapy.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_104108189-17965.jpg", "publishedAt": "2021-01-20T13:26:55Z", "content": "Using the INSPIRE Faculty programme Dr Vimalraj and his research team is further working to develop transgenic zebrafish model by use of the CRISPR/Cas9 gene-editing tool \r\nScientists are exploring a… [+1665 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SLS: NASA'S POWERFUL NEW MOON ROCKET | AFP Animé - AFP News Agency", "description": "NASA conducted a test firing of the engines for its giant Space Launch System (SLS) lunar rocket on Saturday but they shut down earlier than planned, the spa...", "url": "https://www.youtube.com/watch?v=htIs2FVrxCU", "urlToImage": "https://i.ytimg.com/vi/htIs2FVrxCU/hqdefault.jpg", "publishedAt": "2021-01-20T12:23:21Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Appearance, social norms keep students off Zoom cameras - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=793178", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-01-20T12:08:43Z", "content": "New York, Jan 20 (IANS): Ever thought why some students do not turn on their video cameras during online classes on Zoom? Because they may be more concerned about their privacy or how they look, rese… [+1932 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "The University of Auckland: Sexual reproduction in the insect world is often a risky business and never more so than when the risk of being eaten is high - India Education Diary", "description": "But a new study on South African – or Springbok – praying mantids, commonly found in New Zealand after first being identified here in the 1970s, shows the male of the species has develo…", "url": "https://indiaeducationdiary.in/the-university-of-auckland-sexual-reproduction-in-the-insect-world-is-often-a-risky-business-and-never-more-so-than-when-the-risk-of-being-eaten-is-high/", "urlToImage": "https://i2.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/uoa.png?fit=1000%2C330&ssl=1", "publishedAt": "2021-01-20T11:42:00Z", "content": "But a new study on South African – or Springbok – praying mantids, commonly found in New Zealand after first being identified here in the 1970s, shows the male of the species has developed a highly u… [+2722 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Scientists investigate planetary nebulae using Hubble Space Telescope - Open Access Government", "description": "Images from the Hubble Space Telescope are giving astronomers the chance to further investigate planetary nebulae - like the Jewel Bug Nebula (NGC 7027)", "url": "https://www.openaccessgovernment.org/investigate-planetary-nebulae/101876/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/01/dreamstime_xxl_44364214.jpg", "publishedAt": "2021-01-20T11:25:00Z", "content": "Recently, astronomers collectively agreed that the universe is around 14 billion years old. As telescope data and theoretical models are further studied, more revelations keep coming from the space f… [+3566 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "University of Cape Town: Gigantic galaxies discovered with the MeerKAT telescope - India Education Diary", "description": "Two giant radio galaxies – among the largest single objects in the universe, which were thought to be quite rare – have been discovered with South Africa’s powerful MeerKAT telescope. The discovery…", "url": "https://indiaeducationdiary.in/university-of-cape-town-gigantic-galaxies-discovered-with-the-meerkat-telescope/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-01-20T07:26:00Z", "content": "Two giant radio galaxies among the largest single objects in the universe, which were thought to be quite rare have been discovered with South Africas powerful MeerKAT telescope. The discovery has be… [+4882 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "MIT scientists proposed a way to grow certain plant tissues in lab - Tech Explorist", "description": "MIT researchers grow structures made of wood-like plant cells in a lab, hinting at the possibility of more efficient biomaterials production.", "url": "https://www.techexplorist.com/way-grow-certain-plant-tissues-lab/37397/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/01/grow-plant-based-materials.jpg", "publishedAt": "2021-01-20T06:12:00Z", "content": "MIT scientists’ new work offers a possible starting point for novel approaches to biomaterials production that ease the environmental burden of forestry and agriculture. They have developed a new way… [+3426 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarthak Dogra", "title": "Scientific Study Explains Why Some People Can Hear Spirits Of The Dead - India Times", "description": "In a recent study, researchers might have gained new insights into the reason why some people believe that they can ‘hear the dead’. The research is based on the largest-of-its-kind survey of the general population and such specialist mediums.                …", "url": "https://www.indiatimes.com/technology/science-and-future/scientific-study-people-hearing-spirit-of-dead-clairaudient-532350.html", "urlToImage": "https://im.indiatimes.in/content/2021/Jan/Facebook-Thumbnail_6007c03d609bf.jpg", "publishedAt": "2021-01-20T05:35:36Z", "content": "In a recent study, researchers might have gained new insights into the reason why some people believe that they can hear the dead. The research is based on the largest-of-its-kind survey of the gener… [+2051 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Anthony Iemole", "title": "SpaceX launches first Starlink mission of 2021 - NASASpaceflight.com", "description": "As the second SpaceX launch of the year, and the first of many Starlink missions…", "url": "https://www.nasaspaceflight.com/2021/01/spacex-launch-first-starlink-mission-2021/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/01/NSF-2021-01-20-13-58-42-582.jpg", "publishedAt": "2021-01-20T05:34:00Z", "content": "As the second SpaceX launch of the year, and the first of many Starlink missions scheduled to launch in 2021, the company launched the Starlink v1.0 L16 mission the 16th launch of operational satelli… [+7811 chars]"}, {"source": {"id": null, "name": "Sundayvision.co.ug"}, "author": "Mia Thompson", "title": "An exoplanet \"Super puff\" is as large as Jupiter but 10 times lighter, which confuses astronomers - Sunday Vision", "description": "About 212 light-years from Earth, a gas giant planet light enough to be called \"Super Puff\" or \"Spinning Girl\" is orbiting very close to its host star.", "url": "https://www.sundayvision.co.ug/an-exoplanet-super-puff-is-as-large-as-jupiter-but-10-times-lighter-which-confuses-astronomers/", "urlToImage": null, "publishedAt": "2021-01-20T03:04:31Z", "content": "About 212 light-years from Earth, a gas giant planet light enough to be called “Super Puff” or “Spinning Girl” is orbiting very close to its host star. The Exoplanet It’s so light that it left astron… [+3657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Missing: One black hole with 10 billion solar masses - The Indian Express", "description": "In the past few decades, it has become part of astronomical lore that at the center of every galaxy lurks a giant black hole into which the equivalent of millions or even billions of suns have disappeared. The bigger the galaxy, the more massive the black hol…", "url": "https://indianexpress.com/article/technology/science/black-hole-galaxy-astronomy-7153203/", "urlToImage": "https://images.indianexpress.com/2021/01/NASA-Black-hole.jpg", "publishedAt": "2021-01-19T15:28:03Z", "content": "Written by Dennis Overbye\r\nAstronomers are searching the cosmic lost-and-found for one of the biggest, baddest black holes thought to exist. So far they havent found it.\r\nIn the past few decades, it … [+9648 chars]"}]}