{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Did you know Mars rover`s giant parachute carried secret message and space enthusiasts cracked it within a... - Zee News", "description": "The huge parachute used by NASA s Perseverance rover to land on Mars contained a secret message, thanks to a puzzle lover on the spacecraft team. Systems engineer Ian Clark used a binary code to spell out ‘Dare Mighty Things’ in the orange and white strips of…", "url": "https://zeenews.india.com/world/did-you-know-mars-rovers-giant-parachute-carried-secret-message-and-space-enthusiasts-cracked-it-within-a-few-hours-2343965.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/02/24/919138-nasa-message.jpg", "publishedAt": "2021-02-24T01:37:53Z", "content": "Cape Canaveral: The huge parachute used by NASA's Perseverance rover to land on Mars contained a secret message, thanks to a puzzle lover on the spacecraft team.\r\nSystems engineer Ian Clark used a bi… [+2011 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Researchers reveal 'good bacteria' in breast milk changes over time - DTNext", "description": "The cocktail of beneficial bacteria passed from mother to infant through breast milk changes significantly over time and could act as a daily booster shot for infant immunity and metabolism, according to the findings of new research.", "url": "http://www.dtnext.in/Lifestyle/Wellbeing/2021/02/23233729/1277189/Researchers-reveal-good-bacteria-in-breast-milk-changes-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Feb/202102232337287975_Researchers-reveal-good-bacteria-in-breast-milk-changes_SECVPF.gif", "publishedAt": "2021-02-23T18:23:59Z", "content": "The cocktail of beneficial bacteria passed from mother to infant through breast milk changes significantly over time and could act as a daily booster shot for infant immunity and metabolism, accordin… [+2460 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://jpl.nasa.gov/", "title": "Reclusive Neutron Star May Have Been Found in Famous Supernova - Jet Propulsion Laboratory", "description": "NASA's Jet Propulsion Laboratory, the leading center for robotic exploration of the solar system.", "url": "https://www.jpl.nasa.gov/news/reclusive-neutron-star-may-have-been-found-in-famous-supernova", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/Nustar_chandra_supernova_main_art_LARGE.jpg", "publishedAt": "2021-02-23T17:25:03Z", "content": "When a star explodes, it collapses onto itself before the outer layers are blasted into space. The compression of the core turns it into an extraordinarily dense object, with the mass of the Sun sque… [+5411 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Hayley Arceneaux, a Cancer Survivor, Selected as Crew Member of First All-Civilian Space Mission | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "\"It's an incredible honour to join the Inspiration4 crew. This seat represents the hope that St. Jude gave me and continues to give families from around the world, who, like me, find hope when they walk through the doors of St. Jude,\" said Arceneaux. - Articl…", "url": "https://weather.com/en-IN/india/space/news/2021-02-23-hayley-arceneaux-selected-for-first-all-civilian-space-mission", "urlToImage": "https://s.w-x.co/in-hayley.jpg", "publishedAt": "2021-02-23T12:56:19Z", "content": "Hayley Arceneaux, a 29-year-old physician assistant, has been selected as the second crew member of Inspiration4the world's first all-civilian mission to space. She works at the St. Jude Children's R… [+2717 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bar­bara Von­ar­burg", "title": "Martian moons have a common ancestor - Phys.org", "description": "Mars's two moons, Phobos and Deimos, have puzzled researchers since their discovery in 1877. They are very small: Phobos's diameter of 22 kilometers is 160 times smaller than that of our moon, and Deimos is even smaller, with a diameter of only 12 kilometers.…", "url": "https://phys.org/news/2021-02-martian-moons-common-ancestor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/martianmoons.jpg", "publishedAt": "2021-02-23T12:40:03Z", "content": "Mars's two moons, Phobos and Deimos, have puzzled researchers since their discovery in 1877. They are very small: Phobos's diameter of 22 kilometers is 160 times smaller than that of our moon, and De… [+4985 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists have uncovered a gigantic cosmic particle accelerator - Tech Explorist", "description": "Tracing back a ghostly particle to a shredded star, scientists have uncovered a gigantic cosmic particle accelerator i.e., neutrino from a Tidal Disruption Event (TDE).", "url": "https://www.techexplorist.com/scientists-have-uncovered-a-gigantic-cosmic-particle-accelerator/37936/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/Smoking-gun.jpg", "publishedAt": "2021-02-23T07:14:10Z", "content": "Neutrinos give an extraordinary view into the generally hidden mechanism of particle acceleration in astrophysical objects. The IceCube Collaboration recently revealed the possible relationship of on… [+5382 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Microbes from Earth could temporarily survive on Mars: study - The Hindu", "description": "While not all the microbes survived the trip, one previously detected on the International Space Station, the black mold Aspergillus niger, could be revived after it returned home.", "url": "https://www.thehindu.com/sci-tech/science/microbes-from-earth-could-temporarily-survive-on-mars-study/article33911152.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/s8ko09/article33911151.ece/ALTERNATES/LANDSCAPE_615/marsboxatopening", "publishedAt": "2021-02-23T07:08:24Z", "content": "Some microbes found on Earth may temporarily survive on the surface of Mars, according to a study that could be vital for the success of future missions to the Red Planet.\r\n The researchers from NASA… [+2702 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Morning Digest: NASA releases first audio from Mars, NRIs press for voting rights ahead of upcoming Assembly polls, and more - The Hindu", "description": "A select list of stories to read before you start your day.", "url": "https://www.thehindu.com/news/national/morning-digest-february-23-2021/article33907609.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/gh19k9/article33885979.ece/ALTERNATES/LANDSCAPE_615/1", "publishedAt": "2021-02-23T02:23:49Z", "content": "The U.S. space agency NASA on Monday released the first audio from Mars, a faint wind sound captured by the Perseverance rover. NASA also released the first video of the landing of the rover on the R… [+2620 chars]"}, {"source": {"id": null, "name": "Rocketstem.org"}, "author": "Facebook", "title": "What medicines should we take to Mars? - RocketSTEM", "description": "A human expedition to Mars may last a year or longer, so the astronauts will need to take medications with them to deal with most situations.", "url": "https://www.rocketstem.org/2021/02/22/what-medicines-should-we-take-to-mars/", "urlToImage": "https://rocketstem.b-cdn.net/wp-content/uploads/2021/02/image-20151001-5869-1jy7exy-1.jpg", "publishedAt": "2021-02-22T18:03:19Z", "content": "Humans didnt evolve to deal with the unique conditions of space travel. Credit: Bluedharma/Flickr, CC BY-ND\r\nMars has garnered a bunch of headlines recently with the arrival of the first probes from … [+7045 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Neuroscience: Artificial 'brain in a dish' is created that matures 'just like a human brain' - Daily Mail", "description": "Extensive genetic analyses of the so-called 'organoids' - which were allowed to grow in experimental dishes for up to 20 months - was conducted by US researchers.", "url": "https://www.dailymail.co.uk/sciencetech/article-9287071/Neuroscience-Artificial-brain-dish-created-matures-just-like-human-brain.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/22/18/39632798-0-image-a-12_1614019867211.jpg", "publishedAt": "2021-02-22T16:00:55Z", "content": "A 'brain in a dish' grown from stem cells in the lab can develop 'just like a human brain' and may help shed light on conditions like Alzheimer's and schizophrenia.\r\nResearchers from the US conducted… [+5378 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alasdair MacKenzie and Andreas Kolb", "title": "The human genome at 20: How biology's most-hyped breakthrough led to anticlimax and arrests - Phys.org", "description": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence  had been completed, he hailed the breakthrough as \"the most important, most wondrous map ever produced by humankind.\" The scientific achievement…", "url": "https://phys.org/news/2021-02-human-genome-biology-most-hyped-breakthrough.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/thehumangeno.jpg", "publishedAt": "2021-02-22T14:14:27Z", "content": "When President Bill Clinton took to a White House lectern 20 years ago to announce that the human genome sequence had been completed, he hailed the breakthrough as \"the most important, most wondrous … [+8115 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tim Childers", "title": "Astronomers find the fastest spinning black hole to date - Livescience.com", "description": "", "url": "https://www.livescience.com/first-black-hole-detected-fastest-spinning.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dXbNLrCdeGFheedYmy5vce-1200-80.jpg", "publishedAt": "2021-02-22T14:09:03Z", "content": "Six decades after its discovery, the first black hole ever detected is still causing astronomers to scratch their heads. It turns out that the cosmic behemoth at the heart of the Cygnus X-1 system is… [+3891 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "UK Teens Face Kidnapping Charges after Accidentally Stealing Car with Owner's Children Still Inside - News18", "description": "Getting your car stolen is scary enough, but if the car is stolen with your children inside? Simply horrific.", "url": "https://www.news18.com/news/buzz/uk-teens-face-kidnapping-charges-after-accidentally-stealing-car-with-owners-children-still-inside-3461954.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1613991696_car.jpeg", "publishedAt": "2021-02-22T11:02:38Z", "content": "Getting your car stolen is scary enough, but if the car is stolen with your children inside? Simply horrific. A family in Birmingham was caught in a moment of extreme distress when someone stole thei… [+1956 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "42,000 Year Old Tree Captured Evidence Of Earth’s Magnetic Field Flipping - India Times", "description": "A few years ago, workers digging to create a power plant in New Zealand discovered a 60-ton trunk from a kauri tree, and now according to researchers, it has captured the last collapse of Earth’s magnetic field.                         ScienceMagThe massive t…", "url": "https://www.indiatimes.com/technology/science-and-future/earth-magnetic-field-flip-42000-year-old-tree-534882.html", "urlToImage": "https://im.indiatimes.in/content/2021/Feb/Facebook-Image---2021-02-22T150119277_60337a04961c1.jpg", "publishedAt": "2021-02-22T10:16:02Z", "content": "A few years ago, workers digging to create a power plant in New Zealand discovered a 60-ton trunk from a kauri tree, and now according to researchers, it has captured the last collapse of Earths magn… [+3111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Images from NASA Perseverance rover’s landing on Mars you must see - The Indian Express", "description": "Once the software is up to date and the rover is ready to explore, it will search for signs of ancient microbial life on the planet.", "url": "https://indianexpress.com/photos/technology-gallery/nasa-perseverance-rover-landing-mars-first-images-7199149/", "urlToImage": "https://images.indianexpress.com/2021/02/Mars-3.jpg", "publishedAt": "2021-02-22T06:46:27Z", "content": null}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}