{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA finds new Empire State Building-sized asteroid; to make closest approach on Mar 24 - Republic World", "description": "Bigger than the Empire state building, the space rock dubbed 2013 BO76 has a diameter of 450 metres and would swing by from a distance of 51,11,759 km.", "url": "https://www.republicworld.com/science/space/nasa-finds-new-empire-state-building-sized-asteroid-to-make-closest-approach-on-mar-24-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/pfsan6uncqisgict_1648037814.jpeg", "publishedAt": "2022-03-23T12:19:00Z", "content": "NASA's Jet Propulsion Laboratory (JPL) has warned that another potentially hazardous asteroid is hurtling towards the Earth and will make its closest approach on March 24. Bigger than the Empire stat… [+1912 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Leonard, the brightest comet to fly past Earth in 2021, has broken apart. It is dying - India Today", "description": "Comet Leonard entered Earth's skies nearly a year after it was first discovered around Jupiter in January last year.", "url": "https://www.indiatoday.in/science/story/leonard-the-brightest-comet-to-fly-past-earth-in-2021-has-broken-apart-it-is-dying-1928612-2022-03-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Comet_Leonard-647x363.jpeg?EbM9J_BhCee7zJ.QyBnbKse0eJ5bxtY8", "publishedAt": "2022-03-23T11:22:42Z", "content": null}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IANS", "title": "Lettuce protects bones not just on Earth but on Mars trip too for Astronauts [Details] - IBTimes India", "description": "Astronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights.Lettuce produces a drug to protect against bone density loss in microgravity.", "url": "https://www.ibtimes.co.in/lettuce-protects-bones-not-just-earth-mars-trip-too-astronauts-details-846821", "urlToImage": "https://data1.ibtimes.co.in/en/full/770563/lettuce-file-photo-ians.jpg", "publishedAt": "2022-03-23T11:05:07Z", "content": "Watch NASA Astronauts On A Spacewalk Outside The ISS\r\nAstronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights.\r\nResearchers at the Univ… [+1960 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Study explains how ‘Junk DNA’ could treat PTSD and phobia - Tech Explorist", "description": "It could be the key to extinguishing fear-related memories.", "url": "https://www.techexplorist.com/study-explains-junk-dna-treat-ptsd-phobia/45495/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/03/fear.jpg", "publishedAt": "2022-03-23T09:55:38Z", "content": "Until recently, scientists thought most of our genes comprised Junk DNA, which didn’t do anything. But when they explored these regions, they noticed that most of the genome is active.\r\nAccording to … [+1292 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Sustainable leather, yarn and paper—from bread-eating fungi - Verve Times", "description": "Fungal fibers can be turned into yarn (left) or a leather substitute (right). Credit: Akram Zamani                        Your next trendy handbag could be fashioned from \"leather\" mad", "url": "https://vervetimes.com/sustainable-leather-yarn-and-paper-from-bread-eating-fungi/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sustainable-leather-ya.jpg", "publishedAt": "2022-03-23T09:26:52Z", "content": "Fungal fibers can be turned into yarn (left) or a leather substitute (right). Credit: Akram Zamani\r\nYour next trendy handbag could be fashioned from “leather” made from a fungus. Today, researchers w… [+4869 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "The James Webb Space Telescope has become a space rockstar - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/smart-living/innovation/the-james-webb-space-telescope-has-become-a-space-rockstar-111648025687335.html", "urlToImage": "https://images.livemint.com/img/2022/03/23/1140x641/NASA-Space-Telescope-0_1648025776198_1648025787087.jpg", "publishedAt": "2022-03-23T09:23:17Z", "content": "The James Webb Space Telescope successor to the famed Hubble Space Telescope blasted off from South America in December and reached its designated exploration point in January this year. Since then, … [+3941 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Gemini North telescope captures NGC 772 galaxy with overdeveloped arm - News9 LIVE", "description": "Tidal forces from a nearby galaxy have caused the strange appearance of one of the galaxy's arms", "url": "https://www.news9live.com/science/gemini-north-telescope-captures-ngc-772-galaxy-with-overdeveloped-arm-160580", "urlToImage": "https://media.news9live.com/h-upload/2022/03/23/260114-noirlab2209acropped.jpg", "publishedAt": "2022-03-23T08:59:08Z", "content": "The Gemini North Observatory has captured an image of the lopsided NGC 772, which is at a distance of over 100 million light years from the Earth, in the direction of the constellation of Aries. The … [+1547 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Ingenuity helicopter aces 22nd flight on Mars as it flies to new destination - India Today", "description": "The helicopter has flown for 4,647 meters on Mars as it is currently flying to the northwest portion of a region known as Séítah.", "url": "https://www.indiatoday.in/science/story/ingenuity-helicopter-aces-22nd-flight-on-mars-as-it-flies-to-new-destination-1928465-2022-03-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Ingenuity_8-647x363.jpeg?7slrgi.0rQdQMY9Bu5uMopGxIkD3gM0Y", "publishedAt": "2022-03-23T06:54:32Z", "content": null}, {"source": {"id": null, "name": "Westsidepeoplemag.com"}, "author": "Izer", "title": "A new hypothesis for MIT scientists about one of the biggest mysteries of science - Westside People", "description": "About 2.3 billion years ago, oxygen began to accumulate in the atmosphere, eventually reaching the life-sustaining levels we breathe today. A new", "url": "https://westsidepeoplemag.com/a-new-hypothesis-for-mit-scientists-about-one-of-the-biggest-mysteries-of-science/", "urlToImage": "https://westsidepeoplemag.com/wp-content/uploads/2022/03/A-new-hypothesis-for-MIT-scientists-about-one-of-the.jpg", "publishedAt": "2022-03-23T05:27:51Z", "content": "About 2.3 billion years ago, oxygen began to accumulate in the atmosphere, eventually reaching the life-sustaining levels we breathe today. A new hypothesis proposed by MIT scientists suggests a mech… [+6144 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "NASA's Perseverance to Cover Longest Distance in a Single Month Using Artificial Intelligence | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Mission officials have said that the six-wheeled scientist is on a 5-kilometre journey that began March 14 and is full of sandpits, craters, and fields of sharp rocks. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-23-nasas-perseverance-to-cover-longest-distance-in-a-single-month", "urlToImage": "https://s.w-x.co/in-perseverance_1.jpg", "publishedAt": "2022-03-23T05:26:38Z", "content": "Using artificial intelligence, NASA's Perseverance Mars rover is trying to cover more distance in a single month than any rover before.\r\nMission officials have said that the six-wheeled scientist is … [+2521 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA scientist gets excited as new exoplanets discovered beyond our solar system - HT Tech", "description": "What makes this discovery by NASA truly exciting is that some of these exoplanets found outside the solar system are just like Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-scientist-gets-excited-as-new-exoplanets-discovered-beyond-our-solar-system-71648012035280.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/23/1600x900/Planet_1594799805402_1594799819612_1648012192335.jpg", "publishedAt": "2022-03-23T05:12:21Z", "content": "NASA: The American space agency has recently discovered 65 new planets taking its total discovered exoplanets to an impressive 5,000, creating a new cosmic milestone. What makes this discovery truly … [+3951 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "NASA's Roman mission will test competing cosmic acceleration theories - EurekAlert", "description": "The Nancy Grace Roman Space Telescope's enormous, deep panoramas will provide the best opportunity yet to discern between the leading theories about what’s speeding up the universe’s expansion.\n\nRoman will explore this mystery using multiple methods, includin…", "url": "https://www.eurekalert.org/news-releases/947316", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/10f678d6-f691-4293-96fc-863dda5df1fd/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T02:05:12Z", "content": "image: These six cubes show the simulated distribution of galaxies at redshifts 9, 8, 5, 3, 2, and 1, with the corresponding cosmic ages shown. As the universe expands, the density of galaxies within… [+8193 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "ExoMars is Suspended. ESA is Looking for new Solutions to Replace Russian Components - UNIVERSE TODAY - Universe Today", "description": "Coordination between countries in space exploration is widespread.  However, sometimes that coordination falls apart.  In most cases, that failure is due to budgetary constraints. But in more recent times, it is due to geopolitical ones.  Specifically, wester…", "url": "https://www.universetoday.com/155113/exomars-is-suspended-esa-is-looking-for-new-solutions-to-replace-russian-components/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/03/6510.jpg", "publishedAt": "2022-03-23T01:49:09Z", "content": "Coordination between countries in space exploration is widespread.  However, sometimes that coordination falls apart.  In most cases, that failure is due to budgetary constraints. But in more recent … [+4281 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Described a Dinosaur's Butthole in Exquisite Detail - ScienceAlert", "description": "When a dog-sized Psittacosaurus was living out its days on Earth, it was probably concerned with mating, eating, and not being killed by other dinosaurs. It would never even have crossed its mind that, 120 million or so years later, scientists would", "url": "https://www.sciencealert.com/scientists-described-a-dinosaur-s-butthole-in-exquisite-detail", "urlToImage": "https://www.sciencealert.com/images/2021-01/processed/dinobutt_1024.jpg", "publishedAt": "2022-03-23T01:46:35Z", "content": "When a dog-sized Psittacosaurus was living out its days on Earth, it was probably concerned with mating, eating, and not being killed by other dinosaurs. It would never even have crossed its mind tha… [+4582 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Celebrating Women's History Month: Most recent female station crew members - EurekAlert", "description": "For Women’s History Month, NASA and the International Space Station celebrate the women who conduct science aboard the orbiting lab. Women have participated in scientific research on the space station since 2001 and become an integral part of advances in the …", "url": "https://www.eurekalert.org/news-releases/947342", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/8ff922df-df8b-4ae2-80ca-301d41eb77c6/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T00:22:21Z", "content": "image: Astronauts assigned for the Crew-4 Commercial Crew Program (CCP) mission, scheduled to launch in April 2022, include, left to right, NASA astronauts Jessica Watkins, Robert Bob Hines, and Kjel… [+17487 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists discover when beetles became prolific - Phys.org", "description": "Using a previously published and carefully curated 68-gene dataset, the scientists ran a battery of mathematical models to reconstruct the evolution of protein sequences—the results of which, have been published today in Royal Society Open Science.", "url": "https://phys.org/news/2022-03-scientists-beetles-prolific.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/beetle.jpg", "publishedAt": "2022-03-23T00:00:01Z", "content": "Using a previously published and carefully curated 68-gene dataset, the scientists ran a battery of mathematical models to reconstruct the evolution of protein sequencesthe results of which, have bee… [+3959 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Scientists make yeast-free pizza dough that rises like the real thing - Livescience.com", "description": "Their goal was to make tasty dough without a chemical agent.", "url": "https://www.livescience.com/yeast-free-pizza-dough-physics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/itmojZMzmxs69a4uGMHLq8-1200-80.jpg", "publishedAt": "2022-03-22T21:18:20Z", "content": "A materials scientist with a yeast allergy set out to make a yeast-free pizza dough that still rises like a classic Neapolitan pie.\r\nNow, in a new paper published March 22 in the journal Physics of F… [+3841 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Nature study: Ocean life may adapt to climate change, but with hidden costs: Scientists lead first-of-its-kind evolution experiment on 23 generations of tiny sea creatures - Science Daily", "description": "A new study shows that some ocean animals may be able evolve their way out of troubles caused by climate change -- but at a high cost. By artificially evolving 23 generations of a marine copepod, Acartia tonsa, a team of scientists found that the tiny creatur…", "url": "https://www.sciencedaily.com/releases/2022/03/220322150905.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T20:06:41Z", "content": "Suppose that we could watch twenty generations of whales or sharks adapting to climate change -- measuring how they evolve and how their biology changes as temperatures and carbon dioxide levels rise… [+4069 chars]"}, {"source": {"id": null, "name": "News-Daily.com"}, "author": "Ashley Strickland, CNN", "title": "Giant debris cloud spotted by NASA telescope after celestial objects collide - News-Daily.com", "description": "Space can be a violent place. Objects crash into each other, causing destruction or leading to the formation of larger celestial bodies. Scientists serve as astronomical detectives and use the", "url": "https://www.news-daily.com/news/astronomers-see-massive-debris-cloud-in-space-after-2-objects-collide/article_7fc20f6a-8739-5781-a058-35380d1962ef.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-daily.com/content/tncms/custom/image/c66199c4-9f43-11e5-bb6f-171943133c1c.jpg?resize=600%2C307", "publishedAt": "2022-03-22T19:52:34Z", "content": "Space can be a violent place. Objects crash into each other, causing destruction or leading to the formation of larger celestial bodies. Scientists serve as astronomical detectives and use the eviden… [+5135 chars]"}, {"source": {"id": null, "name": "Mutiny.in"}, "author": "Iris Pearce", "title": "NASA reveals a bird's eye image of Mars showing one of the planet's only inhabitants - Great Indian Mutiny", "description": "This is no ordinary image of Mars. A bird's-eye view shared by a NASA satellite features a rare appearance from a lone inhabitant of the planet. The", "url": "https://www.mutiny.in/nasa-reveals-a-birds-eye-image-of-mars-showing-one-of-the-planets-only-inhabitants/", "urlToImage": null, "publishedAt": "2022-03-22T19:51:52Z", "content": "This is no ordinary image of Mars.\r\nA bird’s-eye view shared by a NASA satellite features a rare appearance from a lone inhabitant of the planet.\r\nThe Zhurong rover in China appears as a small purple… [+1481 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researcher documents what happened during the first attempt at a gravitational-wave observatory in Europe - Phys.org", "description": "First predicted in Einstein's theory of general relativity, gravitational waves are tiny ripples in spacetime generated by titanic and powerful cosmic events. The great physicist believed that no equipment would ever be sensitive to detect these faint cosmic …", "url": "https://phys.org/news/2022-03-documents-gravitational-wave-observatory-europe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-gravity.jpg", "publishedAt": "2022-03-22T18:45:32Z", "content": "First predicted in Einstein's theory of general relativity, gravitational waves are tiny ripples in spacetime generated by titanic and powerful cosmic events. The great physicist believed that no equ… [+2920 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Sound Speed Measured on Mars - Physics", "description": "Researchers have made the first measurements of the speed of sound on Mars, revealing that the red planet’s temperature fluctuates on a faster timescale than previously thought.", "url": "https://physics.aps.org/articles/v15/43", "urlToImage": "https://physics.aps.org/assets/44c7d44c-2718-490b-9e6a-bbda0d9f729a/e43_1_thumb.png", "publishedAt": "2022-03-22T18:05:36Z", "content": "NASA’s Perseverance rover uses microphones to record sounds on Mars that researchers have used to measure the speed of sound on that planet.\r\nLast February, the internet was awash with alien sounds a… [+4745 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Bionic wing flaps improve wind energy efficiency: Combining engineered flaps with other structures inspired by seagull wings improves lift, reduces stalling in wind energy turbine blades - Science Daily", "description": "Scientists show a bionic approach combining features of a seagull's wing with an engineered flow control accessory, known as a Gurney flap, can greatly improve wind turbine performance. To achieve the best aerodynamic performance, the scientists simulated the…", "url": "https://www.sciencedaily.com/releases/2022/03/220322111341.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T17:56:22Z", "content": "Wind energy relies on efficient wind turbine blades, which act as airfoils, structures akin to an airplane wing. Air flow control accessories similar to those found in aircraft improve the turbine bl… [+2471 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Study analyses the characteristics of Apophis, the asteroid that will approach Earth in 2029 - Nanowerk", "description": "The Apophis asteroid was discovered in 2004 and has been monitored since then due to its classification as a potentially hazardous asteroid (PHA), as it was estimated that it would have a 2% chance of hitting Earth.", "url": "https://www.nanowerk.com/news2/space/newsid=60138.php", "urlToImage": "https://www.nanowerk.com/news2/space/id60138.jpg", "publishedAt": "2022-03-22T16:58:30Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Curtis", "title": "NASA will fly a ROCKET through the Northern lights - Daily Mail", "description": "The INCAA mission will study how the aurora borealis stir up the boundary layer between the neutral atmosphere that cocoons our planet and the electrically-reactive plasma of space.", "url": "https://www.dailymail.co.uk/sciencetech/article-10639907/NASA-fly-ROCKET-Northern-lights-study-affect-Earth.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/14/55658719-0-image-a-4_1647959519459.jpg", "publishedAt": "2022-03-22T16:17:36Z", "content": "The Northern Lights are one of the most spectacular sights on Earth, but astronomers are just as interested in the science behind them. \r\nNow NASA has revealed plans to fly a rocket straight through … [+7309 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "A new experiment could confirm information as the fifth state of matter - Interesting Engineering", "description": "A scientist from the University of Portsmouth devised an experiment that they believe confirms the fifth state of matter.", "url": "https://interestingengineering.com/information-fifth-state-of-matter", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Z3G8DmayGm/sizes/dna-info_md.jpeg", "publishedAt": "2022-03-22T15:44:55Z", "content": "A scientist from the University of Portsmouth devised an experiment that they believe confirms the fifth state of matter, a discovery that would change the field of physics for good, a press release … [+2583 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "Scientists think there’s a mirror universe where time moves backwards - BGR", "description": "Scientists believe that a mirror universe that brings perfect balance to ours could exist, and time moves backwards within it.", "url": "http://bgr.com/science/scientists-think-theres-a-mirror-universe-where-time-moves-backwards/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/03/AdobeStock_196322910.jpeg?quality=82&strip=all", "publishedAt": "2022-03-22T15:35:00Z", "content": "Some scientists say that our universe could just be one side of the coin. The other side is something they call the “anti-universe”. It’s basically a hypothetical mirror universe where time moves bac… [+3428 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Physicists Defy Haters, Create Tetragonal Ice - Gizmodo", "description": "A diamond anvil squashed water ice into a never-before-seen transitional form that may exist on other planets.", "url": "https://gizmodo.com/physicists-defy-haters-create-tetragonal-ice-1848682806", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/7afc4aaa26e9a181cacba5426ea9c041.jpg", "publishedAt": "2022-03-22T15:23:00Z", "content": "A team of physicists recently discovered a new phase of water ice, after they put ordinary ice under extraordinarily high pressure and melted it before letting it refreeze. The previously unknown pha… [+2957 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Live: Special coverage of second class from China's space station - CGTN", "description": "The second class from China's Tiangong space station by Shenzhou-13 astronauts – Zhai Zhigang, Wang Yaping and Ye Guangfu – will be held at 3:40 pm BJT on March 23.", "url": "https://news.cgtn.com/news/2022-03-22/Live-Special-coverage-of-second-class-from-China-s-space-station-18BDoSMlDCo/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-22/Live-Special-coverage-of-second-class-from-China-s-space-station-18BDoSMlDCo/img/e6bd11e4dd9f46899a188f2a07dc5cd6/e6bd11e4dd9f46899a188f2a07dc5cd6-750.png", "publishedAt": "2022-03-22T14:26:17Z", "content": "The second class from China's Tiangong space station by Shenzhou-13 astronauts Zhai Zhigang, Wang Yaping and Ye Guangfu will be held at 3:40 pm BJT on March 23. \r\nThe second episode of the \"Tiangong … [+705 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Astronauts Raja Chari & Matthias Maurer Spacewalk Outside the International Space Station - NASA", "description": "NASA astronaut Raja Chari and European Space Agency (ESA) astronaut Matthias Maurer are conducting a spacewalk on Wednesday, March 23 to install new hoses on...", "url": "https://www.youtube.com/watch?v=uZqaTsbDcgU", "urlToImage": "https://i.ytimg.com/vi/uZqaTsbDcgU/maxresdefault_live.jpg", "publishedAt": "2022-03-22T13:49:29Z", "content": null}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Supermassive black holes identified as likely cause of stopping star formation - News9 LIVE", "description": "The formation of supermassive black holes is what causes young galaxies to turn into old galaxies", "url": "https://www.news9live.com/science/supermassive-black-holes-identified-as-likely-cause-of-stopping-star-formation-160447", "urlToImage": "https://media.news9live.com/h-upload/2022/03/22/259770-potw1951acropped.jpg", "publishedAt": "2022-03-22T13:35:44Z", "content": "A combination of machine learning, sophisticated supercomputer simulations and data from large scale surveys of the cosmos have resulted in researchers getting closer to solve a 20 year old conundrum… [+3341 chars]"}, {"source": {"id": null, "name": "Polymerupdate.com"}, "author": null, "title": "Plastics waste – no problem; scientists develop enzymes to break down PET in weeks - polymerupdate.com", "description": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and se...", "url": "https://www.polymerupdate.com/news/Important/22Mar2022/1158893/plastics-waste-–-no-problem-scientists-develop-enzymes-to-break-down-pet-in-weeks", "urlToImage": "https://www.polymerupdate.com/images/logo/200x200.png", "publishedAt": "2022-03-22T12:34:07Z", "content": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and seventies, have become a cause of major concern for the entire world due to irresponsible dumping of … [+3241 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Asteroid Ryugu could be a remnant of an extinct comet - Daily Mail", "description": "Samples from the diamond shaped, half-mile diameter space rock were returned to Earth for study by the Japan Aerospace Exploration Agency (JAXA) in 2020.", "url": "https://www.dailymail.co.uk/sciencetech/article-10639185/Asteroid-Ryugu-remnant-extinct-comet.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/10/43979755-0-image-a-5_1647946545549.jpg", "publishedAt": "2022-03-22T11:34:50Z", "content": "Asteroid Ryugu could be a remnant of an extinct comet that spent tens of thousands of years racing through the solar system, new data suggests.\r\nScientists believe it was then vaporised by high tempe… [+6783 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "World record: Scientists succesfully stored qubit for 20 milliseconds - Tech Explorist", "description": "The new world record for qubit storage.", "url": "https://www.techexplorist.com/world-record-scientists-succesfully-stored-qubit-20-milliseconds/45477/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/03/storing-photonic-qubits.jpg", "publishedAt": "2022-03-22T11:06:08Z", "content": "There is a significant hindrance to developing long-haul quantum communication systems: After a few hundred kilometers within an optical fiber, the photons that carry the qubits or ‘quantum bits’ (th… [+2602 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After asteroid struck Earth, NASA makes THIS claim - HT Tech", "description": "An asteroid struck Earth, but worryingly, NASA detected it just two hours before it crashed. Find out what it tells about NASA’s planetary defense system", "url": "https://tech.hindustantimes.com/tech/news/after-asteroid-struck-earth-nasa-makes-this-claim-71647946332041.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/22/1600x900/asteroid-g5603adab3_1920_1647078503425_1647946402612.jpg", "publishedAt": "2022-03-22T10:55:30Z", "content": "Shockingly, an asteroid hit Earth last week. The news in itself is not that shocking as many pebble-sized asteroids get pulled by Earths gravity and burn up in the atmosphere. What was truly surprisi… [+2762 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of St Andrews: A sulphurous death for unlucky dinosaurs - India Education Diary", "description": "Climate cooling associated with sulphur gases directly contributed to the extinction of the dinosaurs, research carried out at the University of St Andrews has found.The gases were ejected into the Earth’s atmosphere after a six-mile-wide asteroid hi", "url": "https://indiaeducationdiary.in/university-of-st-andrews-a-sulphurous-death-for-unlucky-dinosaurs/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/01/Cover-University-of-St-Andrews-1024x576.jpg", "publishedAt": "2022-03-22T06:44:44Z", "content": "Climate cooling associated with sulphur gases directly contributed to the extinction of the dinosaurs, research carried out at the University of St Andrews has found.\r\nThe gases were ejected into the… [+2853 chars]"}, {"source": {"id": null, "name": "Parisbeacon.com"}, "author": "Paris Beacon", "title": "The Hubble Space Telescope captures a picture of a barred spiral galaxy 48 million light-years from Earth - Paris Beacon News", "description": "The Hubble Space Telescope managed to capture a photograph of NGC 1097, a barred spiral galaxy, located 48 million light-years from Earth. “This image reveals the complexity of the latticework of stars and dust at the center of NGC 1097, with long tendrils of…", "url": "https://www.parisbeacon.com/64718/", "urlToImage": "https://www.parisbeacon.com/wp-content/uploads/2022/03/The-Hubble-Space-Telescope-captures-a-picture-of-a-barred.jpg", "publishedAt": "2022-03-22T05:31:47Z", "content": "The Hubble Space Telescope managed to capture a photograph of NGC 1097, a barred spiral galaxy, located 48 million light-years from Earth.\r\n“This image reveals the complexity of the latticework of st… [+855 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "Mysterious, Ghostly Radio Circles From Deep Space Probed With Best Images Yet - CNET", "description": "The faint radio rings pulled into focus, thanks to new images from a South African telescope.", "url": "https://www.cnet.com/science/space/mysterious-ghostly-radio-circles-from-deep-space-probed-with-best-images-yet/", "urlToImage": "https://www.cnet.com/a/img/resize/d72417b9878bcfec016a5383c173b340558d0a57/2022/03/20/29d42643-7a3f-4710-8c68-de4df4211a40/orc1-meerkat.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-03-22T02:30:02Z", "content": "The space Lord of the Rings: The green circle picture here is known as an \"ORC,\" or odd radio circle.\r\nJ. English (U. Manitoba)/EMU/MeerKAT/DES(CTIO)\r\nWhat's about 16 times wider than the Milky Way, … [+4988 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Launches Rocket to Study Hypersonic Aircraft - NASA", "description": "Not often that a second chance comes along, but the upcoming launch of the Air Force’s Office of Scientific Research Boundary Layer Transition and Turbulence project provides just that.", "url": "https://www.nasa.gov/feature/nasa-launches-rocket-to-study-hypersonic-aircraft/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/dsc_1191.jpg", "publishedAt": "2022-03-21T22:46:45Z", "content": null}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "Is 'slow science' the answer to astronomy's carbon footprint? sky and telescope - brytfmonline.com", "description": "Night image taken from the International Space Station European Space Agency / NASA An international...", "url": "https://www.brytfmonline.com/is-slow-science-the-answer-to-astronomys-carbon-footprint-sky-and-telescope/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/03/Is-slow-science-the-answer-to-astronomys-carbon-footprint-sky.jpg", "publishedAt": "2022-03-21T21:29:44Z", "content": "Night image taken from the International Space Station European Space Agency / NASA\r\nAn international team of astronomers has determined the extent to which astronomical facilities the telescopes on … [+6973 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "Scientists Find A Hidden Layer Of Magnetic Energy In Earth's Core - Optic Flux", "description": "Tiny magnetic oscillations identified in the Earth's core may illuminate what is happening deep within our globe. Earth's center is composed of a solid internal part and a liquid outermost part. The heat differential between both the heated core and the coole…", "url": "https://www.opticflux.com/scientists-find-a-hidden-layer-of-magnetic-energy-in-earths-core/17228/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/03/earth-hour-4159995_960_720.jpg", "publishedAt": "2022-03-21T21:16:09Z", "content": "Tiny magnetic oscillations identified in the Earth’s core may illuminate what is happening deep within our globe.\r\nEarth’s center is composed of a solid internal part and a liquid outermost part. The… [+1680 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Sandra Erwin", "title": "Industry proposals sought for 'cislunar highway patrol' satellite - SpaceNews", "description": "The Air Force Research Laboratory is asking companies to submit ideas on how they would design a spacecraft to monitor outer space beyond Earth’s orbit.", "url": "https://spacenews.com/industry-proposals-sought-for-cislunar-highway-patrol-satellite/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-11-at-10.56.08-AM.png", "publishedAt": "2022-03-21T20:43:42Z", "content": "An experiment called Cislunar Highway Patrol System would operate beyond geosynchronous orbit, in the region near the moon\r\nWASHINGTON The Air Force Research Laboratory is asking companies to submit … [+1797 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Black holes may grow quantum 'hair' - Livescience.com", "description": "Information about a black hole's insides might be imprinted in its gravitational field.", "url": "https://www.livescience.com/black-hole-quantum-hair", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5yyL8eEKjNYnWzPSZYjfGE-1200-80.jpg", "publishedAt": "2022-03-21T18:42:43Z", "content": "What falls into a black hole, stays in a black hole, at least according to the laws of general relativity. But now, new research suggests that the material inside the black hole may leave a quantum i… [+4188 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Microbial communities where cells cooperate have increased drug tolerance - Science Daily", "description": "Research has revealed a key mechanism which increases tolerance to drugs amongst microbial communities. The findings could help the development of more effective antifungal treatments.", "url": "https://www.sciencedaily.com/releases/2022/03/220321132141.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-21T17:52:50Z", "content": "Research from the Francis Crick Institute has revealed a key mechanism which increases tolerance to drugs amongst microbial communities. The findings could help the development of more effective anti… [+3824 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Source of fast radio bursts surprises astronomers – Physics World - physicsworld.com", "description": "Discovery suggests ancient stars can collapse to create magnetars", "url": "https://physicsworld.com/a/source-of-fast-radio-bursts-surprises-astronomers/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/03/Sam-Jarman-Fast-radio-bursts-article.jpg", "publishedAt": "2022-03-21T17:41:41Z", "content": "Older than expected: artists impression of a magnetar in a cluster of ancient stars (in red) close to the spiral galaxy M81.\r\nThe source of fast radio bursts (FRBs) first detected in 2020 is likely t… [+2900 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A galaxy with split personality? Here`s what we mean by this - WION", "description": "Space images are mesmerising. There is no doubt about that. Though we know a lot about whats out there, theres lot that is still to be found. But sometimes old images reveal something astoundingly whacky that our eyes go on a different trip altogether.", "url": "https://www.wionews.com/science/a-galaxy-with-split-personality-heres-what-we-mean-by-this-464411", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/21/249149-galaxy-eso.jpg", "publishedAt": "2022-03-21T17:29:44Z", "content": "Space images are mesmerising. There is no doubt about that. Though we know a lot about what's out there, there's lot that is still to be found. But sometimes old images reveal something astoundingly … [+1137 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "See Saturn, Venus and Mars as moon shines near bright Antares - Space.com", "description": "Enjoy the glittering worlds and star along with (early) breakfast.", "url": "https://www.space.com/saturn-venus-moon-antares-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5hZgQxYiF3CBg4D9zXLUFS-1200-80.jpg", "publishedAt": "2022-03-21T17:23:42Z", "content": "A plethora of worlds and a bright star will be visible in the early morning Wednesday (March 23) to predawn risers.\r\nAll in the sky during the same period will be ringed Saturn, bright Mars, and clou… [+2393 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Robin George Andrews", "title": "How a Tiny Asteroid Strike May Save Earthlings From City-Killing Space Rocks - The New York Times", "description": "An asteroid hunter detected the small object two hours before it crashed into the sea near Greenland, a sign of the growing sophistication of NASA’s planetary defense system.", "url": "https://www.nytimes.com/2022/03/21/science/nasa-asteroid-strike.html", "urlToImage": "https://static01.nyt.com/images/2022/03/21/autossell/21sci-asteroid1-cover/21sci-asteroid1-cover-facebookJumbo.jpg", "publishedAt": "2022-03-21T16:38:06Z", "content": "Scout constantly looks at data posted by the Minor Planet Center, a clearinghouse in Cambridge, Mass., that notes the discoveries and positions of small space objects. Then the software tries to figu… [+1692 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mert Erdemir", "title": "A new RNA experiment could finally reveal the origin of life - Interesting Engineering", "description": "Researchers at the University of Tokyo have created an RNA molecule that can not only reproduce but also \"evolve\" into a variety of more complicated molecules.", "url": "https://interestingengineering.com/rna-experiment-could-reveal-the-origin-of-life", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/M3OekvKP6N/sizes/istock-1038779250_md.jpg", "publishedAt": "2022-03-21T16:21:49Z", "content": "Humankind has always been looking for an answer to the question of how life began and coming up with different theories on the origin of life. But now for almost two centuries, Darwin's theory of evo… [+3388 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Prevalence of heterotrophic methylmercury-detoxifying bacteria across oceanic regions - Phys.org", "description": "A team of researchers led by the Institut de Ciències del Mar (ICM-CSIC) of Barcelona and the Universitat Autònoma de Barcelona (UAB) has revealed the distribution and mercury degradation capacities of heterotrophic bacteria recovered from different oceanogra…", "url": "https://phys.org/news/2022-03-prevalence-heterotrophic-methylmercury-detoxifying-bacteria-oceanic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-distribution-and-c.jpg", "publishedAt": "2022-03-21T13:48:23Z", "content": "A team of researchers led by the Institut de Ciències del Mar (ICM-CSIC) of Barcelona and the Universitat Autònoma de Barcelona (UAB) has revealed the distribution and mercury degradation capacities … [+4797 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner, Adam Mann", "title": "Scientists observe quantum boomerang effect for the first time - Livescience.com", "description": "The effect has been predicted for more than 60 years.", "url": "https://www.livescience.com/quantum-boomerang-effect-spotted", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PdX2QTBQ8vTY2fb2jVXB9W-1200-80.jpg", "publishedAt": "2022-03-21T13:25:57Z", "content": "For the first time, physicists have confirmed a weird quantum phenomenon in which tiny particles, when nudged out of place, will snap right back to where they came from.\r\nThe strange behavior, called… [+6880 chars]"}]}