{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Adriana Diaz", "title": "'Cannibal' solar flares trigger spectacular Northern Lights display across the US - Daily Mail", "description": "A 'cannibal' solar flare triggered a spectacular Northern Lights show across parts of the United States on Wednesday, with the hues seen as far south as California and Connecticut.", "url": "https://www.dailymail.co.uk/news/article-10172447/Cannibal-solar-flares-trigger-spectacular-Northern-Lights-display-US.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/06/18/50145991-0-image-a-11_1636224666327.jpg", "publishedAt": "2021-11-06T18:51:49Z", "content": "A 'cannibal' solar flare triggered a spectacular Northern Lights show across Northern parts of the United States on Wednesday, with the hues seen as far south as California and Connecticut. \r\nIt came… [+7566 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "The search for another Earth across the galaxy heats up - CNN", "description": "This week, meet baby seals that share a human trait, find out why a desert turned to glass, join the search for Earth-like planets, discover the child fossil of an enigmatic ancient human species, and more.", "url": "https://www.cnn.com/2021/11/06/world/science-newsletter-wt-scn-habitable-planets/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170221160947-exoplanet-trappist-1f-super-tease.jpg", "publishedAt": "2021-11-06T17:14:00Z", "content": "A version of this story appeared in CNN's Wonder Theory newsletter. To get it in your inbox, sign up for free here. Tell us what you'd like to see more of in the newsletter at sciencenewsletter@cnn.c… [+4833 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Get ready to witness longest partial lunar eclipse of 21st century. Details here - Hindustan Times", "description": "The duration of the partial lunar eclipse will be about 3 hours and 28 minutes. | World News", "url": "https://www.hindustantimes.com/world-news/get-ready-to-witness-longest-partial-lunar-eclipse-of-21st-century-details-here-101636213560420.html", "urlToImage": "https://images.hindustantimes.com/img/2021/11/06/1600x900/longest_partial_lunar_eclipse_in_November_1636215078848_1636215183838.jpg", "publishedAt": "2021-11-06T16:14:23Z", "content": "The longest partial lunar eclipse of the century is set to occur overnight on November 18-19 when the Moon will slip into Earth's shadow for a couple of hours, according to Nasa. The eclipse will occ… [+1646 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Universe expansion directly impacts black hole growth - Tech Explorist", "description": "Both large and small black hole masses can result from a single pathway.", "url": "https://www.techexplorist.com/universe-expansion-directly-impacts-black-hole-growth/42205/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/11/black-hole.jpg", "publishedAt": "2021-11-06T15:47:15Z", "content": "Since the first observation of black hole mergers by LIGO in 2015, astronomers have been repeatedly surprised by their large masses. These mergers emit no light, still are observed through their emis… [+4465 chars]"}, {"source": {"id": null, "name": "Theindianwire.com"}, "author": "Alaina Ali Beg", "title": "Another decadal survey under Astro2020 decides the future of Space, NASA told to build the biggest of all ... - The Indian Wire", "description": "There has been a significant influence of UN Astronomical spirit in shaping the Space dynamics on Earth. Its different now, with strong affluent private players interested in Space, other countries’ power players sending successful missions and contributing l…", "url": "https://www.theindianwire.com/space/another-decadal-survey-under-astro2020-decides-the-future-of-space-nasa-told-to-build-the-biggest-of-all-telescopes-322783/", "urlToImage": "https://www.theindianwire.com/wp-content/uploads/2021/11/astro2020_NAS_920.jpg", "publishedAt": "2021-11-06T13:00:24Z", "content": "There has been a significant influence of UN Astronomical spirit in shaping the Space dynamics on Earth.\r\nIts different now, with strong affluent private players interested in Space, other countries … [+4753 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "No toilet for returning SpaceX crew, stuck using diapers - OrissaPOST", "description": "Cape Canaveral (US): The astronauts who will depart the International Space Station as early as this weekend will be stuck using diapers on the way home because of their capsule’s broken toilet. NASA astronaut Megan McArthur described the situation Friday as …", "url": "https://www.orissapost.com/no-toilet-for-returning-spacex-crew-stuck-using-diapers/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/10/International-Space-Station-ISS-Wiki-scaled.jpg", "publishedAt": "2021-11-06T12:53:26Z", "content": "Cape Canaveral (US): The astronauts who will depart the International Space Station as early as this weekend will be stuck using diapers on the way home because of their capsule’s broken toilet.\r\nNAS… [+2202 chars]"}, {"source": {"id": null, "name": "Techgenyz.com"}, "author": null, "title": "NASA reveals the plan to launch the manned Artemis 3 to the Moon in 2024 - TechGenyz", "description": "Artemis 3 is the third planned flight of NASA’s Orion spacecraft of the Space Launch System. The space agency very recently announced that it will launch", "url": "https://www.techgenyz.com/2021/11/06/nasa-plan-launch-manned-artemis-3-moon-2024/", "urlToImage": "https://www.techgenyz.com/wp-content/uploads/2021/11/moon-mission-2024.jpg", "publishedAt": "2021-11-06T10:41:15Z", "content": "Artemis 3 is the third planned flight of NASAs Orion spacecraft of the Space Launch System. The space agency very recently announced that it will launch Artemis 1 in February 2022 to the moon, but th… [+1624 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Amrit Burman", "title": "Researchers find mysterious patches of glass scattered across Chile's Atacama desert - Republic World", "description": "Scientists have found strange patches in the Atacama Desert in northern Chile, which is one of the driest places on Earth, with a high atmospheric temperature.", "url": "https://www.republicworld.com/world-news/south-america/researchers-find-mysterious-patches-of-glass-scattered-across-chiles-atacama-desert.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/9b6cmtmtw8zxhoqi_1636192575.jpeg", "publishedAt": "2021-11-06T10:32:00Z", "content": "Scientists have found strange patches in the Atacama Desert in northern Chile, which is one of the driest places on Earth, with a very high atmospheric temperature. Researchers have observed that the… [+2970 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Australia to land a home-made rover on the Moon in 2024 to search for water - Deccan Herald", "description": "By Joshua Chou for The Conservation Last month the Australian Space Agency announced plans to send an Australian-made rover to the Moon by as early as 2026, under a deal with NASA. The rover will collect lunar soil containing oxygen, which could eventually be…", "url": "https://www.deccanherald.com/international/australia-to-land-a-home-made-rover-on-the-moon-in-2024-to-search-for-water-1047805.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/11/06/moon-ap-1047805-1636194075.jpg", "publishedAt": "2021-11-06T10:05:41Z", "content": "By Joshua Chou for The Conservation\r\nLast month the Australian Space Agency announced plans to send an Australian-made rover to the Moon by as early as 2026, under a deal with NASA. The rover will co… [+3725 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Jonathan O’Callaghan", "title": "Star System With Right-Angled Planets Surprises Astronomers - The New York Times", "description": "Two planets orbit the poles while another revolves around the star’s equator, suggesting a mysterious, undetected force.", "url": "https://www.nytimes.com/2021/11/06/science/perpendicular-planets-star-system.html", "urlToImage": "https://static01.nyt.com/images/2021/11/06/science/06tb-rightangle1/06tb-rightangle1-facebookJumbo.jpg", "publishedAt": "2021-11-06T09:00:12Z", "content": "It was clearly a surprise, said Vincent Bourrier, from the University of Geneva in Switzerland, who led the discovery published last month in the journal Astronomy &amp; Astrophysics. This is somethi… [+1418 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "NASA selected a new mission to study storms, impacts on climate models - Tech Explorist", "description": "The mission is expected to launch in 2027.", "url": "https://www.techexplorist.com/new-mission-study-storms-impacts-climate-models/42200/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/11/thunderstorm-clouds.jpg", "publishedAt": "2021-11-06T07:38:29Z", "content": "NASA’s new mission will determine the behavior of tropical storms and thunderstorms, including their impacts on weather and climate models. This new Earth science mission is expected to launch in 202… [+1657 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV News Desk", "title": "NASA, USGS release first Landsat 9 light images of Earth - India TV News", "description": "NASA, USGS release first Landsat 9 light images of Earth", "url": "https://www.indiatvnews.com/science/nasa-releases-earth-images-landsat-9-light-images-743827", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/11/jpeg-1636168267.jpg", "publishedAt": "2021-11-06T03:12:05Z", "content": "Joint mission between NASA and the US Geological Survey (USGS), Landsat 9, launched on September 27, 2021, has collected its first light images of Earth. According to a press release by NASA, all the… [+4600 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "From space, an astronaut sounds the alarm about the climate crisis - Space Bollyinside - BollyInside", "description": "“We see the pollution of rivers, atmospheric pollution, things like that. What really shocked me on this mission were extreme weather or climate", "url": "https://www.bollyinside.com/news/from-space-an-astronaut-sounds-the-alarm-about-the-climate-crisis", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-11-05T22:00:32Z", "content": "We see the pollution of rivers, atmospheric pollution, things like that. What really shocked me on this mission were extreme weather or climate phenomena, Pesquet told French President Emmanuel Macro… [+1279 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "5 major heatwaves in 30 years has turned the Great Barrier Reef into a bleached checkerboard - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Townsville/Washington, Nov 5: (The Conversation) Just 2% of the Great Barrier Reef remains untouched by bleaching since 1998 and 80% of individual reefs have bleached severely once, twice or three times since 2016, our new study reveals today. We measured the…", "url": "https://www.dailyexcelsior.com/5-major-heatwaves-in-30-years-has-turned-the-great-barrier-reef-into-a-bleached-checkerboard/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2021/11/download-10-5.jpg", "publishedAt": "2021-11-05T19:07:50Z", "content": "Townsville/Washington, Nov 5: (The Conversation) Just 2% of the Great Barrier Reef remains untouched by bleaching since 1998 and 80% of individual reefs have bleached severely once, twice or three ti… [+5711 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Huge Solar Storm Could Impact The Power Grid And Lead To Outages, Experts Warn - Wonderful Engineering", "description": "Advertisement It is being reported that there is a tremendous solar storm heading towards earth and the extreme radiation is expected to meddle with the power grids. The Space Weather Prediction Center (SWPC), which is run by the National Oceanic and Atmosphe…", "url": "https://wonderfulengineering.com/the-huge-solar-flare-could-impact-the-power-grid-and-lead-to-outages-experts-warn/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2021/11/Untitled-design-6-1130x580-1.jpg", "publishedAt": "2021-11-05T18:56:42Z", "content": "It is being reported that there is a tremendous solar storm heading towards earth and the extreme radiation is expected to meddle with the power grids.\r\nThe Space Weather Prediction Center (SWPC), wh… [+1322 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists present the dark side of Pluto in new images - Daily Mail", "description": "Capturing the shot of Pluto involved leveraging light that was reflected off the largest of Pluto's five moons, Charon, according to a study published by the American Astronomical Society.", "url": "https://www.dailymail.co.uk/sciencetech/article-10169455/Scientists-present-dark-Pluto-new-images.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/05/13/50104089-0-image-a-11_1636119614218.jpg", "publishedAt": "2021-11-05T16:43:04Z", "content": "NASA has revealed a grainy photo of Pluto's dark side, six years after it was taken by its New Horizons spacecraft. \r\nThe image taken in July 2015 when Pluto was 3 billion miles from Earth shows the … [+8306 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists find water in a galaxy 12.8 billion light-years away - WION", "description": "Our constant search for answer to whether we are alone in the universe involves detection of water. The simple liquid has a great significance in finding life in space as it has cradled life on our very own planet. Water has been found and even predicted to b…", "url": "https://www.wionews.com/science/scientists-find-water-in-a-galaxy-128-billion-light-years-away-426992", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/08/03/152762-untitled-design-9.jpg, 2017 shows an artist&#039;s impression of a galaxy forming stars within powerful outflows of material blasted out from supermassive black holes at its core\" typeof=\"foaf:Image\" />", "publishedAt": "2021-11-05T14:44:45Z", "content": "Our constant search for answer to whether we are alone in the universe involves detection of water. The simple liquid has a great significance in finding life in space as it has cradled life on our v… [+1451 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Hubble snapped a colorful planetary Nebula ringed by a halo of glowing gas - Tech Explorist", "description": "A halo of glowing gas over 4.5 light-years across surrounds the nebula's brighter inner ring.", "url": "https://www.techexplorist.com/hubble-snapped-colorful-planetary-nebula-ringed-halo-glowing-gas/42188/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/11/Colorful-Planetary-Nebula.jpg", "publishedAt": "2021-11-05T14:31:22Z", "content": "NASA/ESA Hubble Space Telescope captured and shared the imaged of a planetary nebula called NGC 2438 that formed after the death of a Sun-like star.\r\nLocated in the southern constellation of Puppis, … [+643 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "The Taurid meteor shower of 2021 is peaking now. Here's what to expect. - Space.com", "description": "The annual Taurid meteor shower from Comet Encke peaks Nov. 5-12.", "url": "https://www.space.com/taurid-meteor-shower-2021-peaking-now", "urlToImage": "https://cdn.mos.cms.futurecdn.net/reqygnU7map8VZonAa8UoA-1200-80.png", "publishedAt": "2021-11-05T14:08:33Z", "content": "For the next week or so, if you happen to be outside during the overnight hours and happen to catch a glimpse of a bright \"shooting star\" with a yellow-orange or ruddy hue you might very well have ju… [+4561 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Can a digital replica of the Earth save the world from climate disaster? - Space Bollyinside - BollyInside", "description": "ESA and its partners discussed their progress in the runup to the UN Climate Change Conference COP26, a two-week event that’s currently taking place in", "url": "https://www.bollyinside.com/news/can-a-digital-replica-of-the-earth-save-the-world-from-climate-disaster", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-11-05T14:00:52Z", "content": "ESA and its partners discussed their progress in the runup to the UN Climate Change Conference COP26, a two-week event thats currently taking place in Glasgow, Scotland.  Related: 10 devastating sign… [+3284 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This is how long the geomagnetic storm sparked by the Sun lasted on Earth - HT Tech", "description": "The CMEs from the Sun collided with the magnetic field of Earth at 583 km/sec speed, causing a G3 geomagnetic storm on Earth.", "url": "https://tech.hindustantimes.com/tech/news/this-is-how-long-the-geomagnetic-storm-sparked-by-the-sun-lasted-on-earth-71636120644824.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/11/05/1600x900/geomagnetic_storm_1635590002511_1636120871535.jpg", "publishedAt": "2021-11-05T13:57:24Z", "content": "The second solar flare eruption within a week has sparked another geomagnetic storm on the Earth. If nothing else, it gifted the inhabitants of Earth one of the most intense displays of auroras in ye… [+2251 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Video: Melting glaciers - Phys.org", "description": "Glaciers across the globe have lost over nine trillion tons of ice in half a century. How will glaciers look over the coming decades? \"It all depends on what humans are doing now in terms of greenhouse gas emissions:\" this is the message one scientist deliver…", "url": "https://phys.org/news/2021-11-video-glaciers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/26-meltingglaci.jpg", "publishedAt": "2021-11-05T13:12:16Z", "content": "Glaciers across the globe have lost over nine trillion tons of ice in half a century. How will glaciers look over the coming decades? \"It all depends on what humans are doing now in terms of greenhou… [+1116 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA's new lunar mission: ice-mining experiment to launch in 2022 | Science and environment news - Space Bollyinside - BollyInside", "description": "The Polar Resources Ice-Mining Experiment-1 (PRIME-1) will land on the lunar surface attached to a robotic lander. PRIME-1 consists of a drill paired with", "url": "https://www.bollyinside.com/news/nasas-new-lunar-mission-ice-mining-experiment-to-launch-in-2022-science-and-environment-news", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-11-05T13:10:37Z", "content": "The Polar Resources Ice-Mining Experiment-1 (PRIME-1) will land on the lunar surface attached to a robotic lander. PRIME-1 consists of a drill paired with a mass spectrometer a 4G/LTE communications … [+2257 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "NASA shares photo of celestial 'festival of lights' called globular cluster to wish Happy Diwali - Times Now", "description": "NASA shared the photo of the globular cluster on their social media pages, adding it was captured by the Hubble Telescope.", "url": "https://www.timesnownews.com/technology-science/article/nasa-shares-photo-of-celestial-festival-of-lights-called-globular-cluster-to-wish-happy-diwali/829471", "urlToImage": "https://imgk.timesnownews.com/story/CCCQ.jpeg?tr=w-560,h-292,fo-top", "publishedAt": "2021-11-05T12:55:08Z", "content": "<ul><li>NASA said the stunning image was captured by the Hubble Telescope</li></ul>\r\n<ul><li>It contains a densely-packed collection of colorful stars close to the heart of the Milky Way.</li></ul>\r\n… [+2155 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ALMA telescope detects element found in our teeth in a galaxy 12 billion light-years away - Republic World", "description": "Astronomers, using the ALMA telescope, detected the presence of fluorine in a galaxy named, NGP–190387, over 12 billion light-years from Earth.", "url": "https://www.republicworld.com/technology-news/science/alma-telescope-detects-element-found-in-our-teeth-in-a-galaxy-12-billion-light-years-away.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/vczzlpzz48dmzwbb_1636113676.jpeg", "publishedAt": "2021-11-05T12:31:00Z", "content": "It would be fair to dedicate this week to groundbreaking discoveries as astronomers, for the very first time, have detected the presence of fluorine in a galaxy named, NGP190387, over 12 billion ligh… [+3320 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Scary & eerie! NASA posts sounds of Cosmic Reef, netizens left terrified - Zee News", "description": "The US space agency in its latest post shared a sonification post of the Cosmic Reef.", "url": "https://zeenews.india.com/viral/scary-eerie-nasa-posts-sounds-of-cosmic-reef-netizens-left-terrified-2408183.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/11/05/985236-nasa-hubble-cosmic.jpg", "publishedAt": "2021-11-05T12:24:49Z", "content": "New Delhi: The US space agency in its latest post shared a sonification post of the Cosmic Reef. In the audio clip, two nebulae named NGC 2014 and NGC 2020 are seen in the middle of the 'Large Magell… [+1531 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "China wants to bring Martian soil this decade - The Times Hub", "description": "The cute Chinese rover Zhurong/OCG NEWS China unexpectedly burst into space arena. The country did not “exchange” for a gradual exit into space, but immediately “went with the trump cards”: landing on the far side of the Moon, returning to Earth with soil, it…", "url": "https://thetimeshub.in/china-wants-to-bring-martian-soil-this-decade", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2021/11/kitaj-hochet-privezti-marsianskuju-pochvu-v-etom-desjatiletii-10e9974.jpg", "publishedAt": "2021-11-05T11:30:05Z", "content": "The cute Chinese rover Zhurong/OCG NEWS \r\n China unexpectedly burst into space arena. The country did not “exchange” for a gradual exit into space, but immediately “went with the trump cards”: landin… [+2652 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "This fish loses 20 teeth each day, then grows them all back - The Indian Express", "description": "The researchers also found that, much like in humans, tooth replacement in lingcod is predetermined, which means teeth are replaced by teeth of the same type and teeth don’t grow bigger over time.", "url": "https://indianexpress.com/article/technology/science/fish-loses-20-teeth-each-day-grows-back-7608231/", "urlToImage": "https://images.indianexpress.com/2021/11/rspb20211436f03.jpg", "publishedAt": "2021-11-05T07:58:49Z", "content": "If there is one place you dont want to stick your finger, its the mouth of a Pacific lingcod. These fearsome fish, which can grow up to 5 feet in length and weigh 80 pounds, have around 500 needlelik… [+4433 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "New Curtin Study Points to Likely Home of Martian Meteorites - Space Bollyinside - BollyInside", "description": "About 166 Martian rocks have landed on Earth over the past 20 million years, however their precise origins on Mars were unknown. Lead researcher Dr", "url": "https://www.bollyinside.com/news/new-curtin-study-points-to-likely-home-of-martian-meteorites", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/10/Amazon-wants-to-turn-your-cell-phone-into-a-satellite.png", "publishedAt": "2021-11-05T04:40:36Z", "content": "About 166 Martian rocks have landed on Earth over the past 20 million years, however their precise origins on Mars were unknown. Lead researcher Dr Anthony Lagain, from Curtin Universitys Space Scien… [+2932 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "South Taurid Meteors Expected To Be Seen Early Friday Morning - CBS New York", "description": "The South Taurid meteors are expected to shoot across the sky early Friday morning.", "url": "https://www.youtube.com/watch?v=7Ajk7yygfeg", "urlToImage": "https://i.ytimg.com/vi/7Ajk7yygfeg/hqdefault.jpg", "publishedAt": "2021-11-04T22:10:46Z", "content": null}]}