{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Technosports.co.in"}, "author": null, "title": "Boston Dynamic's 'Spot' becomes a helping hand of Chernobyl - TechnoSports", "description": "In several places like the Chernobyl Reactor 4, where a human being doesn’t want to go. In 1986, the reactor suffered a catastrophic meltdown. Now, it is covered up in every possible way to keep its nuclear core contained. But in the end, the nuclear material…", "url": "https://technosports.co.in/2020/11/30/boston-dynamics-spot-becomes-a-helping-hand-of-chernobyl/", "urlToImage": "https://i2.wp.com/technosports.co.in/wp-content/uploads/2020/11/spot.jpg?fit=1100%2C585&ssl=1", "publishedAt": "2020-11-30T17:14:00Z", "content": "In several places like the Chernobyl Reactor 4, where a human being doesnt want to go. In 1986, the reactor suffered a catastrophic meltdown. Now, it is covered up in every possible way to keep its n… [+2197 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "Fast-moving gas flowing away from young star’s asteroid belt may be caused by icy comet vaporisation - India Education Diary", "description": "Astronomers have detected fast-moving carbon monoxide gas flowing away from a young, low-mass star: a unique stage of planetary system evolution which may provide insight into how our own solar sys…", "url": "https://indiaeducationdiary.in/fast-moving-gas-flowing-away-from-young-stars-asteroid-belt-may-be-caused-by-icy-comet-vaporisation/", "urlToImage": "https://i1.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/11/nolupcrop.jpg?fit=885%2C432&ssl=1", "publishedAt": "2020-11-30T16:03:00Z", "content": "Astronomers have detected fast-moving carbon monoxide gas flowing away from a young, low-mass star: a unique stage of planetary system evolution which may provide insight into how our own solar syste… [+5482 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Alphabet’s DeepMind achieves historic new milestone in AI-based protein structure prediction - TechCrunch", "description": "DeepMind, the AI technology company that’s part of Google parent Alphabet, has achieved a significant breakthrough in AI-based protein structure prediction. The company announced today that its AlphaFold system has officially solved a protein folding grand ch…", "url": "http://techcrunch.com/2020/11/30/alphabets-deepmind-achieves-historic-new-milestone-in-ai-based-protein-structure-prediction/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1279331936.jpg?w=730", "publishedAt": "2020-11-30T15:30:24Z", "content": "DeepMind, the AI technology company that’s part of Google parent Alphabet, has achieved a significant breakthrough in AI-based protein structure prediction. The company announced today that its Alpha… [+2554 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Bhavya Sukheja", "title": "European Space Agency to send giant ‘claw’ into orbit to clean up space clutter - Republic World", "description": "To clear out the space clutter, the ESA has come up with a plan: A space claw, which will grip defunct satellites and steer them back into Earth's atmosphere.", "url": "https://www.republicworld.com/technology-news/science/european-space-agency-to-send-giant-claw-into-orbit-to-clean-up-space-clutter.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/vfksvlmq3b5mfaao_1606745191.jpeg?tr=f-jpeg", "publishedAt": "2020-11-30T14:30:00Z", "content": "There are around 2,800 live satellites currently orbiting the Earth and space clutter is believed to be a hindrance in effective space exploration. Scientists have estimated that almost 3,000 dead sa… [+3073 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "Nitrino proves that our sun is going through another type of fission in its core. - Sprout Wired", "description": "Like all stars, our sun is powered by fission in the heavy elements of hydrogen. Atomic fission is not only what makes stars shine, it is also a major", "url": "https://www.sproutwired.com/nitrino-proves-that-our-sun-is-going-through-another-type-of-fission-in-its-core/", "urlToImage": "https://news.google.com/images/2020-11/SunsNeutrinosEnergyLevels02.jpg", "publishedAt": "2020-11-30T14:20:59Z", "content": "Like all stars, our sun is powered by fission in the heavy elements of hydrogen. Atomic fission is not only what makes stars shine, it is also a major source of the chemicals that make up the world a… [+3152 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Don't panic, but we're 2,000 light years closer to the Milky Way's central black hole than we thought - SYFY WIRE", "description": "A compilation of old and new observations out of Japan has revised a couple of important physical measurements of the Sun in the galaxy: According to the results, the Sun is orbiting the galactic center a bit faster and, more interestingly, is closer to the g…", "url": "https://www.syfy.com/syfywire/dont-panic-but-were-2000-light-years-closer-to-the-milky-ways-central-black-hole-than-we", "urlToImage": "https://fastly.syfy.com/sites/syfy/files/styles/1200x680/public/milkyway_youarehere.jpg?offset-x=0", "publishedAt": "2020-11-30T14:00:00Z", "content": "A compilation of old and new observations out of Japan has revised a couple of important physical measurements of the Sun in the galaxy: According to the results, the Sun is orbiting the galactic cen… [+5307 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Chang'e-5's lander-ascender and return vehicle successfully separated - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-11-30/Chang-e-5-s-lander-ascender-and-return-vehicle-successfully-separates-VQriKE5Qsg/index.html", "urlToImage": "https://video.cgtn.com/news/2020-11-30/Chang-e-5-s-lander-ascender-and-return-vehicle-successfully-separates-VQriKE5Qsg/video/ec350e8693da43059ed8d853834db48e/ec350e8693da43059ed8d853834db48e-750.png", "publishedAt": "2020-11-30T13:41:15Z", "content": "Chang'e-5's lander-ascender combination and the orbiter-sample return vehicle combination of the probe have successfully separated in preparation for landing on the moon.\r\nAll the systems are in good… [+179 chars]"}, {"source": {"id": null, "name": "Mccourier.com"}, "author": "mccadmin", "title": "A meteor crosses the skies of Japan and disintegrates (video) - The Courier", "description": "On the night of November 28th to 29th, smartphones and cameras of the Japanese public broadcaster NHK filmed images of a meteor entering the stratosphere over Japan. Spectacular! eye-catching imagesAc", "url": "https://www.mccourier.com/a-meteor-crosses-the-skies-of-japan-and-disintegrates-video/", "urlToImage": "https://www.mccourier.com/wp-content/uploads/2020/11/hitek_2c12ce7396ea41d73e67a0f0215e66c7_1606742879-780x470.jpeg", "publishedAt": "2020-11-30T13:38:00Z", "content": "On the night of November 28th to 29th, smartphones and cameras of the Japanese public broadcaster NHK filmed images of a meteor entering the stratosphere over Japan. Spectacular!\r\neye-catching images… [+596 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "By Jackson Barron For Daily Mail Australia", "title": "Diver fights off hammerhead shark with a GoPro after the predator lunged at him on Queensland reef - Daily Mail", "description": "Dion Creek captured incredible footage of the six-foot long shark lunging at him at Magpie Reef in Princess Charlotte Bay on the Cape York Peninsula on Thursday.", "url": "https://www.dailymail.co.uk/news/article-9001001/Diver-fights-hammerhead-shark-GoPro-predator-lunged-Queensland-reef.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/11/30/13/36261140-0-image-a-5_1606741335840.jpg", "publishedAt": "2020-11-30T13:05:00Z", "content": "A spear fisherman has captured the horrifying moment a hammerhead shark charged at him while diving off the coast of far north Queensland.\r\nDion Creek captured incredible footage of the six-foot long… [+2000 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "This British Astronaut Thought He Saw Aliens. But They were Crsytallised Urine Droplets - News18", "description": "British astronaut Tim Peake recalled the time he thought he spotted a UFO in space during his time aboard the ISS in the recent episode of The Graham Norton Show.", "url": "https://www.news18.com/news/buzz/this-british-astronaut-thought-he-saw-aliens-but-they-were-crsytallised-urine-droplets-3131228.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1606741105_untitled-design-4.jpg", "publishedAt": "2020-11-30T12:59:45Z", "content": "Some of the Sci-Fi space exploration movies have explored the idea of aliens. But maybe none of it could prepare an actual astronaut to face a potential Unidentified Flying Object when in space.\r\nBri… [+1737 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers discover solid phosphorus from a comet - Phys.org", "description": "An international study led from the University of Turku, Finland, discovered phosphorus and fluorine in solid dust particles collected from a comet. The finding indicates that all the most important elements necessary for life may have been delivered to the E…", "url": "https://phys.org/news/2020-11-solid-phosphorus-comet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/comet.jpg", "publishedAt": "2020-11-30T12:49:44Z", "content": "An international study led from the University of Turku, Finland, discovered phosphorus and fluorine in solid dust particles collected from a comet. The finding indicates that all the most important … [+2704 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chris Ciaccia", "title": "Can ET see us? Some planets beyond solar system can view Earth, researchers find - Fox News", "description": "More than 4,500 exoplanets have been discovered so far, with only a small portion thought to have the properties to contain life. A new study suggests that some of those planets and any extraterrestrial life that lives on them can see us too.", "url": "https://www.foxnews.com/science/planets-beyond-solar-system-can-view-earth", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/toi-700-d-2.jpg", "publishedAt": "2020-11-30T12:21:28Z", "content": "More than 4,500 exoplanets have been discovered so far, with only a small portion thought to have the properties to contain life. A new study suggests that some of those planets and any extraterrestr… [+3142 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "How 20 years on space station benefit people on Earth - The Rahnuma Daily", "description": "Washington, Nov 3 (IANS) Technologies developed for and aboard the International Space Station have benefited people on the ground, from improving workouts to helping us get a good night’s sleep, NASA said as the orbiting laboratory marked 20 years of continu…", "url": "https://www.therahnuma.com/how-20-years-on-space-station-benefit-people-on-earth/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2020/02/db0e37919a83f1d850a60a57851f3cc9.jpg", "publishedAt": "2020-11-30T12:20:11Z", "content": "Astronaut Christina Koch who created a new female record by spending 328 days in space is back on Earth.\r\nWashington, Nov 3 (IANS) Technologies developed for and aboard the International Space Statio… [+3220 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Losing Arecibo's giant dish leaves humans more vulnerable to space rocks, scientists say - Space.com", "description": "Arecibo was a cornerstone in the campaign to protect Earth from asteroids.", "url": "https://www.space.com/arecibo-observatory-loss-for-planetary-defense-asteroids", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dNSf9Qzjige2oK97uXbkZB-1200-80.jpg", "publishedAt": "2020-11-30T12:13:00Z", "content": "Ignorance may feel like bliss, but preparedness offers better odds of surviving what is to come. And when it comes to planetary defense\r\n, ignorance just became a bit more inevitable.\r\nPlanetary defe… [+8137 chars]"}, {"source": {"id": null, "name": "Jane's"}, "author": null, "title": "Japan launches first optical data-relay satellite - Jane's", "description": "Japan has launched an H-2A (also spelled H-IIA) rocket carrying its first optical data-relay satellite designed to transmit data collected by reconnaissance satellites...", "url": "https://www.janes.com/defence-news/news-detail/japan-launches-first-optical-data-relay-satellite", "urlToImage": null, "publishedAt": "2020-11-30T12:03:10Z", "content": "30 November 2020\r\nby Kosuke Takahashi\r\nJapan has launched an H-2A (also spelled H-IIA) rocket carrying its first optical data-relay satellite designed to transmit data collected by reconnaissance sat… [+1536 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Japanese Spacecraft Carrying Asteroid Soil Samples Set for Return to Earth after Year of Travel - News18", "description": "The Hayabusa2 spacecraft left the asteroid Ryugu a year ago and is expected to reach Earth and drop a capsule containing the precious samples in Australia on December 6.", "url": "https://www.news18.com/news/buzz/japanese-spacecraft-carrying-asteroid-soil-samples-set-for-return-to-earth-after-year-of-travel-3131063.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/10/1603972767_untitled-design-2020-10-29t172805.190.png", "publishedAt": "2020-11-30T11:39:00Z", "content": "A Japanese spacecraft is nearing Earth after a yearlong journey home from a distant asteroid with soil samples and data that could provide clues to the origins of the solar system, a space agency off… [+3072 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Kelly-Ann Mills", "title": "Hermes sack delivery driver after he's spotted 'stealing parcel' on neighbour's CCTV - Mirror Online", "description": "The customer was expecting to receive a £50 parcel from Sports Direct, but despite a photo of it at their door, it never arrived at the home in Four Marks, Hampshire", "url": "https://www.mirror.co.uk/news/uk-news/hermes-sack-delivery-driver-after-23091001", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23091045.ece/ALTERNATES/s1200/0_PAY-suspicious_delivery_DN02JPG.jpg", "publishedAt": "2020-11-30T11:24:00Z", "content": "A delivery driver has been sacked and accused of theft after a video emerged appearing to show him taking a photo of a parcel outside a home before returning the item back to his van.\r\nThe bizarre in… [+2441 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Hackers can dupe DNA scientists into creating deadly viruses - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=776727", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2020-11-30T11:20:27Z", "content": "New Delhi, Nov 30 (IANS): In what may put the future potential Covid vaccine development at risk, researchers have spotted a new form of biohacking that can dupe DNA scientists into unknowingly creat… [+2685 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Roscosmos claims an ISRO satellite made dangerous pass of a Russian satellite - Firstpost", "description": "The incident has drawn focus to the increasing traffic in outer space, particularly in low-Earth orbit.", "url": "https://www.firstpost.com/tech/science/roscosmos-claims-an-isro-satellite-made-dangerous-pass-of-a-russian-satellite-9066831.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/06/space-debris.jpg", "publishedAt": "2020-11-30T10:20:47Z", "content": "FP TrendingNov 30, 2020 15:50:47 IST\r\nThe Russian space agency has said that a satellite sent into space by the Indian Space Research Organisation (ISRO) recently had a close pass-by with a Roscosmos… [+1928 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Launch of Soyuz rocket rescheduled due to bad weather - The Tribune", "description": "", "url": "https://www.tribuneindia.com/news/schools/launch-of-soyuz-rocket-rescheduled-due-to-bad-weather-178005", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/11/2020_11$largeimg_2078137436.jpg", "publishedAt": "2020-11-30T10:18:00Z", "content": "Moscow, November 30 \r\nThe launch of a Russian Soyuz-ST-A rocket with Falcon Eye 2 satellite for the United Arab Emirates (UAE) has ben postponed until December 1 due to bad weather, Director General … [+909 chars]"}, {"source": {"id": null, "name": "Factorymaintenance.com.au"}, "author": null, "title": "European Vega missile suffers key promotion failure, satellites for France and Spain lost - Factory Maintenance", "description": null, "url": "https://factorymaintenance.com.au/space/151/european-vega-missile-suffers-key-promotion-failure-satellites-for-france-and-spain-lost/", "urlToImage": null, "publishedAt": "2020-11-30T10:05:00Z", "content": "A Vega rocket lamented a major upheaval shortly after takeoff on November 16, which was on Monday, underwriting satellites’ damage from France and Spain. The four-stage Vega missile upstretched off a… [+2319 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Fossil Remains of Peculiar Bird With Large Bill Provide Glimpse of Avian Diversity in Dinosaur Era | The Weather Channel - Articles from The Weather Channel | weather.com - weather.com", "description": "Moreover, the fossils not only offer a glimpse on the wide diversity of birds which lived in that era but also provide interesting insights on how the face and beak of various bird species evolved over time. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2020-11-30-fossil-remains-of-bird-provide-glimpse-of-avian-diversity", "urlToImage": "https://s.w-x.co/in-bird_0.jpg", "publishedAt": "2020-11-30T09:49:14Z", "content": "When we think of the age of reptilesbetween 250 million and 65 million years agolarge dinosaurs come to our minds. However, the period, formally known as the Mesozoic era, also hosted hundreds of var… [+4261 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": null, "title": "Experimental proof of liquid–liquid transition in supercooled water - Chemistry World", "description": "Diffraction measurements taken whilst laser heating pressurised water from an exotic frozen state", "url": "https://www.chemistryworld.com/news/experimental-proof-of-liquid-liquid-transition-in-supercooled-water/4012820.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/8/4/7/509847_gettyimages161332800_711511.jpg", "publishedAt": "2020-11-30T09:18:35Z", "content": "Some theoretical chemists believe many of liquid waters unusual properties, such as its decrease in density on freezing and its decrease in viscosity on compression, can be explained if, under ambien… [+2634 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lunar Eclipse 2020: Chandra Grahan And Kartik Purnima Date, Time, Why Do People Fast On This Day? - NDTV Food", "description": "Chandra Grahan 2020: The November lunar eclipse, also known as the Chandra Grahan, will coincide with one of the biggest Hindu festival Kartik Purnima.", "url": "https://food.ndtv.com/food-drinks/lunar-eclipse-2020-chandra-grahan-date-time-on-kartik-purnima-why-do-people-fast-on-this-day-2330949", "urlToImage": "https://c.ndtvimg.com/6tnqcj4o_lunar-eclipse-chandra-grahan_625x300_27_July_18.jpg", "publishedAt": "2020-11-30T07:53:42Z", "content": "The last lunar eclipse of the year is all set to take place today. on 30th November 2020, Monday. The lunar eclipse, also known as the Chandra Grahan, will coincide with one of the biggest Hindu fest… [+2480 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "NASA astronaut shares a video of the Earth while trav..ing to the ISS on SpaceX's Crew Dragon, it goes viral - Firstpost", "description": "", "url": "https://www.firstpost.com/tech/science/nasa-astronaut-shares-a-video-of-the-earth-while-travelling-to-the-iss-on-spacexs-crew-dragon-it-goes-viral-9066251.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/05/Earth__Mir_STS-71.jpg", "publishedAt": "2020-11-30T07:43:46Z", "content": "FP TrendingNov 30, 2020 13:13:46 IST\r\nVictor Glover, a NASA astronaut who was recently launched to the International Space Station on SpaceX's Crew Dragon Crew-1 mission. shared his first video of th… [+2136 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Michael Steiner | The Conversation", "title": "How coronavirus changed the way we support people with respiratory disease - Business Standard", "description": "With clinical opinion changing so quickly, it's worth reflecting on how and why this has happened - particularly as the scientific evidence to back up this change is lagging behind clinical practice", "url": "https://www.business-standard.com/article/current-affairs/how-coronavirus-changed-the-way-we-support-people-with-respiratory-disease-120113000309_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-11/04/full/1604472136-9303.jpg", "publishedAt": "2020-11-30T06:13:00Z", "content": "As the second wave of the coronavirus pandemic hits hospitals, the hiss and bubble of advanced respiratory support is an increasingly familiar sound on medical wards. This is because some patients wh… [+6099 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Why the ‘Burj Khalifa-sized’ asteroid approaching Earth isn’t a threat - The Indian Express", "description": "In reality, a civilisation-threatening risk from space objects is extremely rare – occurring once every few million years, according to NASA.", "url": "https://indianexpress.com/article/explained/explained-why-the-burj-khalifa-sized-asteroid-approaching-earth-is-not-a-threat-7071001/", "urlToImage": "https://images.indianexpress.com/2020/08/asteroid.jpg", "publishedAt": "2020-11-30T05:32:14Z", "content": "By: Explained Desk | New Delhi | \r\nUpdated: November 30, 2020 11:32:14 am\r\nAsteroids the size of 1 km or more in diameter, capable of causing catastrophic worldwide effects, are extremely rare, impac… [+5080 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": null, "title": "Swarna Jayanti Fellow Dr Basudeb Gupta’s study could help understand how neutrinos play a role in star explosions - India Education Diary", "description": "New  Delhi:    Scientists may soon find a clue to how stars explode due to neutrinos, one of the most abundant particles in the universe. These sub atomic particles are extremely difficult to detec…", "url": "https://indiaeducationdiary.in/swarna-jayanti-fellow-dr-basudeb-guptas-study-could-help-understand-how-neutrinos-play-a-role-in-star-explosions/", "urlToImage": "https://i1.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/11/En_c1QGVcAAXe2v.png?fit=383%2C292&ssl=1", "publishedAt": "2020-11-30T05:29:00Z", "content": "New  Delhi:    Scientists may soon find a clue to how stars explode due to neutrinos, one of the most abundant particles in the universe.\r\nThese sub atomic particles are extremely difficult to detect… [+2425 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Chandra Grahan: When, where to watch the fourth, final lunar eclipse of 2020 on 30 Nov - Firstpost", "description": "The Chandra Grahan is expected to begin around 1.02 pm IST and will be at its peak at 3.12 pm IST. The celestial event will end at 5.23 pm IST.", "url": "https://www.firstpost.com/tech/science/lunar-eclipse-2020-when-and-where-to-watch-the-fourth-and-final-chandra-grahan-today-9054011.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/Penumbral-eclipse.jpg", "publishedAt": "2020-11-30T04:31:10Z", "content": "FP TrendingNov 30, 2020 10:08:59 IST\r\nThe last lunar eclipse or Chandra Grahan of the year 2020 will occur on 30 November. This will be the fourth lunar eclipse of the year and will be a penumbral lu… [+2139 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": null, "title": "Mitochondrial Changes Key to Health Problems in Space - Astrobiology News", "description": null, "url": "http://astrobiology.com/2020/11/mitochondrial-changes-key-to-health-problems-in-space.html", "urlToImage": null, "publishedAt": "2020-11-30T03:26:00Z", "content": "Living in space isn't easy. There are notable impacts on the biology of living things in the harsh environment of space. \r\nA team of scientists has now identified a possible underlying driver of thes… [+3638 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "ANI", "title": "British engineers develop process to turn moon dust into oxygen - Free Press Journal", "description": "British engineers are fine-tuning a process that will be used to extract oxygen from lunar dust, leaving behind metal powders that could be 3D printed into construction materials for a Moon base.", "url": "https://www.freepressjournal.in/science/british-engineers-develop-process-to-turn-moon-dust-into-oxygen", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2020-11%2F7913d4c4-0323-4c47-9f5d-ce982fd5507c%2Fmoon.jpg?rect=0%2C0%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-11-29T15:11:00Z", "content": "Washington: British engineers are fine-tuning a process that will be used to extract oxygen from lunar dust, leaving behind metal powders that could be 3D printed into construction materials for a Mo… [+2785 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "NASA certifies SpaceX Crew Dragon to carry astronauts - The Rahnuma Daily", "description": "Washington, Nov 11 (IANS) After years of design, development, and testing NASA has finally certified SpaceX to carry astronauts to and from the International Space Station (ISS) on its Crew Dragon spaceship. The Crew Dragon, including the Falcon 9 rocket and …", "url": "https://www.therahnuma.com/nasa-certifies-spacex-crew-dragon-to-carry-astronauts/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2020/05/8098f5815e289d675bf85988075c1ea4.jpg", "publishedAt": "2020-11-29T14:35:56Z", "content": "NASA astronauts Robert Behnken (right) and Douglas Hurley at NASAâ\u0080\u0099s Kennedy Space Center in Florida on May 23 as they prepare to be transported to Launch Complex 39A during a full dress rehearsal a… [+2294 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "SpaceX launches satellite for NASA and ESA to monitor rising sea levels - SatelliteProME.com", "description": "Sentinel-6 Michael Freilich will now undergo a series of exhaustive checks and calibrations before it starts collecting science data in a few months' time.", "url": "https://satelliteprome.com/news/spacex-launches-satellite-for-nasa-and-esa-to-monitor-rising-sea-levels/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2020/11/NASa.jpg", "publishedAt": "2020-11-29T13:43:51Z", "content": "Sentinel-6 Michael Freilich will now undergo a series of exhaustive checks and calibrations before it starts collecting science data in a few months' time.\r\nSpaceX has launched a satellite for NASA a… [+1993 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Aanchal Nigam", "title": "NASA celebrates Black Friday by recalling basics of supermassive Black Hole - Republic World", "description": "National Aeronautics and Space Administration (NASA) joined ‘Black Friday’ celebrations along with rest of the world by talking about ‘Basics of Black Hole’.", "url": "https://www.republicworld.com/technology-news/science/nasa-celebrates-black-friday-by-recalling-basics-of-supermassive-black-hole.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/8rlkxhngy7wxhlpw_1606654413.jpeg?tr=f-jpeg", "publishedAt": "2020-11-29T13:22:00Z", "content": "The National Aeronautics and Space Administration (NASA) also joined ‘Black Friday’ celebrations on November 27 along with many parts of the world by talking about ‘Basics of Black Hole’. While for t… [+2307 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Cyprus becomes a rocky testing ground for space equipment - HT Tech", "description": "Planetologists and geologists arrived in Cyprus earlier this month to test out the equipment in the Troodos mountains, which officials say has geological similarities with Mars.", "url": "https://tech.hindustantimes.com/tech/news/cyprus-becomes-a-rocky-testing-ground-for-space-equipment-71606648017283.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2020/11/29/600x338/bgrpic-copy-10_1605595647933_1606648192841.jpg", "publishedAt": "2020-11-29T11:06:56Z", "content": "International and Cypriot experts on Friday discussed a research project to test space equipment on the Mediterranean island before sending it to Mars to measure the age of its rocks, officials said.… [+1625 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "\"Post News Network\"", "title": "After 400 years, Jupiter and Saturn to converge in rare celestial event; read more - OrissaPOST", "description": "Bhubaneswar: For the first time since 1623, a rare celestial phenomenon is going to take place in our solar system. It is the great conjunction, or in common language meetings of two biggest planets in our solar system. Jupiter and ringed planet Saturn are co…", "url": "https://www.orissapost.com/after-400-years-jupiter-and-saturn-to-converge-in-rare-celestial-event-read-more/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2020/11/After-400-years-Jupiter-and-Saturn-to-converge-in-rare-celestial-event-read-more.jpg", "publishedAt": "2020-11-29T10:37:00Z", "content": "Bhubaneswar: For the first time since 1623, a rare celestial phenomenon is going to take place in our solar system.\r\nIt is the great conjunction, or in common language meetings of two biggest planets… [+1116 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Burj Khalifa sized asteroid to zoom past Earth on Sunday, here's all you need to know - DNA India", "description": "Nasa's Jet Propulsion Laboratory has classified it as a 'Potentially Hazardous Asteroid' due to its predicted close pass with Earth.", "url": "https://www.dnaindia.com/science/news-nasa-burj-khalifa-sized-potentially-hazardous-asteroid-zoom-past-earth-celestial-object-2859088", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/11/29/940358-asteriod.jpg", "publishedAt": "2020-11-29T05:51:00Z", "content": null}, {"source": {"id": null, "name": "National Herald"}, "author": "Sankar Ray/IPA", "title": "Kolkata physicist who inspired the 2020 Physics Nobel laureate - National Herald", "description": "Sir Roger Penrose’s muse was Dr Amal Raychaudhuri, whose paper, known for the ‘Raychaudhuri Equation’ developed the mathematical formulation that helped him prove that black holes really can form", "url": "https://www.nationalheraldindia.com/india/kolkata-physicist-who-inspired-the-2020-physics-nobel-laureate", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-10%2F91f2998d-4580-49e7-a5c9-2fdf7c696d0f%2FUntitled_design__2_.jpg?rect=0%2C92%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-29T05:45:00Z", "content": "Kolkata is in a rare radiance as the Royal Swedish Academy of Sciences has awarded half of the Nobel Prize in Physics for 2020 to Sir Roger Penrose, emeritus professor at the Mathematical Institute, … [+1013 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "NASA to pay you Rs 26 lakh for designing a space toilet for Moon - National Herald", "description": "NASA is preparing for return to the Moon and innumerable activities to equip, shelter, and otherwise support future astronauts are underway", "url": "https://www.nationalheraldindia.com/science-and-tech/nasa-to-pay-you-rs-26-lakh-for-designing-a-space-toilet-for-moon", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-06%2F2217ff47-26ba-4626-ac28-6211e5a8ce20%2Fnasa.jpg?rect=0%2C0%2C1920%2C1008&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-29T05:45:00Z", "content": "\"Although space toilets already exist and are in use (at the International Space Station, for example), they are designed for microgravity only,\" the US space agency said in a statement.\r\nNASA's Huma… [+283 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Why the far side of the Moon so different from near side - National Herald", "description": "The composition of the Moon’s near side that is perpetually Earth-facing is oddly different from its far side which always faces away from Earth and scientists think they finally understand why", "url": "https://www.nationalheraldindia.com/science-tech/why-the-far-side-of-the-moon-so-different-from-near-side", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-06%2Fa5818fe4-ee1b-4ffd-b746-7ef7adc126c9%2FMoon_2.jpg?rect=0%2C0%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-29T05:45:00Z", "content": "But why volcanism and this KREEP signature should be distributed so unevenly between the near and far sides of the Moon again presented a puzzle.\r\nNow, using a combination of observation, laboratory … [+893 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Hubble telescope finds mysterious black hole disc - National Herald", "description": "Using NASA’s Hubble Space Telescope, astronomers have discovered a disc very close to a starving black hole - something that should not be there - based on current astronomical theories", "url": "https://www.nationalheraldindia.com/science-and-tech/hubble-telescope-finds-mysterious-black-hole-disc", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2019-07%2Fd9fc7fa9-f735-4095-9f7c-82c5201309db%2F645c6308ad52dea5af2fd6b67d5733cd.jpg?rect=0%2C20%2C985%2C517&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-29T05:45:00Z", "content": "\"This is an intriguing peek at a disc very close to a black hole, so close that the velocities and the intensity of the gravitational pull are affecting how we see the photons of light,\" explained th… [+495 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "NASA spacecraft makes 1st touchdown on asteroid Bennu - National Herald", "description": "After over a decade of planning, a NASA spacecraft made history after it successfully touched an asteroid to collect dust and pebbles from its surface", "url": "https://www.nationalheraldindia.com/science-and-tech/nasa-spacecraft-makes-1st-touchdown-on-asteroid-bennu", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-10%2F3d8320b1-03f1-4b2a-9589-c95c971d1cd5%2FNASA.jpg?rect=31%2C0%2C954%2C501&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-29T05:45:00Z", "content": "At 1.50 p.m. EDT, OSIRIS-REx fired its thrusters to nudge itself out of orbit around Bennu. It extended the shoulder, then elbow, then wrist of its 3.35-metre sampling arm, known as the Touch-And-Go … [+941 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Voice of British science fights for future of UK research - Financial Times", "description": "Nobel Prize winner Venki Ramakrishnan was focused on Brexit’s impact on the sector, and then Covid-19 hit", "url": "https://www.ft.com/content/dcc54f4e-9ace-41e5-8a0e-51a65abe3396", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc3b93f5c-b329-4ae6-b54e-6424a50b7ae5.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2020-11-29T05:00:00Z", "content": "Venki Ramakrishnan reacted with incredulity to the two most momentous phone calls of his working life. In October 2009, he refused for several minutes to believe that his caller really was the secret… [+8298 chars]"}, {"source": {"id": null, "name": "Best gaming pro"}, "author": "Dinu das", "title": "Scientists propose new way of ordering the elements – Bestgamingpro - Best gaming pro", "description": null, "url": "https://bestgamingpro.com/scientists-propose-new-way-of-ordering-the-elements/", "urlToImage": null, "publishedAt": "2020-11-29T04:00:00Z", "content": "The periodic table of the elements, principally created by the Russian chemist, Dmitry Mendeleev (1834-1907), celebrated its 150th anniversary last year. It would be hard to overstate its importance … [+6297 chars]"}, {"source": {"id": null, "name": "Haveeru.com.mv"}, "author": "Max Grant", "title": "Earth is 2,000 light-years closer to the Milky Way galaxy than previously thought - haveeruonline", "description": "New map of the Milky Way created National Astronomical Laboratory of Japan Shows that the Earth rotates faster and is 2,000 light-years closer to the", "url": "https://www.haveeru.com.mv/earth-is-2000-light-years-closer-to-the-milky-way-galaxy-than-previously-thought/", "urlToImage": null, "publishedAt": "2020-11-29T03:56:21Z", "content": "New map of the Milky Way created National Astronomical Laboratory of Japan Shows that the Earth rotates faster and is 2,000 light-years closer to the miraculous black hole at the center of our galaxy… [+2324 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "NASA's Hubble Spots Galaxy Being Stripped Of Dark Matter - Forbes", "description": "For first time ever, Hubble observations reveal a massive galaxy actually in the latter stages of being stripped of its dark matter, say researchers.", "url": "https://www.forbes.com/sites/brucedorminey/2020/11/28/nasas-hubble-spots-galaxy-being-stripped-of-dark-matter/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5fc2ec6807eec43cef075718%2F0x0.jpg", "publishedAt": "2020-11-29T00:50:39Z", "content": "The region around the galaxy NGC 1052-DF4, taken by the IAC80 telescope at the Teide Observatory in ... [+] Tenerife, Spain. The main galaxies in the field of view, include NGC 1052-DF4 (center of th… [+4371 chars]"}, {"source": {"id": null, "name": "Rocketstem.org"}, "author": "Facebook", "title": "Special Topic: Sample Retrieval Missions - RocketSTEM", "description": "There have been four launched space mission with the intent of collecting and returning samples from the solar system’s “small bodies.”", "url": "https://www.rocketstem.org/2020/11/28/ice-and-stone-special-topic-49/", "urlToImage": "https://rocketstem.b-cdn.net/wp-content/uploads/2020/11/bennuasteroid.jpg", "publishedAt": "2020-11-29T00:00:00Z", "content": "The asteroid (101955) Bennu, imaged by OSIRIS-REx on December 2, 2018. Courtesy NASA.\r\nIn most scientific disciplines, if we want to examine an object closely and in-depth, we can collect some kind o… [+10025 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New COVID-19 Research Provides Deep Insights Into Transmission and Mutation Properties of SARS-CoV-2 - SciTechDaily", "description": "Learning from past SARS-CoV-2 outbreaks for future pandemic control. In the COVID-19 pandemic, 57 million people have already been infected worldwide. In the search for vaccines and therapies, a precise understanding of the virus, its mutations and transmissi…", "url": "https://scitechdaily.com/new-covid-19-research-provides-deep-insights-into-transmission-and-mutation-properties-of-sars-cov-2/", "urlToImage": "https://scitechdaily.com/images/Transmission-Bottleneck-scaled.jpg", "publishedAt": "2020-11-28T23:23:00Z", "content": "Austrian study reveals important characteristics of the virus: The analysis of infection clusters and superspreading events in Austria built the foundation to obtain general information on transmissi… [+6311 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Canada developing lunar rover and science payloads - SpaceNews", "description": "The Canadian Space Agency is moving ahead on efforts to develop lunar science payloads and a small rover that could fly to the moon with NASA.", "url": "https://spacenews.com/canada-developing-lunar-rover-and-science-payloads/", "urlToImage": "https://spacenews.com/wp-content/uploads/2019/02/2019-02-28-2-MTL-AS-32.jpg", "publishedAt": "2020-11-28T23:22:17Z", "content": "WASHINGTON The Canadian Space Agency (CSA) is moving ahead on efforts to develop lunar science payloads and a small rover that could fly to the moon on a NASA-sponsored lander mission.\r\nThe CSA annou… [+3487 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Dame Jocelyn Bell-Burnell: Portrait honour for 'trailblazing' NI scientist - BBC News", "description": "Dame Jocelyn Bell-Burnell takes \"rightful place\" among the world's \"most distinguished scientists\".", "url": "https://www.bbc.com/news/uk-northern-ireland-55115120", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/C2C2/production/_115685894_damejocelyn.jpg", "publishedAt": "2020-11-28T22:57:00Z", "content": "By Eimear FlanaganBBC News NI\r\nimage copyrightStephen Shankland\r\nimage captionA portrait of Dame Jocelyn Bell-Burnell has been unveiled by the Royal Society in London\r\nA leading astrophysicist, who w… [+6339 chars]"}, {"source": {"id": null, "name": "http://www.newsgram.com/"}, "author": null, "title": "Researchers Discover Galaxy Surviving Black Hole’s Hunger - http://www.newsgram.com/", "description": "Researchers have discovered a galaxy that has been managing to survive a black hole's hunger by continuing to birth new stars.", "url": "https://www.newsgram.com/researchers-discover-galaxy-surviving-black-holes-hunger/", "urlToImage": "https://i0.wp.com/www.newsgram.com/wp-content/uploads/2020/11/bade2735c95f340d5106d814646f85d2-1.jpg", "publishedAt": "2020-11-28T21:31:49Z", "content": "Researchers have discovered a galaxy that has been managing to survive a black hole’s hunger by continuing to birth new stars, about 100 Sun-sized stars a year.\r\nThe discovery from NASA’s telescope o… [+2360 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "One of These Pictures Is the Brain, the Other is the Universe. Can You Tell Which is Which? - Universe Today", "description": "“Science is not only compatible with spirituality; it is a profound source of spirituality. When we recognize our place in an immensity of light years and in the passage of ages, when we grasp the intricacy, beauty and subtlety of life, then that soaring feel…", "url": "https://www.universetoday.com/148966/one-of-these-pictures-is-the-brain-the-other-is-the-universe-can-you-tell-which-is-which/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/11/Universe-Brain-3.jpg", "publishedAt": "2020-11-28T21:19:00Z", "content": "Science is not only compatible with spirituality; it is a profound source of spirituality. When we recognize our place in an immensity of light years and in the passage of ages, when we grasp the int… [+10885 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Japan's Hayabusa2 spacecraft carrying asteroid soil samples nears Earth - India Today", "description": "Japan's Hayabusa2 spacecraft left the asteroid Ryugu a year ago and is expected to reach Earth and drop a capsule containing the precious samples in southern Australia on December 6.", "url": "https://www.indiatoday.in/science/story/japan-hayabusa2-spacecraft-asteroid-ryugu-soil-samples-earth-1745018-2020-11-29", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202011/spacejapan-647x363.jpeg?dU3psp6auZGE.etqjDfhpzNuwc37Og4r", "publishedAt": "2020-11-28T20:36:15Z", "content": "A Japanese spacecraft is nearing Earth after a yearlong journey home from a distant asteroid with soil samples and data that could provide clues to the origins of the solar system, a space agency off… [+3370 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Shubashree Desikan", "title": "The Hindu Explains | Would space exploration survive in the era of privatisation? - The Hindu", "description": "Why is NASA’s SpaceX Crew-1 launch significant? What are the other trends in the commercial space sector?", "url": "https://www.thehindu.com/sci-tech/science/the-hindu-explains-would-space-exploration-survive-in-the-era-of-privatisation/article33202818.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/q94uk6/article33202817.ece/ALTERNATES/LANDSCAPE_615/TH28SPACEXCREWLAUNCH", "publishedAt": "2020-11-28T20:15:00Z", "content": "The story so far: Perhaps the most stunning instance of a collaboration between public enterprises and the private sector in recent times is that between NASA and SpaceX. It is stunning because of th… [+4456 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Maria Temming", "title": "Farming on Mars will be a lot harder than ‘The Martian’ made it seem - The Washington Post", "description": "Growing plants in Red Planet soil will require adding nutrients and removing toxic chemicals.", "url": "https://www.washingtonpost.com/science/mars-growing-food/2020/11/27/cdc80e8a-2dc0-11eb-bae0-50bb17126614_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F6JJYIBOZII6XHOWFUAXTGAXDE.jpg&w=1440", "publishedAt": "2020-11-28T20:00:00Z", "content": "Researchers planted lettuce and the weed Arabidopsis thaliana in three kinds of fake Mars dirt. Two were made from materials mined in Hawaii or the Mojave Desert that look like dirt on Mars. To mimic… [+4826 chars]"}, {"source": {"id": null, "name": "http://www.newsgram.com/"}, "author": null, "title": "Russia Working on Development of Own Space Station - http://www.newsgram.com/", "description": "Energia, the rocket and space corporation of Russia, has announced that it was working on the development of a new homegrown multi-functional space station.", "url": "https://www.newsgram.com/russia-working-on-development-of-own-space-station/", "urlToImage": "https://i0.wp.com/www.newsgram.com/wp-content/uploads/2020/11/f4bf5474c35e1143c4482cc0d1100ed9-1.jpg", "publishedAt": "2020-11-28T19:29:52Z", "content": "Energia, Russia’s rocket and space corporation, has announced that it was working on the development of a new homegrown multi-functional space station.\r\nRussia’s own orbital station will consist of t… [+1376 chars]"}, {"source": {"id": null, "name": "Timebulletin.com"}, "author": "Raeesa Sayyad", "title": "Watch SpaceX’s Falcon 9 Starlink satellite launch tonight - Time Bulletin", "description": "SpaceX intends to launch the 16th batch of its Starlink broadband satellites on Monday, a day after Elon Musk's rocket organization effectively sent a new NASA and European Space Agency satellite to orbit. Boosting a new group of its orbiting routers has gott…", "url": "https://www.timebulletin.com/watch-spacexs-falcon-9-starlink-satellite-launch-tonight/", "urlToImage": "https://www.timebulletin.com/wp-content/uploads/2020/11/Watch-SpaceXs-Falcon-9-Starlink-satellite-launch-tonight.jpg", "publishedAt": "2020-11-28T19:22:56Z", "content": "SpaceX intends to launch the 16th batch of its Starlink broadband satellites on Monday, a day after Elon Musk’s rocket organization effectively sent a new NASA and European Space Agency satellite to … [+1295 chars]"}, {"source": {"id": null, "name": "Brumpost.com"}, "author": "Lisa Irène", "title": "Scientist finally detects neutrinos from star fusion - Brumpost", "description": "The newest report is about a group of Italian National Institute of Nuclear Physics researchers have been able to confirm one of the most important theories", "url": "https://www.brumpost.com/scientist-finally-detects-neutrinos-from-star-fusion/", "urlToImage": "https://www.brumpost.com/wp-content/uploads/2020/11/Scientists-find-neutrinos-1024x512.jpg", "publishedAt": "2020-11-28T19:15:11Z", "content": "The newest report is about a group of Italian National Institute of Nuclear Physics researchers have been able to confirm one of the most important theories in star physics. The researcher were able … [+1496 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "NASA delays SpaceX Crew-1 launch until Sunday - The Rahnuma Daily", "description": "Washington, Nov 14 (IANS) NASA and SpaceX are now targeting Sunday for the launch of the Crew-1 mission to the International Space Station (ISS) due to onshore winds and first stage booster recovery readiness. The Crew-1 flight was earlier scheduled to launch…", "url": "https://www.therahnuma.com/nasa-delays-spacex-crew-1-launch-until-sunday/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2019/10/Crew_of_STS-107_official_photo-1024x819.jpg", "publishedAt": "2020-11-28T01:30:41Z", "content": "The STS-107 crew includes, from the left, Mission Specialist David Brown, Commander Rick Husband, Mission Specialists Laurel Clark, Kalpana Chawla and Michael Anderson, Pilot William McCool and Paylo… [+1193 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Russia hails launch of China’s lunar probe - TASS", "description": "Moscow regards the field as very promising for bilateral cooperation, the Russian presidential spokesman said", "url": "https://tass.com/science/1227189", "urlToImage": "https://phototass4.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20201124/1292843.jpg", "publishedAt": "2020-11-24T11:16:54Z", "content": "MOSCOW, November 24. /TASS/. Moscow welcomes China’s achievements in space exploration and regards this field as very promising for bilateral cooperation, Russian presidential spokesman, Dmitry Pesko… [+1115 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Crew Dragon spacecraft with four astronauts aboard docks with ISS - TASS", "description": "The manned spacecraft’s docking with the ISS is performed in an automatic mode", "url": "https://tass.com/science/1224431", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20201117/1291959.jpg", "publishedAt": "2020-11-17T04:53:04Z", "content": "NEW YORK, November 17. /TASS/. The US SpaceX’s Crew Dragon manned spacecraft with four astronauts aboard docked with the International Space Station, according to live broadcast of the National Aeron… [+2114 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Moon mining rush: Russia to draw UN’s attention to US plans to grab lunar resources - TASS", "description": "US President Donald Trump signed an executive order in April, proclaiming Washington’s right to extract various metals and other mineral resources on the Moon, particularly within the late phases of the Artemis lunar program", "url": "https://tass.com/science/1216983", "urlToImage": "https://phototass2.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20201027/1289537.jpg", "publishedAt": "2020-10-27T14:34:50Z", "content": "MOSCOW, October 27. /TASS/. The issue of the US intention to extract mineral resources on the Moon will be discussed at the 75th session of the UN General Assembly at Russia’s request, the State Spac… [+1165 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune News Service", "title": "3 share Nobel Physics Prize for black hole research - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/science%20technology/3-share-nobel-physics-prize-for-black-hole-research-151960", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/10/Desk/2020_10$largeimg_675076899.jpeg", "publishedAt": "2020-10-07T08:31:55Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+465 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "Emissions to add 15 inches to global sea level rise by 2100: NASA-led study - ETEnergyworld.com", "description": "Greenland and Antarctica's ice sheets could together contribute more than 38 centimetres to global sea level rise by 2100, if greenhouse gas emissions continue, according to a study led by NASA.", "url": "https://energy.economictimes.indiatimes.com/news/coal/emissions-to-add-15-inches-to-global-sea-level-rise-by-2100-nasa-led-study/78188608", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-78188608,imgsize-188270,width-800,height-434,overlay-etenergyworld/emissions-to-add-15-inches-to-global-sea-level-rise-by-2100-nasa-led-study.jpg", "publishedAt": "2020-09-18T12:33:20Z", "content": "Greenland and Antarctica's ice sheets could together contribute more than 38 centimetres to global sea level rise by 2100, if greenhouse gas emissions continue, according to a study led by NASA. The … [+2872 chars]"}, {"source": {"id": null, "name": "Prensa Latina"}, "author": "", "title": "India's space mission completes a year orbiting the Moon - Prensa Latina", "description": "New Delhi, Aug 20 (Prensa Latina) India's second space mission to the Moon with the Chandrayaan-2 spacecraft completed on Thursday a year of orbiting the Earth's natural satellite.", "url": "https://www.plenglish.com/index.php?o=rn&id=59052&SEO=indias-space-mission-completes-a-year-orbiting-the-moon", "urlToImage": "http://www.plenglish.com/images/2020/agosto/20/india-Chandrayaan-2.jpg", "publishedAt": "2020-08-20T20:32:05Z", "content": "New Delhi, Aug 20 (Prensa Latina) India's second space mission to the Moon with the Chandrayaan-2 spacecraft completed on Thursday a year of orbiting the Earth's natural satellite.\r\nThe Indian Space … [+994 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "Global warming will lead to river ice cover decline: Study - ETEnergyworld.com", "description": "The annual river ice cover will decline by about six days for every one degree Celsius increase in global temperatures, posing economic and environmental consequences, according to a study", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/global-warming-will-lead-to-river-ice-cover-decline-study/73068132", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-73068132,imgsize-246212,width-800,height-434,overlay-etenergyworld/global-warming-will-lead-to-river-ice-cover-decline-study.jpg", "publishedAt": "2020-01-02T08:29:26Z", "content": "WASHINGTON: The annual river ice cover will decline by about six days for every one degree Celsius increase in global temperatures, posing economic and environmental consequences, according to a stud… [+1778 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: Novel device creates electricity from snowfall - ETEnergyworld.com", "description": "The device designed by researchers at the University of California, Los Angeles (UCLA) is inexpensive, small, thin and flexible like a sheet of plastic.", "url": "https://energy.economictimes.indiatimes.com/news/power/innovation-novel-device-creates-electricity-from-snowfall/68902736", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-68902736,imgsize-962319,width-800,height-434,overlay-etenergyworld/innovation-novel-device-creates-electricity-from-snowfall.jpg", "publishedAt": "2019-04-16T07:28:22Z", "content": "Los Angeles: Scientists have designed a first-of-its-kind 3D-printed device that can produce electricity from falling snow. The device designed by researchers at the University of California, Los Ang… [+2894 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "INNOVATION: New lung-inspired design turns water into fuel - ETEnergyworld.com", "description": "The research, published in the journal Joule, could help existing clean energy technologies run more efficiently", "url": "https://energy.economictimes.indiatimes.com/news/renewable/innovation-new-lung-inspired-design-turns-water-into-fuel/67193738", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-67193738,imgsize-57244,width-800,height-434,overlay-etenergyworld/innovation-new-lung-inspired-design-turns-water-into-fuel.jpg", "publishedAt": "2018-12-21T11:14:08Z", "content": "Boston: Scientists have designed an electrocatalytic material that works like a mammalian lung to convert water into fuel. The research, published in the journal Joule, could help existing clean ener… [+3199 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET EnergyWorld", "title": "Wind, solar farms could bring rains to Sahara Desert - ETEnergyworld.com", "description": "\"Previous modeling studies have shown that large-scale wind and solar farms can produce significant climate change at continental scales,\" said Yan Li, a postdoctoral researcher at the University of Illinois in the US.", "url": "https://energy.economictimes.indiatimes.com/news/renewable/wind-solar-farms-could-bring-rains-to-sahara-desert/65747616", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-65747616,imgsize-106482,width-800,height-434,overlay-etenergyworld/wind-solar-farms-could-bring-rains-to-sahara-desert.jpg", "publishedAt": "2018-09-10T02:14:23Z", "content": "Washington: A massive wind and solar installation in the Sahara Desert would increase precipitation and vegetation in the world's largest hot desert. The study, published in the journal Science, is a… [+2813 chars]"}, {"source": {"id": null, "name": "http://www.newsgram.com/"}, "author": "https://www.facebook.com/NewsGramDOTcom", "title": "50 Astronauts to conduct 3 Spacewalks outside International Space Station (ISS) for future arrival of commercial crew Spacecraft - http://www.newsgram.com/", "description": "50 astronauts will conduct up to 3 spacewalks outside the ISS to prepare for the future arrival of commercial crew spacecraft.", "url": "https://www.newsgram.com/50-astronauts-to-conduct-3-spacewalks-outside-international-space-station-iss-for-future-arrival-of-commercial-crew-spacecraft/", "urlToImage": "https://i0.wp.com/www.newsgram.com/wp-content/uploads/2016/06/Aerial_View_of_Launch_Complex_39-e1483513863190.jpg", "publishedAt": "2017-06-14T06:02:45Z", "content": "Washington, March 24, 2017: Starting Friday, Expedition 50 astronauts will conduct up to three spacewalks outside the International Space Station (ISS) to prepare for the future arrival of commercial… [+1889 chars]"}]}