{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Dream Home on Red planet? Scientists Develop Cosmic Concrete to Build House on Mars - News18", "description": "Planning to build a house on Mars may now be easy as scientists have created a concrete-like material made of extraterrestrial dust along with the blood, sweat and tears of astronauts.", "url": "https://www.news18.com/news/buzz/dream-home-on-red-planet-scientists-develop-cosmic-concrete-to-build-house-on-mars-4204457.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/house-on-mars-163167787416x9.png", "publishedAt": "2021-09-15T03:55:51Z", "content": "Planning to build a house on Mars may now be easy as scientists have created a concrete-like material made of extraterrestrial dust along with the blood, sweat and tears of astronauts. Transporting e… [+2390 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Spaceflight will carry payloads from Orbit Fab, GeoJump to lunar orbit next year. - Space Bollyinside - BollyInside", "description": "Spaceflight’s electric propulsive Sherpa-LTE flew on the SpaceX Transporter-2 mission in June, while Sherpa-LTC with chemical propulsion will launch later", "url": "https://www.bollyinside.com/news/spaceflight-will-carry-payloads-from-orbit-fab-geojump-to-lunar-orbit-next-year", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-09-15T03:00:14Z", "content": "Spaceflight’s electric propulsive Sherpa-LTE flew on the SpaceX Transporter-2 mission in June, while Sherpa-LTC with chemical propulsion will launch later this year on Transporter-3. The company has … [+1403 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "SpaceX launches 51 Starlink internet satellites since May - Sentinelassam - The Sentinel Assam", "description": "SpaceX on Tuesday launched its first full stack of 51 Starlink broadband satellites since May, the...", "url": "https://www.sentinelassam.com/international/spacex-launches-51-starlink-internet-satellites-since-may-554866", "urlToImage": "https://assets.sentinelassam.com/h-upload/2021/09/15/254751-space.jpg", "publishedAt": "2021-09-15T02:36:37Z", "content": "SAN FRANCISCO: SpaceX on Tuesday launched its first full stack of 51 Starlink broadband satellites since May, the media reported.\r\nThe satellites blasted off on a Falcon 9 rocket from Space Launch Co… [+1866 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "All-civilian SpaceX crew feels only 'good kind' of jitters before launch - Devdiscourse", "description": "The four would-be citizen astronauts poised to ride a SpaceX rocket ship around the globe as the first all-civilian crew launched into orbit said on Tuesday they were eager for liftoff on the eve of their flight, feeling only \"the good kind\" of jitters.  \"I w…", "url": "https://www.devdiscourse.com/article/technology/1730188-all-civilian-spacex-crew-feels-only-good-kind-of-jitters-before-launch", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_33_47_4854533.png?width=920&format=jpeg", "publishedAt": "2021-09-15T01:25:53Z", "content": "The four would-be citizen astronauts poised to ride a SpaceX rocket ship around the globe as the first all-civilian crew launched into orbit said on Tuesday they were eager for liftoff on the eve of … [+3193 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Soyuz Rocket Launches 34 New UK Satellites - NDTV", "description": "A Russian Soyuz rocket has blasted into space carrying 34 new satellites from British operator Oneweb, which aims to provide broadband internet everywhere in the world.", "url": "https://www.ndtv.com/world-news/russian-soyuz-rocket-launches-34-new-uk-satellites-2541160", "urlToImage": "https://c.ndtvimg.com/2021-09/j29v2ad4_russia-soyuz-rocketafp650_625x300_15_September_21.jpg", "publishedAt": "2021-09-15T00:52:00Z", "content": "The rocket took off at 1807 GMT Tuesday from Baikonur cosmodrome in Kazakhstan.\r\nBaikonur: A Russian Soyuz rocket has blasted into space carrying 34 new satellites from British operator Oneweb, which… [+1203 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "Brasileiro registers possible impact on Jupiter’s equatorial region; check out! - Play Crazy Game", "description": "The recording of impacts from space objects on Jupiter is such a rare event that, since 1994, only seven have been observed — but recently a Brazilian seems to have had great luck. At around 19:39 GMT on September 13, amateur astronomer José Luis Pereira disc…", "url": "https://playcrazygame.com/2021/09/15/brasileiro-registers-possible-impact-on-jupiters-equatorial-region-check-out/", "urlToImage": "https://t.ctcdn.com.br/_gUC1sopDTNqeuBZzSpixcL6Td8=/1024x0/smart/i503183.jpeg", "publishedAt": "2021-09-15T00:02:29Z", "content": "The recording of impacts from space objects on Jupiter is such a rare event that, since 1994, only seven have been observed but recently a Brazilian seems to have had great luck. At around 19:39 GMT … [+2248 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Akshay", "title": "On a wild mission to bring back the woolly mammoth - DTNext", "description": "A team of scientists and entrepreneurs announced on Monday that they have started a new company to genetically resurrect the woolly mammoth. The company, named Colossal, aims to place thousands of these magnificent beasts back on the Siberian tundra, thousand…", "url": "http://www.dtnext.in/News/World/2021/09/15012643/1318134/On-a-wild-mission-to-bring-back-the-woolly-mammoth.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/Sep/202109150126432141_On-a-wild-mission-to-bring-back-the-woolly-mammoth_SECVPF.gif", "publishedAt": "2021-09-14T20:34:48Z", "content": "A team of scientists and entrepreneurs announced on Monday that they have started a new company to genetically resurrect the woolly mammoth. The company, named Colossal, aims to place thousands of th… [+3288 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Three ... Two ... One: Hayley Arceneaux's Space Trip Launches Wednesday From Cape Canaveral | Entertainment / Life - BollyInside", "description": "Arceneaux, 29, joins businessman-philanthropist Jared Isaacman, geoscientist Sian Proctor and aerospace industry worker Chris Sembroski on a three-day", "url": "https://www.bollyinside.com/news/three-two-one-hayley-arceneauxs-space-trip-launches-wednesday-from-cape-canaveral-entertainment-life", "urlToImage": null, "publishedAt": "2021-09-14T19:10:36Z", "content": "Arceneaux, 29, joins businessman-philanthropist Jared Isaacman, geoscientist Sian Proctor and aerospace industry worker Chris Sembroski on a three-day trip 500 kilometers above the earth’s surface. T… [+3170 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Homemade face masks work; effectiveness varies depending on how they are made - Phys.org", "description": "Since the spread of virus causing COVID-19 continues, experts recommended wearing homemade facemasks when surgical or N95 masks are not available to prevent the spread of the pandemic. While such makeshift masks are more economical and accessible in low-capit…", "url": "https://phys.org/news/2021-09-homemade-masks-effectiveness-varies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/homemade-face-masks-wo.jpg", "publishedAt": "2021-09-14T15:00:12Z", "content": "Since the spread of virus causing COVID-19 continues, experts recommended wearing homemade facemasks when surgical or N95 masks are not available to prevent the spread of the pandemic. While such mak… [+3390 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Mission Artemis: NASA Is Building Durable Spacesuits To Withstand Micrometeorite Hits - News18", "description": "The National Aeronautics and Space Administration (NASA) is gearing up to land humans on the moon for the second time after 1969.", "url": "https://www.news18.com/news/buzz/mission-artemis-nasa-is-building-durable-spacesuits-to-withstand-micrometeorite-hits-4202630.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/untitled-design-50-163162773316x9.jpg", "publishedAt": "2021-09-14T13:56:59Z", "content": "The National Aeronautics and Space Administration (NASA) is gearing up to land humans on the moon for the second time after 1969. Artemis, being a series of human-crewed missions, is an immensely imp… [+1920 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "How to watch SpaceX launch its first all-civilian mission on Wednesday - Digital Trends", "description": "SpaceX is about to launch its first all-civilian crew to space in a mission that will orbit Earth for three days. Here's how to watch.", "url": "https://www.digitaltrends.com/news/how-to-watch-spacex-launch-its-first-all-civilian-mission/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/inspiration4-netflix-documentary.jpg", "publishedAt": "2021-09-14T12:49:28Z", "content": "SpaceX is a short time away from launching its first all-civilian crew for a three-day ride in low Earth orbit.\r\nThe mission is set to lift off from Launch Complex 39A at NASAs Kennedy Space Center i… [+2289 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA to Launch Bread Loaf-sized Satellite CuPID to Study Sun-Earth Boundary - News18", "description": "This month, National Aeronautics and Space Administration (NASA) will be launching a satellite to study planet Earth’s interaction with the sun.", "url": "https://www.news18.com/news/buzz/nasa-to-launch-bread-loaf-sized-satellite-cupid-to-study-sun-earth-boundary-4201400.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/cupid-163160898616x9.png", "publishedAt": "2021-09-14T08:45:52Z", "content": "This month, National Aeronautics and Space Administration (NASA) will be launching a satellite to study planet Earth’s interaction with the sun. Dubbed as CuPID, which stands for Cusp Plasma Imaging … [+2065 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "NASA Perseverance Rover's Rock Samples Suggest Alien Life Existed On Mars - India Times", "description": "The recent samples of rock that were collected by NASA's Perseverance rover point to alien life, scientists have revealed.The samples revealed that Mars once had an environment that would have allowed life to exist. While this does not mean that aliens walked…", "url": "https://www.indiatimes.com/technology/science-and-future/nasa-perseverance-rock-samples-alien-life-mars-549370.html", "urlToImage": "https://im.indiatimes.in/content/2021/Sep/mars-nasa-picture_614042ff2b7f5.jpeg", "publishedAt": "2021-09-14T06:38:23Z", "content": "The recent samples of rock that were collected by NASA's Perseverance rover point to alien life, scientists have revealed.\r\nThe samples revealed that Mars once had an environment that would have allo… [+2070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aswathi Pacha", "title": "Explained: Can a solar storm disrupt an internet connection? - The Indian Express", "description": "Massive Solar Storm could cause global internet blackout: The rapid development of technology took place in the last three decades when the Sun was in its period of low activity and there are very limited studies on whether our current infrastructure can with…", "url": "https://indianexpress.com/article/explained/solar-storm-internet-apocalypse-explained-7502072/", "urlToImage": "https://images.indianexpress.com/2021/09/SolarFlares_NASA_1200.jpg", "publishedAt": "2021-09-14T06:38:12Z", "content": "Impact of solar storm could be a threat to the internet. Everything you need to know: After witnessing a pandemic, locust attack and cicada invasion in 2020, meme pages quipped that human beings are … [+5389 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "In an Accidental Discovery, Physicists Find that Black Holes Exert Pressure on their Environment | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Physicists have, for the first time, discovered that black holes exert pressure on their environment. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2021-09-14-physicists-find-that-black-holes-exert-pressure", "urlToImage": "https://s.w-x.co/in-black%20hole.jpg", "publishedAt": "2021-09-14T06:10:54Z", "content": "Physicists have, for the first time, discovered that black holes exert pressure on their environment.\r\nIn 1974 Stephen Hawking made the seminal discovery that black holes emit thermal radiation. Befo… [+1791 chars]"}, {"source": {"id": null, "name": "Californianewstimes.com"}, "author": "julesmenten", "title": "MIT Engineers Create 3D-Printed Objects That Sense How a User Is Interacting With Them - Californianewstimes.com", "description": "Researchers at MIT have developed a way to integrate sensing capabilities into a 3D printable structure consisting of iterative cells. This allows designers to quickly prototype interactive input devi", "url": "https://californianewstimes.com/mit-engineers-create-3d-printed-objects-that-sense-how-a-user-is-interacting-with-them/522286/", "urlToImage": "https://scitechdaily.com/images/3D-Printed-Flexible-Input-Device.gif", "publishedAt": "2021-09-14T05:41:14Z", "content": "Researchers at MIT have developed a way to integrate sensing capabilities into a 3D printable structure consisting of iterative cells. This allows designers to quickly prototype interactive input dev… [+6334 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Masks do not increase body temperature during exercise in the heat - The Indian Express", "description": "Researchers hope this study can help shape guidelines for athletes who are exercising and competing during the summer and into the fall while ambient temperatures are still high.", "url": "https://indianexpress.com/article/explained/masks-do-not-increase-body-temperature-during-exercise-in-the-heat-study-shows-7506990/", "urlToImage": "https://images.indianexpress.com/2021/09/park-walk.jpg", "publishedAt": "2021-09-14T01:56:24Z", "content": "A new paper published in Sports Health has demonstrated that exercising in the heat with a face mask on does not significantly increase body temperature or heart rate during exercise.Ayami Yoshihara,… [+1533 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Squirrels have human-like personalities, new UC Davis research shows - Games Bollyinside - BollyInside", "description": "Researchers say the findings show how personality influences an animal’s use of space in the wild. The study, which the group says is the first to", "url": "https://www.bollyinside.com/news/squirrels-have-human-like-personalities-new-uc-davis-research-shows", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-09-14T01:07:13Z", "content": "Researchers say the findings show how personality influences an animal’s use of space in the wild. The study, which the group says is the first to ever document personality in golden-mantled ground s… [+2647 chars]"}, {"source": {"id": null, "name": "PennLive"}, "author": "Claudia Dimuro | cdimuro@pennlive.com", "title": "Fossil of ‘dragon’ millions of years old discovered for the first time in Chile - PennLive", "description": "This is the first time that a pterosaur fossil—exclusively found in the northern part of the world—was discovered in the Southern Hemisphere, proving that life does, indeed, find a way.", "url": "https://www.pennlive.com/life/2021/09/fossil-of-dragon-millions-of-years-old-discovered-for-the-first-time-in-chile.html", "urlToImage": "https://www.pennlive.com/resizer/QbNIZX4GC5v9QBZIK3rzkfe1fuc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/5ACMBUO7YZAODMIJ4GR6CHOECQ.jpg", "publishedAt": "2021-09-13T18:00:00Z", "content": "The fossil of a dinosaur discovered in Chile that called the Earth its home millions of years ago has turned out to be a paleontology first.\r\nThe remains of the dinosaura winged reptile whose appeara… [+1681 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA: Mars rover rocks reveal 'potentially habitable sustained environment' - CNET", "description": "The Perseverance rover's first Martian rock samples are giving scientists a scintillating peek into the watery past of an ancient lakebed.", "url": "https://www.cnet.com/news/mars-perseverance-rocks-reveal-potentially-habitable-sustained-environment-nasa-says/", "urlToImage": "https://www.cnet.com/a/img/QianeiZwA0tbv6JIzE5z_hzrPKU=/1200x630/2021/09/10/49c069ab-f611-4af3-a494-de043825522b/1-pia24840-main-samuels-5-hazcam-001.jpg", "publishedAt": "2021-09-13T16:49:00Z", "content": "NASA's Perseverance rover collected its first two Martian rock cores from \"Rochette,\" the rock near the center of the image.\r\nNASA/JPL-Caltech\r\nThis story is part of Welcome to Mars, our series explo… [+2022 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Scientists have created the largest simulation of the universe. It is available to everyone - T24 - Czech television - SwordsToday.ie", "description": "Uchu (meaning “universe” in Japanese) is still there The largest and most realistic simulation of the universe. It contains 2.1 trillion particles housed in...", "url": "https://swordstoday.ie/scientists-have-created-the-largest-simulation-of-the-universe-it-is-available-to-everyone-t24-czech-television/", "urlToImage": null, "publishedAt": "2021-09-13T13:21:30Z", "content": "Uchu (meaning “universe” in Japanese) is still there The largest and most realistic simulation of the universe. It contains 2.1 trillion particles housed in a virtual cube. Each side is 9.63 billion … [+1793 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Filling in the gaps in the SuperDARN file - Space Bollyinside - BollyInside", "description": "Historically, researchers have filled in these gaps with models that make assumptions based either on climatological averages of the SuperDARN data or on", "url": "https://www.bollyinside.com/news/filling-in-the-gaps-in-the-superdarn-file", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/08/Takeshi-Kitanos-legacy-in-video-games-•-news.png", "publishedAt": "2021-09-13T13:09:41Z", "content": "Historically, researchers have filled in these gaps with models that make assumptions based either on climatological averages of the SuperDARN data or on solar wind measurements. In a new study, Shor… [+1421 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's asteroid-slamming DART spacecraft reaches final stages of development - Republic World", "description": "NASA's Double Asteroid Redirection Test (DART) is being planned to prepare Earth's defence mechanisms to protect it from future asteroid hazards.", "url": "https://www.republicworld.com/technology-news/science/nasas-asteroid-slamming-dart-spacecraft-reaches-final-stages-of-development.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/rujsz1ro8lxaerie_1631532433.jpeg", "publishedAt": "2021-09-13T12:40:00Z", "content": "NASA has made it to the final stages of the Hollywoodesque Double Asteroid Redirection Test (DART) mission as the spacecraft, headed for a collision with an asteroid system, has been equipped with in… [+2215 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Space Has A Lot Of Junk Flying Around And It's A Growing Threat. New Research Centre In UK To Now Track Them - ABP Live", "description": "Team of scientists from University of Warwick has established Centre for Space Domain Awareness, a first-of-its-kind research centre in UK, to tackle threats posed by space junk", "url": "https://news.abplive.com/science/space-has-a-lot-of-junk-flying-around-uk-centre-for-space-domain-awareness-to-track-tackle-growing-threat-1481946", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2021/09/13/5f240a2f1abeff96e11fbdcdd5f922dc_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2021-09-13T12:34:58Z", "content": "New Delhi: Dead satellites that failed or were left in orbit at the end of their mission, parts of a rocket, defunct artificial objects — there is a lot of junk flying around in space. \r\nThe National… [+5981 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Scientists scramble to harvest ice cores as glaciers melt - The Indian Express", "description": "A study published in April found glaciers lost 227 gigatons of ice annually from 2000 to 2004, but that increased to an average of 298 gigatons a year after 2015.", "url": "https://indianexpress.com/article/technology/science/scientists-scramble-to-harvest-ice-cores-as-glaciers-melt-7506297/", "urlToImage": "https://images.indianexpress.com/2021/09/climate.jpg", "publishedAt": "2021-09-13T12:27:45Z", "content": "Scientists are racing to collect ice cores along with long-frozen records they hold of climate cycles as global warming melts glaciers and ice sheets. Some say they are running out of time. And, in s… [+8205 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Not larger than a loaf of bread, this satellite will study how Sun interacts with Earth - India Today", "description": "The satellite will study the interaction between Earth’s magnetic field, a protective bubble surrounding the planet, and the Sun.", "url": "https://www.indiatoday.in/science/story/cupid-cubesat-earth-magnetic-field-solar-storms-sun-1852351-2021-09-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202109/Cubesat_q-647x363.jpeg?rqPaE1FPXBigxtnBJ62Sb3KPLOf0IxC.", "publishedAt": "2021-09-13T11:45:56Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Ways to detect merging black holes in addition to gravitational waves - Phys.org", "description": "If two black holes merge in the middle of space, and nobody's around to see it, does it really happen?", "url": "https://phys.org/news/2021-09-ways-merging-black-holes-addition.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/black-holes.jpg", "publishedAt": "2021-09-13T11:42:46Z", "content": "If two black holes merge in the middle of space, and nobody's around to see it, does it really happen?\r\nTo date, the only way astronomers have conclusively witnessed the merging of black holes is thr… [+2681 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Penguins 'might be aliens', scientists say after discovering Venus chemical in bird’s droppings - Times Now", "description": "After the study, the scientists now believe penguins could help them identify different types of organisms that exist in other worlds.", "url": "https://www.timesnownews.com/the-buzz/article/penguins-might-be-aliens-scientists-say-after-discovering-venus-chemical-in-bird-s-droppings/811363", "urlToImage": "https://imgk.timesnownews.com/story/GNN.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-09-13T11:30:00Z", "content": "<ul><li>It is speculated that penguins could be aliens after scientists found traces of a chemical in their droppings that is also found in the planet Venus.</li></ul>\r\n<ul><li>The researchers from t… [+2181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Milkweed butterflies are more murderous than they look - The Indian Express", "description": "Although butterflies had previously been observed feeding on grasshoppers that harbor toxic alkaloids, no one had ever documented adult butterflies stealing such compounds from their own kin.", "url": "https://indianexpress.com/article/technology/science/milkweed-butterflies-murderous-kleptopharmacophagy-7506170/", "urlToImage": "https://images.indianexpress.com/2021/09/BUTTERFLIES-BEHAVIOR-1.jpg", "publishedAt": "2021-09-13T11:02:01Z", "content": "Butterflies seem gentle as they flutter from plant to plant. But some may be more murderous than you imagine. Naturalists recently witnessed several species of milkweed butterfly harassing, subduing … [+5245 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": "Naveen", "title": "Astronomers capture best images yet of peculiar dog-bone asteroid - newkerala.com - New Kerala", "description": "Astronomers capture best images yet of peculiar 'dog-bone' asteroid", "url": "https://www.newkerala.com/news/2021/132337.htm", "urlToImage": null, "publishedAt": "2021-09-13T10:41:15Z", "content": "New York, Sep 12: A team of astronomers have obtained the sharpest and most detailed images yet of the asteroid Kleopatra, using the European Southern Observatory's Very Large Telescope (ESO's VLT).\r… [+2248 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Dese Gowda", "title": "The International Space Station Is Getting Ready For A Fresh Array Of Solar Panels - Mashable India", "description": "In the first spacewalk to not include an American or a Russian astronaut, a team of two international astronauts completed the prep work on the aging space station.", "url": "https://in.mashable.com/science/24650/the-international-space-station-is-getting-ready-for-a-fresh-array-of-solar-panels", "urlToImage": "https://sm.mashable.com/t/mashable_in/photo/default/spacewalk_71kb.1200.jpg", "publishedAt": "2021-09-13T08:40:57Z", "content": "A team of two international astronauts has completed the prep work to install a fresh array of solar panels on the International Space Station (ISS).\r\nThe spacewalk which lasted for 6 hours and 54 mi… [+2043 chars]"}]}