{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Finding the cause of a fatal problem in rocket engine combustors - Science Daily", "description": "A vital piece of gas engines, combustors -- the chambers in which the combustion powering the engine occurs -- have the problem of breaking down due to fatal high-frequency oscillations during the combustion process. Now, through advanced time-series analyses…", "url": "https://www.sciencedaily.com/releases/2021/08/210802140154.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-02T20:13:51Z", "content": "Rocket engines contain confined combustion systems, which are, essentially, combustion chambers. In these chambers, nonlinear interactions among turbulent fuel and oxidizer flows, sound waves, and he… [+2732 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Decline in CO2 cooled earth’s climate over 30 million years ago, scientists find - India Education Diary", "description": "Between 40 and 34 million years ago, Earth’s climate underwent a major climatic transition. Before 40 million years ago, during the Eocene, Antarctica was covered by lush forests, but by 34 million years ago, in the Oligocene, these forests had been", "url": "https://indiaeducationdiary.in/university-of-bristol-decline-in-co2-cooled-earths-climate-over-30-million-years-ago-scientists-find/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2-1024x309.png", "publishedAt": "2021-08-02T18:00:26Z", "content": "Between 40 and 34 million years ago, Earths climate underwent a major climatic transition. Before 40 million years ago, during the Eocene, Antarctica was covered by lush forests, but by 34 million ye… [+1910 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Edinburgh: Russian Arctic warming leads to major ice loss - India Education Diary", "description": "Satellite data suggests that the amount of ice lost between 2010 and 2018 would put an area the size of the Netherlands under seven feet of water.Warming of the Arctic Ocean appears to play a key role in accelerating ice loss from two large groups of", "url": "https://indiaeducationdiary.in/university-of-edinburgh-russian-arctic-warming-leads-to-major-ice-loss/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/University_of_Edinburgh_ceremonial_roundel.svg_-1017x1024.png", "publishedAt": "2021-08-02T18:00:25Z", "content": "Satellite data suggests that the amount of ice lost between 2010 and 2018 would put an area the size of the Netherlands under seven feet of water.\r\nWarming of the Arctic Ocean appears to play a key r… [+2223 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Google Claims To Create Time Crystal Inside Quantum Computer - Futurism", "description": "\"The consequence is amazing: You evade the second law of thermodynamics.\"", "url": "https://futurism.com/the-byte/google-time-crystal-quantum-computer", "urlToImage": "https://wp-assets.futurism.com/2021/08/google-time-crystal-quantum-computer.jpg", "publishedAt": "2021-08-02T16:54:32Z", "content": "If the research stands up to scrutiny, this could be the spark quantum computers need.\r\nBreaking Physics\r\nIn what could prove to be a momentous accomplishment for fundamental physics and quantum phys… [+2503 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Two spacecraft to fly by Venus on August 9, 10 - European Space Agency - United News of India", "description": "Paris, Aug 2 (UNI/Sputnik) Solar Orbiter and BepiColombo spacecraft are expected to operate a double Venus flyby 33 hours apart on August 9 and 10, the European Space Agency (ESA) said on Monday.", "url": "http://www.uniindia.com/two-spacecraft-to-fly-by-venus-on-august-9-10--european-space-agency/world/news/2466155.html", "urlToImage": "", "publishedAt": "2021-08-02T16:51:00Z", "content": "More News03 Aug 2021 | 1:17 AMWashington, Aug 2 (UNI/Sputnik) US Senator Lindsey Graham said on Monday that he tested positive for the novel coronavirus despite having received a vaccine.\r\nsee more..… [+1031 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Pulsed lasers in liquids speed up hunt for effective catalysts - Science Daily", "description": "Researchers document how the technique quickly produces arrays of highly active, carefully tuned nanoparticles with remarkably uniform properties that can be compared and tested for use as catalysts, far more quickly than traditional wet lab methods.", "url": "https://www.sciencedaily.com/releases/2021/08/210802114956.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-02T16:49:54Z", "content": "Chemical catalysts are the change agents behind the production of just about everything we use in our daily lives, from plastics to prescription drugs. When the right catalysts are mixed with the rig… [+5155 chars]"}, {"source": {"id": null, "name": "Bcm.edu"}, "author": null, "title": "Cryptic transcription in mammalian stem cells linked to aging - Baylor College of Medicine News", "description": "Although visible signs of aging are usually unmistakable, unraveling what triggers them has been quite a challenge. Researchers at Baylor College of Medicine...", "url": "https://www.bcm.edu/news/cryptic-transcription-in-mammalian-stem-cells-linked-to-aging", "urlToImage": "https://cdn.bcm.edu/sites/default/files/2021-08/lab_samples.jpg", "publishedAt": "2021-08-02T16:44:43Z", "content": "Although visible signs of aging are usually unmistakable, unraveling what triggers them has been quite a challenge. Researchers at Baylor College of Medicine and collaborating institutions have disco… [+3549 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "New theory: Earth's longer days kick-started oxygen growth - Economic Times", "description": "A study published Monday proposes and puts to the test the theory that longer, continuous daylight kick-started weird bacteria into producing lots of oxygen, making most of life as we know it possible.", "url": "https://economictimes.indiatimes.com/news/science/new-theory-earths-longer-days-kick-started-oxygen-growth/articleshow/84981978.cms", "urlToImage": "https://img.etimg.com/thumb/msid-84982160,width-1070,height-580,imgsize-101642,overlay-economictimes/photo.jpg", "publishedAt": "2021-08-02T16:36:00Z", "content": "Scientists have a new idea for how Earth got its oxygen: It's because the planet slowed down and days got longer. \r\nA study published Monday proposes and puts to the test the theory that longer, cont… [+3023 chars]"}, {"source": {"id": null, "name": "Marketresearchtelecast.com"}, "author": null, "title": "How to cut a pizza so that all its portions are equal, according to mathematicians - Market Research Telecast", "description": "As much as we do to cut one pizza in equal portions To avoid conflict, most attempts often have frustrating results. However, this problem seems to have found a solution thanks to two mathematicians who ... Read more", "url": "https://marketresearchtelecast.com/how-to-cut-a-pizza-so-that-all-its-portions-are-equal-according-to-mathematicians/119193/", "urlToImage": "https://marketresearchtelecast.com/wp-content/uploads/2021/08/How-to-cut-a-pizza-so-that-all-its-portions.jpg", "publishedAt": "2021-08-02T16:29:06Z", "content": "As much as we do to cut one pizza in equal portions To avoid conflict, most attempts often have frustrating results. However, this problem seems to have found a solution thanks to two mathematicians … [+2166 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Chris Davies", "title": "NASA’s hunt for water on the Moon just got an unexpected Apollo boost - SlashGear", "description": "Decades-old images from the Apollo missions have cast new light – or, more accurately, new shadow – on NASA’s hunt for water on the Moon, potentially paving the way to Artemis ast…", "url": "https://www.slashgear.com/nasas-hunt-for-water-on-the-moon-just-got-an-unexpected-apollo-boost-02684960/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/08/nasa-artemis-moon-surface.jpg", "publishedAt": "2021-08-02T16:25:00Z", "content": "Decades-old images from the Apollo missions have cast new light – or, more accurately, new shadow – on NASA’s hunt for water on the Moon, potentially paving the way to Artemis astronauts being more s… [+3882 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Frank Close", "title": "Steven Weinberg obituary - The Guardian", "description": "Winner of the 1979 Nobel prize whose insights determined the direction of high-energy particle physics for decades", "url": "https://amp.theguardian.com/science/2021/aug/02/steven-weinberg-obituary", "urlToImage": null, "publishedAt": "2021-08-02T16:04:00Z", "content": "Particle physicsWinner of the 1979 Nobel prize whose insights determined the direction of high-energy particle physics for decades\r\nThe American theoretical particle physicist Steven Weinberg, who ha… [+6332 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Drone Mapping of Methane Emission Hotspots - AZoRobotics", "description": "A novel new drone system fitted with an array of sensors could assess methane emissions in local areas allowing researchers to zoom in on hotspots for greenhouse gas emissions.", "url": "https://www.azorobotics.com/News.aspx?newsID=12422", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ImageForNews_12422_16279199359905628.jpg", "publishedAt": "2021-08-02T16:00:00Z", "content": "A novel new drone system fitted with an array of sensors could assess methane emissions in local areas allowing researchers to zoom in on hotspots for greenhouse gas emissions.\r\nUAV system setup at t… [+6785 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Astronomers spot light behind a black hole for the first time, reaffirming Einstein's theory of general relativity - TechSpot", "description": "Led by Stanford University’s Dan Wilkins, the team focused on a black hole that is 10 million times as massive as our sun and located 1,800 million...", "url": "https://www.techspot.com/news/90632-astronomers-spot-light-behind-black-hole-first-time.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-02-image-17.jpg", "publishedAt": "2021-08-02T15:56:00Z", "content": "Something to look forward to: An international team of astronomers have observed light from behind a black hole for the first time. Future observatories, like the Advanced Telescope for High Energy A… [+1402 chars]"}, {"source": {"id": null, "name": "Thenationalnews.com"}, "author": "Paul Peachey", "title": "Eruptions at Greek volcano show activity falls as sea levels rise - The National", "description": "Global warming may be limiting volcanic eruptions, paper finds", "url": "https://www.thenationalnews.com/world/2021/08/02/volcanic-activity-falls-as-sea-levels-rise-study-finds/", "urlToImage": "https://www.thenationalnews.com/resizer/NVPYQxpQHjE2hxHX-yPKlB8q3Vk=/arc-photo-thenational/eu-central-1-prod/public/C7TCN2VKE5FSPO4CFRX253VWX4.jpg", "publishedAt": "2021-08-02T15:01:59Z", "content": "Rising sea levels from climate change may lead to reduced numbers of volcanic eruptions, according to research published on Monday.\r\nA study of 360,000 years of activity at the Santorini volcano in G… [+1426 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Birnessite study offers insights for electrochemistry, energy storage - Phys.org", "description": "The adsorption of ions from the electrolyte at an electrode surface is a ubiquitous process, of use for both existing and emerging electrochemical energy technologies. But what happens when these ions penetrate very small spaces? To address this question, res…", "url": "https://phys.org/news/2021-08-birnessite-insights-electrochemistry-energy-storage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/2dmaterial.jpg", "publishedAt": "2021-08-02T15:00:13Z", "content": "The adsorption of ions from the electrolyte at an electrode surface is a ubiquitous process, of use for both existing and emerging electrochemical energy technologies. But what happens when these ion… [+3505 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Manganese could make luminescent materials and the conversion of sunlight more sustainable - Phys.org", "description": "University of Basel researchers have reached an important milestone in their quest to produce more sustainable luminescent materials and catalysts for converting sunlight into other forms of energy. Based on the cheap metal manganese, they have developed a ne…", "url": "https://phys.org/news/2021-08-manganese-luminescent-materials-conversion-sunlight.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/manganese-could-make-l.jpg", "publishedAt": "2021-08-02T15:00:04Z", "content": "University of Basel researchers have reached an important milestone in their quest to produce more sustainable luminescent materials and catalysts for converting sunlight into other forms of energy. … [+3870 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Cheap material converts heat to electricity - Science Magazine", "description": "New thermoelectric could usher in inexpensive power source", "url": "https://www.sciencemag.org/news/2021/08/cheap-material-converts-heat-electricity", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/_20210802_on_thermoelectric.jpg?itok=XkYtBNpX", "publishedAt": "2021-08-02T15:00:00Z", "content": "Purified polycrystalline tin selenide could form the basis for cheap devices that convert waste heat to electricity.\r\nNorthwestern University \r\nBy Robert F. ServiceAug. 2, 2021 , 11:00 AM\r\nSo-called … [+4018 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "New X-Ray Imaging Method Based on Hackmanite’s Coloring Abilities - AZoOptics.com", "description": "A new X-ray imaging technique has been identified by researchers from the University of Turku based on the coloring abilities of the natural mineral hackmanite.", "url": "https://www.azooptics.com/News.aspx?newsID=26932", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_26932_16279061191525244.jpg", "publishedAt": "2021-08-02T14:33:00Z", "content": "Aug 2 2021Reviewed by Alex Smith\r\nA new X-ray imaging technique has been identified by researchers from the University of Turku based on the coloring abilities of the natural mineral hackmanite.\r\nBod… [+3514 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Bradley", "title": "Predicting COVID-19 using 'fuzzy logic' - Phys.org", "description": "There is increasing pressure on society to test people in a timely manner for infection by the COVID-19 virus, SARS-CoV-2, but physical testing takes time and effort and requires people to either have a test kit at home or to attend a test center. The burden …", "url": "https://phys.org/news/2021-08-covid-fuzzy-logic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/calculus.jpg", "publishedAt": "2021-08-02T14:08:57Z", "content": "There is increasing pressure on society to test people in a timely manner for infection by the COVID-19 virus, SARS-CoV-2, but physical testing takes time and effort and requires people to either hav… [+2827 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jack Lee", "title": "Simulating 195 million years of global climate in the Mesozoic - Phys.org", "description": "The Mesozoic, which stretched from about 252 million to 66 million years ago, was a pivotal period in Earth's history. In addition to being the age of the dinosaurs, it was when the supercontinent Pangaea began to separate into the fragmented continents we're…", "url": "https://phys.org/news/2021-08-simulating-million-years-global-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/simulating-195-million.jpg", "publishedAt": "2021-08-02T14:07:41Z", "content": "The Mesozoic, which stretched from about 252 million to 66 million years ago, was a pivotal period in Earth's history. In addition to being the age of the dinosaurs, it was when the supercontinent Pa… [+2799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Kaleidoscope of colour’: Nasa posts breathtaking picture of 300-year-old supernova remnant - The Indian Express", "description": "From calling it the most beautiful photograph they had ever seen to wishing it was visible in the sky, netizens loved the image.", "url": "https://indianexpress.com/article/trending/trending-globally/kaleidoscope-of-colours-nasa-posts-picture-of-300-year-old-remnant-7434836-7434836/", "urlToImage": "https://images.indianexpress.com/2021/08/Trending-card-06.jpg", "publishedAt": "2021-08-02T13:30:51Z", "content": "US space agency Nasa has, in an Instagram post, shared the image of a 300-year-old remnant formed by the supernova explosion of a huge star located 11,000 light-years away from the Earth. It also wen… [+2357 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Asteroid bigger than Burj Khalifa will pass by Earth on 21 August - Firstpost", "description": "With a highly elliptical orbit, asteroid  2016 AJ193 orbits the Sun every 2,160 days or every 5.91 years.", "url": "https://www.firstpost.com/tech/science/asteroid-bigger-than-burj-khalifa-will-pass-by-earth-on-21-august-9858991.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/11/asteroid-3628185_1280-1.jpg", "publishedAt": "2021-08-02T13:07:24Z", "content": "FP TrendingAug 02, 2021 18:37:24 IST\r\nAn asteroid will pass by Earth on Saturday, 21 August. The asteroid is 1.4 km wide and it's travelling at the speed of 94,208 km/h. It is a mid-sized asteroid an… [+1435 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mammal biodiversity shapes disease risk - Phys.org", "description": "To predict the spillover of pathogens from wildlife to humans and limit future pandemics, it is important to understand where wildlife disease risk is highest. A team of researchers, led by Wageningen University & Research (WUR) in The Netherlands, report tha…", "url": "https://phys.org/news/2021-08-mammal-biodiversity-disease.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/mammal-biodiversity-sh.jpg", "publishedAt": "2021-08-02T12:49:10Z", "content": "To predict the spillover of pathogens from wildlife to humans and limit future pandemics, it is important to understand where wildlife disease risk is highest. A team of researchers, led by Wageninge… [+4468 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Michael A. Little, Professor Emeritus of Anthropology, Binghamton University, State University of New York and William D. MacDonald, Professor Emeritus, Department of Geological Sciences, Binghamton University, State University of New York", "title": "What will the Earth be like in 500 years? - Yahoo News", "description": "The planet and the way we live on it are constantly changing. Buena Vista Images via Getty Images Curious Kids is a series for children of all ages. If you...", "url": "https://news.yahoo.com/earth-500-years-123856194.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/du198q.pKd878jgiRkStsA--~B/aD05NTY7dz0xNDQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_conversation_us_articles_815/17433cfa2f8491235e3fd69a262d2c6c", "publishedAt": "2021-08-02T12:38:56Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to curiouskidsus@theconversation.com.\r\nWhat will the Earth be like in 500 years? Lotte… [+4652 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "World's first high-resolution, 3D image of a monkey BRAIN is revealed - Daily Mail", "description": "A detailed map of a complete macaque monkey brain was created using fluorescent imaging techniques by a team from the Chinese Academy of Sciences in Beijing.", "url": "https://www.dailymail.co.uk/sciencetech/article-9851831/Worlds-high-resolution-3D-image-monkey-BRAIN-revealed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/02/11/46182173-0-image-a-4_1627899349148.jpg", "publishedAt": "2021-08-02T12:23:28Z", "content": "The world's first high-resolution 3D image of a monkey brain has been revealed, in a breakthrough that could pave the way for treatments for human diseases including Parkinson's.\r\nA detailed map of a… [+7924 chars]"}, {"source": {"id": null, "name": "Flipboard.com"}, "author": "Live Science - Charles Q. Choi", "title": "Astronomers catch fizzled-out gamma-ray burst from supernova - Flipboard", "description": "A fizzled example of a gamma-ray burst, the most powerful kind of explosion known in the universe, suggests these outbursts may not always work the …", "url": "https://flipboard.com/article/astronomers-catch-fizzled-out-gamma-ray-burst-from-supernova/f-e9a71d9a74%2Flivescience.com", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DP83jvM7CvZdrcxhzABJJg-1200-80.jpeg", "publishedAt": "2021-08-02T12:16:36Z", "content": "Adele Morrison, Research Fellow, Australian National University Andrew Kiss, Research fellow, Australian National University Andy Hogg, Professor,"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "A newly discovered fossil has a remarkably preserved brain - SlashGear", "description": "Researchers have discovered one of the oldest and most preserved brains and all of the fossil record. The fossil is a 310 million-year-old horseshoe crab found with its entire brain intact. Researc…", "url": "https://www.slashgear.com/a-newly-discovered-fossil-has-a-remarkably-preserved-brain-02684869/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/08/brain-fossil.jpg", "publishedAt": "2021-08-02T12:13:00Z", "content": "Researchers have discovered one of the oldest and most preserved brains and all of the fossil record. The fossil is a 310 million-year-old horseshoe crab found with its entire brain intact. Researche… [+1619 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Watch: Turkey sees `mysterious` meteor explosion that made the sky bright green - WION", "description": "The residents of Izmir were absolutely taken aback by an explosion in the sky that occurred in Turkey.", "url": "https://www.wionews.com/science/watch-turkey-sees-mysterious-meteor-explosion-that-made-the-sky-bright-green-402417", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/08/02/204822-meteor.jpeg, Turkey, turned green\" typeof=\"foaf:Image\" />", "publishedAt": "2021-08-02T12:11:15Z", "content": "The residents of Izmir were absolutely taken aback by an explosion in the sky that occurred in Turkey.\r\nIt also became brilliant green for a few seconds, according to accounts.\r\nTurkish social media … [+944 chars]"}, {"source": {"id": null, "name": "H2 View"}, "author": "Molly Burgess", "title": "PowerUP Energy Technologies to develop closed cathode hydrogen fuel cells for Lunar and Mars missions - H2 View", "description": "PowerUP Energy Technologies will develop a 1kW liquid-cooled closed cathode hydrogen fuel cell stack for the Lunar cargo ships – and it has inked a new contract with the European...", "url": "https://www.h2-view.com/story/powerup-energy-technologies-to-develop-closed-cathode-hydrogen-fuel-cells-for-lunar-and-mars-missions/", "urlToImage": "https://www.h2-view.com/wp-content/files/fly-images/46721/Screenshot-2021-08-02-at-12.49.11-600x600.png", "publishedAt": "2021-08-02T11:53:10Z", "content": "PowerUP Energy Technologies will develop a 1kW liquid-cooled closed cathode hydrogen fuel cell stack for the Lunar cargo ships and it has inked a new contract with the European Space Agency for the e… [+2308 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "China’s upcoming space station to host over 1,000 experiments including medical research, tech studies - India Today", "description": "The China Manned Space Agency has approved over 1,000 experiments to be conducted beyond Earth.", "url": "https://www.indiatoday.in/science/story/china-tiangong-space-station-experiments-particle-detector-cmsa-nasa-1835811-2021-08-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202108/China_space_astro_q-647x363.jpeg?tpqcqZXRto0DV_lDqh2etl6GsLvn.nHp", "publishedAt": "2021-08-02T11:39:58Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Sophie", "title": "Astronomers spot light from behind a black hole for the first time — proving Einstein right, again - CBS News", "description": "The discovery proves Albert Einstein's theory of general relativity was right — again.", "url": "https://www.cbsnews.com/news/black-hole-light-from-behind-einstein/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/07/30/cb607553-7e22-4ac9-93ae-dbea37755b87/thumbnail/1200x630/5cfe7cc80c2fe0351f4e77d4095d1ff1/low-res-disc-reverb-v2-png.png", "publishedAt": "2021-08-02T11:19:32Z", "content": "For the first time ever, astronomers have directly detected light from behind a supermassive black hole. The discovery proves Albert Einstein's theory of general relativity was right — again. \r\nUsing… [+3305 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA Rover Sends Across 'Mail From Mars'. Check Out the Spectacular New Photos - News18", "description": "While NASA's Mars 2020 rover is exploring the red planet's territory looking for traces of alien life, its Mars Reconnaissance Orbiter is observing the planet from a distance.", "url": "https://www.news18.com/news/buzz/nasa-rover-sends-across-mail-from-mars-check-out-the-spectacular-new-photos-4035179.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/08/1627902340_mars-new-images-1600x900.jpg", "publishedAt": "2021-08-02T11:13:19Z", "content": "While NASA’s Mars 2020 rover is exploring the red planet’s territory looking for traces of alien life, its Mars Reconnaissance Orbiter is observing the planet from a distance. Recently, the orbiter h… [+1817 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Clays, not water, are likely source of Mars ‘lakes’, says NASA; no liquid water under polar ice caps? - Times Now", "description": "There has been a huge hype around the possibility of the existence of subsurface lakes below the Martian south pole. 3 studies published in the past month have cast doubt on the premise, says NASA.", "url": "https://www.timesnownews.com/technology-science/article/clays-not-water-are-likely-source-of-mars-lakes-says-nasa-no-liquid-water-under-polar-ice-caps/793716", "urlToImage": "https://imgk.timesnownews.com/story/Mars_Polar_Ice_Cap_liquid_lake_or_clay_on_radar.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-08-02T10:51:22Z", "content": "<ul><li>In 2018, a team led by Roberto Orosei of Italys Istituto Nazionale di Astrofisica announced they had found evidence of subsurface lakes deep below the ice cap at Mars south pole.</li></ul>\r\n<… [+5623 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Russian cosmonauts give video tour of module that jolted space station - The Indian Express", "description": "Nauka was launched from the Baikonur Cosmodrome in Kazakhstan on July 21", "url": "https://indianexpress.com/article/technology/science/russian-cosmonauts-video-tour-module-nauka-space-station-7434622/", "urlToImage": "https://images.indianexpress.com/2021/08/2021-08-01T131521Z_1212080430_RC2DWO95CE42_RTRMADP_2_SPACE-EXPLORATION-ISSMODULE-RUSSIA.jpg", "publishedAt": "2021-08-02T09:29:29Z", "content": "Russian cosmonauts have given a video tour of the interior of a research module which briefly threw the International Space Station out of control on Thursday a few hours after docking.\r\nRussian spac… [+1327 chars]"}, {"source": {"id": null, "name": "Energy Live News - Energy Made Easy"}, "author": null, "title": "Earth's interior 'swallowing up' more carbon than previously thought, say scientists - Energy Live News - Energy Made Easy", "description": "They found the carbon drawn into the Earth's interior where the tectonic plates collide tends to stay locked away at depth, rather than resurfacing in the form of volcanic emissions", "url": "https://www.energylivenews.com/2021/08/02/earths-interior-swallowing-up-more-carbon-than-previously-thought-say-scientists/", "urlToImage": "https://www.energylivenews.com/wp-content/uploads/2021/08/shutterstock_765103606.jpg", "publishedAt": "2021-08-02T09:19:07Z", "content": "Slow motion collisions of the pieces of Earth’s crust and uppermost mantle, called the tectonic plates, are swallowing up more carbon into its interior than previously thought.\r\nThat’s according to l… [+2618 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "DNA Explainer: What is space radiation and how does it affect humans? - DNA India", "description": "Protected by the Earth's atmosphere, humans are mostly safe from space radiation on the planet. But not when they venture out.", "url": "https://www.dnaindia.com/explainer/report-dna-explainer-what-is-space-radiation-and-how-does-it-affect-humans-astronauts-solar-storm-nasa-moon-mars-2903697", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/08/02/988400-space-radiation-human-body.jpg", "publishedAt": "2021-08-02T08:55:00Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Perseid meteor shower: Annual celestial event to peak in August as Nasa spots first glowing fragment - India Today", "description": "The Perseid meteor shower is an annual event that occurs in the night sky when Earth comes in the path of the fragments from the Swift-Tuttle comet.", "url": "https://www.indiatoday.in/science/story/perseid-meteor-shower-2021-nasa-comets-swift-tuttle-1835716-2021-08-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202108/Perseid-647x363.jpeg?s_Czm4dcBxaDleQIEAr.Iv.2E0guFz9x", "publishedAt": "2021-08-02T08:18:03Z", "content": null}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  TZVI JOFFRE", "title": "'God particle': TAU researchers further understanding of physics at CERN - The Jerusalem Post", "description": "Scientists found that the decay of the Higgs boson into \"charm\" quarks doesn't deviate from the Standard Model of particle physics.", "url": "https://www.jpost.com/health-science/tau-researchers-further-understanding-of-god-particle-at-cern-675594", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/480694", "publishedAt": "2021-08-02T07:50:00Z", "content": null}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "Weird metallic star moving 2 million miles an hour to leave our galaxy - TweakTown", "description": "Researchers published a paper in the Astrophysical Journal Letters that explores a star traveling towards the edge of our galaxy.", "url": "https://www.tweaktown.com/news/80917/weird-metallic-star-moving-2-million-miles-an-hour-to-leave-our-galaxy/index.html", "urlToImage": "https://static.tweaktown.com/news/8/0/80917_01_weird-metallic-star-moving-near-2-million-miles-an-hour-to-leave-galax_full.jpg", "publishedAt": "2021-08-02T07:45:56Z", "content": "A new study published in The Astrophysical Journal Letters explored the star labeled as LP 40-365, a unique fast-moving star.\r\nSo, what is LP 40-365, and why is it moving towards the edge of the Milk… [+757 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Big brains of birds might help them survive the mass extinction of Nonavian dinosaurs - Tech Explorist", "description": "Bird brains left other dinosaurs behind.", "url": "https://www.techexplorist.com/big-brains-birds-might-help-survive-mass-extinction-nonavian-dinosaurs/40375/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/08/3D-model-of-the-fossil.jpg", "publishedAt": "2021-08-02T07:41:49Z", "content": "Unlike any known animals except mammals, living birds have more complex brains. Due to their unique brain shape, the ancestors of living birds survived the mass extinction of Nonavian dinosaurs, sugg… [+2084 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Girls are less likely to see science as a viable career when taught alongside scientifically confident classmates - Phys.org", "description": "Being in a classroom surrounded by children who are confident and interested in science can actually put girls off pursuing a career in STEM subjects, according to a new study. In contrast, boys seem to be inspired by their peers' confidence and are more like…", "url": "https://phys.org/news/2021-08-girls-science-viable-career-taught.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/girl.jpg", "publishedAt": "2021-08-02T07:15:43Z", "content": "Being in a classroom surrounded by children who are confident and interested in science can actually put girls off pursuing a career in STEM subjects, according to a new study. In contrast, boys seem… [+3895 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "NASA Hubble Shares Stunning Image Of ‘Arp 195’ Triplet Galaxies Caught In A Tug-Of-War Game! - Mashable India", "description": "The National Aeronautics and Space Administration (NASA) recently shared an image of a triplet of galaxies, called Arp 195, caught in a gravitational tug-of-war game. The image has been shared by NASA Hubble’s official website and has received a whopping 81,1…", "url": "https://in.mashable.com/science/23897/nasa-hubble-shares-stunning-image-of-arp-195-triplet-galaxies-caught-in-a-tug-of-war-game", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/28415/28415_vtch.png", "publishedAt": "2021-08-02T07:03:25Z", "content": "The National Aeronautics and Space Administration (NASA) recently shared an image of a triplet of galaxies, called Arp 195, caught in a gravitational tug-of-war game. The image has been shared by NAS… [+1853 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Maurits Kuypers", "title": "An alchemist's dream: Turning water into gold - Innovation Origins - Innovation Origins", "description": "Researchers have succeeded in turning water for a brief time into a gold-colored and metallic material with the properties of an electrical conductor.", "url": "https://innovationorigins.com/en/an-alchemists-dream-turning-water-into-gold/", "urlToImage": "https://innovationorigins.com/app/uploads/2021/08/metallwasserg.jpg", "publishedAt": "2021-08-02T07:00:00Z", "content": "Turning base metals like lead into gold is an age-old dream of alchemists. A group of researchers is taking it a step further. They have found a way to turn water into a metallic, gold-colored materi… [+3191 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Earth’s energy imbalance: Less than 1% chances for the changes to occur naturally - Tech Explorist", "description": "The major changes in earth’s climate haven’t occurred naturally.", "url": "https://www.techexplorist.com/earth-energy-imbalance-less-than-1-chances-changes-occur-naturally/40371/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/08/earth-climate.jpg", "publishedAt": "2021-08-02T06:29:06Z", "content": "Earth’s climate is determined by Earth’s energy budget, a delicate balance between how much of the Sun’s radiative energy is absorbed in the atmosphere and at the surface and how much thermal infrare… [+3153 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "KS Arpitha", "title": "Sponge fossil may be the first sign of animal life on planet Earth - Yahoo India News", "description": "A Canadian geologist found one of the earliest fossils. This Sponge fossil may be the first sign of animal life on our planet. Read to know more about the...", "url": "https://in.news.yahoo.com/sponge-fossil-may-first-sign-062335462.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/y.Iy_KPYzIMFdiL19G66Hw--~B/aD01ODU7dz0xMDQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/breezy_scroll_news_and_sports_257/ee0df4e4b482ef57b3de6e33351e2e9a", "publishedAt": "2021-08-02T06:23:35Z", "content": "A Canadian geologist found one of the earliest fossils. This Sponge fossil may be the first sign of animal life on our planet. Read to know more about the first evidence of animal life.\r\nSponge fossi… [+2043 chars]"}, {"source": {"id": null, "name": "Marketresearchtelecast.com"}, "author": null, "title": "The Olympic Games are also held on the International Space Station - Market Research Telecast", "description": "The current ones Tokyo Olympics they have many people aware of everything that the athletes of their respective countries do in each of the competitions that are held and with so much olympic spirit it ... Read more", "url": "https://marketresearchtelecast.com/the-olympic-games-are-also-held-on-the-international-space-station/118763/", "urlToImage": null, "publishedAt": "2021-08-02T06:08:03Z", "content": "The current ones Tokyo Olympics they have many people aware of everything that the athletes of their respective countries do in each of the competitions that are held and with so much olympic spirit … [+2129 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "From Blue Moon to Jupiter and Saturn appearing bigger: Celestial events in August to watch out for - Firstpost", "description": "On Wednesday and Thursday, 11 and 12 August, the Perseid meteors will perform in full glory.", "url": "https://www.firstpost.com/tech/science/from-blue-moon-to-jupiter-and-saturn-appearing-bigger-celestial-events-in-august-to-watch-out-for-9847951.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/08/20359334789_3c86a6e701_o.jpg", "publishedAt": "2021-08-02T04:49:50Z", "content": "FP TrendingAug 02, 2021 10:19:50 IST\r\nIn the month of August, stargazers and night sky watchers have a long list of exciting events lined up for them. From the blue moon to Jupiter and Saturn appeari… [+1509 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Water detected as a metal at BESSY II - Chemie.de", "description": "Under normal conditions, pure water is an almost perfect insulator. Water only develops metallic properties under extreme pressure, such as exists at most in the interior of large planets. Now, an ...", "url": "https://www.chemeurope.com/en/news/1172183/water-detected-as-a-metal-at-bessy-ii.html", "urlToImage": "https://rs1.chemie.de/images//157939-75.jpg", "publishedAt": "2021-08-02T03:21:41Z", "content": "Under normal conditions, pure water is an almost perfect insulator. Water only develops metallic properties under extreme pressure, such as exists at most in the interior of large planets. Now, an in… [+3413 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Hubble finds evidence of water vapour on Jupiter Moon - National Herald", "description": "This water vapour forms when ice from the moon's surface sublimates -- that is, turns from solid to gas. The findings are published in the journal Nature Astronomy", "url": "https://www.nationalheraldindia.com/science-and-tech/hubble-finds-evidence-of-water-vapour-on-jupiter-moon", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-07%2Ff552732e-0ba1-4729-ae60-42c8067f0060%2FHubble_finds_evidence_of_water_vapour_on_Jupiter_Moon.jpg?rect=0%2C206%2C985%2C517&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2021-08-02T02:48:00Z", "content": "Astronomers have, for the first time, uncovered evidence of water vapour in the atmosphere of Jupiter's moon Ganymede using NASA's Hubble Space Telescope.\r\nThis water vapour forms when ice from the m… [+614 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Zaini Majeed", "title": "NASA set to launch Boeing's (CST)-100 Starliner cargo spacecraft to ISS on August 3 - Republic World", "description": "“Spacecraft will carry more than 400 pounds of NASA cargo and crew supplies to ISS. It will return to Earth with more than 550 pounds of cargo,\" NASA said.", "url": "https://www.republicworld.com/technology-news/science/nasa-set-to-launch-boeings-cst-100-starliner-cargo-spacecraft-to-iss-on-august-3.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/lh0ywzmqiubg8exj_1627868481.jpeg", "publishedAt": "2021-08-02T01:45:00Z", "content": "NASA is set to launch the second uncrewed flight Boeings CST-100 Starliner spacecraft for Boeing Orbital Flight Test-2 (OFT-2) mission to the International Space Station. The mission is targeted to l… [+2239 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Luke Plunkett", "title": "Man Shocked Through Video Game Controller After Lighting Strike - Yahoo! Voices", "description": "A man from Robertson County, Tennessee was playing a video game on Saturday night during a storm when a nearby lightning strike resulted in him being shocked...", "url": "https://finance.yahoo.com/news/man-shocked-video-game-controller-233000737.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/3KEepUNwhgvQVgfuQqab.Q--~B/aD0zNTg7dz02MzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/kotaku_564/d48e0dfe51b59d9e9c425cab03d6e216", "publishedAt": "2021-08-01T23:30:00Z", "content": "A man from Robertson County, Tennessee was playing a video game on Saturday night during a storm when a nearby lightning strike resulted in him being shocked straight up the wire of his controller.\r\n… [+1536 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Anderson Anderson", "title": "NASA begins search for ancient life on Mars after arrival of Perseverance, Ingenuity spacecrafts - 60 Minutes - CBS News", "description": "Anderson Cooper reports on the nerve-wracking Mars landing of the rover Perseverance, the painstaking process of launching the tiny helicopter Ingenuity, and the extraordinary images the two have already sent back to Earth.", "url": "https://www.cbsnews.com/news/mars-life-ingenuity-helicopter-perseverance-rover-60-minutes-2021-08-01/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2021/05/09/4c529582-7e4c-4817-91a6-f60cd9697b1f/thumbnail/1200x630/4330c4e89659bf5615f1ec37ca2e57af/perseverancearticle.jpg", "publishedAt": "2021-08-01T22:55:00Z", "content": "It's been a year since the tiny helicopter Ingenuity and the one-ton rover Perseverance left planet Earth, and they've come a very long way since then. In February, they landed in a hazardous and pre… [+13943 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "RJ Pierce", "title": "Space Travel Relies Too Much on Entrepreneurs Today, And Experts Say It's Risky - Tech Times", "description": "With today's space travel being headlined by private companies, some experts say it could be a problematic setup for the future.", "url": "https://www.techtimes.com/articles/263625/20210801/space-travel-relies-too-much-on-business-owners.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/390027/space-travel-rocket.jpg", "publishedAt": "2021-08-01T20:30:00Z", "content": "Space travel companies, not government-backed space agencies such as NASA, have been headlining more missions than ever before. And according to experts, it's a very risky ordeal.  \r\nUniversity of Ch… [+3437 chars]"}, {"source": {"id": null, "name": "Fintechzoom.com"}, "author": null, "title": "Space – New book by the son of an astronaut in Austin chronicles the first untethered spacewalk - Fintech Zoom", "description": "Latest financial technology news, fintech news, fin tech news, open banking news​, banking news, blogs opinion, analysis on Fintech Zoom.", "url": "https://fintechzoom.com/fintech_news_space/space-new-book-by-the-son-of-an-astronaut-in-austin-chronicles-the-first-untethered-spacewalk/", "urlToImage": "https://fintechzoom.com/wp-content/uploads/2021/08/img.jpg", "publishedAt": "2021-08-01T17:39:21Z", "content": "Space – New book by the son of an astronaut in Austin chronicles the first untethered spacewalk\r\nEditor’s note: Addie Broyles is a longtime food writer, who wrote for the Austin American-Statesman fo… [+10903 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "Birds' brain may hold clue why they outlived other dinosaurs - The Shillong Times", "description": "New York, Aug 1 ; US researchers have discovered a new bird fossil which showed that a unique brain shape may be the reason why the ancestors of living birds survived the mass extinction that claimed all other known dinosaurs 66 million years ago.A t", "url": "https://theshillongtimes.com/2021/08/02/birds-brain-may-hold-clue-why-they-outlived-other-dinosaurs/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2021/08/Birds-brain.jpg", "publishedAt": "2021-08-01T15:07:24Z", "content": "New York, Aug 1 ; US researchers have discovered a new bird fossil which showed that a unique brain shape may be the reason why the ancestors of living birds survived the mass extinction that claimed… [+2347 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Tyler Cowen", "title": "The Future Will Be Weirder Than We Think - BloombergQuint", "description": "The Future Will Be Weirder Than We Think", "url": "https://www.bloombergquint.com/gadfly/the-future-will-be-weirder-than-we-think", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-08-01T13:05:25Z", "content": "(Bloomberg Opinion) -- How weird is the future going to be? Just a little bit or plain flat-out radically unthinkably weird? And is this future 1,000 years from now or 100?\r\nThe notion that the futur… [+4750 chars]"}, {"source": {"id": null, "name": "Newsnationusa.com"}, "author": "Noah hilton", "title": "Why Pluto was kicked off the team - News Nation USA", "description": "It was 15 years ago that Pluto was officially kicked out of the solar system. And the demotion to “dwarf planet” still stings.It was 15 years ago this month that once certified member of the solar sys", "url": "https://newsnationusa.com/news/world/australia/why-pluto-was-kicked-off-the-team/", "urlToImage": "https://content.api.news/v3/images/bin/92ee5fd80b5aa3f50adb6420f764ec94", "publishedAt": "2021-08-01T12:26:30Z", "content": "It was 15 years ago that Pluto was officially kicked out of the solar system. And the demotion to dwarf planet still stings.It was 15 years ago this month that once certified member of the solar syst… [+6034 chars]"}, {"source": {"id": null, "name": "Quebecnewstribune.com"}, "author": "Brand Story", "title": "Fractals, the strangest matter, can produce quantum clues - QNT", "description": "Your desk is It is composed of individual, different atoms, but from a distance, its surface looks very smooth. This simple idea is the core of all our physical world models. We can describe what is happening as a whole without getting caught up in the comple…", "url": "https://quebecnewstribune.com/technology/fractals-the-strangest-matter-can-produce-quantum-clues-35899/", "urlToImage": "https://media.wired.com/photos/610029016a5b5b55c0e34a1a/191:100/w_1280,c_limit/Science_Fractons_2880x1620_Lede.jpg", "publishedAt": "2021-08-01T12:00:00Z", "content": "Your desk is It is composed of individual, different atoms, but from a distance, its surface looks very smooth. This simple idea is the core of all our physical world models. We can describe what is … [+4374 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Aakansha Tandon", "title": "NASA's Mars rover captures unseen pics of Red Planet; caption it 'Mail from Mars' - Republic World", "description": "The top space and research organization had shared the pictures captured by its MARS rover named, NASA JPL Mars Reconnaissance Orbiter that had gone viral", "url": "https://www.republicworld.com/technology-news/science/nasas-mars-rover-captures-unseen-pics-of-red-planet-caption-it-mail-from-mars.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/hkhiepckveiwc8gq_1627813877.jpeg", "publishedAt": "2021-08-01T11:16:00Z", "content": "The red planet is the only planet that has the potential to prosper an atmosphere or life. Scientists around the world have stuck their eyes on it and are awaiting any significant development that ca… [+2235 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Earth's energy imbalance removes almost all doubts about man-made climate change - Space Bollyinside - BollyInside", "description": "The changes to Earth’s energy system have major ramifications for the planet’s future climate and humanity’s understanding of climate change. The", "url": "https://www.bollyinside.com/news/earths-energy-imbalance-removes-almost-all-doubts-about-man-made-climate-change", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/07/Rochdales-Planet-Earth-Exhibit-Opened-a-Whole-New-World-for.png", "publishedAt": "2021-08-01T11:14:18Z", "content": "The changes to Earths energy system have major ramifications for the planets future climate and humanitys understanding of climate change. The Princeton University researchers behind the paper found … [+3119 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "How to watch Boeing’s Starliner test flight to ISS on Tuesday - Digital Trends", "description": "NASA is gearing up for a crucial test flight of Boeing’s CST-100 Starliner spacecraft. Here's how to watch the launch on Tuesday, August 3.", "url": "https://www.digitaltrends.com/news/how-to-watch-boeing-launch-starliner-test-flight-on-friday/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/starliner_hero.jpg", "publishedAt": "2021-08-01T09:59:06Z", "content": "NASA is gearing up for a crucial test flight of Boeings CST-100 Starliner spacecraft.\r\nThe uncrewed Orbital Flight Test-2 (OFT-2) mission is set to launch at 1:20 p.m. ET on Tuesday, August 3, and wi… [+2253 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "Saman  Haziq", "title": "Dubai: Watch Saturn, Jupiter from special deck at the Palm tomorrow - Khaleej Times", "description": "The View at The Palm, the 360-degree observation deck by Nakheel, is now offering a unique opportunity to observe Saturn and Jupiter at their largest...", "url": "https://www.khaleejtimes.com/news/dubai-watch-saturn-jupiter-from-special-deck-at-the-palm-tomorrow", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20210801/ARTICLE/210809966/AR/0/AR-210809966.jpg&NCS_modified=20210801114610&exif=.jpg", "publishedAt": "2021-08-01T09:30:26Z", "content": "The View at The Palm, the 360-degree observation deck by Nakheel, is now offering a unique opportunity to observe Saturn and Jupiter at their largest and brightest on Monday, August 2 and Friday, Aug… [+1860 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "fin24", "title": "World's first commercial re-programmable satellite blasts into space - News24", "description": "The world's first commercial fully re-programmable satellite lifted off from French Guiana on Friday on board an Ariane 5 rocket, ushering in a new era of more flexible communications.", "url": "https://www.news24.com/fin24/Economy/World/worlds-first-commercial-re-programmable-satellite-blasts-into-space-20210731", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10879/241c867d1fa04e73b9c43b3ff8119966.jpg", "publishedAt": "2021-08-01T07:07:30Z", "content": "The world's first commercial fully re-programmable satellite lifted off from French Guiana on Friday on board an Ariane 5 rocket, ushering in a new era of more flexible communications.\r\nUnlike conven… [+1349 chars]"}, {"source": {"id": null, "name": "Scitation.org"}, "author": "R. Joel  England, Peter  Hommelhoff, Robert L.  Byer", "title": "Microchip accelerators: Physics Today: Vol 74, No 8 - Physics Today", "description": "An international collaboration aims to couple ultrafast lasers with integrated photonics to create chip-scale devices.", "url": "https://physicstoday.scitation.org/doi/10.1063/PT.3.4815", "urlToImage": "https://physicstoday.scitation.org/action/showOpenGraphArticleImage?doi=10.1063/PT.3.4815&id=images/medium/pt.3.4815.figures.online.pt.3.4815highlight.jpg", "publishedAt": "2021-08-01T07:04:41Z", "content": null}, {"source": {"id": null, "name": "Fintechzoom.com"}, "author": null, "title": "NOAA recovers from latest GOES-17 weather satellite issue, plans to replace it next year - NASASpaceFlight.com - Fintech Zoom", "description": "Latest financial technology news, fintech news, fin tech news, open banking news​, banking news, blogs opinion, analysis on Fintech Zoom.", "url": "https://fintechzoom.com/fintech_news_space/space-noaa-recovers-from-latest-goes-17-weather-satellite-issue-plans-to-replace-it-next-year/", "urlToImage": "https://fintechzoom.com/wp-content/uploads/2021/08/GOES-T.jpg", "publishedAt": "2021-08-01T05:41:55Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: International Space Station thrown out of control by misfire of Russian module -NASA; Russia blames software glitch after space station briefly thrown out of control and more - Devdiscourse", "description": "The Government Accountability Office (GAO) said it \"denied the protest arguments that NASA acted improperly in making a single award to SpaceX.\"", "url": "https://www.devdiscourse.com/article/technology/1674985-science-news-roundup-international-space-station-thrown-out-of-control-by-misfire-of-russian-module--nasa-russia-blames-so", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_04_2021_10_41_51_3007185.jpg?width=920&format=jpeg", "publishedAt": "2021-08-01T04:58:28Z", "content": "Following is a summary of current science news briefs.\r\nInternational Space Station thrown out of control by misfire of Russian module -NASA\r\nThe International Space Station (ISS) was thrown briefly … [+1707 chars]"}, {"source": {"id": null, "name": "Admet.net"}, "author": "admet751", "title": "Astronomers Directly Image Planet Just 35 Light Years Away - ADMET.net", "description": "", "url": "https://www.admet.net/astronomers-directly-image-planet-just-35-light-years-away/", "urlToImage": "https://www.admet.net/wp-content/uploads/2021/08/Astronomers-Directly-Image-Planet-Just-35-Light-Years-Away.jpg", "publishedAt": "2021-08-01T02:20:06Z", "content": "This website might earn affiliate commissions from the hyperlinks on this web page. Terms of use.\r\nWithin the hunt for exoplanets, astronomers are solely not often capable of look upon a world instan… [+3071 chars]"}, {"source": {"id": null, "name": "Fintechzoom.com"}, "author": null, "title": "Space – Top 5 Things to Know About NASA's Astromaterials Research and Science (ARES) Division - Fintech Zoom", "description": "Latest financial technology news, fintech news, fin tech news, open banking news​, banking news, blogs opinion, analysis on Fintech Zoom.", "url": "https://fintechzoom.com/fintech_news_space/space-top-5-things-to-know-about-nasas-astromaterials-research-and-science-ares-division/", "urlToImage": "https://fintechzoom.com/wp-content/uploads/2021/07/Apollo-17-Lunar-Sample.jpg", "publishedAt": "2021-07-31T22:25:28Z", "content": "Space – Top 5 Things to Know About NASAs Astromaterials Research and Science (ARES) DivisionA color composite mosaic showing most of the Moons surface, based on images from NASAs Lunar Reconnaissance… [+6077 chars]"}, {"source": {"id": null, "name": "TheNewsTrace"}, "author": null, "title": "Apollo 15's fiftieth Anniversary: ​​Moon Touchdown Observed In Shocking Element - TheNewsTrace", "description": "New Pictures Launched to Fox Information Display the Apollo 15 moon touchdown in exceptional element 50 years later. The footage, remastered through “Apollo Remastered” writer Andy Saunders, display the Lunar Roving Car (LRV) because it was once managed throu…", "url": "https://thenewstrace.com/apollo-15s-fiftieth-anniversary-​​moon-touchdown-observed-in-shocking-element/172498/", "urlToImage": "https://thenewstrace.com/wp-content/uploads/2021/05/WATCH-TV-CHANNELS-FREE-FILMYONE-APP.jpg", "publishedAt": "2021-07-31T22:06:06Z", "content": "New Pictures Launched to Fox Information Display the Apollo 15 moon touchdown in exceptional element 50 years later.\r\nThe footage, remastered through Apollo Remastered writer Andy Saunders, display t… [+3451 chars]"}]}