{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Birmingham Live"}, "author": "Stephanie Balloo", "title": "Samaritans at work - the listeners giving their ear to city's darkest struggles through pandemic - Birmingham Live", "description": "As people grind on with the lockdown, people are struggling with dark feelings - but there is help and support available through the pandemic", "url": "https://www.birminghammail.co.uk/news/midlands-news/samaritans-work-listeners-giving-ear-19775338", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article19775279.ece/ALTERNATES/s1200/0_Birmingham-branch-Samaritans.jpg", "publishedAt": "2021-02-21T05:30:00Z", "content": "Tucked away in a red-brick building in Birmingham city centre embellished with the words 'we're here to listen', are a team of volunteers privy to people's darkest moments.\r\nFirst launched as a 'suic… [+8527 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "‘Something we’ve never seen’ – Mars rover beams back selfie from moment before landing - The Indian Express", "description": "The picture, looking down on the rover, shows the entire vehicle suspended from three cables unspooled from the sky crane, along with an “umbilical” communications cord.", "url": "https://indianexpress.com/article/technology/science/nasa-mars-perseverance-rover-selfie-touchdown-7197791/", "urlToImage": "https://images.indianexpress.com/2021/02/mars-rover-selfie.jpg", "publishedAt": "2021-02-21T03:39:21Z", "content": "NASA scientists on Friday presented striking early images from the picture-perfect landing of the Mars rover Perseverance, including a selfie of the six-wheeled vehicle dangling just above the surfac… [+4191 chars]"}, {"source": {"id": null, "name": "SocialNews.XYZ"}, "author": "https://www.facebook.com/socialnewsxyz/", "title": "ISS launch honors 'Hidden Figures' mathematician (Video) - Social News XYZ", "description": "A space station supply ship named after the Black NASA mathematician featured in the movie Hidden Figures rocketed into orbit Saturday, the 59th anniversary of John Glenn's historic launch. (Feb. 20) Subscribe for more Breaking... - Social News XYZ", "url": "https://www.socialnews.xyz/?p=3394714", "urlToImage": "https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2017/11/16/font_previewd.png?fit=487%2C70&quality=80&zoom=1&ssl=1", "publishedAt": "2021-02-20T20:46:34Z", "content": "A space station supply ship named after the Black NASA mathematician featured in the movie Hidden Figures rocketed into orbit Saturday, the 59th anniversary of John Glenn's historic launch. (Feb. 20)… [+385 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Decode How Mars May Have Lost Its Atmosphere - NDTV", "description": "Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belief that planets need a protective magnetic field to block such harmful radiations in order to sustain life.", "url": "https://www.ndtv.com/india-news/scientists-decode-how-mars-may-have-lost-its-atmosphere-2374968", "urlToImage": "https://c.ndtvimg.com/2021-02/entffq_mars_625x300_14_February_21.jpg", "publishedAt": "2021-02-20T14:48:22Z", "content": "Scientists Decode How Mars May Have Lost Its Atmosphere\r\nNew Delhi: Solar winds may have led to Mars losing its atmosphere, according to a computer simulation study which confirms the long held belie… [+2057 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Aria Bendix", "title": "Neanderthals died out after Earth's magnetic poles flipped, causing a climate crisis 42,000 years ago, a study - Business Insider India", "description": "Earth's magnetic poles flipped 42,000 years ago, which may have triggered a global climate crisis, a new study found. The resulting changes in temperatures", "url": "https://www.businessinsider.in/science/news/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says/articleshow/81127374.cms", "urlToImage": "https://www.businessinsider.in/photo/81127374/neanderthals-died-out-after-earths-magnetic-poles-flipped-causing-a-climate-crisis-42000-years-ago-a-study-says.jpg?imgsize=779366", "publishedAt": "2021-02-20T12:34:00Z", "content": "Earth\r\n saw a lot of commotion when its magnetic poles flipped 42,000 years ago. \r\nScientists have known about the flip since the late 1960s. Earth's magnetic poles aren't static - they're generated … [+5378 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "First black hole ever detected is more massive than we thought - Tech Explorist", "description": "The research shows the system known as Cygnus X-1 contains the most massive stellar-mass black hole ever detected without the use of gravitational waves.", "url": "https://www.techexplorist.com/first-black-hole-ever-detected-massive-thought/37878/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/02/Cygnus-X-1-system.jpg", "publishedAt": "2021-02-20T07:11:51Z", "content": "Cygnus X-1 is a stellar-mass black hole- one of the closest black holes to Earth. Discovered in 1964, the object gathered the attention of a famous scientific wager between physicists Stephen Hawking… [+2743 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robin A. Smith", "title": "Time-lapse reveals the hidden dance of roots - Phys.org", "description": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a camera on rice seeds sprouting in clear gel, taking a new p…", "url": "https://phys.org/news/2021-02-time-lapse-reveals-hidden-roots.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/plantroots.jpg", "publishedAt": "2021-02-19T22:23:29Z", "content": "Duke researchers have been studying something that happens too slowly for our eyes to see. A team in biologist Philip Benfey's lab wanted to see how plant roots burrow into the soil. So they set up a… [+4705 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "AS IT HAPPENED: UAE Hope probe enters Mars' orbit - Arab News", "description": "DUBAI: The UAE’s Hope probe has entered the orbit of Mars after a six-month-long voyage into outer space. There were cheers at the Mohammed Bin Rashid Space Center when mission control received information that the manouver had been success. Abu Dhabi Crown P…", "url": "https://www.arabnews.com/node/1806206", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/09/2465401-1167535181.jpg", "publishedAt": "2021-02-09T07:32:20Z", "content": "NEW YORK CITY: When the time came for Bashar Jaafari, Syrias former UN permanent representative, to leave New York, only one person saw him off at JFK airport: his loyal office assistant.\r\nThe symbol… [+10530 chars]"}]}