{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Armless, but Not Harmless: Bizarre New Dinosaur Species Discovered in Argentina - SciTechDaily", "description": "A new dinosaur which formed part of an array of \"unusual\" creatures has been discovered in Argentina. The new species, Guemesia ochoai, could be the close relative of the ancestors of an armless group of dinosaurs, which roamed the southern hemisphere over 70…", "url": "https://scitechdaily.com/armless-but-not-harmless-bizarre-new-dinosaur-species-discovered-in-argentina/", "urlToImage": "https://scitechdaily.com/images/Carnotaurus-sastrei-scaled.jpg", "publishedAt": "2022-02-26T22:12:48Z", "content": "Guemesia ochoai could have looked similar to relatives such as Carnotaurus sastrei (pictured). Credit: © Fred Wierum, licensed under CC BY-SA 4.0 via Wikimedia Commons\r\nA new dinosaur which formed pa… [+6978 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "NANCY ATKINSON, Universe Today", "title": "Curiosity Rover Snapped This Photo of a Tiny And Delicate Mineral 'Flower' on Mars - ScienceAlert", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a min", "url": "https://www.sciencealert.com/curiosity-rover-snapped-this-photo-of-a-tiny-and-delicate-mineral-flower-on-mars", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/BlackthornSaltMineralFormationOnMars_1024.jpg", "publishedAt": "2022-02-26T21:02:51Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2409 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Mysterious repeating fast radio burst from space looks strangely familiar, scientists realize - Space.com", "description": "The powerful signals might be coming from a magnetar.", "url": "https://www.space.com/galactic-burst-m81-crab-nebula", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UW6b9zmuTrMv7o8oHZD5YL-1200-80.png", "publishedAt": "2022-02-26T12:05:23Z", "content": "Scientists got a strange sense of déjà vu when they took a close look at a mysterious series of bright flashes in a galaxy just 12 million light-years away.\r\nThe flashes, known as a repeating fast ra… [+4303 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Identify Real-Life Planet With Two Suns – Like “Tatooine” From Star Wars - SciTechDaily", "description": "Study proves ground-based telescopes can search for planets with two suns. Astronomers have used a new technique to confirm a real-life Tatooine, the fictional planet with two suns that was home to Luke Skywalker in “Star Wars.” The planet, Kepler-16b, is abo…", "url": "https://scitechdaily.com/astronomers-identify-real-life-planet-with-two-suns-like-tatooine-from-star-wars/", "urlToImage": "https://scitechdaily.com/images/Kepler-16b-1-scaled.jpg", "publishedAt": "2022-02-26T11:43:04Z", "content": "Artist’s impression of Kepler-16b, the first planet known to definitively orbit two stars – what’s called a circumbinary planet. The planet, which can be seen in the foreground, was discovered by NAS… [+4663 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "New sky map showcases more than 4 million galaxies, stars and other objects - Space.com", "description": "That's from one team's examination of just one-quarter of the northern sky.", "url": "https://www.space.com/sky-map-showcases-4-million-galaxies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zyir8zrX7nrxavESEDf3FY-1200-80.jpg", "publishedAt": "2022-02-26T11:00:51Z", "content": "This video still of data shows the most detailed ever view of our radio universe as revealed by LOFAR, which built a map of 4.4 million galaxies. (Image credit: LOFAR/Frits Sweijen)\r\nMillions of new … [+2150 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Spaceflight doesn’t just change astronauts’ bodies, it also rewires their brains - Syfy", "description": "It’s been more than 50 years since humans first left our planet and ventured into the reaches of space. Hundred of astronauts and cosmonauts have orbited the Earth and a select few have journeyed to the Moon to circle that desolate globe or set boots down on …", "url": "https://www.syfy.com/syfy-wire/spaceflight-doesnt-just-change-astronauts-bodies-it-also-rewires-their-brains", "urlToImage": "https://www.syfy.com/sites/syfy/files/2022/02/gettyimages-200171095-001.jpg", "publishedAt": "2022-02-25T23:10:04Z", "content": "Its been more than 50 years since humans first left our planet and ventured into the reaches of space. Hundred of astronauts and cosmonauts have orbited the Earth and a select few have journeyed to t… [+4147 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "2 Supermassive Black Holes Are Locked in The Tightest Orbit We've Seen Yet - ScienceAlert", "description": "A dance of death is taking place at the heart of a galaxy in the distant Universe.", "url": "https://www.sciencealert.com/two-supermassive-black-holes-have-been-found-locked-in-the-tightest-orbit-yet", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/binary-supermassive-black-hole_1024.jpg", "publishedAt": "2022-02-25T23:01:06Z", "content": "A dance of death is taking place at the heart of a galaxy in the distant Universe.\r\nSome 10 billion light-years away, two supermassive black holes are locked in an orbit so tight that they will colli… [+4362 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Claire Cameron", "title": "NASA gives a tantalizing preview of how the Webb Telescope will see stars - Inverse", "description": "The James Webb Space Telescope is inching closer to being able to image the universe as never before. On Friday, NASA announced it had met two major milestones on the way to producing its first science images.", "url": "https://www.inverse.com/science/webb-mirror-alignment-milestone", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/2/25/8888b5ff-5f4b-4f81-bfbf-587a07e703bb-postimagestacking-1536x1536.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-25T22:03:18Z", "content": "The \r\nJames Webb\r\n Space Telescope is slowly finding its focus. On February 25, the Webb Telescope team released new images that show how well Webbs mirror alignment is going, including its first sta… [+3604 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Ben Cost", "title": "27 million people linked in largest-ever family tree - New York Post ", "description": "It’s the grand sequoia of family trees.", "url": "https://nypost.com/2022/02/25/world-record-family-tree-links-27-million-people/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/02/scientists-largest-family-tree-03.jpg?quality=90&strip=all&w=1024", "publishedAt": "2022-02-25T21:32:00Z", "content": "It’s the grand sequoia of family trees. \r\nResearchers at the University of Oxford’s Big Data Institute have created the largest-ever family tree, which links more than 27 million people — both living… [+3947 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "SpaceX makes its case for space sustainability with latest Starlink launch - SpaceNews", "description": "SpaceX launched another set of Starlink satellites Feb. 25 as the company argues its satellite constellation is consistent with space sustainability.", "url": "https://spacenews.com/spacex-makes-its-case-for-space-sustainability-with-latest-starlink-launch/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/02/f9-starlink-20220225.jpg", "publishedAt": "2022-02-25T20:48:38Z", "content": "WASHINGTON SpaceX launched another set of Starlink satellites Feb. 25 as the company argues its satellite constellation is consistent with the safe and sustainable use of low Earth orbit.\r\nA Falcon 9… [+3924 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Biggest bacterium ever discovered amazes scientists with its complexity - Livescience.com", "description": "A newfound bacterium is bigger than a fruit fly.", "url": "https://www.livescience.com/biggest-bacterium-ever-discovered-complex", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nQNbSjhpzr54VkHpTHAXQZ-1200-80.jpg", "publishedAt": "2022-02-25T20:02:10Z", "content": "Scientists discovered an absolutely massive bacterium that can be seen without the aid of a microscope and lurks among the mangroves of Grande-Terre in the Caribbean, Science magazine reported\r\n.\r\nTh… [+2439 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Mike Brown", "title": "SpaceX Mars City: New study solves a major problem with living off-Earth - Inverse", "description": "New research reveals that electrolysis does work at lower gravitational levels. The findings could support the idea that humans could travel to Mars, use the planet's resources to refuel, and return home.", "url": "https://www.inverse.com/innovation/mars-city-moon-electrolysis", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2020/1/29/abfc9008-c87b-49c0-b3a0-6f77ef794ad9-shutterstock-731611657.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-02-25T20:00:25Z", "content": "Humanity could establish\r\nbases on other planets and guarantee their supply of oxygen using new techniques discovered here on Earth. \r\nThe discovery \r\n Research published earlier this month reveals t… [+3939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Death Spiral: A Black Hole Spins on Its Side – “Completely Unexpected” - SciTechDaily", "description": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding challenges current theoretical models of black hole formati…", "url": "https://scitechdaily.com/death-spiral-a-black-hole-spins-on-its-side-completely-unexpected/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Binary-System-MAXI-J1820-070.gif", "publishedAt": "2022-02-25T18:15:38Z", "content": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding… [+4163 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Kenneth Chang", "title": "Venus Shows Its Hot, Cloudy Side - The New York Times", "description": "The Parker Solar Probe captured images of a glowing red surface during flybys.", "url": "https://www.nytimes.com/2022/02/25/science/venus-photos-nasa.html", "urlToImage": "https://static01.nyt.com/images/2022/02/25/science/25sci-venus-promo/25sci-venus-promo-facebookJumbo-v2.jpg", "publishedAt": "2022-02-25T17:51:07Z", "content": "The single camera instrument, known as the Wide-Field Imager for Parker Solar Probe, or WISPR, is not designed to look directly at the sun, which is far too bright, especially at close distances. Rat… [+1073 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "New Quantum Gravity Sensor Can Look Under Earth's Surface in Unprecedented Detail - ScienceAlert", "description": "Scientists would be able to discover much more about what lies underground if our planet could be sliced open and viewed as a cross-section – but as that's not really possible, they have to rely on a variety of other methods instead.", "url": "https://www.sciencealert.com/quantum-gravity-sensor-enables-us-to-look-under-earth-s-surface-in-scientific-first", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/AbstractBlueWavesOnADarkBackground_1024.jpg", "publishedAt": "2022-02-25T17:00:46Z", "content": "Scientists would be able to discover much more about what lies underground if our planet could be sliced open and viewed as a cross-section but as that's not really possible, they have to rely on a v… [+3454 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Joshua Rapp Learn", "title": "The Pacific Spiny Lumpsucker Is Armed to the Teeth - The New York Times", "description": "The diminutive predator is a terrible swimmer but thrives in the intertidal zone thanks to odd evolutionary adaptation.", "url": "https://www.nytimes.com/2022/02/25/science/pacific-spiny-lumpsucker-fish.html", "urlToImage": "https://static01.nyt.com/images/2022/02/16/science/00SCI-LUMPSUCKER-promo/00SCI-LUMPSUCKER-promo-facebookJumbo.jpg", "publishedAt": "2022-02-25T15:00:15Z", "content": "The young, once hatched, sink to the sea floor and grasp onto something with their fully developed suction cups. They just stick there for a while, like, This is my safe spot, this is where I go, Ms.… [+1401 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA's daring Parker Solar Probe spacecraft zips past the sun again today - Space.com", "description": "It will zoom close to 5 million miles from the sun's surface.", "url": "https://www.space.com/parker-solar-probe-close-approach-february-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uHo6oES2T6nxjgNwJek8vV-1200-80.jpg", "publishedAt": "2022-02-25T12:16:07Z", "content": "The Parker Solar Probe is ready to make its 11th close flyby of the sun during its quest to understand how our neighboring star works.\r\nThe plucky spacecraft, heavily shielded against the sun's radia… [+2403 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Max Gorbachev", "title": "Scientists Claim to Have Cracked the Mystery of King Tutankhamun’s Dagger 'From Space' - Sputnik International", "description": "Commonly referred to as King Tut, he was the last representative of the 18th Dynasty, which ruled Egypt from around 1550 BC to 1292 BC. King Tut is credited with restoring ancient Egyptian religion following its dissolution by his father Pharaoh Akhenaten. He…", "url": "https://sputniknews.com/20220225/scientists-claim-to-have-cracked-the-mystery-of-king-tutankhamuns-dagger-from-space-1093359374.html", "urlToImage": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1093359374.jpg?10761666691645784170", "publishedAt": "2022-02-25T10:16:00Z", "content": "https://sputniknews.com/20220225/scientists-claim-to-have-cracked-the-mystery-of-king-tutankhamuns-dagger-from-space-1093359374.html\r\nScientists Claim to Have Cracked the Mystery of King Tutankhamuns… [+4717 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New simulations refine axion mass, refocusing dark matter search - Phys.org", "description": "Physicists searching—unsuccessfully—for today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were produced shortly after the Big Bang 13.6 billion years ago.", "url": "https://phys.org/news/2022-02-simulations-refine-axion-mass-refocusing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-simulations-refine.jpg", "publishedAt": "2022-02-25T10:00:09Z", "content": "Physicists searchingunsuccessfullyfor today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were p… [+11546 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Fossils on forgotten continent give clues about mammal evolution - Business Insider", "description": "Fossil records show the land once hosted distinct species like marsupials and hippo-like mammals, before other animals took over.", "url": "https://www.businessinsider.com/forgotten-continent-balkanatolia-mammals-fossils-asia-europe-2022-2", "urlToImage": "https://i.insider.com/6216870a45889c0019d1f806?width=1200&format=jpeg", "publishedAt": "2022-02-24T10:33:00Z", "content": "Scientists didn't expect to stumble upon the remains of a forgotten continent in the Balkans and Anatolia, a peninsula in western Asia. Instead, they were to hoping to solve a mystery: Fossils from t… [+4078 chars]"}]}