{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Steven Lee Myers", "title": "She Is Breaking Glass Ceilings in Space, but Facing Sexism on Earth - The New York Times", "description": "Sanitary pads and makeup: A Chinese astronaut’s six-month stay aboard the country’s space station has revealed conflicted cultural values toward gender.", "url": "https://www.nytimes.com/2021/10/23/world/asia/china-space-women.html", "urlToImage": "https://static01.nyt.com/images/2021/10/23/world/23space-sexism1/23space-sexism1-facebookJumbo.jpg", "publishedAt": "2021-10-23T09:00:15Z", "content": "In highly scripted appearances in state media, Colonel Wang has expressed pride in her accomplishments as the second Chinese woman in space, and the first to go twice.\r\nColonel Wang grew up in Yantai… [+1037 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "What Happens if 4 Electrons Join Up? A Brand New State of Matter Says a Recent Study - ScienceAlert", "description": "Almost 20 years after researchers first predicted electron quadruplets, evidence of their existence has been shown to occur in experimental setups, representing a brand new state of matter that opens up a whole new field of possibilities in physics.", "url": "https://www.sciencealert.com/experiments-have-revealed-a-brand-new-state-of-matter-electron-quadruplets", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/AbstractRepresentationOfQuantumWaveWithSparkesAndSwirls_1024.jpg", "publishedAt": "2021-10-23T00:00:48Z", "content": "Almost 20 years after researchers first predicted electron quadruplets, evidence of their existence has been shown to occur in experimental setups, representing a brand new state of matter that opens… [+2821 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Amanda Morris", "title": "Why Can’t Astronauts Have Disabilities? 12 Flyers Search for Proof They Can. - The New York Times", "description": "People with different types of disabilities tested their skills and technologies on a zero-gravity research flight with the goal of proving that they can safely go to space.", "url": "https://www.nytimes.com/2021/10/22/science/astronauts-disabilities-astroaccess.html", "urlToImage": "https://static01.nyt.com/images/2021/10/26/science/22sci-astronauts1/22sci-astronauts1-facebookJumbo.jpg", "publishedAt": "2021-10-22T23:37:32Z", "content": "My biggest takeaway from this is my initial reaction of, Oh my goodness, this is going to be hard, was wrong, he said. They didnt need a lot of extra stuff.\r\nBut moving around the plane was not witho… [+1196 chars]"}, {"source": {"id": null, "name": "WGAL Susquehanna Valley Pa."}, "author": "Susan Shapiro", "title": "Lancaster County trucking company transports James Webb Space Telescope - WGAL Susquehanna Valley Pa.", "description": "Lester Summers Trucking hauled the James Webb Space Telescope to California, where it was put on a barge for its journey to a space center in French Guiana.", "url": "https://www.wgal.com/article/lancaster-county-trucking-company-transports-james-webb-space-telescope/38040900", "urlToImage": "https://kubrick.htvapps.com/vidthumb/images/james-webb-space-telescope-1634941719.jpg?crop=1xw:1xh;center,top&resize=1200:*", "publishedAt": "2021-10-22T22:49:00Z", "content": "EPHRATA, Pa. —After years of delays, a space telescope is set to launch from a space center in South America.\r\nA Lancaster County trucking company and its drivers played a big role in getting the tel… [+1373 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Fundamental Physics? Unexplainable Phenomena From Large Hadron Collider Experiment - SciTechDaily", "description": "Results announced by the LHCb experiment at CERN have revealed further hints for phenomena that cannot be explained by our current theory of fundamental physics. In March 2020, the same experiment released evidence of particles breaking one of the core princi…", "url": "https://scitechdaily.com/new-fundamental-physics-unexplainable-phenomena-from-large-hadron-collider-experiment/", "urlToImage": "https://scitechdaily.com/images/Typical-LHCb-Event-Fully-Reconstructed.jpg", "publishedAt": "2021-10-22T21:33:02Z", "content": "ByUniversity of CambridgeOctober 22, 2021\r\nA typical LHCb event fully reconstructed. Particles identified as pions, kaon, etc. are shown in different colors. Credit: CERN, LHCb Collaboration\r\nResults… [+5310 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers discover infant planet - Phys.org", "description": "One of the youngest planets ever found around a distant infant star has been discovered by an international team of scientists led by University of Hawaiʻi at Mānoa faculty, students, and alumni.", "url": "https://phys.org/news/2021-10-astronomers-infant-planet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/infant-planet-discover.jpg", "publishedAt": "2021-10-22T21:16:39Z", "content": "One of the youngest planets ever found around a distant infant star has been discovered by an international team of scientists led by University of Hawaii at Mnoa faculty, students, and alumni.\r\nThou… [+3496 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "If you ever wanted to help find new planets, now’s your chance - Ars Technica", "description": "Scientists ask the public for help in figuring out which signals are real.", "url": "https://arstechnica.com/science/2021/10/zooniverse-wants-to-turn-you-into-a-planet-hunter/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/ngts_scopes-760x380.jpg", "publishedAt": "2021-10-22T20:56:19Z", "content": "Enlarge/ The telescope array of the Next Generation Transit Survey.\r\n22 with 18 posters participating\r\nIf you've ever wanted to search for distant worlds, your time has come. The team behind a planet… [+3621 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Orion Spacecraft for Artemis I Is on the Move on This Week @NASA – October 22, 2021 - NASA", "description": "The Orion spacecraft for Artemis I is on the move, critical hardware for Artemis II is delivered, and a new telescope to study our Milky Way … a few of the s...", "url": "https://www.youtube.com/watch?v=dP4KkSEdvjM", "urlToImage": "https://i.ytimg.com/vi/dP4KkSEdvjM/maxresdefault.jpg", "publishedAt": "2021-10-22T19:59:03Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Experiments confirm a quantum material's unique response to circularly polarized laser light - Phys.org", "description": "When the COVID-19 pandemic shut down experiments at the Department of Energy's SLAC National Accelerator Laboratory early last year, Shambhu Ghimire's research group was forced to find another way to study an intriguing research target: quantum materials know…", "url": "https://phys.org/news/2021-10-quantum-material-unique-response-circularly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/experiments-confirm-a.jpg", "publishedAt": "2021-10-22T18:36:35Z", "content": "When the COVID-19 pandemic shut down experiments at the Department of Energy's SLAC National Accelerator Laboratory early last year, Shambhu Ghimire's research group was forced to find another way to… [+5381 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Chemists discover mechanism in controlled growth of tetrahedron-shaped nanoparticles - Phys.Org", "description": "Nature clearly likes symmetry. Look at your own hands, for example. But sometimes nature produces asymmetric things, and the reasons aren't always clear.", "url": "https://phys.org/news/2021-10-chemists-mechanism-growth-tetrahedron-shaped-nanoparticles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/this-pyramid-scheme-co.jpg", "publishedAt": "2021-10-22T18:28:00Z", "content": "Nature clearly likes symmetry. Look at your own hands, for example. But sometimes nature produces asymmetric things, and the reasons aren't always clear.\r\nRice University chemist Matthew Jones and hi… [+4354 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Rahul Rao", "title": "NASA wants to buy more astronaut rides on private spaceships - Space.com", "description": "NASA wants more private-sector firms to ferry its astronauts up into space, including missions to and from the International Space Station.", "url": "https://www.space.com/nasa-commercial-crew-more-private-spaceships", "urlToImage": "https://cdn.mos.cms.futurecdn.net/saFP5pwfBUmLVFTThCFePD-1200-80.jpg", "publishedAt": "2021-10-22T18:18:42Z", "content": "NASA wants more private-sector firms to ferry astronauts up into space, including missions to and from the International Space Station. The agency has put out a request for information, an initial st… [+2555 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Hear sounds from Mars captured by NASA's Perseverance rover - Space.com", "description": "The mission has recorded five hours of audio since landing in February.", "url": "https://www.space.com/perseverance-mars-rover-sounds", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Xzfe6tgAbT4Kdbng84rWqA-1200-80.jpg", "publishedAt": "2021-10-22T17:57:08Z", "content": "After the Perseverance mission picked up five hours from sounds on Mars, engineers are starting to get a sense of how the Red Planet sounds different from Earth.\r\nNASA now has a website filling up wi… [+3620 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Earth Bombardment Model: How Asteroid and Comet Strikes May Have Delayed Evolution of the Atmosphere - SciTechDaily", "description": "Study finds collisions that stalled oxygen growth on planet more common than thought. Between 2.5 and 4 billion years ago, a time known as the Archean eon, Earth’s weather could often be described as cloudy with a chance of asteroid. Back then, it was not unc…", "url": "https://scitechdaily.com/new-earth-bombardment-model-how-asteroid-and-comet-strikes-may-have-delayed-evolution-of-the-atmosphere/", "urlToImage": "https://scitechdaily.com/images/Planetary-Bombardment-Model.gif", "publishedAt": "2021-10-22T17:24:46Z", "content": "A Southwest Research Institute-led team updated planetary bombardment models with the latest geologic information and then applied those models to understand how impacts may have affected oxygen leve… [+5472 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Weird stellar remnant may be from one of the first stars in the universe - Livescience.com", "description": "Astronomers recently identified an unusual star that most likely formed from the hypernova remains of one of the universe's first stars.", "url": "https://www.livescience.com/evidence-of-first-stars-in-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XcDbyKvKcbvcvqZmAbqinG-1200-80.jpg", "publishedAt": "2021-10-22T17:00:27Z", "content": "An artist's impression of a red giant star undergoing a hypernova explosion. (Image credit: Shutterstock)\r\nAstronomers have detected an extremely unusual star that they believe is a stellar fossil, o… [+5286 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Neel V. Patel", "title": "Could Battery Made From Trees Replace Lithium-Ion in Electric Cars - The Daily Beast", "description": "Most green vehicles run on lithium-ion batteries, which are made from toxic materials. Is there an alternative?", "url": "https://www.thedailybeast.com/could-battery-made-from-trees-replace-lithium-ion-in-electric-cars", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_114/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1634920202/car-gf40644fe5_1920_mbjdah", "publishedAt": "2021-10-22T16:33:45Z", "content": "Electric cars are supposed to help the world go green and stop hurting the planet. Engineers at Brown University and the University of Maryland are taking that goal to another other level, with a new… [+1692 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Strange white dwarf switches 'on' and 'off' in front of astronomers - Space.com", "description": "Scientists spotted the star's behavior using a planet-hunting satellite.", "url": "https://www.space.com/white-dwarf-turns-on-and-off", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AzrzF88yttdoa5mYoTiGHP-1200-80.png", "publishedAt": "2021-10-22T16:18:49Z", "content": "A spacecraft that usually seeks new worlds saw a white dwarf suddenly switch \"off\" with a swift drop in brightness. Then it switched back on again.\r\nThis observation represents the first time astrono… [+3631 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Data suggests oil giants are not looking very hard to find ways to reduce their carbon footprint - Phys.org", "description": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journal Science highlighting the lack of effort by the world's lar…", "url": "https://phys.org/news/2021-10-oil-giants-hard-ways-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/data-suggests-oil-gian.jpg", "publishedAt": "2021-10-22T14:30:01Z", "content": "A small team of environmentalists from the London School of Economics and the Political Science Organization for Economic Co-operation and Development has published a Policy Forum piece in the journa… [+2880 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Astronomers spot a star 60 million light years from Earth dying and going supernova in REAL-TIME - Daily Mail", "description": "Astronomers have  witnessed for the first time a star dying and going supernova, using the Hubble Space Telescope and NASA's TESS telescope.", "url": "https://www.dailymail.co.uk/sciencetech/article-10120483/Astronomers-spot-star-60-million-light-years-Earth-dying-going-supernova-REAL-TIME.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/22/14/49511605-0-image-a-43_1634910174432.jpg", "publishedAt": "2021-10-22T14:06:52Z", "content": "Astronomers using the Hubble Space Telescope and other space-peering instruments have witnessed for the first time a star dying 60 million light-years away and going supernova in 'real-time,' which m… [+5574 chars]"}, {"source": {"id": null, "name": "The Denver Channel"}, "author": "Scripps National", "title": "Fireball spotted in Midwest wasn't a meteor, but a failed satellite - The Denver Channel", "description": "Stargazers in the Midwest spotted a fireball in the night sky this week, but the bright streak actually turned out not to be a meteor.", "url": "https://www.thedenverchannel.com/lifestyle/fireball-spotted-in-midwest-wasnt-a-meteor-but-a-failed-satellite", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/ad3693d/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fdf%2Ff3%2F4d6365ba49a2ab40dccd546ac8af%2Ffireball.jpg", "publishedAt": "2021-10-22T12:53:00Z", "content": "ANN ARBOR, Mich. Stargazers in the Midwest spotted a fireball in the night sky this week, but the bright streak actually turned out not to be a meteor.\r\nNASA said the long-lasting fireball seen Tuesd… [+1042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Patagonian fossils show Jurassic dinosaur had the herd mentality - CNN", "description": "A vast trove of fossils unearthed in Argentina's southern Patagonia region is offering the oldest-known evidence that some dinosaurs thrived in a complex and well-organized herd structure, with adults caring for the young and sharing a communal nesting ground.", "url": "https://www.cnn.com/2021/10/22/world/patagonian-fossils-jurassic-dinosaur-herd-mentality-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211022074532-patagonia-fossilized-egg-jurassic-dinosaur-super-tease.jpg", "publishedAt": "2021-10-22T12:41:00Z", "content": "(CNN)A vast trove of fossils unearthed in Argentina's southern Patagonia region is offering the oldest-known evidence that some dinosaurs thrived in a complex and well-organized herd structure, with … [+3568 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Engineers develop flexible, self-healing material to protect steel from the elements - Phys.org", "description": "An insulator of sulfur and selenium made with flexible devices in mind may have found its true destiny: As an anticorrosive coating for steel.", "url": "https://phys.org/news/2021-10-flexible-self-healing-material-steel-elements.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/engineers-develop-flex.jpg", "publishedAt": "2021-10-22T12:17:55Z", "content": "An insulator of sulfur and selenium made with flexible devices in mind may have found its true destiny: As an anticorrosive coating for steel.\r\nThe compound developed by the Rice University lab of ma… [+3935 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Small galaxy consumes an even smaller galaxy - EarthSky", "description": "Scientists found evidence that a small galaxy - the Large Magellanic Cloud, a satellite of the Milky Way - has", "url": "https://earthsky.org/space/small-galaxy-eats-smaller-galaxy-lmc/", "urlToImage": "https://earthsky.org/upl/2021/10/Large_Magellanic_Cloud_VISTA-ESO.jpg", "publishedAt": "2021-10-22T12:13:02Z", "content": "At left is NGC 2005, a globular star cluster. At right is the dwarf galaxy near our Milky Way that carries the name Large Magellanic Cloud. Scientists believe NGC 2005 was once part of a small galaxy… [+3437 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Earth may be trapped inside a giant magnetic tunnel - Livescience.com", "description": "Scientists made the startling discovery by plugging radio wave observations into a brand-new computer model.", "url": "https://www.livescience.com/earth-inside-giant-magnetic-tunnel", "urlToImage": "https://cdn.mos.cms.futurecdn.net/njszMaeFX4A7wFA7urtcxH-1200-80.jpg", "publishedAt": "2021-10-22T11:49:52Z", "content": "Our planet, along with the rest of the solar system and some nearby stars, may be trapped inside a giant magnetic tunnel — and astronomers don't know why. \r\nA tube of vast magnetized tendrils, 1,000 … [+5138 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China's Mars rover successfully survives solar outage, to continue trek of scientific exploration - Global Times", "description": "China's Zhurong Mars rover - the country's first deep-space probe exploring the Red Planet - has once again embarked on its trek of scientific exploration after safely surviving almost a month of solar outage, during which time the probe lost contact with the…", "url": "https://www.globaltimes.cn/page/202110/1237041.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-10-22/3e832039-bed4-455a-90d5-6072bd0c7c72.jpeg", "publishedAt": "2021-10-22T07:42:00Z", "content": "Photo released on June 11, 2021 by the China National Space Administration (CNSA) shows a selfie of China's first Mars rover Zhurong with the landing platform. (CNSA/Handout via Xinhua)\r\nChina's Zhur… [+3993 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "When and why did human brains decrease in size 3,000 years ago? Ants may hold clues - Phys.org", "description": "The brain is the most complex organ in the human body. Now, a new study has brought us closer to understanding some of its evolution. It shows that human brains decreased in size approximately 3,000 years ago. By studying ants as models to illustrate why brai…", "url": "https://phys.org/news/2021-10-human-brains-decrease-size-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/10-brain.jpg", "publishedAt": "2021-10-22T04:10:01Z", "content": "The brain is the most complex organ in the human body. Now, a new study has brought us closer to understanding some of its evolution. It shows that human brains decreased in size approximately 3,000 … [+4935 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "Scientists made a wooden knife that's three times sharper than steel blades - CNET", "description": "Hardened wood slices through steak like a hot (steel) knife through butter.", "url": "https://www.cnet.com/news/scientists-made-a-wooden-knife-thats-three-times-sharper-than-steel-blades/", "urlToImage": "https://www.cnet.com/a/img/LK8EgrefN_q3Iyz3LxRARGtOJYM=/1200x630/2021/10/20/c6e62ea4-aeee-47d1-b648-6fdde7d3ee4d/knife1-15.jpg", "publishedAt": "2021-10-22T03:37:09Z", "content": "You've never used a wooden knife like this.\r\nBo Chen\r\nI've been to enough fairs and foodie festivals to know the wooden knife and fork you get with your semi-hot duck fries are dismal excuses for cut… [+2332 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Andy Meek", "title": "Something unexpected and special is happening to Uranus this week - BGR", "description": "Here's how you can catch a rare glimpse of Uranus in the sky this week, thanks to the advent of the so-called Hunter's Moon.", "url": "https://bgr.com/science/something-unexpected-and-special-is-happening-to-uranus-this-week/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/10/rsz_adobestock_318700318.jpg?quality=82&strip=all", "publishedAt": "2021-10-22T02:18:00Z", "content": "According to the Old Farmer’s Almanac, the dazzlingly bright and full moon many of us saw last night — and which should continue for a few more nights — is called the Hunter’s Moon for an obvious rea… [+2428 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Monisha Ravisetti", "title": "'Monster' dinosaur fossil may not belong to vicious raptor-like predator - CNET", "description": "Scientists thought they found footprints of the Triassic period's \"largest meat-eating dinosaur.\" Nope. The steps belonged to a tender vegetarian.", "url": "https://www.cnet.com/news/monster-dinosaur-fossil-may-not-belong-to-vicious-raptor-like-predator/", "urlToImage": "https://www.cnet.com/a/img/3x0YbflVcPKdDrJqLIXb0GZWX3o=/1200x630/2021/10/20/589f4bf7-760b-4a47-9534-b18acd03045c/prosauropod-cropped.jpg", "publishedAt": "2021-10-22T02:00:03Z", "content": "A reconstruction of the herbivorous dinosaurs, prosauropods, based on 220-million-year-old fossil footprints from Ipswich, Queensland, Australia.\r\nAnthony Romilio\r\nIn the 1960s, a crew of Australian … [+3705 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Russian cargo ship completes novel 28-hour docking port move at space station - Space.com", "description": "An uncrewed Russian cargo ship will begin swapping parking spots at the International Space Station tonight (Oct. 20) in a move that will take just over a day to reach its new berth.", "url": "https://www.space.com/russian-progress-78-cargo-ship-iss-docking-port-swap", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TLhs4VyisEQ5Hd3LhwriEC-1200-80.jpg", "publishedAt": "2021-10-22T01:16:39Z", "content": "An uncrewed Russian cargo ship completed a day-long parking spot swap at the International Space Station early Friday (Oct. 22) to move to a new berth on the orbiting lab's newest laboratory module.\r… [+3517 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Explosive star death witnessed by Hubble could help develop an early warning system - CNN", "description": "Astronomers had an unprecedented front-row seat to watch the explosive death of a star 60 million light-years away using the Hubble Space Telescope. These observations reveal what happens before a star dies and could help develop an early warning system.", "url": "https://www.cnn.com/2021/10/21/world/hubble-telescope-doomed-star-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211021133730-interacting-butterfly-galaxies-super-tease.jpg", "publishedAt": "2021-10-21T20:06:00Z", "content": null}, {"source": {"id": null, "name": "The Indianapolis Star"}, "author": "Rashika Jaipuriar, The Indianapolis Star", "title": "Fireball over Hamilton County was not a meteor. Here's what it was. - IndyStar", "description": "A Fishers resident captured a bright, flying object in the sky. Experts explain what it could have been.", "url": "https://www.indystar.com/story/news/local/2021/10/21/orionid-meteor-shower-tonight-indiana/6116695001/", "urlToImage": "https://www.gannett-cdn.com/-mm-/3a5039cc05c258f95280dd2bbb10675d4e52286a/c=0-140-3500-2109/local/-/media/2020/10/20/NewBedford/ghows-NB-201029975-71de3a9c.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2021-10-21T19:57:38Z", "content": "Just after midnight Thursday, Clayton Thompson was sitting outside his Fishers home when he saw something he \"couldn't believe.\" \r\n\"It was gigantic,\" Thompson told IndyStar. \"A blaze in the sky, almo… [+4369 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Evidence of a Giant Impact in Nearby Star System Stripping the Atmosphere From a Planet - SciTechDaily", "description": "Such planetary smashups are likely common in young solar systems, but they haven’t been directly observed. Young planetary systems generally experience extreme growing pains, as infant bodies collide and fuse to form progressively larger planets. In our own s…", "url": "https://scitechdaily.com/evidence-of-a-giant-impact-in-nearby-star-system-stripping-the-atmosphere-from-a-planet/", "urlToImage": "https://scitechdaily.com/images/Giant-Planet-Impact-Strips-Atmosphere.jpg", "publishedAt": "2021-10-21T19:24:10Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyOctober 21, 2021\r\nAn MIT-led team has discovered evidence of a giant impact in the nearby HD 17255 star system, in which an Earth-sized terrestria… [+7820 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "China brought the first moon rocks back to Earth in 45 years. They hint at mysterious volcanic eruptions. - Yahoo News", "description": "China brought the first moon samples to Earth since 1976. They're lava remnants from a mysterious volcanic eruption 2 billion years ago.", "url": "https://www.businessinsider.com/china-brought-moon-samples-to-earth-from-volcanic-eruptions-2021-10", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3wQ2Vk88zg_Ss4xevSBk4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://s.yimg.com/uu/api/res/1.2/TrCi8FCo2t7tDg3VxaMb1A--~B/aD0yMDAwO3c9MjY2NjthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/business_insider_articles_888/8f4c3f3811fce58461f8c18682936a74", "publishedAt": "2021-10-21T18:09:17Z", "content": "Lunar samples from the Chang'e-5 mission at the Institute of Geology and Geophysics of the Chinese Academy of Sciences in Beijing, October 15, 2021. Jin Liwang/Xinhua/Getty Images\r\nVolcanoes on the m… [+3886 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Climate Change Wiped Out the Mammoth, New DNA Study Shows - Gizmodo", "description": "A decade-long study of environmental DNA indicates that glacial melt may have doomed the hairy animals.", "url": "https://gizmodo.com/climate-change-wiped-out-the-mammoth-new-dna-study-sho-1847909083", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/c108581771c9135698dc12679f466f3c.jpg", "publishedAt": "2021-10-21T17:20:00Z", "content": "Humans are very rarely the good guys in extinction narratives, given our proclivity for pushing species to the brink of extinction, and often over it. But were almost certainly absolved of guilt in t… [+3778 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "Critics and supporters come out in force to discuss SpaceX’s plans to launch from South Texas - The Verge", "description": "On October 18th and October 20th, the Federal Aviation Administration conducted two virtual town halls to hear comments from the public about the agency’s environmental assessment of SpaceX’s launch facility in Boca Chica, Texas. The comments ranged from prai…", "url": "https://www.theverge.com/2021/10/21/22738106/spacex-boca-chica-starship-launch-site-faa-town-hall-environmental-assessment", "urlToImage": "https://cdn.vox-cdn.com/thumbor/H_razs4BJRMnnHAGKemK6pvb7N0=/0x275:3840x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22944651/51370391111_a43a3825e5_o.jpg", "publishedAt": "2021-10-21T15:45:05Z", "content": "Virtual FAA town halls this week got heated\r\nSpaceX stacking its Starship spacecraft on top of a Super Heavy booster at the companys launch site in Boca Chica, Texas.\r\nImage: SpaceX\r\nThis week, a vib… [+6945 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Gleeson, USA TODAY", "title": "'This is a big moment for crabs': 100-million-year old fossil in amber alters crustacean past - USA TODAY", "description": "Fossils of the earliest \"modern-looking\" crabs were discovered in tree amber, estimated to date back 100 million years, rewriting crustacean history.", "url": "https://www.usatoday.com/story/news/world/2021/10/21/crab-trapped-amber-100-million-years-ago/6116755001/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/10/21/USAT/a61dcb9b-d504-40e6-8528-a57262e567c5-211020071216-02-amber-crab-fossil-scn-exlarge-169.jpg?auto=webp&crop=636,358,x80,y33&format=pjpg&width=1200", "publishedAt": "2021-10-21T15:24:55Z", "content": "Fossils of the earliest \"modern-looking\" crabs were discovered in tree amber, estimated by scientists to date back 100 million years – the most complete crustacean fossil ever preserved in amber.  \r\n… [+2105 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Uh oh, one of Lucy’s Solar Arrays Hasn’t Latched Properly - Universe Today", "description": "As we’re fond of saying here at UT, space exploration is hard. Many things can go wrong when launching thousands of kgs of highly engineered equipment that took years to develop into space.  Now, something seems to have gone wrong with NASA’s latest Discovery…", "url": "https://www.universetoday.com/153058/uh-oh-one-of-lucys-solar-arrays-hasnt-latched-properly/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/10/5683.jpg", "publishedAt": "2021-10-21T15:22:14Z", "content": "As were fond of saying here at UT, space exploration is hard. Many things can go wrong when launching thousands of kgs of highly engineered equipment that took years to develop into space.  Now, some… [+2227 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "New MOND theory able to account for cosmic microwave background - Phys.org", "description": "A pair of researchers at the Czech Academy of Sciences has been shaking up the astrophysics community with a new modified Newtonian dynamics (MOND) theory that tosses out the concept of dark matter and instead backs up theories that suggest there is a type of…", "url": "https://phys.org/news/2021-10-mond-theory-account-cosmic-microwave.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/new-mond-theory-able-t.jpg", "publishedAt": "2021-10-21T13:50:01Z", "content": "A pair of researchers at the Czech Academy of Sciences has been shaking up the astrophysics community with a new modified Newtonian dynamics (MOND) theory that tosses out the concept of dark matter a… [+2499 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Corinne Purtill", "title": "The Triassic's Fearsome Dinosaur Was a Timid Plant Eater - The New York Times", "description": "A new analysis of fossilized footprints corrects what earlier scientists mistook for a very early carnivore in the dinosaur era.", "url": "https://www.nytimes.com/2021/10/21/science/triassic-dinosaur-australia-footprints.html", "urlToImage": "https://static01.nyt.com/images/2021/10/26/science/21tb-ozdino1/21tb-ozdino1-facebookJumbo.jpg", "publishedAt": "2021-10-21T13:01:06Z", "content": "Reports of the mysterious tracks made their way out of the mine. In a 1964 paper on the discovery, Henry Ross Edgar Staines, a paleontologist with the Geological Survey of Queensland, and J.T. Woods … [+1940 chars]"}]}