{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler", "title": "Man Keeps a Rock For Years, Hoping It's Gold. It Turned Out to Be Far More Valuable - ScienceAlert", "description": "In 2015, David Hole was prospecting in Maryborough Regional Park near Melbourne, Australia.", "url": "https://www.sciencealert.com/man-keeps-rock-for-years-hoping-it-s-gold-it-turned-out-to-be-a-meteorite", "urlToImage": "https://www.sciencealert.com/images/2019-07/processed/huge-meteor-maryborough_1_1024.jpg", "publishedAt": "2021-11-22T05:21:02Z", "content": "In 2015, David Hole was prospecting in Maryborough Regional Park near Melbourne, Australia.\r\nArmed with a metal detector, he discovered something out of the ordinary a very heavy, reddish rock restin… [+4227 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising New Information on How Salt Affects Blood Flow in the Brain - SciTechDaily", "description": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the brain is affected by salt consumption. When neurons are activa…", "url": "https://scitechdaily.com/surprising-new-information-on-how-salt-affects-blood-flow-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Blood-Flow-MRI.jpg", "publishedAt": "2021-11-22T01:33:02Z", "content": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the br… [+4912 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Prepares to Launch Asteroid Defense Test Mission - VOA Learning English", "description": "NASA is preparing to launch a spacecraft designed to strike an asteroid.", "url": "https://learningenglish.voanews.com/a/nasa-prepares-to-launch-asteroid-defense-test-mission/6318699.html", "urlToImage": "https://gdb.voanews.com/C27B36A6-BC02-4175-9B42-68C44C0D9969_w1200_r1.jpg", "publishedAt": "2021-11-21T22:02:34Z", "content": "The American space agency NASA is preparing to launch a spacecraft that will attempt to strike an asteroid to see how the crash affects the space objects path. \r\nThe test mission is designed to demon… [+3797 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA's Hubble Space Telescope delivers epic new views of gas giant planets - CNET", "description": "Dazzling glamour shots for Jupiter, Saturn, Uranus and Neptune from the workhorse scope.", "url": "https://www.cnet.com/news/nasas-hubble-space-telescope-delivers-epic-new-views-of-gas-giant-planets/", "urlToImage": "https://www.cnet.com/a/img/MCuk0jilR3hl-GY6PXP1rl4UhWk=/1200x630/2021/11/18/da0b5be7-0782-4563-b6e7-8d3381bd5621/stsci-01fm7r1qhaverq1tn0xz652605.jpg", "publishedAt": "2021-11-21T21:53:01Z", "content": "Hubble's 2021 portraits of the outer planets show changes in the atmospheres of Jupiter (left), Saturn (upper right), Uranus (middle) and Neptune (lower right).\r\nScience: NASA, ESA, Amy Simon (NASA-G… [+2154 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Unfolding the universe: the commissioning process of the James Webb Space Telescope - NASASpaceFlight.com - NASASpaceflight.com", "description": "This December, an Ariane 5 rocket will launch from Kourou, French Guiana carrying the most…", "url": "https://www.nasaspaceflight.com/2021/11/commissioning-jwst-1/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/11/b1675157revbfinalpublish-471x350.jpeg", "publishedAt": "2021-11-21T21:03:31Z", "content": "This December, an Ariane 5 rocket will launch from Kourou, French Guiana carrying the most complicated telescope ever developed — the joint NASA/ESA/CSA James Webb Space Telescope. However, when the … [+11933 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Revolutionary Laser Communications Mission: 6 Things You Need To Know - SciTechDaily", "description": "NASA’s Laser Communications Relay Demonstration (LCRD) will use laser communications systems to transmit data from space to Earth. Below are six things you need to know about NASA’s revolutionary LCRD mission. 1. Laser communications will transform how NASA g…", "url": "https://scitechdaily.com/nasas-revolutionary-laser-communications-mission-6-things-you-need-to-know/", "urlToImage": "https://scitechdaily.com/images/LCRD-Communicating-Data-scaled.jpg", "publishedAt": "2021-11-21T19:45:12Z", "content": "ByKatherine Schauer, NASAs Goddard Space Flight CenterNovember 21, 2021\r\nIllustration of NASA’s Laser Communications Relay Demonstration communicating with the International Space Station over laser … [+8128 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clever Physics Experiment That Produces “Something From Nothing” - SciTechDaily", "description": "New theory ‘detects’ light in the darkness of a vacuum. Black holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundaries of these massive objects, including light. The precise natu…", "url": "https://scitechdaily.com/clever-physics-experiment-that-produces-something-from-nothing/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Event-Horizon.gif", "publishedAt": "2021-11-21T18:27:40Z", "content": "New theory ‘detects’ light in the darkness of a vacuum.\r\nBlack holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundarie… [+5968 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Here's Why Earthquakes' 'Four-Leaf Clover' Shockwaves Are Dangerous Instead of Lucky - ScienceAlert", "description": "Geologists have measured a devastating 'four-leaf clover' pattern of earthquake shockwaves in greater detail than ever before – and the resulting findings could be crucial in making our buildings and cities more resistant to large quakes in the fut", "url": "https://www.sciencealert.com/seismologists-have-detailed-a-devastating-clover-leaf-pattern-in-earthquakes", "urlToImage": "https://www.sciencealert.com/images/2021-11/processed/FourMapsOfFourLeafCloverPatternEarthquakeFrequencies_1024.jpg", "publishedAt": "2021-11-21T18:02:44Z", "content": "Geologists have measured a devastating 'four-leaf clover' pattern of earthquake shockwaves in greater detail than ever before and the resulting findings could be crucial in making our buildings and c… [+3315 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Propose Jumpstarting Mars' Magnetic Field to Make It Habitable - Futurism", "description": "A team of scientists are suggesting that we protect humans on Mars from deadly atmospheric conditions by kickstarting the planet's magnetic field.", "url": "https://futurism.com/scientists-propose-jumpstarting-mars-magnetic-field", "urlToImage": "https://wp-assets.futurism.com/2021/11/scientists-propose-jumpstarting-mars-magnetic-field.jpg", "publishedAt": "2021-11-21T15:58:35Z", "content": "Any long term human presence on Mars colonization, research, visit and travel that didnt confine settlers to airtight compounds would rely on a stable atmosphere that doesnt lose too many particles o… [+3477 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "A Composite Photo of the Longest Partial Lunar Eclipse of the Century - PetaPixel", "description": "Photographer Andrew McCarthy captured an incredible composite showing 7 stages of the longest partial lunar eclipse of the century.", "url": "https://petapixel.com/2021/11/21/a-composite-photo-of-the-longest-partial-lunar-eclipse-of-the-century/", "urlToImage": "https://petapixel.com/assets/uploads/2021/11/compositelongestpartiallunareclipsefeat.jpg", "publishedAt": "2021-11-21T15:27:30Z", "content": "The longest partial lunar eclipse in 580 years occurred this week, and photographers around the world did their best to capture the once-in-a-lifetime event on camera. Photographer Andrew McCarthy we… [+2231 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Telephoto Snapshot of an Almost Total Lunar Eclipse - SciTechDaily", "description": "Predawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the lunar disk is not quite entirely immersed in Earth's dark umbral shadow during a long partial lunar eclipse. The partial eclipse w…", "url": "https://scitechdaily.com/stunning-telephoto-snapshot-of-an-almost-total-lunar-eclipse/", "urlToImage": "https://scitechdaily.com/images/Almost-Total-Lunar-Eclipse-Crop.jpg", "publishedAt": "2021-11-21T12:10:17Z", "content": "An Almost Total Lunar Eclipse. Credit &amp; Copyright: Robert Fedez\r\nPredawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the l… [+517 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jon Levine", "title": "Calls grow for US to bolster defense against asteroid threat - New York Post", "description": "Experts are sounding the alarm about the threat of asteroids to life on Earth — and warning that the United States does not have a clear plan to prevent catastrophe.", "url": "https://nypost.com/2021/11/20/calls-grow-for-us-to-bolster-defense-against-asteroid-threat/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/11/asteroids-373.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-11-20T20:19:00Z", "content": "Experts are sounding the alarm about the threat of asteroids to life on Earth — and warning that the United States does not have a clear plan to prevent catastrophe.\r\nThough NASA says the odds are li… [+3239 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Warming Events Could Destabilize The Antarctic Ice Sheet Soon. Very Soon - ScienceAlert", "description": "Here's another reminder of the precarious position that the world's climate and ecosystems are in: a new study estimates that global warming could push the Antarctic ice sheet past a tipping point in as little as 10 years.", "url": "https://www.sciencealert.com/warming-events-could-destabilize-the-antarctic-ice-sheet-in-just-10-years", "urlToImage": "https://www.sciencealert.com/images/2021-11/processed/ALargeJaggedIceberg_1024.jpg", "publishedAt": "2021-11-20T18:01:09Z", "content": "Here's another reminder of the precarious position that the world's climate and ecosystems are in: a new study estimates that global warming could push the Antarctic ice sheet past a tipping point in… [+3354 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "AI creates 9 million new designer drugs - RT", "description": "Scientists have used artificial intelligence to \"predict\" formulas for new designer drugs, with the stated goal of helping to improve their regulation. The AI generated formulas for nearly nine million potential new drugs.", "url": "https://www.rt.com/news/540845-ai-predicts-designer-drugs/", "urlToImage": "https://cdni.rt.com/files/2021.11/article/6199175985f54071ce213e64.jpg", "publishedAt": "2021-11-20T15:50:00Z", "content": "Researchers with the University of British Columbia (UBC) used a deep neural net for the job, teaching it to make up chemical structures of potential new drugs. According to their study, released thi… [+2267 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Replacing Carbon Fuel With Nitrogen: Chemists Discover New Way To Harness Energy From Ammonia - SciTechDaily", "description": "A research team at the University of Wisconsin–Madison has identified a new way to convert ammonia to nitrogen gas through a process that could be a step toward ammonia replacing carbon-based fuels. The discovery of this technique, which uses a metal catalyst…", "url": "https://scitechdaily.com/replacing-carbon-fuel-with-nitrogen-chemists-discover-new-way-to-harness-energy-from-ammonia/", "urlToImage": "https://scitechdaily.com/images/Energy-Magnetism-Waves-Concept.gif", "publishedAt": "2021-11-20T14:50:39Z", "content": "A research team at the University of Wisconsin–Madison has identified a new way to convert ammonia to nitrogen gas through a process that could be a step toward ammonia replacing carbon-based fuels.\r… [+4582 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Blown-up satellite pieces circling Earth shown in scientist's unsettling simulation - Mashable", "description": "\"It wasn't a good outcome. It was never going to be a good outcome.\"", "url": "https://mashable.com/article/space-debris-blown-up-satellite", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01fsVvgR12GS12We8nTs6HE/hero-image.fill.size_1200x675.v1637256476.png", "publishedAt": "2021-11-20T13:01:48Z", "content": null}]}