{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Perseverance Rover Sends Sneak Peek of Mars Landing - NASA", "description": "Less than a day after NASA’s Mars 2020 Perseverance rover successfully landed on the surface of Mars, engineers and scientists at the agency’s Jet Propulsion Laboratory in Southern California were hard at work, awaiting the next transmissions from Perseveranc…", "url": "https://www.nasa.gov/press-release/nasa-s-perseverance-rover-sends-sneak-peek-of-mars-landing/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/rover_drop.jpg", "publishedAt": "2021-02-19T18:34:02Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Reversal of Earth's magnetic poles may have triggered Neanderthal extinction -- and it could happen again - CNN ", "description": "The reversal of Earth's magnetic poles and the temporary breakdown of the world's magnetic field some 42,000 years ago, could have triggered solar storms, many environmental changes and the extinction of the Neanderthals, according to a new study.", "url": "https://www.cnn.com/2021/02/19/world/magnetic-fields-earth-intl-scli-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210219083121-restricted-file-aurora-norway-2020-super-tease.jpg", "publishedAt": "2021-02-19T15:49:00Z", "content": "(CNN)The reversal of Earth's magnetic poles, along with a temporary breakdown of the world's magnetic field about 42,000 years ago, could have triggered a raft of environmental changes, solar storms … [+4894 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Researchers observe stationary Hawking radiation in an analog black hole - Phys.org", "description": "Black holes are regions in space where gravity is very strong—so strong that nothing that enters them can escape, including light. Theoretical predictions suggest that there is a radius surrounding black holes known as the event horizon. Once something passes…", "url": "https://phys.org/news/2021-02-stationary-hawking-analog-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/6-blackhole.jpg", "publishedAt": "2021-02-19T14:40:01Z", "content": "Black holes are regions in space where gravity is very strongso strong that nothing that enters them can escape, including light. Theoretical predictions suggest that there is a radius surrounding bl… [+6838 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Found a Way to Communicate With People Who Are Asleep And Dreaming - ScienceAlert", "description": "Scientists have identified a new phenomenon they describe as \"interactive dreaming\", where people experiencing deep sleep and lucid dreams are able to follow instructions, answer simple yes-or-no questions, and even solve basic mathematics problems.", "url": "https://www.sciencealert.com/people-can-answer-questions-and-even-do-math-problems-when-asleep-study-shows", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/sleeping_people_communication_cover_1024.jpg", "publishedAt": "2021-02-19T01:46:40Z", "content": "Scientists have identified a new phenomenon they describe as \"interactive dreaming\", where people experiencing deep sleep and lucid dreams are able to follow instructions, answer simple yes-or-no que… [+3808 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Alicia McDermott", "title": "Mammoth DNA Breaks Record for World's Oldest Sequence - Ancient Origins", "description": "Researchers have sequenced the oldest known DNA in the world. Using material from the Early and Middle Pleistocene sub-epochs, the ancient DNA analysis shatters the record for the world’s oldest sequenced DNA.", "url": "https://www.ancient-origins.net/news-general/mammoth-dna-0014948", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/mammoth-DNA.jpg", "publishedAt": "2021-02-19T00:34:00Z", "content": "Researchers have sequenced the oldest known DNA in the world. Using material from the Early and Middle Pleistocene sub-epochs, the ancient DNA analysis shatters the record for the worlds oldest seque… [+6329 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "A genetic advantage inherited from Neanderthals could give some people a 22% lower risk of severe COVID-19 - Yahoo News", "description": "The remnants of Neanderthal DNA are more common in people from Europe and Asia. They could confer an advantage during a coronavirus infection.", "url": "https://www.businessinsider.com/neanderthal-genes-lower-risk-severe-coronavirus-2021-2", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/mEjC4_byhh12k0DC3z.2yA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xNTAw/https://s.yimg.com/uu/api/res/1.2/36alIVsCVOsSFiZvvPkYsA--~B/aD0yMzQyO3c9MzEyMzthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/business_insider_articles_888/03dbdce6db85cd3e1286360a48334fa7", "publishedAt": "2021-02-18T17:24:18Z", "content": "A model of a Neanderthal male in his twenties on display at the Natural History Museum in London in September 2014. Will Oliver/PA Images/Getty\r\n<ul><li>Some people may have genes inherited from Nean… [+5262 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Tom Nardi", "title": "NASA Selects SpaceX To Launch Lunar Gateway - Hackaday", "description": "While not a Cabinet position, the NASA Administrator is nominated by the president of the United States and tasked with enacting their overall space policy. As such, a new occupant in the White Hou…", "url": "https://hackaday.com/2021/02/18/nasa-selects-spacex-to-launch-lunar-gateway/", "urlToImage": "https://hackaday.com/wp-content/uploads/2021/02/spacexgateway_feat.jpg", "publishedAt": "2021-02-18T15:01:00Z", "content": "While not a Cabinet position, the NASA Administrator is nominated by the president of the United States and tasked with enacting their overall space policy. As such, a new occupant in the White House… [+6630 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Planet Nine Hypothesis Takes a Major Hit in New Study - ExtremeTech", "description": "It used to be easy to know how many planets there were: nine. It had been nine planets for an entire generation before scientists started rethinking what counts as a planet. Pluto is out, but some astronomers believe there's a real ninth planet lurking out th…", "url": "https://www.extremetech.com/extreme/320048-planet-nine-hypothesis-takes-a-major-hit-in-new-study", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2016/08/planet-nine-artist-illustration.jpg", "publishedAt": "2021-02-18T12:30:39Z", "content": "It used to be easy to know how many planets there were: nine. It had been nine planets for an entire generation before scientists started rethinking what counts as a planet. Pluto is out, but some as… [+2318 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Starliner test flight slips to early April - SpaceNews", "description": "A second uncrewed test flight of Boeing’s CST-100 Starliner commercial crew vehicle will be delayed by more than a week to replace damaged hardware.", "url": "https://spacenews.com/starliner-test-flight-slips-to-early-april/", "urlToImage": "https://spacenews.com/wp-content/uploads/2019/12/starliner-orbit.jpg", "publishedAt": "2021-02-18T11:39:07Z", "content": "WASHINGTON A second uncrewed test flight of Boeings CST-100 Starliner commercial crew vehicle will be delayed by a little more than a week to replace hardware damaged during processing of the spacecr… [+2894 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Michael Greshko", "title": "Million-year-old mammoth teeth yield world's oldest DNA - National Geographic", "description": "The record-breaking genetic material is offering fresh insights into how North America’s mammoths lived and evolved.", "url": "https://www.nationalgeographic.com/science/article/million-year-old-mammoth-teeth-yield-worlds-oldest-dna", "urlToImage": "https://i.natgeofe.com/n/509c5721-c1e8-4594-8000-02cfd5028a00/1_mammoths.jpg?w=1200", "publishedAt": "2021-02-17T23:25:09Z", "content": "Scientists have sequenced the oldest DNA yet, smashing through a symbolic barrier in the study of ancient genomes and opening an unprecedented window into the evolution of North Americas extinct Ice … [+9337 chars]"}]}