{"status": "ok", "totalResults": 40, "articles": [{"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "Scientists believe they've discovered a planet that orbits three stars - Salon", "description": "Forget about one or two sunsets — three might be possible in this solar system", "url": "https://www.salon.com/2021/10/05/scientists-believe-theyve-discovered-a-planet-that-orbits-three-stars/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/10/gw-orionis-side-by-side-views-1004211.jpg", "publishedAt": "2021-10-05T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Adorable, bloodsucking sea parasite looks just like sushi - Livescience.com", "description": "The isopod was discovered off the coast of Japan and is a new aquarium superstar.", "url": "https://www.livescience.com/sushi-isopod-fukushima-aquarium", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YYAFvFagCsrMZKGqNfv3id-1200-80.jpeg", "publishedAt": "2021-10-05T17:19:48Z", "content": "Do not adjust your screen, and do not reach for the soy sauce. What you see before you is a real, living, breathing marine animal currently on display in a Japanese aquarium a creature that just happ… [+2028 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "New Triceratops Relative Found on Ted Turner’s Ranch in New Mexico - Gizmodo", "description": "The discovery suggests dinosaurs had surprisingly small geographic ranges. The question now is: why?", "url": "https://gizmodo.com/new-triceratops-relative-found-on-ted-turner-s-ranch-in-1847801639", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/89b1daac180e9f35ce25c8f69fe6d48e.jpg", "publishedAt": "2021-10-05T16:48:00Z", "content": "The reanalysis of a fossil found more than 20 years ago in New Mexico has resulted in the discovery of an entirely new species of horned dinosaur. Named Sierraceratops turneri, the Cretaceous beast i… [+5217 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "This hydrogel tablet can purify a liter of river water in an hour - Phys.org", "description": "As much as a third of the world's population does not have access to clean drinking water, according to some estimates, and half of the population could live in water-stressed areas by 2025. Finding a solution to this problem could save and improve lives for …", "url": "https://phys.org/news/2021-10-hydrogel-tablet-purify-liter-river.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/this-hydrogel-tablet-c-1.jpg", "publishedAt": "2021-10-05T16:47:31Z", "content": "As much as a third of the world's population does not have access to clean drinking water, according to some estimates, and half of the population could live in water-stressed areas by 2025. Finding … [+3306 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Extreme exoplanet even more exotic than originally thought - Phys.org", "description": "Considered an ultra-hot Jupiter—a place where iron gets vaporized, condenses on the night side and then falls from the sky like rain—the fiery, inferno-like WASP-76b exoplanet may be even more sizzling than scientists had realized.", "url": "https://phys.org/news/2021-10-extreme-exoplanet-exotic-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/extreme-exoplanet-even.jpg", "publishedAt": "2021-10-05T16:25:20Z", "content": "Considered an ultra-hot Jupitera place where iron gets vaporized, condenses on the night side and then falls from the sky like rainthe fiery, inferno-like WASP-76b exoplanet may be even more sizzling… [+2966 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "UAE to launch probe targeting asteroid between Mars, Jupiter - NBC News", "description": "The United Arab Emirates announced plans to send a probe to land on an asteroid between Mars and Jupiter to collect data on the origins of the universe.", "url": "https://www.nbcnews.com/science/space/uae-launch-probe-targeting-asteroid-mars-jupiter-rcna2606", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-10/211005-mars-uae-mn-1105-5569f9.jpg", "publishedAt": "2021-10-05T15:30:25Z", "content": "DUBAI, United Arab Emirates The United Arab Emirates on Tuesday announced plans to send a probe to land on an asteroid between Mars and Jupiter to collect data on the origins of the universe, the lat… [+2845 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brandon Specktor", "title": "Perseverance rover on Mars spotted from space in striking new satellite image - Space.com", "description": "Percy is moving on to its next drill site in Mars' lonely Jezero Crater.", "url": "https://www.space.com/perseverance-mars-rover-spotted-by-recon-orbiter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dHBz8zrZB5vLeVHhBxaXc9-1200-80.jpeg", "publishedAt": "2021-10-05T15:00:50Z", "content": "Like a white gumball dropped in the sand, NASA's Perseverance rover glints amongst the cliffs of Mars in a striking new satellite image.\r\nPerseverance or \"Percy,\" to its familiars has been rolling ar… [+2242 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "You Can Stop Putting Spider Silk on Your Wounds - Gizmodo", "description": "Researchers found no evidence that spider silk has antibacterial properties, as is commonly believed.", "url": "https://gizmodo.com/you-can-stop-putting-spider-silk-on-your-wounds-1847799660", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ee83eaf3f5df36e2e044b7f3b7c9dd09.jpg", "publishedAt": "2021-10-05T15:00:00Z", "content": "Spider silk may not be quite as magical a substance as weve been led to believe, new research suggests. Scientists looked closely at the silk of several different spiders but were unable to find any … [+4452 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Hundreds of three-eyed 'dinosaur shrimp' emerge after Arizona monsoon - Livescience.com", "description": "Their eggs can stay dormant for decades, waiting for water.", "url": "https://www.livescience.com/dinosaur-shrimp-emerge-arizona", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zHmUvUre72ECbRSboWsGK3-1200-80.jpg", "publishedAt": "2021-10-05T14:13:37Z", "content": "Following a torrential summer downpour in northern Arizona, hundreds of bizarre, prehistoric-looking critters emerged from tiny eggs and began swimming around a temporary lake on the desert landscape… [+5579 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Study of prior research suggests there is a swarm of large asteroids hidden in the Taurid complex - Phys.org", "description": "A pair of space scientists, one with the University of Antioquia, the other the University of Salento, has found evidence of a swarm of large asteroids hidden in the Taurid complex. Ignacio Ferrín and Vincenzo Orofino have written a paper describing their fin…", "url": "https://phys.org/news/2021-10-prior-swarm-large-asteroids-hidden.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/study-of-prior-researc.jpg", "publishedAt": "2021-10-05T14:10:01Z", "content": "A pair of space scientists, one with the University of Antioquia, the other the University of Salento, has found evidence of a swarm of large asteroids hidden in the Taurid complex. Ignacio Ferrín an… [+2530 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Brian Kahn, Dharna Noor", "title": "Earth Is Getting Dimmer - Gizmodo", "description": "Decades of earthshine data show the planet is less bright than it used to be.", "url": "https://gizmodo.com/earth-is-getting-dimmer-1847782399", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/93e6ae22c0e83629b7bf3580f0174ba2.jpg", "publishedAt": "2021-10-05T13:48:00Z", "content": "Earth is losing some of its glow, a study published in Geophysical Research Letters last week shows. It appears climate change and a natural climate shift have essentially scuffed up our planet. We r… [+3836 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Record the Breaking of a Single Chemical Bond – “Amazing” - SciTechDaily", "description": "Using advanced microscopy techniques at Princeton University, researchers have recorded the breaking of a single chemical bond between a carbon atom and an iron atom on different molecules. The team used a high-resolution atomic force microscope (AFM) operati…", "url": "https://scitechdaily.com/researchers-record-the-breaking-of-a-single-chemical-bond-amazing/", "urlToImage": "https://scitechdaily.com/images/Iron-Phthalocyanine-Molecule-Bond-Rupture.gif", "publishedAt": "2021-10-05T13:21:36Z", "content": "ByPrinceton UniversityOctober 5, 2021\r\nResearchers measured the mechanical forces applied to break a bond between carbon monoxide and iron phthalocyanine, which appears as a symmetrical cross in scan… [+7198 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Fiona Amery", "title": "People have long claimed to hear the northern lights. Are the reports true? - Livescience.com", "description": "Or is it just an illusion?", "url": "https://www.livescience.com/people-hear-the-northern-lights", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PG6NtteY7ASUWBZHKvmUvm-1200-80.jpg", "publishedAt": "2021-10-05T13:03:10Z", "content": "This drawing by Adam Paulsen shows his observation of the aurora from Godthaab, Greenland, on Nov. 15, 1882.  (Image credit: Adam Paulsen/The Royal Society Journal of the History of Science/CC By 4.0… [+7421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "NASA's DART mission will deliberately crash into an asteroid's moon in the name of planetary defense - CNN", "description": "NASA's Double Asteroid Redirection Test, a planetary defense mission, will lift off on November 23 from Vandenberg Space Force Base in California. The spacecraft will deliberately crash into a small moon orbiting a near-Earth asteroid.", "url": "https://www.cnn.com/2021/10/05/world/nasa-dart-asteroid-mission-launch-date-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200629132529-nasa-dart-spacecraft-liciacube-super-tease.jpg", "publishedAt": "2021-10-05T12:17:00Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "Melting permafrost in the Arctic could release radioactive waste and awaken sleeping viruses - Livescience.com", "description": "Thawing permafrost driven by climate change could free trapped microbes and radioactive material.", "url": "https://www.livescience.com/warming-arctic-nuclear-waste-viruses", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nft6xVuTiq7exEvJFjMGnh-1200-80.jpg", "publishedAt": "2021-10-05T11:02:00Z", "content": "As climate change warms the Arctic, melting ice could release hazardous chemicals and radioactive material dating to the Cold War. Vanishing permafrost could also free viruses and bacteria that have … [+7439 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Cosmonaut photos show International Space Station from rare perspective - Space.com", "description": "Two images shared on Twitter last week by cosmonaut Oleg Novitsky show the International Space Station in all its complex, multimodular glory.", "url": "https://www.space.com/international-space-station-cosmonaut-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/46SoWfbWAVsNRsh8u53hsR-1200-80.jpg", "publishedAt": "2021-10-05T11:00:53Z", "content": "Cosmonaut Oleg Novitsky shared this photo of the International Space Station on Twitter on Sept. 29, 2021. He and two colleagues were relocating a Russian Soyuz spacecraft from one port to another at… [+3106 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Watch the BepiColombo spacecraft zoom past Mercury in this new video - Space.com", "description": "The European and Japanese BepiColombo spacecraft made the closest ever measurements of the magnetic field of Mercury above the planet's southern hemisphere as it zoomed past, snapping epic selfies along the way.", "url": "https://www.space.com/bepicolombo-first-mercury-flyby-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5qWbUrr3M8G9ce3inXcymE-1200-80.jpg", "publishedAt": "2021-10-05T11:00:06Z", "content": "The European and Japanese BepiColombo spacecraft made the closest ever measurements of the magnetic field of Mercury above the planet's southern hemisphere as it zoomed past, snapping epic selfies al… [+7749 chars]"}, {"source": {"id": null, "name": "WLWT Cincinnati"}, "author": null, "title": "WATCH: Home security cameras capture 'fireball' meteor over Colorado's night sky - WLWT Cincinnati", "description": "\"Everything was pitch dark, and all of a sudden it lit up.\"", "url": "https://www.wlwt.com/article/colorado-security-cameras-fireball-meteor-watch/37860952", "urlToImage": "https://kubrick.htvapps.com/vidthumb/images/meteor-1633402368.jpg?crop=1xw:1xh;center,top&resize=1200:*", "publishedAt": "2021-10-05T07:33:00Z", "content": "DENVER —Several home security cameras picked up a rare and amazing sight in the night skies over Colorado on Sunday morning.\r\n\"Everything was pitch dark, and all of a sudden it lit up,\" Doug Robinson… [+337 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious World Appears to Be The First Exoplanet Ever Found Orbiting 3 Stars - ScienceAlert", "description": "Our Solar System, with just one star in the sky, may be a bit of an oddball. Most of the stars in the Milky Way galaxy actually have at least one gravitationally bound stellar companion, meaning that two-starred worlds like Tatooine are probably not", "url": "https://www.sciencealert.com/we-may-have-just-found-the-first-exoplanet-known-to-orbit-three-stars", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/gw-orionis_1024.jpg", "publishedAt": "2021-10-05T06:01:33Z", "content": "Our Solar System, with just one star in the sky, may be a bit of an oddball. Most of the stars in the Milky Way galaxy actually have at least one gravitationally bound stellar companion, meaning that… [+4092 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lunar Landers Could Blast Deposit Instant Landing Pads as They Arrive at the Moon - SciTechDaily", "description": "Space exploration requires all kinds of interesting solutions to complex problems. There is a branch of NASA designed to support the innovators trying to solve those problems – the Institute for Advanced Concepts (NIAC). They occasionally hand out grant fundi…", "url": "https://scitechdaily.com/lunar-landers-could-blast-deposit-instant-landing-pads-as-they-arrive-at-the-moon/", "urlToImage": "https://scitechdaily.com/images/Lunar-Lander-FAST-Landing-Pad-Deposition-Technology.jpg", "publishedAt": "2021-10-05T05:39:15Z", "content": "ByAndy Tomaswick, Universe TodayOctober 4, 2021\r\nArtist depiction of a lunar lander utilizes the FAST landing pad deposition technology. Credit: Masten Space Systems\r\nSpace exploration requires all k… [+4570 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "Nobel Physics Prize to two climate experts and Italian theorist - msnNOW", "description": "US-Japanese scientist Syukuro Manabe, Klaus Hasselmann of Germany and Giorgio Parisi of Italy on Tuesday won the Nobel Physics Prize for climate models and the understanding of physical systems, the jury said. Manabe, 90, and Hasselmann, 89, share one half of…", "url": "https://www.msn.com/en-us/news/world/invisibility-cloak-and-quantum-physics-tipped-for-nobel-prize/ar-AAP8Pwn", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAP9CgU.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2021-10-05T03:01:28Z", "content": "US-Japanese scientist Syukuro Manabe, Klaus Hasselmann of Germany and Giorgio Parisi of Italy on Tuesday won the Nobel Physics Prize for climate models and the understanding of physical systems, the … [+4563 chars]"}, {"source": {"id": null, "name": "Motor1 "}, "author": "Christopher Smith", "title": "NASA Shopping For New Astrovan To Carry Astronauts To Launch Pad - Motor1 ", "description": "NASA is preparing for its new round of deep space missions, and that includes a new transport vehicle to shuttle astronauts to the launch pad.", "url": "https://www.motor1.com/news/538417/nasa-next-gen-astrovan-astronauts/", "urlToImage": "https://cdn.motor1.com/images/mgl/RGRbP/s1/nasa-astrovan.jpg", "publishedAt": "2021-10-04T22:03:00Z", "content": "The Astrovan is a legend in the world of space travel. No, not the Chevy Astro van that served families through the 1980s and 1990s we're talking about NASA's astronaut transfer van that carried spac… [+2014 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Molly Sharlach", "title": "Team measures the breakup of a single chemical bond - Phys.org", "description": "The team used a high-resolution atomic force microscope (AFM) operating in a controlled environment at Princeton's Imaging and Analysis Center. The AFM probe, whose tip ends in a single copper atom, was moved gradually closer to the iron-carbon bond until it …", "url": "https://phys.org/news/2021-10-team-breakup-chemical-bond.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/researchers-measure-th-2.jpg", "publishedAt": "2021-10-04T21:14:48Z", "content": "The team used a high-resolution atomic force microscope (AFM) operating in a controlled environment at Princeton's Imaging and Analysis Center. The AFM probe, whose tip ends in a single copper atom, … [+6344 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lila Reynolds", "title": "Our DNA is becoming the world's tiniest hard drive - Phys.org", "description": "Our genetic code is millions of times more efficient at storing data than existing solutions, which are costly and use immense amounts of energy and space. In fact, we could get rid of hard drives and store all the digital data on the planet within a couple h…", "url": "https://phys.org/news/2021-10-dna-world-tiniest-hard.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/dna.jpg", "publishedAt": "2021-10-04T20:07:04Z", "content": "Our genetic code is millions of times more efficient at storing data than existing solutions, which are costly and use immense amounts of energy and space. In fact, we could get rid of hard drives an… [+6153 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dan Avery", "title": "X-rays of 390-million-year-old trilobite fossil show it had hundreds of tiny eyes inside each eye - Daily Mail", "description": "After a half-century, German researchers have proven an amateur paleontologist's theory that a 390-million-year-old trilobite had hyper-compound eyes, with 100s of lenses in each.", "url": "https://www.dailymail.co.uk/sciencetech/article-10058243/X-rays-390-million-year-old-trilobite-fossil-hundreds-tiny-eyes-inside-eye.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/10/04/20/48756505-0-image-a-25_1633375112560.jpg", "publishedAt": "2021-10-04T19:39:51Z", "content": "Researchers reviewing decades-old x-rays of a 390 million year-old trilobite fossil have uncovered it had a wholly unique eye structure composed of 200 large lenses in each eye.\r\nPhacops geesops, a t… [+5534 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Supercomputers reveal how X chromosomes fold, deactivate - Phys.org", "description": "Using supercomputer-driven dynamic modeling based on experimental data, researchers can now probe the process that turns off one X chromosome in female mammal embryos. This new capability is helping biologists understand the role of RNA and the chromosome's s…", "url": "https://phys.org/news/2021-10-supercomputers-reveal-chromosomes-deactivate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/supercomputers-reveal.jpg", "publishedAt": "2021-10-04T19:13:29Z", "content": "Using supercomputer-driven dynamic modeling based on experimental data, researchers can now probe the process that turns off one X chromosome in female mammal embryos. This new capability is helping … [+6192 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Scientists are still learning cool new things about gooey hagfish slime - Ars Technica", "description": "Larger hagfish produce larger, stronger thread cells to better ward off predators.", "url": "https://arstechnica.com/science/2021/10/unlocking-more-secrets-of-hagfish-slime/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/hagfish1-760x380.jpg", "publishedAt": "2021-10-04T19:07:50Z", "content": "Enlarge/ A recently discovered species: the Galapagos Ghost Hagfish (Myxine phantasma).\r\n12 with 9 posters participating\r\nMeet the humble hagfish, an ugly, gray, eel-like creature affectionately know… [+7935 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": "Ben Hooper", "title": "6-year-old finds mastodon tooth in Michigan nature preserve - UPI News", "description": "A 6-year-old walking with his family in a Michigan nature preserve made a rare discovery: a 12,000-year-old mastodon tooth.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/ph/st/th/3691633369947/2021/i/16333701091905/v1.5/6-year-old-finds-mastodon-tooth-in-Michigan-nature-preserve.jpg?lg=2", "publishedAt": "2021-10-04T17:59:44Z", "content": "Oct. 4 (UPI) -- A 6-year-old walking with his family in a Michigan nature preserve made a rare discovery: a 12,000-year-old mastodon tooth.\r\nJulian Gagnon, 6, was walking with his family in the Dinos… [+1465 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Science of Psyche: Unique Asteroid Holds Clues to Early Solar System - NASA", "description": "Set to launch next year, NASA’s Psyche mission marks the first time the agency has set out to explore an asteroid richer in metal than rock or ice.", "url": "https://www.nasa.gov/feature/jpl/science-of-psyche-unique-asteroid-holds-clues-to-early-solar-system/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-pia24891-install-of-grns-16.jpg", "publishedAt": "2021-10-04T15:37:04Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists confirm decrease in Pluto's atmospheric density - Phys.org", "description": "When Pluto passed in front of a star on the night of August 15, 2018, a Southwest Research Institute-led team of astronomers had deployed telescopes at numerous sites in the U.S. and Mexico to observe Pluto's atmosphere as it was briefly backlit by the well-p…", "url": "https://phys.org/news/2021-10-scientists-decrease-pluto-atmospheric-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/swri-scientists-confir.jpg", "publishedAt": "2021-10-04T15:07:03Z", "content": "When Pluto passed in front of a star on the night of August 15, 2018, a Southwest Research Institute-led team of astronomers had deployed telescopes at numerous sites in the U.S. and Mexico to observ… [+4056 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This 'Extraordinary Gamma-Ray Burst' Likely Came From Something Much Closer to Earth - ScienceAlert", "description": "For all our current proficiency at studying the cosmos, there are some basic things that are still extremely difficult to do.", "url": "https://www.sciencealert.com/an-extraordinary-gamma-ray-burst-seems-to-have-instead-been-light-reflecting-off-of-space-junk", "urlToImage": "https://www.sciencealert.com/images/2021-10/processed/earth-from-iss_1024.jpg", "publishedAt": "2021-10-04T15:04:36Z", "content": "For all our current proficiency at studying the cosmos, there are some basic things that are still extremely difficult to do.\r\nOne of those things is gauge distances, especially for random, transient… [+4961 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dennis Overbye", "title": "A Nobel Prize for Stephen Hawking That Might Have Been - The New York Times", "description": "A recent study of black holes confirmed a fundamental prediction that the theoretical physicist made nearly five decades ago. But the ultimate award is beyond his reach.", "url": "https://www.nytimes.com/2021/10/04/science/hawking-nobel-black-hole.html", "urlToImage": "https://static01.nyt.com/images/2021/08/25/science/00SCI-OUTTHERE-HAWKING1/00SCI-OUTTHERE-HAWKING1-facebookJumbo.jpg", "publishedAt": "2021-10-04T13:46:21Z", "content": "The quest to understand what happens to information in a black hole has transformed fundamental physics and energized a generation of young theorists. At stake is whether Einsteinian gravity, which g… [+1796 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Simulations suggest an Earth or Mars size planet may be lurking out beyond Neptune - Phys.org", "description": "A team of space scientists has published a paper in Annual Review of Astronomy and Astrophysics suggesting that there may be an Earth- or Mars-sized planet orbiting beyond Neptune. They further suggest that simulations of the creation of the solar system show…", "url": "https://phys.org/news/2021-10-simulations-earth-mars-size-planet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/neptune.jpg", "publishedAt": "2021-10-04T13:22:20Z", "content": "A team of space scientists has published a paper in Annual Review of Astronomy and Astrophysics suggesting that there may be an Earth- or Mars-sized planet orbiting beyond Neptune. They further sugge… [+2485 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "Danielle Chavira", "title": "VIDEOS: Fireball Streaks Across Colorado Sky Early Sunday Morning - CBS Denver", "description": "Coloradans as far west as Evergreen and as far north as Wellington caught a incredible sight on their security cameras early Sunday morning.", "url": "https://denver.cbslocal.com/2021/10/04/meteor-colorado-sunday-video/", "urlToImage": "https://denver.cbslocal.com/wp-content/uploads/sites/15909806/2021/10/wellington-meteor-andrew-fisher.jpg?w=1182", "publishedAt": "2021-10-04T12:58:00Z", "content": "(CBS4) – Coloradans as far west as Evergreen, as far north as Wellington, as far east as Bennet and as far south as Colorado Springs caught a incredible sight on their security cameras early Sunday m… [+2297 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "ESA and JAXA release Mercury eyecandy, courtesy of spacecraft BepiColumbo - The Register", "description": "Fourth of nine scheduled planetary assists completed as spacecraft inches closer to releasing its orbiters", "url": "https://www.theregister.com/2021/10/04/bepicolombo_mercury_flyby/", "urlToImage": "https://regmedia.co.uk/2020/03/16/mercury.jpg", "publishedAt": "2021-10-04T12:13:00Z", "content": "The European Space Agency (ESA) and Japan Aerospace Exploration Agency's (JAXA) joint mission BepiColombo sent back its first photos of Mercury on Friday as it completed the fourth of nine planetary … [+3236 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": null, "title": "How apples get their shapes - Harvard School of Engineering and Applied Sciences", "description": "Using theory and experiments, researchers show how apples get their distinct cusp-like features", "url": "https://www.seas.harvard.edu/news/2021/10/how-apples-get-their-shapes", "urlToImage": "https://www.seas.harvard.edu/sites/default/files/2021-10/an_vision-gDPaDDy6_WE-unsplash.jpg", "publishedAt": "2021-10-04T12:00:00Z", "content": "Apples are among the oldest and most recognizable fruits in the world. But have you ever really considered an apples shape? Apples are relatively spherical except for that characteristic dimple at th… [+3876 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Adam Mann", "title": "Baby planets marinate in a life-giving cyanide 'soup,' analysis reveals - Livescience.com", "description": "The molecules needed for life are common in space.", "url": "https://www.livescience.com/life-chemicals-abundant-in-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DfqKkDLzE59uW6Q7jALsm8-1200-80.jpg", "publishedAt": "2021-10-04T11:00:44Z", "content": "The universe may be teeming with the molecules needed for life, a new study finds. The results come from the most comprehensive maps ever made of the types and locations of chemicals in the gas and d… [+4337 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "We Just Got Closer to Pinpointing a Major Moment in Earth's Evolutionary History - ScienceAlert", "description": "For the vast majority of animals on Earth, breath is synonymous with life. Yet for the first 2 billion years of our planet's existence, oxygen was in scarce supply.", "url": "https://www.sciencealert.com/we-re-getting-closer-to-figuring-out-when-earth-started-producing-oxygen", "urlToImage": "https://www.sciencealert.com/images/2021-09/processed/earthoxygenlife_1024.jpg", "publishedAt": "2021-10-04T00:06:42Z", "content": "For the vast majority of animals on Earth, breath is synonymous with life. Yet for the first 2 billion years of our planet's existence, oxygen was in scarce supply.\r\nThat doesn't mean Earth was lifel… [+3908 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Metals Supercharge Method To Bury Billions of Tons of Harmful Carbon Dioxide Under the Sea for Centuries - SciTechDaily", "description": "Capturing and burying carbon is one of the most promising ways to blunt the pace of climate change University of Texas and ExxonMobil researchers found a way to speed up the formation of crystal structures called hydrates that can store billions of tons of ca…", "url": "https://scitechdaily.com/metals-supercharge-method-to-bury-billions-of-tons-of-harmful-carbon-dioxide-under-the-sea-for-centuries/", "urlToImage": "https://scitechdaily.com/images/Deep-Ocean-Current.gif", "publishedAt": "2021-10-03T23:23:12Z", "content": "<ul><li>Capturing and burying carbon is one of the most promising ways to blunt the pace of climate change</li><li>University of Texas and ExxonMobil researchers found a way to speed up the formation… [+4274 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Fiona Amery", "title": "The people who claim to hear the Northern Lights - BBC News", "description": "Some people have claimed the aurora borealis makes discernible crackling, whooshing or whizzing sounds. Are they highly perceptive, or are the sounds a trick of the mind?", "url": "https://www.bbc.com/future/article/20211001-the-people-who-claim-to-hear-the-northern-lights", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p09xhhs2.jpg", "publishedAt": "2021-10-03T23:08:15Z", "content": "If you want to hear the Northern Lights for yourself, you may have to spend a considerable amount of time in the polar regions, considering the aural phenomenon only presents itself in 5% of violent … [+1480 chars]"}]}