{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Perseverance Captures Video, Audio of Fourth Ingenuity Flight – NASA's Mars Exploration Program - NASA Mars Exploration", "description": "Sounds of the Mars Helicopter’s whirring rotors add another new dimension to the historic project.", "url": "https://mars.nasa.gov/news/8941/nasas-perseverance-captures-video-audio-of-fourth-ingenuity-flight/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/8941_20210507_HelicopterFliesOnMars.jpg", "publishedAt": "2021-05-07T15:31:49Z", "content": "Sounds of the Mars Helicopter’s whirring rotors add another new dimension to the historic project.\r\nFor the first time, a spacecraft on another planet has recorded the sounds of a separate spacecraft… [+5483 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sharks Use Earth’s Magnetic Fields to Guide Them Like a Map – “It Really Is Mind Blowing” - SciTechDaily", "description": "Sea turtles are known for relying on magnetic signatures to find their way across thousands of miles to the very beaches where they hatched. Now, researchers reporting in the journal Current Biology on May 6, 2021, have some of the first solid evidence that s…", "url": "https://scitechdaily.com/sharks-use-earths-magnetic-fields-to-guide-them-like-a-map-it-really-is-mind-blowing/", "urlToImage": "https://scitechdaily.com/images/Bonnethead-Shark-Hunting-at-Night.jpg", "publishedAt": "2021-05-07T14:27:22Z", "content": "Sea turtles are known for relying on magnetic signatures to find their way across thousands of miles to the very beaches where they hatched. Now, researchers reporting in the journal Current Biology … [+4166 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Harry Pettit", "title": "Scientist predicted a man named ‘Elon’ would colonise Mars in book written 70 YEARS ago... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/14881853/predict-man-elon-colonise-mars-book/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/05/NINTCHDBPICT000643389533-2.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-05-07T13:22:00Z", "content": "ELON Musk's plot to colonise other worlds may have been predicted by a German scientist 70 years ago.\r\nWriting in his 1952 science fiction novel \"Project Mars\", engineer Wernher von Braun described a… [+4121 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "SpaceX might try to fly the first Starship prototype to successfully land a second time - TechCrunch", "description": "SpaceX is fresh off a high for its Starship spacecraft development program, but according to CEO Elon Musk, it’s already looking ahead to potentially repeating its latest success with an unplanned early reusability experiment. Earlier this week, SpaceX flew t…", "url": "http://techcrunch.com/2021/05/07/spacex-might-try-to-fly-the-first-starship-prototype-to-successfully-land-a-second-time/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/HP_SN15_Desktop.jpg?w=764", "publishedAt": "2021-05-07T12:21:58Z", "content": "SpaceX is fresh off a high for its Starship spacecraft development program, but according to CEO Elon Musk, it’s already looking ahead to potentially repeating its latest success with an unplanned ea… [+1837 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "'Spaghettified' star wrapped around a black hole spotted for the first time - Space.com", "description": "Astronomers observe as a giant black hole sucks in a spaghettified star.", "url": "https://www.space.com/spaghettified-star-observed-near-black-hole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AtBFL9uC69d8pWzYwMsApS-1200-80.jpg", "publishedAt": "2021-05-07T11:10:16Z", "content": "Filaments of material wrapped around a supermassive black hole have been spotted for the first time suggesting a star trapped by the black hole's gravity has just been destroyed by spaghettification.… [+4072 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“I Felt Really Heavy!” – NASA’s SpaceX Crew-1 Astronauts Discuss Their Historic Mission and Return to Earth - SciTechDaily", "description": "NASA astronauts Michael Hopkins, Victor Glover, and Shannon Walker, along with Japan Aerospace Exploration Agency (JAXA) astronaut Soichi Noguchi, participated in the first media event following their mission and splashdown, where they answered questions abou…", "url": "https://scitechdaily.com/i-felt-really-heavy-nasas-spacex-crew-1-astronauts-discuss-their-historic-mission-and-return-to-earth/", "urlToImage": "https://scitechdaily.com/images/NASA-SpaceX-Crew-1-Landing.jpg", "publishedAt": "2021-05-07T10:25:29Z", "content": "Crew-1 astronauts pictured after their return to Earth: NASA astronauts Mike Hopkins, Victor Glover, and Shannon Walker and Japan Aerospace Exploration Agency (JAXA) astronaut Soichi Noguchi. Credit:… [+5138 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "There's Evidence Volcanoes Are Active on Mars, Raising Chances of Recent Habitability - ScienceAlert", "description": "Evidence seems to be mounting for a geologically and volcanically active Mars.", "url": "https://www.sciencealert.com/volcanoes-on-mars-could-be-active-raising-the-chances-of-recent-habitability", "urlToImage": "https://www.sciencealert.com/images/2021-05/processed/1200px-osiris_mars_true_color_2_1024.jpg", "publishedAt": "2021-05-07T07:29:30Z", "content": "Evidence seems to be mounting for a geologically and volcanically active Mars.\r\nA new, close study of volcanic features on the surface of the red planet has found that a lava deposit on the Elysium P… [+4253 chars]"}, {"source": {"id": null, "name": "WDAF FOX4 Kansas City"}, "author": "Makenzie Koch", "title": "Seeing lights in the sky? SpaceX Starlink satellite — not UFOs — passes over Kansas City area - WDAF FOX4 Kansas City", "description": "KANSAS CITY, Mo. — If you’re seeing a strange string of lights in the sky Thursday night, don’t worry. It’s not aliens invading. It’s just a SpaceX Starlink satellite traveling over the Kansas City region. Others in various parts of the central Midwest, like …", "url": "https://fox4kc.com/news/seeing-lights-in-the-sky-spacex-starlink-satellite-not-ufos-passes-over-kansas-city-area/", "urlToImage": "https://fox4kc.com/wp-content/uploads/sites/16/2021/05/starlink.jpg?w=1280", "publishedAt": "2021-05-07T03:16:03Z", "content": "KANSAS CITY, Mo. — If you’re seeing a strange string of lights in the sky Thursday night, don’t worry. It’s not aliens invading.\r\nIt’s just a SpaceX Starlink satellite traveling over the Kansas City … [+907 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shuvuuia: Extraordinary Dinosaurs That Hunted in the Dark - SciTechDaily", "description": "The tiny desert-living dinosaur Shuvuuia had extraordinary vision and owl-like hearing for nocturnal life in the Mongolian desert. Today's 10,000 species of birds live in virtually every habitat on Earth, but only a handful have adaptations enabling them to h…", "url": "https://scitechdaily.com/shuvuuia-extraordinary-dinosaurs-that-hunted-in-the-dark/", "urlToImage": "https://scitechdaily.com/images/Shuvuuia-Deserti-Reconstruction-Crop.jpg", "publishedAt": "2021-05-07T02:45:25Z", "content": "Shuvuuia deserti artist’s reconstruction. Credit: Viktor Radermaker\r\nThe tiny desert-living dinosaur Shuvuuia had extraordinary vision and owl-like hearing for nocturnal life in the Mongolian desert.… [+4045 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Starliner test flight scheduled for July 30 - SpaceNews", "description": "NASA and Boeing have scheduled a second uncrewed test flight of the CST-100 Starliner commercial crew spacecraft for July 30.", "url": "https://spacenews.com/starliner-test-flight-scheduled-for-july-30/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/05/starliner-oft2preps.jpg", "publishedAt": "2021-05-06T22:58:37Z", "content": "WASHINGTON NASA and Boeing have scheduled a second uncrewed test flight of the CST-100 Starliner commercial crew spacecraft for July 30.\r\nIn separate statements, the agency and the company said they … [+4050 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Public, Media to Watch Asteroid Mission Begin Return - NASA", "description": "NASA invites the public and the media to watch its first asteroid sample return mission begin a two-year cruise home at 4 p.m. EDT Monday, May 10, on NASA Television, the NASA app, and the agency’s website.", "url": "https://www.nasa.gov/press-release/nasa-invites-public-media-to-watch-asteroid-mission-begin-return-to-earth/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/osiris-rex_departure_0.png", "publishedAt": "2021-05-06T21:25:37Z", "content": null}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Direct observation of deterministic macroscopic entanglement - Science Magazine", "description": "Quantum entanglement occurs when two separate entities become strongly linked in a way that cannot be explained by classical physics; it is a powerful resource in quantum communication protocols and advanced technologies that aim to exploit the enhanced capab…", "url": "https://science.sciencemag.org/content/372/6542/622.full", "urlToImage": "https://science.sciencemag.org/content/372/6542/622/F1.large.jpg", "publishedAt": "2021-05-06T18:04:49Z", "content": "Abstract\r\nQuantum entanglement of mechanical systems emerges when distinct objects move with such a high degree of correlation that they can no longer be described separately. Although quantum mechan… [+693 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "A rooted phylogeny resolves early bacterial evolution - Science Magazine", "description": "The origin of the eubacteria and phylogenetic relationships between subgroups have been difficult to resolve. Applying a phylogenetic analysis and recent computational methods to the expanded diversity of bacterial sequences from metagenomic analyses, Coleman…", "url": "https://science.sciencemag.org/content/372/6542/eabe0511.full", "urlToImage": "https://science.sciencemag.org/content/372/6542/eabe0511/F1.large.jpg", "publishedAt": "2021-05-06T18:04:49Z", "content": "By Gareth A. Coleman, Adrián A. Davín, Tara A. Mahendrarajah, Lénárd L. Szánthó, Anja Spang, Philip Hugenholtz, Gergely J. Szöllsi, Tom A. Williams\r\nScience07 May 2021"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Molecular Glue” Boosts Efficiency and Makes Perovskite Solar Cells Dramatically More Reliable Over Time - SciTechDaily", "description": "A research team from Brown University has made a major step toward improving the long-term reliability of perovskite solar cells, an emerging clean energy technology. In a study to be published on Friday, May 7, 2021, in the journal Science, the team demonstr…", "url": "https://scitechdaily.com/molecular-glue-boosts-efficiency-and-makes-perovskite-solar-cells-dramatically-more-reliable-over-time/", "urlToImage": "https://scitechdaily.com/images/Molecular-Glue-Perovskite-Solar-Cells.jpg", "publishedAt": "2021-05-06T18:00:27Z", "content": "Researchers have used self-assembled monolayer “molecular glue” to toughen interfaces in perovskite solar cells to make them more efficient, stable, and reliable. Credit: Padture lab/Brown University… [+6834 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Review: Most human origins stories are not compatible with known fossils - Phys.org", "description": "In the 150 years since Charles Darwin speculated that humans originated in Africa, the number of species in the human family tree has exploded, but so has the level of dispute concerning early human evolution. Fossil apes are often at the center of the debate…", "url": "https://phys.org/news/2021-05-human-stories-compatible-fossils.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/review-most-human-orig.jpg", "publishedAt": "2021-05-06T18:00:09Z", "content": "In the 150 years since Charles Darwin speculated that humans originated in Africa, the number of species in the human family tree has exploded, but so has the level of dispute concerning early human … [+4962 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": "jcole", "title": "Chernobyl's ruins grow restless, and entangling macroscopic objects - Science Magazine", "description": "On this week’s show: Researchers are keeping a close eye on worrying signals at the site of the Chernobyl nuclear disaster, and quantum entanglement for bigger and bigger things", "url": "https://www.sciencemag.org/podcast/chernobyl-s-ruins-grow-restless-and-entangling-macroscopic-objects", "urlToImage": "https://www.sciencemag.org/sites/default/files/chernobyl-pod.jpg", "publishedAt": "2021-05-06T18:00:00Z", "content": "Rich Stone, former international news editor at Science and current senior science editor at the Howard Hughes Medical Institutes Tangled Bank Studios, joins host Sarah Crespi to talk about concernin… [+846 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "SpaceX Prototype Rocket for the Moon and Mars Makes First Successful Landing - IGN - IGN", "description": "SpaceX's prototype rocket for the Moon and Mars has made its first successful landing after four unsuccessful attempts since December.", "url": "https://www.ign.com/articles/spacex-elon-musk-prototype-rocket-for-the-moon-and-mars-makes-first-successful-landing", "urlToImage": "https://assets1.ignimgs.com/2021/05/06/screen-shot-2021-05-06-at-111013-am-1620319288469.png?width=1280", "publishedAt": "2021-05-06T17:31:05Z", "content": "SpaceX's prototype rocket, Starship, which has plans to eventually go to the Moon and Mars, has made its first-ever successful landing back on Earth.The space company founded by Elon Musk has made fo… [+2719 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "NASA EGS, Jacobs preparing SLS Core Stage for Artemis 1 stacking - NASASpaceFlight.com - NASASpaceflight.com", "description": "The Core Stage of NASA’s first Space Launch System (SLS) vehicle arrived at the Kennedy…", "url": "https://www.nasaspaceflight.com/2021/05/nasa-egs-jacobs-sls-artemis-1-stacking/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/05/P1180372.small_.jpg", "publishedAt": "2021-05-06T17:25:54Z", "content": "The Core Stage of NASA’s first Space Launch System (SLS) vehicle arrived at the Kennedy Space Center (KSC) and was moved into the Vehicle Assembly Building (VAB) on April 29. The stage is now in the … [+19644 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Brad Bergan", "title": "Scientists Found Evidence of Fungus Growing on Mars - Interesting Engineering", "description": "Rovers on Mars snapped photos of what appear to be fungi-like life forms! But read the full study.", "url": "https://interestingengineering.com/fungus-growing-on-mars", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/lV6D5Z7nwx/sizes/fungus-growing-on-mars_md.jpg", "publishedAt": "2021-05-06T16:58:26Z", "content": "On Mars, most life from Earth would not survive — but microbes like the black mold fungus might survive on the Red Planet's surface for a substantial timeframe. But, recent photos seem to suggest tha… [+3535 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Physicists describe new type of aurora - Phys.org", "description": "For millennia, humans in the high latitudes have been enthralled by auroras—the northern and southern lights. Yet even after all that time, it appears the ethereal, dancing ribbons of light above Earth still hold some secrets.", "url": "https://phys.org/news/2021-05-physicists-aurora.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/aurora.jpg", "publishedAt": "2021-05-06T16:44:42Z", "content": "For millennia, humans in the high latitudes have been enthralled by aurorasthe northern and southern lights. Yet even after all that time, it appears the ethereal, dancing ribbons of light above Eart… [+5768 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "Scientists Create The Most High-Intensity Laser Ever Seen - IFLScience", "description": "Scientists have developed the most intense laser ever created. The beam of light delivers a whopping 1023 W/cm2, an intensity equivalent to concentrating t", "url": "https://www.iflscience.com/physics/scientists-create-the-most-highintensity-laser-ever-seen/", "urlToImage": "https://cdn.iflscience.com/images/704b1e47-838f-53f9-9700-3920b338ef30/default-1620316207-image-credit-digital-abstract-art-shutterstock-com.jpg", "publishedAt": "2021-05-06T16:25:00Z", "content": "Scientists have developed the most intense laser ever created. The beam of light delivers a whopping 1023 W/cm2, an intensity equivalent to concentrating the entire luminosity of the Sun into an area… [+2447 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "Archaeologists discover the oldest known human burial in Africa | TheHill - The Hill", "description": "The burial site dates back to 78,000 years ago.", "url": "https://thehill.com/changing-america/enrichment/education/552138-archaeologists-discover-the-oldest-known-human-burial", "urlToImage": "https://thehill.com/sites/default/files/ca_oldestburialsiteinafrica_050621.png", "publishedAt": "2021-05-06T16:20:09Z", "content": "Archaeologists have uncovered the oldest known human burial in Africa: a young child laid to rest in a shallow grave 78,000 years ago. \r\nNew research published Wednesday in the journal Nature details… [+2271 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New Fanged Frog Species Discovered in Philippines | Biology - Sci-News.com", "description": "An international team of scientists has discovered a cryptic new species of fanged frog living on Mindoro and Semirara Islands of the central Philippines.", "url": "http://www.sci-news.com/biology/mindoro-fanged-frog-09628.html", "urlToImage": "http://cdn.sci-news.com/images/2021/05/image_9628f-Limnonectes-beloncioi.jpg", "publishedAt": "2021-05-06T15:47:38Z", "content": "An international team of scientists has discovered a cryptic new species of fanged frog living on Mindoro and Semirara Islands of the central Philippines.\r\nAdult female of the Mindoro fanged frog (Li… [+2452 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "International Cutting-Edge SWOT Satellite to Survey the World's Water - NASA", "description": "So just how does the Surface Water and Ocean Topography mission expect to measure what’s flowing in the planet’s lakes, rivers, and oceans? A very busy project manager explains.", "url": "https://www.nasa.gov/feature/jpl/international-cutting-edge-swot-satellite-to-survey-the-world-s-water/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-pia24531-swot_parag-clean-room-1041.jpg", "publishedAt": "2021-05-06T14:58:54Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jennifer Chu", "title": "Physicists find a novel way to switch antiferromagnetism on and off - Phys.org", "description": "When you save an image to your smartphone, those data are written onto tiny transistors that are electrically switched on or off in a pattern of \"bits\" to represent and encode that image. Most transistors today are made from silicon, an element that scientist…", "url": "https://phys.org/news/2021-05-physicists-antiferromagnetism.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/magneticliqu.jpg", "publishedAt": "2021-05-06T14:19:10Z", "content": "When you save an image to your smartphone, those data are written onto tiny transistors that are electrically switched on or off in a pattern of \"bits\" to represent and encode that image. Most transi… [+7321 chars]"}, {"source": {"id": null, "name": "Nerdist"}, "author": null, "title": "NASA Space Probe Detects Radio Emissions Coming from Venus - Nerdist", "description": "NASA's Parker Solar Probe has picked up on radio emissions coming from Venus' atmosphere, and they sound like something out of the Twilight Zone.", "url": "https://nerdist.com/article/radio-emissions-coming-from-venus/", "urlToImage": "https://nerdist.com/wp-content/uploads/2021/05/Venus-Radio-Emission-feature-image-05052021.jpg", "publishedAt": "2021-05-06T12:51:37Z", "content": "On its latest flyby of Venus, NASA’s Parker Solar Probe once again swung by the second planet from the Sun for its yearly gravity boost. On this routine flyby, something unexpected happened: the prob… [+1810 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Marie Morales", "title": "Mushrooms Growing on Mars? Rock-Like Formations on Surface May Actually Be Fungi - Science Times", "description": "A scientist also famous for the name, \"Space Tiger King,\" is dubbed, recently claimed that the odd 'puffball-like' rocks found on Mars \"are actually mushrooms.\"", "url": "https://www.sciencetimes.com/articles/31042/20210506/mushrooms-growing-mars-rock-formations-surface-actually-fungi.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/33416/science-times-red-planet-has-mushrooms-scientist-claims.jpg", "publishedAt": "2021-05-06T09:30:00Z", "content": "\"Space Tiger King,\" as to how a scientist is dubbed, recently claimed that the odd 'puffball-like' rocks found on Mars \"are actually mushrooms.\"\r\nA Mail Online report said, Dr. Xinli Wei, a microbiol… [+3769 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Eta Aquarids Meteor Shower will peak this evening with up to 20 shooting stars per hour - Daily Mail", "description": "Met Office forecasters warn of showers and cloud cover for much of the UK, however, they expect some clear patches to break through overnight.", "url": "https://www.dailymail.co.uk/sciencetech/article-9549187/Eta-Aquarids-Meteor-Shower-peak-evening-20-shooting-stars-hour.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/06/09/42414412-0-image-a-5_1620289643035.jpg", "publishedAt": "2021-05-06T08:33:44Z", "content": "Up to 20 shooting stars per hour will be visible shooting across the night sky tonight as the Eta Aquarids meteor shower reaches its peak, with best viewing before dawn.\r\nThe show is the result of th… [+6464 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "This Tool By NASA Tells You What Hubble Telescope Observed In Space On Your Birthday! - Mashable India", "description": "Not a lot of people are aware of this but you can actually find out what NASA Hubble observed on your birthday! The tool was released by NASA on Hubble’s 30th anniversary and it’s really exciting to find out about the cosmic wonders it observed.", "url": "https://in.mashable.com/science/22067/this-tool-by-nasa-tells-you-what-hubble-space-telescope-observed-on-your-birthday", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/26649/26649_kkxz.jpg", "publishedAt": "2021-05-06T08:05:35Z", "content": "NASA Hubble just celebrated its 31st birthday last month on April 24 and not a lot of people are aware of this but you can actually find out what NASA Hubble observed in space on your birthday! The t… [+1792 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Saturn Has a Weirdly Neat, Symmetrical Magnetic Field. We May Finally Know Why - ScienceAlert", "description": "Saturn really stands out among the Solar System planets, and not just because of its glorious system of rings. Its magnetic field is also peculiar; unlike other planets, with their off-axis fields, Saturn's magnetic field is almost perfectly symmetri", "url": "https://www.sciencealert.com/saturn-has-a-weirdly-neat-and-symmetrical-magnetic-field-helium-rain-might-be-why", "urlToImage": "https://www.sciencealert.com/images/2021-05/processed/saturn_1024.jpg", "publishedAt": "2021-05-06T06:07:11Z", "content": "Saturn really stands out among the Solar System planets, and not just because of its glorious system of rings. Its magnetic field is also peculiar; unlike other planets, with their off-axis fields, S… [+3441 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "SpaceX will try to launch its Starship SN15 rocket in Texas today (updated) - Space.com", "description": "Liftoff could occur at 6:20 p.m. EDT (2220 GMT).", "url": "https://www.space.com/spacex-starship-sn15-launch-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uhZo4S238ttbJEXUyKyKu9-1200-80.jpg", "publishedAt": "2021-05-05T22:11:17Z", "content": "Update: SpaceX has successfully launched and landed its Starship SN15 rocket. You can see a replay of the launch above. You can read our wrap story here.\r\nSpaceX will attempt to launch its latest Sta… [+3048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Chinese rocket debris is expected to crash into Earth soon. It's not the first time. - CNN", "description": "China's large rocket is out of control and set to reenter Earth's atmosphere this weekend, bringing about an alarming but not unprecedented situation.", "url": "https://www.cnn.com/2021/05/05/politics/chinese-rocket-debris-space-earth-explainer-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210504155312-long-march-5b-launch-0429-super-tease.jpg", "publishedAt": "2021-05-05T22:04:00Z", "content": "Washington (CNN)The large Chinese rocket that is out of control and set to reenter Earth's atmosphere this weekend has brought about an alarming but not unprecedented situation. \r\nSpace debris has cr… [+7541 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Visit 'Mars' with me in Space.com's new 'Space Traveler' mini-documentary on Friday - Space.com", "description": "Premiering on Space.com this Friday at noon EDT (1600 GMT).", "url": "https://www.space.com/hi-seas-analog-astronaut-space-documentary-premiere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JHvgfDPgrnXKYihE6ymXYT-1200-80.jpg", "publishedAt": "2021-05-05T20:47:42Z", "content": "Have you ever wanted to go to Mars\r\n? \r\nFollow along with me, Space.com senior writer Chelsea Gohd, as I become an analog astronaut in a brand new documentary premiering on Space.com this Friday at n… [+2576 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Julia Jacobo", "title": "New species of prehistoric turtle discovered in Madagascar - ABC News", "description": "", "url": "https://abcnews.go.com/International/species-prehistoric-turtle-discovered-madagascar/story?id=77505377", "urlToImage": "https://s.abcnews.com/images/International/turtle-illo-ht-ps-210505_1620234114793_hpMain_16x9_992.jpg", "publishedAt": "2021-05-05T18:41:38Z", "content": "A new species of turtle that roamed Earth alongside dinosaurs and flying reptiles has been discovered in Madagascar.\r\nThe near-complete fossil of the quick-mouthed frog turtle, or Sahonachelys mailak… [+1430 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "'Freaky fanged frog' hiding in plain sight is a new species, scientists say - CNET", "description": "Nature is metal.", "url": "https://www.cnet.com/news/freaky-fanged-frog-hiding-in-plain-sight-is-a-new-species-scientists-say/", "urlToImage": "https://www.cnet.com/a/img/DbLwtd_SO9Tj7bDVYG2kR6SFK8U=/1200x630/2021/05/05/af426c42-2c3d-478b-9bae-eceede4512d3/fangedfrog1.jpg", "publishedAt": "2021-05-05T17:37:00Z", "content": "Limnonectes beloncioi (the Mindoro Fanged Frog) was originally thought to be the same species as another fanged frog.\r\nScott Travers\r\nYou might think of frogs as shy and retiring little creatures, bu… [+1344 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Scientists claim to have found evidence of FUNGI on the Red Planet - Daily Mail", "description": "Researchers claim that images from Mars taken by NASA rovers and orbiting spaceships appear to show fungus-like specimens emerging from the Martian soil.", "url": "https://www.dailymail.co.uk/sciencetech/article-9546225/Scientists-claim-evidence-FUNGI-Red-Planet.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/05/18/42615550-0-image-a-73_1620236012625.jpg", "publishedAt": "2021-05-05T17:34:54Z", "content": "Images captured by the NASA Curiosity rover on Mars contain evidence of mushrooms growing on the Red Planet, according to a new study.\r\nMicrobiologists Dr Xinli Wei from the Chinese Academy of Scienc… [+10297 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Chris Bergin", "title": "Starship SN15 conducts smooth test flight and nails landing - NASASpaceFlight.com - NASASpaceflight.com", "description": "Starship SN15 proved out a number of upgrades that resulted in a smooth touchdown on…", "url": "https://www.nasaspaceflight.com/2021/05/starship-sn15-tests-mcgregor-raptor-testing/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/05/E0qQf9jXMAI8OhK-525x350.jpg", "publishedAt": "2021-05-05T17:01:40Z", "content": "Starship SN15 proved out a number of upgrades that resulted in a smooth touchdown on the Boca Chica landing pad on Wednesday. The successful test took place amid ongoing groundwork for the push to or… [+10346 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Adam Mann", "title": "NASA simulation reveals the \"best defense\" against an asteroid impact - Inverse", "description": "At an annual conference, more than 300 scientists ran a simulated asteroid strike on Earth. What they found suggests we may not be prepared for the reality.", "url": "https://www.inverse.com/science/planetary-defense-conference-exercise-2021", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2021/5/5/13dcb7e7-7b89-45b2-b793-36283d01a629-shutterstock-302650415.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-05-05T17:00:25Z", "content": "On April 19, telescopes on Earth detected a huge asteroid out in the depths of space whizzing along at 11,000 miles per hour toward our planet. \r\nSimulated trajectories estimated it could crash down … [+7580 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists model Saturn's interior - Phys.org", "description": "New Johns Hopkins University simulations offer an intriguing look into Saturn's interior, suggesting that a thick layer of helium rain influences the planet's magnetic field.", "url": "https://phys.org/news/2021-05-scientists-saturn-interior.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/johns-hopkins-scientis-2.jpg", "publishedAt": "2021-05-05T16:36:47Z", "content": "New Johns Hopkins University simulations offer an intriguing look into Saturn's interior, suggesting that a thick layer of helium rain influences the planet's magnetic field.\r\nThe models, published t… [+2887 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Amy Thompson", "title": "SpaceX's next flight for Crew Dragon Resilience is a private launch of 4 civilians - Space.com", "description": "The capsule just returned from space with four astronauts.", "url": "https://www.space.com/spacex-crew-dragon-resilience-private-inspiration4-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tabbdeYsvAsVryyfDNoJC9-1200-80.jpg", "publishedAt": "2021-05-05T16:00:08Z", "content": "The SpaceX Dragon spacecraft Resilience may have just returned to Earth, but it already has a new mission: to carry the first private astronaut flight for SpaceX. \r\nAfter completing a 167-day stay at… [+2754 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "60 Years Ago: Alan Shepard Becomes the First American in Space - NASA", "description": "In 1961, the United States and the Soviet Union found themselves in a race to put the first human being into space. The United States initiated Project Mercury in 1958 to put the first American into space and selected its first group of astronauts in 1959 to …", "url": "https://www.nasa.gov/image-feature/60-years-ago-alan-shepard-becomes-the-first-american-in-space/", "urlToImage": "https://www.nasa.gov/sites/default/files/thumbnails/image/freedom_7_7_glenn_grissom_shepard_w_redstone_rocket_s61-00239.jpg", "publishedAt": "2021-05-05T15:47:27Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Jets from MRC 0600-399 bent by magnetic fields in the cluster Abell 3376 - Nature.com", "description": "Radio observations of the cluster Abell 3376, combined with numerical modelling, attribute the bent jets associated with the second-brightest galaxy in the cluster to an ordered magnetic field at the discontinuity.", "url": "https://www.nature.com/articles/s41586-021-03434-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-021-03434-1/MediaObjects/41586_2021_3434_Fig1_HTML.png", "publishedAt": "2021-05-05T15:14:44Z", "content": "<li>1.Markevitch, M. et al. Chandra observation of Abell 2142: survival of dense subcluster cores in a merger. Astrophys. J. 541, 542549 (2000).\r\nADS \r\n Article \r\nGoogle Scholar \r\n</li><li>2.Vikhlini… [+7473 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Yellowstone volcano hit by 43 earthquakes amid fears supervolcano is overdue an eruption - Daily Express", "description": "YELLOWSTONE volcano was struck by more than 40 earthquakes in April, amid widespread concern the US supervolcano is going to blow one day without warning. But is the Yellowstone volcano overdue for an eruption and should you be worried?", "url": "https://www.express.co.uk/news/science/1431599/yellowstone-volcano-earthquakes-usgs-supervolcano-overdue-eruption-yellowstone-latest-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1431599.jpg", "publishedAt": "2021-05-04T12:43:00Z", "content": null}]}