{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Keeping a weather eye on Earth from 22,236 miles above the planet - CNN", "description": "A new weather satellite will provide our most sophisticated and sharpest look yet at Earth's Western Hemisphere. GOES-18 can help weather forecasters improve their tracking of storms, wildfires and other hazards. The satellite will also monitor dangerous spac…", "url": "https://www.cnn.com/2022/02/04/world/noaa-goes18-western-weather-satellite-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203120315-01-noaa-goes-t-weather-satellite-super-tease.jpg", "publishedAt": "2022-02-04T12:00:00Z", "content": "(CNN)Whether it's wildfires that sweep across the West Coast, storms rolling in from the Pacific Ocean, or dense fog that blankets the Pacific Northwest, a new weather satellite will be able to track… [+5462 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Photons Incoming: Team Begins Aligning the Webb Space Telescope - SciTechDaily", "description": "https://youtu.be/_hekz7loDwM This animation shows the path light will follow as it hits the primary James Webb Space Telescope (JWST) mirror, and is reflected to the secondary, and then in through the aft optics assembly where the tertiary and fine steering m…", "url": "https://scitechdaily.com/photons-incoming-team-begins-aligning-the-webb-space-telescope/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Light-Path.gif", "publishedAt": "2022-02-04T10:23:06Z", "content": "This animation shows the path light will follow as it hits the primary James Webb Space Telescope (JWST) mirror, and is reflected to the secondary, and then in through the aft optics assembly where t… [+8763 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Breathtaking New Chandra Pics Show Cosmic Objects Like You've Never Seen Them Before - ScienceAlert", "description": "Human vision may be limited to a specific range of wavelengths, but that doesn't mean we'll never understand the full complexity of light in our Universe.", "url": "https://www.sciencealert.com/awe-inspiring-new-chandra-images-reveal-the-complexity-of-the-x-ray-cosmos", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/chandra-images_1024.jpg", "publishedAt": "2022-02-04T05:40:39Z", "content": "Human vision may be limited to a specific range of wavelengths, but that doesn't mean we'll never understand the full complexity of light in our Universe.\r\nInstruments can peer into the cosmos in reg… [+5767 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Are Scientists Being Fooled by Bacteria? New Machine Learning Algorithm Reveals the Truth About DNA - SciTechDaily", "description": "Previous studies of a genetic on/off switch may have been confounded by contamination, but Mount Sinai scientists have created a new tool for accurately determining whether it plays a role in human disease. For decades, a small group of cutting-edge medical r…", "url": "https://scitechdaily.com/are-scientists-being-fooled-by-bacteria-new-machine-learning-algorithm-reveals-the-truth-about-dna/", "urlToImage": "https://scitechdaily.com/images/DNA-Genetics.gif", "publishedAt": "2022-02-04T05:25:55Z", "content": "Previous studies of a genetic on/off switch may have been confounded by contamination, but Mount Sinai scientists have created a new tool for accurately determining whether it plays a role in human d… [+7076 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Alan Boyle, Universe Today", "title": "NASA Just Announced Where ISS Will Plunge to Its Death in Early 2031 - ScienceAlert", "description": "NASA says it plans to plunge the vestiges of the International Space Station (ISS) into a remote part of the Pacific Ocean known as Point Nemo in early 2031, after passing the baton to commercial space stations.", "url": "https://www.sciencealert.com/nasa-s-made-a-plan-for-the-end-of-the-international-space-station", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/PointNemoMarkedWithRedArrowInTheOcean_1024.jpg", "publishedAt": "2022-02-04T01:10:11Z", "content": "NASA says it plans to plunge the vestiges of the International Space Station (ISS) into a remote part of the Pacific Ocean known as Point Nemo in early 2031, after passing the baton to commercial spa… [+4136 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "China's Tianwen 1 Mars orbiter takes amazing video selfie for lunar New Year - Space.com", "description": "Tianwen 1 did something similar to celebrate the solar New Year a month ago.", "url": "https://www.space.com/china-tianwen-1-mars-selfie-lunar-new-year", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Mp79FLgiPk8gxQeYW6yahi-1200-80.jpeg", "publishedAt": "2022-02-03T23:10:23Z", "content": "China's Tianwen 1 Mars orbiter is once again delivering stunning imagery, with a new video released to celebrate the lunar New Year.\r\nThe 38-second clip shows shadows and sunlight moving across the b… [+1295 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers trace galaxy flows across 700 million light years - Phys.org", "description": "Everything in our universe moves, but the timescales needed to see motion are often vastly greater than human lifetimes. In a major new study, a team of astronomers from the University of Hawaiʻi Institute for Astronomy (IfA), University of Maryland and Unive…", "url": "https://phys.org/news/2022-02-astronomers-galaxy-million-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/astronomers-trace-gala.jpg", "publishedAt": "2022-02-03T20:57:31Z", "content": "Everything in our universe moves, but the timescales needed to see motion are often vastly greater than human lifetimes. In a major new study, a team of astronomers from the University of Hawaii Inst… [+3799 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "New artificial enamel is harder and more durable than the real thing - Science Magazine", "description": "Novel material mimics enamel’s complex structure with stronger components", "url": "https://www.science.org/content/article/new-artificial-enamel-harder-and-more-durable-real-thing", "urlToImage": "https://www.science.org/do/10.1126/science.ada0937/abs/artificialtoothenamel_istock1292486558.jpg", "publishedAt": "2022-02-03T20:12:06Z", "content": "Enamel enables teeth to take a stomping and keep on chomping. The hardest tissue in the human body is tough enough to resist dents, yet elastic enough not to crack during decades of jaw smashing. It’… [+4898 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Puffy Planets Lose Atmospheres, Become Super Earths - NASA", "description": "Astronomers have identified two different cases of \"mini-Neptune\" planets that are losing their puffy atmospheres and likely transforming into super-Earths. The new findings help paint a picture of how exotic worlds like these form and evolve, and help explai…", "url": "https://www.nasa.gov/feature/goddard/2022/hubble-puffy-planets-lose-atmospheres-become-super-earths/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hubble_puffyplanets_stsci-01ftvj48myz4tge5af72tjvwra.png", "publishedAt": "2022-02-03T20:07:18Z", "content": null}, {"source": {"id": null, "name": "My Modern Met"}, "author": null, "title": "NASA Satellite Captures Epic GIF of Moon Transiting the Earth - My Modern Met", "description": "NASA has captured this rarely seen sequence and now we can all see it.", "url": "https://mymodernmet.com/earth-moon-transit-dscovr/", "urlToImage": "https://mymodernmet.com/wp/wp-content/uploads/2022/02/moon-earth-transit-nasa-thumbnail.jpg", "publishedAt": "2022-02-03T19:27:14Z", "content": "Though it may look like a CGI animation, this gif of the Moon transiting Earth is very real. And what's even more incredible is the side of the Moon that's visible in the imagery. Taken in 2015 by a … [+2574 chars]"}, {"source": {"id": null, "name": "Getindianews.com"}, "author": null, "title": "PICTURE NASA TOOK ON MY BIRTHDAY: How To See The Photo Of NASA On Birth Day? (Updated) - Get India News", "description": "Picture Nasa Took On My Birthday: How to See Photo of NASA on Birth Day? Revealed: Nowadays social media has become the hot platform where new trends take off", "url": "https://getindianews.com/picture-nasa-took-on-my-birthday/", "urlToImage": "https://getindianews.com/wp-content/uploads/2022/02/Picture-Nasa-Took-On-My-Birthday2.jpg", "publishedAt": "2022-02-03T18:57:46Z", "content": "PICTURE NASA TOOK ON MY BIRTHDAY: How To See The Photo Of NASA On Birth Day? Step-by-Step Guide Explained: Nowadays social media has become the hot platform where new trends take off throughout the w… [+7108 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Highlights Science on Next Northrop Grumman Space Station Mission - NASA", "description": "NASA will host a media call at 1 p.m. EST on Thursday, Feb. 10, to discuss the science and technology demonstrations bound for the International Space Station aboard Northrop Grumman’s Cygnus spacecraft on the company’s 17th commercial resupply mission.", "url": "https://www.nasa.gov/press-release/nasa-highlights-science-on-next-northrop-grumman-space-station-mission/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/xroots.jpg", "publishedAt": "2022-02-03T18:22:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How fault lines in a kitchen sink are changing what we know about geology - Phys.org", "description": "In a new paper recently published in the journal Geology, researchers at the University of Massachusetts Amherst unveiled a physical model that yields an unprecedented, high-resolution look at the slip rates of faults, which determine the likelihood of earthq…", "url": "https://phys.org/news/2022-02-fault-lines-kitchen-geology.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/how-fault-lines-in-a-k.jpg", "publishedAt": "2022-02-03T18:00:14Z", "content": "In a new paper recently published in the journal Geology, researchers at the University of Massachusetts Amherst unveiled a physical model that yields an unprecedented, high-resolution look at the sl… [+3872 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Lucas Joel", "title": "Dissolving in Toxic Oceans: How an Ancient Extinction Happened - The New York Times", "description": "Scientists say rocks on the English coast contain clues of the processes that drove the end-Triassic event that killed as much as a quarter of all life on Earth.", "url": "https://www.nytimes.com/2022/02/03/science/extinction-triassic-volcano.html", "urlToImage": "https://static01.nyt.com/images/2022/02/03/science/03tb-extinction-promo/03tb-extinction-promo-facebookJumbo.jpg", "publishedAt": "2022-02-03T17:27:48Z", "content": "Bathed in toxic waters with no oxygen to breathe, marine life on top of being dissolved alive was all but doomed.\r\nNoah Planavsky, a biogeochemist at Yale University who was not involved in the resea… [+1317 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Engineers Create the “Impossible” – New Material That Is Stronger Than Steel and As Light as Plastic - SciTechDaily", "description": "The new substance is the result of a feat thought to be impossible: polymerizing a material in two dimensions. Using a novel polymerization process, MIT chemical engineers have created a new material that is stronger than steel and as light as plastic, and ca…", "url": "https://scitechdaily.com/mit-engineers-create-the-impossible-new-material-that-is-stronger-than-steel-and-as-light-as-plastic/", "urlToImage": "https://scitechdaily.com/images/Hammer-Cell-Phone.gif", "publishedAt": "2022-02-03T15:28:47Z", "content": "Stock video to illustrate the concept of a super strong cell phone.\r\nThe new substance is the result of a feat thought to be impossible: polymerizing a material in two dimensions.\r\nUsing a novel poly… [+5786 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA reveals details of the first all civilian crew going to visit the ISS - Daily Mail", "description": "They will launch on Wednesday, March 30, from Launch Complex 39A at NASA's Kennedy Space Center in Florida, on a flight-proven SpaceX Falcon 9 rocket.", "url": "https://www.dailymail.co.uk/sciencetech/article-10473165/NASA-reveals-details-civilian-crew-going-visit-ISS.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/03/15/53734715-0-image-a-6_1643901804221.jpg", "publishedAt": "2022-02-03T15:14:35Z", "content": "NASA has confirmed the details of the four civilian astronauts that will spend a week living and carrying out experiments on the International Space Station in April.\r\nAxiom Space, the private space … [+10649 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Loren Grush", "title": "New company run by former NASA leader aims to build robotic outpost near the Moon - The Verge", "description": "A new private spaceflight company called Quantum Space, run by former NASA acting administrator Steve Jurczyk, is aiming to building a robotic outpost in the space near the Moon.", "url": "https://www.theverge.com/2022/2/3/22914873/quantum-space-lunar-robotic-outpost-nasa-artemis", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lIP-7uIW9xxFPd-MxnHZcnxwiCw=/0x156:8000x4344/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215195/quantum_splash_012822.jpg", "publishedAt": "2022-02-03T15:00:00Z", "content": "Quantum Space wants to help you go to the Moon\r\nAn artistic rendering of the robotic outpost, servicing satellite, and other pathfinder vehicles that Quantum Space hopes to build.\r\nImage: Quantum Spa… [+5827 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Astronomers find the first rogue black hole wandering the Milky Way! - Syfy", "description": "Exploiting a bizarre property of black holes and gravity, astronomers may have made the first unambiguous detection of an isolated stellar-mass black hole in our galaxy, including a measurement of its mass and distance! If this pans out it will be the first r…", "url": "https://www.syfy.com/syfy-wire/bad-astronomy-first-rogue-black-hole-ever-found", "urlToImage": "https://www.syfy.com/sites/syfy/files/2021/10/art_blackhole_sky.jpg", "publishedAt": "2022-02-03T14:00:19Z", "content": "Exploiting a bizarre property of black holes and gravity, astronomers may have made the first unambiguous detection of an isolated stellar-mass black hole in our galaxy, including a measurement of it… [+5890 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Alexandra Alexandra", "title": "Scientists discover rare asteroid that will follow Earth in orbit for the next 4,000 years - CBS News", "description": "The Earth Trojan asteroid, only the second one proven by scientists to exist, orbits the sun along the same path as Earth.", "url": "https://www.cbsnews.com/news/asteroid-trojan-orbit-earth-space-4000-years/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/02/02/dc83c230-8657-40a3-badd-0fffb463045c/thumbnail/1200x630/9b8131ffbb6a1ae680872caec35e2e6e/low-res-foto-1-ctio-noirlab-nsf-aura-j-da-silva-spaceengine-jpg.png", "publishedAt": "2022-02-03T13:03:00Z", "content": "Scientists have proven the existence of an Earth Trojan asteroid — or a small rock that shares the same orbit as our planet — that will be following us for several thousand years. The study, publishe… [+2052 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Supermountains controlled the evolution of life on Earth - Phys.org", "description": "Giant mountain ranges at least as high as the Himalayas and stretching up to 8,000 kilometers across entire supercontinents played a crucial role in the evolution of early life on Earth, according to a new study by researchers at The Australian National Unive…", "url": "https://phys.org/news/2022-02-supermountains-evolution-life-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/supermountains-control.jpg", "publishedAt": "2022-02-03T12:15:30Z", "content": "Giant mountain ranges at least as high as the Himalayas and stretching up to 8,000 kilometers across entire supercontinents played a crucial role in the evolution of early life on Earth, according to… [+3557 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Amanda Hess", "title": "Apocalypse When? Global Warming’s Endless Scroll - The New York Times", "description": "From “Don’t Look Up” to Greta Thunberg videos to doomsaying memes, we are awash in warnings that we are almost out of time. But the climate crisis is outpacing our emotional capacity to describe it.", "url": "https://www.nytimes.com/2022/02/03/arts/climate-change-doomsday-culture.html", "urlToImage": "https://static01.nyt.com/images/2022/02/06/arts/06doomsday-notebook3/merlin_201011394_a9ee8092-2d29-43c3-a3ee-ec73731669c5-facebookJumbo.jpg", "publishedAt": "2022-02-03T10:00:15Z", "content": "In the 2020 Hulu documentary I Am Greta, the teenage climate activist Greta Thunberg explains how knowledge of global warming nearly killed her. After watching a film in school featuring starving pol… [+2459 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Woolly mammoth and other Ice Age remains found in Devon - BBC News", "description": "The bones, including those of a woolly rhinoceros and wolf, were found on a housing development.", "url": "https://www.bbc.com/news/uk-england-devon-60234766", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16468/production/_123104219_archaeologyteammemberrecordingdepositsbythewolfskull.imagecreditacarchaeology.jpg", "publishedAt": "2022-02-03T10:00:07Z", "content": "Image source, AC Archaeology\r\nImage caption, Part of a woolly mammoth tusk recovered from the site near Plymouth\r\nThe remains of a woolly mammoth have been found among a host of hugely significant Ic… [+2680 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Incoming! SpaceX Falcon 9 Rocket on Collision Course With the Moon - SciTechDaily", "description": "The Moon is set to gain one more crater. A leftover SpaceX Falcon 9 upper stage will impact the lunar surface in early March, marking the first time that a human-made debris item unintentionally reaches our natural satellite. In 2015 the Falcon 9 placed NOAA’…", "url": "https://scitechdaily.com/incoming-spacex-falcon-9-rocket-on-collision-course-with-the-moon/", "urlToImage": "https://scitechdaily.com/images/NASAs-LCROSS-Impacting-the-Moon.jpg", "publishedAt": "2022-02-03T09:30:06Z", "content": "A high-definition image of the Mars Australe lava plain on the Moon taken by Japan’s Kaguya lunar orbiter in November 2007. Credit: JAXA/NHK\r\nThe Moon is set to gain one more crater. A leftover Space… [+7638 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Drones flying over Mars could cause Saint Elmo’s fire, NASA says - RT", "description": "The rotating blades of drones flying in the Martian atmosphere could cause an electric glow known as Saint Elmo’s fire, NASA says", "url": "https://www.rt.com/uk/548173-mars-glow-drones-nasa/", "urlToImage": "https://cdni.rt.com/files/2022.02/article/61fb9c272030270d8b658800.jpg", "publishedAt": "2022-02-03T09:30:00Z", "content": "A team of NASA scientists conducted research to investigate how electricity could build up on the rotor blades of drones, causing the Martian air to glow. This phenomenon is known as Saint Elmo’s fir… [+2029 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Juno and Hubble data reveal electromagnetic 'tug-of-war' lights up Jupiter's upper atmosphere - Phys.org", "description": "New Leicester space research has revealed, for the first time, a complex 'tug-of-war' lights up aurorae in Jupiter's upper atmosphere, using a combination of data from NASA's Juno probe and the Hubble Space Telescope.", "url": "https://phys.org/news/2022-02-juno-hubble-reveal-electromagnetic-tug-of-war.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/juno-and-hubble-data-r.jpg", "publishedAt": "2022-02-03T08:59:56Z", "content": "New Leicester space research has revealed, for the first time, a complex 'tug-of-war' lights up aurorae in Jupiter's upper atmosphere, using a combination of data from NASA's Juno probe and the Hubbl… [+5834 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA delays SLS rollout for launch rehearsal - SpaceNews", "description": "NASA is postponing the rollout of the first Space Launch System for a final pre-launch test by a month to give more time to complete vehicle preparations.", "url": "https://spacenews.com/nasa-delays-sls-rollout-for-launch-rehearsal/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/12/sls-dec21.jpg", "publishedAt": "2022-02-03T01:10:44Z", "content": "WASHINGTON NASA is postponing the rollout of the first Space Launch System for a final prelaunch test by a month to give workers more time to complete vehicle preparations.\r\nNASA announced Feb. 2 tha… [+3874 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers offer theory about mysterious location of massive stars - Phys.org", "description": "Astronomers from Georgia State University have found an explanation for the strange occurrence of massive stars located far from their birthplace in the disk of our Milky Way Galaxy.", "url": "https://phys.org/news/2022-02-astronomers-theory-mysterious-massive-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/1-stars.jpg", "publishedAt": "2022-02-02T21:05:31Z", "content": "Astronomers from Georgia State University have found an explanation for the strange occurrence of massive stars located far from their birthplace in the disk of our Milky Way Galaxy.\r\nStars more mass… [+4328 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Astronaut Warns Tom Cruise About Appalling Smell on Space Station - Futurism", "description": "NASA astronaut Victor Glover sat down for a chat with Hollywood actor Tom Cruise to prepare him for what it's really like to spend time on board the ISS.", "url": "https://futurism.com/the-byte/astronaut-tom-cruise-smell-space-station", "urlToImage": "https://wp-assets.futurism.com/2022/01/astronaut-tom-cruise-smell-space-station.jpg", "publishedAt": "2022-02-02T20:49:53Z", "content": "\"When you go into the module that has the lifting, the strength training equipment, that's also where the bathroom is.\"\r\nEau de Space\r\nNASA astronaut Victor Glover sat down for a chat with Hollywood … [+2536 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "'Moderate' geomagnetic storm expected to hit Earth, giving some states chance to see northern lights - USA TODAY", "description": "A solar flare that erupted on Saturday evening could mean some Americans may see the northern lights Wednesday evening.", "url": "https://www.usatoday.com/story/news/nation/2022/02/02/solar-flare-northern-lights-visible-some-states/9316278002/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/06/12/USAT/3708482f-aed1-4cf0-8100-9a905dd5e00a-GettyImages-486010544.jpg?auto=webp&crop=2120,1193,x0,y215&format=pjpg&width=1200", "publishedAt": "2022-02-02T19:20:17Z", "content": "A powerful solar flare from over the weekend will make its way to Earth Wednesday as a \"moderate\" geomagnetic storm, the National Oceanic and Atmospheric Administration said, making the northern ligh… [+2422 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Secrets of Early Animal Evolution Revealed by Chromosome 'Tectonics' - Quanta Magazine", "description": "Large blocks of genes conserved through hundreds of millions of years of evolution hint at how the first animal chromosomes came to be.", "url": "https://www.quantamagazine.org/secrets-of-early-animal-evolution-revealed-by-chromosome-tectonics-20220202/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/02/Chromosome-Tectonics_1200_social.jpg", "publishedAt": "2022-02-02T19:00:26Z", "content": "Chromosomes, the bundles of DNA that star in the mitotic ballet of cell division, play a leading role in complex life. But the question of how chromosomes came to exist and evolve has long been disco… [+13029 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Shocked zircon find a 'one-off gift' from Mars - Phys.org", "description": "Curtin University researchers studying a Martian meteorite have found the first evidence of high-intensity damage caused by asteroid impact, in findings that have implications for understanding when conditions suitable for life may have existed on early Mars.", "url": "https://phys.org/news/2022-02-zircon-one-off-gift-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/mars.jpg", "publishedAt": "2022-02-02T19:00:02Z", "content": "Curtin University researchers studying a Martian meteorite have found the first evidence of high-intensity damage caused by asteroid impact, in findings that have implications for understanding when … [+3079 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "These photos of SpaceX's Italian satellite launch and rocket landing are amazing - Space.com", "description": "The sunset liftoff was a stunner.", "url": "https://www.space.com/spacex-csg-2-launch-rocket-landing-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mpA3TvyAGaMgdNvo5UZvmD-1200-80.jpg", "publishedAt": "2022-02-02T17:52:44Z", "content": "SpaceX's launch of an Italian Earth-observation satellite was worth the wait.\r\nSpaceX\r\n originally aimed to launch the Cosmo-SkyMed Second Generation FM2 (CSG-2) satellite on Thursday (Jan. 27), but … [+3096 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Fluctuation-induced quantum friction in nanoscale water flows - Nature.com", "description": "The quantum contribution to friction enables the rationalization of the peculiar friction properties of water on carbon surfaces, and in particular the radius dependence of slippage in carbon nanotubes.", "url": "https://www.nature.com/articles/s41586-021-04284-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-021-04284-7/MediaObjects/41586_2021_4284_Fig1_HTML.png", "publishedAt": "2022-02-02T16:37:37Z", "content": "<li>1.Bocquet, L. Nanofluidics coming of age. Nat. Mater.19, 254256 (2020).\r\nADS \r\n CAS \r\n Article \r\nGoogle Scholar \r\n</li><li>2.Holt, J. K. et al. Fast mass transport through sub-2-nanometer carbon … [+7352 chars]"}, {"source": {"id": null, "name": "OPB News"}, "author": "Cassandra Profita", "title": "Scientists detect new movement in Three Sisters volcanoes - OPB News", "description": "Scientists are seeing new signs that magma is moving deep within the Three Sisters volcanic complex in Oregon’s Cascade Range, but there are no signs of imminent eruption.", "url": "https://www.opb.org/article/2022/02/02/scientists-detect-new-movement-in-three-sisters-volcanoes/", "urlToImage": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/5KEYQzndElydtAHUafd8sLNH_vg=/1200x675/smart/cloudfront-us-east-1.images.arcpublishing.com/opb/DYNSS5Y32JGEZK2O3ECL2FFXVA.jpg", "publishedAt": "2022-02-02T13:02:24Z", "content": "An aerial view from the south of South Sister, Middle Sister and North Sister in Oregon's Cascade Range.\r\nCourtesy of U.S. Geological Survey / John Scurlock\r\nScientists are seeing new signs that magm… [+3268 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In 20 Years, Greenland Ice Sheet Loses Water Enough To Submerge US: Study - NDTV", "description": "Greenland's immense ice sheet has lost enough ice in the past 20 years to submerge the entire United States in half a metre of water, according to data released this week by Danish researchers.", "url": "https://www.ndtv.com/world-news/greenland-ice-sheet-loses-enough-water-in-20-years-to-submerge-us-study-2743770", "urlToImage": "https://c.ndtvimg.com/2020-08/qp51olsg_greenland_625x300_17_August_20.jpg", "publishedAt": "2022-02-01T21:09:00Z", "content": "Greenland ice sheet has lost about 4,700 billion tonnes of ice since 2002. (File)\r\nCopenhagen: Greenland's immense ice sheet has lost enough ice in the past 20 years to submerge the entire United Sta… [+2241 chars]"}]}