{"status": "ok", "totalResults": 33, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes Act as a Safety Valve for Earth’s Long-Term Climate – Stabilizing Surface Temperatures - SciTechDaily", "description": "Scientists at the University of Southampton have discovered that extensive chains of volcanoes have been responsible for both emitting and then removing atmospheric carbon dioxide (CO2) over geological time. This stabilized temperatures at Earth’s surface. Th…", "url": "https://scitechdaily.com/volcanoes-act-as-a-safety-valve-for-earths-long-term-climate-stabilizing-surface-temperatures/", "urlToImage": "https://scitechdaily.com/images/Kamchatka-Erosion.jpg", "publishedAt": "2021-08-24T08:26:56Z", "content": "Continental volcanic arcs such as this one in Kamchatka, Russia, are rapidly weathered, driving CO2 removal from the atmosphere over geological time. Credit: Tom Gernon, University of Southampton\r\nSc… [+5132 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Christina Larson", "title": "Fossil leaves may reveal climate in last era of dinosaurs - Associated Press", "description": "WASHINGTON (AP) — Richard Barclay opens a metal drawer in archives of the Smithsonian Natural History Museum containing fossils that are nearly 100 million years old. Despite their age, these rocks aren’t fragile.", "url": "https://apnews.com/article/climate-environment-and-nature-fossils-climate-change-dinosaurs-904002ff30d375808639e2f7be88e976", "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfca4eafa19e4c0388813e3d9c5e165f/3000.jpeg", "publishedAt": "2021-08-24T05:14:01Z", "content": "WASHINGTON (AP) Richard Barclay opens a metal drawer in archives of the Smithsonian Natural History Museum containing fossils that are nearly 100 million years old. Despite their age, these rocks are… [+5475 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Florina Spînu", "title": "Terminator Tape Draws Satellites Back to Earth Faster to Their Fiery Doom - autoevolution", "description": "Millennium Space Systems, a Boeing company, has successfully demonstrated the ability to safely and quickly de-orbit a satellite by using its Terminator Tape Deorbit Module, a lightweight solution for end-of-mission disposal of satellites that helps ensure th…", "url": "https://www.autoevolution.com/news/terminator-tape-draws-satellites-back-to-earth-faster-to-their-fiery-doom-167917.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/terminator-tape-draws-satellites-back-to-earth-faster-to-their-fiery-doom-167917_1.jpg", "publishedAt": "2021-08-23T21:52:00Z", "content": "We all know that space junk is becoming more and more of an issue. Our planet is progressively being suffocated by our leftover waste, with the Department of Defense's global Space Surveillance Netwo… [+1582 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Rocket Lab’s Mars mission gets green light from NASA - TechCrunch", "description": "Rocket Lab is one step closer to going to Mars with NASA’s approval of the company’s Photon spacecraft for an upcoming science mission. If all continues according to plan the two craft will launch in 2024 and arrive on the red planet 11 months later to study …", "url": "http://techcrunch.com/2021/08/23/rocket-labs-mars-mission-gets-green-light-from-nasa/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/Rocket-Lab-Photon-Blue-Gold-ESCAPADE-Mission.jpg?w=624", "publishedAt": "2021-08-23T21:05:01Z", "content": "Rocket Lab is one step closer to going to Mars with NASA’s approval of the company’s Photon spacecraft for an upcoming science mission. If all continues according to plan the two craft will launch in… [+2155 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Scientists Just Discovered the Fastest Asteroid in the Solar System - Futurism", "description": "It's a real speed demon.", "url": "https://futurism.com/the-byte/fastest-asteroid-solar-system", "urlToImage": "https://wp-assets.futurism.com/2021/08/fastest-asteroid-solar-system.jpg", "publishedAt": "2021-08-23T20:36:12Z", "content": "It gets close enough to the Sun to melt lead.\r\nSpeed Demon\r\nA team of researchers led by Scott Sheppard, a staff scientist at the Carnegie Institution of Science, has discovered the fastest-orbiting … [+2001 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera Staff", "title": "Robot, plants to blast off on upcoming SpaceX mission to ISS - Al Jazeera English", "description": "The experiments on the latest SpaceX supply mission probe everything from bone and eye health to robot dexterity.", "url": "https://www.aljazeera.com/economy/2021/8/23/robot-plants-to-blast-off-on-upcoming-spacex-mission-to-iss", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/08/jsc2021e036654_orig.jpg?resize=1200%2C630", "publishedAt": "2021-08-23T19:59:01Z", "content": "SpaceX is targeting Saturday for the launch of its next resupply mission to the International Space Station (ISS), and it plans to have some fascinating scientific experiments in tow.\r\nWhen the comme… [+2839 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mathematicians build an algorithm to 'do the twist' - Phys.org", "description": "Mathematicians at the Center for Advanced Mathematics for Energy Research Applications (CAMERA) at Lawrence Berkeley National Laboratory (Berkeley Lab) have developed a mathematical algorithm to decipher the rotational dynamics of twisting particles in large …", "url": "https://phys.org/news/2021-08-mathematicians-algorithm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/berkeley-lab-mathemati.jpg", "publishedAt": "2021-08-23T19:58:03Z", "content": "Mathematicians at the Center for Advanced Mathematics for Energy Research Applications (CAMERA) at Lawrence Berkeley National Laboratory (Berkeley Lab) have developed a mathematical algorithm to deci… [+8258 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "What is multiverse theory? - Livescience.com", "description": "Do we live in a multiverse? Maybe, maybe not.", "url": "https://www.livescience.com/multiverse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9JXpWhDRvxjBzEfzXjoHCX-1200-80.jpg", "publishedAt": "2021-08-23T19:55:39Z", "content": "Multiverse theory suggests that our universe, with all its hundreds of billions of galaxies and almost countless stars, spanning tens of billions of light-years, may not be the only one. Instead, the… [+5971 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "NASA Curiosity Rover Snaps New 360-Panorama of Mars' Mountains - PetaPixel", "description": "NASA's Curiosity rover has captured a new 360-degree panorama that features a look over Mount Sharp, a crucial region for the mission.", "url": "https://petapixel.com/2021/08/23/nasa-curiosity-rover-snaps-new-360-panorama-of-mars-mountains/", "urlToImage": "https://petapixel.com/assets/uploads/2021/08/mars-rover-curiosity-panorama-petapixel-2.jpg", "publishedAt": "2021-08-23T19:27:03Z", "content": "NASA’s Curiosity Mars rover has captured a new 360-degree panorama that reveals the diverse terrain of Mount Sharp, a crucial part of the planet that plays an integral role in helping scientists stud… [+2378 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "Martian snow is dusty, could potentially melt, new study shows - Phys.org", "description": "Over the last two decades, scientists have found ice in many locations on Mars. Most Martian ice has been observed from orbital satellites like NASA's Mars Reconnaissance Orbiter. But determining the grain size and dust content of the ice from that far above …", "url": "https://phys.org/news/2021-08-martian-dusty-potentially.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/martian-snow-is-dusty.jpg", "publishedAt": "2021-08-23T19:18:47Z", "content": "Over the last two decades, scientists have found ice in many locations on Mars. Most Martian ice has been observed from orbital satellites like NASA's Mars Reconnaissance Orbiter. But determining the… [+2900 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "The Science of Underground Kingdoms - Caltech", "description": "Caltech's Jose Andrade and Joe Parker look at how ants dig tunnels, and come up with some surprising results.", "url": "https://www.caltech.edu/about/news/the-science-of-underground-kingdoms", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/Ant_Farm_Tunneling2.width-600.jpg", "publishedAt": "2021-08-23T19:01:27Z", "content": "Understanding ant physics\r\nNext, Andrade's team set about analyzing what the ants were actually doing as they worked, and a few patterns emerged. For one, Andrade says, the ants tried to be efficient… [+4652 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genetic patterns offer clues to evolution of homosexuality - Nature.com", "description": "Massive study finds that genetic markers associated with same-sex encounters might aid reproduction. But some scientists question the conclusions.", "url": "https://www.nature.com/articles/d41586-021-02312-0", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-021-02312-0/d41586-021-02312-0_19590374.jpg", "publishedAt": "2021-08-23T18:29:39Z", "content": "Same-sex attraction seems to be at least partly controlled by genetics.Credit: Piotr Lapinski/NurPhoto via Getty\r\nTo evolutionary biologists, the genetics of homosexuality seems like a paradox. In th… [+6803 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Stunning 'Einstein Ring' is spotted by the Hubble Telescope 65 million light-years from Earth - Daily Mail", "description": "The 'Einstein Ring' formed when a quasar was magnified as it passed through the gravitational field of two galaxies that are much farther away. Albert Einstein called this gravitational lensing.", "url": "https://www.dailymail.co.uk/sciencetech/article-9919789/Stunning-Einstein-Ring-spotted-Hubble-Telescope-65-million-light-years-Earth.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/23/19/47010349-0-image-a-62_1629741969243.jpg", "publishedAt": "2021-08-23T18:28:46Z", "content": "The Hubble Space Telescope captured a stunning Einstein Ring in the Virgo constellation that sits more than 65 million light-years from Earth.  \r\nThis cosmic display, formally known as gravitational … [+4947 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Thousands of New Radio Signals Have Been Detected From Nearby Cosmic Sources - ScienceAlert", "description": "A powerful radio telescope staring at a satellite galaxy of the Milky Way has detected thousands of hitherto unknown radio sources.", "url": "https://www.sciencealert.com/thousands-of-never-seen-before-radio-signals-detected-in-the-large-magellanic-cloud", "urlToImage": "https://www.sciencealert.com/images/2021-08/processed/tarantula-nebula_1024.jpg", "publishedAt": "2021-08-23T18:03:14Z", "content": "A powerful radio telescope staring at a satellite galaxy of the Milky Way has detected thousands of hitherto unknown radio sources.\r\nIn the direction of the Large Magellanic Cloud, thousands of nearb… [+3800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Doomed comet ATLAS had a long history with Earth - CNN", "description": "Comet ATLAS first appeared in 2020, but it disintegrated into tiny ice shards months later. Observations made while the comet was still intact have shed light on the comet's \"family,\" which stretches back thousands of years.", "url": "https://www.cnn.com/2021/08/23/world/comet-atlas-parent-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210823112348-comet-atlas-april-2020-super-tease.jpg", "publishedAt": "2021-08-23T17:35:00Z", "content": null}, {"source": {"id": null, "name": "GeekWire"}, "author": "https://www.facebook.com/lisa.stiffler.5", "title": "How is the ‘snowiest place on Earth’ faring in this record-hot summer? It’s a little rocky on Rainier - GeekWire", "description": "Washington's Mount Rainier is either the snowiest place on Earth, or a close runner up. From records collected over the past century, the average annual snowfall at Rainier's Paradise area is nearly…", "url": "https://www.geekwire.com/2021/snowiest-place-earth-faring-record-hot-summer-gotten-little-rocky/", "urlToImage": "https://cdn.geekwire.com/wp-content/uploads/2021/08/Rainier1.jpg", "publishedAt": "2021-08-23T17:06:47Z", "content": "A photo of Mount Rainier taken by Dr. Samuel Browd on Aug. 9, 2021 on a flight en route to a meeting. (Samuel Browd Photo)\r\nWashingtons Mount Rainier is either the snowiest place on Earth, or a close… [+6143 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Volcanoes acted as a safety valve for Earth's long-term climate - Phys.org", "description": "Scientists at the University of Southampton have discovered that extensive chains of volcanoes have been responsible for both emitting and then removing atmospheric carbon dioxide (CO2) over geological time. This stabilized temperatures at Earth's surface.", "url": "https://phys.org/news/2021-08-volcanoes-safety-valve-earth-long-term.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/volcanoes-acted-as-a-s.jpg", "publishedAt": "2021-08-23T15:00:05Z", "content": "Scientists at the University of Southampton have discovered that extensive chains of volcanoes have been responsible for both emitting and then removing atmospheric carbon dioxide (CO2) over geologic… [+4900 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Perseverance rover snaps Mars' dainty moon Deimos - CNET", "description": "That's no moon. Oh wait, it is a moon.", "url": "https://www.cnet.com/news/try-to-spot-dainty-mars-moon-deimos-in-this-wondrous-nasa-rover-shot/", "urlToImage": "https://www.cnet.com/a/img/yB74wCWB7f793qAu48v5vN_XLnw=/1200x630/2021/08/23/7f30a03e-ee6b-4355-abaa-6ae91fd67486/mars-perseverance-nlf-0173-0682322749-659ecm-n0061648ncam00514-01-295j.jpg", "publishedAt": "2021-08-23T14:11:35Z", "content": "Can you find Deimos in this image from Aug. 15, 2021? NASA's movie shows you where it is.\r\nNASA/JPL-Caltech\r\nThis story is part of Welcome to Mars, our series exploring the red planet.\r\nOn Earth, we … [+1779 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Radio Image of Andromeda Galaxy Is the Most-Detailed Ever Captured - SciTechDaily", "description": "Disk of galaxy identified as region where new stars are born. Scientists have published a new, detailed radio image of the Andromeda galaxy – the Milky Way’s sister galaxy – which will allow them to identify and study the regions of Andromeda where new stars …", "url": "https://scitechdaily.com/new-radio-image-of-andromeda-galaxy-is-the-most-detailed-ever-captured/", "urlToImage": "https://scitechdaily.com/images/Andromeda-Galaxy-Captured-at-6-6-GHz.jpg", "publishedAt": "2021-08-23T14:01:55Z", "content": "Radio image of Andromeda galaxy at 6.6 GHz (inset), captured using the Sardinia Radio Telescope in Italy. Credit: S. Fatigoni et al (2021)\r\nDisk of galaxy identified as region where new stars are bor… [+3926 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "T. rex's jaw had sensors that made it an even more fearsome predator - Phys.org", "description": "Tyrannosaurus rex was not just a huge beast with a big bite, it had nerve sensors in the very tips of its jaw enabling it to better detect—and eat—its prey, a new study published in the peer-reviewed journal Historical Biology today finds.", "url": "https://phys.org/news/2021-08-rex-jaw-sensors-fearsome-predator.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/t-rexs-jaw-had-sensors.jpg", "publishedAt": "2021-08-23T13:43:12Z", "content": "Tyrannosaurus rex was not just a huge beast with a big bite, it had nerve sensors in the very tips of its jaw enabling it to better detectand eatits prey, a new study published in the peer-reviewed j… [+4000 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Unveiling a century-old mystery: Where the Milky Way's cosmic rays come from - Phys.org", "description": "Astronomers have succeeded for the first time in quantifying the proton and electron components of cosmic rays in a supernova remnant. At least 70% of the very-high-energy gamma rays emitted from cosmic rays are due to relativistic protons, according to the n…", "url": "https://phys.org/news/2021-08-unveiling-century-old-mystery-milky-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/unveiling-a-century-ol.jpg", "publishedAt": "2021-08-23T12:37:55Z", "content": "Astronomers have succeeded for the first time in quantifying the proton and electron components of cosmic rays in a supernova remnant. At least 70% of the very-high-energy gamma rays emitted from cos… [+5418 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Eva Frederick", "title": "So-called 'junk' DNA plays a key role in speciation - Phys.org", "description": "More than 10 percent of our genome is made up of repetitive, seemingly nonsensical stretches of genetic material called satellite DNA that do not code for any proteins. In the past, some scientists have referred to this DNA as \"genomic junk.\"", "url": "https://phys.org/news/2021-08-so-called-junk-dna-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/so-called-junk-dna-pla.jpg", "publishedAt": "2021-08-23T12:35:38Z", "content": "More than 10 percent of our genome is made up of repetitive, seemingly nonsensical stretches of genetic material called satellite DNA that do not code for any proteins. In the past, some scientists h… [+7259 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Rothery", "title": "The five most impressive geological structures in the solar system - Phys.org", "description": "When we talk about amazing geological features, we often limit ourselves to those on Earth. But as a geologist, I think that's crazy—there are so many structures on other worlds that can excite and inspire, and that can put processes on our own planet into pe…", "url": "https://phys.org/news/2021-08-geological-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/the-five-most-impressi.jpg", "publishedAt": "2021-08-23T12:33:57Z", "content": "When we talk about amazing geological features, we often limit ourselves to those on Earth. But as a geologist, I think that's crazythere are so many structures on other worlds that can excite and in… [+6601 chars]"}, {"source": {"id": null, "name": "FierceBiotech"}, "author": null, "title": "Sabatini, biotech founder and mTOR pioneer, ousted after sexual harassment investigation - FierceBiotech", "description": "David Sabatini, the scientific founder of several biotechs, has been ousted from his lab after a sexual harassment investigation. The high-profile cell signaling and cancer metabolism scientist is “no longer associated” with either the Whitehead Institute or …", "url": "https://www.fiercebiotech.com/biotech/sabatini-biotech-founder-and-mtor-pioneer-ousted-after-sexual-harassment-investigation", "urlToImage": "https://qtxasset.com/fiercebiotech/1629713837/Sabatini_Big.jpeg?6GpboEp7CsY8Ks6mYxK.rS1.SwKRAT6k", "publishedAt": "2021-08-23T11:40:00Z", "content": "David Sabatini, M.D., Ph.D., scientific founder of several biotechs, has been ousted from his lab after a sexual harassment investigation. The high-profile cell signaling and cancer metabolism scient… [+1940 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Adam Mann", "title": "Mystery object in space could be a new arm of the Milky Way - Livescience.com", "description": "Scientists spot giant feature at edge of the galaxy.", "url": "https://www.livescience.com/new-arm-milky-way-cattail.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vd7PB2tyqzqCFXrhczaZDB-1200-80.jpg", "publishedAt": "2021-08-23T11:00:30Z", "content": "Astronomers have discovered an enormous new filament of gas and dust hanging at the outer edge of our galaxy. Nicknamed \"Cattail,\" the feature is not yet fully mapped, and the team who found it belie… [+3331 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "NASA updates world on odds of devastating asteroid impacting Earth - TweakTown", "description": "NASA has updated the world on the odds of one of the most likely asteroids impacting Earth that would cause devastation.", "url": "https://www.tweaktown.com/news/81251/nasa-updates-world-on-odds-of-devastating-asteroid-impacting-earth/index.html", "urlToImage": "https://static.tweaktown.com/news/8/1/81251_01_nasa-updates-world-on-odds-of-devastating-asteroid-impacting-earth_full.jpg", "publishedAt": "2021-08-23T10:03:02Z", "content": "A relatively new study has been able to predict the exact date for asteroid Bennu's highest chance of impacting Earth.\r\nNASA created the Planetary Defense Coordination Office (PDCO) back in 2016 with… [+1859 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Interstellar comets like Borisov may not be all that rare - Phys.org", "description": "In 2019, astronomers spotted something incredible in our backyard: a rogue comet from another star system. Named Borisov, the icy snowball traveled 110,000 miles per hour and marked the first and only interstellar comet ever detected by humans.", "url": "https://phys.org/news/2021-08-interstellar-comets-borisov-rare.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/interstellar-comets-li.jpg", "publishedAt": "2021-08-23T10:00:01Z", "content": "In 2019, astronomers spotted something incredible in our backyard: a rogue comet from another star system. Named Borisov, the icy snowball traveled 110,000 miles per hour and marked the first and onl… [+5142 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Huge Number of Rogue Supermassive Black Holes Are Wandering The Universe - ScienceAlert", "description": "Supermassive black holes tend to sit, more or less stationary, at the centers of galaxies. But not all of these awesome cosmic objects stay put; some may be knocked askew, wobbling around galaxies like cosmic nomads.", "url": "https://www.sciencealert.com/there-could-be-a-huge-number-of-wandering-supermassive-black-holes-out-there", "urlToImage": "https://www.sciencealert.com/images/2021-08/processed/smbh-art_1024.jpg", "publishedAt": "2021-08-23T06:22:07Z", "content": "Supermassive black holes tend to sit, more or less stationary, at the centers of galaxies. But not all of these awesome cosmic objects stay put; some may be knocked askew, wobbling around galaxies li… [+4021 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NuSTAR Space Observatory: Seeing Some Cosmic X-Ray Emitters Might Be a Matter of Perspective - SciTechDaily", "description": "Known as ultraluminous X-ray sources, the emitters are easy to spot when viewed straight on, but they might be hidden from view if they point even slightly away from Earth. It’s hard to miss a flashlight beam pointed straight at you. But that beam viewed from…", "url": "https://scitechdaily.com/nustar-space-observatory-seeing-some-cosmic-x-ray-emitters-might-be-a-matter-of-perspective/", "urlToImage": "https://scitechdaily.com/images/SS-433-Animation-Crop.gif", "publishedAt": "2021-08-23T01:56:04Z", "content": "ByJet Propulsion LaboratoryAugust 22, 2021\r\nThis illustration shows SS 433, a black hole or neutron star, as it pulls material away from its companion star. The stellar material forms a disk around S… [+9106 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Steph Panecasio", "title": "Puffy-cheeked prehistoric creature named after The Hobbit character - CNET", "description": "The early ancestors of horses, cows and other hoofed creatures could have big implications for the evolution of mammals.", "url": "https://www.cnet.com/news/puffy-cheeked-prehistoric-creature-named-after-the-hobbit-character/", "urlToImage": "https://www.cnet.com/a/img/Ooxs10Qn_FBZoWVYqq4LmNbbxGo=/1200x630/2021/08/18/e05730b5-31c6-4170-81e2-92eed35f7d19/tdos-beorn-jpg.jpg", "publishedAt": "2021-08-23T00:03:23Z", "content": "An artist's rendering of the Conacodon hettingeri, Miniconus jeanninae and Beornus honeyi. \r\nBanana Art Studio\r\nThe discovery of a previously unknown creature is even more fun when we can link it to … [+2508 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Making nylon 6-6 'greener,' and without zinc - Phys.org", "description": "Outdoor stadium seats, ski bindings, tire reinforcements and other products that require strength, durability and weather resistance are all made with a type of nylon called nylon 6-6. However, producing this material requires an environmentally unfriendly pr…", "url": "https://phys.org/news/2021-08-nylon-greener-zinc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/making-nylon-6-6-green.jpg", "publishedAt": "2021-08-22T12:53:29Z", "content": "Outdoor stadium seats, ski bindings, tire reinforcements and other products that require strength, durability and weather resistance are all made with a type of nylon called nylon 6-6. However, produ… [+4163 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Rare Blue Moon of August 2021 rises tonight. Here's what to expect. - Space.com", "description": "The August full moon, also known as the \"Sturgeon Moon,\" reaches its peak Sunday morning at 8:02 a.m. EDT (1200 GMT). It is also considered a seasonal Blue Moon because it is the third full moon to occur in a single season that has four full moons.", "url": "https://www.space.com/rare-blue-moon-august-2021-rises-tonight", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fAvChvPyP2KvgLcfBhX3dk-1200-80.jpg", "publishedAt": "2021-08-22T11:40:30Z", "content": "The August full moon rises tonight (Aug. 22), bringing skywatchers a rare seasonal \"Blue Moon.\" \r\nThe full moon, also known as the \"Sturgeon Moon,\" reaches its peak Sunday morning at 8:02 a.m. EDT (1… [+3188 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "What color is the universe? - Livescience.com", "description": "It is a bit tamer than you might imagine.", "url": "https://www.livescience.com/average-color-of-universe.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gjwF3CaJSee2Hr3LUodYyJ-1200-80.jpg", "publishedAt": "2021-08-22T11:00:30Z", "content": "A colorful shot of nebula and stars in deep space. (Image credit: Shutterstock)\r\nWhen you look up at the night sky, it's easy to think that the universe is a never-ending sea of blackness. But if you… [+5394 chars]"}]}