{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Explanation for the Two-Faced Moon: Colossal Ancient Impact Linked to Differences Between the Moon's Near and Far Sides - SciTechDaily", "description": "New research shows how the impact that created the Moon’s South Pole–Aitken basin is linked to the stark contrast in composition and appearance between the two sides of the Moon. The face that the Moon shows to Earth looks far different from the one it hides …", "url": "https://scitechdaily.com/explanation-for-the-two-faced-moon-colossal-ancient-impact-linked-to-differences-between-the-moons-near-and-far-sides/", "urlToImage": "https://scitechdaily.com/images/Moon-Impact-Driven-Convection.jpg", "publishedAt": "2022-04-10T15:14:25Z", "content": "A new study reveals that an ancient collision on the Moon’s south pole changed patterns of convection in the lunar mantle, concentrating a suite of heat-producing elements on the nearside. Those elem… [+5339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabh Sinha", "title": "India’s space debris back to levels before 2019 anti-satellite test, lowest among major space-faring nations - The Indian Express", "description": "India’s contribution to space debris had increased sharply in 2019 after the country’s first-ever anti-satellite test, during which India had demonstrated its capability to strike at an enemy country’s space assets.", "url": "https://indianexpress.com/article/india/indias-space-debris-2019-anti-satellite-test-7862796/", "urlToImage": "https://images.indianexpress.com/2019/10/chandrayaan-1200-pti-1.jpg", "publishedAt": "2022-04-10T13:37:30Z", "content": "The debris created by Indias anti-satellite test in March 2019 seems to have all decayed or disintegrated, and Indias contribution to space debris has fallen to the lowest levels in the last four yea… [+2842 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Four Private Ax-1 Astronauts Enter Space Station, Meet Expedition 67 Crew - SciTechDaily", "description": "Axiom Mission 1 (Ax-1) astronauts Michael Lopez-Alegria, Larry Connor, Eytan Stibbe, and Mark Pathy are now aboard the International Space Station following Crew Dragon’s hatch opening at 10:13 a.m. EDT, Saturday, April 9. It is the first mission with an enti…", "url": "https://scitechdaily.com/four-private-ax-1-astronauts-enter-space-station-meet-expedition-67-crew/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Axiom-Space-Ax-1.gif", "publishedAt": "2022-04-10T09:25:37Z", "content": "Axiom Mission 1 (Ax-1) astronauts Michael Lopez-Alegria, Larry Connor, Eytan Stibbe, and Mark Pathy are now aboard the International Space Station following Crew Dragon’s hatch opening at 10:13 a.m. … [+3297 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot, Alia Shoaib", "title": "Dinosaur fossil from day extinction asteroid hit earth, scientists claim - Business Insider", "description": "Dinosaur fossils found at Tanis in North Dakota are believed to date back to the mass extinction event when an asteroid struck 66 million years ago.", "url": "https://www.businessinsider.com/dinosaur-fossil-from-day-extinction-asteroid-hit-earth-scientists-claim-2022-4", "urlToImage": "https://i.insider.com/62503b6700ada10018fc0e5e?width=1200&format=jpeg", "publishedAt": "2022-04-10T08:23:33Z", "content": "Scientists claim to have found a fossil of a dinosaur killed on the day an extinction asteroid struck the Earth 66 million years ago.\r\nScientists say that the perfectly preserved leg of a Thescelosau… [+4471 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA to delay, modify SLS countdown rehearsal - SpaceNews", "description": "After discovering a problem with a valve on the SLS upper stage, NASA is both delaying a countdown rehearsal and fueling test and modifying it.", "url": "https://spacenews.com/nasa-to-delay-modify-sls-countdown-rehearsal/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/04/sls-wdr-220409.jpg", "publishedAt": "2022-04-09T23:47:20Z", "content": "WASHINGTON After discovering a problem with a valve on the Space Launch Systems upper stage, NASA is delaying a countdown rehearsal and fueling test and modifying it to limit fueling of the upper sta… [+2862 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "New Theory Suggests That Dark Matter Could Be an Extra-Dimensional Cosmic Refugee - ScienceAlert", "description": "Massive gravitons may have formed a trillionth of a second after the Big Bang, in abundances great enough to account for dark matter.", "url": "https://www.livescience.com/dark-matter-particles-from-extra-dimensions", "urlToImage": "https://cdn.mos.cms.futurecdn.net/p42j6o2TsMJyU6u9GEZfta-1200-80.jpg", "publishedAt": "2022-04-09T20:03:37Z", "content": "Dark matter, the elusive substance that accounts for the majority of the mass in the universe, may be made up of massive particles called gravitons that first popped into existence in the first momen… [+4872 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "5,500 New RNA Virus Species Discovered in the Ocean – Tracing the Origins of Viruses and the Origins of Life - SciTechDaily", "description": "Ocean Water Samples Yield Treasure Trove of RNA Virus Data Ocean water samples collected around the world have yielded a treasure trove of new data about RNA viruses, expanding ecological research possibilities and reshaping our understanding of how these sma…", "url": "https://scitechdaily.com/5500-new-rna-virus-species-discovered-in-the-ocean-tracing-the-origins-of-viruses-and-the-origins-of-life/", "urlToImage": "https://scitechdaily.com/images/Ocean-Underwater.jpg", "publishedAt": "2022-04-09T17:25:22Z", "content": "Ocean Water Samples Yield Treasure Trove of RNA Virus Data\r\nOcean water samples collected around the world have yielded a treasure trove of new data about RNA viruses, expanding ecological research p… [+8484 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Astronomers detect a powerful space laser that is 5 billion light-years away - Interesting Engineering", "description": "An international team of astronomers has detected a 'galactic space laser' shooting light beams at Earth from 5 billion light-years away. It is the most distant megamaser of its kind ever detected.", "url": "https://interestingengineering.com/space-5-billion-light-years", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/k7GM55RLGZ/sizes/megamaser_md.jpg", "publishedAt": "2022-04-09T14:40:53Z", "content": "An international team of astronomers led by Dr. Marcin Glowacki, who previously worked at the Inter-University Institute for Data Intensive Astronomy and the University of the Western Cape in South A… [+2124 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "What's the tallest wave ever recorded on Earth? - Livescience.com", "description": "This wave was taller than the Empire State Building.", "url": "https://www.livescience.com/tallest-wave-recorded-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TKyGF6GM9bxYvzcLYzatnM-1200-80.jpg", "publishedAt": "2022-04-09T11:00:01Z", "content": "A massive wave breaks.  (Image credit: Shutterstock)\r\n(opens in new tab)In July 1958, an 8.3-magnitude earthquake at the Fairweather Fault rocked Alaska's southern coast. The ground-shaking event cau… [+7264 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Sarah Braner", "title": "W boson explained: what's going on with the surprisingly heavy particle. - Slate", "description": "What just happened with the W boson? And wait, what is a W boson?", "url": "https://slate.com/technology/2022/04/w-boson-explained-particle-physics-standard-model.html", "urlToImage": "https://compote.slate.com/images/5310b1b5-db39-4f00-a8b9-680be8ff184c.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2022-04-09T09:45:00Z", "content": "It is once again stocky particle spring. You might recall that, one year ago, researchers at Fermilab announced the discovery of a fat wobbly muon. Now, they have another offering for us: a boson wit… [+7636 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Melting ice caps may not shut down ocean current - Phys.org", "description": "Most simulations of our climate's future may be overly sensitive to Arctic ice melt as a cause of abrupt changes in ocean circulation, according to new research led by scientists at the University of Wisconsin–Madison.", "url": "https://phys.org/news/2022-04-ice-caps-ocean-current.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/1-ice.jpg", "publishedAt": "2022-04-09T06:04:46Z", "content": "Most simulations of our climate's future may be overly sensitive to Arctic ice melt as a cause of abrupt changes in ocean circulation, according to new research led by scientists at the University of… [+4370 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Kate Ravilious", "title": "Terrawatch: Rare gas points to deep nebula origins for Earth - The Guardian", "description": "Most of rare isotope of helium found on mid-ocean ridges dates to big bang, providing clue to planet’s formation", "url": "https://amp.theguardian.com/science/2022/apr/09/terrawatch-rare-gas-deep-nebula-origins-earth-isotope-helium-big-bang", "urlToImage": null, "publishedAt": "2022-04-09T05:00:00Z", "content": "TerrawatchMost of rare isotope of helium found on mid-ocean ridges dates to big bang, providing clue to planets formation\r\nA rare isotope of helium, bubbling up along mid-ocean ridges, is proving to … [+1509 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ellen Neff", "title": "In a sea of magic angles, 'twistons' keep electrons flowing through three layers of graphene - Phys.org", "description": "The discovery of superconductivity in two ever-so-slightly twisted layers of graphene made waves a few years ago in the quantum materials community. With just two atom-thin sheets of carbon, researchers had discovered a simple device to study the resistance-f…", "url": "https://phys.org/news/2022-04-sea-magic-angles-twistons-electrons.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/in-a-sea-of-magic-angl.jpg", "publishedAt": "2022-04-08T20:37:04Z", "content": "The discovery of superconductivity in two ever-so-slightly twisted layers of graphene made waves a few years ago in the quantum materials community. With just two atom-thin sheets of carbon, research… [+2851 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Abby Lee Hood", "title": "Scientists Detect Huge Object, Farther Away Than Anything Else Detected in Universe - Futurism", "description": "A new study published last week in arXiv reports that researchers found an unidentified object nearly 13.5 billion light-years away in the universe.", "url": "https://futurism.com/the-byte/detect-farthers-object-universe", "urlToImage": "https://wp-assets.futurism.com/2022/04/detect-farthers-object-universe.jpg", "publishedAt": "2022-04-08T19:49:10Z", "content": "That's... so far.\r\nStar Light\r\nScientists may have glimpsed some of the oldest material in the universe.\r\nAccording to a new, yet-to-be-peer-reviewed study, researchers found an unidentified object n… [+2042 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Curiosity Rover Must Take Detour After Encountering ‘Gator Back’ Rocks on Mars - Gizmodo", "description": "Craggy sandstone is stopping the rover’s ascent of a Martian mountain.", "url": "https://gizmodo.com/curiosity-rover-must-take-detour-after-encountering-ga-1848769658", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e6e4e01fd33fe93874fc90759a517080.png", "publishedAt": "2022-04-08T17:41:00Z", "content": "Forgot all about Curiosity, didnt you? The veteran Mars rover spent most of last month climbing a gentle slope known as the Greenheugh Pediment, but now it has to turn back after encountering sharp r… [+2446 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Axiom Mission 1 at Pad 39A and Artemis I at Pad 39B - NASA", "description": "SpaceX’s Axiom-1 is in the foreground on Launch Pad 39A with NASA’s Artemis I in the background on Launch Pad 39B on April 6, 2022.", "url": "https://www.nasa.gov/image-feature/axiom-mission-1-at-pad-39a-and-artemis-i-at-pad-39b/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ksc-20220406-ph-jbp01-0001_orig.jpeg", "publishedAt": "2022-04-08T16:36:08Z", "content": null}]}