{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "We Just Had the Super Flower Blood Moon and an Eclipse – Here's What's Next! - SciTechDaily", "description": "This Week's Full Moon was the Flower, Corn Planting, or Milk Moon, Vesak or Buddha Purnima, a Lunar Eclipse, and a Supermoon. The full Moon on Wednesday morning, May 26, 2021, appeared opposite the Sun in Earth-based longitude at 7:14 a.m. EDT. The Moon appea…", "url": "https://scitechdaily.com/we-just-had-the-super-flower-blood-moon-and-an-eclipse-heres-whats-next/", "urlToImage": "https://scitechdaily.com/images/Red-Blood-Supermoon-Total-Lunar-Eclipse.gif", "publishedAt": "2021-05-28T23:29:35Z", "content": "A perigee full moon, or supermoon, is seen during a total lunar eclipse on Sunday, September 27, 2015, in Washington, DC. The combination of a supermoon and total lunar eclipse last occurred in 1982 … [+21615 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "New map shows how dark matter \"bridges\" tether galaxies - Salon", "description": "A new astronomical map shows direction and flow of dark matter as well as its distribution", "url": "https://www.salon.com/2021/05/28/new-map-shows-how-dark-matter-bridges-tether-galaxies/", "urlToImage": "https://media.salon.com/2021/05/dark-matter-black-holes-0526211.jpg", "publishedAt": "2021-05-28T22:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Curiosity rover captures shining clouds on Mars - Phys.org", "description": "Cloudy days are rare in the thin, dry atmosphere of Mars. Clouds are typically found at the planet's equator in the coldest time of year, when Mars is the farthest from the Sun in its oval-shaped orbit. But one full Martian year ago—two Earth years—scientists…", "url": "https://phys.org/news/2021-05-curiosity-rover-captures-clouds-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/curiosity-rover-captur.jpg", "publishedAt": "2021-05-28T21:38:27Z", "content": "Cloudy days are rare in the thin, dry atmosphere of Mars. Clouds are typically found at the planet's equator in the coldest time of year, when Mars is the farthest from the Sun in its oval-shaped orb… [+3035 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Administrator Statement on President's FY 2022 Funding Request - NASA", "description": "The following is a statement from NASA Administrator Bill Nelson on the president's FY 2022 budget request for the agency.", "url": "https://www.nasa.gov/press-release/nasa-administrator-statement-on-president-s-fy-2022-funding-request/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/fy22_budget_cover.png", "publishedAt": "2021-05-28T20:04:14Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "MARCIA DUNN", "title": "NASA releases stunning new pic of Milky Way's 'downtown' - Yahoo News", "description": "NASA has released a stunning new picture of our galaxy’s violent, super-energized “downtown.”  A radio telescope in South Africa also contributed to the...", "url": "https://news.yahoo.com/nasa-releases-stunning-pic-milky-184620010.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/tPZJpXyekn9_raEk5wcqHw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0zNTAx/https://s.yimg.com/uu/api/res/1.2/rUTTAATH_.IP2_hcuLE0fQ--~B/aD01MDAwO3c9Mjg1NjthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/584e6223cfab43d494a2662a25bde4da", "publishedAt": "2021-05-28T18:46:20Z", "content": "CAPE CANAVERAL, Fla. (AP) NASA has released a stunning new picture of our galaxys violent, super-energized downtown.\r\nIt's a composite of 370 observations over the past two decades by the orbiting Ch… [+1057 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A fiery past sheds new light on the future of global climate change - Phys.org", "description": "Centuries-old smoke particles preserved in the ice reveal a fiery past in the Southern Hemisphere and shed new light on the future impacts of global climate change, according to new research published in Science Advances.", "url": "https://phys.org/news/2021-05-fiery-future-global-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/climate-change.jpg", "publishedAt": "2021-05-28T18:00:01Z", "content": "Centuries-old smoke particles preserved in the ice reveal a fiery past in the Southern Hemisphere and shed new light on the future impacts of global climate change, according to new research publishe… [+4815 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Image: Hubble captures a captivating spiral - Phys.org", "description": "This image shows the spiral galaxy NGC 5037, in the constellation of Virgo. First documented by William Herschel in 1785, the galaxy lies about 150 million light-years away from Earth. Despite this distance, we can see the delicate structures of gas and dust …", "url": "https://phys.org/news/2021-05-image-hubble-captures-captivating-spiral.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/hubble-captures-a-capt.jpg", "publishedAt": "2021-05-28T16:43:25Z", "content": "This image shows the spiral galaxy NGC 5037, in the constellation of Virgo. First documented by William Herschel in 1785, the galaxy lies about 150 million light-years away from Earth. Despite this d… [+1090 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rebecca Sohn", "title": "Human life span may have an 'absolute limit' of 150 years - Livescience.com", "description": "After that, the human body can't repair itself.", "url": "https://www.livescience.com/human-life-span-limit-150-found.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EoWQmdf2siecLnATa7LAoK-1200-80.jpg", "publishedAt": "2021-05-28T15:37:43Z", "content": "Humans may be able to live for between 120 and 150 years, but no longer than this \"absolute limit\" on human life span, a new study suggests.\r\nFor the study, published online May 25 in the journal Nat… [+5101 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sutirtho Patranobis I Edited by Amit Chanda", "title": "With 8 new ones, 35 features on Moon now have Chinese names - Hindustan Times", "description": "China is the second country after the US in more than 50 years to plant its flag on the Moon following the landing of Chang’e-5 spacecraft.", "url": "https://www.hindustantimes.com/world-news/with-8-new-ones-35-features-on-moon-now-have-chinese-names-101622213963302.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/28/1600x900/200440b0-bfc5-11eb-a02f-b8472ed09407_1622213962420.jpg", "publishedAt": "2021-05-28T14:59:22Z", "content": "At least eight features on the Moon near the landing area of the Chinese spacecraft Change-5 were named after Chinese scientists and places earlier this month.\r\nThe Paris-based International Astronom… [+2816 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kathleen Haughney", "title": "Researchers reveal key information about how genes turn on and off - Phys.org", "description": "Human bodies have roughly 30,000 genes dictating not only how we look, but also critical biological processes. Now, a Florida State University and Australia National University research team has discovered a key aspect of gene regulation and ultimately how th…", "url": "https://phys.org/news/2021-05-reveal-key-genes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/2-gene.jpg", "publishedAt": "2021-05-28T12:27:04Z", "content": "Human bodies have roughly 30,000 genes dictating not only how we look, but also critical biological processes. Now, a Florida State University and Australia National University research team has disc… [+2727 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "These worker ants drag their queens to far-off bachelor pads to mate - Livescience.com", "description": "This is the first time that third-party matchmaking has been observed in non-humans.", "url": "https://www.livescience.com/ants-carry-queen-to-foreign-nest.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/akw6Cj7PcoGCsTUf2Bm5qV-1200-80.jpg", "publishedAt": "2021-05-28T12:05:42Z", "content": "Worker ants are known to take on many different job roles, from trash collectors to nurses that dress the wounds of injured comrades, to babysitters that care for their leader's young. But one Medite… [+4638 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Eric Niiler", "title": "NASA's MOXIE Experiment Is Making Oxygen on Mars - WIRED", "description": "Future crews on the Red Planet will need it to make propellant for the trip home. Scientists are also testing whether oxygen can be extracted from lunar soil.", "url": "https://www.wired.com/story/nasas-moxie-experiment-is-making-oxygen-on-mars/", "urlToImage": "https://media.wired.com/photos/60afaaab74ef4079779bcb09/191:100/w_1280,c_limit/Science_MOXIE_PIA23154_large.jpg", "publishedAt": "2021-05-28T12:00:00Z", "content": "It might be a long time before any astronauts land on MarsNASA is talking about the early 2030s, while SpaceXs Elon Musk has promised it will be sooner. But when humans do touch down, they might find… [+3427 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Lewis", "title": "Rare \"super flower blood moon\" lunar eclipse captured in stunning photos from around the world - CBS News", "description": "Photographers didn't miss out on the chance to capture the most spectacular full moon of the year.", "url": "https://www.cbsnews.com/news/lunar-eclipse-super-flower-blood-moon-2021-photos/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/05/26/30acfc5d-fe57-405e-abe0-ae78d746935f/thumbnail/1200x630/c980424994625940522802f842000f55/brazil.jpg", "publishedAt": "2021-05-28T10:43:31Z", "content": "Skywatchers around the world were treated to the most spectacular full moon of the year in the early morning hours on Wednesday. May 26 marked not just a supermoon, but also a lunar eclipse, or so-ca… [+2469 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "\"Helium Rain Is Real!\" – Experiments Validate the Possibility of Helium Rain Inside Jupiter and Saturn - SciTechDaily", "description": "Nearly 40 years ago, scientists first predicted the existence of helium rain inside planets composed primarily of hydrogen and helium, such as Jupiter and Saturn. However, achieving the experimental conditions necessary to validate this hypothesis hasn’t been…", "url": "https://scitechdaily.com/helium-rain-is-real-experiments-validate-the-possibility-of-helium-rain-inside-jupiter-and-saturn/", "urlToImage": "https://scitechdaily.com/images/Saturn-Illustration.gif", "publishedAt": "2021-05-28T10:17:11Z", "content": "An international research team, including scientists from Lawrence Livermore National Laboratory, have validated a nearly 40-year-old prediction and experimentally shown that helium rain is possible … [+4465 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Veronique Greenwood", "title": "Where Your Watermelon Came From - The New York Times", "description": "A genetic analysis of a melon found in Sudan may point to the wild fruit that gave rise to one of summertime’s sweetest treats.", "url": "https://www.nytimes.com/2021/05/28/science/watermelons-genome-origins.html", "urlToImage": "https://static01.nyt.com/images/2021/05/28/science/28TB-WATERMELON1/28TB-WATERMELON1-facebookJumbo.jpg", "publishedAt": "2021-05-28T09:00:32Z", "content": "We are really confident in saying this is the closest relative, Dr. Chomicki said.\r\nThe Kordofan melon and the modern watermelon most likely arose from a long-ago wild melon, the results suggest. Far… [+1819 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This Startling Image of Our Galaxy's Center Hints at a New Cosmic Phenomenon - ScienceAlert", "description": "The center of the Milky Way is a strange and wild place.", "url": "https://www.sciencealert.com/wild-image-of-the-galactic-center-hints-at-a-new-phenomenon", "urlToImage": "https://www.sciencealert.com/images/2021-05/processed/galactic-centre_1024.jpg", "publishedAt": "2021-05-28T07:22:35Z", "content": "The center of the Milky Way is a strange and wild place.\r\nThere dwells our galactic nucleus - a supermassive black hole 4 million times the mass of the Sun, a beast named Sgr A*. It's probably the mo… [+4178 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "These Photos from Space Make Earth Look like Water World - PetaPixel", "description": "Water as far as the eye can see.", "url": "https://petapixel.com/2021/05/27/these-photos-from-space-make-earth-look-like-water-world/", "urlToImage": "https://petapixel.com/assets/uploads/2021/05/These-Photos-from-Space-Make-Earth-Look-like-Water-World.jpg", "publishedAt": "2021-05-27T21:25:58Z", "content": "Photo Credit: Thomas Pesquet / ESA\r\nEuropean Space Agency astronaut Thomas Pesquet recently published a set of images from the International Space Station of Earth that show only water and clouds, wh… [+2678 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists unravel noise-assisted signal amplification in systems with memory - Phys.org", "description": "Signals can be amplified by an optimum amount of noise, but stochastic resonance is a fragile phenomenon. Researchers at AMOLF were the first to investigate the role of memory for this phenomenon in an oil-filled optical microcavity. The effects of slow non-l…", "url": "https://phys.org/news/2021-05-scientists-unravel-noise-assisted-amplification-memory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/amolf-scientists-unrav.jpg", "publishedAt": "2021-05-27T21:00:02Z", "content": "Signals can be amplified by an optimum amount of noise, but stochastic resonance is a fragile phenomenon. Researchers at AMOLF were the first to investigate the role of memory for this phenomenon in … [+5365 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Ciaccia", "title": "Bird brain! Alpine parrot may have fled to the mountains to avoid people, study says - Daily Mail", "description": "Keas, a type of parrot found in New Zealand's alpine regions, may have fled there to get away from humans, a new study says. But if the climate gets warmer, they may have to fight for space.", "url": "https://www.dailymail.co.uk/sciencetech/article-9626985/Bird-brain-Alpine-parrot-fled-mountains-avoid-people-study-says.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/27/21/43533965-0-image-a-7_1622146051448.jpg", "publishedAt": "2021-05-27T20:36:17Z", "content": "Keas, a species of large parrots found in New Zealand's alpine regions, may have fled there to get away from humans, a new study suggests.\r\nThe research notes there is evidence that the birds have ad… [+3096 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Engineered defects in crystalline material boost electrical performance - Phys.org", "description": "Materials engineers don't like to see line defects in functional materials.", "url": "https://phys.org/news/2021-05-defects-crystalline-material-boost-electrical.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/engineered-defects-in.jpg", "publishedAt": "2021-05-27T20:08:48Z", "content": "Materials engineers don't like to see line defects in functional materials.\r\nThe structural flaws along a one-dimensional line of atoms generally degrades performance of electrical materials. So, as … [+4130 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Cassandra Garrison", "title": "New coral reef restoration technology aims to reverse climate change damage - Reuters", "description": "Marine scientist Deborah Brosnan remembers \"feeling like a visitor at an amazing party\" on her diving trips to a bay near the Caribbean island of Saint Barthelemy where she swam above coral reefs with nurse sharks, sea turtles and countless colorful fish.", "url": "https://www.reuters.com/business/environment/new-coral-reef-restoration-technology-aims-reverse-climate-change-damage-2021-05-27/", "urlToImage": "https://www.reuters.com/resizer/_LTWeu9jV9Lu0kV7F6HBzXBOMRY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3LZBCMHOD5MLRDJFFVDANGWTFU.jpg", "publishedAt": "2021-05-27T19:07:00Z", "content": "Marine scientist Deborah Brosnan remembers feeling like a visitor at an amazing party on her diving trips to a bay near the Caribbean island of Saint Barthelemy where she swam above coral reefs with … [+3450 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unprecedented New Panorama of the Center of Our Milky Way – Reveals Magnetized Threads Weaving Spectacular Galactic Tapestry - SciTechDaily", "description": "A new panorama provides an unprecedented X-ray view above and below the center of Milky Way. This new survey builds on previous Chandra observations, stitching together 370 separate pointings of the telescope. In this main image, different bands of X-rays fro…", "url": "https://scitechdaily.com/unprecedented-new-panorama-of-the-center-of-our-milky-way-reveals-magnetized-threads-weaving-spectacular-galactic-tapestry/", "urlToImage": "https://scitechdaily.com/images/Chandra-Survey-of-Galactic-Center-Crop.jpg", "publishedAt": "2021-05-27T18:44:10Z", "content": "A panorama of the Galactic Center builds on previous surveys from Chandra and other telescopes. This latest version expands Chandra’s high-energy view farther above and below the plane of the galaxy … [+6037 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Fight against antibiotic-resistant bacteria has a glowing new weapon - Phys.org", "description": "In the perpetual arms races between bacteria and human-made antibiotics, there is a new tool to give human medicine the edge, in part by revealing bacterial weaknesses and potentially by leading to more targeted or new treatments for bacterial infections.", "url": "https://phys.org/news/2021-05-antibiotic-resistant-bacteria-weapon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/fight-against-antibiot.jpg", "publishedAt": "2021-05-27T18:38:53Z", "content": "In the perpetual arms races between bacteria and human-made antibiotics, there is a new tool to give human medicine the edge, in part by revealing bacterial weaknesses and potentially by leading to m… [+4069 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists overhear two atoms chatting - Phys.org", "description": "How materials behave depends on the interactions between countless atoms. You could see this as a giant group chat in which atoms are continuously exchanging quantum information. Researchers from Delft University of Technology in collaboration with RWTH Aache…", "url": "https://phys.org/news/2021-05-scientists-atoms-chatting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/scientists-overhear-tw.jpg", "publishedAt": "2021-05-27T18:00:05Z", "content": "How materials behave depends on the interactions between countless atoms. You could see this as a giant group chat in which atoms are continuously exchanging quantum information. Researchers from Del… [+5551 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Biologists construct a 'periodic table' for cell nuclei - Phys.org", "description": "One hundred fifty years ago, Dmitri Mendeleev created the periodic table, a system for classifying atoms based on the properties of their nuclei. This week, a team of biologists studying the tree of life has unveiled a new classification system for cell nucle…", "url": "https://phys.org/news/2021-05-biologists-periodic-table-cell-nuclei.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/biologists-construct-a.jpg", "publishedAt": "2021-05-27T18:00:04Z", "content": "One hundred fifty years ago, Dmitri Mendeleev created the periodic table, a system for classifying atoms based on the properties of their nuclei. This week, a team of biologists studying the tree of … [+5091 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Lost in space? Here's a new method to find your way back home. - Space.com", "description": "", "url": "https://www.space.com/interstellar-spacecraft-navigation-by-stellar-parallax", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2c5RkvtNWmNXMLMon7zX65-1200-80.jpg", "publishedAt": "2021-05-27T17:18:42Z", "content": "Paul M. Sutter is an astrophysicist at The Ohio State University, host of Ask a Spacemanand \"Space Radio,\" and author of \"Your Place in the Universe\r\n.\" Sutter contributed this article to Space.com's… [+5987 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Spacetime crystals proposed by placing space and time on an equal footing - Phys.org", "description": "A Penn State scientist studying crystal structures has developed a new mathematical formula that may solve a decades-old problem in understanding spacetime, the fabric of the universe proposed in Einstein's theories of relativity.", "url": "https://phys.org/news/2021-05-spacetime-crystals-space-equal-footing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/spacetime-crystals-pro.jpg", "publishedAt": "2021-05-27T16:41:22Z", "content": "A Penn State scientist studying crystal structures has developed a new mathematical formula that may solve a decades-old problem in understanding spacetime, the fabric of the universe proposed in Ein… [+4146 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Physics: Scientists capture the highest EVER resolution images of atoms - Daily Mail", "description": "These images are so fine-tuned, that the blurring remaining in the shot is the product of the thermal jiggling of the atoms themselves, the team from New York's Cornell University explained.", "url": "https://www.dailymail.co.uk/sciencetech/article-9625703/Physics-Scientists-capture-highest-resolution-images-atoms.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/27/16/43524199-0-image-a-54_1622128116795.jpg", "publishedAt": "2021-05-27T15:22:41Z", "content": "Researchers have broken the record for the highest resolution image ever captured of individual atoms, creating a shot that is 'zoomed in' some 100 million times.\r\nThese images are so fine-tuned, in … [+4704 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Spinning Neutron Stars Reveal New Insights Into Elusive Continuous Gravitational Waves - SciTechDaily", "description": "Five years on from the first discovery of gravitational waves, an international team of scientists, including from the ARC Centre of Excellence for Gravitational Wave Discovery (OzGrav), are continuing the hunt for new discoveries and insights into the Univer…", "url": "https://scitechdaily.com/spinning-neutron-stars-reveal-new-insights-into-elusive-continuous-gravitational-waves/", "urlToImage": "https://scitechdaily.com/images/Continuous-Gravitational-Waves.gif", "publishedAt": "2021-05-27T14:00:22Z", "content": "Artist’s impression of continuous gravitational waves generated by a spinning asymmetric neutron star. Credit: Mark Myers, Ozgrav-Swinburne University\r\nFive years on from the first discovery of gravi… [+7432 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "Fluffy ball of darkinos could be lurking at the center of the Milky Way - Livescience.com", "description": "Our galaxy's black hole may be something else entirely.", "url": "https://www.livescience.com/fluffy-ball-darkinos-center-milky-way.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aUjP7anBNThFAV2QhVctY4-1200-80.gif", "publishedAt": "2021-05-27T12:58:14Z", "content": "In the summer of 2014, astronomers watched with giddy anticipation as a cloud of gas, known as G2, swung dangerously close to a supermassive black hole at the center of the Milky Way. Sparks didn't f… [+5774 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "10 winners of a Milky Way photo contest show our galaxy lighting up the sky - Yahoo News", "description": "The winners of Capture the Atlas' \"Milky Way Photographer of the Year\" contest showcase our galaxy in the sky over stunning settings.", "url": "https://www.businessinsider.com/milky-way-galaxy-photo-contest-winners-2021-5", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/90YDPR01UoB.AluDWoLqxw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xNTAw/https://s.yimg.com/uu/api/res/1.2/bXSwq.cv5g3_8SWQOr.M7A--~B/aD0xODAyO3c9MjQwMzthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/business_insider_articles_888/b8950c9a09f2b1cd447deadc796e46b1", "publishedAt": "2021-05-27T12:43:00Z", "content": "You don't need a telescope to see the Milky Way, but our galaxy isn't always visible in the night sky.\r\nPhotographers usually have to wait for the perfect moment - before sunrise, when the moon has s… [+5215 chars]"}, {"source": {"id": null, "name": "Newsmax"}, "author": "Henry F. Cooper", "title": "A Looming Existential Solar Threat - Newsmax", "description": "Such a major solar storm is not our greatest threat — though there is nothing we can do to avoid it if nature sends one our way. But our leaders are simply irresponsible in permitting this condition to continue, since we have long known how to address it.", "url": "https://www.newsmax.com/henryfcooper/solar-storm-powergrids/2021/05/27/id/1022948/", "urlToImage": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=62275066-b37e-4406-be13-784aa6375b28&SiteName=Newsmax", "publishedAt": "2021-05-27T12:39:00Z", "content": "Recent articles highlight an existential threat that we continue to ignore at our peril.\r\nNadia Drake writes in National Geographic that the sun is getting stormier, and that it’ll peak following a t… [+7055 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "GAO report identifies technical and management risks with Artemis - SpaceNews", "description": "A GAO report warns that NASA’s Artemis program faces technical and management risks that raise doubts about returning humans to the moon by 2024.", "url": "https://spacenews.com/gao-report-identifies-technical-and-management-risks-with-artemis/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/05/ppe-halo.jpg", "publishedAt": "2021-05-27T11:47:07Z", "content": "WASHINGTON A Government Accountability Office report warns that NASAs Artemis program faces technical risks as well as management issues that raise doubts about achieving the goal of returning humans… [+5817 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Adam Frank", "title": "'Helgoland' Is A Poetic Argument For Carlo Rovelli's View Of Quantum Mechanics - NPR", "description": "Carlo Rovelli writes that quantum mechanics tells us reality is a net of interactions where there are no things, only relationships; nothing has properties until it interacts with something else.", "url": "https://www.npr.org/2021/05/27/1000444659/helgoland-offers-a-new-way-to-understand-the-world-and-our-place-in-it", "urlToImage": "https://media.npr.org/assets/img/2021/05/26/helgo_wide-afdaef88223dfd1ee3fbab889538004934950522.jpg?s=1400", "publishedAt": "2021-05-27T10:13:17Z", "content": "Helgoland: Making Sense of the Quantum Revolution, by Carlo Rovelli\r\nRiverhead\r\nAs you read these words the world around you seems pretty solid, pretty stable: The device you're using seems to exist … [+5917 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Angus Watson and Francesca Street, CNN", "title": "What it was like on board the Qantas supermoon flight to nowhere - CNN ", "description": "As people on the ground to admire a rare super blood moon eclipse, perhaps the best view of the astronomical marvel came from 43,000 feet in the sky -- on board a Qantas-operated \"flight to nowhere.\"", "url": "https://www.cnn.com/travel/article/lunar-eclipse-qantas-super-blood-moon-flight-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210527105039-03-qantas-supermoon-super-tease.jpg", "publishedAt": "2021-05-27T09:11:15Z", "content": "Sydney (CNN) The moon was illuminated a bright coppery red, big and beaming in the night sky.\r\nAnd as people on the ground in Australia and New Zealand and parts of the western United States peered u… [+5132 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Lauren Sommer", "title": "Scientists Are Trying To Save Coral Reefs From Climate Change - NPR", "description": "Hotter oceans are putting coral reefs in peril worldwide. Scientists are warning that to save them, heat-trapping emissions must fall, and reefs will need more protection and restoration.", "url": "https://www.npr.org/2021/05/27/999837654/fearing-their-kids-will-inherit-dead-coral-reefs-scientists-are-urging-bold-acti", "urlToImage": "https://media.npr.org/assets/img/2021/05/24/corals-1_wide-88a716b9ed55951d539b39341a77a594250a6240.jpg?s=1400", "publishedAt": "2021-05-27T09:05:00Z", "content": "Scientists expect increasing marine heat waves to cause coral bleaching, which can result in reefs dying off.\r\nKevin Lino/NOAA/NMFS/PIFSC/ESD\r\nCoral reef biologists are often asked the same question … [+5000 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s first flight-proven Starship rolled back to factory for likely retirement - Teslarati", "description": "While SpaceX has spent the better part of three weeks inspecting the first flight-proven Starship to survive a high-altitude launch and landing, the company appears to have decided to retire the rocket instead of flying it again. On May 25th, four days after …", "url": "https://www.teslarati.com/spacex-first-flight-proven-starship-retired/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2021/05/Starship-Boca-Chica-052621-NASASpaceflight-bocachicagal-SN15-retirement-10-crop-c-1024x625.jpg", "publishedAt": "2021-05-27T08:57:33Z", "content": "While SpaceX has spent the better part of three weeks inspecting the first flight-proven Starship to survive a high-altitude launch and landing, the company appears to have decided to retire the rock… [+4273 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "First mission of Russia’s nuclear-powered space tug to take 50 months - TASS", "description": "The first flight has been scheduled for 2030", "url": "https://tass.com/science/1292721", "urlToImage": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "publishedAt": "2021-05-22T21:55:54Z", "content": "MOSCOW, May 22. /TASS/. The first mission of Russia’s nuclear-powered transport and energy module, Zeus, will last 50 months, Roscosmos Executive Director for Long-Term Programs and Science Alexander… [+941 chars]"}]}