{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Neptune just experienced an unexplained temperature shift - CNN", "description": "Astronomers observing Neptune for the past 17 years tracked a surprising drop in the ice giant's global temperatures, which was then followed by a dramatic warming trend at the planet's south pole.", "url": "https://www.cnn.com/2022/04/11/world/neptune-temperature-shifts-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220411132755-01-neptune-temperature-shifts-top-super-tease.jpg", "publishedAt": "2022-04-11T20:02:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "The moon's near and far sides are surprisingly different. A new study sheds light on the mystery - CNN", "description": "The far side of the moon, which we can never see from our vantage point on Earth, looks surprisingly different than the orb we're used to seeing in the night sky. A new study offers an explanation.", "url": "https://www.cnn.com/2022/04/11/world/far-near-sides-of-the-moon-difference-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220411083650-near-side-far-side-moon-split-super-tease.jpg", "publishedAt": "2022-04-11T12:49:00Z", "content": "(CNN)The far side of the moon, which we can never see from our vantage point on Earth, looks surprisingly different than the orb we're used to seeing in the night sky. \r\nThe near side we are so famil… [+2575 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "An interstellar object exploded over Earth in 2014, declassified government data reveal - Livescience.com", "description": "Classified data prevented scientists from verifying their discovery for 3 years.", "url": "https://www.livescience.com/first-interstellar-object-detected", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FeL4UiXNgrJq8xvZvXx8VX-1200-80.jpg", "publishedAt": "2022-04-11T12:05:06Z", "content": "A fireball that blazed through the skies over Papua New Guinea in 2014 was actually a fast-moving object from another star system, according to a recent memo\r\n (opens in new tab) released by the U.S.… [+2759 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "A private Ax-1 astronaut will test making a liquid telescope mirror in space - Space.com", "description": "The method involves building lenses out of liquid polymers — while in space.", "url": "https://www.space.com/liquid-telescope-construction-in-space-ax-1", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7vdMPYfdFEzapzHhAtvChJ-1200-80.jpg", "publishedAt": "2022-04-11T10:45:10Z", "content": "Among the many experiments that crewmembers on the all-private Ax-1 mission will take part in during their one-week stay on the International Space Station is one that could help NASA build larger sp… [+3030 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Latest Plans for Critical Artemis I Moon Rocket Testing - SciTechDaily", "description": "NASA is planning to proceed with a modified wet dress rehearsal, primarily focused on tanking the core stage, and minimal propellant operations on the interim cryogenic propulsion stage (ICPS) with the ground systems at Kennedy. Due to the changes in loading …", "url": "https://scitechdaily.com/nasa-latest-plans-for-critical-artemis-i-moon-rocket-testing/", "urlToImage": "https://scitechdaily.com/images/NASA-SLS-and-SpaceX-Falcon-9-at-Launch-Complex-39A-39B-scaled.jpg", "publishedAt": "2022-04-11T02:07:44Z", "content": "NASA’s Space Launch System (SLS) rocket with the Orion spacecraft aboard is seen atop a mobile launcher at Launch Complex 39B as the Artemis I launch team prepares for the next attempt of the wet dre… [+2461 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rachael Rettner", "title": "Thousands of new viruses discovered in world's oceans - Livescience.com", "description": "More than 5,000 new RNA virus species were identified.", "url": "https://www.livescience.com/thousands-of-new-rna-viruses-oceans", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gX4RgWDzFA9n3Do3wpDhP3-1200-80.jpg", "publishedAt": "2022-04-10T13:26:22Z", "content": "More than 5,000 new virus species have been identified in the world's oceans, according to a new study.\r\nThe study researchers analyzed tens of thousands of water samples from around the globe, hunti… [+3253 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Jona Jaupi", "title": "Five MIND-BLOWING Hubble Space Telescope images from the past decade... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/18223239/five-mind-blowing-hubble-space-telescope-images/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/04/EP_NASA_HUBBLE_OFFPLATFORM.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-04-10T11:14:00Z", "content": "NASA's Hubble Space Telescope has captured many stunning images over its lifetime here are five of the most mind-blowing.\r\nFirst conceived in the 1940s, the Hubble Space Telescope (or just Hubble for… [+4141 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot, Alia Shoaib", "title": "Scientists claim they've found a perfectly preserved dinosaur fossil killed when the mass extinction asteroid hit the earth 66 million years ago - Yahoo News", "description": "Dinosaur fossils found at Tanis in North Dakota are believed to date back to the mass extinction event when an asteroid struck 66 million years ago.", "url": "https://www.businessinsider.com/dinosaur-fossil-from-day-extinction-asteroid-hit-earth-scientists-claim-2022-4", "urlToImage": "https://i.insider.com/62503b6700ada10018fc0e5e?width=1200&format=jpeg", "publishedAt": "2022-04-10T08:22:11Z", "content": "Scientists claim to have found a fossil of a dinosaur killed on the day an extinction asteroid struck the Earth 66 million years ago.\r\nScientists say that the perfectly preserved leg of a Thescelosau… [+4471 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Rich Calder", "title": "SpaceX capsule docks at ISS with an all-private astronaut crew - New York Post ", "description": "The SpaceX capsule crew of three wealthy entrepreneurs and a retired NASA astronaut were welcomed aboard the International Space Station.", "url": "https://nypost.com/2022/04/09/spacex-capsule-docks-at-iss-with-an-all-private-astronaut-crew/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/04/newspress-collage-21843461-1649545562244.png?w=1024", "publishedAt": "2022-04-09T23:39:00Z", "content": "The historic SpaceX capsule, carrying the first all-private team of astronauts, successfully docked at the International Space Station on Saturday.\r\nThe crew of three wealthy entrepreneurs and a reti… [+2058 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "New Theory Suggests That Dark Matter Could Be an Extra-Dimensional Cosmic Refugee - ScienceAlert", "description": "Massive gravitons may have formed a trillionth of a second after the Big Bang, in abundances great enough to account for dark matter.", "url": "https://www.livescience.com/dark-matter-particles-from-extra-dimensions", "urlToImage": "https://cdn.mos.cms.futurecdn.net/p42j6o2TsMJyU6u9GEZfta-1200-80.jpg", "publishedAt": "2022-04-09T20:03:37Z", "content": "Dark matter, the elusive substance that accounts for the majority of the mass in the universe, may be made up of massive particles called gravitons that first popped into existence in the first momen… [+4872 chars]"}]}