{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": null, "name": "NPR"}, "author": "Rachel Treisman", "title": "'The Sky's Not Even The Limit': Cancer Survivor To Become Youngest American In Space - NPR", "description": "Physician's assistant and pediatric bone cancer survivor Hayley Arceneaux, 29, will be one of four crew members on  the world's first all-civilian mission to space at the end of this year.", "url": "https://www.npr.org/2021/02/22/970173918/the-skys-not-even-the-limit-cancer-survivor-to-become-youngest-american-in-space", "urlToImage": "https://media.npr.org/assets/img/2021/02/22/ap_21051858665598_wide-8937b5bed57192d2950ee5fc578d61772521bf09.jpg?s=1400", "publishedAt": "2021-02-22T18:30:44Z", "content": "A photo provided by St. Jude Children's Research Hospital shows Hayley Arceneaux at the hospital in Memphis, Tenn. It announced on Monday that Arceneaux, a former patient and current employee, will b… [+5515 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Joey Roulette", "title": "SpaceX’s Crew Dragon performing ‘beautifully’ on ISS as NASA eyes a backup ride - The Verge", "description": "NASA’s human spaceflight chief said SpaceX’s Crew Dragon capsule is performing “beautifully” on the ISS as the space agency looks for a backup Soyuz astronaut seat as a safety net.", "url": "https://www.theverge.com/2021/2/22/22295119/spacex-crew-dragon-iss-nasa-eyes-backup-soyuz-ride", "urlToImage": "https://cdn.vox-cdn.com/thumbor/BhyYTrtveBamUjk9kBYosbefAgk=/0x399:5568x3314/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22320528/50953553088_6da480ba2a_o.jpg", "publishedAt": "2021-02-22T17:45:04Z", "content": "Besides some housekeeping issues, the mission has gone beautifully\r\nRussias Progress 77 cargo resupply ship is seen approaching the International Space Station through the window of SpaceXs Crew Drag… [+6001 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "Dust Storms on Mars Might Glow with Tiny Sparks, Study Shows - IGN - IGN", "description": "As if dust storms weren't ominous enough already, on Mars, they might glow due to electricity, according to a new study.", "url": "https://www.ign.com/articles/dust-storms-on-mars-might-glow-with-tiny-sparks-study-shows", "urlToImage": "https://assets1.ignimgs.com/2021/02/22/pia15959-orig-1614014502641.jpg?width=1280", "publishedAt": "2021-02-22T17:30:07Z", "content": "Like something out of a Mad Max movie, a new study shows that dust storms on Mars might glow with tiny sparks.A new abstract published by a group of scientists that simulated the low-pressure atmosph… [+2555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A spacecraft named for 'Hidden Figures' mathematician Katherine Johnson has arrived on the International Space Station - CNN ", "description": "The S.S. Katherine Johnson, a Northrop Grumman Cygnus resupply spacecraft, launched on Saturday from a NASA facility in Virginia and made it to the space station early Monday morning.", "url": "https://www.cnn.com/2021/02/22/us/katherine-johnson-spacecraft-launches-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210222104059-cygnus-northrop-grumman-antares-rocket-launch-super-tease.jpg", "publishedAt": "2021-02-22T17:26:00Z", "content": "(CNN)A spacecraft named for the famed NASA mathematician Katherine Johnson has arrived at the International Space Station with about 8,000 pounds of cargo in tow.\r\nThe S.S. Katherine Johnson, a North… [+3278 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Swift Helps Tie Neutrino to Star-shredding Black Hole - NASA", "description": "For only the second time, astronomers have linked an elusive particle called a high-energy neutrino to an object outside our galaxy. Using ground- and space-based facilities, including NASA’s Neil Gehrels Swift Observatory, they traced the neutrino to a black…", "url": "https://www.nasa.gov/feature/goddard/2021/nasa-s-swift-helps-tie-neutrino-to-star-shredding-black-hole/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/tde_animation_prores_still.jpg", "publishedAt": "2021-02-22T16:17:42Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The Milky Way may be swarming with planets with oceans and continents like here on Earth - Phys.org", "description": "Astronomers have long been looking into the vast universe in hopes of discovering alien civilisations. But for a planet to have life, liquid water must be present. The likelihood of that scenario has seemed impossible to calculate because it has been the assu…", "url": "https://phys.org/news/2021-02-milky-swarming-planets-oceans-continents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/themilkywaym.jpg", "publishedAt": "2021-02-22T16:01:37Z", "content": "Astronomers have long been looking into the vast universe in hopes of discovering alien civilisations. But for a planet to have life, liquid water must be present. The likelihood of that scenario has… [+4720 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "Traffic noise can kill you - Boing Boing", "description": "Over the last decade, researchers have linked the noise of airports and road traffic to an increased risk of cardiovascular disease and death. Apparently the noise triggers a stress response in the…", "url": "https://boingboing.net/2021/02/22/traffic-noise-can-kill-you.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2021/02/screenshot-88.jpg?fit=1200%2C781&ssl=1", "publishedAt": "2021-02-22T15:43:51Z", "content": "Over the last decade, researchers have linked the noise of airports and road traffic to an increased risk of cardiovascular disease and death. Apparently the noise triggers a stress response in the b… [+1297 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Chris Bergin", "title": "Starship SN10 hopeful for launch \"this week\" - Super Heavy waiting in the wings - NASASpaceFlight.com - NASASpaceflight.com", "description": "Starship SN10’s wait for a launch date, following weather-related delays, could soon be over following…", "url": "https://www.nasaspaceflight.com/2021/02/starship-sn10-launch-super-heavy-waiting/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/02/NSF-2021-02-22-01-28-56-492.jpg", "publishedAt": "2021-02-22T15:32:22Z", "content": "Starship SN10’s wait for a launch date, following weather-related delays, could soon be over following an optimistic update from Chief Designer Elon Musk. SN10 first requires a Static Fire test – exp… [+8881 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jennifer Chu", "title": "New 'metalens' shifts focus without tilting or moving - Phys.org", "description": "Polished glass has been at the center of imaging systems for centuries. Their precise curvature enables lenses to focus light and produce sharp images, whether the object in view is a single cell, the page of a book, or a far-off galaxy.", "url": "https://phys.org/news/2021-02-metalens-shifts-focus-tilting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/newmetalenss.jpg", "publishedAt": "2021-02-22T14:51:06Z", "content": "Polished glass has been at the center of imaging systems for centuries. Their precise curvature enables lenses to focus light and produce sharp images, whether the object in view is a single cell, th… [+7017 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Benjamin Taub", "title": "Deer With Hairy Eyeballs Found In Tennessee Suburb - IFLScience", "description": "A year-old whitetail buck was recently found circling a Tennessee suburb with hair covering both of its eyeballs, according to the National Deer Associatio", "url": "https://www.iflscience.com/plants-and-animals/deer-hairy-eyeballs-found-tennessee-suburb/", "urlToImage": "https://cdn.iflscience.com/images/9bafc075-9add-5554-82ca-b029aa371156/default-1613995493-deer-with-corneal-dermoids.jpg", "publishedAt": "2021-02-22T14:24:00Z", "content": "A year-old whitetail buck was recently found circling a Tennessee suburb with hair covering both of its eyeballs, according to the National Deer Association. The bizarre condition is a rare example o… [+2326 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Monica Grady", "title": "Can the laws of physics disprove God? - The Conversation UK", "description": "If God could break the laws of physics,  why haven't we seen any evidence of the laws ever being broken in the universe?", "url": "https://theconversation.com/can-the-laws-of-physics-disprove-god-146638", "urlToImage": "https://images.theconversation.com/files/368289/original/file-20201109-23-s91zxo.jpg?ixlib=rb-1.1.0&rect=262%2C13%2C3994%2C1994&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-22T14:20:23Z", "content": "I still believed in God (I am now an atheist) when I heard the following question at a seminar, first posed by Einstein, and was stunned by its elegance and depth: If there is a God who created the e… [+10923 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tim Childers", "title": "Astronomers find the fastest spinning black hole to date - Livescience.com", "description": "", "url": "https://www.livescience.com/first-black-hole-detected-fastest-spinning.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dXbNLrCdeGFheedYmy5vce-1200-80.jpg", "publishedAt": "2021-02-22T14:09:03Z", "content": "Six decades after its discovery, the first black hole ever detected is still causing astronomers to scratch their heads. It turns out that the cosmic behemoth at the heart of the Cygnus X-1 system is… [+3891 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "The Mantis Shrimp Inspires a New Material—Made by Bacteria - WIRED", "description": "By 3D-printing scaffolds and dipping them in microbe juice, scientists make robust structures that could one day lead to self-growing roads.", "url": "https://www.wired.com/story/the-mantis-shrimp-inspires-a-new-material-made-by-bacteria/", "urlToImage": "https://media.wired.com/photos/60300b7b091d7b01b7e2080b/191:100/w_1280,c_limit/Science_mantisshrimp-1061398692.jpg", "publishedAt": "2021-02-22T14:00:00Z", "content": "A good kind of chaotic, as it happens. When the researchers tested the strength of each lattice, the Type IV Bouligand structure absorbed 20 times as much energy as Type I. This kind of microstructur… [+2463 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Cosmologists create 4,000 virtual universes to solve Big Bang mystery - Livescience.com", "description": "A supercomputer presses the rewind button on the universe's creation.", "url": "https://www.livescience.com/simulating-early-universe-inflation.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mNyFEbkzVqcJg4JeUxh4K8-1200-80.jpg", "publishedAt": "2021-02-22T12:00:57Z", "content": "Cosmologists are pressing rewind on the first instant after the Big Bang by simulating 4,000 versions of the universe on a massive supercomputer. \r\nThe goal is to paint a picture of the immediate aft… [+2720 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Poorvi Gupta", "title": "Meet Vandi Verma: The Roboticist Who Drove NASA's Perseverance to Mars - Yahoo India News", "description": "The Chief Engineer for Robotic Operations for the Mars 2020 Perseverance rover, Verma was responsible for driving the Mars rovers – Curiosity and...", "url": "https://in.makers.yahoo.com/meet-vandi-verma-the-roboticist-who-drove-nas-as-perseverance-to-mars-115838701.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/4f4c94f0-7504-11eb-96ef-df292d57dbe6", "publishedAt": "2021-02-22T11:58:38Z", "content": "In yet another proud moment, NASA has successfully landed its Perseverance rover on the surface of Mars on February 18, 2021. Adding to the excitement was the way in which the rover landed on the pla… [+2821 chars]"}, {"source": {"id": null, "name": "Weatherboy.com"}, "author": "Weatherboy Team Meteorologist", "title": "Potent Solar Wind Could Impact Earth on Tuesday - Weatherboy", "description": "A potent blast of energy in the form of solar wind from the Sun could impact Earth early on Tuesday, NASA space weather models warn. During a solar storm...", "url": "https://www.weatherboy.com/potent-solar-wind-could-impact-earth-on-tuesday/", "urlToImage": "https://www.weatherboy.com/wp-content/uploads/2021/02/Filament.jpg", "publishedAt": "2021-02-22T08:05:09Z", "content": "The Sun releases a constant stream of particles and magnetic elds called the solar wind. This solar wind slams bodies across the solar system with particles and radiation which can stream all the way… [+4628 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Kellen Beck", "title": "Stunning Photo Shows Perseverance's Mars Landing From Above! - Mashable India", "description": "NASA's Perseverance rover shared an exciting photo on Friday from right before its wheels first touched the surface of Mars.\nIn the photo shared on the official Perseverance Twitter account, we get an extremely rare, close-up photo of an entire rover on (or a…", "url": "https://in.mashable.com/science/20458/stunning-photo-shows-perseverances-mars-landing-from-above", "urlToImage": "https://sm.mashable.com/t/mashable_in/news/s/stunning-p/stunning-photo-shows-perseverances-mars-landing-from-above_jgwp.1200.png", "publishedAt": "2021-02-22T08:00:00Z", "content": "NASA's Perseverance rover shared an exciting photo on Friday from right before its wheels first touched the surface of Mars\r\n.\r\nIn the photo shared on the official Perseverance Twitter account, we ge… [+1000 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "Scientists Discover 'Ingredients For Life' in 3.5 Billion-Year-Old Rocks in Australia - ScienceAlert", "description": "Researchers have discovered organic molecules trapped in incredibly ancient rock formations in Australia, revealing what they say is the first detailed evidence of early chemical ingredients that could have underpinned Earth's primeval microbial life", "url": "https://www.sciencealert.com/scientists-discover-ingredients-for-life-in-3-5-billion-year-old-rocks-in-australia", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/010-dresser-organic_1024.jpg", "publishedAt": "2021-02-22T05:19:02Z", "content": "Researchers have discovered organic molecules trapped in incredibly ancient rock formations in Australia, revealing what they say is the first detailed evidence of early chemical ingredients that cou… [+3617 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "NASA says some Earth organisms could temporarily survive on Mars - Engadget", "description": "NASA and the German Aerospace Center scientists have published a paper on discussing how the spores of black mold could survive on Mars.", "url": "https://www.engadget.com/nasa-studyorganisms-earth-survive-on-mars-050034231.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/EwOU5PGIJVuOrK1qEnFugQ--~B/aD02NzU7dz0xMjAwO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-uploaded-images/2021-02/48342390-72ac-11eb-b1bf-ca3296e82b00.cf.jpg", "publishedAt": "2021-02-22T05:03:01Z", "content": "We could unknowingly contaminate Mars and any other world we're exploring in the future with microorganisms from our planet. Scientists from NASA and the German Aerospace Center launched several fung… [+2485 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The White Dots in This Image Are Not Stars or Galaxies. They're Black Holes - ScienceAlert", "description": "The image above may look like a fairly normal picture of the night sky, but what you're looking at is a lot more special than just glittering stars. Each of those white dots is an active supermassive black hole.", "url": "https://www.sciencealert.com/every-white-dot-in-this-image-is-a-black-hole-at-the-heart-of-a-distant-galaxy", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/black_hole_sky_map_cover_1024.jpg", "publishedAt": "2021-02-22T01:23:30Z", "content": "The image above may look like a fairly normal picture of the night sky, but what you're looking at is a lot more special than just glittering stars. Each of those white dots is an active supermassive… [+3662 chars]"}, {"source": {"id": null, "name": "TheBlaze"}, "author": "Paul Sacca", "title": "Study warns solar farms could unleash unintended consequences on the environment, including global warming - TheBlaze", "description": "Large-scale solar and wind turbine farms could trigger negative affects on the climate around the world", "url": "https://www.theblaze.com/news/solar-farms-global-warming-consequences-study", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNTY3MDU1Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYzMTYzMzgyN30.Igr-wcvvKfvVtHxi6KNwfwKtD59B6dd417v2bXmrd4c/img.jpg?width=1200&coordinates=0%2C247%2C0%2C247&height=600", "publishedAt": "2021-02-21T23:14:52Z", "content": "A new study finds there could be unintended consequences of constructing massive solar farms in deserts around the world. The eye-opening research claims that huge solar farms, such as in the Sahara,… [+3608 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "NASA warns of STADIUM-SIZED asteroid headed towards Earth - RT", "description": "The US space agency is warning of a salvo of space rocks headed for Earth, ranging in size from a paltry 10 meters in diameter all the way up to a positively petrifying 213.", "url": "https://www.rt.com/news/516215-stadium-sized-asteroid-nasa-warning/", "urlToImage": "https://cdni.rt.com/files/2021.02/article/60329285203027166b3c3349.jpg", "publishedAt": "2021-02-21T17:25:00Z", "content": "When not keeping a close eye on its Perseverance rover, which touched down on Mars this week, NASA is busy monitoring the sky for potential threats to life on Earth – namely asteroids. And this week … [+1488 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Mike Wehner", "title": "New research suggests a polar flip could be catastrophic - BGR", "description": "Earth’s magnetic poles are constantly on the move, but they haven’t drifted far enough to actually flip in the modern age. Researchers know that Earth’s poles have flipped in the past, but opinion has been split over what effects such an event might have on t…", "url": "https://bgr.com/2021/02/21/pole-flip-earth-magnetic-fields/", "urlToImage": "https://bgr.com/wp-content/uploads/2019/02/earth.jpg?quality=70&strip=all", "publishedAt": "2021-02-21T15:23:00Z", "content": "<ul><li>Earth’s magnetic poles are constantly on the move, but they haven’t drifted far enough to actually flip in the modern age. </li><li>Researchers know that Earth’s poles have flipped in the pas… [+3514 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "John Timmer, Ars Technica", "title": "Million-Year-Old DNA Rewrites Mammoths' Evolutionary Tree - WIRED", "description": "The oldest DNA ever sequenced shows how the genus split off into new species.", "url": "https://www.wired.com/story/ancient-dna-mammoth-evolutionary-tree/", "urlToImage": "https://media.wired.com/photos/6031c5a8e97c7c2411ca9db5/191:100/w_1280,c_limit/Science_Mammoth_tusk_1_landscape.jpg", "publishedAt": "2021-02-21T14:00:00Z", "content": "Ancient DNA has revolutionized how we understand human evolution, revealing how populations moved and interacted and introducing us to relatives like the Denisovans, a \"ghost lineage\" that we wouldn'… [+4252 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elisa Raffaella Ferrè", "title": "Europe is recruiting astronauts. Here’s what it takes to become one - Space.com", "description": "", "url": "https://www.space.com/europe-is-recruiting-astronauts-heres-what-it-takes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dxqMjhoKXvGahXhers3QB4-1200-80.jpg", "publishedAt": "2021-02-21T12:22:48Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nElisa Raffaella Ferrè, Senior Lecturer, Departm… [+6395 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Engineers Place Thousands of Nanoscale Molecular Devices in Precise Orientation - SciTechDaily", "description": "Proof-of-concept project paves the way for the integration of molecules with computer chips. Engineers have developed a technique that allows them to precisely place microscopic devices formed from folded DNA molecules in not only a specific location but also…", "url": "https://scitechdaily.com/engineers-place-thousands-of-nanoscale-molecular-devices-in-precise-orientation/", "urlToImage": "https://scitechdaily.com/images/Molecule-Scale-Devices-in-Precise-Orientation.gif", "publishedAt": "2021-02-21T06:06:54Z", "content": "Researchers placed more than 3,000 glowing moon-shaped nanoscale molecular devices into a flower-shaped instrument for indicating the polarization of light. The “moons” in each of the 12 petals point… [+7719 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Variations in Sunlight Have More to Do With Pollution Than Clouds, Says Study - ScienceAlert", "description": "The amount of sunlight reaching Earth's surface has been fluctuating for decades now, and a new study supports the idea that human activity is to blame.", "url": "https://www.sciencealert.com/variations-in-sunlight-have-more-to-do-with-human-pollution-than-clouds", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/sunaerosols_1024.jpg", "publishedAt": "2021-02-21T05:50:25Z", "content": "The amount of sunlight reaching Earth's surface has been fluctuating for decades now, and a new study supports the idea that human activity is to blame.\r\nIn the late 1980s, researchers first noticed … [+3186 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Jon Fingas", "title": "One of the first known black holes is more massive than once thought - Yahoo Tech", "description": "Astronomers have determined that one of the first known black holes, Cygnus X-1, is more massive than once thought — and that could force a rethink of...", "url": "https://www.engadget.com/cygnus-x-1-black-hole-more-massive-than-thought-224954350.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/5da33590-73c9-11eb-b4df-2cf6e1a7b545", "publishedAt": "2021-02-20T22:49:54Z", "content": "When billionaire financier Ray Dalio makes a move, Wall Street pays attention. Dalio, who got his start working on the floor of the New York Stock Exchange trading commodity futures, founded the worl… [+9329 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Are dogs self-aware? Scientists say there's a good chance - CTV News", "description": "Scientists studying dogs have found that canines can exhibit displays of 'body awareness,' a trait that denotes self-awareness or self-representation.", "url": "https://www.ctvnews.ca/sci-tech/are-dogs-self-aware-scientists-say-there-s-a-good-chance-1.5317364", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5317368.1613848516!/httpImage/image.png_gen/derivatives/landscape_620/image.png", "publishedAt": "2021-02-20T19:23:00Z", "content": "TORONTO -- \r\nA new study suggests that dogs, like humans, are self-aware and likely understand the consequences of their actions.\r\nThe findings, published in the Scientific Reports journal Thursday, … [+2757 chars]"}]}