{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Nasa selects landing site for Moon rover mission - BBC News", "description": "The space agency will send a rover to look for water-ice near a crater at the Moon's South Pole.", "url": "https://www.bbc.com/news/science-environment-58608295", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2885/production/_120637301_viper_drilling_on_moon_copy.jpg", "publishedAt": "2021-09-21T01:32:15Z", "content": "By Paul RinconScience editor, BBC News website\r\nimage captionViper will explore one of the coldest places in the Solar System, the Moon's South Pole\r\nNasa is sending a robotic rover to look for water… [+5497 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Christopher R. Moore, The Conversation", "title": "Giant Space Rock Blast Wiped Out Ancient City With 1,000 Times Hiroshima's Ferocity - ScienceAlert", "description": "As the inhabitants of an ancient Middle Eastern city now called Tall el-Hammam went about their daily business one day about 3,600 years ago, they had no idea an unseen icy space rock was speeding toward them at about 38,000 mph (61,000 kph).", "url": "https://www.sciencealert.com/biblical-story-may-have-been-inspired-by-this-ancient-city-obliterating-asteroid", "urlToImage": "https://www.sciencealert.com/images/2021-09/processed/Bolide_1024.jpg", "publishedAt": "2021-09-21T01:07:50Z", "content": "As the inhabitants of an ancient Middle Eastern city now called Tall el-Hammam went about their daily business one day about 3,600 years ago, they had no idea an unseen icy space rock was speeding to… [+7832 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "[{\"@type\":\"Person\",\"name\":\"Liz Richardson\",\"url\":\"https://www.buzzfeed.com/lizmrichardson\",\"jobTitle\":\"BuzzFeed Staff\"}]", "title": "Name The Eight Planets In The Solar System In One Minute And You Win - BuzzFeed", "description": "This should be easy.", "url": "https://www.buzzfeed.com/lizmrichardson/name-all-eight-planets-quiz", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2021-09/16/15/enhanced/755b4e0a2a45/original-1812-1631804984-17.jpg?crop=1250:654;0,99%26downsize=1250:*", "publishedAt": "2021-09-20T22:45:12Z", "content": "BBC\r\n*This excludes dwarf planets like Pluto."}, {"source": {"id": null, "name": "New York Post"}, "author": "Hannah Sparks", "title": "When to see the harvest moon, the last full moon before 2021's fall equinox - New York Post ", "description": "Say goodbye to summer with a salute to Monday’s harvest moon. We also answer the question: What does Neil Young have to do with the harvest moon?", "url": "https://nypost.com/2021/09/20/when-to-see-harvest-moon-2021-last-full-moon-before-fall-equinox/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/09/Harvest-Moon-index.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-09-20T21:36:00Z", "content": "Say goodbye to summer with a salute to Monday night’s “harvest moon,” the last full moon before the Northern Hemisphere’s autumnal equinox on Wednesday, Sept. 22.\r\nWhen is the harvest moon?\r\nThe Amer… [+1699 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Holly Ober", "title": "Modern activities follow the contours of ancient Teotihuacan - Phys.org", "description": "A lidar mapping study using a cutting-edge aerial mapping technology shows ancient residents of Teotihuacan moved astonishing quantities of soil and bedrock for construction and reshaped the landscape in a way that continues to influence the contours of moder…", "url": "https://phys.org/news/2021-09-modern-contours-ancient-teotihuacan.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/modern-activities-foll.jpg", "publishedAt": "2021-09-20T21:12:17Z", "content": "A lidar mapping study using a cutting-edge aerial mapping technology shows ancient residents of Teotihuacan moved astonishing quantities of soil and bedrock for construction and reshaped the landscap… [+5923 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Solar electric propulsion makes NASA's Psyche spacecraft go - Phys.org", "description": "When it comes time for NASA's Psyche spacecraft to power itself through deep space, it'll be more brain than brawn that does the work. Once the stuff of science fiction, the efficient and quiet power of electric propulsion will provide the force that propels …", "url": "https://phys.org/news/2021-09-solar-electric-propulsion-nasa-psyche.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/solar-electric-propuls.jpg", "publishedAt": "2021-09-20T20:06:36Z", "content": "When it comes time for NASA's Psyche spacecraft to power itself through deep space, it'll be more brain than brawn that does the work. Once the stuff of science fiction, the efficient and quiet power… [+5948 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "NASA evaluating a dozen proposals for private space stations - Business Insider", "description": "NASA expects to retire the International Space Station by the end of the decade. The agency is turning to private companies to build new alternatives.", "url": "https://www.businessinsider.com/nasa-evaluating-proposals-for-private-space-stations-2021-9", "urlToImage": "https://i.insider.com/6148f2abde0e7b00194b78a9?width=1200&format=jpeg", "publishedAt": "2021-09-20T19:45:02Z", "content": "NASA is preparing to award up to $400 million to companies that want to build their own space stations.\r\nThe agency has relied on the International Space Station (ISS) for 20 years, but it won't last… [+3750 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Mars was always too small to hold onto its oceans, rivers and lakes - Space.com", "description": "Mars' story may hold a basic truth about planetary habitability.", "url": "https://www.space.com/mars-too-small-ocean-rivers-lakes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QUrVyYZw6rKftxCCZEu4x5-1200-80.jpg", "publishedAt": "2021-09-20T19:00:39Z", "content": "Mars was doomed to desiccation by its small size, a new study suggests.\r\nThanks to observations by robotic explorers such as NASA's Curiosity and Perseverance rovers, scientists know that in the anci… [+4531 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Strain", "title": "Nano-scale discovery could help to cool down overheating in electronics - Phys.org", "description": "A team of physicists at CU Boulder has solved the mystery behind a perplexing phenomenon in the nano realm: why some ultra-small heat sources cool down faster if you pack them closer together. The findings, published today in the journal Proceedings of the Na…", "url": "https://phys.org/news/2021-09-nano-scale-discovery-cool-overheating-electronics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/nano-scale-discovery-c.jpg", "publishedAt": "2021-09-20T19:00:02Z", "content": "A team of physicists at CU Boulder has solved the mystery behind a perplexing phenomenon in the nano realm: why some ultra-small heat sources cool down faster if you pack them closer together. The fi… [+5810 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jade Boyd", "title": "Understanding photon collisions could aid search for physics beyond the Standard Model - Phys.org", "description": "Hot on the heels of proving an 87-year-old prediction that matter can be generated directly from light, Rice University physicists and their colleagues have detailed how that process may impact future studies of primordial plasma and physics beyond the Standa…", "url": "https://phys.org/news/2021-09-physicists-probe-smashups-future.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/physicists-probe-light-2.jpg", "publishedAt": "2021-09-20T18:56:39Z", "content": "Hot on the heels of proving an 87-year-old prediction that matter can be generated directly from light, Rice University physicists and their colleagues have detailed how that process may impact futur… [+7477 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA TV to Air Landsat 9 Launch, Prelaunch Activities - NASA", "description": "NASA will provide coverage of the upcoming prelaunch and launch activities for the Landsat 9 satellite, a joint NASA and U.S. Geological Survey (USGS) mission that will continue the legacy of monitoring Earth’s land and coastal regions that began with the fir…", "url": "https://www.nasa.gov/press-release/nasa-tv-to-air-landsat-9-launch-prelaunch-activities/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/landsat9_still_sw2_print_0.jpeg", "publishedAt": "2021-09-20T17:50:57Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Scott Gleeson", "title": "Elon Musk taunts President Biden with 'sleeping' tweet after SpaceX completes mission - Yahoo News", "description": "Elon Musk took a jab at President Joe Biden the day after his spacecraft SpaceX, completed a historic mission as the first all-civilian flight crew.", "url": "https://www.usatoday.com/story/tech/news/2021/09/20/elon-musk-taunts-biden-over-spacex-mission-sleeping-tweet/8416901002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/12/09/USAT/e8d6d571-2775-4e91-a5f4-51e727497f6d-VPC_ELON_MUSK_MOVES_TO_TEXAS_DESK_THUMB.jpg?crop=1911,1075,x0,y0&width=1600&height=800&fit=bounds", "publishedAt": "2021-09-20T17:33:48Z", "content": "Billionaire Jared Isaacman is funding the first all-civilian SpaceX flight into orbit.\r\nUSA TODAY\r\nBusiness mogul and CEO Elon Musk took a jab at President Joe Biden on Sunday, the day after his priv… [+2235 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "Elon Musk trolls 'sleepy' President Biden over perceived Inspiration4 snub - CNET", "description": "Musk wants acknowledgment for the historic mission.", "url": "https://www.cnet.com/news/elon-musk-trolls-biden-with-trump-line-over-perceived-inspiration4-snub/", "urlToImage": "https://www.cnet.com/a/img/TeeIyyE3UW6lyGUq0CLxZ-Efj_I=/1200x630/2021/09/20/cd2df515-a6f4-482f-bbe8-1e0b889cb86f/screen-shot-2014-09-16-at-2-46-38-pm.jpg", "publishedAt": "2021-09-20T17:26:00Z", "content": "SpaceX CEO Elon Musk unveiled the Dragon V2 in May 2014.\r\nTim Stevens/CNET\r\nSpaceX founder and leading orbital travel agent Elon Musk was feeling a bit slighted by the world's most powerful man this … [+2143 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Kids' fossilized handprints may be some of the world's oldest art - Livescience.com", "description": "Newfound hand and footprints on the Tibetan Plateau date about 169,000 to 226,000 years old.", "url": "https://www.livescience.com/ancient-hominin-handprint-art-tibetan-plateau", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SynRBcwyWTd7MDNZnEs8mk-1200-80.jpg", "publishedAt": "2021-09-20T16:38:56Z", "content": "About 200,000 years ago, ice age children squished their hands and feet into sticky mud thousands of feet above sea level on the Tibetan Plateau. These impressions, now preserved in limestone, provid… [+7645 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Extreme volcanism did not cause the massive extinction of species in the late Cretaceous - Phys.org", "description": "A study published in the journal Geology rules out that extreme volcanic episodes had any influence on the massive extinction of species in the late Cretaceous. The results confirm the hypothesis that it was a giant meteorite impact what caused the great biol…", "url": "https://phys.org/news/2021-09-extreme-volcanism-massive-extinction-species.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/extreme-volcanism-did-1.jpg", "publishedAt": "2021-09-20T15:17:58Z", "content": "A study published in the journal Geology rules out that extreme volcanic episodes had any influence on the massive extinction of species in the late Cretaceous. The results confirm the hypothesis tha… [+6266 chars]"}, {"source": {"id": null, "name": "Treehugger"}, "author": "https://www.facebook.com/Treehugger", "title": "Why Some Primate Moms Carry Their Babies After They Die - Treehugger", "description": "Some primate mothers may carry their infants after death as a way of grieving and becoming aware of death, study finds.", "url": "https://www.treehugger.com/primate-moms-carry-babies-after-death-5201940", "urlToImage": "https://www.treehugger.com/thmb/OcD8ZzPWaTCRSFUcScX8PwIT96Q=/3504x2336/filters:fill(auto,1)/mother-baboon-dead-infant-6683e3e0956d4c028102d228b3d99f2c.jpg", "publishedAt": "2021-09-20T14:31:46Z", "content": "Mothers in some non-human primate species may express grief over the loss of a baby by carrying their infants around with them for months, a new study finds.\r\nResearchers have been divided about whet… [+4875 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious “Empty Sky” Gamma-Ray Puzzle Solved – May Lead Astrophysicists To Unravel Dark Matter - SciTechDaily", "description": "Star-forming galaxies are responsible for creating gamma-rays that until now had not been associated with a known origin. Star-forming galaxies are responsible for creating gamma-rays that until now had not been associated with a known origin, researchers fro…", "url": "https://scitechdaily.com/mysterious-empty-sky-gamma-ray-puzzle-solved-may-lead-astrophysicists-to-unravel-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Fermis-Five-year-View-Gamma-ray-Sky-scaled.jpg", "publishedAt": "2021-09-20T13:28:26Z", "content": "ByAustralian National UniversitySeptember 20, 2021\r\nA detailed look at the gamma-ray sky. Credit: NASA/DOE/Fermi LAT Collaboration\r\nStar-forming galaxies are responsible for creating gamma-rays that … [+3731 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Anne Trafton", "title": "Engineers create light-emitting plants that can be charged repeatedly - Phys.org", "description": "Using specialized nanoparticles embedded in plant leaves, MIT engineers have created a light-emitting plant that can be charged by an LED. After 10 seconds of charging, plants glow brightly for several minutes, and they can be recharged repeatedly.", "url": "https://phys.org/news/2021-09-light-emitting-repeatedly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/engineers-create-light.jpg", "publishedAt": "2021-09-20T13:21:12Z", "content": "Using specialized nanoparticles embedded in plant leaves, MIT engineers have created a light-emitting plant that can be charged by an LED. After 10 seconds of charging, plants glow brightly for sever… [+6271 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Forget Yellowstone: Thousands of immense supervolcano eruptions buried much of ancient Mars - SYFY WIRE", "description": "In one of the single most terrifying articles I have ever read, planetary scientists show that ancient Mars suffered from immense, repeated supervolcano eruptions that buried a huge region under ash as deep as a kilometer, and that these eruptions are tied to…", "url": "https://www.syfy.com/syfywire/forget-yellowstone-thousands-of-immense-supervolcano-eruptions-buried-much-of-ancient-mars", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/hirise_arabiaterra_mounds.jpg", "publishedAt": "2021-09-20T13:00:00Z", "content": "In one of the single most terrifying articles I have ever read, planetary scientists show that ancient Mars suffered from immense, repeated supervolcano eruptions that buried a huge region under ash … [+5422 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Men sleep worse during the first half of the lunar cycle, study finds - Daily Mail", "description": "Men's sleep may be more powerfully influenced by the lunar cycle than women's, report researchers at Uppsala University in Sweden.", "url": "https://www.dailymail.co.uk/sciencetech/article-10008881/Men-sleep-worse-half-lunar-cycle-study-finds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/09/20/13/48144125-0-image-a-17_1632140358289.jpg", "publishedAt": "2021-09-20T12:57:58Z", "content": "Sleep struggles regularly affect many of us, and now a new study has revealed that the moon may be to blame for these issues particularly if you're a man.  \r\nResearchers at Uppsala University in Swed… [+7543 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hubble takes 31st anniversary image: Two new views showcase the dual nature of the star AG Carinae - Phys.org", "description": "Comparing two images shows puffing dust bubbles and an erupting gas shell—the final acts of a monster star's life.", "url": "https://phys.org/news/2021-09-hubble-31st-anniversary-image-views.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/hubble-takes-a-closer.jpg", "publishedAt": "2021-09-20T12:07:47Z", "content": "Comparing two images shows puffing dust bubbles and an erupting gas shellthe final acts of a monster star's life.\r\nThese new views showcase the dual nature of the star AG Carinae, which was the targe… [+3061 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Reddening” Clusters and Constellations: Hubble Captures Densely Packed Sparkling Starfield Near the Center of the Milky Way - SciTechDaily", "description": "This sparkling starfield, captured by the NASA/ESA Hubble Space Telescope’s Wide Field Camera 3 and Advanced Camera for Surveys, contains the globular cluster ESO 520-21 (also known as Palomar 6). A densely packed, roughly spherical collection of stars, it li…", "url": "https://scitechdaily.com/reddening-clusters-and-constellations-hubble-captures-densely-packed-sparkling-starfield-near-the-center-of-the-milky-way/", "urlToImage": "https://scitechdaily.com/images/Palomar-6.jpg", "publishedAt": "2021-09-20T10:44:54Z", "content": "ByESA/HubbleSeptember 20, 2021\r\nHubble Space Telescope image of a sparkling starfield that contains the globular cluster ESO 520-21 (also known as Palomar 6). Credit: ESA/Hubble and NASA, R. Cohen\r\nT… [+1969 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Vittoria D'alessio", "title": "The nanophotonics orchestra presents: Twisting to the light of nanoparticles - Phys.org", "description": "Physics researchers at the University of Bath in the UK discover a new physical effect relating to the interactions between light and twisted materials—an effect that is likely to have implications for emerging new nanotechnologies in communications, nanorobo…", "url": "https://phys.org/news/2021-09-nanophotonics-orchestra-nanoparticles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/the-nanophotonics-orch.jpg", "publishedAt": "2021-09-20T07:15:09Z", "content": "Physics researchers at the University of Bath in the UK discover a new physical effect relating to the interactions between light and twisted materialsan effect that is likely to have implications fo… [+5611 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Carly Earl", "title": "September full moon 2021: how to photograph the harvest moon on your phone or camera with the right settings - The Guardian", "description": "Guardian Australia picture editor Carly Earl explains the dos and don’ts of taking pictures of tonight’s full moon", "url": "https://amp.theguardian.com/technology/2021/sep/20/full-moon-september-2021-how-to-photograph-harvest-moon-with-phone-tips-tonight-take-picture-photography-what-time-when-sunday-night-sky-smartphone-camera-dslr-iphone-best-settings", "urlToImage": null, "publishedAt": "2021-09-20T01:12:00Z", "content": "PhotographyGuardian Australia picture editor Carly Earl explains the dos and donts of taking pictures of tonights full moon\r\nWith the September 2021 full moon rising, also known as the harvest moon, … [+3006 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "SpaceX Just Marked Another Huge Milestone in The History of Crewed Spaceflight - ScienceAlert", "description": "Four SpaceX tourists returned to Earth safely on Saturday after spending three days in space, successfully concluding the first orbital mission in history with no professional astronauts on board.", "url": "https://www.sciencealert.com/spacex-s-historic-all-civilian-space-flight-safely-returned-home-to-earth", "urlToImage": "https://www.sciencealert.com/images/2021-09/processed/SpaceXCivilianFlightLandingOrbiter_1024.jpg", "publishedAt": "2021-09-20T00:46:41Z", "content": "Four SpaceX tourists returned to Earth safely on Saturday after spending three days in space, successfully concluding the first orbital mission in history with no professional astronauts on board.\r\nT… [+4513 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sandra Salathe", "title": "Jeff Bezos and Lauren Sánchez have a romantic dinner date at Jon & Vinny's - Daily Mail", "description": "On the same day Elon Musk Space welcomed back four civilians he successfully sent into space, Amazon founder Jeff Bezos was spotted in Los Angeles having dinner with 'Lauren Sánchez.", "url": "https://www.dailymail.co.uk/news/article-10006773/Jeff-Bezos-Lauren-S-nchez-romantic-dinner-date-Jon-Vinnys.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/09/19/22/48115253-0-image-a-10_1632086290761.jpg", "publishedAt": "2021-09-19T21:18:29Z", "content": "Amazon founder Jeff Bezos was spotted in Los Angeles having dinner with his girlfriend, Good Day LA anchor, Lauren Sánchez. \r\nBezos, 57, and Sanchez, 51, were seen leaving Jon &amp; Vinny's restauran… [+8869 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Deep Drilling Success for ExoMars – Much Deeper Than Any Other Martian Rover Has Ever Attempted - SciTechDaily", "description": "ESA’s Rosalind Franklin twin rover on Earth has drilled down and extracted samples 1.7 meters into the ground – much deeper than any other martian rover has ever attempted. The successful collection of soil from a hard stone and its delivery to the laboratory…", "url": "https://scitechdaily.com/first-deep-drilling-success-for-exomars-much-deeper-than-any-other-martian-rover-has-ever-attempted/", "urlToImage": "https://scitechdaily.com/images/Drilling-on-Mars-Like-Terrain-scaled.jpg", "publishedAt": "2021-09-19T21:12:47Z", "content": "ByEuropean Space AgencySeptember 19, 2021\r\nESA’s Rosalind Franklin twin rover on Earth has drilled down and extracted samples 1.7 meters into the ground – much deeper than any other martian rover has… [+5567 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/jon-fingas", "title": "NASA's chief scientist will retire in 2022 - Engadget", "description": "NASA chief scientist Jim Green is retiring in 2022 after overseeing projects like the Curiosity rover and New Horizon..", "url": "https://www.engadget.com/nasa-chief-scientist-jim-green-retires-201648273.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-09/d9e3f180-1982-11ec-affe-31b72b36a03f", "publishedAt": "2021-09-19T20:19:09Z", "content": "NASA is about to close an important chapter in its history. Chief Scientist Jim Green, who has worked at the agency for over 40 years, now plans to retire in early 2022. He started by developing NASA… [+1086 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Ingenuity Helicopter Flies at a Lower Altitude Than Ever Before – Captures a Mars Rock Feature in 3D - SciTechDaily", "description": "The rotorcraft captures nuances of rocky outcrop during aerial reconnaissance. NASA’s Ingenuity Mars Helicopter provided a 3D view of a rock-covered mound during its 13th flight on September 4. The plan for this reconnaissance mission into the “South Seítah” …", "url": "https://scitechdaily.com/nasas-ingenuity-helicopter-flies-at-a-lower-altitude-than-ever-before-captures-a-mars-rock-feature-in-3d/", "urlToImage": "https://scitechdaily.com/images/3D-View-Mars-Rock-Mound-Faillefeu.jpg", "publishedAt": "2021-09-19T18:48:10Z", "content": "ByJet Propulsion LaboratorySeptember 19, 2021\r\nThis 3D view of a rock mound called “Faillefeu” was created from data collected by NASA’s Ingenuity Mars Helicopter during its 13th flight at Mars on Se… [+4162 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Volcanoes on Mars exploded in ‘super eruptions’ that blotted out the sun - Digital Trends", "description": "New evidence shows volcanic activity on ancient Mars included thousands of 'super eruptions\"'throwing huge quantities of dust and toxic gases into the air.", "url": "https://www.digitaltrends.com/news/mars-volcanoes-super-erruptions/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/pia243831.jpg", "publishedAt": "2021-09-19T17:06:43Z", "content": "Mars is home to the solar system’s largest volcano, Olympus Mons, and volcanic activity has had a profound impact on shaping the planet into the state it is in today. Now, new evidence shows that vol… [+3221 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Space community ponders right-of-way rules for space traffic - SpaceNews", "description": "The growing number of satellites in orbit is leading to calls to develop formal “right of way” rules, although there is no consensus on those rules.", "url": "https://spacenews.com/space-community-ponders-right-of-way-rules-for-space-traffic/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/01/Cover-Space-Junk.jpg", "publishedAt": "2021-09-19T17:03:41Z", "content": "WAILEA, Hawaii The growing number of satellites in orbit is leading to calls to develop formal right of way rules, although there is no consensus on what those rules should be and how they should be … [+4548 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Rebecca Flood", "title": "Parrot Hilariously Asks Alexa to Add Pulled Pork to Shopping List - Newsweek", "description": "The parrot chats to Google's assistant, adding groceries to the shopping list and getting it to turn lights on.", "url": "https://www.newsweek.com/parrot-pulled-pork-alexa-viral-video-1630260", "urlToImage": "https://d.newsweek.com/en/full/1896911/file-photo-grey-parrot.jpg", "publishedAt": "2021-09-19T11:30:01Z", "content": "A clever parrot has worked out how to chat to Alexa, using the electronic assistant to add items to the shopping list and control the lights.\r\nThe African grey Congo parrot, named Max, has a wide voc… [+2578 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "What is time, and why does it move forward? - EarthSky", "description": "What is time, and why does it move forward? Cosmologist Thomas Kitching of University College London explains how the arrow of time points to the future.", "url": "https://earthsky.org/human-world/what-is-time/", "urlToImage": "https://earthsky.org/upl/2016/02/9193084187_a53e74842f_z-e1456333454605.jpg", "publishedAt": "2021-09-19T11:03:45Z", "content": "We think of the universe as having a timeline, a point at which it began, until now. But how much do modern cosmologists really know about time? Image via Alex Mittelmann/ Wikimedia.\r\nWhat is time?\r\n… [+6433 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "JoAnna Wendel", "title": "Why do the planets in the solar system orbit on the same plane? - Livescience.com", "description": "To answer this question, we have to go back in time.", "url": "https://www.livescience.com/planets-orbit-same-plane", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wiCxuWfzL2n3dqEYmytHMb-1200-80.jpg", "publishedAt": "2021-09-19T11:00:05Z", "content": "If you've ever gazed at a  model of the solar system, you've likely noticed that the sun, planets, moons and asteroids sit roughly on the same plane. But why is that?\r\nTo answer this question, we hav… [+2813 chars]"}, {"source": {"id": null, "name": "Hawaii Tribune-Herald (subscription)"}, "author": null, "title": "A new planet? Astronomers believe they’ve found proof - Hawaii Tribune-Herald", "description": "Astronomers using the Subaru Telescope believe they have found evidence of a ninth planet in the solar system.", "url": "https://www.hawaiitribune-herald.com/2021/09/19/hawaii-news/a-new-planet-astronomers-believe-theyve-found-proof/", "urlToImage": "https://www.hawaiitribune-herald.com/wp-content/uploads/2021/09/web1_Planet_Nine_Subaru.jpg", "publishedAt": "2021-09-19T10:05:00Z", "content": "Astronomers using the Subaru Telescope believe they have found evidence of a ninth planet in the solar system.\r\nAstronomer Michael Brown and astrophysicist Konstantin Batygin, both professors at the … [+3135 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "We May Know Where the Dinosaur-Killing Asteroid Came From. How Does That Help Us? - autoevolution", "description": "About 66 million years ago, give or take a period of time too great for us humans to understand, a 6.2 miles (10 km) asteroid came crashing down somewhere in the Yucatan Peninsula in Mexico. Upon impact, the rock detonated with the power of about 100 million …", "url": "https://www.autoevolution.com/news/we-may-know-where-the-dinosaur-killing-asteroid-came-from-how-does-that-help-us-169711.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/we-may-know-where-the-dinosaur-killing-asteroid-came-from-how-does-that-help-us-169711_1.jpg", "publishedAt": "2021-09-19T09:06:00Z", "content": "After the impact, the Earth was still standing, but the effects of the blast killed most of Earth’s species, including the dominant one at the time, the dinosaurs.Now, this extinction-level event has… [+3566 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "Scientists create ‘concrete’ using blood, sweat, tears of astronauts for construction on Mars - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/scientists-create-concrete-using-blood-sweat-tears-of-astronauts-for-construction-on-mars/735856/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/09/AstroCrete.jpg", "publishedAt": "2021-09-19T03:38:53Z", "content": "New Delhi: A team of scientists from the University of Manchester have developed a way to create a concrete-like material made of extraterrestrial dust along with the blood, sweat and tears of astron… [+6892 chars]"}]}