{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Study blames Earth’s magnetic field flip for climate change, extinctions - Ars Technica", "description": "Study suggests that one magnetic event caused everything from extinctions to art.", "url": "https://arstechnica.com/science/2021/02/study-blames-earths-magnetic-field-flip-for-climate-change-extinctions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/02/00_29_0496_Waipoua_Forest_NZ_-_Kauri_Baum_Tane_Mahuta-760x380.jpg", "publishedAt": "2021-02-19T22:46:52Z", "content": "Enlarge/ The massive trunk of a kauri tree can remain intact for tens of thousands of years.\r\n17 with 14 posters participating, including story author\r\nThe Earth's magnetic field helps protect life f… [+9728 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Wild NASA image shows Perseverance rover just before Mars touchdown - CNET", "description": "NASA's Mars Reconnaissance Orbiter also snapped a lucky view from over 400 miles away.", "url": "https://www.cnet.com/news/wild-nasa-image-shows-perseverance-rover-just-before-mars-touchdown/", "urlToImage": "https://cnet2.cbsistatic.com/img/YQaN1M1NwyrWyRJraxSf6SC3Rp8=/1200x630/2021/02/19/5e3dfbec-066c-4ffc-a2dd-2f72486a4978/edlpercymars.jpg", "publishedAt": "2021-02-19T22:00:00Z", "content": "Welcome to Mars, Perseverance rover. This stunning view was captured during the landing process as the rover was lowered to the surface.\r\nNASA\r\nThis story is part of Welcome to Mars, our series explo… [+2455 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": "Dante Graves", "title": "Communicating with a dreaming person is possible - NOVA Next", "description": "A study from four independent teams report that lucid dreaming during the REM sleep stage allows for two-way communication.", "url": "https://www.pbs.org/wgbh/nova/article/lucid-dreaming-communication/", "urlToImage": "https://www.pbs.org/wgbh/nova/media/original_images/Lucid_Dream_Hero.jpg", "publishedAt": "2021-02-19T17:51:00Z", "content": "Chris Mazurek was a freshman in college when he had a dream that he was inside the Legends of Zelda video game. He saw himself as the main protagonist, Link, in third person. \r\nSuddenly, beeping nois… [+9224 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Researchers observe stationary Hawking radiation in an analog black hole - Phys.org", "description": "Black holes are regions in space where gravity is very strong—so strong that nothing that enters them can escape, including light. Theoretical predictions suggest that there is a radius surrounding black holes known as the event horizon. Once something passes…", "url": "https://phys.org/news/2021-02-stationary-hawking-analog-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/6-blackhole.jpg", "publishedAt": "2021-02-19T14:40:01Z", "content": "Black holes are regions in space where gravity is very strongso strong that nothing that enters them can escape, including light. Theoretical predictions suggest that there is a radius surrounding bl… [+6838 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Origin of life: Did Darwinian evolution begin before life itself? - Phys.org", "description": "A study done by Ludwig-Maximilians-Universitaet (LMU) in Munich physicists demonstrates that fundamental characteristics of mopolymeric lecules, such as their subunit composition, are sufficient to trigger selection processes in a plausible prebiotic setting.", "url": "https://phys.org/news/2021-02-life-darwinian-evolution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/602fadc139791.jpg", "publishedAt": "2021-02-19T13:52:42Z", "content": "Templated ligation of random sequence DNA 12-mers. (A) Before cells evolved, the first ribozymes were thought to perform basic cell functions. In the exponentially vast sequence space, spontaneous em… [+6856 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "A genetic advantage inherited from Neanderthals could give some people a 22% lower risk of severe COVID-19 - Business Insider", "description": "The remnants of Neanderthal DNA are more common in people from Europe and Asia. They could confer an advantage during a coronavirus infection.", "url": "https://www.businessinsider.com/neanderthal-genes-lower-risk-severe-coronavirus-2021-2", "urlToImage": "https://i.insider.com/5e4ea034a27fc556864c7ea4?width=1200&format=jpeg", "publishedAt": "2021-02-18T22:24:00Z", "content": "Insider logo\r\nThe word \"Insider\".\r\nClose icon\r\nTwo crossed lines that form an 'X'. It indicates a way to close an interaction, or dismiss a notification.\r\nHomeChevron icon\r\nIt indicates an expandable… [+5399 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Tom Nardi", "title": "NASA Selects SpaceX To Launch Lunar Gateway - Hackaday", "description": "While not a Cabinet position, the NASA Administrator is nominated by the president of the United States and tasked with enacting their overall space policy. As such, a new occupant in the White Hou…", "url": "https://hackaday.com/2021/02/18/nasa-selects-spacex-to-launch-lunar-gateway/", "urlToImage": "https://hackaday.com/wp-content/uploads/2021/02/spacexgateway_feat.jpg", "publishedAt": "2021-02-18T15:01:00Z", "content": "While not a Cabinet position, the NASA Administrator is nominated by the president of the United States and tasked with enacting their overall space policy. As such, a new occupant in the White House… [+6630 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Planet Nine Hypothesis Takes a Major Hit in New Study - ExtremeTech", "description": "It used to be easy to know how many planets there were: nine. It had been nine planets for an entire generation before scientists started rethinking what counts as a planet. Pluto is out, but some astronomers believe there's a real ninth planet lurking out th…", "url": "https://www.extremetech.com/extreme/320048-planet-nine-hypothesis-takes-a-major-hit-in-new-study", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2016/08/planet-nine-artist-illustration.jpg", "publishedAt": "2021-02-18T12:30:39Z", "content": "It used to be easy to know how many planets there were: nine. It had been nine planets for an entire generation before scientists started rethinking what counts as a planet. Pluto is out, but some as… [+2318 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Starliner test flight slips to early April - SpaceNews", "description": "A second uncrewed test flight of Boeing’s CST-100 Starliner commercial crew vehicle will be delayed by more than a week to replace damaged hardware.", "url": "https://spacenews.com/starliner-test-flight-slips-to-early-april/", "urlToImage": "https://spacenews.com/wp-content/uploads/2019/12/starliner-orbit.jpg", "publishedAt": "2021-02-18T11:39:07Z", "content": "WASHINGTON A second uncrewed test flight of Boeings CST-100 Starliner commercial crew vehicle will be delayed by a little more than a week to replace hardware damaged during processing of the spacecr… [+2894 chars]"}]}