{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "Jupiter's Great Red Spot isn't just wide — it's deep, too - Salon", "description": "The biggest storm in the solar system extends to a depth 40 times that of the Mariana Trench", "url": "https://www.salon.com/2021/11/02/jupiters-great-red-spot-isnt-just-wide-its-deep-too/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/09/planet-jupiter-0927211.jpg", "publishedAt": "2021-11-02T22:23:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Rocky exoplanets are even stranger than we thought - Phys.org", "description": "An astronomer from NSF's NOIRLab has teamed up with a geologist from California State University, Fresno, to make the first estimates of rock types that exist on planets orbiting nearby stars. After studying the chemical composition of \"polluted\" white dwarfs…", "url": "https://phys.org/news/2021-11-rocky-exoplanets-stranger-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/rocky-exoplanets-are-e.jpg", "publishedAt": "2021-11-02T21:02:05Z", "content": "An astronomer from NSF's NOIRLab has teamed up with a geologist from California State University, Fresno, to make the first estimates of rock types that exist on planets orbiting nearby stars. After … [+4937 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Baby seals share a rare vocal ability with humans, study finds - CNN", "description": "Changing the pitch of one's voice to be better understood is a crucial aspect of human speech. Baby seals might be one of only a few other mammals capable of this trait, a new study has found.", "url": "https://www.cnn.com/2021/11/02/world/baby-seals-vocal-learning-study-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211101125647-01-harbour-seal-pups-study-super-tease.jpg", "publishedAt": "2021-11-02T20:41:47Z", "content": "(CNN)Besides being an adorable and important part of marine ecosystems, baby seals might have a unusual ability. They can change the pitch of their voices to be better understood, like humans do, a n… [+5075 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "An asteroid barely missed Earth last week, and no one knew it was coming - Livescience.com", "description": "The space rock was a cosmic visitor that no one expected.", "url": "https://www.livescience.com/surprise-asteroid-flyby", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kg94zu8abAAAYDVSfLsnMg-1200-80.jpg", "publishedAt": "2021-11-02T19:31:11Z", "content": "An asteroid about the size of a refrigerator shot past Earth last week, and astronomers didn't know the object existed until hours after it was gone. \r\nIt was a close call (from a cosmic perspective)… [+3980 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "NASA study: Climate change impact on world's crops expected within next decade - Fox News", "description": "Climate change may impact the production of corn (maize) and wheat as early as 2030, according to NASA researchers.", "url": "https://www.foxnews.com/science/nasa-study-climate-change-impact-world-crops-next-decade", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/Arizona-Water-Corn.gif", "publishedAt": "2021-11-02T18:53:07Z", "content": "Climate change may impact the production of corn (maize) and wheat as early as 2030, according to NASA researchers. \r\nA new study from the agency published in the journal Nature Food said that under … [+4937 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's SpaceX Crew-2 Astronauts Advance Research in Space - NASA", "description": "After more than six months aboard the International Space Station, the astronauts of NASA’s SpaceX Crew-2 mission are returning home. The four crew members -...", "url": "https://www.youtube.com/watch?v=AtjR-gHufxg", "urlToImage": "https://i.ytimg.com/vi/AtjR-gHufxg/maxresdefault.jpg", "publishedAt": "2021-11-02T17:00:06Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Stargazers in Chile's Atacama Desert search for alien life and 'dark energy' - CNN", "description": "In Chile's dry Atacama Desert, stargazers are scanning the clear night skies to detect the existence of life on other planets and study so-called \"dark energy,\" a mysterious cosmic force thought to be driving the accelerating expansion of the universe.", "url": "https://www.cnn.com/2021/11/02/americas/chile-atacama-desert-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211102092721-las-campanas-observatory-atacama-chile-10-14-2021-super-tease.jpg", "publishedAt": "2021-11-02T16:36:00Z", "content": "Atacama Desert, Chile,In Chile's dry Atacama Desert, stargazers are scanning the clear night skies to detect the existence of life on other planets and study so-called \"dark energy,\" a mysterious cos… [+1806 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Sharon Pruitt-Young", "title": "Astronauts grew green chile on the space station and made themselves space tacos - NPR", "description": "It's NASA's first time growing peppers in space. And after they were harvested, NASA astronauts got to sample the crop sprinkled on tacos at the International Space Station.", "url": "https://www.npr.org/2021/11/02/1051428046/astronauts-grew-green-chile-on-the-space-station-and-made-themselves-space-tacos", "urlToImage": "https://media.npr.org/assets/img/2021/11/02/iss065e235375-edit_wide-bd855665a4e5ae951456b28a63141a9bdd2df231.jpg?s=1400", "publishedAt": "2021-11-02T15:39:37Z", "content": "NASA astronaut Shane Kimbrough checks Hatch chile plants growing on the International Space Station earlier this year.\r\nNASA\r\nOuter space just got a little more delicious. \r\nAstronauts aboard the Int… [+2086 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "The Hubble Space Telescope Is in Safe Mode for the Third Time This Year - Gizmodo", "description": "The telescope’s science instruments appear to be fine, but normal operations have been suspended.", "url": "https://gizmodo.com/the-hubble-space-telescope-is-in-safe-mode-for-the-thir-1847981152", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8c8384614c50d9f370816abf0e36a7de.jpg", "publishedAt": "2021-11-02T15:15:00Z", "content": "The Hubble Space Telescope has entered into a protective safe mode, in what is now an upsettingly regular occurrence. Mission team members have yet to identify the source of the latest issue.\r\nThe pr… [+2557 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Joe Hernandez", "title": "NASA wants a scale to help explain discoveries about alien life to the public - NPR", "description": "A scientific discovery about extraterrestrial life can provide new insight, but it can be misunderstood or exaggerated into something else when it reaches the public. NASA is hoping to change that.", "url": "https://www.npr.org/2021/11/02/1051407020/nasa-extraterrestrial-life-research-understanding", "urlToImage": "https://media.npr.org/assets/img/2021/11/02/ap224840876985_wide-3ce53f88ccb291beee107ea429b55ce9a4657b02.jpg?s=1400", "publishedAt": "2021-11-02T15:11:33Z", "content": "The moon shines over radio antennas at the operations support facility of one of the worlds largest astronomy projects, the Atacama Large Millimeter/submillimeter Array (ALMA), in the Atacama desert … [+2651 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A strategy to control the spin polarization of electrons using helium - Phys.org", "description": "Spintronics, also known as spin electronics, is a research field that explores how the intrinsic spin of electrons and its magnetic moment can be exploited by devices. Spintronic devices are promising for a wide range of applications, particularly for efficie…", "url": "https://phys.org/news/2021-11-strategy-polarization-electrons-helium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/a-strategy-to-control-3.jpg", "publishedAt": "2021-11-02T14:00:01Z", "content": "Spintronics, also known as spin electronics, is a research field that explores how the intrinsic spin of electrons and its magnetic moment can be exploited by devices. Spintronic devices are promisin… [+7096 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Satellite monitoring of Greenland ice melting highlights global flood risk - Phys.org", "description": "Global warming has caused extreme ice melting events in Greenland to become more frequent and intense over the past 40 years, raising sea levels and flood risk worldwide, finds new research involving UCL academics.", "url": "https://phys.org/news/2021-11-satellite-greenland-ice-highlights-global.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/satellite-monitoring-o.jpg", "publishedAt": "2021-11-02T12:59:12Z", "content": "Global warming has caused extreme ice melting events in Greenland to become more frequent and intense over the past 40 years, raising sea levels and flood risk worldwide, finds new research involving… [+4910 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mongooses give bullies the cold shoulder, scientists find - Phys.org", "description": "Management of within-group conflict is a key feature of human lives and those of many social animals, with contestants known to adopt various strategies in the immediate aftermath to minimize costs. The study, published today in the journal eLife by a team at…", "url": "https://phys.org/news/2021-11-mongooses-bullies-cold-shoulder-scientists.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/mongooses-give-bullies.jpg", "publishedAt": "2021-11-02T08:17:46Z", "content": "Management of within-group conflict is a key feature of human lives and those of many social animals, with contestants known to adopt various strategies in the immediate aftermath to minimize costs. … [+3612 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Uncovering the Surprising Secrets Behind Earth’s First Major Mass Extinction - SciTechDaily", "description": "A team of researchers publish a new study exploring the cause of the Late Ordovician mass extinction. We all know that the dinosaurs died in a mass extinction. But did you know that there were other mass extinctions? There are five most significant mass extin…", "url": "https://scitechdaily.com/uncovering-the-surprising-secrets-behind-earths-first-major-mass-extinction/", "urlToImage": "https://scitechdaily.com/images/Hirnantian-Branchiopods-scaled.jpg", "publishedAt": "2021-11-02T02:49:32Z", "content": "Detail images of fossils from the Ordovician Period outcrop on Anticosti Island, Quebec, Canada. Credit: André Desrochers, University of Ottawa\r\nA team of researchers publish a new study exploring t… [+6317 chars]"}, {"source": {"id": null, "name": "AlterNet"}, "author": "The Conversation", "title": "A small telescope past Saturn could solve some of the universe's mysteries - AlterNet", "description": "by Michael Zemcov, Rochester Institute of TechnologyDozens of space-based telescopes operate near Earth and provide incredible images of the universe. But imagine a telescope far away in the outer solar system, 10 or even 100 times farther from the Sun than E…", "url": "https://www.alternet.org/2021/11/saturn-telescope/", "urlToImage": "https://www.alternet.org/media-library/galaxy.jpg?id=27868704&width=1200&coordinates=0%2C500%2C0%2C500&height=600", "publishedAt": "2021-11-02T00:55:03Z", "content": "by Michael Zemcov, Rochester Institute of Technology\r\nDozens of space-based telescopes operate near Earth and provide incredible images of the universe. But imagine a telescope far away in the outer … [+6415 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "NASA just found these organic molecules on Mars for the first time - Inverse", "description": "The Curiosity rover detected certain organic molecules on Mars for the first time.", "url": "https://www.inverse.com/science/organic-molecules-found-on-mars-for-the-first-time", "urlToImage": "https://imgix.bustle.com/uploads/image/2021/11/1/d3a23f8e-f960-4152-9850-3c22b205e0d2-25098_pia23974-16.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-11-01T23:00:25Z", "content": "After spending 1,909 Martian sols on the Red Planet\r\n, NASAs Curiosity rover was suffering from a slight malfunction.\r\nThe robots drill stopped working while Curiosity was on Mars Vera Rubin ridge at… [+5427 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "John Loeffler", "title": "Something keeps exploding in space and astronomers have no idea what it is - TechRadar", "description": "Bizarre source of fast radio burst keeps exploding over and over", "url": "https://www.techradar.com/news/something-keeps-exploding-in-space-and-astronomers-have-no-idea-what-it-is", "urlToImage": "https://cdn.mos.cms.futurecdn.net/afDYhH2KvchE9aP7QNzWM4-1200-80.jpg", "publishedAt": "2021-11-01T22:14:40Z", "content": "After watching a bizarre space object repeatedly explode over 1,600 times in fairly short order, astronomers are still at a loss as to what it actually is.\r\nThe object is the source of a fast radio b… [+2542 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Researchers discover new type of nerve cell in the retina - Medical Xpress", "description": "Scientists at the John A. Moran Eye Center at the University of Utah have discovered a new type of nerve cell, or neuron, in the retina.", "url": "https://medicalxpress.com/news/2021-11-nerve-cell-retina.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/retina.jpg", "publishedAt": "2021-11-01T19:49:51Z", "content": "Scientists at the John A. Moran Eye Center at the University of Utah have discovered a new type of nerve cell, or neuron, in the retina.\r\nIn the central nervous system, a complex circuitry of neurons… [+2378 chars]"}, {"source": {"id": null, "name": "Pnas.org"}, "author": null, "title": "Microchromosomes are building blocks of bird, reptile, and mammal chromosomes - pnas.org", "description": "Genomes of birds and reptiles, but not mammals, consist of a few large chromosomes and many tiny microchromosomes. Microchromosomes are gene-rich and highly conserved among birds and reptiles and share homology with one or more of the tiny chromosomes of an i…", "url": "https://www.pnas.org/content/118/45/e2112494118", "urlToImage": "https://www.pnas.org/content/118/45/e2112494118/F1.large.jpg", "publishedAt": "2021-11-01T19:43:37Z", "content": "Abstract\r\nMicrochromosomes, once considered unimportant shreds of the chicken genome, are gene-rich elements with a high GC content and few transposable elements. Their origin has been debated for de… [+22040 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Physicists discover how particles self-assemble - Phys.org", "description": "A team of physicists has discovered how DNA molecules self-organize into adhesive patches between particles in response to assembly instructions. Its findings offer a \"proof of concept\" for an innovative way to produce materials with a well-defined connectivi…", "url": "https://phys.org/news/2021-11-physicists-particles-self-assemble.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/physicists-discover-ho.jpg", "publishedAt": "2021-11-01T19:11:16Z", "content": "A team of physicists has discovered how DNA molecules self-organize into adhesive patches between particles in response to assembly instructions. Its findings offer a \"proof of concept\" for an innova… [+3004 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Dr Henrik Drake", "title": "Microbes may have lived in the underground for more than a billion years - Phys.org", "description": "A study using the thermal history and biosignatures of the upper few kilometers of some of the oldest rocks on Earth place constraints on the evolutionary history of microbes in the deep biosphere. A new study, published in PNAS, Proceedings of the National A…", "url": "https://phys.org/news/2021-11-microbes-underground-billion-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/microbes-may-have-live.jpg", "publishedAt": "2021-11-01T19:00:02Z", "content": "A study using the thermal history and biosignatures of the upper few kilometers of some of the oldest rocks on Earth place constraints on the evolutionary history of microbes in the deep biosphere. A… [+4230 chars]"}, {"source": {"id": null, "name": "HYPEBEAST"}, "author": "Dylan Kelly", "title": "Here's What Jupiter's 'Beautiful and Violent Atmosphere' Looks Like in 3D - HYPEBEAST", "description": "Captured by NASA's Juno probe.", "url": "https://hypebeast.com/2021/11/nasa-juno-spacecraft-jupiter-3d-images", "urlToImage": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2021%2F11%2Fnasa-juno-spacecraft-jupiter-3d-images-TW.jpg?w=960&cbr=1&q=90&fit=max", "publishedAt": "2021-11-01T18:11:36Z", "content": "NASA‘s Juno probe has captured a deeper view of Jupiter‘s atmosphere.\r\nScientists have developed the first three-dimensional look at Jupiter’s atmospheric layers, showcasing the mechanics of the plan… [+1650 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Cooper pairs spotted above critical temperature for superconductivity – Physics World - physicsworld.com", "description": "Shot noise reveals pairs in disordered superconductor with no pseudogap", "url": "https://physicsworld.com/cooper-pairs-spotted-above-critical-temperature-for-superconductivity/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2021/11/Photo-of-Koen-Bastiaans-.jpg", "publishedAt": "2021-11-01T17:41:04Z", "content": "Noisy measurement: Koen Bastiaans in the lab at the University of Leiden. (Courtesy: University of Leiden)\r\nThe most direct evidence so far that Cooper pairs of electrons can exist in a material abov… [+4842 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "Inside Artemis 1's complex launch windows and constraints - NASASpaceFlight.com - NASASpaceflight.com", "description": "When the flight hardware and ground systems are finally ready for the inaugural Artemis 1…", "url": "https://www.nasaspaceflight.com/2021/11/artemis-1-launch-periods/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/10/Orion-on-ICPS-Oct-2021-NSF.jpg", "publishedAt": "2021-11-01T16:40:57Z", "content": "When the flight hardware and ground systems are finally ready for the inaugural Artemis 1 launch to the Moon, NASA will also have to synchronize the timing of the flight with unique celestial mechani… [+22776 chars]"}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "Astronauts ‘touch down’ in Negev’s Ramon Crater after mission to ‘Mars’ - The Times of Israel", "description": "In a collaboration between the Israel Space Agency and the Austrian Space Forum, 6 analog astronauts spent several weeks simulating life on Red Planet and conducting experiments", "url": "https://www.timesofisrael.com/astronauts-touch-down-in-negevs-ramon-crater-after-mission-to-mars/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2021/11/20211031_161805-1024x640.jpg", "publishedAt": "2021-11-01T15:02:00Z", "content": "After 21 days on Mars, six astronauts emerge smiling and waving into an overcast afternoon.\r\nThat was the scene that played out Sunday at the Ramon Crater, in the middle of Israels Negev Desert, thou… [+5853 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "New technology gives smart cars 'X-ray' vision, detecting hidden pedestrians, cyclists - Tech Xplore", "description": "Australian researchers have developed disruptive technology allowing autonomous vehicles to track running pedestrians hidden behind buildings, and cyclists obscured by larger cars, trucks, and buses.", "url": "https://techxplore.com/news/2021-11-technology-smart-cars-x-ray-vision.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/new-technology-gives-s.jpg", "publishedAt": "2021-11-01T13:36:08Z", "content": "Australian researchers have developed disruptive technology allowing autonomous vehicles to track running pedestrians hidden behind buildings, and cyclists obscured by larger cars, trucks, and buses.… [+5352 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Separated only by quadrillionths of a second: Ultrashort flashes of light combined precisely and quickly - Phys.org", "description": "Ultrashort flashes of light lasting less than a quadrillionth of a second are fast growing in technological importance. In laser sources, pairs and groups of light flashes can be created instead of individual flashes. Similar to the chemically bonded atoms in…", "url": "https://phys.org/news/2021-11-quadrillionths-ultrashort-combined-precisely-quickly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/separated-only-by-quad.jpg", "publishedAt": "2021-11-01T12:15:23Z", "content": "Ultrashort flashes of light lasting less than a quadrillionth of a second are fast growing in technological importance. In laser sources, pairs and groups of light flashes can be created instead of i… [+4304 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Captures Brilliant Cosmic Fireworks - SciTechDaily", "description": "This NASA/ESA Hubble Space Telescope Picture of the Week features the galaxy NGC 6984, an elegant spiral galaxy in the constellation Indus roughly 200 million light-years away from Earth. The galaxy is a familiar sight for Hubble, having already been captured…", "url": "https://scitechdaily.com/hubble-captures-brilliant-cosmic-fireworks/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-6984-Crop-scaled.jpg", "publishedAt": "2021-11-01T10:08:52Z", "content": "ByESA/HubbleNovember 1, 2021\r\nGalaxy NGC 6984, an elegant spiral galaxy in the constellation Indus roughly 200 million light-years away from Earth, captured by the Hubble Space Telescope. Credit: ESA… [+2045 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "Massive Sun solar flare hits Earth, causes crazy phenomenon in the sky - TweakTown", "description": "NASA confirmed a solar flare happened on the Sun and a blast heading directly towards Earth. That blast caused a phenomenon.", "url": "https://www.tweaktown.com/news/82506/massive-sun-solar-flare-hits-earth-causes-crazy-phenomenon-in-the-sky/index.html", "urlToImage": "https://static.tweaktown.com/news/8/2/82506_05_blast-from-sun-hits-earth-causes-phenomenon-to-be-seen-in-the-sky_full.jpg", "publishedAt": "2021-11-01T08:32:01Z", "content": "NASA recently confirmed that on October 28, the solar flare was observed on the Sun's lower center and that this flare would result in a large amount of radiation smashing into Earth.\r\nThe flare was … [+1226 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Michael Safi, Sirin Kale, Rudi Zygadlo, Elizabeth Cassin, Phil Maynard, Archie Bland", "title": "The regrets of the unvaccinated: why Covid-bereaved families are speaking out - The Guardian", "description": "The majority of those dying of Covid-19 in the UK and the US are have not been vaccinated. Bereaved relatives are telling their stories to try to convince others to get their jabs", "url": "https://www.theguardian.com/news/audio/2021/nov/01/fit-healthy-then-dying-unvaccinated-covid-bereaved-families-speak-out-podcast", "urlToImage": "https://i.guim.co.uk/img/media/3b750d06c7ad6dbae0874c4945c15f43d255ab02/0_216_3202_1921/master/3202.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75581c56375079251a305809cab4f06d", "publishedAt": "2021-11-01T03:00:44Z", "content": "Phil Valentine was a Tennessee-based conservative talk radio host who was sceptical about the US governments response to the coronavirus crisis. He was not completely anti-vax, but he did not think h… [+674 chars]"}]}