{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Marcia Dunn", "title": "NASA Mars helicopter heard humming through thin Martian air - The Associated Press", "description": "CAPE CANAVERAL, Fla. (AP) — First came the amazing pictures, then the video. Now NASA is sharing sounds of its little helicopter humming through the thin Martian air.  NASA’s Jet Propulsion Laboratory in California released this first-ever <a href=\"https://ww…", "url": "https://apnews.com/article/business-mars-science-3274bb1f7433ab203f31cb23c7e27824", "urlToImage": "https://storage.googleapis.com/afs-prod/media/59c4a921dcb24c4ab3b7916b77e52c3a/1500.jpeg", "publishedAt": "2021-05-07T17:27:31Z", "content": "CAPE CANAVERAL, Fla. (AP) First came the amazing pictures, then the video. Now NASA is sharing sounds of its little helicopter humming through the thin Martian air. \r\nNASAs Jet Propulsion Laboratory … [+1751 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sharks Use Earth’s Magnetic Fields to Guide Them Like a Map – “It Really Is Mind Blowing” - SciTechDaily", "description": "Sea turtles are known for relying on magnetic signatures to find their way across thousands of miles to the very beaches where they hatched. Now, researchers reporting in the journal Current Biology on May 6, 2021, have some of the first solid evidence that s…", "url": "https://scitechdaily.com/sharks-use-earths-magnetic-fields-to-guide-them-like-a-map-it-really-is-mind-blowing/", "urlToImage": "https://scitechdaily.com/images/Bonnethead-Shark-Hunting-at-Night.jpg", "publishedAt": "2021-05-07T14:27:22Z", "content": "Sea turtles are known for relying on magnetic signatures to find their way across thousands of miles to the very beaches where they hatched. Now, researchers reporting in the journal Current Biology … [+4166 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Hologram experts can now create real-life images that move in the air - EurekAlert", "description": "They may be tiny weapons, but Brigham Young University's holography research group has figured out how to create lightsabers -- green for Yoda and red for Darth Vader, naturally -- with actual luminous beams rising from them.", "url": "https://www.eurekalert.org/pub_releases/2021-05/byu-hec050621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/264265_web.jpg", "publishedAt": "2021-05-07T13:22:20Z", "content": "IMAGE: A tiny Starship Enterprise fires on a tiny Klingon Battle cruiser with real animated images created in thin air.\r\n view more \r\nCredit: BYU\r\nThey may be tiny weapons, but Brigham Young Universi… [+3146 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Harry Pettit", "title": "Scientist predicted a man named ‘Elon’ would colonise Mars in book written 70 YEARS ago... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/14881853/predict-man-elon-colonise-mars-book/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/05/NINTCHDBPICT000643389533-2.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-05-07T13:22:00Z", "content": "ELON Musk's plot to colonise other worlds may have been predicted by a German scientist 70 years ago.\r\nWriting in his 1952 science fiction novel \"Project Mars\", engineer Wernher von Braun described a… [+4121 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "SpaceX might try to fly the first Starship prototype to successfully land a second time - TechCrunch", "description": "SpaceX is fresh off a high for its Starship spacecraft development program, but according to CEO Elon Musk, it’s already looking ahead to potentially repeating its latest success with an unplanned early reusability experiment. Earlier this week, SpaceX flew t…", "url": "http://techcrunch.com/2021/05/07/spacex-might-try-to-fly-the-first-starship-prototype-to-successfully-land-a-second-time/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/HP_SN15_Desktop.jpg?w=764", "publishedAt": "2021-05-07T12:21:58Z", "content": "SpaceX is fresh off a high for its Starship spacecraft development program, but according to CEO Elon Musk, it’s already looking ahead to potentially repeating its latest success with an unplanned ea… [+1837 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "'Spaghettified' star wrapped around a black hole spotted for the first time - Space.com", "description": "Astronomers observe as a giant black hole sucks in a spaghettified star.", "url": "https://www.space.com/spaghettified-star-observed-near-black-hole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AtBFL9uC69d8pWzYwMsApS-1200-80.jpg", "publishedAt": "2021-05-07T11:10:16Z", "content": "Filaments of material wrapped around a supermassive black hole have been spotted for the first time suggesting a star trapped by the black hole's gravity has just been destroyed by spaghettification.… [+4072 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "There's Evidence Volcanoes Are Active on Mars, Raising Chances of Recent Habitability - ScienceAlert", "description": "Evidence seems to be mounting for a geologically and volcanically active Mars.", "url": "https://www.sciencealert.com/volcanoes-on-mars-could-be-active-raising-the-chances-of-recent-habitability", "urlToImage": "https://www.sciencealert.com/images/2021-05/processed/1200px-osiris_mars_true_color_2_1024.jpg", "publishedAt": "2021-05-07T07:29:30Z", "content": "Evidence seems to be mounting for a geologically and volcanically active Mars.\r\nA new, close study of volcanic features on the surface of the red planet has found that a lava deposit on the Elysium P… [+4253 chars]"}, {"source": {"id": null, "name": "WDAF FOX4 Kansas City"}, "author": "Makenzie Koch", "title": "Seeing lights in the sky? SpaceX Starlink satellite — not UFOs — passes over Kansas City area - WDAF FOX4 Kansas City", "description": "KANSAS CITY, Mo. — If you’re seeing a strange string of lights in the sky Thursday night, don’t worry. It’s not aliens invading. It’s just a SpaceX Starlink satellite traveling over the Kansas City region. Others in various parts of the central Midwest, like …", "url": "https://fox4kc.com/news/seeing-lights-in-the-sky-spacex-starlink-satellite-not-ufos-passes-over-kansas-city-area/", "urlToImage": "https://fox4kc.com/wp-content/uploads/sites/16/2021/05/starlink.jpg?w=1280", "publishedAt": "2021-05-07T03:16:03Z", "content": "KANSAS CITY, Mo. — If you’re seeing a strange string of lights in the sky Thursday night, don’t worry. It’s not aliens invading.\r\nIt’s just a SpaceX Starlink satellite traveling over the Kansas City … [+907 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shuvuuia: Extraordinary Dinosaurs That Hunted in the Dark - SciTechDaily", "description": "The tiny desert-living dinosaur Shuvuuia had extraordinary vision and owl-like hearing for nocturnal life in the Mongolian desert. Today's 10,000 species of birds live in virtually every habitat on Earth, but only a handful have adaptations enabling them to h…", "url": "https://scitechdaily.com/shuvuuia-extraordinary-dinosaurs-that-hunted-in-the-dark/", "urlToImage": "https://scitechdaily.com/images/Shuvuuia-Deserti-Reconstruction-Crop.jpg", "publishedAt": "2021-05-07T02:45:25Z", "content": "Shuvuuia deserti artist’s reconstruction. Credit: Viktor Radermaker\r\nThe tiny desert-living dinosaur Shuvuuia had extraordinary vision and owl-like hearing for nocturnal life in the Mongolian desert.… [+4045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Felt Really Heavy\": Astronauts Describe Returning To Earth On SpaceX Capsule - NDTV", "description": "Four astronauts just returned from the International Space Station described on Thursday their reentry into Earth's atmosphere and ocean splashdown after more than 160 days in space.", "url": "https://www.ndtv.com/world-news/astronauts-describe-returning-to-earth-on-spacex-capsule-felt-really-heavy-2436717", "urlToImage": "https://c.ndtvimg.com/2021-05/lcmfdck_astronauts-splash-down-off-florida-650_625x300_02_May_21.jpeg", "publishedAt": "2021-05-07T00:40:37Z", "content": "A SpaceX Crew Dragon capsule carrying the crew back to Earth splashed down off Florida early Sunday.\r\nWashington, United States: Four astronauts just returned from the International Space Station des… [+2273 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Starliner test flight scheduled for July 30 - SpaceNews", "description": "NASA and Boeing have scheduled a second uncrewed test flight of the CST-100 Starliner commercial crew spacecraft for July 30.", "url": "https://spacenews.com/starliner-test-flight-scheduled-for-july-30/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/05/starliner-oft2preps.jpg", "publishedAt": "2021-05-06T22:58:37Z", "content": "WASHINGTON NASA and Boeing have scheduled a second uncrewed test flight of the CST-100 Starliner commercial crew spacecraft for July 30.\r\nIn separate statements, the agency and the company said they … [+4050 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Public, Media to Watch Asteroid Mission Begin Return - NASA", "description": "NASA invites the public and the media to watch its first asteroid sample return mission begin a two-year cruise home at 4 p.m. EDT Monday, May 10, on NASA Television, the NASA app, and the agency’s website.", "url": "https://www.nasa.gov/press-release/nasa-invites-public-media-to-watch-asteroid-mission-begin-return-to-earth/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/osiris-rex_departure_0.png", "publishedAt": "2021-05-06T21:25:37Z", "content": null}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Direct observation of deterministic macroscopic entanglement - Science Magazine", "description": "Quantum entanglement occurs when two separate entities become strongly linked in a way that cannot be explained by classical physics; it is a powerful resource in quantum communication protocols and advanced technologies that aim to exploit the enhanced capab…", "url": "https://science.sciencemag.org/content/372/6542/622.full", "urlToImage": "https://science.sciencemag.org/content/372/6542/622/F1.large.jpg", "publishedAt": "2021-05-06T18:04:49Z", "content": "Abstract\r\nQuantum entanglement of mechanical systems emerges when distinct objects move with such a high degree of correlation that they can no longer be described separately. Although quantum mechan… [+693 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Fossil apes and human evolution - Science Magazine", "description": "There has been much focus on the evolution of primates and especially where and how humans diverged in this process. It has often been suggested that the last common ancestor between humans and other apes, especially our closest relative, the chimpanzee, was …", "url": "https://science.sciencemag.org/content/372/6542/eabb4363.full", "urlToImage": "https://science.sciencemag.org/content/372/6542/eabb4363/F1.large.jpg", "publishedAt": "2021-05-06T18:04:49Z", "content": "Structured Abstract\r\nIn 1871, Darwin (1) speculated that humans originated in Africa based on the anatomical similarities with African apes (gorillas and chimpanzees) identified by Huxley (2). Howeve… [+5190 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "A rooted phylogeny resolves early bacterial evolution - Science Magazine", "description": "The origin of the eubacteria and phylogenetic relationships between subgroups have been difficult to resolve. Applying a phylogenetic analysis and recent computational methods to the expanded diversity of bacterial sequences from metagenomic analyses, Coleman…", "url": "https://science.sciencemag.org/content/372/6542/eabe0511.full", "urlToImage": "https://science.sciencemag.org/content/372/6542/eabe0511/F1.large.jpg", "publishedAt": "2021-05-06T18:04:49Z", "content": "By Gareth A. Coleman, Adrián A. Davín, Tara A. Mahendrarajah, Lénárd L. Szánthó, Anja Spang, Philip Hugenholtz, Gergely J. Szöllsi, Tom A. Williams\r\nScience07 May 2021"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Molecular glue' makes perovskite solar cells dramatically more reliable over time - Phys.org", "description": "A research team from Brown University has made a major step toward improving the long-term reliability of perovskite solar cells, an emerging clean energy technology. In a study to be published on Friday, May 7 in the journal Science, the team demonstrates a …", "url": "https://phys.org/news/2021-05-molecular-perovskite-solar-cells-reliable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/molecular-glue-makes-p.jpg", "publishedAt": "2021-05-06T18:00:12Z", "content": "A research team from Brown University has made a major step toward improving the long-term reliability of perovskite solar cells, an emerging clean energy technology. In a study to be published on Fr… [+6942 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": "jcole", "title": "Chernobyl's ruins grow restless, and entangling macroscopic objects - Science Magazine", "description": "On this week’s show: Researchers are keeping a close eye on worrying signals at the site of the Chernobyl nuclear disaster, and quantum entanglement for bigger and bigger things", "url": "https://www.sciencemag.org/podcast/chernobyl-s-ruins-grow-restless-and-entangling-macroscopic-objects", "urlToImage": "https://www.sciencemag.org/sites/default/files/chernobyl-pod.jpg", "publishedAt": "2021-05-06T18:00:00Z", "content": "Rich Stone, former international news editor at Science and current senior science editor at the Howard Hughes Medical Institutes Tangled Bank Studios, joins host Sarah Crespi to talk about concernin… [+846 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Wesley LeBlanc", "title": "SpaceX Prototype Rocket for the Moon and Mars Makes First Successful Landing - IGN - IGN", "description": "SpaceX's prototype rocket for the Moon and Mars has made its first successful landing after four unsuccessful attempts since December.", "url": "https://www.ign.com/articles/spacex-elon-musk-prototype-rocket-for-the-moon-and-mars-makes-first-successful-landing", "urlToImage": "https://assets1.ignimgs.com/2021/05/06/screen-shot-2021-05-06-at-111013-am-1620319288469.png?width=1280", "publishedAt": "2021-05-06T17:31:05Z", "content": "SpaceX's prototype rocket, Starship, which has plans to eventually go to the Moon and Mars, has made its first-ever successful landing back on Earth.The space company founded by Elon Musk has made fo… [+2719 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "NASA EGS, Jacobs preparing SLS Core Stage for Artemis 1 stacking - NASASpaceFlight.com - NASASpaceflight.com", "description": "The Core Stage of NASA’s first Space Launch System (SLS) vehicle arrived at the Kennedy…", "url": "https://www.nasaspaceflight.com/2021/05/nasa-egs-jacobs-sls-artemis-1-stacking/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2021/05/P1180372.small_.jpg", "publishedAt": "2021-05-06T17:25:54Z", "content": "The Core Stage of NASA’s first Space Launch System (SLS) vehicle arrived at the Kennedy Space Center (KSC) and was moved into the Vehicle Assembly Building (VAB) on April 29. The stage is now in the … [+19644 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Hydrogen-Free Supernova Sheds Light on Massive Stars’ Violent Death Throes - SciTechDaily", "description": "A curiously yellow pre-supernova star has caused astrophysicists to re-evaluate what’s possible at the deaths of our Universe’s most massive stars. The team describes the peculiar star and its resulting supernova in a new study published recently in Monthly N…", "url": "https://scitechdaily.com/mysterious-hydrogen-free-supernova-sheds-light-on-massive-stars-violent-death-throes/", "urlToImage": "https://scitechdaily.com/images/Yellow-Supergiant-Close-Binary-Blue-Main-Sequence-Companion-Star.jpg", "publishedAt": "2021-05-06T17:19:51Z", "content": "Artist’s impression of a yellow supergiant in a close binary with a blue, main sequence companion star, similar to the properties derived for the 2019yvr progenitor system in Kilpatrick et al. (2021)… [+4101 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Physicists describe new type of aurora - Phys.org", "description": "For millennia, humans in the high latitudes have been enthralled by auroras—the northern and southern lights. Yet even after all that time, it appears the ethereal, dancing ribbons of light above Earth still hold some secrets.", "url": "https://phys.org/news/2021-05-physicists-aurora.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/aurora.jpg", "publishedAt": "2021-05-06T16:44:42Z", "content": "For millennia, humans in the high latitudes have been enthralled by aurorasthe northern and southern lights. Yet even after all that time, it appears the ethereal, dancing ribbons of light above Eart… [+5768 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "Scientists Create The Most High-Intensity Laser Ever Seen - IFLScience", "description": "Scientists have developed the most intense laser ever created. The beam of light delivers a whopping 1023 W/cm2, an intensity equivalent to concentrating t", "url": "https://www.iflscience.com/physics/scientists-create-the-most-highintensity-laser-ever-seen/", "urlToImage": "https://cdn.iflscience.com/images/704b1e47-838f-53f9-9700-3920b338ef30/default-1620316207-image-credit-digital-abstract-art-shutterstock-com.jpg", "publishedAt": "2021-05-06T16:25:00Z", "content": "Scientists have developed the most intense laser ever created. The beam of light delivers a whopping 1023 W/cm2, an intensity equivalent to concentrating the entire luminosity of the Sun into an area… [+2447 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "Archaeologists discover the oldest known human burial in Africa | TheHill - The Hill", "description": "The burial site dates back to 78,000 years ago.", "url": "https://thehill.com/changing-america/enrichment/education/552138-archaeologists-discover-the-oldest-known-human-burial", "urlToImage": "https://thehill.com/sites/default/files/ca_oldestburialsiteinafrica_050621.png", "publishedAt": "2021-05-06T16:20:09Z", "content": "Archaeologists have uncovered the oldest known human burial in Africa: a young child laid to rest in a shallow grave 78,000 years ago. \r\nNew research published Wednesday in the journal Nature details… [+2271 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New Fanged Frog Species Discovered in Philippines | Biology - Sci-News.com", "description": "An international team of scientists has discovered a cryptic new species of fanged frog living on Mindoro and Semirara Islands of the central Philippines.", "url": "http://www.sci-news.com/biology/mindoro-fanged-frog-09628.html", "urlToImage": "http://cdn.sci-news.com/images/2021/05/image_9628f-Limnonectes-beloncioi.jpg", "publishedAt": "2021-05-06T15:47:38Z", "content": "An international team of scientists has discovered a cryptic new species of fanged frog living on Mindoro and Semirara Islands of the central Philippines.\r\nAdult female of the Mindoro fanged frog (Li… [+2452 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "International Cutting-Edge SWOT Satellite to Survey the World's Water - NASA", "description": "So just how does the Surface Water and Ocean Topography mission expect to measure what’s flowing in the planet’s lakes, rivers, and oceans? A very busy project manager explains.", "url": "https://www.nasa.gov/feature/jpl/international-cutting-edge-swot-satellite-to-survey-the-world-s-water/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-pia24531-swot_parag-clean-room-1041.jpg", "publishedAt": "2021-05-06T14:58:54Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jennifer Chu", "title": "Physicists find a novel way to switch antiferromagnetism on and off - Phys.org", "description": "When you save an image to your smartphone, those data are written onto tiny transistors that are electrically switched on or off in a pattern of \"bits\" to represent and encode that image. Most transistors today are made from silicon, an element that scientist…", "url": "https://phys.org/news/2021-05-physicists-antiferromagnetism.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/magneticliqu.jpg", "publishedAt": "2021-05-06T14:19:10Z", "content": "When you save an image to your smartphone, those data are written onto tiny transistors that are electrically switched on or off in a pattern of \"bits\" to represent and encode that image. Most transi… [+7321 chars]"}, {"source": {"id": null, "name": "Nerdist"}, "author": null, "title": "NASA Space Probe Detects Radio Emissions Coming from Venus - Nerdist", "description": "NASA's Parker Solar Probe has picked up on radio emissions coming from Venus' atmosphere, and they sound like something out of the Twilight Zone.", "url": "https://nerdist.com/article/radio-emissions-coming-from-venus/", "urlToImage": "https://nerdist.com/wp-content/uploads/2021/05/Venus-Radio-Emission-feature-image-05052021.jpg", "publishedAt": "2021-05-06T12:51:37Z", "content": "On its latest flyby of Venus, NASA’s Parker Solar Probe once again swung by the second planet from the Sun for its yearly gravity boost. On this routine flyby, something unexpected happened: the prob… [+1810 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Radiation resistance is baked into the Perseverance Mars rover. Here's why that's important. - Space.com", "description": "", "url": "https://www.space.com/mars-rovers-radiation-protection-xilinx", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ma3qmUZ9Yhpi5QvvbJiNZD-1200-80.jpg", "publishedAt": "2021-05-06T10:56:27Z", "content": "Think about the number of times your computer on Earth has crashed. Now imagine how challenging that would be during a rover mission on Mars\r\n.\r\nFrom time to time, the Curiosity rover has gone into \"… [+7450 chars]"}, {"source": {"id": null, "name": "Science Times"}, "author": "Marie Morales", "title": "Mushrooms Growing on Mars? Rock-Like Formations on Surface May Actually Be Fungi - Science Times", "description": "A scientist also famous for the name, \"Space Tiger King,\" is dubbed, recently claimed that the odd 'puffball-like' rocks found on Mars \"are actually mushrooms.\"", "url": "https://www.sciencetimes.com/articles/31042/20210506/mushrooms-growing-mars-rock-formations-surface-actually-fungi.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/33416/science-times-red-planet-has-mushrooms-scientist-claims.jpg", "publishedAt": "2021-05-06T09:30:00Z", "content": "\"Space Tiger King,\" as to how a scientist is dubbed, recently claimed that the odd 'puffball-like' rocks found on Mars \"are actually mushrooms.\"\r\nA Mail Online report said, Dr. Xinli Wei, a microbiol… [+3769 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Eta Aquarids Meteor Shower will peak this evening with up to 20 shooting stars per hour - Daily Mail", "description": "Met Office forecasters warn of showers and cloud cover for much of the UK, however, they expect some clear patches to break through overnight.", "url": "https://www.dailymail.co.uk/sciencetech/article-9549187/Eta-Aquarids-Meteor-Shower-peak-evening-20-shooting-stars-hour.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/06/09/42414412-0-image-a-5_1620289643035.jpg", "publishedAt": "2021-05-06T08:33:44Z", "content": "Up to 20 shooting stars per hour will be visible shooting across the night sky tonight as the Eta Aquarids meteor shower reaches its peak, with best viewing before dawn.\r\nThe show is the result of th… [+6464 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Saturn Has a Weirdly Neat, Symmetrical Magnetic Field. We May Finally Know Why - ScienceAlert", "description": "Saturn really stands out among the Solar System planets, and not just because of its glorious system of rings. Its magnetic field is also peculiar; unlike other planets, with their off-axis fields, Saturn's magnetic field is almost perfectly symmetri", "url": "https://www.sciencealert.com/saturn-has-a-weirdly-neat-and-symmetrical-magnetic-field-helium-rain-might-be-why", "urlToImage": "https://www.sciencealert.com/images/2021-05/processed/saturn_1024.jpg", "publishedAt": "2021-05-06T06:07:11Z", "content": "Saturn really stands out among the Solar System planets, and not just because of its glorious system of rings. Its magnetic field is also peculiar; unlike other planets, with their off-axis fields, S… [+3441 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Anthony Cuthbertson", "title": "SpaceX launch - live: Starship SN15 launches and lands in critical flight over Texas - The Independent", "description": "", "url": "https://www.independent.co.uk/life-style/gadgets-and-tech/space/spacex-starship-sn15-launch-live-b1841695.html", "urlToImage": "https://static.independent.co.uk/2021/03/29/09/spacex%20starship%20sn11%20launch.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-05-05T23:09:31Z", "content": "SpaceX has successfully launched and landed a prototype of its Mars-bound Starship rocket. The next-generation spacecraft lifted off from SpaceXs Starbase facility in Boca Chica, Texas, on Wednesday.… [+2639 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "SpaceX will try to launch its Starship SN15 rocket in Texas today (updated) - Space.com", "description": "Liftoff could occur at 6:20 p.m. EDT (2220 GMT).", "url": "https://www.space.com/spacex-starship-sn15-launch-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uhZo4S238ttbJEXUyKyKu9-1200-80.jpg", "publishedAt": "2021-05-05T22:11:17Z", "content": "Update: SpaceX has successfully launched and landed its Starship SN15 rocket. You can see a replay of the launch above. You can read our wrap story here.\r\nSpaceX will attempt to launch its latest Sta… [+3048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Chinese rocket debris is expected to crash into Earth soon. It's not the first time. - CNN", "description": "China's large rocket is out of control and set to reenter Earth's atmosphere this weekend, bringing about an alarming but not unprecedented situation.", "url": "https://www.cnn.com/2021/05/05/politics/chinese-rocket-debris-space-earth-explainer-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210504155312-long-march-5b-launch-0429-super-tease.jpg", "publishedAt": "2021-05-05T22:04:00Z", "content": "Washington (CNN)The large Chinese rocket that is out of control and set to reenter Earth's atmosphere this weekend has brought about an alarming but not unprecedented situation. \r\nSpace debris has cr… [+7541 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Visit 'Mars' with me in Space.com's new 'Space Traveler' mini-documentary on Friday - Space.com", "description": "Premiering on Space.com this Friday at noon EDT (1600 GMT).", "url": "https://www.space.com/hi-seas-analog-astronaut-space-documentary-premiere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JHvgfDPgrnXKYihE6ymXYT-1200-80.jpg", "publishedAt": "2021-05-05T20:47:42Z", "content": "Have you ever wanted to go to Mars\r\n? \r\nFollow along with me, Space.com senior writer Chelsea Gohd, as I become an analog astronaut in a brand new documentary premiering on Space.com this Friday at n… [+2576 chars]"}, {"source": {"id": null, "name": "WMUR Manchester"}, "author": "KC Downey", "title": "60 years ago Wednesday, Derry's Alan Shepard became first American in space - WMUR Manchester", "description": "Wednesday marks the 60th anniversary of a New Hampshire man becoming the first American to travel in space.", "url": "https://www.wmur.com/article/derry-new-hampshire-alan-shepard-first-american-in-space/36338921", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/alan-shepard-5-4-1525464583.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2021-05-05T20:17:00Z", "content": "DERRY, N.H. —Wednesday marks the 60th anniversary of a New Hampshire man becoming the first American to travel in space.\r\nOn May 5, 1961, Derry's Alan Shepard made history.\r\nBefore lifting off, Shepa… [+1122 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Sebastian Kettley", "title": "Yellowstone volcano hit by 43 earthquakes amid fears supervolcano is overdue an eruption - Daily Express", "description": "YELLOWSTONE volcano was struck by more than 40 earthquakes in April, amid widespread concern the US supervolcano is going to blow one day without warning. But is the Yellowstone volcano overdue for an eruption and should you be worried?", "url": "https://www.express.co.uk/news/science/1431599/yellowstone-volcano-earthquakes-usgs-supervolcano-overdue-eruption-yellowstone-latest-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1431599.jpg", "publishedAt": "2021-05-04T12:43:00Z", "content": null}]}