{"status": "ok", "totalResults": 112, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "China successfully launches first module of planned space station", "description": "The International Space Station's role as the sole venue for a continuous human presence in space may be coming to a close, with China's planned launch of a space station module.", "url": "https://www.cnn.com/2021/04/29/world/iss-future-china-space-station-russia-us-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191008131418-international-space-station-iss-file-2011-super-tease.jpg", "publishedAt": "2021-04-29T06:26:49Z", "content": "(CNN)For more than two decades, the International Space Station has orbited 227 nautical miles above Earth with more than 200 astronauts from 19 different countries enjoying stints aboard. \r\nBut its … [+5491 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "Fact-checking GOP response to Biden's joint address", "description": "In the Republican response to President Joe Biden's joint address to Congress, Sen. Tim Scott of South Carolina said Biden and Democrats were \"pulling\" the US apart and took time to praise former President Donald Trump.", "url": "https://www.cnn.com/2021/04/29/politics/tim-scott-joint-address-response-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428223632-02-gop-response-tim-scott-play-button-super-tease.jpg", "publishedAt": "2021-04-29T06:14:26Z", "content": "Washington (CNN)In the Republican response to President Joe Biden's joint address to Congress, Sen. Tim Scott of South Carolina said Biden and Democrats were \"pulling\" the US apart and took time to p… [+5969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Andrew Brown Jr.'s family and DA offer different accounts of his car's movements during the fatal police shooting", "description": "The family of Andrew Brown Jr. and the local district attorney offered different accounts Wednesday as to what led to the fatal police shooting of the Black man last week in Elizabeth City, North Carolina.", "url": "https://www.cnn.com/2021/04/29/us/andrew-brown-elizabeth-city-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428171714-03-andrew-brown-nc-police-shooting-death-super-tease.jpg", "publishedAt": "2021-04-29T05:35:13Z", "content": "(CNN)The family of Andrew Brown Jr. and the local district attorney offered different accounts Wednesday as to what led to the fatal police shooting of the Black man last week in Elizabeth City, Nort… [+4141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths, CNN", "title": "Hong Kong passes new immigration law that could enable China-style exit bans", "description": "Officials in Hong Kong will soon be able to block people from entering or leaving the territory, raising concerns over the possibility of mainland Chinese-style \"exit bans\" being used to prevent activists and former lawmakers from leaving.", "url": "https://www.cnn.com/2021/04/29/china/hong-kong-china-immigration-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429101636-hong-kong-airplane-free-hk-2019-0901-super-tease.jpg", "publishedAt": "2021-04-29T05:10:33Z", "content": "Hong Kong (CNN)Officials in Hong Kong will soon be able to block people from entering or leaving the territory, raising concerns over the possibility of mainland Chinese-style \"exit bans\" being used … [+5390 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Hits and misses from Biden's speech to Congress", "description": "President Joe Biden delivered the biggest speech of his presidency to date on Wednesday night -- an address to a joint session of Congress.", "url": "https://www.cnn.com/2021/04/29/politics/biden-speech-hits-and-misses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428225506-67-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T04:35:27Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and <a href=\"/profiles/james-griffiths\">James Griffiths</a>, CNN", "title": "The latest on Covid-19 and India's worsening crisis", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-29-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-29T04:07:13Z", "content": "Indian Prime Minister Narendra Modi called for people to continue to come out \"in line with Covid-19 protocols\" and vote during the last phase of West Bengal state elections.\r\nModi and his Bharatiya … [+1580 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, Holmes Lybrand, Tara Subramaniam, Tami Luhby, Katie Lobosco, Anneken Tappe, Jen Christensen, Priscilla Alvarez and Brandon Miller, CNN", "title": "Fact-checking Biden's first joint address to Congress", "description": "In his first joint address to Congress, President Joe Biden struck an optimistic tone, speaking for more than an hour and pushing his expansive vision of building America \"back better\" by touting his vast infrastructure plan and praising the progress the coun…", "url": "https://www.cnn.com/2021/04/28/politics/biden-joint-address-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428220950-biden-address-to-congress-vpx-screengrab-super-tease.jpg", "publishedAt": "2021-04-29T03:52:28Z", "content": "Washington (CNN)In his first joint address to Congress, President Joe Biden struck an optimistic tone, speaking for more than an hour and pushing his expansive vision of building America \"back better… [+9426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "YouTubers face deportation from Bali over fake mask stunt", "description": "Two YouTubers are facing deportation from Bali after they made a prank video that depicted one of them breaking local mask laws.", "url": "https://www.cnn.com/travel/article/youtubers-deportation-bali-indonesia-fake-masks-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428230139-02-youtubers-deportation-bali-indonesia-fake-masks-super-tease.jpg", "publishedAt": "2021-04-29T03:44:06Z", "content": "Indonesia has been strictly enforcing its mask mandates. Police are allowed to issue fines on the first offense and deport foreigners on the second offense. Though this was Lin's and Se's first known… [+284 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Biden's first address to Congress", "description": "Joe Biden addressed a joint session of Congress on Wednesday for the first time in his presidency — and it was an address unlike any other we've seen in modern American history.", "url": "https://www.cnn.com/2021/04/28/politics/gallery/biden-first-address-joint-session-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428220703-43-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T03:42:52Z", "content": "President Joe Biden addresses a joint session of Congress in front of Vice President Kamala Harris and House Speaker Nancy Pelosi on Wednesday, April 28. \"Madam speaker, madam vice president. No pres… [+1102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, CNN Polling Director", "title": "CNN Poll: 7 in 10 who watched say Biden's speech left them feeling optimistic", "description": "About half of Americans who watched President Joe Biden's address to Congress had a very positive reaction to the speech, and 71% said they walked away feeling more optimistic about the country's direction, according to a CNN Poll conducted by SSRS.", "url": "https://www.cnn.com/2021/04/28/politics/cnn-poll-biden-speech-to-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428225508-69-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T03:29:47Z", "content": "(CNN)About half of Americans who watched President Joe Biden's address to Congress had a very positive reaction to the speech, and 71% said they walked away feeling more optimistic about the country'… [+1590 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden goes off-script to thank McConnell for honoring his late son in 2016", "description": "President Joe Biden went off-script during his first joint address to Congress on Wednesday to thank Senate Minority Leader Mitch McConnell for a tribute the Kentucky Republican made to Biden's late son, Beau, in 2016.", "url": "https://www.cnn.com/2021/04/28/politics/mcconnell-beau-biden-cancer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201215105233-mcconnell-biden-split-super-tease.jpg", "publishedAt": "2021-04-29T03:07:25Z", "content": "(CNN)President Joe Biden went off-script during his first joint address to Congress on Wednesday to thank Senate Minority Leader Mitch McConnell for a tribute the Kentucky Republican made to Biden's … [+2380 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Smith-Spark, CNN", "title": "India is the world's top 10 buyer of Covid vaccines. It still has nowhere near enough", "description": "India has the world's biggest vaccine producing capacity but is suffering a devastating second wave of coronavirus infections -- just as supplies of Covid-19 vaccines for its huge population are running low.", "url": "https://www.cnn.com/2021/04/28/asia/india-vaccines-supply-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428214358-20210429-india-vaccines-tease-super-tease.jpg", "publishedAt": "2021-04-29T02:51:16Z", "content": "(CNN)India has the world's biggest vaccine producing capacity but is suffering a devastating second wave of coronavirus infections -- just as supplies of Covid-19 vaccines for its huge population are… [+2263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "5 takeaways from President Biden's first address to Congress", "description": "President Joe Biden made a sweeping case Wednesday for massive new programs that would transform the government's role in Americans' lives, claiming the very future of the country is at stake in his first address to Congress.", "url": "https://www.cnn.com/2021/04/28/politics/joe-biden-congress-address-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428212311-17-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T02:28:26Z", "content": "(CNN)President Joe Biden made a sweeping case Wednesday for massive new programs that would transform the government's role in Americans' lives, claiming the very future of the country is at stake in… [+11628 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Austin Bush, CNN", "title": "Southern Thai food: Exploring the flavors of the country's 'spiciest cuisine'", "description": "The food of southern Thailand has a reputation for being spicy. And often, this reputation is justified. But below the surface there are so many otther flavors and outside influences at play, making it clear that the real goal is balance.", "url": "https://www.cnn.com/travel/article/southern-thailand-food-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427155342-02-southern-thailand-food-collage-super-tease.jpg", "publishedAt": "2021-04-29T02:01:07Z", "content": "(CNN) The toughest reservation in Bangkok? It's almost certainly a place called Sorn. \r\nWhen the restaurant announces on Instagram that its booking period has opened, foodies are willing to endure ho… [+6141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "West Virginia governor signs anti-trans sports bill into law", "description": "West Virginia Gov. Jim Justice on Wednesday signed into law a measure that prohibits transgender girls and women in the state from competing on sports teams at \"any public secondary school or state institution of higher education.\"", "url": "https://www.cnn.com/2021/04/28/politics/west-virginia-anti-trans-sports-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200428143738-jim-justice-super-tease.jpg", "publishedAt": "2021-04-29T01:57:14Z", "content": "Washington (CNN)West Virginia Gov. Jim Justice on Wednesday signed into law a measure that prohibits transgender girls and women in the state from competing on sports teams at \"any public secondary s… [+3187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, CNN", "title": "Hong Kong has fined a journalist for ticking a box. That shows the city's media freedoms are in jeopardy", "description": "On Wednesday, Hong Kong journalist Bao Choy won an award for her investigative work. The next day, that very same work saw her convicted of breaking the city's laws.", "url": "https://www.cnn.com/2021/04/28/media/hong-kong-media-bao-choy-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427114357-01a-hong-kong-media-freedoms-choy-super-tease.jpg", "publishedAt": "2021-04-29T01:00:09Z", "content": "By Julia Hollingsworth, CNN\r\nUpdated 9:00 PM ET, Wed April 28, 2021\r\nHong Kong (CNN)Last Wednesday, Hong Kong journalist Bao Choy was honored for her investigative work. The following day, she was co… [+15569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle and Caroline Kelly, CNN", "title": "Brendan Hunt found guilty of threatening to assault or murder members of Congress", "description": "Brendan Hunt -- whose father is a retired judge and who allegedly threatened the lives of House Speaker Nancy Pelosi, now-Senate Majority Leader Chuck Schumer and Rep. Alexandria Ocasio-Cortez -- was found guilty of one count of threatening to assault or murd…", "url": "https://www.cnn.com/2021/04/28/politics/brendan-hunt-guilty-threatening-assault-murder-members-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210119172339-01-capitol-riot-wide-ground-shot-0106-super-tease.jpg", "publishedAt": "2021-04-29T00:09:29Z", "content": "(CNN)Brendan Hunt -- whose father is a retired judge and who allegedly threatened the lives of House Speaker Nancy Pelosi, now-Senate Majority Leader Chuck Schumer and Rep. Alexandria Ocasio-Cortez -… [+4136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Covid-19 vaccine myths: These reasons for not getting a shot don't hold up. In fact, they'll set the US back", "description": "Americans have an easy way to crush Covid-19 -- one that would let businesses fully reopen safely, ditch the need for social distancing and restore a mask-free return to normalcy. But too many refuse to get vaccinated, citing myths that don't make sense.", "url": "https://www.cnn.com/2021/04/28/health/covid-vaccine-myths-debunked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420141937-01-needles-pfizer-vaccine-0415-super-tease.jpg", "publishedAt": "2021-04-28T23:48:46Z", "content": "(CNN)Americans have an easy way to crush Covid-19 -- one that would let businesses fully reopen safely, ditch the need for social distancing and restore a mask-free return to normalcy. \r\nBut many Ame… [+14119 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stella Chan and Amanda Jackson, CNN", "title": "World's largest firefighting plane grounded as the West braces for another destructive wildfire season", "description": "Amid a drought in the West and warnings of another potentially destructive wildfire season ahead, the owners of the world's largest firefighting air tanker have grounded the massive aircraft, saying it's just not turning a profit.", "url": "https://www.cnn.com/2021/04/28/weather/global-supertanker-wildfire-grounded-trnd-scn-wx/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428163811-01-global-supertanker-super-tease.jpg", "publishedAt": "2021-04-28T23:30:52Z", "content": "(CNN)Amid a drought in the West and warnings of another potentially destructive wildfire season ahead, the owners of the world's largest firefighting air tanker have grounded the massive aircraft, sa… [+3093 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Marshall Cohen", "title": "What's happening with the Rudy Giuliani raids and Ukraine investigation", "description": "Federal agents raided the apartment and office of former President Donald Trump's longtime attorney Rudy Giuliani on Wednesday, an extraordinary move in the Justice Department's ongoing criminal probe.", "url": "https://www.cnn.com/2021/04/28/politics/giuliani-raid-explained/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428125158-file-rudy-giuliani-2020-super-tease.jpg", "publishedAt": "2021-04-28T23:29:27Z", "content": "(CNN)Federal agents raided the apartment and office of former President Donald Trump's longtime attorney Rudy Giuliani on Wednesday, an extraordinary move in the Justice Department's ongoing criminal… [+6002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Melissa Alonso and Rebekah Riess, CNN", "title": "Ohio police union appeals firing of ex-officer who fatally shot Tamir Rice", "description": "Attorneys for the Cleveland Police Patrolmen's Association filed an appeal seeking to have the state Supreme Court overturn the decision.", "url": "https://www.cnn.com/2021/04/28/us/tamir-rice-officer-timothy-loehmann-appeal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201229203045-tamir-rice-file-super-tease.jpg", "publishedAt": "2021-04-28T22:56:49Z", "content": "(CNN)A police union has filed an appeal with the Ohio Supreme Court to reinstate former Cleveland Police Officer Timothy Loehmann, who fatally shot 12-year-old Tamir Rice outside a recreation center … [+1756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Colgate's new toothpaste tube is designed with slippery coating to let you squeeze out every last drop", "description": "Colgate wants to save you the agony of trying to squeeze out every last drop of toothpaste. It's doing that by partnering with LiquiGlide, a company spun out of MIT's Varanasi Research Group, on a new toothpaste tube with a coating designed to avoid any waste.", "url": "https://www.cnn.com/2021/04/28/us/colgate-new-toothpaste-tube-tech-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428153201-01-toothpaste-tube-tech-scn-trnd-super-tease.jpg", "publishedAt": "2021-04-28T22:56:02Z", "content": "(CNN)Colgate wants to save you the agony of trying to squeeze out every last drop of toothpaste. It's doing that by partnering with LiquiGlide, a company spun out of MIT's Varanasi Research Group, on… [+2012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "How the first 100 days became a standard by which new presidents are judged", "description": "President Franklin Delano Roosevelt might have conquered the Great Depression and won World War II. But he bequeathed a first-term curse for his successors.", "url": "https://www.cnn.com/2021/04/28/world/meanwhile-in-america-april-28-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426162736-fdr-biden-split-super-tease.jpg", "publishedAt": "2021-04-28T22:44:32Z", "content": "This was excerpted from the April 28 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)President Fran… [+4484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova, CNN", "title": "1 in 4 Covid deaths last week was in the Americas, official says", "description": "The coronavirus's uncontrolled spread through the Americas accounted for a major part of all global Covid-19 deaths last week, according to Pan American Health Organization (PAHO) Director Carissa Etienne.", "url": "https://www.cnn.com/2021/04/28/americas/covid-19-central-america-paho-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210412152400-brazils-covid-crisis-lockdowns-intl-latam-super-tease.jpg", "publishedAt": "2021-04-28T22:32:35Z", "content": "(CNN)The coronavirus's uncontrolled spread through the Americas accounted for a major part of all global Covid-19 deaths last week, according to Pan American Health Organization (PAHO) Director Caris… [+1884 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "5 key things to remember about Rudy Giuliani and Ukraine", "description": "On Wednesday, federal agents executed a search warrant at the Manhattan home of Rudy Giuliani in connection with a long-running criminal investigation into his involvement with Ukraine in the latter years of Donald Trump's presidency.", "url": "https://www.cnn.com/2021/04/28/politics/rudy-giuliani-raid-ukraine-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191012134844-01-giuliani-super-tease.jpg", "publishedAt": "2021-04-28T22:32:07Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek and Jamiel Lynch, CNN", "title": "Suspected shooter is barricaded in a house after two deputies shot in NC, authorities say", "description": "Two deputies were shot near Boone, North Carolina, and an standoff with the suspected shooter is underway, according to a statement obtained by CNN affiliate WBTV from the Watauga County Sheriff's Office.", "url": "https://www.cnn.com/2021/04/28/us/north-carolina-watauga-county-deputies-shot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428180516-north-carolina-boone-deputies-shot-super-tease.jpg", "publishedAt": "2021-04-28T22:12:15Z", "content": "(CNN)Two deputies were shot near Boone, North Carolina, and an standoff with the suspected shooter is underway, according to a statement obtained by CNN affiliate WBTV from the Watauga County Sheriff… [+993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Hot sleeper? These top-rated Amazon pajamas may be the answer", "description": "With warm summer nights in the near future, we tested out Latuza's Women's V-Neck Short-Sleeve Pajama Set, which has more than 4,000 5-star reviews on Amazon, to see if it's worth the hype.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/amazon-pajamas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427171929-amazon-pajamas-lead-super-169.jpg", "publishedAt": "2021-04-28T22:00:29Z", "content": "With warm summer nights in the near future, owning a pair of PJs that can help keep you cool all night long can be a game changer. And while silk pajamas may seem to be a good answer for some, their … [+4317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Biden to push ambitious economic plan in first prime-time address to Congress", "description": "President Joe Biden will deliver his first address to a joint session of Congress on Wednesday night, hoping to build on the trust he engendered by accelerating the nation's response to the Covid-19 pandemic to convince Americans that they should back his amb…", "url": "https://www.cnn.com/2021/04/28/politics/presidential-prime-time-address/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427132505-01-centered-joe-biden-super-tease.jpg", "publishedAt": "2021-04-28T21:53:29Z", "content": "(CNN)President Joe Biden will deliver his first address to a joint session of Congress on Wednesday night, hoping to build on the trust he engendered by accelerating the nation's response to the Covi… [+5395 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "Biden is marking 100 days. What do you want to see him do next?", "description": "President Biden marks his first 100 days in office successfully delivering on his  promise of getting Covid-19 shots in arms and stimulus checks in the bank. As he enters his next 100 days, tell us what issues you want him to focus on.", "url": "https://www.cnn.com/2021/04/28/politics/callout-biden-next-100-days/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427232328-joe-biden-0427-super-tease.jpg", "publishedAt": "2021-04-28T21:36:42Z", "content": "(CNN)President Joe Biden has moved fast since his January 20 swearing-in, signing a $1.9 trillion Covid relief bill into law less than two months into his term and issuing more executive orders so fa… [+577 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eoin McSweeney, CNN", "title": "Saber-toothed cats stalked and ate baby mammoths", "description": "The comedy film \"Ice Age\" depicted a saber-toothed cat and a mammoth as misfit friends, but in prehistoric times the feline carnivore was a formidable predator that hunted the babies of the large mammal.", "url": "https://www.cnn.com/2021/04/28/world/sabertooth-cats-baby-mammoths-scn-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428161324-01-sabertooth-cat-baby-mammoths-scli-intl-super-tease.jpg", "publishedAt": "2021-04-28T21:24:00Z", "content": "(CNN)The comedy film \"Ice Age\" humorously depicted a saber-toothed cat and a mammoth as misfit friends, but in prehistoric times the feline carnivore was a formidablepredator that preyed on the young… [+2885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Jessica Dean, CNN", "title": "GOP Sen. Tim Scott to deliver Republican response to Biden's first address to Congress", "description": "Sen. Tim Scott of South Carolina will deliver the GOP rebuttal to President Joe Biden's first address to a joint session of Congress on Wednesday evening, spotlighting a unique voice in the party whose profile is on the rise as he leads congressional Republic…", "url": "https://www.cnn.com/2021/04/28/politics/tim-scott-republican-response-biden-address-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427134035-01-play-button-tim-scott-super-tease.jpg", "publishedAt": "2021-04-28T21:18:32Z", "content": "(CNN)Sen. Tim Scott of South Carolina will deliver the GOP rebuttal to President Joe Biden's first address to a joint session of Congress on Wednesday evening, spotlighting a unique voice in the part… [+2953 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "3 men indicted on federal hate crime charges in death of Ahmaud Arbery", "description": "Three men were indicted by a federal grand jury in Southern Georgia in connection with the death of Ahmaud Arbery, the Department of Justice announced Wednesday.", "url": "https://www.cnn.com/2021/04/28/us/ahmaud-arbery-suspects-indicted/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200503221623-ahmaud-arbery-ctn-super-tease.jpg", "publishedAt": "2021-04-28T21:11:55Z", "content": "(CNN)Three men were indicted by a federal grand jury in Southern Georgia in connection with the death of Ahmaud Arbery, the Department of Justice announced Wednesday. \r\nThis is a developing story."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "Biden to deliver first joint address to Congress", "description": "President Biden will deliver a prime-time speech to a joint session of Congress as he prepares to mark 100 days in office. Follow here for the latest.", "url": "https://www.cnn.com/politics/live-news/biden-address-fact-check-updates-04-28-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427123938-01-biden-foreign-policy-restricted-super-tease.jpg", "publishedAt": "2021-04-28T20:59:52Z", "content": "President Biden will address a joint session of Congress for the first time this evening and is expected to tout his administration's accomplishments within his first 100 days in office and unveil ke… [+2258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins and Phil Mattingly, CNN", "title": "Biden will invite the top four congressional leaders to the White House for May 12 meeting", "description": "President Joe Biden will invite the top four congressional leaders to the White House on May 12, his first meeting with the bipartisan congressional leadership since he entered office, according to a White House official.", "url": "https://www.cnn.com/2021/04/28/politics/top-four-congressional-leaders-white-house-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427161742-07-biden-100-days-super-tease.jpg", "publishedAt": "2021-04-28T20:59:02Z", "content": "(CNN)President Joe Biden will invite the top four congressional leaders to the White House on May 12, his first meeting with the bipartisan congressional leadership since he entered office, according… [+625 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "Scoring Biden's performance on 4 key campaign promises in first 100 days", "description": "The practice of judging a presidency during its first 100 days began almost a century ago during the first term of President Franklin Roosevelt as he attempted to pull the country out of the depths of the Great Depression.", "url": "https://www.cnn.com/2021/04/28/politics/biden-100-day-promises-scorecard/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427163143-09-biden-100-days-super-tease.jpg", "publishedAt": "2021-04-28T20:30:32Z", "content": "Washington (CNN)The practice of judging a presidency during its first 100 days began almost a century ago during the first term of President Franklin Roosevelt as he attempted to pull the country out… [+5216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "First lady's virtual joint address guests spotlight Biden administration priorities", "description": "When President Joe Biden delivers his address to a joint session of Congress Wednesday night, first lady Jill Biden will forgo the traditional set of guests in the first lady's viewing box due to social distancing constraints in the House chamber amid the cor…", "url": "https://www.cnn.com/2021/04/28/politics/jill-biden-joint-address-congress-guests/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210225143926-jill-biden-kelly-clarkson-divorce-advice-orig-mg-00000000-super-tease.png", "publishedAt": "2021-04-28T20:21:06Z", "content": "(CNN)When President Joe Biden delivers his address to a joint session of Congress Wednesday night, first lady Jill Biden will forgo the traditional set of guests in the first lady's viewing box due t… [+5091 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Holocaust survivor and Nobel laureate Elie Wiesel memorialized with bust at Washington National Cathedral", "description": "The Washington National Cathedral has unveiled a stone carving of Holocaust survivor and Nobel laureate Elie Wiesel to recognize his legacy as a human rights defender \"dedicated to combating indifference and intolerance.\"", "url": "https://www.cnn.com/2021/04/28/us/national-cathedral-elie-wiesel-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428095427-elie-wiesel-washington-national-cathedral-0416-super-tease.jpg", "publishedAt": "2021-04-28T19:50:34Z", "content": "(CNN)The Washington National Cathedral has unveiled a stone carving of Holocaust survivor and Nobel laureate Elie Wiesel to recognize his legacy as a human rights defender \"dedicated to combating ind… [+2772 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sam Lauron", "title": "Stay on top of your day and your stuff with a Tile Bluetooth Tracker", "description": "Say goodbye to midday disruptions and never lose track of your valuables again with Tile. Tile is the original and most highly rated Bluetooth tracker that keeps track of your stuff.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/tile-paid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428140834-tile-paid-lead-super-169.jpg", "publishedAt": "2021-04-28T19:46:41Z", "content": "There are few situations that can make you feel as frantic as that moment when youre heading out the door, you reach for your keys and you come back empty-handed. What follows is usually a mad dash t… [+3250 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "L.A. County, once California's pandemic epicenter, could enter the final reopening phase May 5", "description": "Los Angeles County, the first county in the US to have recorded more than one million coronavirus cases, is set to enter its least restrictive reopening phase as early as next week, public health officials announced.", "url": "https://www.cnn.com/2021/04/28/health/la-county-reopening/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200304150533-california-coronavirus-presser-0304-super-tease.jpg", "publishedAt": "2021-04-28T19:26:13Z", "content": "(CNN)Los Angeles County, the first county in the US to have recorded more than one million coronavirus cases, is set to enter its least restrictive reopening phase as early as next week, public healt… [+2321 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "California man who died in custody was restrained on his stomach for 5 minutes and lost consciousness, police body camera shows", "description": "A California man who died in police custody this month was restrained on his stomach on the ground for about five minutes before he became unresponsive and officers began CPR, body camera footage released Tuesday by the Alameda Police Department shows.", "url": "https://www.cnn.com/2021/04/28/us/california-mario-arenales-gonzalez-police-custody-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428121600-01-mario-gonzalez-police-custody-death-screengrab-super-tease.jpg", "publishedAt": "2021-04-28T19:14:11Z", "content": "(CNN)A California man who died in police custody this month was restrained on his stomach on the ground for about five minutes before he became unresponsive and officers began CPR, body camera footag… [+4055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Harris and Pelosi to make history as the first women to lead House and Senate during presidential address to Congress", "description": "The imagery of President Joe Biden's address to a joint session of Congress will be notable Wednesday evening for what it will not include, with attendance dramatically scaled back to ensure social distancing amid the pandemic. But it will also be historic fo…", "url": "https://www.cnn.com/2021/04/28/politics/kamala-harris-nancy-pelosi-joint-address/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428143651-kamala-harris-nancy-pelosi-split-super-tease.jpg", "publishedAt": "2021-04-28T18:41:33Z", "content": "(CNN)The imagery of President Joe Biden's address to a joint session of Congress will be notable Wednesday evening for what it will not include, with attendance dramatically scaled back to ensure soc… [+3559 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Your mom isn't like other moms; she's a cool mom. Here's what to get her", "description": "If whoever you're shopping for this Mother's Day falls into this category of trendy, lovable women, you need something special, so we rounded up some of the most unique and unforgettable gifts to give.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/unique-mothers-day-gifts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210422163629-uniquemothersdaylead-super-169.jpg", "publishedAt": "2021-04-28T17:50:45Z", "content": "Theyre not like other moms theyre a cool mom. \r\nIf whoever youre shopping for this Mothers Day falls into this category of trendy, lovable women, you need something truly unique. A bouquet or a box o… [+7294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle, CNN", "title": "New York City primary care doctors begin vaccinating patients against Covid-19", "description": "New York is the latest state to allocate Covid-19 vaccine doses directly to primary care doctors as part of an initiative to reach people who may be reluctant to be inoculated.", "url": "https://www.cnn.com/2021/04/28/health/nyc-primary-care-doctors-covid-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427224512-02-nyc-primary-care-doctors-vaccines-super-tease.jpg", "publishedAt": "2021-04-28T17:47:54Z", "content": "New York, New York (CNN)New York is the latest state to allocate Covid-19 vaccine doses directly to primary care doctors as part of an initiative to reach people who may be reluctant to be inoculated… [+8677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Google CEO on India's Covid crisis: The worst is yet to come", "description": "Sundar Pichai, CEO of Google, tells CNN's Poppy Harlow what the company is doing to support India. He says, getting \"the right information on the ground has been a big focus for us.\"", "url": "https://www.cnn.com/videos/business/2021/04/28/google-ceo-sundar-pichai-covid-india.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428130427-sundar-pichai-google-ceo-super-tease.jpg", "publishedAt": "2021-04-28T17:07:20Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Morrow, CNN Business", "title": "Microsoft is retiring its default font, and it wants your help choosing a new one", "description": "Microsoft is changing its default font for the first time in nearly 15 years, and it wants your help selecting the new one. And no, you can't vote for the goofy options like Comic Sans, Windings or — heaven forbid — Papyrus.", "url": "https://www.cnn.com/2021/04/28/business/microsoft-font-default-calibri/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428120138-01-microsoft-laptop-file-super-tease.jpg", "publishedAt": "2021-04-28T17:03:38Z", "content": "New York (CNN Business)Microsoft is changing its default font for the first time in nearly 15 years, and it wants your help selecting the new one. And no, you can't vote for the goofy options like Co… [+4536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Filipovic", "title": "Joe Biden isn't going to take away your burgers", "description": "It's just a ludicrous rumor cooked up by American conservative politicians (and their media confederates), who have proven themselves less and less interested in engaging on policy questions on the merits, instead trying to distract with make-believe culture …", "url": "https://www.cnn.com/2021/04/28/opinions/nonsense-from-right-on-biden-and-beef-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210316030625-05-eating-habits-poor-sleep-wellness-super-tease.jpg", "publishedAt": "2021-04-28T17:01:48Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6191 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Will Biden stick with Powell at the Fed?", "description": "President Joe Biden has a lot on his plate right now. But he'll soon need to make an important decision about the future of the Federal Reserve — a choice that will help shape his administration's economic policy in the coming years.", "url": "https://www.cnn.com/2021/04/28/economy/federal-reserve-jerome-powell-successor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428083251-02-jerome-powell-1201-super-tease.jpg", "publishedAt": "2021-04-28T16:44:01Z", "content": "New York (CNN Business)President Joe Biden has a lot on his plate right now. But he'll soon need to make an important decision about the future of the Federal Reserve a choice that will help shape hi… [+5057 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Erica Orden, CNN", "title": "Federal agents execute search warrant on Rudy Giuliani's apartment", "description": "Federal agents executed a search warrant Wednesday at the Manhattan apartment of Rudy Giuliani, advancing a criminal investigation by federal prosecutors that has been underway for months, according to two people familiar with the matter.", "url": "https://www.cnn.com/2021/04/28/politics/rudy-giuliani-federal-prosecutors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201222110730-rudy-giuliani-1107-super-tease.jpg", "publishedAt": "2021-04-28T16:30:09Z", "content": "(CNN)Federal agents executed a search warrant Wednesday at the Manhattan apartment of Rudy Giuliani, advancing a criminal investigation by federal prosecutors that has been underway for months, accor… [+1065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara O'Brien, CNN Business", "title": "One of the world's most famous Indian CEOs says he's heartbroken about his country", "description": "Google CEO Sundar Pichai said it has been \"heartbreaking\" to witness the pandemic's devastating impact on India, which is experiencing the world's worst outbreak of the coronavirus. In an exclusive interview with CNN's Poppy Harlow Wednesday, Pichai discussed…", "url": "https://www.cnn.com/2021/04/28/tech/sundar-pichai-google-india/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428120112-sundar-pichai-intv-0428-super-tease.jpg", "publishedAt": "2021-04-28T16:23:40Z", "content": "New York (CNN Business)Google CEO Sundar Pichai said it has been \"heartbreaking\" to witness the pandemic's devastating impact on India, which is experiencing the world's worst outbreak of the coronav… [+3736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Biden's pick to serve on powerful DC-based appellate says her experience as a Black jurist 'might be valuable' if confirmed", "description": "Judge Ketanji Brown Jackson, President Joe Biden's pick to fill a vacancy on a powerful DC-based appellate court, said at a Senate hearing Wednesday that her race doesn't play a role in her work as a judge, but that her experience as an African American juris…", "url": "https://www.cnn.com/2021/04/28/politics/ketanji-brown-jackson-senate-confirmation-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428105059-02-ketanji-brown-jackson-hearing-0428-super-tease.jpg", "publishedAt": "2021-04-28T16:16:42Z", "content": "Washington (CNN)Judge Ketanji Brown Jackson, President Joe Biden's pick to fill a vacancy on a powerful DC-based appellate court, said at a Senate hearing Wednesday that her race doesn't play a role … [+1722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Bring your living room outside with these great outdoor rugs from Boutique Rugs", "description": "If your deck or patio is in rough shape, Boutique Rugs is offering a solution that will revamp your outdoor spaces with its seemingly limitless collection of beautiful, high-quality outdoor rugs.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/boutique-rugs-paid-2/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428120022-boutique-rugs-paid-lead-super-169.jpg", "publishedAt": "2021-04-28T16:16:14Z", "content": "Put a smile on your face and rejoice! The dreary winter months have finally passed, the sun is back in full force and you can finally venture out onto your patio, porch, verandah or deck and Oh dear,… [+3332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Allison Hope", "title": "Give Caitlyn Jenner a chance", "description": "Allison Hope writes that Caitlyn Jenner's potential candidacy for California governor -- despite the waves it's making -- could have positive and meaningful ripple effects. Jenner shouldn't get a pass from the LGBTQ community, Hope says, but she should get th…", "url": "https://www.cnn.com/2021/04/28/opinions/caitlyn-jenner-deserves-chance-california-governor-hope/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427190351-caitlyn-jenner-2016-vanity-fair-party-super-tease.jpg", "publishedAt": "2021-04-28T16:07:33Z", "content": "Allison Hope is a writer whose work has been featured by The New York Times, The Washington Post, CNN, Slate and elsewhere. The views expressed here are the author's. Read more opinion on CNN.\r\n (CNN… [+5840 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "6 things to watch during President Joe Biden's first address to Congress", "description": "President Joe Biden is slated to deliver his first joint address to Congress on Wednesday, where he will lay out his next big legislative priority to the American people and celebrate what he sees as his administration's victories during his first 100 days in…", "url": "https://www.cnn.com/2021/04/28/politics/congress-address-tonight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427125800-01-joe-biden-0420-super-tease.jpg", "publishedAt": "2021-04-28T16:00:12Z", "content": "(CNN)President Joe Biden is slated to deliver his first joint address to Congress on Wednesday, where he will lay out his next big legislative priority to the American people and celebrate what he se… [+9085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Joe Rogan spread anti-vaccine misinformation. Spotify's CEO is standing behind him", "description": "Spotify CEO Daniel Ek is standing behind and promoting his company's top podcast host, Joe Rogan, even after Rogan spread anti-vaccine misinformation on-air.", "url": "https://www.cnn.com/2021/04/28/media/daniel-ek-responds-joe-rogan-podcast-controversy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428104314-daniel-ek-joe-rogan-split-super-tease.jpg", "publishedAt": "2021-04-28T15:55:11Z", "content": "New York (CNN Business)Spotify CEO Daniel Ek is standing behind and promoting his company's top podcast host, Joe Rogan, even after Rogan spread anti-vaccine misinformation on-air.\r\nRogan said in a r… [+2832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "21 Mother's Day gift baskets to help thank Mom for all she's done", "description": "We've rounded up 21 lovely, elegant and downright delicious gift baskets and boxes to help thank Mom for all she's done.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/mothers-day-gift-baskets/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210421154813-basketleadetsy-super-169.jpg", "publishedAt": "2021-04-28T15:48:36Z", "content": "We are strong believers that every day should be Mothers Day, but this year, on May 9, well be taking special care to honor the moms in our lives. And whether Mom is a fanatic for flowers, is a caffe… [+12168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, CNN", "title": "Internal Biden administration debate over vaccine sharing grows more intense", "description": "The internal debate in the Biden administration over sharing excess US vaccines doses with other countries has grown more intense in recent weeks as the Covid-19 crisis worsens globally and the situation in the US improves, according to sources familiar with …", "url": "https://www.cnn.com/2021/04/28/politics/biden-administration-vaccine-sharing-debate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401062309-01-pfizer-covid-19-vaccine-new-york-0326-super-tease.jpg", "publishedAt": "2021-04-28T15:42:50Z", "content": "Washington (CNN)The internal debate in the Biden administration over sharing excess US vaccines doses with other countries has grown more intense in recent weeks as the Covid-19 crisis worsens global… [+2812 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Al Goodman, Claudia Rebaza and Lauren Said-Moorhouse, CNN", "title": "Two Spanish journalists and an Irish citizen killed in Burkina Faso", "description": "Two Spanish journalists and an Irish citizen have been killed after they were kidnapped during an anti-poaching patrol in Burkina Faso on Monday.", "url": "https://www.cnn.com/2021/04/28/africa/spanish-journalists-killed-burkina-faso-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428123004-david-beriain-roberto-fraile-split-super-tease.jpg", "publishedAt": "2021-04-28T15:29:09Z", "content": "Madrid, Spain (CNN)Two Spanish journalists and an Irish citizen have been killed after they were kidnapped during an anti-poaching patrol in Burkina Faso on Monday.\r\nSpanish Prime Minister Pedro Sánc… [+3438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Here's what Liz Cheney 'did wrong'", "description": "No one is in a hotter seat in today's Republican Party than Liz Cheney.", "url": "https://www.cnn.com/2021/04/28/politics/liz-cheney-donald-trump-kevin-mccarthy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205160111-01-liz-cheney-0203-super-tease.jpg", "publishedAt": "2021-04-28T15:23:28Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "A bad 80-year-old review of 'Citizen Kane' has been unearthed, making 'Paddington 2' officially a better movie", "description": "The online reviews database Rotten Tomatoes has discovered a negative 80-year-old write-up of \"Citizen Kane,\" stripping the cinematic classic of its perfect score among critics and demoting it below movies including \"Paddington 2\" and \"The Terminator.\"", "url": "https://www.cnn.com/2021/04/28/entertainment/citizen-kane-rotten-tomatoes-review-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/111221073606-welles-kane-story-top.jpg", "publishedAt": "2021-04-28T15:21:47Z", "content": "(CNN)The online reviews database Rotten Tomatoes has unearthed a negative 80-year-old write-up of \"Citizen Kane,\" stripping the cinematic classic of its perfect score among critics and demoting it be… [+2340 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "All the home goods you should buy at Way Day, Wayfair's biggest sale of the year", "description": "Way Day, Wayfair's biggest sale of the year is officially on. You'll find tons of great deals for every room of the house, including a slew of flash deals offering deep discounts for an ultra-limited time. Read on for some of our favorite picks.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/wayfair-sale-way-day/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428111216-wayfair-sale-way-day-lead-1-super-169.jpg", "publishedAt": "2021-04-28T15:21:06Z", "content": "Its time for spring cleaning, and that might mean a few things in the house are getting a refresh too especially after a year of spending a lot of time at home. Whether youre looking for outdoor furn… [+8690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eoin McSweeney, CNN", "title": "Man who filmed and taunted dying police officers jailed for 10 months", "description": "An Australian court has jailed a man for 10 months after he drove dangerously and then filmed and mocked dying police officers at the scene of a deadly crash.", "url": "https://www.cnn.com/2021/04/28/australia/pusey-sentencing-australia-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428094113-02-richard-pusey-case-australia-file-super-tease.jpg", "publishedAt": "2021-04-28T15:06:56Z", "content": "(CNN)An Australian court has jailed a man for 10 months after he drove dangerously and then filmed and mocked dying police officers at the scene of a deadly crash. \r\nRichard Pusey was charged with re… [+3621 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Republican congressman is offering a compelling vision of the post-Trump GOP", "description": "In the space of a single three-and-a-half-minute video posted earlier this week, Illinois Rep. Adam Kinzinger offered a complete -- and compelling -- vision of what the Republican Party (and politics more generally) could be.", "url": "https://www.cnn.com/2021/04/28/politics/adam-kinzinger-donald-trump-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170517090200-rep-adam-kinzinger-super-tease.jpg", "publishedAt": "2021-04-28T15:03:49Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The best sales to shop today: Casper, Apple Watch, Ring and more", "description": "Today, you'll find a deal on a Ring alarm system bundle, a discounted Apple Watch and savings on all things home at Wayfair's Way Day. All that and more below.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428094420-0428dealslead-super-169.jpg", "publishedAt": "2021-04-28T14:50:50Z", "content": "Today, youll find a deal on a Ring alarm system bundle, a discounted Apple Watch and savings on all things home at Wayfairs Way Day. All that and more below.\r\nWay Day is here! The internets favorite … [+11396 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "Photo cutouts and feel-good signs. How these small businesses found a pandemic lifeline", "description": null, "url": "https://www.cnn.com/2021/04/28/success/sports-fan-cutouts-small-business-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426095052-03-aaa-flag--banner-super-tease.jpeg", "publishedAt": "2021-04-28T14:50:33Z", "content": "For most people, the pandemic created an unthinkable year of going nowhere and seeing nobody. But many managed to show their faces at baseball games, graduations and birthdays anyway. Sort of. \r\nStri… [+6078 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeff Merkley and Alan Lowenthal", "title": "What really happens to the plastic you throw out", "description": "Our planet is facing a crisis of catastrophic proportions, with the potential to impact life for generations to come. It is not the Covid-19 pandemic -- which the US is making great progress toward managing. It is also not the climate crisis, though it is rel…", "url": "https://www.cnn.com/2021/04/28/opinions/plastic-pollution-legislation-opinion-merkley-lowenthal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160311142207-plastic-water-bottle-pollution-super-tease.jpg", "publishedAt": "2021-04-28T14:50:26Z", "content": "Jeff Merkley, a Democratic senator from Oregon, and Alan Lowenthal, the Democratic representative in the House for California's 47th district, are the lead sponsors of the Break Free From Plastic Pol… [+5600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Majority of Americans say US economic conditions are good for the first time during the pandemic, per CNN Poll", "description": "For the first time during the pandemic, most Americans approve of the economic conditions in the United States, according to a CNN poll conducted by SSRS that was released Wednesday.", "url": "https://www.cnn.com/2021/04/28/economy/economy-biden-cnn-poll/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428131647-joe-biden-0129-super-tease.jpg", "publishedAt": "2021-04-28T14:38:08Z", "content": "New York (CNN Business)For the first time during the pandemic, most Americans approve of the economic conditions in the United States, according to a CNN poll conducted by SSRS that was released Wedn… [+3641 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Samsung's sleek Galaxy Book Pro laptops are up for pre-order — here's your first look", "description": "The Samsung Galaxy Book Pro and Galaxy Book Pro 360 pack promising specs and gorgeous AMOLED screens into thin and light designs.", "url": "https://www.cnn.com/2021/04/28/cnn-underscored/samsung-galaxy-book-pro-360-preorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428085959-underscored-galaxy-book-pro-screen-super-169.jpg", "publishedAt": "2021-04-28T14:00:47Z", "content": "Its been a busy year for Samsung. After giving us the flagship Galaxy S21 phones, the affordable Galaxy A series handsets and the excellent Galaxy Buds Pro earbuds, the company is back with its first… [+7204 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "How to reduce Covid-19 risk at salons and spas", "description": "Hair, nail or spa appointments aren't possible without the close physical contact that increases Covid-19 risk. If you go, these are the precautions you should take to be safe, regardless of vaccination status.", "url": "https://www.cnn.com/2021/04/28/health/salon-spa-safety-covid-pandemic-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200515071933-11-hair-salons-reopening-coronavirus-lockdown-croatia-0504-super-tease.jpg", "publishedAt": "2021-04-28T13:56:19Z", "content": "There are few no-risk activities during the Covid-19 pandemic, but there are ways to mitigate risks. Fully vaccinated people are, of course, at much lower risk of contracting and spreading coronaviru… [+6669 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "He's shaping the future of Spotify, one moonshot idea at a time", "description": "Spotify is frequently one step ahead of us, suggesting undiscovered songs, artists and podcasts based on what you listened to in the past. But who is helping Spotify stay one step — or 10 years — ahead in the audio industry?", "url": "https://www.cnn.com/2021/04/28/media/spotify-head-of-innovation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210203110419-03-spotify-app-phone---stock-super-tease.jpg", "publishedAt": "2021-04-28T13:43:54Z", "content": "New York (CNN Business)Spotify(SPOT) is frequently one step ahead of us, suggesting undiscovered songs, artists and podcasts based on what you listened to in the past. But who is helping Spotify stay… [+5963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Budd launches North Carolina Senate bid by aligning himself with Trump in growing primary field", "description": "Rep. Ted Budd launched his North Carolina Senate campaign on Wednesday, aligning himself with former President Donald Trump in a 2022 bid for the crucial seat.", "url": "https://www.cnn.com/2021/04/28/politics/budd-north-carolina-senate-bid-republican-primary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428092747-rep-ted-budd-file-super-tease.jpg", "publishedAt": "2021-04-28T13:35:05Z", "content": "(CNN)Rep. Ted Budd launched his North Carolina Senate campaign on Wednesday, aligning himself with former President Donald Trump in a 2022 bid for the crucial seat.\r\nThe congressman, who was first el… [+2712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "Justice Department backs off opposition to releasing videos of attack on Capitol Police officer", "description": "The Justice Department told a court it is backing down from its unwillingness to share with media outlets videos of the alleged chemical spray assault of Capitol Police Officer Brian Sicknick and others on January 6, according to a new court filing.", "url": "https://www.cnn.com/2021/04/28/politics/brian-sicknick-capitol-riot-videos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326163722-01-us-capitol-riots-file-super-tease.jpg", "publishedAt": "2021-04-28T13:27:32Z", "content": "Washington (CNN)The Justice Department told a court it is backing down from its unwillingness to share with media outlets videos of the alleged chemical spray assault of Capitol Police Officer Brian … [+4855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "Man who put his feet on desk in Pelosi's office during Capitol riot to be released from jail pending trial", "description": "Richard Barnett, the man who put his feet on a desk in House Speaker Nancy Pelosi's office and left her an insulting note during the Capitol riot, will be released from jail to await further court proceedings from home.", "url": "https://www.cnn.com/2021/04/28/politics/richard-barnett-nancy-pelosi-desk-jail/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210114142657-richard-barnett-pelosi-office-super-tease.jpg", "publishedAt": "2021-04-28T13:23:14Z", "content": "(CNN)Richard Barnett, the man who put his feet on a desk in House Speaker Nancy Pelosi's office and left her an insulting note during the Capitol riot, will be released from jail to await further cou… [+2526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Chicken coops for everyone: A rural chain is thriving as millennials flee cities", "description": "If you're one of those millennials who moved to a rural or suburban area during the pandemic, it's practically a requirement that you pick up gardening tools at the very least, or maybe even some animal feed or a chicken coop.", "url": "https://www.cnn.com/2021/04/28/business/tractor-supply-millennials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423171917-tractor-supply-company-store-super-tease.jpg", "publishedAt": "2021-04-28T13:07:09Z", "content": "New York (CNN Business)If you're one of those millennials who moved to a rural or suburban area during the pandemic, it's practically a requirement that you pick up gardening tools at the very least,… [+4930 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steven Poole, CNN", "title": "Need your quarterback of the future? The 2021 NFL Draft is here to help", "description": "The NFL Draft is back, and with the commissioner Roger Goodell fully vaccinated, he's out the basement, available for hugs.", "url": "https://edition.cnn.com/2021/04/28/sport/nfl-draft-2021-explainer-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428064440-01-nfl-draft-2021-explainer-trevor-lawrence-super-tease.jpg", "publishedAt": "2021-04-28T13:02:44Z", "content": "(CNN)The NFL Draft is back, and with the commissioner Roger Goodell fully vaccinated, he's out the basement, available for hugs.\r\nAfter 100 days of Joe Biden's presidency and 230 million vaccination … [+3208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "How to watch President Biden's first address to Congress", "description": "President Joe Biden will address a joint session of Congress for the first time on Wednesday evening and is expected to tout his administration's accomplishments within his first 100 days in office and unveil key components of his next legislative push.", "url": "https://www.cnn.com/2021/04/28/politics/how-to-watch-biden-speech-today/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427134751-02-biden-remarks-0427-super-tease.jpg", "publishedAt": "2021-04-28T12:19:26Z", "content": "(CNN)President Joe Biden will address a joint session of Congress for the first time on Wednesday evening and is expected to tout his administration's accomplishments within his first 100 days in off… [+3306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Tony Blair has a mullet now, and it's disturbing Britain", "description": "The former British prime minister appeared in a television interview sporting a hairstyle that prompted comparisons with Doc Brown in \"Back to the Future\" and the possessed Vigo painting in \"Ghostbusters.\"", "url": "https://www.cnn.com/2021/04/28/uk/tony-blair-mullet-interview-scli-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428071931-restricted-screengrab-tony-blair-itv-super-tease.jpg", "publishedAt": "2021-04-28T12:14:21Z", "content": "So Tony Blair's lockdown look has got David Icke, Peter Stringfellow, Paul Weller, and William Hartnell all trending. Fair enough, but I think that's a shocking erasure for Vigo the Carpathian. pic.t… [+74 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Aaron David Miller", "title": "The main idea behind Biden's global strategy", "description": "After 100 days, the prime directive of President Joe Biden so far is stunningly clear -- aspire to be a transformative leader at home and a smart, careful one abroad, writes Aaron David Miller.", "url": "https://www.cnn.com/2021/04/28/opinions/biden-100-days-global-strategy-miller/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210408121518-joe-biden-april-8-2021-super-tease.jpg", "publishedAt": "2021-04-28T12:11:30Z", "content": "Aaron David Miller is a senior fellow at the Carnegie Endowment for International Peace and author of \"The End of Greatness: Why America Can't Have (and Doesn't Want) Another Great President.\" Miller… [+6333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Doctor calls on Joe Rogan to walk back vaccine comments", "description": "Joe Rogan, one of the world's most popular podcast hosts, gave air to anti-vaccine narratives on his Spotify exclusive podcast.", "url": "https://www.cnn.com/videos/media/2021/04/28/joe-rogan-vaccines-podcast-newday-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428072505-joe-rogan-podcast-vpx-super-tease.jpg", "publishedAt": "2021-04-28T12:07:18Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Kelly, CNN Business", "title": "Samsung to unveil 'most powerful Galaxy' device yet", "description": "In a typical year, Samsung only holds two of its big \"Unpacked\" events. But this is no normal year. The South Korean consumer electronics company on Wednesday will hold its third product launch within the first four months of 2021.", "url": "https://www.cnn.com/2021/04/28/tech/samsung-unpacked-event-april-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427145645-01-samsung-unpacked-april-2021-teaser---screenshot-super-tease.jpg", "publishedAt": "2021-04-28T12:06:24Z", "content": "New York (CNN Business)In a typical year, Samsung only holds two of its big \"Unpacked\" events. But this is no normal year. The South Korean consumer electronics company on Wednesday will hold its thi… [+1598 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Exclusive: The Declaration of Independence is the next hot IPO", "description": "A copy of the Declaration of Independence is hitting the sizzling collectibles market, just in time for July 4th. And unlike other rare items up for sale, you don't have to be a millionaire to own a piece of it.", "url": "https://www.cnn.com/2021/04/28/investing/ipo-declaration-of-independence-rally/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427092250-restricted-01-declaration-of-independence-copy-rally-super-tease.jpg", "publishedAt": "2021-04-28T12:02:32Z", "content": "If you pick your collectible right, you can make a lot of money. If you pick it because it's cool, you will probably lose money.\"\r\nNicholas Colas, co-founder of DataTrek Research"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, CNN", "title": "The rich world has failed India", "description": "Dr. Anthony Fauci said helping India was \"a responsibility that the rich countries need to assume.\"", "url": "https://www.cnn.com/2021/04/28/world/coronavirus-newsletter-intl-04-28-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-04-28T11:40:53Z", "content": "A version of this story appeared in the April 28 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)The rich world has… [+6863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "America's economy is rebounding. But it is still in a deep hole", "description": "America is emerging from the worst of the pandemic, and that will mean some eye-popping figures when the government releases economic growth data Thursday. But the big jump — fueled by resurgent consumer spending after a year in lockdown — will still be start…", "url": "https://www.cnn.com/2021/04/28/economy/gdp-growth-economy-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427082519-restricted-second-quarter-gdp-preview-super-tease.jpg", "publishedAt": "2021-04-28T11:28:33Z", "content": "New York (CNN Business)America is emerging from the worst of the pandemic, and that will mean some eye-popping figures when the government releases economic growth data Thursday. But the big jump fue… [+2713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Sophia Saifi and Esha Mitra, CNN", "title": "As India's Covid crisis and variant spreads, neighboring countries go on high alert", "description": "As India continues to grapple with an unrelenting second wave of Covid-19, some neighboring countries in South Asia are seeing their own surges in case numbers, prompting border closures and travel bans.", "url": "https://www.cnn.com/2021/04/28/india/india-covid-south-asia-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428005912-03-india-covid-southeast-asia-restricted-super-tease.jpg", "publishedAt": "2021-04-28T11:20:07Z", "content": "New Delhi (CNN)As India continues to grapple with an unrelenting second wave of Covid-19, some neighboring countries in South Asia are seeing their own surges in case numbers, prompting border closur… [+5527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill", "title": "'Mad Max' superyacht concept powered by airplane jet engines", "description": "Yacht designer Uros Pavasovic has come up with a rather unorthodox way of utilizing discarded aircraft and pushing the boundaries of superyacht design simultaneously.", "url": "https://www.cnn.com/travel/article/cobra-superyacht-concept/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210421075018-cobra-concept--03---visual-aft---uros-pavasovic-studio-super-tease.jpg", "publishedAt": "2021-04-28T10:47:17Z", "content": "(CNN) Rather than dropping in popularity, superyachts have been more in demand than ever during global pandemic.\r\nHowever, yacht designer Uros Pavasovic has come up with a rather unorthodox way of ut… [+3610 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "US stocks await news from the Fed for their next move", "description": "View more stock market news today.", "url": "https://www.cnn.com/business/live-news/stock-market-news-042821/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426061854-03-nyse-0415-super-tease.jpg", "publishedAt": "2021-04-28T10:39:56Z", "content": "After a difficult year, Starbucks (SBUX) sales are finally bouncing back. \r\nSales at US stores open at least 13 months jumped 9% in the three months ending March 28 compared with the same period last… [+712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Norman Eisen, Joanna Lydgate and Jessica Marsden", "title": "The threat to US democracy goes beyond voter suppression", "description": "State legislatures aren't just trying to interfere with how votes are cast — they're also trying to interfere with the way elections are run, write Norman Eisen, Joanna Lydgate and Jessica Marsden. As of early April, at least 148 bills have been introduced in…", "url": "https://www.cnn.com/2021/04/28/opinions/voter-suppression-democracy-threat-eisen-lydgate-marsden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181101114340-cnn-special-report-voter-suppression-democracy-in-peril-ron-7-00002105-super-tease.jpg", "publishedAt": "2021-04-28T10:26:11Z", "content": "Norman Eisen (@NormEisen) served as President Barack Obama's ethics czar and was counsel to the House Judiciary Committee for the first impeachment and trial of President Trump. Joanna Lydgate (@JLyd… [+6692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for April 28: Covid-19, Biden, police violence, Boko Haram, Hungary", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/04/28/us/five-things-april-28-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428050601-5-things-mask-wearing-0427-super-tease.jpg", "publishedAt": "2021-04-28T10:22:07Z", "content": "(CNN)It may be hard to find gas this summer, but it's not because of any crude oil shortage. It's the tanker truck drivers needed to deliver the gas that are in short supply. \r\nHere's what you need t… [+5245 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Opinion: Trump set a low bar for Biden's speech to Congress", "description": "As the House Sergeant of Arms cries \"Madam Speaker, the President of the United States,\" Joe Biden can walk to the rostrum confident of one thing: His first address to Congress will represent a break from what Americans have experienced over the past four yea…", "url": "https://www.cnn.com/2021/04/28/opinions/biden-trump-address-to-congress-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427163143-09-biden-100-days-super-tease.jpg", "publishedAt": "2021-04-28T10:20:47Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+4534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Whitney Wild, CNN", "title": "Internal emails reveal Capitol security officials dismissed warnings about troubling social media posts before January 6 riot", "description": "Newly revealed internal emails show an outside group warned Capitol security officials one day before the January 6 insurrection about a series of troubling social media posts calling for people to storm the US Capitol and kill federal employees, evidence tha…", "url": "https://www.cnn.com/2021/04/28/politics/capitol-security-emails-social-media-riot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413102700-us-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-04-28T10:16:55Z", "content": "(CNN)Newly revealed internal emails show an outside group warned Capitol security officials one day before the January 6 insurrection about a series of troubling social media posts calling for people… [+5399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, CNN Polling Director", "title": "CNN Poll: Majority of Americans approve of Biden and his priorities in first 100 days", "description": "On the cusp of the 100-day mark of Joe Biden's presidency, a new CNN Poll conducted by SSRS finds 53% of Americans approve of the way he is handling the job and say he has had the right priorities, and 59% say he is doing a good job keeping his campaign promi…", "url": "https://www.cnn.com/2021/04/28/politics/cnn-poll-biden-approval-100-days/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427232328-joe-biden-0427-super-tease.jpg", "publishedAt": "2021-04-28T10:07:17Z", "content": "(CNN)On the cusp of the 100-day mark of Joe Biden's presidency, a new CNN Poll conducted by SSRS finds 53% of Americans approve of the way he is handling the job and say he has had the right prioriti… [+7206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, CNN", "title": "'Not an easy transition': Inside Trump's unconventional first months out of office", "description": "Most Mondays and Tuesdays, former President Donald Trump skips golf to confer with aides about the week ahead.", "url": "https://www.cnn.com/2021/04/28/politics/trump-post-presidency/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427170017-01-trump-manhattan-0309-super-tease.jpg", "publishedAt": "2021-04-28T10:04:27Z", "content": "Palm Beach, Florida (CNN)Most Mondays and Tuesdays, former President Donald Trump skips golf to confer with aides about the week ahead. \r\nTogether they decide which Republican candidates he will meet… [+18929 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Dean, CNN", "title": "Tim Scott's Republican rebuttal comes as his role in policing bill negotiation is also in the spotlight", "description": "Sen. Tim Scott, a key player in the bipartisan congressional effort to overhaul policing, will step into the national spotlight Wednesday, handpicked by GOP leadership to give the Republican rebuttal to President Joe Biden's first address to a joint session o…", "url": "https://www.cnn.com/2021/04/28/politics/tim-scott-spotlight-policing-reform/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210121133722-07-us-senators-black-history-scott-super-tease.jpg", "publishedAt": "2021-04-28T10:03:02Z", "content": "(CNN)Sen. Tim Scott, a key player in the bipartisan congressional effort to overhaul policing, will step into the national spotlight Wednesday, handpicked by GOP leadership to give the Republican reb… [+7449 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Former New York AG Eric Schneiderman's law license has been suspended for a year over allegations of abuse", "description": "Disgraced former New York Attorney General Eric Schneiderman, who resigned from his post in 2018 after multiple women accused him of abuse, will not be able to practice law for a year, according to an appeals court decision.", "url": "https://www.cnn.com/2021/04/28/politics/former-ny-ag-eric-schneiderman-law-license-suspended/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180508112519-02-eric-schneiderman-file-super-tease.jpg", "publishedAt": "2021-04-28T09:47:50Z", "content": "(CNN)Disgraced former New York Attorney General Eric Schneiderman, who resigned from his post in 2018 after multiple women accused him of abuse, will not be able to practice law for a year, according… [+3084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "A first look at Ewan McGregor's transformation into fashion designer Halston", "description": "Netflix has teased new images from its upcoming series \"Halston\" showing Ewan McGregor as the titular fashion icon and Krysta Rodriguez's striking transformation into Liza Minnelli.", "url": "https://www.cnn.com/style/article/halston-ewan-mcgregor-netflix/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427124831-02-halston-netflix-super-tease.jpg", "publishedAt": "2021-04-28T09:02:26Z", "content": "Netflix has offered a first look at Ewan McGregor's transformation into fashion designer Roy Halston Frowick ahead of a dramatized series about the 1970s icon.\r\nIn a series of new images, the actor c… [+2618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, Maegan Vazquez and Katie Lobosco, CNN", "title": "Here's what's in Biden's $1.8 trillion American Families Plan", "description": "A month after he laid out a roughly $2 trillion infrastructure plan aimed at helping the nation recover from the coronavirus pandemic, President Joe Biden is set to unveil an additional $1.8 trillion federal investment in education, child care and paid family…", "url": "https://www.cnn.com/2021/04/28/politics/american-families-plan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323222727-02-work-from-home-mom-stock-super-tease.jpg", "publishedAt": "2021-04-28T09:00:20Z", "content": "(CNN)A month after he laid out a roughly $2 trillion infrastructure plan aimed at helping the nation recover from the coronavirus pandemic, President Joe Biden is set to unveil an additional $1.8 tri… [+16125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "These meteorites landed on Earth after a 22-million-year voyage", "description": "Scientists have precisely mapped the flight path of an asteroid that landed on Earth and traced it back to its point of origin. The boulder-size fragment was ejected from the asteroid Vesta and it took 22 million years to reach Earth in 2018.", "url": "https://www.cnn.com/2021/04/28/world/meteorites-asteroid-vesta-earth-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427154858-03-2018-la-asteroid-meteorites-super-tease.jpg", "publishedAt": "2021-04-28T08:51:50Z", "content": "(CNN)For the first time, scientists have been able to precisely map the flight path of an asteroid that landed on Earth and trace it back to its point of origin. The boulder-size fragment's journey t… [+6601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Are we ready for our smart home devices to become truly \"smart\"?", "description": "For decades, the smart home has been a mainstay in pop culture, from Disney's 1999 flick \"Smart House,\" in which an artificially intelligent home takes on the personality of a domineering mother, to the retro high-tech home of \"The Jetsons.\" The 1960s cartoon…", "url": "https://www.cnn.com/style/article/future-smart-home-ambient-technology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427135751-08-future-smart-homes-ambient-technology-super-tease.jpg", "publishedAt": "2021-04-28T08:05:19Z", "content": "designPublished 28th April 2021\r\nFor decades, the smart home has been a mainstay in pop culture, from Disney's 1999 flick \"Smart House,\" in which an artificially intelligent home takes on the persona… [+11010 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess", "title": "New Hampshire officer on administrative leave after TikTok video surfaces calling out 'media/liberals'", "description": "A New Hampshire police officer was placed on administrative leave after Bedford police chief John Bryfonski became aware of \"at least one\" TikTok video the officer created while in uniform and apparently on duty, the chief said in a Monday statement.", "url": "https://www.cnn.com/2021/04/28/us/new-hampshire-officer-on-leave-over-tiktok-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428031644-new-hampshire-officer-tiktok-video-super-tease.jpg", "publishedAt": "2021-04-28T07:49:43Z", "content": "(CNN)A New Hampshire police officer was placed on administrative leave after Bedford police chief John Bryfonski became aware of \"at least one\" TikTok video the officer created while in uniform and a… [+1836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "New video shows 4 seconds between police arrival and the fatal shooting on Andrew Brown Jr., attorney says", "description": "A new video shows that no more than four seconds passed between when Pasquotank Sheriff's deputies' arrival at Andrew Brown Jr.'s home and when shots began to ring out, a family attorney said Tuesday.", "url": "https://www.cnn.com/2021/04/28/us/andrew-brown-elizabeth-city-shooting-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428020305-wayne-kendall-brown-family-attorney-0427-super-tease.jpg", "publishedAt": "2021-04-28T06:24:25Z", "content": "Elizabeth City, North Carolina (CNN)A new video shows that no more than four seconds passed between when Pasquotank Sheriff's deputies' arrival at Andrew Brown Jr.'s home and when shots began to ring… [+6154 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and Jessie Yeung, CNN", "title": "China offered Covid aid to India while US dragged its feet, but Delhi isn't that keen", "description": "When India asked the United States this month to lift a ban on exporting vaccine raw materials to help with the South Asian country's Covid crisis, Washington appeared to drag its feet, citing the need to \"vaccinate the American people\" first.", "url": "https://www.cnn.com/2021/04/28/china/china-india-covid-relief-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427121901-01-india-covid-ward-0427-super-tease.jpg", "publishedAt": "2021-04-28T06:00:23Z", "content": "This is a wrap of several top stories from China for April 28, 2021.\r\nHong Kong (CNN)When India asked the United States this month to lift a ban on exporting vaccine raw materials to help with the So… [+7917 chars]"}]}