{"status": "ok", "totalResults": 176, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler and Kylie Atwood, CNN", "title": "US Embassy in Afghanistan tells staff to destroy sensitive materials", "description": "The US Embassy in Kabul is instructing personnel to destroy sensitive materials as well as items \"which could be misused in propaganda efforts,\" according to a management notice sent Friday to embassy staff, seen by CNN and described by another source familia…", "url": "https://www.cnn.com/2021/08/13/politics/afghanistan-embassy-72-scramble/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813105606-01-kandahar-afghanistan-0813-taliban-super-tease.jpg", "publishedAt": "2021-08-13T18:51:15Z", "content": "(CNN)The US Embassy in Kabul is instructing personnel to destroy sensitive materials as well as items \"which could be misused in propaganda efforts,\" according to a management notice sent Friday to e… [+1375 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Johnson", "title": "Earn 5% cash back in the category you spend the most each month with this credit card", "description": "The Citi Custom Cash Card was only recently launched in June, yet it's a promising option in a sea of popular cash back credit cards, especially since you automatically earn 5% back in the one eligible category you spend the most in each billing cycle.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/citi-custom-cash-credit-card-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813004128-underscored-five-percent-5-written-on-chalk-board-super-169.jpg", "publishedAt": "2021-08-13T18:20:27Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+13118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Bociurkiw", "title": "Canada has big decisions to make on China", "description": "In what Canadian officials have described as \"arbitrary\" decisions, Chinese courts this week have handed down a harsh sentence to Michael Spavor, accused of espionage, and upheld a death sentence for Robert Schellenberg, convicted of drug smuggling in the Asi…", "url": "https://www.cnn.com/2021/08/13/opinions/canada-big-decisions-china-bociurkiw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813131304-trudeau-0613-super-169.jpg", "publishedAt": "2021-08-13T18:15:06Z", "content": "In what Canadian officials have described as arbitrary decisions, Chinese courts this week have handed down a harsh sentence to Michael Spavor, accused of espionage, and upheld a death sentence for R… [+5965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Calls for violence online similar to before January 6 Capitol attack, DHS Intel chief says", "description": "Online extremist rhetoric is strikingly similar to the build-up to the January 6 attack on the US Capitol, with increasing calls for violence linked to conspiracy theories and false narratives, Homeland Security Intelligence chief John Cohen said in an interv…", "url": "https://www.cnn.com/2021/08/13/politics/violence-online-similar-january-6-dhs-intel-chief/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726221744-06-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-08-13T18:08:41Z", "content": "(CNN)Online extremist rhetoric is strikingly similar to the build-up to the January 6 attack on the US Capitol, with increasing calls for violence linked to conspiracy theories and false narratives, … [+2017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bianca Pineda", "title": "Chargers and power strips that'll make you dorm life way easier", "description": "Considering how much college students rely on technology for both work and play, it's more important than ever to be able to charge devices quickly and efficiently. From cables and bricks to wireless chargers and power strips, we rounded up everything you nee…", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/best-chargers-power-strips-for-college-dorm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813135642-dormcharger-lead-super-169.jpg", "publishedAt": "2021-08-13T18:01:47Z", "content": "Considering how much college students rely on technology for both work and play, its more important than ever to be able to charge devices quickly and efficiently. From cables and bricks to wireless … [+4644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The United States is more diverse and has more people than ever before. A map of where we live and how we identify.", "description": "The United States is more diverse and has more people than ever before. A map of where we live and how we identify.\n \n \r\n\n \n\n \n ↩︎ CNN\n \n \n View Post →", "url": "https://www.cnn.com/interactive/2021/us/census-race-ethnicity-map/", "urlToImage": "https://www.cnn.com/interactive/2021/us/census-race-ethnicity-map/media/dotmap_card.png", "publishedAt": "2021-08-13T17:58:00Z", "content": "The United States is more diverse and has more people than ever before, with much of the growth occurring in and around metropolitan areas, according to the 2020 census. By plotting the population on… [+129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The $999 Galaxy Z Flip 3 is priced to compete with flagship phones. Does that make it a contender?", "description": "Samsung's been beating the foldable drum for three years now. And while it took them a generation and a half to get the beat timed right, they now offer two variants of what a foldable phone can truly be. The expensive and flagship Galaxy Z Fold turns a stand…", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/samsung-galaxy-z-flip-vs-s21-iphone-12/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813132635-galaxy-z-flip-foldable-lead-super-169.jpeg", "publishedAt": "2021-08-13T17:48:40Z", "content": "Samsungs been beating the foldable drum for three years now. And while it took them a generation and a half to get the beat timed right, they now offer two variants of what a foldable phone can truly… [+8975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "27 Covid cases reported aboard Carnival cruise ship", "description": "More than two dozen cases of Covid-19 have been detected among crew and passengers aboard a Carnival cruise ship, according to the Belize Tourism Board.", "url": "https://www.cnn.com/travel/article/carnival-cruise-ship-vista-covid-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813120800-01-carnival-vista-cruise-ship-file-super-tease.jpg", "publishedAt": "2021-08-13T17:37:36Z", "content": "(CNN) More than two dozen cases of Covid-19 have been detected among crew and passengers aboard a Carnival cruise ship, according to the Belize Tourism Board.\r\nOne passenger and 26 crew members teste… [+3766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Miller", "title": "July was the hottest month on record, amid extreme weather around the globe", "description": "We just experienced the hottest month, as a planet, in any of our lifetimes -- and we saw the weather extremes that resulted from it.", "url": "https://www.cnn.com/2021/08/13/weather/july-hottest-month-noaa-climate-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711201309-08-heat-wave-unf-0711-super-169.jpg", "publishedAt": "2021-08-13T17:35:44Z", "content": "We just experienced the hottest month, as a planet, in any of our lifetimes and we saw the weather extremes that resulted from it.\r\nThe global temperature in July 2021 was the highest for any July in… [+1849 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lesley Kennedy", "title": "The best pour-over coffee makers of 2021", "description": "To help determine which pour-over maker you should add to your coffee-making routine, we rounded up eight highly rated models to put through the wringer. We tested six flat-bottom- and cone-shaped versions and two larger all-in-one carafe-styles.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/best-pour-over-coffee-makers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303131215-best-pour-over-coffee-maker-lead-super-169.jpg", "publishedAt": "2021-08-13T17:22:13Z", "content": "While we like a classic drip coffee maker when a full pot is absolutely necessary and can appreciate the quick convenience of a single-serve pod, a pour-over is the best way to recreate the rich, rob… [+18529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Gard and Judson Jones, CNN", "title": "The US northern coasts swelter in brutal heat Friday", "description": "Stifling, excessive heat continues to plague both coasts on Friday, bringing record-breaking temperatures and dangerous conditions.", "url": "https://www.cnn.com/2021/08/13/weather/heat-wave-northwest-northeast-seattle-new-york-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813091736-weather-heat-card-image-08132021-super-tease.jpg", "publishedAt": "2021-08-13T17:07:29Z", "content": "Today will be one of the hottest days of the summer, with widespread 90s across the Tri-State. With dew points in the 70s, it will feel even hotter.\r\nStay cool, and know the signs of heat illness! ht… [+154 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz, CNN Business", "title": "Online mask sales jump as Delta variant spreads", "description": null, "url": "https://www.cnn.com/2021/08/13/business/mask-sales-delta-variant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813105742-mask-requirement-la-store-0719-super-tease.jpg", "publishedAt": "2021-08-13T17:02:24Z", "content": "New York (CNN)Sales of reusable face masks, which had started to cool down earlier in the summer, have reversed course as the Delta variant spreads across the United States.\r\nWeekly mask sales in dol… [+3404 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace, CNN Business", "title": "Drive-in theaters fueled Hollywood's box office last year. They could be here to stay", "description": "During a pandemic that upended lives, broke routines, and mothballed most forms of in-person activities, a funny thing happened in the entertainment business: The drive-in theater saved the cinema. But while it might have been dismissed as another anomaly in …", "url": "https://www.cnn.com/2021/08/13/business/drive-ins-here-to-stay-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812192428-restricted-03-drive-in-movie-theaters-pandemic-file-super-tease.jpg", "publishedAt": "2021-08-13T16:55:47Z", "content": "(CNN Business)During a pandemic that upended lives, broke routines, and mothballed most forms of in-person activities, a funny thing happened in the entertainment business: The drive-in theater saved… [+10530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Consumer sentiment suddenly crashes below early-pandemic levels", "description": "Americans are extremely worried about the Delta variant and the spike in Covid-19 cases. A key survey of consumer confidence plunged in August below where it was in April 2020 when the first Covid-19 outbreak slammed the brakes on the US economy.", "url": "https://www.cnn.com/2021/08/13/economy/consumer-sentiment-august/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813112847-us-consumer-sentiment-0729-super-169.jpg", "publishedAt": "2021-08-13T16:21:58Z", "content": "Americans are extremely worried about the Delta variant and the spike in Covid-19 cases. A key survey of consumer confidence plunged in August below where it was in April 2020 when the first Covid-19… [+3455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Biden's new eviction moratorium can remain in place for now, judge rules", "description": "A federal judge in Washington, DC, on Friday allowed the Biden administration's revised eviction moratorium to remain in place, but acknowledged the moratorium faces an uncertain legal future.", "url": "https://www.cnn.com/2021/08/13/politics/eviction-moratorium/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813101756-eviction-protest-nyc-0811-super-169.jpg", "publishedAt": "2021-08-13T16:05:51Z", "content": "A federal judge in Washington, DC, on Friday allowed the Biden administrations revised eviction moratorium to remain in place, but acknowledged the moratorium faces an uncertain legal future.\r\nUS Dis… [+1059 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellen McAlpine", "title": "All the top accessories for your Galaxy S21", "description": "Keeping your Samsung Galaxy S21 protected isn't as hard as you think. Check out our favorite cases, screen protectors and other accessories that can add some style to your phone while keeping it safe.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/best-samsung-galaxy-s21-accessories/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812080711-best-samsung-galaxy-s21-accessories-lead-super-169.jpg", "publishedAt": "2021-08-13T16:02:38Z", "content": "Your Galaxy S21, S21+ or S21 Ultra is a top piece of tech from Samsung and youll want to keep it protected, stylish and charged. To help you find the best case for you, weve rounded up our top access… [+11693 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Cassano", "title": "Tired of tights that rip after one wear? Sheertex tights are a professional wardrobe investment that lasts", "description": "The definition of \"business attire\" has seriously shifted in the past year. For most of us, it's temporarily switched from blazers and button-downs to sweats and backless sweaters. As things open back up, though, people are starting to rebuild their professio…", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/sheertex-tights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813062648-sheertex-tights-feature-super-169.jpg", "publishedAt": "2021-08-13T15:39:20Z", "content": "The definition of business attire has seriously shifted in the past year. For most of us, its temporarily switched from blazers and button-downs to sweats and backless sweaters. As things open back u… [+3127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico", "title": "NFL star JuJu Smith-Schuster reveals his favorite gadgets for Twitch, travel and more", "description": "Here's Pittsburgh Steelers wide receiver JuJu Smith-Schuster's favorite gaming gear, which he uses both on the field and when he's home streaming on Twitch.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/juju-smith-schuster-twitch-streaming/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812171549-influenced-juju-smith-schuster-lead-super-169.jpg", "publishedAt": "2021-08-13T15:03:59Z", "content": "Welcome to Influenced, where we interview creators of all kinds about the gear they use to do their job and their advice for folks looking to follow in their footsteps. This week, we caught up with N… [+4392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathryn Vasel", "title": "How to make the days that you're in the office really count", "description": "If you are only going into the office a few days a week, here's how to make them productive.", "url": "https://www.cnn.com/2021/08/13/success/hybrid-worker-return-to-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812152116-20210812-office-work-productivity-illustration-super-169.jpg", "publishedAt": "2021-08-13T14:55:01Z", "content": "For many workers, the office is going to play a different role when they return.\r\nMany companies are adopting a hybrid work model, where employees split their time between the office and home. And em… [+3742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams", "title": "First live 'murder hornet' of 2021 spotted attacking a wasp nest in Washington", "description": "Entomologists in Washington state are setting up traps and urging people to be on the lookout after a \"murder hornet\" was spotted attacking a paper wasp nest this week near the US-Canadian border.", "url": "https://www.cnn.com/2021/08/13/us/murder-hornet-washington-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813135931-01-wa-live-murder-hornet-super-169.jpg", "publishedAt": "2021-08-13T14:47:26Z", "content": "Entomologists in Washington state are setting up traps and urging people to be on the lookout after a murder hornet was spotted attacking a paper wasp nest this week near the US-Canadian border.\r\nIts… [+2505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Airbnb warns that the Delta variant could disrupt travel", "description": "Airbnb had a blockbuster second quarter, with revenue soaring nearly 300% and topping expectations. But it also reported some bad news: The company is worried about the Delta variant's impact on consumers' future travel plans.", "url": "https://www.cnn.com/2021/08/13/investing/airbnb-earnings-delta-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201210101503-airbnb-nasdaq-1210-super-169.jpg", "publishedAt": "2021-08-13T14:47:24Z", "content": "Airbnb had a blockbuster second quarter, with revenue soaring nearly 300% and topping expectations. But it also reported some bad news: The company is worried about the Delta variants impact on consu… [+2862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Tapp", "title": "Your guide to back-to-school shopping after a very weird year", "description": "It's back-to-school time! Grab your supplies list, make a note of your kids' favourite colours and characters and get shopping. We've gathered together the best tech options for those still learning at home or older kids who are beginning a new chapter at col…", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/canada-back-to-school/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813052657-canada-back-to-school-lead-super-169.jpg", "publishedAt": "2021-08-13T14:37:35Z", "content": "Its back-to-school time! Grab your supplies list, make a note of your kids favourite colours and characters and get shopping. Most Canadian kids will head back to in-person learning this September, b… [+13274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop this weekend: Therabody, Best Buy, PhoneSoap and more", "description": "This weekend, you'll find a deal on our pick for best budget keyboard, a discounted Apple Watch and savings on tons of tech from Best Buy. All that and more below.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813094822-0813dealslead-super-169.jpg", "publishedAt": "2021-08-13T14:27:00Z", "content": "This weekend, youll find a deal on our pick for best budget keyboard, a discounted Apple Watch and savings on tons of tech from Best Buy. All that and more below.\r\nFind savings on most any tech you n… [+12911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "ACLU sues DC, police over use of chemical irritants, stun grenades at racial justice protest", "description": "The American Civil Liberties Union has filed a lawsuit on behalf of two photojournalists who allege they were hit by chemical irritants and stun grenades by Metropolitan Police Department officers while covering racial justice protests in August 2020.", "url": "https://www.cnn.com/2021/08/13/politics/aclu-washington-dc-police-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813092752-floyd-protest-dc-file-2020-super-tease.jpg", "publishedAt": "2021-08-13T14:22:17Z", "content": "(CNN)The American Civil Liberties Union has filed a lawsuit on behalf of two photojournalists who allege they were hit by chemical irritants and stun grenades by Metropolitan Police Department office… [+1942 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar", "title": "Big Tech embraced hybrid work. It's more complicated for some startups", "description": "Starting any business is full of challenges. Starting one in the middle of a global pandemic is on a whole other level. That reality didn't stop serial entrepreneur Rami Essaid from starting Finmark last June, but it did force him to take a different approach.", "url": "https://www.cnn.com/2021/08/13/tech/remote-work-hybrid-tech-startups/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813095207-restricted-remote-work-startups-super-169.jpg", "publishedAt": "2021-08-13T14:19:27Z", "content": "Starting any business is full of challenges. Starting one in the middle of a global pandemic is on a whole other level. That reality didnt stop serial entrepreneur Rami Essaid from starting Finmark l… [+7269 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Caruso", "title": "The 5 best skin care ingredients to smooth wrinkles, according to derms", "description": "There are a few powerhouse skin care ingredients that smooth wrinkles, buff hyperpigmentation away and overall work wonders on mature skin. CNN spoke to four dermatologists to find out the top actives, plus the products that come with them.", "url": "https://www.cnn.com/2021/08/13/cnn-underscored/anti-aging-skincare-ingredients/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805083716-anti-aging-skincare-ingredients-lead-super-169.jpg", "publishedAt": "2021-08-13T14:02:45Z", "content": "As we get older, our bodies undergo tons of tiny changes that keep us moving albeit sometimes not as quickly as we used to. Because the skin is the bodys largest organ, many of these changes stare ba… [+9105 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judson Jones", "title": "Fred is likely to hit Florida as a tropical storm", "description": "Fred hasn't dropped dead yet. Despite looking disorganized on satellite, the National Hurricane Center (NHC) forecasts the tropical depression may strengthen back into a tropical storm before hitting Florida.", "url": "https://www.cnn.com/2021/08/13/weather/fred-storm-florida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813081537-weather-fred-winds-card-20210813-super-169.jpg", "publishedAt": "2021-08-13T14:01:16Z", "content": "Fred hasnt dropped dead yet. \r\nDespite looking disorganized on satellite, the tropical depression may strengthen back into a tropical storm before impacting Florida as soon as early Saturday, the Nat… [+3498 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Coda' is a small movie that hits all the right notes", "description": "\"Coda\" is a small movie, exquisitely made. Touching, funny and stirring, it would be the kind of movie you'd urge a friend to run out and see, except they'll only need to stay home and ante up to stream it on Apple TV+.", "url": "https://www.cnn.com/2021/08/13/entertainment/coda-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811192606-01-coda-movie-super-tease.jpg", "publishedAt": "2021-08-13T14:00:51Z", "content": "(CNN)\"Coda\" is a small movie, exquisitely made. Touching, funny and stirring, it would be the kind of movie you'd urge a friend to run out and see, except they'll only need to stay home and ante up t… [+2962 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry and Brian Lowry", "title": "'Brand New Cherry Flavor' serves up a weird brew of empty calories", "description": "If you're the type who enjoys consuming an eight-episode limited series and thinking \"What the heck did I just watch?\" when it's over, \"Brand New Cherry Flavor\" might be for you.", "url": "https://www.cnn.com/2021/08/13/entertainment/brand-new-cherry-flavor-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210723183613-08-august-streaming-2021brand-new-cherry-flavor-super-169.jpg", "publishedAt": "2021-08-13T13:58:54Z", "content": "If youre the type who enjoys consuming an eight-episode limited series and thinking What the heck did I just watch? when its over, Brand New Cherry Flavor might be for you. Otherwise, this bizarre Ne… [+2543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Selma Blair opens up about life with multiple sclerosis in emotional documentary trailer", "description": "Selma Blair believed she was \"shooting the final days of (her) life\" at one point during the filming of an upcoming documentary following her battle with multiple sclerosis (MS), a trailer for the movie reveals.", "url": "https://www.cnn.com/2021/08/13/entertainment/selma-blair-ms-documentary-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813102258-01-selma-blair-file-2019-super-tease.jpg", "publishedAt": "2021-08-13T13:50:38Z", "content": "(CNN)Selma Blair believed she was \"shooting the final days of (her) life\" at one point during the filming of an upcoming documentary following her battle with multiple sclerosis (MS), a trailer for t… [+1822 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawn Nottingham, CNN", "title": "4 Broward County, Florida, educators died in 24 hours from Covid-19 complications, report says", "description": "Four educators in Broward County, Florida, died within 24 hours of each other from Covid-19 related complications, the president of the Broward Teachers Union told CNN affiliate WFOR.", "url": "https://www.cnn.com/2021/08/13/us/broward-county-florida-covid-deaths/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813134321-01-fl-broward-county-school-buses-file-restricted-super-tease.jpg", "publishedAt": "2021-08-13T13:25:44Z", "content": "(CNN)Four educators in Broward County, Florida, died within 24 hours of each other from Covid-19 related complications, local education officials said. \r\n\"Within a 24-hour span, we had an assistant t… [+1917 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "The civil suit against Prince Andrew has wider implications for the British royal family", "description": "The Queen was welcomed back to her beloved Scottish estate, Balmoral Castle, Monday for her annual summer residency Monday. Less than 24 hours later, Britain's royal family was dragged back into crisis as it emerged Prince Andrew was being sued.", "url": "https://www.cnn.com/2021/08/13/uk/royal-news-newsletter-08-13-21-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812194759-01-royal-newsletter-0813-super-tease.jpg", "publishedAt": "2021-08-13T13:11:06Z", "content": "A version of this story appeared in the August 13 edition of CNN's Royal News, a weekly dispatch bringing you the inside track on the royal family, what they are up to in public and what's happening … [+10616 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Olympic silver medalist Chijindu Ujah provisionally suspended for doping violation", "description": "British sprinter Chijindu Ujah, who won a silver medal in the 4x100m relay at the Tokyo Olympics last week, has been provisionally suspended for a doping violation, the Athletics Integrity Unit (AIU) announced on Thursday.", "url": "https://www.cnn.com/2021/08/13/sport/chijindu-ujah-provisionally-suspended-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813070139-chijindu-ujah-tokyo-olympics-super-tease.jpg", "publishedAt": "2021-08-13T12:57:57Z", "content": "(CNN)British sprinter Chijindu Ujah, who won a silver medal in the 4x100m relay at the Tokyo Olympics last week, has been provisionally suspended for a doping violation, the Athletics Integrity Unit … [+916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Emily Parker for CNN Business Perspectives", "title": "Central bank digital currencies are coming. The US must be prepared", "description": "We may soon be living in a CBDC world. And if America stays on the sidelines, it could miss its chance to influence what that world looks like.", "url": "https://www.cnn.com/2021/08/13/perspectives/central-bank-digital-currencies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812154113-china-central-bank-digital-currency-restricted-super-tease.jpg", "publishedAt": "2021-08-13T12:17:42Z", "content": "Emily Parker is managing director at CoinDesk and a former policy advisor at the US State Department and writer/editor at The Wall Street Journal. She is author of \"Now I Know Who My Comrades Are: Vo… [+4551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the Covid-19 pandemic in the US", "description": "The Delta variant is wreaking havoc through much of the US, and an internal CDC document shows it spreads as easily as chickenpox. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-13-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-08-13T12:04:25Z", "content": "An Arkansas father of a 1-year-old hospitalized due to Covid-19 pleaded with people to get vaccinated, so other babies dont need to suffer like his son. \r\nKyle Butrum said the hardest part of their s… [+1984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lucy Sherriff, CNN", "title": "Piranhas and pink dolphins lure visitors to remote Lake Tarapoto", "description": "Pink dolphins, piranhas and black caiman. It sounds like the stuff of legend, but in fact they're the inhabitants of a protected wetlands system in the Amazon, home to thousands of rare animal species and fascinating tales of tribal gods turning men into dolp…", "url": "https://www.cnn.com/travel/article/lake-tarapoto-colombia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812102256-02-lake-tarapoto-colombia-travel-super-tease.jpg", "publishedAt": "2021-08-13T11:38:11Z", "content": "(CNN) Pink dolphins, piranhas and black caiman. It sounds like the stuff of legend, but in fact they're the inhabitants of a protected wetlands system in the Amazon, home to thousands of rare animal … [+6908 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona and Manu Raju", "title": "A tale of two Kentuckians: Paul and McConnell diverge as Covid cases rise", "description": "Sen. Rand Paul just got temporarily kicked off YouTube for an inaccurate tirade against masks.", "url": "https://www.cnn.com/2021/08/13/politics/rand-paul-mitch-mcconnell-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812182711-rand-paul-mcconnell-split-super-169.jpg", "publishedAt": "2021-08-13T10:44:54Z", "content": "Sen. Rand Paul just got temporarily kicked off YouTube for an inaccurate tirade against masks. \r\nSen. Mitch McConnell, meanwhile, has been airing ads that urge people to go out and get the vaccine.\r\n… [+6409 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "How extreme weather is making food more expensive", "description": "Devastating heat. Debilitating droughts. Crippling frost. Extreme weather is creating nightmares for farmers around the world -- and making food more expensive for Americans.", "url": "https://www.cnn.com/2021/08/13/business/food-prices-inflation-climate-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812104139-brazil-coffee-price-0804-restricted-super-tease.jpg", "publishedAt": "2021-08-13T10:37:34Z", "content": "I've never seen anything like this -- where everything is bid to the moon at the same time.\"\r\nRobert Yawger, Mizuho Securities"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Shinskey, Royal Holloway University of London", "title": "This is why we can't remember our early childhood memories", "description": "Many of us can't remember much of our childhood before the age of 7, which is known as \"childhood amnesia.\" Here are some the reasons why.", "url": "https://www.cnn.com/2021/08/13/health/childhood-memories-partner-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810142949-baby-playing-with-toys-restricted-super-tease.jpg", "publishedAt": "2021-08-13T10:37:08Z", "content": "The views expressed in this commentary are solely those of the writers. CNN is showcasing the work of The Conversation, a collaboration between journalists and academics to provide news analysis and … [+6282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "How to choose a therapist who will be the best fit for you", "description": "If you have been thinking about getting some help to deal with stress or an emotional or behavioral problem, here are expert-based tips on how to get the best \"fit\" in the therapist you choose.", "url": "https://www.cnn.com/2021/08/13/health/how-to-choose-therapist-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805164533-stressed-adult-stock-super-tease.jpg", "publishedAt": "2021-08-13T10:31:11Z", "content": "(CNN)A never-ending pandemic: Death, dying, sickness, masks, school is back, but is it safe? Is it a cold or Covid? Job losses, looming evictions, political fur flying -- the types of stressors we ar… [+8148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for August 13: Census, Covid, Afghanistan, migrants, Britney Spears", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/08/13/us/five-things-august-13-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812210535-2020-us-census-file-super-tease.jpg", "publishedAt": "2021-08-13T10:28:01Z", "content": "(CNN)The first child tax credit from the IRS seems to have had a big impact on American families. If you got one, you may want to check your account -- the second installment is scheduled for today. … [+6428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deidre McPhillips and Naomi Thomas, CNN", "title": "Covid-19 hospitalizations are surging again, but they're different this time", "description": "Covid-19 hospitalizations in the US have been growing for more than a month, and at the current pace -- more than 2,500 patients added each day over the past week, according to data from the US Department of Health and Human Services -- the US will surpass Ja…", "url": "https://www.cnn.com/2021/08/13/health/covid-hospitalizations-younger-not-vaccinated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811212922-covid-hospital-louisiana-0810-super-tease.jpg", "publishedAt": "2021-08-13T10:26:09Z", "content": "(CNN)Covid-19 hospitalizations in the United States have been growing for more than a month, and at the current pace -- more than 2,500 patients added each day over the past week, according to data f… [+7027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Daniella Diaz", "title": "House Democratic moderates threaten Pelosi's strategy and demand immediate vote on infrastructure bill", "description": "Nine Democratic House moderates are threatening to withhold their support for their party's must-pass budget resolution until Speaker Nancy Pelosi changes course and instead allows their chamber to first vote on the $1.2 trillion bipartisan infrastructure pla…", "url": "https://www.cnn.com/2021/08/13/politics/house-moderate-democrats-infrastructure-strategy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731014012-01-nancy-pelosi-0730-super-169.jpg", "publishedAt": "2021-08-13T10:23:00Z", "content": "Nine Democratic House moderates are threatening to withhold their support for their partys must-pass budget resolution until Speaker Nancy Pelosi changes course and instead allows their chamber to fi… [+3863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Maria Barry-Jester, KHN", "title": "Sewage is the latest disease detection tool for Covid-19 -- and more", "description": "Hundreds of college campuses, cities and counties around California and the U.S. are exploring sewers for the newest data stream to track covid and other infectious diseases.", "url": "https://www.cnn.com/2021/08/13/health/wastewater-covid-disease-detection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811160521-wastewater-sampling-covid-oakland-super-tease.jpg", "publishedAt": "2021-08-13T10:22:43Z", "content": "(KHN)Since reopening campus at the University of California-San Diego last summer, university officials have relied on the tried-and-true public health strategies of testing and contact tracing. But … [+9206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi and Rebekah Riess", "title": "New Orleans will require proof of vaccination or a negative Covid-19 test to enter certain indoor venues", "description": "People in New Orleans will be required to show either proof of vaccination or a recent negative Covid-19 test to enter certain indoor places starting Monday, according to the city.", "url": "https://www.cnn.com/2021/08/13/us/new-orleans-vaccination-proof/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813032439-new-orleans-0811-super-169.jpg", "publishedAt": "2021-08-13T10:19:27Z", "content": "People in New Orleans will be required to show either proof of vaccination or a recent negative Covid-19 test to enter certain indoor places starting Monday, according to the city. \r\nThe new rule wil… [+2746 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "US Capitol riot judges step up as the conscience of democracy while lawmakers squabble", "description": "A \"disgrace to our country.\" \"The tyranny we rejected.\" \"An embarrassment to every American.\"", "url": "https://www.cnn.com/2021/08/13/politics/judges-riot-court-describe-january-6-chilling-disgrace-tyranny/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200220133040-03-roger-stone-sentencing-sketch-0220-super-tease.jpg", "publishedAt": "2021-08-13T10:03:11Z", "content": "(CNN)A \"disgrace to our country.\" \"The tyranny we rejected.\" \"An embarrassment to every American.\" \r\nIn presiding over the cases of hundreds of people accused of breaching the US Capitol on January 6… [+8422 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Text by Will Noble; video by Max Burnell, CNN", "title": "The hovercraft that kept on going", "description": "Gigantic hovercrafts once carried hundreds of passengers and cars across the English channel on a cushion of air, now there's only one place left on the planet that the public can ride this unusual mode of transport all year round.", "url": "https://www.cnn.com/travel/article/uk-last-hovercraft-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811123410-hovercraft-hover-travel-2-super-tease.jpg", "publishedAt": "2021-08-13T10:02:17Z", "content": "Text by Will Noble; video by Max Burnell, CNNPublished 13th August 2021\r\nSouthsea, England (CNN) On October 1, 2000, the skirts of Princess Anne and Princess Margaret deflated for the final time. The… [+9420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Williams, Natasha Bertrand and Alex Marquardt, CNN", "title": "New intel reports indicate fresh efforts by Russia to interfere in 2022 election", "description": "The Biden administration is receiving regular intelligence reports indicating Russian efforts to interfere in US elections are evolving and ongoing, current and former officials say, and in fact, never stopped, despite President Joe Biden's warnings to Russia…", "url": "https://www.cnn.com/2021/08/13/politics/intel-report-russia-election-interference-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709220100-biden-putin-super-tease.jpg", "publishedAt": "2021-08-13T10:02:13Z", "content": "Washington (CNN)The Biden administration is receiving regular intelligence reports indicating Russian efforts to interfere in US elections are evolving and ongoing, current and former officials say, … [+7500 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "How two long-term Biden aides led efforts to court Republicans ahead of the Senate infrastructure deal", "description": "In touting the $1.2 trillion infrastructure bill hours after it passed the Senate with 19 Republican votes on Tuesday, President Joe Biden took a moment to needle his critics.", "url": "https://www.cnn.com/2021/08/13/politics/biden-aides-court-republicans-infrastructure-deal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811152502-07-wh-infrastructure-ricchetti-terrell-super-tease.jpg", "publishedAt": "2021-08-13T10:00:56Z", "content": "Washington (CNN)In touting the $1.2 trillion infrastructure bill hours after it passed the Senate with 19 Republican votes on Tuesday, President Joe Biden took a moment to needle his critics. \r\n\"From… [+14438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Phil Mattingly, Kylie Atwood and Jennifer Hansler, CNN", "title": "Afghanistan's quick unraveling jolts national security officials and threatens to stain Biden's legacy", "description": "The security situation in Afghanistan has deteriorated faster than President Joe Biden and his most senior national security officials had anticipated, leaving the White House rushing to stave off the worst effects of a Taliban takeover.", "url": "https://www.cnn.com/2021/08/13/politics/biden-legacy-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812072501-us-military-afghanistan-biden-0502-file-restricted-super-tease.jpg", "publishedAt": "2021-08-13T10:00:14Z", "content": "(CNN)The security situation in Afghanistan has deteriorated faster than President Joe Biden and his most senior national security officials had anticipated, leaving the White House rushing to stave o… [+11182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/tara-john\">Tara John</a> and <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, CNN", "title": "Afghanistan's second largest city falls to Taliban", "description": null, "url": "https://www.cnn.com/world/live-news/afghanistan-taliban-us-troops-intl-08-13-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811133918-afhan-security-forces-super-tease.jpg", "publishedAt": "2021-08-13T09:20:22Z", "content": "The Taliban has taken control of the city of Kandahar, Afghanistan's second-largest city, Afghan Member of Parliament Gul Ahmad Kamin told CNN on Friday.\r\nThe Taliban said in a statement Friday that … [+464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Giovanni Prati, CNN", "title": "This Dubai-based company wants to revolutionize how ports operate", "description": "In Dubai's Jebel Ali port, DP World is testing its \"BoxBay\" technology, which aims to speed up and automate the way shipping containers are stored, moved and shipped.", "url": "https://www.cnn.com/2021/08/13/middleeast/dubai-dp-world-boxbay-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812121239-box-bay-dp-world-wide-super-tease.jpg", "publishedAt": "2021-08-13T08:56:26Z", "content": "Dubai (CNN)In Dubai's Jebel Ali port, a new technology is being tested that aims to speed up, improve and automate the way shipping containers are stored, moved and shipped. \r\nTypically, at major por… [+2589 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Diksha Madhok", "title": "Amazon shifts 'Lord of the Rings' production to UK from New Zealand", "description": "Middle-Earth is moving from New Zealand to the United Kingdom.", "url": "https://www.cnn.com/2021/08/13/media/amazon-lord-of-the-rings-hnk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813033930-the-lord-of-the-rings-amazon-super-169.jpg", "publishedAt": "2021-08-13T08:52:04Z", "content": "Middle-Earth is moving from New Zealand to the United Kingdom.\r\nAmazon Studios announced Thursday that it is moving the filming of the second season of its highly anticipated, and extremely expensive… [+2490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He, CNN Business", "title": "China growth forecasts slashed as Delta variant spreads across the country", "description": "China's worst coronavirus outbreak in a year has authorities taking dramatic measures to stamp out new infections. But while locking down cities, canceling flights and suspending trade may bring the virus back under control, those actions risk stalling an alr…", "url": "https://www.cnn.com/2021/08/13/economy/china-economy-delta-impact-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813015716-02-china-economy-covid-impact-restricted-super-tease.jpg", "publishedAt": "2021-08-13T08:38:35Z", "content": "Hong Kong (CNN Business)China's worst coronavirus outbreak in a year has authorities taking dramatic measures to stamp out new infections. But while locking down cities, canceling flights and suspend… [+6672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "$138m Jack Grealish transfer shows it's business as usual for English Premier League's elite", "description": "It wasn't that long ago that six of the English Premier League's biggest teams -- Liverpool, Chelsea, Manchester United, Manchester City, Arsenal and Tottenham -- sparked outrage for signing up to the proposed European Super League (ESL).", "url": "https://www.cnn.com/2021/08/13/football/english-premier-league-new-season-preview-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812124755-01-jack-grealish-manchester-city-0807-super-tease.jpg", "publishedAt": "2021-08-13T07:40:09Z", "content": "(CNN)It wasn't that long ago that six of the English Premier League's biggest teams -- Liverpool, Chelsea, Manchester United, Manchester City, Arsenal and Tottenham -- sparked outrage for signing up … [+6584 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "These 8 states make up half of US Covid-19 hospitalizations. And the surge among the unvaccinated is overwhelming healthcare workers", "description": "With the escalating spread of the more dangerous Covid-19 Delta variant, health officials and experts are racing to mitigate its damage by encouraging vaccinations and mask-wearing.", "url": "https://www.cnn.com/2021/08/13/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813011214-louisiana-hospital-0810-super-tease.jpg", "publishedAt": "2021-08-13T07:35:41Z", "content": "(CNN)With the escalating spread of the more dangerous Covid-19 Delta variant, health officials and experts are racing to mitigate its damage by encouraging vaccinations and mask-wearing. \r\nBut hospit… [+5937 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Every two days, US wildfires are consuming an area the size of Washington, DC. And there's no let up in sight", "description": "The dozens of wildfires that have scorched the western US this summer have consumed on average 30 square miles  —almost half the size of Washington, DC— on a daily basis, the US Drought Monitor said Thursday.", "url": "https://www.cnn.com/2021/08/13/weather/us-western-wildfires-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813001309-05-western-wildfires-0811-montana-super-tease.jpg", "publishedAt": "2021-08-13T07:11:31Z", "content": "(CNN)The dozens of wildfires that have scorched the western US this summer have consumed on average 30 square miles almost half the size of Washington, DC on a daily basis, the US Drought Monitor sai… [+4205 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "China issues new guidelines for face mask wearing amid Delta outbreak", "description": "Chinese health authorities have issued new guidelines upping the requirement of mask wearing for the public -- including in outdoor areas, as the country grapples with its worst resurgence of Covid-19 in more than a year.", "url": "https://www.cnn.com/2021/08/13/china/china-covid-mask-guideline-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813024733-shanghai-outdoor-masks-0806-restricted-super-tease.jpg", "publishedAt": "2021-08-13T07:08:52Z", "content": "Hong Kong (CNN)Chinese health authorities have issued new guidelines upping the requirement of mask wearing for the public -- including in outdoor areas, as the country grapples with its worst resurg… [+3456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, Jessie Yeung and Steve George, CNN", "title": "Beijing has denied taking political hostages. Experts say the fates of two Canadians suggest otherwise", "description": "After spending nearly 1,000 days in a Chinese jail cell, Canadian businessman Michael Spavor has finally received his court verdict — yet there is still no clarity on how much longer he will actually remain behind bars.", "url": "https://www.cnn.com/2021/08/13/china/spavor-kovrig-canada-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812091009-michael-kovrig-michael-spavor-split-super-tease.jpg", "publishedAt": "2021-08-13T06:56:56Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+12898 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward and Brad Lendon, CNN", "title": "Taliban seizes Afghanistan's second-largest city", "description": "The Taliban has taken control of the city of Kandahar, Afghanistan's second-largest city, Afghan Member of Parliament Gul Ahmad Kamin told CNN on Friday, as the insurgent group continues its rapid advancement toward the capital Kabul.", "url": "https://www.cnn.com/2021/08/13/asia/afghanistan-kandahar-falls-taliban-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813005509-01-kandahar-afghanistan-0810-restricted-super-tease.jpg", "publishedAt": "2021-08-13T06:17:22Z", "content": "Kabul, Afghanistan (CNN)The Taliban has taken control of the city of Kandahar, Afghanistan's second-largest city, Afghan Member of Parliament Gul Ahmad Kamin told CNN on Friday, as the insurgent grou… [+3533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter", "title": "Reporters describe 'palpable fear' in Afghanistan as Taliban continues to sweep across the country", "description": "A version of this article first appeared in the \"Reliable Sources\" newsletter.", "url": "https://www.cnn.com/2021/08/13/media/afghanistan-taliban-reliable-sources/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812132653-04-ghazni-afghanistan-0812-taliban-rerstricted-super-169.jpg", "publishedAt": "2021-08-13T04:03:43Z", "content": "A version of this article first appeared in the Reliable Sources newsletter. You can sign up for free right here.\r\nThe US presence in Afghanistan, often lamented as the forgotten war, is front of min… [+5070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN and Serenitie Wang, CNN", "title": "Robot pandas and board shorts: Chinese military launches aircraft carrier clothing line", "description": "China's military is honoring its first domestically designed and built aircraft carrier, the Shandong, with a collection of T-shirts, jackets, coveralls and shorts.", "url": "https://www.cnn.com/style/article/china-aircraft-carrier-clothing-line-intl-hnk-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812222819-05-china-aircraft-carrier-clothing-line-super-tease.jpg", "publishedAt": "2021-08-13T04:03:31Z", "content": "Aircraft carriers are kind ofcool. Anybody who's ever seen \"Top Gun\" can attest to that.\r\nBut only a few of the world's navies have the industrial and technological capabilities to build them. In 201… [+2982 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson", "title": "How the 2020 census explains Donald Trump", "description": "Donald Trump got it. Years before long-awaited 2020 census data published Thursday showed a dramatic picture of a less-White, more diverse, less rural, more metropolitan nation, the ex-President built a political apparatus on the idea that America's tradition…", "url": "https://www.cnn.com/2021/08/13/politics/how-the-2020-census-explains-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811193752-trump-super-169.jpg", "publishedAt": "2021-08-13T04:01:08Z", "content": "Donald Trump got it.\r\nYears before long-awaited 2020 census data published Thursday showed a dramatic picture of a less-White, more diverse, less rural, more metropolitan nation, Trump built a politi… [+9686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Paton Walsh, CNN", "title": "Belarus floods the European Union with migrants, taking a page out of Putin's playbook", "description": "European officials accuse Belarus' authoritarian regime of allowing growing numbers of migrants to cross the border into Lithuania unimpeded as part of a high-stakes game with the European Union.", "url": "https://www.cnn.com/2021/08/13/europe/belarus-lithuania-border-migrants-eu-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804095432-01-cnn-belarus-migrants-lithuania-super-tease.jpg", "publishedAt": "2021-08-13T04:00:48Z", "content": "Near Pokonys, Lithuania-Belarus border (CNN)Desperate, frightened and begging for help, they emerge from the darkness: a group of Yazidi migrants, lost in the forests of eastern Europe. \r\nIt's a surr… [+8099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Emma Tucker and Omar Jimenez", "title": "Behind police leaders claims that bail reform is responsible for surge in violence", "description": "\"It is an outrage,\" wrote Chicago Police Superintendent David Brown.", "url": "https://www.cnn.com/2021/08/12/us/police-leaders-bail-reform-violence-surge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812234403-bail-bonds-sign-file-super-169.jpg", "publishedAt": "2021-08-13T03:47:00Z", "content": "It is an outrage, wrote Chicago Police Superintendent David Brown.\r\nHis statement was in reaction to a federal judges decision to release the man accused of supplying the gun that was used to fatally… [+10041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson and Rebekah Riess, CNN", "title": "Two Georgia coaches have been charged with second-degree murder in the heat-related death of a 16-year-old", "description": "Two Atlanta-area high-school basketball coaches have been charged with second-degree murder after the heat-related death of a 16-year-old in August 2019, according to court records.", "url": "https://www.cnn.com/2021/08/12/us/georgia-coaches-charged-2019-death-of-16-year-old-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812221503-imani-bell-super-tease.jpg", "publishedAt": "2021-08-13T03:16:07Z", "content": "(CNN)Two Atlanta-area high-school basketball coaches have been charged with second-degree murder after the heat-related death of a 16-year-old in August 2019, according to court records.\r\nImani Bell … [+3129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 40 photos", "description": "Take a look at 40 photos of the week from August 5 to August 12.", "url": "https://www.cnn.com/2021/08/12/world/gallery/photos-this-week-august-5-august-12/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812182346-01-photos-this-week-0812-restricted-super-tease.jpg", "publishedAt": "2021-08-13T03:08:39Z", "content": "Open Menu\r\nprevious image\r\nnext image\r\nNew York Gov. Andrew Cuomo prepares to board a helicopter after he announced his resignation on Tuesday, August 10. The announcement came a week after New York … [+9140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sophia Saifi and Ben Westcott, CNN", "title": "Pakistan's foreign minister blames Afghanistan and India for suicide attack on Chinese workers", "description": "Pakistan's foreign minister has accused India and Afghanistan of backing a suicide bombing which killed nine Chinese workers on July 14, and called for the remaining perpetrators to be handed over to Islamabad for trial.", "url": "https://www.cnn.com/2021/08/12/asia/china-pakistan-india-afghanistan-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812213207-pakistan-bus-blast-0714-restricted-super-tease.jpg", "publishedAt": "2021-08-13T03:06:11Z", "content": "Islamabad, Pakistan (CNN)Pakistan's foreign minister has accused India and Afghanistan of backing a suicide bombing which killed nine Chinese workers on July 14, and called for the remaining perpetra… [+3011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sophia Saifi and Ben Westcott, CNN", "title": "Pakistan's foreign minister blames Afghanistan and India for suicide attack on Chinese workers", "description": "Pakistan's foreign minister has accused India and Afghanistan of backing a suicide bombing which killed nine Chinese workers on July 14, and called for the remaining perpetrators to be handed over to Islamabad for trial.", "url": "https://www.cnn.com/2021/08/12/asia/china-pakistan-india-afghanistan-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812213207-pakistan-bus-blast-0714-restricted-super-tease.jpg", "publishedAt": "2021-08-13T03:06:11Z", "content": "Islamabad, Pakistan (CNN)Pakistan's foreign minister has accused India and Afghanistan of backing a suicide bombing which killed nine Chinese workers on July 14, and called for the remaining perpetra… [+3011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sara Stewart", "title": "Opinion: I didn't expect a Nicolas Cage movie to be the voice of this moment. I was wrong", "description": "Of all 2021's surprises, a movie delivering gentle, minimally violent emotional catharsis and starring Nicolas Cage has to be one of the strangest. The plot of the new movie \"Pig,\" released on video on demand last week, sounds like a \"John Wick\" riff: A reclu…", "url": "https://www.cnn.com/2021/08/12/opinions/nicolas-cage-pig-movie-stewart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812190837-nicholas-cage-pig-super-tease.jpg", "publishedAt": "2021-08-13T02:44:23Z", "content": "Sara Stewart is a film and culture writer who lives in western Pennsylvania. The views expressed here are solely the author's own. View more opinion articles on CNN. The op-ed below contains spoilers… [+5046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Heavy floods hit northwest Turkey killing 17 people", "description": "Seventeen people were killed in flash floods in Turkey's Black Sea region on Thursday that sent water and debris cascading through streets, damaged bridges and ripped up roads in the second natural disaster to strike the country this month.", "url": "https://www.cnn.com/2021/08/12/world/turkey-flash-floods-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812211122-02-flash-floods-northern-turkey-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-13T02:00:00Z", "content": "Seventeen people were killed in flash floods in Turkey's Black Sea region on Thursday that sent water and debris cascading through streets, damaged bridges and ripped up roads in the second natural d… [+885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yoonjung Seo and Jessie Yeung, CNN", "title": "Disgraced K-pop star Seungri sentenced to three years on prostitution charges", "description": "Former K-pop star Seungri was sentenced to three years in jail on Thursday by a South Korean military court, more than two years after sexual assault allegations first emerged stunning the country.", "url": "https://www.cnn.com/2021/08/12/asia/seungri-kpop-sentenced-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812215559-seungri-2020-file-super-tease.jpg", "publishedAt": "2021-08-13T01:55:04Z", "content": "Seoul (CNN)Former K-pop star Seungri was sentenced to three years in jail on Thursday by a South Korean military court, more than two years after sexual assault allegations first emerged stunning the… [+2269 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy and Jeremy Harlan, CNN", "title": "Colorado secretary of state accuses county clerk's office of assisting QAnon-affiliated leak of voting machine logins", "description": "In announcing the revoking of some Mesa County voting machines -- their logins appeared in a video by an individual affiliated with QAnon -- Colorado Secretary of State Jena Griswold on Thursday also accused the county's clerk, Tina Peters, of assisting in th…", "url": "https://www.cnn.com/2021/08/12/politics/colorado-qanon-voting-machine-login-leak/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812201630-jena-griswold-presser-0812-super-tease.jpg", "publishedAt": "2021-08-13T01:42:54Z", "content": "(CNN)In announcing the revoking of some Mesa County voting machines -- their logins appeared in a video by an individual affiliated with QAnon -- Colorado Secretary of State Jena Griswold on Thursday… [+5983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Second libel case against journalist Maria Ressa dismissed by Philippine court", "description": "A Philippine court has dismissed a libel case against Maria Ressa, a lawyer said on Thursday, one of several lawsuits filed against the journalist who says she has been targeted because of her news site's critical reports on President Rodrigo Duterte.", "url": "https://www.cnn.com/2021/08/12/media/philippine-court-dismiss-libel-case-maria-ressa-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812203136-maria-ressa-030421-super-tease.jpg", "publishedAt": "2021-08-13T01:18:34Z", "content": "(CNN)A Philippine court has dismissed a libel case against Maria Ressa, a lawyer said on Thursday, one of several lawsuits filed against the journalist who says she has been targeted because of her n… [+1725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christobel Hastings, CNN", "title": "Why is Friday the 13th unlucky? The cultural origins of an enduring superstition", "description": "When it comes to bad luck, there are few superstitions as pervasive in Western culture as that of Friday the 13th. Here's why.", "url": "https://www.cnn.com/style/article/why-friday-13-unlucky-explained/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805114203-05-friday-the-13-history-super-tease.jpg", "publishedAt": "2021-08-13T01:09:53Z", "content": "artsPublished 13th August 2021\r\nWhen it comes to bad luck, there are few superstitions as pervasive in Western culture as that of Friday the 13th. Like crossing paths with a black cat and breaking a … [+7255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Laura Ly, CNN", "title": "Los Angeles judge dismisses sexual battery charge against Harvey Weinstein", "description": "Weinstein has pleaded not guilty to the sexual assault charges against him in Los Angeles.", "url": "https://www.cnn.com/2021/08/12/us/harvey-weinstein-sexual-battery-charge-dismissed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729145929-harvey-weinstein-los-angeles-07-29-2021-super-tease.jpg", "publishedAt": "2021-08-13T00:38:11Z", "content": "(CNN)A Los Angeles County judge has dismissed one of the 11 charges in an indictment of Harvey Weinstein, according to Greg Risling, spokesman for the Los Angeles County District Attorney's office.\r\n… [+1473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "The US has seen a 1,200% increase in orders for monoclonal antibodies to treat Covid-19, HHS says", "description": "As coronavirus case numbers spike, the US has seen a 1,200% increase in orders for monoclonal antibody treatments in the past month, the US Health and Human Services Department told CNN Thursday. About 75% of the orders are coming from regions of the US that …", "url": "https://www.cnn.com/2021/08/12/health/covid-19-antibody-treatments-1200-increase-in-orders/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200814213249-laboratorio-mabxience-argentina-vacuna-de-la-universidad-de-oxford-y-astrazeneca-super-169.jpg", "publishedAt": "2021-08-12T23:52:22Z", "content": "As coronavirus case numbers spike, the US has seen a 1,200% increase in orders for monoclonal antibody treatments in the past month, the US Health and Human Services Department told CNN Thursday. Abo… [+4348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray, Jeff Simon and Alex Rogers, CNN", "title": "Pennsylvania congressman aided Trump effort to flip Justice Department on Big Lie", "description": "While other Republicans garnered more attention in attempting to convince the country that the 2020 election was stolen from former President Donald Trump, Rep. Scott Perry made the critical connection linking the then-president to Jeffrey Clark, a little-kno…", "url": "https://www.cnn.com/2021/08/12/politics/scott-perry-justice-department-big-lie/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812114115-rep-scott-perry-file-restricted-super-tease.jpg", "publishedAt": "2021-08-12T23:44:50Z", "content": "(CNN)While other Republicans garnered more attention in attempting to convince the country that the 2020 election was stolen from former President Donald Trump, Rep. Scott Perry made the critical con… [+6831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Boyette, CNN", "title": "A parent sent their child to school after a positive Covid-19 test. More than 80 students may have been exposed, officials say", "description": "More than 80 students were potentially exposed to Covid-19 on the first day of class in Reno, Nevada, on Monday after a parent sent their child to Marce Herz Middle School, despite both the parent and child receiving a positive Covid-19 test just two days ear…", "url": "https://www.cnn.com/2021/08/12/us/reno-nevada-school-covid-exposure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812180401-marce-herz-middle-school-super-tease.jpg", "publishedAt": "2021-08-12T23:41:44Z", "content": "(CNN)More than 80 students were potentially exposed to Covid-19 on the first day of class in Reno, Nevada, on Monday after a parent sent their child to Marce Herz Middle School, despite both the pare… [+2076 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Justin Gest", "title": "The Census shows the GOP base is shrinking fast. So why does its power seem secure?", "description": "Justin Gest writes that even though the latest US Census data reveals the diversification of America, which on the surface would suggest a bleak future for the Republican Party, demographic trends actually favor the GOP because of the way political power is a…", "url": "https://www.cnn.com/2021/08/12/opinions/us-census-republican-party-power-gest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812191250-vote-republican-sign-file-super-tease.jpg", "publishedAt": "2021-08-12T23:35:28Z", "content": "Justin Gest (@_JustinGest) is an associate professor at George Mason University's Schar School of Policy and Government. He is the author of \"The New Minority: White Working Class Politics in an Age … [+7303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul Begala", "title": "Opinion: Rand Paul's awful week", "description": "The 'dog ate my disclosure form' excuse for failing to report for 16 months his wife's purchase of stock in a company that makes a Covid treatment is merely a coda to a symphony of simpering coming from Paul and other Republicans, writes Paul Begala. It gets …", "url": "https://www.cnn.com/2021/08/12/opinions/rand-paul-covid-whining-begala/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812180229-rand-paul-for-oped-super-tease.jpg", "publishedAt": "2021-08-12T22:47:48Z", "content": "Paul Begala, a Democratic strategist and CNN political commentator, was a political consultant for Bill Clinton's presidential campaign in 1992 and served as a counselor to Clinton in the White House… [+5613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Lauren Dezenski, CNN", "title": "Most Americans support $1.2T infrastructure bill, poll finds", "description": "A new poll finds most Americans back the infrastructure deal, which is more good news for proponents of the package that cleared the Senate with bipartisan support this week.", "url": "https://www.cnn.com/2021/08/12/politics/bipartisan-infrastructure-bill-poll-support/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810154230-07-biden-harris-remarks-0810-super-tease.jpg", "publishedAt": "2021-08-12T22:30:51Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Amara Walker, CNN", "title": "Parents clash at mask mandate protest in Georgia county where 5th graders were sent home", "description": "Tense confrontations, yelling and accusations of spitting were seen Thursday as parents gathered for a protest over mask mandates at a school district office in Marietta, Georgia, just outside Atlanta.", "url": "https://www.cnn.com/2021/08/12/us/cobb-county-schools-mask-mandate-protest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812170619-03-cobb-county-schools-mask-protest-081221-super-tease.jpg", "publishedAt": "2021-08-12T22:25:39Z", "content": "Marietta, Georgia (CNN)Tense confrontations, yelling and accusations of spitting were seen Thursday as parents gathered for a protest over mask mandates at a school district office near Atlanta. \r\nTh… [+2140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "Opinion: Biden deserves blame for the Afghanistan debacle", "description": "Peter Bergen writes that President Joe Biden is presiding over a debacle entirely of his own making in Afghanistan -- and one that has unfolded more swiftly than even the most dire prognostications.", "url": "https://www.cnn.com/2021/08/12/opinions/afghanistan-president-biden-debacle-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708143551-02-biden-afghanistan-remarks-0708-super-tease.jpg", "publishedAt": "2021-08-12T22:23:01Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen has reported from Afghanistan since 1993. His new book… [+5796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore", "title": "Nikola gets $2 million federal grant, even as founder faces criminal charges", "description": "Electric truck maker Nikola said Thursday it was approved for a $2 million grant from the Energy Department — news that comes despite the fact that the company's founder and largest shareholder faces federal criminal charges for deceiving shareholders.", "url": "https://www.cnn.com/2021/08/12/business/nikola-federal-grant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812151605-01-trevor-milton-nikola-indictment-0729-restricted-super-169.jpg", "publishedAt": "2021-08-12T21:50:57Z", "content": "Electric truck maker Nikola said Thursday it was approved for a $2 million grant from the Energy Department news that comes despite the fact that the companys founder and largest shareholder faces fe… [+2705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "TikTok disables late-night notifications for teens as part of new safety measures", "description": "To promote positive digital habits -- and perhaps help parents enforce bedtimes -- TikTok says accounts for children between ages 13-15 will not receive push notifications after 9 p.m.", "url": "https://www.cnn.com/2021/08/12/business/tiktok-child-safety-measures/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210609174222-tiktok-logo-super-169.jpg", "publishedAt": "2021-08-12T21:41:59Z", "content": "TikTok wont send younger teens late-night notifications as part of a series of child safety measures announced Thursday.\r\nTo promote positive digital habits and perhaps help parents enforce bedtimes … [+2388 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar", "title": "Facebook pushes its office reopening to 2022", "description": "Facebook is the latest tech company to delay its employees' return to the office until next year as the Delta variant wreaks havoc on reopening plans around the country.", "url": "https://www.cnn.com/2021/08/12/tech/facebook-return-to-office-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210506191342-facebook-menlo-park-california-file-restricted-super-169.jpg", "publishedAt": "2021-08-12T21:32:09Z", "content": "Facebook is the latest tech company to delay its employees return to the office until next year as the Delta variant wreaks havoc on reopening plans around the country. \r\nData, not dates, is what dri… [+1142 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "Influential tech CEO Rebecca Enonchong detained in Cameroon", "description": "Rebecca Enonchong, a Cameroonian tech entrepreneur, has been arrested and brought before a court in Douala, in Cameroon's Littoral Region, according to her lawyer and another close associate.", "url": "https://www.cnn.com/2021/08/12/africa/cameroon-detains-rebecca-enonchong-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812102756-rebecca-enonchong-super-tease.jpg", "publishedAt": "2021-08-12T21:30:35Z", "content": "(CNN)Rebecca Enonchong, a Cameroonian tech entrepreneur, has been arrested and brought before a court in Douala, in Cameroon's Littoral Region, according to her lawyer and another close associate.\r\nE… [+2532 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France And Chloe Melas", "title": "Jamie Spears steps down as Britney Spears' conservator", "description": "After months of public pressure from supporters of Britney Spears, Jamie Spears, the singer's father, signaled in a legal response Thursday that intends to step down as conservator of the singer's estate, according to a prepared copy of the response obtained …", "url": "https://www.cnn.com/2021/08/12/entertainment/jamie-spears-britney-spears-conservartorship/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210209123502-jamie-spears-britney-father-2008-super-tease.jpg", "publishedAt": "2021-08-12T21:28:46Z", "content": "(CNN)After months of public pressure from supporters of Britney Spears, Jamie Spears, the singer's father, signaled in a legal response Thursday that intends to step down as conservator of the singer… [+2073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Kent, CNN", "title": "Multiple fatalities in 'serious firearms incident' in England", "description": "A number of people have died at the scene of a \"serious firearms incident\" on Thursday in Plymouth, southwest England, according to a police statement.", "url": "https://www.cnn.com/2021/08/12/uk/plymouth-england-shooting-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812170553-plymouth-shooting-uk-map-super-tease.jpg", "publishedAt": "2021-08-12T21:16:36Z", "content": "London (CNN)A number of people have died at the scene of a \"serious firearms incident\" on Thursday in Plymouth, southwest England, according to a police statement.\r\nThe incident is not being treated … [+1162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Moira Ritter", "title": "Disney earnings exceed expectations as parks reopen and Disney+ grows", "description": "Theme parks are back, and that's good news for Disney, which reported better-than-expected earnings Thursday.", "url": "https://www.cnn.com/2021/08/12/media/disney-earnings-q3-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812122044-02-disney-anaheim-060621-restricted-super-169.jpg", "publishedAt": "2021-08-12T20:45:59Z", "content": "Theme parks are back, and thats good news for Disney, which reported better-than-expected earnings Thursday.\r\nThe company brought in $17 billion in sales, up 45% from same period last year. Thats a b… [+1728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "The bipartisan infrastructure bill takes on hot car deaths, but advocates say the effort isn't enough", "description": "The bipartisan infrastructure bill that passed the US Senate this week would require new motor vehicles to have an alert system that would remind people not to leave their child or pet in the backseat. Some say the rule doesn't go far enough.", "url": "https://www.cnn.com/2021/08/12/us/hot-car-deaths-infrastructure-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810231606-child-death-hot-car-fairfax-screengrab-super-tease.jpg", "publishedAt": "2021-08-12T20:40:42Z", "content": "(CNN)The bipartisan infrastructure bill that passed the US Senate this week would require new motor vehicles to have an alert system that would remind people not to leave their child or pet in the ba… [+5728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "Rachel Maddow is thinking about leaving MSNBC and starting her own media venture", "description": "Rachel Maddow, the highest-rated host on MSNBC, has held talks about leaving the cable news channel and launching her own new media ventures, according to sources who have spoken with her.", "url": "https://www.cnn.com/2021/08/12/media/rachel-maddow-msnbc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812140611-restricted-rachel-maddow-03-02-2020-super-tease.jpg", "publishedAt": "2021-08-12T20:18:14Z", "content": "New York (CNN Business)Rachel Maddow, the highest-rated host on MSNBC, has held talks about leaving the cable news channel and launching her own new media ventures, according to sources who have spok… [+2033 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Respect' spells out an earnest Aretha Franklin tribute as a showcase for Jennifer Hudson", "description": "Earnest to a fault, \"Respect\" spells out a handsome tribute to Aretha Franklin, with Jennifer Hudson and her peerless singing pipes as its formidable anchor. Yet this biography never fully sparks to life, as the Queen of Soul fights in episodic fashion to est…", "url": "https://www.cnn.com/2021/08/12/entertainment/respect-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811124943-jennifer-hudson-respect-super-tease.jpg", "publishedAt": "2021-08-12T20:11:37Z", "content": "(CNN)Earnest to a fault, \"Respect\" spells out a handsome tribute to Aretha Franklin, with Jennifer Hudson and her peerless singing pipes as its formidable anchor. Yet this biography never fully spark… [+3108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "US encounters 'unprecedented' number of migrants at southern border, Homeland Security chief says", "description": "The Biden administration is facing a \"serious challenge\" at the US southern border, Homeland Security Secretary Alejandro Mayorkas said Thursday, saying the US has encountered an \"unprecedented\" number of migrants illegally crossing the border.", "url": "https://www.cnn.com/2021/08/12/politics/us-mexico-border-migrants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802190805-texas-border-migrants-0709-super-tease.jpg", "publishedAt": "2021-08-12T20:01:00Z", "content": "(CNN)The Biden administration is facing a \"serious challenge\" at the US southern border, Homeland Security Secretary Alejandro Mayorkas said Thursday, saying the US has encountered an \"unprecedented\"… [+3692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Tapfumaneyi, Lauren Kent and Tim Lister, CNN", "title": "Social media and messaging apps appeared to be shut down in Zambia on election day, Facebook says", "description": "Social media and messaging apps, including Facebook, Instagram, WhatsApp, and Twitter, appeared to be shutdown in Zambia on Thursday as the country voted in presidential and parliamentary elections, according to a Facebook spokesperson.", "url": "https://www.cnn.com/2021/08/12/africa/zambia-election-social-media-blackout-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812102605-01-zambia-election-0812-super-tease.jpg", "publishedAt": "2021-08-12T19:47:34Z", "content": "(CNN)Social media and messaging apps, including Facebook, Instagram, WhatsApp, and Twitter, appeared to be shutdown in Zambia on Thursday as the country voted in presidential and parliamentary electi… [+1583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Why AirTags are a must-have school supply this year", "description": "Move-in day is fast approaching for college students across the country. And while a smartphone, tablet and laptop are all necessities, we have one other item to add to your list: Apple's AirTag.", "url": "https://www.cnn.com/2021/08/12/cnn-underscored/bluetooth-tracker-for-school-airtags/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210421200433-7-apple-airtags-review-underscored-super-169.jpg", "publishedAt": "2021-08-12T19:35:54Z", "content": "Move-in day is fast approaching for college students across the country. And while a smartphone, tablet and laptop are all necessities, we have one other item to add to your list: Apples AirTag. \r\nSo… [+6735 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Donald Judd, CNN", "title": "Biden on anti-mask ordinances: 'This isn't about politics -- this is about keeping our children safe'", "description": "President Joe Biden on Thursday hit out at anti-masking protesters for politicizing the Covid-19 pandemic, saying he was particularly disturbed by scenes at a school board meeting in Tennessee earlier this week.", "url": "https://www.cnn.com/2021/08/12/politics/joe-biden-anti-mask-ordinances-prescription-drug-prices/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810152440-06-biden-harris-remarks-0810-super-tease.jpg", "publishedAt": "2021-08-12T19:29:19Z", "content": "(CNN)President Joe Biden on Thursday hit out at anti-masking protesters for politicizing the Covid-19 pandemic, saying he was particularly disturbed by scenes at a school board meeting in Tennessee e… [+5068 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji", "title": "This Virginia school board just passed an inclusive policy for transgender and gender-expansive students", "description": "A Virginia school board whose heated meeting in June gained national attention has voted to expand the rights of its transgender and gender-expansive students.", "url": "https://www.cnn.com/2021/08/12/us/loudoun-transgender-student-policy-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624164339-01-loudoun-county-public-schools-meeting-0622-super-169.jpg", "publishedAt": "2021-08-12T19:25:38Z", "content": "A Virginia school board whose heated meeting in June gained national attentionhas voted to expand the rights of its transgender and gender-expansive students.\r\nThe Loudoun County School Board voted W… [+4457 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Meg Dunn, CNN", "title": "She lost her husband in a tragic accident and then built a community of support that has reached millions", "description": "Michele Neff Hernandez and her non-profit, Soaring Spirits, connect widowed people, allowing them to heal in a community that understands the pain of losing a partner.", "url": "https://www.cnn.com/2021/08/12/us/widows-grief-soaring-spirits-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812111824-cnnheroes-michele-neff-hernandez-super-tease.jpeg", "publishedAt": "2021-08-12T19:22:43Z", "content": "Simi Valley, CA (CNN)In 2005, Michele Neff Hernandez and her husband, Phillip, were enjoying the active life they built as a couple. \r\n\"We hiked. We biked. We ran. We just had such a good time togeth… [+6215 chars]"}]}