{"status": "ok", "totalResults": 151, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi and Lauren Fox, CNN", "title": "Montana GOP congressman blasts Biden effort to resettle Afghan refugees in his state", "description": "A House Republican on Friday publicly pushed back against the Biden administration's plan to resettle Afghan nationals in his home state of Montana and suggested that the refugees are not properly vetted, despite repeated assurances from the Biden administrat…", "url": "https://www.cnn.com/2021/09/17/politics/montana-matt-rosendale-afghan-refugees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917134033-rep-matt-rosendale-super-tease.jpg", "publishedAt": "2021-09-17T19:21:26Z", "content": "Washington (CNN)A House Republican on Friday publicly pushed back against the Biden administration's plan to resettle Afghan nationals in his home state of Montana and suggested that the refugees are… [+3504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Coren, Julia Hollingsworth and Sandi Sidhu, CNN", "title": "US military admits it killed 10 civilians and targeted wrong vehicle in Kabul airstrike", "description": "A United States military investigation into a deadly Kabul drone strike in August has found that it killed 10 civilians and the driver and the vehicle targeted was likely not a threat associated with ISIS-K, according to a US military official familiar with t…", "url": "https://www.cnn.com/2021/09/17/politics/kabul-drone-strike-us-military-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917135921-afghanistan-damage-drone-strike-0829-restricted-super-tease.jpg", "publishedAt": "2021-09-17T19:02:38Z", "content": "(CNN)A United States military investigation into a deadly Kabul drone strike in August has found that it killed 10 civilians and the driver and the vehicle targeted was likely not a threat associated… [+1504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tal Yellin and Janie Boschma, CNN", "title": "Workers in these five industries will be affected the most by Biden's vaccine mandate", "description": "In five industries, more than 80% of the workforce are employed by businesses with a staff of at least 100 employees — and will be required to get a vaccine or a weekly Covid-19 test.", "url": "https://www.cnn.com/2021/09/17/business/business-vaccine-mandates-industries-states/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915170703-20210915-vaccine-mandate-job-sectors-card-super-tease.jpg", "publishedAt": "2021-09-17T18:37:56Z", "content": "New York (CNN Business)Employees in five industries will especially feel the effects of the new vaccine mandate management, utilities, information, finance and insurance, and administration and waste… [+2878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Why France is angry about the US and UK giving Australia nuclear-powered submarines", "description": "The French government says it was betrayed when Australia pulled out of their existing multi-billion dollar defense deal, agreeing instead to attain nuclear-powered submarines through a new deal with the United States and the United Kingdom.", "url": "https://www.cnn.com/2021/09/17/politics/france-anger-over-nuclear-powered-submarines-explained/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917100624-03-biden-national-security-0915-super-tease.jpg", "publishedAt": "2021-09-17T18:33:53Z", "content": "(CNN)The French government says it was betrayed when Australia pulled out of their existing multi-billion dollar defense deal, agreeing instead to attain nuclear-powered submarines through a new deal… [+5796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Schneider, CNN", "title": "New documents reveal concern among Capitol Police officers about others in the force after January 6", "description": "A high-ranking Capitol Police officer, who was also a vocal Donald Trump supporter, told those under his command not to wear riot gear on January 6, according to internal documents reviewed by CNN that detail allegations submitted to an officer tip line.", "url": "https://www.cnn.com/2021/09/17/politics/capitol-police-officers-concerns-january-6-documents/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629171548-03-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-09-17T17:57:33Z", "content": "(CNN)A high-ranking Capitol Police officer, who was also a vocal Donald Trump supporter, told those under his command not to wear riot gear on January 6, according to internal documents reviewed by C… [+5924 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, CNN", "title": "Mississippi says Covid-19 deaths in pregnant women are rising -- and it's pleading with them to get vaccinated", "description": "At least eight pregnant Mississippi women have died of Covid-19 since late July -- none of them fully vaccinated -- officials said, more than doubling the state's pandemic total in just two months and spurring medical leaders to give this message:", "url": "https://www.cnn.com/2021/09/17/health/mississippi-pregnant-women-covid-vaccine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917143950-01-mississippi-covid-vaccine-file-0727-super-tease.jpg", "publishedAt": "2021-09-17T17:50:54Z", "content": "(CNN)At least eight pregnant Mississippi women have died of Covid-19 since late July -- none of them fully vaccinated -- officials said, more than doubling the state's pandemic total in just two mont… [+8691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Is this all John Durham has?", "description": "On Thursday we learned that the Durham probe, the investigation into the origins of the FBI's counter-intelligence probe into Russian interference in the 2016 election long touted by Donald Trump and his fellow conservatives as the investigation that would bl…", "url": "https://www.cnn.com/2021/09/17/politics/john-durham-probe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916151718-john-durham-super-tease.jpg", "publishedAt": "2021-09-17T17:49:18Z", "content": "(CNN)On Thursday we learned that the Durham probe, the investigation into the origins of the FBI's counter-intelligence probe into Russian interference in the 2016 election long touted by Donald Trum… [+2959 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Clive Sinclair, an inventor who helped popularize personal computers, dies at 81", "description": "Sinclair created affordable computers including the ZX Spectrum, which prompted a generations of coders to create computer games, as well as famous flops like the C5 electric vehicle.", "url": "https://www.cnn.com/2021/09/17/tech/clive-sinclair-death-zx-computer-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917093824-restricted-file-01-clive-sinclair-super-tease.jpg", "publishedAt": "2021-09-17T17:36:09Z", "content": "(CNN)Before computers were a staple of workplaces, schools, libraries and many homes, they were bulky, expensive and a luxury many couldn't afford. \r\nEnter Clive Sinclair. The British inventor's firs… [+5629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Benjamin Levin", "title": "Samsung is having a massive sale on Amazon, with smartphones, earbuds and more all included", "description": "Right now, you can save up to $300 on select Samsung phones, tablets, Chromebooks and earbuds on Amazon. Notably, this sale drags a few steeper price points down to a more affordable range, so you won't want to miss a deal.", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/samsung-amazon-sale-smartphones/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210917123301-samsung.jpg?q=x_0,y_0,h_900,w_1601,c_fill/w_800", "publishedAt": "2021-09-17T17:29:48Z", "content": "Samsung has always pushed the envelope in tech, like with its recent foray into the niche space of foldable phones. And right now, you can save up to $300 on select Samsung phones, tablets, Chromeboo… [+7537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barry Neild and Katharina Krebs, CNN", "title": "Amber list scrapped as England overhauls travel rules", "description": "The UK government announced Friday it is simplifying its controversial traffic light travel rules and removing mandatory Covid tests for vaccinated travelers returning to England from countries on its safe list.", "url": "https://www.cnn.com/travel/article/england-scraps-amber-traffic-light-travel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917125246-01-heathrow-airport-arrivals-0802-super-tease.jpg", "publishedAt": "2021-09-17T17:23:46Z", "content": "(CNN) The UK government announced Friday it is simplifying its controversial traffic light travel rules and removing mandatory Covid tests for vaccinated travelers returning to England from countries… [+3553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Idaho's struggle to keep up with Covid-19 surge puts pressure on Washington state hospitals", "description": "Idaho officials announced Thursday they're preparing to ration hospital care due to the Covid-19 surge, and it was the last thing next-door Washington state's top hospital advocate wanted to hear.", "url": "https://www.cnn.com/2021/09/17/health/idaho-covid-surge-washington-state-hospitals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917115638-idaho-hospital-0831-super-tease.jpg", "publishedAt": "2021-09-17T17:03:16Z", "content": "(CNN)Idaho officials announced Thursday they're preparing to ration hospital care due to the Covid-19 surge, and it was the last thing next-door Washington state's top hospital advocate wanted to hea… [+6045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Moderna's vaccine is the most effective, but Pfizer and J&J also protect well, CDC-led study says", "description": "A head-to-head study of all three authorized coronavirus vaccines in the United States finds the Moderna vaccine is slightly more effective than Pfizer's in real-life use in keeping people out of the hospital, and Johnson & Johnson's Janssen vaccine comes in …", "url": "https://www.cnn.com/2021/09/17/health/moderna-vaccine-most-effective-cdc-study/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917123311-moderna-vaccine-0915-restricted-super-tease.jpg", "publishedAt": "2021-09-17T17:00:23Z", "content": "(CNN)A head-to-head study of all three authorized coronavirus vaccines in the United States finds the Moderna vaccine is slightly more effective than Pfizer's in real-life use in keeping people out o… [+2224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, CNN", "title": "Pence preps for potential 2024 presidential run amid rocky headlines about relationship with Trump", "description": "Mike Pence is adding staffers for his brand-new office in downtown Washington -- inching closer to a possible White House run even as his standing worsens with former President Donald Trump and his base of supporters.", "url": "https://www.cnn.com/2021/09/17/politics/pence-2024-run/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624233301-mike-pence-0603-super-tease.jpg", "publishedAt": "2021-09-17T16:31:35Z", "content": "(CNN)Mike Pence is adding staffers for his brand-new office in downtown Washington -- inching closer to a possible White House run even as his standing worsens with former President Donald Trump and … [+7192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zahra Ullah, CNN", "title": "Google and Apple said to have removed Navalny voting app as Russian elections begin", "description": "A voting app created by allies of prominent Kremlin critic Alexey Navalny was removed from Google and Apple's online stores in Russia just as polls opened for parliamentary elections, according to a series of tweets from Navalny's team on Friday.", "url": "https://www.cnn.com/2021/09/17/tech/navalny-app-google-facebook/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917105410-restricted-alexey-navalny-02-20-2021-super-tease.jpg", "publishedAt": "2021-09-17T16:19:10Z", "content": "(CNN)A voting app created by allies of prominent Kremlin critic Alexey Navalny was removed from Google and Apple's online stores in Russia just as polls opened for parliamentary elections, according … [+3476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Junko Ogura and Sara Spary, CNN", "title": "Japanese students sent a message in a bottle. 37 years later, it washed up in Hawaii", "description": "A glass bottle containing a message from 1984 has washed up in Hawaii and been discovered by a 9-year-old girl -- 37 years after high school students in Japan dropped it into the ocean as part of an experiment.", "url": "https://www.cnn.com/travel/article/hawaii-message-in-a-bottle-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917102607-tokyo-message-in-a-bottle-scli-intl-super-tease.jpg", "publishedAt": "2021-09-17T16:11:24Z", "content": "(CNN) A glass bottle containing a message from 1984 has washed up in Hawaii and been discovered by a 9-year-old girl -- 37 years after high school students in Japan dropped it into the ocean as part … [+1563 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alisha Ebrahimji, CNN", "title": "Officials wrapped the world's largest tree in protective foil to guard it against California wildfires", "description": "The world's largest tree has been wrapped in foil to protect it against flames from an out-of-control fire burning in California's scenic Sequoia National Park.", "url": "https://www.cnn.com/travel/article/sequoias-wrapped-knp-complex-fire-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917084525-01-general-sherman-sequoia-wrapped-in-foil-super-tease.jpg", "publishedAt": "2021-09-17T16:01:44Z", "content": "Alisha Ebrahimji, CNNUpdated 17th September 2021\r\n(CNN) The world's largest tree has been wrapped in foil to protect it against flames from an out-of-control fire burning in California's scenic Sequo… [+1754 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "iPhone 13 preorders are live — here's everything you need to know", "description": "Like clockwork, there's a new batch of smartphones from Apple in town. The iPhone 13 Mini, 13, 13 Pro and 13 Pro Max are all up for preorder now and keep a similar design to the iPhone 12 family. The updates focus on a smaller notch, improved cameras and bett…", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/apple-iphone-13-pre-order/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210917112006-iphone-13-preorder-lead.jpg?q=x_0,y_66,h_2535,w_4505,c_crop/w_800", "publishedAt": "2021-09-17T15:40:41Z", "content": "Like clockwork, theres a new batch of smartphones from Apple in town. The iPhone 13 Mini, 13, 13 Pro and 13 Pro Max are all up for preorder now and keep a similar design to the iPhone 12 family. The … [+16614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "Two of Queen Elizabeth's sons are facing growing pressure", "description": "Virginia Roberts Giuffre is suing Prince Andrew in a New York court on allegations of sexual assault. Andrew has consistently denied the claims and his legal team says papers haven't been properly served. So where does the case go from here?", "url": "https://www.cnn.com/2021/09/17/uk/royal-news-newsletter-09-17-21-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916180450-01-royal-newsletter-0917-super-tease.jpg", "publishedAt": "2021-09-17T15:34:26Z", "content": "A version of this story appeared in the September 17 edition of CNN's Royal News, a weekly dispatch bringing you the inside track on the royal family, what they are up to in public and what's happeni… [+14879 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Wray, CNN", "title": "Must-watch videos of the week", "description": "Celebrities hit the red carpet at the Met Gala, Miley Cyrus performs with Metallica and a \"megapod\" of whales surfaces in Australia. These are the must-watch videos of the week.", "url": "https://www.cnn.com/2021/09/17/world/videos-of-the-week-mobile-september-17/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917111427-kim-kardashian-met-gala-richard-quest-split-super-tease.jpg", "publishedAt": "2021-09-17T15:33:41Z", "content": "(CNN)Celebrities hit the red carpet at the Met Gala, Miley Cyrus performs with Metallica and a \"megapod\" of whales surfaces in Australia. These are the must-watch videos of the week. \r\nAfter a brief … [+533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Parachute now has gorgeous bed frames to go with its top-quality linen sheets", "description": "Parachute started out as a destination for top-quality bed linens, but for anyone who's looking to give their bedroom a refresh, there's some major news: The brand is expanding into its first line of furniture, starting with beautiful bed frames that are all …", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/parachute-furniture-bed-frames/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210916140708-parachute-furniture-bed-frames-lead.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_800", "publishedAt": "2021-09-17T15:12:35Z", "content": "Parachute started out as a destination for top-quality bed linens, but for anyone whos looking to give their bedroom a refresh, theres some major news: The brand is expanding into its first line of f… [+1311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Designer Yinka Ilori gives London streets a technicolor makeover", "description": "Yinka Ilori, a British Nigerian designer known for his exuberant technicolor murals, has transformed 11 pedestrian crossings in ctechnientral London as part of a new public art project hoping to increase domestic tourism within the UK.", "url": "https://www.cnn.com/style/article/yinka-ilori-london-pedestrian-crossings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917140918-yinka-ilori-tottenham-1-super-tease.jpg", "publishedAt": "2021-09-17T15:02:11Z", "content": "artsPublished 17th September 2021\r\nYinka Ilori, a British Nigerian designer known for his exuberant technicolor murals, has transformed 11 pedestrian crossings in central London as part of a new publ… [+2317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Uncontrollable vomiting due to marijuana use on rise, study finds", "description": "An unusual illness is on the rise in the United States, especially in states that have legalized marijuana. People who frequently use cannabis, including teenagers, are showing up in emergency rooms with uncontrollable vomiting.", "url": "https://www.cnn.com/2021/09/17/health/marijuana-vomiting-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917002113-02-marijuana-smoking-stock-super-tease.jpg", "publishedAt": "2021-09-17T15:01:16Z", "content": "(CNN)An unusual illness is on the rise in the United States, especially in states that have legalized marijuana. Habitual users of cannabis, including teenagers, are showing up in emergency rooms com… [+5869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop this weekend: Cricut, Roomba, 23andMe and more", "description": "Today, you'll find a deal on the Cricut Explore Air 2, Puma and savings on a Roomba 692. All that and more below.", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210917103445-0917lead.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "publishedAt": "2021-09-17T14:56:28Z", "content": "Today, youll find a deal on the Cricut Explore Air 2, Puma and savings on a Roomba 692. All that and more below.\r\nHands-off cleaners will appreciate this deal on a Roomba 692 robotic vacuum at Daily … [+10168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Democratic lawmakers urge Biden administration to halt deportations to Haiti", "description": "More than 50 Democratic lawmakers urged the Biden administration Friday to halt deportations to Haiti as nearly 10,000 migrants have overwhelmed Del Rio, Texas, many of whom are Haitian.", "url": "https://www.cnn.com/2021/09/17/politics/haiti-deportations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917103315-haiti-deportation-protest-file-super-tease.jpg", "publishedAt": "2021-09-17T14:35:25Z", "content": "(CNN)More than 50 Democratic lawmakers urged the Biden administration Friday to halt deportations to Haiti as nearly 10,000 migrants have overwhelmed Del Rio, Texas, many of whom are Haitian. \r\nIn a … [+3357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Wall Street Journal: Milley defends calls to China during Trump presidency as 'perfectly' within his duties", "description": null, "url": "https://www.cnn.com/2021/09/17/politics/mark-milley-defends-china-calls-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815141356-mark-milley-07-21-2021-super-tease.jpg", "publishedAt": "2021-09-17T14:30:07Z", "content": "(CNN)Gen. Mark Milley on Friday defended the calls he placed to his Chinese counterpart during Donald Trump's final months in office as \"perfectly within the duties and responsibilities\" of his job a… [+1289 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Spary, CNN", "title": "Jane Powell, star of Hollywood Golden Age musicals, dead at 92", "description": "Jane Powell, the star of some of Hollywood's best-loved Golden Age musicals, has died at the age of 92.", "url": "https://www.cnn.com/2021/09/17/entertainment/jane-powell-death-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917091534-01-jane-powell-1954-restricted-super-tease.jpg", "publishedAt": "2021-09-17T14:29:09Z", "content": "(CNN)Jane Powell, the star of some of Hollywood's best-loved Golden Age musicals, has died at the age of 92.\r\nPowell died Thursday at her home in Wilton, Connecticut, her friend Susan Granger told CN… [+464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tanya Edwards and Tanya Edwards", "title": "How to color your hair at home, according to experts", "description": "Coloring your hair at home can be daunting, but there's no need to worry. To help you get your perfect look, we talked to experts who recommend their favorite hair coloring products.", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/best-at-home-hair-color/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210915162329-at-home-hair-color-lead.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "publishedAt": "2021-09-17T14:19:05Z", "content": "Coloring your hair at home can be daunting, but in reality its quite easy if you know what youre doing. Whether its covering grays, giving natural color a little bit of a boost, or going all-out with… [+6470 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "9/11 made spy dramas like '24' and 'Alias' scramble. But not for long", "description": "The Sept. 11 terror attacks that rippled through US society and culture 20 years ago also disrupted the fall TV season that was about to begin. While all of television pondered how to respond, those events particularly impacted a trio of new dramas with anti-…", "url": "https://www.cnn.com/2021/09/17/entertainment/fall-tv-2001-column/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150603153546-kiefer-sutherland-24-super-169.jpg", "publishedAt": "2021-09-17T14:14:42Z", "content": "(CNN)The Sept. 11 terror attacks that rippled through US society and culture 20 years ago also disrupted the fall TV season that was about to begin. While all of television pondered how to respond, t… [+3717 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Muhammad Ali' lets Ken Burns go four fascinating rounds with the champ's life and legacy", "description": "Floating and stinging as it explores the boxing icon's life inside the ring and out, \"Muhammad Ali\" is another epic Ken Burns-produced dive into the life of an influential 20th-century figure.", "url": "https://www.cnn.com/2021/09/17/entertainment/muhammad-ali-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210913063444-muhammad-ali-sonny-liston-boxing-052565-file-super-tease.jpg", "publishedAt": "2021-09-17T14:14:18Z", "content": "(CNN)Floating and stinging as it explores the boxing icon's life inside the ring and out, \"Muhammad Ali\" is another epic Ken Burns-produced dive into the life of an influential 20th-century figure, c… [+3691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jolie Kerr", "title": "How to clean different types of jewelry, according to experts", "description": "It's actually pretty easy to clean your jewelry at home, but if you use the wrong products it can be a costly mistake. We enlisted three jewelry experts to explain the dos and don'ts of maintaining your jewelry's luster and cleanliness.", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/how-to-clean-jewelry/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210916110236-how-to-clean-jewelry-lead.jpg?q=x_0,y_0,h_1406,w_2498,c_fill/w_800", "publishedAt": "2021-09-17T14:00:33Z", "content": "Theres good news and theres bad news when it comes to cleaning jewelry: The good news is that it is actually very easy to clean jewelry of all kinds, from metals like gold and silver, to gemstones li… [+8288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Kevin Liptak, CNN", "title": "White House warns states of potentially dire effects if government defaults", "description": "The White House is warning states that a default caused by failing to raise the federal debt limit could result in drastic cutbacks to disaster relief, Medicaid, school funding and other programs.", "url": "https://www.cnn.com/2021/09/17/politics/white-house-warning-debt-limit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210704190844-white-house-exterior-0703-super-tease.jpg", "publishedAt": "2021-09-17T13:52:40Z", "content": "(CNN)The White House is warning states that a default caused by failing to raise the federal debt limit could result in drastic cutbacks to disaster relief, Medicaid, school funding and other program… [+2410 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "Canada's cliffhanger election is heating up. Some fear US-style political polarization will follow", "description": "The vote, set for September 20, includes six federal parties. Prime Minister Justin Trudeau and Conservative leader Erin O'Toole are likely the only leaders capable of forming government given their national support, but Jagmeet Singh, leader of the New Democ…", "url": "https://www.cnn.com/2021/09/17/americas/canada-elections-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916164420-canada-debate-0909-super-tease.jpg", "publishedAt": "2021-09-17T13:50:02Z", "content": "Carp, Ontario (CNN)The sky was blue, the families were smiling, the toddlers were taking tender steps through the grass. Canada's Conservative Party leader was ready to make a childcare announcement … [+8352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill, CNN", "title": "The 'world's safest city' for 2021 revealed", "description": "Asian cities like Tokyo, Singapore and Osaka formerly occupied the top spots in the Economist's annual list of safe destinations, but Covid has turned the world on its head. Now a European city leads the pack in terms of resilience, security and wellbeing.", "url": "https://www.cnn.com/travel/article/the-worlds-safest-city-2021-revealed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917144011-210916154827-01-worlds-safest-city-2021-super-tease.jpg", "publishedAt": "2021-09-17T13:42:55Z", "content": "(CNN) Safety has long been a paramount concern for travelers when it comes to deciding which destination to visit.\r\nBut the world has been turned on its head in recent years due to the global pandemi… [+5687 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This retiring Republican just handed more power to Donald Trump", "description": "Ohio Republican Rep. Anthony Gonzalez's retirement announcement made national headlines on Thursday night as he savaged former President Donald Trump and the GOP complicit in his continued status as its leader.", "url": "https://www.cnn.com/2021/09/17/politics/anthony-gonzalez-ohio-retiring/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512145147-01-anthony-gonzalez-super-tease.jpg", "publishedAt": "2021-09-17T13:30:22Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Donald Trump is gaslighting us on the January 6 riot", "description": "Donald Trump's assault on the truth didn't end when he left office. If anything, it's picked up steam since then.", "url": "https://www.cnn.com/2021/09/17/politics/donald-trump-september-18-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205104923-104-january-6-capitol-riots-super-tease.jpg", "publishedAt": "2021-09-17T13:24:50Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jolie Kerr", "title": "8 Amazon products \"The Real Housewives of Salt Lake City\" star Lisa Barlow can't live without", "description": "With Bravo's \"The Real Housewives of Salt Lake City\" back for a second season, we spoke with one of its stars, Lisa Barlow, about the Amazon buys that are always in her cart.", "url": "https://www.cnn.com/2021/09/17/cnn-underscored/real-housewives-of-salt-lake-city-lisa-barlow-amazon-products/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210909121721-rhoslclead.jpg?q=x_0,y_0,h_1406,w_2498,c_fill/w_800", "publishedAt": "2021-09-17T13:22:27Z", "content": "In the premiere episode of Bravos The Real Housewives of Salt Lake City, Lisa Barlow dismissed any concerns the viewer might have about the tension between being an active Mormon and owning a liquor … [+4394 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Guinea declares end of Marburg virus outbreak", "description": "An outbreak of the deadly Marburg virus in Guinea is officially over, health authorities said on Thursday, less than six weeks since West Africa's first ever case of the disease was detected.", "url": "https://www.cnn.com/2021/09/17/africa/guinea-marburg-virus-over-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/141008085144-marburg-virus-story-top.jpg", "publishedAt": "2021-09-17T13:07:20Z", "content": "(CNN)An outbreak of the deadly Marburg virus in Guinea is officially over, health authorities said on Thursday, less than six weeks since West Africa's first ever case of the disease was detected.\r\nN… [+1419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jennifer M. Granholm for CNN Business Perspectives", "title": "Extreme weather keeps knocking out America's power. Here's what we must do", "description": "The image of a collapsed electrical tower and power lines that Hurricane Ida tossed into the Mississippi River illustrated a fundamental challenge facing the nation: Our power systems weren't built to withstand extreme weather events. Without major investment…", "url": "https://www.cnn.com/2021/09/17/perspectives/clean-energy-economy-build-back-better-agenda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916162044-01-extreme-weather-hurricane-ida-power-grid-louisiana-super-tease.jpg", "publishedAt": "2021-09-17T13:01:14Z", "content": "Jennifer M. Granholm is the 16th United States Secretary of Energy. The opinions expressed in this commentary are her own. \r\nThe image of a collapsed electrical tower and power lines that Hurricane I… [+5889 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Melissa Macaya, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on the Covid-19 pandemic in the US", "description": "The FDA's advisory committee is meeting today to discuss booster doses of coronavirus vaccine. Follow here for the latest news.", "url": "https://www.cnn.com/world/live-news/coronavirus-vaccine-booster-news-09-17-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-09-17T12:05:35Z", "content": "A US Food and Drug Administration briefing document posted ahead of Fridays FDA vaccine advisers' meeting does not include a recommendation on whether Pfizer/BioNTech Covid-19 vaccine boosters are wa… [+2248 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "Carli Lloyd scores five goals as US women hammer Paraguay in farewell tour", "description": "US forward Carli Lloyd showed no signs of slowing down during her team's 9-0 battering against Paraguay on Thursday night, scoring five goals despite announcing her retirement from professional football earlier this year.", "url": "https://www.cnn.com/2021/09/17/football/carli-lloyd-uswnt-paraguay-friendly-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917054126-05-carli-lloyd-paraguay-091621-file-super-tease.jpg", "publishedAt": "2021-09-17T11:48:38Z", "content": "(CNN)US forward Carli Lloyd showed no signs of slowing down during her team's 9-0 battering against Paraguay on Thursday night, scoring five goals despite announcing her retirement from professional … [+3553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Clare Duffy, CNN Business\nVideo by John General, CNN Business", "title": "This mobile app is helping Afghans navigate Kabul following the Taliban takeover", "description": "As the Taliban entered Kabul last month, the team behind the crowdsourced news alert app Ehtesab deserted their office in the city. But they continued their work of providing Afghans with critical information, such as which roads were congested and where outb…", "url": "https://www.cnn.com/2021/09/17/tech/mobile-app-kabul-real-time-alerts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914120742-kabul-market-0911-super-tease.jpg", "publishedAt": "2021-09-17T11:48:17Z", "content": "New York (CNN Business)As the Taliban entered Kabul last month, the team behind the crowdsourced news alert app Ehtesab deserted their office in the city. But they continued their work of providing A… [+5600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray and Jason Morris, CNN", "title": "Georgia criminal probe into Trump's attempts to overturn 2020 election quietly moves forward", "description": "As Donald Trump returns to Georgia later this month, criminal investigators in the state have been quietly conducting interviews, collecting documents and working to build a line of communication with congressional investigators as they aim to build a case ag…", "url": "https://www.cnn.com/2021/09/17/politics/georgia-probe-trump-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916164409-02-georgia-criminal-probe-trump-super-tease.jpg", "publishedAt": "2021-09-17T11:00:20Z", "content": "(CNN)As Donald Trump returns to Georgia later this month, criminal investigators in the state have been quietly conducting interviews, collecting documents and working to build a line of communicatio… [+11213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Duffy, CNN", "title": "How to improve sleep habits to support emotional wellness, according to a therapist", "description": "Poor sleep patterns can drive the stress that contributes to anxiety, depression and our ability to focus. When psychologist John Duffy asks his clients to track their rest, they find they get far less sleep than they think they do. Here's how his clients add…", "url": "https://www.cnn.com/2021/09/17/health/how-to-improve-sleep-habits-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916122034-man-meditating-in-bed-stock-super-tease.jpg", "publishedAt": "2021-09-17T10:59:09Z", "content": "Psychologist John Duffy, author of \"Parenting the New Teen in the Age of Anxiety,\" practices in Chicago. He specializes in work with teens, parents, couples and families. \r\n (CNN)I worked recently wi… [+5904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "The tricky agenda behind vaccine resistance", "description": "The tension over vaccine requirements reflects historical debates about the appropriate balance among government authority, religious freedom and the public good, writes Nicole Hemmer. That history reveals how religious exemptions were co-opted first by the a…", "url": "https://www.cnn.com/2021/09/17/opinions/tricky-agenda-behind-vaccine-resistance-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901094953-vaccine-protesters-us-0806-super-tease.jpg", "publishedAt": "2021-09-17T10:47:54Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+9189 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for September 17: Australia, Afghanistan, Covid, immigrants, climate", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/09/17/us/five-things-september-17-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917100624-03-biden-national-security-0915-super-tease.jpg", "publishedAt": "2021-09-17T10:27:54Z", "content": "(CNN)It's Hispanic Heritage Month -- and yes, it starts in the middle of September and runs to the middle of October. The date structure is a nod to several important dates in Latin American countrie… [+5698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "Milley's reasonable actions raise a serious question", "description": "What Milley did was put his country above his commander-in-chief, writes Peter Bergen. Given the irrational rage that Trump was exhibiting after his election loss, Milley made the right call to reassure the Chinese about the stability of the US national secur…", "url": "https://www.cnn.com/2021/09/17/opinions/milleys-reasonable-actions-raise-a-serious-question-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815141356-mark-milley-07-21-2021-super-tease.jpg", "publishedAt": "2021-09-17T10:13:58Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. He is the author of \"Trump and His Generals: The Cost of Chao… [+7140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ariane de Vogue, CNN Supreme Court Reporter", "title": "The Supreme Court's actions on abortion and voting rights would have stunned RBG", "description": "Justice Ruth Bader Ginsburg, who died a year ago this week, had been well aware that the conservatives on the Supreme Court were poised to take a right turn in areas concerning reproductive health and voting rights. But the liberal icon would likely be stunne…", "url": "https://www.cnn.com/2021/09/17/politics/ruth-bader-ginsburg-supreme-court-abortion-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916162409-justice-ruth-bader-ginsburg-restricted-super-tease.jpg", "publishedAt": "2021-09-17T10:05:40Z", "content": "(CNN)Justice Ruth Bader Ginsburg, who died a year ago this week, had been well aware that the conservatives on the Supreme Court were poised to take a right turn in areas concerning reproductive heal… [+9175 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands and Zachary Cohen, CNN", "title": "January 6 vs. September 18: How law enforcement hopes to prevent another riot", "description": "A new fence, an information-sharing alert and ramped-up airport security are just a few of the ways law enforcement is preparing to prevent another deadly insurrection ahead of Saturday's rally aimed at showing support for those arrested on January 6.", "url": "https://www.cnn.com/2021/09/17/politics/september-18-rally-law-enforcement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916182311-capitol-fencing-0916-super-tease.jpg", "publishedAt": "2021-09-17T10:04:46Z", "content": "(CNN)A new fence, an information-sharing alert and ramped-up airport security are just a few of the ways law enforcement is preparing to prevent another deadly insurrection ahead of Saturday's rally … [+9122 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "The Arc de Triomphe is wrapped in fabric, a vision six decades in the making", "description": "After three months of construction work at Paris' famed Arc de Triomphe, the 160-foot-tall war monument has been completely concealed. The landmark, built during Napoleon's reign, has been outfitted in 270,000 square feet of silver-blue polypropylene fabric b…", "url": "https://www.cnn.com/style/article/christo-arc-de-triomphe-wrapped-completed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916140901-05-christo-jeanne-claude-projects-super-tease.jpg", "publishedAt": "2021-09-17T09:48:00Z", "content": "artsPublished 17th September 2021\r\nAfter three months of construction work at Paris' famed Arc de Triomphe, the 160-foot-tall war monument has been completely concealed. The landmark, built during Na… [+6763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Prince Philip's will to be kept secret for 90 years", "description": "The will of Prince Philip, the late husband of Britain's Queen Elizabeth, will be sealed and remain private for at least 90 years to preserve the monarch's dignity, a judge at London's High Court has ruled.", "url": "https://www.cnn.com/2021/09/17/uk/prince-philip-will-secret-ruling-scli-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210409212150-prince-phillip-file-super-tease.jpg", "publishedAt": "2021-09-17T09:45:44Z", "content": "(CNN)The will of Prince Philip, the late husband of Britain's Queen Elizabeth, will be sealed and remain private for at least 90 years to preserve the monarch's dignity, a judge at London's High Cour… [+1915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, CNN", "title": "The countries that are vaccinating children against Covid-19", "description": "Schools are in session, Covid-19 restrictions are being relaxed en masse and the Delta variant is raging worldwide, creating a maelstrom of confusion for parents on how to best protect their unvaccinated children.", "url": "https://www.cnn.com/2021/09/17/world/covid-vaccine-children-countries-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210909124624-01-cuba-children-vaccination-0824-super-tease.jpg", "publishedAt": "2021-09-17T09:25:04Z", "content": "(CNN)Schools are in session, Covid-19 restrictions are being relaxed en masse and the Delta variant is raging worldwide, creating a maelstrom of confusion for parents on how to best protect their unv… [+7095 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Diksha Madhok, CNN Business", "title": "Trump abandoned this giant trade deal. Now, China wants in", "description": "Beijing has formally applied to join an 11-country Asia-Pacific trade pact, which was once pushed by the United States as a way to counter China's growing influence in the region.", "url": "https://www.cnn.com/2021/09/17/economy/china-cptpp-application-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917011950-cptpp-ceremony-file-2018-super-tease.jpg", "publishedAt": "2021-09-17T09:03:11Z", "content": "New Delhi (CNN Business)China has applied to join a major Asia-Pacific trade partnership that the United States ditched several years ago, as the world's second largest economy tries to bolster its r… [+4486 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Women are coding the future in Saudi Arabia - CNN Video", "description": "Saudi Arabia is increasing its efforts to empower women in the technology industry, and at Tuwaiq Academy, women learn to code alongside men in this conservative kingdom.", "url": "https://www.cnn.com/videos/business/2021/09/15/saudi-women-tech-coding-spc-intl.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210913145918-saudi-woman-laptop-super-tease.jpg", "publishedAt": "2021-09-17T08:57:40Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Stephanie Bailey, CNN", "title": "Egypt is building a $4.5 billion high-speed rail line", "description": "Through a project led by Siemens, passengers and cargo will soon be able to shoot through the Egyptian desert aboard the country's first high-speed train.", "url": "https://www.cnn.com/travel/article/egypt-high-speed-train-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917084745-restricted-egypt-fast-train-7-super-tease.jpg", "publishedAt": "2021-09-17T08:10:26Z", "content": "(CNN) Passengers and cargo will soon be able to shoot through the Egyptian desert aboard a high-speed train, in a first for the country.\r\nGerman company Siemens Mobility signed a contract with Egypt'… [+2741 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Don Riddell, CNN", "title": "'Maybe, he wasn't the problem. Maybe, I was': How Muhammad Ali stayed true to himself on his path to becoming an icon", "description": "Muhammad Ali scoops up his baby daughter Maryum and explains a concept that she couldn't possibly understand at such a tender young age: \"Your daddy is fighting for you,\" he is reported as saying in 1968. \"Someday, you're going to be able to walk with your he…", "url": "https://www.cnn.com/2021/09/17/sport/muhammad-ali-documentary-legacy-ken-burns-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915125501-20210915-muhammad-ali-documentary-super-tease.jpg", "publishedAt": "2021-09-17T08:01:53Z", "content": "(CNN)Muhammad Ali scoops up his baby daughter Maryum and explains a concept that she couldn't possibly understand at such a tender young age: \"Your daddy is fighting for you,\" he is reported as sayin… [+13542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and Steve George, CNN", "title": "Analysis: Separated from his parents, an infected 4-year-old highlights the cost of China's zero-Covid policy", "description": "Covered from head to toe in a white hazmat suit, a small child carrying a backpack half the size of his body toddles down a hospital corridor and arrives at a CT scan room -- all by himself.", "url": "https://www.cnn.com/2021/09/17/china/human-cost-covid-quarantine-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917025915-child-quarantine-ct-scan-china-super-tease.jpg", "publishedAt": "2021-09-17T07:55:19Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+11555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bianca Nobilo, Jessie Gretener and Jaya Sharma, CNN", "title": "UK Speaker: We can't let mob rule smash democracy", "description": "Following high-profile attacks on democratic institutions, including the January 6 riot at the US Capitol, UK Parliament Speaker Lindsay Hoyle feels an urgent responsibility to champion political freedoms.", "url": "https://www.cnn.com/2021/09/17/uk/speakers-summit-lindsay-hoyle-democracy-gbr-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916105753-01-sir-lindsay-hoyle-file-super-tease.jpg", "publishedAt": "2021-09-17T07:54:58Z", "content": "London (CNN)Following high-profile attacks on democratic institutions, including the January 6 riot at the US Capitol, UK Parliament Speaker Lindsay Hoyle feels an urgent responsibility to champion p… [+3864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Gabby Petito's family and police urge her fiancé to come forward with any information about her disappearance", "description": "Investigators searching for Gabby Petito believe her fiancé and those around him are withholding critical information related to her disappearance and are refusing to come forward, police said Thursday night.", "url": "https://www.cnn.com/2021/09/17/us/gabby-petito-missing-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915142521-02-gabby-petito-super-tease.jpg", "publishedAt": "2021-09-17T07:41:47Z", "content": "(CNN)Investigators searching for Gabby Petito believe her fiancé and those around him are withholding critical information related to her disappearance and are refusing to come forward, police said T… [+5156 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, Dakin Andone and Angela Barajas, CNN", "title": "Alex Murdaugh's legal team is 'casting a defense that doesn't exist,' lawyer for his former housekeeper says", "description": "When South Carolina lawyer Alex Murdaugh appeared in court Thursday on fraud charges, his lawyer spoke of his life deteriorating and his opioid addiction spiraling.", "url": "https://www.cnn.com/2021/09/17/us/murdaugh-shooting-arrest-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916172912-alex-murdaugh-bond-hearing-0916-super-tease.jpg", "publishedAt": "2021-09-17T07:02:49Z", "content": "(CNN)When South Carolina lawyer Alex Murdaugh appeared in court Thursday on fraud charges, his lawyer spoke of his life deteriorating and his opioid addiction spiraling. \r\nBut the lawyer for a family… [+6368 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "An arrest has been made in the 2012 killing of a UNC-Chapel Hill student, police say", "description": "A 28-year-old man has been arrested in connection with the killing of Faith Danielle Hedgepeth, a 19-year-old University of North Carolina at Chapel Hill student who was found dead in her off-campus apartment in 2012, officials said Thursday.", "url": "https://www.cnn.com/2021/09/17/us/faith-hedgepeth-unc-murder-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916223528-faith-hedgepeth-vigil-file-super-tease.jpg", "publishedAt": "2021-09-17T05:36:08Z", "content": "(CNN)A 28-year-old man has been arrested in connection with the killing of Faith Danielle Hedgepeth, a 19-year-old University of North Carolina at Chapel Hill student who was found dead in her off-ca… [+2486 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "The FDA's meeting on Covid-19 boosters may not provide an answer to all the questions, experts say", "description": "The US Food and Drug Administration is meeting Friday about Covid-19 vaccine boosters, but the long-awaited discussion may not yield an answer as to whether all vaccinated Americans will get a third dose, experts said.", "url": "https://www.cnn.com/2021/09/17/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916234755-01-pfizer-vaccine-0914-super-tease.jpg", "publishedAt": "2021-09-17T05:14:44Z", "content": "(CNN)The US Food and Drug Administration is meeting Friday about Covid-19 vaccine boosters, but the long-awaited discussion may not yield an answer as to whether all vaccinated Americans will get a t… [+6326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "What are nuclear-powered submarines and how do they work? Australia's new firepower explained", "description": "With Australia making a deal with the United States and United Kingdom to begin a nuclear-powered submarine program, we can expect the Aussie subs will look a lot like the latest versions in the US and British arsenals.", "url": "https://www.cnn.com/2021/09/17/australia/nuclear-submarines-aukus-explainer-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150803125646-u-s-navys-submarine-fleet-1-super-tease.jpg", "publishedAt": "2021-09-17T05:10:48Z", "content": "Hong Kong (CNN)With Australia making a deal with the United States and United Kingdom to begin a nuclear-powered submarine program, we can expect the Aussie subs will look a lot like the latest versi… [+4894 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Philippines refuses to work with ICC 'war on drugs' probe", "description": "The government of Philippines President Rodrigo Duterte on Thursday said it will not cooperate with an International Criminal Court (ICC) probe into his notorious war on drugs, or allow any investigators into the country.", "url": "https://www.cnn.com/2021/09/17/asia/philippines-duterte-icc-response-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917000253-rodrigo-duterte-file-0726-super-tease.jpg", "publishedAt": "2021-09-17T04:24:49Z", "content": "The government of Philippines President Rodrigo Duterte on Thursday said it will not cooperate with an International Criminal Court (ICC) probe into his notorious war on drugs, or allow any investiga… [+2562 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "This new survey by one of my favorite groups, the Public Religion Research Institute, underscores the point. \"We asked who's to blame for the violence on January 6, now that some time has passed,\" the group said. \" Most of the country blames white supremacist…", "url": "https://view.newsletters.cnn.com/messages/1631850520206c3bdfe6ddae2/raw", "urlToImage": null, "publishedAt": "2021-09-17T04:15:06Z", "content": "Softening the ground?\r\nLet's drill down deeper on the PRRI data. WaPo opinion columnist Greg Sargentsays \"the poll's big finding is that people who rely heavily on Fox News and other right-wing media… [+3509 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lincoln Mitchell", "title": "A big win for Gavin Newsom, but a bigger defeat for the GOP", "description": "Lincoln Mitchell writes that White women voters' support for the California governor in the recall election should worry the GOP because that's usually a big part of their base, and if this demographic continues to abandon the party, suburban districts around…", "url": "https://www.cnn.com/2021/09/17/opinions/newsom-recall-win-big-gop-defeat-mitchell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915002825-03-newsom-recall-election-remarks-0914-super-tease.jpg", "publishedAt": "2021-09-17T04:00:57Z", "content": "Lincoln Mitchell (@LincolnMitchell) teaches in the School of International and Public Affairs at Columbia University. His most recent book is \"The Giants and Their City: Major League Baseball in San … [+4900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mark Robinson, CNN", "title": "How to eat sushi: Tips for ordering and eating like a Tokyo local", "description": "In theory, sushi is a simple thing to be enjoyed in almost any way you like. However, if you want to eat it like a Tokyo local, remember that sushi etiquette changes with the setting.", "url": "https://www.cnn.com/travel/article/how-to-eat-sushi-tokyo-local-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916135259-sushi-stock-restricted-super-tease.jpg", "publishedAt": "2021-09-17T03:20:08Z", "content": "Tokyo (CNN) In theory, sushi is a simple thing to be enjoyed in almost any way you like. \r\nEat it standing or seated, with fingers or chopsticks, dipped in soy sauce, mixed with wasabi, swallowed in … [+8693 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Minnesota Supreme Court rules Minneapolis voters may decide on abolishing the police department in upcoming elections", "description": "The Minnesota Supreme Court ruled Thursday that voters in Minneapolis may decide on abolishing the police department in the upcoming municipal elections.", "url": "https://www.cnn.com/2021/09/16/us/minneapolis-police-vote-court-ruling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210723223036-minneapolis-police-department-file-super-tease.jpg", "publishedAt": "2021-09-17T03:03:43Z", "content": "(CNN)The Minnesota Supreme Court ruled Thursday that voters in Minneapolis may decide on abolishing the police department in the upcoming municipal elections.\r\nThe measure, if approved, would amend t… [+677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peggy Drexler", "title": "Opinion: The real issue with Nicki Minaj", "description": "Clearly, touting misinformation—from anyone—is not helpful to persuading vaccine-resistant Americans. But do Minaj's opinions, or any celebrity's opinions, make a meaningful difference in the Covid landscape? They can in one sense, writes Peggy Drexler: such …", "url": "https://www.cnn.com/2021/09/16/opinions/nicki-minaj-covid-drexler/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914153307-01-nick-minaj-file-super-tease.jpg", "publishedAt": "2021-09-17T02:07:36Z", "content": "Peggy Drexler is a research psychologist, documentary producer and the author of \"Our Fathers, Ourselves: Daughters, Fathers, and the Changing American Family\" and \"Raising Boys Without Men.\" She is … [+6532 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica and Michael Warren, CNN", "title": "McAuliffe and Youngkin spar over Covid vaccine requirements in first Virginia debate", "description": "Virginia gubernatorial candidates Terry McAuliffe and Glenn Youngkin sparred on Thursday over what each would do in the fight against the coronavirus, revealing a significant divide between the Democrat's backing of vaccine mandates and the Republican's argum…", "url": "https://www.cnn.com/2021/09/16/politics/mcauliffe-youngkin-virginia-governor-debate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916203125-mcauliffe-youngkin-debate-super-tease.jpg", "publishedAt": "2021-09-17T02:05:13Z", "content": "(CNN)Virginia gubernatorial candidates Terry McAuliffe and Glenn Youngkin sparred on Thursday over what each would do in the fight against the coronavirus, revealing a significant divide between the … [+6505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Hertling", "title": "Retired General: General Milley did his job", "description": "The Chairman of the Joint Chiefs of Staff was right to reassure China during the turbulent final days of Trump's presidency that the US was not going to suddenly, recklessly start a war with them, writes Ret. Lt. Gen. Mark Hertling. Milley was reacting to the…", "url": "https://www.cnn.com/2021/09/16/opinions/milley-woodward-costa-book-hertling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815141356-mark-milley-07-21-2021-super-tease.jpg", "publishedAt": "2021-09-17T01:54:56Z", "content": "Retired Lt. Gen. Mark Hertling is a national security, intelligence and terrorism analyst for CNN. He served for 37 years in the Army, including three years in combat, and retired as commanding gener… [+6169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette, CNN", "title": "Democratic legislation aims to address State Department restrictions on certain diplomats", "description": "Democratic lawmakers introduced legislation to address long-standing complaints that the State Department places disproportionate restrictions on the places diplomats of certain backgrounds can serve and that there is no independent appeals process to challen…", "url": "https://www.cnn.com/2021/09/16/politics/state-assignment-restrictions-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201221141219-harry-s-truman-department-of-state-building-super-tease.jpg", "publishedAt": "2021-09-17T01:30:24Z", "content": "(CNN)Democratic lawmakers introduced legislation to address long-standing complaints that the State Department places disproportionate restrictions on the places diplomats of certain backgrounds can … [+5883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "Ohio Republican who voted to impeach Trump says he will not run for reelection in 2022", "description": "Rep. Anthony Gonzalez of Ohio, one of 10 House Republicans who voted to impeach former President Donald Trump earlier this year, announced Thursday that he will not run for reelection in 2022.", "url": "https://www.cnn.com/2021/09/16/politics/anthony-gonzalez-not-running-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512145147-01-anthony-gonzalez-super-tease.jpg", "publishedAt": "2021-09-17T01:22:11Z", "content": "(CNN)Rep. Anthony Gonzalez of Ohio, one of 10 House Republicans who voted to impeach former President Donald Trump earlier this year, announced Thursday that he will not run for reelection in 2022. \r… [+45 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "Analysis: The FBI failed Olympic gymnasts. What does that mean for everyone else?", "description": "Simone Biles, Aly Raisman and McKayla Maroney won gold for the US in gymnastics but were ignored or dismissed by the country's justice system for too long before Larry Nassar, the predator volunteering as a doctor for USA Gymnastics and working at Michigan St…", "url": "https://www.cnn.com/2021/09/16/politics/what-matters-fbi-usa-gymnastics-nassar/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915105349-01-us-gymnasts-senate-hearing-0915-super-tease.jpg", "publishedAt": "2021-09-16T23:54:28Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here. \r\n (CNN)Simone Biles, Aly Raisman and McKayla Maroney won gold for the US in gymnast… [+5456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 40 photos", "description": "The past week marked a somber milestone in the United States as we stopped to remember those killed in the September 11 terrorist attacks 20 years ago.", "url": "https://www.cnn.com/2021/09/16/world/gallery/photos-this-week-september-10-september-16/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916173106-19-week-in-photos-0916-super-tease.jpg", "publishedAt": "2021-09-16T23:41:48Z", "content": "A moment of silence is held Saturday at the National September 11 Memorial and Museum in New York. From left are former President Bill Clinton; former first lady and US Sen. Hillary Clinton; former P… [+1416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The best thing the Trump presidency did", "description": "It's funny what four years of a president who carries a healthy disregard for the Constitution, and a violent insurrection at the US Capitol, can do for people's knowledge of our democratic institutions!", "url": "https://www.cnn.com/2021/09/16/politics/trump-legacy-three-branches-of-government/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201025080142-trump-sworn-2017-super-tease.jpg", "publishedAt": "2021-09-16T22:30:53Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Paul Ryan was convinced Donald Trump had narcissistic personality disorder", "description": "Paul Ryan knew that he had a problem. Donald Trump had been elected president and now Ryan, as the Republican Speaker of the House, had to find ways to work with him -- despite the two men's totally opposite approaches to life and politics.", "url": "https://www.cnn.com/2021/09/16/politics/paul-ryan-donald-trump-narcissistic-personality-disorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180824144202-27-trump-gallery-super-tease.jpg", "publishedAt": "2021-09-16T21:41:09Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt, Jennifer Hansler and Kylie Atwood, CNN", "title": "France cancels Washington reception and tones down celebrations of US-French Revolutionary War victory amid submarine spat", "description": "Amid a rift over a new security agreement between the United States, Australia and the United Kingdom, the French Embassy in Washington has canceled a Washington reception and toned down celebrations commemorating a Revolutionary War naval victory by the Fren…", "url": "https://www.cnn.com/2021/09/16/politics/battle-of-the-capes-french-embassy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/151127094502-french-flags-super-tease.jpg", "publishedAt": "2021-09-16T21:08:58Z", "content": "Washington (CNN)Amid a rift over a new security agreement between the United States, Australia and the United Kingdom, the French Embassy in Washington has canceled a Washington reception and toned d… [+3000 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Arlette Saenz, CNN", "title": "US defends partnership with UK and Australia after the French blast 'brutal' decision", "description": "American officials are defending a new deal to provide Australia with nuclear-powered submarines after French officials expressed frustration over the agreement's effect on an existing multibillion-dollar defense deal.", "url": "https://www.cnn.com/2021/09/16/politics/aukus-france-us-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915171229-02-biden-national-security-0915-super-tease.jpg", "publishedAt": "2021-09-16T20:53:31Z", "content": "(CNN)American officials are defending a new deal to provide Australia with nuclear-powered submarines after French officials expressed frustration over the agreement's effect on an existing multibill… [+5651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "She survived a suicide bomb. Now her app is helping keep other Afghans safe", "description": "Ehtesab -- which roughly translates to \"accountability\" -- is an Afghan-created app that verifies instances of explosions, power outages, checkpoints, and other need-to-know information in Kabul. Since the Taliban took control of the city, the app has seen a …", "url": "https://www.cnn.com/videos/business/2021/09/16/ehtesab-afghan-crisis-alert-app-jg-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916155117-ehtesab-afghan-app-super-tease.jpg", "publishedAt": "2021-09-16T20:45:08Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Dean and Nicolo Ruotolo, CNN", "title": "Italy to mandate Covid-19 'Green Pass' for all workers", "description": "The Italian government has approved a decree making it mandatory for all public and private sector workers to show proof of vaccination, a negative test or recent recovery from infection, Italian Health Minister Roberto Speranza told a news conference on Thur…", "url": "https://www.cnn.com/2021/09/16/europe/italy-covid-19-green-pass-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916161356-italy-vaccination-green-pass-file-super-tease.jpg", "publishedAt": "2021-09-16T20:31:31Z", "content": "Rome (CNN)The Italian government has approved a decree making it mandatory for all public and private sector workers to show proof of vaccination, a negative test or recent recovery from infection, I… [+2326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "White House has told governors how many Afghan refugees they can expect to be resettled", "description": "The White House has informed governors about the number of Afghan refugees they can expect to be resettled in their states in coming weeks, an administration official told CNN Thursday.", "url": "https://www.cnn.com/2021/09/16/politics/white-house-governors-afghan-refugees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210903230238-01-afg-refugees-dulles-airport-083121-super-tease.jpg", "publishedAt": "2021-09-16T20:08:18Z", "content": "Washington (CNN)The White House has informed governors about the number of Afghan refugees they can expect to be resettled in their states in coming weeks, an administration official told CNN Thursda… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "First on CNN: White House economists say a clean energy transition will lower consumer costs", "description": "The White House economists write that the costs of not responding to climate change through Biden's legislation will be steep.", "url": "https://www.cnn.com/2021/09/16/politics/white-house-economists-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916151428-01-biden-colorado-climate-0914-super-tease.jpg", "publishedAt": "2021-09-16T19:53:05Z", "content": "(CNN)In a blog post shared first with CNN, White House economists argue that President Joe Biden's climate agenda will not only cut carbon emissions but also bring down costs for consumers. \r\nWhite H… [+3407 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico", "title": "The iPhone 13 is coming — here's who should (and shouldn't) upgrade", "description": "Wondering if the new iPhone 13 is for you? Here are the biggest reasons to upgrade, as well as a few good reasons to hold out.", "url": "https://www.cnn.com/2021/09/16/cnn-underscored/should-you-upgrade-to-iphone-13/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210916144754-iphone-13-pro-should-you-upgrade-lead.jpg?q=x_0,y_0,h_946,w_1681,c_fill/w_800", "publishedAt": "2021-09-16T19:51:16Z", "content": "Few things are guaranteed these days, but you can always count on a new iPhone releasing every fall and the temptation to upgrade that comes with it. The new iPhone 13 and iPhone 13 Pro are looking l… [+9727 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and Katelyn Polantz, CNN", "title": "Special counsel Durham's probe into origins of Trump-Russia investigation nears end", "description": "Special counsel John Durham is nearing the conclusion of his more than two-year-long probe into the origins of the Trump-Russia investigation and faces a looming deadline on whether to seek charges over the handling of evidence used in the probe, according to…", "url": "https://www.cnn.com/2021/09/16/politics/john-durham-probe-nears-end-trump-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916151718-john-durham-super-tease.jpg", "publishedAt": "2021-09-16T19:48:42Z", "content": "(CNN)Special counsel John Durham is nearing the conclusion of his more than two-year-long probe into the origins of the Trump-Russia investigation and faces a looming deadline on whether to seek char… [+6848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "DHS warns of potential for violence surrounding the 'Justice for J6' rally in intelligence brief", "description": "The Department of Homeland Security warned Thursday about the potential for violence from people involved in or opposed to the \"Justice for J6\" rally planned for Saturday, according to an unclassified intelligence briefing that was shared with state and local…", "url": "https://www.cnn.com/2021/09/16/politics/dhs-intelligence-brief-potential-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914105158-dhs-seal-super-tease.jpg", "publishedAt": "2021-09-16T19:41:38Z", "content": "(CNN)The Department of Homeland Security warned Thursday about the potential for violence from people involved in or opposed to the \"Justice for J6\" rally planned for Saturday, according to an unclas… [+2751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katharina Krebs, CNN", "title": "Dutch Foreign Minister Sigrid Kaag resigns over Afghanistan crisis", "description": "Dutch Foreign Minister Sigrid Kaag announced her resignation on Thursday after a majority of the Dutch parliament said she had mishandled the Afghanistan evacuation crisis, a press officer from the Dutch Ministry of Foreign Affairs told CNN.", "url": "https://www.cnn.com/2021/09/16/europe/dutch-minister-resigns-afghanistan-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210820220817-03-afghanistan-0820-kabul-airport-super-tease.jpg", "publishedAt": "2021-09-16T19:41:28Z", "content": "(CNN)Dutch Foreign Minister Sigrid Kaag announced her resignation on Thursday after a majority of the Dutch parliament said she had mishandled the Afghanistan evacuation crisis, a press officer from … [+1235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Republican Governors Association was hacked earlier this year", "description": "Hackers breached the Republican Governors Association in February, potentially exposing the personal data of nearly 500 people affiliated with the organization, the RGA said in a September 15 public filing.", "url": "https://www.cnn.com/2021/09/16/politics/republican-governors-association-hacked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621154549-hackers-keyboard-super-tease.jpg", "publishedAt": "2021-09-16T19:38:17Z", "content": "Washington (CNN)Hackers breached the Republican Governors Association in February, potentially exposing the personal data of nearly 500 people affiliated with the organization, the RGA said in a Sept… [+3302 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Mascarenhas, CNN", "title": "Mass shootings in the US increased during the coronavirus pandemic, study finds", "description": "Mass shootings in the United States increased during the coronavirus pandemic, and even doubled in July 2020 compared to a year earlier, according to research published in the journal JAMA Open Network Thursday.", "url": "https://www.cnn.com/2021/09/16/us/mass-shootings-increased-in-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916145452-englewood-chicago-shooting-0617-super-tease.jpg", "publishedAt": "2021-09-16T19:18:31Z", "content": "(CNN)Mass shootings in the United States increased during the coronavirus pandemic, and even doubled in July 2020 compared to a year earlier, according to research published in the journal JAMA Open … [+1634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Federal judge blocks Biden administration from expelling migrant families under public health order", "description": "A federal judge blocked the Biden administration from expelling migrant families apprehended at the US-Mexico border under a public health order, according to a Thursday ruling, marking a major defeat for the administration.", "url": "https://www.cnn.com/2021/09/16/politics/federal-judge-blocks-administration-expulsion-of-migrant-families/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915190129-us-mexico-border-august-2021-super-tease.jpg", "publishedAt": "2021-09-16T18:49:15Z", "content": "(CNN)A federal judge blocked the Biden administration from expelling migrant families apprehended at the US-Mexico border under a public health order, according to a Thursday ruling, marking a major … [+1449 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Lawmakers launch investigation into climate crisis disinformation by fossil fuel industry", "description": "The House Oversight and Reform Committee announced Thursday it is launching an investigation into fossil fuel industry disinformation on the climate crisis. The committee invited the heads of six oil companies and major lobbying groups to testify in front of …", "url": "https://www.cnn.com/2021/09/16/politics/house-investigation-fossil-fuel-disinformation-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916135841-oil-refinery-2020-super-tease.jpg", "publishedAt": "2021-09-16T18:44:29Z", "content": "(CNN)The House Oversight and Reform Committee announced Thursday it is launching an investigation into fossil fuel industry disinformation on the climate crisis. The committee invited the heads of si… [+3273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Eyes of Tammy Faye' isn't as good as Jessica Chastain's performance", "description": "The stars outshine the movie in \"The Eyes of Tammy Faye,\" a dazzling showcase for Jessica Chastain and Andrew Garfield as Tammy Faye and Jim Bakker in a dutiful, somewhat disjointed chronicle of how the televangelists amassed great wealth before his disgraced…", "url": "https://www.cnn.com/2021/09/16/entertainment/eyes-of-tammy-faye-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915133245-01-eyes-of-tammy-faye-super-tease.jpg", "publishedAt": "2021-09-16T18:27:57Z", "content": "(CNN)The stars outshine the movie in \"The Eyes of Tammy Faye,\" a dazzling showcase for Jessica Chastain and Andrew Garfield as Tammy Faye and Jim Bakker in a dutiful, somewhat disjointed chronicle of… [+3464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Cipriani", "title": "Abode Cam 2 review: A $35 camera that punches above its weight", "description": "The $35 Abode Cam 2 is affordable, can be used with or without a full Abode security system, and with a $15 monthly subscription, the camera will keep a 24/7 record of anything that happens within its view.", "url": "https://www.cnn.com/2021/09/16/cnn-underscored/abode-cam-2-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210915120212-abode-cam-2-review-6.jpg?q=x_2,y_0,h_900,w_1599,c_crop/w_800", "publishedAt": "2021-09-16T18:20:03Z", "content": "Theres no shortage of home security companies and products that offer peace of mind through various means. Abode, whose main product offering is whole-home DIY security systems and monitoring, has a … [+7697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Morrow, CNN Business", "title": "Jaw-dropping moments in WSJ's bombshell Facebook investigation", "description": "This week the Wall Street Journal released a series of scathing articles about Facebook, citing leaked internal documents that detail in remarkably frank terms how the company is not only well aware of its platforms' negative effects on users but also how it …", "url": "https://www.cnn.com/2021/09/16/business/facebook-wsj-investigation-highlights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916133235-mark-zuckerberg-0602-restricted-super-tease.jpg", "publishedAt": "2021-09-16T18:08:11Z", "content": "New York (CNN Business)This week the Wall Street Journal released a series of scathing articles about Facebook, citing leaked internal documents that detail in remarkably frank terms how the company … [+4086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "United CEO: Employer mandate is the best way to raise vaccination rates", "description": "United Airlines has achieved a high level of compliance with the strict vaccine mandate it set for its 67,000 US employees. But the airline's CEO doesn't believe expanding that requirement to passengers is a good idea.", "url": "https://www.cnn.com/2021/09/16/business/united-ceo-vaccine-mandates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916120135-01-united-airlines-covid-vaccine-employees-super-tease.jpeg", "publishedAt": "2021-09-16T17:50:46Z", "content": "(CNN)United Airlines has achieved a high level of compliance with the strict vaccine mandate it set for its 67,000 US employees. But the airline's CEO doesn't believe expanding that requirement to pa… [+3773 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "DHS upheaval comes as policy tensions bubble over", "description": "Infighting within the Biden administration over the onslaught of challenges facing officials has, at times, stalled decision making on key issues, frustrating officials, sources tell CNN.", "url": "https://www.cnn.com/2021/09/16/politics/biden-department-of-homeland-security-departures/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916132844-02-alejandro-mayorkas-0909-super-tease.jpg", "publishedAt": "2021-09-16T17:45:57Z", "content": "(CNN)Infighting within the Biden administration over the onslaught of challenges facing officials has, at times, stalled decision making on key issues, frustrating officials, sources tell CNN. \r\nThis… [+7836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "'Incredibly dangerous': Trump is trying to get Big Lie promoters chosen to run the 2024 election", "description": "Former President Donald Trump is trying to get people who tried to overturn the 2020 election chosen to be in charge of the 2024 election.", "url": "https://www.cnn.com/2021/09/16/politics/trump-secretary-of-state-big-lie/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916125223-state-rep-mark-finchem-super-tease.jpg", "publishedAt": "2021-09-16T17:45:29Z", "content": "Washington (CNN)Swing state by swing state, former President Donald Trump is trying to get people who tried to overturn the 2020 election chosen to be in charge of the 2024 election. \r\nTrump's Monday… [+6370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Walmart tests self-driving delivery cars", "description": "Walmart is testing a driverless car, in partnership with Ford and Argo AI, that delivers your order straight to your door. HLN's Elizabeth Prann reports.", "url": "https://www.cnn.com/videos/business/2021/09/16/walmart-car-delivery-ford-argo-ai-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916114204-walmart-self-driving-delivery-super-tease.jpeg", "publishedAt": "2021-09-16T17:03:30Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "Satellite images reveal North Korea expanding facility used to produce weapons-grade uranium", "description": "New satellite images obtained by CNN reveal North Korea is expanding a key facility capable of enriching uranium for nuclear weapons, renovations that likely indicate the country plans to significantly ramp-up production at this once-dormant site in the near …", "url": "https://www.cnn.com/2021/09/16/politics/north-korea-yongbyon-expansion-satellite-images/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915140651-nk-satellite-photos-yongbyon-expansion-super-tease.jpg", "publishedAt": "2021-09-16T17:00:31Z", "content": "Washington (CNN)New satellite images obtained by CNN reveal North Korea is expanding a key facility capable of enriching uranium for nuclear weapons, renovations that likely indicate the country plan… [+7795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Luke McGee, CNN", "title": "America's deal with UK and Australia leaves France bruised and Europe in the cold on China", "description": "The surprise announcement that the United States, United Kingdom and Australia have agreed a defense pact that will go some way toward countering China in the Indo-Pacific region sparked an array of emotions. In Europe, it left the French government furious a…", "url": "https://www.cnn.com/2021/09/16/world/aukus-leaves-europe-in-the-cold-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915171229-02-biden-national-security-0915-super-tease.jpg", "publishedAt": "2021-09-16T16:48:53Z", "content": "(CNN)The surprise announcement that the United States, United Kingdom and Australia have agreed a defense pact that will go some way toward countering China in the Indo-Pacific region sparked an arra… [+6635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why the debt ceiling debate is just plain dumb", "description": "Every few years, the most Washington possible debate engulfs the nation's capitol: Whether or not to raise the debt ceiling.", "url": "https://www.cnn.com/2021/09/16/politics/debt-ceiling-mcconnell-schumer-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180212125818-01-schumer-mcconnell-02-12-2018-super-tease.jpg", "publishedAt": "2021-09-16T16:40:31Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}]}