{"status": "ok", "totalResults": 136, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rosanne Salvatore", "title": "The best grill brushes of 2021", "description": "Using a wire brush to clean your grill could be hazardous to your health, so we set out to find the best grill brush without wire bristles.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/best-grill-brush/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804140625-underscored-grill-brush-kona-lead-image-super-169.jpg", "publishedAt": "2021-08-06T13:00:08Z", "content": "Whether youre whipping up a batch of hamburgers or slow cooking ribs basted in barbecue sauce on your charcoal grill, you know that grilling can get pretty messy. Cleaning your grill after each use i… [+5560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dana Peterson for CNN Business Perspectives", "title": "It may look like a bubble, but the US isn't heading for another housing crisis", "description": "Basic supply and demand factors — not speculation, predatory lending and/or bad underwriting — are driving home prices.", "url": "https://www.cnn.com/2021/08/06/perspectives/housing-market-home-prices/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803131434-us-home-construction-0706-restricted-super-tease.jpg", "publishedAt": "2021-08-06T12:33:53Z", "content": "Dana Peterson is an executive vice president and chief economist at The Conference Board. The opinions expressed in this commentary are her own. \r\nHome prices have surged during the pandemic, leaving… [+4585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner", "title": "Coke is changing the recipe of a popular drink. A lot could go wrong", "description": "If you've had a sip of Coke Zero Sugar recently and thought that it tastes a little different, you're not crazy. The company is rolling out across the United States a new version of the beverage designed to taste more like regular Coke.", "url": "https://www.cnn.com/2021/08/06/business/new-coke-zero/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802170007-file-new-coke-and-coca-cola-classic-1985-super-169.jpg", "publishedAt": "2021-08-06T12:20:02Z", "content": "If youve had a sip of Coke Zero Sugar recently and thought that it tastes a little different, youre not crazy. The company is rolling outacross the United States a new version of the beverage designe… [+7953 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on the Covid-19 pandemic in the US", "description": "The Delta variant continues to spread across the US accounting for more than 90% of Covid-19 cases. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-06-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175742-05-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-08-06T12:12:01Z", "content": "United Airlines will join the growing list of companies that are requiring employees get vaccinated against Covid-19, the first major US airline to implement such a mandate.\r\nA United executive said … [+3182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Mike Lindell got owned in the worst possible way on his ridiculous election fraud claims", "description": "Mike Lindell is the single most prominent pusher this side of Donald Trump of the Big Lie -- the idea that the 2020 election was somehow stolen despite zero evidence to back up that claim.", "url": "https://www.cnn.com/2021/08/06/politics/mike-lindell-mypillow-2020-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154953-lindell-trump-rally-oct-2019-super-tease.jpg", "publishedAt": "2021-08-06T12:06:59Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz, CNN Business", "title": "How a deepfake Tom Cruise on TikTok turned into a very real AI company", "description": "Earlier this year, videos of Tom Cruise started popping up on TikTok of the actor doing some surprisingly un-Tom-Cruise-like stuff: goofing around in an upscale men's clothing store; showing off a coin trick; growling playfully during a short rendition of Dav…", "url": "https://www.cnn.com/2021/08/06/tech/tom-cruise-deepfake-tiktok-company/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210728165027-02-deepfake-tom-cruise-tiktok-super-tease.jpg", "publishedAt": "2021-08-06T11:45:36Z", "content": "(CNN Business)Earlier this year, videos of Tom Cruise started popping up on TikTok of the actor doing some surprisingly un-Tom-Cruise-like stuff: goofing around in an upscale men's clothing store; sh… [+8352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David McKenzie", "title": "Jailed former South African President Zuma admitted to hospital for medical observation", "description": "Jailed former South African president Jacob Zuma has been admitted to an outside hospital for medical observation, the country's Department of Correctional Services (DCS) said Friday in a statement.", "url": "https://www.cnn.com/2021/08/06/africa/jacob-zuma-hospitalized-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210223133256-jacob-zuma-super-169.jpg", "publishedAt": "2021-08-06T11:45:34Z", "content": "Jailed former South African president Jacob Zuma has been admitted to an outside hospital for medical observation, the countrys Department of Correctional Services (DCS) said Friday in a statement. \r… [+1460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "After a blown deadline and Democratic blowback, an urgent scramble for a new eviction ban", "description": "Even President Joe Biden did not sound particularly confident his administration's new freeze on evictions would hold up in court when he explained the move in the East Room this week. Instead, he said the new ban, even if challenged, would at least \"give som…", "url": "https://www.cnn.com/2021/08/06/politics/biden-eviction-moratorium-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804075846-04-biden-0803-super-tease.jpg", "publishedAt": "2021-08-06T11:32:46Z", "content": "(CNN)Even President Joe Biden did not sound particularly confident his administration's new freeze on evictions would hold up in court when he explained the move in the East Room this week. Instead, … [+7578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Wray, CNN", "title": "Must-watch videos of the week", "description": "Good Samaritans save a stranded orca, a woman fights off a coyote with a stick and Prince Harry surprises Meghan for her birthday. These are the must-watch videos of the week.", "url": "https://www.cnn.com/2021/08/06/world/videos-of-the-week-mobile-august-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731223124-alaska-stranded-orca-killer-whale-freed-super-tease.jpg", "publishedAt": "2021-08-06T11:29:38Z", "content": "(CNN)Good Samaritans save a stranded orca, a woman fights off a coyote with a stick and Prince Harry surprises Meghan for her birthday. These are the must-watch videos of the week. \r\nNational Oceanic… [+450 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Roth, Michael Conte and Sarah Dean", "title": "Tigrayan fighters reportedly seize control of UN World Heritage Site in Ethiopia", "description": "Fighters from Ethiopia's war-torn Tigray region have seized control of a UN World Heritage Site in a neighboring region, Reuters and AFP reported, citing eyewitnesses.", "url": "https://www.cnn.com/2021/08/06/africa/ethiopia-lalibela-tigray-forces-intl-afr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806100943-01-file-ethiopia-lalibela-rock-church-2011-super-169.jpg", "publishedAt": "2021-08-06T11:06:08Z", "content": "Fighters from Ethiopias war-torn Tigray region have seized control of a UN World Heritage Site in a neighboring region, Reuters and AFP reported, citing eyewitnesses.\r\nLalibela is home to 11 medieval… [+3600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Sharp decline in ads for Covid-19 vaccines, as the number of 'persuadable' Americans diminishes", "description": "As the Delta variant quickly spreads, and the number of US Covid-19 cases heads in the wrong direction, it's now more urgent than ever for people to get the Covid-19 vaccine. However, television ads persuading people to get vaccinated have declined sharply, a…", "url": "https://www.cnn.com/2021/08/06/health/covid-19-ads-why-theyve-gone-away/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709225656-us-coronavirus-saturday-0710-super-tease.jpg", "publishedAt": "2021-08-06T11:00:59Z", "content": "(CNN)As the Delta variant quickly spreads, and the number of US Covid-19 cases heads in the wrong direction, it's now more urgent than ever for people to get the Covid-19 vaccine. However, television… [+7590 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "56 years after the Voting Rights Act of 1965, lawmakers struggle to find common ground", "description": "President Lyndon B. Johnson signed the Voting Rights Act of 1965 into law on August 6, 1965.", "url": "https://www.cnn.com/2021/08/06/politics/voting-rights-act-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805210931-voting-rights-act-1965-signing-super-tease.jpg", "publishedAt": "2021-08-06T11:00:03Z", "content": "(CNN)President Lyndon B. Johnson signed the Voting Rights Act of 1965 into law on August 6, 1965.\r\nThe legislation served to protect and enforce the 14th and 15th Amendments of the Constitution. It w… [+4905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Aisha Salaudeen, CNN", "title": "Why is it so strange to get married and keep my surname in 2021?", "description": "Aisha Salaudeen has been getting grief -- often from strangers -- for not taking her husband's name after they got married last year. So the CNN producer set out to uncover the history of marital name change and asks why it remains such a big deal.", "url": "https://www.cnn.com/2021/08/06/opinions/maiden-name-history-rebellion-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210507052523-stock-proposal-super-tease.jpg", "publishedAt": "2021-08-06T10:59:47Z", "content": "Opinion by Aisha Salaudeen, CNN \r\nUpdated 6:59 AM ET, Fri August 6, 2021\r\nAisha Salaudeen is a CNN producer based in Lagos, Nigeria. The views expressed in this commentary belong solely to the author… [+5441 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Keith Magee", "title": "This isn't only a fight about Black voters", "description": "Keith Magee, on the 56th anniversary of the 1965 Voting Rights Act, writes that perhaps many Latinx, Asians, Native Americans and Whites hear the name John Lewis -- a Black icon -- and think that this is only a fight about Black American voters. If that's the…", "url": "https://www.cnn.com/2021/08/06/opinions/voting-rights-act-anniversary-us-democracy-in-danger-magee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806064628-voting-rights-op-ed-super-tease.jpg", "publishedAt": "2021-08-06T10:48:09Z", "content": "Keith Magee is a theologian, political adviser and social justice scholar. He is chair and professor of practice in social justice at Newcastle University in the United Kingdom and senior fellow in c… [+6193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "Job growth is picking up again, but the Delta spike could change that", "description": "America's job market recovery is chugging along, but worries about the Delta variant derailing progress are rampant. Even as economists anticipate the best gains since last summer in Friday's jobs report, persistently high unemployment claims and a big miss i…", "url": "https://www.cnn.com/2021/08/06/economy/july-jobs-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805144012-restricted-friday-jobs-report-super-tease.jpg", "publishedAt": "2021-08-06T10:26:55Z", "content": "New York (CNN Business)America's job market recovery is chugging along, but worries about the Delta variant derailing progress are rampant. Even as economists anticipate the best gains since last sum… [+3549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Icard, CNN", "title": "5 ways parents can support their tweens when a friendship ends", "description": "Tweens' friendships can end quickly and often in middle school, and it can feel devastating for them. Here is how parents can support their tweens when they face the end of a friendship.", "url": "https://www.cnn.com/2021/08/06/health/middle-school-tween-friendship-end-breakup-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805164233-upset-tween-stock-super-tease.jpg", "publishedAt": "2021-08-06T10:22:30Z", "content": "Welcome to our CNN Wellness five-part series on adolescence -- a tough time under any circumstances. As our children head back to school this fall, learn more about helping your tweens and teens unde… [+6901 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "Bryan Adams photographs Rita Ora, Cher and Iggy Pop for star-studded Pirelli calendar", "description": "Singer-turned-photographer Bryan Adams recreated life on tour for the 2022 edition of Pirelli's glamorous annual calendar, which is themed \"On the Road.\"", "url": "https://www.cnn.com/style/article/bryan-adams-pirelli-calendar/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805230446-05-bryan-adams-pirelli-calendar-cher-grimes-super-tease.jpg", "publishedAt": "2021-08-06T08:04:22Z", "content": "artsPublished 6th August 2021\r\nThe days of stadium concerts may feel like a distant memory, but singer-turned-photographer Bryan Adams is recreating the touring lifestyle with the likes of Iggy Pop, … [+3943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aisha Salaudeen, CNN", "title": "Nigeria's social media comedians are making laughter pay", "description": "In Nigeria, an emerging crop of young comics are leveraging social media to create video content that makes people laugh -- and makes money.", "url": "https://www.cnn.com/2021/08/06/africa/nigeria-comedy-social-media-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803073906-01-nigeria-comedy-social-media-split-super-tease.jpg", "publishedAt": "2021-08-06T08:01:35Z", "content": "Lagos, Nigeria (CNN)In Nigeria, Africa's most populous country, an emerging crop of young comics are leveraging social media to create video content that makes people laugh -- and makes money.\r\nWhat … [+5742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallika Kallingal and Andy Rose", "title": "Idaho prosecutors plan to seek death penalty against Chad Daybell in alleged murders of two children and his first wife", "description": "Prosecutors in Idaho are planning to seek the death penalty in the murder case against Chad Daybell, according to a court document filed Thursday. Daybell is accused of conspiring with his current wife, Lori Vallow, to murder two of her children and his first…", "url": "https://www.cnn.com/2021/08/06/us/chad-daybell-death-penalty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806000049-chad-daybell-court-hearing-file-2020-super-169.jpg", "publishedAt": "2021-08-06T07:54:43Z", "content": "Prosecutors in Idaho are planning to seek the death penalty in the murder case against Chad Daybell, according to a court document filed Thursday. Daybell is accused of conspiring with his current wi… [+2408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yasmin Coles, Sophie Jeong and Jessie Yeung, CNN", "title": "Manila residents crowd vaccination centers in rush before lockdown", "description": "Residents in the Philippine capital are rushing to get Covid-19 vaccines, crowding into vaccination centers and waiting in long lines outside, ahead of a two-week lockdown that goes into effect Friday evening.", "url": "https://www.cnn.com/2021/08/06/asia/manila-philippines-vaccine-lockdown-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806000917-01-philippines-manila-lockdown-vaccine-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-06T07:38:10Z", "content": "Manila, Philippines (CNN)Residents in the Philippine capital are rushing to get Covid-19 vaccines, crowding into vaccination centers and waiting in long lines outside, ahead of a two-week lockdown th… [+2429 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Breakthrough Covid-19 infections of vaccinated people are expected. But the unvaccinated are 'the big highway of transmission,' experts say", "description": "Tens of thousands of vaccinated people may catch Covid-19, but the majority will not fall severely ill — a testament to the efficacy of inoculations even against the Delta variant that has been fueling case surges across the US, a top health official said.", "url": "https://www.cnn.com/2021/08/06/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806000555-springfield-mo-vaccination-0805-super-tease.jpg", "publishedAt": "2021-08-06T07:16:20Z", "content": "(CNN)Tens of thousands of vaccinated people may catch Covid-19, but the majority will not fall severely ill a testament to the efficacy of inoculations even against the Delta variant that has been fu… [+8003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Militia finds 40 bodies in Myanmar jungle after army crackdown, says UN envoy", "description": "A Myanmar militia force fighting the army in a central part of the country and residents have found at least 40 bodies in jungle areas in recent weeks, including some showing signs of torture, said a militia member and Myanmar's UN envoy.", "url": "https://www.cnn.com/2021/08/06/asia/myanmar-bodies-found-army-crackdown-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806020404-map-kani-myanmar-0806-super-169.jpg", "publishedAt": "2021-08-06T06:21:59Z", "content": "A Myanmar militia force fighting the army in a central part of the country and residents have found at least 40 bodies in jungle areas in recent weeks, including some showing signs of torture, said a… [+2262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and Steve George, CNN", "title": "Beijing doubles down on baseless 'US origins' Covid conspiracy as Delta outbreak worsens", "description": "As Beijing grapples with a worsening outbreak of the Delta variant, an outlandish conspiracy theory linking the origin of the coronavirus to the United States military has gained renewed traction in China.", "url": "https://www.cnn.com/2021/08/06/china/china-covid-origin-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806000414-file-fort-detrick-2002-super-tease.jpg", "publishedAt": "2021-08-06T05:53:21Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+11858 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 40 photos", "description": "Take a look at 40 photos of the week from July 29 to August 5.", "url": "https://www.cnn.com/2021/08/06/world/gallery/photos-this-week-july-29-august-5/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162612-06-photos-this-week-0805-super-tease.jpg", "publishedAt": "2021-08-06T04:40:38Z", "content": "Open Menu\r\nprevious image\r\nnext image\r\nUS gymnast Simone Biles is congratulated by coach Cecile Canqueteau-Landi as it became evident that Biles would win an Olympic medal in the balance beam final o… [+10796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson", "title": "Why the infrastructure bill is more important than ever for Biden", "description": "The bipartisan infrastructure bill making its precarious way through the Senate was always a cornerstone of Joe Biden's presidency. Now, it's even more vital for an administration badly needing wins as the White House struggles to navigate multiple crises.", "url": "https://www.cnn.com/2021/08/06/politics/president-joe-biden-senate-infrastructure-politics-republicans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805094717-02-joe-biden-0729-super-169.jpg", "publishedAt": "2021-08-06T04:03:57Z", "content": "The bipartisan infrastructure bill making its precarious way through the Senate was always a cornerstone of Joe Bidens presidency. Now, its even more vital for an administration badly needing wins as… [+7721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Adam Renton, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-06-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-06T04:00:05Z", "content": "There's still plenty of competition left as the Olympics head into their final weekend. But a storm, hot weather and rising coronavirus cases loom over the forthcoming finale of the Tokyo Games. \r\nCo… [+3477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Ron DeSantis is a big problem for Biden", "description": "As Covid cases and hospitalizations surge in Florida, Gov. Ron DeSantis is resisting President Joe Biden's initiatives to fight back. The tension between the two leaders proves that Biden's problem with the pandemic is political, writes Julian Zelizer.", "url": "https://www.cnn.com/2021/08/05/opinions/joe-biden-ron-desantis-covid-vaccine-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802043232-florida-gov-ron-desantis-file-0713-super-tease.jpg", "publishedAt": "2021-08-06T02:56:26Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+4661 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Jennifer Hauser", "title": "Belarusian Olympic officials who allegedly tried to force sprinter onto plane stripped of accreditation", "description": "The International Olympic Committee has revoked the accreditation of two Belarusian coaches allegedly involved in trying to force sprinter Kristina Timanovskaya to return home against her will.", "url": "https://www.cnn.com/2021/08/05/sport/ioc-revokes-belarus-accreditation-olympics-spt-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805223216-01-kristina-timanovskaya-0805-super-169.jpg", "publishedAt": "2021-08-06T02:48:42Z", "content": "The International Olympic Committee has revoked the accreditation of two Belarusian coaches allegedly involved in trying to force sprinter Kristina Timanovskaya to return home against her will. \r\nBel… [+3764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Reuters", "title": "Indonesia's controversial 'Jurassic Park' project going ahead in Komodo National Park", "description": "Construction on an Indonesian tourism project dubbed \"Jurassic Park\" on social media will continue, the southeast Asian country's environment ministry said on August 5, despite UNESCO warnings the plans could have a negative environmental impact.", "url": "https://www.cnn.com/travel/article/indonesia-komodo-jurassic-park-project-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805222608-indonesia-komodo-jurassic-park-project-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-06T02:39:45Z", "content": "Construction on an Indonesian tourism project dubbed \"Jurassic Park\" on social media will continue, the southeast Asian country's environment ministry said on August 5, despite UNESCO warnings the pl… [+2081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Rebecca Saunders, CNN", "title": "Why summer is spooky season in Japan", "description": "High temperatures during the Tokyo Olympics have been making headlines around the world. But the weather cooking the capital is not unusual. Japanese summers are notoriously sticky and sweaty, and for many Japanese people, spooky.", "url": "https://www.cnn.com/travel/article/japan-summer-spooky-season-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805091159-04-tokyo-spooky-festival-061520-file-super-tease.jpg", "publishedAt": "2021-08-06T01:46:18Z", "content": "(CNN) High temperatures during the Tokyo Olympics have been making headlines around the world. \r\nIn fact, the event may go down as one of the hottest and most humid in the history of the Games. \r\nLas… [+8013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, Clare Foran and Manu Raju, CNN", "title": "Schumer moves to shut down debate on infrastructure bill in key step toward final vote", "description": "Senate Majority Leader Chuck Schumer moved on Thursday night to cut off debate on the $1.2 trillion bipartisan infrastructure bill, paving the way for swift passage of the sweeping legislation that would enact key elements of President Joe Biden's economic ag…", "url": "https://www.cnn.com/2021/08/05/politics/infrastructure-bill-schumer-shut-down-debate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803101818-us-capitol-0802-super-tease.jpg", "publishedAt": "2021-08-06T01:20:26Z", "content": "(CNN)Senate Majority Leader Chuck Schumer moved on Thursday night to cut off debate on the $1.2 trillion bipartisan infrastructure bill, paving the way for swift passage of the sweeping legislation t… [+4560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan, Curt Devine and Drew Griffin, CNN", "title": "MyPillow magnate Mike Lindell's latest election conspiracy theory is his most bizarre yet", "description": "MyPillow CEO Mike Lindell, a close ally of former President Donald Trump, has emerged as one of the most vocal boosters still pushing false claims about the 2020 election. His latest theory about vote-switching is outrageous.", "url": "https://www.cnn.com/2021/08/05/politics/mike-lindell-mypillow-ceo-election-claims-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154953-lindell-trump-rally-oct-2019-super-tease.jpg", "publishedAt": "2021-08-06T00:30:44Z", "content": "(CNN)Since the presidential election, Christina Jensen says she's been stopped on the street several times by acquaintances who wanted to share troubling news: hackers from Beijing had switched nearl… [+15306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "READ: Congressional Budget Office report on the bipartisan infrastructure plan and what it costs", "description": "The Congressional Budget Office offers lawmakers an assessment of how much legislation will cost the US taxpayer if implemented. A new report from the CBO out Thursday says a bipartisan infrastructure plan, currently making its way through the Senate, would a…", "url": "https://www.cnn.com/2021/08/05/politics/cbo-infrastructure-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729152353-us-capitol-building-0726-super-tease.jpg", "publishedAt": "2021-08-05T23:05:59Z", "content": "(CNN)The Congressional Budget Office offers lawmakers an assessment of how much legislation will cost the US taxpayer if implemented. A new report from the CBO out Thursday says a bipartisan infrastr… [+135 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten and Dianne Gallagher, CNN", "title": "Democrats scramble to find a path forward on federal legislation on voting rights as Texas Gov. Greg Abbott calls new special session", "description": "Texas Gov. Greg Abbott has escalated the Republican push to pass new voting restrictions in the state, announcing on Thursday a second special session of the state legislature that could continue the bitter standoff with Democrats in the Texas House who broke…", "url": "https://www.cnn.com/2021/08/05/politics/texas-special-session-federal-voting-legislation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729135223-01-gov-greg-abbott-0608-super-tease.jpg", "publishedAt": "2021-08-05T23:02:41Z", "content": "(CNN)Texas Gov. Greg Abbott has escalated the Republican push to pass new voting restrictions in the state, announcing on Thursday a second special session of the state legislature that could continu… [+6167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Donald Judd", "title": "Biden signs bill to award Congressional Gold Medal to police who responded to insurrection", "description": "President Joe Biden signed a bill into law at the White House on Thursday to award congressional gold medals to the police forces that responded to the insurrection at the US Capitol on January 6.", "url": "https://www.cnn.com/2021/08/05/politics/joe-biden-capitol-police-officers-award/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805184511-bidencongressional-gold-medal-0805-super-169.jpg", "publishedAt": "2021-08-05T22:48:25Z", "content": "President Joe Biden signed a bill into law at the White House on Thursday to award congressional gold medals to the police forces that responded to the insurrection at the US Capitol on January 6. \r\n… [+2451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Miguel Marquez, Dakin Andone and Meridith Edwards", "title": "Alabama has one of the lowest vaccination rates in the US. Now it's starting to rise", "description": "Joan Chang, 42, is 33 weeks pregnant with her second child. But it wasn't until last week that she got her first dose of a Covid-19 vaccine.", "url": "https://www.cnn.com/2021/08/05/us/alabama-vaccination-rate-uptick/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805144330-01-alabama-vaccines-0730-super-169.jpg", "publishedAt": "2021-08-05T22:37:50Z", "content": "Joan Chang, 42, is 33 weeks pregnant with her second child. But it wasnt until last week that she got her first dose of a Covid-19 vaccine. \r\nChang, who works in the banking industry, has been workin… [+7270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Cori Bush just handed Republicans a 2022 gift", "description": "Missouri Rep. Cori Bush (D) has had quite a week.", "url": "https://www.cnn.com/2021/08/05/politics/cori-bush-defund-the-police-private-security/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210113184419-cori-bush-file-super-tease.jpg", "publishedAt": "2021-08-05T22:30:33Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler and Kylie Atwood", "title": "US 'not ready to throw in the towel' on Afghan talks even as Taliban violence grows", "description": "The Biden administration has continued to back negotiations between the Afghan government and the Taliban, insisting the latter is still invested in the political process and political success is still possible, even as the international community has accused…", "url": "https://www.cnn.com/2021/08/05/politics/afghanistan-diplomacy-state-department/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805172037-intra-afgan-talks-sept-2020-super-169.jpg", "publishedAt": "2021-08-05T22:29:26Z", "content": "The Biden administration has continued to back negotiations between the Afghan government and the Taliban, insisting the latter is still invested in the political process and political success is sti… [+6173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Apple to start checking iPhone and iCloud photos for child abuse imagery", "description": "Apple on Thursday said it will begin testing a new system to automatically match photos on iPhones and uploaded iCloud accounts to a database of child sexual abuse images and alert authorities as needed.", "url": "https://www.cnn.com/2021/08/05/tech/apple-photos-child-abuse-imagery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419151703-iphone-12-file-super-tease.jpg", "publishedAt": "2021-08-05T22:23:12Z", "content": "(CNN Business)Apple on Thursday said it will begin testing a new system to automatically match photos on iPhones and uploaded iCloud accounts to a database of child sexual abuse images and alert auth… [+3140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena", "title": "Biden's electric vehicle sales goal won't be too hard to reach by 2030", "description": "President Joe Biden announced an agreement Thursday that aims to push the US auto industry to sell more electric vehicles. The goals include a \"shared aspiration\" that 40% to 50% of vehicles sold in the US will be electric, plug-in hybrids or hydrogen-powered.", "url": "https://www.cnn.com/2021/08/05/cars/biden-electric-vehicle-sales-goal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805155053-nissan-electric-vehicle-0422-super-169.jpg", "publishedAt": "2021-08-05T21:45:15Z", "content": "President Joe Biden announced an agreement Thursday that aims to push the US auto industry to sell more electric vehicles. The goals include a shared aspiration that 40% to 50% of vehicles sold in th… [+3278 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams and Joe Sutton", "title": "A venomous West African banded cobra is missing in a Texas neighborhood", "description": "Wildlife experts are setting out traps and searching a Grand Prairie, Texas, neighborhood for a large, venomous West African banded cobra that's been missing since Tuesday evening.", "url": "https://www.cnn.com/2021/08/05/us/missing-cobra-texas-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805141213-texas-missing-snake-super-169.jpg", "publishedAt": "2021-08-05T21:43:39Z", "content": "Wildlife experts are setting out traps and searching a Grand Prairie, Texas, neighborhood for a large, venomous West African banded cobra thats been missing since Tuesday evening.\r\nWe dont know if th… [+1932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Top cyber official makes debut calling for more 'ambitious' defenses and wearing a 'Free Britney' shirt", "description": "In her first major speech since taking office, Cybersecurity and Infrastructure Security Agency Director Jen Easterly sought to elevate the young agency, pushing for more cybersecurity talent across the US and announcing a new initiative collaborating with th…", "url": "https://www.cnn.com/2021/08/05/politics/easterly-cisa-debut-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805144850-restricted-jen-easterly-08-05-2021-super-tease.jpg", "publishedAt": "2021-08-05T21:41:02Z", "content": "(CNN)In her first major speech since taking office, Cybersecurity and Infrastructure Security Agency Director Jen Easterly sought to elevate the young agency, pushing for more cybersecurity talent ac… [+5667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Torgan, CNN", "title": "Home is where the heart is: This CNN Hero is housing transplant patients near their hospitals", "description": "A heart transplant saved Ava Kaufman's life. Now she's working to help and house others whose lives depend on organ donation.", "url": "https://www.cnn.com/2021/08/05/health/los-angeles-hospital-housing-transplant-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805101427-los-angeles-hospital-apartment-transplant-cnnheroes-00044504-super-tease.png", "publishedAt": "2021-08-05T21:38:32Z", "content": "Los Angeles (CNN)Twelve years ago, Ava Kaufman was fighting for her life. Now, thanks to a donor heart and successful organ transplant, she's alive -- and saving others. \r\n\"My life changed on a dime,… [+3648 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins", "title": "FDA could lay out a national strategy for Covid-19 booster shots in early September", "description": "Internal discussions at the US Food and Drug Administration have centered around an early September timeline for laying out a strategy on Covid-19 vaccine booster shots, a Biden administration official told CNN.", "url": "https://www.cnn.com/2021/08/05/politics/fda-covid-booster-shot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805173244-vaccine-vial-file-super-169.jpg", "publishedAt": "2021-08-05T21:35:11Z", "content": "Internal discussions at the US Food and Drug Administration have centered around an early September timeline for laying out a strategy on Covid-19 vaccine booster shots, a Biden administration offici… [+839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "Los Angeles police investigating possible excessive use of force in arrest of NBA center Jaxson Hayes", "description": "The Los Angeles Police Department has launched an investigation into whether officers used excessive force while arresting NBA Pelicans center Jaxson Hayes, a department spokesperson confirmed to CNN Wednesday.", "url": "https://www.cnn.com/2021/08/05/us/jaxson-hayes-los-angeles-police-investigation-excessive-force/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805170835-jaxson-hayes-file-02-super-tease.jpg", "publishedAt": "2021-08-05T21:28:40Z", "content": "(CNN)The Los Angeles Police Department has launched an investigation into whether officers used excessive force while arresting NBA Pelicans center Jaxson Hayes, a department spokesperson confirmed t… [+1883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "Virgin Galactic reopens ticket sales — for $450,000 per seat", "description": "Virgin Galactic says its re-opening ticket sales for the first time in years, giving anyone who can afford it the chance to reserve a seat on the company's rocket-powered suborbital space plane for $450,000, a significant markup over what tickets were previou…", "url": "https://www.cnn.com/2021/08/05/tech/virgin-galactic-ticket-prices-sales-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805165500-virgin-galactic-space-plane-unity-0711-super-169.jpg", "publishedAt": "2021-08-05T21:24:59Z", "content": "Virgin Galactic says its re-opening ticket sales for the first time in years, giving anyone who can afford it the chance to reserve a seat on the companys rocket-powered suborbital space plane for $4… [+2712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Just 4% of Hispanic or Latino people prefer the term 'Latinx,' new Gallup poll finds", "description": "The use of the term \"Latinx\" has been a divisive issue for some time --  and a new poll shows that it's the least popular signifier among Hispanic and Latino people.", "url": "https://www.cnn.com/2021/08/05/us/latinx-gallup-poll-preference-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805163816-latinx-protest-sign-super-tease.jpg", "publishedAt": "2021-08-05T21:24:14Z", "content": "(CNN)The use of the term \"Latinx\" has been a divisive issue for some time -- and a new poll shows that it's the least popular signifier among Hispanic and Latino people.\r\nGallup found that only 4% of… [+2718 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Zachary Cohen and Whitney Wild, CNN", "title": "House select committee begins taking over January 6 investigation from other committee", "description": "The newly formed House select committee is taking the lead on investigating January 6 going forward, consolidating the investigation, as other committees looking into the matter begin handing over their work, according to a multiple sources familiar with the …", "url": "https://www.cnn.com/2021/08/05/politics/house-select-committee-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727101704-10-jan-6-committee-hearing-0727-super-tease.jpg", "publishedAt": "2021-08-05T21:20:08Z", "content": "(CNN)The newly formed House select committee is taking the lead on investigating January 6 going forward, consolidating the investigation, as other committees looking into the matter begin handing ov… [+3334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "'Pretty Boys' author David Yi on male beauty and 7 cultural offerings that redefine masculinity", "description": "Interest in men's beauty was socially acceptable before it became taboo, and, as David Yi notes in his new book, it is now reemerging after a long hiatus. Here, Yi offers his tips for what to watch, listen to and read to celebrate boy beauty.", "url": "https://www.cnn.com/style/article/david-yi-male-beauty-masculinity-culture-queue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154307-pretty-boys-book-cover-super-tease.jpg", "publishedAt": "2021-08-05T20:57:11Z", "content": "artsPublished 5th August 2021\r\nKeeping you in the know, Culture Queue is an ongoing series of recommendations for timely books to read, films to watch, and podcasts and music to listen to.\r\nFamed anc… [+4969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Refugee arrivals to the US set to be the lowest on record this fiscal year", "description": "After Joe Biden came into office, Suleiman Omar Hassan and his roommate, both living in Uganda at the time, scrolled through the news on their cellphones every day looking for the answer to a life-altering question: Will Biden raise the refugee cap?", "url": "https://www.cnn.com/2021/08/05/politics/refugee-admissions-us-record-low/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190919153709-refugee-resettlement-file-super-tease.jpg", "publishedAt": "2021-08-05T20:52:13Z", "content": "(CNN)After Joe Biden came into office, Suleiman Omar Hassan and his roommate, both living in Uganda at the time, scrolled through the news on their cellphones every day looking for the answer to a li… [+5253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How Trump tried to pressure Georgia officials to overturn the 2020 election - CNN International", "description": "State prosecutors are still investigating whether former President Donald Trump broke any laws when he tried to overturn the results of the 2020 election in Georgia. Here’s a breakdown of what prosecutors will likely scrutinize as they piece together the time…", "url": "https://www.cnn.com/interactive/2021/08/politics/trump-georgia-2020-election/", "urlToImage": "http://i2.cdn.turner.com/cnnnext/dam/assets/210805150558-20210805-georgia-voting-trump-gfx-story-top.jpg", "publishedAt": "2021-08-05T20:50:38Z", "content": "Phase I\r\nTrump loses Georgia\r\nGeorgians went to the polls after a bitter campaign. Trump held onto a narrow lead for three days until President Joe Biden pulled ahead, buoyed by mail-in ballots that … [+14512 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Female Asian and Pacific Islander characters are still objectified in films, a new report finds", "description": "From \"Full Metal Jacket\" in the '80s to \"Mean Girls\" in the '00s, Asian and Pacific Islander women have historically been exoticized and hypersexualized in Hollywood -- and the problem lingers today, according to the Geena Davis Institute on Gender in Media.", "url": "https://www.cnn.com/2021/08/05/entertainment/asians-pacific-islanders-film-representation-report-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805160747-movie-theater-audience-stock-super-tease.jpg", "publishedAt": "2021-08-05T20:39:47Z", "content": "(CNN)From \"Full Metal Jacket\" in the '80s to \"Mean Girls\" in the '00s, Asian and Pacific Islander women have historically been exoticized and hypersexualized in Hollywood -- and the problem lingers t… [+4009 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner, CNN Business", "title": "People are flocking to Applebee's. This popular song is one reason why", "description": "The pandemic was difficult for casual dining brands like Applebee's, which saw sales plummet when it closed its dining rooms last year. But now, Applebee's is doing better than it has in years.", "url": "https://www.cnn.com/2021/08/05/business/applebees-earnings-song/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805144503-applebees-restaurant-0905-file-restricted-super-tease.jpg", "publishedAt": "2021-08-05T20:35:00Z", "content": "New York (CNN Business)The pandemic was difficult for casual dining brands like Applebee's, which saw sales plummet when it closed its dining rooms last year. But now, Applebee's is doing better than… [+2705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas and Jason Hanna, CNN", "title": "Moderna's Covid-19 vaccine shows 93% efficacy through 6 months, as company expects to finish application for approval this month", "description": "Moderna's Covid-19 vaccine showed 93% efficacy against symptomatic disease through six months, and the company expects to complete its application for full approval from the US Food and Drug Administration this month, the company said Thursday.", "url": "https://www.cnn.com/2021/08/05/health/moderna-coronavirus-vaccine-efficacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805121301-restricted-moderna-covid-19-vaccine-pennsylvania-04-01-2021-super-tease.jpg", "publishedAt": "2021-08-05T20:32:50Z", "content": "(CNN)Moderna's Covid-19 vaccine showed 93% efficacy against symptomatic disease through six months, and the company expects to complete its application for full approval from the US Food and Drug Adm… [+5850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Wilson, CNN", "title": "CBO: Bipartisan infrastructure plan will add $256 billion to projected deficits over the next decade", "description": "The bipartisan infrastructure plan making its way through the Senate will \"add $256 billion to projected deficits\" between 2021 and 2031, a report from the Congressional Budget Office released Thursday found.", "url": "https://www.cnn.com/2021/08/05/politics/bipartisan-infrastructure-plan-senate-cbo-score/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-08-05T20:26:09Z", "content": "(CNN)The bipartisan infrastructure plan making its way through the Senate will \"add $256 billion to projected deficits\" between 2021 and 2031, a report from the Congressional Budget Office released T… [+2033 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Attorney for Britney Spears files petition requesting earlier court date to remove her father as co-conservator", "description": "An attorney for Britney Spears has filed a petition requesting the judge in the her conservatorship case move up a hearing to determine immediately whether Jamie Spears will be removed as the co-conservator of his daughter's estate, according to court documen…", "url": "https://www.cnn.com/2021/08/05/entertainment/britney-spears-ex-parte-father-co-conservator-battle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714052443-file-britney-spears-2019-super-tease.jpg", "publishedAt": "2021-08-05T20:07:53Z", "content": "(CNN)An attorney for Britney Spears has filed a petition requesting the judge in the her conservatorship case move up a hearing to determine immediately whether Jamie Spears will be removed as the co… [+3143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Fortinsky", "title": "South Carolina Republican congressman tests positive for Covid-19", "description": "Rep. Ralph Norman has tested positive for Covid-19 after experiencing mild symptoms, the South Carolina Republican, who is fully vaccinated, announced Thursday in a statement.", "url": "https://www.cnn.com/2021/08/05/politics/ralph-norman-covid-positive/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805150121-rep-ralph-norman-file-restricted-super-169.jpg", "publishedAt": "2021-08-05T19:59:49Z", "content": "Rep. Ralph Norman has tested positive for Covid-19 after experiencing mild symptoms, the South Carolina Republican, who is fully vaccinated, announced Thursday in a statement.\r\nAfter experiencing min… [+1739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher and Rachel Janfaza, CNN", "title": "Texas Gov. Greg Abbott announces second special session of state legislature", "description": "Texas Gov. Greg Abbott on Thursday called for a second special session of the state legislature to begin this weekend, after Democratic lawmakers fled the state to block a restrictive voting bill.", "url": "https://www.cnn.com/2021/08/05/politics/texas-state-legislature-second-special-session/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805143212-greg-abbott-0710-super-tease.jpg", "publishedAt": "2021-08-05T19:46:00Z", "content": "(CNN)Texas Gov. Greg Abbott on Thursday called for a second special session of the state legislature to begin this weekend, after Democratic lawmakers fled the state to block a restrictive voting bil… [+2751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Amazon is delaying its return to office until 2022", "description": "Amazon on Thursday pushed back its office return date until early next year amid a surge in Covid-19 cases from the Delta variant, making it one of the most significant delays yet in the tech industry.", "url": "https://www.cnn.com/2021/08/05/tech/amazon-office-return-reopening-delay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805140244-01-amazon-seattle-offices-file-super-tease.jpg", "publishedAt": "2021-08-05T19:20:19Z", "content": "(CNN Business)Amazon on Thursday pushed back its office return date until early next year amid a surge in Covid-19 cases from the Delta variant, making it one of the most significant delays yet in th… [+1507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Maegan Vazquez, CNN", "title": "Education secretary warns that politicizing masks could lead to in-person school disruption", "description": "Education Sec. Miguel Cardona on Thursday warned Americans not to let adult politics get in the way of schools reopening safely and remaining open without disruption, specifically expressing concern about states that are preventing schools from instating mask…", "url": "https://www.cnn.com/2021/08/05/politics/education-miguel-cardona-schools-covid-florida-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210613195849-miguel-cardona-file-super-tease.jpg", "publishedAt": "2021-08-05T19:17:25Z", "content": "(CNN)Education Sec. Miguel Cardona on Thursday warned Americans not to let adult politics get in the way of schools reopening safely and remaining open without disruption, specifically expressing con… [+5183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bregman and Howard Jacobson", "title": "Angry at the unvaccinated? Here's a better way", "description": "You're furious at what you see as the selfishness and ignorance and lack of civic responsibility of the people in your life who refuse to get the jab. You try to convince them by explaining how wrongheaded they are, hoping browbeating will break them. But her…", "url": "https://www.cnn.com/2021/08/05/opinions/how-to-move-people-from-hesitant-to-vaccinated-bregman-jacobson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805131038-covid-vaccine-nyc-0730-super-tease.jpg", "publishedAt": "2021-08-05T19:07:26Z", "content": "Peter Bregman, CEO of Bregman Partners, is an executive coach, bestselling author and host of the Bregman Leadership Podcast. Howard Jacobson is an executive and health coach and director of coach tr… [+8788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "Why Olympic divers take showers -- and use those tiny towels -- between dives", "description": "Some viewers of the Tokyo Olympics are baffled by the behavior of divers between plunges into the pool. Let us explain.", "url": "https://www.cnn.com/2021/08/05/sport/olympics-divers-showers-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805024853-14-olympics-080521-womens-10m-diving-super-169.jpg", "publishedAt": "2021-08-05T18:45:00Z", "content": "Viewers of the Tokyo Olympics are apparently a little baffled by the behavior of athletes in the diving events. \r\nDivers typically emerge from the water after a plunge and immediately take a quick sh… [+2565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "More companies are requiring vaccines for workers, but unions could slow the effort", "description": "More employers are mandating Covid-19 vaccines for their workers as the Delta variant surges across the United States. But one step in the process could slow down the rollout of such requirements: negotiations with labor unions representing employees.", "url": "https://www.cnn.com/2021/08/05/business/vaccine-mandates-unions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729083853-us-covid-19-vaccine-dose-pfizer-0514-super-tease.jpg", "publishedAt": "2021-08-05T18:35:58Z", "content": "New York (CNN Business)More employers are mandating Covid-19 vaccines for their workers as the Delta variant surges across the United States. But one step in the process could slow down the rollout o… [+6968 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega", "title": "DOJ opens investigation into city of Phoenix and Phoenix Police Department", "description": "Attorney General Merrick Garland announced on Thursday that the Justice Department's Civil Rights Division is launching an investigation into policing practices into the city of Phoenix, Arizona, and its police department.", "url": "https://www.cnn.com/2021/08/05/politics/phoenix-justice-garland/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726121303-merrick-garland-0426-super-tease.jpg", "publishedAt": "2021-08-05T18:31:35Z", "content": "(CNN)Attorney General Merrick Garland announced on Thursday that the Justice Department's Civil Rights Division is launching an investigation into policing practices into the city of Phoenix, Arizona… [+72 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Vaughan, CNN", "title": "Need Housing and rental relief? Here's how to get started", "description": "After the federal eviction moratorium expired, the Centers for Disease Control and Prevention issued an extension until October 3 for high Covid-19 transmission areas. The Biden administration says those areas cover 90 percent of the country's renters.", "url": "https://www.cnn.com/2021/08/05/us/iyw-housing-and-rental-resources/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326153110-us-apartment-eviction-file-super-tease.jpg", "publishedAt": "2021-08-05T18:15:52Z", "content": "(CNN)After the federal eviction moratorium expired, the Centers for Disease Control and Prevention issued an extension until October 3 for high Covid-19 transmission areas. The Biden administration s… [+2100 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson, Caitlin Stephen Hu and Shelby Rose", "title": "Mexico's lawsuit against gun makers faces a tough road", "description": "Normally, when the headlines blare about flows across the US-Mexico border, they concern desperate migrants and refugees heading north. But Mexico has now turned the tables and is seeking to halt the torrent of firearms heading south from the gun-toting Unite…", "url": "https://www.cnn.com/2021/08/05/world/meanwhile-in-america-august-5-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804152500-mexico-gunmaker-lawsuit-super-169.jpg", "publishedAt": "2021-08-05T18:14:09Z", "content": "Normally, when the headlines blare about flows across the US-Mexico border, they concern desperate migrants and refugees heading north. But Mexico has now turned the tables and is seeking to halt the… [+4510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Editorial Research", "title": "Ebrahim Raisi Fast Facts", "description": "Read CNN's Fast Facts about Ebrahim Raisi and learn more about the president of Iran.", "url": "https://www.cnn.com/2021/08/05/middleeast/ebrahim-raisi-fast-facts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620115925-exp-gps-0620-iran-election-ebrahim-raisi-00003114-super-tease.png", "publishedAt": "2021-08-05T17:54:18Z", "content": "(CNN)Here's a look at the life of Iran's President Ebrahim Raisi, who was inaugurated August 5, 2021.\r\nBirth date: December 14, 1960\r\nBirth place: Mashhad, Iran\r\nFull name: Sayyid Ebrahim Raisol-Sada… [+2760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Neelam Bohra and Scottie Andrew", "title": "Lil Nas X's defiant pride is essential to hip-hop -- and the DaBaby debacle is one reason why", "description": "Lil Nas X's unapologetic commitment to his identity has become even more essential in the wake of DaBaby's comments. And he's carving out a new space for the future of LGBTQ musicians to express themselves without limits.", "url": "https://www.cnn.com/2021/08/05/entertainment/lil-nas-x-dababy-homophobia-black-queer-rappers-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730135514-02-lil-nas-x-dababy-rap-homophobia-trnd-super-169.jpg", "publishedAt": "2021-08-05T17:41:25Z", "content": "Lil Nas X, the 22-year-old juggernaut known by most for Old Town Road, is in prison. Hes in the shower, naked save for some humble pixelation and twerking, surrounded by eight male backup dancers. An… [+6981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The best computer monitors of 2021", "description": "We've been testing seven of the highest-rated monitors over the past month to find the best computer monitor for work — or play — which we ultimately whittled down to three top picks.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-computer-monitors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805133532-cnn-underscored-best-computer-monitors-01-super-169.jpg", "publishedAt": "2021-08-05T17:36:23Z", "content": "Screen constraint can hamper anyones workflow. Who hasnt wasted precious time trying to find that one spreadsheet buried beneath 15 other open applications on an oh-so-small laptop screen? A full-siz… [+9550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle", "title": "New York state impeachment investigation into Cuomo is 'nearing completion'", "description": "A wide-ranging New York state impeachment investigation into various allegations of misconduct against embattled Democratic Gov. Andrew Cuomo is close to concluding, according to a letter obtained by CNN.", "url": "https://www.cnn.com/2021/08/05/politics/new-york-cuomo-impeachment-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805122217-restricted-andrew-cuomo-08-02-2021-super-tease.jpg", "publishedAt": "2021-08-05T17:20:58Z", "content": "(CNN)A wide-ranging New York state impeachment investigation into various allegations of misconduct against embattled Democratic Gov. Andrew Cuomo is close to concluding, according to a letter obtain… [+2104 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "White House touts more than 864,000 vaccinations in last 24 hours, highest rate since early July", "description": "The White House touted progress in vaccinations in recent days, noting that over the past 24 hours, the US recorded more than 864,000 vaccinations, the highest daily rate since July 3, and praised momentum for vaccine mandates Thursday, days after President J…", "url": "https://www.cnn.com/2021/08/05/politics/vaccine-mandates-progress-delta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805123634-white-house-0729-super-tease.jpg", "publishedAt": "2021-08-05T16:50:45Z", "content": "(CNN)The White House touted progress in vaccinations in recent days, noting that over the past 24 hours, the US recorded more than 864,000 vaccinations, the highest daily rate since July 3, and prais… [+2533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Justice Department IG couldn't find evidence of FBI Clinton probe leaks to Giuliani", "description": "The Justice Department inspector general could not find evidence that FBI employees leaked non-public information to Rudy Giuliani about the Hillary Clinton email investigation in the lead-up to the 2016 election, according to a new report.", "url": "https://www.cnn.com/2021/08/05/politics/giuliani-inspector-general-review-2016-fbi-leaks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210607141454-rudy-giuliani-file-super-tease.jpg", "publishedAt": "2021-08-05T16:49:17Z", "content": "Washington (CNN)The Justice Department inspector general could not find evidence that FBI employees leaked non-public information to Rudy Giuliani about the Hillary Clinton email investigation in the… [+2848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "Kentucky sheriff's deputy shot, killed in ambush attack, police say", "description": "A Jefferson County Sheriff's (JCSO) deputy has died after being shot early Thursday while working an off-duty detail, and investigators believe he was \"targeted\" and \"ambushed,\" according to JCSO spokesman, Lt. Col. Carl Yates.", "url": "https://www.cnn.com/2021/08/05/us/kentucky-deputy-shot-ambush/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805121514-01-kentucky-deputy-shot-shirley-0805-restricted-super-tease.jpg", "publishedAt": "2021-08-05T16:25:23Z", "content": "(CNN)A Jefferson County Sheriff's (JCSO) deputy has died after being shot early Thursday while working an off-duty detail, and investigators believe he was \"targeted\" and \"ambushed,\" according to JCS… [+979 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Alex Rogers and Michael Warren, CNN", "title": "GOP fears grow over Herschel Walker as party leaders seek other candidates in Georgia Senate race", "description": "Republicans from Georgia to Washington, DC, are searching for a viable candidate to mount a Senate bid in the Peach State next year, fearing that former President Donald Trump's choice, football great Herschel Walker, would implode if he ran and could cost th…", "url": "https://www.cnn.com/2021/08/05/politics/georgia-senate-race/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805104724-herschel-walker-file-2019-super-tease.jpg", "publishedAt": "2021-08-05T16:24:24Z", "content": "(CNN)Republicans from Georgia to Washington, DC, are searching for a viable candidate to mount a Senate bid in the Peach State next year, fearing that former President Donald Trump's choice, football… [+9209 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Free Guy' lets Ryan Reynolds run up the score in a video-game action comedy", "description": "\"Free Guy\" is a cleverly programmed wedding of star (Ryan Reynolds) and subject matter, in a movie that's silly, handsome-looking and a great deal of fun, in roughly inverse proportion to how much one sweats the details. Traveling inside videogames doesn't al…", "url": "https://www.cnn.com/2021/08/05/entertainment/free-guy-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802144054-01-ryan-reynolds-free-guy-super-tease.jpg", "publishedAt": "2021-08-05T16:04:17Z", "content": "(CNN)\"Free Guy\" is a cleverly programmed wedding of star (Ryan Reynolds) and subject matter, in a movie that's silly, handsome-looking and a great deal of fun, in roughly inverse proportion to how mu… [+3108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Wilson, Manu Raju, Lauren Fox and Kristin Wilson", "title": "McConnell rejects Democrats' effort to get GOP to back raising the nation's debt limit", "description": "Senate Minority Leader Mitch McConnell said Thursday that Democrats should expect zero help from Republicans in their effort to raise the debt ceiling, previewing a looming fight this fall over the nation's borrowing limit, which Congress must approve.", "url": "https://www.cnn.com/2021/08/05/politics/debt-ceiling-debate-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618123013-01-mcconnell-0617-super-169.jpg", "publishedAt": "2021-08-05T15:58:48Z", "content": "Senate Minority Leader Mitch McConnell said Thursday that Democrats should expect zero help from Republicans in their effort to raise the debt ceiling, previewing a looming fight this fall over the n… [+3166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Hemmer", "title": "Why Tucker Carlson went to Hungary", "description": "Historian Nicole Hemmer writes that Tucker Carlson being in Hungary this week and his support for conservative authoritarian Prime Minister Viktor Orban is a strategy that we've seen play out in the 1960s and 1970s, when White, right-wing media personalities …", "url": "https://www.cnn.com/2021/08/05/opinions/tucker-carlson-hungary-viktor-orbn-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804170448-carlson-orban-twitter-super-169.jpeg", "publishedAt": "2021-08-05T15:30:42Z", "content": "When Tucker Carlson, host of the highest-rated show on Fox News, opened his show on Monday, he appeared not behind his glossy desk, but in front of the ornate spires of Budapest, Hungary. Standing ne… [+5537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judith Graham, Kaiser Health News", "title": "Most seniors who died of Covid-19 lived outside nursing homes", "description": "As covid-19 resurges across the country, driven by the highly infectious delta variant, experts are extending our understanding of the pandemic's toll on older adults — the age group hit hardest by the pandemic.", "url": "https://www.cnn.com/2021/08/05/health/seniors-covid-19-deaths-partner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210310180437-05-uk-elderly-first-touch-covid-super-tease.jpg", "publishedAt": "2021-08-05T15:20:57Z", "content": "(CNN)As covid-19 resurges across the country, driven by the highly infectious delta variant, experts are extending our understanding of the pandemic's toll on older adults the age group hit hardest b… [+7307 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Akanksha Singh", "title": "A jailed priest's death sends a message about India's crackdown", "description": "On July 5, Stan Swamy, an 84-year-old priest passed away in a hospital in a suburb of Mumbai. He spent nearly nine months in jail, without trial, under an Indian anti-terrorism law. The case calls attention to a crackdown on activists.", "url": "https://www.cnn.com/2021/08/05/opinions/stan-swamy-and-india-anti-terror-law-crackdown-akanksha-singh-op-ed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706010457-02-indian-jailed-activist-priest-death-intl-ink-super-tease.jpg", "publishedAt": "2021-08-05T15:16:47Z", "content": "Akanksha Singh is a journalist based in Mumbai, India. She covers politics and social justice and has written for the BBC, The Independent and the South China Morning Post, among others. Follow her o… [+6103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Johnson", "title": "How to get the best credit card when you have an excellent credit score", "description": "With a credit score that's considered excellent or exceptional, you can have your pick of the top rewards and travel credit card options, so it's vital that you compare card offerings and current promotions to find the right fit.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-credit-cards-for-excellent-credit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154747-underscored-credit-score-meter-pointing-to-excellent-super-169.jpg", "publishedAt": "2021-08-05T15:06:52Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+11619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Perfectly preserved cave lion cub found frozen in Siberia is 28,000 years old. Even its whiskers are intact.", "description": "Found frozen deep in the Siberian Arctic, the cave lion cub looks like she's asleep and one touch might awaken her.", "url": "https://www.cnn.com/2021/08/05/world/frozen-cave-lion-cubs-siberia-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805100743-01-siberia-cave-lion-cub-discovery-super-tease.jpg", "publishedAt": "2021-08-05T14:55:11Z", "content": "Sign up for CNN's Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\n (CNN)Found frozen deep in the Siberian Arctic, the c… [+4832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna and Joe Sutton, CNN", "title": "'We lost Greenville': Dixie Fire wipes out much of Northern California community", "description": "The Golden State's largest active wildfire has wiped out much of the Greenville community in Northern California, sweeping through Wednesday at alarming speed and endangering anyone who did not heed evacuation orders, officials said.", "url": "https://www.cnn.com/2021/08/05/weather/greenville-california-dixie-fire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805090511-04-dixie-fire-greenville-0804-super-tease.jpg", "publishedAt": "2021-08-05T14:48:38Z", "content": "(CNN)The Golden State's largest active wildfire has wiped out much of the Greenville community in Northern California, sweeping through Wednesday at alarming speed and endangering anyone who did not … [+3769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "Carnival cruise ship reports Covid cases, brings in mask requirement for all passengers", "description": "After a \"small number of positive cases\" of Covid-19 were detected aboard a Carnival Cruise Line ship, a new fleetwide policy requiring all guests to wear masks in some indoor areas was implemented ahead of schedule, the cruise line said.", "url": "https://www.cnn.com/travel/article/carnival-cruise-line-covid-cases-mask-requirement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805103308-carnival-vista-file-0503-galveston-restricted-super-tease.jpg", "publishedAt": "2021-08-05T14:46:29Z", "content": "(CNN) After a \"small number of positive cases\" of Covid-19 were detected aboard a Carnival Cruise Line ship, a new fleetwide mask policy requiring all guests to wear masks in some indoor areas was im… [+1710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "Wayfair is having a Save Big, Give Back sale — here are the best picks", "description": "If you have a few needs around the house — or you've just moved and have a new place to furnish — it's a great time to shop, score some discounts (up to 80% off!) and do a little good in the process. Read on for some of our top picks from Wayfair's sale below.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/wayfair-sale-save-big-give-back/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804103115-wayfair-sale-save-big-give-back-lead-super-169.jpg", "publishedAt": "2021-08-05T14:26:39Z", "content": "Wayfair has been a go-to for a ton of people for a while now, and their current Save Big, Give Back sale is giving their famously great bargains an even better spin. During the promotion, which runs … [+6841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Tensley", "title": "Why August is the perfect time to revisit Black rebellion", "description": "A version of this story appeared in CNN's Race Deconstructed newsletter. To get it in your inbox every week, sign up for free here.", "url": "https://www.cnn.com/2021/08/05/politics/black-rebellion-kerner-race-deconstructed-newsletter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803164139-the-essential-kerner-commission-report-book-cover-super-169.jpg", "publishedAt": "2021-08-05T14:25:35Z", "content": "A version of this story appeared in CNNs Race Deconstructed newsletter. To get it in your inbox every week, sign up for free here.\r\nThis week marks the start of Black August. The annual commemoration… [+6147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Phil Mattingly, CNN", "title": "Biden touts LGBTQ diversity in announcing sixth round of judicial nominees", "description": "President Joe Biden on Thursday announced four judicial nominees, including two barrier-breaking nominations of LGBTQ judges, marking his sixth round of judicial nominees since taking office as his administration seeks to maintain a rapid pace of nominations …", "url": "https://www.cnn.com/2021/08/05/politics/biden-judicial-nominees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803165508-01-biden-0803-super-tease.jpg", "publishedAt": "2021-08-05T14:24:39Z", "content": "(CNN)President Joe Biden on Thursday announced four judicial nominees, including two barrier-breaking nominations of LGBTQ judges, marking his sixth round of judicial nominees since taking office as … [+2262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop today: Columbia, Jabra, NuFace and more", "description": "Today, you'll find a deal on our runner-up pick for best over-ear headphones, a discounted NuFace bundle and savings on batteries. All that and more below.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805093800-0805deals-super-169.jpg", "publishedAt": "2021-08-05T14:24:21Z", "content": "Today, youll find a deal on our runner-up pick for best over-ear headphones, a discounted NuFace bundle and savings on batteries. All that and more below.\r\nOur runner-up for best overall over-ear hea… [+12266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden extends temporary safe haven to Hong Kong residents in US amid China crackdown", "description": "President Joe Biden on Thursday signed a memorandum extending temporary safe haven to certain Hong Kong residents in the US amid ongoing repression and undermining of democracy by China.", "url": "https://www.cnn.com/2021/08/05/politics/deferred-enforced-departure-hong-kong-china/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716145103-white-house-file-0306-super-tease.jpg", "publishedAt": "2021-08-05T14:23:27Z", "content": "(CNN)President Joe Biden on Thursday signed a memorandum extending temporary safe haven to certain Hong Kong residents in the US amid ongoing repression and undermining of democracy by China.\r\nThe pr… [+2102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "You shouldn't miss this massive bombshell in Trump's ongoing election fraud lie", "description": "Unless you have been living on another planet for the past six months, you know by now that Donald Trump leaned on state and national officials in the final days of his presidency to force investigations into made-up claims of widespread election fraud in the…", "url": "https://www.cnn.com/2021/08/05/politics/donald-trump-jeffrey-rosen-election-fraud-cnn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210527101033-donald-trump-2018-file-super-169.jpg", "publishedAt": "2021-08-05T14:22:25Z", "content": "Unless you have been living on another planet for the past six months, you know by now that Donald Trump leaned on state and national officials in the final days of his presidency to force investigat… [+3577 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry and Brian Lowry", "title": "'Vivo' gets Lin-Manuel Miranda animated again in a sweet if slight adventure", "description": "After putting the wind in \"Moana's\" sails with his music and lyrics, Lin-Manuel Miranda brings his stage-honed chops to another animated movie in \"Vivo,\" a sweet if slight love story built around an inordinately resourceful kinkajou. Premiering on Netflix, Mi…", "url": "https://www.cnn.com/2021/08/05/entertainment/vivo-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804151141-01-vivo-netflix-super-169.jpg", "publishedAt": "2021-08-05T14:08:32Z", "content": "After putting the wind in Moanas sails with his music and lyrics, Lin-Manuel Miranda brings his stage-honed chops to another animated movie in Vivo, a sweet if slight love story built around an inord… [+2303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood and Veronica Stracqualursi, CNN", "title": "Japanese whiskey worth $5,800 gifted to Pompeo is missing, State filings say", "description": "The State Department is looking into the whereabouts of a $5,800 bottle of Japanese whiskey that was gifted to former Secretary of State Mike Pompeo, according to State Department filings in the federal register.", "url": "https://www.cnn.com/2021/08/05/politics/pompeo-japanese-whiskey-bottle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805081626-restricted-mike-pompeo-12-09-2020-super-tease.jpg", "publishedAt": "2021-08-05T14:08:12Z", "content": "(CNN)The State Department is looking into the whereabouts of a $5,800 bottle of Japanese whiskey that was gifted to former Secretary of State Mike Pompeo, according to State Department filings in the… [+1634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Don't sleep on this exclusive deal: Yana's famous body pillow is 20% off right now", "description": "For those of us who love to curl up with a body pillow at night, Yana has one of the best around. Now, with our exclusive code, you can save 20% on the well-engineered pillow during the entire month of August. It's the perfect opportunity to make an investmen…", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/yana-sleep-sale-body-pillow/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804071707-yana-sleep-pillow-sale-lead-super-169.jpg", "publishedAt": "2021-08-05T14:01:12Z", "content": "For those of us who love to curl up with a body pillow at night, Yana has one of the best around: Made from organic, luxurious textiles, its a great little or big spoon at night and can curl around y… [+1162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Logan Garvey", "title": "The cutest notebooks, pens & school supplies we're obsessed with right now", "description": "Cute school supplies get us excited in anticipation for back to school, and we want to share our faves with you. Here's a list of our go-to notebooks, pens, sticky notes and more.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/cute-desk-supplies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730090108-cute-desk-supplies-lead-super-169.jpg", "publishedAt": "2021-08-05T13:57:37Z", "content": "Everything is more fun when it is stylish too. Cute school supplies get us excited in anticipation for back to school, and we want to share our faves with you. Heres a list of our go-to notebooks, pe… [+3484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Staff", "title": "Travel to Portugal during Covid-19: What you need to know before you go", "description": "If you're planning a trip to Portugal, here's what you'll need to know and expect if you want to visit during the global coronavirus pandemic.", "url": "https://www.cnn.com/travel/article/portugal-travel-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200704075040-algarve-tourism-super-tease.jpg", "publishedAt": "2021-08-05T13:54:10Z", "content": "(CNN) If you're planning to travel to Portugal, here's what you'll need to know and expect if you want to visit during the Covid-19 pandemic.\r\nPortugal is in a State of Calamity until August 8, with … [+4005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Noelle Ike", "title": "Pepper is creating gorgeous, well-fitting bras for AA, A and B cups", "description": "Pepper creates bras specifically designed for those with AA, A and B cups. We tested the brand ourselves and found that the bras are comfortable, stylish and small-bust approved.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/pepper-bra-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803134430-pepper-bra-review-lead-super-169.jpg", "publishedAt": "2021-08-05T13:30:24Z", "content": "Finding the right bra, no matter your size, is a journey. But when you add the extra hurdle of having a smaller chest, it can be not only difficult, but embarrassing and even humiliating at times. Be… [+8835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "Travelers to Greece undeterred by extreme heatwave", "description": "As Greece suffers its worst heatwave in more than 30 years, wildfires are raging, the capital Athens is thick with haze, and residents on the outskirts of the city have fled, leaving their possessions to go up in flames.", "url": "https://www.cnn.com/travel/article/greece-travel-heatwave/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805133509-athens-heatwave-smoke-super-tease.jpg", "publishedAt": "2021-08-05T13:13:20Z", "content": "As the temperatures soar, eyes are turning towards the tourist industry. Tourism is crucial for Greece's economy -- it brought in over $45 billion to the economy in 2019 -- and the sector has, of cou… [+6208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Democratic leader just went off on the 'woke' left", "description": "Hakeem Jeffries is sick of hearing from liberals carping about how Democrats -- and their leaders, of which he is one -- aren't doing enough to advance progressive policies.", "url": "https://www.cnn.com/2021/08/05/politics/hakeem-jeffries-alexandria-ocasio-cortez-liberals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160212101605-hakeem-jeffries-super-tease.jpg", "publishedAt": "2021-08-05T13:07:07Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Why you could see subtle changes to your smartphone's design", "description": "Smartphone season is underway, and the headlines will almost certainly be the same as always: thinner, sleeker, faster models are coming to consumer pockets.", "url": "https://www.cnn.com/2021/08/05/tech/right-to-repair-smartphones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726140931-01-broken-smartphone-restricted-super-tease.jpg", "publishedAt": "2021-08-05T13:01:23Z", "content": "(CNN)Smartphone season is underway, and the headlines will almost certainly be the same as always: thinner, sleeker, faster models are coming to consumer pockets.\r\nBut if a new push from the US gover… [+5508 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The new Nest Cams pack a big punch with modern looks and smarter notifications", "description": "Alongside a completely redesigned doorbell, Nest is refreshing its entire line of cameras as well. Here's your first look at the Nest Cam (indoor/outdoor), Nest Cam With Floodlight and Nest Cam (wired).", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/new-nest-cam-2021-preorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804165646-1-nest-cam-2021-super-169.jpg", "publishedAt": "2021-08-05T13:00:40Z", "content": "Alongside a completely redesigned doorbell, Nest is refreshing its entire line of cameras as well. Heres your first look at the Nest Cam (indoor/outdoor), Nest Cam With Floodlight and Nest Cam (wired… [+6742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The new Nest Doorbell is here — and it could be a serious Ring rival", "description": "It's time to say goodbye to the Nest Hello and hello to the Nest Doorbell. Yes, there's finally a new Nest Doorbell and it aims to fix the main frustrations we had with its predecessor. The Google Nest Doorbell — which is up for preorder now for $179.99 — inc…", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/new-nest-doorbell-2021-preorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804161008-new-nest-doorbell-2021-super-169.jpg", "publishedAt": "2021-08-05T13:00:14Z", "content": "Its time to say goodbye to the Nest Hello and hello to the Nest Doorbell. Yes, theres finally a new Nest Doorbell and it aims to fix the main frustrations we had with its predecessor. The Google Nest… [+6919 chars]"}]}