{"status": "ok", "totalResults": 170, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, CNN Polling Director", "title": "CNN Poll: Americans are divided on what causes problems in US elections", "description": "Amid a flurry of changes to voting rules and regulations across the country, the American public is divided over whether the bigger problem with elections in America is that it is too hard to vote or that it is too easy to cheat, according to a new CNN Poll c…", "url": "https://www.cnn.com/2021/04/30/politics/cnn-poll-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201009155321-02-voting-booth-file-super-tease.jpg", "publishedAt": "2021-04-30T16:00:51Z", "content": "(CNN)Amid a flurry of changes to voting rules and regulations across the country, the American public is divided over whether the bigger problem with elections in America is that it is too hard to vo… [+6027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "18 splurge-worthy Mother's Day gifts that she definitely deserves", "description": "From silk robes to pearl bracelets and high-end hair dryers, here are all the luxury gifts your mom definitely deserves by now.", "url": "https://www.cnn.com/2021/04/30/cnn-underscored/luxury-gifts-mothers-day/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427133527-splurgemomsday-super-169.jpg", "publishedAt": "2021-04-30T15:56:40Z", "content": "With Mothers Day coming up, its time to scoop up something special to thank her for putting up with your teenage years.\r\nWhether its a new piece of jewelry, the coolest new tech, an elegant handbag o… [+4785 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "Fractures in GOP on full display as Cheney faces renewed criticism for bucking Trump and disagreeing with McCarthy in public", "description": "House Conference Chairwoman Rep. Liz Cheney is once again facing the ire of her colleagues and GOP voters, laying bare the ongoing and internal divisions within the GOP about how Republicans should move forward in the wake of former President Donald Trump.", "url": "https://www.cnn.com/2021/04/30/politics/liz-cheney-republican-reaction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205160111-01-liz-cheney-0203-super-tease.jpg", "publishedAt": "2021-04-30T15:56:16Z", "content": "(CNN)House Conference Chairwoman Rep. Liz Cheney is once again facing the ire of her colleagues and GOP voters, laying bare the ongoing and internal divisions within the GOP about how Republicans sho… [+4729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The best sales to shop this weekend: Casper, Bose, Dyson and more", "description": "This weekend, you'll find a deal on Dyson's Supersonic Hair Dryer, discounted batteries and savings on jewelry from Baublebar. All that and more below.", "url": "https://www.cnn.com/2021/04/30/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430111734-0430dealslead-super-169.jpg", "publishedAt": "2021-04-30T15:53:30Z", "content": "This weekend, youll find a deal on Dysons Supersonic Hair Dryer, discounted batteries and savings on jewelry from Baublebar. All that and more below.\r\nIn addition to making your floors spotless, Dyso… [+10482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kyle Meyaard-Schaap", "title": "The key word missing from the climate movement", "description": "Kyle Meyaard-Schaap writes that when coming face to face with the gravity of climate change, darker emotions are natural. But for sustained, long-term action -- the kind needed to face down the threat of climate change -- we need more than anger. Every one of…", "url": "https://www.cnn.com/2021/04/30/opinions/climate-movement-joy-meyaard-schaap/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190927091824-01-climate-strike-dc-super-tease.jpg", "publishedAt": "2021-04-30T15:49:56Z", "content": "Rev. Kyle Meyaard-Schaap is vice president of the Evangelical Environmental Network and is a Public Voices Fellow on the Climate Crisis with the Yale Program on Climate Change Communication and the O… [+5834 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Tigray could face famine without increased access to region, US aid official says", "description": "As the humanitarian crisis continues in Ethiopia's northern Tigray region, the US Agency for International Development is warning that the area could face famine if aid organizations are not granted unfettered access to the millions in urgent need of assistan…", "url": "https://www.cnn.com/2021/04/30/politics/usaid-tigray-dart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423091954-01-tigray-conflict-0314-super-tease.jpg", "publishedAt": "2021-04-30T15:44:59Z", "content": "(CNN)As the humanitarian crisis continues in Ethiopia's northern Tigray region, the US Agency for International Development is warning that the area could face famine if aid organizations are not gra… [+3912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Lil Nas X mocks himself after failing driving test", "description": "Rapper Lil Nas X took to TikTok after failing what he says was his first driving test.", "url": "https://www.cnn.com/videos/entertainment/2021/04/30/lil-nas-x-montero-driving-test-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430111445-lil-nas-x-driving-test-super-tease.jpg", "publishedAt": "2021-04-30T15:26:38Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toyin Owoseje, CNN", "title": "BAFTA suspends Noel Clarke, 'Doctor Who' and 'Kidulthood' star, over abuse allegations", "description": "BAFTA, the British Academy of Film and Television Arts, has suspended British actor and producer Noel Clarke following allegations of sexual misconduct.", "url": "https://www.cnn.com/2021/04/30/entertainment/noel-clarke-bafta-suspended-intl-scli-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430091828-noel-clarke-bafta-file-2019-super-tease.jpg", "publishedAt": "2021-04-30T15:25:06Z", "content": "(CNN)BAFTA, the British Academy of Film and Television Arts, has suspended British actor and producer Noel Clarke following allegations of sexual misconduct. \r\nThe body told CNN in a statement on Fri… [+4025 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "Here's who would get hit by Biden's proposed tax hikes", "description": null, "url": "https://www.cnn.com/2021/04/30/success/biden-tax-increase-proposals-feseries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429104348-02-joe-biden-congress-0428-super-tease.jpg", "publishedAt": "2021-04-30T15:24:24Z", "content": "President Joe Biden has proposed several ambitious plans to create jobs, build infrastructure and better support middle and working class families. His most recent is the American Families Plan, whic… [+4136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "First-ever US release of genetically modified mosquitoes begins in Florida Keys", "description": "The first US release of genetically modified mosquitoes began in the Florida Keys this week, part of a plan to fight a dangerous invasive species. The plan was approved by local and government agencies, but some Florida residents and environmental groups are …", "url": "https://www.cnn.com/2021/04/30/health/genetically-modified-mosquitoes-us-scn-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160908162336-03-zika-story-photos-super-tease.jpg", "publishedAt": "2021-04-30T14:59:40Z", "content": "(CNN)The first release of genetically modified mosquitoes in the United States began this week in the Florida Keys -- the culmination of a decade-long effort by local mosquito control authorities to … [+10121 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "26 of the cutest Mother's Day gifts at Target under $100", "description": "From satin pajamas to a heated foot massager, these gifts will delight your mom, mostly also because they're from Target.", "url": "https://www.cnn.com/2021/04/30/cnn-underscored/target-mothers-day-gifts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428122454-targetmomdaylead-super-169.jpg", "publishedAt": "2021-04-30T14:59:29Z", "content": "It might be a bit of cliché, but moms loveTarget. Whether theyre perusing workout gear, tank tops, slinky blankets, yummy-smelling candles or sheet sets or even just doing some boring grocery shoppin… [+11730 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "McConnell sends letter to Education secretary demanding removal of the 1619 Project from federal grant programs", "description": "Senate Minority Leader Mitch McConnell is wading into the culture wars Friday morning.", "url": "https://www.cnn.com/2021/04/30/politics/mcconnell-1619-project-education-secretary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210406133007-mitch-mcconnell-april-6-2021-louisville-kentucky-super-tease.jpg", "publishedAt": "2021-04-30T14:31:10Z", "content": "(CNN)Senate Minority Leader Mitch McConnell is wading into the culture wars Friday morning.\r\nIn a letter obtained by CNN, the Republican leader asks Education Secretary Miguel Cardona to abandon curr… [+2767 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz, CNN Business", "title": "Walmart sets up vaccine clinics for Flipkart workers as India grapples with Covid crisis", "description": null, "url": "https://www.cnn.com/2021/04/30/business/walmart-india-covid-effort/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429235341-india-covid-0429-super-tease.jpg", "publishedAt": "2021-04-30T14:29:18Z", "content": "New York (CNN Business)Walmart is setting up vaccination clinics for more than 200,000 of its workers and their families in India, as the country grapples with a devastating second wave of the Covid-… [+2236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Q&A by Paul LeBlanc, CNN", "title": "Experts are divided on the new CDC mask guidance. Here's what they're saying.", "description": "New mask guidance from the US Centers for Disease Control and Prevention this week has divided experts and fueled a new debate about the best way to steer Americans out of the pandemic.", "url": "https://www.cnn.com/2021/04/30/politics/cdc-mask-guidance-experts-debate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427142809-05-biden-mask-remarks-0427-super-tease.jpg", "publishedAt": "2021-04-30T14:17:40Z", "content": "Washington (CNN)New mask guidance from the US Centers for Disease Control and Prevention this week has divided experts and fueled a new debate about the best way to steer Americans out of the pandemi… [+13777 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Get the most from your AirTags with these accessories", "description": "Apple AirTags are on the market and we couldn't be more excited. They keep track of your stuff but you'll need an accessory ---- like a keyring, attachment or a mount ---- to attach them to your belongings. We've collected some of our favorites.", "url": "https://www.cnn.com/2021/04/30/cnn-underscored/best-airtag-accessories/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429151524-best-airtag-accessories-lead-super-169.jpg", "publishedAt": "2021-04-30T14:12:11Z", "content": "Apple AirTags are finally on the market and we couldnt be more excited. AirTags are item trackers that integrate with the Find My app on your iPhone to help you keep track of common objects you tend … [+5402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "How Kate's role in the British royal family has changed in the last 10 years", "description": "As the Cambridges celebrate their 10th wedding anniversary, we look at how Catherine is owning her role as a queen in waiting.", "url": "https://www.cnn.com/2021/04/30/uk/royal-news-newsletter-04-30-21-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430094558-catherine-philips-funeral-0417-super-tease.jpg", "publishedAt": "2021-04-30T14:09:26Z", "content": "A version of this story appeared in the April 30 edition of CNN's Royal News, a weekly dispatch bringing you the inside track on the royal family, what they are up to in public and what's happening b… [+10423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Washington Post: FBI warned Rudy Giuliani directly of Russian influence campaign", "description": "Rudy Giuliani was warned by the FBI in late 2019 that he was the target of a Russian influence operation intended to damage now-President Joe Biden in the 2020 election by spreading falsehoods, The Washington Post reported Thursday night.", "url": "https://www.cnn.com/2021/04/30/politics/rudy-giuliani-russia-influence-campaign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201003204147-30-trump-covid-circle-rudy-giuliani-super-tease.jpg", "publishedAt": "2021-04-30T14:07:13Z", "content": "Washington (CNN)Rudy Giuliani was warned by the FBI in late 2019 that he was the target of a Russian influence operation intended to damage now-President Joe Biden in the 2020 election by spreading f… [+5844 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "We spent a week with Apple's new AirTag — it's worth it", "description": "After months of speculation and anticipation, Apple's AirTag trackers are finally here at a relatively affordable $29 for a single AirTag or $99 for a pack of four. We spent a week with five AirTags to see if they were worth the hype.", "url": "https://www.cnn.com/2021/04/30/cnn-underscored/apple-airtag-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210421200348-1-apple-airtags-review-underscored-super-169.jpg", "publishedAt": "2021-04-30T14:07:00Z", "content": "After months of speculation and anticipation, Apples AirTag trackers are finally here at a relatively affordable $29 for a single AirTag or $99 for a pack of four.\r\nWe spent a week with five AirTags … [+14253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Chandran Nair", "title": "Opinion: The Covid disaster in India shows that the future is biological, not digital", "description": "The dire effects from the pandemic should be a reminder that most of the world may have internet access but it is the basics we need to focus on, writes Chandran Nair. Human society is a biological entity: one that affects the real world and, in turn, is affe…", "url": "https://www.cnn.com/2021/04/30/opinions/covid-disaster-india-global-biological-future-nair/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429235341-india-covid-0429-super-tease.jpg", "publishedAt": "2021-04-30T14:04:49Z", "content": "Chandran Nair is founder and CEO of the Global Institute For Tomorrow, a Hong Kong-based think tank. The views expressed in this commentary are his own. View more opinion at CNN.\r\n (CNN)Millions of p… [+6550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bethany Hines, CNN", "title": "Woman with rare muscular disease sings to exercise her lungs. Her songs inspire others to chase their dreams", "description": "Songwriter Tabitha Haly loves to sing but her singing serves another purpose. It's a technique that helps keep her lungs strong as she deals with spinal muscular atrophy, a degenerative condition affects muscle movement and respiration.", "url": "https://www.cnn.com/2021/04/30/health/tabitha-haly-spinal-muscular-atrophy-singer-hf-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415143211-tabitha-haly-with-band-super-tease.jpg", "publishedAt": "2021-04-30T14:04:22Z", "content": "(CNN)Songwriter Tabitha Haly doesn't just sing, she belts. It's a technique that helps keep her lungs strong as she deals with spinal muscular atrophy. \r\n\"If I can't sing a certain note or hold it lo… [+2436 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Major Biden receives special training to prepare for new White House cat", "description": "Some Major news at the White House: Major Biden has made his return to 1600 Pennsylvania Avenue after training following two biting incidents, but he may soon have to adjust to another furry friend.", "url": "https://www.cnn.com/2021/04/30/politics/major-biden-cat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324142609-01-major-biden-0323-super-tease.jpg", "publishedAt": "2021-04-30T14:03:02Z", "content": "(CNN)Some Major news at the White House: Major Biden has made his return to 1600 Pennsylvania Avenue after training following two biting incidents, but he may soon have to adjust to another furry fri… [+2425 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jessica Seinfeld", "title": "We are leaving fathers out of this important discussion", "description": "To get at the root causes of child poverty, writes Jessica Seinfeld, we need to address a key gap in our systems and policies and look at interventions that engage dads and support co-parenting for unmarried mothers and fathers.", "url": "https://www.cnn.com/2021/04/30/opinions/investing-in-fathers-to-tackle-child-poverty-seinfeld/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429203454-jessica-seinfeld-op-ed-super-tease.jpg", "publishedAt": "2021-04-30T13:43:06Z", "content": "Jessica Seinfeld is an author and Founder of the social services philanthropy Good+ Foundation, a nonprofit that works to dismantle multi-generational poverty by pairing tangible goods with innovativ… [+7384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "READ: McConnell letter to the Education Department regarding '1619 Project' programs", "description": "Senate Minority Leader Mitch McConnell this week sent a letter, obtained by CNN, to Education Secretary Miguel Cardona to abandon curriculum in American schools that McConnell argues tells a revisionist history of America's founding, specifically criticizing …", "url": "https://www.cnn.com/2021/04/30/politics/mitch-mcconnell-miguel-cardona-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210215202426-mcconnell-210213-super-tease.jpg", "publishedAt": "2021-04-30T13:30:07Z", "content": "(CNN)Senate Minority Leader Mitch McConnell this week sent a letter, obtained by CNN, to Education Secretary Miguel Cardona to abandon curriculum in American schools that McConnell argues tells a rev… [+5178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "YouTubers to be deported from Bali following prank video", "description": "Two self-described influencers are to be deported from the Indonesian resort island of Bali after being jailed for creating a \"prank\" video of a painted-on face mask, an official said on Friday.", "url": "https://www.cnn.com/travel/article/youtube-influencers-deported-bali-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428225926-01-youtubers-deportation-bali-indonesia-fake-masks-super-tease.jpg", "publishedAt": "2021-04-30T13:28:38Z", "content": "(CNN) Two self-described influencers are to be deported from the Indonesian resort island of Bali after being jailed for creating a \"prank\" video of a painted-on face mask, an official said on Friday… [+2761 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Mosquito Coast' feels even weirder moving the book into the modern age", "description": "\"The Mosquito Coast\" comes together as the product of several puzzling choices, beginning with the decision to again adapt Paul Theroux's 1981 book, and then to situate it in a contemporary setting. The result is a creepier-than-perhaps-even-intended limited …", "url": "https://www.cnn.com/2021/04/30/entertainment/the-mosquito-coast-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426142930-mosquito-coast-apple-tv-super-tease.jpg", "publishedAt": "2021-04-30T13:24:41Z", "content": "(CNN)\"The Mosquito Coast\" comes together as the product of several puzzling choices, beginning with the decision to again adapt Paul Theroux's 1981 book, and then to situate it in a contemporary sett… [+2935 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Glenn Close and Mila Kunis can't dance fast enough to save the grim addiction tale 'Four Good Days'", "description": "\"Four Good Days\" is only a so-so movie, a grim addiction story -- based on a Washington Post piece -- that plumbs the extent to which a mother is willing to suffer and exercise tough love to save her child. Said mom is played by Glenn Close, in a role unlikel…", "url": "https://www.cnn.com/2021/04/30/entertainment/four-good-days-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426142028-four-good-days-glenn-close-mila-kunis-super-tease.jpg", "publishedAt": "2021-04-30T13:23:41Z", "content": "(CNN)\"Four Good Days\" is only a so-so movie, a grim addiction story -- based on a Washington Post piece -- that plumbs the extent to which a mother is willing to suffer and exercise tough love to sav… [+2441 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "See what's streaming in May", "description": null, "url": "https://www.cnn.com/2021/04/30/entertainment/gallery/new-may-streaming-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210422231309-07-new-may-streaming-2021-cruella-super-tease.jpg", "publishedAt": "2021-04-30T13:19:38Z", "content": "By Lisa Respers France, CNN\r\nUpdated 9:19 AM ET, Fri April 30, 2021"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden says schools 'should probably all be open' in the fall", "description": "President Joe Biden said Friday that K-12 schools \"should probably all be open\" in the fall for in-person learning after more than a year of most of the country's kids facing the challenge of remote instruction due to the coronavirus pandemic.", "url": "https://www.cnn.com/2021/04/30/politics/biden-schools-reopening-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429104348-02-joe-biden-congress-0428-super-tease.jpg", "publishedAt": "2021-04-30T13:07:05Z", "content": "(CNN)President Joe Biden said Friday that K-12 schools \"should probably all be open\" in the fall for in-person learning after more than a year of most of the country's kids facing the challenge of re… [+3420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "Europe's recession deepened in the first quarter but the recovery is underway", "description": "Europe fell deeper into recession in the first three months of the year, but the region's economy is already turning a corner and looks set to bounce back as coronavirus restrictions ease.", "url": "https://www.cnn.com/2021/04/30/economy/recession-europe-gdp/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430062750-rome-italy-restaurant-0426-super-tease.jpg", "publishedAt": "2021-04-30T12:47:03Z", "content": "London (CNN Business)Europe fell deeper into recession in the first three months of the year, but the region's economy is already turning a corner and looks set to bounce back as coronavirus restrict… [+2808 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "People are ready to have sex again: Condom sales are surging", "description": "Condom sales have been in a slump during the pandemic as people sheltered at home and put their sex life on hold. But now, as more Americans are getting vaccinated and Covid-19 safety restrictions are loosening, condom makers are no longer having trouble gett…", "url": "https://www.cnn.com/2021/04/30/business/condoms-durex-trojan-sex/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429101605-durex-condoms-us-store---stock-super-tease.jpg", "publishedAt": "2021-04-30T12:46:23Z", "content": "New York (CNN Business)Condom sales have been in a slump during the pandemic as people sheltered at home and put their sex life on hold. But now, as more Americans are getting vaccinated and Covid-19… [+3061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Ma'Khia Bryant to be remembered as a vibrant and bubbly girl at funeral", "description": "Ma'Khia Bryant loved styling her curly hair in front of her camera phone and posting about it on TikTok.", "url": "https://www.cnn.com/2021/04/30/us/makhia-bryant-columbus-ohio-funeral/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210422153939-02-makhia-bryant-super-tease.jpg", "publishedAt": "2021-04-30T12:30:37Z", "content": "(CNN)Ma'Khia Bryant loved styling her curly hair in front of her camera phone and posting about it on TikTok.\r\n\"My baby was an innocent, talented, bubbly, loving teenager,\" her mother, Paula Bryant, … [+3069 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "These TikTok stars built a VC firm backed by Anthony Scaramucci and the Winklevoss twins", "description": "Social media influencers have enormous power to set trends, create overnight sensations and broadly define what's cool. Josh Richards, a 19-year-old determined to be the world's first influencer billionaire, isn't shy about flexing that clout.", "url": "https://www.cnn.com/2021/04/30/business/josh-richards-tiktok-investing-venture-capital/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423101556-02-josh-richards-tiktok-screenshot-super-tease.jpg", "publishedAt": "2021-04-30T12:29:36Z", "content": "New York (CNN Business)Social media influencers have enormous power to set trends, create overnight sensations and broadly define what's cool. Josh Richards, a 19-year-old determined to be the world'… [+5903 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Ed Lavandera, Ashley Killough and Catherine E. Shoichet, CNN\nVideo by Dave Ruff, Gregg Canes, Joel De La Rosa and Madeleine Stix, CNN", "title": "What happened when border wall construction froze", "description": "President Biden has halted construction of President Trump's border wall. But a big question remains: What will happen at sites along the border where wall construction was underway?", "url": "https://www.cnn.com/2021/04/30/us/border-wall-construction-stopped/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210412112556-construction-border-wall-stopped-super-tease.jpg", "publishedAt": "2021-04-30T12:28:30Z", "content": "Patagonia Mountains, Arizona (CNN)Once there was a bustling construction zone here. Now it's like a ghost town, frozen in time.\r\nHeavy machinery is parked and motionless. Stacks of steel bollards str… [+4986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Nothing short of an apocalypse': Indian doctor on Covid crisis", "description": "CNN's John Berman speaks with Dr. Farah Husain, head of a Covid-19 ICU unit at a hospital in India, about the country's coronavirus crisis. India reported almost 380,000 new infections on April 29, marking yet another global record for the highest single-day …", "url": "https://www.cnn.com/videos/world/2021/04/30/india-coronavirus-deaths-narendra-modi-husain-intv-berman-newday-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430115216-farah-husain-doctor-india-coronavirus-new-day-april-30-super-tease.jpg", "publishedAt": "2021-04-30T12:19:20Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Why Amazon is the 'perfect' moneymaking machine", "description": "Throughout the pandemic, Amazon has had no trouble generating huge returns. Once the Covid-19 crisis passes, it's in great shape to make even more money.", "url": "https://www.cnn.com/2021/04/30/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308110806-amazon-distribution-ca-file-super-tease.jpg", "publishedAt": "2021-04-30T12:09:42Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)Throughout the pandemic, Amazon(AMZN) has had n… [+6397 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "What the world's most expensive Irish whiskey tastes like", "description": "Ireland's Midleton Very Rare whiskey distillery has just launched the second batch in its Silent Distillery Collection, a 46-year-old single pot still whiskey with a price tag of $45,000. CNN Travel had a taste", "url": "https://www.cnn.com/travel/article/midleton-very-rare-irish-whiskey-chapter-two/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200219154457-most-expensive-irish-whiskey---midleton-very-rare-bottle-image-super-tease.jpg", "publishedAt": "2021-04-30T11:58:41Z", "content": "London (CNN) The second batch of Ireland's oldest ever whiskey collection will be released this May -- and a single bottle costs $45,000. \r\nPresented in a hand blown Waterford Crystal decanter and di… [+4553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, CNN", "title": "Two nations stagger under the onslaught of Covid", "description": "Outbreaks in India and Brazil have pushed global figures to over 150 million cases.", "url": "https://www.cnn.com/2021/04/30/world/coronavirus-newsletter-intl-04-30-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-04-30T11:45:23Z", "content": "A version of this story appeared in the April 30 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)Flames crackle ove… [+6476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lianne Kolirin, CNN", "title": "First pregnant Egyptian mummy surprises researchers", "description": "Polish researchers examining an Egyptian mummy previously believed to be a male priest discover it was actually a woman after spotting the tiny foot of a 26-30 week old fetus in her abdomen.", "url": "https://www.cnn.com/travel/article/pregnant-mummy-revealed-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430104921-06-pregnant-egyptian-mummy-super-tease.jpg", "publishedAt": "2021-04-30T11:38:19Z", "content": "(CNN) An Egyptian mummy previously believed to be a priest has turned out to be a pregnant woman. \r\nThe surprise discovery, the first of its kind anywhere in the world, was made by Polish scientists … [+3837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nina Trieu Tarnay; \nVideo by Paddy Driscoll, Shane Csontos-Popko, Melody Shih, Ignacio Osorio, Kelly Flynn, Madeleine Stix, CNN", "title": "Opinion: We left my little brother and a world behind us when we escaped Vietnam by boat", "description": "Over 40 years ago, Nina Trieu Tarnay and her mother climbed onto a boat in Vietnam bound for America. They fled, separated from her father and without her little brother, dividing their family in case not all of them made it. She shares her family's American …", "url": "https://www.cnn.com/2021/04/30/opinions/escape-from-vietnam-after-saigon-our-american-story-trieu-tarnay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429172607-nina-trieu-tarnay-family-young-super-tease.jpg", "publishedAt": "2021-04-30T11:32:58Z", "content": "Opinion by Nina Trieu Tarnay; Video by Paddy Driscoll, Shane Csontos-Popko, Melody Shih, Ignacio Osorio, Kelly Flynn, Madeleine Stix, CNN\r\nUpdated 7:32 AM ET, Fri April 30, 2021\r\nNina Trieu Tarnay li… [+9210 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Francesca Street, CNN", "title": "The past, present and future of space tourism", "description": "It's 20 years since the first private citizen traveled to space. In the two decades since Dennis Tito went into orbit, only a handful of space tourists have followed in his footsteps, but companies like SpaceX are hoping your next big vacation might be out of…", "url": "https://www.cnn.com/travel/article/space-tourism-20-year-anniversary-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303180913-space-hotel-voyager-station-2-super-tease.jpg", "publishedAt": "2021-04-30T11:29:20Z", "content": "(CNN) On April 30, 2001, US millionaire Dennis Tito arrived at the International Space Station (ISS) via a Russian Soyuz rocket, becoming the world's first space tourist.\r\nFor Tito, then 60, it was t… [+9870 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ada Wood, CNN", "title": "How to socialize for the first time again after a year of isolation", "description": "I've been wanting to take my friend to my favorite tea shop for what seems like forever. Ever since we had to switch from having our tea in person to sipping over video calls during the pandemic, I've been looking forward to having a reunion at \"Dr. Bombay's …", "url": "https://www.cnn.com/2021/04/30/health/post-pandemic-socializing-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428104436-drinking-tea-coffee-stock-restricted-super-tease.jpg", "publishedAt": "2021-04-30T10:42:44Z", "content": "(CNN)I've been wanting to take my friend to my favorite tea shop for what seems like forever. Ever since we had to switch from having our tea in person to sipping over video calls during the pandemic… [+5652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Live from LA, it's Buffettpalooza. What to expect from Berkshire Hathaway's annual meeting", "description": "Forget the Oscars. If you're looking for star power — in the business world, at least — it doesn't get any bigger than Warren Buffett, and he'll be live from Los Angeles on Saturday for the latest Berkshire Hathaway annual shareholder meeting.", "url": "https://www.cnn.com/2021/04/30/investing/warren-buffett-berkshire-hathaway-meeting-preview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200129113709-warren-buffett-0503-file-super-tease.jpg", "publishedAt": "2021-04-30T10:41:34Z", "content": "New York (CNN BUsiness)Forget the Oscars. If you're looking for star power in the business world, at least it doesn't get any bigger than Warren Buffett, and he'll be live from Los Angeles on Saturda… [+4154 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for April 30: Coronavirus, police reform, security hacks, Afghanistan, Israel", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/04/30/us/five-things-april-30-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430011826-india-covid-0429-super-tease.jpg", "publishedAt": "2021-04-30T10:23:26Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Donie O'Sullivan, CNN\nVideo by Jeremy Moorhead, CNN", "title": "Texas congressional race showcases GOP fight over Trump, conspiracy theories and election lies", "description": "Some Republicans in a crowded field of candidates competing for a US House seat in Texas ahead of a May 1 special election have embraced Donald Trump and his political legacy. A former professional wrestler is using the tagline \"make America Texas again\" as h…", "url": "https://www.cnn.com/2021/04/30/politics/texas-6th-congressional-special-election-trump-conspiracy-theories/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429222942-texas-6th-district-special-election-super-tease.jpg", "publishedAt": "2021-04-30T10:01:27Z", "content": "Mansfield, Texas (CNN)Some Republicans in a crowded field of candidates competing for a US House seat in Texas ahead of a May 1 special election have embraced Donald Trump and his political legacy. A… [+11613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Former Germany defender Christoph Metzelder found guilty of sharing child pornography pictures", "description": "Former Germany defender Christoph Metzelder was given a 10-month suspended prison sentence on Thursday after being found guilty of sharing pictures of child pornography with acquaintances through a message service, a court in Düsseldorf said.", "url": "https://edition.cnn.com/2021/04/30/football/christoph-metzelder-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430102926-01-christoph-metzelder-trial-0429-super-tease.jpg", "publishedAt": "2021-04-30T09:48:01Z", "content": "Former Germany defender Christoph Metzelder was given a 10-month suspended prison sentence on Thursday after being found guilty of sharing pictures of child pornography with acquaintances through a m… [+876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "China orders Tencent and other big tech firms to curb their finance businesses", "description": "Chinese regulators have ordered more than a dozen tech companies to fix the most \"prominent problems\" of their financial units, escalating a historic crackdown on the sector that has already engulfed some of the country's top players.", "url": "https://www.cnn.com/2021/04/30/tech/china-tech-crackdown-finance-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430025109-pboc-in-beijing-0304-restricted-super-tease.jpg", "publishedAt": "2021-04-30T08:40:01Z", "content": "Hong Kong (CNN Business)Chinese regulators have ordered more than a dozen tech companies to fix the most \"prominent problems\" of their financial units, escalating a historic crackdown on the sector t… [+2792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallika Kallingal, Jason Carroll and Laura Dolan CNN", "title": "Andrew Brown Jr.'s relative disputes official account of the fatal police shooting", "description": "A relative of Andrew Brown Jr., who was fatally shot by police last week, has offered a different account of what happened in Elizabeth City, North Carolina, when police fired on the 42-year-old Black man.", "url": "https://www.cnn.com/2021/04/30/us/andrew-brown-elizabeth-city-shooting-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423120938-andrew-brown-file-super-tease.jpg", "publishedAt": "2021-04-30T08:36:01Z", "content": "(CNN)A relative of Andrew Brown Jr., who was fatally shot by police last week, has offered a different account of what happened in Elizabeth City, North Carolina, when police fired on the 42-year-old… [+3105 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "'Anybody anywhere can join': How African book clubs are bringing together readers from across the world", "description": "In a year of isolation, virtual book clubs in Africa are connecting people across the continent and around the globe.", "url": "https://www.cnn.com/2021/04/30/africa/african-virtual-book-clubs-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430085315-restricted-african-virtual-book-clubs-jola-ayeye-card-super-tease.jpg", "publishedAt": "2021-04-30T07:58:18Z", "content": "Born in Rabat, Morocco, Laila Lalami is a novelist and essayist. Her debut collection of short stories, \"Hope and Other Dangerous Pursuits,\" was published in 2005. Nearly a decade later her book \"The… [+481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "As America starts to reopen, experts warn more people need to get vaccinated", "description": "As May arrives, the US is taking a major step toward resuming normal life, with cities, businesses and entertainment venues announcing plans to begin reopening after the deadly winter surge of Covid-19 infections.", "url": "https://www.cnn.com/2021/04/30/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210430023340-new-york-city-0413-restricted-super-tease.jpg", "publishedAt": "2021-04-30T07:54:02Z", "content": "(CNN)As May arrives, the US is taking a major step toward resuming normal life, with cities, businesses and entertainment venues announcing plans to begin reopening after the deadly winter surge of C… [+6059 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/kara-fox\">Kara Fox</a> and <a href=\"/profiles/nick-thompson\">Nick Thompson</a>, CNN", "title": "Israel religious festival stampede kills 44", "description": "At least 44 worshipers die in a stampede during a mass religious gathering at Israel's Mount Meron overnight. Get the latest updates here.", "url": "https://www.cnn.com/middleeast/live-news/israel-mount-meron-stampede-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429202954-israel-mount-meron-overcrowding-super-tease.jpg", "publishedAt": "2021-04-30T07:09:38Z", "content": "Israeli investigators are examining what caused a crush that killed at least 44 worshipers at a mass religious gathering in Mount Meron overnight.\r\nThousands of worshipers had crowded onto the mounta… [+1146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Top US, Japanese and South Korean military leaders meet, underscoring US shift from the Middle East to China", "description": "The top US general met his South Korean and Japanese counterparts in Hawaii Thursday, emphasizing America's commitment to \"long-term peace and stability in the region\" and underscoring a broader US shift from the Middle East to China.", "url": "https://www.cnn.com/2021/04/30/politics/us-japan-south-korea-generals-meet-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303070141-file-mark-milley-2020-super-tease.jpg", "publishedAt": "2021-04-30T05:13:56Z", "content": "Honolulu (CNN)The top US general met his South Korean and Japanese counterparts in Hawaii Thursday, emphasizing America's commitment to \"long-term peace and stability in the region\" and underscoring … [+2472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Exclusive by Nic Robertson and Saleem Mehsud, CNN", "title": "Al Qaeda promises 'war on all fronts' against America as Biden pulls out of Afghanistan", "description": "This weekend marks the 10th anniversary since Osama Bin Laden, the mastermind of the September 11, 2001, attacks on the United States, was killed by US special-operations forces, Seal Team 6, inside his high-walled compound in the Pakistani military college c…", "url": "https://www.cnn.com/2021/04/30/asia/al-qaeda-afghanistan-biden-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429140135-01-afghanistan-al-qaeda-intl-cmd-super-tease.jpg", "publishedAt": "2021-04-30T05:07:02Z", "content": "(CNN)This weekend marks the 10th anniversary since Osama Bin Laden, the mastermind of the September 11, 2001, attacks on the United States, was killed by US special-operations forces, Seal Team 6, in… [+8634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and James Griffiths, CNN", "title": "The great power race between the US and China is on. And Beijing is confident of winning", "description": "When US President Joe Biden urged Americans to \"win the 21st century\" in his joint address to Congress, he painted a picture of a new great power competition with China and repeatedly name checked its leader, Xi Jinping.", "url": "https://www.cnn.com/2021/04/30/china/biden-xi-china-us-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428225508-69-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-30T05:03:55Z", "content": "This is a wrap of several top stories from China for April 30, 2021.\r\nHong Kong (CNN)When US President Joe Biden urgedAmericans to \"win the 21st century\" in his joint address to Congress, he painted … [+7616 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "The Daily Beast: Gaetz associate wrote in letter that congressman paid for sex with minor", "description": "Joel Greenberg, a central figure in the ongoing investigation into Florida Republican Rep. Matt Gaetz, wrote in a letter obtained by The Daily Beast that he and Gaetz paid for sex with multiple women, including a minor who was 17 at the time.", "url": "https://www.cnn.com/2021/04/30/politics/matt-gaetz-joel-greenberg-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423163611-matt-gaetz-probe-public-corruption-medical-marijuana-reid-lead-vpx-00000712-super-tease.jpg", "publishedAt": "2021-04-30T04:48:15Z", "content": "Washington (CNN)Joel Greenberg, a central figure in the ongoing investigation into Florida Republican Rep. Matt Gaetz, wrote in a letter obtained by The Daily Beast that he and Gaetz paid for sex wit… [+3555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Double crises of coup and Covid could push half of Myanmar's population into poverty, UN warns", "description": "Almost half of Myanmar's population could be forced into poverty by the end of the year as the country teeters on the brink of economic collapse caused by the double shock of a bloody military coup and the Covid-19 pandemic, according to a new United Nations …", "url": "https://www.cnn.com/2021/04/30/asia/myanmar-coup-covid-poverty-undp-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429015202-01-myanmar-market-0205-super-tease.jpg", "publishedAt": "2021-04-30T04:39:05Z", "content": "(CNN)Almost half of Myanmar's population could be forced into poverty by the end of the year as the country teeters on the brink of economic collapse caused by the double shock of a bloody military c… [+7166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Crawford, National Security Producer", "title": "A former Louisiana police officer indicted for an alleged 2019 assault of a man under arrest", "description": "A former Louisiana police officer has been indicted by a federal grand jury for allegedly punching, pistol-whipping and kicking a man who was under arrest.", "url": "https://www.cnn.com/2021/04/30/us/shreveport-louisiana-officer-excessive-force-indictment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200701141247-shrevport-police-officers-investigation-super-tease.jpg", "publishedAt": "2021-04-30T04:27:38Z", "content": "(CNN)A former Louisiana police officer has been indicted by a federal grand jury for allegedly punching, pistol-whipping and kicking a man who was under arrest. \r\nDylan Hudson of the Shreveport Polic… [+1511 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Uvistra Naidoo and Mark Feinberg", "title": "Covid 19's lessons are key to crushing the world's most brutal infectious disease", "description": "TB pediatrician Uvistra Naidoo, and former science officer with Merck Vaccines Mark Feinberg, write on the extraordinary pace of the development of vaccines against Covid-19 and the urgency of the current rollout across the globe.", "url": "https://www.cnn.com/2021/04/30/opinions/immunization-covid-tb-vaccine-naidoo-feinberg/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429163319-coronavirus-vaccine-portland-oregon-file-super-tease.jpg", "publishedAt": "2021-04-30T04:14:04Z", "content": "Uvistra Naidoo is a TB pediatrician, scientist, advocate, and survivor of multi-drug resistant (MDR)-TB based in Cape Town, South Africa. Mark Feinberg is president and CEO of the International AIDS … [+8043 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ben-westcott\">Ben Westcott</a>, <a href=\"/profiles/kara-fox\">Kara Fox</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on Covid-19 and India's worsening crisis", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-30-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-30T04:01:20Z", "content": "The seven-day average of new Covid-19 deaths in the United States is around 684 newly reported lives lost each day as of Wednesday, according to the latest data from Johns Hopkins University. The sev… [+1027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Idaho state representative resigns amid allegations of sexual misconduct", "description": "Republican Idaho state Rep. Aaron von Ehlinger resigned Thursday afternoon, hours after the state's House Ethics Committee had unanimously recommended he be censured and stripped of the powers of his office without pay.", "url": "https://www.cnn.com/2021/04/29/politics/idaho-representative-resign-ethics-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429232403-aaron-von-ehlinger-0428-super-tease.jpg", "publishedAt": "2021-04-30T03:52:54Z", "content": "(CNN)Republican Idaho state Rep. Aaron von Ehlinger resigned Thursday afternoon, hours after the state's House Ethics Committee had unanimously recommended he be censured and stripped of the powers o… [+2783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Full FDA approval of Covid-19 vaccines could help fight vaccine hesitancy, officials say", "description": "As a condition of the emergency use authorizations issued for the Pfizer/BioNTech and Moderna coronavirus vaccines, those companies are expected to work toward asking the US Food and Drug Administration for full approval -- and some health officials are hopin…", "url": "https://www.cnn.com/2021/04/29/health/fda-approval-covid-19-vaccines-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429130255-vaccination-0414-florida-super-tease.jpg", "publishedAt": "2021-04-30T03:32:43Z", "content": "(CNN)As a condition of the emergency use authorizations issued for the Pfizer/BioNTech and Moderna coronavirus vaccines, those companies are expected to work toward asking the US Food and Drug Admini… [+6834 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kieron Monks, CNN", "title": "Germany to return looted Benin Bronzes to Nigeria", "description": "Precious artifacts looted during the colonial era will be returned to Nigeria from 2022, the German government has announced.", "url": "https://www.cnn.com/style/article/benin-bronzes-germany-restitution/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429215713-01-benin-bronzes-restricted-super-tease.jpg", "publishedAt": "2021-04-30T03:03:12Z", "content": "artsPublished 30th April 2021\r\nPrecious artifacts that were looted during the colonial era will finally be returned to Nigeria, the German government has announced. The first returns are planned for … [+5462 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd and Ryan Nobles, CNN", "title": "Biden invites Capito to the White House on infrastructure but warns 'it's a no-go from me' if GOP doesn't meet him halfway", "description": "President Joe Biden has invited Sen. Shelly Moore Capito back to the White House to discuss infrastructure, the President told reporters Thursday, a week after the West Virginia Republican unveiled a counterproposal to the White House's $2 trillion package.", "url": "https://www.cnn.com/2021/04/29/politics/infrastructure-joe-biden-shelley-moore-capito/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426201308-biden-march-19-super-tease.jpg", "publishedAt": "2021-04-30T02:46:01Z", "content": "(CNN)President Joe Biden has invited Sen. Shelly Moore Capito back to the White House to discuss infrastructure, the President told reporters Thursday, a week after the West Virginia Republican unvei… [+3017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare", "title": "World's longest pedestrian suspension bridge opens in Portugal", "description": "The world's longest pedestrian suspension bridge has just opened in Portugal. 516 Arouca connects Aguieiras Waterfall and Paiva Gorge and is the latest adventure offering in the Arouca Geopark, known for its extreme sports.", "url": "https://www.cnn.com/travel/article/world-longest-pedestrian-suspension-bridge-portugal-arouca/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201009162249-arouca-super-tease.jpg", "publishedAt": "2021-04-30T02:16:24Z", "content": "Maureen O'HareUpdated 30th April 2021\r\n(CNN) The world's longest pedestrian suspension bridge has just opened in Portugal. \r\n516 Arouca -- so called because it's 516 meters long and is in the town of… [+2178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Japanese airline debuts hands-free plane lavatory doors", "description": "Japanese airline ANA is trialing a new innovation that could make your next flight more hygienic -- bathroom doors that you can open without having to use your hands.", "url": "https://www.cnn.com/travel/article/hands-free-airplane-bathroom-doors-wellness-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200823201739-02-ana-japan-hands-free-door-super-tease.jpg", "publishedAt": "2021-04-30T01:16:48Z", "content": "(CNN) Japanese airline ANA is trialing a new innovation that could make your next flight more hygienic -- bathroom doors that you can open without having to use your hands.\r\nThe airline will roll out… [+2275 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "Why so many people in China are becoming mermaids", "description": "A shoal of 100 mermaid divers broke the Guinness World Record for largest underwater mermaid show on April 28 in China. The sport has experienced a surge in interest in recent years, with mermaid courses now accounting for 30% of all diving certificates in Ch…", "url": "https://www.cnn.com/travel/article/china-mermaid-diving-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428160436-02-mermaid-swimming-world-record-restricted-super-tease.jpg", "publishedAt": "2021-04-30T01:07:38Z", "content": "(CNN) On a normal day, the Ambassador Lagoon inside China's Atlantis Sanya resort on the island of Hainan is home to about 86,000 marine creatures from over 280 animal species.\r\nBut on April 28, this… [+6216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Sealy, Nadia Kounang and Ryan Prior, CNN", "title": "Manufacturers change shipment sizes as coronavirus vaccine demand falls", "description": "With demand for Covid-19 vaccines falling off, mass vaccination sites around the country find themselves facing a dilemma of how to deliver vaccines without wasting precious doses.", "url": "https://www.cnn.com/2021/04/29/health/pfizer-moderna-shipment-vials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429173248-pfizer-vaccine-philadelphia-0302-super-tease.jpg", "publishedAt": "2021-04-30T01:06:33Z", "content": "(CNN)With demand for Covid-19 vaccines falling off, mass vaccination sites around the country find themselves facing a dilemma of how to deliver vaccines without wasting precious doses.\r\nState and lo… [+6506 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Sen. Marsha Blackburn falsely claims Biden would force people to attend pre-K and two years of college", "description": "Republican Tennessee Sen. Marsha Blackburn tried Wednesday to portray President Joe Biden's new $1.8 trillion American Families Plan proposal as an \"anti-family\" initiative that would reduce Americans' control over their own lives.", "url": "https://www.cnn.com/2021/04/29/politics/fact-check-blackburn-biden-families-plan-pre-k-college/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429174741-marsha-blackburn-march-2021-restricted-super-tease.jpg", "publishedAt": "2021-04-30T00:09:43Z", "content": "Washington (CNN)Republican Tennessee Sen. Marsha Blackburn tried Wednesday to portray President Joe Biden's new $1.8 trillion American Families Plan proposal as an \"anti-family\" initiative that would… [+3558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rashard Rose and Paul LeBlanc, CNN", "title": "DC Police personnel files obtained by hackers in recent ransomware attack, acting police chief says", "description": "The personnel files of some Washington Metropolitan Police Department officers were obtained by hackers in a ransomware attack earlier this month, the department's acting police chief said Thursday.", "url": "https://www.cnn.com/2021/04/29/politics/dc-police-ransomware-attack-personnel-files/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201029151522-ransomware-attacks-target-hospitals-election-voter-databases-ferrante-nr-vpx-00000102-super-tease.jpg", "publishedAt": "2021-04-30T00:04:55Z", "content": "Washington (CNN)The personnel files of some Washington Metropolitan Police Department officers were obtained by hackers in a ransomware attack earlier this month, the department's acting police chief… [+2238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands and Brian Fung, CNN", "title": "Five federal agencies potentially breached in Pulse Connect Secure hack", "description": "At least five federal civilian agencies appear to have been breached in the latest hack to hit the US government, a discovery that follows emergency measures to mitigate potential damage from the incident, according to a top official at the Cybersecurity and …", "url": "https://www.cnn.com/2021/04/29/politics/pulse-connect-secure-vpn-hack-federal-agencies-potential-breach/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420190351-pulse-secure-headquarters-super-tease.jpg", "publishedAt": "2021-04-29T23:47:16Z", "content": "(CNN)At least five federal civilian agencies appear to have been breached in the latest hack to hit the US government, a discovery that follows emergency measures to mitigate potential damage from th… [+2397 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Plague wasn't the only disease that afflicted medieval Britons. Cancer did, too", "description": "Cancer wasn't thought to be a major affliction in medieval times, but new research has suggested the disease was much more common than previously thought.", "url": "https://www.cnn.com/2021/04/29/health/cancer-medieval-england-scn-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429141319-01-cancer-medieval-england-super-tease.jpg", "publishedAt": "2021-04-29T23:12:11Z", "content": "(CNN)The earliest description of cancer is from an ancient Egyptian papyrus, and going back further, evendinosaurs suffered a form of the disease. But cancer long has been thought to have become a co… [+4201 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Martin, CNN", "title": "Report: NFL MVP Aaron Rodgers does not want to return to the Packers", "description": "Aaron Rodgers, the reigning NFL MVP and the starting quarterback of the Green Bay Packers, does not want to return to the team, according to a report from ESPN.", "url": "https://www.cnn.com/2021/04/29/us/aaron-rodgers-green-bay-packers-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210109122110-aaron-rogers-file-super-tease.jpg", "publishedAt": "2021-04-29T23:10:46Z", "content": "(CNN)Aaron Rodgers, the reigning NFL MVP and the starting quarterback of the Green Bay Packers, does not want to return to the team, according to a report from ESPN. \r\nESPN's Adam Schefter, citing un… [+689 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Joe Rogan addresses his controversial anti-vaccine comments", "description": "Joe Rogan, Spotify's top podcast host, responded to the controversy surrounding his remarks that healthy young people should not get the Covid vaccine.", "url": "https://www.cnn.com/2021/04/29/media/joe-rogan-clarifies-vaccine-comments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429175350-joe-rogan-file-super-tease.jpg", "publishedAt": "2021-04-29T23:07:40Z", "content": "New York (CNN Business)Joe Rogan, Spotify's(SPOT) top podcast host, responded to the controversy surrounding his remarks that healthy young people should not get the Covid vaccine.\r\nOn Thursday's epi… [+2256 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Living in the world of pants-on-fire lies", "description": "Removing President Donald Trump from office -- and social media -- hasn't rid Americans of a political environment where lies and liars are normalized, says historian Nicole Hemmer. Effectively fighting misinformation and rejecting pseudo-stories about beef a…", "url": "https://www.cnn.com/2021/04/29/opinions/trump-lying-in-politics-goes-deeper-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210128150146-01-kevin-mccarthy-trump-file-super-tease.jpg", "publishedAt": "2021-04-29T22:59:09Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+8663 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Clay Cane", "title": "Tim Scott's deeply deceptive response to Joe Biden", "description": "Sen. Tim Scott's rebuttal to President Joe Biden's joint address to Congress showcased one of the main requirements for today's Black Republicans, says Clay Cane: the tricky logic of downplaying racism while simultaneously playing the race card.", "url": "https://www.cnn.com/2021/04/29/opinions/tim-scott-rebuttal-to-biden-wasnt-cane/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428223632-02-gop-response-tim-scott-play-button-super-tease.jpg", "publishedAt": "2021-04-29T22:51:30Z", "content": "Clay Cane is a Sirius XM radio host and the author of \"Live Through This: Surviving the Intersections of Sexuality, God, and Race.\" Follow him on Twitter @claycane. The opinions expressed in this com… [+6639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Klairmont, CNN", "title": "Covid forced too many parents to choose between work and helping their kids with remote classes. This CNN Hero is giving families the support to do both", "description": "CNN Hero Jennifer Maddox transformed her after-school center into a remote learning hub to help keep students on track and give families peace of mind.", "url": "https://www.cnn.com/2021/04/29/us/chicago-schools-covid-remote-learning-student-support-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429142004-cnnheroes-maddox-with-student-2021-super-tease.jpg", "publishedAt": "2021-04-29T22:26:40Z", "content": "(CNN)As the vaccine rollout continues and parts of the US loosen restrictions, school reopenings in some communities are still in flux. For many families of remote students, parents returning to work… [+6485 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Minnesota man sentenced to 4 years in prison for role in setting ablaze a Minneapolis police precinct during Floyd protests", "description": "Minnesota man was sentenced to four years in prison and must pay $12 million in restitution for his role in damaging a Minneapolis police station in the wake of racial injustice protests sparked by the murder of George Floyd.", "url": "https://www.cnn.com/2021/04/29/us/floyd-protester-sentenced/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429151441-minneapolis-police-station-fire-0528-super-tease.jpg", "publishedAt": "2021-04-29T22:14:37Z", "content": "(CNN)A Minnesota man was sentenced to four years in prison and ordered to pay $12 million in restitution for his role in damaging a Minneapolis police station amid racial injustice protests sparked b… [+844 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "She just became the oldest living person in the US and all she wants is to be able to eat meals with her friend again", "description": "At 114 years old, Thelma Sutcliffe just became the oldest living American, according to the Gerontology Research Group. She is also the 7th oldest person in the world, and all she wants to do is eat meals with her friend.", "url": "https://www.cnn.com/2021/04/29/us/oldest-living-american-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429170954-oldest-living-american-trnd-super-tease.jpg", "publishedAt": "2021-04-29T22:11:38Z", "content": "(CNN)At 114 years old, Thelma Sutcliffe just became the oldest living American, according to the Gerontology Research Group. She is also the 7th oldest person in the world, and all she wants to do is… [+1458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson and Caitlin Hu, CNN", "title": "The key lines from Biden's address to Congress for the rest of the world", "description": "\"Madam Speaker, Madam Vice President.\" Those were words that no President has ever said before while addressing a joint session of Congress -- and they explain why the image above is what history will remember from Joe Biden's big speech on Wednesday night.", "url": "https://www.cnn.com/2021/04/29/world/meanwhile-in-america-april-29-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428220703-43-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T22:09:27Z", "content": "This was excerpted from the April 29 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)\"Madam Speaker… [+6875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The Axle Barbell will give you a killer multifunctional workout, after you get used to it", "description": "The Axle Barbell — an ultralight Olympic barbell that's often used in group fitness classes at boutique gyms — is a versatile barbell that promises a total body workout in the comfort of your home.", "url": "https://www.cnn.com/2021/04/29/cnn-underscored/axle-barbell-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429165737-axle-barbell-lead-super-169.jpg", "publishedAt": "2021-04-29T21:54:59Z", "content": "With an increased demand for at-home workout equipment coupled with stock issues across the board, this past year has shone a spotlight on the need for multifunctional exercise accessories. The Axle … [+4664 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Biden administration says it's consulting 'nonstop' with India with first aid shipment en route", "description": "The Biden administration has been consulting \"nonstop\" with the Indian government on their priorities as the country grapples with a catastrophic coronavirus surge that has left its healthcare system on the brink of collapse, according to a top US Agency for …", "url": "https://www.cnn.com/2021/04/29/politics/india-covid-response-biden-administration-consulting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427121901-01-india-covid-ward-0427-super-tease.jpg", "publishedAt": "2021-04-29T21:47:23Z", "content": "(CNN)The Biden administration has been consulting \"nonstop\" with the Indian government on their priorities as the country grapples with a catastrophic coronavirus surge that has left its healthcare s… [+5030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Biden administration says it's consulting 'nonstop' with India with first aid shipment en route", "description": "The Biden administration has been consulting \"nonstop\" with the Indian government on their priorities as the country grapples with a catastrophic coronavirus surge that has left its healthcare system on the brink of collapse, according to a top US Agency for …", "url": "https://www.cnn.com/2021/04/29/politics/india-covid-response-biden-administration-consulting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427121901-01-india-covid-ward-0427-super-tease.jpg", "publishedAt": "2021-04-29T21:47:23Z", "content": "(CNN)The Biden administration has been consulting \"nonstop\" with the Indian government on their priorities as the country grapples with a catastrophic coronavirus surge that has left its healthcare s… [+5030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "More than 100 US colleges and universities are now requiring students to get Covid-19 vaccinations", "description": "More than 100 US college and universities have said they will require all their students to get vaccinated against Covid-19 before they return to campus for the fall semester. Drew University, University of Massachusetts at Lowell, Washington State University…", "url": "https://www.cnn.com/2021/04/29/health/student-vaccine-requirement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429163319-coronavirus-vaccine-portland-oregon-file-super-tease.jpg", "publishedAt": "2021-04-29T21:45:10Z", "content": "(CNN)College students hesitant to receive a Covid-19 vaccination may need to rethink their decision. As most colleges in the US inch toward the end of the spring semester, a new procedure is taking s… [+2199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Erica Orden", "title": "Rudy Giuliani expected to wage court fight over files seized in federal raid", "description": "With federal authorities now in possession of Rudy Giuliani's electronic devices as a result of search warrants executed on his Manhattan residence and office Wednesday, federal officials anticipate a court fight over their potentially privileged contents.", "url": "https://www.cnn.com/2021/04/29/politics/giuliani-ukraine-federal-raid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201222110730-rudy-giuliani-1107-super-tease.jpg", "publishedAt": "2021-04-29T21:40:23Z", "content": "(CNN)With federal authorities now in possession of Rudy Giuliani's electronic devices as a result of search warrants executed on his Manhattan residence and office Wednesday, federal officials antici… [+4862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Number of children held in Border Patrol facilities drops 84% since peak last month", "description": "The number of unaccompanied migrant children in jail-like conditions by US Customs and Border Protection dropped nearly 84% in the span of a month, according to a White House official, underscoring the significant progress made by the administration after rea…", "url": "https://www.cnn.com/2021/04/29/politics/border-patrol-unaccompanied-minors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323130008-05-border-facility-donna-texas-super-tease.jpg", "publishedAt": "2021-04-29T21:30:06Z", "content": "(CNN)The number of unaccompanied migrant children in jail-like conditions by US Customs and Border Protection dropped nearly 84% in the span of a month, according to a White House official, underscor… [+4305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Amazon profit soars more than 200% in the first quarter", "description": "Amazon's profits more than tripled in the first quarter of 2021, as the pandemic continued to boost its online retail, cloud and advertising businesses.", "url": "https://www.cnn.com/2021/04/29/tech/amazon-q1-earnings-profit-spike/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429145300-amazon-delivery-0202-super-tease.jpg", "publishedAt": "2021-04-29T21:01:19Z", "content": "New York (CNN Business)Amazon's profits more than tripled in the first quarter of 2021, as the pandemic continued to boost its online retail, cloud and advertising businesses. \r\nThe tech giant on Thu… [+2415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The best travel pillow of 2021", "description": "CNN Underscored spent weeks testing 10 of the most popular and highest-rated travel pillows on the market. And while many of the pillows we tested had their merits, there was one clear winner.", "url": "https://www.cnn.com/2021/04/29/cnn-underscored/best-travel-pillow/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429151536-travel-pillow-lead-super-169.jpg", "publishedAt": "2021-04-29T20:57:43Z", "content": "Travel pillows need to strike a tricky balance: not supportive enough and youll end up with a crick in your neck, too big and stiff youll, er, end up with a crick in your neck. They also need to be c… [+10938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Meg Jacobs", "title": "Joe Biden is old. Here's why that's a good thing", "description": "Meg Jacobs writes that President Joe Biden's age means he remembers a time when Democrats stood before the country and said unabashedly that a big and bold government was exactly what the country needed. Now, as President, he is reviving that same principle t…", "url": "https://www.cnn.com/2021/04/29/opinions/joe-biden-age-good-thing-jacobs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428212354-23-biden-address-0428-super-tease.jpg", "publishedAt": "2021-04-29T20:56:17Z", "content": "Meg Jacobs teaches history at Princeton University. Follow her on Twitter @MegJacobs100. The opinions expressed in this commentary are hers. Read more opinion on CNN.\r\n (CNN)The best thing about Pres… [+5074 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner, CNN Business", "title": "New York City sues Chipotle, alleging hundreds of thousands of labor law violations", "description": "New York City is suing Chipotle Mexican Grill, alleging that the company violated a law that requires fast food chains to give their employees more predictable, less hectic schedules.", "url": "https://www.cnn.com/2021/04/29/business/chipotle-nyc-lawsuit-labor-law/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429105039-chipotle-new-york-file-restricted-super-tease.jpg", "publishedAt": "2021-04-29T20:52:12Z", "content": "New York (CNN Business)New York City is suing Chipotle Mexican Grill, alleging that the company violated a law that requires fast food chains to give their employees more predictable, less hectic sch… [+3240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Risk from the J&J vaccine was never as big as it seemed", "description": "Risk from the J&J vaccine was never as big as it seemedcnn.com", "url": "https://www.cnn.com/interactive/2021/04/health/johnson-and-johnson-vaccine-risk-explained/", "urlToImage": "https://cdn.cnn.com/cnn/2021/images/04/28/social-jj-blood-clot-explainer.jpg", "publishedAt": "2021-04-29T20:47:36Z", "content": "Contextualizing those risks and benefits in a rational way is a lot harder than it may seem. Research has found that our brains are inclined to process risk as a feeling rather than through an analyt… [+5684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "18 personalized Mother's Day gifts that say the right thing", "description": "Celebrating your mom is an everyday event. That's why personalized Mother's Day gifts are a brilliant idea.", "url": "https://www.cnn.com/2021/04/29/cnn-underscored/personalized-mothers-day-gifts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426155906-personalizedmomsdaygifts-super-169.jpg", "publishedAt": "2021-04-29T20:35:27Z", "content": "Celebrating your mom is an everyday event. Thats why personalized Mothers Day gifts are a brilliant idea. You simply fill in the details, and the artisan does the rest of the magic. No matter if you … [+7572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez and Jessica Schneider, CNN", "title": "DOJ to seek indictment of Derek Chauvin and three other ex-Minneapolis police officers, reports say", "description": "Federal prosecutors are moving forward with plans to charge Derek Chauvin and three other former Minneapolis police officers with federal civil rights violations, according to two local media reports in Minnesota.", "url": "https://www.cnn.com/2021/04/29/us/derek-chauvin-minneapolis-officers-federal-indictment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201105103404-chauvin-thao-lane-keung-split-super-tease.jpg", "publishedAt": "2021-04-29T20:19:33Z", "content": "(CNN)Federal prosecutors are moving forward with plans to charge Derek Chauvin and three other former Minneapolis police officers with federal civil rights violations, according to two local media re… [+1900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "The Bidens visit the Carters in Georgia", "description": "President Joe Biden and first lady Jill Biden met with former President Jimmy Carter and former first lady Rosalynn Carter at the Carters' Plains, Georgia, home on Thursday.", "url": "https://www.cnn.com/2021/04/29/politics/bidens-carters-visit-georgia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429160339-bidens-leave-carter-home-0429-super-tease.jpg", "publishedAt": "2021-04-29T20:17:32Z", "content": "(CNN)President Joe Biden and first lady Jill Biden met with former President Jimmy Carter and former first lady Rosalynn Carter at the Carters' Plains, Georgia, home on Thursday. \r\nThe visit, which l… [+2528 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, CNN Polling Director", "title": "CNN Poll: About a quarter of adults say they won't try to get a Covid-19 vaccine", "description": "With a majority of adult Americans now at least partially vaccinated against coronavirus, roughly a quarter of adults say they will not try to get the shot, according to a new CNN Poll conducted by SSRS. That vaccine-hesitant 26% is much more willing to retur…", "url": "https://www.cnn.com/2021/04/29/politics/cnn-poll-covid-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429130255-vaccination-0414-florida-super-tease.jpg", "publishedAt": "2021-04-29T20:02:39Z", "content": "(CNN)With a majority of adult Americans now at least partially vaccinated against coronavirus, roughly a quarter of adults say they will not try to get the shot, according to a new CNN Poll conducted… [+5421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "Top US military intelligence official says Russian military poses an 'existential threat' to the US", "description": "The top US military intelligence official said during a congressional hearing on Thursday that the Russian military is an \"existential threat\" to the United States.", "url": "https://www.cnn.com/2021/04/29/politics/military-intel-leader-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429111002-02-lt-gen-scott-berrier-0414-super-tease.jpg", "publishedAt": "2021-04-29T20:00:31Z", "content": "(CNN)The top US military intelligence official said during a congressional hearing on Thursday that the Russian military is an \"existential threat\" to the United States.\r\n\"The Russian military is an … [+4425 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "\"Mighty Ducks: Game Changers\" stages reunion with possibly more familiar faces to come -- and maybe Aaron Rogers", "description": "For executive producer Steve Brill, the man behind the \"Mighty Ducks\" film franchise and the Disney+ series based on the world, he knew it was inevitable: At some point, he was going to bring the original Quack Attack back.", "url": "https://www.cnn.com/2021/04/29/entertainment/mighty-ducks-reunion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429101845-mighty-ducks-reunion-2-super-tease.jpeg", "publishedAt": "2021-04-29T19:49:57Z", "content": "(CNN)For executive producer Steve Brill, the man behind the \"Mighty Ducks\" film franchise and the Disney+ series based on the world, he knew it was inevitable: At some point, he was going to bring th… [+4088 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nick Paton Walsh, CNN", "title": "The lies that were told to sustain the US and UK mission in Afghanistan", "description": "In the end the lies about the US-led war in Afghanistan were bookended with -- even dominated by -- basic truths, writes Nick Paton Walsh. The lies themselves were not malicious -- more the deceit needed for survival. The things America had to tell itself to …", "url": "https://www.cnn.com/2021/04/29/opinions/lies-told-to-sustain-us-and-uk-mission-in-afghanistan-walsh/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414171517-50-afghanistan-war-unf-super-tease.jpg", "publishedAt": "2021-04-29T19:46:24Z", "content": "Nick Paton Walsh is the international security editor for CNN International. He was Kabul correspondent for CNN from 2011-2012 and has reported from Afghanistan for 15 years. The views expressed here… [+7103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond and Kaitlan Collins, CNN", "title": "White House ready to grind through next pandemic steps: 'Every 1% from here on out will represent incredible progress'", "description": "The next 100 days of President Joe Biden's term will test his administration in a new, critical way: Convincing those who are not yet vaccinated to do so while making it more convenient for them to get their shot.", "url": "https://www.cnn.com/2021/04/29/politics/next-100-days-of-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427161252-06-100-days-covid-super-tease.jpg", "publishedAt": "2021-04-29T19:42:44Z", "content": "Washington (CNN)The next 100 days of President Joe Biden's term will test his administration in a new, critical way: Convincing those who are not yet vaccinated to do so while making it more convenie… [+5580 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jonathan Reiner", "title": "Joe Rogan's dubious medical advice", "description": "The comedian and podcast host missed a huge opportunity to use his prominent platform to promote Covid-19 vaccination to a stubbornly hesitant young demographic. Instead, he offered decidedly unhelpful musings, writes Dr. Jonathan Reiner. He should be aware t…", "url": "https://www.cnn.com/2021/04/29/opinions/joe-rogan-covid-reiner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428072448-joe-rogan-vacines-podcast-newday-vpx-00001108-super-tease.png", "publishedAt": "2021-04-29T19:29:22Z", "content": "Dr. Jonathan Reiner is a CNN medical analyst and Professor of Medicine and Surgery at George Washington University. The views expressed in this commentary belong to the author. View more opinion at C… [+2983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Kevin McCarthy repeats debunked claim that Biden is trying to impose meat limits", "description": "By Monday, numerous media outlets had debunked the viral false claim that President Joe Biden has proposed to restrict how much red meat Americans are allowed to eat. Even a Fox News anchor admitted on air on Monday afternoon that the claim was inaccurate.", "url": "https://www.cnn.com/2021/04/29/politics/fact-check-kevin-mccarthy-biden-red-meat-limit-four-pounds/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420081324-02-kevin-mccarthy-0415-super-tease.jpg", "publishedAt": "2021-04-29T18:54:23Z", "content": "Washington (CNN)By Monday, numerous media outlets had debunked the viral false claim that President Joe Biden has proposed to restrict how much red meat Americans are allowed to eat. Even a Fox News … [+1795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "The pandemic disrupted organ transplants. But these three siblings aren't giving up", "description": "Organ transplants from living donors in 2020 dropped to numbers not seen in two decades. This has created challenges for one California family desperate for a new kidney.", "url": "https://www.cnn.com/2021/04/29/health/organ-donations-coronavirus-wellness-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428113746-02-organ-donations-coronavirus-wellness-trnd-super-tease.jpg", "publishedAt": "2021-04-29T18:45:39Z", "content": "(CNN)As coronavirus shut down the world last year, Terre Baldwin was getting a life-saving heart and kidney transplant in San Francisco. With no guests allowed in her hospital room, she spent most of… [+7834 chars]"}]}