{"status": "ok", "totalResults": 108, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts and Susannah Cullinane, CNN", "title": "Adoptive parents plead not guilty to murder of daughter, 6, as court documents describe horrific abuse allegations", "description": "A Hawaii couple charged with the murder of their adopted 6-year-old daughter pleaded not guilty via an attorney Friday, as court documents allege abusive treatment leading up to the girl's death, including her being kept in a dog cage to stop her searching fo…", "url": "https://www.cnn.com/2021/11/13/us/hawaii-ariel-adoptive-parents-court-plea/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113165418-kalua-parents-split-super-tease.jpg", "publishedAt": "2021-11-13T23:31:46Z", "content": "(CNN)A Hawaii couple charged with the murder of their adopted 6-year-old daughter pleaded not guilty via an attorney Friday, as court documents allege abusive treatment leading up to the girl's death… [+3049 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "US opens probe into Tesla's Autopilot over emergency vehicle crashes", "description": "WASHINGTON, Nov 12 (Reuters) - The U.S. National Highway Traffic Safety Administration (NHTSA) said it is looking into a consumer report that a Tesla Model Y was involved in an accident while using the company's Full Self-Driving (FSD) Beta software.", "url": "https://www.cnn.com/2021/11/13/tech/tesla-autopilot-emergency-crashes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113092130-tesla-stock-super-tease.jpg", "publishedAt": "2021-11-13T23:16:43Z", "content": "(CNN)WASHINGTON, Nov 12 (Reuters) - The U.S. National Highway Traffic Safety Administration (NHTSA) said it is looking into a consumer report that a Tesla Model Y was involved in an accident while us… [+1768 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeffrey Sachs", "title": "US can fight inflation and still 'build back better'", "description": "Many factors resulting from the Covid-19 crisis have produced the sharp rise in prices, but economist Jeffrey Sachs writes that inflation shouldn't derail the long-term investments in America's future contained in President Joe Biden's social spending bill.", "url": "https://www.cnn.com/2021/11/13/opinions/us-can-fight-inflation-build-back-better-sachs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113151138-turkeys-super-tease.jpg", "publishedAt": "2021-11-13T22:17:56Z", "content": "Jeffrey Sachs is a professor and director of the Center for Sustainable Development at Columbia University and president of the United Nations Sustainable Development Solutions Network. His most rece… [+7729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: Biden has to do a whole lot more on inflation", "description": "In a speech at the Port of Baltimore this week, President Joe Biden acknowledged that inflation was \"worrisome.\" With consumer prices increasing 6.2% over the last 12 months, the administration understands that it has a problem on its hands. Of course, the pr…", "url": "https://www.cnn.com/2021/11/13/opinions/inflation-biden-midterms-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112174726-02-biden-1112-super-tease.jpg", "publishedAt": "2021-11-13T21:51:42Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Abraham Joshua Heschel: A life of Radical Amazement.\" Follow him… [+6415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De la Fuente", "title": "Green Bay Packers star quarterback Aaron Rodgers expected to play Sunday", "description": "Green Bay Packers star quarterback Aaron Rodgers has been activated off the NFL's reserve/Covid-19 list, the team confirmed Saturday.", "url": "https://www.cnn.com/2021/11/13/sport/green-bay-packers-aaron-rodgers-expected-to-play-sunday-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113161553-aaron-rodgers-file-102821-super-tease.jpg", "publishedAt": "2021-11-13T21:22:46Z", "content": "(CNN)Green Bay Packers star quarterback Aaron Rodgers has been activated off the NFL's reserve/Covid-19 list, the team confirmed Saturday.\r\nRodgers, who missed the team's Week 9 game against the Kans… [+1279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt, CNN", "title": "Some Afghans trying to flee country face exorbitant costs as Blinken touts success of efforts to help Americans", "description": "Afghans desperate to flee the country are increasingly having to negotiate with private operators charging exorbitant sums while US Secretary of State Antony Blinken announced on Friday that all Americans who have asked to leave Afghanistan have been offered …", "url": "https://www.cnn.com/2021/11/13/politics/afghans-exorbitant-costs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210902111934-kabul-afghanistan-bank-queue-0831-super-tease.jpg", "publishedAt": "2021-11-13T21:20:20Z", "content": "(CNN)Afghans desperate to flee the country are increasingly having to negotiate with private operators charging exorbitant sums while US Secretary of State Antony Blinken announced on Friday that all… [+6182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sana Noor Haq, CNN", "title": "Top chef to leave London's Claridge's after hotel turns down plant-based menu", "description": "Top chef Daniel Humm will leave his post at London's prestigious Claridge's after the Mayfair hotel turned down his decision to serve an entirely plant-based menu.", "url": "https://www.cnn.com/travel/article/daniel-humm-claridges-exit-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113084107-01-claridges-rejects-plant-based-menu-intl-scli-super-tease.jpg", "publishedAt": "2021-11-13T16:02:39Z", "content": "(CNN) Top chef Daniel Humm will leave his post at London's prestigious Claridge's after the Mayfair hotel turned down his decision to serve an entirely plant-based menu.\r\nHumm opened the hotel's Davi… [+2709 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Veronica Stracqualursi, CNN", "title": "Federal appeals court reaffirms its decision to freeze Biden's vaccine mandate", "description": "A federal appeals court on Friday reaffirmed its earlier decision to freeze the Biden administration's vaccine mandate, calling the requirement for large employers to make sure its employees are vaccinated against Covid-19 \"staggeringly overbroad.\"", "url": "https://www.cnn.com/2021/11/13/politics/biden-vaccine-mandate-fifth-circuit-appeals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113093211-biden-vaccine-mandate-for-large-employers-super-tease.jpg", "publishedAt": "2021-11-13T15:46:16Z", "content": "(CNN)A federal appeals court on Friday reaffirmed its earlier decision to freeze the Biden administration's vaccine mandate, calling the requirement for large employers to make sure its employees are… [+2210 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Duarte Mendonca, CNN", "title": "Britain's army chief warns risk of accidental war with Russia is greater than during Cold War", "description": "The risk of an accidental war breaking out between Russia and the West is greater than at any time during the Cold War, Britain's most senior military officer has said in an interview with Times Radio.", "url": "https://www.cnn.com/2021/11/13/europe/uk-russia-war-risks-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210409080517-restricted-01-russia-forces-ukraine-border-0319-super-tease.jpg", "publishedAt": "2021-11-13T15:41:48Z", "content": "(CNN)The risk of an accidental war breaking out between Russia and the West is greater than at any time during the Cold War, Britain's most senior military officer has said in an interview with Times… [+1261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeff Yang", "title": "The future of digital art doesn't have to be paved with troll memes and trash", "description": "Jeff Yang cautions not to let NFTs go the way of social media platforms, becoming engines of misinformation and hate. He cites as a better example of how to use technology and aesthetics artist Drue Kataoka, whose work \"Will Your Heart Pass the Test?\" -- an N…", "url": "https://www.cnn.com/2021/11/13/opinions/nfts-beeple-drue-kataoka-social-justice-yang/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112173205-yang-oped-2-super-tease.jpg", "publishedAt": "2021-11-13T15:41:05Z", "content": "Jeff Yang is a frequent contributor to CNN Opinion, a featured writer for Quartz and other publications, and the co-host of the podcast \"They Call Us Bruce.\" He co-wrote Jackie Chan's bestselling aut… [+10655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by AJ Willingham, CNN", "title": "Britney's battle was an enduring consequence of the cruelest celebrity gossip era. We should never let it happen again", "description": "Britney Spears was placed at the center of the celebrity gossip culture of the early 2000s. Now that her conservatorship battle is over, she's reclaimed control of her life and deserves to chose to tell her story -- or not -- on her own terms.", "url": "https://www.cnn.com/2021/11/13/entertainment/britney-spears-whats-next/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714052443-file-britney-spears-2019-super-tease.jpg", "publishedAt": "2021-11-13T15:12:13Z", "content": "A previous version of this story originally published in July. It has been updated.\r\n (CNN)It is human nature to gossip, to peer behind the gossamer curtain of secrecy separating the rich and famous … [+7104 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Los Angeles is seeing a trend of 'follow-home' robberies targeting people based on their cars and jewelry, police say", "description": "There has been a slew of robberies in Los Angeles where the perpetrators target people based on the jewelry they're wearing and their cars, police said Friday.", "url": "https://www.cnn.com/2021/11/13/us/los-angeles-follow-home-robberies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113073610-los-angeles-police-1014-file-super-tease.jpg", "publishedAt": "2021-11-13T14:21:14Z", "content": "(CNN)There has been a slew of robberies in Los Angeles where the perpetrators target people based on the jewelry they're wearing and their cars, police said Friday. \r\nThe Los Angeles Police Departmen… [+1030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "10-year-old Utah Black and autistic student dies by suicide weeks after scathing DOJ report on school district", "description": "Isabella \"Izzy\" Tichenor, a 10-year-old Black and autistic student in Utah, died by suicide after allegedly being bullied by classmates and her family's complaints were ignored, the family's lawyer tells CNN. The tragedy comes just weeks after the Justice Dep…", "url": "https://www.cnn.com/videos/us/2021/11/13/isabella-tichenor-10-year-old-utah-black-autistic-student-suicide-ndwknd-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112154758-02-isabella-izzy-tichenor-super-tease.jpg", "publishedAt": "2021-11-13T14:18:09Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "Harris' trip to Paris signals a relationship back on track", "description": "As French President Emmanuel Macron arrived at the Arc de Triomphe for a national televised Armistice Day Ceremony, Vice President Kamala Harris -- donning the traditional bleuet de France honoring veterans -- waited to greet him.", "url": "https://www.cnn.com/2021/11/13/politics/kamala-harris-france-trip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110133831-kamala-harris-emmanuel-macron-paris-1110-super-tease.jpg", "publishedAt": "2021-11-13T14:16:42Z", "content": "Paris (CNN)As French President Emmanuel Macron arrived at the Arc de Triomphe for a national televised Armistice Day Ceremony, Vice President Kamala Harris -- donning the traditional bleuet de France… [+5186 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "Harry and Meghan visit Afghan refugees at Task Force Liberty", "description": "Harry and Meghan, the Duke and Duchess of Sussex, visited a military base Thursday where they met Afghan refugees who had made it to the United States.", "url": "https://www.cnn.com/2021/11/13/world/harry-meghan-afghan-refugees-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113061250-04-harry-meghan-afghan-refugees-intl-scli-super-tease.jpg", "publishedAt": "2021-11-13T13:22:32Z", "content": "(CNN)Harry and Meghan, the Duke and Duchess of Sussex, visited a military base Thursday where they met Afghan refugees who had made it to the United States.\r\nThe couple spoke with women recently arri… [+1666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Chernova, Antonia Mortensen and Duarte Mendonca, CNN", "title": "Russia has 'nothing to do with' Poland-Belarus border crisis, Putin insists", "description": "Russian President Vladimir Putin insisted Saturday that Russia has \"absolutely nothing to do with\" the ongoing crisis at the Poland-Belarus border, where thousands of people are stranded in desperate conditions.", "url": "https://www.cnn.com/2021/11/13/europe/poland-belarus-crisis-russia-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112100923-02-poland-belarus-border-migrants-1112-super-tease.jpg", "publishedAt": "2021-11-13T13:21:36Z", "content": "Kuznica, Poland (CNN)Russian President Vladimir Putin insisted Saturday that Russia has \"absolutely nothing to do with\" the ongoing crisis at the Poland-Belarus border, where thousands of people are … [+6556 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Should you go to Thanksgiving dinner with your unvaccinated uncle? Experts help make the decision", "description": "As it is, holiday gatherings with loved ones can be a careful dance of dodging landmines on the way to wonderful memories -- and this year, we are adding potentially explosive conversations around vaccination status.", "url": "https://www.cnn.com/2021/11/13/health/holiday-gatherings-vaccination-boundaries-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191006145252-thanksgiving-dinner-stock-super-tease.jpg", "publishedAt": "2021-11-13T13:18:57Z", "content": "(CNN)As it is, holiday gatherings with loved ones can be a careful dance of dodging landmines on the way to wonderful memories -- and this year, we are adding potentially explosive conversations arou… [+5996 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Smith-Spark, CNN", "title": "UK risks trade war with EU over Brexit deal on Northern Ireland", "description": "Northern Ireland is once again at the center of post-Brexit tensions between the United Kingdom and the European Union, after both sides fired up the rhetoric in recent days before promising to intensify talks.", "url": "https://www.cnn.com/2021/11/13/business/uk-eu-northern-ireland-protocol-article-16-intl-gbr-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110121743-01-boris-johnson-glasgow-1110-super-tease.jpg", "publishedAt": "2021-11-13T13:16:04Z", "content": "London (CNN)Northern Ireland is once again at the center of post-Brexit tensions between the United Kingdom and the European Union, after both sides fired up the rhetoric in recent days before promis… [+10721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Boyette, CNN", "title": "Lawsuit over Andrew Brown Jr's killing now alleges an officer's weapon was altered after shooting and before it was admitted as evidence", "description": "An amended lawsuit filed by the estate of Andrew Brown, Jr. alleges one of the officers who fatally shot him told investigators that he \"altered\" his gun after the incident and before the weapon was seized as evidence.", "url": "https://www.cnn.com/2021/11/13/us/andrew-brown-amended-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113064749-andrew-brown-amended-lawsuit-super-tease.jpg", "publishedAt": "2021-11-13T13:15:49Z", "content": "(CNN)An amended lawsuit filed by the estate of Andrew Brown, Jr. alleges one of the officers who fatally shot him told investigators that he \"altered\" his gun after the incident and before the weapon… [+3964 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sana Noor Haq, CNN", "title": "Isles of Scilly named UK's most scenic destination of outstanding natural beauty", "description": "The Isles of Scilly have been voted the most scenic destination of outstanding natural beauty in the UK, according to a survey by the users of the consumer champion platform Which?.", "url": "https://www.cnn.com/travel/article/isles-of-scilly-uk-top-destination-intl-scli-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113070951-01-uk-most-scenic---isles-of-scilly-super-tease.jpg", "publishedAt": "2021-11-13T13:07:27Z", "content": "(CNN) The Isles of Scilly have been voted the most scenic destination of outstanding natural beauty in the UK, according to a survey by the users of the consumer champion platform Which?.\r\nLocated ab… [+1686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Viral video purporting to show vaccinated woman's plane tantrum is fake", "description": "A video of a maskless woman having a tantrum on an airplane -- threatening to call the police because she is being forced to sit next to a man she presumes is unvaccinated -- has gone extraordinarily viral on social media.", "url": "https://www.cnn.com/2021/11/13/politics/fact-check-vaccinated-plane-tantrum-video-prince-ea/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112141918-daniel-dale-fact-check-fake-covid-airplane-vaccine-video-super-tease.jpg", "publishedAt": "2021-11-13T13:01:54Z", "content": "Washington (CNN)A video of a maskless woman having a tantrum on an airplane -- threatening to call the police because she is being forced to sit next to a man she presumes is unvaccinated -- has gone… [+6945 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "'Happy Days' actor Gavan O'Herlihy dies at age 70", "description": "Actor Gavan O'Herlihy, best known for his brief role as the eldest Cunningham son on the sitcom \"Happy Days,\" has died at the age of 70, his agent said.", "url": "https://www.cnn.com/2021/11/13/entertainment/gavan-oherlihy-happy-days-dies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113063737-02-gavan-oherlihy-happy-days-dies-super-tease.jpg", "publishedAt": "2021-11-13T12:36:24Z", "content": "(CNN)Actor Gavan O'Herlihy, best known for his brief role as the eldest Cunningham son on the sitcom \"Happy Days,\" has died at the age of 70, his agent said.\r\n\"He was a wonderful actor with a long an… [+2056 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Ahmaud Arbery’s old football team turned angst into love — and a perfect season", "description": "Ahmaud Arbery’s killing taught Brunswick High’s football team how to love and trust like family. The winning came naturally.", "url": "https://www.cnn.com/interactive/2021/11/us/ahmaud-arbery-brunswick-high-school-football-cnnphotos/", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112150908-01-cnnphotos-ahmaud-arbery-brunswick-football-super-tease.jpg", "publishedAt": "2021-11-13T12:29:18Z", "content": "Brunswick Highs Chuckobe Hill gets his team ready to take the field prior to their final regular season home game.Brunswick, Georgia Sean Pender knew what his football team had to do. It wasnt going … [+16113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "How the UK became the sick man of European tourism", "description": "Tourists are returning to Europe, but the UK tourism sector has crashed due to a combination of the pandemic and political problems, according to the travel industry", "url": "https://www.cnn.com/travel/article/uk-tourism-decline-restrictions-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113101208-tower-bridge-london-super-tease.jpg", "publishedAt": "2021-11-13T11:44:15Z", "content": "(CNN) It's a country that has just endured national fuel shortages, isolated food shortages, and its government voted this fall to dump untreated sewage onto its famous coastlines. Oh -- and it has t… [+18240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "Pandemic travel news: US borders open as more of Europe is rated 'very high' risk", "description": "After nearly 20 months of closed borders, the US finally opened to vaccinated international visitors on Monday. In Europe, as Covid cases continue to climb, one country is considering a lockdown for its unvaccinated population. Find out more about what happen…", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-us-reopens-europe-high-risk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211108152655-amsterdam-netherlands-singel-canal-super-tease.jpg", "publishedAt": "2021-11-13T10:42:41Z", "content": "(CNN) After nearly 20 months of closed borders, the US finally opened to vaccinated international visitors on Monday, November 8.\r\nBut transatlantic travel remains an ever changing landscape, with th… [+5966 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "Australia's last two flamingos, adopted as emblem by LGBTQ+ festival, get new lease of life", "description": "When Australia's last two flamingos Greater and Chile died in 2014 and 2018 respectively, it was believed that would be the last time the country would see the majestic birds. Now they have been preserved and put on display.", "url": "https://www.cnn.com/2021/11/13/australia/australia-flamingos-taxidermy-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnn/.e/img/4.0/logos/cnn_logo_social.jpg", "publishedAt": "2021-11-13T10:38:35Z", "content": "(CNN)When Australia's last two flamingos Greater and Chile died in 2014 and 2018 respectively, it was believed that would be the last time the country would see the majestic birds. \r\nNow, they've bee… [+1592 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Barcelona legend Dani Alves set to be reunited with new manager Xavi after 'agreement in principle' to return", "description": "Barcelona legend Dani Alves is set to be reunited with his former teammate and now manager of the Spanish giants, Xavi, after the club \"reached an agreement in principle\" for him to return.", "url": "https://www.cnn.com/2021/11/13/football/dani-alves-barcelona-return-xavi-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211113101958-dani-alves-celebrate-wide-super-tease.jpg", "publishedAt": "2021-11-13T10:32:24Z", "content": "(CNN)Barcelona legend Dani Alves is set to be reunited with his former teammate and now manager of the Spanish giants, Xavi, after the club \"reached an agreement in principle\" for him to return.\r\nIn … [+2246 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Funeral services underway for Astroworld Festival victims as dozens of lawsuits are filed over the tragedy", "description": "The funeral for one of the youngest victims of the Astroworld Festival is being held Saturday in Houston, as families and friends remember loved ones who died a week ago at the high-energy music event that turned into a nightmare.", "url": "https://www.cnn.com/2021/11/13/us/travis-scott-concert-houston-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112232518-brianna-rodriguez-vigil-super-tease.jpg", "publishedAt": "2021-11-13T09:31:34Z", "content": "(CNN)The funeral for one of the youngest victims of the Astroworld Festival is being held Saturday in Houston, as families and friends remember loved ones who died a week ago at the high-energy music… [+4997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sahar Akbarzai, CNN", "title": "Massachusetts high school students hold walkout to protest racist video by a White classmate", "description": "Students at a Massachusetts high school held a walkout on Friday morning to protest a racist video made by a White student and to demand a change to the \"culture of racism\" in the school district, a top school official said.", "url": "https://www.cnn.com/2021/11/13/us/massachusetts-quincy-high-school-protest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112230350-quincey-high-school-walk-out-1112-super-tease.jpg", "publishedAt": "2021-11-13T09:26:20Z", "content": "(CNN)Students at a Massachusetts high school held a walkout on Friday morning to protest a racist video made by a White student and to demand a change to the \"culture of racism\" in the school distric… [+3439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter, CNN", "title": "World Kindness Day 2021: 25 ways to be kind today", "description": "It's time to be kind. World Kindness Day is this Saturday, November 13. Here are 25 ways to be kind and make a difference.", "url": "https://www.cnn.com/2021/11/13/health/world-kindness-day-2021-acts-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201112155701-01-world-kindness-day-2020-card-image-super-tease.jpg", "publishedAt": "2021-11-13T08:00:20Z", "content": "(CNN)It's time to be kind.\r\nIt's World Kindness Day today, Saturday, November 13. \r\nAfter more than a year of pandemic living, maybe it seems like there is no time to be kind. The world, however, nee… [+6684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandler Thornton and Jinky Jorgio, CNN", "title": "Daughter of Philippine President Duterte to run for vice president", "description": "Sara Duterte Carpio, the eldest daughter of Philippine President Rodrigo Duterte, filed her candidacy for vice president on Saturday, according to CNN affiliate CNN Philippines.", "url": "https://www.cnn.com/2021/11/13/asia/philippines-sarah-duterte-vice-presidency-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115030045-rodrigo-duterte-sara-duterte-file-super-tease.jpg", "publishedAt": "2021-11-13T06:06:30Z", "content": "Manila, Philippines (CNN)Sara Duterte Carpio, the eldest daughter of Philippine President Rodrigo Duterte, filed her candidacy for vice president on Saturday, according to CNN affiliate CNN Philippin… [+518 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Wai Hnin Pwint Thon", "title": "I met my dad for the first time when I was 4, and he was behind bars", "description": "Wai Hnin Pwint Thon writes that her father, a jailed Burmese human rights activist, has taught her that an equal and just political system is not a guarantee. It requires hard work, and it could come with serious consequences -- not just for her family or cou…", "url": "https://www.cnn.com/2021/11/13/opinions/burmese-democracy-human-rights-wai-hnin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020155221-20211020-voices-of-freedom-wai-hnin-super-tease.jpg", "publishedAt": "2021-11-13T05:00:44Z", "content": "Wai Hnin Pwint Thon is a Burmese human rights activist working for the nongovernmental organization Burma Campaign UK. She has been advocating for human rights and federal democracy in Burma, now wid… [+8108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Joseph, CNN", "title": "10-year-old Utah Black and autistic student dies by suicide weeks after scathing DOJ report on school district", "description": "Isabella \"Izzy\" Tichenor, a 10-year-old Black and autistic student in Utah, died by suicide last Saturday after allegedly being bullied by classmates and her family's complaints were ignored, the family's lawyer tells CNN.", "url": "https://www.cnn.com/2021/11/12/us/isabella-izzy-tichenor-utah-bullying-claims-suicide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112154758-02-isabella-izzy-tichenor-super-tease.jpg", "publishedAt": "2021-11-13T03:01:02Z", "content": "(CNN)Isabella \"Izzy\" Tichenor, a 10-year-old Black and autistic student in Utah, died by suicide last Saturday after allegedly being bullied by classmates and her family's complaints were ignored, th… [+4188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "US announces big hike in Medicare premiums", "description": "The federal government announced a large hike in Medicare premiums Friday night, blaming the pandemic but also what it called uncertainty over how much it may have to be forced to pay for a pricey and controversial new Alzheimer's drug.", "url": "https://www.cnn.com/2021/11/12/health/medicare-premium-hike/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112214022-senior-with-doctor-stock-super-tease.jpeg", "publishedAt": "2021-11-13T02:44:41Z", "content": "(CNN)The federal government announced a large hike in Medicare premiums Friday night, blaming the pandemic but also what it called uncertainty over how much it may have to be forced to pay for a pric… [+2338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "Businesswoman Sheila Cherfilus-McCormick is apparent winner of Florida primary for late Alcee Hastings' seat", "description": "By the narrowest of margins -- just five votes -- businesswoman Sheila Cherfilus-McCormick appears to have won a South Florida Democratic primary to replace the late US Rep. Alcee Hastings in Washington, according to official results reported by the counties.", "url": "https://www.cnn.com/2021/11/12/politics/sheila-cherfilus-mccormick-florida-congressional-primary-alcee-hastings-seat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112210409-sheila-cherfilus-mccormick-super-tease.jpg", "publishedAt": "2021-11-13T02:18:52Z", "content": "(CNN)By the narrowest of margins -- just five votes -- businesswoman Sheila Cherfilus-McCormick appears to have won a South Florida Democratic primary to replace the late US Rep. Alcee Hastings in Wa… [+2929 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Boyette and Claudia Dominguez, CNN", "title": "Pardon for Homer Plessy, of Plessy v. Ferguson's 'separate but equal' ruling, heads to Louisiana governor's desk", "description": "Homer Plessy, whose 19th century case Plessy v. Ferguson became a landmark civil rights Supreme Court ruling, is only a step away from a posthumous full pardon from the state of Louisiana.", "url": "https://www.cnn.com/2021/11/12/us/homer-plessy-pardon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112204247-plessy-arrest-marker-super-tease.jpg", "publishedAt": "2021-11-13T01:58:33Z", "content": "(CNN)Homer Plessy, whose 19th century case Plessy v. Ferguson became a landmark civil rights Supreme Court ruling, is only a step away from a posthumous full pardon from the state of Louisiana.\r\nPles… [+2386 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Kinzinger says he hopes Bannon indictment for contempt of Congress 'sends a chilling message'", "description": "Rep. Adam Kinzinger, one of two Republicans on the House select committee investigating January 6, said Friday that he hopes a federal grand jury's indictment of Steve Bannon for contempt of Congress \"sends a chilling message\" to anyone considering not cooper…", "url": "https://www.cnn.com/2021/11/12/politics/adam-kinzinger-bannon-indictment-contempt-of-congress-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112180714-rep-adam-kinzinger-file-super-tease.jpg", "publishedAt": "2021-11-13T00:54:34Z", "content": "(CNN)Rep. Adam Kinzinger, one of two Republicans on the House select committee investigating January 6, said Friday that he hopes a federal grand jury's indictment of Steve Bannon for contempt of Con… [+2495 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "US seeks extradition of alleged ransomware money launderer", "description": "A Russian man accused of laundering money in connection with ransomware that hackers have used to disrupt multiple US hospitals has been detained in the Netherlands at the request of the FBI, according to his lawyer.", "url": "https://www.cnn.com/2021/11/12/politics/us-ransomware-extradition/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210712160202-ransomware-cyberattack---stock-super-tease.jpg", "publishedAt": "2021-11-12T23:42:50Z", "content": "(CNN)A Russian man accused of laundering money in connection with ransomware that hackers have used to disrupt multiple US hospitals has been detained in the Netherlands at the request of the FBI, ac… [+2113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Dezenski, CNN", "title": "The week in 14 headlines", "description": "This week, concerns over inflation and unreliable supply chains forced the Biden administration to step up its efforts on two fronts particularly important to Americans, according to a new CNN Poll. Meanwhile, former President Donald Trump and his allies cont…", "url": "https://www.cnn.com/2021/11/12/politics/week-in-review-biden-inflation-supply-chain/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111190024-18-week-in-photos-1112-super-tease.jpg", "publishedAt": "2021-11-12T23:32:01Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Is 'Free Joe Biden' the answer to Democrats' problems?", "description": "In the wake of a disastrous 2021 election for Democrats, the man charged with keeping his party in the House majority had a very interesting prescription for how make that a reality.", "url": "https://www.cnn.com/2021/11/12/politics/free-joe-biden-2022-infrastructure-dccc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211106102735-05-biden-infrastructure-bill-1106-super-tease.jpg", "publishedAt": "2021-11-12T23:30:15Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elissa Strauss, CNN", "title": "Meet the teens making the digital world a kinder and gentler place", "description": "Deny kids access to digital life, and you hamstring their social life. You also limit their ability to develop online skills. A new project called HX brings together top thinkers and researchers in ethical technology to generate new language, ideas and models…", "url": "https://www.cnn.com/2021/11/12/health/kids-online-digital-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111165842-tween-smartphone-stock-super-tease.jpg", "publishedAt": "2021-11-12T23:16:06Z", "content": "(CNN)Deny your kids access to digital life, and you hamstring their social life especially in a pandemic. You also limit their ability to develop online skills that will help them succeed. \r\nGrant yo… [+9080 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Opinion: Kamala Harris' Paris trip puts a band-aid on deteriorating US-France relations", "description": "Whether all this bonhomie will be enough to patch over deeply frayed relations between the US and France remains to be seen. What is apparent, however, is that the two leaders are touting their partnership -- with the goal of making a mark at home as Macron f…", "url": "https://www.cnn.com/2021/11/12/opinions/kamala-harris-paris-trip-macron-us-france-relations-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110133831-kamala-harris-emmanuel-macron-paris-1110-super-tease.jpg", "publishedAt": "2021-11-12T22:55:00Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, and executive director of The Red Lines Project, is the author of \"A Red Line in the Sand: Diplomacy, Strategy, and t… [+5684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "Source: FDA will likely make booster decision without outside advisory committee weighing in", "description": "The US Food and Drug Administration is unlikely to ask its outside vaccine advisers to weigh in on whether the agency should authorize Pfizer Covid-19 boosters for all adults, a source familiar with the situation told CNN.", "url": "https://www.cnn.com/2021/11/12/health/fda-vaccine-advisers-pfizer-booster-request/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211008135959-pfizer-booster-vaccine-california-1001-super-tease.jpg", "publishedAt": "2021-11-12T22:34:47Z", "content": "(CNN)The US Food and Drug Administration is unlikely to ask its outside vaccine advisers to weigh in on whether the agency should authorize Pfizer Covid-19 boosters for all adults, a source familiar … [+5134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: The January 6 committee just got a lot more powerful", "description": "The news late Friday that on-again, off-again Trump political svengali Steve Bannon had been indicted on two counts of contempt for his refusal to testify before the House January 6 select committee is a game-changer in terms of the committee's power to compe…", "url": "https://www.cnn.com/2021/11/12/politics/january-6-committee-bannon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211109213022-bennie-thompson-11-09-2021-super-tease.jpg", "publishedAt": "2021-11-12T22:08:29Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Trump scores two legal wins after Summer Zervos drops lawsuit and Michael Cohen's suit against Trump Org. dismissed - CNN", "description": "Former President Donald Trump scored two big legal victories Friday and avoided having to sit for a deposition in a defamation lawsuit after former \"Apprentice\" contestant Summer Zervos agreed to drop her claims, according to a court filing, and a New York ju…", "url": "https://www.cnn.com/2021/11/12/politics/trump-lawsuits-michael-cohen-summer-zervos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112162936-zervos-trump-cohen-split-super-tease.jpg", "publishedAt": "2021-11-12T22:00:00Z", "content": "(CNN)Former President Donald Trump scored two big legal victories Friday and avoided having to sit for a deposition in a defamation lawsuit after former \"Apprentice\" contestant Summer Zervos agreed t… [+2669 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Andy Rose and Jennifer Henderson, CNN", "title": "Woman sentenced to jail for walking on thermal features at Yellowstone has sentence vacated", "description": "Madeline Casey, the woman sentenced to seven days in jail for walking directly on thermal features at Yellowstone National Park in July, had her jail sentence vacated, according to a judge's order.", "url": "https://www.cnn.com/travel/article/yellowstone-visitor-jail-sentence-vacated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112150719-yellowstone-hot-spring-norris-geyser-basin-super-tease.jpg", "publishedAt": "2021-11-12T21:55:13Z", "content": "(CNN) Madeline Casey, the woman sentenced to seven days in jail for walking directly on thermal features at Yellowstone National Park in July, had her jail sentence vacated, according to a judge's or… [+1279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox and Deidre McPhillips, CNN", "title": "The Covid-19 numbers seem stuck. That doesn't bode well for winter, experts say", "description": "Covid cases are down in the South, headed up in other places. It's confusing everywhere. But epidemiologists say the overall trend is not looking good.", "url": "https://www.cnn.com/2021/11/12/health/covid-cases-winter-surge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112134056-01-covid-test-nebraska-1110-super-tease.jpg", "publishedAt": "2021-11-12T21:48:42Z", "content": "(CNN)The coronavirus numbers don't look so good this week. New Covid-19 diagnoses are up in about half of US states over the past week. Hospitalizations are up in 11 states, and deaths have risen in … [+7688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Syra Madad", "title": "How my kids feel about getting the Covid-19 vaccine", "description": "So much has been and will be said about vaccinating kids against Covid-19. Talking to my kids about getting vaccinated and allowing them to share their thoughts is also an important part of the process, writes Syra Madad.", "url": "https://www.cnn.com/2021/11/12/opinions/kids-covid-vaccine-madad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112085954-syra-madad-kids-covid-vaccine-opinion-super-tease.jpg", "publishedAt": "2021-11-12T21:17:16Z", "content": "Syra Madad, DHSc, MSc, MCP is an infectious disease epidemiologist, senior director of the system-wide special pathogens program at NYC Health + Hospitals, health and safety lead at the Enhanced Inve… [+8569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "Steve Bannon indicted by federal grand jury", "description": "A federal grand jury has returned an indictment against former Trump adviser Steve Bannon, CNN has learned. Follow here for the latest news.", "url": "https://www.cnn.com/politics/live-news/doj-steve-bannon-contempt-11-12-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015130343-03-steve-bannon-file-2020-super-tease.jpg", "publishedAt": "2021-11-12T21:00:10Z", "content": "A federal grand jury has returned an indictment against former Trump adviser Steve Bannon for contempt of Congress.\r\nIn a release, the Department of Justice said one of the charges stems from \"his re… [+2921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "It's not just Elon Musk: Here's who else at Tesla has been selling the stock", "description": "Just days before his brother started selling billions of dollars worth of Tesla shares, Kimbal Musk, a Tesla board member, sold $108 million worth of his own stock in the company.", "url": "https://www.cnn.com/2021/11/12/investing/elon-musk-tesla-insider-stock-sales/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112125318-01-elon-musk-delaware-0713-super-tease.jpg", "publishedAt": "2021-11-12T20:46:24Z", "content": "New York (CNN Business)Just days before his brother started selling billions of dollars worth of Tesla shares, Kimbal Musk, a Tesla board member, sold $108 million worth of his own stock in the compa… [+4410 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "What are your family recipes that you cherish? Share your stories", "description": "With Thanksgiving approaching, you are likely setting up your menus and talking about family traditions. What are your family recipes that you hold dear?", "url": "https://www.cnn.com/2021/11/12/us/thanksgiving-family-recipes-callout/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111160317-bpt101-thanksgiving-food-recipes-111121-super-tease.jpg", "publishedAt": "2021-11-12T20:43:29Z", "content": "(CNN)As Thanksgiving approaches, many of us are already preparing our menus for the holiday. Some of you may be pulling grandma's braciole recipe steeped in tomato sauce or that creamy garlic mash th… [+458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Fisher and Pete Muntean, CNN Business", "title": "Blue Origin astronaut Glen de Vries dies in plane crash", "description": "One of Blue Origin's newest astronauts, 49-year-old Glen de Vries, survived a ride to space in October alongside actor William Shatner. But less than a month later, he was killed in a small plane crash on Thursday in New Jersey.", "url": "https://www.cnn.com/2021/11/12/business/glen-de-vries-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112150946-01-glen-de-vries-1013-super-tease.jpg", "publishedAt": "2021-11-12T20:29:43Z", "content": "(CNN Business)One of Blue Origin's newest astronauts, 49-year-old Glen de Vries, survived a ride to space in October alongside actor William Shatner. But less than a month later, he was killed in a s… [+1725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/chloe-melas\">Chloe Melas</a>, <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Melissa Macaya, CNN", "title": "Britney Spears' conservatorship hearing", "description": "A judge is expected to answer Britney Spears' request to terminate her conservatorship at an afternoon court hearing. Follow here for live updates.", "url": "https://www.cnn.com/entertainment/live-news/britney-spears-conservatorship-hearing-11-12-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426165640-britney-spears-july-22-super-tease.jpg", "publishedAt": "2021-11-12T20:14:24Z", "content": "Britney Spears' conservatorship case is back in court today, and a judge is expected to consider terminating the arrangement altogether.\r\nIn September, Judge Brenda Penny suspended Jamie Spears as co… [+891 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy and Kate Sullivan, CNN", "title": "Jen Psaki returns to White House briefing room after testing positive for Covid-19", "description": "White House press secretary Jen Psaki returned to the White House briefing room Friday for the first time since testing positive for Covid-19, telling reporters she completed a 10-day quarantine and received a negative Covid-19 test on Thursday.", "url": "https://www.cnn.com/2021/11/12/politics/psaki-returns-white-house-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211031174109-psaki-101821-super-tease.jpg", "publishedAt": "2021-11-12T19:40:13Z", "content": "(CNN)White House press secretary Jen Psaki returned to the White House briefing room Friday for the first time since testing positive for Covid-19, telling reporters she completed a 10-day quarantine… [+1755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "The climate crisis is messing with birds' body shapes", "description": "Researchers studying 15,000 birds in the Amazon rainforest found that nearly all of the birds' bodies have become lighter since the 1980s, losing on average about 2% of their body weight every decade.", "url": "https://www.cnn.com/2021/11/12/americas/birds-bodies-amazon-rainforest-climate-change-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111171810-03b-birds-bodies-amazon-rainforest-climate-change-scn-super-tease.jpg", "publishedAt": "2021-11-12T19:26:53Z", "content": "(CNN)Birds' bodies are shrinking in response to climate change, even in places like the Amazon rainforest that are relatively untouched by human hands. \r\nResearchers have studied information on more … [+3077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ramishah Maruf, CNN Business", "title": "California gas prices surge to $4.66 — about a penny away from an all-time record", "description": "California gas prices hit an average price of $4.658 a gallon Friday, about a penny short of the highest recorded average price of $4.671 for regular gasoline set in October 2012, according to AAA.", "url": "https://www.cnn.com/2021/11/12/energy/california-gas-prices-record-high/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112125846-01-gas-prices-california-102121-file-restricted-super-tease.jpg", "publishedAt": "2021-11-12T18:50:00Z", "content": "New York (CNN Business)California gas prices hit an average price of $4.658 a gallon Friday, about a penny short of the highest recorded average price of $4.671 for regular gasoline set in October 20… [+1697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianna Cerini, CNN", "title": "New documentary explores a tiny '60s icon that shaped a new era in fashion", "description": "Sadie Frost's \"Quant\" makes it easy to see how the designer -- who is credited with turning the miniskirt into a worldwide phenomenon and launching one of the first global super brands -- didn't just shape a new era in fashion, but also served as a voice for …", "url": "https://www.cnn.com/style/article/mary-quant-sadie-frost-culture-queue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111160417-05-mary-quant-super-tease.jpg", "publishedAt": "2021-11-12T17:46:02Z", "content": "artsPublished 12th November 2021\r\nKeeping you in the know, Culture Queue is an ongoing series of recommendations for timely books to read, films to watch and podcasts and music to listen to.\r\nThere's… [+8257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Judy Gold", "title": "I still can't stop watching Cecily Strong's clown sketch", "description": "Cecily Strong as Goober talking about her clown abortion on Saturday Night Live did what great comedians have been doing since the beginning of time, says Judy Gold -- which is why she says she can't stop watching the sketch. As long we live in a country wher…", "url": "https://www.cnn.com/2021/11/12/opinions/cecily-strong-snl-abortion-clown-gold/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211107214107-cecily-strong-snl-110621-super-tease.jpg", "publishedAt": "2021-11-12T17:20:32Z", "content": "Judy Gold is a stand-up comic in New York, actress, writer and winner of two Emmy Awards. She is the host of the podcast \"Kill Me Now,\" available on iTunes or at judygold.com/podcast. She is also the… [+3919 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, Anna Chernova, Katharina Krebs and Matthew Chance, CNN", "title": "Russia and Belarus hold military drills as migrant crisis on EU border grows", "description": "Russia and Belarus flexed their military might for a third time this week near the Poland-Belarus border, where thousands of people are stranded in deplorable conditions, trapped at the center of an intensifying humanitarian and geopolitical crisis.", "url": "https://www.cnn.com/2021/11/12/europe/poland-belarus-russia-ukraine-military-drills-sanctions-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112100818-01-poland-belarus-border-migrants-1112-super-tease.jpg", "publishedAt": "2021-11-12T17:17:31Z", "content": "Bruzgi, Belarus (CNN)Russia and Belarus flexed their military might for a third time this week near the Poland-Belarus border, where thousands of people are stranded in deplorable conditions, trapped… [+6341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Donald Trump isn't sorry about the \"Hang Mike Pence\" chants", "description": "When thinking about Donald Trump, it's always important to remember that a) he cares only about himself and b) he is utterly incapable of remorse.", "url": "https://www.cnn.com/2021/11/12/politics/donald-trump-mike-pence-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210105143554-01-trump-pence-file-super-tease.jpg", "publishedAt": "2021-11-12T17:15:15Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Netflix cut a Latina housekeeper character from the show 'Uncoupled' after it was criticized as offensive", "description": "The upcoming Netflix comedy series \"Uncoupled,\" starring Neil Patrick Harris will no longer feature a Latina housekeeper character after actor Ada Maris criticized the role for being stereotypical and flat.", "url": "https://www.cnn.com/2021/11/12/us/uncoupled-netflix-latina-character-dropped-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112113043-netflix-headquarters-restricted-super-tease.jpg", "publishedAt": "2021-11-12T17:15:06Z", "content": "(CNN)The upcoming Netflix comedy series \"Uncoupled,\" starring Neil Patrick Harris, will no longer feature a Latina housekeeper character after an actor publicly criticized the role for being stereoty… [+2302 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, CNN Chief Congressional Correspondent", "title": "As Biden agenda hinges on Manchin, House progressives look to 'deescalate' tension", "description": "Soon after Missouri Rep. Cori Bush accused Sen. Joe Manchin of espousing an \"anti-Black, anti-child, anti-woman and anti-immigrant\" position, another House progressive was on national TV with a sharply different message.", "url": "https://www.cnn.com/2021/11/12/politics/joe-manchin-relationship-progressives/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211104094047-01-joe-manchin-1103-super-tease.jpg", "publishedAt": "2021-11-12T17:08:12Z", "content": "(CNN)Soon after Missouri Rep. Cori Bush accused Sen. Joe Manchin of espousing an \"anti-Black, anti-child, anti-woman and anti-immigrant\" position, another House progressive was on national TV with a … [+9972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Migrants face lack of food and medical attention", "description": "Thousands of migrants are stranded at the border between Poland and Belarus. The migrants -- most of whom are from the Middle East and Asia -- have been trying to get into Poland from the Belarusian side of the Kuznica border crossing.", "url": "https://www.cnn.com/2021/11/11/europe/gallery/poland-belarus-border-crisis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111155112-01-belarus-poland-borde-super-tease.jpg", "publishedAt": "2021-11-12T16:59:49Z", "content": "Migrants gather to receive humanitarian aid at a camp on the Poland-Belarus border on Friday, November 12. \r\nUpdated 11:59 AM ET, Fri November 12, 2021\r\nMigrants gather to receive humanitarian aid at… [+1125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toyin Owoseje, CNN", "title": "Waylon Smithers finally finds love in 'The Simpsons'", "description": "Waylon Smithers Jr, the loyal assistant to cantankerous billionaire Montgomery Burns, will finally find love in a landmark episode of \"The Simpsons.\"", "url": "https://www.cnn.com/2021/11/12/entertainment/simpsons-waylon-smithers-romance-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112112837-01-simpsons-smithers-love-coming-out-super-tease.jpg", "publishedAt": "2021-11-12T16:55:06Z", "content": "(CNN)Waylon Smithers Jr, the loyal assistant to cantankerous billionaire Montgomery Burns, will finally find love in a landmark episode of \"The Simpsons.\" \r\nThe character, who came out in a 2016 epis… [+1467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Kentucky nurse wins $200k lottery prize after retiring from the Covid front lines", "description": "After 36 years as a nurse, one Kentucky woman had more than earned her retirement -- and now she has plenty of money to retire in style.", "url": "https://www.cnn.com/2021/11/12/us/covid-nurse-lottery-win-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112103034-ky-nurse-lottery-win-super-tease.jpg", "publishedAt": "2021-11-12T16:52:28Z", "content": "(CNN)After 36 years as a nurse, one Kentucky woman had more than earned her retirement -- and now she has plenty of money to retire in style.\r\nThat's because she had no sooner retired than she bought… [+600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Why giant companies are splitting into pieces", "description": "Breaking up is the newest craze for ginormous global companies. Johnson & Johnson, Toshiba and GE announced plans to split into multiple entities this week. The trend may have only just begun.", "url": "https://www.cnn.com/2021/11/12/investing/johnson-johnson-ge-toshiba-splits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112101838-johnson--johnson-building-germany-file-restricted-super-tease.jpg", "publishedAt": "2021-11-12T16:24:22Z", "content": "New York (CNN Business)Breaking up is the newest craze for ginormous global companies. Johnson &amp; Johnson, Toshiba and GE announced plans to split into multiple entities this week. The trend may h… [+3318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Rivian's blockbuster IPO shows how far we've come since Tesla's debut", "description": "Rivian's stock price soared Thursday, a day after its Wall Street debut, valuing the company at more than $100 billion. It also had the biggest American initial public offering since Facebook.", "url": "https://www.cnn.com/2021/11/12/cars/rivian-electric-vehicles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211028161207-rivian-r1t-super-tease.jpeg", "publishedAt": "2021-11-12T15:49:29Z", "content": "Washington, DC (CNN)Rivian's stock price soared Thursday, a day after its Wall Street debut, valuing the company at more than $100 billion. It also had the biggest American initial public offering si… [+3359 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Caraway's clean cookware means your food will be free of toxins — and won't stick to the pan", "description": "Whether it's because of the holidays closing in or just because you like inviting friends and family over for home-cooked meals, you may be one of the many Americans suddenly wondering if it's time to revamp their cookware. But when you look at the chemicals …", "url": "https://www.cnn.com/2021/11/12/cnn-underscored/caraway-cookware-toxin-free/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211112095531-caraway-cookware-toxin-free-3.jpg?q=x_0,y_0,h_901,w_1602,c_fill/w_800", "publishedAt": "2021-11-12T15:22:48Z", "content": "Whether its because of the holidays closing in or just because you like inviting friends and family over for home-cooked meals, you may be one of the many Americans suddenly wondering if its time to … [+2860 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peniel E. Joseph", "title": "What Kyle Rittenhouse's tears reveal about America", "description": "Kyle Rittenhouse's sobs (and people's reactions to them) -- happening as the trial of the men charged with murdering Ahmaud Arbery is unfolding -- show how toxic and widespread sympathy is in the US for White anger, fear and vigilantism, says Peniel E. Joseph.", "url": "https://www.cnn.com/2021/11/12/opinions/kyle-rittenhouse-crying-ahmaud-arbery-killed-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111183150-01-week-in-photos-1112-super-tease.jpg", "publishedAt": "2021-11-12T15:20:06Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+6752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "9 people have died in the wake of the Astroworld tragedy. A week on, questions remain over who should be held accountable", "description": "In the week since a Houston music festival turned deadly, questions have emerged about who should be held accountable for the nine people who died and the hundreds who were injured.", "url": "https://www.cnn.com/2021/11/12/us/astroworld-festival-tragedy-accountability/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112002503-astroworld-memorial-1107-super-tease.jpg", "publishedAt": "2021-11-12T15:18:51Z", "content": "(CNN)In the week since a Houston music festival turned deadly, questions have emerged about who should be held accountable for the nine people who died and the hundreds who were injured.\r\nAudience me… [+6246 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "ISIS destroyed thousands of years of Mosul's history. See how it's being rebuilt", "description": "Mosul, Iraq's second largest city, is rising from the ashes after it was almost completely destroyed by the battle to liberate it from ISIS. During the years ISIS occupied the city, it tried to erase thousands of years of Mosul's rich history, culture and div…", "url": "https://www.cnn.com/videos/style/2021/11/11/iraq-mosul-reconstruction-unesco-isis-karadsheh-pkg-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111134945-screengrab-mosul-reconstruction-karadsheh-pkg-super-tease.jpg", "publishedAt": "2021-11-12T14:59:20Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frank Pallotta, CNN Business", "title": "Why Taylor Swift re-recorded 'Red'", "description": "Taylor Swift fans entered a state of grace on Friday thanks to the artist re-releasing one of her most beloved albums, 2012's \"Red.\"", "url": "https://www.cnn.com/2021/11/12/media/album-re-recordings-taylor-swift/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211031134634-01-taylor-swift-rock--roll-hall-of-fame-super-tease.jpg", "publishedAt": "2021-11-12T14:57:59Z", "content": "It never would have been possible to go back &amp; remake my previous work, uncovering lost art &amp; forgotten gems along the way if you hadn't emboldened me. Red is about to be mine again, but it h… [+163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "100,000 pounds of Trader Joe's chicken patties recalled for possible bone fragments", "description": "Roughly 100,000 pounds of raw ground chicken patty products, mostly sold at Trader Joe's, are being recalled.", "url": "https://www.cnn.com/2021/11/12/business/trader-joes-chicken-patty-recall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112090437-trader-joes-chili-lime-chicken-burgers-file-restricted-super-tease.jpg", "publishedAt": "2021-11-12T14:49:34Z", "content": "New York (CNN Business)Roughly 100,000 pounds of raw ground chicken patty products, mostly sold at Trader Joe's, are being recalled.\r\nThe US Department of Agriculture's Food Safety and Inspection Ser… [+1202 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas, CNN", "title": "Winter the dolphin, who inspired 'Dolphin Tale,' has died", "description": "Winter, an injured dolphin who learned to swim with a prosthetic tale and whose story served as the inspiration for two heartwarming films, died Thursday, according to the Clearwater Marine Aquarium, where she resided.", "url": "https://www.cnn.com/2021/11/12/entertainment/winter-the-dolphin-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112092336-01-winter-the-dolphin-restricted-super-tease.jpg", "publishedAt": "2021-11-12T14:48:02Z", "content": "(CNN)Winter, an injured dolphin who learned to swim with a prosthetic tale and whose story served as the inspiration for two heartwarming films, died Thursday, according to the Clearwater Marine Aqua… [+1387 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Britney Spears' conservatorship may finally come to an end", "description": "Britney Spears' 13-year court-ordered conservatorship may finally end on Friday.", "url": "https://www.cnn.com/2021/11/12/entertainment/what-to-know-britney-spears-court-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806172048-britney-spears-file-ss-super-tease.jpg", "publishedAt": "2021-11-12T14:23:24Z", "content": "#FreeBritney movement ... I have no words ... because of you guys and your constant resilience in freeing me from my conservatorship ... my life is now in that direction !!!!! I cried last night for … [+131 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins and Kate Sullivan, CNN", "title": "Biden to nominate Dr. Rob Califf as FDA commissioner", "description": "President Joe Biden will nominate Dr. Rob Califf, a longtime cardiologist, to be the next commissioner of the Food and Drug Administration, a role Califf previously held during the Obama administration.", "url": "https://www.cnn.com/2021/11/12/politics/rob-califf-fda-commissioner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211014123718-robert-califf-file-super-tease.jpg", "publishedAt": "2021-11-12T13:59:39Z", "content": "(CNN)President Joe Biden will nominate Dr. Rob Califf, a longtime cardiologist, to be the next commissioner of the Food and Drug Administration, a role Califf previously held during the Obama adminis… [+2831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "TV OT: 'The Shrink Next Door' shows how streaming lets funny people get serious", "description": "There's a long history of comedic actors -- cinematic clowns, for lack of a better term -- yearning to get serious. Through the years Bill Murray, Robin Williams and others all took on dramatic movie roles, in sometimes-jarring fashion for their fans.", "url": "https://www.cnn.com/2021/11/12/entertainment/what-to-watch-shrink-next-door/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111172304-01-the-shrink-next-door-apple-tv-super-tease.jpg", "publishedAt": "2021-11-12T13:17:25Z", "content": "(CNN)There's a long history of comedic actors -- cinematic clowns, for lack of a better term -- yearning to get serious. Through the years Bill Murray, Robin Williams and others all took on dramatic … [+8129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Why America's economy may still need trillions of dollars", "description": "News that prices for American consumers are rising at the fastest rate in three decades has spooked investors and economists, piling pressure on President Joe Biden and the Federal Reserve to respond more aggressively.", "url": "https://www.cnn.com/2021/11/12/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112071520-economy-job-fair-new-york-101921-file-super-tease.jpg", "publishedAt": "2021-11-12T13:08:11Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+7130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz, CNN", "title": "After her mom battled Covid-19, this missionary traveled 7,500 miles to Ohio for a vaccine", "description": "A missionary held back tears after she received her Covid vaccine in late October. She had traveled about 7,500 miles to get to this fateful moment.", "url": "https://www.cnn.com/2021/11/12/world/dr-congo-missionary-ohio-covid-vaccine-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111154750-01-lorraine-charinda-congo-missionary-vaccinated-us-super-tease.jpg", "publishedAt": "2021-11-12T12:57:45Z", "content": "(CNN)A missionary held back tears after she received her Covid vaccine in late October. She had traveled about 7,500 miles to get to this fateful moment. \r\nLorraine Charinda got her first shot of the… [+3851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN and Ben Wedeman, CNN", "title": "Provocative art exhibition opens in Italy amid Chinese embassy protests", "description": "A satirical exhibition in Brescia, Italy, has enraged Chinese officials. But for local politicians, museum officials and the dissident artist Badiucao, it's a matter of free speech.", "url": "https://www.cnn.com/style/article/badiucao-italian-exhibition-chinese-embassy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112122255-restricted-badiucao-bear-hunt-super-tease.jpg", "publishedAt": "2021-11-12T12:32:51Z", "content": "artsUpdated 12th November 2021\r\nAt a museum in Brescia, northern Italy, Shanghai-born artist Badiucao is making final adjustments to an exhibition that has enraged Chinese officials.\r\nImages of Presi… [+4467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "From Covid to cancer: BioNTech CEO wants to get company back to its roots", "description": "Dr. Ugur Sahin is trying out the same mRNA technology that underlies the Covid-19 vaccine that BioNTech brought to much of the world -- with its partner Pfizer -- to try to improve the newest and riskiest approach to treating cancer: CAR-T therapy.", "url": "https://www.cnn.com/2021/11/12/health/covid-cancer-biontech-ugur-sahin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111172113-ugur-sahin-1023-super-tease.jpg", "publishedAt": "2021-11-12T12:21:24Z", "content": "(CNN)He has conquered Covid for the time being, and now the CEO of BioNTech says he wants to turn his attention back to his first interest: cancer.\r\nDr. Ugur Sahin is trying out the same mRNA technol… [+4416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, CNN", "title": "GOP Sen. Lisa Murkowski of Alaska announces reelection bid", "description": "GOP Sen. Lisa Murkowski of Alaska announced her bid Friday for reelection in a race that's sure to be tough for the moderate Republican who has been a strong critic of former President Donald Trump.", "url": "https://www.cnn.com/2021/11/12/politics/lisa-murkowski-alaska-reelection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618184744-lisa-murkowski-210615-super-tease.jpg", "publishedAt": "2021-11-12T12:05:53Z", "content": "(CNN)GOP Sen. Lisa Murkowski of Alaska announced her bid Friday for reelection in a race that's sure to be tough for the moderate Republican who has been a strong critic of former President Donald Tr… [+1817 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan, CNN\nPhotographs by Barrett Emke for CNN", "title": "Biden vowed to close federal private prisons, but prison companies are finding loopholes to keep them open", "description": "Leavenworth Detention Center seems like a prime example of why President Joe Biden wants to close private prisons: So far this year, the federally contracted jail has been the site of multiple stabbings and a fatal beating. Former guards say drugs and weapons…", "url": "https://www.cnn.com/2021/11/12/politics/biden-private-prisons-immigration-detention-centers-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111164501-01-private-prisons-invs-super-tease.jpg", "publishedAt": "2021-11-12T12:03:06Z", "content": "(CNN)Leavenworth Detention Center seems like a prime example of why President Joe Biden wants to close private prisons: So far this year, the federally contracted jail has been the site of multiple s… [+22144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "House Democrats to introduce resolution censuring Paul Gosar for video depicting violence against Ocasio-Cortez and Biden", "description": "House Democrats plan to introduce a resolution Friday to censure Arizona Republican Rep. Paul Gosar for posting a photoshopped anime video to his Twitter and Instagram accounts showing him appearing to kill Democratic Rep. Alexandria Ocasio-Cortez and attacki…", "url": "https://www.cnn.com/2021/11/12/politics/paul-gosar-censure-resolution-introduced/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200106224631-paul-gosar-jan-7-2016-super-tease.jpg", "publishedAt": "2021-11-12T12:02:00Z", "content": "(CNN)House Democrats plan to introduce a resolution Friday to censure Arizona Republican Rep. Paul Gosar for posting a photoshopped anime video to his Twitter and Instagram accounts showing him appea… [+2472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "8 signs your snoring may be dangerous (and what to do about it)", "description": "At some point in our lives, we all snore. A cold or allergy can block nasal passages, a few drinks too close to bed will automatically relax tongue, palate and throat muscles -- and before we know it, we're unconsciously forcing air past those soft tissues, c…", "url": "https://www.cnn.com/2021/11/12/health/snoring-danger-sleep-apnea-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111194941-loud-snoring-stock-super-tease.jpg", "publishedAt": "2021-11-12T11:52:39Z", "content": "(CNN)At some point in our lives, we all snore. A cold or allergy can block nasal passages, a few drinks too close to bed will automatically relax tongue, palate and throat muscles -- and before we kn… [+9533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster and Lauren Said-Moorhouse, CNN", "title": "Prince Charles' closest aide resigns over cash-for-honors scandal", "description": "Prince Charles' longest serving and closest aide has stepped down voluntarily as head of The Prince's Foundation amid claims of misconduct first reported by the Sunday Times.", "url": "https://www.cnn.com/2021/11/12/uk/prince-charles-aide-michael-fawcett-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112052705-02-michael-fawcett-restricted-super-tease.jpg", "publishedAt": "2021-11-12T11:45:10Z", "content": "London (CNN)Michael Fawcett, Prince Charles' longest-serving and closest aide, has quit his role as head of The Prince's Foundation amid an alleged cash-for-honors scandal, the charity said Friday.\r\n… [+1224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Testimony has concluded in Kyle Rittenhouse's trial. Here are some key moments", "description": "After more than 30 witnesses testified in the Kyle Rittenhouse homicide trial, the case that has grabbed the nation's attention is moving into its final stages.", "url": "https://www.cnn.com/2021/11/12/us/kyle-rittenhouse-trial-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111153904-03-rittenhouse-trial-1111-super-tease.jpg", "publishedAt": "2021-11-12T11:42:00Z", "content": "(CNN)After more than 30 witnesses testified in the Kyle Rittenhouse homicide trial, the case that has grabbed the nation's attention is moving into its final stages. \r\nTestimony, which spanned more t… [+5858 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for November 12: Climate, Capitol riot, Astroworld, Covid, Myanmar", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/11/12/us/five-things-november-12-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112051607-cop26-youth-climate-activists-111121-file-super-tease.jpg", "publishedAt": "2021-11-12T11:36:08Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/kara-fox\">Kara Fox</a> and Ed Upright, CNN", "title": "Belarus-Poland border crisis traps thousands in \"catastrophic\" conditions", "description": "Thousands of people are stuck in a tense standoff on the Belarus-Poland border, as the humanitarian and geopolitical crisis worsens. Follow here for the latest news updates.", "url": "https://www.cnn.com/europe/live-news/belarus-poland-border-11-12-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111155808-07-belarus-poland-border-super-tease.jpg", "publishedAt": "2021-11-12T10:42:46Z", "content": "Thousands of people are trapped between two borders on Europe's frontier, in conditions deemed \"catastrophic\" by the UNHCR. \r\nThe West has accused authoritarian Belarusian leader Alexander Lukashenko… [+4125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "How feeling 'vulnerable' helped climber Lor Sabourin explore their identity", "description": "The feeling of total vulnerability is something that would prevent most from trying rock climbing, but for Lor Sabourin, it's what they love most about the sport.", "url": "https://www.cnn.com/2021/11/12/sport/lor-sabourin-climbing-identity-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110112447-20211010-climber-lor-sabourin-super-tease.jpg", "publishedAt": "2021-11-12T09:44:08Z", "content": "(CNN)The feeling of total vulnerability is something that would prevent most from trying rock climbing, but for Lor Sabourin, it's what they love most about the sport. \r\nBeing so far out of their com… [+6062 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Grief, lawsuits and questions over accountability: What we know a week after the Astroworld tragedy", "description": "In the week since a Houston music festival turned deadly, questions have emerged about who should be held accountable for the nine people who died and the hundreds who were injured.", "url": "https://www.cnn.com/2021/11/12/us/travis-scott-concert-houston-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112002503-astroworld-memorial-1107-super-tease.jpg", "publishedAt": "2021-11-12T09:14:00Z", "content": "(CNN)In the week since a Houston music festival turned deadly, questions have emerged about who should be held accountable for the nine people who died and the hundreds who were injured.\r\nAudience me… [+6246 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Chinese state newspaper blasts 'worship of turnover' after Alibaba's Singles Day", "description": "The focus of China's Singles' Day shopping festival should shift from a \"traffic and sales war\" to one of science and technology, a state-backed newspaper said on Friday, describing the \"worship of turnover\" as incompatible with China's new development path.", "url": "https://www.cnn.com/2021/11/12/tech/singles-day-china-media/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112035131-02-singles-day-2021-restricted-super-tease.jpg", "publishedAt": "2021-11-12T09:08:27Z", "content": "ShanghaiThe focus of China's Singles' Day shopping festival should shift from a \"traffic and sales war\" to one of science and technology, a state-backed newspaper said on Friday, describing the \"wors… [+1975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tom Page, interviews by Ana de Oliva, CNN", "title": "A tiny robot to plant seeds in the desert and a simple way to keep plastic out of the ocean: Global Grad Show looks to a greener future", "description": "Dubai's annual exhibition of student innovations has one eye on the pandemic and another looking to a greener future beyond.", "url": "https://www.cnn.com/style/article/global-grad-show-2021-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112074036-global-grad-show-aseedbot-story-card-restricted-super-tease.jpg", "publishedAt": "2021-11-12T08:26:44Z", "content": "designPublished 12th November 2021\r\nCNN series often carry sponsorship originating from the countries and regions we profile. However, CNN retains full editorial control over all of its reports. Read… [+3722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephy Chung, CNN", "title": "Hong Kong's extraordinary M+ museum opens amid ongoing censorship fears", "description": "A political cloud hangs over the opening, but excitement around M+ is tangible in the art world and beyond.", "url": "https://www.cnn.com/style/article/m-museum-opening/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112004429-11-m-museum-opening-super-tease.jpg", "publishedAt": "2021-11-12T08:12:37Z", "content": "artsPublished 12th November 2021\r\nA version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how… [+11706 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Ivana Kottasová, CNN", "title": "New draft of COP26 agreement on final day includes unprecedented reference to fossil fuels", "description": "A new version of the COP26 draft agreement was published early on Friday and retains a reference to fossil fuels, despite a fierce campaign from major coal, oil and gas producers to water down the text.", "url": "https://www.cnn.com/2021/11/12/world/cop26-agreement-climate-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111224113-climate-activists-cop26-1111-super-tease.jpg", "publishedAt": "2021-11-12T07:45:58Z", "content": "(CNN)A new version of the COP26 draft agreement was published early on Friday and retains a reference to fossil fuels, despite a fierce campaign from major coal, oil and gas producers to have it remo… [+1904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallika Kallingal and Alex Harring, CNN", "title": "New Jersey teen, who went missing nearly a month ago, has been found in New York", "description": "Jashyah Moore, who went missing from her home in New Jersey nearly a month ago, has been found safe in New York City, officials said Thursday.", "url": "https://www.cnn.com/2021/11/12/us/missing-teen-jashyah-moore-found/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211105141243-jashya-moore-missing-new-jersey-super-tease.jpg", "publishedAt": "2021-11-12T07:12:09Z", "content": "(CNN)Jashyah Moore, who went missing from her home in New Jersey nearly a month ago, has been found safe in New York City, officials said Thursday.\r\n\"Jashyah is currently safe and is being provided a… [+1541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Nectar Gan and Steve George, CNN", "title": "Xi cements his power. Now he's ready to meet Biden virtually", "description": "Chinese leader Xi Jinping has further cemented his power at a key meeting of the Communist Party elite, overseeing the passing of a landmark resolution that paves the way for him to secure a third term in office.", "url": "https://www.cnn.com/2021/11/12/china/xi-jinping-sixth-plenum-biden-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111235325-china-6th-plenum-super-tease.jpg", "publishedAt": "2021-11-12T07:07:43Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+4947 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Fatou Jaw Manneh", "title": "Our deepest fear for America -- and the world", "description": "Fatou Jaw Manneh writes the symbol of American democracy is still the most potent global force for freedom, and without it, the world -- including my home country, Gambia -- faces a dark future.", "url": "https://www.cnn.com/2021/11/12/opinions/united-states-democracy-deepest-fear-manneh/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020111332-20211020-voices-of-freedom-manneh-super-tease.jpg", "publishedAt": "2021-11-12T05:00:15Z", "content": "Fatou Jaw Manneh is a Gambian political commentator, human rights activist and former journalist. She is a fellow of the Renew Democracy Initiative's Frontlines of Freedom project. The views expresse… [+7019 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "From CNN's Sahar Akbarzai and Elizabeth Joseph", "title": "Two Pennsylvania teens charged with the death of an 8-year-old who was killed by police gunfire", "description": "A Pennsylvania teenager was arrested for murder in connection with the August death of 8-year-old Fanta Bility, who was killed by police gunfire, officials said Wednesday.", "url": "https://www.cnn.com/2021/11/11/us/pennsylvania-teens-charged-for-murder-of-fanta-bility/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929151913-fanta-bility-super-tease.jpg", "publishedAt": "2021-11-12T04:58:31Z", "content": "New York (CNN)A Pennsylvania teenager was arrested for murder in connection with the August death of 8-year-old Fanta Bility, who was killed by police gunfire, officials said Wednesday.\r\nAngelo \"AJ\" … [+3169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 35 photos", "description": "A couple of high-profile trials have been taking place in the United States this week.", "url": "https://www.cnn.com/2021/11/11/world/gallery/photos-this-week-november-5-november-11/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111184934-04-week-in-photos-1112-restricted-super-tease.jpg", "publishedAt": "2021-11-12T02:44:26Z", "content": "Kyle Rittenhouse breaks down on the stand as he testifies during his homicide trial in Kenosha, Wisconsin, on Wednesday, November 10. Rittenhouse, 18, said he acted in self-defense when he fatally sh… [+1545 chars]"}]}