{"status": "ok", "totalResults": 123, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kiana Murden", "title": "This is everything you need to transition back into the office", "description": "Returning to the office means you have to reacclimate yourself with what it means to actually work there. From portable coffee mugs to comfortable shoes and desk accessories, we've rounded up what we think are the best back to work office essentials.", "url": "https://www.cnn.com/2021/08/18/cnn-underscored/back-to-work-office-essentials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817133312-back-to-work-office-essentials-lead-super-169.jpg", "publishedAt": "2021-08-18T14:31:48Z", "content": "Your transition back into the office may be imminent if it hasnt already happened for you and your employer. \r\nHowever, at this point, returning to the office may mean you have to reacclimate yoursel… [+9036 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Lauren Fox and Ryan Nobles, CNN", "title": "Democrats ramp up oversight over Biden's Afghan withdrawal", "description": "Congressional Democrats are preparing a series of hearings on the US withdrawal from Afghanistan amid rising anger about the Biden administration's handling of the end of the war, with the Taliban rapidly taking control and the US chaotically scrambling to ev…", "url": "https://www.cnn.com/2021/08/18/politics/democratic-response-afghanistan-withdrawal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311103227-08-blinken-diversity-state-dept-menendez-super-tease.jpg", "publishedAt": "2021-08-18T14:23:09Z", "content": "(CNN)Congressional Democrats are preparing a series of hearings on the US withdrawal from Afghanistan amid rising anger about the Biden administration's handling of the end of the war, with the Talib… [+6136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "The Girl Scouts are bringing us a new cookie that tastes like a brownie", "description": "\"Adventurefuls,\" the latest addition to the Girl Scouts' cookie lineup, are fudgy with salted caramel creme. They'll be available to the masses in 2022.", "url": "https://www.cnn.com/2021/08/18/us/new-girl-scout-cookie-adventureful-brownie-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818093725-girl-scout-adventurefuls-cookies-handout-restricted-super-tease.jpg", "publishedAt": "2021-08-18T14:22:26Z", "content": "(CNN)Despite perfecting the coconut-and-caramel combo of Samoas and the chocolate-covered breath mint that is a Thin Mint, it took decades before the bakers behind Girl Scout Cookies brought us their… [+1539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: The lesson Greg Abbott should learn from having Covid-19 -- but won't", "description": "Texas Gov. Greg Abbott, despite being fully vaccinated, announced on Tuesday that he has Covid-19", "url": "https://www.cnn.com/2021/08/18/politics/greg-abbott-covid-19-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729135223-01-gov-greg-abbott-0608-super-tease.jpg", "publishedAt": "2021-08-18T14:16:03Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "A timeline of the case against R. Kelly", "description": "A federal trial for singer R. Kelly, who has pleaded not guilty to racketeering and sex trafficking charges that could send him to prison for decades, is underway.", "url": "https://www.cnn.com/2021/08/18/entertainment/r-kelly-timeline/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807134235-r-kelly-09-17-2019-super-tease.jpg", "publishedAt": "2021-08-18T14:12:31Z", "content": "A version of this story was originally published in 2019. It has been updated to include more recent events in the case.\r\n (CNN)A federal trial for singer R. Kelly, who has pleaded not guilty to rack… [+13937 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Melissa Macaya and Mike Hayes, CNN", "title": "The latest on the Covid-19 pandemic and vaccine booster shots", "description": "The Biden administration is expected to advise Covid-19 booster shots for most Americans as the Delta variant wreaks havoc through much of the US. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-18-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175742-05-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-08-18T14:11:04Z", "content": "Top health officials in the Biden administration are coalescing around an agreement that most Americans should get Covid booster shots eight months after becoming fully vaccinated, two sources famili… [+2974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'In the Same Breath' digs into the Covid outbreak in China and the US", "description": "Deeply personal, complex and timely, \"In the Same Breath\" charts the initial outbreak of novel coronavirus in Wuhan, while paralleling the Chinese reaction to the outbreak with the US. Chinese-born filmmaker Nanfu Wang has created an unsettling window into th…", "url": "https://www.cnn.com/2021/08/18/entertainment/in-the-same-breath-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817102241-03-in-the-same-breath-hbo-super-tease.jpg", "publishedAt": "2021-08-18T14:04:08Z", "content": "(CNN)Deeply personal, complex and timely, \"In the Same Breath\" charts the initial outbreak of novel coronavirus in Wuhan, while paralleling the Chinese reaction to the outbreak with the US. Chinese-b… [+2687 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Noelle Ike", "title": "39 stylish, office-friendly wardrobe staples perfect for refreshing your work wardrobe", "description": "As we wave goodbye to the WFH-era style that's dominated the past year, we say hello to the return of an office-friendly wardrobe. Keep reading to check out 39 expert-approved work wardrobe essentials for men and women to buy right now.", "url": "https://www.cnn.com/2021/08/18/cnn-underscored/work-wardrobe-essentials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816172345-work-wardrobe-essentials-lead-super-169.jpg", "publishedAt": "2021-08-18T14:03:30Z", "content": "As we wave goodbye to the WFH-era style thats dominated the past year (read: sweats and leggings), we say hello to the return of an office-friendly wardrobe. With many of us heading back to an in-per… [+17413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, CNN", "title": "Oakland A's pitcher Chris Bassitt conscious after line drive hit him in his face, manager says", "description": "A line drive struck Oakland Athletics starting pitcher Chris Bassitt in the face Tuesday in Chicago, dropping him to his knees for several minutes before he was carted off the field on his way to a hospital.", "url": "https://www.cnn.com/2021/08/18/us/chris-bassitt-injury-oakland-a-pitcher/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818071223-chris-bassitt-white-sox-injury-0817-file-super-tease.jpg", "publishedAt": "2021-08-18T14:01:50Z", "content": "(CNN)A line drive struck Oakland Athletics starting pitcher Chris Bassitt in the face Tuesday in Chicago, dropping him to his knees for several minutes before he was carted off the field on his way t… [+1732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Paton Walsh", "title": "For the Afghans who make it through Taliban checkpoints, Kabul airport is a gateway to a new world", "description": "A baby desperately held aloft to guards on top of a besieged gate. Shots fired in the air. A crush of Afghan people below -- screaming in the English that put them in this predicament -- to let them in.", "url": "https://www.cnn.com/2021/08/18/asia/kabul-airport-npw-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818005954-kabul-airport-tarmac-npw-0817-super-169.jpg", "publishedAt": "2021-08-18T13:59:09Z", "content": "Hamid Karzai International Airport, AfghanistanCNN\r\n —  \r\nA baby desperately held aloft to US Marines on top of a besieged gate. Shots fired in the air. A crush of Afghan people below screaming in th… [+2585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Pedram Javaheri", "title": "The summer's coolest air comes at a price for some in the West", "description": "With little over 30 days left in a summer marked by record-setting heatwaves and historic wildfires, a dramatic change is coming for parts of the West on Wednesday and into the weekend.", "url": "https://www.cnn.com/2021/08/18/weather/west-forecast-cold-smoke/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818075808-weather-below-average-forecast-temperature-20210818-super-tease.jpg", "publishedAt": "2021-08-18T13:56:00Z", "content": "(CNN)With little over 30 days left in a summer marked by record-setting heatwaves and historic wildfires, a dramatic change is coming for parts of the West on Wednesday and into the weekend. \r\nA pote… [+3390 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mark Zandi for CNN Business Perspectives", "title": "Here's what the Delta variant means for the economic recovery", "description": "While it seems unlikely that the variant would become so disruptive that it undermines the recovery, there are mounting reasons to be worried that it may become a significant headwind to near-term economic growth.", "url": "https://www.cnn.com/2021/08/18/perspectives/economic-recovery-delta-variant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210728160116-us-second-quarter-gdp-recovery-super-tease.jpg", "publishedAt": "2021-08-18T13:55:19Z", "content": "Mark Zandi is chief economist of Moody's Analytics. The opinions expressed in this commentary are his own. \r\nThe US economy's immediate prospects appear inextricably tied to how the wave of infection… [+4522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta and Jamie Gumbrecht", "title": "White House officials to present data that suggest waning vaccine protection against Covid-19 in the United States", "description": "Officials are expected to present three sets of data at Wednesday's White House Covid-19 briefing that suggest waning vaccine protection against Covid-19 infection in the United States, a senior federal health official tells CNN.", "url": "https://www.cnn.com/2021/08/18/health/white-house-covid-boosters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812003553-covid-vaccine-california-0811-super-169.jpg", "publishedAt": "2021-08-18T13:40:59Z", "content": "Officials are expected to present three sets of data at Wednesdays White House Covid-19 briefing that suggest waning vaccine protection against Covid-19 infection in the United States, a senior feder… [+3236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Explained: The charges against R. Kelly in his federal racketeering trial", "description": "John Gotti. Whitey Bulger. R. Kelly? The disgraced R&B singer's federal trial begins Wednesday in New York as he is accused of sex trafficking and racketeering, a charge most famously applied to mob leaders like Gotti and Bulger.", "url": "https://www.cnn.com/2021/08/18/us/r-kelly-charges-explained/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200827173853-02-r-kelly-file-super-tease.jpg", "publishedAt": "2021-08-18T13:17:50Z", "content": "(CNN)John Gotti. Whitey Bulger. R. Kelly?\r\nThe disgraced R&amp;B singer's federal trial begins Wednesday in New York as he is accused of racketeering, a charge famously applied to mob leaders like Go… [+7831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Gemma Zoë Price, CNN", "title": "What Ibiza is like when the party stops", "description": "In the run up to summer, Ibiza's nightlife empresarios were optimistic that the White Isle could fully reopen safely, but despite their best efforts, its hedonistic day-and-night dance super clubs remain bereft of fluoro-clad ravers.", "url": "https://www.cnn.com/travel/article/ibiza-spain-restaurants-beach-clubs-lodging/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818084625-ibiza-el-silencio-water-super-tease.jpg", "publishedAt": "2021-08-18T13:11:39Z", "content": "Ibiza, Spain (CNN) In the run up to summer, Ibiza's nightlife empresarios were optimistic that the White Isle could fully reopen safely, but despite their best efforts, its hedonistic day-and-night d… [+8419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez", "title": "Biden administration proposes overhaul of asylum system to speed up claim approval", "description": "The Biden administration has proposed a federal regulation that would overhaul the asylum system in an attempt to settle claims at a faster pace and help alleviate the immigration court backlog, the departments of Homeland Security and Justice announced Wedne…", "url": "https://www.cnn.com/2021/08/18/politics/asylum-rules/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201101130019-justice-department-file-super-169.jpg", "publishedAt": "2021-08-18T13:08:10Z", "content": "The Biden administration has proposed a federal regulation that would overhaul the asylum system in an attempt to settle claims at a faster pace and help alleviate the immigration court backlog, the … [+2177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz", "title": "The housing boom could be losing steam", "description": "The economic recovery from the pandemic has produced a red-hot global housing market, sending prices soaring and generating angst for would-be first-time buyers.", "url": "https://www.cnn.com/2021/08/18/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818072405-lumber-home-prices-kentucky-0323-file-restricted-super-169.jpg", "publishedAt": "2021-08-18T12:31:10Z", "content": "A version of this story first appeared in CNN Business Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nThe economic recovery from the pandemic has produced a red-hot global… [+6159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Miquel Ros, CNN", "title": "Travel to the North Pole on board a luxury airship", "description": "Nearly a century after legendary polar explorer Roald Amundsen voyaged to the North Pole by airship, Swedish company OceanSky is planning to open the Arctic up to luxury trips onboard a 16-person airship kitted out in 21st-century style and comfort.", "url": "https://www.cnn.com/travel/article/oceansky-airship-north-pole-expeditions-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818124141-hav-airlander-cabin-super-tease.gif", "publishedAt": "2021-08-18T12:28:50Z", "content": "(CNN) It's May 11, 1926, and a giant airship, the Norge (meaning Norway), has just been unhooked from its mast at one of the world's most remote settlements, Ny-Ålesund, in the Svalbard archipelago.\r… [+7755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, CNN", "title": "Booster shots are coming to the US. But the world's poorest are still waiting for their first", "description": "The US is expected to recommend a third shot to bolster immunity, a move the World Health Organization says will only widen global vaccine inequality.", "url": "https://www.cnn.com/2021/08/18/world/coronavirus-newsletter-intl-18-08-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-08-18T12:19:46Z", "content": "This is the weekly edition of CNN's coronavirus newsletter. Look out for your roundup every Wednesday. If you haven't subscribed yet, sign up here.\r\n (CNN)The White House is expected to advise most A… [+9379 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "T-Mobile says data breach affects more than 40 million people", "description": "Tens of millions of current, former or prospective T-Mobile customers' personal information has been leaked to hackers, the wireless carrier said Tuesday, disclosing further details on a data breach it has been investigating since the weekend.", "url": "https://www.cnn.com/2021/08/18/tech/t-mobile-data-breach/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818080537-01-tmobile-phone-file-restricted-super-tease.jpg", "publishedAt": "2021-08-18T12:07:50Z", "content": "(CNN)Tens of millions of current, former or prospective T-Mobile(TMUS) customers' personal information has been leaked to hackers, the wireless carrier said Tuesday, disclosing further details on a d… [+1420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Natasha Bertrand, Kylie Atwood, Jennifer Hansler and Evan Perez", "title": "Biden administration faces daunting odds of pulling off massive Afghanistan evacuation in 2 weeks", "description": "The Biden administration is still struggling to answer basic questions about whether it can successfully evacuate tens of thousands of Americans and vulnerable Afghans in a race against a ticking clock ahead of the US military's August 31 Afghanistan withdraw…", "url": "https://www.cnn.com/2021/08/18/politics/biden-afghanistan-evacuation-daunting-odds/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817084902-32-taliban-afghanistan-unf-super-169.jpg", "publishedAt": "2021-08-18T11:01:38Z", "content": "The Biden administration is still struggling to answer basic questions about whether it can successfully evacuate tens of thousands of Americans and vulnerable Afghans in a race against a ticking clo… [+10377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz", "title": "The Taliban are sitting on $1 trillion worth of minerals the world desperately needs", "description": "The swift fall of Afghanistan to Taliban fighters two decades after the United States invaded the country has triggered a political and humanitarian crisis. It's also causing security experts to wonder: What's going to happen to the country's vast untapped mi…", "url": "https://www.cnn.com/2021/08/18/business/afghanistan-lithium-rare-earths-mining/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817154400-restricted-02-afghanistan-rare-earth-minerals-file-super-169.jpg", "publishedAt": "2021-08-18T10:39:23Z", "content": "The swift fall of Afghanistan to Taliban fighters two decades after the United States invaded the country has triggered a political and humanitarian crisis. Its also causing security experts to wonde… [+7226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for August 18: Afghanistan, coronavirus, tropical storms, wildfires, China", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/08/18/us/five-things-august-18-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818095720-01-afghanistan-0818-kabul-super-tease.jpg", "publishedAt": "2021-08-18T10:30:24Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tom Bouchier Hayes and Rachel Wood, CNN", "title": "'Misfit' Ghanaian artist Kojo Marfo finds a home among London's elite", "description": "Picasso-inspired Ghanaian artist Kojo Marfo, whose bright and bold abstract work explores social issues, sells out at JD Malat Gallery in London.", "url": "https://www.cnn.com/style/article/ghana-artist-kojo-marfo-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729132903-12-ghana-kojo-marfo-london-exhibition-lotus-restricted-super-tease.jpg", "publishedAt": "2021-08-18T10:28:28Z", "content": "artsPublished 18th August 2021\r\nThe JD Malat Gallery in London's Mayfair is everything you'd expect an exclusive art space to be. The premises are immaculate and highly ordered, the owner and staff e… [+3698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "As Covid-19 cases rise among teens, so do vaccinations, CNN analysis finds", "description": "More adolescents have received Covid-19 vaccinations in the past two weeks -- representing about a fifth of all new vaccinations in the United States, data suggest.", "url": "https://www.cnn.com/2021/08/18/health/covid-19-teens-vaccinations-rise-analysis-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817215808-teen-vaccination-08084-restricted-super-tease.jpg", "publishedAt": "2021-08-18T10:27:38Z", "content": "(CNN)More adolescents have received Covid-19 vaccinations in the past two weeks -- representing about a fifth of all new vaccinations in the United States, data suggest. \r\nPublic health experts call … [+8812 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "Investors anxiously await signals that the Fed will start hitting the brakes", "description": "Here's the latest news on what stocks are doing ahead of key US inflation report.", "url": "https://www.cnn.com/business/live-news/stock-market-news-081821/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811131022-nyse-0616-file-super-tease.jpg", "publishedAt": "2021-08-18T10:20:20Z", "content": "Apple, Google and other big companies around the world are continuing to add to their massive piles of cash, a sign that corporations are increasingly nervous about how the highly contagious Delta va… [+642 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Villano", "title": "How to harness positivity to rise above collective trauma and fear", "description": "Even in a pandemic, positive psychiatrist Dr. Samantha Boardman suggests the best approach might be to build strength and positivity from within. In \"Everyday Vitality: Turning Stress into Strength,\" Boardman offers instructions for getting the most out of ea…", "url": "https://www.cnn.com/2021/08/18/health/samantha-boardman-trauma-mindfulness-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816035625-01-samantha-boardman-trauma-mindfulness-wellness-super-169.jpg", "publishedAt": "2021-08-18T10:12:16Z", "content": "As we struggle through month after month of the pandemic, it can be difficult to keep a positive attitude about the present and the future.\r\nEven in a pandemic, positive psychiatrist Dr. Samantha Boa… [+6744 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "China's Delta outbreak shows signs of slowing, as variant rages across the world", "description": "On July 20, Chinese authorities detected a cluster of Covid-19 cases in the eastern city of Nanjing. The virus soon spread across the country, with dozens of cities reporting infections fueled by the highly infectious Delta variant.", "url": "https://www.cnn.com/2021/08/18/china/china-covid-delta-outbreak-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818002805-coronavirus-testing-china-0817-super-tease.jpg", "publishedAt": "2021-08-18T09:26:20Z", "content": "Hong Kong (CNN)On July 20, Chinese authorities detected a cluster of Covid-19 cases in the eastern city of Nanjing. The virus soon spread across the country, with dozens of cities reporting infection… [+3118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill, CNN", "title": "She flew to Tonga for a weekend, 18 months later she's still stuck there", "description": "Nearly 18 months after she flew in for the weekend, Zoe Stephens is still stuck on the tiny archipelago, which happens to be one of the few places in the world that has remained entirely Covid-free.", "url": "https://www.cnn.com/travel/article/british-woman-who-spent-pandemic-in-tonga/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816105530-01-zoe-stephens-tonga-pandemic-super-tease.jpg", "publishedAt": "2021-08-18T09:07:21Z", "content": "(CNN) When British traveler Zoe Stephens flew into the South Pacific island nation of Tonga last March, she was only planning to stay for the weekend.\r\nOriginally from Crosby, Merseyside in the UK, t… [+11594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He", "title": "President Xi Jinping turns his fire on China's rich in push to redistribute wealth", "description": "Chinese President Xi Jinping this week issued a bold new pledge to redistribute wealth in the country, piling more pressure on the country's richest citizens and businesses.", "url": "https://www.cnn.com/2021/08/18/economy/xi-jinping-china-wealth-redistribution-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818033632-xi-jinping-file-071621-super-169.jpg", "publishedAt": "2021-08-18T09:01:10Z", "content": "Chinese President Xi Jinping this week issued a bold new pledge to redistribute wealth in the country, piling more pressure on the countrys richest citizens and businesses.\r\nXi told top leaders from … [+4136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Northern California wildfire triples in size, forcing thousands to evacuate", "description": "Thousands of people have been evacuated as a wildfire ignited over the weekend in Northern California tripled in size within a day and almost leveled a small town, officials said.", "url": "https://www.cnn.com/2021/08/18/weather/us-western-wildfires-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818012327-03-western-wildfires-0817-caldor-fire-super-tease.jpg", "publishedAt": "2021-08-18T07:37:39Z", "content": "(CNN)Thousands of people have been evacuated as a wildfire ignited over the weekend in Northern California tripled in size within a day and almost leveled a small town, officials said.\r\nThe Caldor fi… [+4200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Tropical Depression Fred prompts flash flood warnings across the Appalachians of North Carolina", "description": "Flash flood warnings have been issued across the Appalachians of North Carolina due to the heavy rainfall from Tropical Depression Fred.", "url": "https://www.cnn.com/2021/08/18/weather/tropical-depression-fred-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818025441-01-north-carolina-flooding-0817-super-tease.jpg", "publishedAt": "2021-08-18T07:24:37Z", "content": "(CNN)Flash flood warnings have been issued across the Appalachians of North Carolina due to the heavy rainfall from Tropical Depression Fred. \r\nWithin the past 24 hours, 3 to 6 inches of rain has fal… [+1180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Hurricane conditions and life-threatening riptides could be in store as Tropical Storm Grace heads toward Mexico", "description": "Tropical Storm Grace is barreling toward Mexico Wednesday, threatening to bring with it hurricane-force winds, life-threatening rip tides and up to half a foot of rain.", "url": "https://www.cnn.com/2021/08/18/weather/tropical-storm-grace-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818022826-tropical-storm-grace-satellite-super-tease.jpg", "publishedAt": "2021-08-18T07:10:01Z", "content": "(CNN)Tropical Storm Grace is barreling toward Mexico Wednesday, threatening to bring with it hurricane-force winds, life-threatening rip tides and up to half a foot of rain.\r\nAfter moving away from J… [+2020 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and Steve George", "title": "Beijing sets sights on Taiwan as US' Afghan retreat stokes Chinese nationalism", "description": "The chaotic US withdrawal from Afghanistan has presented Beijing with a propaganda boost, with Chinese state media capitalizing on the crisis to trumpet the supposed decline of America and taunt Taiwan with threats of invasion.", "url": "https://www.cnn.com/2021/08/18/china/china-afghanistan-taiwan-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818010310-10-afghanistan-0816-kabul-super-169.jpg", "publishedAt": "2021-08-18T06:47:06Z", "content": "Editors Note: A version of this story appeared in CNNs Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the countrys rise and how it impacts the world.… [+4543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "Thieves attempt to steal $1.4M Monet painting in botched museum raid", "description": "Two men attempted to steal a prized Claude Monet painting from a museum in the Netherlands, though the robbery was foiled and the suspects fled empty-handed, according to Dutch police.", "url": "https://www.cnn.com/style/article/monet-robbery-zaans-museum/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817235905-02-monet-robbery-zaans-museum-super-tease.jpg", "publishedAt": "2021-08-18T06:10:46Z", "content": "artsPublished 18th August 2021\r\nTwo men attempted to steal a prized Claude Monet painting from a museum in the Netherlands, though the robbery was foiled and the suspects fled empty-handed, according… [+2130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Child Covid-19 cases are steadily increasing. But with schools opening, expert warns this is just the beginning", "description": "Cases of Covid-19 among children have steadily increased since the beginning of July, according to a report from the American Academy of Pediatrics.  And an expert says this rise is just the warmup act.", "url": "https://www.cnn.com/2021/08/18/health/us-coronavirus-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818012218-02-school-covid-test-ky-0817-super-tease.jpg", "publishedAt": "2021-08-18T05:45:51Z", "content": "(CNN)Cases of Covid-19 among children have steadily increased since the beginning of July, according to a report from the American Academy of Pediatrics. And an expert says this rise is just the warm… [+6657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "R. Kelly faces racketeering and sex crime charges at federal trial", "description": "For some of R. Kelly's accusers, the start of his federal trial in New York is a long-awaited second chance at justice.", "url": "https://www.cnn.com/2021/08/18/us/r-kelly-trial-walkup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807134235-r-kelly-09-17-2019-super-tease.jpg", "publishedAt": "2021-08-18T04:12:58Z", "content": "Brooklyn, NY (CNN)For some of R. Kelly's accusers, the start of his federal trial in New York is a long-awaited second chance at justice. \r\nKelly, a singer whose real name is Robert Sylvester Kelly, … [+8798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "US left to depend on the Taliban for a safe exit from Afghanistan defeat", "description": "The depth of the mess the United States finds itself in Afghanistan is encapsulated by the fact that it must now effectively rely on its enemy, the Taliban, as it extricates itself from the humiliating endgame of its longest war.", "url": "https://www.cnn.com/2021/08/18/politics/us-must-rely-on-taliban-for-evacuation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817085117-01-afghanistan-kabul-0817-super-tease.jpg", "publishedAt": "2021-08-18T04:01:02Z", "content": "(CNN)The depth of the mess the United States finds itself in Afghanistan is encapsulated by the fact that it must now effectively rely on its enemy, the Taliban, as it extricates itself from the humi… [+9599 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and <a href=\"/profiles/brad-lendon\">Brad Lendon</a>, CNN", "title": "The latest on Afghanistan as Taliban take charge", "description": "With the Taliban in control of Afghanistan, most countries are evacuating their citizens and shutting their embassies temporarily. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/afghanistan-taliban-us-news-08-18-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815041735-02-kabul-afghanistan-0815-super-tease.jpg", "publishedAt": "2021-08-18T04:00:37Z", "content": "American personnel destroyed the passports of some Afghans when they were getting rid of all sensitive materials at the US Embassy in Kabul in preparation for a full evacuation, according an update t… [+1724 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, CNN", "title": "New Zealand becomes latest country to confirm Delta outbreak", "description": "New Zealand's first community Covid-19 case in six months is the Delta variant -- and genome sequencing shows that it's linked to the growing outbreak in neighboring Australia, Prime Minister Jacinda Ardern said.", "url": "https://www.cnn.com/2021/08/17/asia/new-zealand-delta-outbreak-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817223314-coronavirus-testing-new-zealand-0818-super-tease.jpg", "publishedAt": "2021-08-18T03:18:45Z", "content": "(CNN)New Zealand's first community Covid-19 case in six months is the Delta variant -- and genome sequencing shows that it's linked to the growing outbreak in neighboring Australia, Prime Minister Ja… [+2538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher, CNN", "title": "Texas Supreme Court rules state House Democrats can be arrested to force attendance at Capitol", "description": "The Texas Supreme Court has ruled that the state House may compel the attendance of its members by civil arrest, overturning a lower court order from earlier this month.", "url": "https://www.cnn.com/2021/08/17/politics/texas-supreme-court-house-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810130403-texas-dems-dc-0720-super-tease.jpg", "publishedAt": "2021-08-18T01:39:31Z", "content": "(CNN)The Texas Supreme Court has ruled that the state House may compel the attendance of its members by civil arrest, overturning a lower court order from earlier this month. \r\nThe Texas House has ye… [+2524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leyla Santiago and Mallory Simon", "title": "Florida state school board takes steps against two districts over mask mandates", "description": "Florida's State Board of Education voted unanimously Tuesday at an emergency meeting to recommend investigations into two school districts whose mask mandates defy Gov. Ron DeSantis.", "url": "https://www.cnn.com/2021/08/17/us/florida-school-board-mask-mandate-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806204207-ron-desantis-071321-super-169.jpg", "publishedAt": "2021-08-18T00:37:37Z", "content": "Floridas State Board of Education voted unanimously Tuesday at an emergency meeting to recommend investigations into two school districts whose mask mandates defy Gov. Ron DeSantis.\r\nThe board author… [+1933 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "This is not Saigon 1975", "description": "Julian Zelizer writes that despite comparisons to the US withdrawal from Saigon in 1975, the US's departure from Afghanistan is not the same.", "url": "https://www.cnn.com/2021/08/17/opinions/saigon-afghanistan-biden-withdrawal-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815041320-01-kabul-afghanistan-0815-us-helicopters-super-tease.jpg", "publishedAt": "2021-08-17T22:57:18Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+5588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "The Senate playing field just tipped toward Republicans", "description": "When the difference between the majority and the minority in the Senate is a single seat, every development in the 2022 playing field carries outsized importance.", "url": "https://www.cnn.com/2021/08/17/politics/laxalt-nv-senate-control-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201005161354-20201005-map-senate-ratings-super-169.png", "publishedAt": "2021-08-17T22:30:52Z", "content": "When the difference between the majority and the minority in the Senate is a single seat, every development in the 2022 playing field carries outsized importance.\r\nOn Tuesday, Republicans got some ve… [+1972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Bus driver shortage has districts looking at signing bonuses, alternate routes", "description": "The nationwide need for school bus drivers is expected to remain at \"critical levels\" over the coming months, with impacts to the industry's ability to provide consistent service stretching well into the school year, according to the National School Transport…", "url": "https://www.cnn.com/2021/08/17/us/school-bus-driver-shortage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817161059-01-aps-bus-file-super-tease.jpg", "publishedAt": "2021-08-17T22:26:24Z", "content": "(CNN)Trenton Dale, who has driven a school bus in Atlanta for 23 years, loves his job.\r\n\"To see the kids grow up and graduate, I mean, that's the most beautiful sight you will see,\" he told CNN affil… [+3162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Bus driver shortage has districts looking at signing bonuses, alternate routes", "description": "The nationwide need for school bus drivers is expected to remain at \"critical levels\" over the coming months, with impacts to the industry's ability to provide consistent service stretching well into the school year, according to the National School Transport…", "url": "https://www.cnn.com/2021/08/17/us/school-bus-driver-shortage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817161059-01-aps-bus-file-super-tease.jpg", "publishedAt": "2021-08-17T22:26:24Z", "content": "(CNN)Trenton Dale, who has driven a school bus in Atlanta for 23 years, loves his job.\r\n\"To see the kids grow up and graduate, I mean, that's the most beautiful sight you will see,\" he told CNN affil… [+3162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Birthday party guest jumps on alligator's back after it bit its trainer and wouldn't let go", "description": "A Utah animal trainer is recovering after the alligator she was feeding during a girl's birthday party chomped down on her hand and refused to let go until after one of the adult guests jumped on its back to help her.", "url": "https://www.cnn.com/2021/08/17/us/alligator-bites-trainer-utah-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817155509-alligator-trainer-rescued-super-tease.jpg", "publishedAt": "2021-08-17T22:19:32Z", "content": "(CNN)A Utah animal trainer is recovering after the alligator she was feeding during a girl's birthday party chomped down on her hand and refused to let go until after one of the adult guests jumped o… [+4305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "As additional mRNA shots roll out, Johnson & Johnson vaccine recipients told to wait", "description": "The calls and emails about Covid-19 boosters have already started coming in to Dr. William Schaffner's medical center in Nashville, Tennessee.", "url": "https://www.cnn.com/2021/08/17/health/johnson-covid-booster-wait-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817121631-01-johnson-and-johnson-vaccine-080521-super-tease.jpg", "publishedAt": "2021-08-17T22:16:11Z", "content": "(CNN)The calls and emails about Covid-19 boosters have already started coming in to Dr. William Schaffner's medical center in Nashville, Tennessee. \r\nIt started last week, when the the the US Food an… [+5800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Analysis: Here's why there may be no need for boosters for everyone just yet", "description": "Biden administration officials say the federal government is thinking about offering boosters to people starting about eight months after they've been fully vaccinated. But is it too soon to start talking about boosters for the general public?", "url": "https://www.cnn.com/2021/08/17/health/boosters-need-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625161640-01-pfizer-vaccine-file-super-tease.jpg", "publishedAt": "2021-08-17T21:51:13Z", "content": "(CNN)Biden administration officials say the federal government is thinking about offering boosters to people starting about eight months after they've been fully vaccinated. But is it too soon to sta… [+7596 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Lemos and Steve Almasy", "title": "Mississippi eighth grader dies a day after positive coronavirus test", "description": "A 13-year-old Mississippi girl has died just one day after testing positive for coronavirus, according to Smith County School District Superintendent Nick Hillman.", "url": "https://www.cnn.com/2021/08/17/us/mississippi-teenager-dies-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817154452-01-raleigh-ms-high-school-super-169.jpg", "publishedAt": "2021-08-17T21:30:03Z", "content": "A 13-year-old Mississippi girl has died just one day after testing positive for coronavirus, according to Smith County School District Superintendent Nick Hillman. \r\nThe girl wasnt feeling well last … [+1673 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact-checking Biden's assertion that the Afghan military was '300,000 strong'", "description": "Defending his withdrawal of US troops from Afghanistan, President Joe Biden and his administration have emphasized how many people served in the Afghan military before its collapse.", "url": "https://www.cnn.com/2021/08/17/politics/fact-check-biden-afghan-military-size-forces-police/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817072728-biden-afghanistan-washington-0816-file-restricted-super-tease.jpg", "publishedAt": "2021-08-17T21:22:16Z", "content": "Washington (CNN)Defending his withdrawal of US troops from Afghanistan, President Joe Biden and his administration have emphasized how many people served in the Afghan military before its collapse.\r\n… [+4255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Ex-defense secretary: Trump's push to get US troops out of Afghanistan possibly 'undermined' deal with Taliban", "description": "Former Defense Secretary Mark Esper said Tuesday that he was concerned that then-President Donald Trump \"undermined\" the US' 2020 agreement with the Taliban by pushing for US forces to leave Afghanistan without the Taliban meeting the conditions of the deal.", "url": "https://www.cnn.com/2021/08/17/politics/mark-esper-donald-trump-taliban-afghanistan-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200714171751-01-mark-esper-0709-file-super-tease.jpg", "publishedAt": "2021-08-17T21:06:04Z", "content": "Washington (CNN)Former Defense Secretary Mark Esper said Tuesday that he was concerned that then-President Donald Trump \"undermined\" the US' 2020 agreement with the Taliban by pushing for US forces t… [+2983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nick Ochsner", "title": "My dad died serving in Afghanistan. I'm sad and angry, and you should be too", "description": "As he watched the Taliban take Kabul, Nick Ochsner recalled the day in 2002 when his father -- SFC James Ochsner -- told him he was going to Afghanistan. His father went there three times, and the fourth time he went back, in 2005, he didn't come home.", "url": "https://www.cnn.com/2021/08/17/opinions/afghanistan-us-withdrawal-leaves-gold-star-families-angry-ochsner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817152401-01-oshsner-opinion-super-tease.jpg", "publishedAt": "2021-08-17T21:05:03Z", "content": "Nick Ochsner is the chief investigative reporter at WBTV in Charlotte, North Carolina. His father, SFC James Ochsner, was killed in Afghanistan by a roadside bomb in 2005 while serving his fourth tou… [+7382 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Selma Blair says humor helps her cope with health struggles", "description": "Selma Blair has in recent years faced some serious health struggles, but she says she's met these moments with a dose of humor.", "url": "https://www.cnn.com/2021/08/17/entertainment/selma-blair/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813102258-01-selma-blair-file-2019-super-tease.jpg", "publishedAt": "2021-08-17T21:00:11Z", "content": "(CNN)Selma Blair has in recent years faced some serious health struggles, but she says she's met these moments with a dose of humor. \r\nThe actress, speaking to reporters during the Television Critics… [+819 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Pete Buttigieg and husband Chasten have become parents", "description": "Pete Buttigieg and his husband Chasten have become first-time parents, the transportation secretary announced on Tuesday.", "url": "https://www.cnn.com/2021/08/17/politics/pete-chasten-buttigieg-parents/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817160501-pete-chasten-file-2019-super-tease.jpg", "publishedAt": "2021-08-17T20:53:56Z", "content": "Washington (CNN)Pete Buttigieg and his husband Chasten have become first-time parents, the transportation secretary announced on Tuesday. \r\n\"For some time, Chasten and I have wanted to grow our famil… [+2129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact check: Sen. John Cornyn falsely claims there are '30,000' US troops in Taiwan", "description": "President Joe Biden's withdrawal of US troops from Afghanistan has been widely criticized across the political spectrum, with a focus on the administration's miscalculation of the speed with which the Taliban would take over and its failure to act faster to e…", "url": "https://www.cnn.com/2021/08/17/politics/cornyn-us-troop-numbers-afghanistan-taiwan-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201022170329-21b-john-cornyn-play-button-super-tease.jpg", "publishedAt": "2021-08-17T20:48:00Z", "content": "Washington (CNN)President Joe Biden's withdrawal of US troops from Afghanistan has been widely criticized across the political spectrum, with a focus on the administration's miscalculation of the spe… [+2709 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Emmy Favilla", "title": "The best liquid eyeliners of 2021", "description": "We tested liquid eyeliners from Tarte and Revlon to Stila and NYX for precision, staying power, value and more to find the best liner for you.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/best-liquid-eyeliners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200724172354-underscored-eyeliner-lead-new-super-169.jpg", "publishedAt": "2021-08-17T20:43:10Z", "content": "Finding the best of any beauty product will forever be a mission of endless variables and subjectivities. What works well on someones oily skin may not fare so well on anothers dry and sensitive skin… [+17530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Wallace", "title": "TSA to extend transportation mask mandate into January", "description": "The Transportation Security Administration will extend its US federal transportation mask mandate through January 18, according to a source familiar with the matter, who requested anonymity because the announcement has not been made public.", "url": "https://www.cnn.com/2021/08/17/politics/mask-mandate-planes-trains-tsa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817161055-mask-atl-airport-0407-restricted-super-169.jpg", "publishedAt": "2021-08-17T20:25:15Z", "content": "The Transportation Security Administration will extend its US federal transportation mask mandate through January 18, according to a source familiar with the matter, who requested anonymity because t… [+570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Clarissa Ward and Gianluca Mezzofiore, CNN", "title": "They worked for America in Afghanistan. Now they are in hiding.", "description": "Fawad is one of hundreds and probably thousands of Afghans whose applications for visas to enter the US are somewhere in limbo. Now, unable to reach Kabul airport, he and his family are living in fear -- too scared to venture outside.", "url": "https://www.cnn.com/2021/08/17/asia/afghanistan-us-taliban-visas-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815041735-02-kabul-afghanistan-0815-super-tease.jpg", "publishedAt": "2021-08-17T19:40:07Z", "content": "Kabul, Afghanistan (CNN)Fawad is one of hundreds and probably thousands of Afghans whose applications for visas to enter the US are somewhere in limbo. Now, unable to reach Kabul airport, he and his … [+6748 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden's national security adviser defends chaotic Afghanistan withdrawal", "description": "White House national security adviser Jake Sullivan on Tuesday defended the US' chaotic withdrawal from Afghanistan, telling reporters that President Joe Biden \"is taking responsibility for every decision the United States government took with respect to Afgh…", "url": "https://www.cnn.com/2021/08/17/politics/biden-jake-sullivan-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210502114359-jake-sullivan-0204-super-tease.jpg", "publishedAt": "2021-08-17T18:09:15Z", "content": "(CNN)White House national security adviser Jake Sullivan on Tuesday defended the US' chaotic withdrawal from Afghanistan, telling reporters that President Joe Biden \"is taking responsibility for ever… [+1797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Johnson", "title": "These are two of our favorite Citi credit cards, but which one is the best?", "description": "The Citi Double Cash Card is easily one of the most popular cash back credit cards around, yet the recent launch of the Citi Custom Cash Card means it's worth taking a look at both of them head-to-head to see if one or the other is a better fit for you.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/citi-double-cash-vs-citi-custom-cash-credit-card/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817013640-underscored-citi-double-cash-vs-citi-custom-cash-super-169.jpg", "publishedAt": "2021-08-17T17:40:46Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+12770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan", "title": "Fintechs have a fraud problem with their Covid relief loans", "description": "Fintech lenders helped speed the delivery of forgivable government loans to small businesses crushed by the pandemic. But these tech-savvy lenders may also have opened the door to widespread fraud and misuse of taxpayer money.", "url": "https://www.cnn.com/2021/08/17/business/ppp-loan-fraud-fintech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817122928-department-of-justice-dc-0621-restricted-super-169.jpg", "publishedAt": "2021-08-17T17:38:01Z", "content": "Fintech lenders helped speed the delivery of forgivable government loans to small businesses crushed by the pandemic. But these tech-savvy lenders may also have opened the door to widespread fraud an… [+5502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "The buck stops with Biden -- but Trump's role in Afghanistan debacle is a doozy", "description": "Four presidents have had their hands in the Afghanistan war, and President Joe Biden bears responsibility for the chaotic execution of troop withdrawal. But make no mistake, write Frida Ghitis, It was Trump who set the stage during his presidency: relentlessl…", "url": "https://www.cnn.com/2021/08/17/opinions/buck-stops-with-biden-but-trump-role-in-afghanistan-a-doozy-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816185410-ghitis-oped-super-tease.jpg", "publishedAt": "2021-08-17T17:30:38Z", "content": "Frida Ghitis (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a … [+7271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy", "title": "FBI joins investigation into QAnon-affiliated leak of voting machine logins in Colorado", "description": "The FBI Denver field office has joined a Colorado district attorney's investigation into the County Clerk's office and how voting machine logins from the county wound up in a QAnon-affiliated video, an FBI spokeswoman told CNN.", "url": "https://www.cnn.com/2021/08/17/politics/fbi-voting-machine-colorado/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817131906-jena-griswold-0812-super-169.jpg", "publishedAt": "2021-08-17T17:26:16Z", "content": "The FBI Denver field office has joined a Colorado district attorneys investigation into the County Clerks office and how voting machine logins from the county wound up in a QAnon-affiliated video, an… [+3189 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter", "title": "Vaccine boosters are not unusual: CNN's medical analyst explains why", "description": "With the Biden administration expected to announce that booster doses will be needed for most people who received the Covid-19 vaccine, many people have questions. CNN Medical Analyist Dr. Leana Wen has  answers.", "url": "https://www.cnn.com/2021/08/17/health/why-boosters-covid-wen-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817121539-01-pfizer-vaccine-vial-file-super-169.jpg", "publishedAt": "2021-08-17T17:21:01Z", "content": "With the Biden administration expected to announce that booster doses will be needed for most people who received the Covid-19 vaccine, many people have questions: Are boosters safe? Does the fact th… [+4542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Chillag, CNN", "title": "How to help Afghan refugees", "description": "Many non-profits are helping provide protection, shelter, water and health care for refugees both inside Afghanistan and abroad during this latest crisis. You can help them.", "url": "https://www.cnn.com/2021/08/17/world/iyw-how-to-help-afghan-refugees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816181209-01-afghan-refugee-file-super-tease.jpg", "publishedAt": "2021-08-17T17:12:01Z", "content": "(CNN)The refugee crisis in Afghanistan is growing as the Taliban take over the country. Since the start of this year, 550,000 Afghans were forced to flee their homes due to internal fighting, accordi… [+740 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Brent Swails and Ivana Kottasová, CNN", "title": "The Taliban has been in charge of Kabul for 48 hours. Women have already disappeared from the streets", "description": "The busy Kabul street looks almost as if nothing has changed. People rush by, as shopkeepers arrange their colorful merchandise, and police direct traffic.", "url": "https://www.cnn.com/2021/08/17/asia/afghanistan-kabul-streets-under-taliban-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817085938-03-afghanistan-kabul-0817-super-tease.jpg", "publishedAt": "2021-08-17T16:33:55Z", "content": "Kabul (CNN)The busy Kabul street looks almost as if nothing has changed. People rush by, as shopkeepers arrange their colorful merchandise, and police direct traffic.\r\nThere's one big change, though:… [+2714 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Burnstein, CNN", "title": "Help for veterans anguished by Afghanistan", "description": "The Taliban's takeover of Afghanistan is particularly disheartening to Americans who fought there. Across 20 years of combat, almost 800,000 troops deployed to the war zone -- many of them more than once.", "url": "https://www.cnn.com/2021/08/17/us/iyw-how-veterans-upset-by-afghanistans-fall-can-get-help/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816162231-01-afghanistan-us-marines-file-super-tease.jpg", "publishedAt": "2021-08-17T16:06:06Z", "content": "(CNN)The Taliban's takeover of Afghanistan is particularly disheartening to Americans who fought there. Across 20 years of combat, almost 800,000 troops deployed to the war zone -- many of them more … [+997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Former Nevada attorney general Adam Laxalt launches Senate campaign", "description": "Former Nevada state Attorney General Adam Laxalt launched his campaign for US Senate on Tuesday, comparing his campaign against Democratic Sen. Catherine Cortez Masto to the Star Wars' battles between the Rebels and the Empire.", "url": "https://www.cnn.com/2021/08/17/politics/adam-laxalt-nevada-senate-campaign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817115450-adam-laxalt-file-2020-super-tease.jpg", "publishedAt": "2021-08-17T16:05:50Z", "content": "(CNN)Former Nevada state Attorney General Adam Laxalt launched his campaign for US Senate on Tuesday, comparing his campaign against Democratic Sen. Catherine Cortez Masto to the Star Wars' battles b… [+2872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Dozens of Nazi-looted artworks are exhibiting in New York", "description": "Over 50 artworks stolen from Jewish collectors during World War II, including paintings by Matisse, Picasso and Pissarro, will go on display at Manhattan's Jewish Museum.", "url": "https://www.cnn.com/style/article/afterlives-jewish-museum-nyc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817103415-04-nazi-looted-artworks-jewish-museum-new-york-super-tease.jpg", "publishedAt": "2021-08-17T16:01:50Z", "content": "artsPublished 17th August 2021\r\nDozens of artworks once stolen from Jewish collectors by the Nazis in the 1930s and '40s will be exhibited in New York starting on Friday.\r\nTaken before and during Wor… [+3617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Google's latest Pixel is seriously impressive for a $449 phone", "description": "You don't need to spend close to $1,000 for a smartphone with great cameras and long battery life. Yes, the iPhone 12 or Galaxy S21 deliver a terrific experience, but your money can go pretty far at $500 or less.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/google-pixel-5a-5g-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817095517-4-pixel-5a-with-5g-review-underscored-super-169.jpg", "publishedAt": "2021-08-17T16:00:55Z", "content": "You dont need to spend close to $1,000 for a smartphone with great cameras and long battery life. Yes, the iPhone 12 or Galaxy S21 deliver a terrific experience, but your money can go pretty far at $… [+15780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "It's time to start taking the California recall seriously", "description": "In 28 days, California voters will decide whether to recall Gavin Newsom. And the governor is getting nervous.", "url": "https://www.cnn.com/2021/08/17/politics/gavin-newsom-california-recall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726144848-01-gavin-newsom-0510-super-tease.jpg", "publishedAt": "2021-08-17T16:00:48Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "The heroines of 'RushTok' received their bids. Here's why we were so invested in TikTok's sorority recruitment saga", "description": "\"RushTok\" followed young women, mostly students at the University of Alabama, as they chose outfits and traded stories from sorority rush. TikTok viewers became obsessed -- here's why.", "url": "https://www.cnn.com/2021/08/17/us/rushtok-sorority-tiktok-recruitment-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816163125-01-alabama-bid-day-081521-restricted-super-tease.jpg", "publishedAt": "2021-08-17T15:57:49Z", "content": "(CNN)It's day two of philanthropy round. Will you be wearing the Pants Store skort with the Kendra Scott earrings, or the Shein shorts with the bangles from Amazon? As long as you don't forget the he… [+7147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "Marvel's Kevin Feige calls Disney's 'Shang-Chi' flare-up on social media a 'misunderstanding'", "description": "Disney's recent run-ins with talent have seemingly complicated life for Marvel, as Marvel Studios chief Kevin Feige spent part of the premiere for \"Shang-Chi and the Legend of the Ten Rings\" on Monday cleaning up a \"misunderstanding\" involving Disney CEO Bob …", "url": "https://www.cnn.com/2021/08/17/entertainment/shang-chi-premiere-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419121637-01-marvel-shang-chi-and-the-legend-of-the-ten-rings-trailer-super-tease.jpg", "publishedAt": "2021-08-17T15:30:28Z", "content": "(CNN)Disney's recent run-ins with talent have seemingly complicated life for Marvel, as Marvel Studios chief Kevin Feige spent part of the premiere for \"Shang-Chi and the Legend of the Ten Rings\" on … [+1848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "US to ship first of the 500 million Pfizer doses Biden pledged to donate globally", "description": "The Biden administration on Tuesday is shipping the first of the 500 million Covid-19 doses that President Joe Biden pledged to share with countries around the world at the Group of Seven summit earlier this year.", "url": "https://www.cnn.com/2021/08/17/politics/first-of-500-million-pfizer-doses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210704190844-white-house-exterior-0703-super-tease.jpg", "publishedAt": "2021-08-17T15:04:50Z", "content": "(CNN)The Biden administration on Tuesday is shipping the first of the 500 million Covid-19 doses that President Joe Biden pledged to share with countries around the world at the Group of Seven summit… [+2893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Companies are hoarding cash as the Delta variant takes over the globe", "description": "Big companies like Apple and Google are continuing to add to their massive piles of cash, a sign that corporations are increasingly nervous about the impact the highly contagious Delta variant of Covid-19 will have on the global economy.", "url": "https://www.cnn.com/2021/08/17/investing/cash-companies-balance-sheet/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816092208-google-ca-empty-offices-0421-restricted-super-tease.jpg", "publishedAt": "2021-08-17T15:01:11Z", "content": "New York (CNN Business)Apple, Google and other big companies around the world are continuing to add to their massive piles of cash, a sign that corporations are increasingly nervous about how the hig… [+3445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas", "title": "Child Covid-19 cases have 'steadily increased' since the beginning of July, AAP says, with 121,000 new cases last week", "description": "More than 121,000 child Covid-19 cases were reported in the US in the last week, according to a report from the American Academy of Pediatrics.", "url": "https://www.cnn.com/2021/08/17/health/child-covid-19-cases-increase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817102348-01-child-covid-test-austin-tx-0805-super-169.jpg", "publishedAt": "2021-08-17T14:52:27Z", "content": "More than 121,000 child Covid-19 cases were reported in the US in the last week, according to a report from the American Academy of Pediatrics. \r\nAfter declining in early summer, child cases have ste… [+1924 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kiana Murden", "title": "24 of the best beauty products on Amazon that are worth adding to cart", "description": "Sick of spending more than $50 on skin care and makeup, we found the best beauty products on Amazon that are just as good as some cult favorites.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/best-beauty-products-on-amazon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811164409-best-beauty-products-on-amazon-lead-super-169.jpg", "publishedAt": "2021-08-17T14:37:13Z", "content": "Were definitely the kind of people who are willing to try a new beauty product no matter what. And hands down, one of our favorite things is finding more affordable options that hold a candle to anot… [+13252 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Away's new expandable luggage is the solution to your overpacking problem", "description": "Away just launched its first line of expandable hardside luggage, combining the protection of polycarbonate with a little extra room for forgiveness when travelers overpack or do a little shopping while they're on vacation.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/away-expandable-hardside-luggage-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817101521-away-1-super-169.jpg", "publishedAt": "2021-08-17T14:19:38Z", "content": "It feels like its been a year full of launches for Away so far check out the new crossbody, packable bags and cosmetic bags and theres no signs of slowing down. The stylish luggage company (and maker… [+1246 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: Rick Scott just went there on Biden and the 25th Amendment", "description": "Perhaps unhappy with the soaring profile of fellow Floridian Ron DeSantis among the Trumpist base of the Republican Party, Sen. Rick Scott decided to do something about it on Monday.", "url": "https://www.cnn.com/2021/08/17/politics/rick-scott-joe-biden-25th-amendment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201123110402-sen-rick-scott-super-tease.jpg", "publishedAt": "2021-08-17T14:09:00Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "The stock market just doubled from its pandemic low — but now Delta's happening", "description": "US stocks hit record highs Monday, surging 100% from the lows they hit at the start of the pandemic. Then Tuesday happened.", "url": "https://www.cnn.com/2021/08/17/investing/stock-market-pandemic-rebound/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811114508-01-nyse-0810-super-169.jpg", "publishedAt": "2021-08-17T14:05:02Z", "content": "US stocks hit record highs Monday, surging 100% from the lows they hit at the start of the pandemic. Then Tuesday happened.\r\nA widely anticipated retail sales report showed the Delta variant is putti… [+2315 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann and Ellie Kaufman", "title": "An incoherent strategy doomed the 20-year US mission in Afghanistan, watchdog says as US withdraws", "description": "An incoherent strategy to rebuild Afghanistan, flush with resources but lacking cohesive leadership and a well-defined mission, doomed the 20-year US reconstruction effort that saw American taxpayers pour $145 billion into projects that were often unsustainab…", "url": "https://www.cnn.com/2021/08/17/politics/afghanistan-sigar-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817084902-32-taliban-afghanistan-unf-super-169.jpg", "publishedAt": "2021-08-17T14:02:25Z", "content": "An incoherent strategy to rebuild Afghanistan, flush with resources but lacking cohesive leadership and a well-defined mission, doomed the 20-year US reconstruction effort that saw American taxpayers… [+2756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Nine Perfect Strangers' checks in as 'The White Lotus' checks out", "description": "With a mini-reunion of key players from \"Big Little Lies\" at its core, \"Nine Perfect Strangers\" combines a book by Liane Moriarty with Nicole Kidman and writer-producer David E. Kelley, then surrounds them with an equally impressive cast.", "url": "https://www.cnn.com/2021/08/17/entertainment/nine-perfect-strangers-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816104850-01-nine-perfect-strangers-super-tease.jpg", "publishedAt": "2021-08-17T13:50:59Z", "content": "(CNN)With a mini-reunion of key players from \"Big Little Lies\" at its core, \"Nine Perfect Strangers\" combines a book by Liane Moriarty with Nicole Kidman and writer-producer David E. Kelley, then sur… [+2836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Newsroom leadership has never been this diverse, but that's not enough", "description": "A new class of media executives who have taken top jobs at major publications in the US in the last year is much different than any that came before it. Notably, the class is not made up of predominantly White men.", "url": "https://www.cnn.com/2021/08/17/media/media-leadership-diversity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811183429-restricted-american-new-media-leadership-split-super-tease.jpg", "publishedAt": "2021-08-17T13:49:28Z", "content": "\"... they are showing a willingness that other editors did not have. Just that rhetorical awareness about how we have not served our audiences, or we have not served them sufficiently, is progress.\" … [+43 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Rivers, Etant Dupain and Jack Guy, CNN", "title": "Heavy rain hampers Haiti rescue efforts as earthquake death toll rises", "description": "Tropical Storm Grace is bringing heavy rain to the area of Haiti devastated by a 7.2-magnitude earthquake at the weekend.", "url": "https://www.cnn.com/2021/08/17/americas/haiti-earthquake-news-tuesday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817043544-08-haiti-earthquake-0816-ts-grace-super-tease.jpg", "publishedAt": "2021-08-17T13:38:25Z", "content": "(CNN)Tropical Storm Grace is bringing heavy rain to the area of Haiti devastated by a 7.2-magnitude earthquake at the weekend.\r\nThe quake, which struck southwestern Haiti on Saturday morning, killed … [+2313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bianca Pindea and Bianca Pineda", "title": "22 gifts to help celebrate the Virgo in your life", "description": "Finding a gift that's as thoughtful as a Virgo may prove to be a difficult feat. From weighted blankets to charcuterie board sets, here are 22 gift ideas the Virgo in your life is sure to appreciate.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/virgo-gift-ideas-birthday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816141504-virgolead-super-169.jpg", "publishedAt": "2021-08-17T13:27:39Z", "content": "Celebrating Virgos may come easily, and if you have a loved one born between August 23 and September 22, you know what we mean. Theyre nurturing, self-sacrificing, supportive and theyll show up to he… [+5475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, Celine Alkhaldi, Nada Bashir and Nina Avramova, CNN", "title": "Afghans await news on their lives under the Taliban, as the US and allies rush to leave Kabul", "description": "Thousands of desperate Afghans remain stranded under Taliban rule in Kabul on Tuesday, as the US and its allies -- still frantically pulling their personnel from the city's airport -- reckon with the sudden breakdown of their two-decade effort in Afghanistan.", "url": "https://www.cnn.com/2021/08/17/asia/afghanistan-taliban-withdrawal-tuesday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816164637-06-taliban-afghanistan-unf-super-tease.jpg", "publishedAt": "2021-08-17T13:21:34Z", "content": "(CNN)Thousands of desperate Afghans remain stranded under Taliban rule in Kabul on Tuesday, as the US and its allies -- frantically evacuating their personnel from the city's airport -- reckon with t… [+4712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "How Apple's plan to combat child abuse backfired on it", "description": "In early August, Apple announced a major new program designed to help combat child exploitation and promote safety, issues the tech community has increasingly embraced. It was a presentation big on intent but light on the details.", "url": "https://www.cnn.com/2021/08/17/tech/apple-child-safety-tools-backfire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812144047-apple-iphone---stock-super-tease.jpg", "publishedAt": "2021-08-17T13:02:50Z", "content": "(CNN Business)In early August, Apple(AAPL) announced a major new program designed to help combat child exploitation and promote safety, issues the tech community has increasingly embraced. It was a p… [+7743 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wallace and Kai Burkhardt", "title": "12 breathable face masks to protect you while exercising", "description": "Indoor gyms and fitness spaces are open, but with renewed concerns over the Delta variant, you may still want to wear a mask. Here are our favorites.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/best-breathable-face-masks-covid-delta-variant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200730154417-underscored-breathable-face-mask-lead-winner-super-169.jpg", "publishedAt": "2021-08-17T13:00:19Z", "content": "Indoor gyms and fitness spaces are open, but with renewed concerns over the Delta variant, the topic of wearing protective face masks during exercise continues to get folks perspiring. Gym goers will… [+4641 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico", "title": "Can't find a PS5 or Xbox Series X? Here's why Google Stadia is a solid alternative", "description": "Google Stadia isn't for everyone, but this cloud-based gaming service can be a strong alternative to console and PC gaming for casual or budget-concious fans.", "url": "https://www.cnn.com/2021/08/17/cnn-underscored/google-stadia-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816152422-google-stadia-review-lead-super-169.jpg", "publishedAt": "2021-08-17T12:56:37Z", "content": "Google Stadia launched nearly two years ago as a way to play big-name video games on any device via the cloud, and the reception was mixed, to say the least. While Googles game-streaming technology h… [+15499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Fewer people are going to Home Depot. That could be a bad sign for the housing market", "description": "Home Depot has thrived in the red-hot housing market, but there are growing signs that demand is finally starting to cool.", "url": "https://www.cnn.com/2021/08/17/investing/home-depot-earnings-housing-market/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817080836-home-depot-0527-super-169.jpg", "publishedAt": "2021-08-17T12:46:27Z", "content": "Home Depot has thrived in the red-hot housing market, but there are growing signs that demand is finally starting to cool. \r\nAlthough Home Depots second-quarter earnings and revenue topped forecasts … [+1873 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "One million vacancies and soaring wages fuel UK inflation fears", "description": "Job vacancies in the United Kingdom hit a record high last month and wages soared by 7.4% between April and June, adding to fears of a prolonged period of rising prices as companies pass on higher costs to consumers.", "url": "https://www.cnn.com/2021/08/17/economy/uk-economy-jobs-wages-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817070410-uk-economy-jobs-wages-inflation-super-tease.jpg", "publishedAt": "2021-08-17T11:24:50Z", "content": "London (CNN Business)Job vacancies in the United Kingdom hit a record high last month and wages soared by 7.4% between April and June, adding to fears of a prolonged period of rising prices as compan… [+2710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "Venice plans wheelchair-accessible route", "description": "A wheelchair-accessible route from Piazzale Roma to St. Mark's Square is in the works.", "url": "https://www.cnn.com/travel/article/venice-wheelchair-accessible-route/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817062216-01-venice-wheelchair-accessible-route-super-tease.jpg", "publishedAt": "2021-08-17T11:15:40Z", "content": "(CNN) Its 403 bridges, myriad canals and pretty cobbled streets have made Venice one of the world's most beautiful cities. But what's one person's Instagram dream is another's mobility nightmare.\r\nTh… [+5368 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen and Hannah Rabinowitz", "title": "Some US Capitol rioters stay defiant, even while pleading guilty", "description": "Boyd Camper was set to join the ranks of those pleading guilty in the January 6 insurrection when the federal judge overseeing the case abruptly postponed the plea hearing over questions about whether Camper really believed he did anything wrong.", "url": "https://www.cnn.com/2021/08/17/politics/capitol-rioters-defiant-guilty-pleas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210611163618-01-january-6-insurrectionists-file-super-169.jpg", "publishedAt": "2021-08-17T11:01:17Z", "content": "Boyd Camper was set to join the ranks of those pleading guilty in the January 6 insurrection when the federal judge overseeing the case abruptly postponed the plea hearing over questions about whethe… [+8059 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly McCleary, CNN", "title": "Tornado watch issued in central and north Georgia as Fred is downgraded to a tropical depression", "description": "A tornado watch was issued for much of central and north Georgia on Tuesday as Fred was downgraded to a tropical depression.", "url": "https://www.cnn.com/2021/08/17/weather/tropical-depression-fred-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816183357-01-tropical-storm-fred-081621-panama-city-super-tease.jpg", "publishedAt": "2021-08-17T11:01:07Z", "content": "(CNN)A tornado watch was issued for much of central and north Georgia on Tuesday as Fred was downgraded to a tropical depression. \r\nThe tornado watch included much of metro Atlanta, Athens, and Macon… [+1254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Kylie Atwood, Oren Liebermann and Nicole Gaouette", "title": "Biden administration reverts to internal blame-shifting amid Afghanistan chaos", "description": "Factions within the Biden administration are embroiled in a blame game over why the US government didn't act sooner to withdraw American citizens and Afghans who helped the US over two decades of war, leading to a rushed and dangerous evacuation.", "url": "https://www.cnn.com/2021/08/17/politics/biden-afghanistan-blame-shifting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816162517-03-biden-afghanistan-remarks-0816-super-169.jpg", "publishedAt": "2021-08-17T11:01:04Z", "content": "Factions within the Biden administration are embroiled in a blame game over why the US government didnt act sooner to withdraw American citizens and Afghans who helped the US over two decades of war,… [+10726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Alice Stewart", "title": "Biden owns the mess he created in Afghanistan", "description": "Alice Stewart writes on President Joe Biden's defense of his decision to withdraw troops from Afghanistan. Stewart argues that Biden laid out a false choice between an endless war and withdrawing completely.", "url": "https://www.cnn.com/2021/08/17/opinions/biden-afghanistan-address-third-option-stewart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816160754-02-biden-afghanistan-remarks-0816-super-tease.jpg", "publishedAt": "2021-08-17T10:58:50Z", "content": "Alice Stewart is a CNN political commentator, member of the Student Advisory Board at the Kennedy Institute of Politics at Harvard University, and former Communications Director for Ted Cruz for Pres… [+3901 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for August 17: Afghanistan, coronavirus, extreme weather, cybersecurity, India", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/08/17/us/five-things-august-17-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816164353-02-taliban-afghanistan-unf-super-tease.jpg", "publishedAt": "2021-08-17T10:29:42Z", "content": "(CNN)Grace has strengthened into a tropical storm again, threatening the Caribbean with mudslides and flooding. That includes vulnerable Haiti, which just suffered an earthquake and may now face driv… [+4908 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julie Appleby, Kaiser Health News", "title": "For unvaccinated people on the fence, work hurdles could change their minds", "description": "As employers create safety protocols for workers who refuse vaccination, we ask experts if they really work. Or is the point to pressure employees into getting a shot?", "url": "https://www.cnn.com/2021/08/17/health/unvaccinated-workers-covid-partner-khn-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816060932-02-vaccine-protest-0724-file-super-tease.jpg", "publishedAt": "2021-08-17T10:24:01Z", "content": "(CNN)With the Deltavariant surging, a growing number of employers are tiring of merely cajoling workers to get vaccinated and are following President Joe Biden's protocol for federal workers: Either … [+6798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "This meteor shower's 'fizzing' asteroid acts like a comet", "description": "Phaethon, the source of the Geminid meteor shower, has intrigued scientists for years because it's an asteroid that behaves like a comet. New research may reveal the reason why this oddball gets so bright as it approaches the sun: fizzing sodium.", "url": "https://www.cnn.com/2021/08/17/world/phaethon-asteroid-sodium-geminid-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816165638-phaethon-asteroid-nasa-illustration-super-tease.jpg", "publishedAt": "2021-08-17T10:23:19Z", "content": "(CNN)Phaethon, the source of the Geminid meteor shower, has intrigued scientists for years because it's an asteroid that behaves like a comet. New research may reveal the reason why this oddball gets… [+4557 chars]"}]}