{"status": "ok", "totalResults": 169, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, Tara Subramaniam and Greg Clary, CNN", "title": "Fact check: Did the Marine who Trump brought on stage at rally actually hoist a baby over a wall at Kabul airport?", "description": "During a rally in Georgia over the weekend, former President Donald Trump invited Lance Cpl. Hunter Clark to the stage, implying he was the Marine in a viral video who lifted a child over a wall at the airport in Kabul, Afghanistan.", "url": "https://www.cnn.com/2021/09/30/politics/fact-check-trump-rally-marine-baby-kabul-airport/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210820113904-10-afghanistan-0819-airport-wall-super-tease.jpg", "publishedAt": "2021-10-01T01:02:07Z", "content": "Washington (CNN)During a rally in Georgia over the weekend, former President Donald Trump invited Lance Cpl. Hunter Clark to the stage, implying he was the Marine in a viral video who lifted a child … [+2217 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg and Steve Almasy, CNN", "title": "California police reform laws create decertification system for officer misconduct", "description": "California Gov. Gavin Newsom on Thursday signed into law a series of police reform bills, creating a system to decertify law enforcement officers found to have engaged in serious misconduct, strengthen use of force practices and increase transparency with the…", "url": "https://www.cnn.com/2021/09/30/us/california-police-reform-laws-decertification/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930194257-newsom-0915-super-tease.jpg", "publishedAt": "2021-10-01T00:55:17Z", "content": "(CNN)California Gov. Gavin Newsom on Thursday signed into law a series of police reform bills, creating a system to decertify law enforcement officers found to have engaged in serious misconduct, str… [+4505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "The Covid-19 vaccine health care worker holdouts: For them, it's personal. For their hospitals it's professional", "description": "Being a nurse means everything to Andrea Babinski, but she is willing to risk it all -- the connections to colleagues she likes, the patients she cares for, not to mention the steady paycheck -- for a simple belief.", "url": "https://www.cnn.com/2021/09/30/health/unvaccinated-nurses-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714080710-vaccine-protests-texas-0626-super-tease.jpg", "publishedAt": "2021-10-01T00:43:43Z", "content": "(CNN)Being a nurse means everything to Andrea Babinski, but she is willing to risk it all -- the connections to colleagues she likes, the patients she cares for, not to mention the steady paycheck --… [+13433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Killough and Ed Lavandera, CNN", "title": "'She is just absolutely standing in the way': Sinema's critics in Arizona speak out", "description": "When Kyrsten Sinema won her US Senate seat in 2018, she was the first Democrat from Arizona elected to the chamber in three decades. It was a triumphant gain for her party -- bolstered further when Democrats took over the White House and the Senate two years …", "url": "https://www.cnn.com/2021/09/30/politics/kyrsten-sinema-arizona-reaction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210610200419-kyrsten-sinema-lah-dnt-ebof-vpx-super-tease.jpg", "publishedAt": "2021-10-01T00:22:32Z", "content": "Scottsdale, Arizona (CNN)When Kyrsten Sinema won her US Senate seat in 2018, she was the first Democrat from Arizona elected to the chamber in three decades. It was a triumphant gain for her party --… [+6006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Democrats are fighting for their political lives", "description": "There are signs of economic trouble that should concern Democrats. Bottlenecks in the global supply chain have driven prices up and disrupted the availability of everything from nitrile gloves to cars. And things could get even worse, with the potential for t…", "url": "https://www.cnn.com/2021/09/30/opinions/global-supply-chain-politics-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210926151837-01-port-of-los-angeles-container-ships-0920-super-tease.jpg", "publishedAt": "2021-10-01T00:08:28Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+5986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Elam, CNN", "title": "Windy Fire has destroyed more than two dozen giant sequoia trees -- and that's just an early assessment", "description": "The Windy Fire in California is wreaking havoc on sequoia trees in Sequoia National Forest this week. Experts say fire has killed at least 29 of the giant trees, which can live for thousands of years.", "url": "https://www.cnn.com/2021/09/30/us/windy-fire-sequoia-trees-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930180906-windy-fire-0919-super-tease.jpg", "publishedAt": "2021-09-30T22:46:59Z", "content": "(CNN)The Windy Fire in California is wreaking havoc on sequoia trees in Sequoia National Forest this week. Experts say fire has killed at least 29 of the giant trees, which can live for thousands of … [+3290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What Joe Manchin gets wrong about the Senate", "description": "On Thursday afternoon, barraged by reporters asking about criticism from the  left for his opposition to a $3.5 trillion budget package, West Virginia Democratic Sen. Joe Manchin offered progressives some advice:", "url": "https://www.cnn.com/2021/09/30/politics/joe-manchin-senate-ideology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930145747-03-manchin-media-0930-super-tease.jpg", "publishedAt": "2021-09-30T22:39:20Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza, CNN Editor-at-large", "title": "Joe Manchin has been remarkably consistent. Democrats just haven't been listening", "description": "On Thursday, West Virginia Democratic Sen. Joe Manchin made clear how much he was willing to spend on a budget bill being pushed by President Joe Biden and his fellow Democrats in Congress: $1.5 trillion.", "url": "https://www.cnn.com/2021/09/30/politics/joe-manchin-budget-bill-1-5-trillion-schumer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930145747-03-manchin-media-0930-super-tease.jpg", "publishedAt": "2021-09-30T22:10:49Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Kaczynski and Em Steck, CNN", "title": "Harriet Hageman once rebuked Trump and endorsed Liz Cheney. She's now challenging her with his support", "description": "Harriet Hageman, who earned the endorsement of former President Donald Trump in her 2022 bid to challenge Wyoming Rep. Liz Cheney, once called her current opponent a \"proven, courageous, constitutional conservative.\"", "url": "https://www.cnn.com/2021/09/30/politics/kfile-harriet-hageman-endorsed-cheney-2016/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930130106-harriet-hageman-file-2018-super-tease.jpg", "publishedAt": "2021-09-30T22:00:36Z", "content": "(CNN)Harriet Hageman, who earned the endorsement of former President Donald Trump in her 2022 bid to challenge Wyoming Rep. Liz Cheney, once called her current opponent a \"proven, courageous, constit… [+4146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Fisher, CNN", "title": "US inks $20 million deal to launch high-tech weather satellites in space", "description": "The United States announced a $20 million contract with Tomorrow.io to launch a group of small satellites. The initiative will fill a critical gap in the ability to foresee precipitation dangers, like the deluge that overwhelmed Northeastern cities in early S…", "url": "https://www.cnn.com/2021/09/30/world/us-weather-satellite-deal-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930172501-02-us-weather-satellite-deal-super-tease.jpg", "publishedAt": "2021-09-30T21:51:50Z", "content": "(CNN)The United States is aiming to launch a group of small satellites to fill a critical gap in the ability to foresee precipitation dangers, like the deluge that overwhelmed Northeastern cities at … [+3821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How anti-vaxxers cling to centuries-old conspiracy theories", "description": "Anti-vax resistance has been around for years. In the latest \"Reality Check with John Avlon: Extremist Beat,\" Avlon traces the anti-government, anti-science and religious overtones that have persisted through the history of anti-vax opposition with CNN's Elle…", "url": "https://www.cnn.com/videos/business/2021/09/30/anti-vax-history-reality-check-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930120826-avlon-show-anti-vaxxers-desktop-thumb-w-border-super-tease.jpg", "publishedAt": "2021-09-30T21:50:27Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, Daniella Diaz, Alex Rogers and Annie Grayer, CNN", "title": "Pelosi scrambles to pass trillion-dollar infrastructure bill", "description": "House Speaker Nancy Pelosi has been working furiously behind the scenes to build support for the roughly $1 trillion infrastructure bill, personally calling Democrats and talking to members on the House floor as progressives threaten to tank it.", "url": "https://www.cnn.com/2021/09/30/politics/house-infrastructure-negotiations-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930105445-01-congress-budget-0930-pelosi-super-tease.jpg", "publishedAt": "2021-09-30T21:46:01Z", "content": "(CNN)House Speaker Nancy Pelosi has been working furiously behind the scenes to build support for the roughly $1 trillion infrastructure bill, personally calling Democrats and talking to members on t… [+1304 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Refugee groups race to find housing for 53,000 Afghan evacuees", "description": "Refugee resettlement agencies are racing to find housing for the approximately 53,000 Afghans on military bases in the United States who will eventually be resettled in the country, but the groups are facing a strained -- and expensive -- housing market.", "url": "https://www.cnn.com/2021/09/30/politics/afghan-refugees-housing-costs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930171426-afghan-refugees-us-0930-super-tease.jpg", "publishedAt": "2021-09-30T21:43:21Z", "content": "(CNN)Refugee resettlement agencies are racing to find housing for the approximately 53,000 Afghans on military bases in the United States who will eventually be resettled in the country, but the grou… [+8829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan and Steve Almasy, CNN", "title": "FBI joins search for Miya Marcano, who has been missing in Florida for nearly a week", "description": "The FBI is assisting in the search for a 19-year-old woman who went missing last Friday from an Orlando apartment complex, the Orange County sheriff said Thursday.", "url": "https://www.cnn.com/2021/09/30/us/florida-missing-woman-miya-marcano-fbi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927211111-miya-marcano-missing-super-tease.jpg", "publishedAt": "2021-09-30T20:53:27Z", "content": "HELP FIND MIYA: Miya Marcano is still missing. We suspect foul play. Person of interest Armando Caballero was found dead today. It appears he killed himself.\r\nCaballero was a maintenance worker at Ar… [+183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Bruce Friedrich and Anand Gopal", "title": "How alternative meats could help save the planet", "description": "The world is highly unlikely to meet Paris Agreement targets unless conventional meat consumption goes down globally, write Bruce Friedrich and Anand Gopal.", "url": "https://www.cnn.com/2021/09/30/opinions/alternative-meats-save-planet-friedrich-gopal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180705130329-impossible-burger-super-tease.jpg", "publishedAt": "2021-09-30T20:31:08Z", "content": "Bruce Friedrich is founder and CEO of the Good Food Institute, a global non-profit organization that is focused on using science and policy to build a better food system. Anand R. Gopal, PhD is the i… [+6333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "DC appeals court grapples with the question of due process rights for Guantanamo detainees", "description": "The US Court of Appeals for the DC Circuit grappled on Thursday with the question of whether to issue a significant decision about the due process rights of Guantanamo detainees -- a case that has put the Biden administration on complicated footing as the Pre…", "url": "https://www.cnn.com/2021/09/30/politics/guantanamo-due-process-dc-circuit-court-en-banc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210906134714-guantanamo-bay-naval-station-super-tease.jpg", "publishedAt": "2021-09-30T20:17:10Z", "content": "(CNN)The US Court of Appeals for the DC Circuit grappled on Thursday with the question of whether to issue a significant decision about the due process rights of Guantanamo detainees -- a case that h… [+5869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales and Sean Lyngaas, CNN", "title": "NYPD launches internal review of 2 officers after names appear in leaked data apparently belonging to the Oath Keepers", "description": "The New York City Police Department launched an internal review of two active officers after their names and phone numbers were reportedly found in leaked data that apparently belongs to the Oath Keepers, a far-right, anti-government militia, a law enforcemen…", "url": "https://www.cnn.com/2021/09/30/us/nypd-oath-keepers-officers-investigated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930150507-oath-keepers-file-super-tease.jpg", "publishedAt": "2021-09-30T19:30:58Z", "content": "(CNN)The New York City Police Department launched an internal review of two active officers after their names and phone numbers were reportedly found in leaked data that apparently belongs to the Oat… [+2739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "California synagogue shooter sentenced to life in prison without the possibility of parole", "description": "John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synagogue.", "url": "https://www.cnn.com/2021/09/30/us/poway-synagogue-shooter-sentencing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720143150-john-earnest-poway-shooting-sept-2019-super-tease.jpg", "publishedAt": "2021-09-30T19:19:46Z", "content": "(CNN)John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synago… [+3643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "California synagogue shooter sentenced to life in prison without the possibility of parole", "description": "John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synagogue.", "url": "https://www.cnn.com/2021/09/30/us/poway-synagogue-shooter-sentencing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720143150-john-earnest-poway-shooting-sept-2019-super-tease.jpg", "publishedAt": "2021-09-30T19:19:46Z", "content": "(CNN)John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synago… [+3643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "More than 2 million US teens use e-cigarettes, a quarter of them daily, CDC and FDA find", "description": "More than 2 million US teens say they use e-cigarettes, with a quarter of them saying they vape daily, a new national survey finds.", "url": "https://www.cnn.com/2021/09/30/health/youth-tobacco-survey-vaping/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930142824-teen-vaping-stock-super-tease.jpg", "publishedAt": "2021-09-30T19:19:29Z", "content": "(CNN)More than 2 million US teens say they use e-cigarettes, with a quarter of them saying they vape daily, a new national survey finds.\r\nEven with many middle and high school students home because o… [+6316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "Most cryptos will fail, but bitcoin could be here for good", "description": "Bitcoin is among the most polarizing investments in history. Ask a skeptic, and they'll tell you it's a bubble that's about to pop. Ask a believer, and they'll tell you it's a bubble that will keep expanding forever.", "url": "https://www.cnn.com/2021/09/30/investing/foreseeable-future-cryptocurrency/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210924223946-bitcoin-illustration-05-30-2021-super-tease.jpg", "publishedAt": "2021-09-30T19:07:16Z", "content": "New York (CNN)Bitcoin is among the most polarizing investments in history. Ask a skeptic, and they'll tell you it's a bubble that's about to pop. Ask a believer, and they'll tell you it's a bubble th… [+2085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kirsten Powers, CNN Senior Political Analyst", "title": "Cancer survivor blows the whistle on 'toxic positivity'", "description": "At the age of 35, Kate Bowler was diagnosed with stage IV cancer. Doctors predicted that at best she had two years to live -- essentially handing the Duke Divinity School professor a death sentence. Since then, she's been on the receiving end of a maddening c…", "url": "https://www.cnn.com/2021/09/30/opinions/toxic-positivity-and-cancer-survivor-column-powers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930142558-kate-bowler-super-tease.jpg", "publishedAt": "2021-09-30T19:00:21Z", "content": "Kirsten Powers is a CNN senior political analyst and New York Times bestselling author whose forthcoming book is \"Saving Grace: Speak Your Truth, Stay Centered and Learn to Coexist with People Who Dr… [+5755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Stopping antidepressants may lead to relapse, study finds. Here's what you can do", "description": "Weaning off antidepressants when you feel better may seem like a good idea, but for some it can lead to a relapse into depression. Here's what experts say you can do to keep that from happening.", "url": "https://www.cnn.com/2021/09/30/health/stopping-antidepressant-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927175507-medications-stock-super-tease.jpg", "publishedAt": "2021-09-30T18:46:49Z", "content": "(CNN)Over half of people with chronic depression who attempted to stop their antidepressant medication relapsed into depression by the end of a year, compared to those who did not stop medicating, ac… [+9756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "'Big Lie' supporters claimed fraud in Idaho's results. Election officials investigated and found nothing", "description": "Idaho election officials thought they might be on to something.", "url": "https://www.cnn.com/2021/09/30/politics/idaho-election-results-big-lie/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210204161454-01-stop-the-steal-rally-0106-super-tease.jpg", "publishedAt": "2021-09-30T18:45:12Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David Love", "title": "What Congress' total failure on police reform means for communities", "description": "Pointing to the story of Rickia Young, David Love writes that the breakdown of federal police reform talks will have dire consequences for Black and brown communities, particularly in states and cities where an adequate approach to holding officers accountabl…", "url": "https://www.cnn.com/2021/09/30/opinions/federal-police-reform-failure-rickia-young-love/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930140316-david-love-op-ed-federal-prison-refrom-talks-super-tease.jpg", "publishedAt": "2021-09-30T18:37:29Z", "content": "David A. Love is a faculty member in journalism and media studies at the Rutgers University School of Communication and Information, and a writer based in Philadelphia. Follow him on Twitter: @DavidA… [+7998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "This house was in a serious fire. Now it's selling 'as-is' for nearly $400k", "description": "A house outside of Boston, MA was involved in a fire, and then placed on the market before it was repaired. It's now selling for just under $400k.", "url": "https://www.cnn.com/videos/business/2021/09/30/house-fire-sale-400k-housing-market-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930141218-house-fire-400k-boston-super-tease.jpg", "publishedAt": "2021-09-30T18:17:27Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol, Michael Andronico and Michael Nuñez", "title": "The best true wireless earbuds of 2021", "description": "CNN Underscored tested 27 — and counting — top-rated true wireless earbuds to find the very best options for you.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/best-true-wireless-earbuds/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210617092746-best-true-wireless-earbuds-lead-june-2021.jpg?q=x_5,y_0,h_2894,w_5144,c_crop/w_800", "publishedAt": "2021-09-30T17:49:15Z", "content": "Apple may have ushered in the wire-free craze with its now-ubiquitous AirPods, but these days, there seems to be an endless influx of wireless earbuds looking to help you cut the cord. Amazon has Ech… [+44809 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Nearly 50 million seniors could face Social Security payments delays if debt ceiling isn't raised", "description": "Nearly 50 million senior citizens could face delays in their Social Security payments if Congress does not suspend or raise the debt ceiling in the coming weeks, Treasury Secretary Janet Yellen told lawmakers Thursday.", "url": "https://www.cnn.com/2021/09/30/politics/debt-ceiling-social-security-payments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210922121430-social-security-check-file-super-tease.jpg", "publishedAt": "2021-09-30T17:43:40Z", "content": "(CNN)Nearly 50 million senior citizens could face delays in their Social Security payments if Congress does not suspend or raise the debt ceiling in the coming weeks, Treasury Secretary Janet Yellen … [+2941 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Ted Barrett, CNN", "title": "Manchin says $1.5 trillion is his limit on Biden economic agenda price tag", "description": "Moderate Democratic Sen. Joe Manchin of West Virginia made clear Thursday that $1.5 trillion was the price tag he was willing to settle on for his party's plan to expand the social safety net, putting him $2 trillion away from the lowest number progressive De…", "url": "https://www.cnn.com/2021/09/30/politics/manchin-bipartisan-infrastructure-deal-vote-negotiations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622161606-01-joe-manchin-0622-super-tease.jpg", "publishedAt": "2021-09-30T17:41:41Z", "content": "(CNN)Moderate Democratic Sen. Joe Manchin of West Virginia made clear Thursday that $1.5 trillion was the price tag he was willing to settle on for his party's plan to expand the social safety net, p… [+1362 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallory Simon, CNN", "title": "School board group asks for federal help to stop threats and violence in debates on Covid and critical race theory", "description": "The letter comes after a series of heated school board meetings across the country regarding Covid-19 safety protocols and critical race theory, the oft-misunderstood concept examining the role of institutional racism in American history.", "url": "https://www.cnn.com/2021/09/30/us/school-board-threats-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812043103-tn-school-board-meeting-orig-2-super-tease.jpg", "publishedAt": "2021-09-30T17:36:23Z", "content": "(CNN)A group representing national school board associations asked President Joe Biden and the federal government on Wednesday to help look into threats against school board members and educators to … [+3408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and Katelyn Polantz, CNN", "title": "Durham issues fresh round of subpoenas in his continuing probe of FBI investigation into Trump, Russia", "description": "Special Counsel John Durham has issued a new set of subpoenas, including to a law firm with close ties to Hillary Clinton's 2016 campaign, an indication that Durham could be trying to build a broader criminal case, according to people briefed on the matter. S…", "url": "https://www.cnn.com/2021/09/30/politics/durham-subpoenas-probe-russia-fbi-sussman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190514172200-us-attorney-john-durham-super-tease.jpg", "publishedAt": "2021-09-30T17:29:08Z", "content": "Washington (CNN)Special Counsel John Durham has issued a new set of subpoenas, including to a law firm with close ties to Hillary Clinton's 2016 campaign, an indication that Durham could be trying to… [+10934 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, CNN", "title": "Trump super PAC cuts ties with Lewandowski after donor alleged unwanted sexual advances", "description": "Donald Trump's super PAC has severed ties with Republican operative Corey Lewandowski following reports that a donor accused the former Trump campaign manager of making unwanted sexual advances toward her last weekend.", "url": "https://www.cnn.com/2021/09/30/politics/corey-lewandowski-trump-super-pac/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210505154641-corey-lewandowski-sept-2019-super-tease.jpg", "publishedAt": "2021-09-30T17:24:03Z", "content": "(CNN)Donald Trump's super PAC has severed ties with Republican operative Corey Lewandowski following reports that a donor accused the former Trump campaign manager of making unwanted sexual advances … [+2026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "2024 came early for Kristi Noem. And not in a good way.", "description": "With great power comes great responsibility. And a whole lot of scrutiny.", "url": "https://www.cnn.com/2021/09/30/politics/corey-lewandowski-kristi-noem-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210227195703-cpac-kristi-noem-0227-super-tease.jpg", "publishedAt": "2021-09-30T16:43:15Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Navient is quitting the federal student loan business", "description": "Embattled student loan servicer Navient announced this week that it is getting out of the federal student loan business, pending government approval.", "url": "https://www.cnn.com/2021/09/30/politics/navient-student-loans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200707101823-us-college-graduation-file-super-tease.jpg", "publishedAt": "2021-09-30T16:43:12Z", "content": "Washington (CNN)Embattled student loan servicer Navient announced this week that it is getting out of the federal student loan business, pending government approval.\r\nIf it gets the authorization, ab… [+2527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol and Jason Cipriani", "title": "The best tablets of 2021", "description": "Whether you're looking for a portable media experience or a powerful, lightweight laptop replacement for travel, a tablet can fit the bill. These increasingly do-it-all devices can handle work and play, and even replace a laptop. After months of testing, we'v…", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/best-tablets/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210921222249-3-9th-gen-ipad-review-underscored.jpg?q=x_0,y_0,h_2108,w_3746,c_fill/w_800", "publishedAt": "2021-09-30T16:42:11Z", "content": "Whether youre looking for a portable media experience or a powerful, lightweight laptop replacement for travel, a tablet can fit the bill. These increasingly do-it-all devices can handle work and pla… [+17629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Cori Bush shares personal story of sexual assault as a teenager and decision to have an abortion", "description": "Rep. Cori Bush on Thursday shared her personal experience of how she was raped as a teenager, became pregnant and chose to get an abortion.", "url": "https://www.cnn.com/2021/09/30/politics/cori-bush-sexual-assault-abortion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930123245-01-cori-bush-testifies-0930-super-tease.jpg", "publishedAt": "2021-09-30T16:36:43Z", "content": "(CNN)Rep. Cori Bush on Thursday shared her personal experience of how she was raped as a teenager, became pregnant and chose to get an abortion.\r\nIt was one of the first times that Bush, a Missouri D… [+3415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Hormone replacement therapy not linked to an increased risk of developing dementia, study finds", "description": "Hormone replacement therapy (HRT) is, for the most part, not linked with an increased risk of developing dementia, according to a large study of women in the United Kingdom.", "url": "https://www.cnn.com/2021/09/30/health/hormone-replacement-therapy-menopause-hrt-dementia-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929124126-hormone-replacement-therapy-pills-stock-super-tease.jpg", "publishedAt": "2021-09-30T16:20:40Z", "content": "(CNN)Hormone replacement therapy (HRT) is, for the most part, not linked with an increased risk of developing dementia, according to a large study of women in the United Kingdom. \r\nHowever, the study… [+6633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico", "title": "The top podcast equipment for getting started — and expert tips from the pros", "description": "Here are our recommendations for the best podcast equipment, as well as tips from the experts on creating a great show.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/best-podcast-equipment/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210930101040-underscored-best-podcast-equipment-lead.jpg?q=x_0,y_0,h_1299,w_2308,c_fill/w_800", "publishedAt": "2021-09-30T16:14:27Z", "content": "Looking to start your own podcast? Whether you want to catch people up on the days news, give them a laugh or take them down a deep true crime rabbit hole, creating a quality audio program is easier … [+11003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Mansour, CNN", "title": "Back and hip stretches for a more comfortable night's sleep", "description": "This bedtime stretch routine relaxes the back and hips. These stretches from fitness expert Stephanie Mansour will help you sleep more comfortably.", "url": "https://www.cnn.com/2021/09/30/health/hip-stretches-back-stretches-better-sleep-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927212525-05-hip-stretches-back-stretches-better-sleep-wellness-super-tease.jpg", "publishedAt": "2021-09-30T16:06:35Z", "content": "Want the best sleep of your life? Sign up for the Sleep, But Better newsletter series for helpful hints to achieve better sleep. \r\n (CNN)Does your back feel sore as you lie down in bed, or do your hi… [+3599 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Venom: Let There Be Carnage' could use some brains in more ways than one", "description": "Two head-chomping symbiotes aren't better than one in \"Venom: Let There Be Carnage,\" a mind-numbingly tiresome sequel, filled with uninspired comedy and a CGI monster fight that seems to drag on forever. Although this falls under the Sony umbrella, it represe…", "url": "https://www.cnn.com/2021/09/30/entertainment/venom-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928195034-01-venom-carnage-super-tease.jpg", "publishedAt": "2021-09-30T15:44:16Z", "content": "(CNN)Two head-chomping symbiotes aren't better than one in \"Venom: Let There Be Carnage,\" a mind-numbingly tiresome sequel, filled with uninspired comedy and a CGI monster fight that seems to drag on… [+2530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Problem With Jon Stewart' takes a serious leap into advocacy journalism", "description": "Emerging from his TV hibernation, Jon Stewart has taken John Oliver's deep-dive format into a single issue and gone a step further in \"The Problem With Jon Stewart.\" If \"The Daily Show\" offered a satirical spin on the news, this Apple TV+ series is essentiall…", "url": "https://www.cnn.com/2021/09/30/entertainment/the-problem-with-jon-stewart-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929150513-01-the-problem-with-jon-stewart-super-tease.jpg", "publishedAt": "2021-09-30T15:42:59Z", "content": "(CNN)Emerging from his TV hibernation, Jon Stewart has taken John Oliver's deep-dive format into a single issue and gone a step further in \"The Problem With Jon Stewart.\" If \"The Daily Show\" offered … [+3398 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tanya Edwards and Tanya Edwards", "title": "We tried Jill, the company that's normalizing female facial shaving", "description": "If you haven't tried dermaplaning yet, you've probably at least heard of it — I first heard it mentioned on \"The Real Housewives of New Jersey\" of all places. For those who are unfamiliar, \"Dermaplaning is basically shaving the face to both exfoliate the skin…", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/jill-female-face-razor-subscription/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210927114559-jill-female-face-razor-subscription-lead.jpg?q=x_2,y_0,h_900,w_1599,c_crop/w_800", "publishedAt": "2021-09-30T15:37:19Z", "content": "If you havent tried dermaplaning yet, youve probably at least heard of it I first heard it mentioned on The Real Housewives of New Jersey of all places. For those who are unfamiliar, Dermaplaning is … [+5053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Elizabeth Alexander", "title": "The big problem with America's monuments", "description": "Last fall, the Andrew W. Mellon Foundation launched the Monuments Project, a $250 million initiative to better understand and improve America's commemorative landscape -- the monuments, statues and memorials across the country that tell our collective history…", "url": "https://www.cnn.com/2021/09/30/opinions/big-problem-with-americas-monuments-alexander/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210909173719-02-week-in-photos-0909-super-tease.jpg", "publishedAt": "2021-09-30T15:31:03Z", "content": "Elizabeth Alexander is a poet, scholar and president of The Andrew W. Mellon Foundation -- the largest funder of arts, culture and humanities in the nation. The opinions expressed in this commentary … [+4578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden faces a reckoning on his agenda as top aides start to temper expectations", "description": "President Joe Biden faced a reckoning Thursday as his aides began to tamp down expectations for quick passage of his sweeping domestic agenda after efforts to broker compromise between warring factions of his party appeared to fall short.", "url": "https://www.cnn.com/2021/09/30/politics/biden-infrastructure-agenda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210923095045-01-joe-biden-0825-super-tease.jpg", "publishedAt": "2021-09-30T15:18:47Z", "content": "(CNN)President Joe Biden faced a reckoning Thursday as his aides began to tamp down expectations for quick passage of his sweeping domestic agenda after efforts to broker compromise between warring f… [+4708 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Facebook grilled by Senate over company's impact on kids", "description": "A Facebook executive is set to be grilled by Senators on Thursday about the impact its apps have on younger users, two weeks after an explosive report indicated the company was aware that Facebook-owned Instagram could have a \"toxic\" effect on teen girls.", "url": "https://www.cnn.com/2021/09/30/tech/facebook-senate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930085423-antigone-davis-file-super-tease.jpg", "publishedAt": "2021-09-30T15:18:36Z", "content": "(CNN Business)A Facebook executive is set to be grilled by Senators on Thursday about the impact its apps have on younger users, two weeks after an explosive report indicated the company was aware th… [+2723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Scottie Andrew, CNN", "title": "The original 'Scream' house is on Airbnb -- and you can book a stay on Halloween", "description": "If you like scary movies -- so much that you'd want to live inside of one for a night -- you're in luck this October. Airbnb is offering \"Scream\" superfans a stay at the home where much of the original film took place -- and where Ghostface was first defeated.", "url": "https://www.cnn.com/travel/article/scream-house-airbnb-halloween-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930102200-01-airbnb-scream-super-tease.jpg", "publishedAt": "2021-09-30T15:14:03Z", "content": "(CNN) If you like scary movies -- so much that you'd want to live inside of one for a night -- you're in luck this October. Airbnb is offering \"Scream\" superfans a stay at the home where much of the … [+2223 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianne Ross", "title": "20 Amazon products our readers were obsessed with in September", "description": "From earbuds to reusable food wraps, check out the 20 products Underscored readers loved most in September.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/underscored-favorite-amazon-products-september-2021/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210908115742-beeswraplead.jpg?q=x_0,y_0,h_1406,w_2498,c_fill/w_800", "publishedAt": "2021-09-30T15:06:54Z", "content": "Curious about what your fellow CNN Underscored readers are buying? Every month well round up our readers favorite products those products readers like you scooped up the most over the past 30 days.\r\n… [+3589 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best online sales today: Apple AirPods Max, Instant Pot, Oxo and more", "description": "Today, you'll find a deal on Apple AirPods Max, Oxo gadgets and savings on Marmot. All that and more below.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210930102440-0930lead.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "publishedAt": "2021-09-30T15:05:03Z", "content": "Today, youll find a deal on Apple AirPods Max, Oxo gadgets and savings on Marmot. All that and more below.\r\nApples AirPods Max made quite a splash when they hit the headphones scene at the end of 202… [+8586 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Expo 2020 Dubai: Live from the opening ceremony", "description": "Watch live as Expo 2020 Dubai kicks off.", "url": "https://www.cnn.com/world/live-news/expo-2020-dubai-opening-ceremony-live-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929122029-restricted-expo-2020-sustainability-pavilion-live-blog-card-super-tease.jpg", "publishedAt": "2021-09-30T15:01:24Z", "content": "Years in the making, and delayed 12 months by the Covid pandemic, Expo 2020 Dubai is here. \r\nFirst held in London in 1851, World Expos have long been a place to unveil new ideas and technology, and D… [+262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what's streaming in October", "description": "A look at some of the series and films streaming on Netflix, Amazon Prime, Disney+, Hulu and more in September.", "url": "https://www.cnn.com/2021/09/30/entertainment/gallery/new-october-streaming-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928132947-08-october-streaming-2021-muppets-haunted-mansion-super-tease.jpg", "publishedAt": "2021-09-30T14:59:55Z", "content": "Just in time for Halloween, Disney+ has our favorite with the \"Muppets Haunted Mansion\" special. It's just one of the great streaming options in October.\r\nUpdated 10:59 AM ET, Thu September 30, 2021\r… [+266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Henderson and Claudia Dominguez, CNN", "title": "Meeting involving South Dakota Gov. Kristi Noem, her daughter, and state labor and regulation employees to be reviewed by state authorities", "description": "A July 2020 meeting between Republican South Dakota Gov. Kristi Noem, her daughter and state labor and regulation employees will be reviewed by state authorities following a report that the meeting was called at the same time Noem's daughter was seeking a sta…", "url": "https://www.cnn.com/2021/09/30/politics/kristi-noem-south-dakota-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711152015-kristi-noem-cpac-2021-0711-super-tease.jpg", "publishedAt": "2021-09-30T14:58:42Z", "content": "(CNN)A July 2020 meeting between Republican South Dakota Gov. Kristi Noem, her daughter and state labor and regulation employees will be reviewed by state authorities following a report that the meet… [+4138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Ashish Prashar", "title": "Opinion: Prisoners freed because of Covid face a troubling fate", "description": "Recognizing the dire health risks incarcerated individuals faced in overcrowded federal prisons from Covid-19, the Bureau of Prisons allowed thousands of people to complete their sentences from home over the past year. It was part of a directive under the CAR…", "url": "https://www.cnn.com/2021/09/30/opinions/cares-act-home-confinement-biden-prashar/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200912113317-prison-cell-bars-with-male-adult-stock-super-tease.jpg", "publishedAt": "2021-09-30T14:55:00Z", "content": "Ashish Prashar is the global chief marketing officer at R/GA, a marketing and advertising company, and a justice reform activist. He sits on the boards of Exodus Transitional Community, Getting Out a… [+5406 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Read in full: Lord Justice Fulford's full remarks on Wayne Couzens sentencing, and family impact statements", "description": "Here are the sentencing remarks of Lord Justice Fulford as he handed Wayne Couzens a whole life order at the Old Bailey, as provided in full by the Judicial Office. Following those are the comments by Sarah Everard's family in court:", "url": "https://www.cnn.com/2021/09/30/uk/wayne-couzens-sentencing-sarah-everard-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930094125-02-sarah-everard-super-tease.jpg", "publishedAt": "2021-09-30T14:46:04Z", "content": "(CNN)Here are the sentencing remarks of Lord Justice Fulford as he handed Wayne Couzens a whole life order at the Old Bailey, as provided in full by the Judicial Office. Following those are the comme… [+32089 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Adie Vanessa Offiong, CNN", "title": "Explainer: What is femicide and how bad is it globally?", "description": "Before the murder of Sabina Nessa, a 28-year-old primary school teacher killed in London, some were already speaking of a \"femicide epidemic.\" But what is femicide?", "url": "https://www.cnn.com/2021/09/30/world/femicide-explainer-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210923041500-sabina-nessa-super-tease.jpg", "publishedAt": "2021-09-30T14:42:55Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)Beforethe murder of Sabina Nessa, a 28-… [+8526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jacob J. Lew for CNN Business Perspectives", "title": "Opinion: How to get the wealthy to pay the taxes they owe, according to a former US Treasury Secretary", "description": "Imagine you're out to dinner. At the end of the meal, you pay your bill, which helps meet the restaurant's food, rent and wage costs. But some customers slip out without paying. They disappear into the night, leaving the business to pay the same expenses with…", "url": "https://www.cnn.com/2021/09/30/perspectives/jack-lew-wealthy-taxes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308152450-1040-tax-form-stock-super-tease.jpg", "publishedAt": "2021-09-30T14:00:58Z", "content": "Jacob J. Lew served as U.S. Treasury Secretary from 2013 to 2017. The opinions expressed in this commentary are his own. \r\nImagine you're out to dinner. At the end of the meal, you pay your bill, whi… [+4143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Remsen, CNN", "title": "Unapologetically unfiltered, Rick Owens is fashion's ultimate antagonist", "description": "Paris-based designer Rick Owens has been called many things in his long career. An antihero, a goth, fashion's \"prince of darkness.\" He's been labeled as such because of his proclivity for a largely noir, gray and ice-hued oeuvre, his deployment of pentagram …", "url": "https://www.cnn.com/style/article/rick-owens-paris-fashion-week/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930075440-04-rick-owens-paris-fashion-week-super-tease.jpg", "publishedAt": "2021-09-30T13:52:30Z", "content": "fashionPublished 30th September 2021\r\nCNN Style is one of the official media partners of Paris Fashion Week. See all coverage here.\r\nParis-based designer Rick Owens has been called many things in his… [+7006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: Is Liz Cheney going to run for president?", "description": "Liz Cheney is going to New Hampshire.", "url": "https://www.cnn.com/2021/09/30/politics/liz-cheney-new-hampshire-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512144208-09-liz-cheney-0512-super-tease.jpg", "publishedAt": "2021-09-30T13:49:02Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "We tried Tushy's fancy new bidet. Here's what we thought.", "description": "Tushy, the witty bidet brand you've probably seen all over your social media, has made a name for itself with its easy-to-use bidet attachment perfect for beginners. But now, the brand has released a new bidet that's a huge step up from the bidet attachments …", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/tushy-ace-electric-bidet-review/index.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rss%2Fcnn_latest+%28RSS%3A+CNN+-+Most+Recent%29", "urlToImage": null, "publishedAt": "2021-09-30T13:36:10Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "23 genius space-saving furniture pieces for your home", "description": "From sofa beds to nesting tables and corner desks, this is the sort of innovative furniture that can transform a small space.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/small-space-furniture/index.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rss%2Fcnn_latest+%28RSS%3A+CNN+-+Most+Recent%29", "urlToImage": null, "publishedAt": "2021-09-30T13:31:29Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "19 North Face basics you're going to be glad you bought for fall", "description": "It's time to transition into fall, and that chill in the air means one (okay two) things: Jackets and fleece. We found the best jackets and fleece over at The North Face to keep you cozy all season.", "url": "https://www.cnn.com/2021/09/30/cnn-underscored/north-face-fall-essentials/index.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rss%2Fcnn_latest+%28RSS%3A+CNN+-+Most+Recent%29", "urlToImage": null, "publishedAt": "2021-09-30T13:29:22Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "8 ways that getting jabbed gives you the travel edge", "description": "From a bigger list of foreign destinations to more access to attractions, here are eight ways fully vaccinated tourists enjoy the travel edge.", "url": "https://www.cnn.com/travel/article/fully-vaccinated-tourists-travel-edge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929214130-06-travel-edge-vaccination-st-lucia-super-tease.jpg", "publishedAt": "2021-09-30T13:27:47Z", "content": "(CNN) Stock traders seek it. Athletes crave it. And it's something that can help tourists as they navigate the pandemic.\r\nIt's \"the edge\" -- a desirable advantage that puts you ahead of the game. And… [+9536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "18-hour days and panic attacks: Former Ozy staffers allege an abusive environment", "description": "Interviews with nine former Ozy employees suggest a pervasive trend of staffers being worked to the point of exhaustion or worse.", "url": "https://www.cnn.com/2021/09/30/media/ozy-work-culture/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928103232-02-carlos-watson-ozy-file-super-tease.jpg", "publishedAt": "2021-09-30T13:00:24Z", "content": "New York (CNN Business)Around midnight one Saturday late last year, Eva Rodriguez, 24, had trouble breathing. She lost her vision, started sweating and felt a sharp pain in her stomach. She worried s… [+10689 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Lewis, CNN", "title": "Meet the South African carpenter turning skateboards into sunglasses", "description": "Using old recycled skateboard decks, Dave De Witt is turning a piece of his favorite sport into wearable fashion.", "url": "https://www.cnn.com/2021/09/30/africa/sk8shades-dave-de-witt-south-africa-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927120253-01-sk8shades-sunglasses-super-tease.jpg", "publishedAt": "2021-09-30T12:59:17Z", "content": "(CNN)Skateboarding in South Africa may be historically overshadowed by surfing, especially in a town like Durban, also known as \"Surf City.\" But for Dave De Witt, it was no contest.\r\n\"It was colorful… [+890 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "Congress races to avert a government shutdown", "description": "Today is the last day for Congress to get some sort of stopgap bill in order to avoid a government shutdown at midnight. Follow here for the latest news on Capitol Hill.", "url": "https://www.cnn.com/politics/live-news/government-shutdown-congress-infrastructure-vote-09-30-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807223532-us-capitol-0807-super-tease.jpg", "publishedAt": "2021-09-30T12:39:44Z", "content": "Government funding expires at midnight and Congress has not yet passed a stopgap funding bill to avert a shutdown, though Democratic leaders are on track to do so later Thursday.\r\nLawmakers are racin… [+1319 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly and Lauren Fox, CNN", "title": "Biden and Democratic leaders' path forward vanishing after failing to make an infrastructure deal", "description": "There is no deal. There is no commitment. There is no framework. There may be no vote because, barring some dramatic change, there aren't the votes.", "url": "https://www.cnn.com/2021/09/30/politics/biden-democrats-state-of-play-september-30/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930051040-us-capitol-0929-super-tease.jpg", "publishedAt": "2021-09-30T12:38:51Z", "content": "(CNN)There is no deal. There is no commitment. There is no framework. There may be no vote because, barring some dramatic change, there aren't the votes. \r\nPresident Joe Biden, Speaker Nancy Pelosi a… [+11409 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Wall Street revels in the biggest IPO boom in decades", "description": "A resilient stock market, fueled by central bank and government stimulus, is pushing a record number of companies to raise money by offering shares on public markets. That's been a huge boon for the Wall Street banks orchestrating the deals.", "url": "https://www.cnn.com/2021/09/30/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930073559-on-shoes-ipo-0915-super-tease.jpg", "publishedAt": "2021-09-30T12:21:18Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)A resilient stock market, fueled by central ban… [+7385 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "A scary portrait of life inside Trump's White House", "description": "The indelible image that emerges via experts from Stephanie Grisham's book, the latest tell-all about the Trump White House, is of a President plagued by insecurities and unmoored from morality, writes Frida Ghitis. It's an amusing retrospective of a bizarre …", "url": "https://www.cnn.com/2021/09/30/opinions/trump-white-house-stephanie-grisham-book-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200407100829-stephanie-grisham-trump-file-super-tease.jpg", "publishedAt": "2021-09-30T11:42:34Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washington Post and a c… [+7214 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicquel Terry Ellis, CNN", "title": "'I'm passed angry': Police shooting victims' families, civil rights leaders condemn failed police reform talks", "description": "Bridgett Floyd said she could barely find the words to describe her disappointment in lawmakers for failing to pass sweeping police reform legislation that bears her brother George Floyd's name.", "url": "https://www.cnn.com/2021/09/30/us/george-floyd-police-reform-victims-families/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929162559-bridgett-floyd-file-super-tease.jpg", "publishedAt": "2021-09-30T11:36:00Z", "content": "(CNN)Bridgett Floyd said she could barely find the words to describe her disappointment in lawmakers for failing to pass sweeping police reform legislation that bears her brother George Floyd's name.… [+7813 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ritchie and Ivana Kottasová, CNN", "title": "Ex-UK police officer who murdered Sarah Everard gets life in prison with no chance of parole", "description": "Wayne Couzens, the former London police officer who has admitted to the kidnap, rape and murder of Sarah Everard, has been sentenced to life in prison without the possibility of parole, an exceptional sentence in the United Kingdom.", "url": "https://www.cnn.com/2021/09/30/europe/sarah-everard-murder-wayne-couzens-sentencing-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929065533-wayne-couzens-mugshot-super-tease.jpg", "publishedAt": "2021-09-30T11:18:26Z", "content": "London (CNN)Wayne Couzens, the former London police officer who has admitted to the kidnap, rape and murder of Sarah Everard, has been sentenced to life in prison without the possibility of parole, a… [+1537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan, CNN", "title": "Compassionate release became a life-or-death lottery for thousands of federal inmates during the pandemic", "description": "The assessment was dire: Horacio Estrada-Elias had \"less than 18 months\" left to live, his prison doctor wrote last year in a document submitted with the 90-year-old inmate's request for compassionate release.", "url": "https://www.cnn.com/2021/09/30/us/covid-prison-inmates-compassionate-release-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928130152-20210928-compassionate-release-lottery-pandemic-super-tease.jpg", "publishedAt": "2021-09-30T11:05:09Z", "content": "(CNN)The assessment was dire: Horacio Estrada-Elias had \"less than 18 months\" left to live, his prison doctor wrote last year in a document submitted with the 90-year-old inmate's request for compass… [+20567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Labor Secretary Marty Walsh opens up about his sobriety as the nation faces addiction crisis during Covid-19 pandemic", "description": "Marty Walsh chose to go to an alcohol detox program in 1995. But even after committing to it, he was questioning his decision.", "url": "https://www.cnn.com/2021/09/30/politics/marty-walsh-national-recovery-month/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928164128-sec-marty-walsh-super-tease.jpg", "publishedAt": "2021-09-30T11:04:51Z", "content": "(CNN)Marty Walsh chose to go to an alcohol detox program in 1995. But even after committing to it, he was questioning his decision.\r\n\"I didn't want to go to detox. ... When I got there, I thought to … [+5908 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden administration grapples with American addiction as overdose deaths hit a record high", "description": "With a growing number of Americans dying from drug overdoses and concerns over addiction rising, the Biden administration has found itself facing a nationwide crisis that keeps escalating as the Covid-19 pandemic drags on.", "url": "https://www.cnn.com/2021/09/30/politics/biden-administration-drug-epidemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210503134454-oxycodon-pills-file-super-tease.jpg", "publishedAt": "2021-09-30T11:03:56Z", "content": "(CNN)With a growing number of Americans dying from drug overdoses and concerns over addiction rising, the Biden administration has found itself facing a nationwide crisis that keeps escalating as the… [+8317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "His art is worth millions but George Condo is set on 'eliminating' his signature style", "description": "More than four decades into one of American art's most enduring and successful careers, George Condo is reinventing himself.", "url": "https://www.cnn.com/style/article/george-condo-artist-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928110610-12-george-condo-hauser--wirth-2021-super-tease.jpg", "publishedAt": "2021-09-30T10:39:00Z", "content": "artsPublished 30th September 2021\r\nEach morning this past summer, artist George Condo arrived at his New York studio, turned on the same John Coltrane \"Live in Sweden\" CD that he's worked to for year… [+7318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "Biden nominates 10 more to federal bench, with continued focus on diversity", "description": "President Joe Biden on Thursday named 10 nominees to the federal bench, continuing his efforts to diversify the judicial branch with picks who would notch demographic firsts on their respective courts.", "url": "https://www.cnn.com/2021/09/30/politics/federal-judicial-nominees-joe-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210924102658-02-biden-covid-remarks-0924-super-tease.jpg", "publishedAt": "2021-09-30T10:24:44Z", "content": "(CNN)President Joe Biden on Thursday named 10 nominees to the federal bench, continuing his efforts to diversify the judicial branch with picks who would notch demographic firsts on their respective … [+2801 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "German 96-year-old Nazi war crimes suspect flees ahead of trial", "description": "A 96-year-old German woman fled ahead of the opening on Thursday of her trial on charges of aiding and abetting mass murder in a Nazi concentration camp during World War II, a court spokesperson said.", "url": "https://www.cnn.com/2021/09/30/europe/german-96-year-old-nazi-intl-grm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930061223-01-nazi-concentration-camp-guard-trial-0930-super-tease.jpg", "publishedAt": "2021-09-30T10:06:34Z", "content": "(CNN)A 96-year-old German woman fled ahead of the opening on Thursday of her trial on charges of aiding and abetting mass murder in a Nazi concentration camp during World War II, a court spokesperson… [+614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "'The future belongs to us': NextGen America launches $32 million program to turn out young voters in 2022", "description": "With just over a year until the 2022 midterm elections, NextGen America -- the progressive youth voter engagement organization -- is launching a $32 million program to engage young voters across eight states.", "url": "https://www.cnn.com/2021/09/30/politics/nextgen-america-2022-investment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929192116-restricted-election-voted-stickers-texas-2020-super-tease.jpg", "publishedAt": "2021-09-30T10:01:34Z", "content": "Washington, DC (CNN)With just over a year until the 2022 midterm elections, NextGen America -- the progressive youth voter engagement organization -- is launching a $32 million program to engage youn… [+4148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jeevan Ravindran, CNN", "title": "Cave chamber closed for 40,000 years could hold the key to the lives of Neanderthals", "description": "The discovery of a chamber at least 40,000 years old in a Gibraltar cave previously inhabited by Neanderthals could lead to groundbreaking new finds about their lifestyles, according to researchers.", "url": "https://www.cnn.com/travel/article/neanderthals-cave-gibraltar-scn-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928115722-01-neanderthals-cave-gibraltar-scn-scli-intl-super-tease.jpg", "publishedAt": "2021-09-30T09:35:38Z", "content": "(CNN) The discovery of a chamber at least 40,000 years old in a Gibraltar cave previously inhabited by Neanderthals could lead to groundbreaking new finds about their lifestyles,according to research… [+2713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Monica Lewinsky details mental health struggles she endured during Clinton affair scandal", "description": "Monica Lewinsky reflected on the mental health struggles she endured in the 1990s amid the scandal surrounding her affair with then-President Bill Clinton, detailing in a new interview the toll it took and how she has reclaimed her story in the years since.", "url": "https://www.cnn.com/2021/09/30/politics/monica-lewinsky-axe-files/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929221110-01-monica-lewinsky-file-2019-super-tease.jpg", "publishedAt": "2021-09-30T09:06:51Z", "content": "Washington (CNN)Monica Lewinsky reflected on the mental health struggles she endured in the 1990s amid the scandal surrounding her affair with then-President Bill Clinton, detailing in a new intervie… [+3192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "Lawmakers race the clock to avert shutdown ahead of midnight deadline", "description": "Government funding expires at midnight and Congress has not yet passed a stopgap funding bill to avert a shutdown, though Democratic leaders are on track to do so later Thursday.", "url": "https://www.cnn.com/2021/09/30/politics/government-shutdown-deadline-congress-votes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210923130011-schumer-yellen-pelosi-presser-0923-super-tease.jpg", "publishedAt": "2021-09-30T09:02:49Z", "content": "(CNN)Government funding expires at midnight and Congress has not yet passed a stopgap funding bill to avert a shutdown, though Democratic leaders are on track to do so later Thursday.\r\nLawmakers are … [+2224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "'Aladdin' Broadway show cancels performance due to Covid-19 one night after official return", "description": "The \"Aladdin\" performance on Broadway was canceled Wednesday night after the theater company learned of some Covid-19 breakthrough cases.", "url": "https://www.cnn.com/2021/09/30/entertainment/aladdin-broadway-show-canceled-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929222036-aladdin-broadway-file-2020-restricted-super-tease.jpg", "publishedAt": "2021-09-30T08:37:04Z", "content": "(CNN)A performance of Disney's \"Aladdin\" on Broadway was canceled Wednesday -- one night after the show's return to the theater -- because of Covid-19 cases detected in the theater company, show runn… [+2059 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Westcott and Chandler Thornton, CNN", "title": "Covid surge after some Australians break lockdown to celebrate country's biggest football event of the year", "description": "Fans who gathered to watch two Victoria-based rivals play in one of Australia's top sporting events are partly to blame for a more than 50% increase in the state's daily reported Covid-19 cases, local officials said Thursday.", "url": "https://www.cnn.com/2021/09/30/australia/victoria-covid-grand-final-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930010638-australian-football-league-final-0925-super-tease.jpg", "publishedAt": "2021-09-30T07:14:52Z", "content": "(CNN)Fans who gathered to watch two Victoria-based rivals play in one of Australia's top sporting events are partly to blame for a more than 50% increase in the state's daily reported Covid-19 cases,… [+2428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Princess Diana's former London apartment is now an official tourist site", "description": "The London apartment where Diana Spencer lived before she became the Princess of Wales has been commemorated with an official blue plaque.", "url": "https://www.cnn.com/travel/article/princess-diana-london-apartment-blue-plaque-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930002617-princess-diana-apartment-plaque-0929-restricted-super-tease.jpg", "publishedAt": "2021-09-30T06:41:54Z", "content": "Lilit Marcus, CNNPublished 30th September 2021\r\n(CNN) The London apartment where Diana Spencer lived before she became the Princess of Wales has been commemorated with an official blue plaque.\r\nThe p… [+2676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "For the first time since June, the number of projected Covid-19 deaths in the US is decreasing", "description": "For the first time since June, the rate of new Covid-19 deaths in the US is expected to decrease over the next four weeks, according to an ensemble forecast from the Centers for Disease Control and Prevention (CDC).", "url": "https://www.cnn.com/2021/09/30/health/us-coronavirus-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929235401-houston-covid-19-0824-super-tease.jpg", "publishedAt": "2021-09-30T05:51:18Z", "content": "(CNN)For the first time since June, the rate of new Covid-19 deaths in the US is expected to decrease over the next four weeks, according to an ensemble forecast from the Centers for Disease Control … [+5963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "Beijing will open next year's Winter Olympics to fans -- but only if they live in China", "description": "The Beijing 2022 Winter Olympics will be open to spectators -- but only if they live in mainland China, the International Olympic Committee (IOC) said Wednesday, as organizers gave a first glimpse into the country's plans to hold the event while enforcing a s…", "url": "https://www.cnn.com/2021/09/30/sport/beijing-winter-olympics-covid-measures-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929232546-01-beijing-winter-olympics-motto-ceremony-0917-super-tease.jpg", "publishedAt": "2021-09-30T05:27:18Z", "content": "Hong Kong (CNN)The Beijing 2022 Winter Olympics will be open to spectators -- but only if they live in mainland China, the International Olympic Committee (IOC) said Wednesday, as organizers gave a f… [+3065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jake Kwon and Helen Regan, CNN", "title": "Kim Yo Jong, sister of North Korean leader, promoted to nation's top ruling body", "description": "Kim Yo Jong, the younger sister of North Korean leader Kim Jong Un, has been promoted to the nation's top decision-making body, state media said on Thursday.", "url": "https://www.cnn.com/2021/09/30/asia/kim-yo-jong-promoted-leadership-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929222703-kim-yo-jong-2019-super-tease.jpg", "publishedAt": "2021-09-30T04:35:36Z", "content": "Seoul, South Korea (CNN)Kim Yo Jong, the younger sister of North Korean leader Kim Jong Un, has been promoted to the nation's top decision-making body, state media said on Thursday.\r\nThe announcement… [+3463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Pelosi faces her toughest moment of truth yet", "description": "Democrats have an almost mystical faith in Nancy Pelosi's ability to count votes, corral her caucus and pass historic legislation. But her reputation is facing its toughest test as the House speaker, trapped between progressive and moderate Democrats, struggl…", "url": "https://www.cnn.com/2021/09/30/politics/nancy-pelosi-congress-biden-joe-manchin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210722105247-nancy-pelosi-july-22-2021-super-tease.jpeg", "publishedAt": "2021-09-30T04:08:11Z", "content": "(CNN)Democrats have an almost mystical faith in Nancy Pelosi's ability to count votes, corral her caucus and pass historic legislation. But her reputation is facing its toughest test as the House spe… [+8094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Coren, Sandi Sidhu, Julia Hollingsworth and Ahmet Mengli, CNN", "title": "The US apologized for the drone strike that killed 10 family members. But one month on, little has changed", "description": "The Ahmadi family say they are yet to receive any word from the US military, let alone any compensation, one month after a drone strike killed 10 members of their family in Kabul, Afghanistan.", "url": "https://www.cnn.com/2021/09/30/asia/afghanistan-kabul-drone-strike-family-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929015733-04-kabul-afghanistan-family-super-tease.jpg", "publishedAt": "2021-09-30T04:06:18Z", "content": "By Anna Coren, Sandi Sidhu, Julia Hollingsworth and Ahmet Mengli, CNN\r\nUpdated 12:06 AM ET, Thu September 30, 2021\r\nKabul, Afghanistan (CNN)Every day for the past month, Emal Ahmadi's 7-year-old daug… [+9498 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Rohingya leader shot dead in refugee camp", "description": "Gunmen shot and killed a prominent Rohingya Muslim leader in a refugee camp in southern Bangladesh on Wednesday, a United Nations spokesperson and a local police official said, following months of worsening violence in the world's largest refugee settlement.", "url": "https://www.cnn.com/2021/09/29/asia/bangladesh-rohingya-leader-shot-dead-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929224731-mohib-ullah-file-2020-super-tease.jpg", "publishedAt": "2021-09-30T02:56:04Z", "content": "Gunmen shot and killed a prominent Rohingya Muslim leader in a refugee camp in southern Bangladesh on Wednesday, a United Nations spokesperson and a local police official said, following months of wo… [+2254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "A former Boston ballerina and her husband have been accused of sexually abusing young dancers, according to a federal lawsuit", "description": "Former Boston Ballet star Dusty Button and her husband, Mitchell Taylor Button, are accused of sexually abusing several dancers, including a minor, according to a federal lawsuit.", "url": "https://www.cnn.com/2021/09/29/us/ballerina-dusty-button-husband-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929201658-restricted-dusty-button-2013-super-tease.jpg", "publishedAt": "2021-09-30T01:46:27Z", "content": "(CNN)Former Boston Ballet star Dusty Button and her husband, Mitchell Taylor Button, are accused of sexually abusing several dancers, including a minor, according to a federal lawsuit. \r\nTaylor Butto… [+3301 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Brewers pitcher likely out for postseason after punching wall with throwing hand", "description": "Milwaukee Brewers star relief pitcher Devin Williams will likely miss the postseason because of a fractured hand after the player says he struck a wall in frustration.", "url": "https://www.cnn.com/2021/09/29/us/brewers-pitcher-devin-williams-wall-punch-injury-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929192935-devin-williams-0927-super-tease.jpg", "publishedAt": "2021-09-30T00:08:14Z", "content": "(CNN)Milwaukee Brewers star relief pitcher Devin Williams will likely miss the postseason because of a fractured hand after the player says he struck a wall in frustration.\r\nWilliams told reporters o… [+1057 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon and Abel Alvarado", "title": "Over 100 killed in Ecuador prison massacre", "description": "Over 100 people have died in a prison massacre that erupted yesterday in Ecuador, the country's prison agency said Wednesday. At least 52 people were injured, it also said.", "url": "https://www.cnn.com/2021/09/29/americas/ecuador-prison-deaths-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929182943-01-ecuador-prison-riot-0928-super-tease.jpg", "publishedAt": "2021-09-29T22:51:37Z", "content": "(CNN)Over 100 people have died in a prison massacre that erupted yesterday in Ecuador, the country's prison agency said Wednesday. At least 52 people were injured, it also said. \r\nThe death toll repr… [+1301 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "'I'm trying to stay apolitical.' Top US general faces wave of GOP attacks over Trump-era actions", "description": "Top US General Mark Milley appeared before Congress this week to defend Pentagon decision making in Afghanistan but instead found himself fighting a personal battle with lawmakers who charged that he has been more preoccupied with rehabilitating and burnishin…", "url": "https://www.cnn.com/2021/09/29/politics/milley-afghanistan-hearings-gop-attacks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929110247-01-house-armed-services-hearing-0929-super-tease.jpg", "publishedAt": "2021-09-29T22:33:38Z", "content": "(CNN)Top US General Mark Milley appeared before Congress this week to defend Pentagon decision making in Afghanistan but instead found himself fighting a personal battle with lawmakers who charged th… [+8981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Dezenski, CNN", "title": "A warning sign for Texas Gov. Greg Abbott", "description": "A new poll finds cause for concern for Texas Gov. Greg Abbott, who is seeking reelection in 2022.", "url": "https://www.cnn.com/2021/09/29/politics/texas-greg-abbott-2022-reelection-poll/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210818102246-greg-abbott-super-tease.jpg", "publishedAt": "2021-09-29T22:32:45Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Phil Mattingly, CNN", "title": "Biden puts 'closer' role to the test with his entire agenda on the line", "description": "President Joe Biden isn't pitching in Wednesday's night's Congressional Baseball Game, where players and spectators alike hold the key to his political fate.", "url": "https://www.cnn.com/2021/09/29/politics/joe-biden-closer-role-tested/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927114501-biden-0926-super-tease.jpg", "publishedAt": "2021-09-29T21:07:39Z", "content": "(CNN)President Joe Biden isn't pitching in Wednesday's night's Congressional Baseball Game, where players and spectators alike hold the key to his political fate.\r\nBut even off the mound, it is clear… [+12818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Manufacturers allowed baby food contaminated with heavy metals to remain on shelves, lawmakers say", "description": "Just months after a congressional investigation found manufacturers have failed to test for toxic metals in the baby foods they sell, lawmakers report that some companies are not testing and removing these products from the marketplace.", "url": "https://www.cnn.com/2021/09/29/health/baby-food-toxins-update-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928133151-baby-eating-rice-cereal-stock-super-tease.jpg", "publishedAt": "2021-09-29T20:51:22Z", "content": "(CNN)Gerber and Beech-Nut failed to properly test and remove baby foods with dangerous levels of inorganic arsenic from the market, while Sprout Foods Inc., Walmart's Parent's Choice and Campbell's P… [+13238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Mandates are boosting vaccination rates, but not without a tradeoff", "description": "Mandates that require employees to be vaccinated against Covid-19 have spurred workers to get vaccinated in recent weeks -- yet some holdouts have been suspended or lost their jobs, and workplaces are scrambling to cover potential shortages.", "url": "https://www.cnn.com/2021/09/29/us/vaccine-mandate-health-care/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927185009-vaccine-protest-super-tease.jpg", "publishedAt": "2021-09-29T20:39:25Z", "content": "(CNN)Mandates that require employees to be vaccinated against Covid-19 have spurred workers to get vaccinated in recent weeks -- yet some holdouts have been suspended or lost their jobs, and workplac… [+7732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Mandates are boosting vaccination rates, but not without a tradeoff", "description": "Mandates that require employees to be vaccinated against Covid-19 have spurred workers to get vaccinated in recent weeks -- yet some holdouts have been suspended or lost their jobs, and workplaces are scrambling to cover potential shortages.", "url": "https://www.cnn.com/2021/09/29/us/vaccine-mandate-health-care/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927185009-vaccine-protest-super-tease.jpg", "publishedAt": "2021-09-29T20:39:25Z", "content": "(CNN)Mandates that require employees to be vaccinated against Covid-19 have spurred workers to get vaccinated in recent weeks -- yet some holdouts have been suspended or lost their jobs, and workplac… [+7732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Amanda Jackson, CNN", "title": "Swimming with Hawaii's spinner dolphins is now banned", "description": "Hawaii residents and tourists will no longer be able to swim or get in close contact with Hawaiian spinner dolphins, according to a new rule by National Oceanic and Atmospheric Administration (NOAA).", "url": "https://www.cnn.com/travel/article/swimming-banned-hawaii-spinner-dolphins-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929154822-file-spinner-dolphins-hawaii-super-tease.jpg", "publishedAt": "2021-09-29T20:36:40Z", "content": "The rule has been years in the making, as biologists have long noticed that the playful mammals have been stressed by human interactions. The nocturnal animal is known to frequent the waters close to… [+1654 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jill Filipovic", "title": "Women are burned out. Men, do your part!", "description": "The pandemic that has sickened and killed so many people has been devastating in other ways, too, writes Jill Filipovic. A new survey from McKinsey and LeanIn.org found that a whopping one-third of women said they were considering quitting their jobs or reduc…", "url": "https://www.cnn.com/2021/09/29/opinions/mckinsey-survey-women-job-loss-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210520191015-work-at-home-mom-stock-super-tease.jpg", "publishedAt": "2021-09-29T20:25:57Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6554 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona and Lauren Fox, CNN", "title": "House Republican leaders mount all-out campaign to sink infrastructure", "description": "House Republican leaders are launching an all-out campaign to sink a bipartisan infrastructure bill, as Democratic leaders struggle to unite their caucus around the legislation ahead of a high-stakes floor vote on Thursday.", "url": "https://www.cnn.com/2021/09/29/politics/republican-reaction-infrastructure-talks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210801105436-kevin-mccarthy-07-22-2021-super-tease.jpg", "publishedAt": "2021-09-29T20:19:29Z", "content": "(CNN)House Republican leaders are launching an all-out campaign to sink a bipartisan infrastructure bill, as Democratic leaders struggle to unite their caucus around the legislation ahead of a high-s… [+6703 chars]"}]}