{"status": "ok", "totalResults": 237, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "So can you hug your grandkids now?", "description": "People who have been vaccinated against Covid-19 can safely enjoy a much more open lifestyle, although still a far cry from what was normal a year ago, according to new and much-anticipated guidance released Monday by the Centers for Disease Control and Preve…", "url": "https://www.cnn.com/2021/03/08/politics/what-matters-march-8/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308165622-johnson-vaccine-vls-super-tease.jpg", "publishedAt": "2021-03-09T01:00:12Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\n (CNN)People who have been vaccinated against Covid-19 can safely enjoy a much more… [+7892 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Children burn masks at rally", "description": "Boise Mayor Lauren McLean reacts to \"Burn the Mask\" rallies held in Idaho over the weekend, and the lawmakers who supported them.", "url": "https://www.cnn.com/videos/politics/2021/03/09/burn-the-mask-rallies-idaho-lauren-mclean-sot-ebof-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308193600-burn-the-mask-rally-super-tease.jpg", "publishedAt": "2021-03-09T00:50:02Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz and Konstantin Toropin, CNN", "title": "A Mexican restaurant in Texas is requiring people to keep wearing masks. Some are threatening to call ICE on the staff", "description": "As Texans looks ahead to the mask mandate ending and businesses reopening fully on Wednesday, one Houston restaurant is dealing with hateful comments because it said it will require customers to keep wearing masks.", "url": "https://www.cnn.com/2021/03/08/us/texas-mexican-restaurant-ice-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308135612-01-picos-restaurant-houston-super-tease.jpg", "publishedAt": "2021-03-09T00:38:36Z", "content": "(CNN)As Texanslooks ahead to the mask mandate ending and businesses reopening fully on Wednesday, one Houston restaurant is dealing with hateful comments because it said it will require customers to … [+4678 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Hear why Rep. Lofgren released social media report on GOP colleagues", "description": "Anderson Cooper talks to Democratic Rep. Zoe Lofgren, who posted a nearly 2,000-page report documenting social media posts by her Republican colleagues who voted against certifying the presidential election results on January 6. Watch \"Full Circle\" every Mond…", "url": "https://www.cnn.com/videos/us/2021/03/08/zoe-lofgren-intv-why-she-released-report-acfc-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308163415-desktop-acfc-zoe-lofgren-march-8-super-tease.jpg", "publishedAt": "2021-03-09T00:32:37Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "Opinion: Meghan and Harry smash the princess story to pieces", "description": "As troubling as they were to hear, Meghan's jaw-dropping claims of disempowerment in her interview with Oprah will likely also send a salutary message we need to hear: becoming a princess is not something our daughters should aspire to, writes Kara Alaimo.  T…", "url": "https://www.cnn.com/2021/03/08/opinions/harry-meghan-princess-story-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308120511-meghan-harry-interniew-super-tease.jpg", "publishedAt": "2021-03-09T00:32:02Z", "content": "Kara Alaimo, an associate professor of public relations at Hofstra University, is the author of \"Pitch, Tweet, or Engage on the Street: How to Practice Global Public Relations and Strategic Communica… [+5286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Kristin Wilson, CNN", "title": "Greene and Freedom Caucus members force delay on votes for non-controversial legislation", "description": "Republican Rep. Marjorie Taylor Greene of Georgia and several members of the House Freedom Caucus made plans Monday night to ask for a roll call vote on a series of suspension bills.", "url": "https://www.cnn.com/2021/03/08/politics/marjorie-taylor-greene-delays-votes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205160109-02-marjorie-taylor-greene-0205-super-tease.jpg", "publishedAt": "2021-03-09T00:26:46Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Rare meteorite that fell on UK driveway may contain 'ingredients for life'", "description": "A fireball that lit up the sky over the United Kingdom and Northern Europe on February 28 was an extremely rare type of meteorite. Fragments of the space rock could provide answers to questions about the early history of the solar system and life on Earth.", "url": "https://www.cnn.com/2021/03/08/europe/uk-meteorite-extremely-rare-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308104340-01-uk-meteorite-extremely-rare-scn-super-tease.jpg", "publishedAt": "2021-03-09T00:15:03Z", "content": "(CNN)A fireball that lit up the sky over the United Kingdom and Northern Europe on February 28 was an extremely rare type of meteorite. Fragments of the space rock discovered on a driveway in the Cot… [+3163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Kevin Liptak and Ted Barrett, CNN", "title": "Democrats still face tricky path to gutting filibuster despite Manchin's openness to reforms", "description": "Liberal Democrats are sensing new momentum behind their years-long drive to overhaul the Senate's hallowed filibuster -- but they still face a thorny path to weaken the powerful tactic long used to derail bills that lack support from the minority party.", "url": "https://www.cnn.com/2021/03/08/politics/filibuster-democratic-reaction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210223152543-joe-manchin-january-27-2021-super-tease.jpg", "publishedAt": "2021-03-09T00:13:09Z", "content": "(CNN)Liberal Democrats are sensing new momentum behind their years-long drive to overhaul the Senate's hallowed filibuster -- but they still face a thorny path to weaken the powerful tactic long used… [+8301 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Will you get the third stimulus check? Here's how to know", "description": "A third round of stimulus payments is expected to be on the way later this month. The payments are included in a sweeping $1.9 trillion Covid relief package that was approved by the Senate on Saturday and could be signed by President Joe Biden soon after the …", "url": "https://www.cnn.com/2021/03/08/politics/will-i-get-a-third-stimulus-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210113173026-us-stimulus-check---stock-super-tease.jpg", "publishedAt": "2021-03-09T00:00:15Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "The great news from the CDC", "description": "Dr. Kent Sepkowitz writes that he is \"wildly impressed\" with the new CDC guidance for those fully vaccinated against Covid-19. The declaration that vaccinated seniors can indeed visit with kids and grandkids -- a mix that, should it cause harm, would surely b…", "url": "https://www.cnn.com/2021/03/08/opinions/cdc-covid-vaccination-guidance-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308171510-cdc-vaccination-recommendations-graphic-super-tease.jpg", "publishedAt": "2021-03-08T23:59:33Z", "content": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View mo… [+3606 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "India is trying to build its own internet", "description": "While Twitter finds itself in a prolonged standoff with the Indian government over the company's refusal to take down certain accounts, a senior executive of a very similar Indian social network says the sudden attention on his app has been \"overwhelming.\"", "url": "https://www.cnn.com/2021/03/08/tech/india-internet-homegrown-apps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305143715-koo-app-india---stock-super-tease.jpg", "publishedAt": "2021-03-08T23:51:13Z", "content": "(CNN Business)While Twitter finds itself in a prolonged standoff with the Indian government over the company's refusal to take down certain accounts, a senior executive of a very similar Indian socia… [+8187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Iowa governor signs controversial law shortening early and Election Day voting", "description": "Republican Iowa Gov. Kim Reynolds on Monday signed into law a controversial bill aimed at limiting voting and making it harder for voters to return absentee ballots, her office announced Monday.", "url": "https://www.cnn.com/2021/03/08/politics/kim-reynolds-voting-iowa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308175424-kim-reynolds-file-super-tease.jpg", "publishedAt": "2021-03-08T23:40:07Z", "content": "Washington (CNN)Republican Iowa Gov. Kim Reynolds on Monday signed into law a controversial bill aimed at limiting voting and making it harder for voters to return absentee ballots, her office announ… [+2366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Meghan's revelation to Oprah showed the barriers to getting help for mental health. Here's how to manage", "description": "Oprah Winfrey's bombshell interview with Meghan, the Duchess of Sussex, highlighted that help for mental health is still hard to get, even if you're part of the British royal family. Multiple resources and strategies can help with coping and reducing stigma.", "url": "https://www.cnn.com/2021/03/08/health/mental-health-help-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308172045-02-harry-meghan-oprah-handout-super-tease.jpg", "publishedAt": "2021-03-08T23:35:49Z", "content": "How to get help: In the United States, call the National Suicide Prevention Lifeline at 1-800-273-8255. The International Association for Suicide Prevention and Befrienders Worldwide also provide con… [+7054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See Don Lemon's reaction to Meghan and Harry interview", "description": "CNN's Don Lemon reacts to Oprah's interview with Harry and Meghan where they discuss race in the royal family.", "url": "https://www.cnn.com/videos/world/2021/03/08/don-lemon-meghan-markle-royal-family-race-sot-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308181808-don-lemon-super-tease.jpg", "publishedAt": "2021-03-08T23:32:20Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "A record Joe Biden shouldn't be proud of", "description": "The White House announced Monday that President Joe Biden will deliver his first prime-time speech Thursday night to commemorate a year since the Covid-19 pandemic effectively shut down American society.", "url": "https://www.cnn.com/2021/03/08/politics/joe-biden-solo-press-conference-record/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302095327-biden-obrador-meeting-super-tease.jpg", "publishedAt": "2021-03-08T23:30:30Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Bush and Clinton portraits are back on display in White House's Grand Foyer", "description": "The White House has rehung the official presidential portraits of former Presidents George W. Bush and Bill Clinton after they were removed last July during the Trump administration, an official tells CNN.", "url": "https://www.cnn.com/2021/03/08/politics/bill-clinton-george-w-bush-white-house-portraits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200717220330-bill-clinton-george-w-bush-portraits-super-tease.jpg", "publishedAt": "2021-03-08T23:27:24Z", "content": "Washington (CNN)The White House has rehung the official presidential portraits of former Presidents George W. Bush and Bill Clinton after they were removed last July during the Trump administration, … [+1086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jonathan Reiner", "title": "Greg Abbott's delusional ideas about Covid", "description": "The Texas governor's \"100%\" lifting of Covid-19 restrictions, including mask mandates, this week is about putting politics above the health and safety of 29 million Texans, writes Jonathan Reiner. The coronavirus is a relentless and opportunistic pathogen tha…", "url": "https://www.cnn.com/2021/03/08/opinions/texas-greg-abbott-masks-reiner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303030643-greg-abbott-presser-0302-super-tease.jpg", "publishedAt": "2021-03-08T23:25:20Z", "content": "Jonathan Reiner, MD, is a CNN medical analyst and Professor of Medicine and Surgery at George Washington University. The views expressed in this commentary belong to the author. View more opinion at … [+3756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Michigan student accidentally detonates homemade explosive device in classroom", "description": "A high school student in Newaygo, Michigan, accidentally detonated a homemade explosive device he brought to school Monday morning, injuring himself and four of his classmates, police said.", "url": "https://www.cnn.com/2021/03/08/us/michigan-high-school-explosive-device/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082016-social-gfx-just-in-super-169.jpg", "publishedAt": "2021-03-08T23:24:49Z", "content": "(CNN)A Michigan high school student accidentally detonated a homemade explosive device he brought to school Monday morning, injuring himself and four of his classmates, police said.\r\nOfficers from th… [+1775 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "A sculpture of the enslaved Black explorer who was on the Lewis and Clark expedition was mysteriously placed in an Oregon park", "description": "A bust of the enslaved explorer who accompanied Lewis and Clark was mysteriously put in a Portland, Oregon, park last month. Weeks later, the artist still hasn't formally come forward -- but the work has sparked a citywide reflection on the people of color wh…", "url": "https://www.cnn.com/2021/03/08/us/york-bust-portland-park-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308121438-02-york-bust-super-tease.jpg", "publishedAt": "2021-03-08T23:21:37Z", "content": "(CNN)A bust of the enslaved explorer who accompanied Lewis and Clark was mysteriously put in a Portland, Oregon, park last month. Weeks later, the artist still hasn't formally come forward -- but the… [+2476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan", "title": "What 'WandaVision' and 5 other picks can teach us about how to live", "description": "If the superhero genre was once a thinly veiled guise for presenting moral absolutes, then the Disney+ show -- up until its finale released March 5 -- has in many ways been a departure.", "url": "https://www.cnn.com/style/article/wandavision-morality-culture-queue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308132932-03-wandavision-super-tease.jpg", "publishedAt": "2021-03-08T23:18:12Z", "content": "arts\r\nThe following story contains spoilers for \"WandaVision.\"\r\nWhat would you do for love? And to what lengths would you go to erase grief?\r\nThese are the questions at the heart of \"WandaVision,\" wh… [+4197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Texas Democrats urge Abbott to accept federal funds to help border communities", "description": "Democratic lawmakers from Texas are urging the state's governor to accept federal funds to help with the testing and quarantining of migrants released from Border Patrol custody, according to a letter obtained by CNN.", "url": "https://www.cnn.com/2021/03/08/politics/abbott-border-texas-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303030643-greg-abbott-presser-0302-super-tease.jpg", "publishedAt": "2021-03-08T23:08:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Defies common sense': Dr. Wen reacts to CDC guidelines", "description": "CNN Medical Analyst Dr. Leana Wen reacts to newly released CDC guidelines for individuals fully vaccinated against Covid-19.", "url": "https://www.cnn.com/videos/health/2021/03/08/dr-leana-wen-cdc-guidelines-travel-coronavirus-vaccine-sot-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308175815-dr-wen-cdc-reax-vpx-super-tease.jpg", "publishedAt": "2021-03-08T23:03:40Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Paul Walker's daughter, Meadow, opens for Givenchy at Paris Fashion Week", "description": "Givenchy released its first runway show with creative director Matthew M. Williams at the helm, and the recorded film for Paris Fashion Week was opened by 22-year-old Meadow Walker, the daughter of late actor Paul Walker. The actor, best known for starring in…", "url": "https://www.cnn.com/style/article/givenchy-paris-fashion-week-meadow-paul-walker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308160018-01-paul-walker-meadow-givenchy-paris-fashion-week-super-tease.jpg", "publishedAt": "2021-03-08T22:55:20Z", "content": "Givenchy released its first runway show with creative director Matthew M. Williams at the helm, and the recorded film for Paris Fashion Week was opened by 22-year-old Meadow Walker, the daughter of l… [+2783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands and Catherine E. Shoichet, CNN", "title": "Biden administration grants humanitarian protections to Venezuelans in the US", "description": "The Biden administration on Monday granted humanitarian protection for Venezuelans, allowing an estimated 300,000 people to apply and remain lawfully in the United States, according to senior administration officials.", "url": "https://www.cnn.com/2021/03/08/politics/biden-administration-tps-venezuela/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170222175840-state-department-building-sign-photo-illustration-super-tease.jpg", "publishedAt": "2021-03-08T22:42:32Z", "content": "Washington (CNN)The Biden administration on Monday granted humanitarian protection for Venezuelans, allowing an estimated 300,000 people to apply and remain lawfully in the United States, according t… [+3490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "NYC prosecutors' probe into Trump finances expands to include millions loaned for Chicago skyscraper", "description": "The Manhattan district attorney's office subpoenaed documents from an investment company that loaned the Trump Organization millions of dollars for its Chicago skyscraper in a sign that the investigation into the former president's finances continues to expan…", "url": "https://www.cnn.com/2021/03/08/politics/trump-chicago-subpoena/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170424100116-trump-chicago-hotel-super-tease.jpg", "publishedAt": "2021-03-08T22:41:38Z", "content": "(CNN)The Manhattan district attorney's office subpoenaed documents from an investment company that loaned the Trump Organization millions of dollars for its Chicago skyscraper in a sign that the inve… [+3299 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brandon Tensley, CNN", "title": "Meghan Markle's plight also reveals the strength of Black kinship bonds", "description": "Prince Harry and Meghan, Duchess of Sussex's story of racism, mental health struggles and the tearing apart of a family did highlight one bright spot: the strength of Black kinship bonds.", "url": "https://www.cnn.com/2021/03/08/politics/race-meghan-markle-prince-harry-black-kinship/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210304222531-meghan-markle-oprah-entrevista-harry-esposa-acusa-familia-real-acoso-mentiras-inhs-lkl-max-foster-00002717-super-tease.jpg", "publishedAt": "2021-03-08T22:37:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caroline Kelly, CNN", "title": "Hillary Clinton on Meghan and Harry's interview: Young women 'should not be forced into a mold that is no longer relevant'", "description": "Hillary Clinton weighed in Monday on Oprah Winfrey's explosive interview with Meghan, Duchess of Sussex, and her husband, Prince Harry, offering support for Meghan and decrying the tabloids and bureaucracy that often targeted her.", "url": "https://www.cnn.com/2021/03/08/politics/hillary-clinton-meghan-harry-oprah-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308161317-hillary-clinton-meghan-markle-split-super-tease.jpg", "publishedAt": "2021-03-08T22:14:26Z", "content": "How to get help: In the US, call the National Suicide Prevention Lifeline at 1-800-273-8255. The International Association for Suicide Prevention and Befrienders Worldwide also provide contact inform… [+3987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, Jennifer Hansler and Nicole Gaouette, CNN", "title": "US proposes Afghanistan government enter interim power-sharing agreement with Taliban", "description": "The Biden administration has proposed to the Afghan government that they enter an interim power-sharing agreement with the Taliban in a letter from Secretary of State Antony Blinken to President Ashraf Ghani.", "url": "https://www.cnn.com/2021/03/08/politics/us-afghanistan-taliban-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160127131739-afghan-flag-super-tease.jpg", "publishedAt": "2021-03-08T22:08:42Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jazmin Goodwin, CNN Business", "title": "Women's retirement savings have been hit hard. Here's how to recover", "description": "The pandemic has taken a heavy toll on women, ranging from job losses to childcare demands. It's also hit women's finances -- especially when it comes to their retirement savings.", "url": "https://www.cnn.com/2021/03/08/success/retirement-savings-women-coronavirus-feseries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308131248-women-retirement-savings---stock-super-tease.jpg", "publishedAt": "2021-03-08T22:03:32Z", "content": "New York (CNN Business)The pandemic has taken a heavy toll on women, ranging from job losses to childcare demands. It's also hit women's finances -- especially when it comes to their retirement savin… [+4808 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Really disturbing': Friend of Prince Harry reacts to Oprah interview", "description": "CNN's Brooke Baldwin speaks to Dean Stott, a friend of Prince Harry's, about the interview Prince Harry and Meghan, Duchess of Sussex, gave to Oprah Winfrey.", "url": "https://www.cnn.com/videos/world/2021/03/08/dean-stott-mental-health-meghan-harry-interview-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308163230-dean-stott-nr-intv-03082021-super-tease.jpg", "publishedAt": "2021-03-08T21:48:06Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen and Katelyn Polantz, CNN", "title": "'QAnon shaman' must remain in jail, judge rules", "description": "A federal judge ruled Monday that the so-called \"QAnon shaman\" who was charged in the Capitol insurrection is too dangerous to release and must stay in jail while his case moves forward.", "url": "https://www.cnn.com/2021/03/08/politics/qanon-shaman-jail-jacob-chansley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210109181944-jacob-anthony-chansley-super-tease.jpg", "publishedAt": "2021-03-08T21:39:11Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen and Katelyn Polantz, CNN", "title": "'QAnon shaman' must remain in jail, judge rules", "description": "A federal judge ruled Monday that the so-called \"QAnon shaman\" who was charged in the Capitol insurrection is too dangerous to release and must stay in jail while his case moves forward.", "url": "https://www.cnn.com/2021/03/08/politics/qanon-shaman-jail-jacob-chansley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210109181944-jacob-anthony-chansley-super-tease.jpg", "publishedAt": "2021-03-08T21:39:11Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson, CNN", "title": "Rare Kobe Bryant rookie card sells for almost $1.8 million", "description": "A rare Kobe Bryant rookie card sold for more than $1.795 million on Saturday, \"an all-time record\" for any Bryant card, according to the Goldin Auctions, an online auction house.", "url": "https://www.cnn.com/2021/03/08/us/kobe-bryant-rookie-card-sale-record-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308130407-kobe-bryant-file-2005-super-tease.jpg", "publishedAt": "2021-03-08T21:33:52Z", "content": "(CNN)A rare Kobe Bryant rookie card sold for more than $1.795 million on Saturday, \"an all-time record\" for any Bryant card, according to the Goldin Auctions, an online auction house.\r\nThe Topps trad… [+1219 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julian Kheel", "title": "Last chance to activate the rotating bonus categories on the Chase Freedom Flex credit card", "description": "The deadline to activate the Chase Freedom Flex rotating bonus categories for this quarter is just around the corner.", "url": "https://www.cnn.com/2021/03/08/cnn-underscored/activate-quarterly-categories-chase-freedom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200909170720-underscored-chase-freedom-quarterly-categories-calendar-and-laptop-super-169.jpg", "publishedAt": "2021-03-08T21:15:59Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+5071 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Kaitlan Collins, CNN", "title": "Record number of kids are in Border Patrol custody and shelter beds are scarce, documents show", "description": "The number of unaccompanied migrant children in US Border Patrol facilities, which are akin to jail cells and not intended for kids, has reached dramatic highs, according to internal agency documents reviewed by CNN, underscoring the urgent challenge facing t…", "url": "https://www.cnn.com/2021/03/08/politics/children-us-border-patrol/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210304183516-32-week-in-photos-0305-super-tease.jpg", "publishedAt": "2021-03-08T21:02:20Z", "content": "(CNN)The number of unaccompanied migrant children in US Border Patrol facilities, which are akin to jail cells and not intended for kids, has reached dramatic highs, according to internal agency docu… [+4291 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Keilar fires back at RNC chair's false claim", "description": "Republican National Committee Chairwoman Ronna McDaniel falsely claimed that CNN is ignoring the fact that President Joe Biden has not held his own solo press conference since the start of his presidency.", "url": "https://www.cnn.com/videos/politics/2021/03/08/ronna-mcdaniel-rnc-chair-biden-press-conference-roll-the-tape-keilar-sot-vpx-nr.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308154712-keilar-rtp-super-tease.jpg", "publishedAt": "2021-03-08T21:01:42Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judson Jones, CNN Meteorologist", "title": "Brrr! February was ice cold. The coldest in more than 30 years", "description": "Thanks to the record-breaking Arctic outbreak that stretched all the way into Texas, February was the coldest it has been across the US in over 30 years, says the National Oceanic and Atmospheric Administration. However, across the US, it was still in the top…", "url": "https://www.cnn.com/2021/03/08/weather/february-2021-cold-temperature-record/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308133915-noaa-february-2021-temperature-super-tease.jpg", "publishedAt": "2021-03-08T20:55:51Z", "content": "(CNN)Thanks to the record-breaking Arctic outbreak that stretched all the way into Texas, February was the coldest it has been across the US in over 30 years, says the National Oceanic and Atmospheri… [+3501 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Morava and Scottie Andrew, CNN", "title": "It's not just you. Your pets are also putting on the pounds during the pandemic", "description": "Veterinarians across the US are noticing weight gain and higher levels of obesity in pets since the pandemic began.", "url": "https://www.cnn.com/2021/03/08/us/pandemic-overweight-pets-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305163054-10-overweight-pets-split-super-tease.jpg", "publishedAt": "2021-03-08T20:53:39Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Mora, CNN", "title": "A snake that smiles right back at you ... three times", "description": "There are a few reptile fanatics that smile when they see snakes, but maybe only one snake that can smile right back at you ... three times.", "url": "https://www.cnn.com/2021/03/08/us/smiley-snake-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305162734-01-smiley-snake-trnd-super-tease.jpg", "publishedAt": "2021-03-08T20:52:15Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Jeff Zeleny, CNN", "title": "As Grassley weighs his future, Republicans eye his seat", "description": "He's been in the Senate for more than four decades and a fixture in Iowa since starting his political career more than 62 years ago.", "url": "https://www.cnn.com/2021/03/08/politics/chuck-grassley-reelection-senate-seat-iowa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160127181709-chuck-grassley-october-25-2013-super-tease.jpg", "publishedAt": "2021-03-08T20:51:03Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joan Biskupic, CNN legal analyst & Supreme Court biographer", "title": "John Roberts dissents alone and doesn't hold back", "description": "Chief Justice John Roberts, untethered from his usual position in the Supreme Court majority and dissenting alone on Monday, fired back with an arsenal of sarcasm, derision and his own alternative view of history.", "url": "https://www.cnn.com/2021/03/08/politics/john-roberts-lone-dissent-uzuegbunam-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190320122055-20190320-john-roberts-portrait-biskupic-book-politics-super-tease.jpg", "publishedAt": "2021-03-08T20:21:41Z", "content": "(CNN)Chief Justice John Roberts, untethered from his usual position in the Supreme Court majority and dissenting alone on Monday, fired back with an arsenal of sarcasm, derision and his own alternati… [+5510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Analysis: John Roberts dissents alone and doesn't hold back", "description": "Chief Justice John Roberts, untethered from his usual position in the Supreme Court majority and dissenting alone on Monday, fired back with an arsenal of sarcasm, derision and his own alternative view of history.", "url": "https://www.cnn.com/2021/03/08/politics/john-roberts-lone-dissent-uzuegbunam-supreme-court/index.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rss%2Fcnn_topstories+%28RSS%3A+CNN+-+Top+Stories%29", "urlToImage": null, "publishedAt": "2021-03-08T20:21:41Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "How the pandemic transformed some of America's top female execs", "description": null, "url": "https://www.cnn.com/2021/03/08/success/women-executives-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308135025-restricted-amy-jo-smith-hemali-vyas-debbie-medrano-super-tease.jpg", "publishedAt": "2021-03-08T20:17:34Z", "content": "I felt like I was in a fog. My kids were like, 'Mom, you're zoning out all the time.' Objectively I was achieving enough. [But] I was just trying not to drown.\"\r\nDeborah Medrano, CFO, Dreamscape Imme… [+4 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Pete Muntean, CNN", "title": "Airline industry pushes back on CDC guidance that vaccinated people still should avoid travel", "description": "Airline industry group Airlines For America is pushing back against new Centers for Disease Control and Prevention guidelines that fully vaccinated people should still avoid travel.", "url": "https://www.cnn.com/travel/article/airline-industry-cdc-travel-guidance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210209102233-covid-testing-lax-airport-super-tease.jpg", "publishedAt": "2021-03-08T20:15:02Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kehinde Andrews", "title": "Opinion: Royal family's 'post-racial' fantasy unravels", "description": "When Harry and Meghan walked down the aisle, surrounded by examples of #BlackExcellence, and being serenaded by a gospel choir on May 19, 2018, it was meant to mark a new era in race relations. Even the royal family was being \"modernized,\" dragged into the 21…", "url": "https://www.cnn.com/2021/03/08/opinions/meghan-markle-interview-monarchy-uk-racism-andrews/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308022505-meghan-markle-oprah-interview-0307-super-tease.jpg", "publishedAt": "2021-03-08T19:52:43Z", "content": "Kehinde Andrews is professor of Black Studies at Birmingham City University and the author of the book \"The New Age of Empire: How Racism and Colonialism Still Rule the World.\" The opinions in this a… [+6845 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Morava and Saeed Ahmed, CNN", "title": "A woman, nicknamed 'book lady,' wants to give away one million books to her community", "description": "Jennifer Williams wants students to love reading the way she did as a child.", "url": "https://www.cnn.com/2021/03/08/us/book-lady-gives-students-million-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305161507-01-book-lady-gives-students-a-million-books-super-tease.jpg", "publishedAt": "2021-03-08T19:22:21Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Chaka Khan and Idina Menzel remake 'I'm Every Woman' for International Women's Day", "description": "It's the remake of all remakes.", "url": "https://www.cnn.com/2021/03/08/entertainment/chaka-khan-idina-menzel-im-every-woman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120528064341-chaka-khan-bmi-pop-music-awards-story-top.jpg", "publishedAt": "2021-03-08T19:15:49Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Benjamin Levin", "title": "The best VPN of 2021", "description": "As the time we spend online continues to increase — especially as remote work has become the norm — it's even more important than ever for people to protect all the personal data they store across the internet. That's where a VPN comes in.", "url": "https://www.cnn.com/2021/03/08/cnn-underscored/best-vpn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201105102636-best-vpn-lead-super-169.jpg", "publishedAt": "2021-03-08T19:06:42Z", "content": "As the time we spend online continues to increase especially as remote work has become the norm its even more important than ever for people to protect all the personal data they store across the int… [+13500 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Exclusive: Wells Fargo is joining the green wave sweeping finance", "description": "Wells Fargo is the latest big bank to embrace ambitious lending goals to fight the climate crisis.", "url": "https://www.cnn.com/2021/03/08/investing/wells-fargo-net-zero-climate-goals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308113354-01-wells-fargo-bank-file-restricted-super-tease.jpg", "publishedAt": "2021-03-08T19:00:09Z", "content": "It doesn't take a scientist to notice our clients are affects by changes in climate.\"\r\nJon Weiss, CEO of corporate and investment banking at Wells Fargo"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "The US pandemic at one year: Looking back at the week everything changed, and looking forward", "description": "Take a look back at what this week in March 2020 felt like, as the US began to shut down. March 9 was the day when CNN began to use the term pandemic to describe the outbreak...", "url": "https://www.cnn.com/2021/03/08/media/covid-19-pandemic-one-year-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308130217-restricted-coronavirus-media-coverage-2020-super-tease.jpg", "publishedAt": "2021-03-08T18:58:52Z", "content": "New York (CNN)This week's news coverage of the coronavirus will toggle between retrospectives about the one-year anniversary of the pandemic and forward-looking reports about vaccines and variants. I… [+6423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "White and Black Americans are divided over George Floyd's death and whether race relations have improved, poll finds", "description": "White and Black Americans' perceptions of race relations and the circumstances around George Floyd's death remain split, a new poll has found.", "url": "https://www.cnn.com/2021/03/08/us/race-relations-george-floyd-poll/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg", "publishedAt": "2021-03-08T18:56:36Z", "content": "(CNN)White and Black Americans' perceptions of race relations and the circumstances around George Floyd's death remain split, a new poll has found.\r\nAhead of the trial of Derek Chauvin, a former Minn… [+3045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A proposed Kentucky bill would make it a crime to insult or taunt a police officer", "description": "Kentucky state lawmakers have advanced a bill that would make it a crime to insult or taunt a law enforcement officer in a way that could provoke a violent response.", "url": "https://www.cnn.com/2021/03/08/us/kentucky-bill-criminalize-insulting-police-officers-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308130643-louisville-police-file-2020-super-tease.jpg", "publishedAt": "2021-03-08T18:48:25Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "The role of an unexpected savior is not new to Tyler Perry", "description": "When Meghan Markle and Prince Harry revealed their fears and struggles with racism in the royal family, one unlikely hero emerged in the saga: Tyler Perry. But it's a role he's played many times before.", "url": "https://www.cnn.com/2021/03/08/entertainment/meghan-markle-prince-harry-tyler-perry-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210105142404-tyler-perry-file-super-tease.jpg", "publishedAt": "2021-03-08T18:34:01Z", "content": "(CNN)In an interview filled with one bombshell after another, Meghan Markle and Prince Harry revealed their fears and struggles with racism in the royal family. But one unlikely hero emerged in the s… [+4245 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Prisoners also got relief checks from the pandemic bills Trump signed and Cotton voted for", "description": "Arkansas Sen. Tom Cotton has been slamming Democrats for passing a bill that will send relief checks to prisoners. But both of the bills President Donald Trump signed last year -- with the support of Cotton and other Republicans -- also sent relief checks to …", "url": "https://www.cnn.com/2021/03/08/politics/fact-check-tom-cotton-prisoners-pandemic-relief-checks-trump-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308114551-02-sen-tom-cotton-file-restricted-super-tease.jpg", "publishedAt": "2021-03-08T18:31:02Z", "content": "Washington (CNN)Arkansas Sen. Tom Cotton, a Republican, is attacking Democrats for passing a pandemic relief bill that will send money to prisoners.\r\n\"Dzhokhar Tsarnaev, the Boston Bomber, murdered t… [+6442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Morrow, CNN Business", "title": "Stocks rally as Wall Street cheers Biden's stimulus package", "description": "The Dow surged more than 600 points on Monday as investors cheered the Senate's passage of a Covid-19 relief package that aims to bolster the US economy.", "url": "https://www.cnn.com/2021/03/08/investing/dow-stock-market-today/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305162626-nyse-0305-super-tease.jpg", "publishedAt": "2021-03-08T18:19:01Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aleks Klosok, CNN", "title": "Despite 'inappropriate behavior,' UEFA clears officials of alleged racist abuse during Champions League game", "description": "UEFA announced on Monday that Romanian fourth official Sebastian Colţescu and assistant referee Octavian Sovre have been cleared of racism and other discriminatory conduct during December's Champions League match between Paris Saint-Germain and Istanbul Basak…", "url": "https://edition.cnn.com/2021/03/08/football/uefa-champions-league-sebastian-coltescu-octavian-sovre-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308121247-01-sebastian-coltescu-uefa-match-dec08-super-tease.jpg", "publishedAt": "2021-03-08T18:06:37Z", "content": "(CNN)UEFA announced on Monday that Romanian fourth official Sebastian Colescu and assistant referee Octavian Sovre have been cleared of racism and other discriminatory conduct during December's Champ… [+677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Kathryn Hahn wants more Agatha Harkness in her future", "description": "Kathryn Hahn says she's thrilled she got to play \"WandaVision\" villain Agatha Harkness, but says she never saw the role coming.", "url": "https://www.cnn.com/2021/03/08/entertainment/wandavision-kathryn-hahn-agatha-harkness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210224091525-wandavision-agatha-kathryn-hahn-super-tease.jpg", "publishedAt": "2021-03-08T18:02:43Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Kathryn Hahn wants more Agatha Harkness in her future", "description": "Kathryn Hahn says she's thrilled she got to play \"WandaVision\" villain Agatha Harkness, but says she never saw the role coming.", "url": "https://www.cnn.com/2021/03/08/entertainment/wandavision-kathryn-hahn-agatha-harkness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210224091525-wandavision-agatha-kathryn-hahn-super-tease.jpg", "publishedAt": "2021-03-08T18:02:43Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The slew of Senate Republican retirements prove who's in charge of the GOP now", "description": "Missouri Sen. Roy Blunt's surprise retirement announcement Monday adds his name to a growing list of GOP establishment politicians who no longer recognize the party they represent and have decided to walk away rather than face the peril of losing their career…", "url": "https://www.cnn.com/2021/03/08/politics/roy-blunt-rob-portman-pat-toomey/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210127172614-hponly-20210127-senate-map2022-super-tease.png", "publishedAt": "2021-03-08T17:53:33Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Being owned by a billionaire is a newsroom's dream. But it can turn into a nightmare", "description": "Wealthy media owners alleviate the pressures that come with being a part of a publicly traded company or a hedge fund seeking high profit margins. But staffers are still at the whims of a super rich and sometimes capricious owner.", "url": "https://www.cnn.com/2021/03/08/media/wealthy-media-owners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302095635-powell-jobs-bezos-bainum-benioff-split-restricted-super-tease.jpg", "publishedAt": "2021-03-08T17:40:48Z", "content": "\"When the Henrys bought us, it was just an enormous relief to me and to a lot of people at the Globe. In the early years of their ownership, they were willing and able to absorb really significant lo… [+51 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "UK royal family in crisis after Harry and Meghan allege racism and neglect in Oprah interview", "description": "Britain's royal family was facing a once-in-a-generation crisis on Monday after Prince Harry and Meghan, Duchess of Sussex, rocked the institution with a litany of devastating allegations in their eagerly awaited interview with Oprah Winfrey.", "url": "https://www.cnn.com/2021/03/08/uk/oprah-harry-meghan-interview-monday-gbr-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308131629-01-royal-interview-reaction-uk-0308-super-tease.jpg", "publishedAt": "2021-03-08T17:40:40Z", "content": "London (CNN)Britain's royal family was facing a once-in-a-generation crisis on Monday after Prince Harry and Meghan, Duchess of Sussex, rocked the institution with a litany of devastating allegations… [+9276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN", "title": "Record warmth and severe storms to impact the US this week", "description": "The start of Spring is nearly two weeks away, but some areas of the US will feel more like summer this week. Temperatures will be running as much as 30-40 degrees above normal for many in the Plains and Midwest.", "url": "https://www.cnn.com/2021/03/08/weather/record-warmth-severe-storms-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308094148-record-highs-card-super-tease.jpg", "publishedAt": "2021-03-08T17:38:54Z", "content": "The overall quiet weather pattern will come to an end later this week, with heavy #rain possible from the Southern Plains to Ohio Valley beginning on Thursday and lasting through the weekend. The ima… [+151 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Busari and Nimi Princewell, CNN", "title": "Equatorial Guinea explosions kill at least 31, injure hundreds more", "description": "At least 31 people died in multiple explosions at a military base in the port city of Bata, in Equatorial Guinea, the Central African country's health ministry confirmed in a statement on social media Monday.", "url": "https://www.cnn.com/2021/03/08/africa/equatorial-guinea-blasts-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308111010-restricted-equatorial-guinea-bata-map-super-tease.jpg", "publishedAt": "2021-03-08T17:38:20Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelsie Smith, CNN", "title": "Teachers are making surprise visits to students who are struggling with online learning", "description": "Students across the country are struggling with the life changes caused by the pandemic in a breaking point that developmental psychologists are calling the \"pandemic wall.\"", "url": "https://www.cnn.com/2021/03/08/us/teachers-surprise-disengaged-students-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305205704-01-teachers-surprising-disengaged-students-super-tease.jpg", "publishedAt": "2021-03-08T17:31:21Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden to mark one year of Covid-19 shutdown in primetime address Thursday", "description": "President Joe Biden will deliver his first primetime address this Thursday, commemorating the milestone of one year since the global pandemic coronavirus shut down much of the nation.", "url": "https://www.cnn.com/2021/03/08/politics/biden-primetime-address-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210306205230-01-joe-biden-0306-super-tease.jpg", "publishedAt": "2021-03-08T17:28:23Z", "content": "(CNN)President Joe Biden will deliver his first primetime address this Thursday, commemorating the milestone of one year since the global pandemic coronavirus shut down much of the nation.\r\n\"The Pres… [+555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson, CNN", "title": "A search for biological relatives leads an adopted woman to the FBI's most wanted list", "description": "Kathy Gillcrist knew she was adopted, but what she didn't know is that a search for her birth parents would lead her to the FBI's most wanted list.", "url": "https://www.cnn.com/2021/03/08/us/dna-test-leads-woman-to-her-most-wanted-father-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210306150859-screengrab-kathy-gillcrist-super-tease.jpg", "publishedAt": "2021-03-08T17:20:12Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Melinda Gates: Women are leaving workforce in huge numbers", "description": "CNN's Becky Anderson speaks with Melinda Gates on International Women's Day about what governments can do to support women after the United Nations said the coronavirus pandemic has driven 47 million women out of the workforce.", "url": "https://www.cnn.com/videos/business/2021/03/08/coronavirus-international-womens-day-iwd-melinda-gates-anderson-ctw-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308170325-melinda-gates-iwd-coronavirus-ctw-interview-super-tease.jpg", "publishedAt": "2021-03-08T17:12:06Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, Annie Grayer and Jeremy Herb, CNN", "title": "Task force on Capitol security release final report", "description": "The task force established to review security at the US Capitol released its final report Monday, which calls for sweeping changes to improve US Capitol Police's emergency response and multiple security enhancements around the Capitol complex.", "url": "https://www.cnn.com/2021/03/08/politics/capitol-hill-security-report-released/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-03-08T17:05:16Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "Twenty-somethings are finding their dream apartments on TikTok", "description": "As vacant apartments pile up in big cities, real estate agents are increasingly turning to TikTok to match twenty-somethings with rentals that are a steal by pre-pandemic standards.", "url": "https://www.cnn.com/2021/03/08/business/tiktok-real-estate-apartments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308095806-new-york-real-estate-file-super-tease.jpg", "publishedAt": "2021-03-08T17:02:34Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "Why Oprah's interview with Meghan and Harry drew a staggering 17 million viewers", "description": "Harry and Meghan's interview with Oprah Winfrey was a cultural earthquake, with upwards of 17 million viewers measured by Nielsen's TV ratings scale.", "url": "https://www.cnn.com/2021/03/08/media/ratings-oprah-meghan-harry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210306112719-01-harry-meghan-oprah-handout-super-tease.jpg", "publishedAt": "2021-03-08T17:01:56Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Stephen Breyer adds 'respect' to his dissent of Amy Coney Barrett's first opinion", "description": "Justice Amy Coney Barrett filed her first signed majority opinion last week, a momentous occasion for any new justice, and now she officially has the \"respect\" of the dissenting side.", "url": "https://www.cnn.com/2021/03/08/politics/breyer-barrett-respect/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308113842-breyer-barrett-split-super-tease.jpg", "publishedAt": "2021-03-08T17:01:46Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Sen. Graham: Trump can make GOP stronger or 'destroy it'", "description": "In an interview with \"Axios on HBO,\" Sen. Lindsey Graham (R-SC) spoke about former President Donald Trump's influence on the Republican party.", "url": "https://www.cnn.com/videos/media/2021/03/08/lindsey-graham-trump-gop-axios-interview-orig-llr.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308113444-graham-axios-super-tease.jpg", "publishedAt": "2021-03-08T16:58:51Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Banu Ibrahim", "title": "TripAdvisor's top all-inclusive resorts for your next vacation", "description": "Itching to book (or just start dreaming about) your next vacation? Check out the top-rated all-inclusive resorts on TripAdvisor right now, in locations like Mexico, Greece, the Maldives and more.", "url": "https://www.cnn.com/2021/03/08/cnn-underscored/best-all-inclusive-resorts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210304123912-inclusiveleadikosdassia-super-169.jpg", "publishedAt": "2021-03-08T16:55:04Z", "content": "Id say we are all desperately in need of a good vacation. And if youre already antsy to book (or at least dream about) your next post-Covid getaway, weve got just the thing for you. \r\nJust check out … [+7190 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "Read: Task force report on security failures during Capitol riot", "description": "Retired Army Lt. Gen. Russel Honoré was tasked by House Speaker Nancy Pelosi in January to lead a review of Capitol security, which would end in recommendations to immediately improve infrastructure security, Capitol security operations and member security.", "url": "https://www.cnn.com/2021/03/08/politics/final-task-force-report-jan-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210221090239-capitol-riots-210106-file-super-tease.jpg", "publishedAt": "2021-03-08T16:41:10Z", "content": "(CNN)Retired Army Lt. Gen. Russel Honoré was tasked by House Speaker Nancy Pelosi in January to lead a review of Capitol security, which would end in recommendations to immediately improve infrastruc… [+292 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "These sea slugs can self-decapitate and grow a new body", "description": "Two species of sea slugs can escape death and regrow entire organs like the heart and kidneys.", "url": "https://www.cnn.com/2021/03/08/world/sea-slug-decapitation-autotomy-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305175042-sea-slugs-autonomy-discovery-super-tease.jpg", "publishedAt": "2021-03-08T16:38:39Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone, Kai Burkhardt", "title": "The best sales to shop today: PhoneSoap, Adidas, Ring and more", "description": "Today, you'll find a deal on PhoneSoap UV sanitizers, a discounted pair of Samsung Galaxy Buds Live and savings on Adidas shoes and apparel. All that and more below.", "url": "https://www.cnn.com/2021/03/08/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308073703-0308dealslead-super-169.jpg", "publishedAt": "2021-03-08T16:32:25Z", "content": "Today, youll find a deal on PhoneSoap UV sanitizers, a discounted pair of Samsung Galaxy Buds Live and savings on Adidas shoes and apparel. All that and more below.\r\nKeep your tech (and other items) … [+6475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chad Myers and Monica Garrett, CNN Meteorologists", "title": "Multiyear drought builds in western US with little relief in sight", "description": "While much has been written this year about atmospheric rivers, avalanche warnings and even flash flooding, the western half of the United States is experiencing a crushing drought.", "url": "https://www.cnn.com/2021/03/08/weather/western-us-drought-snowpack-lack-of-rain/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308103341-01-drought-calif-0228-super-tease.jpg", "publishedAt": "2021-03-08T16:24:34Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Devan Cole, CNN", "title": "Supreme Court -- over John Roberts' sole dissent -- rules in favor of student in First Amendment case", "description": "The Supreme Court on Monday revived a lawsuit brought by a former student seeking to hold his state university accountable for violating his First Amendment rights when it barred him from speaking about his religion and distributing religious literature.", "url": "https://www.cnn.com/2021/03/08/politics/supreme-court-free-speech-college-religion-case-chike-uzuegbunam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201224043021-01-us-supreme-court-1211-super-tease.jpg", "publishedAt": "2021-03-08T16:20:26Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Governor on relief bill: Why reward states for bad behavior?", "description": "Idaho's Republican Governor Brad Little shares with CNN's Jim Sciutto his objections to President Biden's $1.9 trillion Covid-19 relief plan.", "url": "https://www.cnn.com/videos/politics/2021/03/08/idaho-governor-brad-little-covid-relief-intv-newsroom-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308105225-idaho-governor-brad-little-super-tease.jpg", "publishedAt": "2021-03-08T16:19:04Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Hanna Ziady, CNN Business", "title": "One reason Meghan suffered racist UK coverage: The media is not diverse", "description": "When British newspapers first broke the news of Prince Harry's relationship with Meghan, the Duchess of Sussex, one Mail Online headline declared that she was \"(almost) straight outta Compton.\" Around the same time, The Daily Star ran a headline asking whethe…", "url": "https://www.cnn.com/2021/03/08/media/uk-media-meghan-race-diversity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308065000-meghan-markle-190923-file-super-tease.jpg", "publishedAt": "2021-03-08T16:14:10Z", "content": "London (CNN Business)When British newspapers first broke the news of Prince Harry's relationship with Meghan, the Duchess of Sussex, one Mail Online headline declared that she was \"(almost) straight … [+7518 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "New guidelines outline what people can do once they are two weeks past their final shots. But there are many rules to keep following.", "description": "New guidelines from the US Centers for Disease Control and Prevention say people fully vaccinated against Covid-19 can safely visit with other vaccinated people and small groups of unvaccinated people in some circumstances, but there are still important safet…", "url": "https://www.cnn.com/2021/03/08/health/covid-19-vaccine-cdc-guidelines-fully-vaccinated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308101131-01-vaccination-ohio-0306-super-tease.jpg", "publishedAt": "2021-03-08T16:03:23Z", "content": "(CNN)New guidelines from the US Centers for Disease Control and Prevention say people fully vaccinated against Covid-19 can safely visit with other vaccinated people and small groups of unvaccinated … [+3274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Tamara Qiblawi, with reporting from Muwafaq Mohammed", "title": "Joyous, hopeful scenes are not the only legacy of Pope's visit to Iraq", "description": "When Pope Francis greeted adoring crowds at an Erbil stadium for the final leg of his Iraq tour on Sunday, he showed up in an open-air vehicle. He did the same when he toured Mosul earlier, waving at a handful of onlookers against the backdrop of buildings de…", "url": "https://www.cnn.com/2021/03/08/middleeast/iraq-pope-francis-departs-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308082226-08-pope-francis-iraq-0307-super-tease.jpg", "publishedAt": "2021-03-08T15:56:36Z", "content": "Erbil, Iraq (CNN)When Pope Francis greeted adoring crowds at an Erbil stadium for the final leg of his Iraq tour on Sunday, he showed up in an open-air vehicle. He did the same when he toured Mosul e… [+3856 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Car crashing through wall sends people scrambling", "description": "Patrons of a Charlotte martial arts studio ran for cover after a car came crashing through the wall.", "url": "https://www.cnn.com/videos/us/2021/03/08/car-crash-martial-arts-studio-charlotte-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308100638-car-crash-building-super-tease.jpeg", "publishedAt": "2021-03-08T15:46:06Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How Meghan Markle stared down one of the world's most powerful institutions", "description": "A generation ago -- or even a decade or two ago -- what happened on Sunday night was unthinkable: A royal taking on the monarchic \"institution\" and exposing its intolerant and unkind underbelly.", "url": "https://www.cnn.com/2021/03/08/politics/meghan-markle-harry-oprah-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302113112-meghan-markle-super-tease.jpg", "publishedAt": "2021-03-08T15:38:10Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "GOP Sen. Roy Blunt announces he will not run for reelection", "description": "Sen. Roy Blunt of Missouri, a member of GOP leadership, announced Monday that he will not run for reelection, the latest Republican senator to announce he's not running next year.", "url": "https://www.cnn.com/2021/03/08/politics/blunt-not-running-reelection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120301122623-roy-blunt-file-super-tease.jpg", "publishedAt": "2021-03-08T15:23:04Z", "content": "(CNN)Sen. Roy Blunt of Missouri, a member of GOP leadership, announced Monday that he will not run for reelection, the latest Republican senator to announce he's not running next year.\r\n\"After 14 gen… [+636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Greg Krieg, Hollie Silverman and Lauren del Valle, CNN", "title": "New York state senate majority leader joins growing Democratic calls for Gov. Andrew Cuomo to resign", "description": "The walls are closing in on New York Gov. Andrew Cuomo.", "url": "https://www.cnn.com/2021/03/08/politics/andrew-cuomo-calls-to-resign-harrassment-claims/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210307002336-02-andrew-cuomo-file-super-tease.jpg", "publishedAt": "2021-03-08T15:22:01Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Katharine McPhee Foster shares first photo of son", "description": "Katharine McPhee Foster is enjoying being a first time mother.", "url": "https://www.cnn.com/2021/03/08/entertainment/katharine-mcphee-baby-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180703152414-david-foster-and-katharine-mcphee-super-tease.jpg", "publishedAt": "2021-03-08T15:15:21Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "All the WFH essentials that we now can't live without", "description": "Whether it's an actually pleasant desk lamp, a lumbar pillow that's saved our backs or even a bidet, these are the truly life-changing WFH staples that we've found over the past year — and now can't live without.", "url": "https://www.cnn.com/2021/03/08/cnn-underscored/editors-favorite-work-from-home-products/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303135437-wfheditorspickslead-super-169.jpg", "publishedAt": "2021-03-08T15:05:07Z", "content": "Over the past year our spending habits have changed a lot. \r\nRather than subsisting off of free office coffee, weve finally upgraded our at-home coffee machines to be spectacular. Now without a prope… [+10507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Malala Yousafzai lands Apple TV+ deal and discusses her hope for International Women's Day", "description": "Nobel laureate and activist Malala Yousafzai is teaming up with Apple TV+ to bring empowering content to the streaming platform.", "url": "https://www.cnn.com/2021/03/08/entertainment/malala-apple-tv-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302130101-malala-yousafzai-file-2019-super-tease.jpg", "publishedAt": "2021-03-08T15:03:35Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Stuart, CNN", "title": "New York City high schools to reopen for in-person learning on March 22", "description": "New York City's public high schools will reopen for in-person learning on March 22 the city's Department of Education said Monday, the final group of the largest school district in the country to be welcomed back to school buildings.", "url": "https://www.cnn.com/2021/03/08/us/new-york-city-high-schools/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308094629-new-york-high-school-restricted-super-tease.jpg", "publishedAt": "2021-03-08T15:03:02Z", "content": "(CNN)New York City's public high schools will reopen for in-person learning on March 22 the city's Department of Education said Monday, the final group of the largest school district in the country t… [+1135 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, Max Foster and Lauren Said-Moorhouse, CNN", "title": "The Firm: Britain's royal 'institution' explained", "description": "Oprah Winfrey's bombshell interview with Prince Harry and Meghan, Duchess of Sussex has caused shockwaves, with the couple accusing the royal \"institution\" of failing to protect them when they needed it most.", "url": "https://www.cnn.com/2021/03/08/uk/royal-family-structure-explainer-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308073910-01-uk-royal-family-structure-super-tease.jpg", "publishedAt": "2021-03-08T15:02:57Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Macfarlane and Steven Poole, CNN", "title": "Mikaela Shiffrin reveals how she's been inspired by tennis star Iga witek", "description": "Skier Mikaela Shiffrin reveals how she's been inspired by tennis star Iga Świątek", "url": "https://edition.cnn.com/2021/03/08/sport/mikaela-shiffrin-iga-witek-world-championships-2021-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308075533-mikaela-shiffrin-iga-witek-split-super-tease.jpg", "publishedAt": "2021-03-08T14:54:40Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Eminem releases new song after a TikTok campaign tries to 'cancel' him", "description": "Eminem has released a new song in response to a TikTok campaign that tried to \"cancel\" him.", "url": "https://www.cnn.com/2021/03/08/entertainment/eminem-new-song-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210123170423-eminem-file-super-tease.jpg", "publishedAt": "2021-03-08T14:54:18Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "NASA named the Perseverance rover's landing spot for Octavia E. Butler, the pioneering Black science-fiction author", "description": "Though they starred aliens, vampires and time travelers, Octavia E. Butler's celebrated science-fiction novels were often grounded on Earth. Her name and enduring legacy, though, have made it as far as the Red Planet millions of miles away.", "url": "https://www.cnn.com/2021/03/08/us/octavia-butler-perseverance-mars-nasa-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308084118-octavia-butler-file-super-tease.jpg", "publishedAt": "2021-03-08T14:33:26Z", "content": "(CNN)Though they starred aliens, vampires and time travelers, Octavia E. Butler's celebrated science-fiction novels were often grounded on Earth. Her name and enduring legacy, though, have made it as… [+2053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Scientist explains how massive Siberian craters are formed", "description": "Another massive crater appeared violently and explosively in the Siberian tundra in 2020, leaving a gaping circular scar in the empty and eerie landscape. It was the 17th hole to appear in the Russian Arctic since the first was spotted in 2013.", "url": "https://www.cnn.com/videos/world/2021/03/08/siberia-craters-permafrost-gray-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308140527-siberia-craters-permafrost-gray-intl-ldn-vpx-00001410-super-tease.png", "publishedAt": "2021-03-08T14:32:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Meghan: 'Rude and racist are not the same'", "description": "In a further clip from her interview with Oprah Winfrey, Meghan, Duchess of Sussex, says the palace did not protect her from the press in the same way as her sister-in-law Catherine, Duchess of Cambridge.", "url": "https://www.cnn.com/videos/world/2021/03/08/meghan-rude-vs-racist-media-sot-harry-oprah-intv-newday-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210307191545-01-meghan-diana-cartier-super-tease.jpg", "publishedAt": "2021-03-08T14:08:48Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeanine Celeste Pang for CNN Business Perspectives", "title": "As an Asian American, I'm sick of feeling silenced. Communities and businesses should step up", "description": "Brands should do more than upload a generic \"we stand in solidarity\" post to their social media accounts — this feels like performative messaging at a time when we need real, lasting change.", "url": "https://www.cnn.com/2021/03/08/perspectives/anti-asian-hate-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308083407-anti-asian-violence-protest-0220-super-tease.jpg", "publishedAt": "2021-03-08T14:05:07Z", "content": "Jeanine Celeste Pang is the senior creative director of brand voice at Old Navy, a Gap Inc. brand. The company recently announced a $100,000 donation to Stop AAPI Hate and the National Coalition for … [+5703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "First on CNN: Cameron Diaz wants to ship you her wine", "description": "Actress Cameron Diaz and fashion entrepreneur Katherine Power have a problem: Their new wine label is so popular that even they are having tracking down bottles to buy. That's about to become easier for them and their loyal fans.", "url": "https://www.cnn.com/2021/03/08/business/avaline-wine-direct-to-consumer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305165851-restricted-01-avaline-wine-co-founders-cameron-diaz-katherine-power-super-tease.jpg", "publishedAt": "2021-03-08T14:01:10Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eyad Kourdi, Mostafa Salem and Tamara Qiblawi, CNN", "title": "Syrian President Bashar al-Assad and his wife Asma test positive for Covid-19", "description": "Syrian President Bashar al-Assad and his wife, Asma, have tested positive for Covid-19, the president's office said in a statement Monday.", "url": "https://www.cnn.com/2021/03/08/middleeast/syria-assad-coronavirus-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130903215549-ac-bashar-al-assad-and-asma-story-top.jpg", "publishedAt": "2021-03-08T13:54:52Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'A ransom demand': Avlon slams Trump's letter to RNC", "description": "Former President Donald Trump sent a cease-and-desist letter to the Republican National Committee, upset about fundraising materials using his likeness. CNN's John Avlon breaks down this move.", "url": "https://www.cnn.com/videos/politics/2021/03/08/trump-cease-desist-letter-gop-avlon-reality-check-newday-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308083800-avlon-reality-check-super-tease.jpg", "publishedAt": "2021-03-08T13:47:51Z", "content": null}]}