{"status": "ok", "totalResults": 219, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Loki might be a hedonist, but so far 'Loki' remains a bit of a bore", "description": "The Marvel/Disney+ strategy of slowly building stories is becoming a bit of a bore with the third episode of \"Loki,\" a protracted escape scenario that gave fans lots of time to luxuriate in the title character -- and his new variant -- while doing precious li…", "url": "https://www.cnn.com/2021/06/23/entertainment/loki-episode-3-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623142646-loki-episode-3-tom-hiddlleston-sophia-di-martino-super-tease.jpg", "publishedAt": "2021-06-24T00:04:17Z", "content": "The following contains spoilers about the third episode of \"Loki\" on Disney+.\r\n (CNN)The Marvel/Disney+ strategy of slowly building stories is becoming a bit of a bore with the third episode of \"Loki… [+1857 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen and Paul LeBlanc, CNN", "title": "Top Texas Democrat slams 'out of control' governor in fight over restrictive voting bill", "description": "The top Democratic Party official in Texas on Wednesday blasted Republican Gov. Greg Abbott's recent decisions to veto a portion of the state budget that funds the Texas Legislature and to convene a special legislative session next month, calling the moves \"b…", "url": "https://www.cnn.com/2021/06/23/politics/texas-democrats-greg-abbott-voting-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170908155136-01-texas-governor-greg-abbott-file-super-tease.jpg", "publishedAt": "2021-06-23T23:48:26Z", "content": "(CNN)The top Democratic Party official in Texas on Wednesday blasted Republican Gov. Greg Abbott's recent decisions to veto a portion of the state budget that funds the Texas Legislature and to conve… [+2306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, Cheri Mossburg and Krecyte Villareal, CNN", "title": "A high school basketball coach was fired after tortilla-throwing incident involving rival team", "description": "A school board in Southern California has decided to fire a basketball coach in the wake of widespread criticism after tortillas were thrown at an opposing team following a championship game last weekend.", "url": "https://www.cnn.com/2021/06/23/us/california-basketball-coach-fired-tortilla-throwing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623172946-01-coronado-orange-glen-high-schools-tortillas-super-tease.jpg", "publishedAt": "2021-06-23T23:46:32Z", "content": "(CNN)A school board in Southern California has decided to fire a basketball coach in the wake of widespread criticism after tortillas were thrown at an opposing team following a championship game las… [+5282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Scientist says early coronavirus samples were deleted from NIH database", "description": "Scientists investigating the origins of the  Covid-19 pandemic might be working with the wrong samples, because some early samples of the virus submitted by a Chinese researcher were deleted from a shared database, an expert in the evolution of viruses says.", "url": "https://www.cnn.com/2021/06/23/health/coronavirus-sequences-database-scientist/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623182015-01-covid19-cells-file-super-tease.jpg", "publishedAt": "2021-06-23T23:28:55Z", "content": "(CNN)Scientists investigating the origins of the coronavirus pandemic might be working with the wrong samples, because some early samples of the virus submitted by a Chinese researcher were deleted f… [+3714 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Judge blocks Medicaid expansion in Missouri", "description": "A Missouri judge blocked Medicaid expansion in the state on Wednesday, saying the ballot initiative that voters approved last year was unconstitutional.", "url": "https://www.cnn.com/2021/06/23/politics/missouri-medicaid-expansion-blocked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623174459-01-mike-parson-file-super-tease.jpg", "publishedAt": "2021-06-23T23:16:16Z", "content": "(CNN)A Missouri judge blocked Medicaid expansion in the state on Wednesday, saying the ballot initiative that voters approved last year was unconstitutional. \r\nThe court action stems from Republican … [+3136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Jamie Gumbrecht, CNN", "title": "Benefits of Covid-19 vaccination clearly outweigh risks of rare heart inflammation, CDC vaccine advisers told", "description": "There's a likely association between the mRNA Covid-19 vaccines and rare cases of heart inflammation in adolescents and young adults, but the benefits of vaccination still clearly outweigh the risks, vaccine advisers to the US Centers for Disease Control and …", "url": "https://www.cnn.com/2021/06/23/health/myocarditis-covid-vaccines-cdc-acip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623161602-covid-vaccination-clinic-0618-super-tease.jpg", "publishedAt": "2021-06-23T23:11:47Z", "content": "(CNN)There's a likely association between the mRNA Covid-19 vaccines and rare cases of heart inflammation in adolescents and young adults, but the benefits of vaccination still clearly outweigh the r… [+6269 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lincoln Mitchell", "title": "Why Andrew Yang's mayoral campaign failed", "description": "Lincoln Mitchell writes Andrew Yang's New York mayoral bid failed because instead of focusing much energy on Black and Latino voters, he tried to cobble together a new coalition of Asian Americans, ultra-Orthodox Jews and young moderates. And, even in that, h…", "url": "https://www.cnn.com/2021/06/23/opinions/andrew-yang-mayoral-campaign-failure-mitchell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210519124214-lincoln-mitchell-op-ed-super-tease.jpg", "publishedAt": "2021-06-23T23:09:26Z", "content": "Lincoln Mitchell (@LincolnMitchell) teaches in the political science department at Columbia University. His most recent book is \"The Giants and Their City: Major League Baseball in San Francisco, 197… [+4964 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Ronald Zambrano", "title": "Opinion: How 'red flag' laws could prevent workplace shootings", "description": "Last month, Samuel Cassidy, a \"disgruntled\" employee, gunned down nine people at a San Jose Valley Transit Authority rail yard and then killed himself. His ex-wife told the Associated Press that Cassidy had talked about killing people at work and was viewed a…", "url": "https://www.cnn.com/2021/06/23/opinions/red-flag-gun-laws-workplace-shootings-zambrano/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623175446-gun-safety-op-ed-super-tease.jpg", "publishedAt": "2021-06-23T22:46:32Z", "content": "Ronald Zambrano is the employment litigation chair at West Coast Employment Lawyers, where he represents victims of workplace discrimination and harassment, wrongful termination, whistleblower retali… [+4713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle", "title": "Trial against banker who loaned $16 million to Paul Manafort underway; Anthony Scaramucci set to testify Thursday", "description": "A former Chicago bank executive is on trial in Manhattan for allegedly taking bribes from onetime Donald Trump campaign Chairman Paul Manafort, hoping to trade loans for a high-ranking position in the presidential administration.", "url": "https://www.cnn.com/2021/06/23/politics/stephen-calk-trial-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325122313-stephen-calk-file-2019-super-tease.jpg", "publishedAt": "2021-06-23T22:41:54Z", "content": "New York (CNN)A former Chicago bank executive is on trial in Manhattan for allegedly taking bribes from onetime Donald Trump campaign Chairman Paul Manafort, hoping to trade loans for a high-ranking … [+3578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "People hate Congress. Again.", "description": "For the briefest of moments, Congress had what every middle schooler dreams of: rising popularity. And then, just like that, it was gone.", "url": "https://www.cnn.com/2021/06/23/politics/congress-approval-rating-gallup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420124249-us-capitol-dome-0413-super-tease.jpg", "publishedAt": "2021-06-23T22:30:43Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Biden nominates Cindy McCain as ambassador to the United Nations food agency", "description": "President Joe Biden announced Wednesday that he will nominate Cindy McCain as US ambassador to the United Nations Agencies for Food and Agriculture, elevating a longtime friend and Republican ally to an administration post.", "url": "https://www.cnn.com/2021/06/23/politics/cindy-mccain-biden-nominee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190925120923-cindy-mccain-file-super-tease.jpg", "publishedAt": "2021-06-23T22:26:16Z", "content": "Washington (CNN)President Joe Biden announced Wednesday that he will nominate Cindy McCain as US ambassador to the United Nations Agencies for Food and Agriculture, elevating a longtime friend and Re… [+2145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "His wife died by suicide after a 13-month battle with long-haul Covid. He hopes help is on the way for others", "description": "Filmmaker Nick Guthe says in the months before his wife, Heidi Ferrer, died by suicide, she suffered debilitating long-haul Covid symptoms.", "url": "https://www.cnn.com/2021/06/23/us/nick-guthe-heidi-ferrer-suicide-covid-long-haul/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623174848-nick-guthe-0623-super-tease.jpg", "publishedAt": "2021-06-23T22:25:21Z", "content": "(CNN)Filmmaker Nick Guthe says in the months before his wife, Heidi Ferrer, died by suicide, she suffered debilitating long-haul Covid symptoms. \r\nIt started last summer, with \"excruciating, unexplai… [+3081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Inside Hong Kong's biggest newspaper after news broke of its closing", "description": "Hong Kong's biggest pro-democracy newspaper, Apple Daily, will close its print and digital production as Beijing tightens its grip.", "url": "https://www.cnn.com/videos/business/2021/06/23/apple-daily-closure-hong-kong-ivan-watson-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623155218-0623-applenews2-super-tease.jpg", "publishedAt": "2021-06-23T22:06:17Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler and Kylie Atwood, CNN", "title": "Covid outbreak at US Embassy in Afghanistan grows", "description": "The Covid-19 outbreak at the US Embassy in Kabul has grown to 159 cases, according to a diplomatic cable sent Tuesday, as a devastating third wave of the deadly disease continues to hit Afghanistan.", "url": "https://www.cnn.com/2021/06/23/politics/covid-outbreak-us-embassy-kabul/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160330182055-state-department-logo-2007-super-tease.jpg", "publishedAt": "2021-06-23T21:47:04Z", "content": "(CNN)The Covid-19 outbreak at the US Embassy in Kabul has grown to 159 cases, according to a diplomatic cable sent Tuesday, as a devastating third wave of the deadly disease continues to hit Afghanis… [+5195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Family of inmate who died after being pepper sprayed in Brooklyn federal prison sues", "description": "The mother of a 35-year-old Black man who died last year after being pepper sprayed in a federal prison in Brooklyn is suing the government and unnamed correctional officers for wrongful death, according to court documents.", "url": "https://www.cnn.com/2021/06/23/us/jamel-floyd-wrongful-death-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200604171348-metropolitan-detention-center-file-super-tease.jpg", "publishedAt": "2021-06-23T21:36:42Z", "content": "(CNN)The mother of a 35-year-old Black man who died last year after being pepper sprayed in a federal prison in Brooklyn is suing the government and unnamed correctional officers for wrongful death, … [+4758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Drake Bell pleads guilty to attempted endangering of children", "description": "Actor Drake Bell, best known for the Nickelodeon sitcom \"Drake & Josh,\" pleaded guilty Wednesday to charges of attempted endangering of children and disseminating matter harmful to juveniles, according to the Cuyahoga County Prosecutor's Office in Ohio.", "url": "https://www.cnn.com/2021/06/23/entertainment/drake-bell-pleads-guilty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150602070400-drake-bell-file-super-169.jpg", "publishedAt": "2021-06-23T21:28:30Z", "content": "(CNN)Actor Drake Bell, best known for the Nickelodeon sitcom \"Drake &amp; Josh,\" pleaded guilty Wednesday to charges of attempted endangering of children and disseminating matter harmful to juveniles… [+1206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Conte, CNN", "title": "Top US general hits back against 'offensive' Republican criticism and defends Pentagon diversity efforts", "description": "The most senior general in the US military, Joint Chiefs Chairman Gen. Mark Milley, offered a forceful rebuke of renewed efforts from Republican members of Congress to question the Defense Department's diversity efforts and alleged embrace of \"critical race t…", "url": "https://www.cnn.com/2021/06/23/politics/milley-diversity-pentagon-gop/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190712104849-02-mark-milley-senate-hearing-super-tease.jpeg", "publishedAt": "2021-06-23T21:02:20Z", "content": "Washington (CNN)The most senior general in the US military, Joint Chiefs Chairman Gen. Mark Milley, offered a forceful rebuke of renewed efforts from Republican members of Congress to question the De… [+3920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Rising crime puts Democrats on edge", "description": "With spiking homicide rates, Democrats -- and President Biden -- are feeling the lure of \"law and order,\" writes Julian Zelizer, but there is a danger: Once the debate accelerates, more Democrats might be seduced into a \"tougher,\" more politically expedient, …", "url": "https://www.cnn.com/2021/06/23/opinions/homicide-rates-crime-law-and-order-biden-democrats-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620231604-minneapolis-shooting-0619-super-tease.jpeg", "publishedAt": "2021-06-23T20:58:23Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+7972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donie O'Sullivan and Dan Merica, CNN", "title": "Frustration and bewilderment: Emails show tension between Facebook and Biden campaign", "description": "People working with Joe Biden's presidential campaign repeatedly warned Facebook about violent campaign-related rhetoric on its platform during the heat of the 2020 election, but a series of email exchanges reveals how the social media giant sometimes brushed…", "url": "https://www.cnn.com/2021/06/23/politics/facebook-dnc-biden-emails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210527100552-facebook-super-tease.jpg", "publishedAt": "2021-06-23T20:52:30Z", "content": "(CNN)People working with Joe Biden's presidential campaign repeatedly warned Facebook about violent campaign-related rhetoric on its platform during the heat of the 2020 election, but a series of ema… [+9781 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Democrats urge Biden to extend student loan pause until April 2022", "description": "Key Democratic lawmakers are calling on President Joe Biden to extend the pandemic-related student loan payment pause another six months beyond October -- or until the economy reaches pre-pandemic employment levels, whichever is longer.", "url": "https://www.cnn.com/2021/06/23/politics/student-loan-payment-pause-extension/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210204163107-schumer-student-loan-debt-presser-0204-super-tease.jpg", "publishedAt": "2021-06-23T20:50:30Z", "content": "Washington (CNN)Key Democratic lawmakers are calling on President Joe Biden to extend the pandemic-related student loan payment pause another six months beyond October -- or until the economy reaches… [+3306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Cannabis use may be linked with suicidal thoughts, plans and attempts in young adults, study finds", "description": "During a time of increases in both cannabis use and suicidality, people who use cannabis are more likely to think about, plan and attempt suicide, according to a study published Tuesday in the journal JAMA Network Open.", "url": "https://www.cnn.com/2021/06/23/health/weed-cannabis-suicide-risk-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180417171858-01-smoking-marijuana-stock-super-tease.jpg", "publishedAt": "2021-06-23T20:27:25Z", "content": "If you or someone you know is struggling with suicidal thoughts or mental health matters, please call the National Suicide Prevention Lifeline at 1-800-273-8255 to connect with a trained counselor or… [+6688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Defense secretary: National Guard readiness will 'begin to erode' without Capitol riot reimbursement", "description": "Defense Secretary Lloyd Austin said Wednesday the readiness of the National Guard will \"begin to erode\" if it's not reimbursed for protecting the US Capitol in the aftermath of the January 6 insurrection.", "url": "https://www.cnn.com/2021/06/23/politics/national-guard-capitol-riot-reimbursement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620193042-01-capitol-riots-0106-super-tease.jpg", "publishedAt": "2021-06-23T20:17:46Z", "content": "(CNN)Defense Secretary Lloyd Austin said Wednesday the readiness of the National Guard will \"begin to erode\" if it's not reimbursed for protecting the US Capitol in the aftermath of the January 6 ins… [+2429 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi and David Wright, CNN", "title": "Michigan GOP investigation finds no evidence of widespread fraud in 2020 election", "description": "A Republican-led investigation concluded Wednesday that there was \"no evidence of widespread or systematic fraud\" in Michigan's 2020 election, rejecting claims by former President Donald Trump and his allies that the state's election results were fraudulent.", "url": "https://www.cnn.com/2021/06/23/politics/michigan-gop-committee-investigation-2020-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623090001-01-michigan-gop-investigation-super-tease.jpg", "publishedAt": "2021-06-23T19:36:13Z", "content": "(CNN)A Republican-led investigation concluded Wednesday that there was \"no evidence of widespread or systematic fraud\" in Michigan's 2020 election, rejecting claims by former President Donald Trump a… [+4964 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz, CNN Business", "title": "Gender neutral clothes are the next big thing in fashion", "description": null, "url": "https://www.cnn.com/2021/06/23/business/gender-neutral-fashion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623135543-saks-off-5th-gender-neutral-clothing-super-tease.jpg", "publishedAt": "2021-06-23T19:32:28Z", "content": "New York (CNN)When walking into a traditional department store or browsing your favorite online retailer, shoppers typically navigate clothing options by first choosing a section based on its gender … [+3742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, Katelyn Polantz and Hannah Rabinowitz, CNN", "title": "Indiana woman gets probation for role in US Capitol riot, is first sentenced in insurrection", "description": "A Trump supporter who spent 10 minutes inside the US Capitol during the January 6 insurrection was sentenced to probation Wednesday, avoiding jail, and becoming the first rioter to learn their punishment in the riot investigation.", "url": "https://www.cnn.com/2021/06/23/politics/capitol-rioter-sentenced/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321231141-capitol-hill-riot-0106-super-tease.jpg", "publishedAt": "2021-06-23T19:27:31Z", "content": "(CNN)A Trump supporter who spent 10 minutes inside the US Capitol during the January 6 insurrection was sentenced to probation Wednesday, avoiding jail, and becoming the first rioter to learn their p… [+7044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zach Wasser for CNN Business", "title": "Here's why it's not a great time to become a real estate agent", "description": "As home prices soared during the pandemic, people started racing toward the real estate sales industry seeking to cash in on the housing gold rush.", "url": "https://www.cnn.com/2021/06/23/homes/more-realtors-than-homes-for-sale-feseries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623100040-restricted-01-austin-realtors-super-tease.jpg", "publishedAt": "2021-06-23T19:26:22Z", "content": "Austin, TX (CNN)As home prices soared during the pandemic, people started racing toward the real estate sales industry seeking to cash in on the housing gold rush. \r\nBut that surge in new real estate… [+6569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by James Moore", "title": "Why lawsuit-happy Texas Republicans win even when they lose", "description": "James Moore writes that Texas Republicans often pursue losing cases against the federal government because they serve conservative political interests. In weaponizing the court system against their political opponents, they are able to turn out large numbers …", "url": "https://www.cnn.com/2021/06/23/opinions/texas-republicans-lawsuit-happy-moore/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623141705-greg-abbott-ken-paxton-2015-restricted-super-tease.jpg", "publishedAt": "2021-06-23T19:14:50Z", "content": "James Moore has been reporting and analyzing Texas politics since 1975. He writes a weekly newsletter at Texas to the World. The views expressed in this commentary are his own. View more opinion on C… [+5148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Sturla, CNN", "title": "Remains of Native American children to be exhumed at site of former boarding school", "description": "The remains of 10 children and young adults who died at a Pennsylvania boarding school for Native Americans more than a century ago are expected to be exhumed and returned to their families, according to the Office of Army Cemeteries.", "url": "https://www.cnn.com/2021/06/23/us/carlisle-indian-industrial-school-remains-exhumed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623120749-01-carlisle-indian-industrial-school-remains-exhumed-super-tease.jpg", "publishedAt": "2021-06-23T19:01:47Z", "content": "(CNN)The remains of 10 children and young adults who died at a Pennsylvania boarding school for Native Americans more than a century ago are expected to be exhumed and returned to their families, acc… [+4206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jacob Krol", "title": "The new Echo Show 8 is more of the same — and that's not a bad thing", "description": "The new Echo Show 8 is here, which keeps the same design and all of the functionality, but packs in a new camera for improved video calls and photography.", "url": "https://www.cnn.com/2021/06/23/cnn-underscored/amazon-echo-show-8-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623144011-7-echo-show-8-review-super-169.jpg", "publishedAt": "2021-06-23T18:58:56Z", "content": "The new Echo Show 8 is here, which keeps the same design and all of the functionality, but packs in a new camera for improved video calls and photography.\r\nThe Echo Show 8 is the $129.99 smart displa… [+8040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand and Tara Subramaniam, CNN", "title": "Fact check: Is Biden to blame for high gas prices?", "description": "Partisan finger pointing is nothing new in Washington, and with prices increasing for a wide-range of everyday items, the blame game continues apace. One such product being used as a political weapon is gasoline.", "url": "https://www.cnn.com/2021/06/23/politics/joe-biden-gas-price-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517142852-increase-prices-us-dinero-super-tease.jpg", "publishedAt": "2021-06-23T18:53:35Z", "content": "(CNN)Partisan finger pointing is nothing new in Washington, and with prices increasing for a wide-range of everyday items, the blame game continues apace. One such product being used as a political w… [+4227 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Fritz, CNN", "title": "Incredible before-and-after imagery shows impact of the California drought in one year", "description": "Satellite images captured a year apart illustrate the severity of the California drought.", "url": "https://www.cnn.com/2021/06/23/weather/california-drought-satellite-images/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623135737-01-california-water-reservoirs-before-after-super-tease.jpg", "publishedAt": "2021-06-23T18:53:32Z", "content": "(CNN)Remarkable satellite images captured a year apart illustrate the severity of the California drought.\r\nBetween June 2020 and June 2021, Angeles National Forest went from green and lush to brown a… [+1727 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, Mike Hayes and <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, CNN", "title": "Britney Spears addresses court in conservatorship hearing", "description": "Britney Spears is expected to address the court during a hearing about her conservatorship. Follow here for the latest.", "url": "https://www.cnn.com/entertainment/live-news/britney-spears-court-hearing-conservatorship-june-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622114258-04-britney-spears-file-2018-super-tease.jpg", "publishedAt": "2021-06-23T17:59:46Z", "content": "Britney Spears will remotely address a court regarding her conservatorship, a legal decision to appoint a guardian to manage the finances, medical decisions and overall daily life of another person. … [+1505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lisa Kaltenegger", "title": "Could alien astronomers have spotted Earth?", "description": "The news that we'll soon have an unclassified report sent to Congress on \"unidentified aerial phenomena\" -- commonly known as \"UFOs\" -- has sparked widespread interest in the search for life in the universe. Might there be civilizations out there? Could there…", "url": "https://www.cnn.com/2021/06/23/opinions/aliens-spot-earth-opinion-kaltenegger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200107143732-03-wonders-of-the-universe-super-tease.jpg", "publishedAt": "2021-06-23T17:58:09Z", "content": "Lisa Kaltenegger is the director of the Carl Sagan Institute at Cornell University and associate professor in astronomy. She is an expert in modeling potential habitable worlds and their spectral fin… [+5696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "He was fatally shot in the head trying to drive away from brazen robbers on a New York City street", "description": "A robbery turned fatal when three gunmen approached two men in New York City and demanded their property, police said.", "url": "https://www.cnn.com/2021/06/23/us/ny-fatal-shooting-robbery-milton-grant-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623110705-01-milton-grant-super-tease.jpg", "publishedAt": "2021-06-23T17:57:20Z", "content": "(CNN)A robbery turned fatal when three gunmen approached two men in New York City and demanded their property, police said.\r\nMilton Grant, 34, was shot in the head early Monday morning as he tried to… [+4202 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Detained immigrants on hunger strike over poor conditions at ICE facilities were force-fed, report says", "description": "Immigration and Customs Enforcement used involuntary and invasive medical procedures, such as force-feeding and forced hydration, in response to hunger strikes by detained immigrants, according to a newly released report from the American Civil Liberties Unio…", "url": "https://www.cnn.com/2021/06/23/politics/ice-immigrants-hunger-strikes-force-fed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623131031-ice-hunger-strike-john-super-tease.jpg", "publishedAt": "2021-06-23T17:51:21Z", "content": "(CNN)Immigration and Customs Enforcement used involuntary and invasive medical procedures, such as force-feeding and forced hydration, in response to hunger strikes by detained immigrants, according … [+5053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Judge blocks Iowa abortion law requiring 24-hour waiting period", "description": "An Iowa law requiring women to wait 24 hours before getting an abortion was permanently blocked by a district judge on Monday.", "url": "https://www.cnn.com/2021/06/23/politics/iowa-24-hour-abortion-law-blocked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623083126-02-iowa-abortion-rally-file-super-tease.jpg", "publishedAt": "2021-06-23T17:21:54Z", "content": "(CNN)An Iowa law requiring women to wait 24 hours before getting an abortion was permanently blocked by a district judge on Monday.\r\nDistrict Judge Mitchell E. Turner ruled the law was unconstitution… [+2923 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "States are helping unemployed parents pay for childcare while they look for work", "description": "As states seek to help unemployed residents return to the workforce amid widespread labor shortages, some are providing childcare subsidies to parents while they look for jobs.", "url": "https://www.cnn.com/2021/06/23/politics/unemployed-parents-childcare-assistance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622195317-day-care-texas-restricted-super-tease.jpg", "publishedAt": "2021-06-23T17:19:39Z", "content": "(CNN)As states seek to help unemployed residents return to the workforce amid widespread labor shortages, some are providing childcare subsidies to parents while they look for jobs.\r\nThe Texas Workfo… [+3126 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso and Eric Levenson, CNN", "title": "Pedestrian bridge collapses onto DC highway, injuring several people", "description": "A pedestrian bridge collapsed onto Interstate 295 in Washington, DC on Wednesday, injuring several people and blocking the highway, according to tweets from DC Fire and EMS.", "url": "https://www.cnn.com/2021/06/23/us/pedestrian-bridge-collapse-washington-dc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623130131-dc-bridge-collapse-screengrab-super-tease.jpg", "publishedAt": "2021-06-23T17:10:04Z", "content": "(CNN)A pedestrian bridge collapsed onto Interstate 295 in Washington, DC midday Wednesday, injuring several people and blocking the highway in both directions, according to tweets from DC Fire and EM… [+713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Don't miss the latest evidence Ron DeSantis is *definitely* getting ready to run for president", "description": "Even as Donald Trump continues to stoke insane conspiracy theories about how he will be \"reinstated\" as president this summer, Florida Gov. Ron DeSantis is actively positioning himself to be the rightful heir to Trumpism in 2024.", "url": "https://www.cnn.com/2021/06/23/politics/ron-desantis-florida-governor-2024-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210316195635-ron-desantis-file-super-tease.jpg", "publishedAt": "2021-06-23T17:03:55Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Nimi Princewill; video by Stephanie Busari, CNN", "title": "Nigerian digital artists are making a mark with NFTs", "description": "Nigerian art creators such as Osinachi are leveraging the art world's shift to the digital world through NFTs.", "url": "https://www.cnn.com/2021/06/23/africa/nigeria-artist-nft-cryptocurrency-lgs-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621153215-nigeria-nft-art-mpa-super-tease.jpg", "publishedAt": "2021-06-23T17:00:45Z", "content": "Lagos, Nigeria (CNN)Nigerian art creators are leveraging the art world's shift to the digital world through NFTs. And they are increasing their net worth while they're at it, despite a government cra… [+3659 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "What the NCAA ruling really means for student athletes", "description": "The Supreme Court ruled this week that NCAA student athletes can be compensated for education-related expenses. Here's how that decision could help shape these young athletes' future.", "url": "https://www.cnn.com/2021/06/23/us/ncaa-supreme-court-ruling-explainer-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405221130-03-march-madness-championship-restricted-super-tease.jpg", "publishedAt": "2021-06-23T16:53:07Z", "content": "(CNN)In a decision that could shake up college sports, the Supreme Court ruled this week against the NCAA's restrictions on education-related perks for student athletes. \r\nThe case affirmed lower cou… [+8980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and Mike Hayes, CNN", "title": "Biden to speak about gun violence as US crime surges", "description": "President Biden will announce a comprehensive strategy on violent crime prevention — with a particular emphasis on gun crimes — amid a nationwide spike in violent crime. Follow here for the latest.", "url": "https://www.cnn.com/politics/live-news/joe-biden-crime-speech-06-23-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620045958-flint-shooting-juneteenth-parade-super-tease.jpg", "publishedAt": "2021-06-23T16:21:51Z", "content": "Major American cities saw a 33% increase in homicides last year as a pandemic swept across the country, millions of people joined protests against racial injustice and police brutality, and the econo… [+1656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "The new 'Suicide Squad' trailer has dropped", "description": "The latest trailer for \"The Suicide Squad\" is here, thanks to some cast members who released it a little early, according to director James Gunn.", "url": "https://www.cnn.com/2021/06/23/entertainment/suicide-squad-trailer-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623091025-01-suicide-squad-rain-screengrab-super-tease.jpg", "publishedAt": "2021-06-23T16:07:43Z", "content": "(CNN)The latest trailer for \"The Suicide Squad\" is here, thanks to some cast members who released it a little early, according to director James Gunn. \r\nThe trailer features the squad being recruited… [+911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Euro 2020: Denmark provides feel good story of group stages with unlikely qualification", "description": "In the space of just nine days, Copenhagen's Parken Stadium played host to Euro 2020's worst moment and then its best.", "url": "https://edition.cnn.com/2021/06/23/football/euro-2020-group-stage-review-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621174144-denmark-damsgaard-goal-super-tease.jpg", "publishedAt": "2021-06-23T16:03:05Z", "content": "(CNN)In the space of just nine days, Copenhagen's Parken Stadium played host to Euro 2020's worst moment and then its best.\r\nOn July 12, Denmark's midfield talisman Christian Eriksen collapsed during… [+5013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eleanor Pickston and Amy Woodyatt, CNN", "title": "Police officer found guilty of killing former Aston Villa star Dalian Atkinson", "description": "A British police officer has been found guilty of the manslaughter of former professional soccer player Dalian Atkinson, but he was cleared of his murder, a spokesperson for Birmingham Crown Court told CNN on Wednesday.", "url": "https://edition.cnn.com/2021/06/23/football/dalian-atkinson-intl-scli-gbr-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623101247-01-dalian-atkinson-intl-scli-super-tease.jpg", "publishedAt": "2021-06-23T15:53:14Z", "content": "London (CNN)A British police officer has been found guilty of the manslaughter of former professional soccer player Dalian Atkinson, but he was cleared of his murder, a spokesperson for Birmingham Cr… [+2753 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawn Nottingham and Delano Massey, CNN", "title": "Nikole Hannah-Jones won't take UNC position without tenure, lawyers say", "description": "Pulitzer Prize-winning journalist Nikole Hannah-Jones won't take a position at the University of North Carolina-Chapel Hill without tenure, according to a letter from her legal team obtained by NC Policy Watch and confirmed by CNN.", "url": "https://www.cnn.com/2021/06/23/us/nikole-hannah-jones-unc-tenure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623093903-nikole-hannah-jones-2021-super-tease.jpg", "publishedAt": "2021-06-23T15:38:21Z", "content": "(CNN)Pulitzer Prize-winning journalist Nikole Hannah-Jones won't take a position at the University of North Carolina-Chapel Hill without tenure, according to a letter from her legal team obtained by … [+1994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung and Clare Duffy, CNN Business", "title": "House antitrust bills could change the internet as we know it. Here's how", "description": "Over the last two decades, a handful of large tech companies have pushed into nearly every corner of our lives — from communications and retail to financial services, healthcare and automobiles.", "url": "https://www.cnn.com/2021/06/23/tech/tech-house-antitrust-bills-explained/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623093230-restricted-u-s-capitol-0622-super-tease.jpg", "publishedAt": "2021-06-23T15:37:29Z", "content": "American Innovation and Choice Online Act: Bars large tech platforms from preferencing their own products and services, and disadvantaging rivals.\r\nPlatform Competition and Opportunity Act: Prohibits… [+778 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "These potentially habitable exoplanets can see Earth as it evolves", "description": "Human civilization began to flourish on Earth about 5,000 years ago, and 1,715 star systems within 326 light-years of Earth could have seen our planet over that time. Some of these stars may have even received radio waves from Earth.", "url": "https://www.cnn.com/2021/06/23/world/earth-sight-exoplanets-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622153231-stars-earth-exoplanet-study-restricted-super-tease.jpeg", "publishedAt": "2021-06-23T15:18:50Z", "content": "(CNN)As human civilization began to flourish on Earth about 5,000 years ago, 1,715 star systems within 326 light-years of Earth could have seen our planet over that time. And over the next 5,000 year… [+6428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Katia Hetter, CNN", "title": "Is it safe to travel this summer? A medical expert explains", "description": "As parts of the world welcome back visitors, here's a medical expert's advice on what to consider when deciding whether and where to travel this summer.", "url": "https://www.cnn.com/travel/article/travel-during-covid-safe-wen-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210530100504-europe-travel-patmos-greece-super-tease.jpg", "publishedAt": "2021-06-23T15:17:46Z", "content": "(CNN) As more people get vaccinated and coronavirus infection rates drop in many parts of the world, people are traveling again in larger numbers. \r\nThe European Union has announced that it is liftin… [+9821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "How is the early end of pandemic unemployment benefits affecting job hunters? Share your story.", "description": "Citing widespread labor shortages, at least 26 states are ending pandemic unemployment benefits early in an effort to push more people back into the workforce.", "url": "https://www.cnn.com/2021/06/23/politics/unemployment-benefits-job-search-callout/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210617084505-us-jobless-claims-super-tease.jpg", "publishedAt": "2021-06-23T15:16:57Z", "content": "(CNN)Citing widespread labor shortages, at least 26 states are ending pandemic unemployment benefits early in an effort to push more people back into the workforce.\r\nAre you an employer in one of tho… [+303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathryn Vasel, CNN Business", "title": "How PepsiCo is rethinking the office: More flexibility with remote work. No assigned desks", "description": "When it comes to the future of work, PepsiCo is re-imagining the role of the office and giving employees more flexibility to choose where they work.", "url": "https://www.cnn.com/2021/06/23/success/pepsi-return-to-work-plans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621162603-restricted-pepsico-sergio-ezama-super-tease.jpg", "publishedAt": "2021-06-23T15:13:57Z", "content": "The first key idea is there is no default workplace. This idea of the physical office as the default environment doesn't exist any more\"\r\nSergio Ezama, PepsiCo's Chief Talent Officer"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A Black WWII veteran who was denied the Purple Heart due to racism finally receives the honor at 99", "description": "For nearly eight decades, former Army Private Osceola \"Ozzie\" Fletcher's experience in the Battle of Normandy went unrecognized.", "url": "https://www.cnn.com/2021/06/23/us/ozzie-fletcher-ww2-vet-purple-heart-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622154045-01-ozzie-fletcher-purple-heart-super-tease.jpg", "publishedAt": "2021-06-23T15:12:57Z", "content": "(CNN)For nearly eight decades, former Army Private Osceola \"Ozzie\" Fletcher's experience in the Battle of Normandy went unrecognized.\r\nShortly after D-Day in 1944, Fletcher was in the back of a vehic… [+4075 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The utter predictability of Jared and Ivanka ghosting Donald Trump", "description": "Here's the paragraph you need to read today:", "url": "https://www.cnn.com/2021/06/23/politics/jared-kushner-ivanka-trump-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201115070140-02-jared-kushner-ivanka-trump-file-super-tease.jpg", "publishedAt": "2021-06-23T15:06:12Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "READ: Supreme Court opinion in California unions and property rights case", "description": "The Supreme Court said Wednesday that California cannot allow unions to enter the private property of agricultural businesses to address workers unless the businesses are compensated for the visit, in a case that could have broad property rights implications.", "url": "https://www.cnn.com/2021/06/23/politics/scotus-opinion-ca-unions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210607094912-01-scotus-0601-super-tease.jpg", "publishedAt": "2021-06-23T14:55:52Z", "content": "(CNN)The Supreme Court said Wednesday that California cannot allow unions to enter the private property of agricultural businesses to address workers unless the businesses are compensated for the vis… [+64 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Phil Mattingly, CNN", "title": "Biden aims for high-stakes meeting with Xi Jinping with Putin summit in the rearview", "description": "President Joe Biden's closely watched summit last week with his Russian counterpart affirmed his belief that nothing can replicate a face-to-face with a tough adversary. Now, he and his aides are looking ahead to a higher-stakes encounter: a meeting with Chin…", "url": "https://www.cnn.com/2021/06/23/politics/joe-biden-xi-jinping-meeting-planning/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210610232615-biden-jinping-split-super-tease.jpg", "publishedAt": "2021-06-23T14:54:41Z", "content": "(CNN)President Joe Biden's closely watched summit last week with his Russian counterpart affirmed his belief that nothing can replicate a face-to-face with a tough adversary. Now, he and his aides ar… [+9844 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "Alleged Oath Keeper to plead guilty in first among major Capitol riot conspiracy cases", "description": "An alleged member of the Oath Keepers will plead guilty on Wednesday to charges related to the January 6 insurrection, the first plea deal among the Capitol riot cases against extremist groups, a notice filed in court says.", "url": "https://www.cnn.com/2021/06/23/politics/oath-keeper-capitol-riot-graydon-young/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620193042-01-capitol-riots-0106-super-tease.jpg", "publishedAt": "2021-06-23T14:48:53Z", "content": "Washington (CNN)An alleged member of the Oath Keepers will plead guilty on Wednesday to charges related to the January 6 insurrection, the first plea deal among the Capitol riot cases against extremi… [+1740 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards", "title": "The comfiest pants for lounging around the house", "description": "From cotton joggers to drawstring picks, these are the best lounge pants for doing anything and everything in, according to style experts.", "url": "https://www.cnn.com/2021/06/23/cnn-underscored/best-lounge-pants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618114223-best-lounge-pants-lead-super-169.jpg", "publishedAt": "2021-06-23T14:01:00Z", "content": "Though you may be starting to shop for some fancy going out clothes for the first time in more than a year, were here with fantastic news from fashion experts: Lounge pants are here to stay, says Dur… [+5338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jolie Kerr", "title": "20 products under $25 that help organize your garage", "description": "From heavy-duty hooks to storage bins, these are the 20 products under $25 that you need to organize your garage.", "url": "https://www.cnn.com/2021/06/23/cnn-underscored/garage-organization-ideas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210615101457-garage-lead-image-super-169.jpg", "publishedAt": "2021-06-23T13:25:25Z", "content": "The garage is a place where we tend to put everything that doesnt have another place to go: Holiday decorations, bins of hand-me-down clothing and extra bedding, tools and sporting equipment and extr… [+5721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica and Rob McLean, CNN Business", "title": "Morgan Stanley's New York office bans unvaccinated staff and clients", "description": "Morgan Stanley plans to ban workers from its New York headquarters if they have not received a Covid-19 vaccine. The rule will apply to non-vaccinated guests and clients as well.", "url": "https://www.cnn.com/2021/06/23/investing/morgan-stanley-unvaccinated-employees-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622182035-morgan-stanley-ny-headquarters-restricted-super-tease.jpg", "publishedAt": "2021-06-23T13:24:30Z", "content": "New York (CNN Business)Morgan Stanley plans to ban workers from its New York headquarters if they have not received a Covid-19 vaccine. The rule will apply to non-vaccinated guests and clients as wel… [+2464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "You can still shop these non-Amazon Prime Day sales today", "description": "Amazon Prime Day is has come and gone, but even if you're not an Amazon shopper, there are dozens of deals that you can still shop from plenty of other retailers. Many of your favorites were (and still are!) offering steep discounts of their own to compete wi…", "url": "https://www.cnn.com/2021/06/23/cnn-underscored/prime-day-2021-alternative-sales/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618154747-underscored-prime-day-2021-non-prime-day-sales-article-lead-image-super-169.jpg", "publishedAt": "2021-06-23T12:49:30Z", "content": "Amazon Prime Day is has come and gone, but even if youre not an Amazon shopper, there are dozens of deals that you can still shop from plenty of other retailers. Many of your favorites were (and stil… [+9464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Melissa Macaya, Mike Hayes and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the Covid-19 pandemic and the Delta variant", "description": "Experts now say that dangerous Delta variant could cause a full-on resurgence of coronavirus in the US in the coming months. Follow here for the latest updates on vaccines, variants and the global pandemic.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-06-23-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-06-23T12:19:07Z", "content": "A member of the Uganda Olympic team has tested positive for coronavirus on Wednesday, a Division of Izumisano City official, Takahide Matsufuji, said over the phone to CNN. \r\nThe athlete, who is in h… [+926 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Amazon Prime Day 2021 may be over — but these deals are still live", "description": "Prime Day 2021 was a 48-hour deal extravaganza, to say the least, and while Amazon's biggest sale event is officially over, savings on select products seem to be here to stay — at least for now.", "url": "https://www.cnn.com/2021/06/23/cnn-underscored/amazon-prime-day-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210616145230-underscored-prime-day-2021-lead-image-super-169.jpg", "publishedAt": "2021-06-23T12:12:04Z", "content": "This article is part of CNN Underscoreds wall-to-wall coverage of Amazon Prime Day. To find all of our coverage, click here. \r\nAmazon Prime Day 2021 was a 48-hour deal extravaganza, to say the least,… [+8864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "Italy moves to halt overtourism before travel restarts", "description": "The Uffizi Diffusi project will see Renaissance artworks from the Uffizi Galleries exhibited around the region of Tuscany, turning the area into one giant gallery in a bid to combat overtourism.", "url": "https://www.cnn.com/travel/article/italy-uffizi-diffusi-launch-venues-tuscany-cdm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623122135-florence-duomo-super-tease.jpg", "publishedAt": "2021-06-23T12:05:49Z", "content": "Florence, Italy (CNN) Its founder calls it \"the biggest shakeup in Italy\" in the past decade, it's been hailed as a \"vital way to combat overtourism,\" and now it's ready: the region of Tuscany has ta… [+7955 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett and Gabby Orr, CNN", "title": "Ivanka Trump and Jared Kushner distance themselves from the former President and his constant complaints", "description": "With each passing day away from Washington, former President Donald Trump's grievances continue unabated. And those complaints appear to be driving away two of the people who were closest to him during his White House tenure: his daughter Ivanka Trump and son…", "url": "https://www.cnn.com/2021/06/23/politics/donald-trump-ivanka-trump-jared-kushner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115071514-file-01-jared-kushner-ivanka-trump-2020-super-tease.jpg", "publishedAt": "2021-06-23T12:00:20Z", "content": "(CNN)With each passing day away from Washington, former President Donald Trump's grievances continue unabated. And those complaints appear to be driving away two of the people who were closest to him… [+12567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Oliver Darcy here at 11:15pm ET Tuesday . In this edition: Two reporters were denied entry to a NYC mayoral candidate's election night party; the Capital Gazette killer is set to go on trial; NYT will require employees back in the office 3x a week; Steve Scul…", "url": "https://view.newsletters.cnn.com/messages/1624418234971df514684fee3/raw", "urlToImage": null, "publishedAt": "2021-06-23T12:00:08Z", "content": "Oliver Darcy here at 11:15pm ET Tuesday. In this edition: Two reporters were denied entry to a NYC mayoral candidate's election night party; the Capital Gazette killer is set to go on trial; NYT will… [+1715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Covid-19 vaccine boosters may be necessary. Here's what you need to know", "description": "Vaccine makers are preparing for a next possible phase of the Covid-19 vaccine rollout: booster doses.", "url": "https://www.cnn.com/2021/06/23/health/covid-19-vaccine-boosters-questions-update-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621021756-covid-vaccine-new-york-0618-super-tease.jpg", "publishedAt": "2021-06-23T11:42:41Z", "content": "(CNN)Vaccine makers are preparing for a next possible phase of the Covid-19 vaccine rollout: booster doses.\r\nCurrently three coronavirus vaccines are authorized for emergency use in the United States… [+11957 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Nora Neus, CNN\nVideo by Lacey Russell, Nick Scott and Madeleine Stix", "title": "Trans women are still incarcerated with men and it's putting their lives at risk", "description": "Jasmine Rose Jones is a woman. But for much of the last 23 years, she was incarcerated in a men's facility, and she says she was subjected to rape, sexual assault and abuse, just because she is transgender.", "url": "https://www.cnn.com/2021/06/23/us/trans-women-incarceration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622165859-barbed-wire-prison-fence-stock-super-tease.jpg", "publishedAt": "2021-06-23T11:28:04Z", "content": "Story by Nora Neus, CNNVideo by Lacey Russell, Nick Scott and Madeleine Stix\r\nUpdated 7:28 AM ET, Wed June 23, 2021\r\n (CNN)Jasmine Rose Jones is a woman. But for much of the last 23 years, she was in… [+17116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Biden made it easier to get a work visa. Here's why foreign workers still can't get to the US.", "description": "When President Joe Biden revoked a Trump-era executive order in February that had temporarily banned some immigrant visas during the coronavirus pandemic, he touted the way US industries could again \"utilize talent from around the world.\"", "url": "https://www.cnn.com/2021/06/23/politics/biden-visa-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200623101306-j1-visa-file-super-tease.jpg", "publishedAt": "2021-06-23T11:11:44Z", "content": "Washington (CNN)When President Joe Biden revoked a Trump-era executive order in February that had temporarily banned some immigrant visas during the coronavirus pandemic, he touted the way US industr… [+5284 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "On sale: $125,000 balloon trips to the edge of space", "description": "Florida company Space Perspective plans to fly passengers to the edge of space in a pressurized capsule suspended from a balloon, and tickets can now be reserved for $125,000 a pop. But is it all hot air?", "url": "https://www.cnn.com/travel/article/spaceship-neptune-balloon-flights-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200702163027-space-perspective-capsule-high-alt-291019-super-tease.jpg", "publishedAt": "2021-06-23T11:08:19Z", "content": "(CNN) If you're trying to avoid airborne viruses, heading to a near vacuum might not be the worst idea. \r\nA Florida company is planning to fly passengers to the edge of space in a high-tech version o… [+4389 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sandra Garza", "title": "I can't forgive the people who won't admit my partner, Brian Sicknick, was a hero", "description": "Sandra Garza met Sicknick in 2008, bonded over blueberry pancakes, past military experience and a passion for helping others. His death, after defending the Capitol Jan. 6, left her drowning in grief, she writes, but it turned to rage when she watched Senator…", "url": "https://www.cnn.com/2021/06/23/opinions/brian-sicknick-partner-grief-garza/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622181541-01-sandra-garza-brian-sicknick-super-tease.jpg", "publishedAt": "2021-06-23T11:06:35Z", "content": "Sandra Garza is a licensed clinical social worker and was the long-time partner of Brian Sicknick, the Capitol Police Officer who protected the US Capitol from pro-Trump rioters during the Jan. 6 ins… [+7732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "Nigeria announces talks with Twitter after ban, as Ecowas court bars government crackdown on users", "description": "Nigerian President Muhammadu Buhari has assembled a reconciliation team to lead negotiations with Twitter, more than two weeks after the American social media company's operation was indefinitely suspended in the West African nation.", "url": "https://www.cnn.com/2021/06/23/africa/nigeria-negotiate-twitter-ban-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190218141025-07-muhammadu-buhari-unfurled-file-super-tease.jpg", "publishedAt": "2021-06-23T10:52:19Z", "content": "Abuja, Nigeria (CNN)Nigerian President Muhammadu Buhari has assembled a reconciliation team to lead negotiations with Twitter, more than two weeks after the American social media company's operation … [+2300 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Young, Dakin Andone and Pamela Kirkland, CNN", "title": "Gun sales rise among Black people as they look for firearm training and education", "description": "Deborah Roberts grew up in a family of gun owners. But it wasn't until March this year that the 68-year-old finally pulled the trigger and purchased her own firearm.", "url": "https://www.cnn.com/2021/06/23/us/black-gun-owners-sales-rising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210612184328-05-black-gun-owners-super-tease.jpg", "publishedAt": "2021-06-23T10:28:32Z", "content": "Atlanta (CNN)Deborah Roberts grew up in a family of gun owners. But it wasn't until March this year that the 68-year-old finally pulled the trigger and purchased her own firearm. \r\n\"I think the rheto… [+5427 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "After a week of turmoil, stocks are in record territory again", "description": "Here's the latest news on what stocks are doing.", "url": "https://www.cnn.com/business/live-news/stock-market-news-062321/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604091741-nyse-0603-super-tease.jpg", "publishedAt": "2021-06-23T10:25:18Z", "content": "Home prices in the US continued to climb in May, rising at the fastest pace on record and reaching new highs. But those high prices and continued low inventory are squeezing would-be buyers out of th… [+486 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for June 23: Voting rights, US violence, Covid-19, Hong Kong, Brexit", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/06/23/us/five-things-june-23-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623050208-voting-rights-rally-0609-super-tease.jpg", "publishedAt": "2021-06-23T10:19:13Z", "content": "(CNN)The Amazon rainforest may be headed for another devastating fire season. After a destructive 2020 and with drought conditions in Brazil, the forest has rarely been drier than it is right now. \r\n… [+5565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Lauren Fox, CNN", "title": "House Progressives demand action after voting rights bill fails", "description": "Now that Senate Republicans blocked the path forward on a monumental ethics reform and elections bill, progressives are frustrated, openly calling for an end to the filibuster even as key moderates have made clear they won't be changing it.", "url": "https://www.cnn.com/2021/06/23/politics/progressive-reaction-voting-rights-bill-fails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415182216-rep-mondaire-jones-super-tease.jpg", "publishedAt": "2021-06-23T10:11:14Z", "content": "(CNN)Now that Senate Republicans blocked the path forward on a monumental ethics reform and elections bill, progressives are frustrated, openly calling for an end to the filibuster even as key modera… [+10556 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Lauren Fox, CNN", "title": "House Progressives demand action after voting rights bill fails", "description": "Now that Senate Republicans blocked the path forward on a monumental ethics reform and elections bill, progressives are frustrated, openly calling for an end to the filibuster even as key moderates have made clear they won't be changing it.", "url": "https://www.cnn.com/2021/06/23/politics/progressive-reaction-voting-rights-bill-fails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415182216-rep-mondaire-jones-super-tease.jpg", "publishedAt": "2021-06-23T10:11:14Z", "content": "(CNN)Now that Senate Republicans blocked the path forward on a monumental ethics reform and elections bill, progressives are frustrated, openly calling for an end to the filibuster even as key modera… [+10556 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Tom Perez launches bid for Maryland governor", "description": "Tom Perez, the former chair of the Democratic National Committee, announced Wednesday that he was running for governor of Maryland, seeking to succeed term-limited Republican Gov. Larry Hogan.", "url": "https://www.cnn.com/2021/06/23/politics/tom-perez-maryland-governor-announcement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200220171240-03-tom-perez-0219-restricted-super-tease.jpg", "publishedAt": "2021-06-23T10:00:55Z", "content": "(CNN)Tom Perez, the former chair of the Democratic National Committee, announced Wednesday that he was running for governor of Maryland, seeking to succeed term-limited Republican Gov. Larry Hogan.\r\n… [+3280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi and Joe Sutton, CNN", "title": "Pacific Northwest expected to endure oppressive heat this weekend amid the West's drought misery", "description": "Parts of Oregon and Washington state will be under an excessive heat watch this weekend as scorching, possibly record-breaking heat settles into the region.", "url": "https://www.cnn.com/2021/06/23/weather/pacific-northwest-extreme-heat-west-drought/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623034144-west-extreme-heat-super-tease.jpg", "publishedAt": "2021-06-23T09:41:06Z", "content": "(CNN)Parts of Oregon and Washington state will be under an excessive heat watch this weekend as scorching, possibly record-breaking heat settles into the region.\r\nThe excessive heat watch will go int… [+3662 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "National Geographic says the world has a fifth ocean", "description": "National Geographic, one of the world's pre-eminent and most visible mapmaking groups, has officially decreed the existence of a fifth ocean. Called the Southern Ocean, it's the body of water that surrounds Antarctica.", "url": "https://www.cnn.com/travel/article/southern-ocean-fifth-national-geographic-hnk-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621112058-gerlache-strait-southern-ocean-file-2013-restricted-super-tease.jpg", "publishedAt": "2021-06-23T09:39:44Z", "content": "(CNN) Millions of children around the world have grown up memorizing basic facts about geography: there are seven continents and four oceans.\r\nNational Geographic, one of the world's pre-eminent and … [+4481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Hong Kong's first trial under new national security law begins without a jury", "description": "Hong Kong on Wednesday began the trial for the first person charged under its controversial national security law, which has transformed the city's political landscape since it was imposed by Beijing last year.", "url": "https://www.cnn.com/2021/06/23/asia/hong-kong-nsl-first-case-explainer-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622230951-01-hong-kong-nsl-first-case-explainer-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-23T09:17:48Z", "content": "(CNN)Hong Kong on Wednesday began the trial for the first person charged under its controversial national security law, which has transformed the city's political landscape since it was imposed by Be… [+7965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden set to announce his gun crime prevention and public safety strategy as White House looks to tackle crime surge", "description": "President Joe Biden on Wednesday will announce a comprehensive strategy on violent crime prevention -- with a particular emphasis on gun crimes -- amid a nationwide surge in violent crime that's emerged as an area of concern for the White House.", "url": "https://www.cnn.com/2021/06/23/politics/biden-gun-crime-prevention-strategy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210616135322-11-biden-presser-biden-putin-summit-0616-super-tease.jpg", "publishedAt": "2021-06-23T09:04:30Z", "content": "(CNN)President Joe Biden on Wednesday will announce a comprehensive strategy on violent crime prevention -- with a particular emphasis on gun crimes -- amid a nationwide surge in violent crime that's… [+4817 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Why female mongooses all give birth at the same time", "description": "Mongoose society offers a fascinating perspective on parenthood.", "url": "https://www.cnn.com/2021/06/23/world/mongooses-babies-parenting-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622133930-02-banded-mongooses-super-tease.jpg", "publishedAt": "2021-06-23T09:00:15Z", "content": "(CNN)The vast majority of expectant mongoose moms within a groupgive birth on the same night. The synchronous arrival of the tiny pups makes it impossible to know whose offspring belongs to which mon… [+3294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Santas, CNN", "title": "How to improve posture and relieve pain with your breath", "description": "In the first article of our series, we established why breathing is your superpower, impacting virtually all aspects of your health and wellness. In this second installment, we take a closer look at how breathing can improve your posture, enhance your mobilit…", "url": "https://www.cnn.com/2021/06/23/health/breathing-pain-relief-posture-movement-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618125235-dana-santas-breathing-better-02-super-tease.jpg", "publishedAt": "2021-06-23T08:32:16Z", "content": "Join Dana Santas for a four-part series to learn how you can breathe better to live better. Santas, known as the \"Mobility Maker,\" is a certified strength and conditioning specialist and mind-body co… [+13224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallika Kallingal, CNN", "title": "First came Covid, then long-haul symptoms. And now they're battling the guilt of having survived it all", "description": "At the start of the Covid-19 pandemic, when resources were scarce and experts debated whether the US would have to ration care, many Covid patients began to feel survivor's guilt. These are some of their stories.", "url": "https://www.cnn.com/2021/06/23/health/long-covid-survivors-guilt-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623040201-covid-long-haul-kelly-nichols-tyre-split-super-tease.jpg", "publishedAt": "2021-06-23T08:16:43Z", "content": "By Mallika Kallingal, CNN\r\nUpdated 4:16 AM ET, Wed June 23, 2021\r\n (CNN)Lauren Nichols' battle with Covid-19 began early in the pandemic, when resources were scarce and experts debated whether the US… [+9230 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jenni Marsh, CNN Business", "title": "Hong Kong's biggest pro-democracy newspaper to close as Beijing tightens its grip", "description": "One year was all it took for a Beijing-imposed National Security Law to take down Hong Kong's largest and loudest pro-democracy newspaper.", "url": "https://www.cnn.com/2021/06/23/media/apple-daily-closure-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200811110844-apple-daily-hong-kong-0811-01-super-tease.jpg", "publishedAt": "2021-06-23T07:25:42Z", "content": "Just now, outside Apple Daily's HQ, a woman named Pan left a sunflower and card for staff at the paper. \r\n\"Although the Apple is about to be picked off the tree, the spirit and perseverance of Apple … [+116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Nearly every new Covid-19 death is now entirely preventable, CDC director says", "description": "The dangerous Delta variant poses a risk to the United States as the country works to ease out of the Covid-19 pandemic, but experts say the nation has the tools needed to overcome the threat -- if the public takes advantage of them.", "url": "https://www.cnn.com/2021/06/23/health/us-coronavirus-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623003752-us-coronavirus-wednesday-0623-super-tease.jpg", "publishedAt": "2021-06-23T07:00:52Z", "content": "(CNN)The dangerous Delta variant poses a risk to the United States as the country works to ease out of the Covid-19 pandemic, but experts say the nation has the tools needed to overcome the threat --… [+4769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan and Jessie Yeung, CNN", "title": "Soon, neither the US nor China will have ambassadors in each other's capitals. Will it make a difference?", "description": "Editor's note: CNN has launched the Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up here.", "url": "https://www.cnn.com/2021/06/23/china/chinese-ambassador-leaving-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622233033-01-chinese-ambassador-leaving-mic-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-23T05:43:26Z", "content": "Hong KongEditor's note: CNN has launched the Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up … [+7410 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Biden says he's 'proud' of two professional athletes who announced LGBTQ identities", "description": "President Joe Biden on Tuesday voiced support for two professional athletes who announced recently that they're part of the LGBTQ community, saying he's \"proud\" of their decisions to publicly share their identities.", "url": "https://www.cnn.com/2021/06/23/politics/joe-biden-kumi-yokoyama-carl-nassib-lgbtq-support/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180227114420-rainbow-flag-white-house-file-super-tease.jpg", "publishedAt": "2021-06-23T04:10:40Z", "content": "Washington (CNN)President Joe Biden on Tuesday voiced support for two professional athletes who announced recently that they're part of the LGBTQ community, saying he's \"proud\" of their decisions to … [+2144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jori Finkel", "title": "'Sexist' Marilyn Monroe statue installed in Palm Springs amid widespread opposition", "description": "Activist groups are still fighting to relocate the \"hyper sexualized\" statue from outside the Palm Springs Art Museum.", "url": "https://www.cnn.com/style/article/marilyn-monroe-statue-palm-springs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621223745-02-marilyn-monroe-statue-palm-springs-super-tease.jpg", "publishedAt": "2021-06-23T03:48:33Z", "content": "arts\r\nThis article was originally published by The Art Newspaper, an editorial partner of CNN Style.\r\nMultiple protests, a popular petition, a legal action and a small fire have not been enough to st… [+2839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega, CNN", "title": "Biden administration backs end to the disparity of cocaine sentences", "description": "The Biden administration \"strongly supports\" ending the racial disparity of sentencing federal offenders who are convicted for crack versus powdered cocaine, according to head of the Office of National Drug Control Policy, who testified Tuesday in support of …", "url": "https://www.cnn.com/2021/06/22/politics/crack-powder-cocaine-sentences/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622202013-regina-labelle-senate-hearing-0622-restricted-super-tease.jpg", "publishedAt": "2021-06-23T03:26:45Z", "content": "(CNN)The Biden administration \"strongly supports\" ending the racial disparity of sentencing federal offenders who are convicted for crack versus powdered cocaine, according to head of the Office of N… [+3913 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "US warplanes fly first combat missions off foreign aircraft carrier since World War II", "description": "United States Marine Corps fighter jets aboard a British aircraft carrier flew combat missions over the Middle East this week -- the first time US warplanes have gone into combat from a foreign warship since World War II, the United Kingdom's Ministry of Defe…", "url": "https://www.cnn.com/2021/06/22/middleeast/us-fighter-jets-uk-aircraft-carrier-intl-hnk-ml-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210105113746-us-marines-f-35-hms-queen-elizabeth-super-tease.jpg", "publishedAt": "2021-06-23T03:12:49Z", "content": "(CNN)United States Marine Corps fighter jets aboard a British aircraft carrier flew combat missions over the Middle East this week -- the first time US warplanes have gone into combat from a foreign … [+3057 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen, CNN", "title": "Texas grand jury declines to indict jailers involved in Marvin Scott in-custody death", "description": "A grand jury in Texas declined Tuesday to indict the eight former detention officers involved in the in-custody death of Marvin Scott III, according to a news release from Collin County District Attorney Greg Willis.", "url": "https://www.cnn.com/2021/06/22/us/marvin-scott-death-jailers-no-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429133839-02-marvin-david-scott-iii-super-tease.jpg", "publishedAt": "2021-06-23T02:50:00Z", "content": "(CNN)A grand jury in Texas declined Tuesday to indict the eight former detention officers involved in the in-custody death of Marvin Scott III, according to a news release from Collin County District… [+3787 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "'I've spent almost all my concert earnings on art': Pop star Jay Chou's collecting obsession", "description": "One of Asia's biggest pop stars is gaining recognition as an art collector, with works by Picasso and Basquiat among those hanging in his Taipei home.", "url": "https://www.cnn.com/style/article/jay-chou-interview-sothebys/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622114051-01b-jay-chou-art-collection-super-tease.jpg", "publishedAt": "2021-06-23T02:32:37Z", "content": "arts\r\nTaiwanese pop star Jay Chou tends to excel at whatever he puts his mind to. He's one of Asia's best-known singers, the director of an award-winning movie and a magician with his own Netflix ser… [+8484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez, CNN", "title": "Chicago is throwing its 'whole government' at summer violence", "description": "\"I'm not saying I'm God or I can prevent anything from happening, but I know in my heart I did what I can at 1 or 2 in the morning to help put this guy in a safer environment.\"", "url": "https://www.cnn.com/2021/06/22/us/chicago-summer-violence-whole-of-government/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621184604-chicago-violence-englewood-shooting-scene-super-tease.jpg", "publishedAt": "2021-06-23T02:14:28Z", "content": "Chicago (CNN)\"I'm not saying I'm God or I can prevent anything from happening, but I know in my heart I did what I can at 1 or 2 in the morning to help put this guy in a safer environment.\"\r\nThat's h… [+9231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen, CNN", "title": "153 Houston Methodist employees resign or are fired after refusing to get Covid-19 vaccine, official says", "description": "More than 150 Houston Methodist Hospital employees were officially out of a job Tuesday, 10 days after a judge dismissed a lawsuit against the hospital by employees who opposed a Covid-19 vaccine mandate as a condition of employment, a hospital spokesperson s…", "url": "https://www.cnn.com/2021/06/22/us/houston-methodist-employees-covid-vaccine-resign-fired/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622204932-houston-methodist-hosptial-protest-super-tease.jpg", "publishedAt": "2021-06-23T01:41:37Z", "content": "(CNN)More than 150 Houston Methodist Hospital employees were officially out of a job Tuesday, 10 days after a judge dismissed a lawsuit against the hospital by employees who opposed a Covid-19 vaccin… [+1881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen, CNN", "title": "Police chief says slain Colorado officer was 'targeted' in Monday shooting", "description": "The shooting that left three people dead in Arvada, Colorado, on Monday appears to have been a deliberate attack on a police officer, Police Chief Link Strate told reporters Tuesday afternoon.", "url": "https://www.cnn.com/2021/06/22/us/arvada-colorado-police-officer-targeted-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622141812-01-arvada-shooting-0621-restricted-super-tease.jpg", "publishedAt": "2021-06-23T01:00:42Z", "content": "(CNN)The shooting that left three people dead in Arvada, Colorado, on Monday appears to have been a deliberate attack on a police officer, Police Chief Link Strate told reporters Tuesday afternoon.\r\n… [+1906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Oren Liebermann, CNN", "title": "Pentagon tracked failed Iranian satellite launch, as images reveal Tehran is set to try again", "description": "The Pentagon was watching as Iran attempted, and failed, to launch yet another satellite into orbit earlier this month, multiple defense officials tell CNN.", "url": "https://www.cnn.com/2021/06/22/politics/iran-failed-satellite-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622160057-iran-satellite-0619-super-tease.jpg", "publishedAt": "2021-06-23T00:56:09Z", "content": "(CNN)The Pentagon was watching as Iran attempted, and failed, to launch yet another satellite into orbit earlier this month, multiple defense officials tell CNN. \r\nBut while that previous effort, whi… [+5596 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Louisiana's Democratic governor vetoes anti-trans sports ban, calling it discriminatory", "description": "Louisiana's Democratic governor on Tuesday vetoed a bill that would've prohibited transgender girls and women in the state from competing on girls' and women's public elementary, secondary and college sports teams, calling the Republican-backed measure discri…", "url": "https://www.cnn.com/2021/06/22/politics/louisiana-transgender-sports-ban-governor-veto/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622204600-john-bel-edwards-file-super-tease.jpg", "publishedAt": "2021-06-23T00:28:28Z", "content": "Washington (CNN)Louisiana's Democratic governor on Tuesday vetoed a bill that would've prohibited transgender girls and women in the state from competing on girls' and women's public elementary, seco… [+3698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Defense secretary to recommend prosecution of sexual assaults in the military be taken out of commanders' hands", "description": "Secretary of Defense Lloyd Austin on Tuesday announced he will recommend to President Joe Biden a change in the military justice system to take the prosecution of sexual assaults out of the hands of commanders.", "url": "https://www.cnn.com/2021/06/22/politics/pentagon-sexual-assault-prosecution-recommendation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210122124257-01-lloyd-austin-lead-image-super-tease.jpg", "publishedAt": "2021-06-23T00:12:56Z", "content": "(CNN)Secretary of Defense Lloyd Austin on Tuesday announced he will recommend to President Joe Biden a change in the military justice system to take the prosecution of sexual assaults out of the hand… [+1170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Trump's 'book of all books' undoubtedly a work of fiction", "description": "Michael D'Antonio writes that former President Donald Trump's book, which he claims to furiously writing, will break with the norm of presidential autobiographies by relying on fiction more than fact.", "url": "https://www.cnn.com/2021/06/22/opinions/trump-book-autobiography-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618081153-0618-trumpanalysis-super-tease.jpg", "publishedAt": "2021-06-22T23:43:58Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+6082 chars]"}]}