{"status": "ok", "totalResults": 180, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Fortinsky", "title": "South Carolina Republican congressman tests positive for Covid-19", "description": "Rep. Ralph Norman has tested positive for Covid-19 after experiencing mild symptoms, the South Carolina Republican, who is fully vaccinated, announced Thursday in a statement.", "url": "https://www.cnn.com/2021/08/05/politics/ralph-norman-covid-positive/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805150121-rep-ralph-norman-file-restricted-super-169.jpg", "publishedAt": "2021-08-05T19:59:49Z", "content": "Rep. Ralph Norman has tested positive for Covid-19 after experiencing mild symptoms, the South Carolina Republican, who is fully vaccinated, announced Thursday in a statement.\r\nAfter experiencing min… [+1739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher and Rachel Janfaza, CNN", "title": "Texas Gov. Greg Abbott announces second special session of state legislature", "description": "Texas Gov. Greg Abbott on Thursday called for a second special session of the state legislature to begin this weekend, after Democratic lawmakers fled the state to block a restrictive voting bill.", "url": "https://www.cnn.com/2021/08/05/politics/texas-state-legislature-second-special-session/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805143212-greg-abbott-0710-super-tease.jpg", "publishedAt": "2021-08-05T19:46:00Z", "content": "(CNN)Texas Gov. Greg Abbott on Thursday called for a second special session of the state legislature to begin this weekend, after Democratic lawmakers fled the state to block a restrictive voting bil… [+2751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Amazon is delaying its return to office until 2022", "description": "Amazon on Thursday pushed back its office return date until early next year amid a surge in Covid-19 cases from the Delta variant, making it one of the most significant delays yet in the tech industry.", "url": "https://www.cnn.com/2021/08/05/tech/amazon-office-return-reopening-delay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805140244-01-amazon-seattle-offices-file-super-tease.jpg", "publishedAt": "2021-08-05T19:20:19Z", "content": "(CNN Business)Amazon on Thursday pushed back its office return date until early next year amid a surge in Covid-19 cases from the Delta variant, making it one of the most significant delays yet in th… [+1507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Maegan Vazquez, CNN", "title": "Education secretary warns that politicizing masks could lead to in-person school disruption", "description": "Education Sec. Miguel Cardona on Thursday warned Americans not to let adult politics get in the way of schools reopening safely and remaining open without disruption, specifically expressing concern about states that are preventing schools from instating mask…", "url": "https://www.cnn.com/2021/08/05/politics/education-miguel-cardona-schools-covid-florida-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210613195849-miguel-cardona-file-super-tease.jpg", "publishedAt": "2021-08-05T19:17:25Z", "content": "(CNN)Education Sec. Miguel Cardona on Thursday warned Americans not to let adult politics get in the way of schools reopening safely and remaining open without disruption, specifically expressing con… [+5183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bregman and Howard Jacobson", "title": "Angry at the unvaccinated? Here's a better way", "description": "You're furious at what you see as the selfishness and ignorance and lack of civic responsibility of the people in your life who refuse to get the jab. You try to convince them by explaining how wrongheaded they are, hoping browbeating will break them. But her…", "url": "https://www.cnn.com/2021/08/05/opinions/how-to-move-people-from-hesitant-to-vaccinated-bregman-jacobson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805131038-covid-vaccine-nyc-0730-super-tease.jpg", "publishedAt": "2021-08-05T19:07:26Z", "content": "Peter Bregman, CEO of Bregman Partners, is an executive coach, bestselling author and host of the Bregman Leadership Podcast. Howard Jacobson is an executive and health coach and director of coach tr… [+8788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "Why Olympic divers take showers -- and use those tiny towels -- between dives", "description": "Some viewers of the Tokyo Olympics are baffled by the behavior of divers between plunges into the pool. Let us explain.", "url": "https://www.cnn.com/2021/08/05/sport/olympics-divers-showers-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805024853-14-olympics-080521-womens-10m-diving-super-169.jpg", "publishedAt": "2021-08-05T18:45:00Z", "content": "Viewers of the Tokyo Olympics are apparently a little baffled by the behavior of athletes in the diving events. \r\nDivers typically emerge from the water after a plunge and immediately take a quick sh… [+2565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "More companies are requiring vaccines for workers, but unions could slow the effort", "description": "More employers are mandating Covid-19 vaccines for their workers as the Delta variant surges across the United States. But one step in the process could slow down the rollout of such requirements: negotiations with labor unions representing employees.", "url": "https://www.cnn.com/2021/08/05/business/vaccine-mandates-unions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729083853-us-covid-19-vaccine-dose-pfizer-0514-super-tease.jpg", "publishedAt": "2021-08-05T18:35:58Z", "content": "New York (CNN Business)More employers are mandating Covid-19 vaccines for their workers as the Delta variant surges across the United States. But one step in the process could slow down the rollout o… [+6968 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega", "title": "DOJ opens investigation into city of Phoenix and Phoenix Police Department", "description": "Attorney General Merrick Garland announced on Thursday that the Justice Department's Civil Rights Division is launching an investigation into policing practices into the city of Phoenix, Arizona, and its police department.", "url": "https://www.cnn.com/2021/08/05/politics/phoenix-justice-garland/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726121303-merrick-garland-0426-super-tease.jpg", "publishedAt": "2021-08-05T18:31:35Z", "content": "(CNN)Attorney General Merrick Garland announced on Thursday that the Justice Department's Civil Rights Division is launching an investigation into policing practices into the city of Phoenix, Arizona… [+72 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Vaughan, CNN", "title": "Need Housing and rental relief? Here's how to get started", "description": "After the federal eviction moratorium expired, the Centers for Disease Control and Prevention issued an extension until October 3 for high Covid-19 transmission areas. The Biden administration says those areas cover 90 percent of the country's renters.", "url": "https://www.cnn.com/2021/08/05/us/iyw-housing-and-rental-resources/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326153110-us-apartment-eviction-file-super-tease.jpg", "publishedAt": "2021-08-05T18:15:52Z", "content": "(CNN)After the federal eviction moratorium expired, the Centers for Disease Control and Prevention issued an extension until October 3 for high Covid-19 transmission areas. The Biden administration s… [+2100 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson, Caitlin Stephen Hu and Shelby Rose", "title": "Mexico's lawsuit against gun makers faces a tough road", "description": "Normally, when the headlines blare about flows across the US-Mexico border, they concern desperate migrants and refugees heading north. But Mexico has now turned the tables and is seeking to halt the torrent of firearms heading south from the gun-toting Unite…", "url": "https://www.cnn.com/2021/08/05/world/meanwhile-in-america-august-5-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804152500-mexico-gunmaker-lawsuit-super-169.jpg", "publishedAt": "2021-08-05T18:14:09Z", "content": "Normally, when the headlines blare about flows across the US-Mexico border, they concern desperate migrants and refugees heading north. But Mexico has now turned the tables and is seeking to halt the… [+4510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Editorial Research", "title": "Ebrahim Raisi Fast Facts", "description": "Read CNN's Fast Facts about Ebrahim Raisi and learn more about the president of Iran.", "url": "https://www.cnn.com/2021/08/05/middleeast/ebrahim-raisi-fast-facts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620115925-exp-gps-0620-iran-election-ebrahim-raisi-00003114-super-tease.png", "publishedAt": "2021-08-05T17:54:18Z", "content": "(CNN)Here's a look at the life of Iran's President Ebrahim Raisi, who was inaugurated August 5, 2021.\r\nBirth date: December 14, 1960\r\nBirth place: Mashhad, Iran\r\nFull name: Sayyid Ebrahim Raisol-Sada… [+2760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Neelam Bohra and Scottie Andrew", "title": "Lil Nas X's defiant pride is essential to hip-hop -- and the DaBaby debacle is one reason why", "description": "Lil Nas X's unapologetic commitment to his identity has become even more essential in the wake of DaBaby's comments. And he's carving out a new space for the future of LGBTQ musicians to express themselves without limits.", "url": "https://www.cnn.com/2021/08/05/entertainment/lil-nas-x-dababy-homophobia-black-queer-rappers-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730135514-02-lil-nas-x-dababy-rap-homophobia-trnd-super-169.jpg", "publishedAt": "2021-08-05T17:41:25Z", "content": "Lil Nas X, the 22-year-old juggernaut known by most for Old Town Road, is in prison. Hes in the shower, naked save for some humble pixelation and twerking, surrounded by eight male backup dancers. An… [+6981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The best computer monitors of 2021", "description": "We've been testing seven of the highest-rated monitors over the past month to find the best computer monitor for work — or play — which we ultimately whittled down to three top picks.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-computer-monitors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805133532-cnn-underscored-best-computer-monitors-01-super-169.jpg", "publishedAt": "2021-08-05T17:36:23Z", "content": "Screen constraint can hamper anyones workflow. Who hasnt wasted precious time trying to find that one spreadsheet buried beneath 15 other open applications on an oh-so-small laptop screen? A full-siz… [+9550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle", "title": "New York state impeachment investigation into Cuomo is 'nearing completion'", "description": "A wide-ranging New York state impeachment investigation into various allegations of misconduct against embattled Democratic Gov. Andrew Cuomo is close to concluding, according to a letter obtained by CNN.", "url": "https://www.cnn.com/2021/08/05/politics/new-york-cuomo-impeachment-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805122217-restricted-andrew-cuomo-08-02-2021-super-tease.jpg", "publishedAt": "2021-08-05T17:20:58Z", "content": "(CNN)A wide-ranging New York state impeachment investigation into various allegations of misconduct against embattled Democratic Gov. Andrew Cuomo is close to concluding, according to a letter obtain… [+2104 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "White House touts more than 864,000 vaccinations in last 24 hours, highest rate since early July", "description": "The White House touted progress in vaccinations in recent days, noting that over the past 24 hours, the US recorded more than 864,000 vaccinations, the highest daily rate since July 3, and praised momentum for vaccine mandates Thursday, days after President J…", "url": "https://www.cnn.com/2021/08/05/politics/vaccine-mandates-progress-delta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805123634-white-house-0729-super-tease.jpg", "publishedAt": "2021-08-05T16:50:45Z", "content": "(CNN)The White House touted progress in vaccinations in recent days, noting that over the past 24 hours, the US recorded more than 864,000 vaccinations, the highest daily rate since July 3, and prais… [+2533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Justice Department IG couldn't find evidence of FBI Clinton probe leaks to Giuliani", "description": "The Justice Department inspector general could not find evidence that FBI employees leaked non-public information to Rudy Giuliani about the Hillary Clinton email investigation in the lead-up to the 2016 election, according to a new report.", "url": "https://www.cnn.com/2021/08/05/politics/giuliani-inspector-general-review-2016-fbi-leaks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210607141454-rudy-giuliani-file-super-tease.jpg", "publishedAt": "2021-08-05T16:49:17Z", "content": "Washington (CNN)The Justice Department inspector general could not find evidence that FBI employees leaked non-public information to Rudy Giuliani about the Hillary Clinton email investigation in the… [+2848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "Kentucky sheriff's deputy shot, killed in ambush attack, police say", "description": "A Jefferson County Sheriff's (JCSO) deputy has died after being shot early Thursday while working an off-duty detail, and investigators believe he was \"targeted\" and \"ambushed,\" according to JCSO spokesman, Lt. Col. Carl Yates.", "url": "https://www.cnn.com/2021/08/05/us/kentucky-deputy-shot-ambush/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805121514-01-kentucky-deputy-shot-shirley-0805-restricted-super-tease.jpg", "publishedAt": "2021-08-05T16:25:23Z", "content": "(CNN)A Jefferson County Sheriff's (JCSO) deputy has died after being shot early Thursday while working an off-duty detail, and investigators believe he was \"targeted\" and \"ambushed,\" according to JCS… [+979 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Alex Rogers and Michael Warren, CNN", "title": "GOP fears grow over Herschel Walker as party leaders seek other candidates in Georgia Senate race", "description": "Republicans from Georgia to Washington, DC, are searching for a viable candidate to mount a Senate bid in the Peach State next year, fearing that former President Donald Trump's choice, football great Herschel Walker, would implode if he ran and could cost th…", "url": "https://www.cnn.com/2021/08/05/politics/georgia-senate-race/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805104724-herschel-walker-file-2019-super-tease.jpg", "publishedAt": "2021-08-05T16:24:24Z", "content": "(CNN)Republicans from Georgia to Washington, DC, are searching for a viable candidate to mount a Senate bid in the Peach State next year, fearing that former President Donald Trump's choice, football… [+9209 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Free Guy' lets Ryan Reynolds run up the score in a video-game action comedy", "description": "\"Free Guy\" is a cleverly programmed wedding of star (Ryan Reynolds) and subject matter, in a movie that's silly, handsome-looking and a great deal of fun, in roughly inverse proportion to how much one sweats the details. Traveling inside videogames doesn't al…", "url": "https://www.cnn.com/2021/08/05/entertainment/free-guy-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802144054-01-ryan-reynolds-free-guy-super-tease.jpg", "publishedAt": "2021-08-05T16:04:17Z", "content": "(CNN)\"Free Guy\" is a cleverly programmed wedding of star (Ryan Reynolds) and subject matter, in a movie that's silly, handsome-looking and a great deal of fun, in roughly inverse proportion to how mu… [+3108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Wilson, Manu Raju, Lauren Fox and Kristin Wilson", "title": "McConnell rejects Democrats' effort to get GOP to back raising the nation's debt limit", "description": "Senate Minority Leader Mitch McConnell said Thursday that Democrats should expect zero help from Republicans in their effort to raise the debt ceiling, previewing a looming fight this fall over the nation's borrowing limit, which Congress must approve.", "url": "https://www.cnn.com/2021/08/05/politics/debt-ceiling-debate-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618123013-01-mcconnell-0617-super-169.jpg", "publishedAt": "2021-08-05T15:58:48Z", "content": "Senate Minority Leader Mitch McConnell said Thursday that Democrats should expect zero help from Republicans in their effort to raise the debt ceiling, previewing a looming fight this fall over the n… [+3166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Hemmer", "title": "Why Tucker Carlson went to Hungary", "description": "Historian Nicole Hemmer writes that Tucker Carlson being in Hungary this week and his support for conservative authoritarian Prime Minister Viktor Orban is a strategy that we've seen play out in the 1960s and 1970s, when White, right-wing media personalities …", "url": "https://www.cnn.com/2021/08/05/opinions/tucker-carlson-hungary-viktor-orbn-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804170448-carlson-orban-twitter-super-169.jpeg", "publishedAt": "2021-08-05T15:30:42Z", "content": "When Tucker Carlson, host of the highest-rated show on Fox News, opened his show on Monday, he appeared not behind his glossy desk, but in front of the ornate spires of Budapest, Hungary. Standing ne… [+5537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judith Graham, Kaiser Health News", "title": "Most seniors who died of Covid-19 lived outside nursing homes", "description": "As covid-19 resurges across the country, driven by the highly infectious delta variant, experts are extending our understanding of the pandemic's toll on older adults — the age group hit hardest by the pandemic.", "url": "https://www.cnn.com/2021/08/05/health/seniors-covid-19-deaths-partner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210310180437-05-uk-elderly-first-touch-covid-super-tease.jpg", "publishedAt": "2021-08-05T15:20:57Z", "content": "(CNN)As covid-19 resurges across the country, driven by the highly infectious delta variant, experts are extending our understanding of the pandemic's toll on older adults the age group hit hardest b… [+7307 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Akanksha Singh", "title": "A jailed priest's death sends a message about India's crackdown", "description": "On July 5, Stan Swamy, an 84-year-old priest passed away in a hospital in a suburb of Mumbai. He spent nearly nine months in jail, without trial, under an Indian anti-terrorism law. The case calls attention to a crackdown on activists.", "url": "https://www.cnn.com/2021/08/05/opinions/stan-swamy-and-india-anti-terror-law-crackdown-akanksha-singh-op-ed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706010457-02-indian-jailed-activist-priest-death-intl-ink-super-tease.jpg", "publishedAt": "2021-08-05T15:16:47Z", "content": "Akanksha Singh is a journalist based in Mumbai, India. She covers politics and social justice and has written for the BBC, The Independent and the South China Morning Post, among others. Follow her o… [+6103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Johnson", "title": "How to get the best credit card when you have an excellent credit score", "description": "With a credit score that's considered excellent or exceptional, you can have your pick of the top rewards and travel credit card options, so it's vital that you compare card offerings and current promotions to find the right fit.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-credit-cards-for-excellent-credit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154747-underscored-credit-score-meter-pointing-to-excellent-super-169.jpg", "publishedAt": "2021-08-05T15:06:52Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+11619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Perfectly preserved cave lion cub found frozen in Siberia is 28,000 years old. Even its whiskers are intact.", "description": "Found frozen deep in the Siberian Arctic, the cave lion cub looks like she's asleep and one touch might awaken her.", "url": "https://www.cnn.com/2021/08/05/world/frozen-cave-lion-cubs-siberia-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805100743-01-siberia-cave-lion-cub-discovery-super-tease.jpg", "publishedAt": "2021-08-05T14:55:11Z", "content": "Sign up for CNN's Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\n (CNN)Found frozen deep in the Siberian Arctic, the c… [+4832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna and Joe Sutton, CNN", "title": "'We lost Greenville': Dixie Fire wipes out much of Northern California community", "description": "The Golden State's largest active wildfire has wiped out much of the Greenville community in Northern California, sweeping through Wednesday at alarming speed and endangering anyone who did not heed evacuation orders, officials said.", "url": "https://www.cnn.com/2021/08/05/weather/greenville-california-dixie-fire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805090511-04-dixie-fire-greenville-0804-super-tease.jpg", "publishedAt": "2021-08-05T14:48:38Z", "content": "(CNN)The Golden State's largest active wildfire has wiped out much of the Greenville community in Northern California, sweeping through Wednesday at alarming speed and endangering anyone who did not … [+3769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "Carnival cruise ship reports Covid cases, brings in mask requirement for all passengers", "description": "After a \"small number of positive cases\" of Covid-19 were detected aboard a Carnival Cruise Line ship, a new fleetwide policy requiring all guests to wear masks in some indoor areas was implemented ahead of schedule, the cruise line said.", "url": "https://www.cnn.com/travel/article/carnival-cruise-line-covid-cases-mask-requirement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805103308-carnival-vista-file-0503-galveston-restricted-super-tease.jpg", "publishedAt": "2021-08-05T14:46:29Z", "content": "(CNN) After a \"small number of positive cases\" of Covid-19 were detected aboard a Carnival Cruise Line ship, a new fleetwide mask policy requiring all guests to wear masks in some indoor areas was im… [+1710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "Wayfair is having a Save Big, Give Back sale — here are the best picks", "description": "If you have a few needs around the house — or you've just moved and have a new place to furnish — it's a great time to shop, score some discounts (up to 80% off!) and do a little good in the process. Read on for some of our top picks from Wayfair's sale below.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/wayfair-sale-save-big-give-back/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804103115-wayfair-sale-save-big-give-back-lead-super-169.jpg", "publishedAt": "2021-08-05T14:26:39Z", "content": "Wayfair has been a go-to for a ton of people for a while now, and their current Save Big, Give Back sale is giving their famously great bargains an even better spin. During the promotion, which runs … [+6841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Tensley", "title": "Why August is the perfect time to revisit Black rebellion", "description": "A version of this story appeared in CNN's Race Deconstructed newsletter. To get it in your inbox every week, sign up for free here.", "url": "https://www.cnn.com/2021/08/05/politics/black-rebellion-kerner-race-deconstructed-newsletter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803164139-the-essential-kerner-commission-report-book-cover-super-169.jpg", "publishedAt": "2021-08-05T14:25:35Z", "content": "A version of this story appeared in CNNs Race Deconstructed newsletter. To get it in your inbox every week, sign up for free here.\r\nThis week marks the start of Black August. The annual commemoration… [+6147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Phil Mattingly, CNN", "title": "Biden touts LGBTQ diversity in announcing sixth round of judicial nominees", "description": "President Joe Biden on Thursday announced four judicial nominees, including two barrier-breaking nominations of LGBTQ judges, marking his sixth round of judicial nominees since taking office as his administration seeks to maintain a rapid pace of nominations …", "url": "https://www.cnn.com/2021/08/05/politics/biden-judicial-nominees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803165508-01-biden-0803-super-tease.jpg", "publishedAt": "2021-08-05T14:24:39Z", "content": "(CNN)President Joe Biden on Thursday announced four judicial nominees, including two barrier-breaking nominations of LGBTQ judges, marking his sixth round of judicial nominees since taking office as … [+2262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop today: Columbia, Jabra, NuFace and more", "description": "Today, you'll find a deal on our runner-up pick for best over-ear headphones, a discounted NuFace bundle and savings on batteries. All that and more below.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805093800-0805deals-super-169.jpg", "publishedAt": "2021-08-05T14:24:21Z", "content": "Today, youll find a deal on our runner-up pick for best over-ear headphones, a discounted NuFace bundle and savings on batteries. All that and more below.\r\nOur runner-up for best overall over-ear hea… [+12266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden extends temporary safe haven to Hong Kong residents in US amid China crackdown", "description": "President Joe Biden on Thursday signed a memorandum extending temporary safe haven to certain Hong Kong residents in the US amid ongoing repression and undermining of democracy by China.", "url": "https://www.cnn.com/2021/08/05/politics/deferred-enforced-departure-hong-kong-china/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716145103-white-house-file-0306-super-tease.jpg", "publishedAt": "2021-08-05T14:23:27Z", "content": "(CNN)President Joe Biden on Thursday signed a memorandum extending temporary safe haven to certain Hong Kong residents in the US amid ongoing repression and undermining of democracy by China.\r\nThe pr… [+2102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "You shouldn't miss this massive bombshell in Trump's ongoing election fraud lie", "description": "Unless you have been living on another planet for the past six months, you know by now that Donald Trump leaned on state and national officials in the final days of his presidency to force investigations into made-up claims of widespread election fraud in the…", "url": "https://www.cnn.com/2021/08/05/politics/donald-trump-jeffrey-rosen-election-fraud-cnn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210527101033-donald-trump-2018-file-super-169.jpg", "publishedAt": "2021-08-05T14:22:25Z", "content": "Unless you have been living on another planet for the past six months, you know by now that Donald Trump leaned on state and national officials in the final days of his presidency to force investigat… [+3577 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry and Brian Lowry", "title": "'Vivo' gets Lin-Manuel Miranda animated again in a sweet if slight adventure", "description": "After putting the wind in \"Moana's\" sails with his music and lyrics, Lin-Manuel Miranda brings his stage-honed chops to another animated movie in \"Vivo,\" a sweet if slight love story built around an inordinately resourceful kinkajou. Premiering on Netflix, Mi…", "url": "https://www.cnn.com/2021/08/05/entertainment/vivo-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804151141-01-vivo-netflix-super-169.jpg", "publishedAt": "2021-08-05T14:08:32Z", "content": "After putting the wind in Moanas sails with his music and lyrics, Lin-Manuel Miranda brings his stage-honed chops to another animated movie in Vivo, a sweet if slight love story built around an inord… [+2303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood and Veronica Stracqualursi, CNN", "title": "Japanese whiskey worth $5,800 gifted to Pompeo is missing, State filings say", "description": "The State Department is looking into the whereabouts of a $5,800 bottle of Japanese whiskey that was gifted to former Secretary of State Mike Pompeo, according to State Department filings in the federal register.", "url": "https://www.cnn.com/2021/08/05/politics/pompeo-japanese-whiskey-bottle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805081626-restricted-mike-pompeo-12-09-2020-super-tease.jpg", "publishedAt": "2021-08-05T14:08:12Z", "content": "(CNN)The State Department is looking into the whereabouts of a $5,800 bottle of Japanese whiskey that was gifted to former Secretary of State Mike Pompeo, according to State Department filings in the… [+1634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Don't sleep on this exclusive deal: Yana's famous body pillow is 20% off right now", "description": "For those of us who love to curl up with a body pillow at night, Yana has one of the best around. Now, with our exclusive code, you can save 20% on the well-engineered pillow during the entire month of August. It's the perfect opportunity to make an investmen…", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/yana-sleep-sale-body-pillow/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804071707-yana-sleep-pillow-sale-lead-super-169.jpg", "publishedAt": "2021-08-05T14:01:12Z", "content": "For those of us who love to curl up with a body pillow at night, Yana has one of the best around: Made from organic, luxurious textiles, its a great little or big spoon at night and can curl around y… [+1162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Logan Garvey", "title": "The cutest notebooks, pens & school supplies we're obsessed with right now", "description": "Cute school supplies get us excited in anticipation for back to school, and we want to share our faves with you. Here's a list of our go-to notebooks, pens, sticky notes and more.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/cute-desk-supplies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730090108-cute-desk-supplies-lead-super-169.jpg", "publishedAt": "2021-08-05T13:57:37Z", "content": "Everything is more fun when it is stylish too. Cute school supplies get us excited in anticipation for back to school, and we want to share our faves with you. Heres a list of our go-to notebooks, pe… [+3484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Staff", "title": "Travel to Portugal during Covid-19: What you need to know before you go", "description": "If you're planning a trip to Portugal, here's what you'll need to know and expect if you want to visit during the global coronavirus pandemic.", "url": "https://www.cnn.com/travel/article/portugal-travel-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200704075040-algarve-tourism-super-tease.jpg", "publishedAt": "2021-08-05T13:54:10Z", "content": "(CNN) If you're planning to travel to Portugal, here's what you'll need to know and expect if you want to visit during the Covid-19 pandemic.\r\nPortugal is in a State of Calamity until August 8, with … [+4005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Noelle Ike", "title": "Pepper is creating gorgeous, well-fitting bras for AA, A and B cups", "description": "Pepper creates bras specifically designed for those with AA, A and B cups. We tested the brand ourselves and found that the bras are comfortable, stylish and small-bust approved.", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/pepper-bra-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803134430-pepper-bra-review-lead-super-169.jpg", "publishedAt": "2021-08-05T13:30:24Z", "content": "Finding the right bra, no matter your size, is a journey. But when you add the extra hurdle of having a smaller chest, it can be not only difficult, but embarrassing and even humiliating at times. Be… [+8835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "Travelers to Greece undeterred by extreme heatwave", "description": "As Greece suffers its worst heatwave in more than 30 years, wildfires are raging, the capital Athens is thick with haze, and residents on the outskirts of the city have fled, leaving their possessions to go up in flames.", "url": "https://www.cnn.com/travel/article/greece-travel-heatwave/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805133509-athens-heatwave-smoke-super-tease.jpg", "publishedAt": "2021-08-05T13:13:20Z", "content": "As the temperatures soar, eyes are turning towards the tourist industry. Tourism is crucial for Greece's economy -- it brought in over $45 billion to the economy in 2019 -- and the sector has, of cou… [+6208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Democratic leader just went off on the 'woke' left", "description": "Hakeem Jeffries is sick of hearing from liberals carping about how Democrats -- and their leaders, of which he is one -- aren't doing enough to advance progressive policies.", "url": "https://www.cnn.com/2021/08/05/politics/hakeem-jeffries-alexandria-ocasio-cortez-liberals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160212101605-hakeem-jeffries-super-tease.jpg", "publishedAt": "2021-08-05T13:07:07Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Why you could see subtle changes to your smartphone's design", "description": "Smartphone season is underway, and the headlines will almost certainly be the same as always: thinner, sleeker, faster models are coming to consumer pockets.", "url": "https://www.cnn.com/2021/08/05/tech/right-to-repair-smartphones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726140931-01-broken-smartphone-restricted-super-tease.jpg", "publishedAt": "2021-08-05T13:01:23Z", "content": "(CNN)Smartphone season is underway, and the headlines will almost certainly be the same as always: thinner, sleeker, faster models are coming to consumer pockets.\r\nBut if a new push from the US gover… [+5508 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The new Nest Cams pack a big punch with modern looks and smarter notifications", "description": "Alongside a completely redesigned doorbell, Nest is refreshing its entire line of cameras as well. Here's your first look at the Nest Cam (indoor/outdoor), Nest Cam With Floodlight and Nest Cam (wired).", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/new-nest-cam-2021-preorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804165646-1-nest-cam-2021-super-169.jpg", "publishedAt": "2021-08-05T13:00:40Z", "content": "Alongside a completely redesigned doorbell, Nest is refreshing its entire line of cameras as well. Heres your first look at the Nest Cam (indoor/outdoor), Nest Cam With Floodlight and Nest Cam (wired… [+6742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The new Nest Doorbell is here — and it could be a serious Ring rival", "description": "It's time to say goodbye to the Nest Hello and hello to the Nest Doorbell. Yes, there's finally a new Nest Doorbell and it aims to fix the main frustrations we had with its predecessor. The Google Nest Doorbell — which is up for preorder now for $179.99 — inc…", "url": "https://www.cnn.com/2021/08/05/cnn-underscored/new-nest-doorbell-2021-preorder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804161008-new-nest-doorbell-2021-super-169.jpg", "publishedAt": "2021-08-05T13:00:14Z", "content": "Its time to say goodbye to the Nest Hello and hello to the Nest Doorbell. Yes, theres finally a new Nest Doorbell and it aims to fix the main frustrations we had with its predecessor. The Google Nest… [+6919 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julián Castro for CNN Business Perspectives", "title": "Julián Castro: It's time to make a long-term investment in housing vouchers", "description": "The Housing Choice Voucher Program — the nation's largest rental assistance program — not only helps low-income families afford a home, but also gives those families a much greater choice of where to live.", "url": "https://www.cnn.com/2021/08/05/perspectives/julian-castro-eviction-moratorium-housing-vouchers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804160528-restricted-housing-rights-rally-0630-super-tease.jpg", "publishedAt": "2021-08-05T12:33:02Z", "content": "Julián Castro was Secretary of Housing and Urban Development for President Obama from 2014 to 2017. The opinions expressed in this commentary are his own. \r\nEarlier this week, the US Centers for Dise… [+3643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on the Covid-19 pandemic in the US", "description": "The Delta variant continues to spread across the US accounting for more than 90% of Covid-19 cases. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175742-05-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-08-05T12:07:28Z", "content": "Coronavirus-related deaths in Africa reached a record peak in the week ending Aug. 1, according to data from the World Health Organization (WHO). \r\nOver 64,00 deaths were recorded across Africa, a 2%… [+1044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Planets similar to those in our solar system found around nearby star", "description": "An array of planets with similarities to some in our solar system, including an ocean world and a potentially habitable planet, have been found around a nearby star by astronomers using the European Southern Observatory's Very Large Telescope in Chile.", "url": "https://www.cnn.com/2021/08/05/world/nearby-star-exoplanet-discovery-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804145645-01-exoplanets-0804-super-169.jpg", "publishedAt": "2021-08-05T12:00:10Z", "content": "An array of planets with similarities to some in our solar system have been found around a nearby star by astronomers using the European Southern Observatorys Very Large Telescope in Chile.\r\nThe star… [+3262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Reality television is heading to outer space", "description": "Two upcoming reality television shows plan to offer a once-in-a-lifetime grand prize: A trip to space. Mike Massimino, a former astronaut, talks to CNN Business about the feasibility of these shows taking off.", "url": "https://www.cnn.com/videos/business/2021/08/04/filming-in-space-reality-television-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804162701-iss-international-space-station-super-tease.jpg", "publishedAt": "2021-08-05T11:54:01Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Robinhood brings the meme stock phenomenon full circle", "description": "Earlier this year, when GameStop shares exploded out of the blue, all eyes were on Robinhood, the commission-free trading app that was helping millions of amateur investors gain access to financial markets. Coordinating on social media, the app's users showed…", "url": "https://www.cnn.com/2021/08/05/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805070326-robinhood-ipo-times-square-072921-file-super-tease.jpg", "publishedAt": "2021-08-05T11:50:59Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)Earlier this year, when GameStop(GME) shares ex… [+6654 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Deidre McPhillips", "title": "Some states banning mask mandates in schools also have fewest teens vaccinated", "description": "As kids head back to school this month, vaccination rates among adolescents tend to be lower in states that have banned mask mandates in schools than in states that will require masks in schools, a new CNN analysis finds.", "url": "https://www.cnn.com/2021/08/05/health/covid-19-vaccinations-for-teens-state-rankings-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210723092944-vaccine-teens-super-169.jpg", "publishedAt": "2021-08-05T11:44:26Z", "content": "As kids head back to school this month, vaccination rates among adolescents tend to be lower in states that have banned mask mandates in schools than in states that will require masks in schools, a n… [+9135 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel A. Medina", "title": "He is one of only 39 detainees left at Guantanamo. Once tortured, prisoner's case is a test of larger political realities at play.", "description": "Mohammed al-Qahtani is one of only 39 detainees left at Guantanamo. Once tortured, prisoner's quest for freedom is a test of larger political realities at play for the Biden administration.", "url": "https://www.cnn.com/2021/08/05/politics/guantanamo-detainee-qahtani-biden-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803210932-20210803-guantanamo-qahtani-2-super-169.jpg", "publishedAt": "2021-08-05T11:22:01Z", "content": "Editors Note: Illustrations are artists renderings based on military and court records.\r\nNearly two decades ago, in the aftermath of the September 11th attacks, a man named Mohammed al-Qahtani was ca… [+17712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Rokus and Christina Carrega, CNN", "title": "Former Louisville police officer pleads guilty to hitting a person in the head during an arrest in May 2020", "description": "A former Louisville, Kentucky, police officer has pleaded guilty to hitting a kneeling person in the head who was surrendering during an arrest in May last year, according to a statement from the Department of Justice.", "url": "https://www.cnn.com/2021/08/05/us/former-louisville-officer-cory-evans-guilty-plea/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805043211-louisville-police-department-file-super-tease.jpg", "publishedAt": "2021-08-05T11:18:39Z", "content": "(CNN)A former Louisville, Kentucky, police officer has pleaded guilty to hitting a kneeling person in the head who was surrendering during an arrest in May last year, according to a statement from th… [+1757 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Juliana Koch, Philip Wang and Rodrigo Pedroso", "title": "Brazil's Jair Bolsonaro will be investigated over unproven voter fraud claims", "description": "A Brazilian Supreme Court justice has ruled that President Jair Bolsonaro should be investigated for his unproven claims that the country's electronic voting system is vulnerable to fraud.", "url": "https://www.cnn.com/2021/08/05/americas/brazil-bolsonaro-fraud-supreme-court-investigation-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720180405-jair-bolsonaro-0505-file-super-169.jpg", "publishedAt": "2021-08-05T10:59:52Z", "content": "A Brazilian Supreme Court justice has ruled that President Jair Bolsonaro should be investigated for his unproven claims that the countrys electronic voting system is vulnerable to fraud.\r\nWednesdays… [+3835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson", "title": "6 reasons to watch the final days of the Olympics", "description": "It may seem like all the stars of the 32nd Olympiad have already competed, but there are several Americans who are fighting for the gold before the games come to a close on Sunday.", "url": "https://www.cnn.com/2021/08/05/us/what-to-watch-final-days-of-olympics-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804212845-01-olympics-what-to-watch-super-169.jpg", "publishedAt": "2021-08-05T10:58:04Z", "content": "It may seem like all the stars of the 32nd Olympiad have already competed, but there are several Americans who are fighting for the gold before the games come to a close on Sunday. \r\nAlix Klineman an… [+3065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "Job growth is picking up again, but the Delta spike could change that", "description": "America's job market recovery is chugging along, but worries about the Delta variant derailing progress are rampant. Even as economists anticipate the best gains since last summer in Friday's jobs report, persistently high unemployment claims and a big miss i…", "url": "https://www.cnn.com/2021/08/05/economy/july-jobs-report-preview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804153047-jobs-report-preview-super-tease.jpg", "publishedAt": "2021-08-05T10:54:59Z", "content": "New York (CNN Business)America's job market recovery is chugging along, but worries about the Delta variant derailing progress are rampant. Even as economists anticipate the best gains since last sum… [+3269 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "The new seriousness of Amsterdam", "description": "As things pick up in Amsterdam, after a gruesome year due to the Covid-19 pandemic, Frida Ghitis writes from the capital of the Netherlands that \"there's an unfamiliar seriousness in the air.\"", "url": "https://www.cnn.com/2021/08/05/opinions/amsterdam-tourism-covid-19-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625150800-amsterdam-wants-rowdy-tourists-to-stay-away---city-center---getty-images-super-169.jpg", "publishedAt": "2021-08-05T10:35:14Z", "content": "Editors Note: Frida Ghitis (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washingt… [+6210 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen", "title": "Biden to announce new emissions standards, target that 50% of vehicles sold in US by 2030 are electric", "description": "President Joe Biden will sign an executive order Thursday aimed at shifting the US auto market decisively toward electric vehicles, announcing a new target that half of vehicles sold in the US by 2030 will be battery electric, fuel-cell electric or plug-in hy…", "url": "https://www.cnn.com/2021/08/05/politics/biden-emissions-standards-electric-vehicles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708143919-01-stellantis-electric-vehicle-strategy-super-169.jpg", "publishedAt": "2021-08-05T10:08:40Z", "content": "President Joe Biden will sign an executive order Thursday that points the US auto market toward electric vehicles, announcing a new target that half of vehicles sold in the country by 2030 will be ba… [+3844 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Nigeria seizes record $54 million in pangolin parts and elephant tusks", "description": "Officials in Nigeria - a hub for illegal wildlife trafficking - have seized a record amount of pangolin scales and claws and elephant tusks as the government attempts to combat the trade, the head of customs said on Wednesday.", "url": "https://www.cnn.com/2021/08/05/africa/pangolin-parts-seized-nigeria-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805093555-01-nigeria-pangolin-elephant-tusk-seizure-super-tease.jpg", "publishedAt": "2021-08-05T09:23:37Z", "content": "(CNN)Officials in Nigeria - a hub for illegal wildlife trafficking - have seized a record amount of pangolin scales and claws and elephant tusks as the government attempts to combat the trade, the he… [+1444 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "US returns over 17,000 looted artifacts to Iraq", "description": "In the largest ever repatriation of artifacts to Iraq, the US has returned thousands of smuggled items including statues and carvings from ancient Mesopotamia.", "url": "https://www.cnn.com/style/article/iraq-us-artifacts-repatriation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805090458-04-iraqi-artifacts-returned-super-tease.jpg", "publishedAt": "2021-08-05T08:56:29Z", "content": "arts\r\nThe US has returned more than 17,000 smuggled artifacts to Iraq this year, the country's foreign minister Faud Hussein told a press conference in Baghdad on Tuesday.\r\nThe items, some of which d… [+3337 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christine Koh", "title": "5 ways to support tweens' and teens' developing brains", "description": "Do you feel frustrated by adolescent self-centeredness, boundary pushing and questionable decision-making that seem to come out of nowhere, a dramatic departure from the sweet elementary school years?", "url": "https://www.cnn.com/2021/08/05/health/teen-tween-developing-brains-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731131316-stock-boy-using-computer-night-super-169.jpg", "publishedAt": "2021-08-05T08:33:09Z", "content": "Editors Note: Welcome to our CNN Wellness five-part series on adolescence a tough time under any circumstances. As our children head back to school this fall, learn more about helping your tweens and… [+7170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "How to practice mindfulness if you hate sitting still", "description": "People spend nearly half of their waking hours thinking about something other than what is going on right in front of them. But there's good news --- we are not doomed to a life being incapable of paying attention to more than half of our day.", "url": "https://www.cnn.com/2021/08/05/health/practice-mindfulness-hate-sitting-still-wellness-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804154938-woman-walking-stock-super-tease.jpg", "publishedAt": "2021-08-05T08:29:44Z", "content": "Welcome to our CNN Wellness five-part series on adolescence -- a tough time under any circumstances. As our children head back to school this fall, learn more about helping your tweens and teens unde… [+4056 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Giovanni Prati, CNN", "title": "Dubai's luxury megaproject Heart of Europe is creating a huge coral reef", "description": "Off the coast of Dubai, a property developer is planning to create up to 500,000 square meters of coral reef.", "url": "https://www.cnn.com/travel/article/dubai-heart-of-europe-coral-reef-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804095842-heart-of-europe-coral-regenerated-super-tease.jpg", "publishedAt": "2021-08-05T07:58:42Z", "content": "Dubai (CNN) Off the coast of Dubai, a property developer is planning to create up to 500,000 square meters of coral reef. \r\nKleindienst Group, the developer behind the Heart of Europe megaresort, whi… [+1309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe and Rebekah Riess", "title": "Miami-Dade leaders announce a series of meetings for policy changes after the Surfside collapse", "description": "Local and federal officials will convene a series of meetings, dubbed \"Sunshine\" meetings, to discuss possible changes following the Surfside condo building collapse, Miami-Dade officials announced Wednesday.", "url": "https://www.cnn.com/2021/08/05/us/surfside-miami-dade-sunshine-meetings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805030444-surside-condo-collapse-file-super-169.jpg", "publishedAt": "2021-08-05T07:30:21Z", "content": "Local and federal officials will convene a series of meetings, dubbed Sunshine meetings, to discuss possible changes following the Surfside condo building collapse, Miami-Dade officials announced Wed… [+2040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse and Jill Martin", "title": "Carl Lewis: US men's 4x100m relay fail is a 'total embarrassment,' says US sprint great", "description": "American track and field legend Carl Lewis didn't hold back in his assessment of the US men's 4x100m relay team after the quartet finished sixth in its semifinal on Thursday.", "url": "https://www.cnn.com/2021/08/05/sport/us-mens-4x100m-heat-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805022405-11-olympics-080521-mens-relay-track-super-169.jpg", "publishedAt": "2021-08-05T07:07:58Z", "content": "American track and field legend Carl Lewis didnt hold back in his assessment of the US mens 4x100m relay team after the quartet finished sixth in its semifinal on Thursday.\r\nThe performance by the te… [+2040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, Nadia Romero and Jeff Simon, CNN", "title": "As people of all ages flock to a Louisiana vaccination site, an official says he is optimistic outreach is working", "description": "As hospitals in Louisiana fill up with Covid-19 patients, vaccination sites in the state are also seeing increased traffic, leaving at least one hospital official optimistic that all the vaccination outreach is working.", "url": "https://www.cnn.com/2021/08/05/us/louisiana-baton-rouge-vaccination-increase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805014809-baton-rouge-louisiana-vaccination-increase-super-tease.jpg", "publishedAt": "2021-08-05T07:06:26Z", "content": "Baton Rouge, Louisiana (CNN)As hospitals in Louisiana fill up with Covid-19 patients, vaccination sites in the state are also seeing increased traffic, leaving at least one hospital official optimist… [+4434 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Sydney suffers worst pandemic day as lockdown area extended", "description": "Sydney reported its worst day of the Covid-19 pandemic on Thursday with five deaths and a record rise in locally acquired infections as a weeks-long hard lockdown is struggling to contain the highly contagious Delta strain of the coronavirus.", "url": "https://www.cnn.com/2021/08/05/australia/sydney-covid-deaths-lockdown-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805021228-01-sydney-lockdown-0804-super-tease.jpg", "publishedAt": "2021-08-05T06:55:53Z", "content": "Sydney reported its worst day of the Covid-19 pandemic on Thursday with five deaths and a record rise in locally acquired infections as a weeks-long hard lockdown is struggling to contain the highly … [+4495 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Manveena Suri, CNN", "title": "Delhi leaders order judicial inquiry into alleged rape and murder of 9-year-old girl", "description": "Delhi's chief minister has ordered a judicial inquiry into the alleged rape and murder of a 9-year-old girl in the Indian capital, as protests continue for a fifth day.", "url": "https://www.cnn.com/2021/08/05/india/india-dalit-rape-murder-judicial-inquiry-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805012754-arvind-kejriwal-0317-file-super-tease.jpg", "publishedAt": "2021-08-05T06:53:00Z", "content": "New Delhi (CNN)Delhi's chief minister has ordered a judicial inquiry into the alleged rape and murder of a 9-year-old girl in the Indian capital, as protests continue for a fifth day.\r\nSince Sunday, … [+4019 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Bill Gates says he regrets the time spent with Jeffrey Epstein: 'It was a huge mistake'", "description": "Microsoft founder Bill Gates regrets his gatherings with Jeffrey Epstein, the wealthy financial manager who was accused of child sex trafficking, he told CNN Wednesday.", "url": "https://www.cnn.com/2021/08/05/business/bill-gates-regrets-jeffrey-epstein-relations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804230437-bill-gates-2019-file-restricted-super-tease.jpg", "publishedAt": "2021-08-05T05:22:27Z", "content": "(CNN)Microsoft founder Bill Gates regrets his gatherings with Jeffrey Epstein, the wealthy financial manager who was accused of child sex trafficking, he told CNN Wednesday. \r\n\"It was a huge mistake … [+2276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "If we do not all get vaccinated, the next Covid-19 variant is just around the corner, expert says", "description": "Efforts to get more Americans vaccinated against Covid-19 are growing more urgent as an expert warns that if vaccination rates don't increase, the dangerous Delta variant could continue to evolve.", "url": "https://www.cnn.com/2021/08/05/health/us-coronavirus-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804231743-01-florida-hospital-covid-overflow-0729-super-tease.jpg", "publishedAt": "2021-08-05T04:33:08Z", "content": "(CNN)Efforts to get more Americans vaccinated against Covid-19 are growing more urgent as an expert warns that if vaccination rates don't increase, the dangerous Delta variant could continue to evolv… [+5181 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Republicans vying to replace Newsom in California recall attack his handling of Covid-19 in debate", "description": "Four of the Republican candidates vying to replace California Gov. Gavin Newsom in the September 14 recall election met on the debate stage Wednesday night, railing against Covid-19 mask mandates and accusing the Democrat of failing the state's business owner…", "url": "https://www.cnn.com/2021/08/05/politics/california-recall-debate-republicans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804223822-01-california-recall-debate-0804-super-tease.jpg", "publishedAt": "2021-08-05T04:05:03Z", "content": "(CNN)Four of the Republican candidates vying to replace California Gov. Gavin Newsom in the September 14 recall election met on the debate stage Wednesday night, railing against Covid-19 mask mandate… [+10792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Australia to establish $280 million reparations fund for 'Stolen Generation'", "description": "Australia will create a reparations fund of 380 million Australian dollars ($280 million) for members of its Indigenous population who were forcibly removed from their families, Australian media reported on Thursday, months after 800 survivors filed a class a…", "url": "https://www.cnn.com/2021/08/05/australia/australia-reparations-stolen-generation-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804232958-scott-morrison-0805-super-tease.jpg", "publishedAt": "2021-08-05T04:02:52Z", "content": "Australia will create a reparations fund of 380 million Australian dollars ($280 million) for members of its Indigenous population who were forcibly removed from their families, Australian media repo… [+2975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Adam Renton, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-05-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-05T04:00:19Z", "content": "We're heading into the final weekend of competition at the Olympics. As the Games draw to a close, here's what you need to know from Tokyo.\r\nA \"new phase\" of the pandemic: Though the Olympics have, b… [+3031 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN", "title": "How South African artist Penny Siopis is exploring 'Shame'", "description": "South African artist Penny Siopis created \"Shame\" nearly two decades ago, depicting scenes of regret, guilt and disappointment. Now, she has revisited it in a digital artwork.", "url": "https://www.cnn.com/style/article/penny-siopis-south-africa-artist-shame-revisited-spc-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804173039-restricted-02-penny-siopis-cover-image-super-tease.jpg", "publishedAt": "2021-08-05T03:29:02Z", "content": "artsPublished 5th August 2021\r\nGrowing up in South Africa in the 1950s and '60s, it was inevitable that Penny Siopis' work would be political. \r\nThe multimedia artist was born during apartheid, South… [+3845 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue", "title": "Lawyers for landlords ask federal court to block new eviction moratorium", "description": "Lawyers for a group of landlords and real estate companies asked a federal judge in Washington late Wednesday to put on hold the Biden administration's new eviction moratorium that prohibits landlords from evicting certain tenants who fail to pay rent amid th…", "url": "https://www.cnn.com/2021/08/04/politics/landlords-federal-court-block-eviction-moratorium/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731190840-home-eviction-lock-change-super-169.jpg", "publishedAt": "2021-08-05T02:54:46Z", "content": "Lawyers for a group of landlords and real estate companies asked a federal judge in Washington late Wednesday to put on hold the Biden administrations new eviction moratorium that prohibits landlords… [+2915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen, CNN", "title": "Ten people were killed and 20 were injured after a van crash near Encino, Texas", "description": "Ten people were killed and 20 people were taken to area hospitals after a van crashed on Highway 281 near Encino, Texas, Wednesday afternoon, according to Texas Department of Public Safety (DPS) spokesperson Sgt. Nathan Brandley.", "url": "https://www.cnn.com/2021/08/04/us/texas-van-crash-fatalities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804223158-01-encino-van-crash-super-tease.jpg", "publishedAt": "2021-08-05T02:44:52Z", "content": "(CNN)Ten people were killed and 20 people were taken to area hospitals after a van crashed on Highway 281 near Encino, Texas, Wednesday afternoon, according to Texas Department of Public Safety (DPS)… [+686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kate Springer, CNN", "title": "Why Phuket's \"Sandbox\" pilot project matters to other islands in Asia", "description": "Thailand's Phuket \"Sandbox\" pilot project -- which started welcoming fully vaccinated travelers for quarantine-free holidays on July 1 -- has captured the region's attention.", "url": "https://www.cnn.com/travel/article/thailand-phuket-sandbox-model-asia-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803163004-02-phuket-sandbox-tourism-super-tease.jpg", "publishedAt": "2021-08-05T02:41:18Z", "content": "(CNN) More than 10.5 million visitors in 2019. Over US$13 million in international tourism income. Close to 90% of the local GDP. \r\nIt would be an understatement to say that tourism fuels Phuket's ec… [+10566 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Martin Savidge and Jason Hanna, CNN", "title": "This Arkansas hospital is so short on nurses in this newest Covid-19 surge, it's offering a $25,000 signing bonus", "description": "University of Arkansas for Medical Science facility in Little Rock has 360 vacancies for health care providers, including 230 vacancies just for nurses.", "url": "https://www.cnn.com/2021/08/04/us/arkansas-health-care-burnout/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804194429-university-of-arkansas-for-medical-sciences-file-super-tease.jpg", "publishedAt": "2021-08-05T02:29:33Z", "content": "Little Rock, Arkansas (CNN)Takela Gardner began her nursing career just two years ago, but her patients already think she's a seasoned nurse. \r\nA registered nurse at a University of Arkansas for Medi… [+4945 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Selina Wang, CNN | Chie Kobayashi, CNN", "title": "Last of Tokyo's geishas cling to a disappearing trade", "description": "Geisha houses are struggling to survive amid Covid-19 restrictions and slowing demand for traditional banquets.", "url": "https://www.cnn.com/style/article/geishas-tokyo-disappearing-trade/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726060726-06-modern-geishas-style-super-tease.jpg", "publishedAt": "2021-08-05T02:11:09Z", "content": "artsPublished 5th August 2021\r\nWearing tall platform sandals and a long kimono, Ikuko glides across the room as if she were balancing a glass of water on her head. She gazes at a wall of old photos i… [+9907 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Delta variant is ravaging the world but its pushing Southeast Asia to breaking point", "description": "Countries across Asia are grappling with their worst coronavirus outbreaks of the pandemic, spurred by low vaccine rates and the highly-contagious Delta variant.", "url": "https://www.cnn.com/2021/08/04/asia/southeast-asia-delta-covid-explainer-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804000617-01-southeast-asia-delta-covid-intl-hnk-indonesia-super-tease.jpg", "publishedAt": "2021-08-05T00:46:10Z", "content": "Hong Kong (CNN)Countries across Asia are grappling with their worst coronavirus outbreaks of the pandemic, spurred by low vaccine rates and the highly-contagious Delta variant. \r\nWhile nations such a… [+11458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "New data on kids and Covid made even a GOP governor flip on masks in schools", "description": "The freedom coveted by some Americans to avoid vaccines and spurn masks is, increasingly, leading to a group of Americans that can't access vaccines getting Covid-19.", "url": "https://www.cnn.com/2021/08/04/politics/covid-kids-masks-vaccines-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804195723-hutchinson-covid-presser-0803-super-tease.jpeg", "publishedAt": "2021-08-05T00:01:07Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\n (CNN)The freedom coveted by some Americans to avoid vaccines and spurn masks is, i… [+8112 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "Boston Mayor compared vaccine policy to slavery-era freedom papers and birtherism", "description": "After New York City announced people will need proof of Covid-19 vaccination to enter some indoor facilities, acting Boston Mayor Kim Janey likened the rule to the slavery-era freedom papers.", "url": "https://www.cnn.com/2021/08/04/politics/boston-mayor-covid-19-vaccine-documents/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804173326-boston-mayor-kim-janey-screengrab-super-tease.jpg", "publishedAt": "2021-08-04T23:33:50Z", "content": "(CNN)After New York City announced people will need proof of Covid-19 vaccination to enter some indoor facilities, acting Boston Mayor Kim Janey likened the rule to the slavery-era freedom papers.\r\n\"… [+3061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Close, CNN", "title": "Simone Biles thanks Japanese gym where she secretly trained to regain her Olympic form", "description": "Simone Biles has tweeted thanks to a Japanese gym for allowing her to privately train while she attempted to regain her gold medal form after withdrawing during the women's artistic gymnastics team final at the Summer Olympics.", "url": "https://www.cnn.com/2021/08/04/sport/simone-biles-juntendo-gym-olympics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804191226-biles-womens-balance-beam-final-0803-super-tease.jpg", "publishedAt": "2021-08-04T23:18:50Z", "content": "I'll forever be thankful for Junetendo for allowing me to come train separately to try to get my skills back. The japanese are some of, if not the sweetest people I've ever met. https://t.co/2ZWrItJw… [+48 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Close, CNN", "title": "Simone Biles thanks Japanese gym where she secretly trained to regain her Olympic form", "description": "Simone Biles has tweeted thanks to a Japanese gym for allowing her to privately train while she attempted to regain her gold medal form after withdrawing during the women's artistic gymnastics team final at the Summer Olympics.", "url": "https://www.cnn.com/2021/08/04/sport/simone-biles-juntendo-gym-olympics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804191226-biles-womens-balance-beam-final-0803-super-tease.jpg", "publishedAt": "2021-08-04T23:18:50Z", "content": "I'll forever be thankful for Junetendo for allowing me to come train separately to try to get my skills back. The japanese are some of, if not the sweetest people I've ever met. https://t.co/2ZWrItJw… [+48 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sunlen Serfaty and Clare Foran", "title": "Freshman Rep. Cori Bush in national spotlight for her activism to fight eviction", "description": "Freshman Democratic Rep. Cori Bush has captured national attention for her high-profile activism after she slept on the steps of the US Capitol for several days to protest a lapse in the federal eviction moratorium amid the coronavirus pandemic.", "url": "https://www.cnn.com/2021/08/04/politics/cori-bush-eviction-protest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804123806-02-cori-bush-protests-super-169.jpg", "publishedAt": "2021-08-04T23:13:43Z", "content": "Freshman Democratic Rep. Cori Bush has captured national attention for her high-profile activism after she slept on the steps of the US Capitol for several days to protest a lapse in the federal evic… [+4423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt", "title": "US intervenes to protect state secrets in Saudi Crown Prince's vendetta against former spy", "description": "The Justice Department has made the extremely rare move of intervening in a court case against a former top Saudi intelligence official who has been targeted by Saudi Arabia's powerful Crown Prince, in order to protect classified intelligence secrets.", "url": "https://www.cnn.com/2021/08/04/politics/doj-mbs-lawsuit-vendetta-aljabri/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804164932-mohammed-bin-salman-0428-restricted-super-tease.jpg", "publishedAt": "2021-08-04T23:06:50Z", "content": "(CNN)The Justice Department has made the extremely rare move of intervening in a court case against a former top Saudi intelligence official who has been targeted by Saudi Arabia's powerful Crown Pri… [+5242 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The governors of the 4 largest states in the country are all under fire right now", "description": "Being governor is usually a great job. You have oodles of control, can get things done and don't have to worry about pesky things like the filibuster.", "url": "https://www.cnn.com/2021/08/04/politics/controversy-newsom-desantis-cuomo-abbott/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426185735-newsom-march-16-super-tease.jpg", "publishedAt": "2021-08-04T23:01:24Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Alex Marquardt, CNN", "title": "White House cyber official says 'commitment' by ransomware gang suggests Biden's warnings are working", "description": "White House Deputy National Security Advisor Anne Neuberger said Wednesday that the Biden administration thinks recent comments by a representative of a ransomware gang linked to the May attack on the Colonial Pipeline could amount to a \"commitment\" the group…", "url": "https://www.cnn.com/2021/08/04/politics/neuberger-ransomware-blackmatter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423170415-anne-neuberger-0217-super-tease.jpg", "publishedAt": "2021-08-04T22:22:43Z", "content": "(CNN)White House Deputy National Security Advisor Anne Neuberger said Wednesday that the Biden administration thinks recent comments by a representative of a ransomware gang linked to the May attack … [+4460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue", "title": "What the Supreme Court and lower courts have (and have not) said about the eviction moratorium", "description": "In an unusual press conference Tuesday, President Joe Biden suggested that he was playing out the judicial clock by issuing a new, more tailored eviction moratorium, which he believes may ultimately fail in the courts.", "url": "https://www.cnn.com/2021/08/04/politics/supreme-court-cdc-eviction-moratorium/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210524093346-scotus-0517-super-169.jpg", "publishedAt": "2021-08-04T22:03:10Z", "content": "In an unusual press conference Tuesday, President Joe Biden suggested that he was playing out the judicial clock by issuing a new, more tailored eviction moratorium, which he believes may ultimately … [+5850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "Renters are rejoicing now that eviction ban has been extended. What you need to know", "description": "This weekend, after the almost year-long ban on evictions expired, Ronald Leonard was terrified of being thrown out of his Daytona Beach, Florida, rental home. But then, on Tuesday evening, he heard the eviction moratorium had been extended again.", "url": "https://www.cnn.com/2021/08/04/homes/renters-relieved-eviction-ban-extended-feseries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804133314-housing-advocates-eviction-protest-0804-super-tease.jpg", "publishedAt": "2021-08-04T21:53:50Z", "content": "This weekend, after the almost year-long ban on evictions expired, Ronald Leonard was terrified of being thrown out of his Daytona Beach, Florida, rental home. But then, on Tuesday evening, he heard … [+6705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Valencia, Devon M. Sayers and Rachel Clarke, CNN", "title": "Students and parents welcome school -- with or without masks -- in Georgia", "description": "In hallways, classrooms and the cafeteria at a high school in Georgia, students and staff often choose to go maskless despite latest medical guidance aimed at stopping the spread of Covid-19.", "url": "https://www.cnn.com/2021/08/04/us/georgia-school-opens-masks-optional/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804095852-basa-classroom-super-tease.jpg", "publishedAt": "2021-08-04T21:36:50Z", "content": "Winder, Georgia (CNN)Schools are back in Barrow County, Georgia, with bulging bookbags, new shoes -- and masks optional.\r\nIn a rain-spattered car pool lane, both parents and students seemed more exci… [+4070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden administration developing plan to require all foreign visitors to be vaccinated", "description": "The Biden administration is developing a plan to mandate vaccinations for almost all foreign visitors to the US, a White House official confirms to CNN, though some exceptions are expected.", "url": "https://www.cnn.com/2021/08/04/politics/vaccines-foreign-visitors-to-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803220854-01-vaccine-vial-file-super-tease.jpg", "publishedAt": "2021-08-04T21:27:18Z", "content": "(CNN)The Biden administration is developing a plan to mandate vaccinations for almost all foreign visitors to the US, a White House official confirms to CNN, though some exceptions are expected. \r\nOf… [+1197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Jeremy Diamond, CNN", "title": "Biden changes his tune by getting confrontational with GOP governors over Covid spike", "description": "When Republican governors began prematurely lifting coronavirus restrictions in their states earlier this spring, President Joe Biden and his team largely kept their heads down, ramping up vaccine distribution while steering clear of rhetorical battles with p…", "url": "https://www.cnn.com/2021/08/04/politics/joe-biden-gets-confrontational-with-gop-governors-over-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804075846-04-biden-0803-super-tease.jpg", "publishedAt": "2021-08-04T21:26:32Z", "content": "(CNN)When Republican governors began prematurely lifting coronavirus restrictions in their states earlier this spring, President Joe Biden and his team largely kept their heads down, ramping up vacci… [+6596 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sarah Dean and Lauren Kent, CNN", "title": "UK to add Germany, Austria, several other European countries to 'green' travel list", "description": "The UK government will update its \"green\" travel list on Thursday to add Germany, Austria, Slovenia, Slovakia, Latvia, Romania, and Norway to the list.", "url": "https://www.cnn.com/travel/article/uk-green-travel-list-updates-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708125110-uk-travel-rules-change---heathrow---getty-images-super-tease.jpg", "publishedAt": "2021-08-04T21:22:18Z", "content": "London (CNN) The UK government will update its \"green\" travel list on Thursday to add Germany, Austria, Slovenia, Slovakia, Latvia, Romania, and Norway to the list. \r\nTravelers returning from green-l… [+2363 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe and Devan Cole, CNN", "title": "At least 4 New York district attorneys have requested materials from state's investigation into Cuomo", "description": "At least four district attorneys offices in New York have requested additional investigative information from the state's probe into sexual harassment allegations against Democratic Gov. Andrew Cuomo, saying they need the materials to determine whether incide…", "url": "https://www.cnn.com/2021/08/04/politics/cuomo-investigation-new-york-district-attorneys/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802222237-andrew-cuomo-file-0412-super-tease.jpg", "publishedAt": "2021-08-04T21:19:40Z", "content": "Washington (CNN)At least four district attorneys offices in New York have requested additional investigative information from the state's probe into sexual harassment allegations against Democratic G… [+4197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Derek Van Dam, CNN Meteorologist", "title": "Atlantic hurricane season is about to become more active than first forecast", "description": "NOAA's annual mid-season Atlantic Hurricane season outlook indicates the tropics have no plans of letting up, regardless of the recent lull in activity.", "url": "https://www.cnn.com/2021/08/04/weather/hurricane-season-forecast-update-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402041028-20210402-2021-hurricane-season-super-tease.jpg", "publishedAt": "2021-08-04T21:12:43Z", "content": "Aug 4, 2pm EDT: The Tropics are getting more active with two primary disturbances. One is several hundred miles east of the Lesser Antilles, and the other should emerge off W Africa late tomorrow. It… [+163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "What you need to know about vaccine mandates if you're visiting New York City", "description": "New York City's newly announced vaccine mandate for certain indoor activities raises questions for visitors about meeting the new requirements. Here's what we know right now.", "url": "https://www.cnn.com/travel/article/new-york-city-travelers-vaccine-mandates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804163203-new-york-city-skyline-super-tease.jpg", "publishedAt": "2021-08-04T21:10:26Z", "content": "(CNN) New York City's newly announced vaccine mandate for certain indoor activities raises questions for visitors about meeting the new requirements.\r\nThe Key to NYC pass, announced Tuesday by New Yo… [+2653 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Paton Walsh, CNN", "title": "Belarusian dissidents fear the regime will put them in detention camps. It may have already built one", "description": "Three layers of electrified fence. New security cameras. A military guard and a sign saying \"Entry forbidden.\" Windows with bars and reflective glass, on newly refurbished barrack buildings. All empty, bar the occasional security officer, deep in the forest o…", "url": "https://www.cnn.com/2021/08/04/europe/belarus-political-dissidents-camp-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804143609-01-cnn-belarus-prison-camps-super-tease.jpg", "publishedAt": "2021-08-04T20:45:13Z", "content": "Vilnius, Lithuania (CNN)Three layers of electrified fence. New security cameras. A military guard and a sign saying \"Entry forbidden.\" Windows with bars and reflective glass, on newly refurbished bar… [+5279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "New York Auto Show canceled again due to Covid", "description": "The New York International Auto Show, which had been scheduled to open to the public in just two weeks, has been canceled due to concerns about the Covid-19 Delta variant and the steps being taken to prevent it.", "url": "https://www.cnn.com/2021/08/04/cars/new-york-auto-show-canceled-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804143516-new-york-international-auto-show-file-restricted-super-tease.jpg", "publishedAt": "2021-08-04T20:19:27Z", "content": "(CNN)The New York International Auto Show, which had been scheduled to open to the public in just two weeks, has been canceled due to concerns about the Covid-19 Delta variant and the steps being tak… [+2334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Karol Suarez", "title": "Mexico sues gun makers over flow of arms from US", "description": "Mexico filed a lawsuit Wednesday against eleven gun manufacturers over fire arms that flow from the United States across the border and into criminal hands in Mexico, according to court documents obtained by CNN.", "url": "https://www.cnn.com/2021/08/04/americas/mexico-sues-gunmakers-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804152500-mexico-gunmaker-lawsuit-super-tease.jpg", "publishedAt": "2021-08-04T20:10:25Z", "content": "Mexico City (CNN)Mexico filed a lawsuit Wednesday against eleven gun manufacturers over fire arms that flow from the United States across the border and into criminal hands in Mexico, according to co… [+2698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Kristen Holmes, CNN", "title": "Biden's top health officials sending mixed messages on Covid-19 response", "description": "As the status of Covid-19 in the US has changed quickly in the last few weeks with the rise of the highly contagious Delta variant, the messages coming from public health officials inside the Biden administration have sometimes been muddled or contradictory.", "url": "https://www.cnn.com/2021/08/04/politics/biden-administration-mixed-messaging-covid-delta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623003752-us-coronavirus-wednesday-0623-super-tease.jpg", "publishedAt": "2021-08-04T20:02:32Z", "content": "(CNN)As the status of Covid-19 in the US has changed quickly in the last few weeks with the rise of the highly contagious Delta variant, the messages coming from public health officials inside the Bi… [+6634 chars]"}]}