{"status": "ok", "totalResults": 137, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone and Kristin Magaldi, CNN", "title": "The best sales to shop today: Roomba, Best Buy, Zappos and more", "description": "Today, you'll find a deal on our pick for best budget hair dryer, a discounted Roomba refurb and savings on Tushy bidets. All that and more below.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720101302-0720deals-super-169.jpg", "publishedAt": "2021-07-20T14:56:12Z", "content": "Today, youll find a deal on our pick for best budget hair dryer, a discounted Roomba refurb and savings on Tushy bidets. All that and more below.\r\nDitch your existing vacuum and let a robot handle cl… [+12164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "John Kerry warns 'time is running out' to address climate crisis, calling the last 30 years a 'failure'", "description": "John Kerry, the US Special Presidential Envoy for Climate, urged the world's governments to speed up efforts against the climate crisis Tuesday, saying the political response to it has \"failed\" to respond effectively for more than three decades.", "url": "https://www.cnn.com/2021/07/20/uk/john-kerry-climate-speech-london-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720113431-01-john-kerry-0712-super-tease.jpg", "publishedAt": "2021-07-20T14:52:42Z", "content": "London (CNN)John Kerry, the US Special Presidential Envoy for Climate, urged the world's governments to speed up efforts against the climate crisis Tuesday, saying the political response to it has \"f… [+4652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Ellen McAlpine", "title": "The best ring lights of 2021", "description": "Over the course of a month, we tested eight top-rated ring lights to determine which provided the best overall lighting, with two taking top honors.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/best-ring-lights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200807115842-underscored-best-ring-lights-lead-super-169.jpg", "publishedAt": "2021-07-20T14:45:19Z", "content": "Ring lights are exactly what they sound like: strips of LEDs built into a halo-like apparatus. By placing your camera, webcam, or smartphone in the center of the ring, you minimize shadows and get fl… [+13924 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jamie Beck Alexander", "title": "Seeking your climate refuge? Consider this", "description": "Jamie Beck Alexander writes that anyone who is uprooting their lives because of  the climate crisis -- like her family has done -- shouldn't move in silence. In their new community, they should signal the urgency and gravity of the issue by showing up to city…", "url": "https://www.cnn.com/2021/07/20/opinions/climate-change-migration-alexander/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720095641-04-bootleg-fire-0717-super-tease.jpg", "publishedAt": "2021-07-20T14:42:48Z", "content": "Jamie Beck Alexander is director of Drawdown Labs at Project Drawdown, a nonprofit dedicated to using existing solutions to stop global warming. The views expressed in this commentary are her own. Vi… [+6594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson, CNN", "title": "Deaf-blind US Paralympian withdraws from Tokyo Games after request to bring her mother is denied", "description": "Becca Meyers, a deaf and blind American swimmer, has withdrawn from the Tokyo 2020 Paralympic Games after she said the United States Olympic & Paralympic Committee (USOPC) denied her request to bring her mother to serve as her Personal Care Assistant.", "url": "https://www.cnn.com/2021/07/20/us/becca-meyers-us-paralympic-tokyo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720143931-paralympic-swimmer-becca-meyers-0619-super-tease.jpg", "publishedAt": "2021-07-20T14:33:36Z", "content": "(CNN)Becca Meyers, a deaf and blind American swimmer, has withdrawn from the Tokyo 2020 Paralympic Games after she said the United States Olympic &amp; Paralympic Committee (USOPC) denied her request… [+1914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Krystin Arneson", "title": "Madewell now sells \"preloved\" jeans — here's how you can buy a pair", "description": "The new \"Madewell Forever\" platform helps customers find a new home for well-cared-for jeans, whether they're cleaning out their closet and looking for a place to pass them on, or they're in the market for a new pair of denim themselves.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/madewell-forever-secondhand-jeans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720102415-madewell-lead-super-169.jpg", "publishedAt": "2021-07-20T14:32:26Z", "content": "Madewells long been known for great quality, stylish denim and the brand has just launched a new section of the website to make shopping for jeans more sustainable: The new Madewell Forever platform … [+1490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "by Kai Burkhardt and Kai Burkhardt", "title": "The best alarm clocks of 2021", "description": "To help you replace your phone's alarm, we put 15 top-rated alarm clocks to the test — from analog tickers to tech-filled wake-up lights. For a whole month, we set alarms, let them ring and snoozed (maybe a bit too often) to find the absolute best.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/best-alarm-clocks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210219123146-best-alarm-clock-winners-lead-super-169.jpg", "publishedAt": "2021-07-20T14:30:08Z", "content": "An alarm clock may seem outdated, with your smartphones endless number of tones and apps to wake you up. But using your phone as your alarm can tempt you to use it before you tuck in, and that can le… [+22069 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Kevin McCarthy's picks for the 1/6 commission reveal his true goals", "description": "House Republican leader Kevin McCarthy sent a very clear signal to Democrats -- and the country -- on Monday: He has zero interest in getting to the bottom of what really happened (and why) when the US Capitol was stormed by rioters convinced by former Presid…", "url": "https://www.cnn.com/2021/07/20/politics/kevin-mccarthy-jim-jordan-1-6-commission/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191108093542-02-jim-jordan-lead-image-super-tease.jpg", "publishedAt": "2021-07-20T14:26:35Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jason Cipriani", "title": "The Moto G Stylus 5G makes a high-end smartphone feature more affordable than ever", "description": "There aren't many options for smartphone users who want a phone that includes a stylus to jot notes or sketch. On the high end, there's Samsung's Galaxy Note 20 or S21 Ultra, both of which will set you back over $1,000.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/motorola-moto-g-stylus-5g-2021-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720094958-3-motorola-moto-g-stylus-5g-review--super-169.jpg", "publishedAt": "2021-07-20T14:16:08Z", "content": "There arent many options for smartphone users who want a phone that includes a stylus to jot notes or sketch. On the high end, theres Samsungs Galaxy Note 20 or S21 Ultra, both of which will set you … [+9973 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "White House reviewing Section 230 amid efforts to push social media giants to crack down on misinformation", "description": "The White House is reviewing whether social media platforms should be held legally accountable for publishing misinformation via Section 230, a law that protects companies' ability to moderate content, White House communications director Kate Bedingfield said…", "url": "https://www.cnn.com/2021/07/20/politics/white-house-section-230-facebook/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715133120-01-biden-child-tax-credit-0715-super-tease.jpg", "publishedAt": "2021-07-20T13:51:05Z", "content": "(CNN)The White House is reviewing whether social media platforms should be held legally accountable for publishing misinformation via Section 230, a law that protects companies' ability to moderate c… [+2951 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Jeff Bezos just went to space and back", "description": "Jeff Bezos, the world's richest man, went to space and back Tuesday morning on an 11-minute, supersonic joy ride aboard the rocket and capsule system developed by his space company, Blue Origin.", "url": "https://www.cnn.com/2021/07/20/tech/jeff-bezos-blue-origin-launch-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720091441-17jeff-bezos-spaceflight-0720---screenshot-super-tease.jpg", "publishedAt": "2021-07-20T13:29:58Z", "content": "New York (CNN Business)Jeff Bezos, the world's richest man, went to space and back Tuesday morning on an 11-minute, supersonic joy ride aboard the rocket and capsule system developed by his space com… [+6502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards and Tanya Edwards", "title": "Your guide to hosting the ultimate Olympics party", "description": "While the stands at the Tokyo Olympics won't be packed with fans, there is absolutely nothing stopping you from throwing an Olympics viewing party. If you're stuck for ideas, we've rounded up 20 items to help you plan a podium worthy party.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/olympics-party-ideas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716081304-olympics-party-lead-super-169.jpg", "publishedAt": "2021-07-20T13:27:37Z", "content": "While the stands at the Tokyo 2020 Olympics (happening in 2021, thanks pandemic) wont be packed with fans, there is absolutely nothing stopping you from throwing an Olympics viewing party when the ga… [+3118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Hailey Bieber shuts down pregnancy speculation", "description": "When Justin Bieber posted a photo of him and his wife captioned \"Mom and Dad\" his followers were like \"baby, baby, baby, oh.\" But wait a minute before you start picking baby names.", "url": "https://www.cnn.com/2021/07/20/entertainment/justin-hailey-bieber-baby-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200214111249-hailey-bieber-justin-bieber-0127-super-tease.jpg", "publishedAt": "2021-07-20T13:04:20Z", "content": "(CNN)When Justin Bieber posted a photo of him and his wife captioned \"Mom and Dad\" his followers were like \"baby, baby, baby, oh.\"\r\nBut wait a minute before you start picking baby names.\r\nHis wife, H… [+649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "US gymnast Kara Eaker's father says she doesn't know where she got Covid-19 before the Olympics", "description": "What could have been the pinnacle of her acclaimed career has been thwarted by positive coronavirus tests. But US gymnast Kara Eaker is already looking forward to life beyond the Tokyo Olympics, her father told CNN on Tuesday.", "url": "https://edition.cnn.com/2021/07/20/sport/kara-eaker-covid-father/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720070639-kara-eaker-file-super-tease.jpg", "publishedAt": "2021-07-20T13:00:41Z", "content": "(CNN)What could have been the pinnacle of her acclaimed career has been thwarted by positive coronavirus tests. But US gymnast Kara Eaker is already looking forward to life beyond the Tokyo Olympics,… [+1879 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Wisconsin Lt. Gov. Mandela Barnes to join crowded Senate Democratic primary", "description": "Wisconsin Lt. Gov. Mandela Barnes is expected to announce a Senate run Tuesday in Milwaukee, a source familiar with the plans tells CNN, adding yet another name to the already crowded Democratic primary race for the seat.", "url": "https://www.cnn.com/2021/07/20/politics/mandela-barnes-wisconsin-senate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720085345-mandela-barnes-file-super-tease.jpg", "publishedAt": "2021-07-20T13:00:12Z", "content": "(CNN)Wisconsin Lt. Gov. Mandela Barnes is expected to announce a Senate run Tuesday in Milwaukee, a source familiar with the plans tells CNN, adding yet another name to the already crowded Democratic… [+2578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Naveen Kumar", "title": "The best men's shorts to shop now, according to style experts", "description": "Whether you like relaxed-fit and full coverage or cut offs, there are pairs out men's shorts waiting to be seized. We tapped style experts to pick their favorites of the season, alongside top-rated picks from our favorite trusted retailers.", "url": "https://www.cnn.com/2021/07/20/cnn-underscored/best-mens-shorts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714121635-shortslead-super-169.jpg", "publishedAt": "2021-07-20T13:00:03Z", "content": "Calves are in season. So are mid-thighs, for men who dare to go there. With the dog days of summer around the corner, your legs will thank you for restocking your shorts supply now.\r\nShorts come in a… [+6063 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Mike Hayes and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the Covid-19 pandemic as Olympics approach", "description": "A gymnast, a tennis hopeful, a basketball player and others has tested positive for Covid-19 days before the start of the Summer Games. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/olympics-coronavirus-pandemic-07-20-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708055514-01-tokyo-state-of-emergency-olympics-spt-intl-super-tease.jpg", "publishedAt": "2021-07-20T12:15:29Z", "content": "Belgium will maintain its compulsory mask mandate and tighten its travel rules following a review of its coronavirus measures, Belgian Prime Minister Alexander De Croo announced Monday.\r\nSpeaking at … [+1784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox and Nic Robertson, CNN", "title": "Rockets land near Afghanistan's presidential palace during Eid prayers", "description": "Three rockets landed in two different areas near the presidential palace in Kabul, Afghanistan on Tuesday morning, as President Ashraf Ghani joined other high ranking officials for prayers to mark the Muslim holiday of Eid al-Adha.", "url": "https://www.cnn.com/2021/07/20/middleeast/afghanistan-rockets-presidential-palace-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720111500-01-afghanistan-attack-0720-restricted-super-tease.jpg", "publishedAt": "2021-07-20T12:01:18Z", "content": "(CNN)Three rockets landed in two different areas near the presidential palace in Kabul, Afghanistan on Tuesday morning, as President Ashraf Ghani joined other high ranking officials for prayers to ma… [+3956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden to focus on Covid-19, infrastructure, climate and cybersecurity at Cabinet meeting", "description": "President Joe Biden is holding his second full Cabinet meeting on Tuesday to mark six months in office, and is expected to focus the discussion on Covid-19, infrastructure, climate and cybersecurity, a White House official tells CNN.", "url": "https://www.cnn.com/2021/07/20/politics/biden-cabinet-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719124237-02-biden-economy-remarks-0719-super-tease.jpg", "publishedAt": "2021-07-20T12:00:00Z", "content": "(CNN)President Joe Biden is holding his second full Cabinet meeting on Tuesday to mark six months in office, and is expected to focus the discussion on Covid-19, infrastructure, climate and cybersecu… [+2638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jackie-wattles\">Jackie Wattles</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Adrienne Vogt, CNN", "title": "Jeff Bezos ready to rocket into space", "description": "Jeff Bezos will fly to space today on the first crewed flight of the New Shepard, the rocket ship made by his space company, Blue Origin. Follow here for live updates.", "url": "https://www.cnn.com/business/live-news/jeff-bezos-space-flight-07-20-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719075543-jeff-bezos-and-space-flight-crew-super-tease.jpg", "publishedAt": "2021-07-20T11:35:50Z", "content": "Amazon founder Jeff Bezos is set to fly to space today on the first crewed flight of the New Shepard, the rocket ship made by his space company, Blue Origin.\r\nBezos who recently stepped down as Amazo… [+783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "Boris Johnson had to be talked out of meeting the Queen early on in the pandemic, ex-adviser claims", "description": "Boris Johnson's former chief adviser has claimed that the Prime Minister tried to maintain his weekly face-to-face audiences with Queen Elizabeth during the early stages of the Covid-19 pandemic, despite the elderly monarch being vulnerable to the virus.", "url": "https://www.cnn.com/2021/07/20/uk/boris-johnson-queen-meeting-cummings-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200327121833-boris-johnson-queen-elizabeth-call-split-0325-super-tease.jpg", "publishedAt": "2021-07-20T11:34:59Z", "content": "London (CNN)Boris Johnson's former chief adviser has claimed that the Prime Minister tried to maintain his weekly face-to-face audiences with Queen Elizabeth during the early stages of the Covid-19 p… [+3850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "City children have better mental health and cognition if they live near woodlands", "description": "City children who have daily exposure to woodland have better cognitive development and a lower risk of emotional and behavioral problems, according to a new study published in Nature Sustainability.", "url": "https://www.cnn.com/2021/07/20/health/woodland-children-wellness-scn-intl-scli-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719120918-01-stockhill-forest-file-super-tease.jpg", "publishedAt": "2021-07-20T11:11:48Z", "content": "London (CNN)City children who have daily exposure to woodland have better cognitive development and a lower risk of emotional and behavioral problems, according to a new study published in Nature Sus… [+4873 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jacqueline Howard and Elizabeth Stuart, CNN", "title": "Pediatricians' group says all kids should wear masks in school, but some states block such mandates", "description": "As students return to school in the coming weeks, some will be masked and some won't. With different state laws around what schools can require -- and some schools enforcing masks and others not -- the ever-changing rules have left some parents, teachers and …", "url": "https://www.cnn.com/2021/07/20/health/school-mask-mandates-covid-19-cnn-analysis-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200724040145-child-wearing-backpack-and-mask-stock-super-169.jpg", "publishedAt": "2021-07-20T10:52:35Z", "content": "As students return to school in the coming weeks, some will be masked and some wont. With different state laws around what schools can require and some schools enforcing masks and others not the ever… [+5833 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Olympic athletes, baseball players, soccer stars: Why we're still seeing Covid-19 cases among top athletes", "description": "The sports world, just days ahead of one of its premier global events, has been dealing with a significant and concerning number of Covid-19 cases.", "url": "https://edition.cnn.com/2021/07/20/sport/covid-sports-world-olympics-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719194723-entrance-to-olympic-village-0719-super-tease.jpg", "publishedAt": "2021-07-20T10:35:37Z", "content": "(CNN)The sports world, just days ahead of one of its premier global events, has been dealing with a significant and concerning number of Covid-19 cases.\r\nThere have been calls by some Japanese reside… [+6324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for July 20: Covid-19, cyberattacks, infrastructure, Haiti, Surfside", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/07/20/us/five-things-july-20-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720051326-0720-5things-super-tease.jpg", "publishedAt": "2021-07-20T10:22:29Z", "content": "Now begins the era of the meta-analysis, in which researchers look at hundreds of studies and apply scientific principles to find those which do the best job of randomizing and controlling for compou… [+529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Ethiopia's Tigray forces enter neighboring Afar region, Afar says", "description": "Forces from Ethiopia's northern Tigray region have mounted attacks in neighboring Afar region, a spokesman for Afar said on Monday, marking an expansion of an eight-month-old conflict into a previously untouched area.", "url": "https://www.cnn.com/2021/07/20/africa/ethiopia-tigray-forces-afar-region-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720110356-tigray-forces-mekelle-ethiopia-06-30-2021-super-tease.jpg", "publishedAt": "2021-07-20T10:08:34Z", "content": "Addis Ababa, Ethiopia (CNN)Forces from Ethiopia's northern Tigray region have mounted attacks in neighboring Afar region, a spokesman for Afar said on Monday, marking an expansion of an eight-month-o… [+3974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Martin, CNN", "title": "WNBA players Nneka Ogwumike and Elizabeth Williams won't play for Nigeria at Olympics after appeal rejected", "description": "Nneka Ogwumike of the Los Angeles Sparks and Elizabeth Williams of the Atlanta Dream won't be able to play for Nigeria in the Tokyo Olympics after the Court of Arbitration for Sport (CAS) denied their appeal.", "url": "https://edition.cnn.com/2021/07/20/sport/nneka-ogwumike-elizabeth-williams-nigeria-tokyo-appeal-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720100608-nneka-ogwumike-super-tease.jpg", "publishedAt": "2021-07-20T09:30:50Z", "content": "(CNN)Nneka Ogwumike of the Los Angeles Sparks and Elizabeth Williams of the Atlanta Dream won't be able to play for Nigeria in the Tokyo Olympics after the Court of Arbitration for Sport (CAS) denied… [+2169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "South Africa court postpones Zuma's arms deal corruption trial for one month", "description": "A South African court on Tuesday adjourned former president Jacob Zuma's arms deal corruption trial to August 10, after the former leader applied for a postponement to appear in person rather than virtually.", "url": "https://www.cnn.com/2021/07/20/africa/zuma-corruption-trial-adjourned-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210223133256-jacob-zuma-super-tease.jpg", "publishedAt": "2021-07-20T09:19:40Z", "content": "(CNN)A South African court on Tuesday adjourned former president Jacob Zuma's arms deal corruption trial to August 10, after the former leader applied for a postponement to appear in person rather th… [+3022 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "World's best airlines for 2021, ranked by AirlineRatings.com", "description": "AirlineRatings.com has revealed its annual round-up of the best airlines and last year's winner Air New Zealand is this year's No. 2. Find out which airline got the top spot.", "url": "https://www.cnn.com/travel/article/airline-ratings-worlds-best-airlines-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719160255-qatar-airlines-takeoff-super-tease.jpg", "publishedAt": "2021-07-20T09:17:06Z", "content": "(CNN) It's been a strange year for the aviation industry, with many airlines grounding aircraft for significant chunks of 2020.\r\nBut as air travel returns in some regions, AirlineRatings.com has rele… [+2677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sarah Molano, CNN", "title": "Most romantic relationships start as friendships, study finds", "description": "Contrary to the popular perception that love typically sparks from passion, a new study finds two-thirds of romantic relationships begin as long-term friendships.", "url": "https://www.cnn.com/2021/07/20/health/romantic-relationships-start-as-friends-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719165310-young-couple-stock-super-169.jpg", "publishedAt": "2021-07-20T08:39:39Z", "content": "Contrary to the popular perception that love typically sparks from passion, a new study finds two-thirds of romantic relationships begin as long-term friendships.\r\nThough highly prevalent, the friend… [+5622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "From not speaking the language to competing for the national team at Tokyo 2020, Belgian runner Isaac Kimeli is aiming for gold", "description": "Kenya's golden grasslands and lush cornfields are a far cry from the rolling hills and green forests that run across Beersel in Belgium, a province just outside Brussels, where budding Olympian Isaac Kimeli has been training for his first Games.", "url": "https://edition.cnn.com/2021/07/20/sport/isaac-kimeli-profile-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618131121-20210618-olympics-isaac-kimeli-super-tease.jpg", "publishedAt": "2021-07-20T08:36:55Z", "content": "(CNN)Kenya's golden grasslands and lush cornfields are a far cry from the rolling hills and green forests that run across Beersel in Belgium, a province just outside Brussels, where budding Olympian … [+7637 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "6 ways to develop endurance and achieve your goals", "description": "Here are several key aspects for developing and maintaining endurance, according to experts who have worked with coaches and athletes on physical and mental endurance.", "url": "https://www.cnn.com/2021/07/20/health/how-to-achieve-endurance-goals-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716154648-02-endurance-wellness-stock-super-tease.jpg", "publishedAt": "2021-07-20T08:35:45Z", "content": "(CNN)When US Olympic weightlifting team member Harrison Maurus shows his strengths at this year's Games, the pandemic will have robbed him of getting to hear his mother cheer \"good lifting,\" a distin… [+6591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "Deadly US fires and European flooding push limits of scientists' climate projections", "description": "Climate scientists have for decades warned that the crisis would lead to more extreme weather, that it would become deadlier and more frequent. But many are expressing surprise that heat and rain records are being broken by such large margins.", "url": "https://www.cnn.com/2021/07/20/world/climate-change-extreme-weather-speed-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717191244-06b-western-europe-flood-0717-germany-super-tease.jpg", "publishedAt": "2021-07-20T08:02:21Z", "content": "(CNN)Until recently, climate change had been talked about as a future threat. Its frontlines were portrayed as remote places like the Arctic, where polar bears are running out of sea ice to hunt from… [+6515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, Michael Guy and Hollie Silverman, CNN", "title": "The Bootleg Fire in Oregon is so large, it's creating its own weather", "description": "As hot, dry weather conditions continue to fuel wildfires across much of the United States, the Bootleg Fire in Oregon has become so intense that it is creating its own weather.", "url": "https://www.cnn.com/2021/07/20/weather/us-western-wildfires-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719152710-19-western-wildfires-super-tease.jpg", "publishedAt": "2021-07-20T07:46:06Z", "content": "(CNN)As hot, dry weather conditions continue to fuel wildfires across much of the United States, the Bootleg Fire in Oregon has become so intense that it is creating its own weather.\r\nThe Bootleg Fir… [+3441 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Don't be 'fooled' into letting your guard down against Covid, US Surgeon General says", "description": "Although vaccinations have offered many in the US hope of curbing the Covid-19 pandemic, officials are struggling to get rates where they need to be. And having been tricked by the virus before, the US Surgeon General says now is the time to be cautious.", "url": "https://www.cnn.com/2021/07/20/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720012450-us-coronavirus-tuesday-0720-super-tease.jpg", "publishedAt": "2021-07-20T07:22:21Z", "content": "(CNN)Although vaccinations have offered many in the US hope of curbing the Covid-19 pandemic, officials are struggling to get rates where they need to be. And having been tricked by the virus before,… [+6594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mohammed Tawfeeq, CNN", "title": "ISIS claims responsibility for Iraq blast that left dozens dead", "description": "ISIS have claimed responsibility for an explosion that ripped through a busy market in the Iraqi capital on Monday, killing at least 27 people and wounding 32.", "url": "https://www.cnn.com/2021/07/20/middleeast/isis-claims-responsibility-iraq-blast-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720014612-01-isis-responsibility-iraq-blast-killed-dozens-intl-hnk-super-tease.jpg", "publishedAt": "2021-07-20T07:04:55Z", "content": "(CNN)ISIS have claimed responsibility for an explosion that ripped through a busy market in the Iraqi capital on Monday, killing at least 27 people and wounding 32.\r\nChildren and women were among the… [+2475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Reuters", "title": "Ancient 'sunken city' discovered in Egypt", "description": "Divers have discovered rare remains of a military vessel in the ancient sunken city of Thônis-Heracleion -- once Egypt's largest port on the Mediterranean -- and a funerary complex illustrating the presence of Greek merchants, the country said on Monday, July…", "url": "https://www.cnn.com/travel/article/thonis-heracleion-sunken-city-greece-egypt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720001127-01-thonis-heracleion-sunken-city-greece-egypt-super-tease.jpg", "publishedAt": "2021-07-20T05:26:39Z", "content": "(Reuters) Divers have discovered rare remains of a military vessel in the ancient sunken city of Thônis-Heracleion -- once Egypt's largest port on the Mediterranean -- and a funerary complex illustra… [+1606 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "The Surfside community mourns those lost in the collapse as search crews near the bottom of the debris", "description": "Search crews have been nearing the bottom of a pile of rubble left behind after a Surfside condo building collapsed nearly a month ago, according to officials. And as more families get answers, the community is grieving those lost.", "url": "https://www.cnn.com/2021/07/20/us/miami-dade-building-collapse-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719234326-miami-dade-building-collapse-tuesday-super-tease.jpg", "publishedAt": "2021-07-20T04:54:42Z", "content": "(CNN)Search crews have been nearing the bottom of a pile of rubble left behind after a Surfside condo building collapsed nearly a month ago, according to officials. And as more families get answers, … [+3999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Three arrested after social media video appeared to show boy being abused", "description": "Three people in Fulton County, Georgia, have been arrested and charged after the Atlanta Police Department's Special Victims Unit became aware of a social media video that appeared to show a young male being abused, possibly because of his sexual orientation,…", "url": "https://www.cnn.com/2021/07/20/us/georgia-social-media-abuse-video-arrests/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719223340-01-georgia-social-media-abuse-video-arrests-split-super-tease.jpg", "publishedAt": "2021-07-20T04:48:40Z", "content": "(CNN)Three people in Fulton County, Georgia, have been arrested and charged after the Atlanta Police Department's Special Victims Unit became aware of a social media video that appeared to show a you… [+2807 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "France, South Pacific nations to combat 'predatory' fishing as China extends reach", "description": "French President Emmanuel Macron said on Monday that France and South Pacific nations would launch a South Pacific coast guard network to counter \"predatory\" behavior, which an adviser said was aimed at illegal fishing, as China expands its maritime reach.", "url": "https://www.cnn.com/2021/07/20/asia/france-south-pacific-fishing-china-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719205843-macron-0719-super-169.jpg", "publishedAt": "2021-07-20T04:25:41Z", "content": "French President Emmanuel Macron said on Monday that France and South Pacific nations would launch a South Pacific coast guard network to counter predatory behavior, which an adviser said was aimed a… [+1703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chie Kobayashi and Heather Law, CNN", "title": "Tokyo Olympics composer resigns over historical bullying remarks", "description": "Japanese musician Keigo Oyamada has announced his intention to step down as a composer for the Tokyo 2020 opening and closing ceremonies after old interviews of bullying behavior resurfaced, days before the beleaguered Olympics are due to get underway.", "url": "https://edition.cnn.com/2021/07/20/sport/keigo-oyamada-resigns-bullying-remarks-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719133722-keigo-oyamada-file-super-tease.jpg", "publishedAt": "2021-07-20T04:03:28Z", "content": "Tokyo (CNN)Japanese musician Keigo Oyamada has announced his intention to step down as a composer for the Tokyo 2020 opening and closing ceremonies after old interviews of bullying behavior resurface… [+1044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "2020 was a record year for stress, hitting mothers with children at home hardest", "description": "Last year set records for stress, worry, anger and sadness among both men and women worldwide, according to a new planetary survey of emotions. But it hit women with kids at home hardest.", "url": "https://www.cnn.com/2021/07/20/health/2020-emotions-survey-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201209203849-stressed-mother-stock-super-tease.jpg", "publishedAt": "2021-07-20T04:02:14Z", "content": "(CNN)The pandemic year that will go down in history set records for stress, worry, anger and sadness among both men and women worldwide, according to a new planetary survey of emotions in 2020.\r\nStre… [+4303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "The huge Democratic bet on 'bricks and butter'", "description": "The spending proposals that Senate Democrats plan to begin advancing this week amount to a massive gamble that the party can simultaneously advance two of its longest-standing economic goals without generating a political backlash or overheating the economy.", "url": "https://www.cnn.com/2021/07/20/politics/democrats-infrastructure-bills/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707201230-0707-bideninfrastructure-super-tease.jpg", "publishedAt": "2021-07-20T04:01:10Z", "content": "While such a historic expansion in investment in infrastructure and the safety net will appeal to those who share those goals, a simultaneous expansion in borrowing and debt should not appeal to anyo… [+176 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, Karol Suarez and Jose Armijo, CNN", "title": "Peru's electoral authority declares Pedro Castillo President-elect, 6 weeks after runoff", "description": "Six weeks after voters headed to the polls in Peru, former schoolteacher and union leader Pedro Castillo has been  formally declared the country's President-elect. He will be sworn in on July 28, the bicentennial of Peruvian independence, election authorities…", "url": "https://www.cnn.com/2021/07/19/americas/peru-election-results-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719213408-castillo-peru-super-tease.jpg", "publishedAt": "2021-07-20T03:31:12Z", "content": "Bogota, Colombia (CNN)Six weeks after voters headed to the polls in Peru, former schoolteacher and union leader Pedro Castillo has been formally declared the country's President-elect. He will be swo… [+2634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Don Lincoln", "title": "The billionaires' space race is only just beginning", "description": "Weather and technical conditions permitting, a spacecraft will Tuesday be launched vertically from a location southeast of El Paso. It's expected to reach an altitude of 66 miles (106 km), leaving no doubt that it crossed the boundary between the sky and oute…", "url": "https://www.cnn.com/2021/07/19/opinions/jeff-bezos-space-flight-blur-origin-lincoln/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719174322-jeff-bezos-crane-intv-super-tease.jpg", "publishedAt": "2021-07-20T02:54:21Z", "content": "Don Lincoln is a senior scientist at the Fermi National Accelerator Laboratory. He is the author of several science books for general audiences, including the best-selling audio book \"The Theory of E… [+6793 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Thomas Page, CNN", "title": "Naomi Kawase's Olympic film promises to be like nothing you've ever seen before", "description": "Visiting coronavirus wards and profiling groundskeepers -- it's the Olympics, but not as we know it.", "url": "https://www.cnn.com/style/article/naomi-kawase-olympic-film-tokyo-2020-interview-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715143255-naomi-kawase-nov-2020-super-tease.jpg", "publishedAt": "2021-07-20T02:42:48Z", "content": "arts\r\nNaomi Kawase is on her phone in the back of a taxi, squeezing in this interview on the way to another shoot. For a director known for her lyrical brand of filmmaking, she talks at a clip; time … [+6643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianna Cerini, CNN", "title": "'Legally Blonde' at 20: The enduring legacy of Hollywood's pinkest wardrobe", "description": "There are a few reasons why movies go on to become cult classics. Sometimes, it's because of their storylines. Other times, it's their razor-sharp scripts and quotable, sassy one-liners.", "url": "https://www.cnn.com/style/article/legally-blonde-at-20-style-legacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716055729-restricted-02-legally-blonde-2001-super-tease.jpg", "publishedAt": "2021-07-20T02:02:47Z", "content": "There are a few reasons why movies go on to become cult classics. Sometimes, it's because of their storylines. Other times, it's their razor-sharp scripts and quotable, sassy one-liners. \r\n\"Legally B… [+5238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Paul LeBlanc, CNN", "title": "Biden orders review of remittances to Cuba", "description": "President Joe Biden has directed his administration to examine remittances to Cuba in the wake of protests on the island to determine ways for those residing in the US to send money to the country, a senior administration official told CNN.", "url": "https://www.cnn.com/2021/07/19/politics/cuba-remittances-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719124237-02-biden-economy-remarks-0719-super-tease.jpg", "publishedAt": "2021-07-20T00:59:26Z", "content": "Washington (CNN)President Joe Biden has directed his administration to examine remittances to Cuba in the wake of protests on the island to determine ways for those residing in the US to send money t… [+2509 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Kevin Liptak and Brian Fung, CNN", "title": "Biden administration debating whether and how to sanction China for ransomware attacks", "description": "The Biden administration has been debating internally whether and how to impose sanctions on China for its malfeasance in cyberspace, according to people familiar with the matter, as experts question why the White House has not gone further in penalizing Chin…", "url": "https://www.cnn.com/2021/07/19/politics/china-biden-ransomware/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719124236-01-biden-economy-remarks-0719-super-tease.jpg", "publishedAt": "2021-07-20T00:53:05Z", "content": "(CNN)The Biden administration has been debating internally whether and how to impose sanctions on China for its malfeasance in cyberspace, according to people familiar with the matter, as experts que… [+8295 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Covid-19 breakthrough infections are preventable, but it's going to take a big effort to stop them", "description": "As Covid-19 case numbers overall are on the rise again across the United States, breakthrough infections, while rare, are making headlines.", "url": "https://www.cnn.com/2021/07/19/health/covid-19-breakthrough-infections-who-gets-and-how-to-stop-them/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200818140046-inmunidad-covid19-super-tease.jpg", "publishedAt": "2021-07-19T23:46:12Z", "content": "(CNN)As Covid-19 case numbers overall are on the rise again across the United States, breakthrough infections, while rare, are making headlines. \r\nFlorida Rep. Vern Buchanan tested positive for Covid… [+6705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "Canada surpasses US vaccination rate as country prepares to reopen its borders", "description": "Canada notched a significant milestone this weekend, fully vaccinating about 50% of its population and surpassing the US vaccination rate for Covid-19.", "url": "https://www.cnn.com/2021/07/19/americas/canada-vaccination-rate-surpasses-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719171338-trudeau-vaccination-site-0715-super-tease.jpg", "publishedAt": "2021-07-19T23:34:22Z", "content": "Ottawa (CNN)Canada notched a significant milestone this weekend, fully vaccinating about 50% of its population and surpassing the US vaccination rate for Covid-19.\r\nAccording to Health Canada, nearly… [+4754 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson and Shelby Rose, CNN", "title": "America's 'moral obligation'", "description": "Those damaging America's democracy should listen to Sviatlana Tsikhanouskaya's testimony of what happens when a demagogue and his cronies actually succeed in stealing an election. The Belarusian opposition leader met US Secretary of State Antony Blinken on Mo…", "url": "https://www.cnn.com/2021/07/19/world/meanwhile-in-america-july-20-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719180428-02-sviatlana-tsikhanouskaya-cnn-super-tease.jpg", "publishedAt": "2021-07-19T23:32:20Z", "content": "This story was excerpted from the July 20 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)Those dam… [+3755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "6 injured in a Texas home explosion that damaged 2 other houses", "description": "Six people were injured due to a home explosion in Plano, Texas, that also damaged two other homes, according to Plano Fire-Rescue Lt. Daniel Daly.", "url": "https://www.cnn.com/2021/07/19/us/plano-texas-home-explosion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719185345-01-plano-house-explosion-super-tease.jpeg", "publishedAt": "2021-07-19T23:21:27Z", "content": "(CNN)Six people were injured due to a home explosion in Plano, Texas, that also damaged two other homes, according to Plano Fire-Rescue Lt. Daniel Daly. \r\nThree people were taken to the hospital, Dal… [+270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole and Jennifer Hansler, CNN", "title": "State Department raises travel advisory for the UK to its highest level as Covid-19 cases rise", "description": "The State Department is warning Americans against traveling to the United Kingdom as the country grapples with a rise in Covid-19 cases.", "url": "https://www.cnn.com/2021/07/19/politics/state-department-uk-covid-travel-advisory-level/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719135852-uk-covid-0719-super-tease.jpg", "publishedAt": "2021-07-19T23:19:30Z", "content": "Washington (CNN)The State Department is warning Americans against traveling to the United Kingdom as the country grapples with a rise in Covid-19 cases. \r\nThe department on Monday raised its travel a… [+2232 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tami Luhby, CNN", "title": "Hospitals could face $2 million fine for not disclosing prices under proposed Biden rule", "description": "The Biden administration is doubling down on a Trump-era rule that requires hospitals to disclose the rates they privately negotiate with insurers.", "url": "https://www.cnn.com/2021/07/19/politics/hospitals-prices-transparency/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719174749-hospital-0127-super-169.jpg", "publishedAt": "2021-07-19T23:18:43Z", "content": "The Biden administration is doubling down on a Trump-era rule that requires hospitals to disclose the rates they privately negotiate with insurers.\r\nA large number of hospitals have yet to comply wit… [+3384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julian Zelizer, CNN Political Analyst", "title": "Texas Senate declares war on history", "description": "Julian Zelizer writes that legislators in Texas want their state to cancel the required teaching of key aspects of civil rights in America, including Martin Luther King Jr.'s \"I have a Dream\" speech.", "url": "https://www.cnn.com/2021/07/19/opinions/texas-school-curriculum-civil-rights-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200717215425-mlk-march-selma-1965-super-tease.jpg", "publishedAt": "2021-07-19T22:56:47Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+8567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Paul LeBlanc, CNN", "title": "The US just called out China for hacking. Here's what you need to know.", "description": "The United States and its foreign allies on Monday accused China of a range of hostile cyber activities, including through a massive hack of Microsoft's email system and other ransomware attacks,", "url": "https://www.cnn.com/2021/07/19/politics/what-matters-for-july-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713184938-01-biden-xi-split-super-tease.jpg", "publishedAt": "2021-07-19T22:48:54Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The United States and its foreign allies on Monday accused China of… [+4948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona and Annie Grayer, CNN", "title": "Jim Jordan among 5 House Republicans selected by McCarthy for January 6 select committee", "description": "House Minority Leader Kevin McCarthy will select Reps. Jim Banks of Indiana, Jim Jordan of Ohio, Rodney Davis of Illinois, Kelly Armstrong of North Dakota and freshman Troy Nehls of Texas for the January 6 select committee, according to a GOP aide.", "url": "https://www.cnn.com/2021/07/19/politics/house-republicans-chosen-for-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719183450-mccarthy-banks-jordan-armstrong-davis-nehls-split-super-tease.jpg", "publishedAt": "2021-07-19T22:37:37Z", "content": "(CNN)House Minority Leader Kevin McCarthy will select Reps. Jim Banks of Indiana, Jim Jordan of Ohio, Rodney Davis of Illinois, Kelly Armstrong of North Dakota and freshman Troy Nehls of Texas for th… [+713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Here's how you can tell who's winning the fight for the Senate", "description": "Bring up the 2022 election in most crowds and you will get a lot of side-eye. And maybe a boo (or 10).", "url": "https://www.cnn.com/2021/07/19/politics/senate-2022-candidates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210127172614-hponly-20210127-senate-map2022-super-tease.png", "publishedAt": "2021-07-19T22:31:42Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Hansler and Naomi Thomas, CNN", "title": "US State Department joins CDC in raising UK travel advisory", "description": "The State Department raised its travel advisory for the United Kingdom to Level 4: Do Not Travel on Monday, aligning with an update made by the CDC earlier in the day.", "url": "https://www.cnn.com/travel/article/uk-travel-warning-cdc-state-department/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719180925-england-newcastle-july-2021-super-tease.jpg", "publishedAt": "2021-07-19T22:23:30Z", "content": "© 2021 Cable News Network.A Warner Media Company.All Rights Reserved.CNN Sans &amp; © 2016 Cable News Network."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Linda Speight", "title": "Europe's flood tragedy didn't have to be this severe", "description": "Hydrometeorologist Linda Speight writes that the scale of the floods in western Europe should not have come as a surprise. Various forecasting agencies had warned of serious flooding before the rain started falling, but there is clearly still a need to improv…", "url": "https://www.cnn.com/2021/07/19/opinions/europe-flood-climate-change-evacuations-speight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719132848-01-western-europe-floods-0719-restricted-super-tease.jpg", "publishedAt": "2021-07-19T22:10:27Z", "content": "Linda Speight (@Linda_sp8) is a hydrometeorologist at the University of Reading. Her research seeks to inform the development of effective flood forecast and warning systems by improving integration … [+7780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Britt McHenry's sexual harassment lawsuit against Fox News is voluntarily dismissed", "description": "Britt McHenry's sexual harassment lawsuit against Fox News and one of the network's on-air personalities, George \"Tyrus\" Murdoch, has been voluntarily dismissed by the parties involved.", "url": "https://www.cnn.com/2021/07/19/media/britt-mchenry-fox-news-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719172717-01-britt-mchenry-file-super-tease.jpg", "publishedAt": "2021-07-19T21:59:58Z", "content": "New York (CNN Business)Britt McHenry's sexual harassment lawsuit against Fox News and one of the network's on-air personalities, George \"Tyrus\" Murdoch, has been voluntarily dismissed by the parties … [+1702 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "White House won't commit to reopening northern border, despite announcement from Canada", "description": "The White House declined Monday to commit to reopening its northern border to Canadians after Canada's government said vaccinated US citizens would be able to enter on August 9.", "url": "https://www.cnn.com/2021/07/19/politics/us-canada-border-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708233408-canada-covid-visitors-trudeau-super-tease.jpg", "publishedAt": "2021-07-19T21:10:57Z", "content": "(CNN)The White House declined Monday to commit to reopening its northern border to Canadians after Canada's government said vaccinated US citizens would be able to enter on August 9.\r\n\"We are continu… [+2507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tierney Sneed, CNN", "title": "Man who threatened judge in Michael Flynn case gets 18 months in prison", "description": "Frank Caporusso, a Long Island man who left a threatening voicemail last year for the judge presiding over the Michael Flynn case, was sentenced Monday to 18 months in prison.", "url": "https://www.cnn.com/2021/07/19/politics/judge-sullivan-michael-flynn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200513143134-judge-emmet-sullivan-file-2009-super-169.jpg", "publishedAt": "2021-07-19T21:06:47Z", "content": "Frank Caporusso, a Long Island man who left a threatening voicemail last year for the judge presiding over the Michael Flynn case, was sentenced Monday to 18 months in prison. \r\nCaporusso was arreste… [+1445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Proud Boys leader pleads guilty to burning DC church's Black Lives Matter banner", "description": "The leader of the far-right Proud Boys pleaded guilty Monday to two misdemeanors stemming from his conduct in Washington, DC, amid violent pro-Donald Trump protests in December.", "url": "https://www.cnn.com/2021/07/19/politics/tarrio-proud-boys-guilty-plea/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210225163800-enrique-tarro-cnn-interview-soh-super-tease.jpg", "publishedAt": "2021-07-19T20:54:56Z", "content": "(CNN)The leader of the far-right Proud Boys pleaded guilty Monday to two misdemeanors stemming from his conduct in Washington, DC, amid violent pro-Donald Trump protests in December. \r\nEnrique Tarrio… [+2264 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Democrats look to drug spending to rescue infrastructure deal", "description": "Blocked from boosting revenues through enhanced Internal Revenue Service enforcement, congressional Democrats are turning to reducing drug spending as a possible way to salvage their $600 billion bipartisan infrastructure deal.", "url": "https://www.cnn.com/2021/07/19/politics/democrats-infrastructure-drug-spending/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-07-19T20:52:54Z", "content": "(CNN)Blocked from boosting revenues through enhanced Internal Revenue Service enforcement, congressional Democrats are turning to reducing drug spending as a possible way to salvage their $600 billio… [+3005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jenn Selva, CNN", "title": "Man convicted of murdering his wife on an Alaskan cruise is found dead in his prison cell", "description": "A Utah man convicted of murdering his wife on an Alaskan cruise after she demanded a divorce has been found dead in his prison cell.", "url": "https://www.cnn.com/2021/07/19/us/cruise-ship-killing-man-found-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170729182027-cruise-ship-death-casarez-segment-00001209-super-tease.jpg", "publishedAt": "2021-07-19T20:37:39Z", "content": "(CNN)A Utah man convicted of murdering his wife on an Alaskan cruise after she demanded a divorce has been found dead in his prison cell.\r\nAccording to a press release from the Alaska Department of C… [+1636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See how 17 news outlets are coming together to expose Pegasus spyware", "description": "Journalists from 17 news outlets are working together to expose evidence of spyware that specifically targets journalists, activists and politicians, calling it the Pegasus Project. CNN's Hadas Gold reports.", "url": "https://www.cnn.com/videos/business/2021/07/19/pegasus-project-spyware-qmb-vpx.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719000624-smartphone-group-stock-super-tease.jpg", "publishedAt": "2021-07-19T20:14:40Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Justice Department won't prosecute Wilbur Ross for misleading Congress about attempted 2020 census change", "description": "The Justice Department is declining to prosecute former Commerce Secretary Wilbur Ross for misrepresentations he made to Congress about the origins of the Trump administration's failed push to add a citizenship question to the 2020 census.", "url": "https://www.cnn.com/2021/07/19/politics/census-wilbur-ross-congress-inspector-general-justice-department/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191103141537-wilbur-ross-file-super-tease.jpg", "publishedAt": "2021-07-19T20:06:34Z", "content": "(CNN)The Justice Department is declining to prosecute former Commerce Secretary Wilbur Ross for misrepresentations he made to Congress about the origins of the Trump administration's failed push to a… [+3288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray and Allison Chinchar, CNN meteorologists", "title": "Olympic athletes face high heat and a possible typhoon this week", "description": "The Olympic forecast is hot.", "url": "https://www.cnn.com/2021/07/19/weather/olympics-outlook-weather-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716142651-01-weather-olympics-climate-0716-super-tease.jpg", "publishedAt": "2021-07-19T20:06:08Z", "content": "CNN weather is launching a weekly column, publishing Mondays with the weather news you should be aware of and the week's hurricane outlook. Find updates each week here.\r\n (CNN)Olympic athletes are th… [+5197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Wildfires raging in the West", "description": "Dozens of large wildfires are raging across the western United States as the region experiences a historic and unrelenting drought.", "url": "https://www.cnn.com/2021/07/19/us/gallery/western-wildfires-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719151051-02-western-wildfires-super-tease.jpg", "publishedAt": "2021-07-19T20:02:55Z", "content": "A firefighter battles the Bootleg Fire in the Fremont-Winema National Forest, along the Oregon and California border, on Thursday, July 15.\r\nUpdated 4:02 PM ET, Mon July 19, 2021\r\nA firefighter battl… [+791 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Frank Pallotta, CNN Business", "title": "Prince Harry is publishing a memoir", "description": "Prince Harry, one of the most talked-about figures in the world, is publishing a memoir next year that he calls \"wholly truthful.\"", "url": "https://www.cnn.com/2021/07/19/media/prince-harry-memoir/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324122721-01-prince-harry-file-super-169.jpg", "publishedAt": "2021-07-19T19:37:02Z", "content": "Prince Harry, one of the most talked-about figures in the world, is publishing a memoir next year that he calls wholly truthful.\r\nThe Duke of Sussex will release the book via Penguin Random House glo… [+1594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "Ransomware hits law firm with dozens of major corporate clients", "description": "A major law firm with name-brand clients in over a dozen sectors of the economy was hit by ransomware in February, it said, in a breach that may have leaked Social Security numbers, health insurance information and even biometric data.", "url": "https://www.cnn.com/2021/07/19/tech/ransomware-law-firm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719142516-02-computer-hacking-stock-super-tease.jpg", "publishedAt": "2021-07-19T19:26:16Z", "content": "(CNN Business)A major law firm with name-brand clients in over a dozen sectors of the economy was hit by ransomware in February, it said, in a breach that may have leaked Social Security numbers, hea… [+1850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Gard and Monica Garrett, CNN", "title": "Monsoon promises much needed rain for the parched West, but the prospect for lightning strikes could mean more fires", "description": "Monsoon season is in full swing in the West with no end in sight, bringing hopes of a dent in the unrelenting historic drought -- but with thunderstorms comes lightning and the potential for more wildfires.", "url": "https://www.cnn.com/2021/07/19/weather/monsoon-wildfires-west-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719112531-weather-lightning-monsoon-forecast-card-image-super-tease.jpg", "publishedAt": "2021-07-19T19:23:37Z", "content": "Although this monsoon season thus far has been much busier across Arizona than the last two were through mid-July, the ~73,000 CG lightning strikes we have had since June 15th is actually slightly be… [+151 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "This NYPD officer used an empty potato chip bag and tape to save a stabbing victim's life", "description": "A New York City Police Department (NYPD) officer used an empty bag of potato chips and some tape to treat a stabbing victim's wound, which authorities said ultimately, saved the victim's life.", "url": "https://www.cnn.com/2021/07/19/us/nypd-potato-chips-duct-tape-stabbing-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719124237-02-nypd-potato-chips-duct-tape-stabbing-trnd-super-tease.jpg", "publishedAt": "2021-07-19T19:08:37Z", "content": "(CNN)A New York City Police Department (NYPD) officer used an empty bag of potato chips and some tape to treat a stabbing victim's wound, which authorities said ultimately, saved the victim's life.\r\n… [+431 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "Harris tests negative for Covid-19 following meeting with Texas Democrats who tested positive", "description": "Vice President Kamala Harris tested negative for Covid-19 following a meeting with Texas state House Democrats, several of whom later tested positive, White House press secretary Jen Psaki said Monday.", "url": "https://www.cnn.com/2021/07/19/politics/kamala-harris-negative-texas-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713172704-01-harris-texas-democrats-0713-super-tease.jpg", "publishedAt": "2021-07-19T18:50:29Z", "content": "(CNN)Vice President Kamala Harris tested negative for Covid-19 following a meeting with Texas state House Democrats, several of whom later tested positive, White House press secretary Jen Psaki said … [+2011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Senator Angus King and Tom Fanning for CNN Business Perspectives", "title": "To combat cyberattacks, the US government and businesses must work more closely", "description": "As anyone who has watched the news the last few months can attest, the United States' critical infrastructure continues to be unacceptably vulnerable to cyberattacks. In early May, Colonial Pipeline, responsible for delivering refined gasoline to much of the …", "url": "https://www.cnn.com/2021/07/19/perspectives/cyberattacks-security-us-government-businesses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713153708-01-computer-hacking-stock-super-169.jpg", "publishedAt": "2021-07-19T18:49:23Z", "content": "Editors Note: Angus King is a senator from Maine and co-chair of the Cyberspace Solarium Commission. Tom Fanning is CEO of the Southern Company and a commissioner on the Cyberspace Solarium Commissio… [+6720 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Chelsea Handler is vaccinated, horny and probably a little high", "description": "Chelsea Handler hates the status quo. So, if she's got to get out and move the needle herself, she will.", "url": "https://www.cnn.com/2021/07/19/entertainment/chelsea-handler-tour/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719153148-chelsea-handler-headshot-super-tease.jpg", "publishedAt": "2021-07-19T18:30:13Z", "content": "(CNN)Chelsea Handler hates the status quo. So, if she's got to get out and move the needle herself, she will. \r\nThat's why she's developed new material for a new standup tour, \"Vaccinated and Horny,\"… [+5584 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Halsey welcomes first child with screenwriter Alev Aydin", "description": "Halsey is a mom. The singer announced on her Instagram on Monday that she and her boyfriend, Alev Aydin, have welcomed their first child together.", "url": "https://www.cnn.com/2021/07/19/entertainment/halsey-birth-baby/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113205204-05-cma-red-carpet-2019-super-tease.jpg", "publishedAt": "2021-07-19T18:25:56Z", "content": "(CNN)Halsey is a mom. The singer announced on her Instagram on Monday that she and her boyfriend, Alev Aydin, have welcomed their first child together.\r\n\"Gratitude. For the more 'rare' and euphoric b… [+604 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Krystin Arneson", "title": "Stock up on chic styles from Everlane's Summer Sale right now", "description": "Everlane's moved from \"Choose What You Pay\" sales into fixed-priced deals that we can't complain about — case in point, the brand's current Summer Sale, which offers up to 60% off year-round essentials.", "url": "https://www.cnn.com/2021/07/19/cnn-underscored/everlane-sale-summer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719140923-everlane-lead-super-169.jpg", "publishedAt": "2021-07-19T18:13:20Z", "content": "Everlanes moved from Choose What You Pay sales into fixed-priced deals that we cant complain about case in point, the brands current Summer Sale, which offers up to 60% off year-round essentials. Wer… [+3746 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Photos: Hajj pilgrimage limited by pandemic - CNN", "description": "<ol><li>Photos: Hajj pilgrimage limited by pandemic  CNN\r\n</li><li>Covid-19 global updates: Coronavirus forces another reduced hajj pilgrimage  The Washington Post\r\n</li><li>Masks and social distancing at downsized Hajj - BBC News  BBC News\r\n</li><li>With pan…", "url": "https://www.cnn.com/2021/07/19/world/gallery/hajj-2021-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719122456-0719-hajj7-super-tease.jpg", "publishedAt": "2021-07-19T17:56:00Z", "content": "Muslims pray at the Namira Mosque as they take part in the annual Hajj pilgrimage on Monday, July 19.\r\nUpdated 1:56 PM ET, Mon July 19, 2021\r\nMuslims pray at the Namira Mosque as they take part in th… [+674 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why the California recall might not be bad news for Gavin Newsom", "description": "Over the weekend, we got our clearest picture to date of what the September 14 recall election for Gov. Gavin Newsom (D) will look like. There will be 41 candidates on the ballot -- a far cry from the 100+ who appeared on the recall ballot in 2003 -- with Rep…", "url": "https://www.cnn.com/2021/07/19/politics/california-recall-election-gavin-newsom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210426185735-newsom-march-16-super-tease.jpg", "publishedAt": "2021-07-19T17:36:41Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Stuart, CNN", "title": "Federal judge upholds Indiana University's Covid-19 vaccination policy", "description": "A federal judge is upholding Indiana University's policy requiring students to receive Covid-19 vaccinations before returning to campus for the fall semester, after eight students filed a lawsuit claiming the schools vaccine policy was unconstitutional.", "url": "https://www.cnn.com/2021/07/19/us/iu-covid-vaccine-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719125108-indiana-univeristy-vaccination-protest-june-10-super-tease.jpg", "publishedAt": "2021-07-19T17:15:17Z", "content": "(CNN)A federal judge is upholding Indiana University's policy requiring students to receive Covid-19 vaccinations before returning to campus for the fall semester, after eight students filed a lawsui… [+1854 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein and Maegan Vazquez, CNN", "title": "Biden backs away from his claim that Facebook is 'killing people' by allowing Covid misinformation", "description": "President Joe Biden continued to put pressure on Facebook on Monday over the online dissemination of Covid-19 vaccine information, but backed off his recent accusation that the company was directly responsible for \"killing people\" and suggested it was merely …", "url": "https://www.cnn.com/2021/07/19/politics/joe-biden-facebook/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719124236-01-biden-economy-remarks-0719-super-tease.jpg", "publishedAt": "2021-07-19T17:14:49Z", "content": "(CNN)President Joe Biden continued to put pressure on Facebook on Monday over the online dissemination of Covid-19 vaccine information, but backed off his recent accusation that the company was direc… [+3774 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Covid-19 vaccine myths: These reasons for not getting a shot don't hold up. In fact, they'll set the US back", "description": "No, you can't get Covid-19 from the vaccine. Yes, doctors say young people need to get vaxxed (for several reasons). Here are 9 of the top myths fueling vaccine hesitancy, and why failing to get a shot could ruin other people's vaccinations.", "url": "https://www.cnn.com/2021/07/19/health/covid-vaccine-myths-debunked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719114336-01-vaccination-site-los-angeles-super-tease.jpg", "publishedAt": "2021-07-19T17:12:43Z", "content": "(CNN)Americans have an easy way to crush Covid-19 -- one that would let more businesses fully reopen safely, reduce the need for masks and help prevent more dangerous variants from emerging. \r\nBut ma… [+13684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marshall Cohen", "title": "First US Capitol rioter convicted of a felony gets 8 months in prison", "description": "A man who pleaded guilty to breaching the Senate chamber during the US Capitol insurrection was sentenced Monday to eight months in prison in a closely watched case that could influence how hundreds of other rioters charged with the same felony are punished.", "url": "https://www.cnn.com/2021/07/19/politics/capitol-riot-felony-paul-hodgkins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719094249-paul-hodgkins-capitol-rioter-super-169.jpg", "publishedAt": "2021-07-19T16:33:37Z", "content": "A man who pleaded guilty to breaching the Senate chamber during the US Capitol insurrection was sentenced Monday to eight months in prison in a closely watched case that could influence how hundreds … [+1656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, Barbara Starr and Jennifer Hansler, CNN", "title": "Biden administration planning to relocate some Afghans who worked for US to Virginia Army post", "description": "The Biden administration is planning to relocate a group of Afghans who have applied for special immigrant visas (SIV) to Fort Lee, a US army post in Virginia as early as this week, according to two sources familiar with the matter.", "url": "https://www.cnn.com/2021/07/19/politics/afghan-special-immigrant-visas-virginia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419123853-us-marine-afghan-interpreter-file-super-tease.jpg", "publishedAt": "2021-07-19T16:28:33Z", "content": "Washington (CNN)The Biden administration is planning to relocate a group of Afghans who have applied for special immigrant visas (SIV) to Fort Lee, a US army post in Virginia as early as this week, a… [+1663 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Blinken to meet with Belarus opposition leader in Washington", "description": "US Secretary of State Antony Blinken will meet with Belarusian opposition leader Sviatlana Tsikhanouskaya in Washington on Monday amid continued crackdowns in Belarus by strongman President Alexander Lukashenko.", "url": "https://www.cnn.com/2021/07/19/politics/belarus-opposition-leader-dc-visit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200908125427-svetlana-tikhanovskaya-super-tease.jpg", "publishedAt": "2021-07-19T16:17:29Z", "content": "Washington (CNN)US Secretary of State Antony Blinken will meet with Belarusian opposition leader Sviatlana Tsikhanouskaya in Washington on Monday amid continued crackdowns in Belarus by strongman Pre… [+3525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "ICE failed to send detainee with 'urgent' medical need to hospital who later died, watchdog finds", "description": "An Immigration and Customs Enforcement detainee in Mississippi with an urgent medical need was not sent to the hospital and later died, according to a Department of Homeland Security inspector general report obtained by CNN.", "url": "https://www.cnn.com/2021/07/19/politics/ice-urgent-medical-need-hospital-died-ig/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719120924-ice-police-officer-file-2019-super-tease.jpg", "publishedAt": "2021-07-19T16:14:41Z", "content": "(CNN)An Immigration and Customs Enforcement detainee in Mississippi with an urgent medical need was not sent to the hospital and later died, according to a Department of Homeland Security inspector g… [+3392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kai Burkhardt", "title": "The best beard trimmers of 2021", "description": "We went hands-on with some of the industry's top-rated and best-reviewed clippers and see which ones truly stand out. After dozens of trims, careful consideration and plenty of testing , we found three beard trimmers that — ahem — made the cut.", "url": "https://www.cnn.com/2021/07/19/cnn-underscored/best-beard-trimmers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200618171803-underscored-best-beard-trimmer-winners-super-169.jpg", "publishedAt": "2021-07-19T16:00:06Z", "content": "Beard trimmers run the gamut in terms of functions and abilities, and can be the difference between a manicured look versus a misshapen mess. Thats why we decided to go hands-on with some of the indu… [+15705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Coffee won't make your heart flutter, study says", "description": "Worried that coffee will make your heart go pitter-patter, and not in a good way? A new study puts to rest the fear that your daily fuel will cause heart palpitations -- or cardiac arrhythmia, as doctors call it.", "url": "https://www.cnn.com/2021/07/19/health/coffee-heart-flutters-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210208125723-black-coffee-stock-super-tease.jpg", "publishedAt": "2021-07-19T15:05:16Z", "content": "(CNN)Worried that coffee will make your heart go pitter-patter, and not in a good way? A new study puts to rest the fear that your daily fuel will cause heart palpitations -- or cardiac arrhythmia, a… [+2158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Michael Andronico", "title": "The Blue Yeti is the best gadget I ever bought — and still the best microphone out there", "description": "It was the summer of 2017. I was a few episodes into starting up a new podcast, and decided it was time to step up from my dependable-but-tiny Samson Go Mic in favor of something a little more professional. I had been eyeing the universally beloved $129 Blue …", "url": "https://www.cnn.com/2021/07/19/cnn-underscored/blue-yeti-microphone-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719094932-blue-yeti-lead-super-169.jpg", "publishedAt": "2021-07-19T15:01:01Z", "content": "It was the summer of 2017. I was a few episodes into starting up a new podcast, and decided it was time to step up from my dependable-but-tiny Samson Go Mic in favor of something a little more profes… [+7695 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Donald Trump is doing the opposite of leadership when it comes to vaccines", "description": "The numbers are deeply worrisome.", "url": "https://www.cnn.com/2021/07/19/politics/donald-trump-covid-19-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180508201326-07-trump-iran-deal-0508-super-tease.jpg", "publishedAt": "2021-07-19T14:57:31Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone and Kristin Magaldi, CNN", "title": "The best sales to shop today: Apple, Cricut, Casper and more", "description": "Today, you'll find a deal on our pick for best humidifier for large spaces, a discount on AirPods Pro and savings on Anker charging accessories. All that and more below.", "url": "https://www.cnn.com/2021/07/19/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719101652-0719dealslead-super-169.jpg", "publishedAt": "2021-07-19T14:56:32Z", "content": "Today, youll find a deal on our pick for best humidifier for large spaces, a discount on AirPods Pro and savings on Anker charging accessories. All that and more below.\r\nOur and really, everyones fav… [+11476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, Natalie Gallón, Matt Rivers and Etant Dupain, CNN", "title": "Haiti's acting prime minister Claude Joseph to step down amid power struggle after president's assassination", "description": "Haiti's acting prime minister Claude Joseph, who has led the country since the assassination of president Jovenel Moise earlier this month, will step down and hand power to Ariel Henry, the elections minister told CNN on Monday.", "url": "https://www.cnn.com/2021/07/19/americas/haiti-acting-pm-claude-joseph-to-step-down-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719153815-haiti-claude-joseph-0716-super-tease.jpg", "publishedAt": "2021-07-19T14:51:25Z", "content": "Port-au-Prince, Haiti (CNN)Haiti's acting prime minister Claude Joseph, who has led the country since the assassination of president Jovenel Moise earlier this month, will step down and hand power to… [+2192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "American Academy of Pediatrics recommends universal masking in schools for everyone older than 2", "description": "The American Academy of Pediatrics released new Covid-19 guidance for schools on Monday that supports in-person learning and, among other things, recommends universal masking in school of everyone over the age of 2.", "url": "https://www.cnn.com/2021/07/19/us/aap-open-schools-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719101654-01-masked-student-in-class-file-super-tease.jpg", "publishedAt": "2021-07-19T14:46:38Z", "content": "(CNN)The American Academy of Pediatrics released new Covid-19 guidance for schools on Monday that supports in-person learning and, among other things, recommends universal masking in school of everyo… [+1591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "CNN+ TO DEBUT IN Q1 2022", "description": "GLOBAL NEWS, INFORMATION AND LIFESTYLE SUBSCRIPTION SERVICE WILL PROVIDE NEW EXPERIENCE FOR CNN SUPERFANS, NEWS JUNKIES AND FANS OF QUALITY NON-FICTION CNN+, the much-anticipated streaming subscription service from CNN, will debut in Q1 2022. CNN is coming of…", "url": "https://cnnpressroom.blogs.cnn.com/2021/07/19/cnn-to-debut-in-q1-2022/", "urlToImage": null, "publishedAt": "2021-07-19T14:25:05Z", "content": "CNN+ to Debut in Q1 2022\r\nGLOBAL NEWS, INFORMATION AND LIFESTYLE SUBSCRIPTION SERVICE WILL PROVIDE NEW EXPERIENCE FOR CNN SUPERFANS, NEWS JUNKIES AND FANS OF QUALITY NON-FICTION\r\nCNN+, the much-antic… [+6289 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "Biden aims to directly counter inflation concerns as sweeping agenda hangs in the balance", "description": "President Joe Biden plans to use remarks on Monday to directly counter concerns that his sweeping economic agenda will serve as an accelerant to inflation amid growing concern about price hikes across the economic spectrum.", "url": "https://www.cnn.com/2021/07/19/politics/biden-inflation-concerns/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716101315-01-biden-0713-super-tease.jpg", "publishedAt": "2021-07-19T14:19:34Z", "content": "(CNN)President Joe Biden plans to use remarks on Monday to directly counter concerns that his sweeping economic agenda will serve as an accelerant to inflation amid growing concern about price hikes … [+4875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards and Tanya Edwards", "title": "Everything you need to know about the Mediterranean diet", "description": "The Mediterranean Diet consistently ranks as one of the healthiest overall diets. From knives and skillets to fresh fish and snacks, you can build your seaside happy place with these recommended buys.", "url": "https://www.cnn.com/2021/07/19/cnn-underscored/mediterranean-diet-food-list/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715141956-meddietlead-super-169.jpg", "publishedAt": "2021-07-19T13:59:36Z", "content": "When thinking of the Mediterranean, its easy to let the mind wander to a happy place relaxing on a hillside with a beautiful view of the sea below, while munching on olives, a veggie plate and a litt… [+5134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Juliet Izon, CNN", "title": "10 luxury hotel rooms where you can sleep in the great outdoors", "description": "Are you aching to sleep outdoors under the stars but don't want to wake up aching from a rough camping trip? These 10 luxury hotel rooms around the world offer the ultimate in pampering.", "url": "https://www.cnn.com/travel/article/hotel-rooms-outdoor-sleeping-world-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709125543-hotels-outdoor-sleeping-four-seasons-anguilla-super-tease.jpg", "publishedAt": "2021-07-19T13:41:42Z", "content": "(CNN) Our fear of being indoors has considerably abated since last year, but it's always magical to spend a night sleeping outside.\r\nAnd while you can simply camp in the backyard, we all deserve a li… [+8853 chars]"}]}