{"status": "ok", "totalResults": 112, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Turkey opens record-breaking bridge between Europe and Asia", "description": "The 1915 Canakkale Bridge features the world's longest single-span between suspension towers and will shorten travel times across the Dardanelles Strait from hours to just six minutes.", "url": "https://www.cnn.com/travel/article/turkey-worlds-biggest-bridge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318135445-01-canakkale-bridge-turkey-super-tease.jpg", "publishedAt": "2022-03-18T18:07:29Z", "content": "Istanbul (Reuters) President Tayyip Erdogan opened a massive suspension bridge across Turkey's Dardanelles Strait on Friday, the latest in a series of major infrastructure projects which he has prior… [+2670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Inflation is everywhere. Except your cell phone bill", "description": "Inflation is everywhere: grocery stores, gas stations, retailers and the housing market. But one important part of the economy has remained immune to higher prices: cell phone bills.", "url": "https://www.cnn.com/2022/03/18/investing/smartphones-price-plans-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317100337-cell-phone-plans-inflation-file-restricted-super-tease.jpg", "publishedAt": "2022-03-18T17:14:11Z", "content": "New York (CNN Business)Inflation is everywhere: grocery stores, gas stations, retailers and the housing market. But one important part of the economy has remained immune to higher prices: cell phone … [+3662 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Police arrest suspects in murder of former police officer who was protecting TV news crew", "description": "Police are holding two men on homicide charges and are seeking a third in the killing of a former police officer who was working security for a TV news crew in Oakland, California, last fall, the city's Police Chief, LaRonne Armstrong, said Thursday.", "url": "https://www.cnn.com/2022/03/18/us/caifornia-arrests-security-officer-tv-news-crew/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318071527-california-police-officer-killed-kevin-nishita-file-super-tease.jpg", "publishedAt": "2022-03-18T17:04:34Z", "content": "(CNN)Police are holding two men on homicide charges and are seeking a third in the killing of a former police officer who was working security for a TV news crew in Oakland, California, last fall, th… [+2280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "Her murder stumped investigators for 34 years. Now, DNA evidence points to a neighbor as her killer, police say", "description": "When Diane Lynn Dahn missed her shift at the San Diego Transit Corporation on May 2, 1988, a coworker went to her apartment to check on her.", "url": "https://www.cnn.com/2022/03/18/us/san-diego-cold-case-solved/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318095119-02-san-diego-cold-case-solved-super-tease.jpg", "publishedAt": "2022-03-18T16:45:31Z", "content": "(CNN)When Diane Lynn Dahn missed her shift at the San Diego Transit Corporation on May 2, 1988, a coworker went to her apartment to check on her. \r\nHer coworker discovered her lifeless body in her be… [+4421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher, CNN", "title": "Mark Meadows' voter registration under investigation by state officials in North Carolina", "description": "State investigators in North Carolina are looking into the voter registration of Mark Meadows, the former Republican congressman and White House chief of staff who pushed baseless claims of voter fraud to try to overturn the 2020 election results.", "url": "https://www.cnn.com/2022/03/18/politics/mark-meadows-trump-aide-voter-north-carolina/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220107184224-mark-meadows-file-102120-super-tease.jpg", "publishedAt": "2022-03-18T16:35:51Z", "content": "(CNN)State investigators in North Carolina are looking into the voter registration of Mark Meadows, the former Republican congressman and White House chief of staff who pushed baseless claims of vote… [+3279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "What is Queen Elizabeth II's greatest achievement?", "description": "When Elizabeth acceded to the throne, the British Empire was collapsing. She stopped the rot by making the Commonwealth a priority and, under her stewardship, it has grown from eight members to 54 today.", "url": "https://www.cnn.com/2022/03/18/uk/royal-news-newsletter-03-18-22-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318092705-02-royal-newsletter-0318-super-tease.jpg", "publishedAt": "2022-03-18T16:21:11Z", "content": "| Prince Harry, The Duke of Sussex, is getting ready for the Netherlands with some Dutch lessons. We look forward to giving him a warm welcome in #TheHague. As we all prepare for The Games, our thoug… [+172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "What we know about Texas crash involving a 13-year-old driver that killed nine", "description": "The University of the Southwest golf teams were returning to campus after a tournament when a pickup truck suddenly veered in front of their van in rural Texas. The subsequent fiery crash Tuesday night killed nine people. This is what we know.", "url": "https://www.cnn.com/2022/03/18/us/usw-golf-team-van-crash-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317014055-texas-golf-team-bus-crash-victims-super-tease.jpg", "publishedAt": "2022-03-18T16:20:16Z", "content": "(CNN)The University of the Southwest golf teams -- a mix of students from the US, Canada, Mexico and Portugal -- were returning to campus after a tournament when a pickup truck suddenly veered in fro… [+7181 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Mold and clogged toilets at ICE center spark watchdog call for 'immediate' removal of detainees", "description": "In a rare move, the Department of Homeland Security inspector general called for the \"immediate relocation\" of all detainees from an Immigration and Customs Enforcement facility in New Mexico, citing unsanitary conditions that included clogged toilets, mold a…", "url": "https://www.cnn.com/2022/03/18/politics/dhs-ice-immigration-facility-conditions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318105508-torrance-county-detention-facility-new-mexico-11112000-file-super-tease.jpg", "publishedAt": "2022-03-18T15:36:59Z", "content": "(CNN)In a rare move, the Department of Homeland Security inspector general called for the \"immediate relocation\" of all detainees from an Immigration and Customs Enforcement facility in New Mexico, c… [+5704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "US House passes CROWN Act that would ban race-based hair discrimination", "description": "The US House on Friday passed legislation that would ban race-based hair discrimination in employment and against those participating in federally assisted programs, housing programs, and public accommodations.", "url": "https://www.cnn.com/2022/03/18/politics/house-vote-crown-act/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318101708-us-capitol-0314-restricted-super-tease.jpg", "publishedAt": "2022-03-18T15:28:03Z", "content": "Washington (CNN)The US House on Friday passed legislation that would ban race-based hair discrimination in employment and against those participating in federally assisted programs, housing programs,… [+3096 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, CNN", "title": "Trump considers rescinding his endorsement of Mo Brooks in Alabama's competitive Senate primary", "description": "Former President Donald Trump is on the brink of withdrawing his endorsement from Alabama Senate hopeful Mo Brooks following a series of public and private missteps by the Republican congressman, including back-to-back statements this week in which Brooks dec…", "url": "https://www.cnn.com/2022/03/18/politics/trump-mo-brooks-alabama-senate-endorsement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211124104730-01-trump-mo-brooks-0921-super-tease.jpg", "publishedAt": "2022-03-18T15:16:36Z", "content": "(CNN)Former President Donald Trump is on the brink of withdrawing his endorsement from Alabama Senate hopeful Mo Brooks following a series of public and private missteps by the Republican congressman… [+8521 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "'Sesame Street's' Maria, Sonia Manzano, remembers Emilio Delgado", "description": "Sonia Manzano, who played Maria on \"Sesame Street,\" co-starred alongside Delgado, who played Luis, for decades. In a piece for Time, she remembered her co-star as \"eternally positive\" and an exceptional role model for Latino children.", "url": "https://www.cnn.com/2022/03/18/entertainment/sesame-street-emilio-delgado-luis-sonia-manzano-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318094831-emilio-delgado-sonia-manzano-the-count-sesame-street-file-restricted-super-tease.jpg", "publishedAt": "2022-03-18T14:59:03Z", "content": "(CNN)Emilio Delgado, best known to generations of \"Sesame Street\" viewers as the patient and kind Luis, died last week at 81. \r\nWho better to memorialize him than the actress who worked alongside him… [+1876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jomana Karadsheh, Eyad Kourdi and Kareem Khadder, CNN", "title": "Syrians are watching in horror as Putin deploys the Aleppo playbook in Ukraine", "description": "Six years before its Ukraine war, Russia began another ruthless military operation thousands of kilometers away in Syria -- to prop up the Bashar al-Assad regime. Victims of that war say the scenes from Ukraine on their television screens look hauntingly fami…", "url": "https://www.cnn.com/2022/03/18/middleeast/mideast-summary-03-18-2022-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170810174116-aleppo-ruins-super-tease.jpg", "publishedAt": "2022-03-18T14:49:29Z", "content": "Istanbul (CNN)Abdel Kafi al-Hamdo cannot get Ukraine out of his mind. The 36-year-old Syrian spends his days following the news, tweeting messages of solidarity and teaching his five-year-old daughte… [+13249 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "UK police officer jailed for murder of Sarah Everard charged with more sex crimes", "description": "A former London police officer, who was jailed for life last year for a rape and murder that horrified the nation, was charged on Friday with four new counts of indecent assault that took place just weeks earlier.", "url": "https://www.cnn.com/2022/03/18/uk/sarah-everard-wayne-couzens-rape-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318094939-wayne-couzens-mugshot-super-tease.jpg", "publishedAt": "2022-03-18T14:41:22Z", "content": "A former London police officer, who was jailed for life last year for a rape and murder that horrified the nation, was charged on Friday with four new counts of indecent assault that took place just … [+726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathryn Vasel", "title": "Covid transformed these workers' careers", "description": "The pandemic thrust the working world into a new reality in March 2020 as offices closed and millions of people were forced to learn how to do their jobs from home.", "url": "https://www.cnn.com/2022/03/18/success/pandemic-work-from-home-career-changes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316194116-restricted-ryan-bernsten-rashmi-bhankhede-carlos-ortiz-split-super-tease.jpg", "publishedAt": "2022-03-18T14:37:21Z", "content": "If they aren't going to validate that I enjoy working from home, that I am better at home, and I enjoy my lifestyle at home, I need to find a job that will,\"\r\nRyan Bernsten"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Emma Tucker and Peter Nickeas, CNN", "title": "Chicago Police Department is latest to lower hiring standards amid staffing shortages", "description": "The Chicago Police Department is lowering hiring standards for new recruits by dropping the college credit requirement for some candidates, as the agency like others in the country continues to face Covid-related staffing shortages and national and local reck…", "url": "https://www.cnn.com/2022/03/18/us/chicago-police-recruiting-standards/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317143638-01-chicago-police-emblem-file-super-tease.jpg", "publishedAt": "2022-03-18T14:01:03Z", "content": "(CNN)The Chicago Police Department is lowering hiring standards for new recruits by dropping the college credit requirement for some candidates, as the agency like others in the country continues to … [+5814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, Kylie Atwood and Brian Fung, CNN", "title": "How hackers, Arnold Schwarzenegger and the State Department are trying to pierce Putin's digital Iron Curtain", "description": "The information campaign over Russia's invasion of Ukraine is in full swing as a wide cast of characters -- from the US State Department to Ukrainian hackers to Arnold Schwarzenegger -- tries to circumvent Russian censors to get the truth about the war on Ukr…", "url": "https://www.cnn.com/2022/03/18/politics/information-campaign-ukraine-russia-schwarzenegger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317222324-01-arnold-schwarzenegger-message-russian-people-super-tease.jpg", "publishedAt": "2022-03-18T13:48:45Z", "content": "Washington (CNN)The information campaign over Russia's invasion of Ukraine is in full swing as a wide cast of characters -- from the US State Department to Ukrainian hackers to Arnold Schwarzenegger-… [+7496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Ben Affleck and Ana de Armas bring unhappily married heat to 'Deep Water'", "description": "Seeing exes Ben Affleck and Ana de Armas on screen together will be an undeniable attraction (if not of the \"Fatal\" variety) for \"Deep Water,\" but that shouldn't obscure the simple pleasures of this erotic thriller directed by Adrian Lyne, a crafty veteran of…", "url": "https://www.cnn.com/2022/03/18/entertainment/deep-water-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220314164714-de-armas-affleck-deep-water-handout-super-tease.jpg", "publishedAt": "2022-03-18T13:35:29Z", "content": "(CNN)Seeing exes Ben Affleck and Ana de Armas on screen together will be an undeniable attraction (if not of the \"Fatal\" variety) for \"Deep Water,\" but that shouldn't obscure the simple pleasures of … [+2909 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'WeCrashed' invests in Jared Leto and Anne Hathaway, but the series doesn't pay off", "description": "If there were awards for most-annoying characters, \"WeCrashed\" would have a mantle full of them. As is, this meaty showcase for Jared Leto and Anne Hathaway is wrapped in a somewhat malnourished limited series.", "url": "https://www.cnn.com/2022/03/18/entertainment/wecrashed-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318062812-wecrashed-super-tease.jpg", "publishedAt": "2022-03-18T13:33:18Z", "content": "(CNN)If there were awards for most-annoying characters, \"WeCrashed\" would have a mantle full of them. As is, this meaty showcase for Jared Leto and Anne Hathaway is wrapped in a somewhat malnourished… [+2881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet, CNN", "title": "You asked, we answered: How to help Ukrainian refugees", "description": "Google searches asking how to help Ukrainian refugees have been spiking in the United States. Here's what we know so far about the answers.", "url": "https://www.cnn.com/2022/03/18/world/how-to-help-ukrainian-refugees-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317134230-01-ukrainian-refugees-in-krakow-0315-super-tease.jpg", "publishedAt": "2022-03-18T13:00:40Z", "content": "(CNN)Thousands of miles away from the violence that's engulfing Ukraine and forcing millions to leave their homes, many Americans are looking for answers.\r\nGoogle says searches about how to help Ukra… [+5074 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Karin Kimbrough for CNN Business Perspectives", "title": "US jobs are recovering, but women are still being left behind", "description": "New research from LinkedIn suggests that there are strategies employers can consider adopting in the short term to make their workplaces better environments for women who are still out of a job and eager to get back in.", "url": "https://www.cnn.com/2022/03/18/perspectives/women-jobs-recovery-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317164037-women-pandemic-jobs-losses-recovery-super-tease.jpg", "publishedAt": "2022-03-18T13:00:01Z", "content": "Karin Kimbrough is the chief economist at LinkedIn. The opinions expressed in this commentary are her own. \r\nAs the latest jobs numbers continue to show a resurging labor market, women have seen an u… [+4874 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Omicron survives longer on some surfaces, studies find. That may help explain why it's more contagious, but it's no reason to panic", "description": "Under experimental conditions, the Omicron variant of the coronavirus survives at least twice as long on surfaces like plastic, paper and skin than the original strain that emerged from Wuhan, China, which may help explain how this variant has become so conta…", "url": "https://www.cnn.com/2022/03/18/health/omicron-surfaces-studies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727221553-conclu-cleaning-super-tease.jpg", "publishedAt": "2022-03-18T12:42:18Z", "content": "(CNN)Under experimental conditions, the Omicron variant of the coronavirus survives at least twice as long on surfaces like plastic, paper and skin than the original strain that emerged from Wuhan, C… [+3887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "The airplane cabin designs shortlisted for the 2022 Crystal Cabin Awards", "description": "From an airplane concept with an \"underwater\" twist to an AI-based food scanner that moderates passengers' eating habits, the shortlist for the 2022 Crystal Cabin Awards highlights eye-catching ideas that could be the future of aviation.", "url": "https://www.cnn.com/travel/article/crystal-cabin-awards-shortlist-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317123206-07-crystal-cabin-awards-2022-restricted-super-tease.jpg", "publishedAt": "2022-03-18T12:36:17Z", "content": "(CNN) From an airplane concept with an \"underwater\" twist to an AI-based food scanner that moderates passengers' eating habits, the shortlist for the 2022 Crystal Cabin Awards highlights eye-catching… [+5410 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine Thorbecke, CNN Business", "title": "'We come for our own': How Black volunteers rallied online to help African students in Ukraine", "description": "After some of the hundreds of Black students stranded in the besieged city of Sumy, Ukraine, released desperate pleas for help on social media earlier this month, a grassroots group of volunteers sprang into action to help them safely evacuate the war zone.", "url": "https://www.cnn.com/2022/03/18/tech/african-students-ukraine-social-media/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316174112-restricted-01-black-refugees-ukraine-super-tease.jpg", "publishedAt": "2022-03-18T12:03:11Z", "content": "(CNN Business)After some of the hundreds of Black students stranded in the besieged city of Sumy, Ukraine, released desperate pleas for help on social media earlier this month, a grassroots group of … [+8012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "Burger King franchise 'refuses' to close 800 Russian restaurants", "description": "Burger King is trying to suspend its operations in Russia, but that's proving difficult. A business partner controlling 800 restaurants has \"refused\" to close them, the company said.", "url": "https://www.cnn.com/2022/03/18/business-food/burger-king-russia-joint-venture/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318070157-russia-burger-king-031222-restricted-super-tease.jpg", "publishedAt": "2022-03-18T11:32:30Z", "content": "New York (CNN Business)Burger King is trying to suspend its operations in Russia, but that's proving difficult. A business partner controlling 800 restaurants has \"refused\" to close them, the company… [+2086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy, CNN", "title": "Here's what Americans think the US should be doing about Russia's invasion of Ukraine", "description": "Americans' support for economic sanctions on Russia is broad and bipartisan, according to new polling on the public's response to the war in Ukraine. And so far, that's the case even when the potential for higher gas prices is considered. At the same time, th…", "url": "https://www.cnn.com/2022/03/18/politics/polling-ukraine-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316131803-08-biden-0315-super-tease.jpg", "publishedAt": "2022-03-18T11:05:23Z", "content": "(CNN)Americans' support for economic sanctions on Russia is broad and bipartisan, according to new polling on the public's response to the war in Ukraine. And so far, that's the case even when the po… [+6083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Sleep myths that may be keeping you from a good night's rest", "description": "Many have opinions about sleep not backed by good science. On World Sleep Day, check to see if your sleep beliefs are keeping you from getting quality zzz's.", "url": "https://www.cnn.com/2022/03/18/health/sleep-myths-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309164809-sleeping-bed-stock-super-tease.jpg", "publishedAt": "2022-03-18T11:05:21Z", "content": "Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\n (CNN)What are your sleep myths and facts? You know, the things you are absolutel… [+4911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joan Biskupic, CNN", "title": "How Judge Ketanji Brown Jackson handled Trump and executive privilege cases", "description": "Judge Ketanji Brown Jackson has already ruled in epic battles between Congress and former President Donald Trump, rebuffing efforts to shield White House testimony and records.", "url": "https://www.cnn.com/2022/03/18/politics/ketanji-brown-jackson-executive-privilege/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317141843-kbj-trump-split-super-tease.jpg", "publishedAt": "2022-03-18T11:03:51Z", "content": "(CNN)Judge Ketanji Brown Jackson has already ruled in epic battles between Congress and former President Donald Trump, rebuffing efforts to shield White House testimony and records. \r\nPresident Joe B… [+9963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Sinclair Scott, CNN", "title": "A Ukrainian bridal brand is making wedding gowns and army assault vests", "description": "Ukrainian fashion brand Milla Nova, known for its decadent wedding gowns, is now also producing protective clothing for the country's soldiers and medical workers, as Russia continues to launch its brutal attack on the country.", "url": "https://www.cnn.com/style/article/milla-nova-bridal-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318034655-01-milla-nova-bridal-ukraine-super-tease.jpeg", "publishedAt": "2022-03-18T10:39:45Z", "content": "Ukrainian fashion brand Milla Nova, known for its decadent wedding gowns, is now producing attire for the country's soldiers and medical workers, as Russia continues to launch its brutal attack on th… [+2881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by J.B. Pritzker and Phil Murphy", "title": "We can't address anti-AAPI hate without improving K-12 education", "description": "Two years ago, the World Health Organization declared Covid-19 a pandemic, marking the beginning of a public health crisis as well as a wave of hate toward Asian Americans and Pacific Islanders (AAPIs). Falsely blamed for the global spread of the virus, the A…", "url": "https://www.cnn.com/2022/03/18/opinions/asian-american-history-education-aapi-hate-crimes-murphy-pritzker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220105113224-asian-american-attacks-aftermath-intl-hnk-dst-file-restricted-032121-super-tease.jpg", "publishedAt": "2022-03-18T10:39:44Z", "content": "Governor Phil Murphy is the Governor of New Jersey. Governor J.B. Pritzker is the Governor of Illinois. The views expressed in this commentary are their own. Read more opinion articles on CNN.\r\n (CNN… [+4549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for March 18: Ukraine, Texas crash, Immigration, Covid-19, Cuba", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/03/18/us/five-things-march-18-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318041856-lviv-ukraine-explosion-smoke-031822-super-tease.jpg", "publishedAt": "2022-03-18T10:31:53Z", "content": "(CNN)Hey, you. Yes, you. Keep your head up! The world is very much on edge, so try to seek happiness in these trying times. Traveling is a great mood booster, and if you're looking for a happy place … [+6920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liz Szabo, Kaiser Health News", "title": "'This is just the start': Research into Covid-19 opens doors to understanding other diseases and conditions", "description": "The billions of dollars invested in covid vaccines and covid-19 research so far are expected to yield medical and scientific dividends for decades, helping doctors battle influenza, cancer, cystic fibrosis, and far more diseases.", "url": "https://www.cnn.com/2022/03/18/health/research-benefits-from-covid-19-khn-partner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317130536-mrna-lab-germany-file-restricted-super-tease.jpg", "publishedAt": "2022-03-18T10:22:41Z", "content": "(KHN)The billions of dollars invested in covid vaccines and covid-19 research so far are expected to yield medical and scientific dividends for decades, helping doctors battle influenza, cancer, cyst… [+11137 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "'It was a complete accident': Nick Nyrgios apologizes after smashed racket almost hits ball boy", "description": "The best and worst of Nick Kyrgios was on display in Indian Wells on Thursday, as the supremely talented yet frustrating Australian lost in three sets to Rafael Nadal in a thrilling quarterfinal clash.", "url": "https://www.cnn.com/2022/03/18/tennis/rafael-nadal-beats-nick-kyrgios-indian-wells-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318090713-kyrgios-nadal-super-tease.jpg", "publishedAt": "2022-03-18T09:58:01Z", "content": "(CNN)The best and worst of Nick Kyrgios was on display in Indian Wells on Thursday, as the supremely talented yet frustrating Australian lost in three sets to Rafael Nadal in a thrilling quarterfinal… [+2818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "81 executions in Saudi Arabia on one day and horror of Russia's invasion of Ukraine buffet the Premier League", "description": "Two Premier League managers sat before the media to discuss a football match earlier this month. One faced questions on the sanctioning of a Russian oligarch, while the other was asked about the execution of 81 men in one day in Saudi Arabia.", "url": "https://www.cnn.com/2022/03/18/football/premier-league-newcastle-united-chelsea-owners-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316140835-20220316-premier-league-chelsea-newcastle-united-ownership-spt-intl-super-tease.jpg", "publishedAt": "2022-03-18T08:38:20Z", "content": "(CNN)Two Premier League managers sat before the media to discuss a football match earlier this month. One faced questions on the sanctioning of a Russian oligarch, while the other was asked about the… [+11540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Could Russia's war kick-start a renewable-energy revolution? It depends where in the world you look", "description": "The upheaval brought by Russia's war is sending countires back to fossil fuels. But experts say there is reason to believe it will also speed the clean energy transition in the long run.", "url": "https://www.cnn.com/2022/03/18/world/russia-renewable-energy-revolution-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317163151-03-renewable-energy-revolution-2022-super-tease.jpg", "publishedAt": "2022-03-18T08:30:51Z", "content": "(CNN)As Russia's brutal war in Ukraine disrupts energy supply and forces world leaders to examine their dependence on Russian oil and natural gas, leaders in the United States and Europe are scrambli… [+7367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Powerful storms could bring damaging winds, hail and possibly tornadoes for the Southeast", "description": "Severe storms are expected to sweep across parts of the Southeast, bringing forecasts of damaging winds, hail and possible tornadoes.", "url": "https://www.cnn.com/2022/03/18/weather/severe-storms-southeast-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317222250-southeast-storm-forcast-map-super-tease.jpg", "publishedAt": "2022-03-18T07:21:34Z", "content": "(CNN)Severe storms are expected to sweep across parts of the Southeast, bringing forecasts of damaging winds, hail and possible tornadoes.\r\nNearly 45 million people are at risk of severe weather Frid… [+2334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Most workers feel employers don't care about their well-being", "description": "During parts of the pandemic, American workers said they felt genuinely cared for by their bosses, according to a new survey. But those warm fuzzies soon went away.", "url": "https://www.cnn.com/2022/03/18/health/employers-dont-care-gallup-survey-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317135701-new-york-people-file-021622-super-tease.jpg", "publishedAt": "2022-03-18T06:03:00Z", "content": "(CNN)For several months at the beginning of the pandemic, American workers felt genuinely cared for by their bosses, according to a new survey released Friday by Gallup, an international polling orga… [+5893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Top auction houses cancel Russian art sales in London", "description": "Auction houses Christie's, Sotheby's and Bonhams have canceled sales of Russian art in London in June, part of the art market's response to Western sanctions on Russia as punishment for its invasion of Ukraine.", "url": "https://www.cnn.com/style/article/london-auction-houses-russia-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220318005410-01-london-auction-sales-russia-arts-resrtricted-super-tease.jpg", "publishedAt": "2022-03-18T05:55:53Z", "content": "artsPublished 18th March 2022\r\nAuction houses Christie's, Sotheby's and Bonhams have canceled sales of Russian art in London in June, part of the art market's response to Western sanctions on Russia … [+5207 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales, CNN", "title": "New details emerge in shootings of homeless men in NYC and DC", "description": "His victim begged for mercy, police say. But all Gerald Brevard allegedly did, according to court documents, was pull the trigger, then sit on a nearby curb. A surveillance camera picked up music playing.", "url": "https://www.cnn.com/2022/03/18/us/homeless-shooter-washington-dc-and-new-york-details/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313013513-02-new-york-homeless-shootings-0312-super-tease.jpeg", "publishedAt": "2022-03-18T05:17:32Z", "content": "(CNN)His victim begged for mercy, police say. But all Gerald Brevard allegedly did, according to court documents, was pull the trigger, then sit on a nearby curb. A surveillance camera picked up musi… [+5277 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Evacuation orders in place as blazes burn through parts of central Texas", "description": "Evacuation orders were in place across parts of several central Texas counties late Thursday as crews worked to contain the flames in dangerous fire weather -- fueled by strong winds and dry conditions.", "url": "https://www.cnn.com/2022/03/18/us/eastland-complex-fire-texas-evacuation-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317214710-tease-only-easland-complex-fire-super-tease.jpg", "publishedAt": "2022-03-18T04:57:41Z", "content": "(CNN)Evacuation orders were in place across parts of several central Texas counties late Thursday as crews worked to contain the flames in dangerous fire weather -- fueled by strong winds and dry con… [+2477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Canova's lost 'Maddalena Giacente' seen fetching up to $10M at auction", "description": "A rediscovered Antonio Canova marble sculpture of Mary Magdalene is seen fetching up to $10 million when it heads to auction in July.", "url": "https://www.cnn.com/style/article/canova-maddalena-giacente-auction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317023520-01-antonio-canova-recumbent-magdalene-restricted-super-tease.jpg", "publishedAt": "2022-03-18T04:42:53Z", "content": "artsPublished 18th March 2022\r\nA rediscovered Antonio Canova marble sculpture of Mary Magdalene is seen fetching up to $10 million when it heads to auction in July.\r\nDescribed by auction house Christ… [+1837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "The world's happiest countries for 2022", "description": "Finland and its northern neighbors top the list of the world's happiest countries. There is also a bit of good news for humanity: Benevolence is surging globally.", "url": "https://www.cnn.com/travel/article/worlds-happiest-countries-2022-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316185816-0318-happiest-countries-2022-finland-01-super-tease.jpg", "publishedAt": "2022-03-18T04:02:52Z", "content": "(CNN) Devastating loss of life and growing uncertainty have the world very much on edge, but there is a bit of good news for humanity: Benevolence is surging globally. \r\nThat's one of the key finding… [+5451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "5 reasons the Biden-Xi call is so important", "description": "When President Joe Biden speaks Friday with China's Xi Jinping, it won't be just another phone call in an ongoing flurry of telephone diplomacy.", "url": "https://www.cnn.com/2022/03/18/politics/biden-xi-call-russia-ukraine-importance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211115200756-02-biden-xi-virtual-summit-1115-super-tease.jpg", "publishedAt": "2022-03-18T04:02:04Z", "content": "WASHINGTON (CNN)When President Joe Biden speaks Friday with China's Xi Jinping, it won't be just another phone call in an ongoing flurry of telephone diplomacy. \r\nThis call comes at a potential turni… [+7912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Seán Federico-O'Murchú and Adam Renton, CNN", "title": "Russia invades Ukraine", "description": "Ukraine said it launched a counteroffensive aimed at gaining control of Kyiv's suburbs after NATO officials said Russia's offensive to capture the capital has largely stalled. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-03-18-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317154936-03-ukraine-russian-tank-destroyed-super-tease.jpg", "publishedAt": "2022-03-18T04:00:36Z", "content": "Thousands of Russian troops have been killed in Ukraine since Russia's invasion began nearly one month ago, US and NATO officials told CNN this week, and Russia is now struggling to resupply those fo… [+1943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "American killed in Ukraine described increasing hardships for civilians in city near Russia", "description": "Months before Russian troops attacked Ukraine, American Jimmy Hill went there to be with his Ukranian partner, Ira, who has multiple sclerosis. When war broke out, Hill stayed, despite the deteriorating conditions in the northern Ukrainian city of Chernihiv.", "url": "https://www.cnn.com/2022/03/17/europe/james-hill-american-killed-ukraine-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317182936-01-james-whitney-hill-super-tease.jpg", "publishedAt": "2022-03-18T03:12:29Z", "content": "(CNN)Months before Russian troops attacked Ukraine, American Jimmy Hill went there to be with his Ukranian partner, Ira, who has multiple sclerosis. When war broke out, Hill stayed, despite the deter… [+2867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Arnold Schwarzenegger urges Russians to overcome government disinformation", "description": "Former California Gov. Arnold Schwarzenegger made an impassioned appeal to the Russian people in a video posted on social media, asking them to resist their country's disinformation as the devastating invasion of Ukraine continues.", "url": "https://www.cnn.com/2022/03/17/world/arnold-schwarzenegger-message-russian-people/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317222324-01-arnold-schwarzenegger-message-russian-people-super-tease.jpg", "publishedAt": "2022-03-18T03:03:30Z", "content": "(CNN)Former California Gov. Arnold Schwarzenegger made an impassioned appeal to the Russian people in a video posted on social media, asking them to resist their country's disinformation as the devas… [+786 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Chris Redd says he's ready to tell some Kanye West jokes, with one exception", "description": "At least one \"Saturday Night Live\" star thinks it's time to unleash his Kanye jokes.", "url": "https://www.cnn.com/2022/03/17/entertainment/kanye-west-snl-chris-redd-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317191116-chris-redd-kanye-split-super-tease.jpg", "publishedAt": "2022-03-18T02:54:24Z", "content": "(CNN)\"Saturday Night Live\" may be treading lightly around the volatile situation involving cast member Pete Davidson and musician Kanye West, but Davidson's \"SNL\" castmate Chris Redd has some jokes r… [+2545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "Record-breaking suspension bridge set to open in Yunnan, China", "description": "Traveling in China's scenic Yunnan province is about to get a bit easier -- and more thrilling -- as the world's first single-tower, single-span suspension bridge is set to open next month.", "url": "https://www.cnn.com/travel/article/lvzhijiang-yunnan-china-suspension-bridge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316223618-01-lvzhijiang-bridge-super-tease.jpg", "publishedAt": "2022-03-18T02:43:20Z", "content": "(CNN) Traveling in China's scenic Yunnan province is about to get a bit easier -- and more thrilling -- with the world's first single-tower, single-span suspension bridge set to open next month.\r\nStr… [+2672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez and Rebekah Riess, CNN", "title": "Maryland park police officers said they wanted Black Lives Matter protesters dead, according to lawsuit", "description": "A group of police officers in Montgomery County, Maryland, are being accused of repeatedly making hateful comments against people of color in a group text message chain -- including that they hoped Black Lives Matter protesters would die.", "url": "https://www.cnn.com/2022/03/17/us/maryland-park-police-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317170801-02-maryland-national-capital-park-service-police-super-tease.jpg", "publishedAt": "2022-03-18T02:08:30Z", "content": "(CNN)A group of police officers in Montgomery County, Maryland, are being accused of repeatedly making hateful comments against people of color in a group text message chain -- including that they ho… [+5457 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "Rock & Roll Hall of Fame to keep Dolly Parton on nominee list despite her opting out", "description": "The Rock & Roll Hall of Fame announced on Thursday they will keep singer Dolly Parton on their 2022 nomination list, despite Parton's request to withdraw her name.", "url": "https://www.cnn.com/2022/03/17/entertainment/dolly-parton/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317204853-02-dolly-parton-super-tease.jpg", "publishedAt": "2022-03-18T00:58:37Z", "content": "(CNN)The Rock &amp; Roll Hall of Fame announced on Thursday they will keep singer Dolly Parton on their 2022 nomination list, despite Parton's request to withdraw her name.\r\n\"All of us in the music c… [+1845 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Democratic activists falsely claim Marjorie Taylor Greene refused to applaud Zelensky", "description": "After Ukrainian President Volodymyr Zelensky delivered a virtual address to Congress on Wednesday, a claim went viral among some Democrats on Twitter: Georgia's Rep. Marjorie Taylor Greene, a right-wing Republican, had refused to applaud Zelensky.", "url": "https://www.cnn.com/2022/03/17/politics/marjorie-taylor-greene-applause-zelensky-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317200323-marjorie-taylor-greene-clap-zelensky-split-super-tease.jpg", "publishedAt": "2022-03-18T00:53:23Z", "content": "(CNN)After Ukrainian President Volodymyr Zelensky delivered a virtual address to Congress on Wednesday, a claim went viralamong some Democrats on Twitter: Georgia's Rep. Marjorie Taylor Greene, a rig… [+4145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabriel Kinder, CNN", "title": "A growing number of Ukrainians can't access clean water. A CNN Hero is sending thousands of water filters", "description": "As Russian attacks make drinking water in Ukraine harder to find, CNN Hero Doc Hendley and Wine to Water are sending enough filters to purify 2.4 million gallons per day.", "url": "https://www.cnn.com/2022/03/17/world/ukraine-water-filters-refugees-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317194641-doc-hendley-ukraine-cnnheroes-super-tease.jpg", "publishedAt": "2022-03-18T00:38:04Z", "content": "(CNN)Survivors of Russia's siege on the Ukrainian city of Mariupol are reporting that some residents are being forced to collect rain and melt snow for drinking water. For Doc Hendley, the water cris… [+1719 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz and Holmes Lybrand, CNN", "title": "January 6 defendant pleads guilty after Justice Department admitted to violating his rights", "description": "A Texas man pleaded guilty Thursday to assaulting a police officer with a pole during the US Capitol riot, three days after the Justice Department admitted that his speedy trial rights were violated.", "url": "https://www.cnn.com/2022/03/17/politics/justice-department-defendant-pleads-guilty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/121231065730-capitol-hill-super-tease.jpg", "publishedAt": "2022-03-17T22:17:26Z", "content": "(CNN)A Texas man pleaded guilty Thursday to assaulting a police officer with a pole during the US Capitol riot, three days after the Justice Department admitted that his speedy trial rights were viol… [+2588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Katie Bo Lillis  and Jeremy Herb, CNN", "title": "Mounting Russian casualties in Ukraine lead to more questions about its military readiness", "description": "Thousands of Russian troops have been killed in Ukraine since Russia's invasion began nearly one month ago, US and NATO officials told CNN this week, and Russia is now struggling to resupply those forces as it faces sagging troop morale and fierce Ukrainian r…", "url": "https://www.cnn.com/2022/03/17/europe/russian-casualties-ukraine-military-readiness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317154934-02-ukraine-russian-tank-destroyed-super-tease.jpg", "publishedAt": "2022-03-17T21:21:44Z", "content": "(CNN)Thousands of Russian troops have been killed in Ukraine since Russia's invasion began nearly one month ago, US and NATO officials told CNN this week, and Russia is now struggling to resupply tho… [+6041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Curt Devine, Casey Tolan and Majlie de Puy Kamp, CNN", "title": "'There is literally no paper trail': How Russia experts say Putin hides a fortune", "description": "The sprawling billion-dollar palace that sits on a hilltop overlooking the Black Sea is seen by some Kremlin critics as the ultimate emblem of Russian President Vladimir Putin's legacy of corruption.", "url": "https://www.cnn.com/2022/03/17/business/putin-wealth-sanctions-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316133926-01-putin-wealth-corruption-super-tease.jpg", "publishedAt": "2022-03-17T20:42:08Z", "content": "(CNN)The sprawling billion-dollar palace that sits on a hilltop overlooking the Black Sea is seen by some Kremlin critics as the ultimate emblem of Russian President Vladimir Putin's legacy of corrup… [+9480 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sergey Makarov", "title": "Photographer recounts terrifying escape from Mariupol", "description": "Editor's note: Sergey Makarov, 34, a photographer from the city of Mariupol in southeastern Ukraine, told CNN about his experience surviving the Russian siege and his eventual evacuation.", "url": "https://www.cnn.com/2022/03/17/europe/mariupol-photo-diary-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317150904-01-mariupol-photographer-super-tease.jpg", "publishedAt": "2022-03-17T20:34:20Z", "content": "Mariupol, Ukraine (CNN)Editor's note: Sergey Makarov, 34, a photographer from the city of Mariupol in southeastern Ukraine, told CNN about his experience surviving the Russian siege and his eventual … [+4502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "UFC fighter Kevin Holland disarms gunman with chokehold at a Houston sushi restaurant", "description": "UFC fighter Kevin Holland says he used a chokehold to subdue a suspected gunman who fired a shot into the ceiling of a Houston, Texas, sushi restaurant.", "url": "https://www.cnn.com/2022/03/17/us/ufc-fighter-restaurant-shooting-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317140702-gunman-restaurant-ufc-fighter-super-tease.jpg", "publishedAt": "2022-03-17T20:12:46Z", "content": "(CNN)UFC fighter Kevin Holland says he used a chokehold to subdue a suspected gunman who fired a shot into the ceiling of a Houston, Texas, sushi restaurant.\r\nHolland told CNN affiliate KPRC that he … [+1650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Kristin Wilson, CNN", "title": "House passes bill to suspend normal trade relations with Russia", "description": "The House of Representatives passed a bill Thursday to suspend normal trade relations with Russia, the latest effort by US lawmakers to inflict economic pain on the Kremlin for its unprovoked and brutal invasion of Ukraine.", "url": "https://www.cnn.com/2022/03/17/politics/house-russia-trade-relations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317150408-us-capitol-0317-super-tease.jpg", "publishedAt": "2022-03-17T19:33:03Z", "content": "(CNN)The House of Representatives passed a bill Thursday to suspend normal trade relations with Russia, the latest effort by US lawmakers to inflict economic pain on the Kremlin for its unprovoked an… [+2307 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Zelensky or Zelenskyy? What's in a name?", "description": "As you've been reading about the Russia-Ukraine crisis, you may have noticed a slight -- but significant -- discrepancy in how different media outlets spell Ukrainian President Volodymyr Zelensky's name.", "url": "https://www.cnn.com/2022/03/17/politics/how-to-spell-volodymyr-zelenskyy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220228065937-ukraine-zelensky-super-tease.jpg", "publishedAt": "2022-03-17T19:27:48Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden administration details Covid funding accounting", "description": "The Biden administration sent detailed explanations to key lawmakers Wednesday evening providing an accounting of remaining funding from the Covid-19 relief package that has already been allocated.", "url": "https://www.cnn.com/2022/03/17/politics/covid-funding-detailed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206171000-joe-biden-file-super-tease.jpg", "publishedAt": "2022-03-17T19:15:05Z", "content": "(CNN)The Biden administration sent detailed explanations to key lawmakers Wednesday evening providing an accounting of remaining funding from the Covid-19 relief package that has already been allocat… [+3271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Swimmer Lia Thomas favored to become first transgender athlete to win an NCAA D-I title", "description": "University of Pennsylvania swimmer Lia Thomas is favored to make history as the first transgender athlete to win an NCAA Division I title when she takes to the pool Thursday night at the Women's Swimming and Diving Championships in Atlanta.", "url": "https://www.cnn.com/2022/03/17/sport/lia-thomas-ncaa-swimming/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317135107-01-lia-thomas-0316-super-tease.jpg", "publishedAt": "2022-03-17T19:11:34Z", "content": "(CNN)University of Pennsylvania swimmer Lia Thomas is favored to make history as the first transgender athlete to win an NCAA Division I title when she takes to the pool Thursday night at the Women's… [+3645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN \nOscar Holland, CNN", "title": "The art world responds to Russian invasion of Ukraine by canceling shows and cutting ties", "description": "Stage curtains are closing, art exhibitions are being halted and performers are being replaced. Over the past month, major cultural players worldwide -- including some within Russia -- have reacted to the invasion of Ukraine by canceling shows and applying pr…", "url": "https://www.cnn.com/style/article/art-world-response-ukraine-russia-updates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220302024048-01-russia-cultural-influence-super-tease.jpg", "publishedAt": "2022-03-17T19:10:50Z", "content": "artsPublished 17th March 2022\r\nStage curtains are closing, art exhibitions are being halted and performers are being replaced. Over the past month, major cultural players worldwide -- including some … [+15583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston and Eric Bradner, CNN", "title": "US governors look for ways to aid Ukraine, from field hospital kits to rebuilding funds", "description": "As Ukrainian President Volodymyr Zelensky calls on US officials \"to do more\" to help his country, governors around the US are mobilizing to bolster shipments of humanitarian aid and other supplies, including at least one state sending personal protective and …", "url": "https://www.cnn.com/2022/03/17/politics/governors-aide-to-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317134243-gavin-newsom-ukraine-supplies-0315-super-tease.jpg", "publishedAt": "2022-03-17T19:00:38Z", "content": "(CNN)As Ukrainian President Volodymyr Zelensky calls on US officials \"to do more\" to help his country, governors around the US are mobilizing to bolster shipments of humanitarian aid and other suppli… [+5572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Holi is a celebration of love, color and spring", "description": "With winter finally coming to an end, millions of people in India -- and other parts of the world home to Hindus -- are gearing up for one of the most joyous celebrations of the year.", "url": "https://www.cnn.com/2022/03/17/world/holi-2022-celebration-photos-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317121058-01-holi-031722-super-tease.jpg", "publishedAt": "2022-03-17T18:55:06Z", "content": "(CNN)With winter finally coming to an end, millions of people in India -- and other parts of the world home to Hindus -- are gearing up for one of the most joyous celebrations of the year.\r\nThat cele… [+2327 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Angela Dewan, CNN", "title": "Putin's chilling warning to Russian 'traitors' and 'scum' is a sign things aren't going to plan", "description": "An incendiary Stalinesque speech marked a change in Vladimir Putin's tone. Observers saw it as a sign that the Russian leader would take a vengeful turn at home and crack down more forcefully than ever on any sign of dissent.", "url": "https://www.cnn.com/2022/03/17/europe/putin-speech-russia-ukraine-conflict-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317093946-01-putin-speech-0316-super-tease.jpg", "publishedAt": "2022-03-17T18:51:50Z", "content": "(CNN)Western leaders and security agencies are spending huge amounts of resources on getting into Russian President Vladimir Putin's head. It's a futile exercise -- at times when the West has thought… [+6708 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam and Hannah Rabinowitz, CNN", "title": "Justice Department charges Wisconsin man who said it was 'satisfying' to attack police on January 6", "description": "The Justice Department unsealed charges on Thursday against a 23-year-old Wisconsin man who allegedly told associates it was \"satisfying\" to assault US Capitol Police officers on January 6, 2021, and threatened to return to Washington, DC, with paintball guns…", "url": "https://www.cnn.com/2022/03/17/politics/january-6-doj-wisconsin-man-attack/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317140042-riley-kasper-doj-super-tease.jpg", "publishedAt": "2022-03-17T18:37:30Z", "content": "(CNN)The Justice Department unsealed charges on Thursday against a 23-year-old Wisconsin man who allegedly told associates it was \"satisfying\" to assault US Capitol Police officers on January 6, 2021… [+1634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How natural gas contributes to Russia's global influence", "description": "It is not just with military might that Russia impacts the world, the country has vast oil and gas reserves. With much of Europe relying on Russian gas, Putin's pipeline diplomacy now has its sights on China.", "url": "https://www.cnn.com/videos/business/2022/03/17/natural-gas-russia-explainer-lon-orig.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317163607-natural-gas-explainer-thumbnail-super-tease.jpg", "publishedAt": "2022-03-17T18:21:57Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Instagram suspends Kanye because of post directed at Trevor Noah", "description": "Rapper Kanye West used a racial slur on Instagram to attack \"The Daily Show\" host Trevor Noah after Noah accused West of harassing Kim Kardashian.", "url": "https://www.cnn.com/videos/media/2022/03/17/kanye-instagram-suspended-racial-slur-trevor-noah-kim-kardashian-fitzpatrick-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317134915-kanye-trevor-super-tease.jpg", "publishedAt": "2022-03-17T17:51:18Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Olympic medallist who fled Belarus forced into exile again as Ukraine attacked", "description": "After bolting to Ukraine to escape political persecution in her native Belarus, Olympic swimmer Aliaksandra Herasimenia never thought she would again be forced to flee, this time to save her family from Russian attack.", "url": "https://www.cnn.com/2022/03/17/sport/olympic-medallist-aliaksandra-herasimenia-belarus-ukraine-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317171826-aliaksandra-herasimenia-super-tease.jpg", "publishedAt": "2022-03-17T17:35:20Z", "content": "(Reuters)After bolting to Ukraine to escape political persecution in her native Belarus, Olympic swimmer Aliaksandra Herasimenia never thought she would again be forced to flee, this time to save her… [+3050 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "European Space Agency suspends Mars mission with Russia", "description": "The mission to launch Europe's first planetary rover -- designed to search for signs of life on Mars -- has been suspended, the European Space Agency said Thursday.", "url": "https://www.cnn.com/2022/03/17/world/exomars-suspended-european-space-agency-russia-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190827162810-mars-rover-built-1-super-tease.jpg", "publishedAt": "2022-03-17T17:11:31Z", "content": "(CNN)The mission to launch Europe's first planetary rover -- designed to search for signs of life on Mars -- has been suspended, the European Space Agency said Thursday.\r\nThe ExoMars Rover, a collabo… [+2351 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Paula Newton, CNN", "title": "Canada to lift testing requirement for fully vaccinated travelers", "description": "Canada announced it will lift its Covid-19 pre-entry test requirement for fully vaccinated travelers beginning April 1, saying Thursday that the pandemic was entering a \"transition phase.\"", "url": "https://www.cnn.com/travel/article/canada-lifting-tests-vaccinated-travelers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210122161314-toronto-pearson-international-airport-super-tease.jpg", "publishedAt": "2022-03-17T17:06:57Z", "content": "Ottawa (CNN) Canada announced it will lift its Covid-19 pre-entry test requirement for fully vaccinated travelers beginning April 1, saying Thursday that the pandemic was entering a \"transition phase… [+1916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "DHS relaunches independent council after ousting Trump-era officials last year", "description": "The Department of Homeland Security has reinstituted its independent advisory council, nearly a year after Homeland Security Secretary Alejandro Mayorkas dissolved the existing council, ousting a board of independent advisers that included Trump-era officials.", "url": "https://www.cnn.com/2022/03/17/politics/homeland-security-independent-council-relaunched/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914105158-dhs-seal-super-tease.jpg", "publishedAt": "2022-03-17T17:02:04Z", "content": "(CNN)The Department of Homeland Security has reinstituted its independent advisory council, nearly a year after Homeland Security Secretary Alejandro Mayorkas dissolved the existing council, ousting … [+3676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Why Chicago dyes its river green for St. Patrick's Day", "description": "Read on to learn more about the tradition of dyeing the Chicago River and the dye so secret only a select few know the recipe.", "url": "https://www.cnn.com/2022/03/17/us/chicago-river-dyed-green-st-patricks-day-explained-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317114008-02-chicago-river-green-031222-super-tease.jpg", "publishedAt": "2022-03-17T15:56:37Z", "content": "(CNN)For the last 60 years, enterprising Chicagoans have dyed the city's river a vibrant green in honor of St. Patrick's Day. Thousands of residents turn up to watch the Chicago River light up for th… [+2288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "Drought in West and other parts of US will continue and expand in coming months, NOAA reports", "description": "The West's intense multi-year drought is expected to at least continue — if not worsen — in the coming months, the National Oceanic and Atmospheric Administration announced Thursday in its spring outlook.", "url": "https://www.cnn.com/2022/03/17/us/noaa-drought-spring-outlook-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317095732-lake-powell-drought-0201-restricted-super-tease.jpg", "publishedAt": "2022-03-17T15:41:53Z", "content": "(CNN)The West's intense multi-year drought is expected to at least continue if not worsen in the coming months, the National Oceanic and Atmospheric Administration announced Thursday in its spring ou… [+2723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'DMZ' casts Rosario Dawson in a family drama against the backdrop of civil war", "description": "A series built around a US civil war is bound to get attention, especially in these polarized times. But \"DMZ\" merely uses that backdrop as a device to introduce another dystopian drama based on a DC graphic novel, basically \"The Walking Dead\" meets the '70s …", "url": "https://www.cnn.com/2022/03/17/entertainment/dmz-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308095831-dmz-handout-super-tease.jpg", "publishedAt": "2022-03-17T15:23:26Z", "content": "(CNN)A series built around a US civil war is bound to get attention, especially in these polarized times. But \"DMZ\" merely uses that backdrop as a device to introduce another dystopian drama based on… [+2516 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Life & Beth' turns Amy Schumer loose on a personal but flawed dramedy", "description": "Amy Schumer titled her sketch comedy series \"Inside Amy Schumer,\" which would actually be a better moniker for \"Life & Beth,\" a Hulu dramedy that Schumer created and stars in, in addition to writing and directing most of the episodes. Personal but ponderous, …", "url": "https://www.cnn.com/2022/03/17/entertainment/life-and-beth-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223045446-09-march-2022-streaming-life-beth-super-tease.jpg", "publishedAt": "2022-03-17T15:21:38Z", "content": "(CNN)Amy Schumer titled her sketch comedy series \"Inside Amy Schumer,\" which would actually be a better moniker for \"Life &amp; Beth,\" a Hulu dramedy that Schumer created and stars in, in addition to… [+2860 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Monica Garrett", "title": "Parts of Texas are under 'extremely critical' fire weather risk today -- the highest threat level", "description": "Parts of Texas are under an extreme fire threat on Thursday, according to the Storm Prediction Center (SPC).", "url": "https://www.cnn.com/2022/03/17/weather/extreme-fire-risk-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317092509-extreme-fire-outlook-03172022-card-super-tease.jpg", "publishedAt": "2022-03-17T14:51:23Z", "content": "Extreme fire weather today with the possibility of dangerous wildfires. Most fires caused by people doing stuff preventable, careless or frankly stupid. This is NOT THE DAY to be welding outside, par… [+157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "Mortgage rates rise above 4%", "description": "Mortgage rates climbed past 4% for the first time since May 2019. The 30-year fixed-rate mortgage averaged 4.16% in the week ending March 17, up from 3.85% the week before, according to Freddie Mac.", "url": "https://www.cnn.com/2022/03/17/homes/mortgage-rates-climb-march-17/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316173932-01-us-mortgage-rates-march-17-super-tease.jpg", "publishedAt": "2022-03-17T14:12:08Z", "content": "(CNN)Mortgage rates climbed past 4% for the first time since May 2019. The 30-year fixed-rate mortgage averaged 4.16% in the week ending March 17, up from 3.85% the week before, according to Freddie … [+766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, CNN", "title": "RNC narrows 2024 convention finalists down to Nashville and Milwaukee", "description": "The Republican National Committee has narrowed down the sites for its 2024 national convention to two cities, Milwaukee and Nashville, according to two people familiar with the decision.", "url": "https://www.cnn.com/2022/03/17/politics/rnc-2024-finalists-nashville-milwaukee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200826205415-02-rnc-2020-0824-super-tease.jpg", "publishedAt": "2022-03-17T14:07:25Z", "content": "(CNN)The Republican National Committee has narrowed down the sites for its 2024 national convention to two cities, Milwaukee and Nashville, according to two people familiar with the decision.\r\nRNC Ch… [+1408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dejania Oliver, CNN", "title": "Americans are concerned about rise of AI and human enhancements, survey finds", "description": "More Americans said they are \"more concerned than excited\" by the increase of artificial intelligence technology being implemented in daily life, according to a Pew Research Center survey about the rise of AI.", "url": "https://www.cnn.com/2022/03/17/health/ai-human-enhancements/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190501161413-20190501-artificial-intelligence-ethics-super-tease.jpg", "publishedAt": "2022-03-17T14:00:13Z", "content": "(CNN)More Americans said they are \"more concerned than excited\" by the increase of artificial intelligence technology being implemented in daily life, according to a Pew Research Center survey about … [+5793 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "The Italian chef who puts lasagna in a toothpaste tube", "description": "Young kitchen maverick Valerio Braschi of Rome's Ristorante 1978 is reinventing classic Italian dishes with the aim of confounding and astounding diners.", "url": "https://www.cnn.com/travel/article/italy-chef-lasagna-toothpaste/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316155709-lasagne-in-toothpaste-tube--super-tease.jpg", "publishedAt": "2022-03-17T13:21:14Z", "content": "Editor's Note Sign up to CNN Travel's Unlocking Italy newsletter for insider intel on Italy's best loved destinations and lesser-known regions to plan your ultimate trip. Plus, we'll get you in the m… [+6010 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Uber and Lyft are offering fuel surcharges and cash back offers for workers. Is it enough?", "description": "For many gig workers, their vehicles are how they make a living. And as independent contractors, they're solely responsible for keeping them clean, running and full of gas. In recent weeks, the latter part has gotten much more burdensome.", "url": "https://www.cnn.com/2022/03/17/tech/uber-lyft-fuel-costs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316151842-restricted-uber-lyft-car-ride-file-super-tease.jpg", "publishedAt": "2022-03-17T13:18:50Z", "content": "(CNN Business)For many gig workers, their vehicles are how they make a living. And as independent contractors, they're solely responsible for keeping them clean, running and full of gas. In recent we… [+7723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "The broken nickel market is a warning to Wall Street", "description": "After a week-long pause, investors can trade nickel again on the London Metal Exchange. But the market remains extremely glitchy and volatile, in a sign of how Russia's war in Ukraine continues to rattle the global financial system in unexpected ways.", "url": "https://www.cnn.com/2022/03/17/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317081158-nickel-production-russia-file-restricted-super-tease.jpg", "publishedAt": "2022-03-17T12:49:28Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6520 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Desmond Lachman for CNN Business Perspectives", "title": "The Fed can't afford to move too slowly on interest rates", "description": "If the Fed opts for a path of policy moderation, we could see a prolonged period of high inflation coupled with a sluggish economy, or stagflation.", "url": "https://www.cnn.com/2022/03/17/perspectives/fed-interest-rates-inflation-economy-recession/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316224719-01-fed-interest-rates-super-tease.jpg", "publishedAt": "2022-03-17T12:40:35Z", "content": "Desmond Lachman is a senior fellow at the American Enterprise Institute. He was a deputy director in the International Monetary Fund's Policy Development and Review Department and the chief emerging … [+3229 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Blane Bachelor, CNN", "title": "Should travelers rethink Europe plans because of the war in Ukraine?", "description": "With many travel restrictions finally relaxing in early 2022, Gabriele Antoni booked a trip she's been wanting to take for a while: several weeks in her home country of Germany, followed by a 12-day cruise in Norway with friends.", "url": "https://www.cnn.com/travel/article/europe-travel-plans-ukraine-russia-invasion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220315135053-europe-tourism-siena-italy-super-tease.jpg", "publishedAt": "2022-03-17T12:18:30Z", "content": "(CNN) With many travel restrictions finally relaxing in early 2022, Gabriele Antoni booked a trip she's been wanting to take for a while: several weeks in her home country of Germany, followed by a 1… [+10094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nikki Carvajal, CNN", "title": "Biden to speak with Chinese President Xi Jinping Friday", "description": "President Joe Biden will speak with Chinese President Xi Jinping Friday about \"managing the competition between our two countries as well as Russia's war against Ukraine and other issues of mutual concern,\" press secretary Jen Psaki said in a statement Thursd…", "url": "https://www.cnn.com/2022/03/17/politics/joe-biden-xi-jinping-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211115110823-01-joe-biden-xi-jinping-split-super-tease.jpg", "publishedAt": "2022-03-17T12:08:45Z", "content": "(CNN)President Joe Biden will speak with Chinese President Xi Jinping Friday about \"managing the competition between our two countries as well as Russia's war against Ukraine and other issues of mutu… [+114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "White House Covid-19 response Jeff Zients is leaving the White House", "description": "White House Covid-19 response coordinator Jeff Zients will exit the White House next month, President Joe Biden announced in a statement Thursday.", "url": "https://www.cnn.com/2022/03/17/politics/white-house-covid-zients-resign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210208095507-jeff-zients-file-1208-super-tease.jpg", "publishedAt": "2022-03-17T11:46:29Z", "content": "(CNN)White House Covid-19 response coordinator Jeff Zients will exit the White House next month, President Joe Biden announced in a statement Thursday.\r\nZients will be replaced by Ashish Jha.\r\nThis s… [+36 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Golden State Warriors coach Steve Kerr left fuming after Steph Curry collision and injury", "description": "Golden State Warriors coach Steve Kerr was left fuming after an on-court collision between superstar Steph Curry and Boston Celtics guard Marcus Smart left the Warriors without Curry for the remainder of the game, which ended in a 110-88 win for the Celtics.", "url": "https://www.cnn.com/2022/03/17/sport/steph-curry-injury-golden-state-boston-celtics-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317051420-01-celtics-warriors-03162022-super-tease.jpg", "publishedAt": "2022-03-17T11:25:02Z", "content": "(CNN)Golden State Warriors coach Steve Kerr was left fuming after an on-court collision between superstar Steph Curry and Boston Celtics guard Marcus Smart left the Warriors without Curry for the rem… [+2222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Mahtani", "title": "CNN asked the world's richest nations how they plan to close the pandemic gender gap. Here's what they said", "description": "In a CNN poll two-thirds of women in G7 nations said they feel let down by their governments in dealing with changes brought on by the pandemic. CNN asked those governments for comment", "url": "https://www.cnn.com/2022/03/17/world/g7-governments-closing-gender-gap-cnn-poll-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220307143033-20220307-international-womens-day-2022-v1-super-tease.jpg", "publishedAt": "2022-03-17T11:18:37Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs. \r\n (CNN)On International Women's Day, CNN's As… [+6992 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Natasha Bertrand and Barbara Starr, CNN", "title": "'Wired so tight right now': How the US and NATO are girding against errant drones and unintentional conflict with Russia", "description": "Last week, a drone flew more than 350 miles beyond Ukraine's western border before crashing in Croatia, a NATO member country. The drone was carrying a bomb, Croatian officials said, and it's still not clear whether it belonged to Ukrainian or Russian forces.", "url": "https://www.cnn.com/2022/03/17/politics/us-nato-errant-drones-unintentional-conflict-russia-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316102945-video-thumbnail-ukraine-military-tactics-tanks-super-tease.jpg", "publishedAt": "2022-03-17T11:15:30Z", "content": "(CNN)Last week, a drone flew more than 350 miles beyond Ukraine's western border before crashing in Croatia, a NATO member country. The drone was carrying a bomb, Croatian officials said, and it's st… [+8496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aisha Salaudeen, CNN", "title": "Nigeria's 'Drift Hunters' are putting their own spin on this popular motorsport", "description": "Every Sunday, in Nigeria's capital city, Abuja, Auwwal \"Captain Awwal\" Muhammad, and his partner Jamus \"Jay Bash\" Bashar practice a motorsport known as drifting -- a thrilling car maneuvering technique that involves oversteering the vehicle, causing it to \"dr…", "url": "https://www.cnn.com/2022/03/17/motorsport/drift-hunters-nigeria-motorsports-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220315115035-drift-hunters-nigeria-super-tease.jpg", "publishedAt": "2022-03-17T11:01:30Z", "content": "Abuja, Nigeria (CNN)Every Sunday, in Nigeria's capital city, Abuja, Auwwal \"Captain Awwal\" Muhammad, and his partner Jamus \"Jay Bash\" Bashar practice a motorsport known as drifting -- a thrilling car… [+1351 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "GOP push for new voting restrictions in Michigan ramps up ahead of June 1 deadline", "description": "Michigan Republicans' effort to get around Gov. Gretchen Whitmer's vetoes and implement new voting restrictions via a petition drive is set to ramp up this weekend, with a new push to gather signatures in time to meet a late-spring deadline and make the chang…", "url": "https://www.cnn.com/2022/03/17/politics/michigan-republican-voting-restrictions-petition-whitmer-veto/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210616161046-michigan-voting-file-2020-super-tease.jpg", "publishedAt": "2022-03-17T11:00:36Z", "content": "(CNN)Michigan Republicans' effort to get around Gov. Gretchen Whitmer's vetoes and implement new voting restrictions via a petition drive is set to ramp up this weekend, with a new push to gather sig… [+6707 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for March 17: Ukraine, Inflation, Coronavirus, Japan, Disney", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/03/17/us/five-things-march-17-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317044911-refugees-mariupol-03162022-super-tease.jpg", "publishedAt": "2022-03-17T10:44:06Z", "content": "(CNN)If you're hunting for a new job right now, the odds are in your favor. Companies across the board are struggling to retain and hire more workers. America's largest retailers, in particular, have… [+6987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadia Kounang, CNN", "title": "How xylazine, a veterinary tranquilizer, is making overdoses even riskier", "description": "The latest data from the US Centers for Disease Control and Prevention shows that the country lost 105,752 lives to drug overdoses in the 12-month period ending October 2021. And while most of those overdoses involved the illicit synthetic opioid fentanyl, ex…", "url": "https://www.cnn.com/2022/03/17/health/xylazine-tranq-overdose/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/151020173546-discard-drug-injection-needles-super-tease.jpg", "publishedAt": "2022-03-17T10:30:09Z", "content": "(CNN)The latest data from the US Centers for Disease Control and Prevention shows that the country lost 105,752 lives to drug overdoses in the 12-month period ending October 2021. And while most of t… [+5419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Ira Helfand, Barry Levy and Matt Bivens", "title": "The unimaginable nightmare that haunts the world", "description": "The world is shocked by the violence in Ukrainian cities besieged by Russian forces, as they suffer under indiscriminate mortar, bomb and missile attacks. But these horrors could lead to something far worse -- escalation to nuclear war.", "url": "https://www.cnn.com/2022/03/17/opinions/nuclear-war-weapons-abolition-helfand-levy-bivens/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200806220857-pba-nuclear-super-tease.jpg", "publishedAt": "2022-03-17T10:30:03Z", "content": "Ira Helfand, M.D., is a past president of International Physicians for the Prevention of Nuclear War, which won the Nobel Peace Prize in 1985. Barry Levy, M.D., M.P.H., is an adjunct professor of pub… [+4826 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael Croley", "title": "The March Madness shot that broke our hearts and the real tragedy that followed", "description": "I love March Madness for all the reasons any sports fan loves the tournament, writes Michael Croley, but as I've gotten older, I know that I love the tournament because of these memories and how it kept me close to my brother and our father.", "url": "https://www.cnn.com/2022/03/17/opinions/ncaa-march-madness-basketball-my-brother-tim-croley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316151832-croley-opinion-super-tease.jpeg", "publishedAt": "2022-03-17T10:16:19Z", "content": "Michael Croley is the author of \"Any Other Place,\" which won the James Still Award from the Fellowship of Southern Writers. His work has appeared in GQ, Esquire, The New York Times, Bloomberg, Virgin… [+10803 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Miss World crowned amid calls for peace in Ukraine", "description": "Poland's Karolina Bielawska was crowned the 70th Miss World on Wednesday, with contestants and organizers expressing solidarity with Ukrainians during an on-stage candle tribute.", "url": "https://www.cnn.com/style/article/miss-world-poland-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317023517-04-miss-world-2022-super-tease.jpg", "publishedAt": "2022-03-17T10:07:21Z", "content": "beautyPublished 17th March 2022\r\nPoland's Karolina Bielawska was crowned the 70th Miss World on Wednesday, with contestants and organizers expressing solidarity with Ukrainians during an on-stage can… [+2863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch and Aya Elamroussi, CNN", "title": "Nearly 400 gallons of gas were stolen from a North Carolina gas station after the payment system was bypassed, owner says", "description": "Nearly 400 gallons of gas were stolen from a North Carolina gas station this week, prompting the owner to take extra security precautions amid historically high gas prices nationwide.", "url": "https://www.cnn.com/2022/03/17/us/north-carolina-gas-stolen-from-station/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317005351-north-carolina-gas-station-stolen-0316-super-tease.jpg", "publishedAt": "2022-03-17T10:00:42Z", "content": "(CNN)Nearly 400 gallons of gas were stolen from a North Carolina gas station this week, prompting the owner to take extra security precautions amid historically high gas prices nationwide. \r\nHardik P… [+857 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Gunisha Kaur", "title": "The country where 30 farmers die each day", "description": "India needs far more than agricultural reform, writes Gunisha Kaur. Officials can begin by destigmatizing and decriminalizing suicide, by sincerely committing to collecting accurate data on suicide attempt and mortality, and by devoting resources to support t…", "url": "https://www.cnn.com/2022/03/17/opinions/india-farmer-suicide-agriculture-reform-kaur/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316041512-indian-farmer-file-02162018-super-tease.jpg", "publishedAt": "2022-03-17T09:59:46Z", "content": "Gunisha Kaur is a physician and human rights researcher. She is an assistant professor at Weill Cornell Medicine, director of the Human Rights Impact Lab, and a Stephen M. Kellen Term Member at the C… [+9811 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Kevin Liptak, CNN", "title": "Biden administration looking for ways to help Ukrainian refugees join family members in the US", "description": "President Joe Biden's administration is discussing ways to help Ukrainian refugees join family members already living in the US by providing special pathways for their admission, according to multiple sources.", "url": "https://www.cnn.com/2022/03/17/politics/ukrainian-refugees-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220314044727-ukraine-refugees-poland-03132022-super-tease.jpg", "publishedAt": "2022-03-17T09:59:35Z", "content": "(CNN)President Joe Biden's administration is discussing ways to help Ukrainian refugees join family members already living in the US by providing special pathways for their admission, according to mu… [+7311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Studley, CNN", "title": "New Jersey man faces murder charge over allegedly abusing his 6-year-old son, including forcing the boy to run on a treadmill, officials say", "description": "A New Jersey man has been charged with murder after allegedly abusing his 6-year-old son, including forcing him to run on a treadmill, according to prosecutors and court documents.", "url": "https://www.cnn.com/2022/03/17/us/new-jersey-boy-abuse-murder-charge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220317024343-christopher-gregor-mugshot-super-tease.jpg", "publishedAt": "2022-03-17T08:12:58Z", "content": "(CNN)A New Jersey man has been charged with murder after allegedly abusing his 6-year-old son, including forcing him to run on a treadmill, according to prosecutors and court documents. \r\nChristopher… [+3257 chars]"}]}