{"status": "ok", "totalResults": 97, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Day 4 of the 2022 Beijing Winter Olympics", "description": "The 2022 Beijing Winter Olympics continue with medal events in cross-country skiing, curling, and figure skating. Follow here for the latest news, results and updates.", "url": "https://www.cnn.com/world/live-news/beijing-winter-olympics-02-08-22-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204060019-birds-nest-beijing-02042022-super-tease.jpg", "publishedAt": "2022-02-08T01:06:11Z", "content": "It's hard to fathom the pressure that Eileen Gu would have been feeling as she waited to drop into her third jump of freeski big air qualifying on Monday.\r\nThe 18-year-old who elected to represent he… [+1821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "The Canadian trucker protest is in its second week. This is how we got here", "description": "A massive protest by Canadian truckers and others against Covid-19 mandates has entered a second week, crippling downtown Ottawa with no end in sight. The city's mayor has declared a state of emergency, and the capital's police chief is calling for outside he…", "url": "https://www.cnn.com/2022/02/07/americas/canada-covid-protest-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207160815-01-ottawa-trucker-protest-0129-super-tease.jpg", "publishedAt": "2022-02-08T00:56:00Z", "content": "Ottawa (CNN)A massive protest by Canadian truckers and others against Covid-19 mandates has entered a second week, crippling downtown Ottawa with no end in sight. The city's mayor has declared a stat… [+6893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle, CNN", "title": "Stephen Calk: Banker sentenced to prison for bribery scheme in chase for Trump administration job", "description": "A former Chicago bank executive was sentenced to one year and one day in federal prison Monday for conspiring with one-time Donald Trump campaign chairman Paul Manafort to exchange risky bank loans for a high-ranking position in the presidential administratio…", "url": "https://www.cnn.com/2022/02/07/politics/stephen-calk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325122313-stephen-calk-file-2019-super-tease.jpg", "publishedAt": "2022-02-08T00:31:36Z", "content": "New York (CNN)A former Chicago bank executive was sentenced to one year and one day in federal prison Monday for conspiring with one-time Donald Trump campaign chairman Paul Manafort to exchange risk… [+1159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, CNN", "title": "German chancellor insists NATO response will be unified if Russia invades Ukraine despite disconnect on gas pipeline", "description": "German Chancellor Olaf Scholz insisted to CNN that the United States and Germany are on the same page when it comes to Russia and Ukraine, even as he refused to discuss the Nord Stream 2 pipeline between Russia and Germany.", "url": "https://www.cnn.com/2022/02/07/politics/scholz-cnn-int/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207165053-scholz-the-lead-screengrab-super-tease.jpg", "publishedAt": "2022-02-07T23:35:31Z", "content": "(CNN)German Chancellor Olaf Scholz insisted to CNN that the United States and Germany are on the same page when it comes to Russia and Ukraine, even as he refused to discuss the Nord Stream 2 pipelin… [+2398 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "What to do about the social media shaming of figure skater Zhu Yi", "description": "Kara Alaimo argues that cruel attacks on China's Zhu Yi after falling during an Olympic figure skating competition are more than morally wrong - they also betray misogyny, misplaced nationalism and a short-sighted view of failure. She explains how having the …", "url": "https://www.cnn.com/2022/02/07/opinions/zhu-yi-olympics-figure-skating-positive-slamming-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207145950-zhu-yi-super-tease.jpg", "publishedAt": "2022-02-07T22:46:26Z", "content": "Kara Alaimo, an associate professor in the Lawrence Herbert School of Communication at Hofstra University, is a frequent contributor to CNN Opinion. She was spokesperson for international affairs in … [+5367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Supreme Court lets GOP-drawn Alabama congressional map stay in place", "description": "The Supreme Court, in a 5-4 decision, allowed a congressional map drawn by Alabama Republicans to remain in place Monday, freezing a lower court ruling that said the map likely violates the Voting Rights Act.", "url": "https://www.cnn.com/2022/02/07/politics/supreme-court-alabama/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220127163545-u-s-supreme-court-super-tease.jpg", "publishedAt": "2022-02-07T22:29:47Z", "content": "(CNN)The Supreme Court, in a 5-4 decision, allowed a congressional map drawn by Alabama Republicans to remain in place Monday, freezing a lower court ruling that said the map likely violates the Voti… [+941 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "James Bennet, former New York Times editorial page editor, expected to take the stand in defamation trial", "description": "James Bennet, former head of the New York Times editorial section who is being sued along with the paper by Sarah Palin for defamation is expected to take the witness stand Tuesday, an attorney for Palin said in court.", "url": "https://www.cnn.com/2022/02/07/media/sarah-palin-new-york-times-james-bennet/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207163236-james-bennet-journalist-file-super-tease.jpg", "publishedAt": "2022-02-07T22:16:43Z", "content": "New York (CNN Business)James Bennet, former head of the New York Times editorial section who is being sued along with the paper by Sarah Palin for defamation is expected to take the witness stand Tue… [+4922 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "What the Electoral Count Act is -- and why some argue reforming it can protect future elections", "description": "The Electoral Count Act proved to be a vital safeguard for democracy in 2020 when former President Donald Trump sought to overturn the presidential election in his favor. There is serious interest from both Democrats and Republicans in updating the 19th-centu…", "url": "https://www.cnn.com/2022/02/07/politics/what-is-electoral-count-act-overhaul/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206155920-manchin-murkowski-electoral-count-act-cnntv-super-tease.jpg", "publishedAt": "2022-02-07T22:07:19Z", "content": "Washington (CNN)The Electoral Count Act proved to be a vital safeguard for democracy when former President Donald Trump sought to overturn the 2020 presidential election in his favor.\r\nThough the 19t… [+3796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown and Marnie Hunter, CNN", "title": "CDC's highest travel risk level is jam-packed with nearly 135 places, including Japan", "description": "The US Centers for Disease Control and Prevention added more destinations on Monday to its ever-growing list of places considered to be a \"very high\" travel risk for Covid-19, including Japan and Cuba.", "url": "https://www.cnn.com/travel/article/cdc-very-high-risk-travel-destinations-february-7/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211220182050-02-japan-best-islands-honshu-super-tease.jpg", "publishedAt": "2022-02-07T21:52:32Z", "content": "(CNN) The US Centers for Disease Control and Prevention added even more destinations on Monday to its ever-growing list of places considered to be a \"very high\" travel risk for Covid-19.\r\nLevel 4, th… [+5664 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Former New York Gov. Andrew Cuomo is eyeing a political comeback", "description": "Former New York Gov. Andrew Cuomo is seriously considering a political comeback as early as this year, two sources close to his inner circle told CNN, adding to a series of recent reports hinting at the Democrat's desire to resurrect his career after resignin…", "url": "https://www.cnn.com/2022/02/07/politics/andrew-cuomo-political-future/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806112608-05-andrew-cuomo-0405-super-tease.jpg", "publishedAt": "2022-02-07T21:46:53Z", "content": "(CNN)Former New York Gov. Andrew Cuomo is seriously considering a political comeback as early as this year, two sources close to his inner circle told CNN, adding to a series of recent reports hintin… [+5606 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Parents' bid to block Youngkin school mask policy dismissed, but temporary hold granted to school districts still stands", "description": "The Virginia Supreme Court dismissed a lawsuit filed last month by parents in Chesapeake, Virginia, who alleged that Republican Gov. Glenn Youngkin's mask executive order ran afoul of the state constitution.", "url": "https://www.cnn.com/2022/02/07/politics/virginia-supreme-court-school-mask-youngkin-policy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205143400-glenn-youngkin-maskless-supermarket-super-tease.jpg", "publishedAt": "2022-02-07T21:44:16Z", "content": "(CNN)The Virginia Supreme Court dismissed a lawsuit filed last month by parents in Chesapeake, Virginia, who alleged that Republican Gov. Glenn Youngkin's mask executive order ran afoul of the state … [+1064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Peter Thiel to step down from Facebook's board", "description": "Peter Thiel, one of Facebook's longest-serving and most controversial board members, plans to step down from the company's board later this year, the company said Monday.", "url": "https://www.cnn.com/2022/02/07/tech/peter-thiel-facebook-board/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207161623-file-peter-thiel-2019-restricted-super-tease.jpg", "publishedAt": "2022-02-07T21:35:22Z", "content": "New York (CNN Business)Peter Thiel, one of Facebook's longest-serving and most controversial board members, plans to step down from the company's board later this year, the company said Monday.\r\nThie… [+247 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson and Tina Burnside, CNN", "title": "A woman falls to her death after a drawbridge in Florida opens as she attempted to cross", "description": "Authorities in West Palm Beach, Florida, are investigating the death of a bicyclist who fell to her death from a drawbridge as it opened.", "url": "https://www.cnn.com/2022/02/07/us/woman-falls-to-death-drawbridge-florida-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207155145-royal-park-bridge-death-0206-super-tease.jpg", "publishedAt": "2022-02-07T21:27:41Z", "content": "(CNN)Authorities in West Palm Beach, Florida, are investigating the death of a bicyclist who fell to her death from a drawbridge as it opened.\r\nThe victim was seen walking her bicycle on the sidewalk… [+1541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Isabelle Jani-Friend and Angela Dewan, CNN", "title": "Some of the world's biggest companies are failing on their own climate pledges, researchers say", "description": "Amazon, Google, Ikea and BMW are among some of the world's biggest companies failing to meet their climate targets, a new report claims.", "url": "https://www.cnn.com/2022/02/07/business/companies-net-zero-climate-report-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207101359-03-companies-fail-net-zero-climate-pledge-intl-super-tease.jpg", "publishedAt": "2022-02-07T21:25:03Z", "content": "(CNN)Amazon, Google, Ikea and BMW are among some of the world's biggest companies failing to meet their own proclaimed climate targets and align with international agreements to slash greenhouse gas … [+8540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, CNN", "title": "Former White House officials describe Trump's habit of ripping up documents and haphazard record-keeping", "description": "Former President Donald Trump would routinely rip up documents, drafts and reading materials, and he took several boxes to Mar-a-Lago when he relocated to Florida after leaving the White House -- raising concerns about his preservation of presidential records…", "url": "https://www.cnn.com/2022/02/07/politics/trump-rip-documents-white-house-national-archives/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211027234429-02-donald-trump-100921-super-tease.jpg", "publishedAt": "2022-02-07T20:50:43Z", "content": "(CNN)Former President Donald Trump would routinely rip up documents, drafts and reading materials, and he took several boxes to Mar-a-Lago when he relocated to Florida after leaving the White House -… [+4963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/leinz-vales\">Leinz Vales</a>, Jason Kurtz, Maureen Chowdhury, Mike Hayes and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Active shooter situation at Washington Fred Meyer", "description": "There's an active shooter situation at a Fred Meyer grocery store in Richland, Washington, the Bureau of Alcohol, Tobacco and Firearms says. Follow here for live updates.", "url": "https://www.cnn.com/us/live-news/washington-fred-meyer-shooting-02-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207150204-01-richland-fred-meyer-incident-0207-super-tease.jpg", "publishedAt": "2022-02-07T20:48:32Z", "content": "At least one person is dead and another is injured in the active shooting incident at a Fred Meyer grocery store in Richland, Washington.\r\nBenton County Chief Coroner Dennis Morris told CNN they have… [+588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy, CNN", "title": "Active shooter situation reported at Washington state supermarket, ATF says", "description": "The Bureau of Alcohol, Tobacco, Firearms and Explosives confirms to CNN they received a call for assistance for an active shooter situation at a Fred Meyer grocery store in Richland, Washington.", "url": "https://www.cnn.com/2022/02/07/us/richland-washington-fred-meyer-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207150204-01-richland-fred-meyer-incident-0207-super-tease.jpg", "publishedAt": "2022-02-07T20:30:04Z", "content": "(CNN)The Bureau of Alcohol, Tobacco, Firearms and Explosives confirms to CNN they received a call for assistance for an active shooter situation at a Fred Meyer grocery store in Richland, Washington.… [+314 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "White House keeps encouraging masks in schools as some states move toward lifting mandates", "description": "The White House maintained its adherence to US Centers for Disease Control and Prevention guidance encouraging mask usage in schools Monday as some states take steps toward lifting mask mandates in the classroom.", "url": "https://www.cnn.com/2022/02/07/politics/white-house-masking-in-schools/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211031174109-psaki-101821-super-tease.jpg", "publishedAt": "2022-02-07T20:23:34Z", "content": "(CNN)The White House maintained its adherence to US Centers for Disease Control and Prevention guidance encouraging mask usage in schools Monday as some states take steps toward lifting mask mandates… [+2569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "DHS updates terrorism bulletin in the wake of recent violent events and Russia-Ukraine tensions", "description": "The spread of conspiracy theories and disinformation is fueling the \"heightened threat\" environment in the United States, warns the latest national bulletin issued Monday by the Department of Homeland Security.", "url": "https://www.cnn.com/2022/02/07/politics/homeland-security-terrorism-bulletin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207145139-dhs-file-restricted-super-tease.jpg", "publishedAt": "2022-02-07T20:11:49Z", "content": "Washington (CNN)The spread of conspiracy theories and disinformation is fueling the \"heightened threat\" environment in the United States, warns the latest national bulletin issued Monday by the Depar… [+2831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "House Democrats introduce stopgap bill to fund government until March 11 ahead of looming deadline", "description": "House Democrats on Monday introduced a short-term measure to extend government funding through March 11, an effort to avert a shutdown at the end of next week since funding is currently set to expire on February 18.", "url": "https://www.cnn.com/2022/02/07/politics/stopgap-government-funding-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130718190940-rosa-delauro-headshot-story-top.jpg", "publishedAt": "2022-02-07T20:02:39Z", "content": "(CNN)House Democrats on Monday introduced a short-term measure to extend government funding through March 11, an effort to avert a shutdown at the end of next week since funding is currently set to e… [+1600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "Preparing for Category 6 hurricanes, a new facility will test hurricane winds of 200 mph and storm surge", "description": "A first-of-its-kind facility is being built to test the catastrophic conditions of the world's strongest tropical cyclones.", "url": "https://www.cnn.com/2022/02/07/weather/category-6-hurricane-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190904085957-nick-hague-dorian-eye-super-tease.jpg", "publishedAt": "2022-02-07T19:53:25Z", "content": "A version of this article originally appeared in the weekly weather newsletter, which releases every Monday. You can sign up here to receive these every week and during significant storms. \r\n (CNN)I … [+5948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Covid-19 cases are one-third of the peak 3 weeks ago. Here's where the US stands on other metrics", "description": "The Omicron wave of Covid-19 cases has receded significantly in the US over the past few weeks, but more people are dying each day from the contagious illness than died during the peak of the Delta wave last summer.", "url": "https://www.cnn.com/2022/02/07/us/covid-state-of-play-omicron/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204124630-alabama-covid-hospital-012822-file-super-tease.jpg", "publishedAt": "2022-02-07T19:44:52Z", "content": "(CNN)The Omicron wave of Covid-19 cases has receded significantly in the US over the past few weeks, but more people are dying each day from the contagious illness than died during the peak of the De… [+2118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Corinne Dorsey, Liz Stark and Marnie Hunter, CNN", "title": "Buttigieg says 'we need to take a look at' a no-fly list for unruly passengers", "description": "Transportation Secretary Pete Buttigieg said on CNN on Monday that \"we need to take a look at\" placing unruly passengers on a federal no-fly list as pressure mounts on the Biden administration to continue to address rising violence on airplanes.", "url": "https://www.cnn.com/travel/article/pate-buttigieg-no-fly-list-unruly-passengers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114065906-delta-airlines-planes-file-12242021-super-tease.jpg", "publishedAt": "2022-02-07T19:01:46Z", "content": "Delta Air Lines aircraft on the tarmac of John F. Kennedy International Airpot in New York, on December 24, 2021. Delta's CEO recently repeated a call for a no-fly list for unruly passengers. (Photo … [+102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Chimpanzees apply 'medicine' to each others' wounds in a possible show of empathy", "description": "Chimpanzees were observed applying insects to their own wounds, as well as the wounds of others, for the first time. This behavior may be a sign of helpful tendencies in chimpanzees similar to empathy in humans, according to a new study.", "url": "https://www.cnn.com/2022/02/07/world/chimpanzee-insects-wounds-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207121032-chimpanzee-prosocial-behavior-super-tease.jpg", "publishedAt": "2022-02-07T17:39:35Z", "content": "(CNN)For the first time, chimpanzees were spotted capturing insects and applying them to their own wounds, as well as the wounds of others, possibly as a form of medication. \r\nThis behavior of one an… [+6595 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "No blue Christmas, but filling Santa's sleigh cost Hasbro a fortune", "description": "Kids had plenty of Spider-Man, My Little Pony and Peppa Pig toys from Hasbro under the tree during the 2021 holidays. But Hasbro is warning that continued supply chain woes could be a problem going forward.", "url": "https://www.cnn.com/2022/02/07/investing/hasbro-earnings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207081329-hasbro-earnings-file-restricted-super-tease.jpg", "publishedAt": "2022-02-07T17:24:11Z", "content": "New York (CNN Business)Kids had plenty of Spider-Man, My Little Pony and Peppa Pig toys from Hasbro under the tree during the 2021 holidays. But Hasbro is warning that continued supply chain woes cou… [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: Every Republican should be required to read this Lisa Murkowski quote", "description": "There was an exchange Sunday between CNN's Jake Tapper and Alaska Sen. Lisa Murkowski that should be required reading/watching for every Republican in elected office.", "url": "https://www.cnn.com/2022/02/07/politics/lisa-murkowski-republican-partisan-politics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200920125227-lisa-murkowski-0623-file-super-tease.jpg", "publishedAt": "2022-02-07T16:52:50Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "US and Japan set to announce steel trade deal", "description": "The US and Japan are set to announce a deal that would cut Trump-era tariffs on steel, a person familiar with the matter said.", "url": "https://www.cnn.com/2022/02/07/politics/us-japan-steel-tariffs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220121101232-us-japan-virtual-meeting-wh-photo-super-tease.jpg", "publishedAt": "2022-02-07T16:39:24Z", "content": "(CNN)The US and Japan are set to announce a deal that would cut Trump-era tariffs on steel, a person familiar with the matter said.\r\nUnder the agreement, a limited amount of Japanese steel will be al… [+513 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Beijing 2022 poster child Eileen Gu revels in 'historic moment' of reaching freeski big air final", "description": "It's hard to fathom the pressure that Eileen Gu would have been feeling as she waited to drop into her third jump of freeski big air qualifying on Monday.", "url": "https://www.cnn.com/2022/02/07/sport/eileen-gu-reaches-freeski-big-air-final-beijing-2022-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207032022-eileen-gu-debut-02072022-super-tease.jpg", "publishedAt": "2022-02-07T16:34:11Z", "content": "(CNN)It's hard to fathom the pressure that Eileen Gu would have been feeling as she waited to drop into her third jump of freeski big air qualifying on Monday.\r\nThe 18-year-old -- who elected to repr… [+5501 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jack Guy, CNN", "title": "After more than 1,000 years, this English pub is closing its doors", "description": "An English pub that claims to be the oldest in Britain is closing due to financial problems worsened by the pandemic.", "url": "https://www.cnn.com/travel/article/ye-olde-fighting-cocks-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207094331-ye-olde-fighting-cocks-st-albans-scli-intl-super-tease.jpg", "publishedAt": "2022-02-07T16:17:08Z", "content": "Jack Guy, CNNPublished 7th February 2022\r\n(CNN) An English pub that claims to be the oldest in Britain is closing due to financial problems worsened by the pandemic.\r\nYe Olde Fighting Cocks in St. Al… [+3145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Jill Biden: 'I was disappointed' free community college cut from Build Back Better bill", "description": "First lady Jill Biden said Monday that she was \"disappointed\" one of her key causes, free community college, was cut from President Biden's Build Back Better agenda.", "url": "https://www.cnn.com/2022/02/07/politics/jill-biden-free-community-college/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207112531-01-jill-biden-community-college-super-tease.jpg", "publishedAt": "2022-02-07T16:10:53Z", "content": "(CNN)First lady Jill Biden said Monday that she was \"disappointed\" one of her key causes, free community college, was cut from President Biden's Build Back Better agenda. \r\n\"Joe has also had to make … [+2395 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "New spinal cord stimulation study puts people with paralysis on their feet again", "description": "Michel Roccati lost the ability to walk after a motorcycle accident in 2017, when he had a complete spinal cord injury. But today, equipped with an electrode device implanted on his spinal cord, Roccati can enjoy the simple things again: standing at a bar for…", "url": "https://www.cnn.com/2022/02/07/health/spinal-cord-stimulation-study/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207092954-02-spinal-chord-handout-super-tease.jpg", "publishedAt": "2022-02-07T16:00:24Z", "content": "(CNN)Michel Roccati lost the ability to walk after a motorcycle accident in 2017, when he had a complete spinal cord injury. But today, equipped with an electrode device implanted on his spinal cord,… [+6367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Tesla still owns $2 billion in bitcoin, but crypto volatility has taken a toll", "description": "If you've been hurt by the volatile moves in bitcoin lately, you're in good company. Tesla, run by the world's richest person, Elon Musk, has been hit by the crypto craziness too.", "url": "https://www.cnn.com/2022/02/07/investing/tesla-bitcoin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207100418-tesla-california-012822-restricted-super-tease.jpg", "publishedAt": "2022-02-07T15:48:46Z", "content": "New York (CNN Business)If you've been hurt by the volatile moves in bitcoin lately, you're in good company. Tesla, run by the world's richest person, Elon Musk, has been hit by the crypto craziness t… [+930 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Celine Alkhaldi and Nimi Princewill, CNN", "title": "'May God be with my son.' Father's farewell to Moroccan boy who died after days trapped in well", "description": "Crowds gathered in Morocco's northern Chefchaouen province on Monday to attend the funeral of five-year-old Rayan Aourram, who died after being trapped in a well for four days.", "url": "https://www.cnn.com/2022/02/07/africa/moroccan-toddler-buried-monday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204050333-04-moroccan-boy-rescue-super-tease.jpg", "publishedAt": "2022-02-07T15:45:46Z", "content": "Rayan's passing generated an outpouring of grief with world leaders offering condolences to his family.King Mohammed VI of Morocco offered condolences to Rayan's family in a phone call, according to … [+323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How Mike Pence just doomed his 2024 chances", "description": "Mike Pence just crashed his political career into Donald Trump -- and the former President's ongoing claims that the 2020 election was fraudulent and should have been overturned on January 6.", "url": "https://www.cnn.com/2022/02/07/politics/pence-trump-election-constitution-jan-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211006090839-pence-and-trump-super-tease.jpg", "publishedAt": "2022-02-07T15:42:36Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliott C. McLaughlin, CNN", "title": "Minneapolis City Council to review no-knock warrants in the wake of Amir Locke's killing", "description": "With Minneapolis' mayor imposing what he described as a moratorium on no-knock warrants following the fatal police shooting of Amir Locke, a city council committee Monday will review the practice, which was supposedly all but banned in 2020.", "url": "https://www.cnn.com/2022/02/07/us/no-knock-warrants-minneapolis-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204062646-minnesota-police-bodycam-still-super-tease.jpg", "publishedAt": "2022-02-07T15:39:57Z", "content": "(CNN)With Minneapolis' mayor imposing what he described as a moratorium on no-knock warrants following the fatal police shooting of Amir Locke, a city council committee Monday will review the practic… [+6921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Christopher Leonard for CNN Business Perspectives", "title": "Expect markets to be on a wild ride until the Fed really starts raising rates", "description": "Market volatility will continue until investors figure out whether the Fed is actually serious about raising rates aggressively.", "url": "https://www.cnn.com/2022/02/07/perspectives/fed-interest-rates-stock-market/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220121114322-nyse-0118-restricted-super-tease.jpg", "publishedAt": "2022-02-07T15:25:52Z", "content": "Christopher Leonard is the author of \"The Lords of Easy Money: How the Federal Reserve Broke the American Economy,\" from Simon &amp; Schuster. The opinions expressed in this commentary are his own. \r… [+4614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "PriceRunner sues Google for 2.1 billion euros, prepares for long fight", "description": "Swedish price comparison firm PriceRunner said on Monday it was suing Alphabet-owned Google for about 2.1 billion euros ($2.4 billion), the latest firm to take legal action alleging the search giant manipulated search results.", "url": "https://www.cnn.com/2022/02/07/tech/pricerunner-google-suit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211116004014-google-tablet-stock-super-tease.jpg", "publishedAt": "2022-02-07T15:17:13Z", "content": "StockholmSwedish price comparison firm PriceRunner said on Monday it was suing Alphabet-owned Google(GOOG) for about 2.1 billion euros ($2.4 billion), the latest firm to take legal action alleging th… [+751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Hit by second cyclone in two weeks, Madagascar struggles to bring aid", "description": "Emergency rescuers were struggling on Monday to reach parts of Madagascar ravaged by a cyclone over the weekend because many roads and bridges were impassable, while rising river levels were threatening to displace more people, officials said.", "url": "https://www.cnn.com/2022/02/07/africa/second-cyclone-hits-madagascar-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220128101048-06-death-toll-rises-in-southern-african-floods-super-tease.jpg", "publishedAt": "2022-02-07T14:53:29Z", "content": "Antananarivo, Madagascar (Reuters)Emergency rescuers were struggling on Monday to reach parts of Madagascar ravaged by a cyclone over the weekend because many roads and bridges were impassable, while… [+1747 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Nickeas and Omar Jimenez, CNN", "title": "What Minneapolis' current no-knock warrant policy really says", "description": "An officer from a Minneapolis SWAT team shot a man to death while serving a Wednesday morning warrant in connection with a homicide investigation, and though the man who they shot was armed, he was not the target of the warrant, attorneys and police say.", "url": "https://www.cnn.com/2022/02/07/us/no-knock-warrant-policy-minneapolis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207091106-minneapolis-police-102421-file-restricted-super-tease.jpg", "publishedAt": "2022-02-07T14:52:47Z", "content": "(CNN) An officer from a Minneapolis SWAT team shot a man to death while servinga Wednesday morningwarrant in connection with a homicide investigation, and though the man who they shot was armed, he w… [+4617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan and Jeremy Diamond, CNN", "title": "Top Biden science adviser apologizes for 'demeaning' colleagues", "description": "A top science adviser to President Joe Biden, Eric Lander, apologized to staff on Friday for speaking to colleagues in a \"disrespectful or demeaning way,\" after an internal investigation found evidence of workplace conduct policy violations.", "url": "https://www.cnn.com/2022/02/07/politics/eric-lander-white-house-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207093432-eric-lander-file-2021-super-tease.jpg", "publishedAt": "2022-02-07T14:45:06Z", "content": "(CNN)A top science adviser to President Joe Biden, Eric Lander, apologized to staff on Friday for speaking to colleagues in a \"disrespectful or demeaning way,\" after an internal investigation found e… [+3533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Dwayne Johnson reconsiders his support of Joe Rogan", "description": "Dwayne \"The Rock\" Johnson initially supported Joe Rogan, but has \"become educated\" since learning of Rogan's use of a racial slur.", "url": "https://www.cnn.com/2022/02/07/entertainment/dwayne-johnson-joe-rogan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207133757-dwayne-johnson-joe-rogan-super-tease.jpg", "publishedAt": "2022-02-07T14:34:56Z", "content": "Dear @donwinslowThank you so much for thisI hear you as well as everyone here 100%I was not aware of his N word use prior to my comments, but now I've become educated to his complete narrative.Learni… [+148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Melissa Macaya and Mike Hayes, CNN", "title": "The latest on Ukraine and Russia tensions", "description": "Tensions between Moscow and Kyiv are at their highest in years, with a large Russian troop buildup near the shared borders of the two former Soviet republics. Follow for the latest live news updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-biden-scholz-news-02-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201132018-26-ukraine-russia-training-cnnphotos-super-tease.jpg", "publishedAt": "2022-02-07T14:12:19Z", "content": "As the standoff between Russia and the West enters a potentially decisive phase, President Biden meets today at the White House with Germany's new chancellor, whose willingness to confront Moscow alo… [+2055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Jim Sciutto and Katie Bo Lillis, CNN", "title": "US intel indicates Russian officers have had doubts about full scale Ukraine invasion", "description": "Intercepted communications obtained by the US have revealed that some Russian officials have worried that a large-scale invasion of Ukraine would be costlier and more difficult than Russian President Vladimir Putin and other Kremlin leaders realize, according…", "url": "https://www.cnn.com/2022/02/07/politics/us-intel-russia-doubts-invasion-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207134856-us-intel-indicates-russian-officers-have-had-doubts-about-full-scale-ukraine-invasion-file-restricted-020322-super-tease.jpg", "publishedAt": "2022-02-07T14:00:47Z", "content": "(CNN)Intercepted communications obtained by the US have revealed that some Russian officials have worried that a large-scale invasion of Ukraine would be costlier and more difficult than Russian Pres… [+4316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "Two strangers meet on an airplane. Four years later they fall in love", "description": "High school seniors Schereéya and Anton crossed paths while flying to Virginia for a college acceptance day. Over the next few years, the two weaved in and out of one another's lives, before a road trip to New Orleans cemented their relationship.", "url": "https://www.cnn.com/travel/article/chance-encounters-airplane-schereeya-anton/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207093205-02-chance-encounters-airplane-road-trip-super-tease.jpg", "publishedAt": "2022-02-07T13:05:10Z", "content": "(CNN) Whenever high school senior Schereéya boarded an airplane, it was with a particular thought in mind: \"What if I meet the person I'm going to marry on board?\"\r\nSchereéya, who uses they/them pron… [+14536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for Feb. 7: Covid, Capitol riot, Electoral count, Jubilee, Joe Rogan", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/02/07/us/five-things-february-7-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207043705-canada-protest-police-02052022-super-tease.jpg", "publishedAt": "2022-02-07T11:35:08Z", "content": "(CNN)Tired of seeing empty shelves at your favorite grocery store? More shoppers are turning to smaller convenience stores as a backup, but they're struggling to stay fully stocked too, especially in… [+6188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "White House workers' task force releases pro-union recommendations in new report", "description": "The White House workers' task force, which is chaired by Vice President Kamala Harris, publicly released a report Monday that offers nearly 70 recommendations to promote pro-union policies and practices in the federal government.", "url": "https://www.cnn.com/2022/02/07/politics/white-house-labor-task-force-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206143215-white-house-labor-task-force-report-super-tease.jpg", "publishedAt": "2022-02-07T11:02:23Z", "content": "(CNN)The White House workers' task force, which is chaired by Vice President Kamala Harris, publicly released a report Monday that offers nearly 70 recommendations to promote pro-union policies and p… [+2366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gianluca Mezzofiore and Tim Lister, CNN", "title": "Russia accelerates movement of military hardware towards Ukraine, satellite images show", "description": "New satellite imagery obtained by CNN shows that a large base which held Russian tanks, artillery and other armor near the Ukrainian border has been largely emptied, with the equipment apparently being moved much closer to the frontier in recent days.", "url": "https://www.cnn.com/2022/02/07/europe/yelnya-russian-hardware-ukraine-border-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207034516-01-russia-troops-ukr-satellite-02062022-super-tease.jpg", "publishedAt": "2022-02-07T10:16:14Z", "content": "(CNN)New satellite imagery obtained by CNN shows that a large base which held Russian tanks, artillery and other armor near the Ukrainian border has been largely emptied, with the equipment apparentl… [+3523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Germany's Scholz meets Biden as the new chancellor's resolve on Ukraine is tested", "description": "As the standoff between Russia and the West enters a potentially decisive phase, President Joe Biden meets Monday at the White House with Germany's new chancellor, whose willingness to confront Moscow alongside the United States has been called into question.", "url": "https://www.cnn.com/2022/02/07/politics/biden-scholz-meeting-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206211937-biden-sholz-split-super-tease.jpg", "publishedAt": "2022-02-07T10:02:50Z", "content": "(CNN)As the standoff between Russia and the West enters a potentially decisive phase, President Joe Biden meets Monday at the White House with Germany's new chancellor, whose willingness to confront … [+8026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "Pregnant women are less likely to impact their children's weight than previously believed", "description": "Lifestyle factors such as diet and exercise are more likely to affect a child's body mass index (BMI) than the weight of a mother during her pregnancy.", "url": "https://www.cnn.com/2022/02/07/health/pregnancy-children-bmi-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204141011-pregnant-mom-playground-stock-super-tease.jpg", "publishedAt": "2022-02-07T09:54:02Z", "content": "(CNN)A pregnant woman's body mass index has less of an influence on her child's BMI than previously believed, according to a new study. BMI is a measure that uses height and weight data to track chan… [+3483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allyssia Alleyne, CNN", "title": "Dramatic photos cast Europe's ancient castles in a new light", "description": "For centuries, medieval castles -- hulking, isolated triumphs of masonry -- have held a special place in the Western imagination, evoking at once a sense of history, fantasy, war and romance.", "url": "https://www.cnn.com/style/article/frederic-chaubin-stone-age-castles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211014143421-04c-european-castles-frederic-chaubin-book-restricted-super-tease.jpg", "publishedAt": "2022-02-07T09:18:37Z", "content": "For centuries, medieval castles -- hulking, isolated triumphs of masonry -- have held a special place in the Western imagination, evoking at once a sense of history, fantasy, war and romance. They ar… [+5236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton and Travis Caldwell, CNN", "title": "Crippling protests across Canada over Covid-19 restrictions enter second week as officials announce multiple arrests", "description": "Canadian authorities continue to face protests over Covid-19 regulations that are now stretching into a second week of blocked roads and boisterous demonstrations.", "url": "https://www.cnn.com/2022/02/07/americas/canada-trucker-protests-covid-weekend-arrests-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207010324-canada-vax-protest-02062022-super-tease.jpg", "publishedAt": "2022-02-07T08:35:34Z", "content": "(CNN)Canadian authorities continue to face protests over Covid-19 regulations that are now stretching into a second week of blocked roads and boisterous demonstrations. \r\nInitially stemming from a gr… [+5921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Is Macron the West's new Putin-whisperer?", "description": "If there was one indication that French President Emmanuel Macron may be well on his way to replacing former German Chancellor Angela Merkel as the leading figure in Western Europe, it is his expanding relationship with Russian President Vladimir Putin.", "url": "https://www.cnn.com/2022/02/07/opinions/french-president-macron-putin-whisperer-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204102544-france-russia-macron-putin-062620-file-super-tease.jpg", "publishedAt": "2022-02-07T07:54:47Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+7868 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus and Alex Stambaugh, CNN", "title": "Australia to reopen to vaccinated international travelers this month", "description": "Australia will open its borders to fully vaccinated international travelers from late February, Australian Prime Minister Scott Morrison announced on Monday, February 7 after a meeting of the government's national security committee.", "url": "https://www.cnn.com/travel/article/australia-tourism-reopening-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220207002859-sydney-harbour-file-12312021-restricted-super-tease.jpg", "publishedAt": "2022-02-07T06:14:37Z", "content": "CNN's Teele Rebane contributed reportingSydney Harbour photo by EPA-EFE/Shutterstock"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Eileen Gu is the poster child for a new type of Chinese athlete. But one wrong move could send her tumbling", "description": "At this year's Beijing Winter Olympics, the face of China's sporting dreams is undeniably American.", "url": "https://www.cnn.com/2022/02/07/china/eileen-gu-olympics-foreign-athletes-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204152920-eileen-gu-jan-20-super-tease.jpg", "publishedAt": "2022-02-07T06:06:16Z", "content": "Hong Kong (CNN)At this year's Beijing Winter Olympics, the face of China's sporting dreams is undeniably American.\r\nFreestyle skier Eileen Gu's rise to the top has been meteoric -- and her popularity… [+8869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mick Krever and Melissa Bell, CNN", "title": "Ukrainians prepare for war at the site of the world's worst nuclear disaster", "description": "It's a frigid Friday in Ukraine's Chernobyl Exclusion Zone, and dozens of journalists in fluorescent yellow vests are frantically elbowing each other as they vie for camera position in a town where no one has lived since 1986.", "url": "https://www.cnn.com/2022/02/07/europe/ukraine-chernobyl-belarus-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205151634-02-ukraine-belarus-chernobyl-0204-super-tease.jpg", "publishedAt": "2022-02-07T05:08:11Z", "content": "Chernobyl, Ukraine (CNN)It's a frigid Friday in Ukraine's Chernobyl Exclusion Zone, and dozens of journalists in fluorescent yellow vests are frantically elbowing each other as they vie for camera po… [+5550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Jeff Zucker, has caused tremendous turmoil internally and intensive news coverage externally. There is a lot being said about CNN right now that simply doesn't make sense. So I want to address that - and channel the feelings of the 100+ staffers who I have sp…", "url": "https://view.newsletters.cnn.com/messages/1644209202118fb89cbeafedf/raw", "urlToImage": null, "publishedAt": "2022-02-07T04:55:03Z", "content": "The sudden loss of CNN's leader, Jeff Zucker, has caused tremendous turmoil internally and intensive news coverage externally. There is a lot being said about CNN right now that simply doesn't make s… [+7078 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "New Orleans Saints running back Alvin Kamara arrested in Las Vegas after playing in Pro Bowl", "description": "New Orleans Saints running back Alvin Kamara was arrested Sunday by Las Vegas Metropolitan Police and charged with \"battery resulting in substantial bodily harm,\" a news release from the department said.", "url": "https://www.cnn.com/2022/02/06/sport/alvin-kamara-arrested-running-back-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206225842-alvin-kamara-pro-bowl-practice-02052022-super-tease.jpg", "publishedAt": "2022-02-07T04:43:36Z", "content": "(CNN)New Orleans Saints running back Alvin Kamara was arrested Sunday by Las Vegas Metropolitan Police and charged with \"battery resulting in substantial bodily harm,\" a news release from the departm… [+1261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul, CNN", "title": "Former CNN Digital Asia Director Marc Lourdes dies, aged 40", "description": "Marc Lourdes, a former director of CNN Digital Worldwide for Asia-Pacific, died tragically in a motorcycle accident in Malaysia on Saturday. He was 40.", "url": "https://www.cnn.com/2022/02/06/asia/marc-lourdes-obituary-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206193722-marc-lourdes-obit-intl-hnk-super-tease.jpg", "publishedAt": "2022-02-07T04:34:06Z", "content": "(CNN)Marc Lourdes, a former director of CNN Digital Worldwide for Asia-Pacific, died tragically in a motorcycle accident in Malaysia on Saturday. He was 40. \r\nLourdes joined CNN's Hong Kong newsroom … [+3173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Spotify CEO condemns Rogan's use of racial slurs, but says company won't be 'silencing' him", "description": "Daniel Ek, the chief executive of Spotify, addressed Joe Rogan's past use of racial slurs on Sunday night, telling staff in a memo that while he found the comments \"incredibly hurtful\" and inconsistent with company values, he did not believe \"silencing\" the p…", "url": "https://www.cnn.com/2022/02/06/media/spotify-joe-rogan-daniel-ek/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206230925-joe-rogan-file-12102021-super-tease.jpg", "publishedAt": "2022-02-07T04:29:02Z", "content": "(CNN Business)Daniel Ek, the chief executive of Spotify, addressed Joe Rogan's past use of racial slurs on Sunday night, telling staff in a memo that while he found the comments \"incredibly hurtful\" … [+3040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "Authorities searching for three inmates who escaped a Tennessee jail", "description": "Authorities are searching for three inmates who escaped from a jail in northeast Tennessee Friday morning, according to the Sullivan County Sheriff's Office.", "url": "https://www.cnn.com/2022/02/06/us/tennessee-inmates-escape-jail-sullivan-county/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206220906-tennessee-escapees-split-super-tease.jpg", "publishedAt": "2022-02-07T03:57:28Z", "content": "(CNN)Authorities are searching for three inmates who escaped from a jail in northeast Tennessee Friday morning, according to the Sullivan County Sheriff's Office.\r\n\"All three are wanted on Escape cha… [+607 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Fortinsky", "title": "Stacey Abrams comes under fire for not wearing a mask in now-deleted photos with masked schoolchildren", "description": "A since-deleted tweet featuring photos of a mask-less Stacey Abrams posing among masked schoolchildren has prompted swift backlash from political opponents who chastised the Georgia Democrat for what they describe as hypocritical behavior after she championed…", "url": "https://www.cnn.com/2022/02/06/politics/stacey-abrams-school-photos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206214130-stacey-abrams-school-unmasked-twitter-feb-2022-super-tease.jpeg", "publishedAt": "2022-02-07T03:34:38Z", "content": "(CNN)A since-deleted tweet featuring photos of a mask-less Stacey Abrams posing among masked schoolchildren has prompted swift backlash from political opponents who chastised the Georgia Democrat for… [+3298 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holden Perrelli, CNN", "title": "Miami Dolphins announce their next head coach", "description": "The Miami Dolphins announced Sunday night the hiring of Mike McDaniel as the team's head coach, replacing Brian Flores, who was fired after the regular season wrapped and later initiated a class-action lawsuit against the league alleging racial discrimination…", "url": "https://www.cnn.com/2022/02/06/sport/miami-dolphins-mike-mcdaniel-head-coach-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206192622-miami-dolphins-mike-mcdaniel-next-head-coach-super-tease.jpg", "publishedAt": "2022-02-07T02:21:12Z", "content": "(CNN)The Miami Dolphins announced Sunday night the hiring of Mike McDaniel as the team's head coach, replacing Brian Flores, who was fired after the regular season wrapped and later initiated a class… [+1439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and Adam Renton, CNN", "title": "Day 3 of the 2022 Beijing Winter Olympics", "description": "The Beijing 2022 Winter Olympics continue. Follow here for the latest news, results and updates.", "url": "https://www.cnn.com/world/live-news/beijing-winter-olympics-02-07-22-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204060019-birds-nest-beijing-02042022-super-tease.jpg", "publishedAt": "2022-02-07T01:02:12Z", "content": "Saudi Arabia's Crown Prince Mohammed bin Salman did not attend the Beijing Winter Olympics opening ceremony on Friday despite being on China's official list of attendees. \r\nInstead, the Saudi delegat… [+1085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd", "title": "President Biden to visit Israel 'later this year,' White House says", "description": "President Joe Biden will visit Israel \"later this year\" after Israeli Prime Minister Naftali Bennett invited him to the country, according to a readout of a call between the two on Sunday released by the White House.", "url": "https://www.cnn.com/2022/02/06/politics/biden-israel-visit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206171651-biden-bennett-file-super-tease.jpg", "publishedAt": "2022-02-06T23:28:18Z", "content": "(CNN)President Joe Biden will visit Israel \"later this year\" after Israeli Prime Minister Naftali Bennett invited him to the country, according to a readout of a call between the two on Sunday releas… [+996 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, Aaron Pellish and Ali Main, CNN", "title": "Manchin and Murkowski signal optimism on Electoral Count Act reform", "description": "Democratic Sen. Joe Manchin and Republican Sen. Lisa Murkowski on Sunday signaled optimism about their work to reform the Electoral Count Act, with Manchin going so far as to say it will \"absolutely\" pass, during a rare bipartisan interview on CNN.", "url": "https://www.cnn.com/2022/02/06/politics/manchin-murkowski-electoral-count-act-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206155920-manchin-murkowski-electoral-count-act-cnntv-super-tease.jpg", "publishedAt": "2022-02-06T23:27:37Z", "content": "Washington (CNN)Democratic Sen. Joe Manchin and Republican Sen. Lisa Murkowski on Sunday signaled optimism about their work to reform the Electoral Count Act, with Manchin going so far as to say it w… [+3482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Dean Obeidallah", "title": "If a passenger misbehaves, put them on a no-fly list", "description": "If we want to make air travel safe for all of us, from passengers to the flight crew, it's time to step up the punishment for unruly passengers, writes Dean Obeidallah.", "url": "https://www.cnn.com/2022/02/06/opinions/unruly-passengers-no-fly-list-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211103190707-faa-unruly-passengers-doj-super-tease.jpg", "publishedAt": "2022-02-06T23:10:55Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson, CNN", "title": "Senegal beats Egypt to win Africa Cup of Nations trophy", "description": "Senegal defeated Egypt in the Africa Cup of Nations championship match on Sunday, winning the continental championship for the first time on penalty kicks at Olembe Stadium in Yaoundé, Cameroon.", "url": "https://www.cnn.com/2022/02/06/football/senegal-africa-cup-of-nations-egypt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206162401-01-senegal-win-afcon-super-tease.jpg", "publishedAt": "2022-02-06T22:40:58Z", "content": "(CNN)Senegal defeated Egypt in the Africa Cup of Nations championship match on Sunday, winning the continental championship for the first time on penalty kicks at Olembe Stadium in Yaoundé, Cameroon.… [+1130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Awkwafina issues statement addressing accusations that she has used a 'blaccent'", "description": "The comedian and actress Awkwafina issued a lengthy Twitter statement Saturday addressing criticism in the press and on social media that she has used a \"blaccent,\" or Black accent, and elements of African American language and mannerisms in her career.", "url": "https://www.cnn.com/2022/02/06/entertainment/awkwafina-blaccent/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206123645-awkwafina-2021-file-restricted-super-tease.jpg", "publishedAt": "2022-02-06T21:48:19Z", "content": "(CNN)The comedian and actress Awkwafina issued a lengthy Twitter statement Saturday addressing criticism in the press and on social media that she has used a \"blaccent,\" or Black accent, and elements… [+3925 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Edward-Isaac Dovere, CNN", "title": "The nation's top health official has been a background player for much of his tenure. He says that's about to change.", "description": "Stung by accusations that he's been absent during a once-in-a-century public health crisis, Xavier Becerra -- the country's top health official -- tells CNN he's looking to step into a bigger public role as part of a reset a year into dealing with the dominan…", "url": "https://www.cnn.com/2022/02/06/politics/xavier-becerra-reset-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220110160959-xavier-becerra-file-120121-super-tease.jpg", "publishedAt": "2022-02-06T21:19:09Z", "content": "(CNN)Stung by accusations that he's been absent during a once-in-a-century public health crisis, Xavier Becerra -- the country's top health official -- tells CNN he's looking to step into a bigger pu… [+14627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Pence's baby step away from Trump doesn't go far enough", "description": "Former Vice President Mike Pence, who has tried to distance himself from his ex-boss Donald Trump before, is still trying to get credit for doing the bare minimum when it comes to speaking out against the former President, writes Michael D'Antonio.", "url": "https://www.cnn.com/2022/02/06/opinions/mike-pence-donald-trump-drama-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211006090839-pence-and-trump-super-tease.jpg", "publishedAt": "2022-02-06T21:06:42Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+4000 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tina Burnside, CNN", "title": "US Coast Guard working to rescue 20 people trapped on floating ice on Lake Erie", "description": "A rescue operation is underway for 20 people trapped on ice near Catawba Island, on Lake Erie, according to a tweet from the US Coast Guard's 9th District.", "url": "https://www.cnn.com/2022/02/06/us/lake-erie-rescue-catawba-island/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2022-02-06T20:18:24Z", "content": "(CNN)A rescue operation is underway for 20 people trapped on ice near Catawba Island, on Lake Erie, according to a tweet from the US Coast Guard's 9th District. \r\nThe Coast Guard said a sheet of floa… [+305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Zurawik: 'The country is really drowning' in disinformation - CNN Video", "description": "\"I think the Biden administration thought that just because they weren't Trump, they were going to get some sort of free ride, and it's outrageous,\" David Zurawik says. Claire Atkinson also comments on media news of the week.", "url": "https://www.cnn.com/videos/business/2022/02/06/zurawik-the-country-is-really-drowning-in-disinformation.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206133500-rs-b-block-1-claire-and-david-super-tease.jpg", "publishedAt": "2022-02-06T20:05:32Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Claire Colbert and Claudia Dominguez, CNN", "title": "Texas man suspected of killing 4 people, including a child, before taking his own life, police say", "description": "Police in Corsicana, Texas, say 41-year-old Kevin Milazzo is suspected of killing several members of his own family early Saturday morning, including a 4-year-old child, and later taking his own life.", "url": "https://www.cnn.com/2022/02/06/us/texas-family-members-killed-kevin-milazzo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206110713-texas-man-kills-four-family-members-0206-super-tease.jpg", "publishedAt": "2022-02-06T19:27:06Z", "content": "(CNN)A 41-year-old man is suspected of killing four people including a 4-year-old child, authorities in Corsicana, Texas, said.\r\nThree other people were wounded in the shootings, which happened at tw… [+1839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson, CNN", "title": "A slot machine in Las Vegas malfunctioned and didn't tell a tourist they won. Now the gaming board is tracking them down", "description": "A tourist in Las Vegas hit the jackpot on a slot machine last month, but he was never informed due to a malfunction in the machine, according to gaming officials.", "url": "https://www.cnn.com/2022/02/06/us/missed-jackpot-malfunction-casino-game-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206123808-treasure-island-las-vegas-file-super-tease.jpg", "publishedAt": "2022-02-06T18:06:11Z", "content": "(CNN)A tourist in Las Vegas hit the jackpot on a slot machine last month, but he was never informed due to a malfunction in the machine, according to gaming officials. \r\nNow after an exhaustive searc… [+1721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, CNN", "title": "Pence's chief of staff says former VP rebuked Trump because it 'merited a response'", "description": "Marc Short, the former chief of staff for Mike Pence, said Sunday that the former vice president chose to rebuke former President Donald Trump in remarks last week because Trump's comments about Pence's ability to overturn the 2020 presidential election \"meri…", "url": "https://www.cnn.com/2022/02/06/politics/marc-short-mike-pence-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110113201-marc-short-super-tease.jpg", "publishedAt": "2022-02-06T18:01:07Z", "content": "(CNN)Marc Short, the former chief of staff for Mike Pence, said Sunday that the former vice president chose to rebuke former President Donald Trump in remarks last week because Trump's comments about… [+5447 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Stelter: CNN is not going anywhere - CNN", "description": "<ol><li>Stelter: CNN is not going anywhere  CNN\r\n</li><li>CNN Anchors Press WarnerMedia CEO for Details on Jeff Zucker’s Resignation  The Wall Street Journal\r\n</li><li>Firing Jeff Zucker leaves CNN worse off in every way—and at the worst possible time  Yahoo …", "url": "https://www.cnn.com/videos/media/2022/02/06/cnn-future-jeff-zucker-brian-stelter-rs-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206122317-brian-stelter-02-06-2022-super-tease.jpg", "publishedAt": "2022-02-06T17:39:46Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Eight killed in two days after third deadly avalanche hits Austria", "description": "One person was killed and four others injured in an avalanche in western Austria on Saturday, police said, a day after two other avalanches killed seven skiers as heavy snowfall followed by warmer weather made for unusually dangerous conditions.", "url": "https://www.cnn.com/2022/02/06/europe/austria-deadly-avalanches-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206095147-01-avalanche-austria-0204-super-tease.jpg", "publishedAt": "2022-02-06T15:51:45Z", "content": "(Reuters)One person was killed and four others injured in an avalanche in western Austria on Saturday, police said, a day after two other avalanches killed seven skiers as heavy snowfall followed by … [+1194 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "'We will be there to protect them': Biden official vows protection of US athletes in Beijing for Winter Olympics", "description": "The US government will protect American athletes participating in the Winter Olympic Games in Beijing and their freedom of speech, US Ambassador to the United Nations Linda Thomas-Greenfield affirmed on Sunday.", "url": "https://www.cnn.com/2022/02/06/politics/linda-thomas-greenfield-us-athletes-china-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206095952-linda-thomas-greenfield-sotu-0206-super-tease.jpg", "publishedAt": "2022-02-06T15:18:13Z", "content": "(CNN)The US government will protect American athletes participating in the Winter Olympic Games in Beijing and their freedom of speech, US Ambassador to the United Nations Linda Thomas-Greenfield aff… [+873 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Surfing great Kelly Slater wins Billabong Pro Pipeline days before his 50th birthday", "description": "Just days shy of his 50th birthday, legendary pro surfer Kelly Slater won the Billabong Pro Pipeline in Hawaii on Saturday against the son of a former rival.", "url": "https://www.cnn.com/2022/02/06/sport/kelly-slater-surfing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206094036-01-kelly-slater-billabong-pro-pipeline-super-tease.jpg", "publishedAt": "2022-02-06T15:01:45Z", "content": "(CNN)Just days shy of his 50th birthday, legendary pro surfer Kelly Slater won the Billabong Pro Pipeline in Hawaii on Saturday against the son of a former rival.\r\nThe final of the Pipeline pitted Sl… [+1741 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Zoi Sadowski-Synnott: Kiwi is taking snowboarding 'to the next level' as 20-year-old wins gold", "description": "Zoi Sadowski-Synnott wasn't even born when New Zealand ended its 40-year wait for a Winter Olympics medal in 1992. On Sunday, she soared through the air at Beijing's Genting Snow Park to claim her country's first ever gold at a Winter Games.", "url": "https://www.cnn.com/2022/02/06/sport/sadowski-synnott-new-zealand-gold-winter-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206125029-zoi-sadowski-synnott-super-tease.jpg", "publishedAt": "2022-02-06T14:00:53Z", "content": "(CNN)Zoi Sadowski-Synnott wasn't even born when New Zealand ended its 40-year wait for a Winter Olympics medal in 1992. On Sunday, she soared through the air at Beijing's Genting Snow Park to claim h… [+3599 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "Start your week smart: Ukraine, Queen Elizabeth II, Covid, Spotify, Lata Mangeshkar", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2022/02/06/us/five-things-february-6-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220131151010-04-ukraine-russia-training-cnnphotos-super-tease.jpg", "publishedAt": "2022-02-06T13:45:03Z", "content": "By Alexandra Meeks, CNN\r\nUpdated 8:45 AM ET, Sun February 6, 2022\r\nShould unruly airplane passengers be placed on a \"no-fly\" list? The CEO of one of the largest airlines in the US is asking the Justi… [+5396 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Hannah Ryan and Arnaud Siad, CNN", "title": "New Belgian passports celebrate country's comic strip history", "description": "Most passports tend to be relatively uniform in design. They're often burgundy, black, or blue in color and they might encompass a small version of the symbol of a nation. But that won't be the case for Belgians come February 7 -- the country will now issue p…", "url": "https://www.cnn.com/style/article/belgian-passports-tintin-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206074940-adventures-of-tintin-comics-restricted-super-tease.jpg", "publishedAt": "2022-02-06T13:41:03Z", "content": "artsPublished 6th February 2022\r\nMost passports tend to be relatively uniform in design. They're often burgundy, black, or blue in color and they might encompass a small version of the symbol of a na… [+2508 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Why there's no need to fear a bear market", "description": "Stocks tumbled sharply in January and the market has remained choppy in February. There are worries globally about earnings, inflation, interest rates and Omicron. But some market experts think investors shouldn't be too concerned.", "url": "https://www.cnn.com/2022/02/06/investing/stocks-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203082508-nyse-0201-super-tease.jpg", "publishedAt": "2022-02-06T13:09:49Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nNew York (CNN Business)Stocks tumbled sharply in January and the mar… [+4643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Galant, CNN", "title": "Opinion: The Olympic Truce may be doomed", "description": "On January 28, UN Secretary-General António Guterres asked nations around the world to lay down their weapons and observe an Olympic Truce from seven days before the Beijing Games until seven days after the end of the Paralympic Games. \"Through the power of s…", "url": "https://www.cnn.com/2022/02/06/opinions/olympics-overshadowed-by-war-threat-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204120110-01-winter-olympics-questions-answered-super-tease.jpg", "publishedAt": "2022-02-06T13:00:45Z", "content": "Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)On January 28, UN Secretary-General Antón… [+17044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva McKend, CNN", "title": "What Shalanda Young's ascension means to Black staffers on Capitol Hill", "description": "In the hours leading up to Shalanda Young's Senate confirmation hearing to be deputy director of the Office of Management and Budget, emails circulated among Black staffers on Capitol Hill.", "url": "https://www.cnn.com/2022/02/06/politics/shalanda-young-capitol-hill-black-staffers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204130025-shalanda-young-0201-super-tease.jpg", "publishedAt": "2022-02-06T13:00:10Z", "content": "(CNN)In the hours leading up to Shalanda Young's Senate confirmation hearing to be deputy director of the Office of Management and Budget, emails circulated among Black staffers on Capitol Hill.\r\n\"Le… [+8195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "US-born figure skater Zhu Yi under attack after fall on Olympic debut for China", "description": "Representing China, California-born figure skater Zhu Yi is facing a firestorm of attack on Chinese social media after she fell flat on the ice and finished last in a women's short program team event Sunday.", "url": "https://www.cnn.com/2022/02/06/sport/us-born-figure-skater-beverly-zhu-yi-china-olympic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205224028-china-zhu-yi-0206-restricted-super-tease.jpg", "publishedAt": "2022-02-06T12:38:04Z", "content": "Beijing (CNN)Making her Olympic debut for Team China, California-born figure skater Zhu Yi was eager to prove herself to the Chinese pubic.\r\nInstead, the 19-year-old is facing a firestorm on Chinese … [+3164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, Lauren Said-Moorhouse and Niamh Kennedy, CNN", "title": "Prince Charles leads tributes to his mother, the Queen, on her Platinum Jubilee", "description": "Britain's Prince Charles has paid tribute to his mother, Queen Elizabeth II, as she marks her 70th anniversary on the throne on Sunday, saying her devotion continues to inspire with each passing year.", "url": "https://www.cnn.com/2022/02/06/uk/queen-platinum-jubilee-tributes-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206071635-queen-elizabeth-platinum-jubilee-0206-super-tease.jpg", "publishedAt": "2022-02-06T12:34:46Z", "content": "London (CNN)Britain's Prince Charles has paid tribute to his mother, Queen Elizabeth II, as she marks her 70th anniversary on the throne on Sunday, saying her devotion continues to inspire with each … [+4190 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, CNN", "title": "New satellite images show advanced Russian military deployments in Belarus", "description": "New satellite images released by a US-based technology company appear to show that Russia's military has advanced deployments at several locations in Belarus, a move likely to concern Ukraine and NATO amid fears that the Kremlin is planning an incursion into …", "url": "https://www.cnn.com/2022/02/06/europe/russia-military-images-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206044947-06-russia-troop-movement-satellite-super-tease.jpg", "publishedAt": "2022-02-06T12:30:13Z", "content": "Kyiv, Ukraine (CNN)New satellite images released by a US-based technology company appear to show that Russia's military has advanced deployments at several locations in Belarus, a move likely to conc… [+3959 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliott C. McLaughlin, CNN", "title": "State prosecutors mostly avoided race in trying Ahmaud Arbery's killers. Feds won't have that option", "description": "Georgia prosecutors proved Ahmaud Arbery's killers guilty of murder. Now, lawyers for the federal government will try to prove they chased down the 25-year-old jogger because he was Black.", "url": "https://www.cnn.com/2022/02/06/us/ahmaud-arbery-killers-hate-crimes-trial-walkup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211115120233-02-mcmichael-bryan-mugshots-split-super-tease.jpg", "publishedAt": "2022-02-06T10:01:43Z", "content": "(CNN)Georgia prosecutors proved Ahmaud Arbery's killers guilty of murder. Now, lawyers for the federal government will try to prove they chased down the 25-year-old jogger because he was Black. \r\nTha… [+14611 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "13 states have backed the Mexican government's lawsuit against a group of US gun manufacturers", "description": "The attorneys general of 13 states and Washington DC this week expressed support for a federal lawsuit by the Mexican government that accuses a group of American gun manufacturers of facilitating the trafficking of weapons to criminals in Mexico, fueling gun …", "url": "https://www.cnn.com/2022/02/06/us/mexico-lawsuit-us-gun-manufacturers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804152500-mexico-gunmaker-lawsuit-super-tease.jpg", "publishedAt": "2022-02-06T09:02:24Z", "content": "(CNN)The attorneys general of 13 states and Washington DC this week expressed support for a federal lawsuit by the Mexican government that accuses a group of American gun manufacturers of facilitatin… [+7727 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "Colombia struck a peace deal with guerrilla groups years ago. So why is violence surging?", "description": "This year kicked off with a violent start on the Colombia-Venezuela border, where dissident militant factions have been competing for territorial control of lucrative drug routes that connect the South American country to the US and Europe. At least 23 people…", "url": "https://www.cnn.com/2022/02/06/americas/colombia-venezuela-border-violence-explainer-intl-cmd-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203135314-02-colombia-arauca-national-highway-super-tease.jpg", "publishedAt": "2022-02-06T08:35:14Z", "content": "Bogota, Colombia (CNN)This year kicked off with a violent start on the Colombia-Venezuela border, where dissident militant factions have been competing for territorial control of lucrative drug route… [+7386 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "This is the space graveyard where the International Space Station will be buried", "description": "Spacefaring nations have been dumping their junk in the area around the Pacific Ocean's Point Nemo, the most remote place on Earth, since the 1970s.", "url": "https://www.cnn.com/2022/02/06/world/point-nemo-international-space-station-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220127194643-01-international-space-station-file-2021-super-tease.jpg", "publishedAt": "2022-02-06T08:01:30Z", "content": "(CNN)Three thousand miles off the coast of New Zealand and 2,000 miles north of Antarctica, Point Nemo is so far from land that the closest humans are often the astronauts on board the International … [+6204 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Photographs by Timothy Fadek/Redux for CNN", "title": "In photos: How war has devastated Ukraine's coal industry", "description": "Ukraine was once Europe's third-largest coal producer. But production has dropped dramatically since 2014, when fighting broke out with pro-Russian separatists in the eastern Donbas region.", "url": "https://www.cnn.com/2022/02/05/europe/gallery/ukraine-coal-miners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205220941-01-ukraine-coal-mine-fadek-super-tease.jpg", "publishedAt": "2022-02-06T05:02:47Z", "content": "Miners wait for an elevator to take them below ground at the start of their shift in Vuhledar, Ukraine.\r\nPhotographs by Timothy Fadek/Redux for CNN\r\nUpdated 12:02 AM ET, Sun February 6, 2022\r\nMiners … [+1623 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Swati Gupta, CNN", "title": "India mourns singer Lata Mangeshkar, dead at 92", "description": "Lata Mangeshkar, the \"nightingale of India\" who gave her voice to Indian movies for more than 70 years, died Sunday in Mumbai, according to Prime Minister Narendra Modi and local media reports. She was 92.", "url": "https://www.cnn.com/2022/02/06/india/lata-mangeshkar-india-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191114180109-lata-mangeshkar-02-super-tease.jpg", "publishedAt": "2022-02-06T05:02:14Z", "content": "New Delhi (CNN)Lata Mangeshkar, the \"nightingale of India\" who gave her voice to Indian movies for more than 70 years, died Sunday in Mumbai, according to Prime Minister Narendra Modi and local media… [+4282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "Crowds of demonstrators join rallies across Canada as Covid-19 trucker protests spread", "description": "From the western province of Alberta, moving east to Quebec City, and in cities and towns in between, thousands of Canadians have hit the streets in trucks, tractors, cars and on foot to protest the nation's Covid-19 restrictions.", "url": "https://www.cnn.com/2022/02/05/americas/canada-trucker-protest-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205191300-01-canada-protests-0205-super-tease.jpg", "publishedAt": "2022-02-06T01:58:12Z", "content": "(CNN)From the western province of Alberta, moving east to Quebec City, and in cities and towns in between, thousands of Canadians have hit the streets in trucks, tractors, cars and on foot to protest… [+2993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "A man is accused of breaking into Michael Bloomberg's ranch and kidnapping an employee", "description": "A Colorado man is accused of breaking into a ranch owned by billionaire Michael Bloomberg and kidnapping an employee, asking her about the former New York City mayor's daughters, according to an arrest warrant affidavit and a criminal complaint filed in feder…", "url": "https://www.cnn.com/2022/02/05/us/colorado-man-accused-break-into-michael-bloomberg-ranch-kidnap-worker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220205192703-michael-bloomberg-file-super-tease.jpg", "publishedAt": "2022-02-06T01:58:04Z", "content": "(CNN)A Colorado man is accused of breaking into a ranch owned by billionaire Michael Bloomberg and kidnapping an employee, asking her about the former New York City mayor's daughters, according to an… [+2318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a> and Adam Renton, CNN", "title": "Day 2 of the 2022 Beijing Winter Olympics", "description": "The Beijing 2022 Winter Olympics continue, with events such as luge, snowboarding and figure skating. Follow here for the latest news, results and updates.", "url": "https://www.cnn.com/world/live-news/beijing-winter-olympics-02-06-22-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204060019-birds-nest-beijing-02042022-super-tease.jpg", "publishedAt": "2022-02-06T00:16:00Z", "content": "Athletes that make the podium in Beijing will have more than just a medal to take home.\r\nAll medal-winning athletes will receive a special souvenir for their achievements featuring panda mascot Bing … [+727 chars]"}]}