{"status": "ok", "totalResults": 175, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "LGBTQ Pride lifeguard tower burns down in what that officials believe was an act of hate", "description": "The city of Long Beach, California, is working to rebuild a symbol of LGBTQ inclusion after it was destroyed in a fire that officials believe was an act of hate.", "url": "https://www.cnn.com/2021/03/26/us/lgbtq-pride-lifeguard-tower-burned-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326124757-01-lgbtq-pride-lifeguard-tower-burned-super-tease.jpg", "publishedAt": "2021-03-26T18:19:23Z", "content": "(CNN)The city of Long Beach, California, is working to rebuild a symbol of LGBTQ inclusion after it was destroyed in a fire that officials believe was an act of hate.\r\nThe Long Beach Fire Department … [+1373 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Santas, CNN", "title": "Strengthen your heart like a pro athlete", "description": "When it comes to strengthening your heart, here are three ways you can be as proactive as a pro athlete.", "url": "https://www.cnn.com/2021/03/26/health/strengthen-your-heart-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325173848-02-baseball-interval-training-restricted-super-tease.jpg", "publishedAt": "2021-03-26T18:08:26Z", "content": "(CNN)When you think of professional athletes training, you might have an image of impossibly grueling workouts that the average person could never get through. That isn't exactly accurate. The bigges… [+6717 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "Pelosi appoints first Black House sergeant-at-arms, William J. Walker", "description": "House Speaker Nancy Pelosi announced on Friday that she is appointing DC National Guard Major Gen. William J. Walker to be the House sergeant-at-arms, noting in the announcement that he will be the first Black American to serve in the role.", "url": "https://www.cnn.com/2021/03/26/politics/nancy-pelosi-sergeant-at-arms-pick-william-walker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303113456-01-major-general-william-j-walker-0303-super-tease.jpg", "publishedAt": "2021-03-26T18:00:26Z", "content": "(CNN)House Speaker Nancy Pelosi announced on Friday that she is appointing DC National Guard Major Gen. William J. Walker to be the House sergeant-at-arms, noting in the announcement that he will be … [+1212 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards", "title": "We tried Halo Top's new low-sugar, low-cal fruit pops, and here's what we thought", "description": "With low sugar and just around 50 calories a pop, Halo Top's fruit pops could be your new favorite summer treat.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/halo-top-fruit-pops-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210317123301-halotopfruitlead-super-169.jpg", "publishedAt": "2021-03-26T18:00:25Z", "content": "Halo Top, everyones favorite low-calorie ice cream, is back with something new to cool down with this summer: Fruit pops!\r\nThe pops come in five flavors strawberry, mango, coconut, lime, pineapple ru… [+3614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Steve Rushin", "title": "This March Madness, women are on top of their game", "description": "It's an annual rite of spring, these spot-the-difference inequities in the men's and women's NCAA basketball tournaments, says Steve Rushin. He says one heartening development this time around is that men are also calling out the nonsense, including NBA stars…", "url": "https://www.cnn.com/2021/03/26/opinions/ncaa-gender-disparity-march-madness-rushin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326132354-01-sedona-prince-ncaa-basketball-0324-super-tease.jpg", "publishedAt": "2021-03-26T17:56:41Z", "content": "Steve Rushin is a veteran sportswriter for Sports Illustrated and other publications. He is the author of six books including \"Sting-Ray Afternoons\" and \"Nights in White Castle.\" He is also the co-ho… [+6534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, Mostafa Salem and Rachel Janfaza, CNN", "title": "US Navy plans to send assessment team to Suez Canal to assist with stuck container ship", "description": "The US Navy in the Middle East plans to send an assessment team of dredging experts to the Suez Canal as soon as Saturday to advise local authorities attempting to free the gigantic container ship which has been stuck there since Tuesday, according to two def…", "url": "https://www.cnn.com/2021/03/26/politics/us-navy-suez-assistance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324085406-01-suez-canal-container-ship-0324-super-tease.jpg", "publishedAt": "2021-03-26T17:28:59Z", "content": "(CNN)The US Navy in the Middle East plans to send an assessment team of dredging experts to the Suez Canal as soon as Saturday to advise local authorities attempting to free the gigantic container sh… [+2428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Krystin Arneson", "title": "Spring blooms from Urban Stems are 20% off with this exclusive discount", "description": "Nothing says spring like fresh flowers, and Urban Stems is delivering arrangements around the nation just in time for the season's slate of holidays. And now, you can get an exclusive 20% off your purchase between now and May 10.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/urban-stems-sale-exclusive/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326132044-urban-stems-lead-super-169.jpg", "publishedAt": "2021-03-26T17:28:01Z", "content": "Nothing says spring like fresh flowers, and Urban Stems is delivering arrangements around the nation just in time for the seasons slate of holidays. Whether youre ordering for Easter, Mothers Day, Pa… [+3378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "'I'm always chased away and victimized,' says shopper told his traditional clothing is 'indecent' in South Africa mall", "description": "A South African cultural activist says he is still reeling from the humiliation meted out to him for donning traditional attire to a shopping mall in a suburb of Johannesburg.", "url": "https://www.cnn.com/2021/03/26/africa/south-africa-ndebele-clothing-called-indecent-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325115631-south-africa-ndebele-clothing-called-idecent-intl-super-tease.jpg", "publishedAt": "2021-03-26T16:51:25Z", "content": "Saddest reality in Africa, I was subjected to inside the @Clicks_SA store at The Boulders Shopping Center. By the center manager, who said it was his shopping complex. I was told that I'm wearing ina… [+159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kai Burkhardt", "title": "The best beard trimmers of 2021", "description": "We went hands-on with some of the industry's top-rated and best-reviewed clippers and see which ones truly stand out. After dozens of trims, careful consideration and plenty of testing , we found three beard trimmers that — ahem — made the cut.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/best-beard-trimmers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200619091249-underscored-best-beard-trimmer-winner-new-super-169.jpg", "publishedAt": "2021-03-26T16:32:30Z", "content": "If your beard has grown to Santa Claus-, Gandalf- or even Dumbledore-esque lengths recently, its high time for a trim. And for that, youll need a quality beard trimmer.\r\nBut finding the perfect beard… [+17994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "About a tenth of global trade passes through the Suez Canal, and it could be facing a weeks-long blockage", "description": "Since it was completed in 1869, the Suez Canal has been one of the world's most important bodies of water; a portal between East and West that has been controlled by multiple countries, threatened to ignite war, and become a bedrock of the global economy.", "url": "https://www.cnn.com/2021/03/26/africa/suez-canal-importance-explainer-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325111828-01-satellite-image-suez-canal-container-ship-super-tease.jpg", "publishedAt": "2021-03-26T16:32:16Z", "content": "(CNN)Since it was completed in 1869, the Suez Canal has been one of the world's most important bodies of water; a portal between East and West that has been controlled by multiple countries, threaten… [+5672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Lewis Hamilton 'spoken to Bahrain officials' about human rights issues ahead of F1 race in country", "description": "Seven-time Formula One world champion Lewis Hamilton has said he's \"spoken to Bahrain officials\" about alleged human rights abuses in the country ahead of the Grand Prix in the country.", "url": "https://edition.cnn.com/2021/03/26/motorsport/lewis-hamilton-bahrain-f1-human-rights-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326062333-lewis-hamilton-bahrain-0325-super-tease.jpg", "publishedAt": "2021-03-26T16:29:46Z", "content": "(CNN)Seven-time Formula One world champion Lewis Hamilton has said he's \"spoken to Bahrain officials\" about alleged human rights abuses in the country ahead of the Grand Prix in the country. \r\nComing… [+4684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Park", "title": "Explore your passion for sneakers — let eBay take care of the paperwork", "description": "Sneakerheads can be sure to get what they pay for with the reliability of eBay's Authentication Guarantee.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/sneaker-collector-ebay-authenticity-guarantee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326121145-ebay-sneakers-paid-lead-super-169.jpg", "publishedAt": "2021-03-26T16:28:18Z", "content": "Sneakerheads are arguably the most informed and savvy collectors in the world right now, able to sniff out secret midnight sales in the most unlikely and exclusive places as if they possess ESP. They… [+2888 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Romney receives JFK 'Profile in Courage' award for impeachment vote", "description": null, "url": "https://www.cnn.com/2021/03/26/politics/mitt-romney-receives-jfk-profile-in-courage-award/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326120658-mitt-romney-0922-file-restricted-super-tease.jpg", "publishedAt": "2021-03-26T16:25:32Z", "content": "Washington (CNN)Republican Sen. Mitt Romney is this year's recipient of the John F. Kennedy Profile in Courage award for being the lone GOP senator to stand up to then-President Donald Trump in his f… [+3267 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Fiona Tapp", "title": "All the gear you need for a great outdoor staycation", "description": "Even as lockdowns lift and restrictions ease, you probably shouldn't travel out of province for a while yet. So, why not look right outside your own front door and enjoy an adventure staycation in the great outdoors?", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/canada-outdoor-gear/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325145626-ca-lead-super-169.jpg", "publishedAt": "2021-03-26T16:13:27Z", "content": "Most Canadians have been following Prime Minister Justin Trudeaus instructions not to travel and therefore have had to forego their usual trips down south for a little sun and relaxation during the l… [+12007 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "China slaps duties of up to 218% on Australian wine for 5 years", "description": "China is slapping massive duties on wine from Australia for the next five years, a move that threatens to deprive the country's winemakers of their top export market and escalate a trade dispute.", "url": "https://www.cnn.com/2021/03/26/business/china-australia-wine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326123846-china-australian-wines-file-super-tease.jpg", "publishedAt": "2021-03-26T16:04:37Z", "content": "London (CNN Business)China is slapping massive duties on wine from Australia for the next five years, a move that threatens to deprive the country's winemakers of their top export market and escalate… [+1479 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackson Dill and Monica Garrett, CNN", "title": "More tornadoes are possible in the South this weekend", "description": "Severe weather season is ramping up as the chance for more strong storms threatens parts of the South this weekend, on the heels of Thursday's deadly tornado outbreak.", "url": "https://www.cnn.com/2021/03/26/weather/tornado-forecast-weekend-severe-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326093623-severe-outlooks-card-super-tease.jpg", "publishedAt": "2021-03-26T16:00:33Z", "content": "Today will be dry and mild, but more storms coming Saturday and Saturday night. We have a risk for damaging winds, large hail, and flooding. Isolated tornadoes possible, mainly west of I-65. Be sure … [+145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "The best sales to shop this weekend: Adidas, Macy's, Instant Pot and more", "description": "This weekend, you'll find a deal on Instant Pots at Walmart, a discounted Loftie alarm clock and savings on final sale styles from Adidas. All that and more below.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326110244-0326dealslead-super-169.jpg", "publishedAt": "2021-03-26T15:49:39Z", "content": "This weekend, youll find a deal on Instant Pots at Walmart, a discounted Loftie alarm clock and savings on final sale styles from Adidas. All that and more below.\r\nTheres never been a better time to … [+8092 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Gayle Manchin nominated to be federal co-chair of Appalachian Regional Commission", "description": "Gayle Manchin, an educator and wife of Democratic Sen. Joe Manchin of West Virginia, has been nominated to serve as the federal co-chair of the Appalachian Regional Commission, the White House said in a news release Friday.", "url": "https://www.cnn.com/2021/03/26/politics/gayle-manchin-appalachian-regional-commission/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326142919-joe-and-gayle-manchin-file-2019-super-tease.jpg", "publishedAt": "2021-03-26T14:55:20Z", "content": "(CNN)Gayle Manchin, an educator and wife of Democratic Sen. Joe Manchin of West Virginia, has been nominated to serve as the federal co-chair of the Appalachian Regional Commission, the White House s… [+1536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Catherine Powell", "title": "A year on, the 'Color of Covid' still matters", "description": "Catherine Powell writes that in addressing the linked health and economic crises, the Biden administration is tackling both the global Covid-19 pandemic and related pressing domestic challenges, and yet Biden can do more to combat our interconnected pandemics…", "url": "https://www.cnn.com/2021/03/26/opinions/color-of-covid-biden-administration-powell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210218153457-syringe-needle-in-arm-stock-super-tease.jpg", "publishedAt": "2021-03-26T14:37:55Z", "content": "Catherine Powell (@ProfCatherine) is a professor of law at Fordham University School of Law and adjunct senior fellow at the Council on Foreign Relations. The views expressed here belong to the autho… [+8302 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nora Neus, CNN", "title": "Hundreds of US families have been trying for a year to adopt children from China. They're still waiting", "description": "On a gorgeous spring afternoon, Aimee and Stephen Welch are playing with their five kids in their sun-drenched New Jersey backyard, taking a break from the grind of virtual schooling and working from home.", "url": "https://www.cnn.com/2021/03/26/us/china-us-adoption-families-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323162648-01-welch-chinese-adoption-super-tease.jpg", "publishedAt": "2021-03-26T14:26:18Z", "content": "Basking Ridge, New Jersey (CNN)On a gorgeous spring afternoon, Aimee and Stephen Welch are playing with their five kids in their sun-drenched New Jersey backyard, taking a break from the grind of vir… [+6152 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sandy Tolan", "title": "A new season: Sitting at a baseball game, I saw the promise of a post-Covid life", "description": "Sandy Tolan writes that most years his pilgrimage to spring training is about the eternal hopefulness of a new season when all teams are tied for first place: A gifted top draft choice is making his debut, an out of shape slugger struggles to make the team or…", "url": "https://www.cnn.com/2021/03/26/opinions/new-season-spring-training-covid-life-tolan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325141429-sandy-tolan-baseball-op-ed-super-tease.jpg", "publishedAt": "2021-03-26T14:15:34Z", "content": "Sandy Tolan (@sandy_tolan) is the author of three books, including \"Me and Hank,\" about his boyhood hero Hank Aaron, and \"The Lemon Tree,\" now out in a children's edition. He is a professor at the An… [+5743 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "An Instacart shopper saw an AR-15 in an Atlanta supermarket bathroom. Police arrested a man with 6 guns", "description": "An Instacart shopper who entered an Atlanta supermarket bathroom this week told police he saw an AR-15 style rifle and heard what he believed was the sound of someone loading guns in a bathroom stall.", "url": "https://www.cnn.com/2021/03/26/us/atlanta-guns-supermarket-witness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326090643-rico-marley-guns-super-tease.jpg", "publishedAt": "2021-03-26T14:11:56Z", "content": "(CNN)An Instacart shopper who entered an Atlanta supermarket bathroom this week told police he saw an AR-15 style rifle and heard what he believed was the sound of someone loading guns in a bathroom … [+2743 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jason Cipriani", "title": "The OnePlus 9 and 9 Pro offer an excellent Android experience for less", "description": "The latest batch of phones from OnePlus are official. The 9 and 9 Pro were announced earlier this week, after OnePlus founder and CEO Pete Lau spent the days leading up to the announcement slowly leaking and detailing the features of both phones.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/oneplus-9-pro-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325182942-oneplus-9-9-pro----6-super-169.jpeg", "publishedAt": "2021-03-26T14:02:52Z", "content": "The latest batch of phones from OnePlus are official. The 9 and 9 Pro were announced earlier this week, after OnePlus founder and CEO Pete Lau spent the days leading up to the announcement slowly lea… [+17808 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards", "title": "18 beautiful flower arrangements to send this Easter", "description": "Whether you can be with them to celebrate or not, a gorgeous bouquet of lilies, tulips, roses and more can definitely make the day feel special.", "url": "https://www.cnn.com/2021/03/26/cnn-underscored/easter-flowers-for-delivery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210317110145-easterflowerslead-super-169.jpg", "publishedAt": "2021-03-26T14:02:05Z", "content": "With the arrival of spring, we see the Easter holiday on the horizon, and what better way to celebrate than a bright and beautiful arrangement?\r\nWe know its easy to be overwhelmed with all the choice… [+2791 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daryl Brown, CNN", "title": "'Don't wait till it's perfect -- just do it': This Ghanaian CEO is pioneering her own path", "description": "Jetstream Africa CEO and co-founder Miishe Addy shares her experiences and lessons learned as a female entrepreneur in Ghana, which consistently ranks near the top for the most women-owned businesses in the world.", "url": "https://www.cnn.com/2021/03/26/world/miishe-addy-jetstream-africa-female-entrepreneur-ghana-spc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325134900-07-miishe-addy-ceo-jetstream-africa-super-tease.jpg", "publishedAt": "2021-03-26T13:46:01Z", "content": "(CNN)Imagine for a moment that time travel is possible. What would you go back and tell your younger self? Perhaps it would be to take more risks, or to not let others steal your joy. For Miishe Addy… [+6276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackson Dill and Brandon Miller, CNN", "title": "Sea-level rise is accelerating to its highest levels in at least 2,000 years across the Northeast, including New York City, study says", "description": "Along a stretch of the East Coast that includes New York City, sea-level rise has increased at its fastest rate in the prior 100 years compared to the past 2,000 years, according to a new study led by Rutgers University.", "url": "https://www.cnn.com/2021/03/26/weather/sea-level-rise-accelerating-east-coast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/131025221652-05-sandy-before-after-story-top.jpg", "publishedAt": "2021-03-26T13:41:59Z", "content": "(CNN)Along a stretch of the East Coast that includes New York City, sea-level rise has increased at its fastest rate in the prior 100 years compared to the past 2,000 years, according to a new study … [+5865 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackson Dill and Brandon Miller, CNN", "title": "Study shows historic sea-level rise along stretch of US East Coast", "description": "Along a stretch of the East Coast that includes New York City, sea-level rise has increased at its fastest rate in the prior 100 years compared to the past 2,000 years, according to a new study led by Rutgers University.", "url": "https://www.cnn.com/2021/03/26/weather/sea-level-rise-accelerating-east-coast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/131025221652-05-sandy-before-after-story-top.jpg", "publishedAt": "2021-03-26T13:41:59Z", "content": "(CNN)Along a stretch of the East Coast that includes New York City, sea-level rise has increased at its fastest rate in the prior 100 years compared to the past 2,000 years, according to a new study … [+5865 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hoffman and Jasmine Wright, CNN", "title": "Second gentleman Doug Emhoff's first Passover at the White House brings host of changes to traditional celebration", "description": "There are very few firsts at a Passover Seder, the traditional holiday meal Jewish people have celebrated for centuries. But for second gentleman Doug Emhoff, this Passover is very different than any he has celebrated in the past.", "url": "https://www.cnn.com/2021/03/26/politics/passover-doug-emhoff-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201110145840-harris-emhoff-0812-super-tease.jpg", "publishedAt": "2021-03-26T13:29:13Z", "content": "(CNN)There are very few firsts at a Passover Seder, the traditional holiday meal Jewish people have celebrated for centuries. But for second gentleman Doug Emhoff, this Passover is very different tha… [+4782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Francesco' presents a dutiful look at Pope Francis during a time of crises", "description": "Provided extensive access to Pope Francis, \"Francesco\" is essentially a valentine to his progressive policies and the role he has played in spurring the Catholic Church to address major crises, including the abuse scandal within.", "url": "https://www.cnn.com/2021/03/26/entertainment/francesco-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210322110211-francesco-pope-francis-super-tease.jpg", "publishedAt": "2021-03-26T13:23:48Z", "content": "(CNN)Provided extensive access to Pope Francis, \"Francesco\" is essentially a valentine to his progressive policies and the role he has played in spurring the Catholic Church to address major crises, … [+2411 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Irregulars' spins out Sherlock Holmes' sidekicks with an 'X-Files' twist", "description": "There have been so many variations on Sherlock Holmes that the idea of another -- especially built around teenagers -- didn't provoke much enthusiasm going in. But \"The Irregulars\" proves unexpectedly fun, in what amounts to a Victorian version of \"The X-File…", "url": "https://www.cnn.com/2021/03/26/entertainment/the-irregulars-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210322101839-the-irregulars-netflix-super-tease.jpg", "publishedAt": "2021-03-26T13:22:18Z", "content": "(CNN)There have been so many variations on Sherlock Holmes that the idea of another -- especially built around teenagers -- didn't provoke much enthusiasm going in. But \"The Irregulars\" proves unexpe… [+2680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Tina' tells Tina Turner's story, with a tribute that keeps on turning", "description": "\"Tina\" is that rare documentary that leaves you craving an encore, as if two hours weren't quite enough to do Tina Turner's life and career justice. Weaving in a new interview with the 81-year-old icon, the footage then and now underlines the impression of Tu…", "url": "https://www.cnn.com/2021/03/26/entertainment/tina-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210322104451-tina-turner-hbo-super-tease.jpg", "publishedAt": "2021-03-26T13:20:38Z", "content": "(CNN)\"Tina\" is that rare documentary that leaves you craving an encore, as if two hours weren't quite enough to do Tina Turner's life and career justice. Weaving in a new interview with the 81-year-o… [+2587 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Veronica Stracqualursi, CNN", "title": "Trump tries to whitewash history by claiming his supporters were 'hugging and kissing' cops during Capitol riot", "description": "Former President Donald Trump on Thursday attempted to whitewash the history of the January 6 Capitol riot by pushing the false suggestion that his supporters were \"hugging and kissing\" police officers and posed \"zero threat\" despite widespread violence, inju…", "url": "https://www.cnn.com/2021/03/26/politics/donald-trump-january-6-rioters-arrests/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319215641-donald-trump-022821-super-169.jpg", "publishedAt": "2021-03-26T13:05:51Z", "content": "Former President Donald Trump on Thursday attempted to whitewash the history of the January 6 Capitol riot by pushing the false suggestion that his supporters were hugging and kissing police officers… [+3731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Daniel Bunn and Scott A. Hodge for CNN Business Perspectives", "title": "Why Janet Yellen is wrong on corporate tax rates", "description": "President Joe Biden said he hopes to have America nearly back to normal by July 4th. For that to happen, policymakers must continue to make progress on sparking a swift and sustainable economic recovery.", "url": "https://www.cnn.com/2021/03/26/perspectives/janet-yellen-minimum-global-tax-rate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210122141908-janet-yellen-0112-restricted-super-tease.jpg", "publishedAt": "2021-03-26T12:56:17Z", "content": "Daniel Bunn is vice president of global project of the Tax Foundation. Scott A. Hodge is president of the Tax Foundation. The opinions expressed in this commentary are their own.\r\nPresident Joe Biden… [+5313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "China boycotts are a warning to Western brands", "description": "Companies including H&M, Nike, Adidas and Burberry have been caught in the middle of a political firestorm in China — spooking investors that keep close tabs on a key market.", "url": "https://www.cnn.com/2021/03/26/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326095714-02-hm-beijing-0325-super-tease.jpg", "publishedAt": "2021-03-26T12:40:10Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)Companies including H&amp;M, Nike(NKE), Adidas(… [+6366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta, CNN Chief Medical Correspondent", "title": "Autopsy of a pandemic: 6 doctors at the center of the US Covid-19 response", "description": "This past January, just a few days after the inauguration of President Joe Biden, six of the doctors responsible for the previous administration's Covid-19 response agreed to sit down -- in strict confidence --  and talk with me about the events of the past y…", "url": "https://www.cnn.com/2021/03/26/health/covid-war-doctors-sanjay-gupta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325235413-covid-doctors-split-super-tease.jpg", "publishedAt": "2021-03-26T12:28:50Z", "content": "By Dr. Sanjay Gupta, CNN Chief Medical Correspondent\r\nUpdated 8:28 AM ET, Fri March 26, 2021\r\nWatch, \"COVID WAR: The Pandemic Doctors Speak Out,\" at 9 p.m. Sunday, March 28, only on CNN.\r\n (CNN)This … [+9118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "Covid-19 could be 'swallowed' into our bodies", "description": null, "url": "https://www.cnn.com/2021/03/26/world/coronavirus-newsletter-intl-03-26-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-03-26T12:17:24Z", "content": "A version of this story appeared in the March 26 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)Researchers say th… [+6187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Milestone Amazon union vote nears end, but the battle may just be beginning", "description": "One year to the day after workers first stepped inside a new Amazon warehouse in Bessemer, Alabama, a milestone union vote at the facility is set to come to an end.", "url": "https://www.cnn.com/2021/03/26/tech/amazon-bessemer-union/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210301171508-amazon-bessemer-al-solidarity-event-protest-seattle-0220-super-tease.jpg", "publishedAt": "2021-03-26T12:16:49Z", "content": "(CNN Business)One year to the day after workers first stepped inside a new Amazon warehouse in Bessemer, Alabama, a milestone union vote at the facility is set to come to an end.\r\nMonday is the final… [+9192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "Chinese celebrities rush to defend Beijing's Xinjiang policy by cutting ties with international brands", "description": "Due to China's tight restrictions on free speech, most of the country's stars have been outwardly apolitical by default. But as China embraces a new wave of apparent nationalism -- promoted by the ruling Communist Party and amplified by state media -- it seem…", "url": "https://www.cnn.com/style/article/chinese-celebrities-xj-cotton-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326095155-dilraba-dilmurat-file-restricted-super-tease.jpg", "publishedAt": "2021-03-26T11:55:02Z", "content": "Chinese celebrities are finding it increasingly difficult to stay out of politics. \r\nDue to China's tight restrictions on free speech, most of the country'sstars have been outwardly apolitical by def… [+7310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "This week was a turning point for Harry and Meghan", "description": "The couple have lined up commercial contracts, but can they deliver?", "url": "https://www.cnn.com/2021/03/26/uk/royal-news-newsletter-03-19-26-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325141121-meghan-harry-file-2020-restricted-super-tease.jpg", "publishedAt": "2021-03-26T11:54:25Z", "content": "A version of this story appeared in the March 26 edition of CNN's Royal News, a new weekly dispatch bringing you the inside track on the royal family, what they are up to in public and what's happeni… [+10329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bethlehem Feleke and Eliza Mackintosh, CNN", "title": "Ethiopian Prime Minister says Eritrea will withdraw troops from Tigray", "description": "Eritrea will withdraw its troops from Ethiopia, Ethiopian Prime Minister Abiy Ahmed said on Friday, days after acknowledging for the first time that Eritrean forces had entered Ethiopia's northern Tigray region during the country's five-month-old conflict.", "url": "https://www.cnn.com/2021/03/26/africa/tigray-ethiopia-eritrea-asmara-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326045342-wukro-tigray-0301-super-tease.jpg", "publishedAt": "2021-03-26T11:51:22Z", "content": "(CNN)Eritrea will withdraw its troops from Ethiopia, Ethiopian Prime Minister Abiy Ahmed said on Friday, days after acknowledging for the first time that Eritrean forces had entered Ethiopia's northe… [+2925 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "Global shipping was in chaos even before the Suez blockage", "description": "One of the world's most vital trade arteries has been blocked by a quarter-mile-long container ship, creating a traffic jam that has ensnared over 200 vessels and could take weeks to clear.", "url": "https://www.cnn.com/2021/03/26/business/global-shipping-supply-chains/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319174135-yangshan-port-china-0222-restricted-super-tease.jpg", "publishedAt": "2021-03-26T11:07:24Z", "content": "By Hanna Ziady, CNN Business\r\nUpdated 7:07 AM ET, Fri March 26, 2021\r\nOne of the world's most vital trade arteries has been blocked by a quarter-mile-long container ship, creating a traffic jam that … [+9723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Francesca Street, CNN. Illustration by Alberto Mier, CNN", "title": "The couple who fell in love at first sight on a Cunard cruise ship", "description": "On a New Year's Eve cruise in 1979, American passenger Marianna Pennucci fell for British ship photographer Robert Knowles. The couple said their farewells at the end of the voyage, but six weeks later Robert decided to fly to New York to find her.", "url": "https://www.cnn.com/travel/article/cunard-cruise-love-story-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325130314-20210325-chance-encounters-cunard-cruise-card-1-v2-super-tease.jpg", "publishedAt": "2021-03-26T10:56:38Z", "content": "(CNN) New Year's Eve 1979. Marianna Pennucci clinked glasses with the man sitting across from her. Together they toasted the new decade, which suddenly seemed golden with possibility. \r\nMarianna, a 3… [+11876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Elie Honig", "title": "One of the most important trials America has ever seen is about to start", "description": "Elie Honig writes that while there is no way to predict what the jury in the Derek Chauvin trial will decide, this uncertainty is even more pronounced in a case involving the police and race.", "url": "https://www.cnn.com/2021/03/26/opinions/derek-chauvin-trial-importance-honig/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311212921-05-week-in-photos-0312-super-tease.jpg", "publishedAt": "2021-03-26T10:45:30Z", "content": "Elie Honig is a CNN legal analyst and former federal and state prosecutor. The views expressed in this commentary are his own. Read more opinion on CNN. Watch Honig answer readers' questions on \"CNN … [+9056 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Roxanne Jones", "title": "Alexi McCammond isn't the story anymore. This is", "description": "Roxanne Jones says Alexi McCammond's exit from Teen Vogue shouldn't distract from the larger, glaring issues of race and inequality in media -- ones she has experienced personally after working nearly 25 years in publishing. White supremacy threatens us all. …", "url": "https://www.cnn.com/2021/03/26/opinions/alexi-mccammond-teen-vogue-what-comes-next-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311051309-02-alexi-mccammond-2019-file-super-tease.jpg", "publishedAt": "2021-03-26T10:35:48Z", "content": "Roxanne Jones, a founding editor of ESPN Magazine and former vice president at ESPN, has been a producer, reporter and editor at the New York Daily News and The Philadelphia Inquirer. Jones is co-aut… [+9789 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for March 26: Voting law, Covid, White House, foreign policy, China", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/03/26/us/five-things-march-26-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315113019-georgia-voting-rights-billboard-campaign-super-tease.jpg", "publishedAt": "2021-03-26T10:27:34Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter, CNN", "title": "How to safely celebrate Passover and Easter this year: Dr Wen's advice", "description": "With Passover and Easter season upon us, people who are getting vaccinated may also want to gather. Is it OK for fully vaccinated people to get together for a Seder or Easter brunch? Here's Dr. Leana Wen's take.", "url": "https://www.cnn.com/2021/03/26/health/passover-easter-celebrations-covid-safety-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325182909-easter-egg-hunt-stock-super-tease.jpg", "publishedAt": "2021-03-26T10:24:20Z", "content": "(CNN)Passover begins this Saturday, and Easter will soon be upon us. As more people are getting vaccinated, people are wondering what activities are safe. Is it OK for fully vaccinated people to get … [+4997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson and Maeve Reston, CNN", "title": "'It's a matter of timing': Biden lays out expansive theory of his own presidency", "description": "Joe Biden offered his most expansive explanation yet of his own presidency on Thursday, presenting himself, at least for now, as a problem solver operating above the bitter divides of Washington politics.", "url": "https://www.cnn.com/2021/03/26/politics/joe-biden-first-news-conference-filibuster-timeline/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325142746-joe-biden-march-25-2021-02-super-tease.jpeg", "publishedAt": "2021-03-26T10:05:54Z", "content": "(CNN)Joe Biden offered his most expansive explanation yet of his own presidency on Thursday, presenting himself, at least for now, as a problem solver operating above the bitter divides of Washington… [+11670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "Schiff aide moves to White House as Biden rounds out press team", "description": "The White House is rounding out its press operation, adding a veteran Capitol Hill aide as President Joe Biden prepares to launch his next major agenda push.", "url": "https://www.cnn.com/2021/03/26/politics/emilie-simons-white-house-press-team/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325200615-emilie-simons-file-super-tease.jpg", "publishedAt": "2021-03-26T10:03:16Z", "content": "(CNN)The White House is rounding out its press operation, adding a veteran Capitol Hill aide as President Joe Biden prepares to launch his next major agenda push. \r\nEmilie Simons will join the White … [+2916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tomas Meehan, CNN", "title": "Sam Holness hopes to use autism 'superpower' at Ironman World Championship", "description": "You need to be almost superhuman to take on the Ironman World Championship in Kona, Hawaii. Which is why Briton Sam Holness plans on channeling what he describes as his autism \"superpower\" as he sets his sights on reaching the legendary event.", "url": "https://edition.cnn.com/2021/03/26/sport/ironman-world-championship-sam-holness-triathlon-spt-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325080550-restricted-03-triathlon-world-championships-sam-holness-spt-intl-super-tease.jpg", "publishedAt": "2021-03-26T09:58:23Z", "content": "(CNN)You need to be almost superhuman to take on the Ironman World Championship in Hawaii. Which is why Briton Sam Holness plans on channeling what he describes as his autism \"superpower\" as he sets … [+5752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Miami Beach officials say they're prepared for another weekend of large spring break crowds", "description": "An attempt to enforce an emergency curfew on spring breakers at Miami Beach last weekend devolved into chaos. But this weekend, city officials say they're prepared.", "url": "https://www.cnn.com/2021/03/26/us/miami-beach-spring-break-curfew/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325182234-01-miami-beach-after-curfew-0321-super-tease.jpg", "publishedAt": "2021-03-26T09:36:15Z", "content": "(CNN)An attempt to enforce an emergency curfew on spring breakers at Miami Beach last weekend devolved into chaos. But this weekend, city officials say they're prepared.\r\nAuthorities have extended a … [+3972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Some Social Security recipients are still waiting for their stimulus checks", "description": "The Internal Revenue Service has sent roughly 127 million stimulus payments out in the past two weeks, but some of the lowest-income Social Security recipients are among those still waiting to get the money.", "url": "https://www.cnn.com/2021/03/26/politics/stimulus-payments-social-security/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210313113702-file-stimulus-check-super-tease.jpg", "publishedAt": "2021-03-26T09:13:36Z", "content": "Washington (CNN)The Internal Revenue Service has sent roughly 127 million stimulus payments out in the past two weeks, but some of the lowest-income Social Security recipients are among those still w… [+4012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Samira Said, CNN", "title": "Boulder shooting suspect was moved from county jail after receiving threats", "description": "The man charged with killing 10 people in a Boulder grocery store has been moved out of county jail after officers became aware of \"threats toward him\" from other inmates, a jail official told CNN.", "url": "https://www.cnn.com/2021/03/26/us/boulder-colorado-shooting-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326024654-ahmad-al-aliwi-alissa-court-appearance-0325-super-tease.jpg", "publishedAt": "2021-03-26T08:55:40Z", "content": "(CNN)The man charged with killing 10 people in a Boulder grocery store has been moved out of county jail after officers became aware of \"threats toward him\" from other inmates, a jail official told C… [+5019 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a>, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-03-26-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-03-26T06:36:32Z", "content": "Researchers said Thursday they have found evidence that coronavirus infects the mouth, including inside the cheeks, in the gums and in salivary glands.\r\nTheir findings, detailed in the journal Nature… [+2282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mallika Kallingal, CNN", "title": "Tornadoes roll across 5 southern states causing at least 5 deaths and lots of destruction in their wake", "description": "A wave of tornadoes rolled across five southern states on Thursday, leaving at least five people dead and inflicting heavy damage in its wake, according to officials.", "url": "https://www.cnn.com/2021/03/26/us/weather-tornadoes-storms-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325160526-01-alabama-storm-damage-0325-pelham-super-tease.jpg", "publishedAt": "2021-03-26T06:25:27Z", "content": "(CNN)A wave of tornadoes rolled across five southern states on Thursday, leaving at least five people dead and inflicting heavy damage in its wake, according to officials.\r\nEarly Friday, the city of … [+3534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "US government stops distribution of Eli Lilly Covid-19 antibody treatment due to spread of coronavirus variants", "description": "The US government in coordination with Eli Lilly said it will no longer distribute the Covid-19 monoclonal antibody therapy bamlanivimab for use on its own. The halt is due to the \"sustained increase\" in coronavirus variants in the United States.", "url": "https://www.cnn.com/2021/03/25/health/variants-eli-lilly-antibody-therapy-distribution-stops/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200531184018-eli-lilly-scientist-antibody-therapy-2-super-tease.jpg", "publishedAt": "2021-03-26T03:41:32Z", "content": "(CNN)The US government in coordination with Eli Lilly saidit will no longer distribute the Covid-19 monoclonal antibody therapy bamlanivimab for use on its own. The halt is due to the \"sustained incr… [+3257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Martin, CNN", "title": "A college player dies in a car crash, three days after playing in the NCAA men's basketball tournament", "description": "Just days after playing in the NCAA tournament, Oscar Frayer, a forward on the men's basketball team at Grand Canyon University, died Tuesday in a vehicle accident near Lodi, California, the school's athletics department said Thursday.", "url": "https://www.cnn.com/2021/03/25/us/grand-canyon-mens-basketball-oscar-frayer-dies-spt-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325224925-01-oscar-frayer-card-super-tease.jpg", "publishedAt": "2021-03-26T03:25:38Z", "content": "(CNN)Just days after playing in the NCAA tournament, Oscar Frayer, a forward on the men's basketball team at Grand Canyon University, died Tuesday in a vehicle accident near Lodi, California, the sch… [+2138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Suez Canal authorities need to remove 20,000 cubic meters of sand to free the Ever Given", "description": "Up to 20,000 cubic meters of sand in the Suez Canal need to be removed to free the gigantic container ship that has been stuck there since Tuesday, according to the canal authorities.", "url": "https://www.cnn.com/2021/03/25/middleeast/suez-canal-ship-sand-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325111828-01-satellite-image-suez-canal-container-ship-super-tease.jpg", "publishedAt": "2021-03-26T03:15:07Z", "content": "(CNN)Up to 20,000 cubic meters of sand in the Suez Canal need to be removed to free the gigantic container ship that has been stuck there since Tuesday, according to the canal authorities.\r\nThe Ever … [+3998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "One man thought he was going to die and the owner of a gym saw the roof lifted off by an Alabama tornado", "description": "As Alabama residents continue sheltering in place from disastrous storms, residents who spoke to CNN described scenes of terror, devastation and shock.", "url": "https://www.cnn.com/2021/03/25/us/alabama-tornado-witnesses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325164522-03-alabama-storm-damage-0325-eagle-point-super-tease.jpg", "publishedAt": "2021-03-26T02:39:34Z", "content": "(CNN)As Alabama residents continue sheltering in place from disastrous storms, residents who spoke to CNN described scenes of terror, devastation and shock.\r\n\"I was like this is probably it. I'm prob… [+1666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Blake Ellis and Melanie Hicken, CNN", "title": "Fake CPA hit with criminal charges for Covid-19 loan fraud", "description": "An Arizona businessman who secured more than $1 million in Covid-19 relief funding and then purchased a Porsche and a new home is now facing federal fraud charges. James Polzin, 47, is accused of filing fraudulent applications for government loans by claiming…", "url": "https://www.cnn.com/2021/03/25/business/covid-loan-fraud-criminal-charges-james-polzin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303170526-paycheck-protection-program-application---stock-super-tease.jpg", "publishedAt": "2021-03-26T02:20:53Z", "content": "(CNN)An Arizona businessman who secured more than $1 million in Covid-19 relief funding and then purchased a Porsche and a new home is now facing federal fraud charges. \r\nJames Polzin, 47, is accused… [+3655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Kinzinger on political fundraising: 'We have fed a steady diet of fear'", "description": "Republican Rep. Adam Kinzinger, a vocal critic of Donald Trump who wants to save his party from the former President, thinks politicians have learned that \"fear is the most compelling emotion.\"", "url": "https://www.cnn.com/2021/03/25/politics/adam-kinzinger-fear-political-fundraising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210112182127-rep-adam-kinzinger-file-super-tease.jpg", "publishedAt": "2021-03-26T02:19:33Z", "content": "Washington, DC (CNN)Republican Rep. Adam Kinzinger, a vocal critic of Donald Trump who wants to save his party from the former President, thinks politicians have learned that \"fear is the most compel… [+3883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Kinzinger on political fundraising: 'We have fed a steady diet of fear'", "description": "Republican Rep. Adam Kinzinger, a vocal critic of Donald Trump who wants to save his party from the former President, thinks politicians have learned that \"fear is the most compelling emotion.\"", "url": "https://www.cnn.com/2021/03/25/politics/adam-kinzinger-fear-political-fundraising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210112182127-rep-adam-kinzinger-file-super-tease.jpg", "publishedAt": "2021-03-26T02:19:33Z", "content": "Washington, DC (CNN)Republican Rep. Adam Kinzinger, a vocal critic of Donald Trump who wants to save his party from the former President, thinks politicians have learned that \"fear is the most compel… [+3883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "More than half of all migrants at US-Mexico border expelled under health order in recent weeks", "description": "The Biden administration expelled more than half of the migrants arriving at the US-Mexico border in recent weeks under a Trump-era health order that has been continued by the Biden administration, according to preliminary data reviewed by CNN.", "url": "https://www.cnn.com/2021/03/25/politics/migrants-us-mexico-border-expelled-health-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323140903-13-border-facility-donna-texas-super-tease.jpg", "publishedAt": "2021-03-26T02:16:36Z", "content": "(CNN)The Biden administration expelled more than half of the migrants arriving at the US-Mexico border in recent weeks under a Trump-era health order that has been continued by the Biden administrati… [+4157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, CNN", "title": "NYPD officers are no longer protected from civil lawsuits after city council passes police reform legislation", "description": "The New York City Council passed a series of reforms for the New York Police Department on Thursday, including ending qualified immunity for officers, which protected them against civil lawsuits.", "url": "https://www.cnn.com/2021/03/25/us/nyc-police-reform-nypd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325214805-nypd-logo-restricted-super-tease.jpg", "publishedAt": "2021-03-26T02:14:47Z", "content": "(CNN)The New York City Council passed a series of reforms for the New York Police Department on Thursday, including ending qualified immunity for officers, which protected them against civil lawsuits… [+4978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Your eco-friendly hotel might not be so green after all", "description": "When it comes to making hotels and resorts eco-friendly, it can be hard to know which moves are setting up long-term sustainability and which ones are just trends that will disappear as soon as the next fad emerges.", "url": "https://www.cnn.com/travel/article/eco-friendly-hotels-greenwashing-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325122145-01-hotel-linens-file-super-tease.jpg", "publishedAt": "2021-03-26T01:26:57Z", "content": "(CNN) Hotels, like so many other businesses, go through waves based on changing attitudes -- from design to amenities to excursions.\r\nBut when it comes to making hotels and resorts eco-friendly, it c… [+8909 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "Key House chairs request wide range of documents on US Capitol riot", "description": "House committee chairs are requesting documents and communications from before, during and after the January 6 attack on the US Capitol from a wide range of entities, including the White House, federal agencies, local law enforcement and the House and Senate …", "url": "https://www.cnn.com/2021/03/25/politics/us-capitol-riot-january-6-house-committees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210211085213-capitol-insurrection-gallows-noose-jan-6-super-tease.jpg", "publishedAt": "2021-03-26T01:21:43Z", "content": "(CNN)House committee chairs are requesting documents and communications from before, during and after the January 6 attack on the US Capitol from a wide range of entities, including the White House, … [+2907 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths, CNN", "title": "China sanctions UK lawmakers and entities in retaliation for Xinjiang measures", "description": "China has issued more retaliatory sanctions over Xinjiang, targeting individuals and entities in the United Kingdom it says \"maliciously spread lies and disinformation\" regarding Beijing's treatment of Uyghur Muslims.", "url": "https://www.cnn.com/2021/03/25/china/china-uk-sanctions-xinjiang-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326084301-china-uk-flags-file-super-tease.jpg", "publishedAt": "2021-03-26T01:16:16Z", "content": "Hong Kong (CNN)China has issued more retaliatory sanctions over Xinjiang, targeting individuals and entities in the United Kingdom it says \"maliciously spread lies and disinformation\" regarding Beiji… [+3005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elissaveta Brandon, CNN", "title": "Hong Kong Disneyland's new castle is an architectural vision of diversity", "description": "The new Castle of Magical Dreams, completed in November and reopened last month after Hong Kong's Covid-19 restrictions loosened, nods to the wider variety of female characters now featured in Disney movies.", "url": "https://www.cnn.com/style/article/disneyland-castle-of-magic-dreams-diversity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325205643-03b-hong-kong-disneyland-super-tease.jpg", "publishedAt": "2021-03-26T01:14:16Z", "content": "Much has changed in the 55 years since Walt Disney died -- not just in the fortunes of his brand, now one of the world's most influential corporations, but in the characters it creates and the values… [+7850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "A printout of George Floyd's toxicology report was found on a Black History display at Duke University, insinuating that he deserved to die", "description": "A flier insinuating that George Floyd's death was because of drugs appeared on a Black History Month display at Duke University, causing a school-wide investigation into what officials are calling an \"act of bias.\"", "url": "https://www.cnn.com/2021/03/25/us/duke-university-george-floyd-flier-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200610132604-photo-george-floyd-super-tease.jpg", "publishedAt": "2021-03-26T01:00:25Z", "content": "(CNN)A flier insinuating that George Floyd's death was because of drugs appeared on a Black History Month display at Duke University, causing a school-wide investigation into what officials are calli… [+3386 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Elizabeth Warren and Mary Kay Henry", "title": "Caregivers are essential workers. It's time we recognize them as such", "description": "The pandemic has made it clear how caregivers are essential, write Sen. Elizabeth Warren and Mary Kay Henry. But families struggle to afford care, while care jobs remain undervalued, understaffed, underprotected and underpaid. It's time for Congress and Presi…", "url": "https://www.cnn.com/2021/03/25/opinions/caregivers-essential-workers-protections-investment-warren/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200602141940-us-nursing-home-essential-worker-union-0521-super-tease.jpg", "publishedAt": "2021-03-26T00:53:48Z", "content": "Elizabeth Warren is the senior US senator from Massachusetts and a former Democratic candidate for President in 2020. Mary Kay Henry is the international president of the Service Employees Internatio… [+5461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 43 photos", "description": "Take a look at 43 photos of the week from March 18 to March 25.", "url": "https://www.cnn.com/2021/03/25/world/gallery/photos-this-week-march-18-march-25/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325183903-12-week-in-photos-0326-super-tease.jpg", "publishedAt": "2021-03-26T00:42:06Z", "content": "Open Menu\r\nprevious image\r\nnext image\r\nPeople walk out of a Boulder, Colorado, grocery store after a mass shooting there on Monday, March 22. Ten people were killed. Ahmad Al Aliwi Alissa, the 21-yea… [+7093 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Nicole Gaouette, CNN", "title": "Biden says US faces battle to 'prove democracy works'", "description": "President Joe Biden cast challenges to the US from China, Russia and global shifts in stark terms Thursday, describing \"a battle between the utility of democracies in the 21st century and autocracies.\"", "url": "https://www.cnn.com/2021/03/25/politics/biden-autocracies-versus-democracies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325173626-biden-news-conference-ghtits-oped-super-169.jpg", "publishedAt": "2021-03-26T00:31:20Z", "content": "President Joe Biden cast challenges to the US from China, Russia and global shifts in stark terms Thursday, describing a battle between the utility of democracies in the 21st century and autocracies.… [+7622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "Two Capitol riot cases acknowledge plea talks with the Justice Department", "description": "Plea talks between the Justice Department and some defendants in the Capitol riot cases are still in the works, two court proceedings made clear on Thursday.", "url": "https://www.cnn.com/2021/03/25/politics/plea-talks-capitol-riot-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321231141-capitol-hill-riot-0106-super-tease.jpg", "publishedAt": "2021-03-25T23:38:10Z", "content": "(CNN)Plea talks between the Justice Department and some defendants in the Capitol riot cases are still in the works, two court proceedings made clear on Thursday. \r\nThe acknowledgment of discussions … [+3231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jazmin Goodwin, CNN Business", "title": "The Fed will lift restrictions on dividends and buybacks for most banks after June 30", "description": "The Federal Reserve will end its restrictions on bank dividends and buybacks for most institutions on June 30 as long as they pass the current round of stress tests, the central bank announced Thursday.", "url": "https://www.cnn.com/2021/03/25/investing/federal-reserve-bank-dividends/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210322074910-federal-reserve-building-0319-super-tease.jpg", "publishedAt": "2021-03-25T23:26:34Z", "content": "New York (CNN Business)The Federal Reserve will end its restrictions on bank dividends and buybacks for most institutions on June 30 as long as they pass the current round of stress tests, the centra… [+1644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, Holmes Lybrand, Tara Subramaniam and Katie Lobosco, CNN", "title": "Fact-checking Biden's first news conference as president", "description": "President Joe Biden held the first formal news conference of his presidency on Thursday, taking questions in the East Room of the White House on immigration, foreign policy, the Senate filibuster, his political future and other subjects.", "url": "https://www.cnn.com/2021/03/25/politics/fact-check-biden-first-press-conference/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325173626-biden-news-conference-ghtits-oped-super-tease.jpg", "publishedAt": "2021-03-25T22:53:57Z", "content": "(CNN)President Joe Biden held the first formal news conference of his presidency on Thursday, taking questions in the East Room of the White House on immigration, foreign policy, the Senate filibuste… [+6642 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nima Elbagir and Angela Dewan, CNN", "title": "First fuel ship this year docks in Hodeidah as Saudi-led coalition relaxes blockade", "description": "A tanker carrying oil docked at Hodeidah port in Yemen on Thursday -- the first such ship to berth this year in the country's Houthi-controlled north, where fuel is desperately needed to distribute food and to keep the country's hospitals from shuttering.", "url": "https://www.cnn.com/2021/03/25/middleeast/yemen-fuel-ship-hodeidah-dock-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325160529-hodeida-port-file-2018-super-tease.jpg", "publishedAt": "2021-03-25T22:47:55Z", "content": "(CNN)A tanker carrying oil docked at Hodeidah port in Yemen on Thursday -- the first such ship to berth this year in the country's Houthi-controlled north, where fuel is desperately needed to distrib… [+4305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Claire Colbert, CNN", "title": "NCAA hires law firm to evaluate gender equity issues within all championships", "description": "National Collegiate Athletic Association (NCAA) President Mark Emmert announced  Thursday that the organization has retained a law firm to help address gaps in gender equity in college sports.", "url": "https://www.cnn.com/2021/03/25/us/ncaa-gender-equity-law-firm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319163847-ncaa-womens-basketball-tournament-weight-rooms-facilities-unequal-orig-mg-00001603-super-tease.png", "publishedAt": "2021-03-25T22:32:31Z", "content": "(CNN)National Collegiate Athletic Association (NCAA) President Mark Emmert announced Thursday that the organization has retained a law firm to help address gaps in gender equity in college sports.\r\nT… [+2225 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Lauren Dezenski, CNN", "title": "New York isn't the only state trying to legalize marijuana", "description": "States are on the march toward marijuana legalization, and New York is the latest one to be a step closer to fully legalizing adult use.", "url": "https://www.cnn.com/2021/03/25/politics/marijuana-legalization-new-york-new-mexico-pennsylvania-virginia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190403170632-new-mexico-flag-super-tease.jpg", "publishedAt": "2021-03-25T22:30:45Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "New legislation would reduce toxic heavy metals in baby food", "description": "New legislation to regulate the baby food industry will be presented to Congress this week, less than two months after a congressional investigation found four leading baby food manufacturers knowingly sold baby food with dangerous levels of lead, mercury, ar…", "url": "https://www.cnn.com/2021/03/25/health/baby-food-toxic-metals-legislation-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130319135841-hm-baby-solid-food-00000924-super-tease.jpg", "publishedAt": "2021-03-25T22:30:08Z", "content": "Because rice takes up arsenic more readily than other grains, the U.S. Food and Drug Administration is looking at the effects of long-term exposure to very low amounts of arsenic in rice and rice pro… [+310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "Biden, a President who doesn't insult people -- or our intelligence", "description": "His first conference was not just a startling departure from his predecessor's -- he didn't praise himself, and spoke in full, coherent and informed sentences -- it was a strong, nuanced performance by any standard, writes Frida Ghitis. For most Americans, wh…", "url": "https://www.cnn.com/2021/03/25/opinions/biden-news-conference-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325173626-biden-news-conference-ghtits-oped-super-tease.jpg", "publishedAt": "2021-03-25T22:19:47Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+5669 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jacob Krol", "title": "The best printer of 2021", "description": "Printers have gotten more feature-filled and affordable over the past few years, as the once massive all-in-one units (print, copy and scan) have gotten more and more compact while delivering higher quality prints.", "url": "https://www.cnn.com/2021/03/25/cnn-underscored/best-printers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325171714-underscored-best-printers-lead-super-169.jpg", "publishedAt": "2021-03-25T22:11:19Z", "content": "Printers have gotten more feature-filled and affordable over the past few years, as the once massive all-in-one units (print, copy and scan) have gotten more and more compact while delivering higher … [+17710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Salvatore R. Mercogliano", "title": "Suez Canal traffic jam blocks the world's jugular vein", "description": "A failure of machinery, human error or natural events -- high winds and reduced visibility - may have caused Ever Given to run ashore in the Suez Canal, writes Salvatore R. Mercogliano. But its impact will resonate far from its banks as it has blocked the jug…", "url": "https://www.cnn.com/2021/03/25/opinions/suez-canal-traffic-jam-jugular-mercogliano/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324085406-01-suez-canal-container-ship-0324-super-tease.jpg", "publishedAt": "2021-03-25T22:08:20Z", "content": "Salvatore R. Mercogliano, Ph.D., is an associate professor of history at Campbell University, a former merchant mariner and contributor to gCaptain maritime. The views expressed here are his own. Vie… [+4923 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "Georgia GOP lawmakers pass sweeping bill to restrict voting", "description": "GOP lawmakers in Georgia passed a sweeping elections bill that would clamp down on ballot access and give state officials more powers over local elections. Follow here for the latest.", "url": "https://www.cnn.com/politics/live-news/georgia-voting-restrictions-bill-03-25-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303000208-georgia-capitol-building-super-tease.jpg", "publishedAt": "2021-03-25T22:01:01Z", "content": "In the span of a few hours Thursday, the GOP-controlled Georgia legislature sped a sweeping elections bill through two chambers, putting the battleground state on a course to impose new voting restri… [+1898 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "What Jim Crow looks like in 2021", "description": "The idea that new voting restrictions being pushed in Georgia and other states are a more sanitized version of Jim Crow -- dressed up in a 'suit and tie' or with 'cologne' as voting rights advocates put it -- says a lot about popular understanding of that era…", "url": "https://www.cnn.com/2021/03/25/opinions/voting-rights-suppression-is-jim-crow-suit-and-tie-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325172215-george-floyd-protest-minneapolis-200529-super-tease.jpg", "publishedAt": "2021-03-25T21:55:47Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+8643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Scott Jennings", "title": "Biden's filibuster flip-flop is outrageous", "description": "Scott Jennings writes that during his first press conference, President Joe Biden contradicted himself on where he stands on the filibuster. While in the past he was the biggest proponent of this US Senate tool, Biden now says it's being abused and has a raci…", "url": "https://www.cnn.com/2021/03/25/opinions/filibuster-flip-flop-biden-press-conference-jennings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325143535-joe-biden-march-25-2021-03-super-tease.jpeg", "publishedAt": "2021-03-25T21:18:13Z", "content": "Scott Jennings, a CNN contributor and Republican campaign adviser, is a former special assistant to President George W. Bush and a former campaign adviser to Sen. Mitch McConnell. He is a partner at … [+2800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner, CNN Business", "title": "Olive Garden is raising its wages. That's not the full story", "description": "The company that owns Olive Garden is raising wages in a bid to attract workers. But the move doesn't go far enough to satisfy critics of a practice common in the restaurant industry.", "url": "https://www.cnn.com/2021/03/25/business/darden-tipped-wages/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325120259-olive-garden-restaurant-2020---stock-file-super-tease.jpg", "publishedAt": "2021-03-25T20:20:43Z", "content": "New York (CNN Business)The company that owns Olive Garden is raising wages in a bid to attract workers. But the move doesn't go far enough to satisfy critics of a practice common in the restaurant in… [+3420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner, CNN Business", "title": "Olive Garden is raising its wages. That's not the full story", "description": "The company that owns Olive Garden is raising wages in a bid to attract workers. But the move doesn't go far enough to satisfy critics of a practice common in the restaurant industry.", "url": "https://www.cnn.com/2021/03/25/business/darden-tipped-wages/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325120259-olive-garden-restaurant-2020---stock-file-super-tease.jpg", "publishedAt": "2021-03-25T20:20:43Z", "content": "New York (CNN Business)The company that owns Olive Garden is raising wages in a bid to attract workers. But the move doesn't go far enough to satisfy critics of a practice common in the restaurant in… [+3428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Here's the deal with Jack Dorsey's weird 'clock'", "description": "On Wednesday, the CEOs of Facebook, Google and Twitter appeared (virtually) before a congressional committee to answer hours of pointed questions about how their platforms handle misinformation.", "url": "https://www.cnn.com/2021/03/25/tech/jack-dorsey-clock-blockchain/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325151718-03-tech-senate-misinformation-hearing-0325---screenshot-super-tease.jpg", "publishedAt": "2021-03-25T20:16:27Z", "content": "(CNN Business)On Wednesday, the CEOs of Facebook, Google and Twitter appeared (virtually) before a congressional committee to answer hours of pointed questions about how their platforms handle misinf… [+1568 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Yellin", "title": "There's a new record-high sign-up bonus on the Chase Sapphire Preferred credit card", "description": "For the first time ever, the Chase Sapphire Preferred credit card is offering 80,000 bonus points and up to $50 in statement credits to new card holders, but that's just one reason to get it.", "url": "https://www.cnn.com/2021/03/25/cnn-underscored/reasons-to-get-chase-sapphire-preferred/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201026232205-underscored-couple-in-folding-chairs-on-beach-vacation-super-169.jpg", "publishedAt": "2021-03-25T20:09:24Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+9313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette and Richard Roth, CNN", "title": "US to resume diplomatic ties with Palestinians that were cut under Trump", "description": "The US will resume diplomatic ties with Palestinians that were cut under the Trump administration, the US ambassador to the United Nations, Linda Thomas-Greenfield, told the Security Council Thursday.", "url": "https://www.cnn.com/2021/03/25/politics/us-palestinians-diplomatic-ties-two-states/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319143652-linda-thomas-greenfield-0301-super-tease.jpg", "publishedAt": "2021-03-25T20:07:34Z", "content": "(CNN)The US will resume diplomatic ties with Palestinians that were cut under the Trump administration, the US ambassador to the United Nations, Linda Thomas-Greenfield, told the Security Council Thu… [+2700 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Q&A: What Europe expects from Joe Biden", "description": "Meanwhile asked The Atlantic Council's Nicholas Dungan in The Hague about Europe's expectations for the Biden administration and for cooperation in dealing with China's rise.", "url": "https://www.cnn.com/2021/03/25/world/meanwhile-in-america-march-25-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325143535-joe-biden-march-25-2021-03-super-tease.jpeg", "publishedAt": "2021-03-25T19:36:58Z", "content": "This was excerpted from the March 25 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)Biden will on … [+2897 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Key takeaways from Biden's first White House news conference", "description": "Convening his first formal news conference Thursday, President Joe Biden stepped into a swirl of issues that have bubbled up at the two-month mark of his presidency, which has been almost exclusively focused until now on confronting the coronavirus pandemic.", "url": "https://www.cnn.com/2021/03/25/politics/joe-biden-news-conference-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325134038-07-biden-presser-0325-super-tease.jpg", "publishedAt": "2021-03-25T19:18:24Z", "content": "(CNN)Convening his first formal news conference Thursday, President Joe Biden stepped into a swirl of issues that have bubbled up at the two-month mark of his presidency, which has been almost exclus… [+7515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt and Jeremy Herb, CNN", "title": "Lawmakers advance legislation to go further than Biden administration in punishing Saudi Arabia for Khashoggi murder", "description": "A House committee on Thursday advanced legislation taking aim at Saudi Arabia in the wake of last month's intelligence report implicating the country's crown prince in the murder of journalist Jamal Khashoggi following widespread criticism that the Biden admi…", "url": "https://www.cnn.com/2021/03/25/politics/saudi-arabia-khashoggi-legislation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200702113536-file-02-jamal-khashoggi-super-tease.jpg", "publishedAt": "2021-03-25T19:09:55Z", "content": "Washington (CNN)A House committee on Thursday advanced legislation taking aim at Saudi Arabia in the wake of last month's intelligence report implicating the country's crown prince in the murder of j… [+4960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Jessica Walter, 'Arrested Development' star, dies at 80", "description": "Jessica Walter, an award-winning actress beloved for her role in the television series \"Arrested Development,\" died Wednesday in her sleep at her home in New York City, her daughter confirmed in a statement to CNN.", "url": "https://www.cnn.com/2021/03/25/entertainment/jessica-walter-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325144744-01-jessica-walter-lead-image-restricted-super-tease.jpg", "publishedAt": "2021-03-25T19:04:58Z", "content": "(CNN)Jessica Walter, an award-winning actress beloved for her role in the television series \"Arrested Development,\" died Wednesday in her sleep at her home in New York City, her daughter confirmed in… [+46 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "Biden says he agrees with Obama that filibuster is 'a relic of the Jim Crow era'", "description": "Joe Biden told CNN's Kaitlan Collins on Thursday at the first formal news conference of his presidency that he agreed with former President Barack Obama that the filibuster \"was a relic of the Jim Crow era\" but added that his immediate focus was on addressing…", "url": "https://www.cnn.com/2021/03/25/politics/filibuster-biden-obama/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325143535-joe-biden-march-25-2021-03-super-tease.jpeg", "publishedAt": "2021-03-25T18:56:36Z", "content": "(CNN)Joe Biden told CNN's Kaitlan Collins on Thursday at the first formal news conference of his presidency that he agreed with former President Barack Obama that the filibuster \"was a relic of the J… [+1208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Staff", "title": "Traveling to South Africa during Covid-19: What you need to know before you go", "description": "If you're planning to travel to South Africa, here's what you'll need to know and expect if you want to visit during the Covid-19 pandemic.", "url": "https://www.cnn.com/travel/article/south-africa-travel-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180508141316-02-amazing-places-africa---table-mountain-super-tease.jpg", "publishedAt": "2021-03-25T18:46:03Z", "content": "Editor's Note Coronavirus cases remain high across the globe. Health officials caution that travel increases your chances of getting and spreading the virus. Staying home is the best way to stem tran… [+4057 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette and Kylie Atwood, CNN", "title": "Biden says he 'can't picture' US troops being in Afghanistan next year", "description": "President Joe Biden said he \"can't picture\" US troops being in Afghanistan next year.", "url": "https://www.cnn.com/2021/03/25/politics/biden-afghanistan-presser/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325134844-10-biden-presser-0325-super-tease.jpg", "publishedAt": "2021-03-25T18:44:26Z", "content": "Washington (CNN)President Joe Biden said he \"can't picture\" US troops being in Afghanistan next year.\r\nBiden has been wrestling with a May 1 deadline to withdraw all US troops from the country under … [+3193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Staff", "title": "Traveling to China during Covid-19: What you need to know before you go", "description": "If you're planning a trip to China, here's what you'll need to know and expect if you want to visit during the global coronavirus pandemic.", "url": "https://www.cnn.com/travel/article/china-travel-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325182602-shanghai-skyline-1-super-tease.jpg", "publishedAt": "2021-03-25T18:31:29Z", "content": "Editor's Note Coronavirus cases remain high across the globe. Health officials caution that travel increases your chances of getting and spreading the virus. Staying home is the best way to stem tran… [+2900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden calls state GOP voting restrictions efforts 'sick' and 'un-American'", "description": "President Joe Biden said he will \"do everything\" in his power to halt efforts to restrict voting rights, saying during Thursday's news conference at the White House that the efforts underway in state legislatures are \"un-American.\"", "url": "https://www.cnn.com/2021/03/25/politics/voting-rights-biden-republicans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325134844-09-biden-presser-0325-super-tease.jpg", "publishedAt": "2021-03-25T18:22:50Z", "content": "(CNN)President Joe Biden said he will \"do everything\" in his power to halt efforts to restrict voting rights, saying during Thursday's news conference at the White House that the efforts underway in … [+2022 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fernanda Wenzel, Rodrigo Pedroso and Hira Humayan, CNN", "title": "Brazil launches a new Covid-19 'crisis committee'", "description": "After a year of often acrimonious relations between federal and local governments over Covid handling, the new committee will include members of the legislative branch, the Supreme Court, ministers, and six state governors. The federal government did not resp…", "url": "https://www.cnn.com/2021/03/25/americas/brazil-crisis-committee-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315122112-brazil-covid-19-crisis-overwhelmed-icu-vaccine-shortage-rivers-pkg-intl-hnk-vpx-00025815-super-tease.png", "publishedAt": "2021-03-25T18:22:27Z", "content": "(CNN)More than year into the global pandemic, Brazil's government has decided to form a new Covid-19 crisis committee that will now include state officials.\r\nBrazilian President Jair Bolsonaro made t… [+4534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Susannah Hills", "title": "Doctor: Why I can feel the pain of the long-haul Covid sufferers", "description": "Susannah Hills writes that the stories she hears from patients who are dealing with long term Covid-19 symptoms made her remember her experience returning to work after undergoing surgery, chemotherapy and radiation to treat her Stage 3 cancer.", "url": "https://www.cnn.com/2021/03/25/opinions/long-haul-covid-sufferers-recovery-hills/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201021215050-conclu-covid-super-tease.jpg", "publishedAt": "2021-03-25T18:19:34Z", "content": "Dr. Susannah Hills is a pediatric airway surgeon at the New York Presbyterian Hospital and the Columbia University Medical Center. She also serves as assistant professor of otolaryngology-head and ne… [+6250 chars]"}]}