{"status": "ok", "totalResults": 181, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson", "title": "America's withdrawal from Afghanistan held an unflattering mirror to its often ugly politics", "description": "Like the pandemic, America's final withdrawal from Afghanistan held an unflattering mirror to its often ugly politics. It also revealed characteristics of Joe Biden's leadership that the President had previously shielded from the public.", "url": "https://www.cnn.com/2021/09/01/world/meanwhile-in-america-september-1-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831161620-biden-afghanistan-presser-0831-video-super-tease.jpg", "publishedAt": "2021-09-02T01:06:54Z", "content": "This story was excerpted from the September 1 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)Like … [+2333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN", "title": "Meet 'EMMA': The AI robot masseuse practicing ancient wellness therapies", "description": "Developed by Singapore-based startup AiTreat, \"EMMA\" is a robot masseuse that uses sensors and 3D vision to deliver deep tissue massages and traditional Chinese medicine (TCM) therapies.", "url": "https://www.cnn.com/2021/09/01/health/ai-robot-masseuse-tcm-wellness-hnk-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827144954-01-emma-robot-masseuse-super-tease.jpg", "publishedAt": "2021-09-02T00:39:14Z", "content": "(CNN)For thousands of years, traditional Chinese medicine (TCM) has been used across China and Southeast Asia. Ranging from acupuncture to herbal remedies, its practices have evolved constantly over … [+6019 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb and Natasha Bertrand, CNN", "title": "After Afghanistan withdrawal, questions intensify over who got it wrong", "description": "With the US withdrawal from Afghanistan officially complete, the White House is set to begin the difficult process of reviewing the chaotic and deadly evacuation operation that lurched into high gear after Kabul fell to the Taliban, forcing Biden officials to…", "url": "https://www.cnn.com/2021/09/01/politics/afghanistan-blame-game/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830093526-05-afghanistan-0830-kabul-airport-super-tease.jpg", "publishedAt": "2021-09-01T23:20:03Z", "content": "Washington (CNN)With the US withdrawal from Afghanistan officially complete, the White House is set to begin the difficult process of reviewing the chaotic and deadly evacuation operation that lurche… [+15113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Stuart, CNN", "title": "Oregon school district fires superintendent without reason, after he upheld state's mask mandate", "description": "Adrian School District Superintendent Kevin Purnell was terminated after 14 years working in the district, and three years as superintendent, in a 4-1 vote, with the board saying Purnell failed to follow the its directives. Board members met behind closed doo…", "url": "https://www.cnn.com/2021/09/01/us/oregon-schools-superintendent-fired-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901170704-purnell-2-super-tease.jpg", "publishedAt": "2021-09-01T22:40:08Z", "content": "(CNN)An Oregon schools superintendent was fired during a Monday night school board meeting, after he enforced the state's mask mandate in the district's public schools, according to a report from the… [+2451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona and Manu Raju, CNN", "title": "Biggs to call on McCarthy to boot Kinzinger and Cheney from GOP over January 6 probe", "description": "The head of the conservative House Freedom Caucus is planning to send a letter to House Minority Leader Kevin McCarthy this week calling on him to change the rules in order to remove Reps. Liz Cheney and Adam Kinzinger from the Republican Conference for their…", "url": "https://www.cnn.com/2021/09/01/politics/andy-biggs-kinzinger-cheney-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630161109-kinzinger-cheney-split-super-tease.jpg", "publishedAt": "2021-09-01T22:34:57Z", "content": "(CNN)The head of the conservative House Freedom Caucus is planning to send a letter to House Minority Leader Kevin McCarthy this week calling on him to change the rules in order to remove Reps. Liz C… [+1399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Reddit takes action against groups spreading Covid misinformation", "description": "After days of controversy over its decision not to crack down on misinformation about Covid-19, Reddit is somewhat backtracking, taking action against dozens of its groups known as \"subreddits.\"", "url": "https://www.cnn.com/2021/09/01/tech/reddit-covid-misinformation-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200629130938-01-reddit-app---stock-super-tease.jpg", "publishedAt": "2021-09-01T22:34:39Z", "content": "(CNN Business)After days of controversy over its decision not to crack down on misinformation about Covid-19, Reddit is somewhat backtracking, taking action against dozens of its groups known as \"sub… [+4054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Another tragic statistic to come out of the pandemic", "description": "The numbers are daunting. There have been more than 39 million cases of Covid-19 in America since the start of the pandemic. The virus has killed more than 640,000 of our fellow citizens.", "url": "https://www.cnn.com/2021/09/01/politics/north-dakota-covid-deaths/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201111144544-north-dakota-coronavirus-super-tease.jpg", "publishedAt": "2021-09-01T22:33:28Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Joe Rogan, controversial podcast host, says he tested positive for Covid-19", "description": "Joe Rogan, one of the world's highest paid and most influential podcast hosts, announced Wednesday he has tested positive for Covid-19 and said he'd embarked on a fringe treatment regime.", "url": "https://www.cnn.com/2021/09/01/media/joe-rogan-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901175004-joe-rogan-file-super-tease.jpg", "publishedAt": "2021-09-01T22:18:39Z", "content": "New York (CNN Business)Joe Rogan, one of the world's highest paid and most influential podcast hosts, announced Wednesday he has tested positive for Covid-19 and said he'd embarked on a fringe treatm… [+1938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "What the Supreme Court's inaction means for the future of Roe v. Wade", "description": "The Supreme Court early on Wednesday allowed Texas' six-week abortion ban to go into effect despite the fact that it violates Roe v. Wade, the landmark opinion -- still on the books -- that legalized abortion nationwide prior to viability, which can occur at …", "url": "https://www.cnn.com/2021/09/01/politics/roe-v-wade-future-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210317180021-scotus-conservatives-split-super-tease.jpg", "publishedAt": "2021-09-01T22:15:50Z", "content": "(CNN)The Supreme Court early on Wednesday allowed Texas' six-week abortion ban to go into effect despite the fact that it violates Roe v. Wade, the landmark opinion -- still on the books -- that lega… [+5914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Tom Holland wishes Zendaya a happy birthday", "description": "In what we're sure is a completely platonic message, Tom Holland wished \"Spider-Man\" co-star Zendaya a happy birthday on Wednesday, posting a sweet note to Instagram.", "url": "https://www.cnn.com/2021/09/01/entertainment/tom-holland-zendaya/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170714082227-01-tom-holland-zendaya-dating-super-tease.jpg", "publishedAt": "2021-09-01T22:15:43Z", "content": "(CNN)In what we're sure is a completely platonic message, Tom Holland wished \"Spider-Man\" co-star Zendaya a happy birthday on Wednesday, posting a sweet note to Instagram.\r\n\"My MJ, have the happiest … [+611 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle, CNN Business", "title": "Judge approves plan to dissolve OxyContin maker Purdue Pharma", "description": "A federal bankruptcy judge ruled that Purdue Pharma, the maker of the addictive painkiller OxyContin, will be dissolved under a settlement deal and that its owners, members of the Sackler family, will pay out more than $4 billion to address the opioid epidemi…", "url": "https://www.cnn.com/2021/09/01/business/purdue-sackler-opioid-bankruptcy-ruling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901103834-purdue-pharma-oxycontin-file-restricted-super-tease.jpg", "publishedAt": "2021-09-01T22:10:29Z", "content": "New York (CNN Business)A federal bankruptcy judge ruled that Purdue Pharma, the maker of the addictive painkiller OxyContin, will be dissolved under a settlement deal and that its owners, members of … [+1111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan and Theresa Waldrop, CNN", "title": "What weeks without power and water could look like", "description": "Catastrophic damage means some areas won't have electricity for up to a month -- which can be deadly in the oppressive heat. The next few weeks will be ugly. Here's what experts say residents can do:", "url": "https://www.cnn.com/2021/09/01/health/ida-victims-power-water-outages/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901103412-01-hurricane-ida-power-lines-0830-super-tease.jpg", "publishedAt": "2021-09-01T22:05:14Z", "content": "#NOLATwitter: We've got power!See the map for places to charge your devices while the power's out. The stations are hosted by neighbors, orgs, and businesses across the city.\r\nTo share your power (in… [+136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "Texas' repugnant abortion law is pure Republican hypocrisy", "description": "Frida Ghitis writes that the same politicians who declare that mask requirements are an intolerable intrusion by government into sacrosanct individual freedom, have just imposed the country's most restrictive abortion law since the Supreme Court made abortion…", "url": "https://www.cnn.com/2021/09/01/opinions/texas-abortion-law-contradictions-ghits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831112032-02-abortion-bill-protest-texas-super-tease.jpg", "publishedAt": "2021-09-01T21:37:03Z", "content": "Frida Ghitis (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a CNN Contributor, a contributing columnist to The Washington Post and a columnist for World … [+5684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "White House says it is still examining travel restrictions as European officials say they are damaging relations", "description": "The White House said Wednesday it was continuing to examine a policy that would allow vaccinated foreigners into the United States as the US faces growing anger from European nations over apparently unmoving Covid-19 travel restrictions.", "url": "https://www.cnn.com/2021/09/01/politics/travel-restrictions-us-europe-vaccines-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716132913-01-wh-briefing-psaki-0716-super-tease.jpg", "publishedAt": "2021-09-01T21:26:12Z", "content": "(CNN)The White House said Wednesday it was continuing to examine a policy that would allow vaccinated foreigners into the United States as the US faces growing anger from European nations over appare… [+2536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "Trump endorses Parnell in Pennsylvania Senate race", "description": "Former President Donald Trump waded into Pennsylvania's US Senate race on Wednesday, endorsing Sean Parnell, an Army veteran and former congressional candidate, in the competitive Republican primary.", "url": "https://www.cnn.com/2021/09/01/politics/trump-endorses-pennsylvania-senate-sean-parnell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901170126-sean-parnell-file-2020-super-tease.jpg", "publishedAt": "2021-09-01T21:21:29Z", "content": "(CNN)Former President Donald Trump waded into Pennsylvania's US Senate race on Wednesday, endorsing Sean Parnell, an Army veteran and former congressional candidate, in the competitive Republican pri… [+1930 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "Analysis: Republican trust in media keeps sinking to new lows, opening door to overlapping misinformation", "description": "Every week we read a new story about a conservative media figure who downplayed Covid-19 or mocked the vaccines and wound up hospitalized or dead. Almost as often, we see sad new examples of overlapping misinformation.", "url": "https://www.cnn.com/2021/09/01/media/republicans-losing-trust-media-reliable-sources/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901163822-anti-vaccine-us-protesters-0626-super-tease.jpg", "publishedAt": "2021-09-01T20:58:16Z", "content": "New York (CNN)Every week we read a new story about a conservative media figure who downplayed Covid-19 or mocked the vaccines and wound up hospitalized or dead. Almost as often, we see sad new exampl… [+9013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "NeNe Leakes' husband dead after battle with colon cancer", "description": "Gregg Leakes, the husband of NeNe Leakes from \"Real Housewives of Atlanta,\" has died at age 66.", "url": "https://www.cnn.com/2021/09/01/entertainment/nene-leakes-husband-gregg-death-colon-cancer-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130416150719-nene-leakes-gregg-leakes-march-2013-story-top.jpg", "publishedAt": "2021-09-01T20:44:55Z", "content": "(CNN)NeNe Leakes' husband, Gregg Leakes, 66, has died.\r\nA representative confirmed the news to CNN in a statement Wednesday.\r\n\"Today the Leakes family is in deep pain with a broken heart. After a lon… [+633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Lost power after Ida? Here's how to safely use a generator", "description": "Incorrectly using a generator can lead to dangers including electrocution, fire or carbon monoxide poisoning. Whether you're without power due to a natural disaster like Hurricane Ida or some other reason, here are seven ways to safely use a generator for you…", "url": "https://www.cnn.com/2021/09/01/health/how-to-use-generator-power-outage-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901132938-generator-hurricane-ida-0828-super-tease.jpg", "publishedAt": "2021-09-01T20:35:55Z", "content": "(CNN)More than a million people have lost power during Hurricane Ida and its aftermath, and some are using backup generators to provide their homes with electricity. \r\n\"When a storm hits and the powe… [+6603 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "White supremacist praise of the Taliban takeover concerns US officials", "description": "As the United States-backed government in Afghanistan fell to the Taliban and US troops raced to leave the country, White supremacist and anti-government extremists have expressed admiration for what the Taliban accomplished, a worrying development for US off…", "url": "https://www.cnn.com/2021/09/01/politics/far-right-groups-praise-taliban-takeover/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901161503-01-taliban-fighters-afghanistan-0901-super-tease.jpg", "publishedAt": "2021-09-01T20:25:04Z", "content": "(CNN)As the United States-backed government in Afghanistan fell to the Taliban and US troops raced to leave the country, White supremacist and anti-government extremists have expressed admiration for… [+9070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson and Ariane de Vogue, CNN", "title": "Texas valedictorian, who spoke out against state's impending abortion law, calls new ban 'heart-wrenching'", "description": "A Texas high school valedictorian, who went viral after she changed her speech to speak out against the state's newly passed abortion law, reacted to the news that the abortion ban will not be stopped by the courts.", "url": "https://www.cnn.com/2021/09/01/us/paxton-smith-reacts-to-texas-abortion-law-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901135501-screengrab-paxton-smith-cnn-09-01-2021-super-tease.jpg", "publishedAt": "2021-09-01T20:11:58Z", "content": "(CNN)A Texas high school valedictorian, who went viral after she changed her speech to speak out against the state's newly passed abortion law, reacted to the news that the abortion ban will not be s… [+2414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "Top Biden economic aides join Senate Democrat call in push before debt ceiling fight", "description": "Two top Biden administration economic officials joined a call with top Senate Democratic aides on Wednesday as the White House pressed to maintain unified strategy for the looming fight over the debt ceiling, according to multiple people familiar with the cal…", "url": "https://www.cnn.com/2021/09/01/politics/debt-ceiling-fight-joe-biden-aides-senate-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714142031-03-biden-us-capitol-schumer-0714-super-tease.jpg", "publishedAt": "2021-09-01T19:55:45Z", "content": "(CNN)Two top Biden administration economic officials joined a call with top Senate Democratic aides on Wednesday as the White House pressed to maintain unified strategy for the looming fight over the… [+2605 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter, CNN", "title": "How to weigh Labor Day holiday risks, whether you're vaccinated or not", "description": "As Americans mark the Labor Day holiday weekend during a pandemic surge, people want to know whether they can still travel and visit with family and friends. CNN Medical Analyst Dr. Leana Wen has updated advice.", "url": "https://www.cnn.com/2021/09/01/health/labor-day-2021-what-to-do-pandemic-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628141837-leana-wen-safely-travel-unvaccinated-children-wellness-orig-dp-00000000-super-tease.png", "publishedAt": "2021-09-01T19:42:41Z", "content": "(CNN)As the Labor Day holiday nears, many people are planning travel and get-togethers to see family and friends. \r\nUnfortunately, this is occurring at the same time Covid-19 rates are climbing. The … [+7417 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Amid turmoil and grief, Jill Biden travels to visit face-to-face with military families", "description": "First lady Jill Biden on Wednesday traveled to the Marine Corps Base at Camp Lejeune in Jacksonville, North Carolina, a trip that, according to the White House, included meetings with military families.", "url": "https://www.cnn.com/2021/09/01/politics/jill-biden-military-families-visit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901152946-01-jill-biden-dover-0829-super-tease.jpg", "publishedAt": "2021-09-01T19:41:30Z", "content": "(CNN)First lady Jill Biden on Wednesday traveled to the Marine Corps Base at Camp Lejeune in Jacksonville, North Carolina, a trip that, according to the White House, included meetings with military f… [+2797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Amid turmoil and grief, Jill Biden travels to visit face-to-face with military families", "description": "First lady Jill Biden on Wednesday traveled to the Marine Corps Base at Camp Lejeune in Jacksonville, North Carolina, a trip that, according to the White House, included meetings with military families.", "url": "https://www.cnn.com/2021/09/01/politics/jill-biden-military-families-visit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901152946-01-jill-biden-dover-0829-super-tease.jpg", "publishedAt": "2021-09-01T19:41:30Z", "content": "(CNN)First lady Jill Biden on Wednesday traveled to the Marine Corps Base at Camp Lejeune in Jacksonville, North Carolina, a trip that, according to the White House, included meetings with military f… [+2797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden to visit storm-ravaged Louisiana", "description": "President Joe Biden will visit storm-ravaged Louisiana on Friday as the state attempts to recover from the category 4 Hurricane Ida that plowed into the Gulf Coast over the weekend.", "url": "https://www.cnn.com/2021/09/01/politics/biden-louisiana/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830141349-02-biden-fema-0830-super-tease.jpg", "publishedAt": "2021-09-01T19:10:53Z", "content": "(CNN)President Joe Biden will visit storm-ravaged Louisiana on Friday as the state attempts to recover from the category 4 Hurricane Ida that plowed into the Gulf Coast over the weekend.\r\nThe White H… [+2025 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'AGT' 10-year-old singer wins over judges after miscue", "description": "One of \"America's Got Talent's\" youngest contestants, Peter Rosalita, shows he is unflappable after a miscue at the start of his vocal performance.", "url": "https://www.cnn.com/videos/media/2021/09/01/agt-peter-rosalita-song-mishap-orig-bdk.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901140331-simon-cowell-peter-rosalita-split-super-tease.jpg", "publishedAt": "2021-09-01T19:02:57Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "How to start the Mediterranean diet — meal by meal", "description": "Considered one of the healthiest diets in the world, the Mediterranean way of eating cuts processed foods and red meats, focusing instead on fresh fruits and vegetables, nuts and seeds, healthy whole grains and extra-virgin olive oil.", "url": "https://www.cnn.com/2021/09/01/health/mediterranean-diet-recipes-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831155741-48-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:32:27Z", "content": "(CNN)Considered one of the healthiest diets in the world, the Mediterranean way of eating cuts processed foods and red meats, focusing instead on fresh fruits and vegetables, nuts and seeds, healthy … [+4702 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "'Shark Tank' star Daymond John, DJ Spinderella and more honored for mentoring youth", "description": "You know Daymond John as a powerhouse entrepreneur as well as a judge on \"Shark Tank\" and DJ Spinderella as part of the groundbreaking female rap group Salt-N-Peppa, but behind the scenes, they are busy giving back.", "url": "https://www.cnn.com/2021/09/01/entertainment/daymond-john-sister-accord-leadership-award/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901142005-daymond-john-spinderella-split-super-tease.jpg", "publishedAt": "2021-09-01T18:22:58Z", "content": "(CNN)You know Daymond John as a powerhouse entrepreneur as well as a judge on \"Shark Tank\" and DJ Spinderella as part of the groundbreaking female rap group Salt-N-Peppa, but behind the scenes, they … [+1317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Salmon With Roasted Grape Salsa", "description": "Salmon is rich in essential omega-3 fatty acids, and the roasted grape salsa on top of the dish brings out a burst of sweet and tart flavors.", "url": "https://www.cnn.com/2021/09/01/health/salmon-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211145-06b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:22:22Z", "content": "(CNN)The roasted grape salsa topping this salmon dish brings out a burst of sweet and tart flavors. Salmon is rich in essential omega-3 fatty acids and known for its heart-healthy benefits. Grapes pr… [+2312 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Warm Farro Grain Salad With Pomegranate", "description": "This farro grain salad combines roasted vegetables, feta and pomegranate seeds for a delightful mix of textures and flavors.", "url": "https://www.cnn.com/2021/09/01/health/farro-grain-salad-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211131-34b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:20:51Z", "content": "(CNN)Rich in fiber and protein, this grain salad has farro, an ancient Mediterranean grain, as its base. A pantry staple in Italy, this whole grain has a chewy texture and nutty flavor that combines … [+2949 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Green Shakshuka With Basil and Toasted Pine Nuts", "description": "This green shakshuka is a spin on the traditional tomato shakshuka. Featuring fresh spinach and basil leaves, poached eggs, and toasted pine nuts, this one-skillet dish is a crowd-pleaser and the ideal brunch meal.", "url": "https://www.cnn.com/2021/09/01/health/shakshuka-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211242-26b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:19:18Z", "content": "(CNN)This green shakshuka is a spin on the traditional tomato shakshuka. It features fresh spinach and basil leaves, poached eggs, and toasted pine nuts. Eggs are rich in protein, vitamin D, choline,… [+2070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Za'atar and Rosemary Spiced Roasted Almonds", "description": "Za'atar is a traditional Middle Eastern spice blend that combines thyme, oregano, sumac and sesame seeds. Add it to roasted almonds for a tangy, nutty bite.", "url": "https://www.cnn.com/2021/09/01/health/roasted-almonds-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211118-21b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:17:29Z", "content": "(CNN)Za'atar is a traditional Middle Eastern spice blend that combines thyme, oregano, sumac and sesame seeds. Add it to almonds for a tangy, nutty bite. \r\nIf you already have a prepared za'atar spic… [+1502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Strawberry Ricotta Granola Parfaits", "description": "The protein-rich ricotta and high-fiber oats provide the perfect combo for a healthy yet decadent strawberry parfait dessert.", "url": "https://www.cnn.com/2021/09/01/health/healthy-dessert-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211103-10b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:14:43Z", "content": "(CNN)Ricotta is whipped with cream cheese to give a thick, rich filling that complements crunchy granola and juicy strawberries. The protein-rich ricotta and high-fiber oats provide the perfect combo… [+2175 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Vegetable Frittata Egg Muffins", "description": "Whip up a batch of these make-ahead egg muffins for quick, satisfying breakfasts on the go.", "url": "https://www.cnn.com/2021/09/01/health/vegetable-frittata-egg-muffins-recipe-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211158-29b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:13:16Z", "content": "(CNN)Whip up a batch of these make-ahead egg muffins for quick, satisfying breakfasts on the go. Eggs are high in protein, which means greater fullness from your morning meal. These vegetable frittat… [+725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Suzana Camargo", "title": "Hurricanes are getting scarier", "description": "Predicting with accuracy where Hurricane Ida would make landfall was an amazing feat, writes Suzana Camargo, given how difficult it is to make reliable hurricane intensity forecasts days in advance -- in particular in cases that involve periods of rapid inten…", "url": "https://www.cnn.com/2021/09/01/opinions/hurricanes-are-getting-scarier-camargo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831123109-36-hurricane-ida-0830-super-tease.jpg", "publishedAt": "2021-09-01T18:12:07Z", "content": "Suzana J. Camargo is the Marie Tharp Lamont Research Professor at the Lamont-Doherty Earth Observatory of Columbia University. The opinions expressed in this commentary are solely her own. View more … [+4064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers and Ali Zaslav, CNN", "title": "McConnell: 'There isn't going to be an impeachment' of Biden", "description": "Senate Republican Leader Mitch McConnell said Wednesday that \"there isn't going to be an impeachment\" of President Joe Biden over the withdrawal of US troops from Afghanistan, noting that Democrats control the House and Senate.", "url": "https://www.cnn.com/2021/09/01/politics/mitch-mcconnell-impeachment-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200830232940-joe-biden-mitch-mcconnell-photo-split-super-tease.jpg", "publishedAt": "2021-09-01T18:11:19Z", "content": "(CNN)Senate Republican Leader Mitch McConnell said Wednesday that \"there isn't going to be an impeachment\" of President Joe Biden over the withdrawal of US troops from Afghanistan, noting that Democr… [+1319 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Whipped Greek Yogurt With Cardamom, Date and Pistachios", "description": "Elevate your breakfast by whipping whole-milk Greek yogurt with warm cardamom spice and a topping of medjool dates and pistachios.", "url": "https://www.cnn.com/2021/09/01/health/yogurt-breakfast-recipe-mediterranean-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211227-40b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:09:52Z", "content": "(CNN)Elevate your breakfast by whipping Greek yogurt with warm cardamom spice. A topping of medjool dates adds sweetness and pistachios lend crunch. Whole-milk Greek yogurt is rich in protein compare… [+1188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rahaf Al Bochi, CNN", "title": "Mediterranean Pita Bread Pizza", "description": "Create a pizza masterpiece using whole-wheat pitas for fiber and an array of Mediterranean ingredients for a wholesome, kid-pleasing meal.", "url": "https://www.cnn.com/2021/09/01/health/pita-bread-pizza-mediterranean-recipe-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831211213-16b-cnnphotos-eat-but-better-med-restricted-super-tease.jpg", "publishedAt": "2021-09-01T18:02:27Z", "content": "(CNN)This kid-pleasing meal is easy and wholesome. The pizza comes together in no time, using pita bread and simple Mediterranean pantry staples. The whole-wheat pita adds a boost of fiber. Invite yo… [+1492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "'Majority' of Afghans who worked for the US and applied for visas were likely left behind, State Department official says", "description": "\"The majority\" of Afghans who worked for the United States during its two-decade military campaign were likely left behind in the chaotic and rushed evacuation from Afghanistan, a senior State Department official said Wednesday.", "url": "https://www.cnn.com/2021/09/01/politics/state-department-official-sivs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210824202149-kabul-airport-0824-super-tease.jpg", "publishedAt": "2021-09-01T17:49:54Z", "content": "(CNN)\"The majority\" of Afghans who worked for the United States during its two-decade military campaign were likely left behind in the chaotic and rushed evacuation from Afghanistan, a senior State D… [+4492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peniel E. Joseph", "title": "'Jeopardy!' clue: The person who eventually gets the beloved position on television she/he should have had all along", "description": "Peniel Joseph says the ouster of Mike Richards as executive producer at \"Jeopardy!\" is a reminder of how hard it is to fight systemic inequality and describes what it would mean for fans like him to see LeVar Burton on the screen as permanent host.", "url": "https://www.cnn.com/2021/09/01/opinions/jeopardy-levar-burton-host-mike-richards-out-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210421171654-levar-burton-file-2019-super-tease.jpg", "publishedAt": "2021-09-01T17:38:23Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+7252 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "It's not your imagination. Weather and climate disasters have been getting more frequent since the '70s", "description": "Each extreme weather and climate-related disaster carried an average economic loss of a staggering $383 million. The economic toll of these disasters has climbed seven-fold since the 1970s.", "url": "https://www.cnn.com/2021/09/01/weather/extreme-weather-climate-change-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901094327-sierra-at-tahoe-ski-resort-caldor-fire-super-tease.jpg", "publishedAt": "2021-09-01T17:36:43Z", "content": "(CNN)An extreme weather event or climate disaster has occurred every day, on average, somewhere in the world over the last 50 years, marking a five-fold increase over that period, a new UN analysis s… [+4879 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden blasts Texas' 6-week abortion ban as 'extreme' and violation of a constitutional right", "description": "President Joe Biden on Wednesday blasted the Texas state law that bans abortion after as early as six weeks into pregnancy as \"extreme\" and said it \"blatantly violates\" a woman's constitutional right to have an abortion, as affirmed by the landmark Supreme Co…", "url": "https://www.cnn.com/2021/09/01/politics/biden-texas-abortion-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901090413-05-biden-afghanistan-presser-0831-super-tease.jpg", "publishedAt": "2021-09-01T17:20:03Z", "content": "(CNN)President Joe Biden on Wednesday blasted the Texas state law that bans abortion after as early as six weeks into pregnancy as \"extreme\" and said it \"blatantly violates\" a woman's constitutional … [+2371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Yellin", "title": "5 great ways to travel for free with the 80,000 bonus points on the Citi Premier credit card", "description": "While you can always redeem the Citi ThankYou points earned on the Citi Premier card for flights through the Citi travel portal, here are some of our favorite ways to get even more value for them by transferring them to Citi's partner airlines.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/best-ways-to-use-citi-thank-you-points/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210901011701-underscored-family-walking-on-beach-sand-next-to-ocean-sunset.jpg?q=x_0,y_0,h_1800,w_3200,c_fill/w_800", "publishedAt": "2021-09-01T17:00:21Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+9416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stella Chan and Eric Levenson, CNN", "title": "Grand jury indicts police officers and paramedics in death of Elijah McClain", "description": "A Colorado grand jury has indicted five police officers and paramedics involved in the August 2019 death of Elijah McClain, a 23-year-old Black man who was stopped by police while walking home from a store, put in a carotid hold and then injected with ketamin…", "url": "https://www.cnn.com/2021/09/01/us/elijah-mcclain-death-officers-charged/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200625020242-03-elijah-mcclain-super-tease.jpg", "publishedAt": "2021-09-01T16:55:54Z", "content": "(CNN)A Colorado grand jury has indicted five police officers and paramedics involved in the August 2019 death of Elijah McClain, a 23-year-old Black man who was stopped by police while walking home f… [+2079 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Confusion reigns in Texas as new law aims to restrict how race and history is taught in schools", "description": "A new Texas law aimed at restricting discussions of race and history in schools has some educators second guessing themselves and forgoing civics-related activities to avoid running afoul of it.", "url": "https://www.cnn.com/2021/09/01/us/texas-critical-race-theory-social-studies-law/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901102830-austin-texas-state-capitol-07-08-2021-super-tease.jpg", "publishedAt": "2021-09-01T16:51:07Z", "content": "San Antonio, Texas (CNN)A new Texas law aimed at restricting discussions of race and history in schools has some educators second guessing themselves and forgoing civics-related activities to avoid r… [+7626 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Power could be out for weeks in Louisiana. Avoiding long outages will be incredibly expensive", "description": "The power is off for nearly a million customers in Louisiana after a Category 4 storm slammed into the region. But that's not the biggest problem facing the storm-ravaged state: It's the possibility of perhaps hundreds of thousands of people going weeks, if n…", "url": "https://www.cnn.com/2021/09/01/business/hurricane-ida-fixing-electrical-grid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901082909-02-louisiana-electrical-outage-0831-super-tease.jpg", "publishedAt": "2021-09-01T16:30:10Z", "content": "New York (CNN Business)The power is off for nearly a million customers in Louisiana after a Category 4 storm slammed into the region. But that's not the biggest problem facing the storm-ravaged state… [+6558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judson Jones, CNN Meteorologist", "title": "Before-and-after aerial images show devastation left by Ida in Louisiana", "description": "Until a hurricane like Ida passes, it's difficult to know what kind of damage has been done. It isn't until days after the storm makes landfall that images like those below emerge, clearly showing the destruction left in the storm's wake.", "url": "https://www.cnn.com/2021/09/01/weather/ida-before-and-after-imagery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901110728-ida-before-after-card-image-super-tease.jpg", "publishedAt": "2021-09-01T16:26:08Z", "content": "By Judson Jones, CNN Meteorologist\r\nUpdated 12:26 PM ET, Wed September 1, 2021\r\n (CNN)Until a hurricane like Ida passes, it's difficult to know what kind of damage has been done. It isn't until days … [+669 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam and Holmes Lybrand, CNN", "title": "Fact check: Afghans coming to US are not 'unvetted refugees'", "description": "On Monday, the last American military planes left Afghanistan, bringing weeks of evacuations to a close and raising questions about what's next for thousands of Afghans the US helped evacuate.", "url": "https://www.cnn.com/2021/09/01/politics/afghan-vetting-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825175927-01-afghan-evacuees-dulles-airport-0825-super-tease.jpg", "publishedAt": "2021-09-01T16:14:56Z", "content": "Washington (CNN)On Monday, the last American military planes left Afghanistan, bringing weeks of evacuations to a close and raising questions about what's next for thousands of Afghans the US helped … [+5932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson and Gary Tuchman, CNN", "title": "Louisiana's last inhabited barrier island bore the brunt of Hurricane Ida. Here's what it looks like now", "description": "Grand Isle, Louisiana's last remaining inhabited barrier island at the southern tip of the state, bore the brunt of Hurricane Ida and was devastated by the Category 4 storm's high winds, rain and storm surge.", "url": "https://www.cnn.com/2021/09/01/us/grand-isle-louisiana-ida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901093905-02-grand-isle-hurricane-ida-0831-super-tease.jpg", "publishedAt": "2021-09-01T16:03:27Z", "content": "(CNN)Grand Isle, Louisiana's last remaining inhabited barrier island at the southern tip of the state, bore the brunt of Hurricane Ida and was devastated by the Category 4 storm's high winds, rain an… [+2771 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jean Casarez, CNN", "title": "USA Gymnastics and abuse victims propose a $425 million settlement in bankruptcy court", "description": "USA Gymnastics is proposing a $425 million settlement with sexual abuse victims as part of a reorganization plan submitted jointly with a court-appointed Committee of Sexual Abuse survivors amid bankruptcy proceedings.", "url": "https://www.cnn.com/2021/09/01/us/usa-gymnastics-proposed-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210820115754-larry-nassar-02-05-2018-super-tease.jpg", "publishedAt": "2021-09-01T16:02:21Z", "content": "(CNN)USA Gymnastics is proposing a $425 million settlement with sexual abuse victims as part of a reorganization plan submitted jointly with a court-appointed Committee of Sexual Abuse survivors amid… [+1570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Ann M. Ravel and Kristin Urquiza for CNN Business Perspectives", "title": "Fighting vaccine disinformation is crucial to ending the pandemic", "description": "With more than 600,000 people lost to Covid in the US and case numbers surging yet again, fighting disinformation is critical to ending the pandemic and decreasing health disparities for generations to come.", "url": "https://www.cnn.com/2021/09/01/perspectives/vaccine-disinformation-social-media/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901094953-vaccine-protesters-us-0806-super-tease.jpg", "publishedAt": "2021-09-01T15:55:12Z", "content": "Ann M. Ravel is the Digital Deception Project director at MapLight and previously served as chair of the Federal Election Commission. Kristin Urquiza is co-founder of Marked By Covid. The opinions ex… [+5504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Amazon adding 55,000 employees globally in first hiring push under CEO Andy Jassy", "description": "After growing its workforce to more than 1.3 million people in 2020, Amazon is planning to hire another 55,000 employees globally in the coming months, the company announced Wednesday.", "url": "https://www.cnn.com/2021/09/01/tech/amazon-hiring-andy-jassy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901104453-amazon-global-corporate-hiring-restricted-super-tease.jpg", "publishedAt": "2021-09-01T15:43:17Z", "content": "New York (CNN Business)After growing its workforce to more than 1.3 million people in 2020, Amazon is planning to hire another 55,000 employees globally in the coming months, the company announced We… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Elago's W3 Stand is the perfect way to charge your Apple Watch", "description": "The W3 charging stand from Elago isn't just adorable, it's also surprisingly functional for charging your Apple Watch. The compact piece of rubber resembles the original Macintosh all-in-one desktop.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/elago-w3-apple-watch-stand-classic-mac/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210901112321-elago-w3-stand.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T15:35:37Z", "content": "The W3 charging stand from Elago isnt just adorable, its also surprisingly functional for charging your Apple Watch. The compact piece of rubber resembles the original Macintosh all-in-one desktop. \r… [+1160 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Republican congressman went totally rogue as he tried to get into Afghanistan", "description": "It's like the plot of a (bad) thriller movie.", "url": "https://www.cnn.com/2021/09/01/politics/markwayne-mullin-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901091540-rep-markwayne-mullin-super-tease.jpg", "publishedAt": "2021-09-01T15:35:32Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Amtrak might add more than 50 new routes. But they still won't be faster than a car", "description": "The $1 trillion infrastructure bill appears set to give passenger and freight rail $66 billion, an infusion that will likely expand where service is offered but does little to increase the speed of train travel in the US.", "url": "https://www.cnn.com/2021/09/01/tech/amtrak-speed-trains/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825173959-amtrak-train-potomac-river-file-restricted-super-tease.jpg", "publishedAt": "2021-09-01T15:23:56Z", "content": "Washington, DC (CNN)The $1 trillion infrastructure bill appears set to give passenger and freight rail $66 billion, an infusion that will likely expand where service is offered but does little to inc… [+6998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sheena McKenzie, CNN", "title": "Air pollution is cutting more years from people's lives than smoking, war or HIV/AIDS", "description": "Air pollution is slashing years from billions of people's lives around the world and is a greater threat to life expectancy than smoking, HIV/AIDS or war, a report published Wednesday shows.", "url": "https://www.cnn.com/2021/09/01/world/air-pollution-life-expectancy-climate-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901094145-air-pollution-india-0128-file-super-tease.jpg", "publishedAt": "2021-09-01T15:23:08Z", "content": "(CNN)Air pollution is slashing years from billions of people's lives around the world and is a greater threat to life expectancy than smoking, HIV/AIDS or war, a report published Wednesday shows.\r\nIn… [+4780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlyn McInnis", "title": "Here's how to rock a Canadian tuxedo all autumn long", "description": "The Canadian tuxedo first made international waves when Britney Spears and Justin Timberlake donned matching patchwork denim ensembles at the American Music Awards together more than two decades ago — but Canadians have been wearing double denim in significan…", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/canada-canadian-tuxedo/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831090111-canada-canadian-tuxedo-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T15:20:04Z", "content": "The Canadian tuxedo first made international waves when Britney Spears and Justin Timberlake donned matching patchwork denim ensembles at the American Music Awards together more than two decades ago … [+7268 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "These ancient climate change events helped early humans migrate across the Arabian desert", "description": "Stone tools and ancient animal fossils have revealed that early humans were in Arabia 400,000 years ago. Prehistoric climate change may have created lush grasslands that made it easier for animals and humans to migrate across what are now vast deserts.", "url": "https://www.cnn.com/2021/09/01/world/early-humans-arabia-migration-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901101922-restricted-03-arabian-desert-ancient-lakes-super-tease.jpg", "publishedAt": "2021-09-01T15:05:50Z", "content": "(CNN)Stone tools and ancient animal fossils have revealed that early humans were in Arabia 400,000 years ago. Prehistoric climate change may have encouraged their travels across what are now vast str… [+5447 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Washington Post: GOP congressman threatened US embassy staff in trying to enter Afghanistan", "description": "Republican Rep. Markwayne Mullin threatened US embassy staff in Tajikistan, outraged that they would not assist him in carrying a huge amount of money through the country as he attempted to travel to Afghanistan for an unauthorized evacuation effort, The Wash…", "url": "https://www.cnn.com/2021/09/01/politics/markwayne-mullin-afghanistan-threatens-embassy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831161009-02-rep-markwayne-mullin-super-tease.jpg", "publishedAt": "2021-09-01T15:02:52Z", "content": "(CNN)Republican Rep. Markwayne Mullin threatened US embassy staff in Tajikistan, outraged that they would not assist him in carrying a huge amount of money through the country as he attempted to trav… [+4000 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico and Jacob Krol", "title": "Why the $30 Nest Mini is an essential part of my home", "description": "Here's how the Nest Mini holds up after a solid year of use, and why it's an especially great buy at its new discounted price.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/google-nest-mini-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831163757-nest-mini-lead.jpg?q=x_0,y_0,h_2111,w_3753,c_fill/w_800", "publishedAt": "2021-09-01T15:02:15Z", "content": "Hey Google, play music on Spotify. I utter those same six words at least once a day to my Nest Mini, usually as Im stepping into the bathroom to prepare for an epic shower singalong. Within a second … [+11266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "When school isn't safe: 'You feel like you are sending your child into a lion's den'", "description": "What finally did it for Nathan, the parent of a young child at a small Catholic school in California, was the seating chart that showed how a teacher infected at least 12 of 24 students in her class.", "url": "https://www.cnn.com/2021/09/01/health/schools-parents-covid-teachers-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831221005-stock-schools-parents-covid-teachers-super-tease.jpg", "publishedAt": "2021-09-01T14:57:12Z", "content": "(CNN)What finally did it for Nathan, the parent of a young child at a small Catholic school in California, was the seating chart that showed how a teacher infected at least 12 of 24 students in her c… [+6994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Wolfe and Priya Krishnakumar, CNN", "title": "What the data reveals about children and Covid-19 in the US", "description": "As students and staff return to school, the highly transmissible Delta variant of Covid-19 has caused cases, hospitalizations and death rates to soar across the country.", "url": "https://www.cnn.com/2021/09/01/us/us-covid-kids-data/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901064722-hp-only-new-weekly-cases-chart-super-tease.png", "publishedAt": "2021-09-01T14:57:06Z", "content": "(CNN)As students and staff return to school, the highly transmissible Delta variant of Covid-19 has caused cases, hospitalizations and death rates to soar across the country. Children under 12 are pa… [+3509 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Welcome to September, historically the worst month for stocks", "description": "If you're an investor who knows your market history, you might be tempted to tune out for a bit and start singing Green Day's \"Wake Me Up When September Ends.\" The ninth month is traditionally the worst of the year for stocks.", "url": "https://www.cnn.com/2021/09/01/investing/stock-market-september/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200914154522-nyse-0911-super-tease.jpg", "publishedAt": "2021-09-01T14:52:41Z", "content": "New York (CNN Business)If you're an investor who knows your market history, you might be tempted to tune out for a bit and start singing Green Day's \"Wake Me Up When September Ends.\" The ninth month … [+3276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop today: Chewy, Great Jones, Columbia and more", "description": "Today, you'll find a deal on Chewy, discounted Ring Alarm Kits and savings on Great Jones. All that and more below.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210901101632-0901lead.jpg?q=x_0,y_0,h_1079,w_1919,c_fill/w_800", "publishedAt": "2021-09-01T14:47:15Z", "content": "Today, youll find a deal on Chewy, discounted Ring Alarm Kits and savings on Great Jones. All that and more below.\r\nPet parents, this ones for you and your furry friends. Chewy, the ultimate online p… [+12270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "The leader of the anti-Taliban resistance speaks out", "description": "Afghanistan is entering a new phase in which the Taliban control almost all of the country, but resistance to them is beginning to form. Peter Bergen interviews Ahmad Massoud, the leader of that resistance.", "url": "https://www.cnn.com/2021/09/01/opinions/leader-anti-taliban-resistance-speaks-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210823091405-04-panjshir-valley-northern-alliance-explainer-super-tease.jpg", "publishedAt": "2021-09-01T14:23:55Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen has reported from Afghanistan since 1993. His new book… [+5686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "For misinformation peddlers on social media, it's three strikes and you're out. Or five. Maybe more", "description": "When Twitter suspended Marjorie Taylor Greene for a week last month for posting misinformation about Covid-19 vaccines, it may have sparked some déjà vu. The Republican congresswoman from Georgia had been kicked off the platform for 12 hours for the same viol…", "url": "https://www.cnn.com/2021/09/01/tech/social-media-misinformation-strike-policies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210820134639-twitter-facebook-youtube-instagram-social-media---stock-super-tease.jpg", "publishedAt": "2021-09-01T14:08:49Z", "content": "New York (CNN Business)When Twitter suspended Marjorie Taylor Greene for a week last month for posting misinformation about Covid-19 vaccines, it may have sparked some déjà vu. The Republican congres… [+11002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Britney Spears' lawyer requests her father resign as conservator without payout", "description": "Britney Spears' lawyer wants Jamie Spears to resign as the conservator of his daughter's estate, without the multimillion dollar payout that he is requesting.", "url": "https://www.cnn.com/2021/09/01/entertainment/britney-spears-lawyer-petition-father-jamie-spears-conservator/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812232521-jamie-britney-spears-split-super-tease.jpg", "publishedAt": "2021-09-01T14:02:01Z", "content": "(CNN)Britney Spears' lawyer wants Jamie Spears to resign as the conservator of his daughter's estate, without the multimillion dollar payout that he is requesting. \r\nIn a new court filing obtained by… [+1387 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lesley Kennedy", "title": "20 newly-released books we can't wait to read in September", "description": "September is a great month for adding to your reading lists, with big-name authors releasing sure-to-be bestsellers, a slew of celebs out with new memoirs and a mix of titles that cover everything from cookbooks to mysteries to rom-coms.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/best-books-september-2021/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830113738-septemberbookslead.jpg?q=x_0,y_0,h_1406,w_2499,c_fill/w_800", "publishedAt": "2021-09-01T13:57:57Z", "content": "September signals the start of fall which means three things: The kids are back in school, football season is in full swing and pumpkin spice lattes are already dominating Instagram feeds everywhere.… [+7993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tanya Edwards and Tanya Edwards", "title": "Here's everything you'll want for your home from Wayfair's Labor Day Sale", "description": "Whether you want to make updates to your kitchen, change out accessories for something more fall-appropriate or just add some new furniture, look no further. There are some deals at Wayfair's Labor Day Sale, featuring up to 70% off select items.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/wayfair-labor-day-sale-deals/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831101103-wayfair-labor-day-sale-deals-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T13:57:36Z", "content": "Whether you want to make updates to your kitchen, change out accessories for something more fall-appropriate or just add some new furniture, look no further. There are some deals at Wayfairs Labor Da… [+6524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "Julie Pace is the new executive editor of The Associated Press", "description": "Julie Pace, the political reporter turned Washington bureau chief at The Associated Press, is the news agency's new executive editor.", "url": "https://www.cnn.com/2021/09/01/media/julie-pace-associated-press/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901092100-julie-pace-associated-press-super-tease.jpg", "publishedAt": "2021-09-01T13:51:19Z", "content": "New York (CNN Business)Julie Pace, the political reporter turned Washington bureau chief at The Associated Press, is the news agency's new executive editor.\r\nPace, 39, is succeeding Sally Buzbee, who… [+2037 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lesley Kennedy", "title": "The best Lowe's Labor Day deals to shop now", "description": "As summer unofficially comes to a close, the annual Lowe's Labor Day sale is a great time to stock up on tools, small kitchen appliances and outdoor furniture.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/lowes-labor-day-sales-deals/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831110017-lowes-labor-day-sales-deals-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T13:49:25Z", "content": "As summer unofficially comes to a close, the annual Lowes Labor Day sale is a great time to stock up on tools, small kitchen appliances and outdoor furniture. \r\nNow through September 8 (with some sal… [+7539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianne Ross", "title": "The best Labor Day furniture sales you can shop right now", "description": "Labor Day is almost here, and that means great opportunities to save on all types of furniture to restyle your home.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/labor-day-furniture-sales/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831121923-labor-day-furniture-sales-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T13:43:13Z", "content": "Labor Day is almost here, and that means great opportunities to save on all types of furniture to restyle your home. With summer coming to a close and retailers shifting their seasonal inventory, the… [+7262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lesley Kennedy", "title": "The 20 best deals from The Home Depot's Labor Day Sale", "description": "Now through September 15, you'll find great deals on appliances, patio furniture, smart home items, home decor and more, with up to $100 select items while supplies last.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/home-depot-labor-day-sale/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831100030-the-home-depot.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T13:37:56Z", "content": "Sure, this Labor Day therell be barbecues, camping trips, picnics and a prized day off from work, but the unofficial end of summer also brings with it a slew of amazing sales The Home Depots annual L… [+9055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Ethan Hawke thought Robin Williams 'hated' him on set of 'Dead Poet's Society'", "description": "Ethan Hawke remembered working on 1989's \"Dead Poets Society\" with Robin Williams during a speech at the Karlovy Vary Film Festival, where he picked up the President's Award.", "url": "https://www.cnn.com/2021/09/01/entertainment/ethan-hawke-robin-williams/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170217132426-ethan-hawke-super-tease.jpg", "publishedAt": "2021-09-01T13:34:36Z", "content": "(CNN)Ethan Hawke remembered working on 1989's \"Dead Poets Society\" with Robin Williams during a speech at the Karlovy Vary Film Festival, where he picked up the President's Award. \r\n\"I thought Robin … [+916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "Dyson is offering $150 off stick vacs, air purifiers and more for Labor Day", "description": "Now until Sept. 10, Dyson is offering up to $150 off select items like cordless stick vacuums, air purifiers and upright canister vacuums.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/dyson-labor-day-sale-deals/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830120202-dyson-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-09-01T13:32:59Z", "content": "Theres a lot of hype surrounding Dyson products, and for good reason: The company produces some of the most technologically advanced vacuums, fans, air purifiers and hair styling tools around. That t… [+2388 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Stephen Amell says he 'had too many drinks' before being asked to leave flight", "description": "\"Arrow\" actor Stephen Amell says he feels \"deeply ashamed\" about his behavior aboard a flight in June, before which he \"had too many drinks.\"", "url": "https://www.cnn.com/2021/09/01/entertainment/stephen-amell-delta-flight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901080639-stephen-amell-file-super-tease.jpg", "publishedAt": "2021-09-01T13:30:25Z", "content": "(CNN)\"Arrow\" actor Stephen Amell says he feels \"deeply ashamed\" about his behavior aboard a flight in June, before which he \"had too many drinks.\"\r\nAmell was asked to leave the flight before it depar… [+1159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Noelle Ike", "title": "How to achieve the \"dolphin skin\" makeup trend, according to beauty experts", "description": "According to beauty experts, dolphin skin is a beauty term that's being used to describe a glistening, hydrated makeup look. Read our guide on how to achieve this viral makeup trend right now.", "url": "https://www.cnn.com/2021/09/01/cnn-underscored/dolphin-skin-makeup/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831135356-dolphin-skin-makeup-lead.jpg?q=x_0,y_0,h_1407,w_2501,c_fill/w_800", "publishedAt": "2021-09-01T13:30:23Z", "content": "Theres no shortage of beauty trends and viral makeup tips online. But every so often, well discover a look or trend that just makes perfect sense for the moment were in. And in an age where your skin… [+18437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: The Texas abortion law is a reminder of the Supreme Court stakes for Democrats", "description": "Sometimes doing nothing can be hugely impactful.", "url": "https://www.cnn.com/2021/09/01/politics/democrats-texas-abortion-law-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423144911-stephen-breyer-scotus-2021-super-tease.jpg", "publishedAt": "2021-09-01T13:18:22Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz and Melanie Zanona, CNN", "title": "House panel to debate Afghanistan, China and critical race theory during hearing on defense bill", "description": "Republicans on the House Armed Services Committee are planning to file dozens of amendments on a major defense bill Wednesday that will force Democrats on the panel to vote on a variety of politically fraught issues, from Afghanistan and China, to banning the…", "url": "https://www.cnn.com/2021/09/01/politics/ndaa-markup-amendments-house-military-pentagon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-09-01T13:08:51Z", "content": "(CNN)Republicans on the House Armed Services Committee are planning to file dozens of amendments on a major defense bill Wednesday that will force Democrats on the panel to vote on a variety of polit… [+2292 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "Ida will unleash deadly and damaging flash flooding in the Northeast", "description": "Potentially deadly and damaging flash flooding are possible Wednesday and Wednesday night from parts of the Mid-Atlantic region across southern New York into the southern portion of New England, all caused by the remnants of Hurricane Ida.", "url": "https://www.cnn.com/2021/09/01/weather/ida-flooding-tornado-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901071741-weather-rainfall-forecast-card-20210901-super-tease.jpg", "publishedAt": "2021-09-01T13:02:47Z", "content": "The @NWSWPC has most of our area in a high risk of excessive rain Wed-Wed night. This signals high potential for significant flooding impacts. The last time some of our area was in a high risk: 3/13/… [+165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "The skeleton of the world's biggest Triceratops goes on sale", "description": "The skeleton of a 66-million-year-old giant Triceratops fossil could soon belong to a lucky dinosaur enthusiast -- that is, if they have an estimated 1.2 million euros ($1.4 million) to spare.", "url": "https://www.cnn.com/style/article/dinosaur-auction-triceratops-intl-scli-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901095730-01-big-john-triceratops-auction-super-tease.jpg", "publishedAt": "2021-09-01T12:58:52Z", "content": "luxuryUpdated 1st September 2021\r\nThe skeleton of a 66-million-year-old giant Triceratops fossil could soon belong to a lucky dinosaur enthusiast -- that is, if they have an estimated 1.2 million eur… [+2910 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore and Nathaniel Meyersohn, CNN Business", "title": "Walmart is looking to hire 20,000 supply chain workers", "description": "Walmart is looking to hire 20,000 workers for its distribution and fulfillment centers, trying to fill some of the most high-demand jobs in retail as the pandemic continues to disrupt the global supply chain.", "url": "https://www.cnn.com/2021/09/01/business/walmart-hiring-supply-chain/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901080704-walmart-us-warehouse-0108-restricted-super-tease.jpg", "publishedAt": "2021-09-01T12:41:16Z", "content": "New York (CNN Business)Walmart is looking to hire 20,000 workers for its distribution and fulfillment centers, trying to fill some of the most high-demand jobs in retail as the pandemic continues to … [+1073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet, Madeleine Stix and Ana Maria Luengo-Romero, CNN", "title": "A mother and her four daughters were separated at the border in 2018. This is what they lost", "description": "US authorities separated Juana from her four young daughters at the Mexico border in 2018. For three agonizing years, they could only communicate by phone. Then came good news.", "url": "https://www.cnn.com/2021/09/01/us/us-mexico-border-family-separation-mother-daughters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811100629-restricted-family-separation-juana-hugs-daughters-super-tease.jpg", "publishedAt": "2021-09-01T12:39:19Z", "content": "By Catherine E. Shoichet, Madeleine Stix and Ana Maria Luengo-Romero, CNN\r\nUpdated 8:39 AM ET, Wed September 1, 2021\r\n (CNN)Casandra shouts to her sister as she races to her bedroom. \r\nIt's a relief.… [+17690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "After Hurricane Ida, here's how to get help and stay safe in the difficult weeks ahead", "description": "The logistical nightmares can be overwhelming. Here's how survivors can avoid post-hurricane hazards, get help, protect their emotional health and take the first steps toward recovery.", "url": "https://www.cnn.com/2021/09/01/us/hurricane-ida-help-safety-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830154029-13-hurricane-ida-0830-kenner-la-super-tease.jpg", "publishedAt": "2021-09-01T12:34:25Z", "content": "(CNN)Hurricane Ida victims returning to damaged homes face a torrent of challenges -- if they're lucky enough to have a home standing at all. \r\nIn the most devastated places, \"Power outages will last… [+8094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Renjifo, CNN", "title": "African artists are banking on a record-breaking contemporary and modern art market", "description": "For Abidjan-based artist Saint-Étienne Yéanzi, the continent's social and political reality has sparked a creative evolution for contemporary African artists, he says, giving them confidence to work and stay in Africa.", "url": "https://www.cnn.com/style/article/contemporary-modern-african-art-market-mpa-spc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825184002-vumedi-el-anatsui-2020-super-tease.jpg", "publishedAt": "2021-09-01T12:29:24Z", "content": "artsUpdated 1st September 2021\r\nFor Abidjan-based artist Saint-Étienne Yéanzi, the continent's social and political reality has sparked a creative evolution for contemporary African artists, he says,… [+3065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "There's another big risk brewing in China", "description": "There are a number of reasons for global investors to be keeping close watch on China, from signs its economy is slowing to Beijing's disruptive crackdown on private business. But the list doesn't end there.", "url": "https://www.cnn.com/2021/09/01/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901071910-evergrande-hong-kong-0723-file-restricted-super-tease.jpg", "publishedAt": "2021-09-01T12:23:13Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)There are a number of reasons for global invest… [+6084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, CNN", "title": "100,000 more could die from Covid-19 in US by December", "description": "Health leaders are calling on unvaccinated Americans to get the shot or risk tens of thousands more deaths by the end of the year.", "url": "https://www.cnn.com/2021/09/01/world/coronavirus-newsletter-intl-1-09-21-duplicate-2/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-09-01T11:54:33Z", "content": "This is the weekly edition of CNN's coronavirus newsletter. Look out for your roundup every Wednesday. If you haven't subscribed yet, sign up here.\r\n (CNN)While hospitals around the United States rep… [+6778 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "In a 'sea change' for the agency, CDC is sharing data earlier", "description": "Earlier this summer, Dr. Rochelle Walensky, director of the US Centers for Disease Control and Prevention made a call to Dr. Eric Rubin, editor in chief of the New England Journal of Medicine, asking him to do something unconventional.", "url": "https://www.cnn.com/2021/09/01/health/cdc-data-timing-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602215558-cdc-super-tease.jpg", "publishedAt": "2021-09-01T11:43:31Z", "content": "(CNN)Earlier this summer, Dr. Rochelle Walensky, director of the US Centers for Disease Control and Prevention made a call to Dr. Eric Rubin, editor in chief of the New England Journal of Medicine, a… [+8400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "US stocks look to rebound", "description": "Here's the latest news on what stocks are doing.", "url": "https://www.cnn.com/business/live-news/stock-market-news-090121/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825113253-nyse-0720-super-tease.jpg", "publishedAt": "2021-09-01T10:30:04Z", "content": "Google has yet again postponed a full return to the office, announcing that its employees can continue to work remotely until next year\r\n. The decision follows similar ones already made by the compan… [+344 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Rebecca Soffer, CNN", "title": "What it's like to take a road trip from the US to Canada right now", "description": "After months of closure, the US-Canada border is now open to travelers without quarantine. Writer Rebecca Soffer discovers whether the trip -- with unvaccinated kids in tow -- is worth the hassle of the tests and paperwork.", "url": "https://www.cnn.com/travel/article/canada-road-trip-covid-unvaccinated-kids/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901104534-210831163358-08-canada-family-roadtrip-travel-photos-super-tease.jpg", "publishedAt": "2021-09-01T10:23:24Z", "content": "(CNN) \"We're driving to Canada.\"\r\nThat was the first thing I said last month after reading that the Canadian government would open its border to nonessential travel for fully vaccinated US citizens a… [+8693 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "What is the legal status of Afghans coming to the US? It varies", "description": "More than 122,000 people have been evacuated from Afghanistan, all with varying legal statuses and needs as many of them arrive in the United States.", "url": "https://www.cnn.com/2021/09/01/politics/afghanistan-evacuation-legal-status/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210826190205-21-week-in-photos-0826-super-tease.jpg", "publishedAt": "2021-09-01T10:02:00Z", "content": "(CNN)More than 122,000 people have been evacuated from Afghanistan, all with varying legal statuses and needs as many of them arrive in the United States. \r\nSome are US citizens, others Afghan interp… [+6303 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Kevin Liptak, CNN", "title": "Ukrainian President to accomplish years-long quest for a White House visit with Biden meeting", "description": "Ukrainian President Volodymyr Zelensky is set to meet with President Joe Biden in Washington on Wednesday, the culmination of a years-long struggle to get a White House visit locked up that -- at one point -- saw him at the center of US politics.", "url": "https://www.cnn.com/2021/09/01/politics/ukraine-volodymyr-zelensky-biden-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831203124-ukraine-volodymyr-zelensky-biden-white-house-super-tease.jpg", "publishedAt": "2021-09-01T09:24:03Z", "content": "(CNN)Ukrainian President Volodymyr Zelensky is set to meet with President Joe Biden in Washington on Wednesday, the culmination of a years-long struggle to get a White House visit locked up that -- a… [+5656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva Rothenberg, CNN", "title": "Erase or embrace: How should TV shows and movies depict the pandemic?", "description": "Fictional accounts of Covid-19 may still be too real for some viewers, but popular media could ultimately help people process trauma.", "url": "https://www.cnn.com/style/article/covid-tv-shows-movies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825220851-03-covid-tv-shows-films-contagion-super-tease.jpg", "publishedAt": "2021-09-01T09:15:51Z", "content": "artsPublished 1st September 2021\r\nWhen \"Locked Down\" premiered in January, it provoked eye rolls from critics. Telling the story of a couple whose imminent separation is put on hold by a stay-at-home… [+9153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Atika Shubert, CNN", "title": "The Kabul airlift has ended, but a US operation to get 14,000 people off a base in Germany is far from over", "description": "From his office window, Brigadier General Joshua Olson can see a daily football match organized by the Afghan children who are temporarily calling his air base home.", "url": "https://www.cnn.com/2021/09/01/europe/ramstein-air-base-afghan-evacuees-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831144925-03-ramstein-air-base-afghan-evacuees-intl-cmd-super-tease.jpg", "publishedAt": "2021-09-01T08:52:45Z", "content": "We forget the sacrifices for the last 20 years that the military has borne for a lot of these new Afghan-Americans' freedom.\"\r\nBrigadier General Joshua Olsoon, installation commander at Ramstein Air … [+14 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN", "title": "Meet the entrepreneur teaching computers to understand human emotions", "description": "Computers are smart. They store and process vast amounts of data in the blink of an eye, translate language instantaneously, and even operate machinery. But they have the same emotional intelligence as a brick wall.", "url": "https://www.cnn.com/2021/09/01/world/rana-el-kaliouby-affectiva-emotion-ai-hnk-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629052957-02-rana-el-kaliouby-affectiva-emotion-ai-hnk-spc-intl-super-tease.jpg", "publishedAt": "2021-09-01T08:38:58Z", "content": "(CNN)Computers are smart. They store and process vast amounts of data in the blink of an eye, translate language instantaneously, and even operate machinery. But they have the same emotional intellig… [+5300 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "CDC asks nearly 80 million unvaccinated Americans not to travel for Labor Day as US averages 160,000 daily Covid-19 cases", "description": "Due to the surge of Covid-19 cases, the director of the US Centers for Disease Control and Prevention is asking unvaccinated Americans not to travel during the Labor Day holiday weekend.", "url": "https://www.cnn.com/2021/09/01/health/us-coronavirus-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901025319-covid-testing-florida-0830-super-tease.jpg", "publishedAt": "2021-09-01T08:00:45Z", "content": "(CNN)Due to the surge of Covid-19 cases, the director of the US Centers for Disease Control and Prevention is asking unvaccinated Americans not to travel during the Labor Day holiday weekend.\r\nThe US… [+5667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Trails and campgrounds near Yosemite where a family and their dog were found dead have been closed because of 'unknown hazards,' officials say", "description": "Federal forest officials closed trails and campgrounds in a remote area near Yosemite National Park because of \"unknown hazards\" located in the area where a family and their dog were mysteriously found dead last month.", "url": "https://www.cnn.com/2021/09/01/us/yosemite-campgrounds-closed-family-death-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901021444-yosemite-campgrounds-closed-family-death-super-tease.jpg", "publishedAt": "2021-09-01T07:53:11Z", "content": "(CNN)Federal forest officials closed trails and campgrounds in a remote area near Yosemite National Park because of \"unknown hazards\" located in the area where a family and their dog were mysteriousl… [+3553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi and Joe Sutton, CNN", "title": "Lake Tahoe resort city faces critical hours as the Caldor Fire closes in, threatening 34,000 structures", "description": "The Caldor Fire, which has forced the evacuation of thousands of people from a popular California tourist town, is now threatening more than 34,000 structures after already destroying hundreds of homes, officials said.", "url": "https://www.cnn.com/2021/09/01/weather/us-western-wildfires-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210901004804-03-caldor-fire-0830-super-tease.jpg", "publishedAt": "2021-09-01T06:16:20Z", "content": "(CNN)The Caldor Fire, which has forced the evacuation of thousands of people from a popular California tourist town, is now threatening more than 34,000 structures after already destroying hundreds o… [+3797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "After Ida wiped out power to more than 1 million, Louisiana residents now face gas shortages and dwindling supplies", "description": "A long road to recovery is ahead for Gulf Coast residents impacted by Hurricane Ida, and now some families are scrambling to stock up on food and gas as supplies in the region dwindle.", "url": "https://www.cnn.com/2021/09/01/weather/tropical-depression-ida-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831234515-02-hurricane-ida-gas-shortage-super-tease.jpg", "publishedAt": "2021-09-01T06:13:58Z", "content": "(CNN)A long road to recovery is ahead for Gulf Coast residents impacted by Hurricane Ida, and now some families are scrambling to stock up on food and gas as supplies in the region dwindle.\r\nIn the N… [+6197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He, CNN Business", "title": "China's 'revolution' cost investors $3 trillion. So why aren't they running scared?", "description": "Heavyweight global investment firms are sticking with China despite a sweeping crackdown on business by the ruling Communist Party that has wiped $3 trillion off the market value of the country's biggest companies.", "url": "https://www.cnn.com/2021/09/01/investing/china-investment-tech-crackdown-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831041259-shanghai-stock-exchange-file-2020-super-tease.jpg", "publishedAt": "2021-09-01T05:49:35Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+7587 chars]"}]}