{"status": "ok", "totalResults": 131, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what's streaming in September", "description": "A look at some of the series and films streaming on Netflix, Amazon Prime, Disney+, Hulu and more in September.", "url": "https://www.cnn.com/2021/08/31/entertainment/gallery/new-september-streaming-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827024232-13-september-streaming-2021-happier-than-ever-super-tease.jpg", "publishedAt": "2021-09-01T00:15:13Z", "content": "Billie Eilish makes her Disney+ debut with \"Happier than Ever: A Love Letter to Los Angeles,\" which is described as \"a cinematic concert experience.\" It's just one piece of the new content streaming … [+380 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Holmes, CNN", "title": "Biden administration closely monitoring supply of medical grade oxygen to treat Covid-19 patients", "description": "As coronavirus cases rise across the South, state health officials, hospital consultants and oxygen suppliers continue to sound alarms over a potential shortage of medical grade oxygen to treat Covid-19 patients in the region.", "url": "https://www.cnn.com/2021/08/31/politics/covid-19-medical-grade-oxygen-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831040102-texas-hospital-0818-super-tease.jpg", "publishedAt": "2021-08-31T23:49:58Z", "content": "Washington (CNN)As coronavirus cases rise across the South, state health officials, hospital consultants and oxygen suppliers continue to sound alarms over a potential shortage of medical grade oxyge… [+4742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Filipovic", "title": "What's behind Jan. 6 committee's call for GOP lawmakers' call logs?", "description": "Preserving phone records is part of basic fact-finding, which is the purpose of the Select Committee. But that is exactly what many Republicans appear to want to prevent, writes Jill Filipovic. Instead, a cadre of Republicans are crying \"authoritarianism\" rat…", "url": "https://www.cnn.com/2021/08/31/opinions/jan-6-select-committee-pelosi-phone-records-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831174430-select-committee-filipovic-super-tease.jpg", "publishedAt": "2021-08-31T23:30:42Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+4906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jack Guy, CNN", "title": "Stunning images released by Wildlife Photographer of the Year 2021 competition", "description": "A number of stunning entries to the Wildlife Photographer of the Year competition have been released, including images of an Iberian lynx framed in a doorway, cheetahs swimming in a raging river and blood dripping from the muzzle of a lioness.", "url": "https://www.cnn.com/travel/article/wildlife-photographer-award-2021-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831191646-08a-wildlife-photographer-of-they-year-2021-super-tease.jpg", "publishedAt": "2021-08-31T23:21:02Z", "content": "(CNN) A number of stunning entries to the Wildlife Photographer of the Year competition have been released, including images of an Iberian lynx framed in a doorway, cheetahs swimming in a raging rive… [+1490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "The top candidates running to replace Gov. Newsom in the California recall election", "description": "A colorful cast of more than 40 candidates from all political persuasions are vying to replace Democratic Gov. Gavin Newsom in California's recall election, but only a handful have managed to break through the pack.", "url": "https://www.cnn.com/2021/08/31/politics/california-governor-recall-top-candidates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831183347-newsom-gov-recall-candidates-super-tease.jpg", "publishedAt": "2021-08-31T22:43:24Z", "content": "(CNN)A colorful cast of more than 40 candidates from all political persuasions are vying to replace Democratic Gov. Gavin Newsom in California's recall election, but only a handful have managed to br… [+6419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leyla Santiago and Sara Weisfeldt, CNN", "title": "Two Florida counties stick with mask mandates despite financial penalties", "description": "Broward and Alachua counties in Florida are moving forward with mask mandates for their public school systems despite financial penalties from the state of Florida for not allowing parents to opt out of the requirement, in defiance of an order by Gov. Ron DeS…", "url": "https://www.cnn.com/2021/08/31/us/florida-broward-alachua-counties-school-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831154529-broward-county-school-mask-0818-restricted-super-tease.jpg", "publishedAt": "2021-08-31T22:34:19Z", "content": "(CNN)Broward and Alachua counties in Florida are moving forward with mask mandates for their public school systems despite financial penalties from the state of Florida for not allowing parents to op… [+2828 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why Democrats can't run away from Joe Biden", "description": "There's a lot of talk in Democratic circles these days about vulnerable 2022 candidates beginning to distance themselves from President Joe Biden amid his faltering poll numbers on both how he has handled Afghanistan and his overall job performance.", "url": "https://www.cnn.com/2021/08/31/politics/biden-democrats-midterms-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210826184555-biden-speech-afghanistan-attack-08-26-2021-super-tease.jpg", "publishedAt": "2021-08-31T22:32:10Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Melanie Zanona and Jeremy Herb, CNN", "title": "Vulnerable Democrats seek distance from Biden on Afghanistan ahead of contentious House debate", "description": "House and Senate Democrats are watching President Joe Biden's handling of the withdrawal from Afghanistan with unease, distancing themselves with some Americans left behind in the war-torn country and as Republicans plot to make the issue a major focus headin…", "url": "https://www.cnn.com/2021/08/31/politics/vulnerable-democrats-reaction-biden-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302170410-sen-maggie-hassan-10-senate-seats-super-tease.jpg", "publishedAt": "2021-08-31T22:14:00Z", "content": "(CNN)House and Senate Democrats are watching President Joe Biden's handling of the withdrawal from Afghanistan with unease, distancing themselves with some Americans left behind in the war-torn count… [+10618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact check: Psaki claims US doesn't 'have a presence on the ground' in Yemen and Somalia", "description": "As the war in Afghanistan came to a stark end Monday, the Biden administration now faces questions over the level of risk the US and other Western countries face with the Taliban taking control of the country.", "url": "https://www.cnn.com/2021/08/31/politics/psaki-us-presence-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827175251-04-afghanistan-wh-tick-tock-super-tease.jpg", "publishedAt": "2021-08-31T21:57:04Z", "content": "Washington (CNN)As the war in Afghanistan came to a stark end Monday, the Biden administration now faces questions over the level of risk the US and other Western countries face with the Taliban taki… [+2602 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Arick Wierson", "title": "If only Americans took Covid-19 as seriously as Brazilians", "description": "Arick Wierson writes that while Brazil continues to forge ahead in its fight against Covid-19, we are seeing the result of vaccine hesitance play out in real-time in parts of the US.", "url": "https://www.cnn.com/2021/08/31/opinions/covid-19-in-brazil-jair-bolsonaro-and-us-wierson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200821111723-brazil-coronavirus-covid-19-pandemic-congress-jair-bolsonaro-masks-romo-lkl-intl-ldn-vpx-00004217-super-tease.jpg", "publishedAt": "2021-08-31T21:06:04Z", "content": "Arick Wierson is a six-time Emmy Award-winning television producer and former senior media adviser to New York Mayor Michael Bloomberg. He holds a master's degree in economics from the State Universi… [+9205 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Google pushes its return to the office back to 2022", "description": "Google has yet again postponed a full return to the office, announcing that its employees can continue to work remotely until next year. The decision follows similar ones already made by the company's tech industry peers like Facebook and Amazon.", "url": "https://www.cnn.com/2021/08/31/tech/google-office-return-delay-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831145412-restricted-google-new-york-offices-0413-super-tease.jpg", "publishedAt": "2021-08-31T21:05:33Z", "content": "San Francisco (CNN Business)Google has yet again postponed a full return to the office, announcing that its employees can continue to work remotely until next year. The decision follows similar ones … [+1814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "California recall contender Larry Elder makes misleading claim that young people don't need Covid-19 vaccines", "description": "Larry Elder, the leading GOP candidate vying to replace California Gov. Gavin Newsom, said he doesn't think it's necessary for young people to get vaccinated against Covid-19 or for children to wear masks at school, and he vowed to repeal any mask or vaccine …", "url": "https://www.cnn.com/2021/08/31/politics/larry-elder-california-recall-covid-vaccines-masks-children/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210826202428-02-larry-elder-file-super-tease.jpg", "publishedAt": "2021-08-31T20:51:59Z", "content": "Los Angeles (CNN)Larry Elder, the leading GOP candidate vying to replace California Gov. Gavin Newsom, said he doesn't think it's necessary for young people to get vaccinated against Covid-19 or for … [+8965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "Hurricanes, wildfires, and drought: US finds itself battling climate disasters on several fronts", "description": "Hurricanes, wildfires, floods, heatwaves and drought wreaking havoc on much of the US paint a picture of a nation in peril. Region by region, the country is facing compounding disasters.", "url": "https://www.cnn.com/2021/08/31/us/hurricane-wildfires-climate-change-emergency-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831154647-01-norco-louisiana-0830-super-tease.jpg", "publishedAt": "2021-08-31T20:51:18Z", "content": "(CNN)Hurricanes, wildfires, floods, heat waves, and drought wreaking havoc on much of the United States paint a picture of a nation in peril. Region by region, the country faces compounding disasters… [+8042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Child Covid-19 hospitalizations reach a new high. That's not the only reason kids need to be protected from Delta, doctors say", "description": "Doctors say keeping kids Covid-free is critical to ensure in-person learning, prevent long-term complications and help stave off more aggressive variants for everyone.", "url": "https://www.cnn.com/2021/08/31/health/covid-delta-variant-children/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162107-01-children-covid-mask-stock-super-tease.jpg", "publishedAt": "2021-08-31T20:49:57Z", "content": "(CNN)More kids were hospitalized with Covid-19 this month than any other time this past year -- further proving how seriously the Delta variant can hit any age group.\r\nBetween August 20 and 26, an av… [+9084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Hao-Nhien Vu", "title": "A lesson for America from the fall of Saigon in 1975", "description": "After the fall of Saigon and in the years following, American presidents of both parties worked to admit hundreds of thousands of Vietnamese refugees into the US, including Hao-Nhien Vu and his family. He argues that we should now do the same for the people o…", "url": "https://www.cnn.com/2021/08/31/opinions/afghanistan-vietnam-lesson-from-fall-of-saigon-vu/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831151957-02-afghanistan-saigon-opinion-super-tease.jpg", "publishedAt": "2021-08-31T20:12:36Z", "content": "Hao-Nhien Vu is a former managing editor of Nguoi Viet, a Vietnamese-language newspaper. He is a professor of mathematics at Coastline College in Orange County, California. The views expressed here a… [+5525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Alexandra Kane", "title": "Leaving our 'big green porch' in New Orleans was a tough call", "description": "Alexandra Kane, a New Orleans resident who fled to Mobile, Alabama, before Hurricane Ida made landfall, writes that the decision to evacuate wasn't easy. \"The truth is that evacuating is a privilege -- one that requires money, transportation and a safe place …", "url": "https://www.cnn.com/2021/08/31/opinions/fleeing-new-orleans-before-hurricane-ida-tough-call-kane/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831141956-01-ali-kane-op-ed-super-tease.jpg", "publishedAt": "2021-08-31T19:55:42Z", "content": "Alexandra Kane is a former New Yorker turned New Orleanian. The opinions expressed in this commentary are solely her own. View more opinion on CNN.\r\n (CNN)\"I don't know if I want to exist without thi… [+7030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jesse M. Keenan", "title": "Post-Ida failures show why we need to adapt", "description": "Jesse M. Keenan writes that, in practice, disaster resilience is a flawed concept that has given us a false faith in our ability to withstand extreme weather and climate change.", "url": "https://www.cnn.com/2021/08/31/opinions/post-ida-failures-show-need-to-adapt-keenan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831122941-33-hurricane-ida-0830-super-tease.jpg", "publishedAt": "2021-08-31T19:54:09Z", "content": "Jesse M. Keenan is an associate professor of real estate in the School of Architecture at Tulane University in New Orleans. Keenan is an internationally recognized expert in climate adaptation and th… [+7157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson", "title": "After Afghanistan, Biden can't afford any more missteps", "description": "For the first time in nearly 20 years, Afghans spent the day without US troops on their soil, after the last jet carrying the rearguard of a onetime conqueror lifted off the tarmac at Kabul airport late Monday.", "url": "https://www.cnn.com/2021/08/31/world/meanwhile-in-america-august-31-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210823084201-kabul-airport-evacuation-handout-super-tease.jpg", "publishedAt": "2021-08-31T19:40:37Z", "content": "This story was excerpted from the August 31 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)For the… [+3856 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Social Security won't be able to pay full benefits by 2034", "description": "Social Security will have to cut benefits by 2034 if Congress does nothing to address the program's long-term funding shortfall, according to an annual report released Tuesday by the Social Security and Medicare trustees.", "url": "https://www.cnn.com/2021/08/31/politics/social-security-medicare-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831141641-us-treasury-check-restricted-super-tease.jpg", "publishedAt": "2021-08-31T19:19:58Z", "content": "Washington (CNN)Social Security will have to cut benefits by 2034 if Congress does nothing to address the program's long-term funding shortfall, according to an annual report released Tuesday by the … [+1184 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Opinion: Doctor warns that Covid cases in kids are becoming more complicated", "description": "Dr. Susannah Hills, highlighting Texas and Florida, writes that children could be at higher risk for infection with both Covid and RSV as they return to school this year. While we wait for Covid-19 vaccines to be approved for kids younger than 12, political l…", "url": "https://www.cnn.com/2021/08/31/opinions/kids-covid-19-respiratory-syncytial-virus-hills/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813102700-kids-mask-super-tease.jpg", "publishedAt": "2021-08-31T18:50:12Z", "content": "Susannah Hills is a pediatric airway surgeon at New York-Presbyterian Hospital and Columbia University Medical Center. She also serves as assistant professor of otolaryngology-head and neck surgery a… [+6524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Rand Paul has a *very* wacky theory about ivermectin", "description": "Rand Paul is, by training, a doctor of ophthalmology. Which has to do with eyes. Not infectious disease.", "url": "https://www.cnn.com/2021/08/31/politics/rand-paul-covid-19-ivermectin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210524205620-rand-paul-0511-super-tease.jpg", "publishedAt": "2021-08-31T17:55:57Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Ali Zaslav, CNN", "title": "Senate passes bill to provide assistance to Americans returning from Afghanistan", "description": "The Senate on Tuesday approved a bill that would provide temporary assistance to American citizens who have returned from Afghanistan.", "url": "https://www.cnn.com/2021/08/31/politics/senate-passes-bill-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-08-31T17:55:38Z", "content": "(CNN)The Senate on Tuesday approved a bill that would provide temporary assistance to American citizens who have returned from Afghanistan. \r\nThe bill would set aside up to $10 million for each fisca… [+2580 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "Thousands of American University of Afghanistan students and graduates were left behind", "description": "Peter Bergen interviews Leslie Schweitzer, board member of the American University of Afghanistan. She is watching as the University's campus is taken over by the Taliban.", "url": "https://www.cnn.com/2021/08/31/opinions/american-university-afghanistan-students/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191226135005-american-university-of-afghanistan-file-super-tease.jpg", "publishedAt": "2021-08-31T16:37:03Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen has reported from Afghanistan since 1993. His new book… [+9226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Mike Richards is now out as executive producer of 'Jeopardy!' too", "description": "Mike Richards is out as executive producer of \"Jeopardy!\" and \"Wheel of Fortune,\" Sony, the company behind the two shows, announced Tuesday.", "url": "https://www.cnn.com/2021/08/31/media/mike-richards-jeopardy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831122919-03-mike-richards-producer-file-super-tease.jpg", "publishedAt": "2021-08-31T16:36:17Z", "content": "New York (CNN Business)Mike Richards is out as executive producer of \"Jeopardy!\" and \"Wheel of Fortune,\" Sony, the company behind the two shows, announced Tuesday. \r\nThe news comes after a turbulent … [+1127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Impeachment: American Crime Story' dissects the Clinton scandal with Monica Lewinsky's input", "description": "Sarah Paulson and Monica Lewinsky put women front and center in the Bill Clinton impeachment scandal in the lastest installment of the \"American Crime\" franchise for FX.", "url": "https://www.cnn.com/2021/08/31/entertainment/impeachment-american-crime-story-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830145938-02-impeachment-american-crime-story-beanie-fieldstein-super-tease.jpg", "publishedAt": "2021-08-31T16:31:55Z", "content": "(CNN)The \"American Crime Story\" banner launched by O.J. Simpson's trial is an odd one for FX's \"Impeachment,\" an otherwise engrossing, undeniably juicy limited series that puts the women front and ce… [+4139 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "'Candyman' director Nia DaCosta makes history", "description": "\"Candyman\" director Nia DaCosta has become the first Black female director to have a film debut in the top spot in the US box office, Universal Pictures announced Tuesday.", "url": "https://www.cnn.com/2021/08/31/entertainment/candyman-nia-dacosta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831113902-nia-dacosta-012220-file-super-tease.jpg", "publishedAt": "2021-08-31T16:18:17Z", "content": "(CNN)\"Candyman\" director Nia DaCosta has become the first Black female director to have a film debut in the top spot in the US box office, Universal Pictures announced Tuesday.\r\nAccording to Box Offi… [+897 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, CNN", "title": "First on CNN: McConnell urges Americans to get vaccinated in new TV PSA", "description": "Senate Republican Leader Mitch McConnell is expanding his efforts to convince more Americans to get vaccinated against Covid-19 with a new public service announcement available for TV stations to air nationwide.", "url": "https://www.cnn.com/2021/08/31/politics/mitch-mcconnell-covid-psa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210618123013-01-mcconnell-0617-super-tease.jpg", "publishedAt": "2021-08-31T16:01:07Z", "content": "(CNN)Senate Republican Leader Mitch McConnell is expanding his efforts to convince more Americans to get vaccinated against Covid-19 with a new public service announcement available for TV stations t… [+4002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naveen Kumar", "title": "20 men's beard grooming kits and products that experts love", "description": "Whether you have a big bushy beard or only let it grow out a few millimeters, it's important to keep your facial hair healthy and looking good. We talked to barbers for their recommendations on the best beard grooming kits and products.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/best-beard-grooming-kits/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210419111242-beardgroominglead.jpg?q=x_0,y_0,h_1406,w_2499,c_fill/w_800", "publishedAt": "2021-08-31T16:00:35Z", "content": "Growing and maintaining a beard is a lot like getting a new pet. First comes an adjustment period while you grow comfortable with each other, followed by a slight shift or two in your routine and fin… [+8680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "The Harlem Hellfighters, Black soldiers who fought in World War I, will receive a Congressional Gold Medal", "description": "The Black infantry unit was one of the most decorated regiments at the time, even as most of its members were met with racism and disregard upon their return home. They'll receive a Congressional Gold Medal more than 100 years after the war ended.", "url": "https://www.cnn.com/2021/08/31/us/harlem-hellfighters-congressional-gold-medal-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831100103-01-harlem-hellfighters-restricted-super-tease.jpg", "publishedAt": "2021-08-31T15:38:09Z", "content": "(CNN)The \"Harlem Hellfighters\" helped the US win World War I. The Black infantry unit was one of the most decorated regiments at the time, even as most of its members were met with racism and disrega… [+4829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "All the WFH products that we now can't live without", "description": "Whether it's an actually pleasant desk lamp, a lumbar pillow that's saved our backs or even a bidet, these are the truly life-changing WFH products that we've found over the past year — and now can't live without.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/editors-favorites-wfh-setup/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210303135437-wfheditorspickslead.jpg?q=x_0,y_0,h_1406,w_2499,c_fill/w_800", "publishedAt": "2021-08-31T15:37:29Z", "content": "Over the past year our spending habits have changed a lot. \r\nRather than subsisting off of free office coffee, weve finally upgraded our at-home coffee machines to be spectacular. Now without a prope… [+9394 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ural Garrett", "title": "The Belkin Soundform Freedom are a worthy AirPods alternative — and they're cheaper", "description": "The Belkin Soundform Freedom True Wireless Earbuds are an impressive AirPods alternative with great call quality and full compatibility with Apple's Find My app.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/belkin-soundform-freedom-true-wireless-earbuds-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831102305-2-belkin-soundform-freedom-true-wireless-earbuds.jpg?q=x_0,y_63,h_2343,w_4167,c_crop/w_800", "publishedAt": "2021-08-31T15:25:54Z", "content": "Belkin has spent the past couple of years carving its own niche within the audio space through their Soundform line, which includes some respectable speakers, headphones and earbuds that are fairly a… [+10352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "The 27 best home and office WFH essentials we've tested", "description": "We've tested loads of products from rain jackets and pans to laptops and TVs. That's why we've compiled all the best office essentials we've tested so you can comfortably and efficiently work at home.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/best-work-from-home-office-essentials/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/201202131706-cnn-underscored-cnn-underscored-best-work-from-home-product-testing-lead-image.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-08-31T15:03:15Z", "content": "CNN Underscored is constantly testing products be it coffee makers or headphones to find the absolute best in each respective category.\r\nOur testing process is rigorous, consisting of hours of resear… [+16591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmin Hernandez, CNN", "title": "Raelis Vasquez turns snapshots of Afro Dominican life into paintings of belonging", "description": "Raelis Vasquez, a New York and New Jersey-based artist, works from a bank of his memories and emotions to create tender and sincere paintings of Afro Dominican life. Usually featuring his kin and friends, the large-scale oil and acrylic works are cast in warm…", "url": "https://www.cnn.com/style/article/raelis-vasquez-art-hyphenated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210824183446-04-raelis-vasquez-paintings-hyphenated-restricted-super-tease.jpg", "publishedAt": "2021-08-31T15:00:49Z", "content": "artsPublished 31st August 2021\r\nThis feature is part of CNN Style's new series Hyphenated, which explores the complex issue of identity among minorities in the United States.\r\nRaelis Vasquez, a New Y… [+8444 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Top Tencent investor makes $4.7 billion bet on digital payments in India", "description": "Digital payments are booming in India — and Prosus, the tech investment firm, wants a bigger piece of the action.", "url": "https://www.cnn.com/2021/08/31/investing/prosus-billdesk-deal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831093340-digital-payment---stock-super-tease.jpg", "publishedAt": "2021-08-31T14:43:01Z", "content": "London (CNN Business)Digital payments are booming in India and Prosus, the tech investment firm, wants a bigger piece of the action.\r\nThe Netherlands-based company said Tuesday that it had agreed a $… [+2076 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop today: Macy's, Onsen, 23andMe and more", "description": "Today, you'll find a deal on our runner-up for best alarm clock, a discounted Kindle Paperwhite and savings on Onsen waffle-weave towels. All that and more below.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831100952-0831dealslead.jpg?q=x_0,y_0,h_1080,w_1920,c_fill/w_800", "publishedAt": "2021-08-31T14:34:13Z", "content": "Today, youll find a deal on our runner-up for best alarm clock, a discounted Kindle Paperwhite and savings on Onsen waffle-weave towels. All that and more below.\r\nWake up and save on our runner-up fo… [+11434 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julian Kheel", "title": "American Express opens its Centurion Suite and other card member lounges at the US Open", "description": "American Express has opened its Centurion Suite at the US Open in New York City, along with a second lounge and an outdoor patio reserved exclusively for its card members for the duration of the 2021 tournament.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/us-open-amex-centurion-suite/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210831102603-underscored-us-open-amex-centurion-suite-exterior-patio.jpg?q=x_0,y_0,h_1800,w_3200,c_fill/w_800", "publishedAt": "2021-08-31T14:31:06Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value, but does not review all financial companies or all available financial offers. We may r… [+6299 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Madison Cawthorn didn't learn the right lesson from January 6", "description": "The insurrection at the US Capitol on January 6 was a seminal moment in American politics and our country's history. It was the logical result of a president who lied to the country about, well, just about everything -- including that he lost the 2020 electio…", "url": "https://www.cnn.com/2021/08/31/politics/madison-cawthorn-january-6-insurrection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210301164528-rep-madison-cawthorn-210226-super-tease.jpg", "publishedAt": "2021-08-31T14:25:22Z", "content": "(CNN)The insurrection at the US Capitol on January 6 was a seminal moment in American politics and our country's history. It was the logical result of a president who lied to the country about, well,… [+3002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden set to address the nation following the US withdrawal from Afghanistan", "description": "President Joe Biden is slated to address the nation Tuesday on the end of the war in Afghanistan, a day after the last American military planes left the country, concluding the nation's longest war nearly 20 years after it began.", "url": "https://www.cnn.com/2021/08/31/politics/biden-afghanistan-withdrawal-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210829171242-03-biden-afghanistan-0829-super-tease.jpg", "publishedAt": "2021-08-31T14:05:37Z", "content": "Washington (CNN)President Joe Biden is slated to address the nation Tuesday on the end of the war in Afghanistan, a day after the last American military planes left the country, concluding the nation… [+5515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kami Phillips", "title": "Go back to work in style with these chic office essentials from Loft", "description": "Loft has affordable women's workwear styles including skirts, trousers, jeans, dresses, blazers, shoes and more. Here are 20 of our favorite clothing styles and accessories for heading back into the office.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/ann-taylor-loft-womens-office-attire/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210827113521-loftlead.jpg?q=x_0,y_0,h_1406,w_2500,c_fill/w_800", "publishedAt": "2021-08-31T14:00:53Z", "content": "After more than a year of working from home, many offices are beginning to reopen. While the thought of getting back to business in-person may be exciting, having to part ways with your beloved sweat… [+4801 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Diksha Madhok, CNN Business", "title": "India posts record 20% GDP growth but the second Covid wave still hurt", "description": "India's economy grew at a record pace in the second quarter, even as the country grappled with a devastating wave of Covid-19. But Asia's third largest economy isn't out of the woods yet and remains smaller than at the start of the pandemic.", "url": "https://www.cnn.com/2021/08/31/economy/india-gdp-growth-covid-hnk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831045317-india-shopping-mall-0619-super-tease.jpg", "publishedAt": "2021-08-31T13:45:12Z", "content": "New Delhi (CNN Business)India's economy grew at a record pace in the second quarter, even asthe country grappled with a devastating wave of Covid-19. ButAsia's third largest economy isn't out of the … [+2797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "'I just felt really weak': Anna Nordqvist reveals mental health battle after major victory", "description": "Anna Nordqvist was supposed to be getting married in a castle in Scotland, but because of the Covid-19 pandemic, she and her husband had a smaller ceremony at home in Arizona, US, with guests watching over Zoom instead.", "url": "https://www.cnn.com/2021/08/31/golf/anna-nordqvist-womens-open-gotm-spc-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825130744-04-anna-nordqvist-0822-aig-open-restricted-super-tease.jpg", "publishedAt": "2021-08-31T13:39:54Z", "content": "(CNN)Anna Nordqvist was supposed to be getting married in a castle in Scotland, but because of the Covid-19 pandemic, she and her husband had a smaller ceremony at home in Arizona, US, with guests wa… [+3883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianne Ross", "title": "20 Amazon products our readers were obsessed with in August", "description": "From grill brushes to pocket-sized chargers, check out the 20 products Underscored readers loved most in August.", "url": "https://www.cnn.com/2021/08/31/cnn-underscored/underscored-favorite-amazon-products-august-2021/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210827141322-augustamazonlead.jpg?q=x_0,y_0,h_1406,w_2499,c_fill/w_800", "publishedAt": "2021-08-31T13:26:30Z", "content": "Curious about what your fellow CNN Underscored readers are buying? Every month well round up our readers favorite products those products readers like you scooped up the most over the past 30 days.\r\n… [+3752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Zoom's stock plunges as sales growth slows", "description": "Zoom Video Communications was one of the clear winners of the pandemic economy. But as more people return to the office and classroom, the company now faces a bigger challenge: living up to Wall Street's hype.", "url": "https://www.cnn.com/2021/08/31/investing/zoom-earnings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200421092433-work-from-home-0401-super-tease.jpg", "publishedAt": "2021-08-31T13:15:18Z", "content": "New York (CNN Business)Zoom Video Communications was one of the clear winners of the pandemic economy. But as more people return to the office and classroom, the company now faces a bigger challenge:… [+2983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, CNN", "title": "Covid-19 cases at this Texas school are spiking, yet officials buck local mask mandate", "description": "Michelle Woodard's voice broke and her body shook with emotion as she described the moment she learned her 8-year-old daughter Cara tested positive for Covid-19 last week.", "url": "https://www.cnn.com/2021/08/31/us/covid-spike-texas-school/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210829192025-05-covid-spike-texas-school-super-tease.jpg", "publishedAt": "2021-08-31T13:03:00Z", "content": "Humble, TX (CNN)Michelle Woodard's voice broke and her body shook with emotion as she described the moment she learned her 8-year-old daughter Cara tested positive for Covid-19 last week. \r\n\"I just f… [+8845 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Drivers waiting hours in line for gas in parts of Louisiana", "description": "Parts of Louisiana are seeing long gas lines as the state recovers after damage from Hurricane Ida.", "url": "https://www.cnn.com/videos/business/2021/08/31/long-gas-lines-in-louisiana-after-ida-todd-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831083252-long-gas-lines-super-tease.jpeg", "publishedAt": "2021-08-31T12:36:58Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Drake reveals new album artwork by Damien Hirst", "description": "Drake has revealed the artwork for his upcoming album \"Certified Lover Boy,\" designed by British artist Damien Hirst.", "url": "https://www.cnn.com/style/article/drake-album-artwork-damien-hirst-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831110107-01-drake-album-art-certified-lover-boy-super-tease.jpg", "publishedAt": "2021-08-31T12:07:06Z", "content": "artsPublished 31st August 2021\r\nDrake has revealed the artwork for his upcoming album \"Certified Lover Boy,\" designed by British artist Damien Hirst.\r\nThe cover, which features 12 \"pregnant woman\" em… [+1353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sheena McKenzie, CNN", "title": "Taliban declare victory from airport tarmac after US withdrawal", "description": "Taliban leaders declared victory over the United States from the tarmac of Kabul airport on Tuesday, hours after the withdrawal of last American troops left Afghanistan in the grip of the militant group.", "url": "https://www.cnn.com/2021/08/31/asia/taliban-control-kabul-airport-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831111957-01-afghanistan-0831-kabul-airport-taliban-super-tease.jpg", "publishedAt": "2021-08-31T11:57:42Z", "content": "(CNN)Taliban leaders declared victory over the United States from the tarmac of Kabul airport on Tuesday, hours after the withdrawal of last American troops left Afghanistan in the grip of the milita… [+4029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Investors are starting to play defense as the bull run matures", "description": "As the economic recovery from Covid-19 has progressed this year, investors have had plenty of opportunities to place winning bets. Wagering against the bull run in stocks hasn't been one of them.", "url": "https://www.cnn.com/2021/08/31/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831071650-new-york-stock-exchange-0708-file-super-tease.jpg", "publishedAt": "2021-08-31T11:56:33Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)As the economic recovery from Covid-19 has prog… [+5977 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "PBS \"NewsHour\" special correspondent Jane Ferguson, who flew out of Kabul just a few days ago: \" Can the Taliban hold onto control over Afghanistan, or will everything descend into chaotic civil war and failed state?(view.newsletters.cnn.com)", "url": "https://view.newsletters.cnn.com/messages/1630380681946dede7a64e13a/raw", "urlToImage": null, "publishedAt": "2021-08-31T11:00:05Z", "content": "Welcome to the end of August. Brian Stelter here at 11:30pm ET on Monday, August 30. Here's the latest on the \"COVID commentariat,\" Shaquille Brewster, \"GMA,\" Jon Stewart, \"The View,\" and much more..… [+4113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, Joseph Ataman, Jo Shelley, Saskya Vandoorne, Madalena Araujo and Nilly Kohzad, CNN", "title": "'It was just mayhem and chaos': America has left Kabul. Hear from the Afghans who made it out, and those who didn't", "description": "Some didn't make it to the airport on time. Others never had an opportunity to leave. Some simply chose to stay and fight for their rights. Here are stories of some of the Afghans who escaped -- and those who didn't make it.", "url": "https://www.cnn.com/2021/08/31/asia/afghans-who-left-or-stayed-behind-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830172350-afghan-evacuees-split-super-tease.jpg", "publishedAt": "2021-08-31T10:33:55Z", "content": "By Ivana Kottasová, Joseph Ataman, Jo Shelley, Saskya Vandoorne, Madalena Araujo and Nilly Kohzad, CNN\r\nUpdated 6:33 AM ET, Tue August 31, 2021\r\n(CNN)-- When the Taliban recaptured Afghanistan, tens … [+9118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for August 31: Afghanistan, Ida, coronavirus, China, abortion", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/08/31/us/five-things-august-31-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830203535-last-soldier-leaves-afghanistan-0830-dod-super-tease.jpg", "publishedAt": "2021-08-31T10:28:49Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Manveena Suri, CNN", "title": "India massacre memorial's lights-and-lasers 'makeover' attracts controversy", "description": "The renovation of a historical monument in India to the Amritsar Massacre in which British troops once killed hundreds of men, women and children has sparked furious debate and concerns over the \"Disneyfication\" of history.", "url": "https://www.cnn.com/travel/article/amritsar-massacre-jallianwala-bagh-punjab-india-modi-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831015112-02-jallianwala-bagh-reopening-0828-super-tease.jpg", "publishedAt": "2021-08-31T09:43:22Z", "content": "(CNN) The renovation of a historical monument in India's Punjab state where British troops once killed hundreds of men, women and children has sparked furious debate and concerns over the \"Disneyfica… [+4161 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Spending on international transfer fees nearly tripled in 10 years, FIFA says", "description": "Spending on international transfer fees over the last decade increased from $2.66 billion in 2012 to a peak of $7.35 billion in 2019, while players' agents received $3.5 billion in commissions, a study by world governing body FIFA said.", "url": "https://www.cnn.com/2021/08/31/football/spending-international-transfer-fees-tripled-fifa-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831043920-02-neymar-psg-file-2017-super-tease.jpg", "publishedAt": "2021-08-31T09:19:23Z", "content": "(CNN)Spending on international transfer fees over the last decade increased from $2.66 billion in 2012 to a peak of $7.35 billion in 2019, while players' agents received $3.5 billion in commissions, … [+1940 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Andy Murray says he 'lost respect' for Stefanos Tsitsipas after US Open defeat", "description": "Three-time grand slam champion Andy Murray says he \"lost respect\" for Stefanos Tsitsipas, after the Greek world No. 3 took multiple extended breaks at crucial times during their first round US Open match.", "url": "https://www.cnn.com/2021/08/31/tennis/andy-murray-lost-respect-stefanos-tsitsipas-us-open-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831082016-murray-tsitsipas-super-tease.jpg", "publishedAt": "2021-08-31T09:08:05Z", "content": "(CNN)Three-time grand slam champion Andy Murray says he \"lost respect\" for Stefanos Tsitsipas, after the Greek world No. 3 took multiple extended breaks at crucial times during their first round US O… [+3918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong, CNN", "title": "A parent's primary role: Protecting our kids against hopelessness", "description": "The pandemic has made it hard for parents of teens and tweens to know what's weighing on our kids or how to help, but psychologist Lisa Damour gives advice on what to do.", "url": "https://www.cnn.com/2021/08/31/health/kids-hopelessness-lisa-damour-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830173014-kids-hopelessness-lisa-damour-wellness-super-tease.jpg", "publishedAt": "2021-08-31T08:54:53Z", "content": "(CNN)Given the pandemic's extra stressors, it can be hard for parents to know what's weighing on our kids or how to help. \r\nWhether adolescents are struggling with the impact of Covid-19 on their liv… [+7098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "These 5 states have less than 10% of ICU beds left as Covid-19 overwhelms hospitals", "description": "As Covid-19 cases surge across the US, particularly among unvaccinated Americans, hospitals have been pushed to their limits treating the influx of patients -- and five states are nearly out of ICU beds.", "url": "https://www.cnn.com/2021/08/31/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831040102-texas-hospital-0818-super-tease.jpg", "publishedAt": "2021-08-31T08:35:20Z", "content": "(CNN)As Covid-19 cases surge across the US, particularly among unvaccinated Americans, hospitals have been pushed to their limits treating the influx of patients -- and five states are nearly out of … [+5820 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jonathan Hawkins, CNN", "title": "Taranto: Southen Italy's hidden treasure", "description": "The Puglia region envelops the \"heel\" of the boot-shaped Italian peninsula. Laden with olive groves, surrounded by clear, sparkling water and speckled with charming, historic towns and villages, its rustic appeal has made it an increasingly popular destinatio…", "url": "https://www.cnn.com/travel/article/taranto-italy-tourism/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827161008-01-taranto-italy-tourism-super-tease.jpg", "publishedAt": "2021-08-31T07:59:03Z", "content": "Taranto, Italy (CNN) The Puglia region envelops the \"heel\" of the boot-shaped Italian peninsula. Laden with olive groves, surrounded by clear, sparkling water and speckled with charming, historic tow… [+10462 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "Enchanting photos of seeds and fruits show why they are nature's engineering marvels", "description": "The world's largest seed, the coco de mer, is legendary among plants. It can weigh over 50 pounds and measure up to three feet in circumference. Before it was discovered that it grew on palms native to the Seychelles, seamen who caught a glimpse of one drifti…", "url": "https://www.cnn.com/style/article/biss-hidden-beauty-seeds-photography-c2e-spc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830141952-03b-seeds-hidden-beauty-super-tease.jpg", "publishedAt": "2021-08-31T07:17:15Z", "content": "artsPublished 31st August 2021\r\nThe world's largest seed, the coco de mer, is legendary among plants. It can weigh over 50 pounds and measure up to three feet in circumference. Before it was discover… [+5014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "Two dead and 10 injured after Mississippi highway washed away by heavy rain", "description": "Two people were killed and 10 others injured after a highway was washed out Monday night near the town of Lucedale, Mississippi, officials said.", "url": "https://www.cnn.com/2021/08/31/us/mississippi-highway-26-collapse-flooding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831023424-map-lucedale-mississippi-super-tease.jpg", "publishedAt": "2021-08-31T07:11:08Z", "content": "(CNN)Two people were killed and 10 others injured after a highway was washed out Monday night near the town of Lucedale, Mississippi, officials said.\r\nThe incident occurred on the two-lane Highway 26… [+420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly McCleary, CNN", "title": "Caldor Fire prompts states of emergency in Nevada and California, with more than 50,000 told to evacuate the Lake Tahoe region", "description": "The governors of California and Nevada declared states of emergency Monday as the fast-moving Caldor Fire prompted officials to tell everyone in the city of South Lake Tahoe to get out.", "url": "https://www.cnn.com/2021/08/31/weather/western-wildfires-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831003326-01-caldor-fire-evacuation-0830-super-tease.jpg", "publishedAt": "2021-08-31T07:09:41Z", "content": "(CNN)The governors of California and Nevada declared states of emergency Monday as the fast-moving Caldor Fire prompted officials to tell everyone in the city of South Lake Tahoe to get out.\r\nIn Cali… [+4306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Ida left more than 1 million without power for possibly weeks, and now comes the scorching heat", "description": "The Gulf Coast is still sifting through the aftermath and launching rescue missions in the wake of Ida's landfall as a hurricane, and officials say some areas could spend up to the next month of their recovery without power.", "url": "https://www.cnn.com/2021/08/31/weather/tropical-depression-ida-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831010713-28-hurricane-ida-new-orleans-downtown-super-tease.jpg", "publishedAt": "2021-08-31T06:15:24Z", "content": "(CNN)The Gulf Coast is still sifting through the aftermath and launching rescue missions in the wake of Ida's landfall as a hurricane, and officials say some areas could spend up to the next month of… [+7313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "America's Afghan war is over but the battle for Biden's legacy is only just beginning", "description": "America's chaotic, humiliating -- yet, at times, heroic -- final retreat from its defeat in Afghanistan will resonate for years after the last military jet lifted off from Kabul at 11:59 p.m. local time on Monday, ending the country's longest war.", "url": "https://www.cnn.com/2021/08/31/politics/americas-afghan-war-is-over-joe-biden-legacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830141349-02-biden-fema-0830-super-tease.jpg", "publishedAt": "2021-08-31T04:01:25Z", "content": "(CNN)America's chaotic, humiliating -- yet, at times, heroic -- final retreat from its defeat in Afghanistan will resonate for years after the last military jet lifted off from Kabul at 11:59 p.m. lo… [+9782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and Adam Renton, CNN", "title": "US completes withdrawal from Afghanistan", "description": "The last US military planes left Afghanistan with troops and the remaining core diplomatic staff, the Pentagon said. Follow here for the latest news.", "url": "https://www.cnn.com/world/live-news/afghanistan-kabul-taliban-us-news-08-31-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210826104457-04-kabul-explosion-0826-super-tease.jpg", "publishedAt": "2021-08-31T04:00:12Z", "content": "The last US military planes left Afghanistan, Gen. Kenneth \"Frank\" McKenzie, the commander of US Central Command, announced Monday at the Pentagon. The US departure marked the end of a fraught, chaot… [+1660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "First male to speak publicly of alleged sexual abuse by R. Kelly testifies at trial", "description": "A man identified only as \"Louis\" testified Monday at R. Kelly's trial, saying the singer lured him to his home and studio when he was 17 with promises of helping his music career but instead sexually abused him.", "url": "https://www.cnn.com/2021/08/30/us/r-kelly-testimony-male-witness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830191636-r-kelly-march-2019-super-tease.jpg", "publishedAt": "2021-08-31T03:20:28Z", "content": "This story contains graphic court testimony.\r\nNew York (CNN)A man identified only as \"Louis\" testified Monday at R. Kelly's trial, saying the singer lured him to his home and studio when he was 17 wi… [+5213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Rebekah Riess and Elizabeth Joseph, CNN", "title": "Here's how Louisiana hospitals are handling the double onslaught of Hurricane Ida and Covid-19", "description": "Already overwhelmed by a surge in Covid-19 cases, Louisiana hospitals are now struggling with how to keep functioning after significant damage and disruption caused by Hurricane Ida.", "url": "https://www.cnn.com/2021/08/30/us/louisiana-hospitals-hurricane-ida-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830194408-louisiana-hospitals-hurricane-ida-covid-super-tease.jpg", "publishedAt": "2021-08-31T03:05:28Z", "content": "(CNN)Already overwhelmed by a surge in Covid-19 cases, Louisiana hospitals are now struggling with how to keep functioning after significant damage and disruption caused by Hurricane Ida.\r\n \"For me, … [+6147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Coren and Jessie Yeung, CNN", "title": "'I don't want them to kill my kids': Afghan translator's desperate journey from the clutches of the Taliban to a new life in the US", "description": "Abdul Rashid Shirzad was quiet and nervous on the taxi ride with his family to the Kabul airport, the last American-controlled enclave in the Afghan capital.", "url": "https://www.cnn.com/2021/08/30/asia/afghanistan-interpreter-escape-kabul-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210829234328-01-afghanistan-interpreter-escape-kabul-super-tease.jpg", "publishedAt": "2021-08-31T02:47:21Z", "content": "By Anna Coren and Jessie Yeung, CNN\r\nUpdated 10:47 PM ET, Mon August 30, 2021\r\n (CNN)Abdul Rashid Shirzad was quiet and nervous on the taxi ride with his family to the Kabul airport, the last America… [+14227 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Covid vaccine effectiveness against severe disease has not dropped much, CDC says", "description": "Overall effectiveness of coronavirus vaccines has not dropped much yet for most vaccinated Americans, US Centers for Disease Control and Prevention vaccine advisers were told Monday.", "url": "https://www.cnn.com/2021/08/30/health/booster-shots-acip-discussion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830204655-vaccantion-stockton-ca-super-tease.jpg", "publishedAt": "2021-08-31T01:31:47Z", "content": "(CNN)Overall effectiveness of coronavirus vaccines has not dropped much yet for most vaccinated Americans, US Centers for Disease Control and Prevention vaccine advisers were told Monday.\r\nCDC's Advi… [+4125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "South African researchers keep wary eye on yet a new coronavirus variant", "description": "Genetics researchers who have been watching for new coronavirus variants say they've seen a troubling new lineage that carries many of the same hallmarks as other strains, including Alpha, Beta and Gamma.", "url": "https://www.cnn.com/2021/08/30/health/new-coronavirus-variant-maybe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830204014-file-covid-19-swab-super-tease.jpg", "publishedAt": "2021-08-31T00:50:26Z", "content": "(CNN)Genetics researchers who have been watching for new coronavirus variants say they've seen a troubling new lineage that carries many of the same hallmarks as other strains, including Alpha, Beta … [+2958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "'I hope I'm wrong': GOP lawmaker explains mixed feelings over leaving Afghanistan in Taliban control", "description": "Republican Congressman and US military veteran Adam Kinzinger on Monday reflected on the closing of America's longest war, saying that while he's relieved, Afghanistan now being under Taliban control has left him with mixed emotions.", "url": "https://www.cnn.com/2021/08/30/politics/lawmakers-react-afghanistan-war-end-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210112182127-rep-adam-kinzinger-file-super-tease.jpg", "publishedAt": "2021-08-31T00:38:21Z", "content": "Washington (CNN)Republican Congressman and US military veteran Adam Kinzinger on Monday reflected on the closing of America's longest war, saying that while he's relieved, Afghanistan now being under… [+4667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "'I hope I'm wrong': GOP lawmaker explains mixed feelings over leaving Afghanistan in Taliban control", "description": "Republican Congressman and US military veteran Adam Kinzinger on Monday reflected on the closing of America's longest war, saying that while he's relieved, Afghanistan now being under Taliban control has left him with mixed emotions.", "url": "https://www.cnn.com/2021/08/30/politics/lawmakers-react-afghanistan-war-end-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210112182127-rep-adam-kinzinger-file-super-tease.jpg", "publishedAt": "2021-08-31T00:38:21Z", "content": "Washington (CNN)Republican Congressman and US military veteran Adam Kinzinger on Monday reflected on the closing of America's longest war, saying that while he's relieved, Afghanistan now being under… [+4667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Ed Lavandera, CNN", "title": "Residents of this small Louisiana town describe 'hours of agony' as Hurricane Ida slammed the Gulf Coast", "description": "One resident had to rush to his attic with his four dogs to avoid the rising waters.", "url": "https://www.cnn.com/2021/08/30/us/laplace-louisiana-hurricane-ida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830164313-01-laplace-louisiana-hurricane-ida-super-tease.jpg", "publishedAt": "2021-08-31T00:17:00Z", "content": "LaPlace, Louisiana (CNN)Residents of LaPlace endured hours of harsh winds and rising water as Hurricane Ida's fierce winds blew through the Louisiana town.\r\nIda slammed the Gulf Coast on Sunday, leav… [+3811 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Merissa Nathan Gerson", "title": "I fled Ida. Are we truly all together in a storm?", "description": "Merissa Nathan Gerson writes that along with the destruction Hurricane Ida has left in its wake, those in its path will inevitably confront grief -- often compounded by grief from past hurricanes -- as they fight to survive and recover from the storm.", "url": "https://www.cnn.com/2021/08/30/opinions/hurricane-ida-survivor-grief-gerson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830154343-27-hurricane-ida-0830-super-tease.jpg", "publishedAt": "2021-08-30T23:55:02Z", "content": "Merissa Nathan Gerson is the author of Forget Prayers, Bring Cake: A Single Woman's Guide to Grieving, a memoir on mourning in New Orleans, and visiting assistant professor of communication at Tulane… [+7003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "Climate change is making hurricanes stronger, slower and wetter. Ida checked all the boxes", "description": "Hurricane Ida was a prime example of how scientists say climate change is making storms worse.", "url": "https://www.cnn.com/2021/08/30/weather/hurricane-ida-climate-change-factors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830131419-hurricane-ida-mississippi-0830-super-tease.jpg", "publishedAt": "2021-08-30T23:16:01Z", "content": "(CNN)Human-caused climate change is making hurricanes more dangerous. They are producing more rainfall, moving slower once they make landfall and generating larger storm surges along the coast. Hurri… [+7657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Here's Donald Trump's most lasting, damaging legacy", "description": "Donald Trump has held very few consistent positions since he began running for president in 2015. The one that stands out? His relentless bashing of the media as \"fake news\" and insistence that Republicans tune out all forms of mainstream media.", "url": "https://www.cnn.com/2021/08/30/politics/trump-legacy-fake-news/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210316235645-cnne-trump-super-tease.jpg", "publishedAt": "2021-08-30T22:30:09Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kristen Rogers and Marnie Hunter, CNN", "title": "CDC adds 7 destinations to 'very high' Covid-19 travel risk list, including Puerto Rico and Switzerland", "description": "Switzerland, Puerto Rico and Saint Lucia have been added to the highest-risk destinations for travelers, according to the US Centers for Disease Control and Prevention's regularly revised travel advisories list. They come in at \"Level 4,\" the highest risk lev…", "url": "https://www.cnn.com/travel/article/cdc-very-high-risk-travel-destinations-august-30/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830163756-02-switzerland-0503-file-super-tease.jpg", "publishedAt": "2021-08-30T22:13:03Z", "content": "(CNN) Switzerland and Puerto Rico are now among the highest-risk destinations for travelers, according to the US Centers for Disease Control and Prevention's regularly updated travel advisories list.… [+2247 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Keith Magee", "title": "Lessons from the March on Washington on the value of allyship", "description": "Keith Magee writes that Martin Luther King, Jr. made an unforgettable contribution to the March on Washington and to the policy successes that stemmed from it, but we must remember that he was not part of the \"Big Six,\" but the diverse \"Top Ten\" -- when the g…", "url": "https://www.cnn.com/2021/08/30/opinions/allyship-importance-civil-rights-magee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210828110252-01-march-on-for-voting-rights-08-28-2021-washington-dc-super-tease.jpg", "publishedAt": "2021-08-30T22:06:51Z", "content": "Keith Magee is a theologian, political adviser and social justice scholar. He is chair and professor of practice in social justice at Newcastle University (United Kingdom) and senior fellow in cultur… [+5569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Bernie Sanders urges Californians to reject 'bold-faced Republican power grab' in new Newsom recall ad", "description": "California Gov. Gavin Newsom has enlisted Sen. Bernie Sanders in his fight to remain in office, with the progressive icon urging voters to reject a \"bold-faced Republican power grab\" in a new recall ad.", "url": "https://www.cnn.com/2021/08/30/politics/gavin-newsom-ad-bernie-sanders-california-recall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830163107-sanders-newsom-split-restricted-super-tease.jpg", "publishedAt": "2021-08-30T21:56:05Z", "content": "Washington (CNN)California Gov. Gavin Newsom has enlisted Sen. Bernie Sanders in his fight to remain in office, with the progressive icon urging voters to reject a \"bold-faced Republican power grab\" … [+2572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Rocket startup Astra's stock tanks after botched weekend test flight", "description": "Astra — a startup that's developing small, cheap rockets to deliver batches of satellites to space — attempted to put one of its 40-foot-tall rockets into orbit on Saturday, but the rocket failed during the launch.", "url": "https://www.cnn.com/2021/08/30/business/astra-stock-rocket-launch-failure-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830172836-restricted-astra-lv0006-test-flight-0828-screenshot-super-tease.jpg", "publishedAt": "2021-08-30T21:39:05Z", "content": "New York (CNN Business)Astra a startup that's developing small, cheap rockets to deliver batches of satellites to space attempted to put one of its 40-foot-tall rockets into orbit on Saturday, but th… [+5055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellen McAlpine", "title": "22 stylish cases to keep your AirPods Pro protected", "description": "AirPods Pro have continuously impressed us, so much so that they were our pick for best true wireless earbuds for Apple users. We're sure you love your AirPods Pro as much as we do, so we know you'll want to keep them protected while you take them on the go. …", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/best-airpods-pro-cases/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210827121400-best-airpods-pro-cases-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-08-30T21:31:14Z", "content": "AirPods Pro have continuously impressed us, so much so that they were our pick for best true wireless earbuds for Apple users. Were sure you love your AirPods Pro as much as we do, so we know youll w… [+5244 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ritchie, CNN", "title": "Afghan folk singer taken from his house and killed by the Taliban", "description": "Afghan folk singer Fawad Andarabi was dragged from his home and killed by the Taliban in a restive mountain province north of Kabul on Friday, a local journalist told CNN, raising fears of a return to the militant group's harsh rule of 20 years ago -- includi…", "url": "https://www.cnn.com/2021/08/30/asia/fawad-andarabi-afghan-folk-singer-killed-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830163952-taliban-flag-0820-2021-super-tease.jpg", "publishedAt": "2021-08-30T21:19:36Z", "content": "(CNN)Afghan folk singer Fawad Andarabi was dragged from his home and killed by the Taliban in a restive mountain province north of Kabul on Friday, a local journalist told CNN, raising fears of a ret… [+2617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN", "title": "This is what it's like to be a meteorologist from Louisiana and cover Ida", "description": "Each time I see a storm rapidly intensify in the Gulf of Mexico, my stomach churns.", "url": "https://www.cnn.com/2021/08/30/weather/weather-news-hurricane-ida-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830162155-weather-derek-van-dam-super-tease.jpg", "publishedAt": "2021-08-30T21:05:47Z", "content": "CNN Weather produces a weekly column, publishing Mondays with the weather news you should be aware of and the week's hurricane outlook. Find updates each week here.\r\n (CNN)Each time I see a storm rap… [+6473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico, Jason Cipriani and Jacob Krol", "title": "These are the best smartphones of 2021", "description": "Smartphones are at the center of our digital lives. And since you'll likely use your phone more than any other gadget you own, picking the right one to last you through years of use is crucial.", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/best-smartphones/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/201019224715-2-underscored-iphone-12-review.jpg?q=x_0,y_40,h_1467,w_2608,c_crop/w_800", "publishedAt": "2021-08-30T21:02:53Z", "content": "Smartphones are at the center of our digital lives. And since youll likely use your phone more than any other gadget you own, picking the right one to last you through years of use is crucial.\r\nFortu… [+24612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Staff", "title": "Have you made a life-altering change during the pandemic? Share your story", "description": "The colossal weight of the coronavirus pandemic has left few aspects of life untouched. While the desire to return to the way things were before 2020 is more than understandable, some have used the past year-plus to make a significant transformation -- for th…", "url": "https://www.cnn.com/2021/08/30/world/covid-life-altering-changes-pandemic-callout/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830164149-life-altering-changes-pandemic-callout-super-tease.jpg", "publishedAt": "2021-08-30T20:55:03Z", "content": "(CNN)The colossal weight of the coronavirus pandemic has left few aspects of life untouched. While the desire to return to the way things were before 2020 is more than understandable, some have used … [+769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega and Priya Krishnakumar, CNN", "title": "Hate crime reports in US surge to the highest level in 12 years, FBI says", "description": "More than 10,000 people reported to law enforcement last year that they were the victim of a hate crime because of their race or ethnicity, sexual orientation, gender, religion or disability  -- a number that has been on the rise in recent years, according to…", "url": "https://www.cnn.com/2021/08/30/us/fbi-report-hate-crimes-rose-2020/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830153536-01-stop-asian-hate-rally-file-super-tease.jpg", "publishedAt": "2021-08-30T20:52:28Z", "content": "(CNN)More than 10,000 people reported to law enforcement last year that they were the victim of a hate crime because of their race or ethnicity, sexual orientation, gender, religion or disability -- … [+6193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega and Priya Krishnakumar, CNN", "title": "Hate crime reports in US surge to the highest level in 12 years, FBI says", "description": "More than 10,000 people reported to law enforcement last year that they were the victim of a hate crime because of their race or ethnicity, sexual orientation, gender, religion or disability  -- a number that has been on the rise in recent years, according to…", "url": "https://www.cnn.com/2021/08/30/us/fbi-report-hate-crimes-rose-2020/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830153536-01-stop-asian-hate-rally-file-super-tease.jpg", "publishedAt": "2021-08-30T20:52:28Z", "content": "(CNN)More than 10,000 people reported to law enforcement last year that they were the victim of a hate crime because of their race or ethnicity, sexual orientation, gender, religion or disability -- … [+6193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, Oren Liebermann, Jennifer Hansler and Nicole Gaouette, CNN", "title": "The last US military planes have left Afghanistan marking the end of the United States' longest war", "description": "The last US military planes left Afghanistan, Commander of US Central Command, Gen. Frank McKenzie announced Monday at the Pentagon. The US departure marks the end of a fraught, chaotic and bloody exit from the United States' longest war.", "url": "https://www.cnn.com/2021/08/30/politics/us-military-withdraws-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830093526-05-afghanistan-0830-kabul-airport-super-tease.jpg", "publishedAt": "2021-08-30T20:45:07Z", "content": "(CNN)The last US military planes left Afghanistan, Commander of US Central Command, Gen. Frank McKenzie announced Monday at the Pentagon. The US departure marks the end of a fraught, chaotic and bloo… [+6393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ralph Ellis, CNN", "title": "Marine Rylee McCollum, 20, died in the Kabul blast weeks before the birth of his child, family says", "description": "Rylee McCollum's family in Wyoming wasn't surprised in the least when he enlisted in the Marines after high school.", "url": "https://www.cnn.com/2021/08/30/us/rylee-mccollum-marine-afghanistan-profile/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827191055-01-rylee-mccollum-super-tease.jpg", "publishedAt": "2021-08-30T20:17:51Z", "content": "(CNN)Rylee McCollum's family in Wyoming wasn't surprised in the least when he enlisted in the Marines after high school.\r\n\"He wanted to be a Marine his whole life and carried around his rifle in his … [+2936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Another Tesla reportedly using Autopilot hits a parked police car", "description": "Another Tesla has hit an emergency vehicle, apparently while using the Autopilot driver-assist feature, adding to a problem that is already the subject of a federal safety probe.", "url": "https://www.cnn.com/2021/08/30/business/tesla-crash-police-car/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830110033-01-tesla-police-crash-0828-super-tease.jpg", "publishedAt": "2021-08-30T20:08:42Z", "content": "New York (CNN Business)Another Tesla has hit an emergency vehicle, apparently while using the Autopilot driver-assist feature, adding to a problem that is already the subject of a federal safety prob… [+4030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Holly Thomas", "title": "Gen Z's telling nostalgia for Bennifer, 'Friends' and Y2K", "description": "Gen Z's apparent obsession with the pop culture and aesthetics of the early 2000s makes the Y2K moment (especially its misogyny and toxic celebrity culture) seem better than it actually was -- but their fusion of nostalgia with social conscience is an underst…", "url": "https://www.cnn.com/2021/08/30/opinions/bennifer-friends-y2k-gen-z-nostalgia-early-2000s-thomas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830150023-ben-affleck-jennifer-lopez-2003-super-tease.jpg", "publishedAt": "2021-08-30T20:00:07Z", "content": "Holly Thomas is a writer and editor based in London. She tweets @HolstaT. The opinions expressed in this commentary are solely those of the author. View more opinion articles on CNN. \r\n (CNN)Generati… [+7995 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Ida v. Katrina: How these hurricanes compare", "description": "Hurricane Ida made landfall in Louisiana on Sunday, exactly 16 years to the day after Hurricane Katrina slammed into the state and became the deadliest and costliest hurricane to hit the US in recorded history.", "url": "https://www.cnn.com/2021/08/30/us/hurricane-ida-katrina-new-orleans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830135034-hurricane-ida-french-quarter-0830-super-tease.jpg", "publishedAt": "2021-08-30T19:37:43Z", "content": "(CNN)Hurricane Ida made landfall in Louisiana on Sunday, exactly 16 years to the day after Hurricane Katrina slammed into the state and became the deadliest and costliest hurricane to hit the US in r… [+8452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The compounded tragedy of conservative radio hosts dying of Covid-19", "description": "On Saturday night, Florida conservative talk radio show Marc Bernier, an outspoken opponent of masking and vaccines to combat Covid-19, died of Covid-19. Earlier in the day, Caleb Wallace, a prominent opponent of masks as a means to slow the spread of Covid-1…", "url": "https://www.cnn.com/2021/08/30/politics/covid-19-deaths-conservative-radio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200802160801-02-anti-mask-protests-ohio-0718-super-tease.jpg", "publishedAt": "2021-08-30T19:17:25Z", "content": "(CNN)On Saturday night, Florida conservative talk radio show Marc Bernier, an outspoken opponent of masking and vaccines to combat Covid-19, died of Covid-19. Earlier in the day, Caleb Wallace, a pro… [+3881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "The Galaxy Z Fold 3 is a great combination of phone and tablet — but is it worth $1,799?", "description": "Samsung's 2-in-1 device, the Galaxy Z Fold 3, is part smartphone, part tablet — a full-sized smartphone that folds open to reveal another 6.7-inch display on the inside.", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/samsung-galaxy-z-fold-3-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830143746-9-galaxy-z-fold-3-review-underscored.jpg?q=x_0,y_54,h_2020,w_3592,c_crop/w_800", "publishedAt": "2021-08-30T19:07:45Z", "content": "Samsungs 2-in-1 device, the Galaxy Z Fold 3, is part smartphone, part tablet a full-sized smartphone that folds open to reveal another 6.7-inch display on the inside. \r\nWhile it brings some updates c… [+11965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Another Tesla reportedly using Autopilot hits a parked police car", "description": "Another Tesla has hit an emergency vehicle, apparently while using the Autopilot driver-assist feature, adding to a problem that is already the subject of a federal safety probe.", "url": "https://www.cnn.com/2021/08/30/business/telsa-crash-police-car/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830110033-01-tesla-police-crash-0828-super-tease.jpg", "publishedAt": "2021-08-30T18:25:53Z", "content": "New York (CNN Business)Another Tesla has hit an emergency vehicle, apparently while using the Autopilot driver-assist feature, adding to a problem that is already the subject of a federal safety prob… [+4030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Too much or too little sleep can harm your brain, study suggests", "description": "How long older adults sleep could affect their brain health, according to a study published Monday in the journal JAMA Neurology.", "url": "https://www.cnn.com/2021/08/30/health/sleep-duration-alzheimers-dementia-risk-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614023624-stock-man-sleeping-super-tease.jpg", "publishedAt": "2021-08-30T18:10:59Z", "content": "(CNN)How long older adults sleep could affect their brain health, according to a study published Monday in the journal JAMA Neurology. \r\nDisrupted sleep is common in late life, the study authors wrot… [+6192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The blame game: Whose fault is Afghanistan *really*?", "description": "With less than 48 hours remaining before the United States fully pulls out of Afghanistan, the Washington blame machine is running at top speed as all of the major players seek to avoid becoming the scapegoat for the disastrous last two (or so) weeks in the c…", "url": "https://www.cnn.com/2021/08/30/politics/afghanistan-kabul-biden-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210817084902-32-taliban-afghanistan-unf-super-tease.jpg", "publishedAt": "2021-08-30T17:59:30Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mike Park", "title": "Thrive Market is revolutionizing the way we buy food with its sustainability & conscious consumer focused values", "description": "With an eye on conscious consumers who want to live healthily, affordably and leave the Earth a better place for their grandkids, Thrive Market has found a way to truly revolutionize how we buy our food.", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/thrive-market-grocery-delivery/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830122623-thrive-market-paid-feature.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-08-30T16:33:14Z", "content": "With an eye on conscious consumers who want to live healthily, affordably and leave the Earth a better place for their grandkids, Thrive Market has found a way to truly revolutionize how we buy our f… [+3835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliott C. McLaughlin, CNN", "title": "Middle Tennessee is clawing its way out of devastation from recent flooding. It sits right in Ida's crosshairs", "description": "Middle Tennessee remains deep in recovery mode after last week's deadly and destructive flooding, and it appears the remnants of Hurricane Ida will offer the area little quarter.", "url": "https://www.cnn.com/2021/08/30/us/tennessee-hurricane-ida-flooding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210826185011-04-week-in-photos-0826-super-tease.jpg", "publishedAt": "2021-08-30T16:26:22Z", "content": "(CNN)Middle Tennessee remains deep in recovery mode after last week's deadly and destructive flooding, and it appears the remnants of Hurricane Ida will offer the area little quarter. \r\nIda, now a tr… [+4287 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Lauron", "title": "Find your new favorite dad hat or baseball cap with Redbubble's latest launch", "description": "What was once reserved for baseball players and dads who coach little league on weekends, caps are now a mainstay in nearly everyone's wardrobe. And it's not hard to understand why. Anyone who has found themselves running errands on a busy day or rushing out …", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/redbubble-hats-caps/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830121247-redbubble-paid-feature.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-08-30T16:20:28Z", "content": "What was once reserved for baseball players and dads who coach little league on weekends, caps are now a mainstay in nearly everyones wardrobe. And its not hard to understand why. Anyone who has foun… [+2875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Cassano", "title": "Gap has all the fashion essentials you need for a cozy fall — and more are on the way", "description": "Fall is so much more than a season; it's a mood. Yes, that includes scented candles, pumpkin spice lattes and cuddling underneath your favorite blanket while you sit in front of the TV — but the right wardrobe allows you to take all of that coziness with you …", "url": "https://www.cnn.com/2021/08/30/cnn-underscored/gap-fall-fashion/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210830120301-gap-fall-fashion-feature.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-08-30T16:06:52Z", "content": "Fall is so much more than a season; its a mood. Yes, that includes scented candles, pumpkin spice lattes and cuddling underneath your favorite blanket while you sit in front of the TV but the right w… [+3466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Only Murders in the Building' is Steve Martin's take on a Manhattan murder mystery", "description": "\"Only Murders in the Building\" might have been co-created by Steve Martin, but it has the feel of Woody Allen's lighter mysteries, drenched in New York-centric touches and characters as eccentric as the décor in their high-rise apartments. Martin, Martin Shor…", "url": "https://www.cnn.com/2021/08/30/entertainment/only-murders-in-the-building-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830030110-01-only-murders-in-the-building-hulu-super-tease.jpg", "publishedAt": "2021-08-30T16:01:22Z", "content": "(CNN)\"Only Murders in the Building\" might have been co-created by Steve Martin, but it has the feel of Woody Allen's lighter mysteries, drenched in New York-centric touches and characters as eccentri… [+2733 chars]"}]}