{"status": "ok", "totalResults": 90, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright and Jacqueline Howard, CNN", "title": "Harris to mark Maternal Health Day of Action at White House summit", "description": "Vice President Kamala Harris will mark the White House's first ever Maternal Health Day of Action on Tuesday when she hosts a summit with lawmakers, Cabinet secretaries and celebrities, a White House official said", "url": "https://www.cnn.com/2021/12/07/politics/kamala-harris-maternal-health-day-of-action/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211119112608-kamala-harris-file-october-12-2021-01-super-tease.jpg", "publishedAt": "2021-12-07T11:04:57Z", "content": "(CNN)Vice President Kamala Harris will mark the White House's first ever Maternal Health Day of Action on Tuesday when she hosts a summit with lawmakers, Cabinet secretaries and celebrities, a White … [+4837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Powerlifter Karenjeet Kaur Bains 'found a love for being strong.' Now she wants to inspire more women to take up strength sports", "description": "Karenjeet Kaur Bains started her sporting life as a sprinter, but when she took up powerlifting at the age of 17 -- initially to get faster and more explosive for athletics -- her focus soon changed.", "url": "https://www.cnn.com/2021/12/07/sport/karenjeet-kaur-bains-powerlifting-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203091708-05-karenjeet-kaur-bains-120321-super-tease.jpg", "publishedAt": "2021-12-07T11:02:35Z", "content": "(CNN)Karenjeet Kaur Bains started her sporting life as a sprinter, but when she took up powerlifting at the age of 17 -- initially to get faster and more explosive for athletics -- her focus soon cha… [+5900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Drake pulls out of Grammy Awards race", "description": "Canadian rapper Drake withdrew on Monday from the Grammy Awards, removing his two nominations for music's highest honors, sources close to the musician said.", "url": "https://www.cnn.com/2021/12/07/entertainment/drake-grammy-awards-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207042543-drake-10-30-2021-super-tease.jpg", "publishedAt": "2021-12-07T10:59:05Z", "content": "Canadian rapper Drake withdrew on Monday from the Grammy Awards, removing his two nominations for music's highest honors, sources close to the musician said.\r\nDrake, 35, got two Grammy nominations la… [+1362 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ivana-kottasova\">Ivana Kottasová</a> and Ed Upright, CNN", "title": "The latest on the Omicron coronavirus variant", "description": "A growing number of countries are detecting cases of the new Omicron coronavirus variant, as scientists race to determine how dangerous it is. Get the latest developments here.", "url": "https://www.cnn.com/world/live-news/omicron-coronavirus-variant-12-07-21-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203013958-vaccine-usa-file-12022021-super-tease.jpg", "publishedAt": "2021-12-07T10:31:02Z", "content": "The World Health Organization made a strong recommendation Monday against using convalescent plasma to treat Covid-19 patients, saying there was no indication it helped patients and that it took time… [+1872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Novak Djokovic named in Serbia team for 2022 ATP Cup in Sydney", "description": "Novak Djokovic was named in Serbia's team for the men's season-opening ATP Cup in January in Sydney, although the world No. 1 has yet to commit to the Australian Open following the organizers' mandate for Covid-19 vaccinations.", "url": "https://www.cnn.com/2021/12/07/tennis/novak-djokovic-atp-cup-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207100625-novak-djokovic-super-tease.jpg", "publishedAt": "2021-12-07T10:23:14Z", "content": "(Reuters)Novak Djokovic was named in Serbia's team for the men's season-opening ATP Cup in January in Sydney, although the world No. 1 has yet to commit to the Australian Open following the organizer… [+2073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matthew Chance and Katharina Krebs, CNN", "title": "Ukraine's defense minister warns there will be a 'bloody massacre' if Russia invades", "description": "Ukrainian Defense Minister Oleksiy Reznikov has told CNN there will be a \"really bloody massacre\" if Russia decides to invade Ukraine, and warned that \"Russian guys also will come back in the coffins,\" amid heightened alarm about troop movements on the nation…", "url": "https://www.cnn.com/2021/12/07/europe/oleksiy-reznikov-ukraine-russia-interview-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211204110824-ukraine-soldier-russia-border-120321-super-tease.jpg", "publishedAt": "2021-12-07T10:21:41Z", "content": "Odessa, Ukraine (CNN)Ukrainian Defense Minister Oleksiy Reznikov has told CNN there will be a \"really bloody massacre\" if Russia decides to invade Ukraine, and warned that \"Russian guys also will com… [+3551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Samsung names new co-CEOs for smartphones and chips", "description": "Samsung Electronics will merge its mobile and consumer electronics divisions, the firm said on Tuesday, naming new co-chief executives in the biggest reshuffle since 2017 to simplify its structure and focus on the logic chip business.", "url": "https://www.cnn.com/2021/12/07/tech/samsung-ceos-smartphones-chips/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211124015920-samsung-hq-flag-file-10282021-super-tease.jpg", "publishedAt": "2021-12-07T10:09:38Z", "content": "SeoulSamsung Electronics will merge its mobile and consumer electronics divisions, the firm said on Tuesday, naming new co-chief executives in the biggest reshuffle since 2017 to simplify its structu… [+2679 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Amir Vera, CNN", "title": "Heisman Trophy finalists announced, winner to be awarded Saturday", "description": "The winner of the Heisman will be announced Saturday.", "url": "https://www.cnn.com/2021/12/07/sport/heisman-trophy-finalists-college-football-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206225003-heisman-2021-finalists-4-split-super-tease.jpg", "publishedAt": "2021-12-07T09:55:24Z", "content": "(CNN)Michigan defensive end Aidan Hutchinson, Pittsburgh quarterback Kenny Pickett, Ohio State quarterback C.J. Stroud and Alabama quarterback Bryce Young were announced Monday as the four finalists … [+2234 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong, CNN", "title": "Kindness begins at home: How Traci Baxley uses 'radical love' to conquer fear and promote justice", "description": "Traci Baxley's new book, \"Social Justice Parenting: How to Raise Compassionate, Anti-Racist, Justice-Minded Kids,\" is what she calls a \"road-tested resource,\" grounded in her experiences as an educator and cultural coach for parents. She aims to help readers …", "url": "https://www.cnn.com/2021/12/07/health/social-justice-parenting-traci-baxley-antiracism-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206134628-mother-daughter-kindness-stock-super-tease.jpg", "publishedAt": "2021-12-07T09:54:22Z", "content": "(CNN)When her teenage son, upset that he'd forgotten to do a homework assignment, ran from their home one morning, Traci Baxley panicked. Instead of just worrying about his feelings, she feared for h… [+7680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden and Putin set to hold call at critical moment of escalating tensions over Ukraine", "description": "President Joe Biden will hold a call with Russian President Vladimir Putin on Tuesday in what is expected to be a highly consequential meeting for the two leaders amid escalating tensions between Russia and Ukraine.", "url": "https://www.cnn.com/2021/12/07/politics/biden-putin-call-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206100530-01-biden-putin-geneva-file-super-tease.jpg", "publishedAt": "2021-12-07T09:00:57Z", "content": "Washington (CNN)President Joe Biden will hold a call with Russian President Vladimir Putin on Tuesday in what is expected to be a highly consequential meeting for the two leaders amid escalating tens… [+4780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Kenyan police officer kills six in shooting rampage, police say", "description": "A Kenyan police officer shot dead five people in a rampage through the capital Nairobi on Tuesday and then shot and killed himself, the police Directorate of Criminal Investigations (DCI) said.", "url": "https://www.cnn.com/2021/12/07/africa/kenya-police-shooting-rampage-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnn/.e/img/4.0/logos/cnn_logo_social.jpg", "publishedAt": "2021-12-07T08:53:01Z", "content": "Nairobi, KenyaA Kenyan police officer shot dead five people in a rampage through the capital Nairobi on Tuesday and then shot and killed himself, the police Directorate of Criminal Investigations (DC… [+1167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jacopo Prisco, CNN", "title": "UAE's stunning Expo pavilion is topped by 'falcon wings'", "description": "Designed by Santiago Calatrava, the UAE pavilion is one of the architectural highlights of Expo 2020 Dubai.", "url": "https://www.cnn.com/travel/article/uae-pavilion-expo-2020-dubai-santiago-calatrava-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206135046-uae-pavilion-at-expo-2020-dec-2021-super-tease.jpg", "publishedAt": "2021-12-07T08:45:40Z", "content": "(CNN) Sitting at the heart of the World Expo site in Dubai, the pavilion of host country the United Arab Emirates (UAE) sports one of the most attention-grabbing designs at an event that is packed wi… [+3269 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "A giant 'black box' will gather all climate data for future civilizations to learn from", "description": "The \"black box\" will tell future civilizations how humankind created the climate crisis, and how we failed or succeeded to address it.", "url": "https://www.cnn.com/2021/12/07/world/earth-black-box-climate-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206192226-earth-black-box-climate-change-super-tease.jpg", "publishedAt": "2021-12-07T08:26:17Z", "content": "(CNN)Every time new climate research is published, news headlines are posted or tweets are shared, a giant steel box perched on a granite plain in the Australian state of Tasmania will be recording i… [+5088 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Amanda Watts, CNN", "title": "Michigan school shooting could have been prevented given warning signs, prosecutor says", "description": "One week after a school shooting in Michigan that killed four students and led to the manhunt and arrest of the suspect's parents, officials are wondering how the tragedy could have been prevented.", "url": "https://www.cnn.com/2021/12/07/us/michigan-oxford-high-school-shooting-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203131335-03-michigan-shooting-prosecutor-karen-mcdonald120321-super-tease.jpg", "publishedAt": "2021-12-07T08:22:36Z", "content": "(CNN)One week after a school shooting in Michigan that killed four students and led to the manhunt and arrest of the suspect's parents, officials are wondering how the tragedy could have been prevent… [+7208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Shackelford, CNN", "title": "Hawaii faces life-threatening flooding after some areas of the state see more than a foot of rain in 48 hours", "description": "Relentless rain in Hawaii has left parts of the state under the threat of \"significant and life-threatening flooding,\" the National Weather Service in Honolulu said Monday night, with some areas already tallying more than a foot of rain over a 48-hour span.", "url": "https://www.cnn.com/2021/12/07/weather/hawaii-rainfall-flooding-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206231739-02-hawaii-flooding-120621-super-tease.jpg", "publishedAt": "2021-12-07T08:00:58Z", "content": "(CNN)Relentless rain in Hawaii has left parts of the state under the threat of \"significant and life-threatening flooding,\" the National Weather Service in Honolulu said Monday night, with some areas… [+1989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Instagram will now tell users when to take a break from using the app", "description": "Just a day before the head of Instagram will face questions from lawmakers over its child safety practices, the company is rolling out a handful of new features aimed at making it harder for users, particularly teenagers, to fall down rabbit holes that could …", "url": "https://www.cnn.com/2021/12/07/tech/instagram-take-a-break/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206165034-restricted-instagram-phone-2021-super-tease.jpg", "publishedAt": "2021-12-07T08:00:44Z", "content": "(CNN Business)Just a day before the head of Instagram will face questions from lawmakers over its child safety practices, the company is rolling out a handful of new features aimed at making it harde… [+4253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "Texas could test one of Biden's core political bets", "description": "No state may benefit more than Texas from the social programs included in President Joe Biden's Build Back Better agenda, an array of recent analyses show -- despite the fierce opposition to the bill from the state's Republican leadership. And over time that …", "url": "https://www.cnn.com/2021/12/07/politics/biden-build-back-better-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210226145129-03-biden-texas-0226-super-tease.jpg", "publishedAt": "2021-12-07T07:15:51Z", "content": "It's hard to overstate the importance of this legislation in reducing child poverty. It's a very direct benefit, and unlike some of the other policies in the legislation that require the state to act… [+199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "China threatens the US with retaliation over diplomatic boycott of Winter Olympics", "description": "China has threatened the Biden administration with retaliation over its decision to impose a diplomatic boycott of the 2022 Winter Olympics in Beijing, warning the move could damage bilateral relations.", "url": "https://www.cnn.com/2021/12/07/china/china-response-us-olympic-boycott-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207015737-beijing-winter-olympics-china-training-1203-restricted-super-tease.jpg", "publishedAt": "2021-12-07T07:09:53Z", "content": "Hong Kong (CNN)China has threatened the Biden administration with retaliation over its decision to impose a diplomatic boycott of the 2022 Winter Olympics in Beijing, warning the move could damage bi… [+4967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Chen, Amy Simonson and Tina Burnside, CNN", "title": "Hawaii health officials order Navy to clean up contaminated drinking water after families are forced to move out of their homes", "description": "The Hawaii Department of Health is ordering the Navy to take immediate action to address contaminated drinking water at Joint Base Pearl Harbor-Hickam, an issue that has forced more than 700 people from their homes and left parents fearing the water they bath…", "url": "https://www.cnn.com/2021/12/07/us/hawaii-health-order-contaminated-water-navy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211204205441-honolulu-halawa-shaft-water-source-oahu-contamination-navy-well-super-tease.jpg", "publishedAt": "2021-12-07T06:42:10Z", "content": "(CNN)The Hawaii Department of Health is ordering the Navy to take immediate action to address contaminated drinking water at Joint Base Pearl Harbor-Hickam, an issue that has forced more than 700 peo… [+6633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "These are red flags students and schools can look out for to help prevent school violence", "description": "The clues can range from subtle to overt. And students are often in the best position to notice concerning behavior, a former FBI special agent and profiler says.", "url": "https://www.cnn.com/2021/12/07/us/school-shootings-red-flags/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211130143622-02-oxford-mi-lockdown-1130-screengrab-super-tease.jpg", "publishedAt": "2021-12-07T05:57:19Z", "content": "By Holly Yan, CNN\r\nUpdated 12:57 AM ET, Tue December 7, 2021\r\n (CNN)To help thwart potential school violence, students and staff need to beware of certain warning signs -- and feel comfortable report… [+11324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Selina Wang, CNN", "title": "What it's like traveling to Japan amid the Omicron variant", "description": "As governments have rushed to impose a fresh round of restrictions, travelers have found themselves confused, frustrated -- and in some cases-- suddenly stranded.", "url": "https://www.cnn.com/travel/article/japan-travel-restrictions-omicron-selina-wang-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205233416-japan-narita-airport-international-arrivals-file-120221-super-tease.jpg", "publishedAt": "2021-12-07T04:57:27Z", "content": "Tokyo (CNN) Like so many people around the world, my life was massively upended by the pandemic.\r\nAfter getting legally married in 2019, my husband and I planned to have our wedding celebration early… [+5034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Officers find loaded guns and machete at home of man accused of threatening to attack NYC Pride March", "description": "A man who allegedly threatened to attack the NYC Pride March in June and make the 2016 mass shooting at the Pulse nightclub in Orlando \"look like a cakewalk\" was arrested Monday, according to a news release from the US Attorney's Office in Brooklyn.", "url": "https://www.cnn.com/2021/12/06/us/new-york-arrest-gay-pride-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601103730-nyc-pride-flags-file-super-tease.jpg", "publishedAt": "2021-12-07T04:48:59Z", "content": "(CNN)A man who allegedly threatened to attack the NYC Pride March in June and make the 2016 mass shooting at the Pulse nightclub in Orlando \"look like a cakewalk\" was arrested Monday, according to a … [+2466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Gergen, CNN Senior Political Analyst", "title": "Opinion: The wit and grit of Bob Dole", "description": "When mourners gather this week to share stories about Bob Dole, what a feast they will have as they reminisce about the venerated politician's friendships, humor and, above all, his commitment to country, David Gergen writes.", "url": "https://www.cnn.com/2021/12/06/opinions/bob-dole-legacy-gergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/121105023412-dole-oct-1996-story-top.jpg", "publishedAt": "2021-12-07T04:01:59Z", "content": "David Gergen has been a White House adviser to four presidents of both parties and is a senior political analyst at CNN. A graduate of Harvard Law School, he is a professor of public service at the H… [+5213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Luke McGee, CNN", "title": "The EU is finally putting its money where its mouth is on China", "description": "The European Union has long been criticized for trying to have its cake and eat it when it comes to China. On one hand, it badly wants a strong economic relationship with its biggest partner for goods trade. On the other, it recognizes the Chinese government …", "url": "https://www.cnn.com/2021/12/06/business/the-eu-finally-has-a-china-plan-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206103257-01-china-eu-flags-file-super-tease.jpg", "publishedAt": "2021-12-07T03:10:22Z", "content": "London (CNN)The European Union has long been criticized for trying to have its cake and eat it when it comes to China. On one hand, it badly wants a strong economic relationship with its biggest part… [+10274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "India signs trade and arms deals with Russia during Putin's visit to New Delhi", "description": "Russia and India signed a flurry of trade and arms deals during President Vladimir Putin's visit to New Delhi for talks with Prime Minister Narendra Modi on Monday, including one that will see India produce more than 600,000 Kalashnikov assault rifles.", "url": "https://www.cnn.com/2021/12/06/india/india-russia-arms-deal-putin-modi-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206212207-india-china-arms-deal-putin-modi-120621-super-tease.jpg", "publishedAt": "2021-12-07T02:41:12Z", "content": "New DelhiRussia and India signed a flurry of trade and arms deals during President Vladimir Putin's visit to New Delhi for talks with Prime Minister Narendra Modi on Monday, including one that will s… [+1911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "The ominous signals Putin is sending", "description": "Frida Ghitis writes if Russian President Vladimir Putin is allowed to advance his troops along the Ukrainian border without serious consequences, he will continue to escalate his foreign policy of bullying and intimidation.", "url": "https://www.cnn.com/2021/12/06/opinions/vladimir-putin-russia-ukraine-signals-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211118175637-amanpour-putin-super-tease.jpg", "publishedAt": "2021-12-07T02:06:12Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+6818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Hiking Angels Landing at Zion National Park will require a permit", "description": "One of America's most popular national park hikes will require a permit as of 2022.", "url": "https://www.cnn.com/travel/article/angels-landing-zion-national-park-permit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206200618-angels-landing-zion-national-park-permit-super-tease.jpg", "publishedAt": "2021-12-07T01:48:44Z", "content": "Lilit Marcus, CNNPublished 7th December 2021\r\n(CNN) One of America's most popular national park hikes will require a permit as of 2022.\r\nOfficials at Zion National Park have announced that as of Apri… [+2345 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega, CNN", "title": "Family gets $2.2 million settlement for death of Georgia inmate, calls for criminal investigation", "description": "Georgia's troubled prison system has agreed to pay $2.2 million to the family of a transgender woman, whose threats of suicide were ignored and who was left hanging in her cell for several minutes before getting medical help, according to surveillance video a…", "url": "https://www.cnn.com/2021/12/06/us/georgia-prison-inmate-death-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206160309-valdosta-state-prison-file-super-tease.jpg", "publishedAt": "2021-12-07T01:39:05Z", "content": "(CNN)Georgia's troubled prison system has agreed to pay $2.2 million to the family of a transgender woman, whose threats of suicide were ignored and who was left hanging in her cell for several minut… [+6614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward and Brent Swails, CNN\nPhotographs by Brent Swails, CNN", "title": "The world's newest nation is both drying up and drowning", "description": "The worst floods in six decades have swallowed not only the very roads that people need to escape, but also their farms, homes and markets.", "url": "https://www.cnn.com/2021/12/06/africa/south-sudan-floods-climate-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206125511-03-south-sudan-flooding-super-tease.jpg", "publishedAt": "2021-12-07T01:38:13Z", "content": "Bentiu, South Sudan (CNN)Many of the main roads running through Unity State are now completely submerged, yet the traffic remains. There are no cars, just people, some of whom swim, others wade, push… [+8885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Smart, CNN", "title": "Parents knowingly sent their child to school after they tested positive for Covid-19. 75 classmates were forced to quarantine", "description": "One family's decision to send their child to school after testing positive for Covid-19 resulted in dozens of canceled Thanksgiving plans for other classmates, according to a California school district.", "url": "https://www.cnn.com/2021/12/06/us/student-quarantine-covid-school-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206131018-neil-cummings-elementary-school-covid-quarantine-super-tease.jpg", "publishedAt": "2021-12-07T00:40:50Z", "content": "(CNN)One family's decision to send their child to school after testing positive for Covid-19 resulted in dozens of canceled Thanksgiving plans for other classmates, according to a California school d… [+5167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "'Visible Spectrum': Moving portraits show autism in a new light", "description": "After her son was diagnosed with Asperger's syndrome, Mary Berridge decided to use photography to challenge stereotypes about autism spectrum disorders.", "url": "https://www.cnn.com/style/article/visible-spectrum-mary-berridge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211118142113-03-story-mary-berridge-visible-spectrum-super-tease.jpg", "publishedAt": "2021-12-07T00:16:32Z", "content": "artsPublished 7th December 2021\r\nAlthough Mary Berridge's son displayed signs of autism from birth -- including motor skill and speech delays, difficulty with change and sensory sensitivity -- it too… [+5901 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Paul LeBlanc, CNN", "title": "Biden Supreme Court commission's draft report details 'profound' disagreement over adding seats to bench", "description": "A controversial commission set up by President Joe Biden to explore changes to the US Supreme Court concluded in a draft final report Monday that there was \"profound\" disagreement over whether to add more seats to the bench but suggested more consensus for te…", "url": "https://www.cnn.com/2021/12/06/politics/supreme-court-commission/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210129144107-05-scotus-exterior-file-super-tease.jpg", "publishedAt": "2021-12-06T23:49:41Z", "content": "Washington (CNN)A controversial commission set up by President Joe Biden to explore changes to the US Supreme Court concluded in a draft final report Monday that there was \"profound\" disagreement ove… [+3092 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This is the hidden cost of Trumpism", "description": "By any measure, Charlie Baker is one of the most popular governors in the country.", "url": "https://www.cnn.com/2021/12/06/politics/charlie-baker-gop-trumpism/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181115222512-charlie-baker-super-tease.jpg", "publishedAt": "2021-12-06T23:31:58Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Marijuana may make sleep worse, especially for regular users, study finds", "description": "Many people turn to marijuana to help them sleep, but emerging research is questioning that assumption.", "url": "https://www.cnn.com/2021/12/06/health/marijuana-sleep-problems-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917002113-02-marijuana-smoking-stock-super-tease.jpg", "publishedAt": "2021-12-06T23:31:34Z", "content": "Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\n (CNN)It's a common assumption among marijuana users: Using weed will help you fa… [+5827 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel, Michael Warren and Ryan Nobles, CNN", "title": "CNN Exclusive: Top Pence aide cooperating with January 6 committee", "description": "Marc Short, the former chief of staff to Vice President Mike Pence, is cooperating with the January 6 committee, a significant development that will give investigators insight from one of the highest-ranking Trump officials, according to three sources with kn…", "url": "https://www.cnn.com/2021/12/06/politics/marc-short-pence-aide-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206172644-01-marc-short-file-super-tease.jpg", "publishedAt": "2021-12-06T22:59:59Z", "content": "Washington (CNN)Marc Short, the former chief of staff to Vice President Mike Pence, is cooperating with the January 6 committee, a significant development that will give investigators insight from on… [+3184 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Carey, CNN", "title": "Suspected car-ramming attack by Palestinian teen highlights rising tensions, amid questions over Israeli police actions", "description": "A 15-year old Palestinian boy suspected of deliberately ramming his car into an Israeli army checkpoint, injuring a security guard, has been shot dead, according to Israel's Defense Ministry. The security guard was taken to hospital where he was undergoing su…", "url": "https://www.cnn.com/2021/12/06/middleeast/israeli-police-kill-palestinian-jerusalem-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205084803-palestinian-man-killed-jerusalem-120421-super-tease.jpg", "publishedAt": "2021-12-06T22:48:38Z", "content": "Jerusalem (CNN)A 15-year old Palestinian boy suspected of deliberately ramming his car into an Israeli army checkpoint, injuring a security guard, has been shot dead, according to Israel's Defense Mi… [+4170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, CNN", "title": "Biden faces high-stakes test in call with Putin over Ukraine", "description": "President Joe Biden is set for one of the most critical calls of his presidency on Tuesday with Russian President Vladimir Putin, as he gets stark warnings from the US intelligence community that Russia is preparing to invade Ukraine as soon as next month.", "url": "https://www.cnn.com/2021/12/06/politics/joe-biden-vladimir-putin-call-on-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709220100-biden-putin-super-tease.jpg", "publishedAt": "2021-12-06T22:41:32Z", "content": "(CNN)President Joe Biden is set for one of the most critical calls of his presidency on Tuesday with Russian President Vladimir Putin, as he gets stark warnings from the US intelligence community tha… [+7132 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Geneva Sands, CNN", "title": "'Remain in Mexico' program restarts, fueling frustration among immigration advocates", "description": "The Biden administration relaunched the Trump-era border policy known as \"Remain in Mexico\" on Monday, kicking back into gear the program allowing officials to send non-Mexican migrants to Mexico to await their US immigration court hearings.", "url": "https://www.cnn.com/2021/12/06/politics/biden-remain-in-mexico/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601182005-01-asylum-seekers-crossing-border-0317-super-tease.jpg", "publishedAt": "2021-12-06T22:36:27Z", "content": "(CNN)The Biden administration relaunched the Trump-era border policy known as \"Remain in Mexico\" on Monday, kicking back into gear the program allowing officials to send non-Mexican migrants to Mexic… [+4675 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown and Marnie Hunter, CNN", "title": "CDC adds 5 European countries to 'very high' risk list for Covid", "description": "The US Centers for Disease Control and Prevention has put five places in Europe -- including one of the world's biggest tourism powerhouses -- on its list of destinations for \"very high\" Covid-19 travel risk.", "url": "https://www.cnn.com/travel/article/cdc-very-high-risk-travel-destinations-december-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206162731-france-paris-oct-2021-super-tease.jpg", "publishedAt": "2021-12-06T22:25:20Z", "content": "(CNN) The US Centers for Disease Control and Prevention has put five places in Europe -- including one of the world's biggest tourism powerhouses -- on its list of destinations for \"very high\" Covid-… [+3620 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "Devin Nunes says he's leaving Congress by the end of the year", "description": "Republican Rep. Devin Nunes of California announced Monday he'll leave the House in the coming weeks, in order to follow an undisclosed \"new opportunity to fight for the most important issues I believe in.\"", "url": "https://www.cnn.com/2021/12/06/politics/devin-nunes-retiring/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517192518-nunes-feb-2020-super-tease.jpg", "publishedAt": "2021-12-06T22:10:20Z", "content": "(CNN)Republican Rep. Devin Nunes of California announced Monday he'll leave the House in the coming weeks, in order to follow an undisclosed \"new opportunity to fight for the most important issues I … [+255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Paul Begala", "title": "The war that we should all agree is worth fighting", "description": "Paul Begala writes that 50 years ago, in the midst of poltical division, political parties came together to fight a common enemy: cancer. Now, Americans can come together once more to tackle the devastating disease that continues to cost too many lives.", "url": "https://www.cnn.com/2021/12/06/opinions/nixon-war-on-cancer-begala/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206154200-biden-bipartisan-meeting-cancer-file-030321-super-tease.jpg", "publishedAt": "2021-12-06T22:08:07Z", "content": "Paul Begala, a Democratic strategist and CNN political commentator, was a political consultant for Bill Clinton's presidential campaign in 1992 and served as a counselor to Clinton in the White House… [+5148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray and Jeremy Herb, CNN", "title": "Trump allies are angling for election jobs up and down the ballot. That could have consequences in 2024", "description": "As former President Donald Trump prepares for a potential comeback bid in 2024, his allies are flocking to election jobs all the way down to the local level in key battleground states, raising new concerns that the election officials who blocked Trump's effor…", "url": "https://www.cnn.com/2021/12/06/politics/trump-allies-local-elections/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929183119-restricted-election-voting-booth-kentucky-2020-super-tease.jpg", "publishedAt": "2021-12-06T22:06:00Z", "content": "(CNN)As former President Donald Trump prepares for a potential comeback bid in 2024, his allies are flocking to election jobs all the way down to the local level in key battleground states, raising n… [+10899 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "Christmas trees burned by the heat", "description": "For a state that produces more Christmas trees than anywhere else in the country, Oregon Christmas tree growers are struggling after Mother Nature put on a show in 2021.", "url": "https://www.cnn.com/2021/12/06/weather/weather-news-heat-kills-christmas-trees-hawaii-flooding-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206112536-weather-christmas-tree-drought-card-image-super-tease.jpg", "publishedAt": "2021-12-06T21:23:03Z", "content": "CNN Weather produces a weekly column, publishing Mondays, with the weather news you should be aware of as you plan out your week.Find updates each week here. If you enjoy this, sign up to get emailup… [+9048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Court order seizes websites used by China-based hacking group, Microsoft says", "description": "Microsoft used a court order to seize dozens of websites that a China-based hacking group was using for a cyber-espionage campaign against organizations in the US and 28 other countries, the tech giant said Monday.", "url": "https://www.cnn.com/2021/12/06/politics/microsoft-china-hacking-court-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716161640-microsoft-super-tease.jpg", "publishedAt": "2021-12-06T21:00:19Z", "content": "(CNN)Microsoft used a court order to seize dozens of websites that a China-based hacking group was using for a cyber-espionage campaign against organizations in the US and 28 other countries, the tec… [+2191 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Jarrett, CNN", "title": "Justice Department closes investigation into Emmett Till killing after failing to prove key witness lied", "description": "The Justice Department has officially closed its investigation into the infamous of killing Emmett Till for a second time, two sources familiar with the investigation said, leaving only more questions after a potentially significant claim from one of the last…", "url": "https://www.cnn.com/2021/12/06/politics/emmett-till-case-closed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206115426-emmett-till-file-restricted-super-tease.jpg", "publishedAt": "2021-12-06T20:00:04Z", "content": "(CNN)The Justice Department has officially closed its investigation into the infamous of killing Emmett Till for a second time, two sources familiar with the investigation said, leaving only more que… [+1454 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "This social justice buzzword is Dictionary.com's Word of the Year", "description": "Dictionary.com has chosen a term new to its online reference service for its Word of the Year -- a word that, it says, \"acts as a powerful prism through which to view the defining events and experiences of 2021.\"", "url": "https://www.cnn.com/2021/12/06/us/dictionary-com-word-of-the-year-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206125617-dictionary-com-word-of-the-year-2021-super-tease.jpg", "publishedAt": "2021-12-06T19:32:44Z", "content": "(CNN)Dictionary.com has chosen a term new to its online reference service for its Word of the Year -- a word that, it says, \"acts as a powerful prism through which to view the defining events and exp… [+2296 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Mount Semeru volcano erupts in Indonesia", "description": "Mount Semeru, one of Indonesia's most active volcanoes, erupted on Saturday, December 4, shooting out smoldering hot ash in East Java's Lumajang district.", "url": "https://www.cnn.com/2021/12/06/asia/gallery/mount-semeru-volcano-indonesia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206162003-01-mount-semeru-volcano-120521-super-tease.jpg", "publishedAt": "2021-12-06T19:29:57Z", "content": "A man carries a child Sunday as other people salvage their belongings from an area covered in volcanic ash at the Sumberwuluh village in Indonesia's Lumajang district.\r\nUpdated 2:29 PM ET, Mon Decemb… [+691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "2022 is when investors will finally return to value stocks. Really", "description": "Stop us if you've heard this before: Market strategists are predicting that 2022 will finally be the year when investors choose value stocks -— like banking, oil, consumer, industrial and healthcare companies — over Big Techs, such as Apple, Amazon and Facebo…", "url": "https://www.cnn.com/2021/12/06/investing/value-stocks-investing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201094724-wall-street-1130-super-tease.jpg", "publishedAt": "2021-12-06T18:33:00Z", "content": "New York (CNN Business)Stop us if you've heard this before: Market strategists are predicting that 2022 will finally be the year when investors choose value stocks - like banking, oil, consumer, indu… [+3720 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Malala Yousafzai meets with Blinken, calls on US to take action for Afghan women and girls", "description": "Nobel Peace Prize laureate Malala Yousafzai met Monday with US Secretary of State Antony Blinken and called on the United States to take action to ensure that Afghan girls and women are able to return to the classroom and the workplace in the wake of the Tali…", "url": "https://www.cnn.com/2021/12/06/politics/malala-yousafzai-antony-blinken-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206123429-01-malala-blinken-1206-super-tease.jpg", "publishedAt": "2021-12-06T18:29:52Z", "content": "(CNN)Nobel Peace Prize laureate Malala Yousafzai met Monday with US Secretary of State Antony Blinken and called on the United States to take action to ensure that Afghan girls and women are able to … [+2536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy, CNN", "title": "US announces diplomatic boycott of 2022 Winter Olympics in Beijing", "description": "The Biden administration will not send any diplomatic representatives to the 2022 Winter Olympics in Beijing as a statement against Chinese human rights abuses in Xinjiang, White House press secretary Jen Psaki announced Monday.", "url": "https://www.cnn.com/2021/12/06/politics/us-diplomatic-boycott-winter-olympics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211031174109-psaki-101821-super-tease.jpg", "publishedAt": "2021-12-06T18:28:31Z", "content": "(CNN)The Biden administration will not send any diplomatic representatives to the 2022 Winter Olympics in Beijing as a statement against Chinese human rights abuses in Xinjiang, White House press sec… [+1371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "Investing in crypto? What to know about the new tax reporting requirements", "description": "Thanks to new third-party reporting rules starting in 2023, it will be harder to remain anonymous when engaging in cryptocurrency and other digital asset transactions.", "url": "https://www.cnn.com/2021/12/06/business/money/cryptocurrency-digital-assets-information-reporting-feseries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211026150804-20211029-cypto-coin-gfx-super-tease.jpg", "publishedAt": "2021-12-06T18:28:25Z", "content": "Reporting your cryptocurrency trades to the Internal Revenue Service will no longer be based on an honor system. Starting with tax year2023,any of your potentially taxabledigital asset transactions w… [+5402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Hayes, Melissa Macaya and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Jussie Smollett testifies in his own trial", "description": "Jussie Smollett, who is accused of lying to police about an alleged hate crime, is set to testify in his own defense. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/jussie-smollett-trial-12-06-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211127094635-01-jussie-smollett-trial-preview-file-071421-super-tease.jpg", "publishedAt": "2021-12-06T18:09:40Z", "content": "The long road in the Jussie Smollett case finally reached trial last week in Chicago, more than two years after police first alleged the actor lied about being the victim of a hate crime and wrongful… [+1596 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Ilhan Omar just put Nancy Pelosi on the clock over Lauren Boebert", "description": "The House only has four days left in session this year. And Minnesota Democratic Rep. Ilhan Omar said Sunday she expects Speaker Nancy Pelosi to use at least some of that time to sanction Colorado Republican Rep. Lauren Boebert for suggesting that she was a t…", "url": "https://www.cnn.com/2021/12/06/politics/ilhan-omar-lauren-boebert/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211126172801-ilhan-omar-file-super-tease.jpg", "publishedAt": "2021-12-06T17:54:07Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Fortinsky, CNN", "title": "Former Rep. Max Rose to run again for the House seat in New York he lost in 2020", "description": "Former Democratic Rep. Max Rose announced he will run again for the US House seat he lost in 2020 after a single term to Republican Rep. Nicole Malliotakis, who serves the New York district that includes Staten Island and some of Brooklyn.", "url": "https://www.cnn.com/2021/12/06/politics/max-rose-running-again-congress-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200214171700-max-rose-nicole-malliotakis-split-super-tease.jpg", "publishedAt": "2021-12-06T16:57:46Z", "content": "(CNN)Former Democratic Rep. Max Rose announced he will run again for the US House seat he lost in 2020 after a single term to Republican Rep. Nicole Malliotakis, who serves the New York district that… [+467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "Dow climbs more than 600 points amid renewed volatility", "description": "It's a strong start to the week on Wall Street, where the Dow has climbed more than 600 points amid a rebound from last week's losses.", "url": "https://www.cnn.com/2021/12/06/investing/dow-stock-market-today/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206104011-nyse-1201-super-tease.jpg", "publishedAt": "2021-12-06T16:29:45Z", "content": "New York (CNN Business)It's a strong start to the week on Wall Street, where the Dow has climbed more than 600 points amid a rebound from last week's losses.\r\nThe Dow(INDU) was up 1.8%, or some 610 p… [+1685 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "OMG! LOL! BuzzFeed's trading on the Nasdaq", "description": "At Nasdaq Monday, BuzzFeed CEO Jonah Peretti — flanked by Instagram celebrity \"Dude with Sign\" and people holding oversized yellow \"OMG\" and \"win\" signs — rang the opening bell for BuzzFeed's debut as a public company. Simultaneously at BuzzFeed's headquarter…", "url": "https://www.cnn.com/2021/12/06/media/buzzfeed-ipo-stock-listing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206093912-01-buzzfeed-nasdaq-1206-super-tease.jpg", "publishedAt": "2021-12-06T16:19:51Z", "content": "New York (CNN Business)At Nasdaq Monday, BuzzFeed CEO Jonah Peretti flanked by Instagram celebrity \"Dude with Sign\" and people holding oversized yellow \"OMG\" and \"win\" signs rang the opening bell for… [+2446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why Donald Trump cares *so* much about Georgia", "description": "Donald Trump's recruitment of former Sen. David Perdue to take on Gov. Brian Kemp in next year's Republican primary is part of a broader effort by the former president to install loyalists in the state with an eye not just on 2022 but the possibility of his r…", "url": "https://www.cnn.com/2021/12/06/politics/donald-trump-georgia-david-perdue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210105112259-01-trump-rally-ga-0104-super-tease.jpg", "publishedAt": "2021-12-06T16:07:05Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Wikipedia's first ever edit is being auctioned as an NFT", "description": "Wikipedia co-founder Jimmy Wales is auctioning off a non-fungible token (NFT) of the first edit ever made on the site.", "url": "https://www.cnn.com/style/article/jimmy-wales-wikipedia-edit-nft-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206103048-restricted-01-jimmy-wales-wikipedia-edit-nft-scli-intl-super-tease.jpg", "publishedAt": "2021-12-06T16:02:08Z", "content": "luxuryPublished 6th December 2021\r\nWikipedia co-founder Jimmy Wales is auctioning off a non-fungible token (NFT) of the first edit ever made on the site.\r\nWales typed the words \"Hello, World!\" after … [+2937 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Norwegian club Tromsø releases 'first kit in history with a QR code' to highlight issues surrounding 2022 World Cup in Qatar", "description": "It's a football uniform with a difference -- it has a QR code which, when scanned, will direct users to a web page to learn more about the issues of sportswashing and alleged human rights abuses that surround the 2022 World Cup in Qatar.", "url": "https://www.cnn.com/2021/12/06/football/tromso-qatar-qr-kit-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206115629-02-tromso-norway-intl-spt-120621-super-tease.jpg", "publishedAt": "2021-12-06T15:59:25Z", "content": "(CNN)It's a football uniform with a difference -- it has a QR code which, when scanned, will direct users to a web page to learn more about the issues of sportswashing and alleged human rights abuses… [+4442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden considers sanctions against Putin's inner circle ahead of this week's key call", "description": "US officials are currently weighing a wide set of sanctions on Russia meant to deter Russian President Vladimir Putin from launching an invasion into Ukraine, according to people familiar with the discussions.", "url": "https://www.cnn.com/2021/12/06/politics/biden-putin-call-ukraine-sanctions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210615162537-02-biden-putin-split-super-tease.jpg", "publishedAt": "2021-12-06T14:46:29Z", "content": "(CNN)US officials are currently weighing a wide set of sanctions on Russia meant to deter Russian President Vladimir Putin from launching an invasion into Ukraine, according to people familiar with t… [+1238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Forever Prisoner' explores how the US compromised its values after Sept. 11", "description": "If a goal of the Sept. 11 terrorists was to undermine American values, \"The Forever Prisoner\" makes the case on that score, at least, the bad guys won. Focusing on the treatment of Abu Zubaydah, a former associate of Osama bin Laden held in detention since 20…", "url": "https://www.cnn.com/2021/12/06/entertainment/the-forever-prisoner-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203180237-01-the-forever-prisoner-hbo-super-tease.jpg", "publishedAt": "2021-12-06T14:31:13Z", "content": "(CNN)If a goal of the Sept. 11 terrorists was to undermine American values, \"The Forever Prisoner\" makes the case on that score, at least, the bad guys won. Focusing on the treatment of Abu Zubaydah,… [+2688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Landscapers' plants Olivia Colman and David Thewlis on a flawed foundation", "description": "The blueprint for \"Landscapers,\" a four-part British miniseries airing on HBO, turns out to be considerably sturdier than the construction, somewhat wasting the dream pairing of Olivia Colman and David Thewlis. It's still an interesting detour into bizarre tr…", "url": "https://www.cnn.com/2021/12/06/entertainment/landscapers-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203180800-02-landscapers-hbo-super-tease.jpg", "publishedAt": "2021-12-06T14:29:01Z", "content": "(CNN)The blueprint for \"Landscapers,\" a four-part British miniseries airing on HBO, turns out to be considerably sturdier than the construction, somewhat wasting the dream pairing of Olivia Colman an… [+2387 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "January 6 committee postpones depositions with Michael Flynn and Trump's personal assistant", "description": "One-time Trump national security adviser Michael Flynn and the former President's personal assistant, who were scheduled to be deposed by a congressional committee Monday, have been granted short postponements, a committee aide tells CNN.", "url": "https://www.cnn.com/2021/12/06/politics/michael-flynn-deposition-postponed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201207174534-02-michael-flynn-lead-image-super-tease.jpg", "publishedAt": "2021-12-06T14:28:08Z", "content": "(CNN)One-time Trump national security adviser Michael Flynn and the former President's personal assistant, who were scheduled to be deposed by a congressional committee Monday, have been granted shor… [+486 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Bitcoin's plunge is another sign of market angst", "description": "Over the past week, as markets were churning on fears that the Omicron variant could derail the global economic recovery, bitcoin prices stayed surprisingly stable. Then came the weekend.", "url": "https://www.cnn.com/2021/12/06/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206121359-bitcoin-plunge-120621-super-tease.jpg", "publishedAt": "2021-12-06T13:11:01Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+5741 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "Europe's tastiest cheeses", "description": "The best cheeses in Europe? Well, there's the stinkiest in the world, or the most expensive on the planet. Then there are cheeses for grilling, to eat with chutney, or to enjoy by themselves. Here are Europe's tastiest cheeses.", "url": "https://www.cnn.com/travel/article/europe-best-cheeses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211125200754-20-europe-best-cheeses-112521-super-tease.jpg", "publishedAt": "2021-12-06T12:43:44Z", "content": "(CNN) It is a truth universally acknowledged that (almost) everyone loves cheese. \r\nAnd it's a truth almost as universally acknowledged that Europe makes some of the best. \r\nHere, there are thousand-… [+9770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for December 6: School shooting, pandemic, Congress, China, Russia", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/12/06/us/five-things-december-6-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203231903-01-oxford-high-school-memorial-1203-super-tease.jpg", "publishedAt": "2021-12-06T11:50:19Z", "content": "(CNN)The Biden administration is expected to announce a diplomatic boycott of the 2022 Beijing Olympics this week. The move would send a strong message to China while still allowing American athletes… [+5867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by SE Cupp", "title": "SE Cupp: The podcast episode on mental health I hope everyone hears", "description": "Jalen Rose's December 2 episode of \"Renaissance Man\" features a bravely honest interview with Charlamagne Tha God, the hugely popular radio host, TV personality, and arbiter of cultural and political influence. It's practically a public service announcement o…", "url": "https://www.cnn.com/2021/12/06/opinions/jalen-rose-charlamagne-podcast-mens-mental-health-cupp/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205184818-jalen-rose-charlamagne-podcast-mens-mental-health-cupp-split-super-tease.jpg", "publishedAt": "2021-12-06T11:14:00Z", "content": "SE Cupp is a CNN political commentator. The views expressed in this commentary are solely hers. View more opinion on CNN.\r\n (CNN)Jalen Rose, the prolific sports analyst and NBA veteran, describes his… [+5432 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Far-right French presidential hopeful grabbed by neck at heated rally", "description": "French far-right presidential candidate Eric Zemmour promised on Sunday a \"reconquest\" against decades of decline at his first political rally, as scuffles with anti-racism protesters broke out on its fringes.", "url": "https://www.cnn.com/2021/12/06/europe/french-far-right-zemmour-headlock-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206045536-eric-zemmour-event-violence-120521-super-tease.jpg", "publishedAt": "2021-12-06T10:57:03Z", "content": "Villepinte, FranceFrench far-right presidential candidate Eric Zemmour promised on Sunday a \"reconquest\" against decades of decline at his first political rally, as scuffles with anti-racism proteste… [+2902 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "ITF 'does not want to punish a billion people' by suspending China tournaments in Peng Shuai row", "description": "The governing body of tennis, the International Tennis Foundation (ITF), has not suspended tournaments in China because it \"does not want to punish a billion people,\" its president said Sunday.", "url": "https://www.cnn.com/2021/12/06/tennis/peng-shuai-itf-not-suspending-tournaments-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211124083424-peng-shuai-wta-super-tease.jpg", "publishedAt": "2021-12-06T10:45:33Z", "content": "(CNN)The governing body of tennis, the International Tennis Foundation (ITF), has not suspended tournaments in China because it \"does not want to punish a billion people,\" its president said Sunday. … [+4619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "US reluctance to lift sanctions main hurdle to reviving 2015 pact, Iran official says", "description": "The reluctance of the United States to lift all sanctions on Iran is the main challenge to reviving a 2015 nuclear pact, a senior Iranian official said on Sunday, as Western powers questioned Tehran's determination to salvage the agreement.", "url": "https://www.cnn.com/2021/12/06/middleeast/iran-vienna-talks-sanctions-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206033318-restricted-iran-nuclear-talks-vienna-11-29-2021-super-tease.jpg", "publishedAt": "2021-12-06T10:31:13Z", "content": "Dubai, UAEThe reluctance of the United States to lift all sanctions on Iran is the main challenge to reviving a 2015 nuclear pact, a senior Iranian official said on Sunday, as Western powers question… [+2545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Here's what pleading the Fifth is and what it means for the January 6 committee", "description": "The January 6 committee is facing a new challenge as multiple people it has subpoenaed signal their intentions to invoke Fifth Amendment protections ahead of their testimony.", "url": "https://www.cnn.com/2021/12/06/politics/pleading-the-fifth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812114113-01-jeff-clark-file-2020-super-tease.jpg", "publishedAt": "2021-12-06T10:25:00Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The January 6 committee is facing a new challenge as multiple peopl… [+5494 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ivana-kottasova\">Ivana Kottasová</a> and Kathryn Snowdon, CNN", "title": "The latest on the Omicron variant", "description": "A growing number of countries across the world are detecting cases of the new Omicron variant of the coronavirus. Get the latest developments here.", "url": "https://www.cnn.com/world/live-news/omicron-coronavirus-variant-12-06-21-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211203013958-vaccine-usa-file-12022021-super-tease.jpg", "publishedAt": "2021-12-06T10:13:55Z", "content": "South African hospitals have been ramping up preparations to admit more patients as the the country enters its fourth wave of the Covid-19 pandemic, South African President Cyril Ramaphosa said in a … [+1079 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Barber, CNN", "title": "Vegetarian? More like planetarian — how tiny tweaks to your dinner can help save the planet", "description": "Going \"planetarian\" is a flexible strategy created by Maggy Keet, founder of the online community Planetarian Life, as a way to help ease people into a more plant-rich diet.", "url": "https://www.cnn.com/2021/12/06/health/eat-less-meat-planetarian-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205183129-02-eat-less-meat-planetarian-wellness-super-tease.jpg", "publishedAt": "2021-12-06T10:02:59Z", "content": "(CNN)Eating less meat and dairy is one of the ways we can have a positive impact on the future of the planet, as multiple studies on climate change have demonstrated. \r\nBut as anyone who is holding o… [+5412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Lewis Hamilton accuses Max Verstappen of 'being over the limit' after thrilling Saudi Arabian GP", "description": "Lewis Hamilton and Max Verstappen's rivalry continued to heat up on Sunday -- both on and off the track -- at an action-packed Saudi Arabian Grand Prix as the Mercedes driver won his third consecutive race to go level on points with the Dutchman in the driver…", "url": "https://www.cnn.com/2021/12/06/motorsport/lewis-hamilton-max-verstappen-crash-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206092428-hamilton-verstappen-super-tease.jpg", "publishedAt": "2021-12-06T09:28:07Z", "content": "(CNN)Lewis Hamilton and Max Verstappen's rivalry continued to heat up on Sunday -- both on and off the track -- at an action-packed Saudi Arabian Grand Prix as the Mercedes driver won his third conse… [+1475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "These dogs with jobs are the new calendar stars of 2022", "description": "Photographer Daniel Gebhart de Koekkoek plays up the secret lifestyles of canines in his new calendar \"Doggystyle.\"", "url": "https://www.cnn.com/style/article/daniel-gebhart-de-koekkoek-doggystyle-calendar-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211130113021-09b-daniel-gebhart-de-koekkoek-doggystyle-calendar-restricted-super-tease.jpg", "publishedAt": "2021-12-06T08:44:32Z", "content": "artsPublished 6th December 2021\r\nSam is an artist shiba inu from Berlin in a plaid button-down shirt who poses with his easel. Bertha is a microdosing king poodle chef who frequents the Berlin club B… [+3130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Larry Madowo and Bethlehem Feleke, CNN", "title": "South Africa battles Omicron variant, amid hesitancy and complacency", "description": "South Africans are now bracing for what they fear will be another hard lockdown, with many pandemic-weary businesses expressing little appetite for the crippling economic consequences of potential new restrictions.", "url": "https://www.cnn.com/2021/12/06/africa/south-africa-omicron-covid-surge-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205105305-03-south-africa-covid-surge-120321-super-tease.jpg", "publishedAt": "2021-12-06T07:46:22Z", "content": "(CNN)Johannesburg's Rivers Church, a trendy Christian community for the city's hip and spiritual, has suspended in-person services indefinitely due to a new surge in Covid-19 cases in South Africa. \"… [+5229 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Artemis Moshtaghian, CNN", "title": "Michigan school shooting suspect and his parents isolated in the same facility and under suicide watch, sheriff says", "description": "Following Tuesday's deadly school shooting in Oxford, Michigan, and subsequent manhunt and arrest of the suspected shooter's parents, authorities said the three are being housed at the same facility and monitored under suicide watch.", "url": "https://www.cnn.com/2021/12/06/us/michigan-oxford-high-school-shooting-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211204225055-crumbley-family-mugshots-split-super-tease.jpg", "publishedAt": "2021-12-06T07:17:42Z", "content": "(CNN)Following Tuesday's deadly school shooting in Oxford, Michigan, and subsequent manhunt and arrest of the suspected shooter's parents, authorities said the three are being housed at the same faci… [+7216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Nectar Gan and Steve George, CNN", "title": "China wants to return to 'zero-Covid.' But cases have been above zero for seven weeks", "description": "As the world grapples with the new Omicron coronavirus variant, China is determined as ever to eliminate Covid-19 within its borders -- but it hasn't been able to achieve that ambitious goal for the past seven weeks.", "url": "https://www.cnn.com/2021/12/06/china/china-covid-inner-mongolia-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211206004306-china-inner-mongolia-covid-test-file-120121-super-tease.jpg", "publishedAt": "2021-12-06T07:06:11Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+5073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Myanmar's Aung San Suu Kyi sentenced to four years in prison", "description": "A court in Myanmar has sentenced deposed civilian leader Aung San Suu Kyi to four years in prison, according to a military spokesperson, in the first verdict against the Nobel Peace Prize winner since the military seized power in February.", "url": "https://www.cnn.com/2021/12/06/asia/suu-kyi-verdict-sentence-myanmar-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201105164836-01-aung-san-suu-kyi-file-2019-super-tease.jpg", "publishedAt": "2021-12-06T06:02:14Z", "content": "(CNN)A court in Myanmar has sentenced deposed civilian leader Aung San Suu Kyi to four years in prison oncharges of incitement and breaking Covid-19 rules, in the first verdict against the Nobel Peac… [+515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Gregory Krieg, CNN", "title": "Dole's death prompts nostalgia for a bygone era sullied by Trump's GOP", "description": "The bipartisan outpouring of praise following the death on Sunday of Republican Bob Dole, the longtime Senate leader and former presidential nominee, mourned both a man and a more outwardly collegial era as Republicans drive the country toward another debt ce…", "url": "https://www.cnn.com/2021/12/06/politics/bob-dole-republicans-trump-debt-ceiling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205121750-02-bob-dole-lead-image-restricted-super-tease.jpg", "publishedAt": "2021-12-06T05:01:15Z", "content": "(CNN)The bipartisan outpouring of praise following the death on Sunday of Republican Bob Dole, the longtime Senate leader and former presidential nominee, mourned both a man and a more outwardly coll… [+10116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Asia-Pacific wants to live with Covid. Omicron is threatening those reopening plans", "description": "Little is known about the potential dangers posed by the Omicron coronavirus variant but concern over its spread is already threatening to wreck reopening plans in Asia-Pacific.", "url": "https://www.cnn.com/2021/12/05/asia/asia-pacific-omicron-variant-reopening-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205190903-asia-pacific-omicron-variant-reopening-super-tease.jpg", "publishedAt": "2021-12-06T04:11:53Z", "content": "Hong Kong (CNN)Little is known about the potential dangers posed by the Omicron coronavirus variant but concern over its spread is already threatening to wreck reopening plans in Asia-Pacific. \r\nAfte… [+8475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Mix-and-match J&J Covid booster raised immune response after Pfizer vaccine, study finds", "description": "Using the Johnson & Johnson vaccine as a booster for people initially immunized with the Pfizer/BioNTech vaccine produces a strong immune response and may do more to elicit protection against severe disease, researchers reported Sunday.", "url": "https://www.cnn.com/2021/12/05/health/covid-vaccine-johnson-pfizer-booster-mix/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111052048-johnson--johnson-janssen-covid-19-vaccine-california-032521-file-super-tease.jpg", "publishedAt": "2021-12-06T03:16:55Z", "content": "(CNN)Using the Johnson &amp; Johnson vaccine as a booster for people initially immunized with the Pfizer/BioNTech vaccine produces a strong immune response and may do more to elicit protection agains… [+2171 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Artemis Moshtaghian, CNN", "title": "Virginia to begin removal process of Robert E. Lee statue pedestal in Richmond, governor says", "description": "The state is expected to begin the process of removing the pedestal on Monday, according to a statement from Gov. Ralph Northam.", "url": "https://www.cnn.com/2021/12/05/us/virginia-robert-e-lee-statue-pedestal-removal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929131841-lee-statue-removal-super-tease.jpg", "publishedAt": "2021-12-06T03:08:15Z", "content": "(CNN)The final piece of the Robert E. Lee statue in Richmond, Virginia, will be removed starting this week, Gov. Ralph Northam announced Sunday.\r\nThe state reached a deal with the city to remove the … [+1210 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN", "title": "The African Wildlife Foundation is using photography to inspire the next generation of conservationists", "description": "For the past 60 years, the African Wildlife Foundation (AWF) has protected animals, restored lost habitats and advocated for policy changes that benefit wildlife. Now, the conservation organization is trying a new approach.", "url": "https://www.cnn.com/style/article/awf-africa-photography-conservation-hnk-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201164917-11a-wildlife-conservation-awf-super-tease.jpg", "publishedAt": "2021-12-06T02:18:48Z", "content": "artsPublished 6th December 2021\r\nFor the past 60 years, the African Wildlife Foundation (AWF) has protected animals, restored lost habitats and advocated for policy changes that benefit wildlife. Now… [+4332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "7 popular Western desserts Japanese chefs have made their own", "description": "Many classic cakes and other desserts that are popular in the West made their way to Japan centuries ago and have since been adapted, perfected and popularized.", "url": "https://www.cnn.com/travel/article/japan-best-cakes-desserts-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211130151452-03-japan-best-cakes-super-tease.jpg", "publishedAt": "2021-12-06T02:08:02Z", "content": "(CNN) Japan has long been famous internationally for its diverse and delicious eats, from sushi to ramen, with such staples appearing on menus around the world. \r\nBut in recent years word has also sp… [+8530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden administration expected to announce diplomatic boycott of Beijing Olympics this week", "description": "The Biden administration is expected to announce this week that no US government officials will attend the 2022 Beijing Olympics, implementing a diplomatic boycott of the games, according to several sources.", "url": "https://www.cnn.com/2021/12/05/politics/biden-beijing-olympics-boycott/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205193026-beijing-olympics-2022-biden-administration-boycott-super-tease.jpg", "publishedAt": "2021-12-06T01:32:37Z", "content": "(CNN)The Biden administration is expected to announce this week that no US government officials will attend the 2022 Beijing Olympics, implementing a diplomatic boycott of the games, according to sev… [+711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dean Obeidallah", "title": "What Rep. Massie's Christmas photo says about today's GOP", "description": "Republican Rep. Thomas Massie of Kentucky released a holiday portrait on Twitter on Saturday that features him and six family members in front of a Christmas tree. But instead of posing with wrapped presents or perhaps a family pet, each person is gleefully h…", "url": "https://www.cnn.com/2021/12/05/opinions/thomas-massie-christmas-guns-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205165325-01-thomas-massie-christmas-guns-obeidallah-super-tease.jpg", "publishedAt": "2021-12-06T00:56:45Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "US military's hacking unit publicly acknowledges taking offensive action to disrupt ransomware operations", "description": "Cyber Command, the US military's hacking unit, has taken offensive action to disrupt cybercriminal groups that have launched ransomware attacks on US companies, a spokesperson for the command confirmed to CNN Sunday.", "url": "https://www.cnn.com/2021/12/05/politics/us-cyber-command-disrupt-ransomware-operations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205181626-us-cyber-command-disrupt-ransomware-operations-super-tease.jpg", "publishedAt": "2021-12-06T00:54:06Z", "content": "(CNN)Cyber Command, the US military's hacking unit, has taken offensive action to disrupt cybercriminal groups that have launched ransomware attacks on US companies, a spokesperson for the command co… [+2413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Biden teases 'SNL' creator ahead of Kennedy Center Honors", "description": "Ahead of the 44th annual Kennedy Center Honors, President Joe Biden hosted a reception for this year's recipients at the White House. Among them are \"Saturday Night Live\" creator Lorne Michaels, who Biden teased for the parade of actors recruited to play him …", "url": "https://www.cnn.com/videos/media/2021/12/06/biden-lorne-michaels-steve-martin-kennedy-center-honors-nr-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205194340-biden-kennedy-center-honors-white-house-reception-1205-super-tease.jpg", "publishedAt": "2021-12-06T00:52:28Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "Gambling 'America's Amazon' - CNN", "description": "Alabama’s largest utility plans to bury a heap of toxic coal waste in one of North America’s most biodiverse river systems. Experts say it will put one of the nation’s most pristine wetlands at risk.", "url": "https://www.cnn.com/interactive/2021/12/us/coal-ash-ponds-plant-barry/", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211205163132-00-coal-ash-ponds-super-tease.jpg", "publishedAt": "2021-12-06T00:51:56Z", "content": "A predawn phone call woke Ron Bledsoe with a jolt. It was his supervisor telling him to come in.\r\nBledsoe dressed and drove an hour to the power plant, near Kingston, Tennessee, where he worked. He a… [+35795 chars]"}]}