{"status": "ok", "totalResults": 155, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "CNN Underscored, As Seen On 'New Day'", "description": "Products, reviews and recommendations from CNN Underscored as seen on CNN's 'New Day'.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/new-day/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200615112101-cnn-underscored-logo-super-169.png", "publishedAt": "2021-08-03T21:09:29Z", "content": "CNN Underscored is your guide to the everyday products and services that help you live a smarter, simpler and more fulfilling life. The content is created by CNN Underscored. CNN News staff is not in… [+52 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "White House mourns recent suicides among officers who responded to Capitol insurrection: 'A sad reminder' of January 6 attack", "description": "White House press secretary Jen Psaki on Tuesday mourned two recent suicides of police officers who had responded to the US Capitol insurrection, calling their deaths \"a sad reminder of that shameful day in our country's history.\"", "url": "https://www.cnn.com/2021/08/03/politics/white-house-response-insurrection-officer-suicides/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803101818-us-capitol-0802-super-tease.jpg", "publishedAt": "2021-08-03T20:37:51Z", "content": "(CNN)White House press secretary Jen Psaki on Tuesday mourned two recent suicides of police officers who had responded to the US Capitol insurrection, calling their deaths \"a sad reminder of that sha… [+2440 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins and Kevin Liptak, CNN", "title": "Biden administration to announce new efforts to limit evictions", "description": "The Biden administration is expected to announce new efforts aimed at limiting evictions, according to an administration official, though details of the effort -- and what effect it would have -- are still unclear.", "url": "https://www.cnn.com/2021/08/03/politics/eviction-moratorium-high-covid-spread/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802152947-eviction-moratorium-protest-0730-super-tease.jpg", "publishedAt": "2021-08-03T20:10:30Z", "content": "(CNN)The Biden administration is expected to announce new efforts aimed at limiting evictions, according to an administration official, though details of the effort -- and what effect it would have -… [+1363 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Melanie Zanona, CNN", "title": "'Ignore us at your peril': Democrats fear losing House as party leaders push to sharpen message", "description": "House Democrats in some of the most competitive districts are growing increasingly anxious about their ability to hold on to their seats, with party leaders warning that they could sustain deep losses if they don't sharpen their message and retool their strat…", "url": "https://www.cnn.com/2021/08/03/politics/house-democratic-fears-midterms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180910144139-01-sean-patrick-maloney-super-tease.jpg", "publishedAt": "2021-08-03T19:40:35Z", "content": "(CNN)House Democrats in some of the most competitive districts are growing increasingly anxious about their ability to hold on to their seats, with party leaders warning that they could sustain deep … [+7180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon", "title": "The town where thousands of US-bound migrants came to a standstill", "description": "They travelled by the thousands to arrive here from Haiti, Venezuela, Chile, Brazil, and even further, from Ghana, Mali and Togo. Now they're stuck.", "url": "https://www.cnn.com/2021/08/03/americas/necocli-migrant-colombia-immigration-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803152431-03-necocli-colombia-migrants-super-tease.jpg", "publishedAt": "2021-08-03T19:31:10Z", "content": "Necocli, Colombia (CNN)They travelled by the thousands to arrive here from Haiti, Venezuela, Chile, Brazil, and even further, from Ghana, Mali and Togo. Now they're stuck. \r\nMigrants start lining up … [+6365 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Holmes", "title": "The best SAD light therapy lamps of 2021", "description": "We tested the top-rated SAD light therapy lamps on the market from brands like Verilux, Circadian and more to find the best options out there.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/best-sad-light-therapy-lamps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115131105-best-sad-lamp-lead-new-super-169.jpg", "publishedAt": "2021-08-03T19:23:33Z", "content": "Whether winter makes you want to sleep all day or youve been diagnosed with seasonal affective disorder (SAD), you may have considered purchasing a light therapy lamp or, as its often called, a SAD l… [+23433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sarah Molano, CNN", "title": "A colorful, chaotic, 'mind bending' experience is coming to Denver", "description": "Arts and entertainment collective Meow Wolf will open its immersive art installation in its new Denver location on September 17.", "url": "https://www.cnn.com/travel/article/meow-wolf-denver-art-installation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803100552-02-meow-wolf-denver-art-installation---restricted-super-tease.jpg", "publishedAt": "2021-08-03T19:20:30Z", "content": "(CNN) Imagine this: Four worlds collide following a cosmic event 25 years ago. All inhabitants lose their memories, leading to the disappearances of four women. \r\nWhat sounds like the premise of a sc… [+5523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "How Trump reeled in over $100 million, televangelist style", "description": "Some televangelists have played the promise-the-moon game for decades, roiling the faithful and creating enemies whom they can only vanquish if they have the private aircraft, luxury cars and mansions to do so. But the man of the moment in the evangelize-for-…", "url": "https://www.cnn.com/2021/08/03/opinions/trump-100-million-dollars-televangelist-style-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210206141752-trump-for-zelizer-oped-super-tease.jpg", "publishedAt": "2021-08-03T19:16:26Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy, CNN", "title": "White House press secretary says Biden set to speak about sexual harassment allegations against New York Gov. Andrew Cuomo", "description": "White House press secretary Jen Psaki said President Joe Biden will address the findings of an investigation into New York Gov. Andrew Cuomo Tuesday afternoon, calling the sexual harassment allegations against the Democrat \"abhorrent.\"", "url": "https://www.cnn.com/2021/08/03/politics/joe-biden-andrew-cuomo-reaction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803143109-joe-biden-andrew-cuomo-split-super-tease.jpg", "publishedAt": "2021-08-03T19:16:08Z", "content": "(CNN)White House press secretary Jen Psaki said President Joe Biden will address the findings of an investigation into New York Gov. Andrew Cuomo Tuesday afternoon, calling the sexual harassment alle… [+1719 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "35 words that almost certainly will end Andrew Cuomo's political career", "description": "\"We, the investigators appointed to conduct an investigation into allegations of sexual harassment by Governor Andrew M. Cuomo, conclude that the Governor engaged in conduct constituting sexual harassment under federal and New York State law.\"", "url": "https://www.cnn.com/2021/08/03/politics/andrew-cuomo-sexual-harassment-governor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200518171422-andrew-cuomo-may-6-2020-01-super-tease.jpg", "publishedAt": "2021-08-03T19:08:47Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact check: Can Biden extend the eviction moratorium without Congress?", "description": "The recent expiration of the federal eviction moratorium for renters has led to internal strife inside the Democratic Party, as progressive lawmakers argue President Joe Biden should do more to extend the moratorium, despite his demands for congressional acti…", "url": "https://www.cnn.com/2021/08/03/politics/biden-eviction-moratorium-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731190615-eviction-moratorium-protest-0503-super-tease.jpg", "publishedAt": "2021-08-03T18:59:04Z", "content": "Washington (CNN)The recent expiration of the federal eviction moratorium for renters has led to internal strife inside the Democratic Party, as progressive lawmakers argue President Joe Biden should … [+3077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "At least 30 bodies float down river between Ethiopia's Tigray and Sudan", "description": "At least 30 corpses have washed up on the Sudanese banks of a river that abuts Ethiopia's northern region of Tigray, according to two Ethiopian refugees and four Sudanese witnesses who told Reuters on Monday they had retrieved the bodies.", "url": "https://www.cnn.com/2021/08/03/africa/ethiopia-tigray-sudan-bodies-intl-afr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803143608-wad-alhilew-village-map-tease-only-super-tease.jpg", "publishedAt": "2021-08-03T18:51:36Z", "content": "(CNN)At least 30 corpses have washed up on the Sudanese banks of a river that abuts Ethiopia's northern region of Tigray, according to two Ethiopian refugees and four Sudanese witnesses who told Reut… [+2978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Many companies aren't mandating vaccines for their most exposed workers", "description": "Meat producer Tyson Foods' announcement Tuesday that it will require all its workers to be fully vaccinated against Covid-19 by November 1 is hardly the norm when it comes to vaccine rules for frontline employees.", "url": "https://www.cnn.com/2021/08/03/business/tyson-walmart-disney-vaccine-mandate-workers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803132519-tyson-us-meat-plant-0501-super-tease.jpg", "publishedAt": "2021-08-03T18:33:12Z", "content": "New York (CNN Business)Meat producer Tyson Foods' announcement Tuesday that it will require all its workers to be fully vaccinated against Covid-19 by November 1 is hardly the norm when it comes to v… [+5892 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly", "title": "White House moves to highlight key piece of bipartisan deal as some allies question whether it goes far enough", "description": "The White House, fresh off securing a $1.2 trillion bipartisan infrastructure deal, plans to move in the coming days to highlight one of the thorniest pieces of that negotiation, according to a White House official: the $39 billion in new transit funding.", "url": "https://www.cnn.com/2021/08/03/politics/white-house-highlights-transit-funding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210721150318-01-biden-0714-super-169.jpg", "publishedAt": "2021-08-03T18:06:11Z", "content": "The White House, fresh off securing a $1.2 trillion bipartisan infrastructure deal, plans to move in the coming days to highlight one of the thorniest pieces of that negotiation, according to a White… [+5510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister and Nick Paton Walsh, CNN", "title": "Powerful blast rocks Kabul after Afghan army urges civilians to leave Taliban-controlled areas of major city", "description": "A car bomb exploded near the home of Afghanistan's acting defense minister in Kabul on Tuesday evening, just hours after the Afghan army urged residents in another city to evacuate ahead of an operation against the Taliban.", "url": "https://www.cnn.com/2021/08/03/middleeast/taliban-afghanistan-us-airstrikes-helmand-herat-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803142644-afghanistan-security-personel-militia-taliban-herat-super-tease.jpg", "publishedAt": "2021-08-03T18:03:00Z", "content": "(CNN)A car bomb exploded near the home of Afghanistan's acting defense minister in Kabul on Tuesday evening, just hours after the Afghan army urged residents in another city to evacuate ahead of an o… [+6211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Schumer and Gillibrand call for Cuomo's resignation", "description": "Gov. Andrew Cuomo on Tuesday faced mounting pressure from Democrats, including New York's two US senators, to resign in the wake of a report that found he sexually harassed multiple women.", "url": "https://www.cnn.com/2021/08/03/politics/andrew-cuomo-democrats-reaction-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803112101-gov-andrew-cuomo-file-0505-super-tease.jpg", "publishedAt": "2021-08-03T17:59:51Z", "content": "Washington (CNN)Gov. Andrew Cuomo on Tuesday faced mounting pressure from Democrats, including New York's two US senators, to resign in the wake of a report that found he sexually harassed multiple w… [+4099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Activewear favorite Girlfriend Collective just launched a men's collection", "description": "Sustainable brand Girlfriend Collective, known for bright, comfy activewear as well as a focus on the end use of its clothing, has just launched its first collection for men on August 3 — and it's just as cool and sporty as its collection for the ladies.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/girlfriend-collective-mens-activewear-collection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803083915-girlfriend-collective-mens-collection-lead-super-169.jpg", "publishedAt": "2021-08-03T17:00:32Z", "content": "Sustainable brand Girlfriend Collective, known for bright, comfy activewear as well as a focus on the end use of its clothing, has just launched its first collection for men on August 3 and its just … [+1141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peniel Joseph", "title": "Barack Obama at 60: Why he matters", "description": "Barack Obama's enduring power is his ability to allow us to imagine ourselves as a better country, society and people. As a young state senator, presidential candidate, and commander in chief, Obama called America to be its aspirational best, Peniel E. Joseph…", "url": "https://www.cnn.com/2021/08/03/opinions/barack-obama-60th-birthday-peniel-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803113006-obama-in-munich-super-tease.jpg", "publishedAt": "2021-08-03T16:43:14Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+12120 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Gregory Wallace and Pete Muntean, CNN", "title": "Spirit Airlines enters third consecutive day with significant disruptions", "description": "Spirit Airlines is entering a third consecutive day with significant disruptions to its flight schedule.  The low-cost carrier had canceled or delayed 40% of its schedule as of Tuesday morning, according to the aviation tracking website FlightAware.", "url": "https://www.cnn.com/travel/article/spirit-airlines-disruption/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803110710-01-spirit-airlines-0528-restricted-super-tease.jpg", "publishedAt": "2021-08-03T16:36:37Z", "content": "Top image: Travelers check in for a Spirit Airlines flight at Orlando International Airport on the Friday before Memorial Day. (Photo by Paul Hennessy/SOPA Images/LightRocket via Getty Images)CNN's C… [+39 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "LGBTQ advocates sue Tennessee over new anti-transgender bathroom law", "description": "LGBTQ advocates filed a lawsuit Monday seeking to block enforcement of a new Tennessee law they say will prevent transgender people in the state from using bathrooms and other facilities consistent with their gender identity.", "url": "https://www.cnn.com/2021/08/03/politics/tennessee-transgender-bathroom-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180316092501-tennessee-state-capitol-file-super-tease.jpg", "publishedAt": "2021-08-03T16:23:40Z", "content": "Washington (CNN)LGBTQ advocates filed a lawsuit Monday seeking to block enforcement of a new Tennessee law they say will prevent transgender people in the state from using bathrooms and other facilit… [+4289 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Harris to promote 'America is back' message in Singapore and Vietnam", "description": "Vice President Kamala Harris is set to travel to Singapore and Vietnam later this month, becoming the highest-ranking Biden administration official to visit Asia so far.", "url": "https://www.cnn.com/2021/08/03/politics/vice-president-kamala-harris-singapore-vietnam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622171844-01-kamala-harris-0615-super-tease.jpg", "publishedAt": "2021-08-03T16:22:45Z", "content": "(CNN)Vice President Kamala Harris is set to travel to Singapore and Vietnam later this month, becoming the highest-ranking Biden administration official to visit Asia so far. \r\n\"Her trip will build o… [+1921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jake Kwon and Serentie Wang", "title": "Badminton Korea Association to file complaint about Chinese player's cursing at Tokyo 2020", "description": "South Korea's Badminton Korea Association plans to pursue a formal complaint with the World Badminton Federation (WBF) regarding China's Chen Qingchen's cursing during an Olympic match at Tokyo 2020, the organization has told CNN.", "url": "https://www.cnn.com/2021/08/03/sport/south-korea-china-tokyo-2020-badminton-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803112005-01-tokyo-badminton-chen-qingchen-0724-super-169.jpg", "publishedAt": "2021-08-03T16:09:36Z", "content": "South Koreas Badminton Korea Association plans to pursue a formal complaint with the World Badminton Federation (WBF) regarding Chinas Chen Qingchens cursing during an Olympic match at Tokyo 2020, th… [+2048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Wilson and Ali Zaslav, CNN", "title": "Senate unanimously votes to award Congressional Gold Medal to Capitol police and MPD", "description": "The Senate has unanimously awarded the Congressional Gold Medal to the officers of the US Capitol Police and the Washington, DC, Metropolitan Police Department, nearly seven months after the insurrection at the Capitol.", "url": "https://www.cnn.com/2021/08/03/politics/congressional-gold-medal-senate-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-08-03T16:08:31Z", "content": "(CNN)The Senate has unanimously awarded the Congressional Gold Medal to the officers of the US Capitol Police and the Washington, DC, Metropolitan Police Department, nearly seven months after the ins… [+2360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Blake Lively and Ryan Reynolds recreate their first date for 10-year anniversary", "description": "If there was an award for the cutest anniversary idea, Blake Lively and Ryan Reynolds would win.", "url": "https://www.cnn.com/2021/08/03/entertainment/blake-lively-ryan-reynolds-date-10-year-anniversary-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201126163636-ryan-reynolds-blake-lively-file-2018-super-tease.jpg", "publishedAt": "2021-08-03T16:05:21Z", "content": "(CNN)If there was an award for the cutest anniversary idea, Blake Lively and Ryan Reynolds would win.\r\nThe actors went back to the spot where they had their very first date over the weekend, O Ya, a … [+519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church", "title": "'I'm just here to represent,' says US athlete Gwen Berry after raising her fist at Tokyo 2020", "description": "US hammer thrower Gwen Berry says she is \"ready to change some stuff for real\" after raising her fist before the women's hammer throw final at Tokyo 2020 on Tuesday.", "url": "https://www.cnn.com/2021/08/03/sport/gwen-berry-fist-social-justice-tokyo-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803153843-01-gwen-berry-0803-super-169.jpg", "publishedAt": "2021-08-03T15:52:45Z", "content": "US hammer thrower Gwen Berry says she is ready to change some stuff for real after raising her fist before the womens hammer throw final at Tokyo 2020 on Tuesday. \r\nAs she was introduced into the sta… [+4613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Radina Gigova, CNN", "title": "Archaeological 'treasures,' including 2,400-year-old fruit, discovered at ancient Egyptian city", "description": "Archaeological \"treasures,\" including Greek ceramics and 2,400-year-old wicker baskets filled with fruit, have been discovered at the site of the ancient sunken city of Thonis-Heracleion, off Egypt's coast.", "url": "https://www.cnn.com/travel/article/thonis-heracleion-egypt-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802204334-01-ancient-egypt-artifacts-super-tease.jpg", "publishedAt": "2021-08-03T15:25:36Z", "content": "(CNN) Archaeological \"treasures,\" including Greek ceramics and 2,400-year-old wicker baskets filled with fruit, have been discovered at the site of the ancient sunken city of Thonis-Heracleion, off E… [+3638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Mike Hayes and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "New York attorney general finds Gov. Cuomo sexually harassed multiple women", "description": "The New York attorney general's investigation into sexual harassment allegations against Democratic Gov. Andrew Cuomo found that Cuomo sexually harassed multiple women, Attorney General Letitia James announced Tuesday. Follow here for the latest.", "url": "https://www.cnn.com/politics/live-news/new-york-andrew-cuomo-investigation-08-03-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803095301-01-gov-andrew-cuomo-0802-super-tease.jpg", "publishedAt": "2021-08-03T15:22:06Z", "content": "In March, Alyssa McGrath, a current aide to New York Gov. Andrew Cuomo, joined a chorus of other women in accusing the governor of sexual harassment, accusing the Democrat of having behaved and spoke… [+1629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr and Ellie Kaufman", "title": "Pentagon is currently on lockdown following reports of shooting on bus platform outside", "description": "The Pentagon is locked down with no personnel allowed outside due to a \"shooting event\" that happened outside the building on a bus platform, according a message that was sent to the Pentagon workforce by the Pentagon Force Protection Agency.", "url": "https://www.cnn.com/2021/08/03/politics/pentagon-shooting-lockdown/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213150327-pentagon-building-aerial-file-super-169.jpg", "publishedAt": "2021-08-03T15:05:58Z", "content": "The Pentagon is locked down with no personnel allowed outside due to a shooting event that happened outside the building on a bus platform, according a message that was sent to the Pentagon workforce… [+720 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Benjamin Levin", "title": "The best portable chargers of 2021", "description": "We spent several weeks testing portable chargers — draining devices, charging them up and calculating capacities. Ultimately, we found three winners that each stole the show in their own way.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/best-portable-chargers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200521162305-1-underscored-best-portable-chargers-lead-super-169.jpg", "publishedAt": "2021-08-03T15:05:26Z", "content": "Even when working from home, a power supply can be hard to come by, what with your computer, monitor, WiFi hub and other gadgets and gizmos and their wall chargers hogging those sparse outlets. And w… [+11912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jade Wu", "title": "I'm wearing a mask. Stop trying to shame me", "description": "For wearing a mask against Covid-19 in public, writes Jade Wu, \"I have been called overreactive, too covered up and way too scared,\" by friends, family, even strangers. But it's her right AND her responsiblity to stay safe and avoid potentially carrying virus…", "url": "https://www.cnn.com/2021/08/03/opinions/im-wearing-a-mask-leave-me-alone-wu/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630175713-child-parent-mask-stock-super-169.jpg", "publishedAt": "2021-08-03T15:01:53Z", "content": "Youre paranoid! A relative shouted at me over the phone when I told her three months ago that I wear a mask in public even though Im vaccinated.\r\nYou dont need to wear that anymore, a friend stated c… [+4957 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Police union goes to bat for Chicago officer charged in US Capitol riot", "description": "The Chicago chapter of the Fraternal Order of Police union is going to bat for one of its members who stormed the US Capitol and now might lose his job with the Chicago Police Department.", "url": "https://www.cnn.com/2021/08/03/politics/police-union-chicago-insurrection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620155209-210620-paths-to-insurrection-card-super-tease.jpg", "publishedAt": "2021-08-03T15:00:17Z", "content": "Washington (CNN)The Chicago chapter of the Fraternal Order of Police union is going to bat for one of its members who stormed the US Capitol and now might lose his job with the Chicago Police Departm… [+2371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Your guide to the best deals in Apple's Amazon store", "description": "Yes, Apple has a shop on Amazon. And that means you can get official Apple products with free Prime shipping, and even better, it's almost the whole product line — from iPhones to silicone cases and Apple Watches to accessories, all the way to the Mac and alm…", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/amazon-apple-sale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201020224701-9-underscored-ipad-air-fourth-generation-review-super-169.jpg", "publishedAt": "2021-08-03T15:00:08Z", "content": "Yes, Apple has a shop on Amazon. And that means you can get official Apple products with free Prime shipping, and even better, its almost the whole product line from iPhones to silicone cases and App… [+7783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands and Alex Marquardt, CNN", "title": "Systemic cybersecurity failures persist across federal agencies, Senate report finds", "description": "Key agencies across the federal government continue to fail meet basic cybersecurity standards, according to a new Senate report released Tuesday, which found systematic failures to safeguard data.", "url": "https://www.cnn.com/2021/08/03/politics/cybersecurity-failures-federal-agencies-senate-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210712160202-ransomware-cyberattack---stock-super-tease.jpg", "publishedAt": "2021-08-03T14:47:27Z", "content": "Washington (CNN)Key agencies across the federal government continue to fail meet basic cybersecurity standards, according to a new Senate report released Tuesday, which found systematic failures to s… [+3812 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "The Activision Blizzard lawsuit could be a watershed moment for the business world. Here's why", "description": "Even if you're not an avid gamer, there's a good chance you've heard of \"Call of Duty,\" \"World of Warcraft\" or \"Candy Crush.\" Those games, which are played by hundreds of millions of people around the world and have in some cases attained the status of cultur…", "url": "https://www.cnn.com/2021/08/03/tech/activision-blizzard-employee-backlash-kotick/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729140321-03-activision-blizzard-employees-walkout-0728-restricted-super-tease.jpg", "publishedAt": "2021-08-03T14:45:50Z", "content": "(CNN Business)Even if you're not an avid gamer, there's a good chance you've heard of \"Call of Duty,\" \"World of Warcraft\" or \"Candy Crush.\" Those games, which are played by hundreds of millions of pe… [+9361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "A Sarah Palin Senate bid is Lisa Murkowski's dream scenario", "description": "The news lit up the internet: Sarah Palin -- yes, that Sarah Palin -- opened the door to run for the Senate in 2022.", "url": "https://www.cnn.com/2021/08/03/politics/sarah-palin-senate-lisa-murkowski/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200811120624-01-sarah-palin-file-2008-super-tease.jpg", "publishedAt": "2021-08-03T14:39:44Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop today: Wayfair, Instant Pot, Overstock and more", "description": "Today, you'll find a deal on rechargeable batteries and a charger, a discounted Instant Pot and savings on bedding, mattresses and bath at Allswell. All that and more below.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803100834-0803dealslead-super-169.jpg", "publishedAt": "2021-08-03T14:38:49Z", "content": "Today, youll find a deal on rechargeable batteries and a charger, a discounted Instant Pot and savings on bedding, mattresses and bath at Allswell. All that and more below.\r\nWayfairs Save Big, Give B… [+9805 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "The Activision Blizzard lawsuit could be a watershed moment for the business world. Here's why", "description": "Even if you're not an avid gamer, there's a good chance you've heard of \"Call of Duty,\" \"World of Warcraft\" or \"Candy Crush.\" Those games, which are played by hundreds of millions of people around the world and have in some cases attained the status of cultur…", "url": "https://www.cnn.com/2021/08/03/tech/activision-blizzard-employee-backlash-kotick/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729140321-03-activision-blizzard-employees-walkout-0728-restricted-super-tease.jpg", "publishedAt": "2021-08-03T14:35:55Z", "content": "(CNN Business)Even if you're not an avid gamer, there's a good chance you've heard of \"Call of Duty,\" \"World of Warcraft\" or \"Candy Crush.\" Those games, which are played by hundreds of millions of pe… [+9361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Amy Bass", "title": "Simone Biles' Olympics took everyone by surprise", "description": "Two medals, epic cheerleading on behalf of her teammates, and a whole lot of light shed on the mental health of athletes -- for Simone Biles it has been an Olympics no one expected, writes Amy Bass. With her seventh career Olympic medal around her neck, the g…", "url": "https://www.cnn.com/2021/08/03/opinions/simone-biles-surprising-olympics-bass/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803061851-15-biles-unf-2020-olympics-super-tease.jpg", "publishedAt": "2021-08-03T14:20:59Z", "content": "Amy Bass (@bassab1) is a professor of sport studies at Manhattanville College and the author of \"One Goal: A Coach, a Team, and the Game That Brought a Divided Town Together\" and \"Not the Triumph but… [+5262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "Ilia's newest mascara is thick, luxurious falsies in a tube", "description": "Instagram-famous beauty brand Ilia just took its makeup line to a whole new level with the release of its latest product, the Fullest Volumizing Mascara. This latest lash product is bringing the drama in all the best ways.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/ilia-beauty-fullest-volumizing-mascara/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802113445-ilialead-super-169.jpg", "publishedAt": "2021-08-03T14:01:20Z", "content": "Instagram-famous beauty brand Ilia just took its makeup line to a whole new level with the release of its latest product, the Fullest Volumizing Mascara. While the brands current mascara offering the… [+1916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "27 products our editors tried and loved in July", "description": "We're committed to highlighting the best products out there, so we've decided to curate roundups of our favorite products we try each month. What did we love in July, you ask? Keep reading to check out the products we're now obsessed with.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/underscored-editors-favorite-products-july/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802150310-july-wild-one-travel-carrier-super-169.jpg", "publishedAt": "2021-08-03T14:00:35Z", "content": "The Underscored team tests too many products to count each month. Some dont leave a lasting impression, but others make us want to purchase again and again. Were committed to highlighting the best pr… [+18775 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "White House celebrates US reaching 70% of US adults getting at least one Covid-19 vaccine shot", "description": "The US Centers for Disease Control and Prevention reported on Monday that 70% of US adults have received at least one Covid-19 vaccination shot, reaching President Joe Biden's July Fourth goal about one month late.", "url": "https://www.cnn.com/2021/08/03/politics/70-percent-american-adults-covid-shot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716132913-01-wh-briefing-psaki-0716-super-tease.jpg", "publishedAt": "2021-08-03T13:39:39Z", "content": "(CNN)The US Centers for Disease Control and Prevention reported on Monday that 70% of US adults have received at least one Covid-19 vaccination shot, reaching President Joe Biden's July Fourth goal a… [+1264 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "HBCUs are canceling students' debt, highlighting how integral they are to Black Americans' lives", "description": "Covid-19 ruined Brécha Byrd's inaugural season as a basketball player at Saint Augustine's University, a historically Black school in North Carolina.", "url": "https://www.cnn.com/2021/08/03/us/hbcu-student-debt-cleared/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802185804-04-hbcu-student-debt-cleared-split-super-tease.jpg", "publishedAt": "2021-08-03T13:34:01Z", "content": "By Amir Vera, CNN\r\nUpdated 9:34 AM ET, Tue August 3, 2021\r\n (CNN)Covid-19 ruined Brécha Byrd's inaugural season as a basketball player at Saint Augustine's University, a historically Black school in … [+11241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Joe Biden is having the worst week of his presidency so far", "description": "Joe Biden's presidential honeymoon has officially ended, with a series of problems -- led by the ongoing surge of the Delta variant of the coronavirus -- coalescing to make the last few days some of the worst ones he has spent as president.", "url": "https://www.cnn.com/2021/08/03/politics/joe-biden-eviction-president-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716101316-02-biden-0713-super-tease.jpg", "publishedAt": "2021-08-03T13:31:41Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Logan Garvey", "title": "19 school planners that will make you want to stay organized", "description": "This year in particular, it's essential to find a good quality planner to keep track of assignments and extracurriculars. We've compiled a list of the best planners with a variety of contents, varying from simple designs to ones focused on wellness.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/best-academic-planners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210723091206-best-academic-planner-lead-super-169.jpg", "publishedAt": "2021-08-03T13:28:16Z", "content": "Keeping organized and productive can be challenging, and its essential to find a good quality planner to keep track of assignments and extracurriculars. Weve compiled a list of top-rated planners wit… [+4612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "'America's Got Talent' contestant departs show due to cancer battle", "description": "\"America's Got Talent\" star Jane Marczewski has withdrawn from the competition due to health issues as she battles cancer.", "url": "https://www.cnn.com/2021/08/03/entertainment/jane-marczewski-nightbirde-americas-got-talent-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210609134029-agt-nightbirde-golden-buzzer-super-169.jpg", "publishedAt": "2021-08-03T13:27:25Z", "content": "Americas Got Talent star Jane Marczewski has withdrawn from the competition due to health issues as she battles cancer.\r\nThe 30-year-old Ohio native, who goes by the nickname Nightbirde, took to Inst… [+1223 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien", "title": "This controversial real-time crime alert app is now selling access to its safety agents", "description": "Next time you're walking alone at night or meeting up with a stranger for a first date, one startup, the real-time crime alert app Citizen, would like to listen in -- with the goal of protecting you.", "url": "https://www.cnn.com/2021/08/03/tech/citizen-app-protect-safety-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802162446-citizen-app-file-restricted-super-169.jpg", "publishedAt": "2021-08-03T13:00:03Z", "content": "Next time youre walking alone at night or meeting up with a stranger for a first date, one startup would like to listen in with the goal of protecting you.\r\nCitizen, an app best known and sometimes c… [+4969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden to provide update on vaccination efforts as highly contagious Delta variant spreads", "description": "President Joe Biden on Tuesday will provide an update on his administration's Covid-19 vaccination efforts as the highly contagious Delta variant rips across the country, a White House official tells CNN.", "url": "https://www.cnn.com/2021/08/03/politics/biden-covid-remarks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705205725-biden-fourth-of-july-2021-file-super-tease.jpg", "publishedAt": "2021-08-03T12:38:58Z", "content": "(CNN)President Joe Biden on Tuesday will provide an update on his administration's Covid-19 vaccination efforts as the highly contagious Delta variant rips across the country, a White House official … [+2967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ed Lavandera, Ashley Killough and Dakin Andone, CNN", "title": "This Texas city has a relatively high vaccination rate, but it's still fighting to get shots in arms amid rising cases", "description": "With the pace of inoculations slowing, Austin is scrambling to get more shots in arms, dedicating personnel at sites across the city -- vet clinics, churches, rec centers, construction sites, homeless shelters -- just to vaccinate 10, 15 or 20 people at a tim…", "url": "https://www.cnn.com/2021/08/03/health/austin-texas-vaccination-rate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730144220-02-austin-covid-0720-super-tease.jpg", "publishedAt": "2021-08-03T12:37:37Z", "content": "(CNN)When Camila Fortuna went with her mother last week to a mobile veterinary clinic in Austin, Texas, she thought they were just getting shots for the family's three chihuahuas, Cuca, Lilly and Tob… [+7066 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Mike Hayes, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the Covid-19 pandemic in the US", "description": "The Delta variant is wreaking havoc through much of the US, and an internal CDC document shows it spreads as easily as chickenpox. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-03-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-08-03T12:20:26Z", "content": "The ICU of Louisianas largest hospital is stretched to its limit with Covid-19 patients while others experiencing symptoms were waiting for a bed Monday, an official said.\r\nOur Lady of the Lake Regio… [+2989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "'We didn't want a McMansion': Inside Adam Levine and Behati Prinsloo's understated home", "description": "Tucked between the Santa Monica Mountains and the Pacific Ocean sits Adam Levine and Behati Prinsloo's own private slice of serenity.", "url": "https://www.cnn.com/style/article/adam-levine-behati-prinsloo-home-architectural-digest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803031705-embargo-05-arch-digest-adam-levine-super-tease.jpg", "publishedAt": "2021-08-03T12:13:01Z", "content": "Tucked between the Santa Monica Mountains and the Pacific Ocean sits Adam Levine and Behati Prinsloo's own private slice of serenity. \r\nAfter selling their previous home completely furnished, the Mar… [+2915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Yellin", "title": "Chase adds new transfer partner to its Ultimate Rewards credit cards", "description": "Chase Ultimate Rewards points earned on credit cards such as the Chase Sapphire Reserve, Chase Sapphire Preferred Card and the Ink Business Preferred Credit Card can now be transferred to Air Canada's Aeroplan frequent flyer program.", "url": "https://www.cnn.com/2021/08/03/cnn-underscored/chase-new-transfer-partner-air-canada-aeroplan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803000446-underscored-air-canada-plane-in-flight-against-blue-sky-super-169.jpg", "publishedAt": "2021-08-03T12:00:14Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value, but does not review all financial companies or all available financial offers. We may r… [+5914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "Highly contagious Delta variant has spiked Covid-19 deaths in Africa by 80% in one month, WHO says", "description": "Highly contagious Delta variant has spiked Covid-19 deaths in Africa by 80% in one month, WHO saysCoronavirus deaths in Africa rose rapidly over the past month, as fatalities surged by 80 percent within the last four weeks, the World Health Organization said.", "url": "https://www.cnn.com/2021/08/03/africa/delta-variant-covid-africa-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210121171914-10-covid-100-million-cases-south-africa-super-tease.jpg", "publishedAt": "2021-08-03T11:45:14Z", "content": "Abuja, Nigeria (CNN)Coronavirus deaths in Africa rose rapidly over the past month, as fatalities surged by 80 percent within the last four weeks, the World Health Organization has said. \r\nWHO's Vacci… [+4932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "PepsiCo is selling Tropicana as customers continue to ditch juice", "description": "PepsiCo is selling a controlling stake of its juice brands, which includes Tropicana and Naked, to a private equity firm in a multibillion dollar deal. The sale is part of the company's broader efforts to focus on faster-growing beverages as customers increas…", "url": "https://www.cnn.com/2021/08/03/business/pepsico-tropicana-naked-juice-sale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803065858-tropicana-file-2018-super-tease.jpg", "publishedAt": "2021-08-03T11:09:31Z", "content": "New York (CNN Business)PepsiCo is selling a controlling stake of its juice brands, which includes Tropicana and Naked, to a private equity firm in a multibillion dollar deal. The sale is part of the … [+1796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mohamad Bazzi", "title": "A year after massive explosion in Beirut, Lebanon's crisis deepens", "description": "Mohamad Bazzi writes that one year after the devastating Beirut explosion that killed more than 200 people and caused billions in damage, the country is worse off than it was before August 4, 2020.", "url": "https://www.cnn.com/2021/08/03/opinions/beirut-explosion-one-year-anniversary-bazzi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200812112713-15-beirut-explosion-culture-gemmayzeh-super-169.jpg", "publishedAt": "2021-08-03T11:09:30Z", "content": "Editors Note: Mohamad Bazzi (@BazziNYU) is a journalism professor and incoming director of the Hagop Kevorkian Center for Near Eastern Studies at New York University. He is a non-resident fellow at D… [+9392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Here's how schools should handle a Covid-19 outbreak, experts say", "description": null, "url": "https://www.cnn.com/2021/08/03/health/covid-19-schools-outbreak-response-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201113142013-children-covid-vls-super-tease.jpg", "publishedAt": "2021-08-03T11:07:52Z", "content": "(CNN)Getting children back in classrooms has been a top priority for the United States -- but if a coronavirus outbreak were to happen within a school, how should schools respond?\r\nDrew Charter Schoo… [+14402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Diksha Madhok", "title": "Tencent cracks down on screen time after Chinese state media says gaming is 'spiritual opium'", "description": "Tencent has announced new limits on the amount of time minors can spend playing the company's online games, even as investors worry that China may extend its historic crackdown on the private sector to the gaming industry.", "url": "https://www.cnn.com/2021/08/03/investing/tencent-gaming-crackdown-hnk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803005957-tencent-honor-of-kings-0709-restricted-super-169.jpg", "publishedAt": "2021-08-03T10:24:09Z", "content": "Tencent has announced new limits on the amount of time minors can spend playing the companys online games, even as investors worry that China may extend its historic crackdown on the private sector t… [+2939 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur", "title": "5 things to know for August 3: Covid-19, housing, voting rights, Belarus, immigration", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/08/03/us/five-things-august-3-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802180420-our-lady-of-the-lake-regional-medical-center-0802-super-169.jpeg", "publishedAt": "2021-08-03T10:20:14Z", "content": "Get '5 Things' in your inbox\r\nThose of us on the Gulf and East coasts are in for a rainy week. \r\nHeres what you need to know to Get Up to Speed and On with Your Day. \r\n(You can also get 5 Things You … [+5657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Bergen", "title": "The woman who was the first to warn about Osama bin Laden", "description": "Peter Bergen chronicles the career of Gina Bennett, a US intelligence analyst who was the first to alert the US government to the danger presented by the al Qaeda leader", "url": "https://www.cnn.com/2021/08/03/opinions/first-to-warn-about-bin-laden-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802114441-01-gina-bennett-file-super-169.jpg", "publishedAt": "2021-08-03T10:03:57Z", "content": "Editors Note: Peter Bergen is CNNs national security analyst, a vice president at New America and a professor of practice at Arizona State University. This is adapted from his new book, The Rise and … [+14481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Guan Chenchen wins balance beam gold at the Tokyo Olympics as Simone Biles claims bronze", "description": "China's Guan Chenchen won gold in the women's balance beam final at the Tokyo Olympics as Simone Biles claimed a bronze.", "url": "https://www.cnn.com/2021/08/03/sport/simone-biles-guan-chenchen-balance-beam-tokyo-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803105246-23-olympics-080321-guan-chenchen-super-tease.jpg", "publishedAt": "2021-08-03T09:51:33Z", "content": "Ariake Gymnastics Centre, Tokyo (CNN)China's Guan Chenchen won gold in the women's balance beam final at the Tokyo Olympics as Simone Biles claimed a bronze.\r\nBiles was competing in her first event i… [+955 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay", "title": "Karsten Warholm wins 'best race in Olympic history' as he breaks 400m hurdles world record", "description": "It started the way his races often do -- a slap of the chest, a pump of the fist, and a roar to the camera -- but ended like none have done before.", "url": "https://www.cnn.com/2021/08/03/sport/karsten-warholm-tokyo-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803150810-01-karsten-warholm-super-169.jpg", "publishedAt": "2021-08-03T08:15:24Z", "content": "The Olympic Stadium, TokyoCNN\r\n —  \r\nIt started the way his races often do a slap of the chest, a pump of the fist, and a roar to the camera but ended like none have done before.\r\nAs Karsten Warholm … [+4957 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Karsten Warholm wins 'best race in Olympic history' as he breaks 400m hurdles world record", "description": "It started the way his races often do -- a slap of the chest, a pump of the fist, and a roar to the camera -- but ended like none have done before.", "url": "https://www.cnn.com/2021/08/03/sport/karsten-warholm-tokyo-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803150810-01-karsten-warholm-super-tease.jpg", "publishedAt": "2021-08-03T08:15:24Z", "content": "The Olympic Stadium, Tokyo (CNN)It started the way his races often do -- a slap of the chest, a pump of the fist, and a roar to the camera -- but ended like none have done before.\r\nAs Karsten Warholm… [+5042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elissa Strauss", "title": "What parents need to know about guiding kids through puberty", "description": "This long journey of adolescence becomes more manageable for all parties when we see it as slow and unique to each person. This helps parents and caregivers know when to worry and when to relax, when to explain and when to stay quiet, and when to hold tight a…", "url": "https://www.cnn.com/2021/08/03/health/parents-help-puberty-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731095504-stock-mother-teenage-daughter-talking-super-tease.jpg", "publishedAt": "2021-08-03T07:56:42Z", "content": "Welcome to our CNN Wellness five-part series on adolescence -- a tough time under any circumstances. As our children head back to school this fall, learn more about helping your tweens and teens unde… [+8200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Michigan's Lake Huron sinkhole is a window into how Earth's earliest forms of life diversified", "description": "Earth hasn't always experienced the 24-hour day we're so familiar with now. In fact, the way the world turns not only determines the length of our day, but it could have contributed to an influx of oxygen on early Earth that helped life to flourish, according…", "url": "https://www.cnn.com/2021/08/03/world/early-earth-life-oxygen-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802181524-03-cyanobacteria-microbial-mats-super-tease.jpg", "publishedAt": "2021-08-03T07:45:17Z", "content": "(CNN)Earth hasn't always experienced the 24-hour day we're so familiar with now. In fact, the way the world turns not only determines the length of our day, but it could have contributed to an influx… [+4244 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zahra Ullah, Radina Gigova and Jessie Yeung, CNN", "title": "Head of Belarusian exile group found dead in Kiev", "description": "Vitaly Shishov, the head of a Kiev-based organization helping Belarusians flee abroad, was found dead on Tuesday, a day after he went missing, according to Ukraine's National Police.", "url": "https://www.cnn.com/2021/08/03/europe/belarus-house-leader-dead-ukraine-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803024808-map-kieve-ukraine-super-tease.jpg", "publishedAt": "2021-08-03T07:26:27Z", "content": "(CNN)Vitaly Shishov, the head of a Kiev-based organization helping Belarusians flee abroad, was found dead on Tuesday, a day after he went missing, according to Ukraine's National Police.\r\nShishov, t… [+2712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "'These are the darkest days of the pandemic,' hospital administrator says as state struggles with rising Covid-19 cases", "description": "The ICU of Louisiana's largest hospital is stretched to its limit with Covid-19 patients while others experiencing symptoms were waiting for a bed Monday, an official said.", "url": "https://www.cnn.com/2021/08/03/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803003049-02-covid-19-patient-ca-hospital-0730-super-tease.jpg", "publishedAt": "2021-08-03T06:50:19Z", "content": "(CNN)The ICU of Louisiana's largest hospital is stretched to its limit with Covid-19 patients while others experiencing symptoms were waiting for a bed Monday, an official said.\r\nOur Lady of the Lake… [+5914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "India to deploy naval task force into South China Sea and beyond", "description": "India is sending a task force of four warships into the South China Sea on a two-month deployment that will include exercises with Quad partners the United States, Japan and Australia, India's Defense Ministry announced Monday.", "url": "https://www.cnn.com/2021/08/03/asia/india-warships-south-china-sea-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802221500-01-india-ships-southeast-asia-ranvijay-super-tease.jpg", "publishedAt": "2021-08-03T05:28:37Z", "content": "Hong Kong (CNN)India is sending a task force of four warships into the South China Sea on a two-month deployment that will include exercises with Quad partners the United States, Japan and Australia,… [+4569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, CNN", "title": "Long Island county legislature votes to allow first responders to sue protesters and sets civil fines of up to $50,000", "description": "The legislature for Nassau County, New York, approved a bill Monday that says anyone who harasses or injures a first responder -- which includes police officers -- can be fined up to $50,000 while giving first responders the ability to sue the person directly.", "url": "https://www.cnn.com/2021/08/03/us/nassau-county-protester-bill-approved/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803000539-nassau-county-legislature-0802-super-tease.jpg", "publishedAt": "2021-08-03T05:26:06Z", "content": "(CNN)The legislature for Nassau County, New York, approved a bill Monday that says anyone who harasses or injures a first responder -- which includes police officers -- can be fined up to $50,000 whi… [+5830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Keith Allen, CNN", "title": "Man arrested in Houston road rage killing", "description": "The man suspected of fatally shooting a 17-year-old who was a passenger in a vehicle on the way home from a Houston Astros baseball game last month has surrendered to authorities, Houston Police Chief Troy Finner said Monday.", "url": "https://www.cnn.com/2021/08/03/us/gerald-wayne-williams-houston-road-rage-killing-suspect/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802211452-gerald-williams-houston-pd-arrest-super-tease.jpg", "publishedAt": "2021-08-03T04:59:12Z", "content": "(CNN)The man suspected of fatally shooting a 17-year-old who was a passenger in a vehicle on the way home from a Houston Astros baseball game last month has surrendered to authorities, Houston Police… [+2267 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deanna Hackney, CNN", "title": "5 Miami Beach officers face charges after the alleged use of excessive force during arrest inside hotel", "description": "Five Miami Beach police officers are facing criminal charges, accused of using excessive force during the arrests of two men at a local hotel last week.", "url": "https://www.cnn.com/2021/08/03/us/miami-beach-officers-alleged-excessive-force/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803001641-miami-beach-officers-alleged-excessive-force-super-tease.jpg", "publishedAt": "2021-08-03T04:46:40Z", "content": "(CNN)Five Miami Beach police officers are facing criminal charges, accused of using excessive force during the arrests of two men at a local hotel last week.\r\nMiami-Dade State Attorney Katherine Fern… [+3083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Death toll from China floods jumps to 302; Covid outbreak complicates recovery", "description": "The death toll from floods that ravaged central China last month now stands at 302, local authorities said Monday -- more than triple the last estimate.", "url": "https://www.cnn.com/2021/08/03/china/china-zhengzhou-flood-deaths-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210722014007-01-china-flood-0722-super-tease.jpg", "publishedAt": "2021-08-03T04:38:11Z", "content": "(CNN)The death toll from floods that ravaged central China last month now stands at 302, local authorities said Monday -- more than triple the last estimate.\r\nHeavy rainfall hit the province of Henan… [+4523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Adam Renton, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-03-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-03T04:00:19Z", "content": "It's Tuesday, August 3, the 11th official day of Tokyo 2020. Here's what you need to know.\r\nBiles is back: Simone Biles is expected to compete in the final women's gymnastics event of Tokyo 2020: the… [+3002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc and Rob Frehse, CNN", "title": "New York Times: Andrew Cuomo questioned for 11 hours by New York attorney general's office in sexual harassment inquiry", "description": "New York Gov. Andrew Cuomo was questioned by investigators in the state attorney general's office for 11 hours last month as part of an inquiry into sexual harassment allegations against him, The New York Times reported Monday.", "url": "https://www.cnn.com/2021/08/02/politics/andrew-cuomo-new-york-attorney-general-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319203228-andrew-cuomo-0318-super-tease.jpg", "publishedAt": "2021-08-03T01:53:40Z", "content": "Washington (CNN)New York Gov. Andrew Cuomo was questioned by investigators in the state attorney general's office for 11 hours last month as part of an inquiry into sexual harassment allegations agai… [+3398 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "What's a dim sim? How an oversized dumpling became an Australian food icon", "description": "Dim sims, affectionately called dimmies in Australia, are a variant of a traditional Chinese dumpling and have become an iconic dish in Melbourne and beyond. But who invented them? The answer is complicated.", "url": "https://www.cnn.com/travel/article/dim-sim-chinese-australian-dumpling-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210722003941-03-dim-sim-chinese-australian-dumpling-super-tease.jpg", "publishedAt": "2021-08-03T01:48:41Z", "content": "(CNN) Every Friday, Ross Harrington, a car dealership service manager in Melbourne, heads to a local lunch shop to pick up a couple of deep-fried dim sims, kicking off his weekend dim sim routine.\r\nH… [+8909 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "German warship heads for South China Sea for first time in nearly two decades amid tension with Beijing", "description": "Germany on Monday sent a warship to the South China Sea for the first time in almost two decades, joining other Western nations in expanding its military presence in the region amid growing alarm over China's territorial ambitions.", "url": "https://www.cnn.com/2021/08/02/world/german-warship-south-china-sea-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802210929-02-bayern-german-ship-0802-super-169.jpg", "publishedAt": "2021-08-03T01:43:08Z", "content": "Germany on Monday sent a warship to the South China Sea for the first time in almost two decades, joining other Western nations in expanding its military presence in the region amid growing alarm ove… [+1930 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "How misogynoir is oppressing Black women athletes", "description": "Naomi Osaka discovered what it's like to be at the sharp end of a sporting governing body's regulations this summer.", "url": "https://www.cnn.com/2021/08/02/sport/misogynoir-black-women-athletes-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729114509-20210729-black-atheletes-penalized-illustration-super-tease.jpg", "publishedAt": "2021-08-03T00:37:54Z", "content": "By Hannah Ryan, CNN\r\nUpdated 8:37 PM ET, Mon August 2, 2021\r\n (CNN)Naomi Osaka discovered what it's like to be at the sharp end of a sporting governing body's regulations this summer. \r\nThe four-time… [+21443 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien", "title": "Amazon union election results should be set aside due to misconduct, NLRB officer recommends", "description": "A National Labor Relations Board official is recommending that the results of the milestone union election at an Amazon warehouse in Alabama held earlier this year be scrapped and that a new election be held due to illegal misconduct on the part of the e-comm…", "url": "https://www.cnn.com/2021/08/02/tech/amazon-union-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802193414-amazon-bessemer-al-file-super-169.jpg", "publishedAt": "2021-08-03T00:22:50Z", "content": "A National Labor Relations Board official is recommending that the results of the milestone union election at an Amazon warehouse in Alabama held earlier this year be scrapped and that a new election… [+3435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, Matt Rivers and Natalie Gallón, CNN", "title": "'He died hoping his security would come'", "description": "Mrs. Moise was found bleeding on the floor next to the body of her husband, Jovenel Moise, on July 7. But she survived the mysterious attack -- and is now lighting a fire under the search to bring the killers to justice.", "url": "https://www.cnn.com/2021/08/02/americas/haiti-first-lady-martine-moise-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802135625-01-haiti-first-lady-martine-moise-intv-super-tease.jpg", "publishedAt": "2021-08-03T00:14:07Z", "content": "By Caitlin Hu, Matt Rivers and Natalie Gallón, CNN\r\nUpdated 8:23 PM ET, Mon August 2, 2021\r\nSouth Florida (CNN) -- When Haiti's president was brutally assassinated in his bedroom last month, just one… [+9809 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "The really worrisome thing about the Delta variant", "description": "Kent Sepkowitz writes that, while the headlines about the Delta variant have largely focused on the rising infection rates, ​​the fact that some children have gotten seriously ill from the virus is a problem worthy of real debate.", "url": "https://www.cnn.com/2021/08/02/opinions/worrisome-thing-about-delta-variant-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729173437-dr-wen-back-to-school-orig-thumb-1-super-tease.jpg", "publishedAt": "2021-08-02T23:45:12Z", "content": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View mo… [+4190 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Becker, CNN", "title": "Maricopa County defies latest subpoena request from Arizona state Senate seeking to expand 2020 ballot review", "description": "Maricopa County and Dominion Voting Systems are rebuffing the latest subpoenas from Arizona's GOP-led Senate for election materials related to the so-called audit of 2020 election ballots.", "url": "https://www.cnn.com/2021/08/02/politics/maricopa-county-defies-subpoena-state-senate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210507131521-maricopa-county-ballot-recount-0501-super-tease.jpg", "publishedAt": "2021-08-02T23:37:06Z", "content": "Washington (CNN)Maricopa County and Dominion Voting Systems are rebuffing the latest subpoenas from Arizona's GOP-led Senate for election materials related to the so-called audit of 2020 election bal… [+3989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "US-Mexico border arrests remain at highest level in decades amid hottest summer weeks", "description": "Federal authorities in July arrested tens of thousands of migrants attempting to enter the United States from Mexico, likely surpassing June's numbers that were the highest in decades, raising new health and safety concerns during summer's hottest days.", "url": "https://www.cnn.com/2021/08/02/politics/border-arrests-remain-highest-decades-summer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802190805-texas-border-migrants-0709-super-tease.jpg", "publishedAt": "2021-08-02T23:33:20Z", "content": "Washington (CNN)Federal authorities in July arrested tens of thousands of migrants attempting to enter the United States from Mexico, likely surpassing June's numbers that were the highest in decades… [+3009 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "A rare species thought to be extinct is clinging to survival, study finds", "description": "A species of tiny chameleons thought to be extinct from deforestation has been found, but it's clinging to survival and still might face additional threats, according to a new study.", "url": "https://www.cnn.com/2021/08/02/world/chameleon-endangered-species-found-study-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802152920-02-chapmans-pygmy-chameleon-super-tease.jpg", "publishedAt": "2021-08-02T23:03:12Z", "content": "(CNN)A species of tiny chameleons presumed to be extinct due to deforestation has been found, but it is clinging to survival.\r\nUp to only 5.5 centimeters (2.2 inches) long, the critically endangered … [+5790 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Em Steck, Drew Myers and Andrew Kaczynski, CNN", "title": "Top RNC official in Florida spreads Covid-19 conspiracies, calling vaccines the 'mark of the beast'", "description": "Amid recent surging coronavirus cases in Florida, a top Republican National Committee official in the state has spread anti-vaccine rhetoric and misinformation, comparing the Biden administration's vaccine efforts to Nazi-era \"brown shirts,\" and twice calling…", "url": "https://www.cnn.com/2021/08/02/politics/kfile-rnc-peter-feaman-covid-19-vaccine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802154739-peter-feaman-file-2020-restricted-super-tease.jpg", "publishedAt": "2021-08-02T23:00:23Z", "content": "(CNN)Amid recent surging coronavirus cases in Florida, a top Republican National Committee official in the state has spread anti-vaccine rhetoric and misinformation, comparing the Biden administratio… [+4530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "A depressing number on Republicans and the vaccine", "description": "The White House announced Monday that 70% of eligible Americans have received at least one shot of the Covid-19 vaccine.", "url": "https://www.cnn.com/2021/08/02/politics/monmouth-poll-republicans-vaccine-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729083853-us-covid-19-vaccine-dose-pfizer-0514-super-169.jpg", "publishedAt": "2021-08-02T22:32:10Z", "content": "The White House announced Monday that 70% of eligible Americans have received at least one shot of the Covid-19 vaccine.\r\nWhich is good!\r\nAlso on Monday a new Monmouth University national poll came o… [+1994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "What's next for struggling renters now that the eviction ban has expired", "description": "The federal eviction moratorium has expired, and landlords in many parts of the country can officially begin removing people from their homes. Even though more than 3 million people said they were likely to be evicted \"within the next two months,\" according t…", "url": "https://www.cnn.com/2021/08/02/homes/eviction-ban-next-steps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802152947-eviction-moratorium-protest-0730-super-tease.jpg", "publishedAt": "2021-08-02T22:09:12Z", "content": "(CNN Business)The federal eviction moratorium has expired, and landlords in many parts of the country can officially begin removing people from their homes. Even though more than 3 million people sai… [+6442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar and Haley Brink, CNN Meteorologists", "title": "Researchers want 'zoomies' to replace the standard hurricane forecast cone", "description": "The most used and looked at graphic when a hurricane is forecast could be unintentionally misleading the public into perceiving that they could be safe from a hurricane's track and impacts.", "url": "https://www.cnn.com/2021/08/02/weather/weather-hurricane-track-drought-monsoon-flood-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707092647-tropical-storm-elsa-satellite-9-a-m-et-070721-super-tease.jpg", "publishedAt": "2021-08-02T21:54:25Z", "content": "CNN weather is launching a weekly column, publishing Mondays with the weather news you should be aware of and the week's hurricane outlook. Find updates each week here.\r\n (CNN)A familiar graphic may … [+6124 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Virginia Langmaid and Marnie Hunter, CNN", "title": "CDC adds 16 destinations to 'very high' Covid-19 travel risk list", "description": "The US Centers for Disease Control and Prevention added 16 destinations to its \"very high\" Covid-19 risk level on Monday, including Greece, Ireland and the US Virgin Islands.", "url": "https://www.cnn.com/travel/article/cdc-adds-very-high-risk-travel-destinations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802161329-greece-tourism-060821-super-tease.jpg", "publishedAt": "2021-08-02T21:29:28Z", "content": "(CNN) The US Centers for Disease Control and Prevention added 16 destinations to its \"very high\" Covid-19 risk level on Monday, including Greece, Ireland and the US Virgin Islands.\r\nAccording to the … [+1544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Virginia Langmaid and Marnie Hunter, CNN", "title": "CDC adds 16 destinations to 'very high' Covid-19 travel risk list", "description": "The US Centers for Disease Control and Prevention added 16 destinations to its \"very high\" Covid-19 risk level on Monday, including Greece, Ireland and the US Virgin Islands.", "url": "https://www.cnn.com/travel/article/cdc-adds-very-high-risk-travel-destinations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802161329-greece-tourism-060821-super-tease.jpg", "publishedAt": "2021-08-02T21:29:28Z", "content": "(CNN) The US Centers for Disease Control and Prevention added 16 destinations to its \"very high\" Covid-19 risk level on Monday, including Greece, Ireland and the US Virgin Islands.\r\nAccording to the … [+1544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan and Paul LeBlanc", "title": "Illinois governor signs bill expanding background checks on gun sales starting in 2024", "description": "Illinois Gov. J.B. Pritzker on Monday signed new legislation expanding background checks on all gun sales in the state starting in 2024, a step he touted as \"commonsense\" and with bipartisan support.", "url": "https://www.cnn.com/2021/08/02/politics/illinois-background-checks-gun-sales/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802160021-gov-j-b-pritzker-0802-super-169.jpg", "publishedAt": "2021-08-02T21:18:10Z", "content": "Illinois Gov. J.B. Pritzker on Monday signed new legislation expanding background checks on all gun sales in the state starting in 2024, a step he touted as commonsense and with bipartisan support. \r… [+2449 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Derrick Johnson", "title": "American democracy's infrastructure is crumbling", "description": "Derrick Johnson writes that for American democracy to function, it requires not only the building of roads, bridges and railways, but also the guarantee of access and participation in the voting process.", "url": "https://www.cnn.com/2021/08/02/opinions/voting-rights-crumbling-american-infrastructure-johnson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629100146-voting-rights-rally-scotus-0623-super-tease.jpg", "publishedAt": "2021-08-02T20:51:05Z", "content": "Derrick Johnson is the president and CEO of the NAACP, America's largest civil rights organization. Follow him on Twitter @DerrickNAACP. The views expressed in this commentary are those of the author… [+5601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, Gregory Lemos and Amir Vera, CNN", "title": "Florida judge orders destruction of suppressed video evidence in Robert Kraft case", "description": "Kraft was one of dozens charged in relation to a prostitution and human trafficking investigation.", "url": "https://www.cnn.com/2021/08/02/us/florida-robert-kraft-spa-video-destroyed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120627062946-robert-kraft-patriots-super-tease.jpg", "publishedAt": "2021-08-02T20:48:17Z", "content": "(CNN)A Palm Beach County, Florida, judge ordered the destruction of video evidence previously suppressed in the case against New England Patriots owner Robert Kraft, according to court documents.\r\nJu… [+1764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly", "title": "Pixel 6 and Pixel 6 Pro mark new smartphone era for Google", "description": "Google on Monday kicked off smartphone season by previewing its new Pixel 6 and Pixel 6 Pro smartphones. But it also signaled a new era for the Pixel, shifting it away from a mid-tier line with a niche user base to premium status, in a move that could positio…", "url": "https://www.cnn.com/2021/08/02/tech/google-pixel-6-pro/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802132015-02-google-pixel-6-pixel-6-pro-unveiling-super-169.jpg", "publishedAt": "2021-08-02T20:42:37Z", "content": "Google on Monday kicked off smartphone season by previewing its new Pixel 6 and Pixel 6 Pro smartphones. But it also signaled a new era for the Pixel, shifting it away from a mid-tier line with a nic… [+2542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Rapper DaBaby apologizes for inflammatory comments", "description": "Rapper DaBaby has apologized for the false and disparaging comments he made about gay men and HIV during a performance at a Miami music festival.", "url": "https://www.cnn.com/2021/08/02/entertainment/dababy-apology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210801130713-dababy-072521-super-tease.jpg", "publishedAt": "2021-08-02T20:31:06Z", "content": "(CNN)Rapper DaBaby has apologized for the false and disparaging comments he made about gay men and HIV during a performance at a Miami music festival. \r\nThe move comes days after his comments were la… [+1364 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Is it legal to mandate Covid vaccines? In many circumstances, yes", "description": "For those who are refusing to get the Covid-19 vaccine, there are a lot of legal ways for public and private actors to make that decision painful.", "url": "https://www.cnn.com/2021/08/02/politics/covid-vaccine-mandates-what-is-legal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210724072221-moderna-covid-19-vaccine-florida-05-20-2021-super-169.jpg", "publishedAt": "2021-08-02T20:18:41Z", "content": "For those who are refusing to get the Covid-19 vaccine, there are a lot of legal ways for public and private actors to make that decision painful. \r\nSuch vaccine requirements will undoubtedly be chal… [+7375 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "These businesses won't let you inside without proof of vaccination", "description": "Businesses across the United States are rolling out new vaccine policies for their employees, but there's still a critical part of the equation that needs to be addressed: customers.", "url": "https://www.cnn.com/2021/08/02/business/companies-customers-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802140716-equinox-gym-0706-restricted-super-tease.jpg", "publishedAt": "2021-08-02T20:08:15Z", "content": "New York (CNN)Businesses across the United States are rolling out new vaccine policies for their employees, but there's still a critical part of the equation that needs to be addressed: customers.\r\nA… [+3172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "450,000 honeybees have been occupying the walls of this home for 35 years. They just got rehomed", "description": "Sara Weaver and her husband knew their newest home purchase in Pennsylvania needed some extra love and attention -- but what they didn't know is that an estimated 450,000 bees had been living in the walls for almost 35 years.", "url": "https://www.cnn.com/2021/08/02/us/pennsylvania-honeybee-removal-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802101408-03-pa-honeybee-removal-trnd-super-tease.jpg", "publishedAt": "2021-08-02T20:04:59Z", "content": "(CNN)Sara Weaver and her husband knew their newest home purchase in Pennsylvania needed some extra love and attention -- but what they didn't know is that an estimated 450,000 bees had been living in… [+3943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, Ali Zaslav and Manu Raju", "title": "Lindsey Graham tests positive for Covid-19 and has had 'flu-like symptoms' despite being vaccinated", "description": "Republican Sen. Lindsey Graham of South Carolina announced Monday that he has tested positive for Covid-19 despite being vaccinated and has experienced \"flu-like symptoms,\" but said that he now has only \"mild symptoms\" and is very glad he had been vaccinated …", "url": "https://www.cnn.com/2021/08/02/politics/lindsey-graham-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210802153150-01-lindsey-graham-0414-super-169.jpg", "publishedAt": "2021-08-02T19:52:33Z", "content": "Republican Sen. Lindsey Graham of South Carolina announced Monday that he has tested positive for Covid-19 despite being vaccinated and has experienced flu-like symptoms, but said that he now has onl… [+2311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts, CNN", "title": "Families of Dayton shooting victims file suit against manufacturer of large-capacity magazines", "description": "A group comprising survivors and victims' families in the 2019 mass shooting in Dayton, Ohio, has filed a lawsuit against the manufacturer of the large-capacity magazine (LCM) used in the shooting, according to court documents.", "url": "https://www.cnn.com/2021/08/02/us/dayton-shooting-lawsuit-large-capacity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190805091703-02-dayton-shooting-firearm-super-tease.jpg", "publishedAt": "2021-08-02T19:38:49Z", "content": "(CNN)A group comprising survivors and victims' families in the 2019 mass shooting in Dayton, Ohio, has filed a lawsuit against the manufacturer of the large-capacity magazine (LCM) used in the shooti… [+3382 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tina Burnside, CNN", "title": "A vital Memphis bridge shut down since May due to a structural crack has fully reopened", "description": "A major bridge connecting Memphis, Tennessee, to Arkansas reopened to traffic in both directions on Monday afternoon, nearly three months after a crack forced its closure, the Arkansas Department of Transportation announced in a tweet.", "url": "https://www.cnn.com/2021/08/02/us/memphis-hernando-desoto-bridge-reopen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210728130424-hernando-desoto-bridge-memphis-restricted-super-tease.jpg", "publishedAt": "2021-08-02T19:37:02Z", "content": "(CNN)A major bridge connecting Memphis, Tennessee, to Arkansas reopened to traffic in both directions on Monday afternoon, nearly three months after a crack forced its closure, the Arkansas Departmen… [+925 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "FBI used 'provocative photos' of female office staff to catch sexual predators, watchdog says", "description": "FBI agents posted provocative photos of female coworkers online without formal authorization as part of sting operations against sex trafficking, according to a new watchdog report.", "url": "https://www.cnn.com/2021/08/02/politics/fbi-undercover-agents-ig-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/151021174029-fbi-seal-logo-super-tease.jpg", "publishedAt": "2021-08-02T19:19:42Z", "content": "(CNN)FBI agents posted provocative photos of female coworkers online without formal authorization as part of sting operations against sex trafficking, according to a new watchdog report.\r\nThe Justice… [+1839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild", "title": "Officer who responded to January 6 attack is third to die by suicide", "description": "A DC police officer who responded to the US Capitol insurrection has died by suicide, according to the Metropolitan Police Department.", "url": "https://www.cnn.com/2021/08/02/politics/dc-metropolitan-police-officer-suicide-january-6-capitol-riot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727153745-capitol-riot-file-0106-super-169.jpg", "publishedAt": "2021-08-02T18:57:03Z", "content": "A DC police officer who responded to the US Capitol insurrection has died by suicide, according to the Metropolitan Police Department.\r\nOfficer Gunther Hashida, assigned to the Emergency Response Tea… [+1290 chars]"}]}