{"status": "ok", "totalResults": 145, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, Adam Renton, Rob Picheta, Ed Upright, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, Melissa Macaya and Maureen Chowdhury, CNN", "title": "'Silence': Ukrainian president says Putin wouldn't take his call", "description": "Tensions between Moscow and Kyiv are at their highest in years, US President Biden announced a new round of sanctions following Russian President Putin recognizing two separatist pro-Moscow regions in Ukraine as independent. Follow here for the latest updates.", "url": "https://edition.cnn.com/europe/live-news/ukraine-russia-news-02-23-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222174130-04-biden-0222-super-tease.jpg", "publishedAt": "2022-02-24T00:01:00Z", "content": "The heads of the self-proclaimed Donetsk Peoples Republic (DPR) and Luhansk Peoples Republic (LPR), two separatist regions in Ukraine, recently recognized by Russia as independent, have formally aske… [+1604 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "A man who attacked and blamed an Asian family for Covid-19 pleaded guilty to hate crimes charges", "description": "A 21-year-old Texas man pleaded guilty to federal hate crime charges after he brutally attacked and blamed an Asian family whom he believed to be Chinese for the Covid-19 pandemic, prosecutors announced Wednesday.", "url": "https://www.cnn.com/2022/02/23/us/texas-man-pleads-guilty-hate-crimes-attack-asian-family/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223154439-tease-only-midland-texas-map-super-tease.jpg", "publishedAt": "2022-02-23T23:57:36Z", "content": "(CNN)A 21-year-old Texas man pleaded guilty to federal hate crime charges after he brutally attacked and blamed an Asian family whom he believed to be Chinese for the Covid-19 pandemic, prosecutors a… [+2428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "Ukrainian government and commercial organizations hit with data-wiping hack, researchers say", "description": "A data-wiping hacking tool was found on hundreds of computers in Ukraine on Wednesday, according to cybersecurity researchers, raising concerns that a destructive cyberattack was unfolding as Russian military troops moved into Ukraine's separatist regions.", "url": "https://www.cnn.com/2022/02/23/europe/ukraine-government-commercial-organizations-data-wiping-hack/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220126090308-03-laptop-keyboard-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T23:20:11Z", "content": "A data-wiping hacking tool was found on hundreds of computers in Ukraine on Wednesday, according to cybersecurity researchers, raising concerns that a destructive cyberattack was unfolding as Russian… [+1447 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael D'Antonio", "title": "What Trump's lavish praise of Putin reveals", "description": "Michael D'Antonio says former President Donald Trump took the headline-grabbing route and declared Russian leader Vladimir Putin \"very savvy\" and his decision to roll his army into separatist-held parts of Ukraine \"genius.\"", "url": "https://www.cnn.com/2022/02/23/opinions/donald-trump-praises-putin-dantonio/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220127215545-trump-putin-2017-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T23:05:06Z", "content": "Editors Note: Michael DAntonio is the author of the book Never Enough: Donald Trump and the Pursuit of Success and co-author, with Peter Eisner, of the book High Crimes: The Corruption, Impunity, and… [+4877 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay", "title": "Teenager Anthony Elanga salvages draw for Manchester United against Atletico Madrid in Champions League", "description": "Anthony Elanga's late equalizer rescued an unlikely 1-1 draw for Manchester United against Atletico Madrid in the first leg of the teams' Champions League last 16 contest.", "url": "https://www.cnn.com/2022/02/23/football/atletico-madrid-manchester-united-champions-league-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223215450-anthony-elanga-champions-league.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T22:49:01Z", "content": "Anthony Elangas late equalizer rescued an unlikely 1-1 draw for Manchester United against Atletico Madrid in the first leg of the teams Champions League last 16 contest.\r\nJoão Felixs powerful header … [+2493 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "Trudeau revokes Emergencies Act, saying existing laws are enough to deal with protesters", "description": "The Canadian government announced Wednesday it will lift the Emergencies Act, nine days after it was invoked, saying police have the tools they need to continue to deal with unlawful protesters.", "url": "https://www.cnn.com/2022/02/23/americas/canada-trudeau-revokes-emergencies-act/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082016-social-gfx-just-in-super-169.jpg", "publishedAt": "2022-02-23T22:45:05Z", "content": "Ottawa (CNN)The Canadian government announced Wednesday it will lift the Emergencies Act, nine days after it was invoked, saying police have the tools they need to continue to deal with unlawful prot… [+2009 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed", "title": "Study finds children release fewer respiratory droplets and aerosols, a clue to understanding Covid-19 transmission", "description": "Children ages 8 to 10 put out about a quarter of the aerosolized particles as adults do when breathing, speaking and singing, according to a new study. The researchers suggest that the findings may be useful for making decisions about risk management in schoo…", "url": "https://www.cnn.com/2022/02/23/health/respiratory-emissions-lower-in-children-than-adults/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220105173658-02-kids-omicron-safety-mask-classroom.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T22:35:20Z", "content": "Children ages 8 to 10 put out about a quarter of the aerosolized particles as adults do when breathing, speaking and singing, according to a new study. The researchers suggest that the findings may b… [+3072 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden moves closer toward announcing Supreme Court nominee", "description": "Several signals suggest President Joe Biden is moving closer to picking someone to replace Justice Stephen Breyer on the Supreme Court, as the White House quickly approaches its self-imposed deadline to announce a nominee before the end of the month.", "url": "https://www.cnn.com/2022/02/23/politics/supreme-court-nominee-latest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222143436-02-biden-ukraine-0222-super-tease.jpg", "publishedAt": "2022-02-23T22:25:23Z", "content": "(CNN)Several signals suggest President Joe Biden is moving closer to picking someone to replace Justice Stephen Breyer on the Supreme Court, as the White House quickly approaches its self-imposed dea… [+6784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Nathan Hodge, CNN", "title": "Moscow fireworks mask Russia's collision course with the West", "description": "There were fireworks in the skies over Moscow Wednesday night, but not for the reasons one might expect.", "url": "https://www.cnn.com/2022/02/23/europe/russia-ukraine-analysis-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223133955-moscow-fireworks-0223-super-tease.jpg", "publishedAt": "2022-02-23T22:25:04Z", "content": "2/16 And I thought about the same gathering of nomenklatura dotards from the Politburo of the Central Committee of the CPSU, who, quite similarly, on their own whim , imagining themselves as geopolit… [+127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "'It won't be bloodless': Pentagon warns Putin if Russia launches full-scale invasion", "description": "During a press briefing, Pentagon press secretary John Kirby warns that Russia is prepared to launch an attack on Ukraine and President Vladimir Putin will be choosing war if he decides to do this.", "url": "https://www.cnn.com/videos/world/2022/02/23/pentagon-kirby-ukraine-russia-attack-bloodless-sot-nr-vpx.cnn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223163123-john-kirby.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T21:56:14Z", "content": "'It won't be bloodless. There will be suffering ...' : Pentagon warns Putin if Russia launches full-scale invasion\r\nDuring a press briefing, Pentagon press secretary John Kirby warns that Russia is p… [+113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch", "title": "2 Louisiana deputies face manslaughter charges in fatal shooting of unarmed man", "description": "Two Louisiana deputies have been arrested on manslaughter charges following the fatal shooting of a man last week, authorities said.", "url": "https://www.cnn.com/2022/02/23/us/louisiana-deputies-fatal-shooting-manslaughter-charges/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223112726-louis-hughes-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T21:31:06Z", "content": "Two Louisiana deputies have been arrested on manslaughter charges following the fatal shooting of a man last week, authorities said.\r\nThe two deputies were among officers who responded to a disturban… [+2408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster", "title": "Queen Elizabeth II holds virtual weekly meeting with Prime Minister after Covid-19 diagnosis", "description": "Britain's Queen Elizabeth II spoke with UK Prime Minister Boris Johnson on Wednesday, a Buckingham Palace spokesperson said, despite the monarch suffering mild symptoms after her positive Covid-19 diagnosis.", "url": "https://www.cnn.com/2022/02/23/uk/queen-elizabeth-boris-johnson-intl-gbr/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223124543-queen-elizabeth-1019.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T21:23:09Z", "content": "Britains Queen Elizabeth II spoke with UK Prime Minister Boris Johnson on Wednesday, a Buckingham Palace spokesperson said, despite the monarch suffering mild symptoms after her positive Covid-19 dia… [+1496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "A doghouse struck by a meteorite has sold at auction", "description": "A doghouse that was struck by a meteorite fragment in April 2019 -- complete with a hole in the roof -- is among the items that sold on Wednesday in an auction of rare meteorites.", "url": "https://www.cnn.com/style/article/christies-meteorite-sale-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223091530-02-christies-rare-meteorites-auction-super-tease.jpg", "publishedAt": "2022-02-23T21:10:44Z", "content": "artsPublished 23rd February 2022\r\nA doghouse that was struck by a meteorite fragment in April 2019 -- complete with a hole in the roof -- isamong the items that sold on Wednesday during an online Chr… [+3075 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stella Chan, CNN", "title": "A California woman spent 13 days in jail after being mistaken for another person with the same name, according to a lawsuit against the City of LA", "description": "A California woman was headed for a trip to Mexico but instead spent 13 days in a Los Angeles jail after police mistook her for another person with the same name, according to allegations in a lawsuit filed Tuesday.", "url": "https://www.cnn.com/2022/02/23/us/california-woman-jailed-mistaken-same-name-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223123722-bethany-k-farber-super-tease.jpg", "publishedAt": "2022-02-23T21:07:44Z", "content": "(CNN)A California woman was headed for a trip to Mexico but instead spent 13 days in a Los Angeles jail after police mistook her for another person with the same name, according to allegations in a l… [+3424 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: How Republican candidates around the country have promoted election lies this month", "description": "Numerous Republican candidates running in 2022 primaries across the country continue to baselessly cast doubt on the integrity of the 2020 election.", "url": "https://www.cnn.com/2022/02/23/politics/fact-check-2020-election-lies-arrington-marchant-ramthun-lake-hanks-perdue/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222164803-ramthun-lake-marchant-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T21:02:32Z", "content": "Numerous Republican candidates running in 2022 primaries across the country continue to baselessly cast doubt on the integrity of the 2020 election.\r\nSome of these candidates are just plain lying tha… [+10545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Pets can boost your brain power, study says", "description": "Owning a household pet of any kind can give your brain a boost and delay cognitive decline, especially if you have the pet long-term, a new study revealed.", "url": "https://www.cnn.com/2022/02/23/health/pets-brain-health-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223144018-cat-elderly-woman-stock-super-tease.jpg", "publishedAt": "2022-02-23T21:00:06Z", "content": "Change your relationship with stress. Sign up for CNN's Stress, But Less newsletter, a six-part mindfulness guide that will inform and inspire you to reduce stress while learning how to harness it.\r\n… [+4692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, Zachary Cohen, Ryan Nobles and Annie Grayer, CNN", "title": "Ivanka Trump in talks for voluntary interview with January 6 committee", "description": "Former President Donald Trump's daughter Ivanka, who also served as senior White House adviser, is in discussions with the House select committee investigating the January 6 insurrection to voluntarily appear for an interview, her spokesperson and two sources…", "url": "https://www.cnn.com/2022/02/23/politics/ivanka-trump-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102141221-ivanka-trump-2020-file-super-tease.jpg", "publishedAt": "2022-02-23T20:21:05Z", "content": "(CNN)Former President Donald Trump's daughter Ivanka, who also served as senior White House adviser, is in discussions with the House select committee investigating the January 6 insurrection to volu… [+1234 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "New studies bring BA.2 Covid variant into sharper focus", "description": "On the heels of concerning new lab and animal experiments suggesting that BA.2 may be capable of causing more severe disease than the original Omicron strain, two new studies are helping to show how well human immunity is defending against this strain in the …", "url": "https://www.cnn.com/2022/02/23/health/covid-ba2-omicron-studies-explainer/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223151359-01-covid-hospital-ct-0201.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T20:20:26Z", "content": "On the heels of concerning new lab and animal experiments suggesting that BA.2 may be capable of causing more severe disease than the original Omicron strain, two new studies are helping to show how … [+6467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mike Andronico", "title": "Samsung Galaxy S22+ review: A subtle improvement to one of the best Android phones - CNN", "description": "The Galaxy S22 and S22+ offer gorgeous screens, great cameras, long battery life and some of the best performance you'll find in an Android phone.", "url": "https://www.cnn.com/2022/02/23/cnn-underscored/samsung-galaxy-s22-plus-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223142400-galaxy-s22-plus-lead.jpg?q=h_2085,w_3706,x_0,y_0", "publishedAt": "2022-02-23T20:04:00Z", "content": "At a quick glance, the $799 Galaxy S22 and $999 Galaxy S22+ dont seem like huge annual upgrades. But some of the small changes Samsung made for its latest flagships are significant, and if you havent… [+16407 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez", "title": "Justice Department ends Trump-era China Initiative following bias concerns", "description": "The Justice Department is ending its three-year-old China Initiative, a national security program intended to thwart China's intelligence activities in the US, including those aimed at stealing emerging technology from research universities, in the wake of a …", "url": "https://www.cnn.com/2022/02/23/politics/justice-department-china/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223144720-02-doj-building-dc-2022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T20:01:39Z", "content": "The Justice Department is ending its three-year-old China Initiative, a national security program intended to thwart Chinas intelligence activities in the US, including those aimed at stealing emergi… [+4027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "Ted Cruz praises Biden over sanctions tied to Nord Stream pipeline", "description": "Republican Sen. Ted Cruz of Texas on Wednesday offered rare praise for President Joe Biden over sanctions targeting the company behind a controversial pipeline that has become a flashpoint in the intensifying Ukraine-Russia crisis.", "url": "https://www.cnn.com/2022/02/23/politics/biden-cruz-sanctions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220131125408-sen-ted-cruz-0105-super-tease.jpg", "publishedAt": "2022-02-23T19:41:17Z", "content": "(CNN)Republican Sen. Ted Cruz of Texas on Wednesday offered rare praise for President Joe Biden over sanctions targeting the company behind a controversial pipeline that has become a flashpoint in th… [+3029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Dad help!': 11-year-old texts his father during carjacking", "description": "11-year-old Daniel was in his father's car when it was carjacked. Michelle Charlesworth with CNN affiliate WABC has the story.", "url": "https://www.cnn.com/videos/us/2022/02/23/son-texts-father-help-carjacking-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223134039-daniel-and-david-perez-super-tease.jpg", "publishedAt": "2022-02-23T19:25:26Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "USPS finalizing plan to replace fleet with 90% gas-powered vehicles", "description": "The US Postal Service is moving ahead with a plan to replace its current fleet with 90% gas-powered trucks and 10% battery electric vehicles, after the Environmental Protection Agency and White House objected to the move and asked for further study of the imp…", "url": "https://www.cnn.com/2022/02/23/politics/postal-service-vehicles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223140945-usps-truck-file-2021-super-tease.jpg", "publishedAt": "2022-02-23T19:24:12Z", "content": "(CNN)The US Postal Service is moving ahead with a plan to replace its current fleet with 90% gas-powered trucks and 10% battery electric vehicles, after the Environmental Protection Agency and White … [+2172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "26 things Rick Scott's 'rescue' plan for America would do", "description": "Florida Sen. Rick Scott kicked off the 2024 2022 campaign on Tuesday by releasing an 11-point plan \"to rescue America.\"", "url": "https://www.cnn.com/2022/02/23/politics/rick-scott-rescue-america-plan-gop/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/181118100742-01-rick-scott-file-1118.jpg?q=x_0,y_156,h_1688,w_3000,c_crop/w_800", "publishedAt": "2022-02-23T19:11:14Z", "content": "Florida Sen. Rick Scott kicked off the 2024 2022 campaign on Tuesday by releasing an 11-point plan to rescue America.\r\nIf Republicans return to Washingtons business as usual, if we have no bigger pla… [+5200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Areva Martin", "title": "Killers of Ahmaud Arbery display a reality we must overcome", "description": "The federal hate crime case of the three men who killed Ahmaud Arbery speaks to bigger issues about an entire swath of our country that has been inculcated with theories of White supremacy and superiority -- and Black inferiority, writes Areva Martin.", "url": "https://www.cnn.com/2022/02/23/opinions/ahmaud-arbery-killers-painful-reality-martin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220109183507-ahmaud-arbery-killers-sentencing-justice-tisby-super-tease.jpg", "publishedAt": "2022-02-23T19:03:12Z", "content": "Areva Martin is a CNN legal analyst and a civil rights attorney. The opinions expressed in this commentary are solely her own. View more opinion on CNN.\r\n (CNN)Tuesday brought guilty verdicts in the … [+4194 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "February 23 is officially known as Ahmaud Arbery Day in Georgia and across the US, many continue to honor his memory with a 2.23-mile run advocating for racial equality", "description": "Two years ago people around the world pledged to jog, walk or run 2.23 miles, symbolic of the day Georgia man, Ahmaud Arbery was gunned down while running February 23, 2020.", "url": "https://www.cnn.com/2022/02/23/us/run-for-ahmaud-arbery-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223125311-01-run-for-ahmaud-arbery-2022-file-super-tease.jpg", "publishedAt": "2022-02-23T18:43:16Z", "content": "(CNN)Two years ago people around the world pledged to jog, walk or run 2.23 miles, symbolic of the day Georgia man, Ahmaud Arbery was gunned down while running February 23, 2020. \r\nToday, many of tho… [+5102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Don't expect the Fed to slow rate hikes just because of the midterms", "description": "The Federal Reserve is going to raise interest rates at its next meeting on March 16 to try to put a lid on inflation. That much we know. The only question is whether the Fed will boost rates by a quarter of a percentage point or a half-point.", "url": "https://www.cnn.com/2022/02/23/economy/federal-reserve-interest-rates-midterms/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220211092004-01-jerome-powell-0111.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T18:24:39Z", "content": "The Federal Reserve is going to raise interest rates at its next meeting on March 16 to try to put a lid on inflation. That much we know. The only question is whether the Fed will boost rates by a qu… [+3710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand", "title": "Woman who livestreamed US Capitol attack sentenced to 45 days in jail", "description": "Judge Reggie Walton said he had \"been reading a couple books of how civil wars start,\" adding his concern that history might be repeating itself.", "url": "https://www.cnn.com/2022/02/23/politics/january-6-civil-war-rioter-sentenced/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223124031-imelda-acosta-mariposa-castro-capitol-riot-super-tease.jpg", "publishedAt": "2022-02-23T18:08:08Z", "content": "(CNN)A January 6 rioter who said that \"war just started\" in a video taken after the attack on the US Capitol and encouraged social media followers to act as well was sentenced Wednesday to 45 days in… [+2256 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeevan Ravindran, CNN", "title": "London's largest Roman mosaic in 50 years discovered", "description": "A large area of well-preserved Roman mosaic -- parts of it approximately 1,800 years old -- has been uncovered in London near one of the city's most popular landmarks.", "url": "https://www.cnn.com/style/article/roman-mosaic-london-discovery-scli-scn-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223141124-01-roman-mosaic-london-archaeology-discovery-super-tease.jpg", "publishedAt": "2022-02-23T17:33:28Z", "content": "artsUpdated 23rd February 2022\r\nA large area of well-preserved Roman mosaic -- parts of it approximately 1,800 years old -- has been uncovered in London near one of the city's most popular landmarks.… [+2883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeevan Ravindran, CNN", "title": "Gary Brooker, 'Whiter Shade of Pale' singer-songwriter, dead at 76", "description": "Singer-songwriter Gary Brooker, best known for the 1967 single \"A Whiter Shade of Pale\" as part of British rock band Procol Harum, has died at the age of 76, his representative confirmed to CNN Wednesday.", "url": "https://www.cnn.com/2022/02/23/entertainment/gary-brooker-whiter-shade-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223094854-03-gary-brooker-procol-harum-super-tease.jpg", "publishedAt": "2022-02-23T16:59:24Z", "content": "London (CNN)Singer-songwriter Gary Brooker, best known for the 1967 single \"A Whiter Shade of Pale\" as part of British rock band Procol Harum, has died at the age of 76, his representative confirmed … [+1999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz", "title": "Yeezy Gap unveils Balenciaga collection that includes a $440 denim jacket", "description": "", "url": "https://www.cnn.com/2022/02/23/business/yeezy-gap-balenciaga-launch/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223101600-02-yeezy-gap-balenciaga-february-2022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T16:57:09Z", "content": "The wait has ended. Yeezy Gap revealed the first look at its highly anticipated collaboration with fashion powerhouse brand Balenciaga. \r\nThe 25-piece collection includes a denim jacket paired with j… [+1696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, Brian Fung", "title": "Trump SPAC's stock nears record high after his app debuts to mixed reviews", "description": "The controversial Trump SPAC surged near record highs on Tuesday after former President Donald Trump's social media app debuted atop Apple's App Store — even as the launch was marked with a flurry of one-star ratings, technical-support complaints and a massiv…", "url": "https://www.cnn.com/2022/02/23/investing/trump-spac-truth-social/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223102724-trump-truth-social-app-0221.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T16:42:52Z", "content": "The controversial Trump SPAC surged near record highs on Tuesday after former President Donald Trumps social media app debuted atop Apples App Store even as the launch was marked with a flurry of one… [+3448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Tom Holland joins Tobey Maguire and Andrew Garfield for classic Spider-Man meme", "description": "Tom Holland, Tobey Maguire and Andrew Garfield posed for a classic Spider-Man meme ahead of the digital release date announcement of \"Spider Man: No Way Home.\"", "url": "https://www.cnn.com/2022/02/23/entertainment/tom-holland-tobey-maguire-andrew-garfield-spider-man/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220107162158-spiderman-nwh-tom-010722.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T16:26:16Z", "content": "Tom Holland, Tobey Maguire and Andrew Garfield posed for a classic Spider-Man meme ahead of the digital release date announcement of Spider Man: No Way Home.\r\nOn Wednesday, the official Spider-Man fi… [+766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Asteroid that doomed the dinosaurs struck in springtime", "description": "Picture a calm spring day 66 million years ago in what's now North Dakota. Perhaps a Triceratops was lying in the sun, while in the river freshwater paddlefish, mouths gaping, were foraging plankton.", "url": "https://www.cnn.com/2022/02/23/world/asteroid-dinosaur-extinction-spring-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223111353-02-asteroid-dinosaur-extinction-spring-super-tease.jpg", "publishedAt": "2022-02-23T16:02:18Z", "content": "(CNN)Picture a calm spring day 66 million years ago in what's now North Dakota. Perhaps a Triceratops was lying in the sun, while in the river freshwater paddlefish, mouths gaping, were foraging plan… [+5055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The 40 wildest lines from Donald Trump's interview with Clay Travis", "description": "On Tuesday at Mar-a-Lago, Donald Trump sat down with radio hosts Clay Travis and Buck Sexton for an extended interview. He talked 2024, Russia and, well, just about everything else.", "url": "https://www.cnn.com/2022/02/23/politics/trump-clay-travis-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220127183258-trump-arizona-0115-super-tease.jpg", "publishedAt": "2022-02-23T16:00:23Z", "content": "(CNN)On Tuesday at Mar-a-Lago, Donald Trump sat down with radio hosts Clay Travis and Buck Sexton for an extended interview. He talked 2024, Russia and, well, just about everything else. \r\nI went thr… [+11027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Ivana Kottasová, Nada Bashir and Laura Smith-Spark, CNN", "title": "Ukraine to bring in state of emergency amid Russia tensions", "description": "A state of emergency is to be introduced across all parts of Ukraine under government control, officials said Wednesday, while President Volodymyr Zelensky said reservists would be called up as Russian forces remain massed along Ukraine's borders.", "url": "https://www.cnn.com/2022/02/23/europe/russia-ukraine-tensions-wednesday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223121006-02-russia-ukraine-tensions-super-tease.jpg", "publishedAt": "2022-02-23T15:50:28Z", "content": "Kyiv, Ukraine (CNN)A state of emergency is to be introduced across all parts of Ukraine under government control, officials said Wednesday, while President Volodymyr Zelensky said reservists would be… [+10455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky", "title": "Pepsi introduces a first-of-its-kind flavor", "description": "Pepsi is putting a whole new meaning into the soft drink.", "url": "https://www.cnn.com/2022/02/23/business/pepsi-nitro/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223101207-20220223-nitro-pepsi-product.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T15:48:14Z", "content": "Pepsi is putting a whole new meaning into the soft drink.\r\nIn what the company describes its most ambitious feat yet, Pepsi\r\n(PEP)Co announced Wednesday a first-of-its-kind nitrogen-infused cola that… [+1835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Kenya's UN ambassador slams Russia and compares Ukraine crisis to Africa's colonial past", "description": "Russia's recognition of two pro-Russian breakaway regions in Ukraine as \"independent states\" has been condemned by Kenya's ambassador to the UN, who used Africa's past to warn that clinging to the legacies of colonialism risked \"new forms of domination and op…", "url": "https://www.cnn.com/2022/02/23/europe/kenya-ukraine-russia-colonialism-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223071327-martin-kimani-02222022-super-tease.jpg", "publishedAt": "2022-02-23T15:45:56Z", "content": "(CNN)Russia's recognition of two pro-Russian breakaway regions in Ukraine as \"independent states\" has been condemned by Kenya's ambassador to the UN, who used Africa's past to warn that clinging to t… [+2705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jim Sciutto and Katie Bo Lillis, CNN", "title": "Russia moving some forces and tanks into separatist region, Latvian PM says", "description": "Russian troops have moved into the contested eastern region of Ukraine that Russia has now recognized as \"independent,\" according to the Prime Minister of NATO member Latvia and sources familiar with the latest US intelligence assessments.", "url": "https://www.cnn.com/2022/02/23/europe/russian-troops-donbas-latvian-pm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223101844-01-putin-0221-super-tease.jpg", "publishedAt": "2022-02-23T15:33:41Z", "content": "(CNN)Russian troops have moved into the contested eastern region of Ukraine that Russia has now recognized as \"independent,\" according to the Prime Minister of NATO member Latvia and sources familiar… [+483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Kevin Liptak, Phil Mattingly", "title": "Biden expected to allow sanctions on company building controversial Russian gas pipeline to go into effect", "description": "The Biden administration is expected to announce on Wednesday that it will allow sanctions to move forward on the company in charge of building Russia's Nord Stream 2 gas pipeline, after blocking such sanctions last year using a national security waiver.", "url": "https://www.cnn.com/2022/02/23/politics/white-house-russia-sanctions/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222153052-02-nord-stream-2-hockenos.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T15:02:35Z", "content": "The Biden administration is expected to announce on Wednesday that it will allow sanctions to move forward on the company in charge of building Russias Nord Stream 2 gas pipeline, after blocking such… [+1146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kevin Raub, CNN", "title": "The unknown and otherworldly landscape of Brazil's Lençóis Maranhenses National Park", "description": "As a visitor sets eyes on the brilliant pools of paradise that characterize Brazil's Lençóis Maranhenses National Park for the first time, it wouldn't be out of line to assume hallucination.", "url": "https://www.cnn.com/travel/article/lencois-maranhenses-national-park-sand-dunes-brazil/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219185628-07-lenis-maranhenses-national-park-super-tease.jpg", "publishedAt": "2022-02-23T14:53:19Z", "content": "(CNN) As a visitor sets eyes on the brilliant pools of paradise that characterize Brazil's Lençóis Maranhenses National Park for the first time, it wouldn't be out of line to assume hallucination. \r\n… [+5848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, CNN", "title": "Former Miami Dolphins head coach Brian Flores claims he was offered money to keep quiet after firing", "description": "Former Miami Dolphins head coach Brian Flores said team owner Stephen Ross offered him millions of dollars to keep quiet after he was fired in January.", "url": "https://www.cnn.com/2022/02/23/sport/brian-flores-nfl-coach-dolphins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219142943-brian-flores-dolphis-file-010922-super-tease.jpg", "publishedAt": "2022-02-23T14:43:21Z", "content": "(CNN)Former Miami Dolphins head coach Brian Flores said team owner Stephen Ross offered him millions of dollars to keep quiet after he was fired in January.\r\nIn his first interview since joining the … [+2435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kevin Raub, CNN", "title": "The unknown and otherworldly landscape of Brazil's Lençóis Maranhenses National Park", "description": "As a visitor sets eyes on the brilliant pools of paradise that characterize Brazil's Lençóis Maranhenses National Park for the first time, it wouldn't be out of line to assume hallucination.", "url": "https://www.cnn.com/travel/article/lenis-maranhenses-national-park-brazil/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219185628-07-lenis-maranhenses-national-park-super-tease.jpg", "publishedAt": "2022-02-23T14:43:00Z", "content": "(CNN) As a visitor sets eyes on the brilliant pools of paradise that characterize Brazil's Lençóis Maranhenses National Park for the first time, it wouldn't be out of line to assume hallucination. \r\n… [+5848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Dave Grohl says he's been reading lips because of hearing loss", "description": "The pandemic has made life more difficult for Dave Grohl in a surprising way.", "url": "https://www.cnn.com/2022/02/23/entertainment/dave-grohl-hearing-loss/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211108142351-03-astroworld-travis-scott-other-concerts-cec.jpg?q=x_0,y_0,h_938,w_1666,c_fill/w_800", "publishedAt": "2022-02-23T14:29:50Z", "content": "The pandemic has made life more difficult for Dave Grohl in a surprising way.\r\nIn a recent appearance on The Howard Stern Show, the Foo Fighters frontman shared that his years as a rock musician have… [+981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh and Isabelle Jani-Friend, CNN", "title": "As Britain scraps free mass testing, Hong Kong will swab its entire population", "description": "At the start of the pandemic, the World Health Organization (WHO) had one clear message: \"Test, test, test.\" Now it fears countries are abandoning that advice.", "url": "https://www.cnn.com/2022/02/23/world/coronavirus-newsletter-intl-02-23-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2022-02-23T14:23:43Z", "content": "This is the weekly edition of CNN's coronavirus newsletter. Look out for your roundup every Wednesday. If you haven't subscribed yet, sign up here.\r\n (CNN)At the start of the pandemic, the World Heal… [+9954 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Glitz, glamour and going out: London Fashion Week returns to the spectacle", "description": "The UK capital was back in full swing this season, with a packed physical schedule and an electric atmosphere.", "url": "https://www.cnn.com/style/article/london-fashion-week-aw22-highlights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223015548-02-london-fashion-week-highlights-rixo-restricted-super-tease.jpg", "publishedAt": "2022-02-23T14:07:51Z", "content": "Glitz, glamour and going out: London Fashion Week returns to the spectacle\r\nThe UK capital was back in full swing this season, with a packed physical schedule and an electric atmosphere.\r\nLondon, UKU… [+4078 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Hayes and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Trial for former officer involved in Breonna Taylor raid begins", "description": "The trial of a former police officer involved in the raid that led to the 2020 shooting death of Breonna Taylor will get underway soon. Follow here for live updates.", "url": "https://www.cnn.com/us/live-news/breonna-taylor-raid-trial-brett-hankison-02-23-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221194641-brett-hankison-court-020822-file-super-tease.jpg", "publishedAt": "2022-02-23T13:59:59Z", "content": "Breonna Taylor's mother doesn't believe the trial of a former Louisville, Kentucky, police officer involved in the botched raid that left her daughter dead will lead to justice, but she'll be there a… [+2124 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "Biden's latest Russia sanctions mark new target: the families of Putin's inner circle", "description": "The new US sanctions triggered by Russian's latest actions in Ukraine included targets that in the past have gone untouched: the family members of those in Russian President Vladimir Putin's inner circle.", "url": "https://www.cnn.com/2022/02/23/politics/russian-sanctions-families-putin-inner-circle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221141921-05-putin-address-0221-super-tease.jpg", "publishedAt": "2022-02-23T13:37:40Z", "content": "Washington (CNN)The new US sanctions triggered by Russian's latest actions in Ukraine included targets that in the past have gone untouched: the family members of those in Russian President Vladimir … [+5354 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Paul Hockenos", "title": "Good riddance Nord Stream 2. Now Europe has a golden opportunity", "description": "Nord Stream 2 was always a terrible idea -- it shouldn't have taken the threat of war to finally grind it to a halt, writes Paul Hockenos. Now that Germany has suspended the controversial gas pipeline, Europe has an opportunity to throw off Putin's strangleho…", "url": "https://www.cnn.com/2022/02/23/opinions/nord-stream-2-germany-putin-gas-energy-hockenos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222152934-01-nord-stream-2-hockenos-super-tease.jpg", "publishedAt": "2022-02-23T13:31:15Z", "content": "Paul Hockenos is a Berlin-based writer focusing on renewable energy in Europe. He is the author of four books on European issues, most recently \"Berlin Calling: A Story of Anarchy, Music, the Wall an… [+6158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gumbrecht, CNN", "title": "Time between Pfizer and Moderna Covid-19 vaccines can be up to 8 weeks for some people, updated CDC guidance says", "description": "The interval between first and second doses of the Pfizer and Moderna Covid-19 vaccines may be as long as eight weeks for certain people, the US Centers for Disease Control and Prevention said in vaccine guidance updated on Tuesday.", "url": "https://www.cnn.com/2022/02/23/health/covid-vaccine-interval-cdc-guidance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211026145820-file-us-covid-vaccine-0329-super-tease.jpg", "publishedAt": "2022-02-23T13:04:22Z", "content": "Booster doses continue to be recommended for most people five months after the two-dose primary series of an mRNA vaccine, or two months after a Johnson &amp; Johnson single-dose primary vaccination.… [+241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Charles Riley", "title": "Barclays freezes ex-CEO's $29 million bonus as regulators probe links to Jeffrey Epstein", "description": "Barclays is withholding shares worth as much as $29 million from former CEO Jes Staley, pending the outcome of an investigation by British banking regulators into his relationship with Jeffrey Epstein.", "url": "https://www.cnn.com/2022/02/23/investing/jes-staley-barclays-epstein/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220223063955-jes-staley-davos-01222022-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T12:06:45Z", "content": "Barclays is withholding shares worth as much as $29 million from former CEO Jes Staley, pending the outcome of an investigation by British banking regulators into his relationship with Jeffrey Epstei… [+2733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Carroll, Aaron Cooper, Ray Sanchez", "title": "Former Louisville cop involved in deadly Breonna Taylor raid goes on trial nearly two years after her death", "description": "Breonna Taylor's mother doesn't believe the trial of a former Louisville, Kentucky, police officer involved in the botched raid that left her daughter dead will lead to justice, but she'll be there anyway.", "url": "https://www.cnn.com/2022/02/23/us/brett-hankison-breonna-taylor-raid-trial/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200923184857-hankinson-booking-photo.jpg?q=x_0,y_32,h_1403,w_2494,c_crop/w_800", "publishedAt": "2022-02-23T12:00:20Z", "content": "Breonna Taylors mother doesnt believe the trial of a former Louisville, Kentucky, police officer involved in the botched raid that left her daughter dead will lead to justice, but shell be there anyw… [+5736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown,  CNN", "title": "World's top 10 best beaches for 2022, according to Tripadvisor", "description": "Picture a warm, pristine paradise. White-sand beaches. Turquoise-tinged water clear as gin. And you've got the No. 1 beach in the world for 2022, according to Tripadvisor users.", "url": "https://www.cnn.com/travel/article/tripadvisor-awards-best-beaches-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222231610-01-tripadvisor-top-10-beaches-world-super-tease.jpeg", "publishedAt": "2022-02-23T11:56:07Z", "content": "(CNN) Picture a warm, pristine paradise. White-sand beaches. Turquoise-tinged water clear as gin. And you've got the No. 1 beach in the world for 2022, according to Tripadvisor users.\r\nThe travel pla… [+4349 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for Feb. 23: Ukraine, Arbery, Capitol riot, Covid protests, Uganda", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/02/23/us/five-things-february-23-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223042930-biden-speech-02222022-super-tease.jpg", "publishedAt": "2022-02-23T11:54:31Z", "content": "(CNN)Many people are hyped about the transition away from cars that run on gasoline, but some experts say we should pump the brakes on all the excitement. The US isn't ready for a full switchover to … [+6006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Amy Bass", "title": "Women's soccer settlement is a landmark win for fairness", "description": "Female athletes continue to face opponents on the field and off, constantly told they aren't good enough or strong enough, are dull to watch, celebrate too much when they win, and cry too much when they lose. But a $24 million settlement between the US Women'…", "url": "https://www.cnn.com/2022/02/23/opinions/us-womens-national-team-soccer-settlement-bass/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213163741-u-s-womens-national-soccer-team-0707-super-tease.jpg", "publishedAt": "2022-02-23T11:12:09Z", "content": "Amy Bass (@bassab1) is professor of sport studies at Manhattanville College and the author of \"One Goal: A Coach, a Team, and the Game That Brought a Divided Town Together\" and \"Not the Triumph but t… [+6012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Ahmaud Arbery was gunned down 2 years ago today. Here's what's next after murder and hate crime convictions for his killers", "description": "On February 23, 2020, 25-year-old Ahmaud Arbery went for a run.", "url": "https://www.cnn.com/2022/02/23/us/ahmaud-arbery-killing-whats-next-second-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211124135108-arbery-defendants-mcmichael-bryan-split-super-tease.jpg", "publishedAt": "2022-02-23T10:59:39Z", "content": "(CNN)On February 23, 2020, 25-year-old Ahmaud Arbery went for a run.\r\nJogging through a neighborhood outside Brunswick in southern Georgia, two White men saw Arbery, who was Black, and chased after h… [+4036 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street", "title": "The couple who met at the top of the Eiffel Tower", "description": "American Dan Giedeman happened upon Swiss visitor Esther Wieland at the top of the Eiffel Tower in September 1998. An afternoon wandering the city together sparked a cross-continental romance.", "url": "https://www.cnn.com/travel/article/chance-encounters-eiffel-tower-romance/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220216133436-20220217-chance-ecounters-paris.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T09:51:32Z", "content": "American graduate student Dan Giedeman spent much of his first trip to Paris inside a conference room.\r\nIt was September 1998 and Dan, then 27, was studying for a doctorate in economics at Washington… [+16321 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell and Aya Elamroussi, CNN", "title": "Anti-Semitic flyers left on driveways in Texas city where worshipers were held hostage in a synagogue last month", "description": "A hate crime investigation is underway in the Texas city of Colleyville, where worshipers were held hostage in a synagogue last month, after anti-Semitic and White separatist flyers sealed in clear sandwich bags were left in driveways, authorities said.", "url": "https://www.cnn.com/2022/02/23/us/anti-semitic-flyers-colleyville-texas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223025756-colleyville-anti-semitic-flyers-super-tease.jpeg", "publishedAt": "2022-02-23T08:39:49Z", "content": "(CNN)A hate crime investigation is underway in the Texas city of Colleyville, where worshipers were held hostage in a synagogue last month, after anti-Semitic and White separatist flyers sealed in cl… [+2649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Simone McCarthy, CNN", "title": "China's leaders may be watching Ukraine with an eye on Taiwan", "description": "As the world's attention focuses on the escalating crisis between Russia and Ukraine, a spotlight has also been turned on an island halfway around the world -- self-governing Taiwan.", "url": "https://www.cnn.com/2022/02/23/china/taiwan-ukraine-parallels-china-russia-intl-hnk-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222231624-taiwan-national-day-celebration-092821-restricted-super-tease.jpg", "publishedAt": "2022-02-23T08:13:19Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+7047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, Julia Jones and Omar Jimenez, CNN", "title": "Jury deliberations are set to begin in trial of 3 former officers involved in the killing of George Floyd", "description": "Jury deliberations are due to begin Wednesday in the federal civil rights trial of three former Minneapolis police officers charged in the 2020 death of George Floyd.", "url": "https://www.cnn.com/2022/02/23/us/george-floyd-civil-rights-trial-jury-deliberations-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305114627-kueng-lane-thao-split-super-tease.jpg", "publishedAt": "2022-02-23T07:03:19Z", "content": "(CNN)Jury deliberations are due to begin Wednesday in the federal civil rights trial of three former Minneapolis police officers charged in the 2020 death of George Floyd. \r\nThe ex-officers -- Tou Th… [+5792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez", "title": "Wildfires are getting more extreme and burning more land. The UN says it's time to 'learn to live with fire'", "description": "Wildfires are increasing in severity and frequency, and a new UN report suggests it's time we adapt to it.", "url": "https://www.cnn.com/2022/02/23/world/wildfire-increase-climate-change-unep-report/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222174129-01-unep-wildfires-climate-arctic.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T06:47:46Z", "content": "Wildfires have intensified around the globe, providing a stark reminder of how the climate crisis is upending lives and inflicting billions of dollars a year in damage. And it will only get worse, ac… [+6254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Henderson and Michelle Watson, CNN", "title": "Suspect in deadly shooting during weekend protest in Portland faces several charges, including murder", "description": "The suspect in a weekend shooting that left one woman dead and four people wounded during a protest in Portland, Oregon, faces several charges, including murder, prosecutors said Tuesday.", "url": "https://www.cnn.com/2022/02/23/us/portland-shooting-suspect-charged/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220220074323-01-portland-shooting-021922-super-tease.jpg", "publishedAt": "2022-02-23T05:20:02Z", "content": "(CNN)The suspect in a weekend shooting that left one woman dead and four people wounded during a protest in Portland, Oregon, faces several charges, including murder, prosecutors said Tuesday. \r\nThe … [+2356 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "The latest on the Ukraine-Russia crisis", "description": "Tensions between Moscow and Kyiv are at their highest in years, US President Biden announced a new round of sanctions following Russian President Putin recognizing two separatist pro-Moscow regions in Ukraine as independent. Follow here for the latest updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-news-02-23-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222174130-04-biden-0222-super-tease.jpg", "publishedAt": "2022-02-23T05:16:30Z", "content": "After months of military buildup and brinkmanship, US President Joe Biden on Tuesday described Russia's movements in Ukraine as \"the beginning of a Russian invasion.\" \r\nHere's what you need to know:\r… [+1909 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "US sees recent rise in maternal deaths -- and ongoing inequities, CDC report shows", "description": "There has been a slight rise in the number of women dying due to pregnancy or childbirth each year in the United States, and the maternal death rate among Black women is still three times the rate for White women, a new federal report shows.", "url": "https://www.cnn.com/2022/02/23/health/maternal-deaths-increase-us-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190328115341-pregnant-woman-stock-super-tease.jpg", "publishedAt": "2022-02-23T05:01:38Z", "content": "(CNN)There has been a slight rise in the number of women dying due to pregnancy or childbirth each year in the United States, and the maternal death rate among Black women is still three times the ra… [+3525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, <a href=\"/profiles/brad-lendon\">Brad Lendon</a>, Rob Picheta and Jeevan Ravindran, CNN", "title": "Russian envoy to US claims sanctions will hurt global markets and 'ordinary Americans'", "description": "Tensions between Moscow and Kyiv are at their highest in years, with Russian President Vladimir Putin signing decrees recognizing two separatist pro-Moscow regions in Ukraine as independent, a provocative move as fears of an invasion mount. Follow here for th…", "url": "https://edition.cnn.com/europe/live-news/ukraine-russia-news-02-22-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219155232-zelensky-putin-0219-split-super-tease.jpg", "publishedAt": "2022-02-23T05:00:00Z", "content": "Minutes after US President Joe Biden announced new sanctions on Russian banks and elites Tuesday, a senior FBI cyber official asked US businesses and local governments to be mindful of the potential … [+3497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "Ex-chief financial officer of Trump Organization asks judge to dismiss indictment", "description": "Allen Weisselberg, the former chief financial officer of the Trump Organization, has asked a judge to dismiss the tax fraud indictment against him, saying it violates the immunity he was given in the federal investigation into Michael Cohen, a former personal…", "url": "https://www.cnn.com/2022/02/22/politics/allen-weisselberg-trump-organization-seeks-dismissal-indictment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222215622-allen-weisselberg-court-0920-restricted-super-tease.jpg", "publishedAt": "2022-02-23T03:37:54Z", "content": "(CNN)Allen Weisselberg, the former chief financial officer of the Trump Organization, has asked a judge to dismiss the tax fraud indictment against him, saying it violates the immunity he was given i… [+2914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju, Alex Rogers, Ali Zaslav", "title": "Republican rivals attack Greitens on sex scandal as former governor remains defiant", "description": "The Missouri Senate Republican race officially began on Tuesday, as the candidates filed their campaigns and quickly aimed their sights on former governor Eric Greitens, the apparent frontrunner who resigned in 2018 amid a sex scandal.", "url": "https://www.cnn.com/2022/02/22/politics/missouri-senate-gop-primary/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222172947-eric-greitens-2018.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T02:15:21Z", "content": "Jefferson City, MissouriCNN\r\n —  \r\nThe Missouri Senate Republican race officially began on Tuesday, as the candidates filed their campaigns and quickly aimed their sights on former Gov. Eric Greitens… [+10223 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Close, CNN", "title": "Golfer Phil Mickelson apologizes for comments over reported Saudi-backed tour while saying they were off the record", "description": "Six-time golf major winner Phil Mickelson said Tuesday that recent comments he made regarding a reported breakaway golf tour were off the record -- a claim the reporter who interviewed him has denied -- and said they were shared out of context and without his…", "url": "https://www.cnn.com/2022/02/22/golf/golfer-phil-mickelson-apology-super-league-comments-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222164709-mickelson-0205-super-tease.jpg", "publishedAt": "2022-02-23T02:07:46Z", "content": "(CNN)Six-time golf major winner Phil Mickelson said Tuesday that recent comments he made regarding a reported breakaway golf tour were off the record -- a claim the reporter who interviewed him has d… [+2573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "US officials tell businesses to watch for potential ransomware attacks after Biden announces Russia sanctions", "description": "Minutes after President Joe Biden announced new sanctions on Russian banks and elites on Tuesday, a senior FBI cyber official asked US businesses and local governments to be mindful of the potential for ransomware attacks as the crisis between the Kremlin and…", "url": "https://www.cnn.com/2022/02/22/politics/russia-sanctions-fbi-cyber-threats-ransomware/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222174130-04-biden-0222-super-tease.jpg", "publishedAt": "2022-02-23T01:58:33Z", "content": "(CNN)Minutes after President Joe Biden announced new sanctions on Russian banks and elites on Tuesday, a senior FBI cyber official asked US businesses and local governments to be mindful of the poten… [+3481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Somebody needs to give Putin a history lesson", "description": "David Andelman unpacks Putin's rambling speech that veered into a bizarre history lesson. The Russian President's recognition of territories in the Donbas region are a pretext to war -- but also an example of his crude manipulation of history to push his geop…", "url": "https://www.cnn.com/2022/02/22/opinions/putin-history-lesson-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221144241-03-putin-address-0221-super-tease.jpg", "publishedAt": "2022-02-23T01:49:17Z", "content": "David A. Andelman is a CNN contributor and two-time winner of the Deadline Club Award. He is a chevalier of the French Legion of Honor and author of \"A Red Line in the Sand: Diplomacy, Strategy, and … [+8041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Ukrainian foreign minister: 'No sanctions will be enough' until Russian forces leave Ukraine", "description": "Ukraine's foreign minister on Tuesday said that \"no sanctions will be enough\" until Russian forces leave Ukraine, a day after Russian President Vladimir Putin recognized two separatist regions in the country as independent and announced he would deploy \"peace…", "url": "https://www.cnn.com/2022/02/22/politics/ukraine-foreign-minister-dmytro-kuleba-russia-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222153436-ukraines-foreign-minister-dmytro-kuleba-0222-preser-super-tease.jpg", "publishedAt": "2022-02-23T01:39:06Z", "content": "Washington (CNN)Ukraine's foreign minister on Tuesday said that \"no sanctions will be enough\" until Russian forces leave Ukraine, a day after Russian President Vladimir Putin recognized two separatis… [+2641 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liam Reilly", "title": "Bronx man indicted for hate crimes after allegedly punching Hispanic woman in face and yelling anti-Hispanic slurs, Brooklyn DA says", "description": "A Bronx man was indicted for hate crimes Tuesday after he allegedly assaulted a woman and yelled anti-Hispanic slurs at her, according to prosecutors.", "url": "https://www.cnn.com/2022/02/22/us/bronx-man-indicted-hate-crimes/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222170015-eric-gonzalez-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T01:34:07Z", "content": "A Bronx man was indicted for hate crimes Tuesday after he allegedly assaulted a woman and yelled anti-Hispanic slurs at her, according to prosecutors.\r\nThe victim, a 72-year-old woman, was allegedly … [+1586 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jill Filipovic", "title": "Enough shocking stories about Ginni Thomas. It's time for some action", "description": "The biggest threat to the legitimacy of the United States Supreme Court is not its potential expansion, its Ginni and Clarence Thomas, writes Jill Filipovic. Congress needs to step up and make sure that all judges in America, no matter how powerful, are not a…", "url": "https://www.cnn.com/2022/02/22/opinions/ginni-thomas-clarence-thomas-supreme-court-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222161442-clarence-thomas-virginia-thomas-2021-file-super-tease.jpg", "publishedAt": "2022-02-23T00:36:44Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6626 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Smart, CNN", "title": "His mother promised him $1,800 when he turned 18 -- if he stayed off social media for 6 years", "description": "Lorna Goldstrand Klefsaas challenged her 12-year-old son, Sivert, to stay off social media until he was 18. If he completed the challenge, she'd award him with $1,800 on his eighteenth birthday.", "url": "https://www.cnn.com/2022/02/22/us/mom-pays-son-for-staying-off-social-media-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222173522-01-mom-pays-son-staying-off-social-super-tease.jpg", "publishedAt": "2022-02-23T00:13:45Z", "content": "(CNN)If someone said they'd pay you $1,800 to stay off social media for six years, would you do it? Could you?\r\nSivert Klefsaas did just that.\r\n\"I thought it was awesome,\" Sivert told CNN Tuesday, \"I… [+3006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "Get up to speed: Russia faces sanctions for 'beginning' invasion", "description": "Europe and the US announced tough new sanctions meant to isolate Russia from the Western banking system, cut off some of its natural gas market and punish Russian oligarchs who could have sway with Russian President Vladimir Putin.", "url": "https://www.cnn.com/2022/02/22/politics/russia-ukraine-invasion-putin-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222143436-02-biden-ukraine-0222.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-23T00:07:37Z", "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here. \r\nThis is happening.\r\nRussian President Vladimir Putin has defied the West, recognize… [+7361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, Donald Judd", "title": "Biden pledges to use 'every tool at our disposal' to limit gas price hikes after imposing new sanctions on Russia", "description": "President Joe Biden on Tuesday pledged that his administration is using \"every tool at our disposal\" to limit the effect on gas prices in the US of sanctions he announced against Russia, acknowledging that Americans will likely see rising prices at the pump i…", "url": "https://www.cnn.com/2022/02/22/politics/biden-gas-prices-russia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222174130-04-biden-0222.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T23:43:14Z", "content": "President Joe Biden on Tuesday pledged that his administration is using every tool at our disposal to limit the effect on gas prices in the US of sanctions he announced against Russia, acknowledging … [+5505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "E. Jean Carroll no longer seeks Trump's deposition in defamation lawsuit", "description": "Lawyers for E. Jean Carroll are no longer are seeking to depose former President Donald Trump in their defamation lawsuit, saying doing so would cause too much delay.", "url": "https://www.cnn.com/2022/02/22/politics/e-jean-carroll-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190716072234-e-jean-carroll-new-day-071619-super-tease.jpg", "publishedAt": "2022-02-22T23:00:27Z", "content": "New York (CNN)Lawyers for E. Jean Carroll are no longer are seeking to depose former President Donald Trump in their defamation lawsuit, saying doing so would cause too much delay.\r\nRoberta Kaplan, w… [+2904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew", "title": "Mark Lanegan, Screaming Trees frontman and grunge innovator, dies at 57", "description": "Lanegan, who also appeared on records with Queens of the Stone Age and also released a number of solo albums, was a pioneering member of Seattle's grunge music scene.", "url": "https://www.cnn.com/2022/02/22/entertainment/mark-lanegan-death-screaming-trees-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222161127-mark-lanegan-file-2019-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T22:41:54Z", "content": "Mark Lanegan, a pioneering vocalist of Seattles grunge music scene known for helming Screaming Trees, has died, his family and friends confirmed on his verified Twitter account. He was 57. \r\nA cause … [+3086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "People with Covid-19 may face long-term cardiovascular complications, study says", "description": "As the Covid-19 pandemic enters its third year, scientists are finding that the coronavirus has far-reaching effects on health beyond the acute phase of illness. One recent study has found that people with Covid-19 are at an increased risk for cardiovascular …", "url": "https://www.cnn.com/2022/02/22/health/covid-cardiovascular-complications/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222172539-ekg-machine-stock-super-tease.jpg", "publishedAt": "2022-02-22T22:30:04Z", "content": "(CNN)As the Covid-19 pandemic enters its third year, scientists are finding that the coronavirus has far-reaching effects on health beyond the acute phase of illness. One recent study has found that … [+6618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Jennifer Hansler", "title": "Blinken says meeting with Lavrov is off", "description": "US Secretary of State Antony Blinken will no longer meet with Russian Foreign Minister Sergey Lavrov in Geneva this week, he announced Tuesday, in the latest sign that diplomatic avenues with Russia over Ukraine are quickly closing.", "url": "https://www.cnn.com/2022/02/22/politics/blinken-cancels-lavrov-meeting/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220212090149-antony-blinken-0211.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T21:57:49Z", "content": "US Secretary of State Antony Blinken will no longer meet with Russian Foreign Minister Sergey Lavrov in Geneva this week, he announced Tuesday, in the latest sign that diplomatic avenues with Russia … [+1492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown and Marnie Hunter, CNN", "title": "CDC adds multicultural Asian favorite to its list of highest risk destinations", "description": "The US Centers for Disease Control and Prevention packed in another four entries to its growing list of highest-risk destinations for Covid-19 on Tuesday, including multicultural Malaysia.", "url": "https://www.cnn.com/travel/article/cdc-very-high-risk-travel-destinations-february-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222163850-kuala-lumpur-night-super-tease.jpg", "publishedAt": "2022-02-22T21:47:25Z", "content": "(CNN) The US Centers for Disease Control and Prevention packed in another four entries to its growing list of highest-risk destinations for travel on Tuesday, including multicultural Malaysia.\r\nThe C… [+6967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz", "title": "IRS now lets taxpayers opt out of facial recognition after backlash", "description": "The Internal Revenue Service will continue using controversial facial recognition software for the rest of the current tax-filing season to verify taxpayers' identities before they can log on to its website. But after facing a backlash, the agency is now offe…", "url": "https://www.cnn.com/2022/02/22/tech/irs-facial-recognition-opt-out/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220127144005-restricted-us-internal-revenue-service-website.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T21:37:23Z", "content": "The Internal Revenue Servicewill continue using controversial facial recognition software for the rest of the current tax-filing season to verify taxpayers identities before they can log on to its we… [+3060 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, Geneva Sands and Gabe Cohen, CNN", "title": "Defense Department considers request for National Guard as law enforcement prepares for possible trucker convoys in DC", "description": "The Department of Defense is considering a request for the District of Columbia National Guard to assist law enforcement agencies in Washington, DC, that are preparing for convoys to descend on the area, even as plans for a Canada-style trucker protest in the…", "url": "https://www.cnn.com/2022/02/22/politics/washington-dc-national-guard-trucker-convoy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216173020-05-canada-trucker-protests-0215-super-tease.jpg", "publishedAt": "2022-02-22T21:37:00Z", "content": "(CNN)The Department of Defense is considering a request for the District of Columbia National Guard to assist law enforcement agencies in Washington, DC, that are preparing for convoys to descend on … [+3091 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Here are the key players in the trial of the former Louisville police officer connected to Breonna Taylor's killing", "description": "No officers who took part in the raid of Breonna Taylor's apartment nearly two years ago have been charged for her death but a former Louisville Metro Police Department officer is standing trial on charges for his actions during that day. Here's a look at the…", "url": "https://www.cnn.com/2022/02/22/us/officers-involved-in-breonna-taylor-case/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221194641-brett-hankison-court-020822-file-super-tease.jpg", "publishedAt": "2022-02-22T19:53:56Z", "content": "(CNN)Nearly two years after a botched police raid led to Breonna Taylor's death, the only officer facing criminal charges for his actions on that day is standing trial in Kentucky.\r\nBrett Hankison, a… [+8588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco", "title": "Finalists -- and their stirring images -- revealed in Sony World Photography Awards professional contest", "description": "Striking images showing the aftermath of wildfires, evocative portraits of bushmeat hunters and some of the most indelible shots from the US Capitol riot are among the works that will determine the 2022 Sony World Photography Awards Photographer of the Year.", "url": "https://www.cnn.com/style/article/sony-awards-photography-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222173251-sony-photography-awards-16-super-tease.jpg", "publishedAt": "2022-02-22T19:10:26Z", "content": "artsPublished 22nd February 2022\r\nStriking images showing the aftermath of wildfires, evocative portraits of bushmeat hunters and some of the most indelible shots from the US Capitol riot are among t… [+3318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Daniel Treisman", "title": "Opinion: Putin isn't likely to stop here", "description": "The challenge for the West could not be clearer. If Putin succeeds in undermining Ukraine, he is unlikely to stop there. Our policy must raise the cost of eroding the international order, writes Daniel Treisman", "url": "https://www.cnn.com/2022/02/22/opinions/putin-russia-ukraine-plan-donbas-treisman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222151856-01-putin-eastern-ukraine-russia-destiny-super-tease.jpg", "publishedAt": "2022-02-22T19:02:58Z", "content": "Daniel Treisman is a professor of political science at UCLA, a fellow at the Center for Advanced Research in the Behavioral Sciences at Stanford, and the co-author of \"Spin Dictators: The Changing Fa… [+5599 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Killough, CNN", "title": "8 Austin police officers charged after investigation into 2020 George Floyd protests are released on $1 bond, lawyers say", "description": "A prosecutor said many of the protesters injured by officers were innocent bystanders. But the officers' attorneys said seven of their eight clients were injured during clashes with protesters and that their use of bean bag rounds were authorized.", "url": "https://www.cnn.com/2022/02/22/us/austin-police-officers-george-floyd-protests/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222120110-02-austin-police-protest-060420-file-super-tease.jpg", "publishedAt": "2022-02-22T18:43:28Z", "content": "Dallas (CNN)Eight Austin police officers indicted for their actions during the 2020 George Floyd protests and riots have been released on a $1 cash deposit bond each -- with no additional bond condit… [+791 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David Daley", "title": "Politicians are stripping Black voters of their voice in Congress", "description": "David Daley writes that extreme gerrymandering and racial discrimination have long gone hand in hand, but the current redistricting cycle has turbocharged representational inequality in many states, largely those controlled by Republicans -- even as minority …", "url": "https://www.cnn.com/2022/02/22/opinions/racial-gerrymandering-census-alabama-daley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216125109-alabama-redistricting-2021-file-super-tease.jpg", "publishedAt": "2022-02-22T18:27:55Z", "content": "David Daley is the author of \"Ratf**ked: Why Your Vote Doesn't Count\" and \"Unrigged: How Americans Are Battling Back to Save Democracy.\" His work has appeared in the New Yorker, New York Times, Atlan… [+7987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joan Biskupic", "title": "How presidential interviews can make or break a Supreme Court nomination", "description": "He has read their cases. He knows their records. And now President Joe Biden has begun the last stage for selection of a new Supreme Court justice: the interview.", "url": "https://www.cnn.com/2022/02/22/politics/biden-supreme-court-nominee-interview/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222120440-rbg-clinton-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T18:08:00Z", "content": "He has read their cases. He knows their records. And now President Joe Biden has begun the last stage for selection of a new Supreme Court justice: the interview. \r\nFor possible nominees, this can be… [+8279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Watson", "title": "2 Blackhawk helicopters crash in training accident, Utah National Guard says", "description": "Two Utah National Guard UH-60 Blackhawk helicopters were involved in a training accident Tuesday morning, the Utah National Guard tweeted.", "url": "https://www.cnn.com/2022/02/22/us/blackhawk-helicopters-crash-utah/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222130205-blackhawk-helicopters-crash-utah-0222.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T17:58:46Z", "content": "Two Utah National Guard UH-60 Blackhawk helicopters were involved in a training accident Tuesday morning, the Utah National Guard tweeted. \r\nNo crew members were injured, the tweet said. \r\nBoth helic… [+167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, Tamara Qiblawi and Nada Bashir, CNN", "title": "Western nations scramble response after Putin orders troops into pro-Russian regions of eastern Ukraine", "description": "The threat of a full-scale war weighed heavy in Europe on Tuesday as the international community scrambled to finalize sanctions and further rounds of diplomacy following Russian President Vladimir Putin's decision to order troops into separatist-held parts o…", "url": "https://www.cnn.com/2022/02/22/europe/russia-ukraine-tensions-tuesday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222120558-03-russia-ukraine-tensions-tuesday-intl-super-tease.jpg", "publishedAt": "2022-02-22T17:28:53Z", "content": "(CNN)The threat of a full-scale war weighed heavy in Europe on Tuesday as the international community scrambled to finalize sanctions and further rounds of diplomacy following Russian President Vladi… [+6421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Slack welcomes users back to work with an outage", "description": "Slack went down for many users Tuesday morning, throwing off companies that rely on the popular workplace communication platform just as workers returned from the extended holiday weekend.", "url": "https://www.cnn.com/2022/02/22/tech/slack-outage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222104644-slack-laptop-stock-super-tease.jpeg", "publishedAt": "2022-02-22T17:18:20Z", "content": "New York (CNN Business)Slack went down for many users Tuesday morning, throwing off companies that rely on the popular workplace communication platform just as workers returned from the extended holi… [+1446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "How a battery shortage could threaten US national security", "description": "Bob Galyen has spent his career building electric car batteries. And he thinks the United States has a problem.", "url": "https://www.cnn.com/2022/02/22/cars/electric-vehicle-battery-supply-chain/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221103217-20220221-ev-batteries-natsec-illustration-super-tease.jpg", "publishedAt": "2022-02-22T17:15:35Z", "content": "By Matt McFarland, CNN Business\r\nUpdated 12:15 PM ET, Tue February 22, 2022\r\nWashington, DC (CNN)Bob Galyen has spent his career building electric car batteries. And he thinks the United States has a… [+9123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Debunking a 'totally nuts' conspiracy theory about UN troops in Canada", "description": "Tanya Vrebosch, deputy mayor of the Canadian city of North Bay, saw something strange when she checked her phone on Sunday: North Bay was a trending topic on her Twitter feed.", "url": "https://www.cnn.com/2022/02/22/politics/fact-check-un-north-bay-ottawa-trudeau/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219163715-01-canada-protest-0219-super-tease.jpg", "publishedAt": "2022-02-22T17:07:16Z", "content": "Washington (CNN)Tanya Vrebosch, deputy mayor of the Canadian city of North Bay, saw something strange when she checked her phone on Sunday: North Bay was a trending topic on her Twitter feed.\r\nNorth … [+4297 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Here's the real truth about Donald Trump's Truth Social app", "description": "Donald Trump's Truth Social, his social media app aimed at taking on Twitter, launched on Monday. So, I decided to get in on the action -- setting up my own account so I could see what it was all about.", "url": "https://www.cnn.com/2022/02/22/politics/donald-trump-truth-social-media-app/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221072928-truth-social-app-stock-super-tease.jpg", "publishedAt": "2022-02-22T16:31:08Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue", "title": "Sonia Sotomayor returns to Supreme Court bench as the only justice wearing a mask", "description": "Justice Sonia Sotomayor was back on the bench for oral arguments at the Supreme Court on Tuesday after participating remotely during the court's January sitting that came during a surge in Covid-19 cases due to the Omicron variant.", "url": "https://www.cnn.com/2022/02/22/politics/sotomayor-mask/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210219165313-01-justice-sonia-sotomayor-0120.jpg?q=x_521,y_277,h_1081,w_1921,c_crop/w_800", "publishedAt": "2022-02-22T16:12:55Z", "content": "Justice Sonia Sotomayor was back on the bench for oral arguments at the Supreme Court on Tuesday after participating remotely during the courts January sitting that came during a surge in Covid-19 ca… [+1702 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Barber", "title": "You should be eating citrus this month", "description": "Who else needs a pick-me-up as we move through the last few weeks of winter? While a beach vacation might not be possible for everyone, you can always get a taste of sunny weather in the form of citrus.", "url": "https://www.cnn.com/2022/02/22/health/citrus-winter-recipes-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220216121543-04-citrus-winter-recipes-wellness.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-22T16:10:06Z", "content": "Editors Note: This month, food writer Casey Barber thinks its time to eat winter citrus. Stay tuned for her March recipe selection, and for all the months that follow. \r\nWho else needs a pick-me-up a… [+5677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Omicron continued to disrupt work and families' lives even as Covid-19 cases dropped", "description": "Some 7.8 million people pointed to Covid-19 symptoms as the reason they were not at their jobs, according to the latest US Census Bureau Household Pulse Survey, conducted between January 26 and February 7.", "url": "https://www.cnn.com/2022/02/22/politics/omicron-covid-pandemic-disruptions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221103033-nyc-pedestrians-0216-super-tease.jpg", "publishedAt": "2022-02-22T16:08:45Z", "content": "(CNN)Millions of Americans remained out of work because they or a loved one were sick with coronavirussymptoms in late January and early February, even as the number of cases of the Omicron variant o… [+2786 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Cillizza: How rich is Trump, really?", "description": "Former President Donald Trump is notorious for exaggerating how much he's worth. The debate over how much money he has, and owes, was reignited after news that Mazars, Trump's former accounting firm, distanced itself from the veracity of his financial stateme…", "url": "https://www.cnn.com/videos/business/2022/02/22/how-rich-is-trump-cillizza-the-point-orig.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222090003-the-point-trump-rich-super-tease.jpg", "publishedAt": "2022-02-22T16:06:46Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Couples across the country tie the knot on once-in-a-lifetime 'Twosday'", "description": "February 22, 2022 is a palindrome, which means the date reads the same forward and backward. This year it also falls on a Tuesday, which is now referred to as \"Twosday,\" and some couples are taking advantage of the special date.", "url": "https://www.cnn.com/videos/us/2022/02/22/2-22-2022-twosday-palindrome-couples-wedding-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222104557-wedding-rings-hands-super-tease.jpg", "publishedAt": "2022-02-22T16:02:27Z", "content": "Morning Express with Robin Meade"}]}