{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Italy crowned European champion after beating England on penalties", "description": "On a night fraught with tension and hope, Italy clinched its first major title for 15 years with a penalty shootout win over England in the Euro 2020 final at Wembley Stadium.", "url": "https://edition.cnn.com/2021/07/11/football/england-italy-euro-2020-final-wembley-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711180546-20-euro-2020-finals-england-italy-0711-super-tease.jpg", "publishedAt": "2021-07-11T21:59:12Z", "content": "Wembley Stadium, London (CNN)On a night fraught with tension and hope, Italy clinched its first major title for 15 years with a penalty shootout win over England in the Euro 2020 final at Wembley Sta… [+1871 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Raymond Joseph", "title": "Covid has South Africa by the throat. How I dodged its scary grip", "description": "South African journalist Raymond Joseph shares his experience of being infected six weeks after being vaccinated and how the shot may have saved his life in a country where the health services are buckling, vaccine access is limited and the population is in s…", "url": "https://www.cnn.com/2021/07/11/opinions/south-africa-delta-variant-covid-surge-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708131416-south-africa-covid-hosptial-0621-super-tease.jpg", "publishedAt": "2021-07-11T21:27:56Z", "content": "Raymond Joseph (@rayjoe) is a freelance journalist living and working in Cape Town. The views expressed in this commentary are his own. View more opinion at CNN.\r\n (CNN)As an acute asthma sufferer, w… [+9172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "This restaurant owner spends his free time fixing old cars and donating them to people in need", "description": "When Eliot Middleton was a little boy, he followed his father around everywhere, watching the talented mechanic carefully fix car after car.", "url": "https://www.cnn.com/2021/07/11/us/eliot-middleton-mechanic-fix-donates-cars-bbq-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710210606-01-eliot-middleton-mechanic-fix-donates-cars-bbq-super-tease.jpg", "publishedAt": "2021-07-11T21:17:34Z", "content": "(CNN)When Eliot Middleton was a little boy, he followed his father around everywhere, watching the talented mechanic carefully fix car after car.\r\nLess than a year after his death, Middleton, 38, now… [+7384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Key Watergate figure: I would pay to handle Trump's deposition", "description": "In an interview with Bill O'Reilly, Trump said he would sit for a deposition in his lawsuit against Facebook, Twitter and Google for banning him after the January 6 Capitol insurrection. CNN's Jim Acosta and former Nixon White House counsel John Dean discuss.", "url": "https://www.cnn.com/videos/business/2021/07/11/trump-big-tech-lawsuit-deposition-john-dean-acosta-nr-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711172051-john-dean-trump-split-super-tease.jpg", "publishedAt": "2021-07-11T21:10:21Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Gregory Lemos and Leslie Perrot, CNN", "title": "4 arrested after cache of weapons found in hotel near upcoming MLB All-Star Game in Denver", "description": "FBI Denver said in a statement they have no reason to believe the incident was a threat to the All-Star Game.", "url": "https://www.cnn.com/2021/07/11/us/denver-arrests-near-mlb-all-star-game/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711152811-01-maven-hotel-denver-arrest-super-tease.jpg", "publishedAt": "2021-07-11T20:03:45Z", "content": "Denver, Colorado (CNN)Four people were arrested Friday after a hotel employee alerted authorities about a cache of weapons inside a room at the Maven Hotel in Denver, Colorado. \r\nThe hotel where the … [+2499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Kristi Noem criticizes GOP governors who enacted Covid-19 mandates while accusing some of rewriting their history", "description": "South Dakota Gov. Kristi Noem questioned the grit and instinct of fellow GOP governors who enacted Covid-19 measures like mask mandates and business closures to stop the spread of the virus in their states last year, warning that some of them are now \"rewriti…", "url": "https://www.cnn.com/2021/07/11/politics/kristi-noem-cpac-south-dakota-governor-covid-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711152015-kristi-noem-cpac-2021-0711-super-tease.jpg", "publishedAt": "2021-07-11T19:43:37Z", "content": "Dallas (CNN)South Dakota Gov. Kristi Noem questioned the grit and instinct of fellow GOP governors who enacted Covid-19 measures like mask mandates and business closures to stop the spread of the vir… [+4133 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "'Legend of Zelda' sells for $870,000 at auction, a record for a video game", "description": "A sealed, rare version of the iconic Nintendo game \"The Legend of Zelda\" sold for $870,000 at auction on Friday, making it the most expensive video game ever sold, according to Heritage Auctions, the auction house that ran the sale.", "url": "https://www.cnn.com/2021/07/11/us/legend-of-zelda-auction-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711124458-restricted-01-legend-of-zelda-auction-trnd-super-tease.jpg", "publishedAt": "2021-07-11T17:20:08Z", "content": "(CNN)A sealed, rare version of the iconic Nintendo game \"The Legend of Zelda\" sold for $870,000 at auction on Friday, making it the most expensive video game ever sold, according to Heritage Auctions… [+1598 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Indigenous people are trekking across the US with a 25-foot totem pole. Here's why", "description": "Their goal during the journey from Washington state to Washington, DC: To protect sacred sites from the existential threats of the climate crisis and extractive industries -- and to ensure tribal nations have a seat at the table when decisions affecting them …", "url": "https://www.cnn.com/2021/07/11/us/totem-pole-journey-lummi-nation-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709105022-01-totem-pole-lummi-nation-210621-super-tease.jpg", "publishedAt": "2021-07-11T16:49:38Z", "content": "(CNN)For the House of Tears Carvers, totem poles are more than masterful works of art -- they're a medium for storytelling, for raising consciousness, for healing. \r\nThe group of artisans from the Lu… [+7070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chauncey Alcorn, CNN Business", "title": "Black-owned restaurants are finding a lifeline in food trucks and ghost kitchens", "description": "As business dried up during Covid-19 lockdowns last year, many restaurants fell behind on rent and had to lay off employees. That was especially true for Black-owned restaurants, which struggled to gain access to emergency capital early on.", "url": "https://www.cnn.com/2021/07/11/business/black-owned-restaurants-ghost-kitchens/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709122104-jasmine-brown-food-truck-restricted-super-tease.jpg", "publishedAt": "2021-07-11T16:38:50Z", "content": "New York (CNN)As business dried up during Covid-19 lockdowns last year, many restaurants fell behind on rent and had to lay off employees. That was especially true for Black-owned restaurants, which … [+5234 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz and Veronica Stracqualursi, CNN", "title": "Kinzinger slams GOP colleagues for invoking Nazi-era imagery to criticize Covid vaccination efforts", "description": "Republican Rep. Adam Kinzinger slammed his GOP colleagues, including Reps. Marjorie Taylor Greene and Lauren Boebert, for invoking Nazi-era imagery to mock President Joe Biden's latest Covid-19 vaccination efforts.", "url": "https://www.cnn.com/2021/07/11/politics/kinzinger-marjorie-taylor-greene-covid-sotu-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711103306-screengrab-adam-kinzinger-cnn-07-11-2021-super-tease.jpg", "publishedAt": "2021-07-11T15:53:14Z", "content": "(CNN)Republican Rep. Adam Kinzinger slammed his GOP colleagues, including Reps. Marjorie Taylor Greene and Lauren Boebert, for invoking Nazi-era imagery to mock President Joe Biden's latest Covid-19 … [+2488 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles Business", "title": "Virgin Galactic founder Richard Branson successfully rockets to outer space", "description": "Richard Branson became the first person to ride into space aboard a rocket he helped fund. The supersonic space plane developed by his company, Virgin Galactic, roared into the sky over New Mexico early Sunday, carrying Branson and three fellow crewmembers.", "url": "https://www.cnn.com/2021/07/11/tech/richard-branson-virgin-galactic-space-flight-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711113704-03-branson-space-flight-screengrab-super-tease.jpg", "publishedAt": "2021-07-11T15:51:50Z", "content": "Truth or Consequences, New Mexico (CNN Business)Richard Branson became the first person to ride into space aboard a rocket he helped fund. The supersonic space plane developed by his company, Virgin … [+5510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Adams says Democratic lawmakers 'misplaced' priorities on efforts to curb gun violence", "description": "New York City Democratic Mayoral candidate Eric Adams on Sunday criticized Democrat lawmakers efforts to curb gun violence are \"misplaced\" talks in Congress to overhaul the nation's policing laws continue to stall.", "url": "https://www.cnn.com/2021/07/11/politics/eric-adams-democrats-gun-violence-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711102458-screengrab-eric-adams-cnn-07-11-2021-super-tease.jpg", "publishedAt": "2021-07-11T15:10:47Z", "content": "(CNN)New York City Democratic Mayoral candidate Eric Adams on Sunday criticized Democrat lawmakers efforts to curb gun violence are \"misplaced\" talks in Congress to overhaul the nation's policing law… [+2529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, CNN", "title": "Star UConn guard Paige Bueckers uses ESPYS speech to honor Black women", "description": "Paige Bueckers, the star point guard for the University of Connecticut women's basketball team, was named the best college athlete in women's sports at the 2021 ESPYS on Saturday night and used her acceptance speech to celebrate and honor Black women.", "url": "https://www.cnn.com/2021/07/11/us/paige-bueckers-espys-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711101757-restricted-paige-bueckers-07-10-2021-super-tease.jpg", "publishedAt": "2021-07-11T14:59:51Z", "content": "(CNN)Paige Bueckers, the star point guard for the University of Connecticut women's basketball team, was named the best college athlete in women's sports at the 2021 ESPYS on Saturday night and used … [+1846 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In photos: Richard Branson's historic space flight", "description": "Richard Branson, through his company Virgin Galactic, is set to become the first billionaire to travel to space aboard a spacecraft he helped fund.", "url": "https://www.cnn.com/2021/07/11/us/gallery/richard-branson-space-flight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711101909-07-branson-space-flight-0711-super-tease.jpg", "publishedAt": "2021-07-11T14:49:30Z", "content": "Richard Branson waves to schoolchildren while heading to board the Virgin Galactic rocket-powered space plane at Spaceport America near Truth or Consequences, New Mexico, on Sunday, July 11.\r\nUpdated… [+738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Death toll rises to 90 in Surfside condo collapse", "description": "The death toll in the condo collapse in Surfside, Florida, rose to 90 on Sunday, officials said in a news conference.", "url": "https://www.cnn.com/2021/07/11/us/miami-dade-building-collapse-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710125633-01-surfside-building-collapse-07-10-2021-super-tease.jpg", "publishedAt": "2021-07-11T14:34:04Z", "content": "(CNN)The death toll in the condo collapse in Surfside, Florida, rose to 90 on Sunday, officials said in a news conference. \r\nSeventy-one of the victims have been identified and their next of kin have… [+211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Fauci says Americans who are fully vaccinated do not need booster shots at this time", "description": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that the US government is not yet telling Americans who are fully vaccinated that they need a booster dose of the Covid-19 vaccine, based on the current data…", "url": "https://www.cnn.com/2021/07/11/politics/fauci-booster-shots-sotu-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711094906-dr-anthony-fauci-july-11-2021-screengrab-02-super-tease.jpg", "publishedAt": "2021-07-11T14:33:02Z", "content": "(CNN)Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that the US government is not yet telling Americans who are fully vaccinated that they need … [+2753 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "NFL linebacker Barkevious Mingo arrested on charge of indecency with a child", "description": "The NFL's Atlanta Falcons terminated the contract of linebacker Barkevious Mingo after police in Arlington, Texas, said he was arrested on one count of indecency with a child - sexual contact last week.", "url": "https://www.cnn.com/2021/07/11/us/barkevious-mingo-atlanta-falcons-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711083951-restricted-barkevious-mingo-chicago-bears-01-03-2021-super-tease.jpg", "publishedAt": "2021-07-11T14:02:39Z", "content": "(CNN)The NFL's Atlanta Falcons terminated the contract of linebacker Barkevious Mingo after police in Arlington, Texas, said he was arrested on one count of indecency with a child - sexual contact la… [+1524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ed Lavandera, Chris Boyette and Veronica Stracqualursi, CNN", "title": "Texas man who waited 'over six hours' last Super Tuesday to vote now faces illegal voting charges", "description": "A Texas man who told CNN he waited for \"a lit bit over six hours\" at a polling center in Houston to participate in Super Tuesday last year was arrested and charged this week with two counts of illegal voting.", "url": "https://www.cnn.com/2021/07/11/politics/hervis-rogers-texas-voting-charge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200304140412-hervis-rogers-super-tease.jpg", "publishedAt": "2021-07-11T13:44:52Z", "content": "(CNN)A Texas man who told CNN he waited for \"a lit bit over six hours\" at a polling center in Houston to participate in Super Tuesday last year was arrested and charged this week with two counts of i… [+3273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Start your week smart: Surfside, Haiti, Canada, Bangladesh, Richard Branson", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/07/11/us/five-things-july-11-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710125633-01-surfside-building-collapse-07-10-2021-super-tease.jpg", "publishedAt": "2021-07-11T13:34:41Z", "content": "The first of two daredevil moguls is set for a trip to the final frontier.Richard Branson will strap in for a flight to spacetoday aboard a supersonic plane owned by his company. Nine days later, fel… [+832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Bill Carter, CNN", "title": "Analysis: From 'Friends' to 'Fleabag,' the history of sitcoms is bigger than you think", "description": "After spending much of the past two years working on CNN's documentary series \"History of the Sitcom,\" I think I can finally offer an answer on what defines the genre.", "url": "https://www.cnn.com/2021/07/11/entertainment/history-of-the-sitcom-bill-carter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190305142924-fleabag-phoebe-waller-bridge-super-tease.jpg", "publishedAt": "2021-07-11T13:29:53Z", "content": "Bill Carter is a media analyst for CNN and an executive producer of the CNN Original Series \"History of the Sitcom,\" airing Sundays at 9 p.m. ET/PT. \r\n (CNN)After spending much of the past two years … [+5242 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jane Greenway Carr", "title": "The GOP chooses chaos over everything else", "description": "In \"Hamnet,\" novelist Maggie O'Farrell writes: \"The trick is never to let down your guard.\" Jane Greenway Carr presents CNN Opinion contributors' smartest takes on a week of chaos from the GOP, the blunt truth about Covid vaccination and the Delta variant, wh…", "url": "https://www.cnn.com/2021/07/11/opinions/republicans-choose-chaos-opinion-weekly-column-carr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710190016-01-cpac-2021-0709-super-tease.jpg", "publishedAt": "2021-07-11T13:28:48Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)\"What is given may be taken away at an… [+13349 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jackie-wattles\">Jackie Wattles</a>, <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a> and Mike Hayes, CNN", "title": "Virgin Galactic founder Richard Branson is set to fly in a rocket-powered plane at about 10:30 a.m. ET", "description": "Virgin Galactic founder Richard Branson is set to fly in Virgin's rocket-powered plane today, attempting to become the first billionaire in space. Follow here for the latest.", "url": "https://www.cnn.com/business/live-news/richard-branson-space-flight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708135859-05-virgin-galactic-spaceflight-crew-richard-branson-super-tease.jpg", "publishedAt": "2021-07-11T13:19:34Z", "content": "British billionaire Richard Branson founded Virgin Galactic in 2004, with the aim to offer commercial flights into space. \r\nIt spent nearly two decades to develop a rocket-powered space plane on the … [+1863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "US Treasury Secretary Yellen urges G20 leaders to step up vaccine-sharing support", "description": "US Treasury Secretary Janet Yellen on Sunday urged G20 leaders to step up vaccine-sharing support as the Delta coronavirus variant spreads and countries race to vaccinate as many as possible.", "url": "https://www.cnn.com/2021/07/11/politics/janet-yellen-g20-leaders-vaccine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711082343-janet-yellen-07-11-2021-super-tease.jpg", "publishedAt": "2021-07-11T13:17:07Z", "content": "(CNN)US Treasury Secretary Janet Yellen on Sunday urged G20 leaders to step up vaccine-sharing support as the Delta coronavirus variant spreads and countries race to vaccinate as many as possible. \r\n… [+2206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Concerns about unreported child abuse loom large despite easing Covid restrictions", "description": "Family welfare experts for months have looked to the easing of coronavirus pandemic restrictions as the turning point that would bring clarity about child abuse and neglect rates after a year of unreliable data.", "url": "https://www.cnn.com/2021/07/11/politics/child-abuse-rates-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708164949-pandemic-playground-march-2020-super-tease.jpg", "publishedAt": "2021-07-11T12:01:49Z", "content": "Washington (CNN)Family welfare experts for months have looked to the easing of coronavirus pandemic restrictions as the turning point that would bring clarity about child abuse and neglect rates afte… [+3185 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alanne Orjoux and Aya Elamroussi, CNN", "title": "It's not just about you. Experts say getting vaccinated protects everyone around you", "description": "As the Delta variant of Covid-19 pushes up new infection case counts across the country, public health experts are urging people to get vaccinated -- not just for themselves, but for everyone around them.", "url": "https://www.cnn.com/2021/07/11/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710122828-restricted-pfizer-covid-19-vaccine-boston-06-17-2021-super-tease.jpg", "publishedAt": "2021-07-11T09:34:59Z", "content": "(CNN)As the Delta variant of Covid-19 pushes up new infection case counts across the country, public health experts are urging people to get vaccinated -- not just for themselves, but for everyone ar… [+6361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar, CNN Meteorologist", "title": "How the highly unusual Death Valley temperatures just got more complicated", "description": "California's Death Valley is known to be a hot place, but it hit 130 degrees Fahrenheit (54.4 degrees Celsius) Friday for only the fifth time in recorded history -- that's only five days out of more than 40,000 days on record.", "url": "https://www.cnn.com/2021/07/11/weather/weather-death-valley-heat-record-california-weekend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210617205256-pba-california-super-tease.jpg", "publishedAt": "2021-07-11T09:30:22Z", "content": "Las Vegas, NV had a high of 117°F today (tied all-time record).\r\nYou may be thinking:117°F? My phone/car says it's hotter!\r\nElevation varies a lot across the #LasVegas Valley, so the temperature can … [+141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, Etant Dupain, Stefano Pozzebon, Matt Rivers and Natalie Gallón, CNN", "title": "Haitians hope 'the truth will come out' as foreign investigators probe brutal murder of their President", "description": "Agents from the United States and other nations are joining the criminal inquiry into the assassination of Haiti's President Jovenel Moise following days of dizzying intrigue.", "url": "https://www.cnn.com/2021/07/11/americas/haiti-assassination-investigation-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711031735-03-haiti-assassination-investigation-intl-cmd-super-tease.jpg", "publishedAt": "2021-07-11T08:57:26Z", "content": "Port-au-Prince, Haiti (CNN)Agents from the United States and other nations are joining the criminal inquiry into the assassination of Haiti's President Jovenel Moise following days of dizzying intrig… [+5878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Faith Karimi, CNN", "title": "These twin sisters are college basketball stars and have 3 million TikTok followers. Now they're cashing in", "description": "Twins Hanna and Haley Cavinder, stars on Fresno State's women's basketball team, are early faces of the rule change allowing college athletes to monetize their talents. For the sisters, it all started with TikTok.", "url": "https://www.cnn.com/2021/07/11/us/hanna-haley-cavinder-nil-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709103012-02-haley-hanna-cavinder-file-split-super-169.jpg", "publishedAt": "2021-07-11T08:21:44Z", "content": "Unless you are a huge fan of college hoops or a regular on TikTok, you may not be familiar with Haley and Hanna Cavinder.\r\nBut they are ushering in a new era of college sports.\r\nThe twin sisters, sta… [+5795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Argentina beat Brazil 1-0 to win Copa America", "description": "Argentina won their first major title in 28 years on Saturday and Lionel Messi finally won his first medal in a blue-and-white shirt when an Angel Di Maria goal gave them a 1-0 win over Brazil and a record-equaling 15th Copa America.", "url": "https://edition.cnn.com/2021/07/11/football/copa-america-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711030159-01-copa-america-intl-scli-super-tease.jpg", "publishedAt": "2021-07-11T08:19:27Z", "content": "(CNN) Argentina won their first major title in 28 years on Saturday and Lionel Messi finally won his first medal in a blue-and-white shirt when an Angel Di Maria goal gave them a 1-0 win over Brazil … [+2911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "Colombian ex-soldier's sister responds to Haiti murder plot allegations", "description": "Jenny Capador still cannot believe she will never see her brother again -- and she certainly does not believe that he is an assassin, as officials in two countries have now alleged.", "url": "https://www.cnn.com/2021/07/11/americas/colombian-capador-haiti-cmd-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711023233-colombian-capador-haiti-intl-latam-super-tease.jpg", "publishedAt": "2021-07-11T08:14:56Z", "content": "Bogota, Colombia (CNN)Jenny Capador still cannot believe she will never see her brother again -- and she certainly does not believe that he is an assassin, as officials in two countries have now alle… [+4499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mia Alberti", "title": "Ethiopia's Abiy Ahmed wins election in landslide amid Tigray conflict and voting fraud concerns", "description": "Ethiopian Prime Minister Abiy Ahmed's ruling Prosperity Party (PP) overwhelmingly won general elections Saturday, meaning he will stay in power another term, according to CNN affiliate Nation Media Group.", "url": "https://www.cnn.com/2021/07/11/africa/ethiopia-elections-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711144804-01-abiy-ahmed-super-tease.jpeg", "publishedAt": "2021-07-11T06:56:11Z", "content": "(CNN)Ethiopian Prime Minister Abiy Ahmed's ruling Prosperity Party (PP) overwhelmingly won general elections Saturday, meaning he will stay in power another term, according to CNN affiliate Nation Me… [+1679 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Megan Marples, CNN", "title": "Sharks evolved over millions of years as an apex predator, yet are no match for humans", "description": "Over more than 400 million years, sharks have evolved to glow in the dark, become partially warm-blooded and more, but overfishing is killing off sharks faster than they can reproduce.", "url": "https://www.cnn.com/2021/07/11/us/5-shark-week-facts-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190116013812-hammerheads-super-169.jpg", "publishedAt": "2021-07-11T06:04:11Z", "content": "Sharks have called the Earths oceans home for hundreds ofmillions of years and adapted to thrive in harsh environments.\r\nWhile these top hunters of the deep blue have evolved to survive cold and dark… [+3834 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "7-Eleven Day is canceled again. But you can still get a free Slurpee", "description": "Bad news for Slurpee fans, 7-Eleven Day is canceled for the second year in a row due to the ongoing Covid pandemic. But the good news is you can still get a free Slurpee any day in July.", "url": "https://www.cnn.com/2021/07/11/us/7-eleven-free-slurpee-july-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210613141047-02-7-eleven-free-slurpee-month-trnd-super-tease.jpg", "publishedAt": "2021-07-11T05:56:16Z", "content": "(CNN)Bad news for Slurpee fans: 7-Eleven Day is canceled for the second year in a row. But the good news is you can still get a free Slurpee any day in July.\r\n7-Eleven has celebrated its birthday Jul… [+666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story and photographs by Kara Fox, CNN", "title": "Brexit, shifting demographics and familiar tensions stoke divisions in Northern Ireland", "description": "Niamh Burns is organizing a special 20-year reunion for her schoolmates this year. But while the accomplishments of the \"Courageous Classes of 2001\" are worth celebrating, the date they are commemorating is not.", "url": "https://www.cnn.com/2021/07/11/uk/belfast-northern-ireland-tensions-intl-gbr-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710032041-01-belfast-distinctive-bonfire-youths-super-tease.jpg", "publishedAt": "2021-07-11T04:08:02Z", "content": "Story and photographs by Kara Fox, CNN\r\nUpdated 12:08 AM ET, Sun July 11, 2021\r\nBelfast, Northern Ireland (CNN)Niamh Burns is organizing a special 20-year reunion for her schoolmates this year. But w… [+13661 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston and Sara Murray, CNN", "title": "Trump's false election claims persist at conservative gathering in Texas", "description": "As Texas' battle over voting rights continues to unfold during the special session in Austin, the outrage stoked by former President Donald Trump's false 2020 election claims was still on full display Saturday a few hours north at the major gathering of conse…", "url": "https://www.cnn.com/2021/07/11/politics/trump-cpac-election-claims/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710190016-01-cpac-2021-0709-super-tease.jpg", "publishedAt": "2021-07-11T04:02:50Z", "content": "Dallas (CNN)As Texas' battle over voting rights continues to unfold during the special session in Austin, the outrage stoked by former President Donald Trump's false 2020 election claims was still on… [+6309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Saunders, CNN", "title": "I moved to a tiny Japanese fishing village to experience a disappearing way of life", "description": "Surrounded by mountains on all sides, except for the sea, the tiny fishing village of Ena looks out onto a single lonely island. There's only one shop -- a store that sells fishing equipment, snacks and sake.", "url": "https://www.cnn.com/travel/article/japanese-fishing-village-ena-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709175009-japan-fishing-village-tz-super-tease.jpg", "publishedAt": "2021-07-11T00:44:06Z", "content": "Ena, Japan (CNN) \"Have you seen Mr. Orange Farmer?\" asked my neighbor, in Japanese. \r\nShe was standing at my front door, huddled under a small umbrella in the rain on a Wednesday afternoon. I was in … [+9746 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "It's legal to have sex with a 12-year-old in the Philippines. Activists are trying to change that", "description": "Child sexual abuse is rampant in the Philippines, which activists say is partly driven by the country's low age of consent -- just 12 years old.", "url": "https://www.cnn.com/2021/07/10/asia/philippines-age-of-consent-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630101914-20210630-age-of-consent-gfx-super-tease.jpg", "publishedAt": "2021-07-11T00:19:03Z", "content": "By Jessie Yeung, CNN\r\nUpdated 8:19 PM ET, Sat July 10, 2021\r\n (CNN)Antonnette Acupinpin was 7 when the sexual abuse started. \r\nShe had already endured years of beating and physical violence from her … [+15948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop, CNN", "title": "First African American to win the National Spelling Bee gets offer of full LSU scholarship", "description": "Zaila Avant-garde, the teenager who this week became the first African American to win the Scripps National Spelling Bee, has earned yet another honor: an offer of a full scholarship to Louisiana State University.", "url": "https://www.cnn.com/2021/07/10/us/zaila-avant-garde-lsu-scholarship-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710170218-02-national-spelling-bee-2021-winner-super-tease.jpg", "publishedAt": "2021-07-10T22:42:46Z", "content": "(CNN)Zaila Avant-garde, the teenager who this week became the first African American to win the Scripps National Spelling Bee, has earned yet another honor: an offer of a full scholarship to Louisian… [+797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop, CNN", "title": "First African American to win the National Spelling Bee gets offer of full LSU scholarship", "description": "Zaila Avant-garde, the teenager who this week became the first African American to win the Scripps National Spelling Bee, has earned yet another honor: an offer of a full scholarship to Louisiana State University.", "url": "https://www.cnn.com/2021/07/10/us/zaila-avant-garde-lsu-scholarship-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710170218-02-national-spelling-bee-2021-winner-super-tease.jpg", "publishedAt": "2021-07-10T22:42:46Z", "content": "(CNN)Zaila Avant-garde, the teenager who this week became the first African American to win the Scripps National Spelling Bee, has earned yet another honor: an offer of a full scholarship to Louisian… [+797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Alaa Elassar, CNN", "title": "A crane fell on top of a building in downtown Toronto, causing damage", "description": "A portion of a crane collapsed on top of a building in downtown Toronto, Canada, Sunday afternoon, causing damage to its rooftop.", "url": "https://www.cnn.com/2021/07/10/us/crane-toronto-building-damage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710165842-crane-toronto-building-damage-super-tease.jpg", "publishedAt": "2021-07-10T22:40:48Z", "content": "(CNN)A portion of a crane collapsed on top of a building in downtown Toronto, Canada, Sunday afternoon, causing damage to its rooftop.\r\nThe counterweight, part of the crane meant to prevent it from t… [+1208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza", "title": "The 11 books former President Barack Obama recommends you read this summer", "description": "Former President Barack Obama released his summer reading list on Friday, continuing a tradition from his time in the White House.", "url": "https://www.cnn.com/2021/07/10/politics/obama-summer-reading-list-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710155703-02-barack-obama-file-2020-super-tease.jpg", "publishedAt": "2021-07-10T20:18:03Z", "content": "Washington, DC (CNN)Former President Barack Obama released his summer reading list on Friday, continuing a tradition from his time in the White House.\r\n\"While we were still in the White House, I bega… [+3695 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, CNN", "title": "Barack Obama's 38-song summer playlist includes everyone from J. Cole to Bob Dylan", "description": "It's summertime -- and the 44th President once again has a few tunes for your consideration.", "url": "https://www.cnn.com/2021/07/10/politics/barack-obama-summer-playlist-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710135712-barack-obama-file-2020-super-tease.jpg", "publishedAt": "2021-07-10T20:17:11Z", "content": "With so many folks getting together with family and friends, there's a lot to celebrate this summer. Here's a playlist of songs I've been listening to latelyit's a mix of old and new, household names… [+121 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, CNN", "title": "No pressure: Queen Elizabeth sends 'good wishes' to Gareth Southgate ahead of the Euro 2020 final", "description": "Queen Elizabeth II sent a message of support to England national football team manager Gareth Southgate on Saturday, the evening before England's showdown with Italy at Wembley Stadium in London.", "url": "https://edition.cnn.com/2021/07/10/football/gareth-southgate-queen-elizabeth-euro-2020-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710152951-gareth-southgate-queen-elizabeth-split-super-tease.jpg", "publishedAt": "2021-07-10T20:15:19Z", "content": "London (CNN)Queen Elizabeth II sent a message of support to England national football team manager Gareth Southgate on Saturday, the evening before England's showdown with Italy at Wembley Stadium in… [+1116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peggy Drexler", "title": "How Valerie Bertinelli turned her pain into power", "description": "Think we're moving past the days when a woman's body was everybody's body -- there for the ogling, the analyzing, the commenting on, judging, shaming? We can always harbor that hope-- but then along comes a story like the one this week, writes Peggy Drexler.", "url": "https://www.cnn.com/2021/07/10/opinions/valerie-bertinelli-weight-trolls-drexler/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709130523-valerie-bertinelli-2019-file-super-tease.jpg", "publishedAt": "2021-07-10T19:59:29Z", "content": "Peggy Drexler is a research psychologist, documentary producer and the author of \"Our Fathers, Ourselves: Daughters, Fathers, and the Changing American Family\" and \"Raising Boys Without Men.\" The opi… [+6347 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Historic Miami-Dade courthouse closed due to 'safety concerns' following condo collapse", "description": "The historic Miami-Dade County Courthouse has been closed after an engineer reported \"safety concerns\" following the collapse of a condo in nearby Surfside, Florida, officials said Friday.", "url": "https://www.cnn.com/2021/07/10/us/miami-dade-county-courthouse-concerns/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710113822-restricted-miami-dade-county-courthouse-09-25-2019-super-tease.jpg", "publishedAt": "2021-07-10T16:47:33Z", "content": "(CNN)The historic Miami-Dade County Courthouse has been closed after an engineer reported \"safety concerns\" following the collapse of a condo in nearby Surfside, Florida, officials said Friday.\r\nCour… [+2236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "It's time to ditch the Homo sapiens superiority complex", "description": "It's easy to think we, Homo sapiens, are unique -- that we represent the acme of evolution and will forever sit atop the great chain of being. But it's definitely plausible that we have gotten too self-important.", "url": "https://www.cnn.com/2021/07/10/world/neanderthal-bone-science-newsletter-wt-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708092656-01b-neanderthal-engraved-giant-deer-bone-scn-super-tease.jpeg", "publishedAt": "2021-07-10T15:01:41Z", "content": "A version of this story appeared in CNN's Wonder Theory newsletter. To get it in your inbox, sign up for free here. Tell us what you'd like to see more of in the newsletter at sciencenewsletter@cnn.c… [+2 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Here are just some of Richard Branson's near-death experiences ahead of his first space flight", "description": "Richard Branson, the billionaire entrepreneur who is set to take a test flight on his Virgin Galactic spaceship to the edge of outer space on Sunday, has rarely been one to shy away from risky activities, and because of that he's narrowly avoided being killed…", "url": "https://www.cnn.com/2021/07/10/business/richard-branson-near-death-experiences/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708155102-01-richard-branson-unf-super-tease.jpg", "publishedAt": "2021-07-10T14:23:16Z", "content": "New York (CNN Business)Richard Branson, the billionaire entrepreneur who is set to take a test flight on his Virgin Galactic spaceship to the edge of outer space on Sunday, has rarely been one to shy… [+4764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "How everyone on Medicare could end up paying for the pricey new Alzheimer's drug", "description": "The controversial new drug for Alzheimer's disease, Aduhelm, is priced at $56,000 a year for treatment -- but Alzheimer's patients won't be the only ones shouldering the cost.", "url": "https://www.cnn.com/2021/07/10/politics/aduhelm-alzheimers-drug-medicare/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629221606-biogen-aduhelm-investigation-super-tease.jpg", "publishedAt": "2021-07-10T14:07:00Z", "content": "(CNN)The controversial new drug for Alzheimer's disease, Aduhelm, is priced at $56,000 a year for treatment -- but Alzheimer's patients won't be the only ones shouldering the cost.\r\nAll of Medicare's… [+4751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Harry Enten, CNN", "title": "How long-standing mistrust of government is hurting our vaccination efforts", "description": "This lack of general trust is now hurting our Covid-19 vaccination effort. Trust in the government to give accurate information about the coronavirus is one of the most predictive variables over whether a person is vaccinated.", "url": "https://www.cnn.com/2021/07/10/politics/vaccinations-government-mistrust-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708143937-us-vaccincation-file-super-tease.jpg", "publishedAt": "2021-07-10T13:24:51Z", "content": "(CNN)Americans have lacked trust in the federal government since the 1970s. From the late 1950s until the Watergate scandal, a majority of Americans said they trusted the federal government to do the… [+3952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna and Ralph Ellis, CNN", "title": "Charlottesville begins taking down Confederate statues", "description": "Bronze statutes of two Confederate generals are being taken from public property in Charlottesville, Virginia, on Saturday, almost four years after they were a flashpoint for a violent \"Unite the Right\" rally that left one person dead.", "url": "https://www.cnn.com/2021/07/10/us/charlottesville-statues-coming-down/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710081405-02-charlottesville-confederate-statues-removal-07-10-2021-robert-e-lee-super-tease.jpg", "publishedAt": "2021-07-10T12:33:29Z", "content": "(CNN)Bronze statutes of two Confederate generals are being taken from public property in Charlottesville, Virginia, on Saturday, almost four years after they were a flashpoint for a violent \"Unite th… [+2470 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on the Covid-19 pandemic", "description": "Pfizer says it's seeing waning immunity from its vaccine and is picking up efforts to develop a booster shot. Follow here for the latest updates on vaccines, variants and the global pandemic news.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-07-10-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-07-10T12:29:50Z", "content": "Dr. Anthony Fauci said Friday that he agrees with new guidance from the US Centers for Disease Control and Prevention which recommends a return to in-person school for children this fall.\r\nI think th… [+817 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Livia Borghese and Sharon Braithwaite, CNN", "title": "Pope Francis gradually resuming work and walking after his surgery", "description": "Pope Francis is gradually resuming work, is walking, his blood tests are \"satisfactory\" and \"he is continuing the prescribed treatment\" following last week's surgery, according to a spokesperson for the Holy See on Saturday.", "url": "https://www.cnn.com/2021/07/10/europe/pope-francis-work-surgery-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210704094245-pope-francis-06-29-2021-super-tease.jpg", "publishedAt": "2021-07-10T12:14:17Z", "content": "Rome (CNN)Pope Francis is gradually resuming work, is walking, his blood tests are \"satisfactory\" and \"he is continuing the prescribed treatment\" following last week's surgery, according to a spokesp… [+1318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Breeanna Hare, CNN", "title": "Sitcom wives wore dresses. Then came Mary Tyler Moore in a pair of capri pants", "description": "When Mary Tyler Moore was introduced to TV audiences as Laura Petrie on \"The Dick Van Dyke Show,\" her insistence that her character wear pants made a bold statement in front of and behind the camera.", "url": "https://www.cnn.com/style/article/mary-tyler-moore-capri-pants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708163652-01-mary-tyler-moore-capri-pants-restricted-super-tease.jpg", "publishedAt": "2021-07-10T11:29:32Z", "content": "At a time when one of our fiercest clothing debates is about a generational love of skinny jeans, it may be hard to picture capri pants as revolutionary.\r\nBut 60 years ago, when Mary Tyler Moore was … [+3647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Extreme heat cooked mussels, clams and other shellfish alive on beaches in Western Canada", "description": "The devastating heat wave that ravaged British Columbia last week is being blamed for a massive die-off of mussels, clams and other marine animals that live on the beaches of Western Canada.", "url": "https://www.cnn.com/2021/07/10/weather/heat-sea-life-deaths-trnd-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708165428-02-canada-mussels-heat-deaths-super-tease.jpg", "publishedAt": "2021-07-10T11:04:44Z", "content": "(CNN)The devastating heat wave that ravaged British Columbia last week is being blamed for a massive die-off of mussels, clams and other marine animals that live on the beaches of Western Canada.\r\nCh… [+4523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Rescue teams are able to work more quickly now at the Surfside condo collapse site", "description": "The search teams are able to recover victims more quickly from the collapsed condo building in Surfside, Florida, now that the structure is no longer a threat and heavy machinery is able to gain access, Florida Fire Marshall and Chief Financial Officer Jimmy …", "url": "https://www.cnn.com/2021/07/10/us/miami-dade-building-collapse-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707014625-05-surfside-building-collapse-0706-super-tease.jpg", "publishedAt": "2021-07-10T10:35:55Z", "content": "(CNN)The search teams are able to recover victims more quickly from the collapsed condo building in Surfside, Florida, now that the structure is no longer a threat and heavy machinery is able to gain… [+5483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Before Zaila Avant-garde, there was MacNolia Cox, the first Black top-5 finalist at the National Spelling Bee", "description": "On Thursday, Zaila Avant-garde became the first Black American to win the Scripps National Spelling Bee. But 85 years ago, there was another little Black girl from Ohio who came close.", "url": "https://www.cnn.com/2021/07/10/us/national-spelling-bee-black-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709155919-01-national-spelling-bee-2021-winner-super-tease.jpg", "publishedAt": "2021-07-10T10:01:03Z", "content": "(CNN)On Thursday, Zaila Avant-garde became the first Black American to win the Scripps National Spelling Bee. But 85 years ago, there was another little Black girl from Ohio who came close. \r\nIn 1936… [+4522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova, CNN", "title": "Boxer Chris Eubank's son Sebastian dies in Dubai", "description": "Boxer Chris Eubank's son Sebastian has died in Dubai days before his 30th birthday, and a month after he became a father, UK's PA Media reported Saturday, citing a statement from the family.", "url": "https://edition.cnn.com/2021/07/10/sport/sebastian-eubank-intl-scli-spt-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710034308-sebastian-eubank-intl-super-tease.jpg", "publishedAt": "2021-07-10T09:15:18Z", "content": "(CNN)Boxer Chris Eubank's son Sebastian has died in Dubai days before his 30th birthday, and a month after he became a father, UK's PA Media reported Saturday, citing a statement from the family.\r\nSe… [+2141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "These pretty Italian villages want to pay you $33,000 to move in", "description": "Living in a pretty village in southern Italy already sounds like a dream. Now a network of communities in the Calabria region also want to pay you $33,000 to make the move. There's a couple of conditions though....", "url": "https://www.cnn.com/travel/article/italy-villages-pay-33000-to-move-in-calabria-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709130219-calabria-paid-to-move-santa-severina---borghi-piu-belli-ditalia-super-tease.jpg", "publishedAt": "2021-07-10T09:04:22Z", "content": "(CNN) Ever dreamed of opening an artisan boutique and settling down for good in an idyllic village in Italy's deep south where it's warm almost all year-round -- and get paid to do it?\r\nFor those wil… [+9490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "10 things we learned about Covid travel this week", "description": "Check out CNN's latest weekly news update on pandemic travel. Airplane passenger behavior is getting worse, a US island has become a vaccination tourism hotspot, and 2021's most powerful passposts have been revealed", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-unruly-passengers-powerful-passports/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706221108-tumon-bay-guam-0624-super-tease.jpg", "publishedAt": "2021-07-10T08:24:14Z", "content": "(CNN) Planning travel this summer is a lot like struggling through high school math.\r\nThere's the algebra of restrictions, when X into Y can't go. There are the rising and falling R numbers. There's … [+6932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu and Etant Dupain, CNN", "title": "Wave of speculation and uncertainty grips Haiti after President's assassination", "description": null, "url": "https://www.cnn.com/2021/07/10/americas/haiti-moise-assassination-uncertainty-intl-hnk-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210710004616-01-haiti-assassination-what-we-know-intl-super-tease.jpg", "publishedAt": "2021-07-10T08:02:01Z", "content": "Port-au-Prince, Haiti (CNN)The charred shells of three burned-out cars marked the road to the president's house on Friday in Port-au-Prince, Haiti. Just up the hill, former leader Jovenel Moise had b… [+7408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "7 heritage sites with deep cultural and historical roots to Latinos are in need of preservation, group says", "description": "A historic neighborhood threatened by plans for a sports arena, a bodega that became a hub for Dominicans in Rhode Island and a park where Mexican American students gathered to call for equitable access to education.", "url": "https://www.cnn.com/2021/07/10/us/latinos-heritage-sites-preservation-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709141312-02-latinos-heritage-sites-preservation-report-friendship-super-tease.jpg", "publishedAt": "2021-07-10T08:00:52Z", "content": "(CNN)A historic neighborhood threatened by plans for a sports arena, a bodega that became a hub for Dominicans in Rhode Island and a park where Mexican American students gathered to call for equitabl… [+7366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Sinclair Scott, CNN | Leah Dolan, CNN", "title": "Paris Fashion Week: Ella Emhoff's debut and more highlights from this week's couture shows", "description": "The latest run of couture shows in Paris signaled a return to relative normal, as the balance between digital and in-person shows tipped in favor of the latter, and more international guests returned to the city this week to soak up the atmosphere.", "url": "https://www.cnn.com/style/article/paris-couture-fashion-week-highlights-autumn-winter-2021-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709102728-restricted-10-paris-fashion-week-aw22-couture-highlights-super-tease.jpg", "publishedAt": "2021-07-10T07:59:52Z", "content": "The latest run of couture shows in Paris signaled a return to relative normal, as the balance between digital and in-person events tipped in favor of the latter, and more international guests returne… [+2386 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "With an uptick in Covid-19 cases, there is growing alarm. 'We've seen almost an entire takeover in the Delta variant,' one state official says", "description": "The US has surpassed 20,000 new Covid-19 cases for the fourth day in a row as the highly contagious Delta variant persists in its track in being the most common form of the coronavirus in the country.", "url": "https://www.cnn.com/2021/07/10/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709225656-us-coronavirus-saturday-0710-super-tease.jpg", "publishedAt": "2021-07-10T07:41:42Z", "content": "(CNN)The US has surpassed 20,000 new Covid-19 cases for the fourth day in a row as the highly contagious Delta variant persists in its track in being the most common form of the coronavirus in the co… [+6516 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong, CNN", "title": "The yoga of everyday life: Jessamyn Stanley on nourishing the spiritual and physical body", "description": "Read CNN's Q&A  with Jessamyn Stanley, the author of the new yoga book \"Yoke.\" Find out how she takes yoga off the mat into everyday life -- and how she combine the messy corners of her life with meditation.", "url": "https://www.cnn.com/2021/07/10/health/yoga-everyday-life-jessamyn-stanley-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170412115959-10-jessamyn-stanley-yoga-basics-super-tease.jpg", "publishedAt": "2021-07-10T07:02:05Z", "content": "Jessamyn Stanley's book, \"Every Body Yoga,\" looks at how every person can pick up a yoga practice. Here are some poses to start with.Mountain pose: Tadasana For the first in the series of standing po… [+147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David M. Perry", "title": "The latest Pfizer statement has me on the edge", "description": "David M. Perry writes that Pfizer's statement about developing a booster shot against Covid, despite US public health agencies saying boosters are not necessary at this time, has created confusion about what comes next for those who are fully vaccinated and g…", "url": "https://www.cnn.com/2021/07/10/opinions/pfizer-covid-booster-statement-confusion-perry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625204822-fda-covid-vaccine-heart-warning-super-tease.jpg", "publishedAt": "2021-07-10T04:50:54Z", "content": "David M. Perry is a journalist and historian and co-author of \"The Bright Ages: A New History of Medieval Europe.\" He is a senior academic adviser in the history department of the University of Minne… [+7151 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "How England manager Gareth Southgate has shown the true value of leadership at Euro 2020", "description": "When the referee blew the final whistle and confirmed England had reached the final of Euro 2020 on Wednesday, television cameras quickly honed in on Gareth Southgate.", "url": "https://edition.cnn.com/2021/07/10/football/england-italy-euro-2020-final-gareth-southgate-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709141502-southgate-gareth-super-tease.jpg", "publishedAt": "2021-07-10T04:03:49Z", "content": "(CNN)When the referee blew the final whistle and confirmed England had reached the final of Euro 2020 on Wednesday, television cameras quickly honed in on Gareth Southgate. \r\nThe England manager has … [+8627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Has the world failed South Sudan?", "description": "Ten years after South Sudan's independence, the country faces civil war, food insecurity, and a struggling economy. CNN's Eleni Giokos speaks to Susan D. Page, the first US ambassador to South Sudan, about the issues that the country faces.", "url": "https://www.cnn.com/videos/world/2021/07/10/south-sudan-10-years-later-susan-d-page-intv-oneworld-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/111212051649-south-sudan-independence-story-top.jpg", "publishedAt": "2021-07-10T01:42:12Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Legoland New York opens with 7 themed lands", "description": "On Friday, the Legoland New York Resort fully opened with all seven of its themed lands available for kids and their minders to explore.", "url": "https://www.cnn.com/travel/article/legoland-new-york-opens/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709191830-03-legoland-new-york-pr-super-tease.jpg", "publishedAt": "2021-07-10T00:47:23Z", "content": "(CNN) Visitors and residents of the Northeastern United States puzzlin' where to go with their children this summer have another travel option.\r\nOn Friday, the Legoland New York Resort fully opened w… [+1579 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joshua Berlinger, Lauren Lau and Julia Hollingsworth, CNN", "title": "A man stabbed a Hong Kong police officer. Now people are calling him a hero", "description": "An attack on a police officer in Hong Kong has exposed that while protests and political opposition have been blunted, the anger that rocked the city in 2019 lingers on.", "url": "https://www.cnn.com/2021/07/09/asia/hong-kong-stabbing-aftermath-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709013823-hong-kong-police-stabbing-super-tease.jpg", "publishedAt": "2021-07-10T00:30:44Z", "content": "Hong Kong (CNN)They came with white flowers to honor a man accused of attempted murder.\r\nHis victim wasa seemingly random police officer -- and for some in Hong Kong, that not only justified the viol… [+10143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joshua Berlinger, Lauren Lau and Julia Hollingsworth, CNN", "title": "A man stabbed a Hong Kong police officer. Now people are calling him a hero", "description": "An attack on a police officer in Hong Kong has exposed that while protests and political opposition have been blunted, the anger that rocked the city in 2019 lingers on.", "url": "https://www.cnn.com/2021/07/09/asia/hong-kong-stabbing-aftermath-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709013823-hong-kong-police-stabbing-super-tease.jpg", "publishedAt": "2021-07-10T00:30:44Z", "content": "Hong Kong (CNN)They came with white flowers to honor a man accused of attempted murder.\r\nHis victim wasa seemingly random police officer -- and for some in Hong Kong, that not only justified the viol… [+10143 chars]"}]}