{"status": "ok", "totalResults": 132, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "New York Times: Trump 2020 campaign refunds millions to donors after using aggressive fundraising tactic", "description": "Former President Donald Trump and the Republican Party have refunded nearly $13 million to donors in the first half of the year, after deploying fundraising tactics in the 2020 election that duped donors into giving more money than they intended or believed t…", "url": "https://www.cnn.com/2021/08/07/politics/trump-refunds-millions-2020-campaign-fundraising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807131902-donald-trump-pennsylvania-09-22-2020-super-tease.jpg", "publishedAt": "2021-08-07T18:14:04Z", "content": "(CNN)Former President Donald Trump and the Republican Party have refunded nearly $13 million to donors in the first half of the year, after deploying fundraising tactics in the 2020 election that dup… [+2627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "What experts are learning about Lambda, a coronavirus 'variant of interest'", "description": "As the coronavirus pandemic continues, infections caused by the Lambda variant have been emerging in the United States, including in Texas, where Houston Methodist Hospital last month reported its first case.", "url": "https://www.cnn.com/2021/08/07/health/lambda-coronavirus-variant-wellness-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718020311-01-coronavirus-test-la-0714-super-tease.jpg", "publishedAt": "2021-08-07T18:11:55Z", "content": "(CNN)As the coronavirus pandemic continues, infections caused by the Lambda variant have been emerging in the United States, including in Texas, where Houston Methodist Hospital last month reported i… [+6338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jane Levere, CNN", "title": "Canada is reopening to US tourists on Monday: Your guide to crossing the border", "description": "On Monday, August 9, Canada will reopens its borders to leisure travel from US tourists. Read CNN Travel's Q&A guide to find out all the essential information before you visit.", "url": "https://www.cnn.com/travel/article/canada-reopening-us-tourists-guide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190917100817-canada-flag-file-super-tease.jpg", "publishedAt": "2021-08-07T17:28:51Z", "content": "(CNN) It has been a long time, neighbor.\r\nThe Canadian government has prohibited Americans from taking nonessential trips there since March 2020 because of the Covid-19 pandemic. But that will change… [+6652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dennis Aftergut and Fred Wertheimer", "title": "How to loosen the hold rich people have on our elections", "description": "Dennis Aftergut and Fred Wertheimer  write about a New Yorker feature entitled \"The Big Money Behind the Big Lie\" which talks about two dangerous threats to American democracy today -- election subversion and dark money.", "url": "https://www.cnn.com/2021/08/07/opinions/rich-people-influence-on-elections-aftergut-wertheimer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150617183812-citizens-united-campaign-reform-super-169.jpg", "publishedAt": "2021-08-07T16:59:56Z", "content": "Dennis Aftergut is a former federal prosecutor and former Supreme Court advocate, currently of counsel at the Renne Public Law Group in San Francisco. Fred Wertheimer is president of Democracy 21, a … [+5393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact-checking claim Biden administration is pushing vaccine passport", "description": "Amid confusion over mask mandates, booster shots, and new guidance for those vaccinated, some Republicans have thrown fuel on the fire with false and misleading claims.", "url": "https://www.cnn.com/2021/08/07/politics/biden-vaccine-passport-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726095519-france-covid-pass-law-super-tease.jpg", "publishedAt": "2021-08-07T16:30:17Z", "content": "Washington (CNN)Amid confusion over mask mandates, booster shots, and new guidance for those vaccinated, some Republicans have thrown fuel on the fire with false and misleading claims. \r\nLast week th… [+3001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "Firefighters on the front lines of the Dixie Fire don't know if their own homes are still standing", "description": "As the Dixie Fire rages out of control in northern California, the largest wildfire currently burning in the US, the heroes on the front lines are fighting the biggest fight of their lives, in their own backyards.", "url": "https://www.cnn.com/2021/08/07/weather/dixie-fire-front-lines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729142334-02-dixie-wildfire-lassen-national-forest-0726-file-super-tease.jpg", "publishedAt": "2021-08-07T16:00:59Z", "content": "An early version of this story was featured in CNN Weather's weekly column, which is released every Monday afternoon here.\r\n (CNN)As the Dixie Fire rages out of control in northern California, the la… [+6417 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Adrienne Vogt and Amy Woodyatt, CNN", "title": "Jessica Springsteen, Bruce Springsteen's daughter, wins silver medal in equestrian team jumping final", "description": "Talk about \"born to jump.\" Jessica Springsteen, Bruce Springsteen's daughter, helped her squad nab silver in the team jumping final at Equestrian Park at the Tokyo 2020 Olympics on Saturday.", "url": "https://www.cnn.com/2021/08/07/sport/jessica-springsteen-silver-tokyo-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807085956-jessica-springsteen-equestrian-gold-super-tease.jpg", "publishedAt": "2021-08-07T15:03:57Z", "content": "(CNN)Talk about \"born to jump.\" Jessica Springsteen, Bruce Springsteen's daughter, helped her squad nab silver in the team jumping final at Equestrian Park at the Tokyo 2020 Olympics on Saturday.\r\nDa… [+1348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez", "title": "TV OT: Why are my shows filled with mean girls? Plus, UFOs and the best lines from 'Cooking with Paris'", "description": "At some point between catching up on \"Gossip Girl,\" watching the latest episode of \"White Lotus\" and continuing to make my way through the new season of \"Never Have I Ever,\" I had a realization: If I was a teen girl right now, I'd be annoyed.", "url": "https://www.cnn.com/2021/08/07/entertainment/tv-ot-gossip-girl-white-lotus/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:58:07Z", "content": "Editors Note: TV OT is a weekly look at what CNNs entertainment team is watching since too much television has us all working overtime.\r\nIts the end of another week, end of another Olympics and the e… [+6958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop", "title": "What's next for gymnastics great Simone Biles after Tokyo?", "description": "Gymnastics superstar Simone Biles left Tokyo on Wednesday with her fame intact, but changed from the person she had been before the games.", "url": "https://www.cnn.com/2021/08/07/us/simone-biles-future-career/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:50:28Z", "content": "Gymnastics superstar Simone Biles left Tokyo on Wednesday with her fame intact, but changed from the person she had been before the games. \r\nSuffering from the twisties a mental condition in which gy… [+2992 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Val Kilmer documentary reveals deeply personal portrait of a Hollywood star", "description": "Seeing celebrities through their own eyes and stories can be fraught with ... exaggeration. Or, if the star has been particularly introspective, like Val Kilmer, a lot can be learned.", "url": "https://www.cnn.com/2021/08/07/entertainment/val-kilmer-celebs-plc/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:19:47Z", "content": "Seeing celebrities through their own eyes and stories can be fraught with exaggeration. Or, if the star has been particularly introspective, a lot can be learned.\r\nWhich brings me to actor Val Kilmer… [+4871 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arianna LaPenne", "title": "Opinion: What a community of preppers taught me about survival", "description": "With no shortage of concerning headlines these days, America's preppers -- those who vigilantly prepare for disaster -- seem to be having an \"I told you so\" moment. With her documentary short \"The Bunker Boom: Better Safe Than Sorry,\" director Arianna LaPenne…", "url": "https://www.cnn.com/2021/08/07/opinions/the-bunker-boom-cnn-films-short-arianna-lapenne/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:00:14Z", "content": "Editors Note: Arianna LaPenne is a documentary filmmaker from New York City who has directed Emmy-nominated, and Peabody and Edward R. Murrow award-winning work in more than 50 countries. Her recent … [+5878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby and Liz Stark", "title": "FEMA funeral assistance now flowing to families of Covid victims after a bumpy start", "description": "George Harrington applied for the Federal Emergency Management Agency's funeral assistance program soon after it launched in mid-April. He sent in all the documents related to the burial of his father, George III, 80, a veteran and registered nurse who had di…", "url": "https://www.cnn.com/2021/08/07/politics/fema-covid-funeral-assistance/index.html", "urlToImage": null, "publishedAt": "2021-08-07T12:03:51Z", "content": "George Harrington applied for the Federal Emergency Management Agencys funeral assistance program soon after it launched in mid-April. He sent in all the documents related to the burial of his father… [+5671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alyssa Kraus, CNN", "title": "Olympics schedule and events to watch Saturday", "description": "The Olympics are winding down this weekend, and medals will be awarded in baseball, basketball, football and more on Saturday.", "url": "https://www.cnn.com/2021/08/07/entertainment/olympics-schedule-events-today-spt-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806084245-12-olympics-080621-water-polo-super-tease.jpg", "publishedAt": "2021-08-07T11:57:09Z", "content": "(CNN)The Olympics are winding down this weekend, with the closing ceremony on Sunday. However, several events are still in full swing, with medals being awarded in baseball, basketball, football and … [+2473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A romance writing group gave an award to a book criticized for romanticizing the killing of Native people. Then it took it back", "description": "Barely a year since the Romance Writers of America's course correction after a major scandal over racism and exclusion, controversy erupted when \"At Love's Command\" was given an award.", "url": "https://www.cnn.com/style/article/romance-writers-of-america-vivian-award-controversy-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806123849-book-store-stock-super-tease.jpg", "publishedAt": "2021-08-07T11:08:01Z", "content": "artsPublished 7th August 2021\r\nA new controversy has rocked the Romance Writers of America -- barely a year after a course correction that followed a major scandal over racism and exclusion.\r\nIn the … [+4550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Target will cover 100% of college tuition for its workers", "description": "Target has announced that it will begin paying the college tuition and textbook expenses for its US-based part-time and full-time employees who attend select schools.", "url": "https://www.cnn.com/2021/08/07/business/target-cover-free-college-tuition-employees-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806121631-01-target-store-file-super-tease.jpg", "publishedAt": "2021-08-07T10:03:19Z", "content": "(CNN)Target has announced that it will begin paying the college tuition and textbook expenses for its US-based part-time and full-time employees who attend select schools.\r\nThe retail giant is follow… [+1665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "They got a second chance at love in the middle of the Atlantic Ocean", "description": "American divorcee Jeannette Saqu﻿et met Scottish widower Graham McFarlane on a transatlantic sailing on board Cunard's Queen Mary 2. McFarlane invited Saqu﻿et to visit him in Scotland and their growing friendship deepened into something more.", "url": "https://www.cnn.com/travel/article/couple-who-met-middle-atlantic-ocean/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806123159-back-on-the-queen-mary-2-january-2018-super-tease.jpg", "publishedAt": "2021-08-07T10:01:45Z", "content": "(CNN) When Jeannette Saquet boarded the Queen Mary 2 ocean liner in January 2017, she was 71, and excited for a new adventure.\r\nSaquet had been divorced and single for a number of years. She enjoyed … [+11557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Blaze sweeps through Athens suburbs in fifth day of Greece wildfires", "description": "Flames swept through a residential town outside Athens overnight as wildfires burned across Greece for a fifth day on Saturday, and hundreds of people were evacuated by ferry from the island of Evia east of the capital.", "url": "https://www.cnn.com/2021/08/07/europe/greece-southern-europe-wildfires-heatwave-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807045201-02-greece-fire-evia-super-tease.jpg", "publishedAt": "2021-08-07T09:43:59Z", "content": "(CNN)Flames swept through a residential town outside Athens overnight as wildfires burned across Greece for a fifth day on Saturday, and hundreds of people were evacuated by ferry from the island of … [+2851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN | Emiko Jozuka, CNN and Blake Essig, CNN and Daishi Kusunoki, CNN", "title": "'Each one has a story': Meet Japan's Olympic pin obsessives", "description": "Buying and trading Olympic pins has become a global phenomenon, but Tokyo 2020 is a Games like no other for Japan's memorabilia collectors.", "url": "https://www.cnn.com/style/article/olympic-pin-collectors-japan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803222319-04-olympic-pin-trading-tokyo-072315-file-restricted-super-tease.jpg", "publishedAt": "2021-08-07T09:27:01Z", "content": "designPublished 7th August 2021\r\nWhen Shlomi Tsafrir moved to Nagano, Japan, in 1994, he had no idea the Olympic Games were going to change his life. \r\nThree years later, outside Nagano station, he b… [+5704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Bedlam on US airlines and more vaccine and mask mandates: What's new in Covid travel this week", "description": "Check out CNN's latest weekly news update on pandemic travel. There's bedlam on US airlines, wildfires in Greece and Turkey, and Canada and Japan are coming down hard on Covid rule-breakers", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-airline-chaos-vaccine-mask-mandates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804120838-spirit-airlines-jet-las-vegas-super-tease.jpg", "publishedAt": "2021-08-07T08:26:19Z", "content": "(CNN) There have been cancellations and chaos on US airlines, Canada and Japan have been cracking down on Covid rule-breakers, but the UK is opening up to more and more vaccinated visitors. \r\nHere's … [+6406 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Yes, children can be affected by Covid-19. Here's why doctors say they need to be protected", "description": "Doctors say keeping kids Covid-free is critical to ensure in-person learning, prevent unforeseen complications and help stave off more aggressive variants.", "url": "https://www.cnn.com/2021/08/07/health/children-covid-19-protection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162107-01-children-covid-mask-stock-super-tease.jpg", "publishedAt": "2021-08-07T08:02:30Z", "content": "(CNN)The idea that kids don't get hit hard by Covid-19 is losing steam -- in part because of a variant more contagious than any we've seen before.\r\nSince this time last year, more than 45,000 childre… [+9004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Officials split on masking up children in schools as pediatric hospitals fill up with Covid-19 patients", "description": "The polarization surrounding mask mandates is deepening as some state and local officials spar on how to approach face coverings protocols in schools, a debate unfolding as more children contract Covid-19.", "url": "https://www.cnn.com/2021/08/07/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806235406-elementary-school-ga-0804-super-tease.jpg", "publishedAt": "2021-08-07T07:48:29Z", "content": "(CNN)The polarization surrounding mask mandates is deepeningas some state and local officials spar on how to approach face coverings protocols in schools, a debate unfolding as more children contract… [+8892 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "After latest suicide, the Vessel in New York City's Hudson Yards ponders its future", "description": "The Vessel's future as the Instagrammable centerpiece of New York City's newest neighborhood is in limbo after four suicides. Can it be saved?", "url": "https://www.cnn.com/2021/08/07/us/vessel-hudson-yards-suicide-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805120346-05-vessel-hudson-yards-suicide-super-tease.jpg", "publishedAt": "2021-08-07T07:04:06Z", "content": "(CNN)In a December 2016 article for The Architect's Newspaper, journalist Audrey Wachs noted a glaring issue with the Vessel, the 150-foot-tall tourist attraction that was set to open in New York Cit… [+7954 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sheena McKenzie, CNN", "title": "'Trainspotting' turned a spotlight on Scotland's heroin problem. 25 years on, it's Europe's drug death capital", "description": "It's one of the most famous monologues in cinema history. \"Choose life,\" says Ewan McGregor in the 1996 film adaptation of Irvine Welsh's gritty novel about a group of drug addict friends.", "url": "https://www.cnn.com/2021/08/07/europe/trainspotting-scotland-drug-related-deaths-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805153219-scotland-drug-safe-consumption-van-09-25-2020-super-tease.jpg", "publishedAt": "2021-08-07T07:00:05Z", "content": "(CNN)It's one of the most famous monologues in cinematic history: \"Choose life,\" says Ewan McGregor in the 1996 film adaptation of \"Trainspotting,\"Irvine Welsh's gritty novel about a group of drug ad… [+7568 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Eliud Kipchoge: Marathon world record holder has 'the qualities of an ascetic monk'", "description": "When filmmakers were invited to document Eliud Kipchoge's second attempt to run a marathon in under two hours, it was the runner, rather than the run, that captured their imagination.", "url": "https://www.cnn.com/2021/08/07/sport/eliud-kipchoge-tokyo-marathon-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805225152-06-eliud-kipchoge-2017-super-tease.jpg", "publishedAt": "2021-08-07T06:05:45Z", "content": "(CNN)When filmmakers were invited to document Eliud Kipchoge's second attempt to run a marathon in under two hours, it was the runner, rather than the run, that captured their imagination. \r\nAmid the… [+6814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Martin, CNN", "title": "Team USA wins gold in men's basketball for the fourth Olympics in a row", "description": "Team USA avenged its early Olympic loss to France by beating the French men's basketball team for the gold medal on Saturday in the Japanese city of Saitama.", "url": "https://www.cnn.com/2021/08/07/sport/team-usa-olympic-gold-intl-hnk-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806235951-02-olympics-080721-basketball-durant-super-tease.jpg", "publishedAt": "2021-08-07T04:58:27Z", "content": "(CNN)Team USA avenged its early Olympic loss to France by beating the French men's basketball team for the gold medal on Saturday in the Japanese city of Saitama.\r\nIt was the 100th medal won by Team … [+798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Jamie Crawford, CNN", "title": "Two men arrested in US over alleged plot to kill Myanmar's UN ambassador", "description": "Two Myanmar citizens have been charged in New York with allegedly plotting to kill or injure Myanmar's ambassador to the United Nations, Kyaw Moe Tun, the US Attorney's Office said Friday.", "url": "https://www.cnn.com/2021/08/07/asia/myanmar-kyaw-moe-tun-plot-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806214010-01-kyaw-moe-tun-2021-super-tease.jpg", "publishedAt": "2021-08-07T04:28:15Z", "content": "(CNN)Two Myanmar citizens have been charged in New York with allegedly plotting to kill or injure Myanmar's ambassador to the United Nations, Kyaw Moe Tun, the US Attorney's Office said Friday. \r\nThe… [+4341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-07-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-07T04:00:50Z", "content": "Heat, humidity and tropical systems have been the nemesis of athletes during these Olympic Games, and the closing weekend will bring more of the same.\r\nWhile heat and humidity in Japan in July are co… [+2373 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Homeland Security warns of potential conspiracy theory-fueled violence in August", "description": "The Department of Homeland Security warned state and local authorities Friday about an increase in calls for violence online tied to election-related conspiracy theories, according to a law enforcement source.", "url": "https://www.cnn.com/2021/08/06/politics/homeland-security-warning-political-conspiracy-threat-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727153745-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-08-07T02:53:30Z", "content": "(CNN)The Department of Homeland Security warned state and local authorities Friday about an increase in calls for violence online tied to election-related conspiracy theories, according to a law enfo… [+2766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores and Christina Maxouris", "title": "Florida Gov. Ron DeSantis' order on masks in schools faces its first legal challenge over constitutionality", "description": "Eight Florida attorneys have filed a lawsuit against Gov. Ron DeSantis over his executive order on masks in schools, said Charles Gallagher, an attorney working on the suit.", "url": "https://www.cnn.com/2021/08/06/us/florida-desantis-executive-order-school-masks-first-legal-challenge-constitutionality/index.html", "urlToImage": null, "publishedAt": "2021-08-07T02:09:00Z", "content": "Eight Florida attorneys have filed a lawsuit against Gov. Ron DeSantis over his executive order on masks in schools, said Charles Gallagher, an attorney working on the suit.\r\nThis is the first legal … [+2245 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, Yong Xiong and David Culver, CNN", "title": "A Trump-era policy that shut out top Chinese students could be hurting America more than Beijing", "description": "US visa bans for some Chinese students could have implications for the quality of American research and inspire talented STEM graduates to take their skills back to China, experts warn.", "url": "https://www.cnn.com/2021/08/06/asia/china-united-states-students-visa-ban-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805212123-04-china-united-states-students-visa-ban-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-07T01:16:13Z", "content": "Hong Kong (CNN)When Dennis Hu came home to China for the 2020 Lunar New Year, he thought it would be a brief visit. He planned to enjoy the festivities with his family, renew his United States visa, … [+16949 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Mary Anne Fox, CNN", "title": "9/11 families tell Biden to stay away from memorial service if he doesn't authorize release of records related to attacks", "description": "More than 1,600 people affected by the September 11 attacks are asking President Joe Biden to refrain from coming to Ground Zero to mark the 20th anniversary of the event unless he releases documents and information related to the attacks, according to a lett…", "url": "https://www.cnn.com/2021/08/06/politics/joe-biden-9-11-records-memorial-service/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200911154718-03-joe-biden-0911-super-tease.jpg", "publishedAt": "2021-08-07T00:48:23Z", "content": "(CNN)More than 1,600 people affected by the September 11 attacks are asking President Joe Biden to refrain from coming to Ground Zero to mark the 20th anniversary of the event unless he releases docu… [+3017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, CNN", "title": "Ponytails and smiles: Pervasive language keeps sexism in Olympic sport at play", "description": "When Rebecca Smith sat down to watch New Zealand play the United States Women's National Team in a Tokyo 2020 football match last week, she was floored -- and not just because of the athletes' incredible prowess.", "url": "https://www.cnn.com/2021/08/06/sport/olympics-sexism-women-sport-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806154314-20210806-sports-feature-pagetop-super-tease.jpg", "publishedAt": "2021-08-07T00:32:40Z", "content": "(CNN)When Rebecca Smith sat down to watch New Zealand play the United States Women's National Team in a Tokyo 2020 football match last week, she was floored -- and not just because of the athletes' i… [+11728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel and Rachel Janfaza, CNN", "title": "Former Republican congressman to join staff of January 6 committee", "description": "Former Rep. Denver Riggleman is joining the staff of the House select committee investigating the January 6 attack on the US Capitol, the third Republican that House Speaker Nancy Pelosi has added to the panel that GOP leadership has attacked as a partisan en…", "url": "https://www.cnn.com/2021/08/06/politics/denver-riggleman-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806193838-denver-riggleman-file-super-tease.jpg", "publishedAt": "2021-08-06T23:40:20Z", "content": "(CNN)Former Rep. Denver Riggleman is joining the staff of the House select committee investigating the January 6 attack on the US Capitol, the third Republican that House Speaker Nancy Pelosi has add… [+2565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel and Rachel Janfaza, CNN", "title": "Former Republican congressman to join staff of January 6 committee", "description": "Former Rep. Denver Riggleman is joining the staff of the House select committee investigating the January 6 attack on the US Capitol, the third Republican that House Speaker Nancy Pelosi has added to the panel that GOP leadership has attacked as a partisan en…", "url": "https://www.cnn.com/2021/08/06/politics/denver-riggleman-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806193838-denver-riggleman-file-super-tease.jpg", "publishedAt": "2021-08-06T23:40:20Z", "content": "(CNN)Former Rep. Denver Riggleman is joining the staff of the House select committee investigating the January 6 attack on the US Capitol, the third Republican that House Speaker Nancy Pelosi has add… [+2565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Biden administration expected to unveil new Belarus sanctions", "description": "The Biden administration is expected to unveil new Belarus sanctions and a new executive order amid continued crackdowns by the regime of strongman leader Alexander Lukashenko.", "url": "https://www.cnn.com/2021/08/06/politics/belarus-biden-admin-sanctions-expected/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210728140245-biden-tsikhanouskaya-0728-super-tease.jpg", "publishedAt": "2021-08-06T23:03:14Z", "content": "(CNN)The Biden administration is expected to unveil new Belarus sanctions and a new executive order amid continued crackdowns by the regime of strongman leader Alexander Lukashenko.The Belarusian opp… [+571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "TV teen queens who broke the mold", "description": "From gossip girls to mean girls, teenage girls aren't always portrayed in a positive (or accurate) light. But here are ten teen TV characters who got it right.", "url": "https://www.cnn.com/2021/08/06/entertainment/gallery/teen-tv-queens/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805152658-02-teen-tv-queens-restricted-super-tease.jpg", "publishedAt": "2021-08-06T22:54:25Z", "content": "Updated 6:54 PM ET, Fri August 6, 2021"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna", "title": "Unvaccinated dad records days of regret in hospital -- and makes heartbreaking request for daughter's wedding in case he dies", "description": "Between difficult breaths of supplemental oxygen, Travis Campbell is fighting to relay a message about his battle with Covid-19 in a Virginia hospital. He really regrets not getting vaccinated. And while he hopes he's turned a corner, for a very scary stretch…", "url": "https://www.cnn.com/2021/08/06/health/coronavirus-virginia-travis-campbell-vaccine-regret/index.html", "urlToImage": null, "publishedAt": "2021-08-06T22:35:52Z", "content": "Between difficult breaths of supplemental oxygen, Travis Campbell is fighting to relay a message about his battle with Covid-19 in a Virginia hospital.\r\nHe really regrets not getting vaccinated. And … [+4402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Lauren Dezenski, CNN", "title": "How the Delta variant forced some leaders to get tough on mandates", "description": "The Delta variant has thrown a curveball at the nation's attempt at a post-Covid summer.", "url": "https://www.cnn.com/2021/08/06/politics/covid-mandates-masks-vaccines-nyc-arkansas-florida-texas-boston/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803180743-us-small-business-mask-policies-super-tease.jpg", "publishedAt": "2021-08-06T22:30:56Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Dezenski", "title": "The week in 16 headlines", "description": "This week, advocates for the recently expired nationwide eviction moratorium scored a victory as the CDC rolled out a new, yet more limited, moratorium following pressure and protest by some Democrats. Meanwhile, concerns over the nation's debt limit bubbled …", "url": "https://www.cnn.com/2021/08/06/politics/week-in-review-eviction-moratorium-debt-ceiling-delta/index.html", "urlToImage": null, "publishedAt": "2021-08-06T22:30:47Z", "content": "This week, advocates for the recently expired nationwide eviction moratorium scored a victory as the CDC rolled out a new, yet more limited, moratorium following pressure and protest by some Democrat… [+291 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez", "title": "The inside story behind the season finale of 'Physical'", "description": "The season finale of Apple TV+'s \"Physical\" brought to a, erm, climax a story that began as a tale about an unfulfilled housewife (Rose Byrne) in the '80s and concluded with a woman set free. Well, she's at least starting to set herself free.", "url": "https://www.cnn.com/2021/08/06/entertainment/physical-season-finale/index.html", "urlToImage": null, "publishedAt": "2021-08-06T22:30:07Z", "content": "Editors Note: This story contains spoilers about the season finale of Physical. \r\nThe season finale of Apple TV+s Physical brought to a, erm, climax a story that began as a tale about an unfulfilled … [+10185 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "UN fears for revered Christian and tourist site in Ethiopia that goes back 900 years", "description": "UNESCO is worried the ancient rock-hewn churches of Lalibela could be in peril due to the latest fighting in Ethiopia. Find out the history of this site revered by Christians and loved by tourists.", "url": "https://www.cnn.com/travel/article/lalibela-ethiopia-churches-history-un/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170206173142-ethiopia-travel-lalibela-super-tease.jpg", "publishedAt": "2021-08-06T22:09:10Z", "content": "(CNN) They're one greatest cultural and religious treasures not only in Ethiopia but also in Africa and in Christendom: the ancient rock-hewn churches of Lalibela. \r\nIn a statement released Friday, U… [+2683 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "Amazon reinstates mask requirement for all US warehouse workers", "description": "All of Amazon's US warehouse employees will once again be required to wear masks indoors beginning on Monday, whether they are vaccinated or not, the company confirmed to CNN Business on Friday.", "url": "https://www.cnn.com/2021/08/06/tech/amazon-warehouse-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806164916-amazon-workers-masks-0621-restricted-super-tease.jpg", "publishedAt": "2021-08-06T21:35:45Z", "content": "(CNN)All of Amazon's US warehouse employees will once again be required to wear masks indoors beginning on Monday, whether they are vaccinated or not, the company confirmed to CNN Business on Friday.… [+1867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, Zachary Cohen and Evan Perez, CNN", "title": "How a Trump environmental lawyer tried to weaponize the Justice Department to help the President", "description": "Jeffrey Clark, a Donald Trump-appointed environment law chief at the Justice Department at the center of the former President's efforts to overturn the election, received a high-level intelligence briefing around New Year's 2021 that did little to stop his ef…", "url": "https://www.cnn.com/2021/08/06/politics/doj-clark-trump-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805190917-jeffrey-clark-super-tease.jpg", "publishedAt": "2021-08-06T21:01:52Z", "content": "(CNN)Jeffrey Clark, a Donald Trump-appointed environment law chief at the Justice Department at the center of the former President's efforts to overturn the election, received a high-level intelligen… [+6322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Elie Honig", "title": "The US was thisclose to an attempted Trump coup", "description": "We were a single Donald Trump whim away from an actual coup last January, one backed by the weight of the United States Department of Justice, writes Elie Honig.", "url": "https://www.cnn.com/2021/08/06/opinions/attempted-trump-coup-thisclose-honig/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210724214527-01-donald-trumo-arizona-0724-super-tease.jpg", "publishedAt": "2021-08-06T20:41:19Z", "content": "Elie Honig is a CNN senior legal analyst and former federal and state prosecutor, and author of \"Hatchet Man: How Bill Barr Broke the Prosecutor's Code and Corrupted the Justice Department.\" The view… [+5237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco", "title": "Biden extends student loan payment pause to January 31", "description": "The Biden administration is extending the pause on federal student loan payments one last time until January 31.", "url": "https://www.cnn.com/2021/08/06/politics/student-loan-pause-extended/index.html", "urlToImage": null, "publishedAt": "2021-08-06T20:16:06Z", "content": "The Biden administration is extending the pause on federal student loan payments one last time until January 31. \r\nThe pandemic relief benefit was set to expire on September 30 after an unprecedented… [+3723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "January 6 committee considers whether to seek Trump White House call logs as investigators eyes next steps", "description": "The select committee investigating the January 6 insurrection is weighing whether to pursue call logs from the Trump White House on the day of the riot, a move that could present a potentially thorny dilemma for President Joe Biden who would ultimately have t…", "url": "https://www.cnn.com/2021/08/06/politics/january-6-committee-investigation-white-house-phone-logs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210611163618-01-january-6-insurrectionists-file-super-tease.jpg", "publishedAt": "2021-08-06T20:08:03Z", "content": "(CNN)The select committee investigating the January 6 insurrection is weighing whether to pursue call logs from the Trump White House on the day of the riot, a move that could present a potentially t… [+12208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Brent Swails and Laura Smith-Spark, CNN", "title": "Besieged on a 'Taliban-made island,' Kandahar's residents see no way out as militants advance ever closer", "description": "A wedding hall in the west of Kandahar, Afghanistan's second city, now lies on the front line of fierce fighting between Taliban forces and Afghan government troops.", "url": "https://www.cnn.com/2021/08/06/asia/afghanistan-kandahar-taliban-threat-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806091629-restricted-afghan-security-force-kandahar-07-23-2021-super-tease.jpg", "publishedAt": "2021-08-06T19:59:57Z", "content": "Kandahar, Afghanistan (CNN)A wedding hall in the west of Kandahar, Afghanistan's second city, now lies on the front line of fierce fighting between Taliban forces and Afghan government troops. \r\nDust… [+8332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mayumi Maruyama, CNN", "title": "At least 10 people injured in stabbings on Tokyo train", "description": "Ten passengers were injured after a man wielded a knife on a train in Tokyo on Friday. One female is seriously injured, according to reports.", "url": "https://www.cnn.com/2021/08/06/asia/tokyo-train-stabbing-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806140854-01-tokyo-train-attack-super-tease.jpg", "publishedAt": "2021-08-06T19:09:32Z", "content": "(CNN)Ten people were stabbed on a train in Tokyo by a man with a knife Friday night, according to the Tokyo Fire Department. \r\nThe department responded to a call at 8:38 p.m. and found victims with b… [+416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jim Sciutto, Chief National Security Correspondent", "title": "CNN gets an inside look at Space Force", "description": "I have been embedded with every branch of the US military multiple times -- in war zones and on base -- but nothing is quite like an inside look at the newly created US Space Force. Space Force \"Guardians,\" as they're known, do their work hundreds -- even tho…", "url": "https://www.cnn.com/2021/08/06/politics/sciutto-scn-space-force-first-hand-look/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806105157-space-force-defense-sciutto-pkg-nr-vpx-00000000-super-tease.jpg", "publishedAt": "2021-08-06T19:06:09Z", "content": "(CNN)I have been embedded with every branch of the US military multiple times -- in war zones and on base -- but nothing is quite like an inside look at the newly created US Space Force. Space Force … [+7571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz and Joe Beare", "title": "New Jersey gym owner is first US Capitol rioter to plead guilty to assaulting a police officer on January 6", "description": "A New Jersey gym owner and former MMA fighter pleaded guilty on Friday to assaulting a police officer during the January 6 insurrection, marking the first time a Capitol rioter has been convicted of violence against police.", "url": "https://www.cnn.com/2021/08/06/politics/capitol-rioter-assault-police-new-jersey-mma/index.html", "urlToImage": null, "publishedAt": "2021-08-06T19:04:48Z", "content": "A New Jersey gym owner and former MMA fighter pleaded guilty on Friday to assaulting a police officer during the January 6 insurrection, marking the first time a Capitol rioter has been convicted of … [+1713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams and Carmen Conte Widman", "title": "Texas woman gives birth in same hospital system where her husband died of Covid-19", "description": "Maria Garza spent much of her pregnancy in the ICU of a Texas hospital with her husband Jason, who died of Covid-19 in May when she was seven months pregnant.", "url": "https://www.cnn.com/2021/08/06/us/coronavirus-father-died-hospital-birth-trnd/index.html", "urlToImage": null, "publishedAt": "2021-08-06T18:51:30Z", "content": "Maria Garza spent much of her pregnancy in the ICU of a Texas hospital with her husband Jason, who died of Covid-19 in May when she was seven months pregnant. \r\nShe gave birth to their son last month… [+2996 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Samsung's The Frame is a gorgeous TV that doubles as a work of art", "description": "TVs are better than ever in 2021, but almost all of them leave a black box on your wall or whatever surface they're sitting on. Samsung's The Frame strikes a different chord, ditching the ugly black box for a design that looks like a frame to hold art or a pi…", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/samsung-the-frame-tv-2021-review/index.html", "urlToImage": null, "publishedAt": "2021-08-06T18:47:44Z", "content": "TVs are better than ever in 2021, but almost all of them leave a black box on your wall or whatever surface theyre sitting on. Samsungs The Frame strikes a different chord, ditching the ugly black bo… [+11322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kay Jones and Ray Sanchez", "title": "Baby girl with Covid-19 airlifted 150 miles because of Houston hospital bed shortage", "description": "A 11-month-old girl with Covid-19 had to be airlifted to a hospital 150 miles away because of a shortage of pediatric beds in the Houston area, officials said.", "url": "https://www.cnn.com/2021/08/06/us/houston-baby-girl-airlifted-covid/index.html", "urlToImage": null, "publishedAt": "2021-08-06T18:43:17Z", "content": "A 11-month-old girl with Covid-19 had to be airlifted to a hospital 150 miles away because of a shortage of pediatric beds in the Houston area, officials said. \r\nThe child tested positive for Covid-1… [+2279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Gard and Monica Garrett, CNN", "title": "Summer smoke might be the new normal in Colorado", "description": "Scratchy lungs and scorched earth. The West is not only battling raging wildfires, but poor air quality as well, caused by ash lofted thousands of feet in the air. Hundreds of miles away, that ash is settling in Colorado, something that has become all too fam…", "url": "https://www.cnn.com/2021/08/06/weather/wildfire-smoke-denver-colorado-forecast-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806130625-weather-smoke-forecast-saturday-08062021-card-super-tease.jpg", "publishedAt": "2021-08-06T18:34:02Z", "content": "(CNN)Scratchy lungs and scorched earth. The West is not only battling raging wildfires, but poor air quality as well, caused by ash lofted thousands of feet in the air. Hundreds of miles away, that a… [+8439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "US watching as Iran quietly replaces Red Sea spy ship damaged in April attack", "description": "The US was monitoring Iranian ship movements in the Middle East as Tehran quietly replaced a spy ship in the Red Sea that was damaged in an April attack, two US officials told CNN amid escalating regional tension with Iran and an ongoing maritime shadow confl…", "url": "https://www.cnn.com/2021/08/06/politics/us-monitor-iran-spy-ships/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806110606-restricted-02-iran-spy-ship-graphic-super-tease.jpg", "publishedAt": "2021-08-06T18:17:28Z", "content": "(CNN)The US was monitoring Iranian ship movements in the Middle East as Tehran quietly replaced a spy ship in the Red Sea that was damaged in an April attack, two US officials told CNN amid escalatin… [+4182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Five children were killed in a fire in East St. Louis, Illinois, fire chief says", "description": "Five children between the ages of 2 and 9 were killed in a fire early Friday morning in East St. Louis, Illinois, according to fire officials.", "url": "https://www.cnn.com/2021/08/06/us/east-st-louis-fire-children-killed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806133731-screengrab-east-st-louis-illinois-fire-08-06-2021-super-tease.jpg", "publishedAt": "2021-08-06T18:08:44Z", "content": "(CNN)Five children between the ages of 2 and 9 were killed in a fire early Friday morning in East St. Louis, Illinois, according to fire officials. \r\nThe fire broke out at an apartment building at 29… [+899 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wallace", "title": "The best drip coffee makers of 2021", "description": "We tested the best-rated drip coffee makers using a wide range of criteria over the course of several weeks. Many, many pots of coffee later, we settled on four standout drip coffee machines.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/best-drip-coffee-maker/index.html", "urlToImage": null, "publishedAt": "2021-08-06T17:38:39Z", "content": "There are so many brewing methods to choose from (French press, the currently trendy dalgona whipped, pour-over), but many coffee lovers still rely on the classic, automatic drip for their daily fix.… [+20619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Pentagon investigative team says Iran was behind attack on Mercer Street tanker", "description": "A US Defense Department expert team concluded that the drone behind the deadly attack on the Mercer Street commercial vessel was produced in Iran, US Central Command said in a statement Friday.", "url": "https://www.cnn.com/2021/08/06/politics/us-navy-mercer-street-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210730093832-oman-ship-attack-super-tease.jpg", "publishedAt": "2021-08-06T17:03:38Z", "content": "(CNN)A US Defense Department expert team concluded that the drone behind the deadly attack on the Mercer Street commercial vessel was produced in Iran, US Central Command said in a statement Friday. … [+1639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Pete Muntean, CNN", "title": "Spirit Airlines cancels hundreds of more flights on Friday and vows 'reductions in cancellations'", "description": "Spirit Airlines -- which has been beset by flight disruptions all week -- canceled almost 300 flights as midday Friday ET, according to data from FlightAware.", "url": "https://www.cnn.com/travel/article/spirit-airlines-more-cancellations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190805130912-spirit-airlines-file-super-tease.jpg", "publishedAt": "2021-08-06T16:51:56Z", "content": "© 2021 Cable News Network.A Warner Media Company.All Rights Reserved.CNN Sans &amp; © 2016 Cable News Network."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Benjamin Levin", "title": "These $100 earbuds have active noise cancellation — but are they any good?", "description": "TCL has been all over the earbuds arena with releases like the TCL SOCL500TWS, which fit the \"budget\" description to a T, as well as the TCL S150 and TCL S200. And now the company is back with the $100 TCL MoveAudio S600, budget buds that pack active noise ca…", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/tcl-moveaudio-s600-review/index.html", "urlToImage": null, "publishedAt": "2021-08-06T16:50:30Z", "content": "TCL has been all over the earbuds arena with releases like the TCL SOCL500TWS, which fit the budget description to a T, as well as the TCL S150 and TCL S200. And now the company is back with the $100… [+10688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand and Nicole Gaouette, CNN", "title": "Hopes of revived Iran nuclear talks dim amid delays as new hardline president takes office", "description": "Biden administration officials are becoming increasingly pessimistic about reviving the Iran nuclear deal as the country's new hardline president takes office and its nuclear program continues to accelerate, national security and intelligence officials famili…", "url": "https://www.cnn.com/2021/08/06/politics/iran-nuclear-talks-pessimism-delay-raisi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806123822-president-ebrahim-raisi-0805-super-tease.jpg", "publishedAt": "2021-08-06T16:41:07Z", "content": "Washington (CNN)Biden administration officials are becoming increasingly pessimistic about reviving the Iran nuclear deal as the country's new hardline president takes office and its nuclear program … [+9885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Zachary Cohen, Whitney Wild and Annie Grayer, CNN", "title": "As members of Congress go home, their security concerns come with them", "description": "For the 535 members of Congress, the haunting memories of the violence and chaos from January 6 don't go away as they leave Washington, DC.", "url": "https://www.cnn.com/2021/08/06/politics/congress-recess-district-security/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805103453-01-katie-porter-town-hall-restricted-super-tease.jpg", "publishedAt": "2021-08-06T16:37:32Z", "content": "(CNN)For the 535 members of Congress, the haunting memories of the violence and chaos from January 6 don't go away as they leave Washington, DC. \r\nThe ongoing threat remains top of mind for many lawm… [+7542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "Now what? Texas Democrats have a very hard choice to make", "description": "On Friday at midnight, the Texas legislature's special session -- the one in which Democrats fled the state in order to keep a stringent voting bill from being passed -- will come to a close. On Saturday at noon, the next special session of the legislature wi…", "url": "https://www.cnn.com/2021/08/06/politics/texas-democrats-election-bill/index.html", "urlToImage": null, "publishedAt": "2021-08-06T16:34:52Z", "content": "On Friday at midnight, the Texas legislatures special session the one in which Democrats fled the state in order to keep a stringent voting bill from being passed will come to a close. On Saturday at… [+3258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "South Dakota's Sturgis Motorcycle Rally: A 'cautionary tale' in the age of Covid-19", "description": "Duston Van Balen took a road trip with his family and a wooden urn containing the ashes of a man he considered a brother, with stops at the Grand Canyon in Arizona and Zion National Park in southwest Utah.", "url": "https://www.cnn.com/2021/08/06/us/sturgis-motorcycle-rally-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200811025142-sturgis-bike-rally-0807-super-tease.jpg", "publishedAt": "2021-08-06T16:34:04Z", "content": "(CNN)Duston Van Balen took a road trip with his family and a wooden urn containing the ashes of a man he considered a brother, with stops at the Grand Canyon in Arizona and Zion National Park in sout… [+8997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Alex Rogers, CNN", "title": "GOP Senate candidates align with Trump in bashing bipartisan infrastructure bill", "description": "Sen. Rob Portman, the longtime Washington veteran and savvy deal-cutter, is on the cusp of achieving a major bipartisan achievement that would amount to a capstone of his three decades of public service: The Senate's passage of a roughly $1 trillion package t…", "url": "https://www.cnn.com/2021/08/06/politics/infrastructure-republican-senate-candidates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806094525-josh-mandel-2014-super-tease.jpg", "publishedAt": "2021-08-06T16:19:41Z", "content": "(CNN)Sen. Rob Portman, the longtime Washington veteran and savvy deal-cutter, is on the cusp of achieving a major bipartisan achievement that would amount to a capstone of his three decades of public… [+9439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "Virgin Voyages' first cruise ship sets sail", "description": "After Covid-induced delays, Richard Branson's new cruise line Virgin Voyages is set to launch its first ship on Friday August 6. The swanky Scarlet Lady vessel is departing Portsmouth, England for a three-day sailing around the UK.", "url": "https://www.cnn.com/travel/article/virgin-voyages-scarlet-lady-uk-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806135055-strongislandmedia-scarlett-lady-220621-02-highres-super-tease.jpg", "publishedAt": "2021-08-06T16:08:29Z", "content": "(CNN) The first Virgin Voyages cruise ship with paying passengers on board is setting sail Friday August 6, after Covid-induced delays pushed back the launch of the Richard Branson-owned cruise line … [+7676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle and Veronica Stracqualursi", "title": "Former Cuomo staffer files criminal complaint against governor with Albany sheriff's office", "description": "A criminal complaint against New York Gov. Andrew Cuomo has been filed with the Albany Sheriff's Office by a former staffer who is among the 11 whose sexual harassment allegations against the embattled Democrat were detailed in the state attorney general's re…", "url": "https://www.cnn.com/2021/08/06/politics/cuomo-accuser-sexual-harassment-files-criminal-complaint/index.html", "urlToImage": null, "publishedAt": "2021-08-06T15:55:35Z", "content": "A criminal complaint against New York Gov. Andrew Cuomo has been filed with the Albany Sheriffs Office by a former staffer who is among the 11 whose sexual harassment allegations against the embattle… [+1784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy, CNN", "title": "Exclusive: Family of deceased Pentagon suspect apologizes and blames son's 'mental health challenges'", "description": "The Lanz family tells CNN that their son Austin Lanz, the man authorities say killed a Pentagon Police officer on Tuesday morning, had \"many mental health challenges.\"", "url": "https://www.cnn.com/2021/08/06/politics/suspected-pentagon-attacker-family-apology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803141347-01-pentagon-shooting-0803-super-tease.jpg", "publishedAt": "2021-08-06T15:47:07Z", "content": "(CNN)The Lanz family tells CNN that their son Austin Lanz, the man authorities say killed a Pentagon Police officer on Tuesday morning, had \"many mental health challenges.\" \r\n\"We are devastated by th… [+3132 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan", "title": "Biden touts economic recovery after US added 943,000 jobs in July", "description": "President Joe Biden on Friday touted the country's economic recovery from the coronavirus pandemic after the US added 943,000 jobs in July and the unemployment rate fell to 5.4%.", "url": "https://www.cnn.com/2021/08/06/politics/biden-july-jobs-report/index.html", "urlToImage": null, "publishedAt": "2021-08-06T15:44:00Z", "content": "President Joe Biden on Friday touted the countrys economic recovery from the coronavirus pandemic after the US added 943,000 jobs in July and the unemployment rate fell to 5.4%. \r\nNow while our econo… [+1003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Arrest made in hit and run death of actress Lisa Barnes", "description": "An arrest has been made in the scooter hit and run that led to death of \"Gone Girl\" actress Lisa Banes in June.", "url": "https://www.cnn.com/2021/08/06/entertainment/lisa-barnes-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210615152907-cnn-red-lisa-banes-super-tease.jpg", "publishedAt": "2021-08-06T15:24:48Z", "content": "(CNN)An arrest has been made in the hit and run incident that led to death of \"Gone Girl\" actress Lisa Banes in June. \r\nThe NYPD announced that Brian Boyd, 26, was arrested Thursday. Possible charges… [+975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar and Taylor Ward", "title": "Heat, humidity and another tropical storm are expected for the end of the Olympics", "description": "Heat, humidity and tropical systems have been the nemesis of athletes during these Olympic Games, and the closing weekend will bring more of the same.", "url": "https://www.cnn.com/2021/08/06/sport/olympic-weather-forecast-heat-tropical-storm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806065645-weather-japan-tropical-system-olympics-080621-super-169.jpg", "publishedAt": "2021-08-06T15:16:35Z", "content": "Heat, humidity and tropical systems have been the nemesis of athletes during these Olympic Games, and the closing weekend will bring more of the same.\r\nWhile heat and humidity in July are common, the… [+3400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toby Lyles", "title": "Voting Rights By the Numbers 2021", "description": "The Voting Rights Act of 1965 was enacted because of voter suppression by state governments, local governments and law enforcement. Over the 56-year period of its existence, it has helped Americans reinforce the citizens right to vote.", "url": "https://www.cnn.com/2021/08/06/us/voting-rights-by-the-numbers-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130117191909-mills-mlk-march-story-tablet.jpg", "publishedAt": "2021-08-06T15:08:53Z", "content": "5th Amendment to the Constitution addressed voter suppression based on race or color.\r\n19th Amendment to the Constitution addressed voter suppression based on sex.\r\nVoting Rights Act of 1965 followed… [+5391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "Boris Johnson continued a trip to Scotland despite an official testing positive for Covid-19", "description": "British Prime Minister Boris Johnson continued a tour of Scotland after a member of his team tested positive for Covid-19, deciding not to self-isolate even as others on the trip did.", "url": "https://www.cnn.com/2021/08/06/uk/boris-johnson-staffer-covid-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705140904-boris-johnson-july-5-2021-01-super-tease.jpg", "publishedAt": "2021-08-06T15:07:29Z", "content": "London (CNN)British Prime Minister Boris Johnson continued a tour of Scotland after a member of his team tested positive for Covid-19, deciding not to self-isolate even as others on the trip did.\r\nDo… [+3378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Community rallies behind kids after money is stolen from lemonade stand", "description": "Police in Ames, Iowa, rallied the community to support two kids after the money they earned from their lemonade stand was stolen.", "url": "https://www.cnn.com/videos/us/2021/08/06/lemonade-money-stolen-community-rallies-kids-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806105154-iowa-lemonade-stand-super-tease.jpeg", "publishedAt": "2021-08-06T15:01:57Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "How nail art became an Olympic beauty ritual", "description": "With patriotic manicures pioneered by Flo-Jo in the '80s, Olympic nail art has become a form of soft diplomacy and self-expression for uniformed athletes.", "url": "https://www.cnn.com/style/article/olympic-nail-art-manicure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805062303-09-olympic-nail-art-092588-file-super-tease.jpg", "publishedAt": "2021-08-06T15:00:46Z", "content": "beautyPublished 6th August 2021\r\nAs Olympic sprinter Dina Asher-Smith sailed over the finish line in the women's 100 meter semifinals, photos captured her vibrant blue nails as she celebrated. It may… [+6786 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Tapp", "title": "Be your own hairdresser with these top-rated hair products", "description": "Check out these top-rated hairstyling tools, products and accessories to keep your tresses looking beautiful in between appointments or if there's another lockdown in the future. From shampoo, conditioner and must-have hair care to the styling tools and acces…", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/canada-hair-products/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803071828-canada-hair-products-lead-super-169.jpg", "publishedAt": "2021-08-06T14:55:13Z", "content": "Across the country, hair salons are finally opening again after different province- and territory-wide lockdowns had us all sporting mullets and grown-out bangs. Though, following months of colouring… [+5014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "12 incredible beauty finds from Nordstrom's Anniversary Sale", "description": "Nordstrom's Anniversary Sale is known to drop prices on major beloved beauty brands like Tom Ford, Charlotte Tilbury, Kiehl's, Briogeo and so many more.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/beauty-deals-nordstrom-anniversary-sale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805105052-nordstrom-anniversary-sale-2021-campaign-12-super-169.jpg", "publishedAt": "2021-08-06T14:52:41Z", "content": "Theres a reason Nordstroms Anniversary Sale is considered the retailers event of the year; thousands of products across different categories from clothes to accessories to home goods see major price … [+4011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "Save on supplies for next semester with these back-to-school sales", "description": "You'll find deals on all sorts of supplies, including tech, dorm decor, clothes and more. Read on to find out where to spend your money smartly before class is back in session.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/back-to-school-sales-deals-updated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729124651-bts-lead-super-169.jpg", "publishedAt": "2021-08-06T14:48:48Z", "content": "It might still be midsummer, but fall and all that comes with it will be here in no time. If that means heading back to school for you or a member of your household, you can save on everything you ne… [+9727 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "They predicted a Trump coup attempt. Hear what they say now", "description": "In 2019, Jerry Goldfeder, who teaches election law at Fordham Law School, and Lincoln Mitchell, who teaches in  political science department at Columbia University, predicted that then President Donald Trump would attempt to overturn the 2020 election if he l…", "url": "https://www.cnn.com/videos/politics/2021/08/06/assault-on-democracy-election-experts-predicted-trump-coup-goldfeder-mitchell-newday-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711201210-trump-cpac-dallas-0711-super-tease.jpg", "publishedAt": "2021-08-06T14:45:35Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop this weekend: S'well, Theragun, Keurig and more", "description": "Today, you'll find a deal on S'well, Macy's home goods and savings on a Theragun bundle. All that and more below.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806102149-0806lead-super-169.jpg", "publishedAt": "2021-08-06T14:45:34Z", "content": "Today, youll find a deal on Swell, Macys home goods and savings on a Theragun bundle. All that and more below.\r\nSwells is offering another summer promotion, but this one only lasts until Sunday, Augu… [+14012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Cori Bush", "title": "Rep. Cori Bush: I slept on the Capitol steps because I've been evicted three times in my life", "description": "Missouri Rep. Cori Bush writes about what motivated her to sleep on the Capitol steps until an extension on eviction protection was in place. She recounts the the three times she found herself evicted, one time after a domestic abuse situation and writes that…", "url": "https://www.cnn.com/2021/08/06/opinions/sleep-on-capitol-steps-for-eviction-moratorium-motivation-cori-bush/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210731185753-cori-bush-eviction-moratorium-capitol-steps-malveaux-sot-nr-vpx-00005210-super-tease.jpg", "publishedAt": "2021-08-06T14:44:54Z", "content": "Rep. Cori Bush is a Democrat from Missouri. The opinions expressed in this commentary are solely her own. View more opinion on CNN.\r\n (CNN)This week, the limitless power of people was on full display… [+4050 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David Axelrod, CNN Senior Political Commentator", "title": "DeSantis' cynical move on Covid-19", "description": "Where you might see tragic, unnecessary loss and suffering as Covid-19 surges again across Florida -- the epicenter of the wave -- Florida's governor apparently sees something else: opportunity, writes David Axelrod. In his defiant pose against health officia…", "url": "https://www.cnn.com/2021/08/06/opinions/whats-in-it-for-desantis-axelrod/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806092330-desantis-for-axelrod-super-tease.jpg", "publishedAt": "2021-08-06T14:44:24Z", "content": "David Axelrod, a senior CNN political commentator and host of \"The Axe Files,\" was a senior adviser to President Barack Obama and chief strategist for the 2008 and 2012 Obama presidential campaigns. … [+3552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks and Dakin Andone, CNN", "title": "California hydropower plant forced to shut down as water levels fall at Lake Oroville", "description": "A major California hydroelectric power plant has been forced to shut down due to low water levels for the first time since it opened in 1967, officials said Thursday, as the state grapples with an unrelenting drought.", "url": "https://www.cnn.com/2021/08/06/us/lake-oroville-water-level-power-plant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806083545-lake-oroville-california-07-22-2021-super-tease.jpg", "publishedAt": "2021-08-06T14:33:36Z", "content": "(CNN)A major California hydroelectric power plant has been forced to shut down due to low water levels for the first time since it opened in 1967, officials said Thursday, as the state grapples with … [+2854 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Camille Furst", "title": "Coast Guard offloads a record $1.4 billion in drugs", "description": "The Coast Guard on Thursday offloaded the largest amount of illegal narcotics in its history.", "url": "https://www.cnn.com/2021/08/06/us/coast-guard-narcotics-record/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806094149-01-coast-guard-narcotics-record-super-169.jpg", "publishedAt": "2021-08-06T14:33:24Z", "content": "The Coast Guard on Thursday offloaded the largest amount of illegal narcotics in its history.\r\nThe Cutter James crew in Port Everglades, Florida, had seized 59,700 pounds of cocaine and 1,430 pounds … [+1172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellen McAlpine", "title": "Cool, colorful, and stylish bands to pair with your Apple Watch", "description": "Whether you need a durable band for working out or a cool, fashionable one for the office, there are plenty of Apple Watch bands to choose from. We rounded up our favorites from top brands such as Apple, Nomad and more.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/best-apple-watch-bands/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200916230744-3-apple-watch-series-6-first-impressions-underscored-super-169.jpg", "publishedAt": "2021-08-06T14:28:31Z", "content": "Your Apple Watch does a lot from making calls to tracking workouts so it only makes sense youd pair it with a cool band that serves not only function, but also fashion.\r\nWhether youre looking for a s… [+6664 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Krol", "title": "Here's what you need to know before taking an ASL course, according to experts", "description": "Starting the journey to learn a new language isn't so simple. To help identify what people need to look for in a quality ASL course, we reached out to experts in ASL and created this guide on where those interested in learning ASL can get started.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/learn-asl-online/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806092337-learn-asl-online-lead-super-169.jpg", "publishedAt": "2021-08-06T14:25:16Z", "content": "Starting the journey to learn a new language isnt so simple. With myriad online resources for language learners, you need to do your due diligence to ensure youre using high-quality tools to accurate… [+9652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toyin Owoseje", "title": "Juventus apologizes for racist post shared on women's team's Twitter feed", "description": "Juventus has apologized after a tweet was posted on its women's team's official account showing a player making a racist gesture towards Asian people.", "url": "https://www.cnn.com/2021/08/06/football/juventus-racist-post-asians-intl-scli-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806104856-cecilia-salvai-juventus-file-restricted-super-169.jpg", "publishedAt": "2021-08-06T14:21:51Z", "content": "Juventus has apologized after a tweet was posted on its womens teams official account showing a player making a racist gesture towards Asian people.\r\nThe Italian soccer club sparked outrage on Thursd… [+1991 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Taylor Swift drops cryptic video for re-release of 'Red'", "description": "Taylor Swift is hinting at the music and collaborators on the long-awaited re-release of \"Red.\"", "url": "https://www.cnn.com/2021/08/06/entertainment/taylor-swift-video-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419174855-taylor-swift-record-showbiz-pkg-00000525-super-tease.jpg", "publishedAt": "2021-08-06T14:02:43Z", "content": "THESE ARE ALL WORDS IN THE PUZZLE!!!!nothing, first, forever, ronan, about, message, winter, thing, every, chris, stapleton, sheeran, stone, think, bottle, better, nights, minute, phoebe, bridgers!!!… [+56 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lesley Kennedy", "title": "20 of the most anticipated new books to read this August", "description": "August's new book releases offer something for a slew of preferred areas of study. Love history? You'll find biographies, memoirs and historical fiction. Practically major in thrillers? Stephen King and Paula Hawkins both have new offerings.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/best-books-august-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803124848-augustbookslead-super-169.jpg", "publishedAt": "2021-08-06T13:57:20Z", "content": "As back to school season begins, it seems an appropriate time to add to your own reading syllabi. Augusts new book releases offer something for a slew of preferred areas of study. Love history? Youll… [+7438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Janja Garnbret becomes first woman to win a climbing gold medal at the Olympics", "description": "Janja Garnbret has become the first woman to win a gold medal in sports climbing at the Olympics, thanks largely to masterful bouldering and lead performances.", "url": "https://www.cnn.com/2021/08/06/sport/janja-garnbret-sports-climbing-tokyo-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806093450-01-janja-garnbret-climbing-final-0806-super-tease.jpg", "publishedAt": "2021-08-06T13:51:43Z", "content": "Aomi Urban Sports Park, Tokyo (CNN)As night descended on Tokyo, the climbing wall at the Aomi Urban Sports Park was bathed in light.\r\nIt was there that Janja Garnbret became the first woman to win a … [+2752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Janja Garnbret becomes first woman to win a climbing gold medal at the Olympics", "description": "Janja Garnbret has become the first woman to win a gold medal in sports climbing at the Olympics, thanks largely to masterful bouldering and lead performances.", "url": "https://www.cnn.com/2021/08/06/sport/janja-garnbret-sports-climbing-tokyo-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806093450-01-janja-garnbret-climbing-final-0806-super-tease.jpg", "publishedAt": "2021-08-06T13:51:43Z", "content": "Aomi Urban Sports Park, Tokyo (CNN)As night descended on Tokyo, the climbing wall at the Aomi Urban Sports Park was bathed in light.\r\nIt was there that Janja Garnbret became the first woman to win a … [+2752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan", "title": "A crucial ocean circulation is showing signs of instability. Its shutdown would have serious impacts on our weather.", "description": "A crucial system of currents in the Atlantic Ocean that helps control temperatures in the Northern Hemisphere and has implications for the entire planet's weather systems is showing signs of instability due to human-made climate change, scientists say.", "url": "https://www.cnn.com/2021/08/06/world/climate-gulf-stream-collapse-warning-study-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210519210003-pba-iceberg-super-169.jpg", "publishedAt": "2021-08-06T13:43:27Z", "content": "A crucial system of currents in the Atlantic Ocean that helps control temperatures in the Northern Hemisphere and has implications for the entire planets weather systems is showing signs of instabili… [+4206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Annette' turns Adam Driver loose in a musical that falls woefully flat", "description": "\"Annette\" premiered at the Cannes Film Festival, buoyed by the intriguing tandem of Adam Driver and Marion Cotillard in an original musical. The resulting movie, however, hits the wrong notes, repeating mundane lyrics without uttering the words that keep comi…", "url": "https://www.cnn.com/2021/08/06/entertainment/annette-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804114858-adam-driver-annette-super-tease.jpg", "publishedAt": "2021-08-06T13:32:34Z", "content": "(CNN)\"Annette\" premiered at the Cannes Film Festival, buoyed by the intriguing tandem of Adam Driver and Marion Cotillard in an original musical. The resulting movie, however, hits the wrong notes, r… [+2907 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kami Phillips", "title": "All the Target stuff you need to make your dorm your dream space", "description": "Target is a one-stop shop for affordable bedding, bath essentials, room decor, furniture, appliances, storage solutions and so much more that will help get your college freshman settled into their new space.", "url": "https://www.cnn.com/2021/08/06/cnn-underscored/target-college-dorm-essentials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726093904-target-dorm-essentials-lead-super-169.jpg", "publishedAt": "2021-08-06T13:29:14Z", "content": "With hundreds of college-ready items just a click away, Target is a one-stop shop for affordable bedding, bath essentials, room decor, furniture, appliances, storage solutions and so much more. The b… [+4465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry and Brian Lowry", "title": "'Mr. Corman' earns extra credit thanks to Joseph Gordon-Levitt", "description": "In \"Mr. Corman,\" it's Apple that gets a teacher, although it's a decidedly bittersweet one.", "url": "https://www.cnn.com/2021/08/06/entertainment/mr-corman-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803141545-01-mr-corman-apple-plus-super-169.jpg", "publishedAt": "2021-08-06T13:25:56Z", "content": "In Mr. Corman, its Apple that gets a teacher, although its a decidedly bittersweet one.\r\nThree little words explain Apple TV+s interest in Mr. Corman, and those are Joseph Gordon-Levitt, who created,… [+2589 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Coy Wire and Sana Noor Haq", "title": "\"Don't let anybody stop you, get out there and prove people wrong\": 13-year-old bronze medalist Sky Brown on empowering a new generation of skateboarders", "description": "When Sky Brown took her last run in the women's park skateboarding final at the Tokyo Olympics, she knew she had to step up.", "url": "https://www.cnn.com/2021/08/06/sport/sky-brown-skateboarding-new-generation-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806065204-04-sky-brown-olympics-080221-restricted-super-169.jpg", "publishedAt": "2021-08-06T13:20:28Z", "content": "When Sky Brown took her last run in the womens park skateboarding final at the Tokyo Olympics, she knew she had to step up. \r\nMaking mistakes in her first two runs, she went into her final attempt a … [+3215 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue", "title": "Eviction moratorium needed due to 'deteriorating public health situation' related to the Delta variant, DOJ says", "description": "Justice Department lawyers defended the Biden administration's most recent eviction moratorium Friday telling a federal judge that because of the \"deteriorating public health situation\" related to the Delta variant, the US Centers for Disease Control and Prev…", "url": "https://www.cnn.com/2021/08/06/politics/doj-response-cdc-eviction-moratorium/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804133314-housing-advocates-eviction-protest-0804-super-169.jpg", "publishedAt": "2021-08-06T13:17:24Z", "content": "Justice Department lawyers defended the Biden administrations most recent eviction moratorium Friday telling a federal judge that because of the deteriorating public health situation related to the D… [+2476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In photos: Europe battles wildfires amid scorching heatwaves", "description": "A summer of record-setting heat in southern Europe has set off devastating wildfires that have torn through forests, homes and destroyed vital infrastructure from Turkey to Spain.", "url": "https://www.cnn.com/2021/08/06/world/gallery/europe-extreme-summer-weather-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806120843-12-europe-extreme-weather-0805-greece-super-tease.jpg", "publishedAt": "2021-08-06T13:15:59Z", "content": "Firefighters try to extinguish a wildfire near the town of Olympia, Greece on Thursday, August 5.\r\nUpdated 9:15 AM ET, Fri August 6, 2021\r\nFirefighters try to extinguish a wildfire near the town of O… [+927 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam", "title": "Fact-checking Republican attempts to blame inflation on Democrats", "description": "As the US economy gradually recovers from the coronavirus pandemic, prices are rising across the board with inflation exceeding the Federal Reserve's 2% target and reaching a 13-year high in June. Republicans have turned that jump in inflation into a politica…", "url": "https://www.cnn.com/2021/08/06/politics/inflation-gop-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210728121814-us-inflation-prices-0610-super-169.jpg", "publishedAt": "2021-08-06T13:14:51Z", "content": "As the US economy gradually recovers from the coronavirus pandemic, prices are rising across the board with inflation exceeding the Federal Reserves 2% target and reaching a 13-year high in June. Rep… [+7216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Valentino Rossi calls time on MotoGP, looks to cars", "description": "Valentino Rossi, one of the greatest and most charismatic of motorcycling champions, called time on his MotoGP career on Thursday and looked forward to a future in car racing.", "url": "https://www.cnn.com/2021/08/06/sport/valentino-rossi-retirement-plan-motogp-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806090728-02-valentino-rossi-0806-super-tease.jpg", "publishedAt": "2021-08-06T13:13:34Z", "content": "Valentino Rossi, one of the greatest and most charismatic of motorcycling champions, called time on his MotoGP career on Thursday and looked forward to a future in car racing.\r\nThe 42-year-old Italia… [+2952 chars]"}]}