{"status": "ok", "totalResults": 172, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Man selling catalytic convertor online left a bag of meth in the photo, sheriff's office says", "description": "A man selling a catalytic convertor on Facebook Marketplace left a large bag of methamphetamine and a syringe on the coffee table in the background of the picture he posted, the Stone County Sheriff's Office in Missouri said in a post on Facebook.", "url": "https://www.cnn.com/2021/10/01/us/marketplace-catalytic-convertor-bag-of-meth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001194656-01-catalytic-convertor-meth-super-tease.jpg", "publishedAt": "2021-10-02T01:57:30Z", "content": "(CNN)A man selling a catalytic converter on Facebook Marketplace left a large bag of methamphetamine and a syringe on the coffee table in the background of the picture he posted, the Stone County She… [+1338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Gabrielle Giffords", "title": "Gabby Giffords: This will make a difference in fighting gun violence", "description": "Survivors of high-profile mass shootings often talk about the swarm of media attention that leaves as suddenly as it comes. One day, everyone wants to talk to you, hear your perspective, share in your pain. The next, they're gone, and all that's left is silen…", "url": "https://www.cnn.com/2021/10/01/opinions/gabrielle-giffords-gun-violence-in-communities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200819212409-gabrielle-giffords-dnc-2020-super-tease.jpg", "publishedAt": "2021-10-02T01:26:26Z", "content": "Gabrielle Giffords represented Arizona's 8th district in Congress from 2007 to 2012. She's the founder of the gun violence prevention organization Giffords. The views expressed in this commentary are… [+5738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "South Dakota Gov. Noem says she didn't ask for 'special treatment' for daughter seeking real estate appraiser certification", "description": "South Dakota Gov. Kristi Noem said in a new video Friday that she never asked for \"special treatment\" from the state for her daughter as she was seeking to become a state-certified real estate appraiser, and that her daughter completed the same requirements a…", "url": "https://www.cnn.com/2021/10/01/politics/kristi-noem-south-dakota-investigation-video/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001201959-restricted-kristi-noem-07-11-2021-super-tease.jpg", "publishedAt": "2021-10-02T00:42:25Z", "content": "(CNN)South Dakota Gov. Kristi Noem said in a new video Friday that she never asked for \"special treatment\" from the state for her daughter as she was seeking to become a state-certified real estate a… [+5406 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Cheung and Brad Lendon, CNN", "title": "China sends more than three dozen warplanes in skies near Taiwan in largest incursion yet", "description": "China sent 38 warplanes into the skies around Taiwan on Friday, the highest number of Chinese military aircraft to breach the island's Air Defense Identification Zone in a single day since Taipei began publicly reporting such activities last year, Tawain's De…", "url": "https://www.cnn.com/2021/10/01/asia/china-taiwan-warplane-incursion-record-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001202056-j-16-fighter-file-super-tease.jpg", "publishedAt": "2021-10-02T00:28:02Z", "content": "Taipei, Taiwan (CNN)China sent 38 warplanes into the skies around Taiwan on Friday, the highest number of Chinese military aircraft to breach the island's Air Defense Identification Zone in a single … [+3261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Amy Bass", "title": "The horrific cost of not hearing what women athletes are telling us", "description": "The allegations against former National Women's Soccer League coach Paul Riley echo a pattern of the lack of accountability all too familiar to women, athletes or otherwise, that keeps recurring -- from the testimony of gymnasts before a Congressional committ…", "url": "https://www.cnn.com/2021/10/01/opinions/paul-riley-nwsl-soccer-sexual-coercion-allegations-bass/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001182544-03-paul-riley-file-super-tease.jpg", "publishedAt": "2021-10-01T23:30:26Z", "content": "Amy Bass (@bassab1) is a professor of sport studies at Manhattanville College and the author of \"One Goal: A Coach, a Team, and the Game That Brought a Divided Town Together\" and \"Not the Triumph but… [+6626 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Devon M. Sayers, CNN", "title": "Alabama GOP governor signs bills to use Covid-19 relief funds to build prisons into law", "description": "Alabama Gov. Kay Ivey signed into law Friday a number of prison infrastructure bills, which will use Covid-19 relief funds to build new prisons in the state, calling it a \"pivotal moment for the trajectory of our state's criminal justice system.\"", "url": "https://www.cnn.com/2021/10/01/politics/alabama-covid-relief-prison-bills-signed-governor-kay-ivey/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001172342-screengrab-kay-ivey-10-01-2021-super-tease.jpg", "publishedAt": "2021-10-01T23:01:26Z", "content": "Washington, DC (CNN)Alabama Gov. Kay Ivey signed into law Friday a number of prison infrastructure bills that will use coronavirus relief funds to build new prisons in the state, calling it a \"pivota… [+3504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "After a family member died of Covid-19, a man took aim at Florida's top health official in sarcastic letter", "description": "At first glance, Charles Chamberlain's letter to the editor of the Tampa Bay Times seems to praise Florida's new surgeon general for his observation that the natural immunity that comes from being infected with Covid-19 provides \"great protection\" from the co…", "url": "https://www.cnn.com/2021/10/01/us/covid-19-letter-to-the-editor-tampa-bay-times/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001093041-joseph-ladapo-0922-restricted-super-tease.jpg", "publishedAt": "2021-10-01T22:56:29Z", "content": "(CNN)At first glance, Charles Chamberlain's letter to the editor of the Tampa Bay Times seems to praise Florida's new surgeon general for his observation that the natural immunity that comes from bei… [+5816 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Dezenski, CNN", "title": "The week in 13 headlines", "description": "This week, all eyes were on Capitol Hill as constantly shifting negotiations highlighted the split between moderates and progressives in the Democratic caucus, all amid efforts to pass a bipartisan infrastructure package and a budget bill that includes many o…", "url": "https://www.cnn.com/2021/10/01/politics/week-in-review-congress-shutdown-infrastructure-reconciliation-biden-agenda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930145319-manchin-media-0930-super-tease.jpg", "publishedAt": "2021-10-01T22:32:43Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The utter radicalness of Joe Biden's presidency", "description": "Joe Biden has been president of the United States for a little over eight months now. And he may well be on the verge of radically overhauling the relationship between the federal government and the average American in ways that will linger well beyond his fi…", "url": "https://www.cnn.com/2021/10/01/politics/biden-radical-presidency/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/151021173532-biden-laugh-aviators-super-tease.jpg", "publishedAt": "2021-10-01T22:30:50Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Ozy Media is shutting down after a week of scrutiny into its business", "description": "Ozy Media announced on Friday that it will cease operations. The announcement comes five days after the The New York Times published a bombshell report about its business practices, which kicked off additional scrutiny from other media outlets.", "url": "https://www.cnn.com/2021/10/01/media/ozy-media-shuts-down/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928103137-01-carlos-watson-ozy-file-super-tease.jpg", "publishedAt": "2021-10-01T22:00:46Z", "content": "New York (CNN Business)Ozy Media announced on Friday that it will cease operations. The announcement comes five days after the The New York Times published a bombshell report about its business pract… [+1126 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Rebekah Riess", "title": "Couple and their dog attacked by bear on Blue Ridge Parkway", "description": "A couple was attacked by a bear and treated for injuries Wednesday evening on the Blue Ridge Parkway near Asheville, North Carolina, according to a release from the Blue Ridge Parkway National Park Service.", "url": "https://www.cnn.com/travel/article/bear-attack-blue-ridge-parkway/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001174902-01-nc-brear-attack-super-tease.jpg", "publishedAt": "2021-10-01T21:58:13Z", "content": "(CNN) A couple was attacked by a bear and treated for injuries Wednesday evening on the Blue Ridge Parkway near Asheville, North Carolina, according to a release from the Blue Ridge Parkway National … [+1644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Kristi Noem gets it", "description": "Will the South Dakota governor's loose relationship with the facts bother former President Donald Trump as he considers a 2024 veep choice? Are you kidding? asks Michael D'Antonio. Trump would consider it a definite plus, he writes, especially if he reflects …", "url": "https://www.cnn.com/2021/10/01/opinions/kristi-noem-donald-trump-2024-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210127184030-kristi-noem-0103-super-tease.jpg", "publishedAt": "2021-10-01T21:44:03Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+7042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "5 historical garments that showcase the link between fashion and identity", "description": "From Penn Museum's new exhibit \"The Stories We Wear,\" here are five garments that display how fashion has been used to communicate power from over 1,000 years ago to now.", "url": "https://www.cnn.com/style/article/stories-we-wear-penn-museum-exhibit-artifacts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930134714-06-stories-we-wear-exhibit-restricted-super-tease.jpg", "publishedAt": "2021-10-01T21:31:36Z", "content": "Inherent in fashion is the notion of becoming: Our sartorial choices can tell a story of who we are or who we want to be. In many ways, stepping into an outfit can be one of the most powerful acts of… [+5134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "DHS intelligence branch sent 'untrained, inexperienced' intel collectors to Portland, internal review finds", "description": "An internal review of the Department of Homeland Security intelligence branch revealed an unprepared and ill-trained workforce was thrown into assisting with intelligence collection amid the civil unrest in Portland, Oregon, in summer 2020, contributing to th…", "url": "https://www.cnn.com/2021/10/01/politics/dhs-intelligence-branch-portland-internal-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001151117-01-portland-protests-2020-super-tease.jpg", "publishedAt": "2021-10-01T21:06:12Z", "content": "(CNN)An internal review of the Department of Homeland Security intelligence branch revealed an unprepared and ill-trained workforce was thrown into assisting with intelligence collection amid the civ… [+6715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Darren Murph", "title": "Lower your expenses by getting one of these credit cards with no annual fee", "description": "Choosing a credit card with no annual fee is a great way to shrink your household expenses, and the right no-annual-fee card can still offer rewards, protections and perks.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-no-annual-fee-credit-cards/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200422153531-underscored-cash-and-calculator.jpg?q=x_0,y_0,h_2174,w_3863,c_fill/w_800", "publishedAt": "2021-10-01T20:40:30Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+26505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Judge says DOJ should be 'even-handed' in treatment of Capitol rioters", "description": "A federal judge said Friday that he believes the Justice Department hasn't been \"even-handed\" with President Donald Trump supporters who stormed the US Capitol on January 6, suggesting that they've been treated more harshly than the rioters in last year's rac…", "url": "https://www.cnn.com/2021/10/01/politics/capitol-riot-mcfadden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001161657-judge-trevor-mcfadden-super-tease.jpg", "publishedAt": "2021-10-01T20:28:39Z", "content": "(CNN)A federal judge said Friday that he believes the Justice Department hasn't been \"even-handed\" with President Donald Trump supporters who stormed the US Capitol on January 6, suggesting that they… [+2747 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Scarlett Johansson and Disney agree to end lawsuit", "description": "Scarlett Johansson and Disney resolved their dispute over the lawsuit that Johansson filed against the company. She alleged that Disney breached her contract by releasing \"Black Widow,\" a Marvel film starring the actress, on Disney+ on the same day it was rel…", "url": "https://www.cnn.com/videos/media/2021/10/01/scarlett-johansson-disney-end-lawsuit-firstmove-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200202143830-19-bafta-red-carpet-super-tease.jpg", "publishedAt": "2021-10-01T19:49:03Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "TV OT: The spooky TV that made a generation of horror fans. Plus, Halloween programming, \"Maid\" and \"Billions\"", "description": "As I sit down to write my annual defense of Candy Corn, enjoy this week's TV OT: Halloween TV, \"Maid,\" \"Grey's Anatomy,\" Billions\" and more to watch.", "url": "https://www.cnn.com/2021/10/01/entertainment/what-to-watch-halloween-tv-maid-billions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001143304-tales-from-the-crypt-restricted-super-tease.jpg", "publishedAt": "2021-10-01T19:46:02Z", "content": "TV OT is a weekly look at what CNN's entertainment team is watching since too much television has us all working overtime.\r\n (CNN)As I sit down to write my annual defense of Candy Corn, enjoy this we… [+7028 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Mercury mission to fly by closest planet to the sun for the first time", "description": "The BepiColombo space mission will make its first flyby of Mercury around 7:34 p.m. ET on Friday and pass within 124 miles (200 kilometers) of the planet's surface. During the flyby, BepiColombo will collect science data and images and send them back to Earth.", "url": "https://www.cnn.com/2021/10/01/world/bepicolombo-first-mercury-flyby-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181019100713-01-bepicolombo-mercury-super-tease.jpg", "publishedAt": "2021-10-01T19:15:22Z", "content": "(CNN)Mercury, the smallest planet in our solar system, is all set for a rendezvous with a spacecraft. \r\nThe BepiColombo mission will make its first flyby of Mercury around 7:34 p.m. ET on Friday and … [+5555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Blue Origin: Essay alleges sexism, 'dehumanizing' culture at Jeff Bezos' rocket company", "description": "A group of 21 current and former employees at Blue Origin, the rocket company founded by Jeff Bezos, co-signed an essay speaking out against what they describe as a toxic workplace where \"professional dissent\" is \"actively stifled,\" and certain male leaders r…", "url": "https://www.cnn.com/2021/10/01/tech/blue-origin-workplace-culture-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001143444-blue-origin-file-super-tease.jpg", "publishedAt": "2021-10-01T19:14:45Z", "content": "I was like, 'Wow, now I see how the most powerful person in the world uses their power.' They use it to continually shore up their position and disempower people around them.\r\nAlexandra Abrams, forme… [+44 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, Lauren Fox, Ryan Nobles, Clare Foran and Daniella Diaz, CNN", "title": "Infrastructure negotiations drag on as Biden plans to go to the Hill", "description": "President Joe Biden is heading to Capitol Hill on Friday afternoon as congressional Democratic leaders scramble to secure a last-minute deal on a major economic package and find a way to resolve divisions between moderates and progressives that have put passa…", "url": "https://www.cnn.com/2021/10/01/politics/house-vote-infrastructure-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210429104348-02-joe-biden-congress-0428-super-tease.jpg", "publishedAt": "2021-10-01T19:12:46Z", "content": "(CNN)President Joe Biden is heading to Capitol Hill on Friday afternoon as congressional Democratic leaders scramble to secure a last-minute deal on a major economic package and find a way to resolve… [+4672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz", "title": "Man charged in Fanone assault at Capitol to remain in jail after emotional hearing", "description": "A New York man charged in the grizzly assault of DC Metropolitan Police Officer Michael Fanone will remain in jail while he awaits trail, a federal judge ruled on Friday after an emotional court hearing.", "url": "https://www.cnn.com/2021/10/01/politics/sibick-capitol-riot-fanone/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210312213927-thomas-sibick-super-tease.jpg", "publishedAt": "2021-10-01T19:06:26Z", "content": "(CNN)A New York man charged in the grizzly assault of DC Metropolitan Police Officer Michael Fanone will remain in jail while he awaits trail, a federal judge ruled on Friday after an emotional court… [+2442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "White House explored whether administration could make payments after debt ceiling breached", "description": "Senior White House officials explored whether the US could unilaterally continue payments should the debt ceiling be breached in mid-October but ultimately concluded it would not be possible to avoid default and economic catastrophe, a person with direct know…", "url": "https://www.cnn.com/2021/10/01/politics/debt-ceiling-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210704190844-white-house-exterior-0703-super-tease.jpg", "publishedAt": "2021-10-01T18:36:04Z", "content": "(CNN)Senior White House officials explored whether the US could unilaterally continue payments should the debt ceiling be breached in mid-October but ultimately concluded it would not be possible to … [+4085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Anchorage mayor apologizes after saying protesters' use of Star of David to oppose mask mandate is 'credit' to Jews", "description": "The mayor of Anchorage, Alaska, apologized this week after he said that some residents' decisions to wear the Star of David -- à la Jews who suffered under Nazi-occupied Europe -- to protest a proposed city mask mandate is a \"credit\" to Jewish people.", "url": "https://www.cnn.com/2021/10/01/politics/anchorage-mayor-coronavirus-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001125422-01-anchorage-mayor-star-of-david-comments-super-tease.jpg", "publishedAt": "2021-10-01T18:35:02Z", "content": "(CNN)The mayor of Anchorage, Alaska, apologized this week after he said that some residents' decisions to wear the Star of David -- à la Jews who suffered under Nazi-occupied Europe -- to protest a p… [+4240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hayley Saltzman", "title": "The best office chairs in 2021: Tried and tested", "description": "CNN Underscored tried and tested a dozen top-rated office chairs to find the best one.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-office-chair/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/201105164913-best-office-chair-lead-kw.jpg?q=x_0,y_0,h_1406,w_2500,c_fill/w_800", "publishedAt": "2021-10-01T18:32:52Z", "content": "If youre working from home, one key upgrade you should make is swapping out that dining room chair for an actual desk chair that wont lead to lower back pain.\r\nIn an effort to discover which office c… [+16920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Pat Robertson steps down as regular host of 'The 700 Club'", "description": "The famed televangelist and founder of the Christian Broadcasting Network announced his retirement on Friday's episode. His son and current CBN CEO, Gordon, will take over as host.", "url": "https://www.cnn.com/2021/10/01/us/pat-robertson-leaves-700-club-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001134245-pat-robertson-file-super-tease.jpg", "publishedAt": "2021-10-01T18:28:34Z", "content": "(CNN)Pat Robertson, famed televangelist and founder of the Christian Broadcasting Network, has stepped down as host of the long-running Christian talk show \"The 700 Club.\"\r\nThe 91-year-old announced … [+1676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Snowcone the Happy Unicorn is the latest victim of manufacturing chaos", "description": "The holiday season isn't looking so merry for Dena Fargo this year. Her best-selling toy, a multi-colored, smiling stuffed animal called Snowcone The Happy Unicorn, won't make it to eager parents and kids this year.", "url": "https://www.cnn.com/2021/10/01/business/supply-chain-small-business-holiday-shopping/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001095614-toy-store-supply-chain-080221-file-super-tease.jpg", "publishedAt": "2021-10-01T18:00:46Z", "content": "New York (CNN Business)The holiday season isn't looking so merry for Dena Fargo this year. Her best-selling toy, a multi-colored, smiling stuffed animal called Snowcone The Happy Unicorn, won't make … [+5536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Barber, CNN", "title": "Pumpkin spice really does give you the warm fuzzies — here's the science of why", "description": "If you're suddenly craving pumpkin spice lattes or pumpkin bread now that it's officially fall, it's not just your stomach talking. Catching a whiff of a pumpkin spice-flavored food or drink can trigger emotions and memories that go deeper than a hunger pang.", "url": "https://www.cnn.com/2021/10/01/health/pumpkin-spice-smell-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928180917-01-pumpkin-spice-super-tease.jpg", "publishedAt": "2021-10-01T17:54:47Z", "content": "(CNN)If you're suddenly craving pumpkin spice lattes or pumpkin bread now that it's officially fall, it's not just your stomach talking. Catching a whiff of a pumpkin spice-flavored food or drink can… [+5030 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Nate Berkus and Jeremiah Brent's new home renovation show has real heart", "description": "Nate Berkus and Jeremiah Brent, married designers with two children, are all about the heart of a home -- and so is their new renovation show.", "url": "https://www.cnn.com/2021/10/01/entertainment/nate-berkus-jeremiah-brent-show-tv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930134052-01-jeremiah-brent-and-nate-berkus-super-tease.jpg", "publishedAt": "2021-10-01T17:34:07Z", "content": "(CNN)Nate Berkus and Jeremiah Brent, married designers with two children, are all about the heart of a home.\r\nSo when they were producing their new HGTV series \"The Nate &amp; Jeremiah Home Project,\"… [+3325 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Wallace, CNN", "title": "Nearly 4,000 federal employees furloughed after Congress lets highway funding lapse", "description": "Nearly 4,000 federal employees are off the job on Friday because Congress failed to extend highway funding, a Transportation Department spokesperson told CNN.", "url": "https://www.cnn.com/2021/10/01/politics/highway-funding-lapse-furlough/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930105440-03-us-capitol-0930-super-tease.jpg", "publishedAt": "2021-10-01T17:30:11Z", "content": "(CNN)Nearly 4,000 federal employees are off the job on Friday because Congress failed to extend highway funding, a Transportation Department spokesperson told CNN. \r\nThe funding lapsed as a result of… [+2061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wallace", "title": "The best bath towels of 2021", "description": "CNN Underscored tested nine top-reviewed and editor-favorite bath towels to find the best options for you.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-bath-towels/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210209102131-best-bath-towels-lead.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "publishedAt": "2021-10-01T17:06:03Z", "content": "One thing that can upgrade your bathing experience immediately? A new towel.\r\nThats why we set out to find the best bath towels on the market, settling on a pool of nine top-reviewed and editor-favor… [+23602 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "Former Malawian lawmaker shoots himself dead in parliament building", "description": "A former member of Malawi's parliament killed himself inside the parliament building in the capital Lilongwe on Thursday, a police spokesman has confirmed to CNN.", "url": "https://www.cnn.com/2021/10/01/africa/malawi-lawmaker-parliament-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001092033-clement-chiwaya-grab-super-tease.jpg", "publishedAt": "2021-10-01T16:50:34Z", "content": "(CNN)A former member of Malawi's parliament killed himself inside the parliament building in the capital Lilongwe on Thursday, a police spokesman has confirmed to CNN.\r\nClement Chiwaya, an ex-deputy … [+1891 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Addams Family 2' hits the road to scare up more laughs", "description": "After its live-action movies in the 1990s, the Addams Family has found a logical foothold in animation, with \"The Addams Family 2\" scaring up enough laughs to merit the return, with a mix of low-brow humor for kids and old-time callbacks certain to sail over …", "url": "https://www.cnn.com/2021/10/01/entertainment/addams-family-2-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929141552-01-addams-family-2-super-tease.jpg", "publishedAt": "2021-10-01T16:28:56Z", "content": "(CNN)After its live-action movies in the 1990s, the Addams Family has found a logical foothold in animation, with \"The Addams Family 2\" scaring up enough laughs to merit the return, with a mix of low… [+2011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Spary, CNN", "title": "Princess Beatrice, Queen's granddaughter, pays tribute to monarch with baby's name", "description": "Princess Beatrice of York, the grandaughter of Queen Elizabeth II, has revealed the name of her baby daughter -- and it includes a touching tribute to the British monarch.", "url": "https://www.cnn.com/2021/10/01/uk/beatrice-baby-name-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001111426-edo-mapelli-mozzi-princess-beatrice-file-0708-super-tease.jpg", "publishedAt": "2021-10-01T16:28:42Z", "content": "(CNN)Princess Beatrice of York, the grandaughter of Queen Elizabeth II, has revealed the name of her baby daughter -- and it includes a touching tribute to the British monarch.\r\nBeatrice and husband … [+2383 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan", "title": "Fitch warns debt ceiling fight could cost America its AAA credit rating", "description": "Fitch Ratings warned Friday that the fight in Washington over raising the debt ceiling could force the firm to downgrade America's AAA credit rating.", "url": "https://www.cnn.com/2021/10/01/economy/credit-rating-debt-ceiling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001112139-us-treasury-building-0722-super-tease.jpg", "publishedAt": "2021-10-01T15:49:52Z", "content": "New York, NY (CNN)Fitch Ratings warned Friday that the fight in Washington over raising the debt ceiling could force the firm to downgrade America's AAA credit rating.\r\n\"The failure of the latest eff… [+2036 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lincoln Mitchell", "title": "Manchin and Sinema are hurting their party more than any Republican ever could", "description": "Lincoln Mitchell writes that failure to pass the infrastructure legislation will damage an already vulnerable President Biden and deprive the Democratic Party of a major accomplishment it can present to the voters in both the 2022 and 2024 elections.", "url": "https://www.cnn.com/2021/10/01/opinions/congressional-democrats-manchin-sinema-infrastructure-mitchell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622173942-01-manchin-sinema-0608-super-tease.jpg", "publishedAt": "2021-10-01T15:39:16Z", "content": "Lincoln Mitchell (@LincolnMitchell) teaches in the School of International and Public Affairs at Columbia University. His most recent book is \"The Giants and Their City: Major League Baseball in San … [+5726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Texans are leaving the state for abortions after Supreme Court ruling, Planned Parenthood clinics say", "description": "Planned Parenthood clinics have seen dramatic increases in the number of people from Texas going out of state to seek abortions since the Texas six-week abortion ban took effect, the group says.", "url": "https://www.cnn.com/2021/10/01/politics/texans-leave-state-for-abortions-planned-parenthood/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210909165913-02-texas-abortion-ban-impact-calls-super-tease.jpg", "publishedAt": "2021-10-01T15:09:36Z", "content": "Washington (CNN)Planned Parenthood clinics have seen dramatic increases in the number ofpeople from Texas going out of state to seek abortions since the Texas six-week abortion ban took effect, the g… [+4999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Multimillion-dollar beach property taken from Black owners in Jim Crow era is cleared to be returned", "description": "A stretch of prime Southern California beachfront real estate can now be returned to the descendants of its rightful Black owners, nearly a century after the parcel was taken by the city of Manhattan Beach.", "url": "https://www.cnn.com/2021/10/01/us/bruces-beach-los-angeles-property-return/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001095539-01-bruce-beach-returned-0930-super-tease.jpg", "publishedAt": "2021-10-01T15:05:31Z", "content": "(CNN)A stretch of prime Southern California beachfront real estate can now be returned to the descendants of its rightful Black owners, nearly a century after the parcel was taken by the city of Manh… [+3419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "The best sales to shop this weekend: Adidas, The North Face, Nest Bedding and more", "description": "Today, you'll find a deal on Adidas, Nest Bedding and savings on The North Face. All that and more below.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211001103751-nest-bedding.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "publishedAt": "2021-10-01T15:03:54Z", "content": "Today, youll find a deal on Adidas, Nest Bedding and savings on The North Face. All that and more below.\r\nSave on sneakers and apparel with Adidas latest promo. The brand is currently offering up to … [+7989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "First on CNN: Biden to convene 30 countries to crack down on ransomware threat", "description": "The White House will convene a 30-country meeting this month to try to ramp up global efforts to address the threat of ransomware to economic and national security, President Joe Biden said in a statement shared exclusively with CNN.", "url": "https://www.cnn.com/2021/10/01/politics/blinken-cybersecurity-alliance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928162201-joe-biden-baker-oped-super-tease.jpg", "publishedAt": "2021-10-01T15:03:49Z", "content": "(CNN)The White House will convene a 30-country meeting this month to try to ramp up global efforts to address the threat of ransomware to economic and national security, President Joe Biden said in a… [+2043 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Treating this like a game': Psaki blasts Republicans as debt ceiling deadline nears", "description": "White House Press Secretary Jen Psaki calls out Republicans as the deadline to raise, or suspend, the debt ceiling looms.", "url": "https://www.cnn.com/videos/economy/2021/10/01/debt-ceiling-deadline-jen-psaki-john-harwood-earlystart-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001102954-jen-psaki-debt-ceiling-sot-thumb-vpx-super-tease.jpeg", "publishedAt": "2021-10-01T14:48:31Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Glen Kamara: Rangers to lodge official complaint over 'racist' booing at midfielder", "description": "Steven Gerrard, manager of Scottish football team, Rangers, says he's \"not surprised\" Sparta Prague fans booed Glen Kamara during their 1-0 defeat in the Europa League on Thursday.", "url": "https://www.cnn.com/2021/10/01/football/glen-kamara-sparta-prague-booing-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001044133-01-glen-kamara-sparta-prague-0930-super-tease.jpg", "publishedAt": "2021-10-01T14:42:02Z", "content": "(CNN)Steven Gerrard, manager of Scottish football team, Rangers, says he's \"not surprised\" Sparta Prague fans booed Glen Kamara during their 1-0 defeat in the Europa League on Thursday.\r\nThe Finnish … [+4241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jane Levere, CNN", "title": "$19,000 a night: Richard Branson's Moskito Island debuts two new luxury estates", "description": "It certainly won't come cheap, but Sir Richard Branson's new private-island getaway in the British Virgin Islands -- where you can stay in a luxurious villa staffed by a private chef and resident manager who creates a \"hyper-personalized\" itinerary for each g…", "url": "https://www.cnn.com/travel/article/moskito-island-richard-branson-british-virgin-islands/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930134215-moskito-island-oasis-view-from-master-super-tease.jpg", "publishedAt": "2021-10-01T14:33:50Z", "content": "(CNN) It certainly won't come cheap, but Richard Branson's new private-island getaway in the British Virgin Islands -- where you can stay in a luxurious villa staffed by a private chef and resident m… [+6263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Andronico", "title": "How to use Bluetooth headphones with Nintendo Switch — and the best ones to buy", "description": "Looking to use your Bluetooth headphones with your Nintendo Switch? Here's how to do it, as well as our picks for the best headphones for your console.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/nintendo-switch-bluetooth-headphones/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210930110230-nintendo-switch-bluetooth-headphones-lead.jpg?q=x_0,y_0,h_900,w_1600,c_fill/w_800", "publishedAt": "2021-10-01T14:13:47Z", "content": "Its time to toss that third-party adapter to the side the Nintendo Switch finally supports Bluetooth headphones. That means your AirPods, Bose headphones or any other Bluetooth-enabled headsets can b… [+1914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Vercelletto", "title": "From scary to sweet, 24 Halloween costumes kids will love", "description": "Halloween costumes for kids are the real thrill of the season. From Tinker Bell and Harry Potter to Baby Yoda and Baby Shark, your kiddo will find a costume to love right here.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/halloween-costume-kids/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210927140236-halloween-costume-kids-lead.jpg?q=x_0,y_0,h_900,w_1601,c_fill/w_800", "publishedAt": "2021-10-01T13:51:49Z", "content": "Halloween was once a day spent warding off the spirits of the dead. But whew it has evolved into a festival of trick-or-treating, parties and magical make-believe. The answer to the question What are… [+7818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Eva Marcille goes from 'Housewives' to playing a madam", "description": "Eva Marcille is loving playing Marilyn Deville, a.k.a. Madam, in the new BET+ series \"All the Queen's Men.\"", "url": "https://www.cnn.com/2021/10/01/entertainment/eva-marcille-all-queens-men/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930133513-all-the-queens-men-bet-super-tease.jpeg", "publishedAt": "2021-10-01T13:49:26Z", "content": "(CNN)Eva Marcille is loving playing Marilyn Deville, a.k.a. Madam, in the new BET+ series \"All the Queen's Men.\"\r\n\"She runs the city of Atlanta, she has multiple businesses,\" Marcille told CNN. \"She … [+1916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Noelle Ike", "title": "Glossier's first-ever eyeshadow palette is gorgeous and easy-to-use", "description": "Ever since spending more time at home, I've opted for a simpler beauty routine: skincare, concealer, brows, mascara and that's about it since you don't need much more to look totally acceptable in a virtual meeting. But in a previous, pre-pandemic life, I was…", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/glossier-monochromes-eyeshadow-launch/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210930125314-glossierlead.jpg?q=x_0,y_0,h_901,w_1602,c_fill/w_800", "publishedAt": "2021-10-01T13:43:43Z", "content": "Ever since spending more time at home, Ive opted for a simpler beauty routine: skincare, concealer, brows, mascara and thats about it since you dont need much more to look totally acceptable in a vir… [+5863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Diana: The Musical' brings the stage to Netflix, but 'The Crown' hangs over its head", "description": "After splendid presentations of \"Hamilton\" and \"Come From Away\" brought theater into homes via other streamers, Netflix adds to the act with a bonus, offering \"Diana: The Musical\" prior to its stage debut. But other productions, including Netflix's own The Cr…", "url": "https://www.cnn.com/2021/10/01/entertainment/diana-the-musical-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927144047-02-diana-the-musical-netflix-super-tease.jpg", "publishedAt": "2021-10-01T13:31:27Z", "content": "(CNN)After splendid presentations of \"Hamilton\" and \"Come From Away\" brought theater into homes via other streamers, Netflix adds to the act with a bonus, offering \"Diana: The Musical\" prior to its s… [+3040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "Editors' picks: 28 things our editors tested and loved in September", "description": "We're committed to highlighting the best products out there, so we've decided to curate roundups of our favorite products we try each month. What did we love in September, you ask? Keep reading to check out the products we're now obsessed with.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/underscored-editors-favorite-products-september/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210929182303-september-dr-dennis-gross-skincare-drx-spectralite-faceware-pro.jpg?q=x_0,y_0,h_957,w_1700,c_fill/w_800", "publishedAt": "2021-10-01T13:30:24Z", "content": "In September, we were introduced to a plethora of products from tech gear to candles to fall fashion pieces. Some were forgettable, while others left a lasting impression. Because were committed to s… [+17975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kai Burkhardt", "title": "16 top-rated fire pits for a cozy backyard this fall", "description": "Fire pits provide a communal space where you can swap stories and roast marshmallows with your friends and family. So this fall, make the most of your backyard with one of our favorite fire pits.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-fire-pits/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210609142436-best-fire-pits-lead-2.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/w_800", "publishedAt": "2021-10-01T13:29:30Z", "content": "Even as the weather gets colder this fall, you dont have to abandon your backyard just yet. If you want to squeeze in a few more weeks of outdoor relaxation, a fire pit is a great way to stay cozy wh… [+5553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jolie Kerr", "title": "Your guide to meal prepping, and the containers that make it easy", "description": "Whether you want to save money by taking your lunch to the office, or you just never have enough time during the week to cook dinner, meal prepping can save time, help you shop smarter, make your money go farther and help you eat healthier.", "url": "https://www.cnn.com/2021/10/01/cnn-underscored/best-meal-prep-containers/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210930103223-best-meal-prep-containers-lead.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_800", "publishedAt": "2021-10-01T13:23:49Z", "content": "Whether you want to save money by taking your lunch to the office, or you just never have enough time during the week to cook dinner, meal prepping can save time, help you shop smarter, make your mon… [+13470 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Many Saints of Newark' tells an origin story, following (again) in 'The Godfather' footsteps", "description": "Origin stories aren't reserved for superheroes, as \"Joker\" made clear. But the mob drama occupies a peculiar niche, with \"The Many Saints of Newark\" following \"The Godfather Part II\" in charting the roots of a crime kingpin, as well as a privileged son who, d…", "url": "https://www.cnn.com/2021/10/01/entertainment/many-saints-and-godfather-mob-origins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629131552-the-many-saints-of-newark-super-tease.jpg", "publishedAt": "2021-10-01T13:22:53Z", "content": "(CNN)Origin stories aren't reserved for superheroes, as \"Joker\" made clear. But the mob drama occupies a peculiar niche, with \"The Many Saints of Newark\" following \"The Godfather Part II\" in charting… [+3400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Max Foster and Lauren Said-Moorhouse, CNN", "title": "Britain's royal family love James Bond. There's a few reasons for that", "description": "There are premieres and there are royal premieres, and Bond is the only movie franchise able to guarantee a blue-blooded red-carpet appearance. Not one but two palace limousines pulled up at the Royal Albert Hall this week to deliver the first and second in l…", "url": "https://www.cnn.com/2021/10/01/uk/royal-news-newsletter-10-01-21-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930142114-01-royal-newsletter-1001-super-tease.jpg", "publishedAt": "2021-10-01T13:10:24Z", "content": "London (CNN)There are premieres and there are royal premieres, and Bond is the only movie franchise able to guarantee a blue-blooded red-carpet appearance. Not one but two palace limousines pulled up… [+10101 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David M. Solomon and Kenneth Adams for CNN Business Perspectives", "title": "Goldman Sachs CEO: One way to help solve the nation's labor shortage", "description": "One under-tapped talent pool is the nation's community colleges. These educational institutions are anchors of their local communities as well as centers of mobility and innovation. And the students there are hungry for opportunity.", "url": "https://www.cnn.com/2021/10/01/perspectives/labor-shortage-goldman-sachs-laguardia-community-college/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001023709-labor-shortage-file-restricted-super-tease.jpg", "publishedAt": "2021-10-01T12:53:07Z", "content": "David M. Solomon is chairman and CEO of Goldman Sachs. Kenneth Adams is president of LaGuardia Community College. The opinions expressed in this commentary are their own. \r\nAmerica's more than 30 mil… [+3361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Walé Azeez, CNN Business", "title": "Time running out to save UK industry from worker shortages, say business leaders", "description": "Worker shortages have left UK service stations empty, created gaps on supermarket shelves and are forcing farms to cull pigs. Even the finance industry is starting to suffer. The situation could get much worse this winter if the British government doesn't rel…", "url": "https://www.cnn.com/2021/10/01/business/uk-immigration-business-visas-brexit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930064431-britain-worker-shortage-090721-file-restricted-super-tease.jpg", "publishedAt": "2021-10-01T12:44:28Z", "content": "London (CNN Business)Worker shortages have left UK service stations empty, created gaps on supermarket shelves and are forcing farms to cull pigs. Even the finance industry is starting to suffer. The… [+6443 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Walt Disney World Resort opened 50 years ago today -- and what a ride it's been", "description": "Walt Disney World Resort opened on October 1, 1971. And on its 50th anniversary, it continues to be a major driver in the travel world. Take look back at its history and what's ahead with the celebrations.", "url": "https://www.cnn.com/travel/article/walt-disney-world-florida-50th-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210929180131-10-disney-world-1971-super-tease.jpg", "publishedAt": "2021-10-01T12:39:24Z", "content": "(CNN) It changed acres and acres of orange groves. It changed Orlando. It changed Florida. It changed an already legendary company. And it changed the entire theme park industry.\r\nWalt Disney World R… [+3466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on infrastructure negotiations in Congress", "description": "Negotiations over the bipartisan infrastructure bill continue between wings of the Democratic Party after House Speaker Nancy Pelosi delayed the vote. Follow here for the latest news on Capitol Hill.", "url": "https://www.cnn.com/politics/live-news/congress-infrastructure-bill-vote-10-01-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927100056-capitol-exterior-0927-super-tease.jpg", "publishedAt": "2021-10-01T12:28:28Z", "content": "Democratic leaders and the White House on Thursday put on the table a top line number of $2.1 trillion in an attempt to forge an agreement between moderates and progressives on passing President Bide… [+1785 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "States face tough choices on repaying loans to Uncle Sam for pandemic unemployment benefits", "description": "The federal government picked up the cost of the unprecedented expansion of jobless benefits during the pandemic, but many states are still facing a hefty tab for their share of the program -- and tough decisions about how to cover the bill.", "url": "https://www.cnn.com/2021/10/01/politics/pandemic-unemployment-benefits-federal-loans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210903182143-unemployment-form-restricted-super-tease.jpg", "publishedAt": "2021-10-01T12:19:21Z", "content": "(CNN)The federal government picked up the cost of the unprecedented expansion of jobless benefits during the pandemic, but many states are still facing a hefty tab for their share of the program -- a… [+8403 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "German inflation hits 29-year high as energy costs spike across Europe", "description": "Inflation in Germany hit its highest level in nearly three decades last month, fueled by rising energy costs, supply chain bottlenecks and price hikes following the easing of pandemic lockdowns.", "url": "https://www.cnn.com/2021/10/01/business/germany-inflation-eurozone/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001061846-germany-food-prices-inflation-040121-file-restricted-super-tease.jpg", "publishedAt": "2021-10-01T11:58:51Z", "content": "London (CNN Business)Inflation in Germany hit its highest level in nearly three decades last month, fueled by rising energy costs, supply chain bottlenecks and price hikes following the easing of pan… [+2338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rae Ellen Bichell, KHN", "title": "In one of the country's most vaccinated places, masks were still key to slowing Covid-19", "description": "San Juan County, Colorado, can boast that 99.9% of its eligible population has received at least one dose of covid-19 vaccine, putting it in the top 10 counties in the nation, according to data from the Centers for Disease Control and Prevention.", "url": "https://www.cnn.com/2021/10/01/health/covid-vaccine-colorado-tourist-town/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930193521-silverton-colorado-super-tease.jpg", "publishedAt": "2021-10-01T11:03:30Z", "content": "(KHN)San Juan County, Colorado, can boast that 99.9% of its eligible population has received at least one dose of covid-19 vaccine, putting it in the top 10 counties in the nation, according to data … [+8123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Quest and Joe Minihane, CNN", "title": "The fairytale capital of the world", "description": "In Copenhagen, where the spirit of Hans Christian Andersen can still be found, fairy tales, Vikings and a countercultural commune all add to the city's understated charm.", "url": "https://www.cnn.com/travel/article/copenhagen-fairy-tale-capital-world/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930180547-copenhagen-qwow--8-super-tease.jpg", "publishedAt": "2021-10-01T11:00:08Z", "content": "(CNN) Once upon a time in Scandinavia, a country emerged where the Covid restrictions that many other nations are still living under were completely lifted. \r\nDenmark's decision to become the first E… [+9660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Erwin Chemerinsky", "title": "Justice Sotomayor tells the truth about the Supreme Court", "description": "Erwin Chemerinsky writes that Justice Sonia Sotomayor's comments about the impending disappointment coming in the law, as the Supreme Court is about to begin a term where it will decide high profile cases on ideologically divisive issues, highlights how diffi…", "url": "https://www.cnn.com/2021/10/01/opinions/justice-sonia-sotomayor-us-supreme-court-chemerinsky/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930094937-sonia-sotomayor-file-2019-super-tease.jpg", "publishedAt": "2021-10-01T10:44:02Z", "content": "Erwin Chemerinsky is dean and Jesse H. Choper Distinguished Professor of Law at the University of California, Berkeley, School of Law. He is the author of \"Presumed Guilty: How the Supreme Court Empo… [+4852 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for October 1: Congress, coronavirus, immigration, opioids, Ethiopia", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/10/01/us/five-things-october-1-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930191852-01-week-in-photos-0930-super-tease.jpg", "publishedAt": "2021-10-01T10:32:26Z", "content": "(CNN)September was the worst month of the year so far for Wall Street, which ended its final trading day of the quarter in the red.\r\nHere's what you need to know to Get Up to Speed and On with Your D… [+6132 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Prior, CNN", "title": "'Maid' Netflix series based on Stephanie Land's life shows reality of poverty and abuse", "description": "Stephanie Land's memoir \"Maid\" became a bestseller and inspired a Netflix show premiering on October 1. Land hopes the series can open up a conversation about life below the poverty line, emotional abuse, and the dignity of all work.", "url": "https://www.cnn.com/2021/10/01/tv-shows/maid-netflix-stephanie-land-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928201054-01-maid-netflix-super-tease.jpg", "publishedAt": "2021-10-01T10:28:38Z", "content": "(CNN)Each day Stephanie Land got down on her hands and knees to scrub a toilet, she was buoyed by love for her child -- and a dream that one day she would be a writer. \r\nLand had escaped an abusive r… [+6224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Britney Spears' bid for freedom comes at a crucial moment", "description": "Historian Nicole Hemmer connects the dots on why one of the most visceral elements of Britney Spears's story -- her inability to have more children when she wants them -- resonates so powerfully at a time when reproductive rights are under attack.", "url": "https://www.cnn.com/2021/10/01/opinions/britney-spears-reproductive-rights-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210926193556-restricted-britney-spears-2016-super-tease.jpg", "publishedAt": "2021-10-01T10:04:08Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+8975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Brazil legend Pele leaves hospital after surgery to remove tumor", "description": "Brazil football legend Pele was discharged from hospital on Thursday following surgery to remove a tumor from his colon.", "url": "https://www.cnn.com/2021/10/01/football/pele-leaves-hospital-to-undergo-chemotherapy-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001092051-pele-super-tease.jpg", "publishedAt": "2021-10-01T08:37:51Z", "content": "(CNN)Brazil football legend Pele was discharged from hospital on Thursday following surgery to remove a tumor from his colon.\r\nThe 80-year-old underwent the operation on September 4 and had been rece… [+1561 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Many states see significant increase in Covid-19 vaccinations ahead of deadlines for vaccine mandates", "description": "With more states and health care systems moving toward mandatory inoculations for certain workers, officials are hoping the incentive of employment will eliminate vaccine hesitancy -- while one governor is arranging contingency scenarios.", "url": "https://www.cnn.com/2021/10/01/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930013910-02-vaccine-mandate-protest-new-york-restricted-super-tease.jpg", "publishedAt": "2021-10-01T08:30:04Z", "content": "(CNN)With more states and health care systems moving toward mandatory inoculations for certain workers, officials are hoping the incentive of employment will eliminate vaccine hesitancy -- while one … [+6990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "A first look at Expo 2020 Dubai", "description": "After a long wait, Expo 2020 Dubai is finally upon us. Now the doors are open, we take a look around the site.", "url": "https://www.cnn.com/world/live-news/expo-2020-dubai-first-look-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001091601-expo-2020-dubai-japan-pavilion-super-tease.jpg", "publishedAt": "2021-10-01T08:17:42Z", "content": "It's the first day of Expo Dubai 2020, a six-month, $7 billion event that has been eight years in the making. The much-anticipated event was delayed a year by the pandemic, but between today and Marc… [+551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Infowars host Alex Jones is responsible for damages triggered by his false claims on the Sandy Hook shooting, judge rules", "description": "Alex Jones, the conspiracy theorist who hosts the right-wing commentary website Infowars, was found legally responsible in two lawsuits for damages caused by his claims surrounding the 2012 Sandy Hook school mass shooting, according to court documents release…", "url": "https://www.cnn.com/2021/10/01/us/alex-jones-loses-sandy-hook-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190205142524-01-alex-jones-file-super-tease.jpg", "publishedAt": "2021-10-01T06:25:37Z", "content": "(CNN)Alex Jones, the conspiracy theorist who hosts the right-wing commentary website Infowars, was found legally responsible in two lawsuits for damages caused by his claims surrounding the 2012 Sand… [+2635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "They have all the vaccines they need, but these EU nations are still miles behind their neighbors", "description": "With nearly three quarters of all adults fully vaccinated against Covid-19, the European Union is a world leader in inoculations. But the impressive headline number is obscuring an uncomfortable reality: the rollout has been extremely unequal across the union.", "url": "https://www.cnn.com/2021/10/01/europe/eastern-europe-vaccine-takeup-bulgaria-romania-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210928044159-01-vaccine-clinic-bulgaria-super-tease.jpg", "publishedAt": "2021-10-01T06:09:49Z", "content": "(CNN)With nearly three quarters of all adults fully vaccinated against Covid-19, the European Union is a world leader in inoculations. But the impressive headline number is obscuring an uncomfortable… [+7385 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Nectar Gan, CNN", "title": "China says it's restricting abortions to promote gender equality. Experts are skeptical", "description": "For decades, Chinese authorities imposed strict limits on families that forced millions of women to abort pregnancies deemed illegal by the state.", "url": "https://www.cnn.com/2021/10/01/china/non-medical-abortions-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930120011-china-family-0721-super-tease.jpg", "publishedAt": "2021-10-01T05:57:40Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+9846 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Junko Ogura", "title": "Japan's Princess Mako will marry her commoner fiance this month", "description": "Japan's Princess Mako and her commoner fiance Kei Komuro announced Friday they will be married on October 26, public broadcaster NHK reported -- a controversial union that requires her to give up her royal status.", "url": "https://www.cnn.com/2021/10/01/asia/princess-mako-japan-wedding-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930212009-03-princess-mako-wedding-plan-file-2017-super-tease.jpg", "publishedAt": "2021-10-01T05:44:48Z", "content": "Tokyo (CNN)Japan's Princess Mako and her commoner fiance Kei Komuro announced Friday they will be married on October 26, public broadcaster NHK reported -- a controversial union that requires her to … [+846 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leyla Santiago, Sara Weisfeldt, Rebekah Riess and Andy Rose, CNN", "title": "New bodycam footage reveals what Gabby Petito told police about a domestic dispute with Brian Laundrie", "description": "New details have emerged of a reported domestic dispute between Gabby Petito and her fiance while traveling through Utah in August, as shown on additional bodycam footage from a responding officer.", "url": "https://www.cnn.com/2021/10/01/us/gabby-petito-brian-laundrie-update-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930195536-gabby-petito-moab-city-pd-new-bodycam-santiago-super-tease.jpg", "publishedAt": "2021-10-01T05:25:45Z", "content": "(CNN)New details have emerged of a reported domestic dispute between Gabby Petito and her fiance while traveling through Utah in August, as shown on additional bodycam footage from a responding offic… [+8371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Ben Westcott and Angus Watson, CNN", "title": "Australia reveals plan to reopen international borders to fully vaccinated citizens", "description": "Australian Prime Minister Scott Morrison on Friday, October 1 announced plans to reopen the country's borders to fully vaccinated citizens and permanent residents, moving from a strict zero-Covid strategy to a model of living with the virus.", "url": "https://www.cnn.com/travel/article/australia-international-travel-borders-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930232249-scott-morrison-08-23-2021-super-tease.jpg", "publishedAt": "2021-10-01T05:05:39Z", "content": "(CNN) Australian Prime Minister Scott Morrison on Friday, October 1 announced plans to reopen the country's borders to fully vaccinated citizens and permanent residents, moving from a strict zero-Cov… [+3233 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "The left defies Pelosi as Biden's big hopes are in limbo", "description": "An extraordinary day and night of wrenching tension, failed 11th hour deal making and festering mistrust between liberal and moderate Democrats left President Joe Biden's vast domestic agenda in a dangerous limbo.", "url": "https://www.cnn.com/2021/10/01/politics/pelosi-progressives-infrastructure-biden-agenda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930051040-us-capitol-0929-super-tease.jpg", "publishedAt": "2021-10-01T04:54:20Z", "content": "(CNN)An extraordinary day and night of wrenching tension, failed 11th hour deal making and festering mistrust between liberal and moderate Democrats left President Joe Biden's vast domestic agenda in… [+9160 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Smith-Spark, CNN", "title": "As gas prices soar, people are mulling alternatives to heating their homes. Here's what to know", "description": "Soaring natural gas prices have raised the specter of cold homes and inflated energy bills for millions of people over winter across Europe and the United States, where most people rely on gas-fired boilers for heat and hot water.", "url": "https://www.cnn.com/2021/10/01/europe/gas-boilers-emissions-climate-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930112747-03-low-carbon-heating-gas-boiler-super-tease.jpg", "publishedAt": "2021-10-01T04:14:02Z", "content": "London (CNN)Soaring natural gas prices have raised the specter of cold homes and inflated energy bills for millions of people over winter across Europe and the United States, where most people rely o… [+9273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Historic increase in food stamp benefits starts in October", "description": "Food stamp recipients will see their monthly payments go up in October thanks to a major update to the program, even though a special pandemic boost has now expired.", "url": "https://www.cnn.com/2021/10/01/politics/food-stamps-snap-increase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930170723-food-stamps-2019-super-tease.jpg", "publishedAt": "2021-10-01T04:06:45Z", "content": "(CNN)Food stamp recipients will see their monthly payments go up in October thanks to a major update to the program, even though a special pandemic boost has now expired. \r\nBenefits will jump 27% abo… [+3294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gawon Bae, CNN", "title": "Caught in the midst of a bullying scandal, South Korean volleyball twins Lee Jae-yeong and Lee Da-yeong controversially sign for Greek club", "description": "Twin volleyball players from South Korea, Lee Jae-yeong and Lee Da-yeong, have completed a transfer to Greek club PAOK Thessaloniki, months after being dropped from their national and club sides following claims of bullying.", "url": "https://www.cnn.com/2021/10/01/sport/lee-jae-yeong-lee-da-yeong-south-korea-volleyball-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210217171500-lee-jae-yeong-and-lee-da-yeong-super-tease.jpg", "publishedAt": "2021-10-01T04:00:36Z", "content": "Seoul, South Korea (CNN)Twin volleyball players from South Korea, Lee Jae-yeong and Lee Da-yeong, have completed a transfer to Greek club PAOK Thessaloniki, months after being dropped from their nati… [+3598 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "Anti-Defamation League CEO says he spoke with vice president's office about Israel interaction", "description": "The CEO of the Anti-Defamation League on Thursday said he has spoken with Vice President Kamala Harris' office after the vice president's interaction earlier in the week with a student at George Mason University, who criticized the US' funding of Israel and S…", "url": "https://www.cnn.com/2021/09/30/politics/adl-kamala-harris-israel-funding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210911110558-04-kamala-harris-shanksville-pa-speech-0911-anniversary-2021-screengrab-super-tease.jpg", "publishedAt": "2021-10-01T03:30:44Z", "content": "(CNN)The CEO of the Anti-Defamation League on Thursday said he has spoken with Vice President Kamala Harris' office after the vice president's interaction earlier in the week with a student at George… [+3061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 30 photos", "description": "It has been a busy week on Capitol Hill, where US lawmakers took steps to avoid a government shutdown while also negotiating a trillion-dollar infrastructure bill.", "url": "https://www.cnn.com/2021/09/30/world/gallery/photos-this-week-september-23-september-30/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930193920-restricted-12-week-in-photos-0930-super-tease.jpg", "publishedAt": "2021-10-01T02:42:27Z", "content": "House Speaker Nancy Pelosi and US Rep. Jim Clyburn hold up a stopgap funding bill that was passed by the House on Thursday, September 30, to avert a government shutdown. The bill passed the Senate ea… [+806 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bethlehem Feleke, CNN", "title": "Ethiopia to expel UN officials amid fears of Tigray famine", "description": "Ethiopia is expelling seven senior United Nations officials for allegedly \"meddling in the internal affairs of the country,\" the Ethiopian Ministry of Foreign Affairs said on Thursday.", "url": "https://www.cnn.com/2021/09/30/africa/ethiopia-expels-un-officials-tigray-hunger-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624175509-22-wip-0625-super-tease.jpg", "publishedAt": "2021-10-01T01:54:15Z", "content": "Nairobi, Kenya (CNN)Ethiopia is expelling seven senior United Nations officials for allegedly \"meddling in the internal affairs of the country,\" the Ethiopian Ministry of Foreign Affairs said on Thur… [+2138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "North Korea fires new anti-aircraft missile in latest test, state media says", "description": "North Korea fired a newly developed anti-aircraft missile on Thursday, state media KCNA reported on Friday, the latest in its recent series of weapons tests amid deadlocked denuclearization talks with the United States.", "url": "https://www.cnn.com/2021/09/30/asia/north-korea-aircraft-missile-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930205749-north-korea-missile-0930-super-tease.jpg", "publishedAt": "2021-10-01T01:36:48Z", "content": "Seoul, South KoreaNorth Korea fired a newly developed anti-aircraft missile on Thursday, state media KCNA reported on Friday, the latest in its recent series of weapons tests amid deadlocked denuclea… [+874 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, Tara Subramaniam and Greg Clary, CNN", "title": "Fact check: Did the Marine who Trump brought on stage at rally actually hoist a baby over a wall at Kabul airport?", "description": "During a rally in Georgia over the weekend, former President Donald Trump invited Lance Cpl. Hunter Clark to the stage, implying he was the Marine in a viral video who lifted a child over a wall at the airport in Kabul, Afghanistan.", "url": "https://www.cnn.com/2021/09/30/politics/fact-check-trump-rally-marine-baby-kabul-airport/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210820113904-10-afghanistan-0819-airport-wall-super-tease.jpg", "publishedAt": "2021-10-01T01:02:07Z", "content": "Washington (CNN)During a rally in Georgia over the weekend, former President Donald Trump invited Lance Cpl. Hunter Clark to the stage, implying he was the Marine in a viral video who lifted a child … [+2217 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg and Steve Almasy, CNN", "title": "California police reform laws create decertification system for officer misconduct", "description": "California Gov. Gavin Newsom on Thursday signed into law a series of police reform bills, creating a system to decertify law enforcement officers found to have engaged in serious misconduct, strengthen use of force practices and increase transparency with the…", "url": "https://www.cnn.com/2021/09/30/us/california-police-reform-laws-decertification/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930194257-newsom-0915-super-tease.jpg", "publishedAt": "2021-10-01T00:55:17Z", "content": "(CNN)California Gov. Gavin Newsom on Thursday signed into law a series of police reform bills, creating a system to decertify law enforcement officers found to have engaged in serious misconduct, str… [+4505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "The Covid-19 vaccine health care worker holdouts: For them, it's personal. For their hospitals it's professional", "description": "Being a nurse means everything to Andrea Babinski, but she is willing to risk it all -- the connections to colleagues she likes, the patients she cares for, not to mention the steady paycheck -- for a simple belief.", "url": "https://www.cnn.com/2021/09/30/health/unvaccinated-nurses-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714080710-vaccine-protests-texas-0626-super-tease.jpg", "publishedAt": "2021-10-01T00:43:43Z", "content": "(CNN)Being a nurse means everything to Andrea Babinski, but she is willing to risk it all -- the connections to colleagues she likes, the patients she cares for, not to mention the steady paycheck --… [+13433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Killough and Ed Lavandera, CNN", "title": "'She is just absolutely standing in the way': Sinema's critics in Arizona speak out", "description": "When Kyrsten Sinema won her US Senate seat in 2018, she was the first Democrat from Arizona elected to the chamber in three decades. It was a triumphant gain for her party -- bolstered further when Democrats took over the White House and the Senate two years …", "url": "https://www.cnn.com/2021/09/30/politics/kyrsten-sinema-arizona-reaction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210610200419-kyrsten-sinema-lah-dnt-ebof-vpx-super-tease.jpg", "publishedAt": "2021-10-01T00:22:32Z", "content": "Scottsdale, Arizona (CNN)When Kyrsten Sinema won her US Senate seat in 2018, she was the first Democrat from Arizona elected to the chamber in three decades. It was a triumphant gain for her party --… [+6006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Democrats are fighting for their political lives", "description": "There are signs of economic trouble that should concern Democrats. Bottlenecks in the global supply chain have driven prices up and disrupted the availability of everything from nitrile gloves to cars. And things could get even worse, with the potential for t…", "url": "https://www.cnn.com/2021/09/30/opinions/global-supply-chain-politics-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210926151837-01-port-of-los-angeles-container-ships-0920-super-tease.jpg", "publishedAt": "2021-10-01T00:08:28Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+5986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Elam, CNN", "title": "Windy Fire has destroyed more than two dozen giant sequoia trees -- and that's just an early assessment", "description": "The Windy Fire in California is wreaking havoc on sequoia trees in Sequoia National Forest this week. Experts say fire has killed at least 29 of the giant trees, which can live for thousands of years.", "url": "https://www.cnn.com/2021/09/30/us/windy-fire-sequoia-trees-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930180906-windy-fire-0919-super-tease.jpg", "publishedAt": "2021-09-30T22:46:59Z", "content": "(CNN)The Windy Fire in California is wreaking havoc on sequoia trees in Sequoia National Forest this week. Experts say fire has killed at least 29 of the giant trees, which can live for thousands of … [+3290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What Joe Manchin gets wrong about the Senate", "description": "On Thursday afternoon, barraged by reporters asking about criticism from the  left for his opposition to a $3.5 trillion budget package, West Virginia Democratic Sen. Joe Manchin offered progressives some advice:", "url": "https://www.cnn.com/2021/09/30/politics/joe-manchin-senate-ideology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930145747-03-manchin-media-0930-super-tease.jpg", "publishedAt": "2021-09-30T22:39:20Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza, CNN Editor-at-large", "title": "Joe Manchin has been remarkably consistent. Democrats just haven't been listening", "description": "On Thursday, West Virginia Democratic Sen. Joe Manchin made clear how much he was willing to spend on a budget bill being pushed by President Joe Biden and his fellow Democrats in Congress: $1.5 trillion.", "url": "https://www.cnn.com/2021/09/30/politics/joe-manchin-budget-bill-1-5-trillion-schumer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930145747-03-manchin-media-0930-super-tease.jpg", "publishedAt": "2021-09-30T22:10:49Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Kaczynski and Em Steck, CNN", "title": "Harriet Hageman once rebuked Trump and endorsed Liz Cheney. She's now challenging her with his support", "description": "Harriet Hageman, who earned the endorsement of former President Donald Trump in her 2022 bid to challenge Wyoming Rep. Liz Cheney, once called her current opponent a \"proven, courageous, constitutional conservative.\"", "url": "https://www.cnn.com/2021/09/30/politics/kfile-harriet-hageman-endorsed-cheney-2016/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930130106-harriet-hageman-file-2018-super-tease.jpg", "publishedAt": "2021-09-30T22:00:36Z", "content": "(CNN)Harriet Hageman, who earned the endorsement of former President Donald Trump in her 2022 bid to challenge Wyoming Rep. Liz Cheney, once called her current opponent a \"proven, courageous, constit… [+4146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Fisher, CNN", "title": "US inks $20 million deal to launch high-tech weather satellites in space", "description": "The United States announced a $20 million contract with Tomorrow.io to launch a group of small satellites. The initiative will fill a critical gap in the ability to foresee precipitation dangers, like the deluge that overwhelmed Northeastern cities in early S…", "url": "https://www.cnn.com/2021/09/30/world/us-weather-satellite-deal-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930172501-02-us-weather-satellite-deal-super-tease.jpg", "publishedAt": "2021-09-30T21:51:50Z", "content": "(CNN)The United States is aiming to launch a group of small satellites to fill a critical gap in the ability to foresee precipitation dangers, like the deluge that overwhelmed Northeastern cities at … [+3821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How anti-vaxxers cling to centuries-old conspiracy theories", "description": "Anti-vax resistance has been around for years. In the latest \"Reality Check with John Avlon: Extremist Beat,\" Avlon traces the anti-government, anti-science and religious overtones that have persisted through the history of anti-vax opposition with CNN's Elle…", "url": "https://www.cnn.com/videos/business/2021/09/30/anti-vax-history-reality-check-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930120826-avlon-show-anti-vaxxers-desktop-thumb-w-border-super-tease.jpg", "publishedAt": "2021-09-30T21:50:27Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, Daniella Diaz, Alex Rogers and Annie Grayer, CNN", "title": "Pelosi scrambles to pass trillion-dollar infrastructure bill", "description": "House Speaker Nancy Pelosi has been working furiously behind the scenes to build support for the roughly $1 trillion infrastructure bill, personally calling Democrats and talking to members on the House floor as progressives threaten to tank it.", "url": "https://www.cnn.com/2021/09/30/politics/house-infrastructure-negotiations-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930105445-01-congress-budget-0930-pelosi-super-tease.jpg", "publishedAt": "2021-09-30T21:46:01Z", "content": "(CNN)House Speaker Nancy Pelosi has been working furiously behind the scenes to build support for the roughly $1 trillion infrastructure bill, personally calling Democrats and talking to members on t… [+1304 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Refugee groups race to find housing for 53,000 Afghan evacuees", "description": "Refugee resettlement agencies are racing to find housing for the approximately 53,000 Afghans on military bases in the United States who will eventually be resettled in the country, but the groups are facing a strained -- and expensive -- housing market.", "url": "https://www.cnn.com/2021/09/30/politics/afghan-refugees-housing-costs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930171426-afghan-refugees-us-0930-super-tease.jpg", "publishedAt": "2021-09-30T21:43:21Z", "content": "(CNN)Refugee resettlement agencies are racing to find housing for the approximately 53,000 Afghans on military bases in the United States who will eventually be resettled in the country, but the grou… [+8829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan and Steve Almasy, CNN", "title": "FBI joins search for Miya Marcano, who has been missing in Florida for nearly a week", "description": "The FBI is assisting in the search for a 19-year-old woman who went missing last Friday from an Orlando apartment complex, the Orange County sheriff said Thursday.", "url": "https://www.cnn.com/2021/09/30/us/florida-missing-woman-miya-marcano-fbi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927211111-miya-marcano-missing-super-tease.jpg", "publishedAt": "2021-09-30T20:53:27Z", "content": "HELP FIND MIYA: Miya Marcano is still missing. We suspect foul play. Person of interest Armando Caballero was found dead today. It appears he killed himself.\r\nCaballero was a maintenance worker at Ar… [+183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Bruce Friedrich and Anand Gopal", "title": "How alternative meats could help save the planet", "description": "The world is highly unlikely to meet Paris Agreement targets unless conventional meat consumption goes down globally, write Bruce Friedrich and Anand Gopal.", "url": "https://www.cnn.com/2021/09/30/opinions/alternative-meats-save-planet-friedrich-gopal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180705130329-impossible-burger-super-tease.jpg", "publishedAt": "2021-09-30T20:31:08Z", "content": "Bruce Friedrich is founder and CEO of the Good Food Institute, a global non-profit organization that is focused on using science and policy to build a better food system. Anand R. Gopal, PhD is the i… [+6333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "DC appeals court grapples with the question of due process rights for Guantanamo detainees", "description": "The US Court of Appeals for the DC Circuit grappled on Thursday with the question of whether to issue a significant decision about the due process rights of Guantanamo detainees -- a case that has put the Biden administration on complicated footing as the Pre…", "url": "https://www.cnn.com/2021/09/30/politics/guantanamo-due-process-dc-circuit-court-en-banc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210906134714-guantanamo-bay-naval-station-super-tease.jpg", "publishedAt": "2021-09-30T20:17:10Z", "content": "(CNN)The US Court of Appeals for the DC Circuit grappled on Thursday with the question of whether to issue a significant decision about the due process rights of Guantanamo detainees -- a case that h… [+5869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales and Sean Lyngaas, CNN", "title": "NYPD launches internal review of 2 officers after names appear in leaked data apparently belonging to the Oath Keepers", "description": "The New York City Police Department launched an internal review of two active officers after their names and phone numbers were reportedly found in leaked data that apparently belongs to the Oath Keepers, a far-right, anti-government militia, a law enforcemen…", "url": "https://www.cnn.com/2021/09/30/us/nypd-oath-keepers-officers-investigated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930150507-oath-keepers-file-super-tease.jpg", "publishedAt": "2021-09-30T19:30:58Z", "content": "(CNN)The New York City Police Department launched an internal review of two active officers after their names and phone numbers were reportedly found in leaked data that apparently belongs to the Oat… [+2739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "California synagogue shooter sentenced to life in prison without the possibility of parole", "description": "John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synagogue.", "url": "https://www.cnn.com/2021/09/30/us/poway-synagogue-shooter-sentencing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210720143150-john-earnest-poway-shooting-sept-2019-super-tease.jpg", "publishedAt": "2021-09-30T19:19:46Z", "content": "(CNN)John T. Earnest was formally sentenced to life in prison without the possibility of parole on Thursday for murder and attempted murder in the deadly 2019 shooting at a Southern California synago… [+3643 chars]"}]}