{"status": "ok", "totalResults": 134, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "House passes bill to award Congressional Gold Medal to Willie O'Ree, the first Black NHL player", "description": "The House voted on Wednesday to award a Congressional Gold Medal to Willie O'Ree, the first Black player to play in the National Hockey League.", "url": "https://www.cnn.com/2022/01/19/politics/willie-oree-congressional-gold-medal-house-nhl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118153413-02-willie-oree-file-1960-super-tease.jpg", "publishedAt": "2022-01-19T22:59:00Z", "content": "(CNN)The House has voted to award a Congressional Gold Medal to Willie O'Ree, the first Black player to compete in the National Hockey League.\r\nThe Willie O'Ree Congressional Gold Medal Act passed 42… [+1628 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "PCR vs. antigen: Which test you should take after having Covid-19", "description": "A PCR test is considered the gold standard for detecting coronavirus infection after exposure to Covid-19 or while you're experiencing symptoms. Coronavirus test experts explain why the rapid antigen test is best for knowing if you're still infectious.", "url": "https://www.cnn.com/2022/01/19/health/pcr-vs-antigen-tests-covid-19-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118134730-rapid-covid-test-super-tease.jpg", "publishedAt": "2022-01-19T22:37:26Z", "content": "(CNN)A PCR test is often considered the gold standard for detecting coronavirus infection. It's the test some employers want employees to take before returning to work after having Covid-19, and the … [+7420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "A Canadian restaurant had to close its dining room because it accepted dog photos in lieu of proof of vaccination, negative Covid tests", "description": "A restaurant in Alberta was forced to briefly close its dining room after the health department found patrons were showing photos of dogs instead of proof of vaccination or a negative Covid test, as mandated by the Canadian province.", "url": "https://www.cnn.com/2022/01/19/world/canada-restaurant-dog-photos-covid-requirements-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119152115-01-the-granary-restaurant-alberta-canada-super-tease.jpg", "publishedAt": "2022-01-19T22:16:48Z", "content": "(CNN)A restaurant in Alberta was forced to briefly close its dining room after the health department found patrons were showing photos of dogs instead of proof of vaccination or a negative Covid test… [+2646 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David Perry", "title": "Covidtests.gov is off to a strong start but big hurdle awaits", "description": "With the debacle of healthcare.gov's rollout and his experience as the parent of a child on Medicaid on his mind, David Perry says he was skeptical of covidtests.gov. After navigating it with ease, Perry argues that the program's strong start leaves him more …", "url": "https://www.cnn.com/2022/01/19/opinions/covidtests-gov-rollout-gives-hope-perry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118143032-free-covid-test-web-site-super-tease.jpg", "publishedAt": "2022-01-19T22:15:04Z", "content": "David M. Perry is a journalist and historian and co-author of \"The Bright Ages: A New History of Medieval Europe.\" He is a senior academic adviser in the history department of the University of Minne… [+5742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, Melissa Macaya, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Mike Hayes, CNN", "title": "Senate will vote on voting rights bill but it is unlikely to pass", "description": "The Senate will bring a vote to the floor on voting rights legislation today, despite major obstacles that appear to have closed off a path for Democrats to achieve that ambition. Follow here for the latest news.", "url": "https://www.cnn.com/politics/live-news/voting-rights-bill-senate-vote-01-19-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231132316-us-capitol-1229-super-tease.jpg", "publishedAt": "2022-01-19T22:11:33Z", "content": "Senate Majority Leader Chuck Schumer gave an impassioned floor speech earlier today as the Senate debated voting legislation for the first time in this Congress, and he reiterated that when GOP lawma… [+1784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden predicts Russian invasion of Ukraine, but says 'minor incursion' may prompt discussion over consequences", "description": "President Joe Biden on Wednesday predicted a Russian invasion of Ukraine, citing existential concerns by the country's president, Vladimir Putin, even as he warned of significant economic consequences should such an incursion occur.", "url": "https://www.cnn.com/2022/01/19/politics/russia-ukraine-joe-biden-news-conference/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119164958-06-biden-one-year-presser-super-tease.jpg", "publishedAt": "2022-01-19T22:01:30Z", "content": "(CNN)President Joe Biden on Wednesday predicted a Russian invasion of Ukraine, citing existential concerns by the country's president, Vladimir Putin, even as he warned of significant economic conseq… [+2562 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael Cohen, E. Danya Perry and Joshua Perry", "title": "This is an unmistakable win for incarcerated people", "description": "Michael Cohen, E. Danya Perry and Joshua Perry write that ​​the Federal Bureau of Prisons announced that it will finally implement a key justice reform promise made in 2018's First Step Act, but one which the prior administration had been far too slow to carr…", "url": "https://www.cnn.com/2022/01/19/opinions/first-step-act-justice-department-win-cohen-perry-perry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200508121912-prison-cell-bars-stock-super-tease.jpg", "publishedAt": "2022-01-19T21:58:01Z", "content": "Michael Cohen, the former personal attorney to former President Donald J. Trump, is a podcaster and vocal advocate for prison reform. E. Danya Perry, a former federal and state prosecutor, is a Trust… [+6454 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, CNN Polling Director", "title": "The polls hold scant good news for Joe Biden one year into his presidency", "description": "As the first year of Joe Biden's presidency comes to a close, 41% of Americans approve of the way he's handling his job while 54% disapprove, according to the latest CNN Poll of Polls.", "url": "https://www.cnn.com/2022/01/19/politics/poll-of-polls-biden-approval-one-year/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118230018-president-joe-biden-010622-super-tease.jpg", "publishedAt": "2022-01-19T21:45:49Z", "content": "WASHINGTON (CNN)As the first year of Joe Biden's presidency comes to a close, 41% of Americans approve of the way he's handling his job while 54% disapprove, according to the latest CNN Poll of Polls… [+4323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anaylsis by Chris Cillizza, CNN Editor-at-large", "title": "Why Ron DeSantis wants to form an election security police force", "description": "As Florida Gov. Ron DeSantis runs for president looks to the final year of his first term in office, he is, again, turning to the nonexistent notion of widespread voter fraud to bolster his appeal with the Republican base.", "url": "https://www.cnn.com/2022/01/19/politics/desantis-election-crime-security-voter-fraud/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806204207-ron-desantis-071321-super-tease.jpg", "publishedAt": "2022-01-19T21:44:52Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Cyberattack on Red Cross compromised data of over 500,000 'highly vulnerable people'", "description": "A cyberattack on the International Committee of the Red Cross (ICRC) has compromised the personal data of more than 515,000 \"highly vulnerable people,\" including people separated from their families by conflict and disaster, the organization said Wednesday.", "url": "https://www.cnn.com/2022/01/19/politics/red-cross-cyberattack/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119133817-international-committee-of-the-red-cross-headquarters-super-tease.jpg", "publishedAt": "2022-01-19T21:41:41Z", "content": "(CNN)A cyberattack on the International Committee of the Red Cross (ICRC) has compromised the personal data of more than 515,000 \"highly vulnerable people,\" including people separated from their fami… [+702 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts, CNN", "title": "Gilead announces massive seizure of counterfeit HIV-1 drugs", "description": "The biopharmaceutical company Gilead Sciences announced Wednesday a massive web of seizures across several states of \"counterfeit and tampered Gilead HIV medication within the U.S. supply chain.\"", "url": "https://www.cnn.com/2022/01/19/business/gilead-seizure-counterfeit-drugs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119162616-gilead-sciences-headquarters-file-super-tease.jpg", "publishedAt": "2022-01-19T21:40:21Z", "content": "(CNN)The biopharmaceutical company Gilead Sciences(GILD) announced Wednesday a massive web of seizures across several states of \"counterfeit and tampered Gilead HIV medication within the U.S. supply … [+2566 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Reid, CNN", "title": "Congressional subpoena for Giuliani seeks information on his meetings, fees and fraud claims", "description": "Congressional investigators are demanding information from former President Donald Trump's onetime lawyer Rudy Giuliani about contacts with members of Congress and state election officials, his fee arrangements and any evidence to back up bogus and sometimes …", "url": "https://www.cnn.com/2022/01/19/politics/rudy-giuliani-subpoena/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624114310-01-rudy-giuliani-0621-super-tease.jpg", "publishedAt": "2022-01-19T21:28:41Z", "content": "(CNN)Congressional investigators are demanding information from former President Donald Trump's onetime lawyer Rudy Giuliani about contacts with members of Congress and state election officials, his … [+2431 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "FBI says crooks are using fake QR codes to steal money", "description": "Cybercriminals are trying to steal financial information from Americans through the QR codes that restaurants and businesses have increasingly turned to during the coronavirus pandemic, the FBI warned this week.", "url": "https://www.cnn.com/2022/01/19/politics/fbi-qr-codes-cybercrime/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119142508-qr-code-phone-stock-super-tease.jpg", "publishedAt": "2022-01-19T20:25:52Z", "content": "Washington (CNN)Cybercriminals are trying to steal financial information from Americans through the QR codes that restaurants and businesses have increasingly turned to during the coronavirus pandemi… [+1282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Vogue's Anna Wintour pays tribute to André Leon Talley, calling his loss 'immeasurable'", "description": "Wintour and Talley were close friends and colleagues for decades, though he had said in recent years their relationship had hit \"an iceberg.\"", "url": "https://www.cnn.com/style/article/andre-leon-talley-death-anna-wintour-vogue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119125911-andre-leon-talley-anna-wintour-file-2011-restricted-super-tease.jpg", "publishedAt": "2022-01-19T20:09:41Z", "content": "Vogue editor-in-chief Anna Wintour has called the loss of André Leon Talley \"immeasurable,\" after the trailblazing fashion journalist and former Vogue creative director died Tuesday, at the age of 73… [+4328 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Chuck Collins for CNN Business Perspectives", "title": "Taxing extreme wealth could lift 2.3 billion people out of poverty", "description": "These extreme inequalities are the preexisting condition that made our society more vulnerable to disease and undermined a robust global public health response.", "url": "https://www.cnn.com/2022/01/19/perspectives/inequality-poverty-wealth-tax/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119150215-extreme-wealth-tax-global-poverty-super-tease.jpg", "publishedAt": "2022-01-19T20:06:55Z", "content": "Chuck Collins directs the Program on Inequality and co-edits Inequality.org at the Institute for Policy Studies. He's the author of the book, The Wealth Hoarders: How Billionaires Pay Millions to Hid… [+3916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and Mike Hayes, CNN", "title": "President Biden holds news conference", "description": "President Biden is holding a news conference this afternoon marking his first year in office. Follow here for the latest news and updates.", "url": "https://www.cnn.com/politics/live-news/joe-biden-press-conference-01-19-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114132941-01-biden-infrastructure-0114-super-tease.jpg", "publishedAt": "2022-01-19T19:59:04Z", "content": "As he walked through the front gate of the White House complex last year for the first time as President, Joe Biden declared it felt like \"going home.\"\r\nIf the presidency seemed then like a natural f… [+1281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, CNN", "title": "Republicans refuse to comply with Schiff's request to get tested before committee briefing", "description": "Rep. Mike Turner of Ohio, the top Republican on the House Intelligence Committee, said the panel's chairman, Democratic Rep. Adam Schiff of California, has requested that members receive a negative Covid test before they participate in an upcoming committee b…", "url": "https://www.cnn.com/2022/01/19/politics/adam-schiff-covid-19-testing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200206104937-03-adam-schiff-lead-image-super-tease.jpg", "publishedAt": "2022-01-19T19:48:06Z", "content": "(CNN)Rep. Mike Turner of Ohio, the top Republican on the House Intelligence Committee, said the panel's chairman, Democratic Rep. Adam Schiff of California, has requested that members receive a negat… [+2642 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Emmeline Ha and Miriam Bukhsh", "title": "How the Biden administration can ensure mask access to all Americans", "description": "By distributing high-quality masks directly to the public where they are at, we can maximize protection against the SARS-CoV-2 virus -- balancing equitable access and effective use for all, write Emmeline Ha and Miriam Bukhsh.", "url": "https://www.cnn.com/2022/01/19/opinions/covid-19-masks-recommendations-ha-bukhsh/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118154339-02-biden-year-one-super-tease.jpg", "publishedAt": "2022-01-19T19:03:22Z", "content": "Emmeline Ha, MD is a family physician and Miriam Bukhsh, MD is an emergency physician. They are health policy fellows at the George Washington University Department of Emergency Medicine. The opinion… [+6527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "What you need to know about planning travel right now", "description": "Heading into the third year of the pandemic, there are still a bunch of variables to consider. Can we even make travel plans right now? Yes, definitely. Find out how.", "url": "https://www.cnn.com/travel/article/travel-planning-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119132011-argentina-mount-fitz-roy-super-tease.jpg", "publishedAt": "2022-01-19T18:52:43Z", "content": "(CNN) New year, new outlook, new travel plans. \r\nNow's the time when many people are typically mapping out the year's getaways around school calendars and family events and nice weather and big festi… [+6671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz", "title": "'Do not fall victim to false gods again': Judge worries about rioters acting in 2024", "description": "A federal judge warned on Wednesday that Trump supporters who stormed the Capitol on January 6, 2021, should be more cautious about which political leaders they follow in the future, and said that placing rioters on probation through the 2024 election could b…", "url": "https://www.cnn.com/2022/01/19/politics/january-6-riot-judge-2024-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630162208-capitol-insurrection-0106-super-tease.jpg", "publishedAt": "2022-01-19T18:41:06Z", "content": "(CNN)A federal judge warned on Wednesday that Trump supporters who stormed the Capitol on January 6, 2021, should be more cautious about which political leaders they follow in the future, and said th… [+2259 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, CNN", "title": "Pelosi says Democrats are considering adding Covid-19 relief to larger bill", "description": "House Speaker Nancy Pelosi told reporters on Wednesday that Democrats are considering adding Covid-19 relief to the larger government funding bill, which could complicate Republican support for the broader legislative package.", "url": "https://www.cnn.com/2022/01/19/politics/omnibus-covid-19-funding-package/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220106121246-pelosi-house-super-tease.jpg", "publishedAt": "2022-01-19T18:20:01Z", "content": "(CNN)House Speaker Nancy Pelosi told reporters on Wednesday that Democrats are considering adding Covid-19 relief to the larger government funding bill, which could complicate Republican support for … [+2697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy, CNN", "title": "Man who rescued 5 people during Oklahoma City bombing dies", "description": "Raymond Washburn, who is credited with helping rescue five people from the rubble of the 1995 Oklahoma City bombing, passed away on Sunday at his home in Bristow, Oklahoma, at the age of 75.", "url": "https://www.cnn.com/2022/01/19/us/oklahoma-city-raymond-washburn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119131430-01-raymond-washburn-super-tease.jpg", "publishedAt": "2022-01-19T18:19:56Z", "content": "(CNN)Raymond Washburn, who is credited with helping rescue five people from the rubble of the 1995 Oklahoma City bombing, passed away on Sunday at his home in Bristow, Oklahoma, at the age of 75. \r\nW… [+750 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez and Artemis Moshtaghian, CNN", "title": "Times Square subway victim Michelle Alyssa Go remembered as a 'compassionate soul'", "description": "Michelle Alyssa Go, who was pushed to the her death in front of a Times Square subway train, is remembered as a compassionate woman who volunteered her time to help those less fortunate than her.", "url": "https://www.cnn.com/2022/01/19/us/michelle-alyssa-go-life-family/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119111035-03-michelle-alyssa-go-profile-super-tease.jpg", "publishedAt": "2022-01-19T18:03:42Z", "content": "(CNN)Michelle Alyssa Go, who was pushed to the her death in front of a Times Square subway train, is remembered as a compassionate woman who volunteered her time to help those less fortunate than her… [+4034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "A new species of tarantula discovered by Thai YouTube star", "description": "The previously unknown type of tarantula was discovered in Thailand by a YouTube star.  It lives exclusively in the hollowed stems of bamboo plants, surprising scientists.", "url": "https://www.cnn.com/2022/01/19/asia/tarantula-new-species-bamboo-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119095446-05-tarantula-new-species-bamboo-scn-super-tease.jpg", "publishedAt": "2022-01-19T18:03:32Z", "content": "Sign up for CNN's Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\n (CNN)A previously unknown type of tarantula has been… [+2944 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Flush with cash, big companies are ready to buy up rivals and reward investors", "description": "Microsoft's massive acquisition of Activision Blizzard is notable for several reasons, not the least of which is that it's spending nearly $70 billion -— in cash — to make the deal. That means Microsoft CEO Satya Nadella is essentially going to write a check …", "url": "https://www.cnn.com/2022/01/19/investing/companies-cash-mergers-buybacks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118161854-01-satya-nadella-microsoft-ceo-file-super-tease.jpg", "publishedAt": "2022-01-19T17:17:04Z", "content": "New York (CNN Business)Microsoft's massive acquisition of Activision Blizzard is notable for several reasons, not the least of which is that it's spending nearly $70 billion - in cash to make the dea… [+3320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Takeaways and new details from the New York AG's investigation into Trump's business empire", "description": "New York Attorney General Letitia James laid out new, specific details about what her office believes to be \"misleading or fraudulent\" financial statements from former President Donald Trump's business empire in a late-night court filing on Tuesday.", "url": "https://www.cnn.com/2022/01/19/politics/takeaways-trump-organization/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330122303-03-trump-weisselberg-2017-super-tease.jpg", "publishedAt": "2022-01-19T17:11:08Z", "content": "New York (CNN)New York Attorney General Letitia James laid out new, specific details about what her office believes to be \"misleading or fraudulent\" financial statements from former President Donald … [+5448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Missouri highway patrol blasts out 'Batman' cell phone alert by mistake", "description": "The Joker is not on the rampage in Missouri, but it looks like authorities there are ready for the \"Batman\" villain.", "url": "https://www.cnn.com/2022/01/19/us/missouri-joker-alert-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119093610-02-missouri-batman-alert-trnd-super-tease.jpg", "publishedAt": "2022-01-19T17:06:14Z", "content": "(CNN)The Joker is not on the rampage in Missouri, but it looks like authorities there are ready for the \"Batman\" villain.\r\nAn emergency alert mistakenly sent to mobile devices Tuesday by the Missouri… [+1601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Edward-Isaac Dovere", "title": "Biden leaves Democrats hanging as midterms burst into full swing", "description": "President Joe Biden spotted Rep. Sean Patrick Maloney on the White House campus last June and called out to the House Democratic campaign chair loudly enough for several others to hear: \"I really want to talk to you about the races!\" he shouted.", "url": "https://www.cnn.com/2022/01/19/politics/biden-democrats-midterm-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119102009-01-isaac-biden-super-tease.jpg", "publishedAt": "2022-01-19T17:00:37Z", "content": "(CNN)President Joe Biden spotted Rep. Sean Patrick Maloney on the White House campus last June and called out to the House Democratic campaign chair loudly enough for several others to hear: \"I reall… [+21150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Vitagliano, CNN", "title": "University of Michigan reaches $490 million settlement after sex abuse allegations against former UM doctor", "description": "The University of Michigan has reached a settlement agreement with attorneys for about 1,050 people who say they were abused by the late Dr. Robert Anderson, a former university physician, UM announced Wednesday.", "url": "https://www.cnn.com/2022/01/19/us/robert-anderson-university-of-michigan-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119104445-robert-anderson-university-of-michigan-file-super-tease.jpg", "publishedAt": "2022-01-19T16:17:04Z", "content": "(CNN)The University of Michigan has reached a settlement agreement with attorneys for about 1,050 people who say they were abused by the late Dr. Robert Anderson, a former university physician, UM an… [+319 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This poll number is very ominous for Democrats", "description": "On the eve of his one-year anniversary in office, President Joe Biden finds himself at the lowest polling point of his tenure -- a worrisome omen for Democrats desperately trying to hold onto their House and Senate majorities this fall.", "url": "https://www.cnn.com/2022/01/19/politics/biden-approval-rating-polling-numbers-low/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211221094826-01-biden-climate-summit-file-super-tease.jpg", "publishedAt": "2022-01-19T15:59:43Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "Early works by French master Monet could sell for $50 million in auction", "description": "Several early works by one of the world's most renowned Impressionist painters, Claude Monet, are to be put up for sale by the British auction house Sotheby's, with a combined estimate of $50 million.", "url": "https://www.cnn.com/style/article/monet-early-works-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119145459-03-monet-rare-works-intl-scli-011922-super-tease.jpg", "publishedAt": "2022-01-19T15:46:12Z", "content": "artsUpdated 19th January 2022\r\nSeveral early works by one of the world's most renowned Impressionist painters, Claude Monet, are to be put up for sale by the British auction house Sotheby's, with a c… [+2408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "Mark Kelly backs rules change to pass voting rights legislation", "description": "Sen. Mark Kelly, a Democrat facing reelection in Arizona, announced he will back a rules change to pass voting rights legislation, revealing a schism with his fellow Arizonan, Democratic Sen. Kyrsten Sinema, who has remained steadfast in her opposition to suc…", "url": "https://www.cnn.com/2022/01/19/politics/mark-kelly-backs-senate-filibuster-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119103057-sen-mark-kelly-1019-super-tease.jpg", "publishedAt": "2022-01-19T15:34:35Z", "content": "(CNN)Sen. Mark Kelly, a Democrat facing reelection in Arizona, announced he will back a rules change to pass voting rights legislation, revealing a schism with his fellow Arizonan, Democratic Sen. Ky… [+1750 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "New rule will allow 18-year-olds to drive semi trucks across state lines", "description": "With the trucking industry facing a shortage of qualified drivers, the US government is setting up an apprenticeship program for young truckers. The new program will allow people as young as 18 to drive big interstate semi trucks.", "url": "https://www.cnn.com/2022/01/19/business/18-year-old-truck-drivers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118123927-semi-tractor-trailers-1014-file-super-tease.jpg", "publishedAt": "2022-01-19T15:29:58Z", "content": "(CNN Business)With the trucking industry facing a shortage of qualified drivers, the USgovernment is setting up an apprenticeship program for young truckers. The new program will allow people as youn… [+3871 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Remsen, CNN", "title": "Pharrell Williams and David Grutman to open new resort in the Bahamas", "description": "Designed by The Rockwell Grouo, the new luxury resort will be part of Atlantis Paradise Island.", "url": "https://www.cnn.com/style/article/pharrell-williams-bahamas-resort-somewhere-else/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118121106-07-pharrell-bahamas-atlantis-luxury-super-tease.jpg", "publishedAt": "2022-01-19T14:59:12Z", "content": "luxuryUpdated 19th January 2022\r\nPharrell Williams has announced a new lifestyle and design-forward project with Miami-based hospitality and nightlife entrepreneur David Grutman: Somewhere Else, a ne… [+4826 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Senior citizens are fuming that Medicare won't pay for Covid-19 tests at retailers", "description": "The Biden administration is requiring health insurers to cover the cost of home Covid-19 tests for most Americans with private insurance. However, Medicare is not subject to this requirement, so senior citizens and Americans with disabilities in the tradition…", "url": "https://www.cnn.com/2022/01/19/politics/senior-citizens-medicare-free-covid-tests-retailers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118151104-at-home-covid-test-super-tease.jpg", "publishedAt": "2022-01-19T14:58:21Z", "content": "(CNN)Peggy Matthews-Forney cannot believe that, unlike private insurers, Medicare is not reimbursing senior citizens for the home Covid-19 tests they buy at retailers.\r\n\"As a Medicare enrollee, I am … [+3995 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Liakos and Richard Quest, CNN", "title": "Emirates president: The 5G snafu is the biggest screwup I've witnessed in my career", "description": "The President of Emirates tells CNN that the airline was not aware of some of the potential 5G rollout issues until yesterday morning, calling the situation \"one of the most delinquent, utterly irresponsible\" he has seen in his aviation career.", "url": "https://www.cnn.com/2022/01/19/business/emirates-5g-quest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119090211-emirates-airlines-aircraft-file-restricted-super-tease.jpg", "publishedAt": "2022-01-19T14:19:11Z", "content": "(CNN)The President of Emirates tells CNN that the airline was not aware of some of the potential 5G rollout issues until yesterday morning, calling the situation \"one of the most delinquent, utterly … [+4223 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, CNN", "title": "Plans to close all but one polling place in a rural Georgia county reverberate through a battleground state", "description": "Voting rights activists are closely monitoring takeovers of local election boards in a state that helped decide the presidency and control of the Senate in 2020.", "url": "https://www.cnn.com/2022/01/19/politics/poll-closures-rural-lincoln-county-georgia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118122838-georgia-voter-sticker-super-tease.jpg", "publishedAt": "2022-01-19T13:07:48Z", "content": "(CNN)Election officials in a rural Georgia county are weighing plans to close all but one polling place ahead of this year's elections, alarming local voting and civil rights groups. \r\nBut Wednesday'… [+8974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Tech stocks are hurtling toward a correction", "description": "Persistently high inflation has dealt investors a wake-up call this year, sending them scrambling to re-engineer their portfolios in anticipation of more aggressive action from the Federal Reserve.", "url": "https://www.cnn.com/2022/01/19/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119073935-01-nyse-0118-super-tease.jpg", "publishedAt": "2022-01-19T13:04:34Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN", "title": "The latest on the coronavirus pandemic and the Omicron variant", "description": "Countries across the globe continue to battle a surge in Covid-19 cases driven by the Omicron variant. Follow here for the latest news updates.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-01-19-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118082721-us-coronavirus-testing-1112-super-tease.jpg", "publishedAt": "2022-01-19T12:27:06Z", "content": "Last June, as Covid-19 cases were surging across Brazil, Camila Basto waited at a São Paulo hospital to find out what was wrong with her 9-year-old daughter, Manuela.\r\nManuela had a fever that reache… [+3299 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Allen Greene, Luke McGee and Bianca Nobilo, CNN", "title": "What is the 'pork pie plot' and what does it mean for Boris Johnson?", "description": "Boris Johnson is in trouble. Large chunks of the British public are furious about reports of boozy summer garden evenings and Christmas parties at his Downing Street office. Here's what may come next for the UK Prime Minister.", "url": "https://www.cnn.com/2022/01/19/uk/uk-boris-johnson-pork-pie-plot-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119064339-boris-johnson-01182022-super-tease.jpg", "publishedAt": "2022-01-19T12:20:44Z", "content": "London (CNN)UK Prime Minister Boris Johnson is in trouble. Large chunks of the British public are furious about reports of boozy summer garden evenings and Christmas parties at his Downing Street off… [+4334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, CNN", "title": "'The Rock': Dwayne Johnson says he isn't the anonymous buyer of T-Rex skull", "description": "Dwayne \"The Rock\" Johnson isn't the anonymous T-Rex skull buyer.", "url": "https://www.cnn.com/2022/01/19/sport/dwayne-the-rock-johnson-t-rex-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119062613-dwayne-johnson-peoples-choice-awards-2021-super-tease.jpg", "publishedAt": "2022-01-19T12:03:18Z", "content": "(CNN)Dwayne \"The Rock\" Johnson isn't the anonymous T-Rex skull buyer. \r\nIn October 2020, a 39-foot T-Rex fossil -- nicknamed \"Stan\" in acknowledgement of its discoverer Stan Sacrison who excavated th… [+2202 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for Jan. 19: Voting, Covid, Capitol riot, Trump business, Antitrust", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/01/19/us/five-things-january-19-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119042818-senate-chuck-schumer-011822-restricted-super-tease.jpg", "publishedAt": "2022-01-19T11:50:26Z", "content": "(CNN)I'm a coffee person, but if you prefer starting your mornings with orange juice, I have some sour news. OJ prices are surging because the orange crop this year is set to be the smallest in more … [+6610 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Comoros pulls off historic upset to knock out Ghana on AFCON debut", "description": "The tiny archipelago nation of Comoros pulled off one of the all-time great African Cup of Nations (AFCON) upsets with a 3-2 Group C victory over Ghana on Tuesday, dumping the four-time champion out of the tournament in Cameroon.", "url": "https://www.cnn.com/2022/01/19/football/comoros-ghana-afcon-upset-debut-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119111229-02-comoros-ghana-upset-afcon-debut-spt-intl-file-011822-super-tease.jpg", "publishedAt": "2022-01-19T11:48:23Z", "content": "(CNN)The tiny archipelago nation of Comoros pulled off one of the all-time great African Cup of Nations (AFCON) upsets with a 3-2 Group C victory over Ghana on Tuesday, dumping the four-time champion… [+3497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Jill Filipovic", "title": "The question we should be asking about violent crime in American cities", "description": "When it comes to our current crime trends, two things are true: Deadly violence isn't as pervasive as it was 20 years ago, but homicide numbers are rising in many major American cities. We should not collectively live in fear of deadly violence, Jill Filipovi…", "url": "https://www.cnn.com/2022/01/19/opinions/america-crime-trends-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118131757-queens-shooting-police-tape-super-tease.jpg", "publishedAt": "2022-01-19T11:37:36Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+5550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Robert Alexander", "title": "What 2020's pro-Trump phony electors means for 2024", "description": "Robert Alexander writes that slates of phony electors from seven states were sent to then-Vice President Mike Pence in an effort to persuade him to discard the legitimate slates of electors he received -- an alarming, albeit unsuccessful, attempt to upend the…", "url": "https://www.cnn.com/2022/01/19/opinions/2020-election-phony-electors-democracy-alexander/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220117151131-02-robert-alexander-foia-electors-az-envelope-super-tease.jpg", "publishedAt": "2022-01-19T11:24:48Z", "content": "Robert Alexander is a professor of political science and founding director of the Institute for Civics and Public Policy at Ohio Northern University. He is also the author of \"Representation and the … [+7567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabe Cohen, CNN", "title": "USPS on the hook for White House's free Covid-19 test deliveries", "description": "The US Postal Service says it's prepared to deliver the first 500 million home Covid-19 tests to homes across the US. But USPS is facing problems, with communities in several states dealing with mail delays because of Omicron.", "url": "https://www.cnn.com/2022/01/19/politics/free-home-covid-tests-mail-usps-delays/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118142755-home-covid-test-file-super-tease.jpg", "publishedAt": "2022-01-19T11:00:39Z", "content": "(CNN)The new government website where people can order free Covid-19 at-home rapid antigen tests is up and running. With just names and addresses, families can go to COVIDtests.gov and request up to … [+3153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Cristiano Ronaldo's 'Siu' celebration causes confusion at the Australian Open", "description": "Heard at weddings, in movie theaters and, of course, in football stadiums around the world, the sound of Cristiano Ronaldo's famous 'Siu' celebration became something of an unofficial soundtrack to 2021 -- and it's showing no signs of stopping in 2022.", "url": "https://www.cnn.com/2022/01/19/tennis/cristiano-ronaldo-siu-celebrations-australian-open-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119095317-kyrgios-super-tease.jpg", "publishedAt": "2022-01-19T10:52:16Z", "content": "(CNN)Heard at weddings, in movie theaters and, of course, in football stadiums around the world, the sound of Cristiano Ronaldo's famous 'Siu' celebration became something of an unofficial soundtrack… [+651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Vasco Cotovio, CNN", "title": "Blinken: Russia has plans in place to increase force on Ukraine borders \"even more\"", "description": "Russia has plans to further increase its military forces on Ukrainian borders, Secretary of State Antony Blinken said Wednesday in remarks to personnel at the US Embassy in Kyiv.", "url": "https://www.cnn.com/2022/01/19/politics/antony-blinken-ukraine-trip-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119095650-blinken-kyiv-011922-super-tease.jpg", "publishedAt": "2022-01-19T10:43:58Z", "content": "(CNN)Russia has plans to further increase its military forces on Ukrainian borders, Secretary of State Antony Blinken said Wednesday in remarks to personnel at the US Embassy in Kyiv.\r\n\"We know that … [+1426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Joseph Ataman", "title": "French education minister criticized for announcing Covid-19 measures from Ibiza", "description": "France's education minister has come under fire after confirming reports that he announced stringent new Covid-19 measures for schools while on vacation on the Spanish party island Ibiza.", "url": "https://www.cnn.com/travel/article/france-covid-minister-ibiza-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119051951-jean-michel-blanquer-french-011822-super-tease.jpg", "publishedAt": "2022-01-19T10:42:13Z", "content": "\"I regret the symbolism\" of Ibiza, Jean-Michel Blanquer told lawmakers on Tuesday. \r\nHowever he did caveat his regret. \"In winter it's not at all like in summer,\" he told French TV channel TF1 Tuesda… [+1443 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten and Ariane de Vogue, CNN", "title": "Ted Cruz's campaign finance rule challenge gets its day at the Supreme Court", "description": "The Supreme Court will revisit the issue of campaign finance Wednesday, hearing a challenge brought by Republican Sen. Ted Cruz of Texas to a federal cap on candidates using political contributions to recoup personal loans they make to their campaigns.", "url": "https://www.cnn.com/2022/01/19/politics/ted-cruz-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220107161005-ted-cruz-0105-super-tease.jpg", "publishedAt": "2022-01-19T10:07:13Z", "content": "(CNN)The Supreme Court will revisit the issue of campaign finance Wednesday, hearing a challenge brought by Republican Sen. Ted Cruz of Texas to a federal cap on candidates using political contributi… [+3726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond and Paul LeBlanc, CNN", "title": "Biden administration to distribute 400 million N95 masks to the public for free", "description": "The Biden administration will make 400 million N95 masks available to Americans for free starting next week, a White House official told CNN, the latest federal step aimed at reining in the US' Covid-19 surge.", "url": "https://www.cnn.com/2022/01/19/politics/n95-masks-biden-administration-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114100923-12-biden-first-year-unf-super-tease.jpg", "publishedAt": "2022-01-19T10:06:19Z", "content": "Washington (CNN)The Biden administration will make 400 million N95 masks available to Americans for free starting next week, a White House official told CNN, the latest federal step aimed at reining … [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN\nVideo by Finn McSkimming, CNN", "title": "Lost Sports of the Winter Olympics: The fast and furry world of sled dog racing", "description": "At the 1928 Winter Olympic Games in St. Moritz, Switzerland, demonstration sports -- not part of the official program -- were included for the first time. With demonstration events ceasing to exist after 1992, in this mini-series, CNN Sport explores some of t…", "url": "https://www.cnn.com/2022/01/19/sport/sled-dog-racing-winter-olympics-beijing-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220106102320-20220106-beijing-winter-olympics-sled-dog-racing-super-tease.jpg", "publishedAt": "2022-01-19T09:57:11Z", "content": "(CNN)At the 1928 Winter Olympic Games in St. Moritz, Switzerland, demonstration sports -- not part of the official program -- were included for the first time. With demonstration events ceasing to ex… [+6291 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Lusia Harris, the only woman ever officially drafted by an NBA team, has died", "description": "Lusia \"Lucy\" Harris, a star in women's collegiate basketball during the 1970s and the first and only woman ever to be officially drafted by an NBA team, died Tuesday, according to a statement from her family as well as Delta State University. She was 66.", "url": "https://www.cnn.com/2022/01/19/us/lusia-harris-first-woman-officially-drafted-nba-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119012859-lusia-harris-2021-super-tease.jpg", "publishedAt": "2022-01-19T09:46:43Z", "content": "(CNN)Lusia \"Lucy\" Harris, a star in women's collegiate basketball during the 1970s and the first and only woman ever to be officially drafted by an NBA team, died Tuesday, according to a statement fr… [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Barber, CNN", "title": "This is the ultimate snack food — and it's better for you than you think", "description": "When you're snacking for National Popcorn Day or any other day, popcorn can't be beat. More filling than other snacks, it also can be made from scratch in minutes, and you can flavor it any which way you want. Here's how to make it fun.", "url": "https://www.cnn.com/2022/01/19/health/national-popcorn-day-snack-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118141824-02-popcorn-stock-super-tease.jpeg", "publishedAt": "2022-01-19T09:42:35Z", "content": "Sign up for our Eat, But Better: Mediterranean Style newsletter, an eight-part series that guides you in a delicious expert-backed eating lifestyle that's good for your health.\r\n (CNN)When you're sna… [+5208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Amir Vera, CNN", "title": "New details emerge about hostage taker's behavior in days before Texas synagogue standoff", "description": "As authorities work to learn more about the armed man who held four people hostage at a Texas synagogue Saturday, new details are emerging of his activities in the days leading up to the incident, including a heated exchange at a nearby mosque.", "url": "https://www.cnn.com/2022/01/19/us/colleyville-texas-synagogue-investigation-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220115163705-01-hostage-congregation-beth-israel-colleyville-texas-super-tease.jpg", "publishedAt": "2022-01-19T09:27:34Z", "content": "(CNN)As authorities work to learn more about the armed man who held four people hostage at a Texas synagogue Saturday, new details are emerging of his activities in the days leading up to the inciden… [+6824 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Earl Nurse, CNN", "title": "Nigeria's Grammy-winning recording artist Burna Boy has a complicated relationship with Africa", "description": "Nigeria's Grammy-winning recording artist Burna Boy doesn't hold back when it comes to his feelings about his continent.", "url": "https://www.cnn.com/2022/01/19/africa/burna-boy-nigeria-complicated-relationship-africa-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220113132227-burna-boy-african-voices-02-super-tease.jpg", "publishedAt": "2022-01-19T08:37:07Z", "content": "(CNN)Last March, at an event center in Nigeria, Burna Boy stood on stage with a mic in hand, in front of a captivated audience. But the world-famous Afro-fusion recording artist wasn't there to perfo… [+4944 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "3 Indian sailors killed in explosion on naval ship", "description": "Three Indian Navy personnel were killed in an explosion on a ship at a naval dockyard in Mumbai on Tuesday, the navy said.", "url": "https://www.cnn.com/2022/01/19/india/india-navy-ship-explosion-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119031612-indian-navy-2009-file-super-tease.jpg", "publishedAt": "2022-01-19T08:33:26Z", "content": "Mumbai, IndiaThree Indian Navy personnel were killed in an explosion on a ship at a naval dockyard in Mumbai on Tuesday, the navy said.\r\nIt gave no reason for the blast but said a board of inquiry wo… [+414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sean Federico-O'Murchu, CNN", "title": "Fashion icon André Leon Talley is dead at age 73", "description": "Andrê Leon Talley, the former longtime creative director for Vogue and a fashion icon in his own right, has died at age 73, according to a statement on his official Instagram account.", "url": "https://www.cnn.com/style/article/andre-leon-talley-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118232514-andre-leon-talley-file-02122020-super-tease.jpg", "publishedAt": "2022-01-19T06:55:43Z", "content": "Andrê Leon Talley, the former longtime creative director for Vogue and a fashion icon in his own right, has died at age 73, according to a statement on his official Instagram account.\r\nTalley was a p… [+3543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "New York attorney general's office says it has identified numerous 'misleading statements and omissions' in Trump Org. financial statements", "description": "New York Attorney General Letitia James' office says it needs the testimony of former President Donald Trump and two of his adult children to determine their knowledge of what investigators say they have identified as numerous \"misleading statements and omiss…", "url": "https://www.cnn.com/2022/01/19/politics/new-york-attorney-general-trump-organization-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630100528-02-trump-tower-2019-file-super-tease.jpg", "publishedAt": "2022-01-19T05:54:18Z", "content": "(CNN)New York Attorney General Letitia James' office says it needs the testimony of former President Donald Trump and two of his adult children to determine their knowledge of what investigators say … [+6359 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Virginia parents file lawsuit against Gov. Youngkin over executive order ending mask mandates in public schools", "description": "A group of parents of public school students in Chesapeake, Virginia, filed a lawsuit Tuesday asking Virginia's Supreme Court to block a new executive order issued by Republican Gov. Glenn Youngkin that makes masks voluntary for children in the state's public…", "url": "https://www.cnn.com/2022/01/19/politics/virginia-parents-youngkin-masks-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220117171805-02-glenn-youngkin-0117-super-tease.jpg", "publishedAt": "2022-01-19T05:53:20Z", "content": "(CNN)A group of parents of public school students in Chesapeake, Virginia, filed a lawsuit Tuesday asking Virginia's Supreme Court to block a new executive order issued by Republican Gov. Glenn Young… [+2014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown,  CNN", "title": "Tripadvisor's most popular destination in the world for 2022 is ...", "description": "Tripadvisor has announced its Travelers' Choice Awards for 2022. In the category of top 10 most popular destinations in the world, a Middle Eastern glamour spot has emerged No. 1. Find out the other nine locations and what makes Dubai a favorite.", "url": "https://www.cnn.com/travel/article/tripadvisor-travelers-choice-awards-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118174717-04-tripadvisor-most-popular-destinations-2022-dubai-super-tease.jpg", "publishedAt": "2022-01-19T05:14:49Z", "content": "(CNN) Tripadvisor says a 20th-century fishing village that' has boomed into a 21st-century global hot spot for high-end travel is its most popular destination in the world for 2022.\r\nThe travel platf… [+4077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeff Zeleny, Kevin Liptak and Kaitlan Collins, CNN", "title": "Joe Biden enters the second year of his presidency looking for a reset after a tumultuous first 12 months", "description": "As he walked through the front gate of the White House complex last year for the first time as President, Joe Biden declared it felt like \"going home.\"", "url": "https://www.cnn.com/2022/01/19/politics/joe-biden-first-year-in-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118161428-00-biden-year-one-restricted-super-tease.jpg", "publishedAt": "2022-01-19T05:04:10Z", "content": "A security officer asks the media to step back at the start of the June 16 summit between Biden and Russian President Vladimir Putin. Seated from left are US Secretary of State Antony Blinken, Biden,… [+921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "10 crises that demand answers at Biden's press conference", "description": "If President Joe Biden's only task in his solo press conference on Wednesday was restoring his battered political standing, it would be daunting enough. But the President will arrive in the East Room at a moment of national exhaustion and drained morale as th…", "url": "https://www.cnn.com/2022/01/19/politics/president-joe-biden-10-crises-press-conference/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118154339-02-biden-year-one-super-tease.jpg", "publishedAt": "2022-01-19T05:02:11Z", "content": "(CNN)If President Joe Biden's only task in his solo press conference on Wednesday was restoring his battered political standing, it would be daunting enough. But the President will arrive in the East… [+13875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "For the Year of the Tiger, can luxury fashion change its stripes?", "description": "Luxury labels are again vying for a slice of China's $128-billion Lunar New Year spending spree. But after years of gimmicky designs, this year's tiger theme has finally heralded collections that may outlive the annual fashion cycle.", "url": "https://www.cnn.com/style/article/china-shopping-fashion-year-of-the-tiger-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220113125656-10-year-of-the-tiger-fashion-super-tease.jpg", "publishedAt": "2022-01-19T04:57:52Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+5691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Hong Kong plans to cull 2,000 hamsters over Covid fears. Pet owners are outraged", "description": "Hong Kong will euthanize about 2,000 hamsters and other small animals after a pet store worker and several rodents tested positive for coronavirus, as the city pursues an uncompromising zero-Covid strategy two years into the pandemic.", "url": "https://www.cnn.com/2022/01/18/asia/hong-kong-covid-cull-hamsters-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118162335-02-hk-pet-store-covid-super-tease.jpg", "publishedAt": "2022-01-19T04:10:02Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+6738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "US law enforcement officials aim to reassure Jewish community in wake of hostage standoff", "description": "Top Biden administration law enforcement officials -- including the FBI director, the attorney general and the Homeland Security secretary -- sought to reassure more than 1,000 members of the Orthodox Jewish community during a teleconference meeting Tuesday t…", "url": "https://www.cnn.com/2022/01/18/politics/federal-law-enforcement-jewish-community-standoff/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220115194521-texas-hostage-situation-congregation-beth-israel-synagogue-011522-super-tease.jpg", "publishedAt": "2022-01-19T03:32:41Z", "content": "(CNN)Top Biden administration law enforcement officials -- including the FBI director, the attorney general and the Homeland Security secretary -- sought to reassure more than 1,000 members of the Or… [+3613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray and Jeff Simon, CNN", "title": "The 2020 election wasn't stolen. But an Ohio math teacher and his bogus equation claiming otherwise are still winning over audiences.", "description": "Douglas Frank, an Ohio math teacher, affixed his Texas flag print bow tie, led a booming rendition of the National Anthem and then walked a crowd through an absurd mathematical equation that he claimed proves the 2020 election was stolen.", "url": "https://www.cnn.com/2022/01/18/politics/douglas-frank-big-lie/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211216171216-douglas-frank-ohio-0626-restricted-super-tease.jpg", "publishedAt": "2022-01-19T03:06:41Z", "content": "Austin (CNN)Douglas Frank, an Ohio math teacher, affixed his Texas flag print bow tie, led a booming rendition of the National Anthem and then walked a crowd through an absurd mathematical equation t… [+10960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nell Lewis, CNN", "title": "The bears and the bees: How honey is helping to save the spectacled bear", "description": "South America's only bear species is under threat as human-bear conflict increases. According to conservationists, beekeeping could be part of the solution.", "url": "https://www.cnn.com/2022/01/18/americas/spectacled-bear-bolivia-c2e-spc-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114102942-spectacled-bear-4-super-tease.jpg", "publishedAt": "2022-01-19T02:09:28Z", "content": "This story was identified by Call to Earth guest editor Erika Cuéllar. She is a biologist and conservationist, and a Rolex Award Laureate.\r\n (CNN)A bear cub with distinctive yellow circling about the… [+6657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Sidney Poitier's death certificate indicates he died of heart failure", "description": "A death certificate for legendary actor Sidney Poitier, who died on Jan. 6 at age 94, lists heart failure as the cause of his death.", "url": "https://www.cnn.com/2022/01/18/entertainment/sidney-poitier-cause-of-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220107100228-01-sidney-poitier-lead-image-super-tease.jpg", "publishedAt": "2022-01-19T01:11:31Z", "content": "(CNN)A death certificate for legendary actor Sidney Poitier, who died on Jan. 6 at age 94, lists heart failure as the cause of his death.\r\nThe document, obtained by CNN Tuesday, states Poitier died a… [+1021 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Vitagliano, CNN", "title": "3 Pennsylvania officers charged with manslaughter in fatal shooting of 8-year-old Fanta Bility", "description": "Three Sharon Hill, Pennsylvania, police officers were charged Tuesday in connection with the shooting death of 8-year-old Fanta Bility while she exited a high school football game on August 27, 2021, prosecutors said.", "url": "https://www.cnn.com/2022/01/18/us/pennsylvania-officers-charged-manslaughter-fanta-bility-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118180631-02-officers-charged-manslaughter-bility-shooting-file-0113-super-tease.jpg", "publishedAt": "2022-01-19T00:38:42Z", "content": "(CNN)Three Sharon Hill, Pennsylvania, police officers were charged Tuesday in connection with the shooting death of 8-year-old Fanta Bility while she exited a high school football game on August 27, … [+3453 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf and Fredreka Schouten, CNN", "title": "Say goodbye to making Election Day a federal holiday and other pro-voting ideas", "description": "The ongoing debate over a national standard for voting will reach its climax, for now, on Capitol Hill this week. Here's what American voters should know about how new changes in key states and a failure to enact a new national standard will affect their act …", "url": "https://www.cnn.com/2022/01/18/politics/voting-rights-debate-impact-voters-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118122838-georgia-voter-sticker-super-tease.jpg", "publishedAt": "2022-01-19T00:16:16Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here. \r\n (CNN)The ongoing debate over a national standard for voting will reach its climax… [+5490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Your eyes may reveal your true biological age, study finds", "description": "The back of your eye, called the retina, reveals a wealth of health information to doctors, and may one day show your body's true biological age, regardless of how old you are.", "url": "https://www.cnn.com/2022/01/18/health/eye-reveals-true-age-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200718134512-eyeball-stock-super-tease.jpg", "publishedAt": "2022-01-18T23:34:23Z", "content": "(CNN)The eyes may offer a \"window into the soul,\" as poets say, but they also have a lot to say about your health.\r\nDry eyes can be a sign of rheumatoid arthritis. High levels of cholesterol can caus… [+4273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Nick Saban and other sports figures urge Manchin to help pass voting rights bill", "description": null, "url": "https://www.cnn.com/2022/01/18/politics/nick-saban-jerry-west-joe-manchin-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211125123722-nick-saban-file-november-20-2021-super-tease.jpeg", "publishedAt": "2022-01-18T23:27:12Z", "content": "(CNN)University of Alabama football coach Nick Saban and other prominent sports figures with ties to West Virginia have penned a letter to Sen. Joe Manchin, urging the West Virginia Democrat to help … [+2916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis pushes Florida redistricting map that heavily favors Republicans", "description": "For political observers who have wondered for months how far Republicans should press their advantage in Florida when drawing the state's new congressional boundaries, they now have a response from Gov. Ron DeSantis: all the way.", "url": "https://www.cnn.com/2022/01/18/politics/florida-redistricting-desantis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210922220312-gov-desantis-presser-0922-super-tease.jpg", "publishedAt": "2022-01-18T23:23:08Z", "content": "(CNN)For political observers who have wondered for months how far Republicans should press their advantage in Florida when drawing the state's new congressional boundaries, they now have a response f… [+6289 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel, Jeremy Herb and Elizabeth Stuart, CNN", "title": "Exclusive: Eric Trump and Kimberly Guilfoyle's phone records subpoenaed by January 6 committee", "description": "The House committee investigating the January 6 attack on the US Capitol has subpoenaed and obtained records of phone numbers associated with one of former President Donald Trump's children, Eric Trump, as well as Kimberly Guilfoyle, who is engaged to Donald …", "url": "https://www.cnn.com/2022/01/18/politics/eric-trump-kim-guilfoyle-subpoena-jan-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118165542-eric-trump-kimberly-guilfoyle-split-super-tease.jpg", "publishedAt": "2022-01-18T23:00:30Z", "content": "Washington (CNN)The House committee investigating the January 6 attack on the US Capitol has subpoenaed and obtained records of phone numbers associated with one of former President Donald Trump's ch… [+6183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, CNN", "title": "Here's what the federal voting proposals would do", "description": null, "url": "https://www.cnn.com/2022/01/18/politics/freedom-to-vote-act-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231132316-us-capitol-1229-super-tease.jpg", "publishedAt": "2022-01-18T23:00:03Z", "content": "(CNN)In Texas, it's now a crime for election workers to send absentee ballot applications to voters who didn't request them. In Georgia, most voters who show up at the wrong polling places on Electio… [+4637 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Authorities found the body of a missing woman days after charging her boyfriend with her killing", "description": "Divers from the Fresno County, California, Sheriff's Office embarked on a \"dangerous dive operation\" this week and recovered the body of Missy Hernandez, who was last seen more than a month ago, authorities announced Tuesday.", "url": "https://www.cnn.com/2022/01/18/us/fresno-sheriff-divers-recover-missing-woman-body/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114170009-01-ramon-jimenez-missy-hernandez-011422-super-tease.jpg", "publishedAt": "2022-01-18T22:45:28Z", "content": "(CNN)Divers from the Fresno County, California, Sheriff's Office embarked on a \"dangerous dive operation\" this week and recovered the body of Missy Hernandez, who was last seen more than a month ago,… [+2688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Immigration court backlog nearly equals size of Philadelphia's population, study finds", "description": "The US immigration court backlog reached nearly 1.6 million cases last year, with cases climbing more rapidly between October and December, according to Syracuse University's Transactional Records Access Clearinghouse, which tracks immigration court data.", "url": "https://www.cnn.com/2022/01/18/politics/immigration-court-backlog/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190201095858-immigration-court-super-tease.jpg", "publishedAt": "2022-01-18T22:38:37Z", "content": "(CNN)The US immigration court backlog reached nearly 1.6 million cases last year, with cases climbing more rapidly between October and December, according to Syracuse University's Transactional Recor… [+2466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liz Stark, CNN", "title": "Education Department completes distribution of $122 billion in school Covid-19 relief funding to states", "description": "The US Department of Education has distributed all $122 billion in school Covid-19 relief funding from the American Rescue Plan to states, the Biden administration announced Tuesday -- a major milestone as school districts nationwide continue to grapple with …", "url": "https://www.cnn.com/2022/01/18/politics/covid-relief-education-department-american-rescue-plan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210823101205-01-nyc-school-classroom-file-super-tease.jpg", "publishedAt": "2022-01-18T22:35:48Z", "content": "(CNN)The US Department of Education has distributed all $122 billion in school Covid-19 relief funding from the American Rescue Plan to states, the Biden administration announced Tuesday -- a major m… [+2514 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Annie Grayer, CNN", "title": "January 6 committee subpoenas Giuliani and 3 others", "description": "The House select committee investigating the January 6 riot issued a subpoena Tuesday for Rudy Giuliani, a central figure in former President Donald Trump's failed bid to overturn the 2020 election on the basis of unfounded allegations of widespread voter fra…", "url": "https://www.cnn.com/2022/01/18/politics/rudy-giuliani-january-6-subpoena/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118172627-02-giuliani-file-2020-restricted-super-tease.jpg", "publishedAt": "2022-01-18T22:30:01Z", "content": "(CNN)The House select committee investigating the January 6 riot issued a subpoena Tuesday for Rudy Giuliani, a central figure in former President Donald Trump's failed bid to overturn the 2020 elect… [+1314 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown and Marnie Hunter, CNN", "title": "CDC moves 22 new destinations into its highest-risk level for travel", "description": "The US Centers for Disease Control and Prevention moved a whopping 22 new nations into its highest-risk travel category for Covid-19 (Level 4) on Tuesday, including Argentina, Australia and Egypt.", "url": "https://www.cnn.com/travel/article/cdc-very-high-risk-travel-destinations-january-18/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118160821-giza-pyramids-dec-2021-super-tease.jpg", "publishedAt": "2022-01-18T21:14:51Z", "content": "(CNN) The surge of Omicron variant cases has now reached tsunami-like proportions in the travel world.\r\nThe US Centers for Disease Control and Prevention moved a whopping 22 nations into its highest-… [+4736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "How film is putting Indigenous languages in the spotlight", "description": "Original films like \"Sooyi\" and dubbed versions of movies like \"Moana\" and \"Star Wars\" are bringing attention to Indigenous languages. As these endeavors prove successful and demand grows, the medium is increasingly being seen as a tool to revitalize dying to…", "url": "https://www.cnn.com/2022/01/18/entertainment/film-revitalizing-indigenous-languages-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118070756-01-sooyii-film-super-tease.jpg", "publishedAt": "2022-01-18T20:46:53Z", "content": "By Harmeet Kaur, CNN\r\nUpdated 3:46 PM ET, Tue January 18, 2022\r\n (CNN)On its face, \"Sooyii\" is a story of resilience in the face of unimaginable loss.\r\nThe independent film, directed by Krisztian Ker… [+10383 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Pissarro painting confiscated by Nazis at center of Supreme Court arguments", "description": null, "url": "https://www.cnn.com/2022/01/18/politics/pissarro-nazi-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118095154-camille-pissarro-art-super-tease.jpg", "publishedAt": "2022-01-18T20:10:10Z", "content": "(CNN)In a case involving a Nazi confiscation of a Jewish family's painting, the Supreme Court on Tuesday grappled with how federal courts should decide whether California law or a foreign country's l… [+3633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Gay rights activist Jim Obergefell announces bid for Ohio House", "description": "Jim Obergefell, the gay rights activist and named plaintiff in the Supreme Court case that legalized same-sex marriage nationwide, announced on Tuesday that he is launching a bid for the Ohio State House.", "url": "https://www.cnn.com/2022/01/18/politics/jim-obergefell-ohio-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118123342-01-jim-obergefell-file-super-tease.jpg", "publishedAt": "2022-01-18T19:26:29Z", "content": "Washington, DC (CNN)Jim Obergefell, the gay rights activist and named plaintiff in the Supreme Court case that legalized same-sex marriage nationwide, announced on Tuesday that he is launching a bid … [+1767 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Amy Schumer 'feeling good' after endometriosis surgery and liposuction", "description": "Amy Schumer looks strong and healthy, revealing that she finally feels good following surgery for endometriosis and liposuction.", "url": "https://www.cnn.com/2022/01/18/entertainment/amy-schumer-surgery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118133628-amy-schumer-instagram-post-0118-super-tease.jpg", "publishedAt": "2022-01-18T19:13:49Z", "content": "(CNN)Amy Schumer looks strong and healthy, revealing that she finally feels good following surgery for endometriosis and liposuction.\r\n\"I feel good. Finally. It's been a journey thanks for helping me… [+1102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Two long-serving Democratic congressmen announce they won't seek reelection in 2022", "description": "Long-serving Democratic Reps. Jim Langevin of Rhode Island and Jerry McNerney of California announced Tuesday that they will not be seeking reelection in November, joining the more than two dozen House Democrats planning to retire after this term of Congress.", "url": "https://www.cnn.com/2022/01/18/politics/jim-langevin-jerry-mcnerney-retirements/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614154327-us-rep-jim-langevin-super-tease.jpg", "publishedAt": "2022-01-18T19:03:28Z", "content": "(CNN)Long-serving Democratic Reps. Jim Langevin of Rhode Island and Jerry McNerney of California announced Tuesday that they will not be seeking reelection in November, joining the more than two doze… [+1650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David Andelman", "title": "America has taken its eyes off the ball on Iran", "description": "All but lost in the noise of Russia's \"drumbeat of war\" on Ukraine is an even more pressing warning siren -- getting Iran back into the agreement that would keep it from building a nuclear weapon. And that is looking increasingly chancy.", "url": "https://www.cnn.com/2022/01/18/opinions/america-iran-russia-ukraine-nuclear-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118114328-iran-nuclear-power-plant-development-file-2019-super-tease.jpg", "publishedAt": "2022-01-18T18:52:46Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+7499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav and Clare Foran, CNN", "title": "Schumer starts debate on voting legislation, says 'eyes of the nation' are on the Senate", "description": "As the chamber returned after Martin Luther King Jr. Day, Senate Majority Leader Chuck Schumer started debate on House-passed voting rights legislation and warned that \"the eyes of the nation will be watching what happens this week in the United States Senate…", "url": "https://www.cnn.com/2022/01/18/politics/senate-democrats-voting-bills/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220111132539-01-schumer-senate-democrats-file-super-tease.jpg", "publishedAt": "2022-01-18T18:43:31Z", "content": "(CNN)As the chamber returned after Martin Luther King Jr. Day, Senate Majority Leader Chuck Schumer started debate on House-passed voting rights legislation and warned that \"the eyes of the nation wi… [+3497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Former New York Post digital chief alleges wrongful firing after privately reporting longtime Murdoch lieutenant propositioned her for sex", "description": "Michelle Gotthelf, the former editor in chief of the New York Post's digital operation, filed a lawsuit on Tuesday against the tabloid, alleging she was wrongfully fired earlier this month after she reported to her boss that a longtime lieutenant of Rupert Mu…", "url": "https://www.cnn.com/2022/01/18/media/new-york-post-michelle-gotthelf-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118110229-file-col-allan-new-york-post-2010-restricted-super-tease.jpg", "publishedAt": "2022-01-18T18:32:50Z", "content": "New York (CNN Business)Michelle Gotthelf, the former editor in chief of the New York Post's digital operation, filed a lawsuit on Tuesday against the tabloid, alleging she was wrongfully fired earlie… [+3558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Michael D'Antonio", "title": "What's behind the Hillary Clinton '24 talk", "description": "The most telling thing about a potential Hillary Clinton run in 2024 isn't whether she'll actually do it -- it's in the reactions to the rumors, Michael D'Antonio writes.", "url": "https://www.cnn.com/2022/01/18/opinions/hillary-clinton-2024-reaction-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190510082234-hillary-clinton-0916-file-super-tease.jpg", "publishedAt": "2022-01-18T18:10:17Z", "content": "Michael D'Antonio is the author of the book \"The Hunting of Hillary\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachment of Donald Trump.\" The opinio… [+6526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "'I'm just so embarrassed': Bono really isn't U2's biggest fan", "description": "U2 may be one of the biggest rock bands on the planet, but its lead singer Bono is harboring some grievances around the group's name and the songs he's written and performed throughout their 46 years together.", "url": "https://www.cnn.com/2022/01/18/entertainment/bono-u2-embarrassed-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118105925-01-bono-dec-2021-super-tease.jpg", "publishedAt": "2022-01-18T18:05:53Z", "content": "(CNN)U2 may be one of the biggest rock bands on the planet, but its lead singer Bono is harboring some grievances around the group's name and the songs he's written and performed throughout their 46 … [+2195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Website to order free Covid-19 tests is up and running", "description": "The federal government has quietly launched its website to sign up for free Covid-19 tests, allowing people to order a maximum of four tests shipped directly to their household.", "url": "https://www.cnn.com/2022/01/18/politics/free-covid-tests-wbsite-beta-launched/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222045724-covid-home-test-kit-12172021-super-tease.jpg", "publishedAt": "2022-01-18T18:04:48Z", "content": "(CNN)The federal government has quietly launched its website to sign up for free Covid-19 tests, allowing people to order a maximum of four tests shipped directly to their household.\r\nGiven the forma… [+1010 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Danny McBride says radio sermons and Elvis fuel 'The Righteous Gemstones'", "description": "Danny McBride talks about Season 2 of \"The Righteous Gemstones,\" his third series with HBO.", "url": "https://www.cnn.com/2022/01/18/entertainment/danny-mcbride-the-righteous-gemstones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190813185645-righteous-gemstones-hbo-super-tease.jpg", "publishedAt": "2022-01-18T17:53:31Z", "content": "(CNN)Danny McBride says it was moving to Charleston, South Carolina, that sparked the first idea for \"The Righteous Gemstones,\" his third series with HBO. \r\nHe created, executive produces and stars i… [+3263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "What Neil Gorsuch and Glenn Youngkin have in common", "description": "The mentality that it is ok to make women feel massively uncomfortable in public settings -- so much so that they exit them altogether -- to avoid burdening men with the slightest inconvenience of putting on masks helps explain why we live in such an unequal …", "url": "https://www.cnn.com/2022/01/18/opinions/gorsuch-youngkin-maskless-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118114959-gorsuch-youngkin-split-super-tease.jpg", "publishedAt": "2022-01-18T17:44:45Z", "content": "Kara Alaimo, an associate professor in the Lawrence Herbert School of Communication at Hofstra University, writes about women and social media. She was spokeswoman for international affairs in the Tr… [+5408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Jim Sciutto, Katie Bo Williams, Barbara Starr and Alex Marquardt, CNN", "title": "US weighs more military support for Ukraine to resist Russia if it invades", "description": "The Biden administration is weighing new options, including providing more arms to Ukraine to resist a Russian occupation, to try to raise the costs for Russian President Vladimir Putin should he decide to invade the country.", "url": "https://www.cnn.com/2022/01/18/politics/us-military-support-ukraine-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118113155-02-ukraine-military-1212-super-tease.jpg", "publishedAt": "2022-01-18T17:21:49Z", "content": "(CNN)The Biden administration is weighing new options, including providing more arms to Ukraine to resist a Russian occupation, to try to raise the costs for Russian President Vladimir Putin should h… [+7259 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "FBI & European police take down computer servers used in 'major international cyberattacks'", "description": "The FBI and police from multiple European countries and Canada have taken down 15 computer servers that were used in \"major international cyberattacks,\" law enforcement agencies said this week.", "url": "https://www.cnn.com/2022/01/18/politics/fbi-europol-vpn-ransomware/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118112941-cybercrime-investigation-presser-0118-restricted-super-tease.jpg", "publishedAt": "2022-01-18T17:11:45Z", "content": "(CNN)The FBI and police from multiple European countries and Canada have taken down 15 computer servers that were used in \"major international cyberattacks,\" law enforcement agencies said this week. … [+1861 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "School closures can harm kids' mental and academic health. Experts say how families can help", "description": "Keeping children safe during the pandemic sometimes means keeping them out of school, but they lose a lot of what is important to their academic and emotional wellbeing when that happens. Experts share how children are impacted and how families can help.", "url": "https://www.cnn.com/2022/01/18/health/children-impact-school-closing-coronavirus-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114123859-children-impact-school-closing-coronavirus-wellness-super-tease.jpg", "publishedAt": "2022-01-18T16:41:45Z", "content": "(CNN)Every day, when Phyllis Fagell goes into work as a school counselor, she brings a duffel bag big enough to pack up her office -- awaiting the day that she and her students must adjust to a world… [+9541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peniel E. Joseph", "title": "Why Joe Biden looked to segregrationist history to pull the GOP back from the brink on voting rights", "description": "By invoking Martin Luther King Jr., George Wallace, John Lewis, Bull Connor, Abraham Lincoln and Jefferson Davis, President Joe Biden acknowledged that no aspect of America's history on matters of race is separate or divisible from what came before it, writes…", "url": "https://www.cnn.com/2022/01/18/opinions/biden-segregationist-history-voting-rights-george-wallace-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220111132601-05-biden-harris-atlanta-0111-super-tease.jpg", "publishedAt": "2022-01-18T16:18:51Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+7242 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'I'm old but gold': Jim Carrey on turning 60", "description": "Jim Carrey celebrated his 60th birthday and marked the milestone event with a hilarious Twitter video.", "url": "https://www.cnn.com/videos/entertainment/2022/01/18/jim-carrey-celebrates-60th-birthday-mxp-knowles-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190117230939-pba-jim-carrey-mejores-peliculas-best-movies-super-tease.jpg", "publishedAt": "2022-01-18T15:51:31Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Isabelle Jani-Friend, CNN", "title": "A 555.55-carat black diamond believed to come from space is going on sale", "description": "A 555.55-carat black diamond that is truly from out of this world has been unveiled by auction house Sotheby's Dubai.", "url": "https://www.cnn.com/style/article/enigma-diamond-sothebys-auction-scn-scil-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118054840-04-enigma-diamond-sothbys-auction-scil-intl-super-tease.jpg", "publishedAt": "2022-01-18T15:43:18Z", "content": "luxuryPublished 18th January 2022\r\nA 555.55-carat black diamond that is truly from out of this world has been unveiled by auction house Sotheby's Dubai.\r\nThe rare gem, which Sotheby's has dubbed \"The… [+2487 chars]"}]}