{"status": "ok", "totalResults": 106, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Is herd immunity for Covid-19 still possible?", "description": "This time last year, the brand new, stunningly effective Covid-19 vaccines were rolling out across the country, injecting a strong note of optimism into the United States' once fumbling pandemic response.", "url": "https://www.cnn.com/2022/04/15/health/covid-19-herd-immunity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220415090859-covid-vaccine-pennsylvania-0405-restricted-super-tease.jpg", "publishedAt": "2022-04-15T13:29:07Z", "content": "(CNN)This time last year, the brand new, stunningly effective Covid-19 vaccines were rolling out across the country, injecting a strong note of optimism into the United States' once fumbling pandemic… [+7587 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz", "title": "Feinstein defends service following report about deteriorating memory and ability to lead", "description": "Democratic Sen. Dianne Feinstein defended her position as senior senator representing California following a news report published Thursday that lawmakers she serves with are concerned about her memory and ability to serve in the Senate.", "url": "https://www.cnn.com/2022/04/15/politics/dianne-feinstein-defends-record/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220113173831-01-dianne-feinstein-lead-image.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T13:27:30Z", "content": "Democratic Sen. Dianne Feinstein defended her position as senior senator representing California following a news report published Thursday that lawmakers she serves with are concerned about her memo… [+1826 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Fantastic Beasts' turns 'The Secrets of Dumbledore' into too much of a snore", "description": "Despite the enticing subtitle \"Fantastic Beasts: The Secrets of Dumbledore,\" the second in J.K. Rowling's Harry Potter-prequel franchise mirrors the first, which is to say that it feels like an extended prologue for a better movie that's yet to materialize.", "url": "https://www.cnn.com/2022/04/15/entertainment/fantastic-beasts-secrets-of-dumbledore-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413133611-03-fantastic-beasts-secrets-of-dumbledore-super-tease.jpg", "publishedAt": "2022-04-15T13:25:03Z", "content": "(CNN)Despite the enticing subtitle \"Fantastic Beasts: The Secrets of Dumbledore,\" the second sequel to J.K. Rowling's Wizarding World franchise mirrors the first, which is to say that it feels like a… [+2935 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, graphics by Leah Abucayan", "title": "The community fridge movement could change the way we think about helping each other", "description": "The world has a lot of problems. Big problems, with big consequences that require big solutions. In the midst of all this \"bigness,\" the average person can end up feeling too small to offer anything of value.", "url": "https://www.cnn.com/2022/04/15/us/community-fridge-mutual-aid-free99-love-fridge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413114241-20220413-communityfridge-topimage-super-tease.jpg", "publishedAt": "2022-04-15T13:15:08Z", "content": "This is part of a CNN series, \"The Helpers,\" which showcases people who are going the extra mile to help others and make their communities a better place.\r\nThe world has a lot of problems. Big proble… [+8823 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Griffin for CNN Business Perspectives", "title": "Opinion: 3 things Disney should do after its 'Don't Say Gay' blunder", "description": "The outrage of Disney's LGBTQIA+ workforce and their allies indicate that this strategy clearly backfired. Now, Disney must do more than just speak out against the legislation.", "url": "https://www.cnn.com/2022/04/15/perspectives/disney-dont-say-gay/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220322160942-01-disney-employee-walkout-0322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T13:11:11Z", "content": "Editors Note: Sean Griffin is a professor of Film &amp; Media Arts at Southern Methodist Universitys Meadows School of the Arts. He is the author of Tinker Belles and Evil Queens: The Walt Disney Com… [+5243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Coachella is back. But have festivals escaped the problematic legacy of 'boho chic'?", "description": "Coachella and festival fashion was once one and the same. But its \"boho-chic\" dress code fell out of favor years ago, with uncomfortable instances of cultural appropriation that have now seared into the popular imagination.", "url": "https://www.cnn.com/style/article/coachella-festival-fashion-cultural-appropriation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414113551-07-coachella-cultural-appropriation-fashion-super-tease.jpg", "publishedAt": "2022-04-15T12:45:14Z", "content": "This weekend sees the return of Coachella after a three-year pandemic-induced hiatus. And, as ever, there will be as much written about the festival's fashion as its performances. \r\nBut while the eve… [+6472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse", "title": "12-year-old Ukrainian refugee from Mariupol scores goal in Shakhtar Donetsk charity match", "description": "For 12-year-old Dmytro Keda, after the worst few weeks imaginable, Thursday evening was a dream come true.", "url": "https://www.cnn.com/2022/04/15/football/dmytro-keda-shakhtar-donetsk-ukraine-war-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220415064110-01-shakhtar-goal.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T12:27:09Z", "content": "For 12-year-old Dmytro Keda, after the worst few weeks imaginable, Thursday evening was a dream come true. \r\nKeda, who fled his hometown of Mariupol in Ukraine after spending three weeks holed up as … [+2099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez", "title": "Maine lawmakers have a chance to end these tribes' fight for sovereignty", "description": "Native American people in Maine have been excluded from protections guaranteed by federal law for more than 40 years but lawmakers could help change it.", "url": "https://www.cnn.com/2022/04/15/us/maine-tribal-sovereignty-legislation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414105752-01-native-tribal-sovereignty-augusta-maine-0411.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T12:22:40Z", "content": "Native American people in Maine have been excluded from protections guaranteed by federal law for more than 40 years but lawmakers could help change it.\r\nAs the state Legislatures second session reac… [+5456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Barber, CNN", "title": "Sick of hard-boiled eggs? Here are the dishes to get you egg-cited this month", "description": "It's the most egg-cellent time of the year. Along with crocuses and daffodils, fluffy bunnies and chicks and pastel colors popping up everywhere, spring is the season when the sunny spheres of eggs take center stage.", "url": "https://www.cnn.com/2022/04/15/health/eggs-april-recipe-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220408140008-01-eggs-recipe-april-wellness-stock-super-tease.jpg", "publishedAt": "2022-04-15T12:07:41Z", "content": "This month, food writer Casey Barber takes note of great recipes and dishes with eggs. Stay tuned for her May selection, and for all the months that follow.\r\n (CNN)It's the most egg-cellent time of t… [+5306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dave Lucas", "title": "I am a lapsed Catholic who finds blessings at this Passover table", "description": "Dave Lucas describes the rituals of friendship and religion that have brought him, a lapsed Catholic, together again and again with the descendants of Rudolph and Clara Komerofsky -- two people he never met but whose family's Passover traditions are a yearly …", "url": "https://www.cnn.com/2022/04/15/opinions/passover-seder-catholic-blessings-lucas/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414190622-seder-komerofsky-2015.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T12:04:10Z", "content": "Editors Note: Dave Lucas is a poet and essayist whose work has appeared in Granta, The Nation, The Paris Review, Poetry, Slate, The Threepenny Review, VQR, and elsewhere. The views expressed here are… [+7921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi,Betsy Klein", "title": "Biden to nominate Michael Barr as Fed's top banking regulator", "description": "President Joe Biden on Friday announced his intent to nominate former Obama Treasury official Michael Barr as the vice chair for supervision of the Federal Reserve.", "url": "https://www.cnn.com/2022/04/15/business/biden-federal-reserve-michael-barr/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220415055620-michael-barr-file-2010.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T11:26:48Z", "content": "President Joe Biden on Friday announced his intent to nominate former Obama Treasury official Michael Barr as the vice chair for supervision of the Federal Reserve.\r\nThe announcement comes after Bide… [+1363 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "READ: Mark Meadows' texts with Mike Lee and Chip Roy", "description": "CNN has obtained text messages of separate conversations that then-White House chief of staff Mark Meadows had with Republican Sen. Mike Lee of Utah and Republican Rep. Chip Roy of Texas after the 2020 presidential election and through early January 2021.", "url": "https://www.cnn.com/2022/04/15/politics/read-mark-meadows-texts-mike-lee-chip-roy/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414181047-roy-meadows-lee-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T11:00:51Z", "content": "CNN has obtained text messages of separate conversations that then-White House chief of staff Mark Meadows had with Republican Sen. Mike Lee of Utah and Republican Rep. Chip Roy of Texas after the 20… [+19380 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer, Zachary Cohen and Jamie Gangel, CNN", "title": "CNN Exclusive: 'We need ammo. We need fraud examples. We need it this weekend.' What the Meadows texts reveal about how two Trump congressional allies lobbied the White House to overturn the election.", "description": "In the weeks between the 2020 election and the January 6 attack on the US Capitol, almost 100 text messages from two staunch GOP allies of then-President Donald Trump reveal an aggressive attempt to lobby, encourage and eventually warn the White House over it…", "url": "https://www.cnn.com/2022/04/15/politics/mike-lee-chip-roy-text-messages-jan-6-mark-meadows-overturn-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414155935-lee-roy-jan-6-super-tease.jpg", "publishedAt": "2022-04-15T11:00:16Z", "content": "Washington (CNN)In the weeks between the 2020 election and the January 6 attack on the US Capitol, almost 100 text messages from two staunch GOP allies of then-President Donald Trump reveal an aggres… [+7942 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for April 15: Ukraine, Covid, Subway shooting, Elon Musk, Debates", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/04/15/us/five-things-april-15-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414164022-01-russian-warship-moskva-super-tease.jpg", "publishedAt": "2022-04-15T10:29:58Z", "content": "(CNN)If you've been itching for a social media detox or need a quick break from scrolling on your smartphone, this is the perfect weekend to disconnect from Wi-Fi and reconnect with nature. On Saturd… [+6099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Recht, Kaiser Health News", "title": "Covid-19 test-to-treat program stymied by lack of services, tech problems", "description": "The federal \"test-to-treat\" program, announced in March, is meant to reduce covid hospitalizations and deaths by quickly getting antiviral pills to people who test positive. But even as cases rise again, many Americans don't have access to the program.", "url": "https://www.cnn.com/2022/04/15/health/test-to-treat-khn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202192820-covid-test-file-0118-california-super-tease.jpg", "publishedAt": "2022-04-15T10:10:49Z", "content": "The federal \"test-to-treat\" program, announced in March, is meant to reduce covid hospitalizations and deaths by quickly getting antiviral pills to people who test positive. But even as cases rise ag… [+9526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler and Kylie Atwood, CNN", "title": "No short-term end in sight in Russia's invasion of Ukraine, Western officials say", "description": "Secretary of State Antony Blinken told European allies that the United States believes the Russian war in Ukraine could last through the end of 2022, two European officials told CNN, as US and European officials have increasingly assessed that there is no sho…", "url": "https://www.cnn.com/2022/04/15/politics/ukraine-russia-protracted-war-us-european-officials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414210949-01-ukraine-russia-protracted-war-super-tease.jpg", "publishedAt": "2022-04-15T10:05:22Z", "content": "(CNN)Secretary of State Antony Blinken told European allies that the United States believes the Russian war in Ukraine could last through the end of 2022, two European officials told CNN, as US and E… [+6529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church", "title": "Morgan Hoffmann, diagnosed with muscular dystrophy, returns to competitive golf for first time in three years", "description": "When golfer Morgan Hoffmann was diagnosed with facioscapulohumeral muscular dystrophy -- a condition that causes his muscles to weaken -- in 2017, he was told nothing could be done.", "url": "https://www.cnn.com/2022/04/15/golf/morgan-hoffmann-muscular-dystrophy-pga-tour-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220415092027-hoffmann-golf-tease.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T09:59:04Z", "content": "When golfer Morgan Hoffmann was diagnosed with facioscapulohumeral muscular dystrophy a condition that causes his muscles to weaken in 2017, he was told nothing could be done.\r\nBut after a five year … [+1613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Brad Lendon, CNN", "title": "China is sending its most advanced fighter jet to patrol disputed seas", "description": "China has begun sending its most advanced fighter aircraft, the J-20, to patrol the East and South China Seas, Chinese state media has reported.", "url": "https://www.cnn.com/2022/04/15/china/china-j-20-jet-patrol-east-south-china-sea-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414235408-china-j-20-jet-2021-file-restricted-super-tease.jpg", "publishedAt": "2022-04-15T07:14:32Z", "content": "Hong Kong (CNN)China has begun sending its most advanced fighter aircraft, the J-20, to patrol the East and South China Seas, Chinese state media has reported.\r\nEarly versions of the J-20 stealth jet… [+4371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brynn Gingras, Mark Morales, Shimon Prokupecz, Laura Ly, Kristina Sgueglia, Sonia Moghe and Aya Elamroussi, CNN", "title": "4 victims still hospitalized after Brooklyn subway shooting as suspect is denied bail", "description": "Four victims were still hospitalized Thursday, two days after a mass shooting on a subway train that left New Yorkers badly shaken and forced a reckoning over passenger security on the largest public transportation system in the country.", "url": "https://www.cnn.com/2022/04/15/us/brooklyn-subway-shooting-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414204100-brooklyn-subway-crime-scene-super-tease.jpg", "publishedAt": "2022-04-15T07:09:19Z", "content": "(CNN)Four victims were still hospitalized Thursday, two days after a mass shooting on a subway train that left New Yorkers badly shaken and forced a reckoning over passenger security on the largest p… [+6046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "Chinese officials are 'painfully aware' of economic fallout from lockdowns: European Chamber President", "description": "Chinese officials are grappling with the economic distress caused by their Covid-19 restrictions, as several cities remain in lockdown, according to the head of a European trade group.", "url": "https://www.cnn.com/2022/04/15/business/china-covid-economy-eu-chamber-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414231726-02-beijing-covid-skyscraper-040522-super-tease.jpg", "publishedAt": "2022-04-15T06:35:54Z", "content": "Hong Kong (CNN Business)Chinese officials are grappling with the economic distress caused by their Covid-19 restrictions, as several cities remain in lockdown, according to the head of a European tra… [+4271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Musk said he wants Twitter to open-source its algorithm so that users can see when (and by implication, why) the platform takes action on their content. But it's not clear how much this would achieve, given that it would still be up to the company to actually…", "url": "https://view.newsletters.cnn.com/messages/164999128191111a72388f98e/raw", "urlToImage": null, "publishedAt": "2022-04-15T05:45:01Z", "content": "Ask ten tech insiders about the future of Twitter right now and you're likely to hear at least five different answers.\r\nSome are dismissing Elon Musk's $54.20 per share bid to take the company privat… [+1383 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Simone McCarthy", "title": "China's Covid controls risk sparking crisis for the country -- and its leader Xi Jinping", "description": "Across China, cities are locking down their residents, supply lines are rupturing, and officials are scrambling to secure the movement of basic goods -- as its largest ever recorded outbreak of Covid-19 threatens to spiral into a national crisis of the govern…", "url": "https://www.cnn.com/2022/04/15/china/china-covid-xi-jinping-shanghai-crisis-intl-hnk-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414174619-04-china-covid-xi-jinping-shanghai-crisis-super-tease.jpg", "publishedAt": "2022-04-15T04:14:24Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+8459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta", "title": "Donbas: Here's why Putin wants Ukraine's ravaged heartland", "description": "Donbas, a sprawling and beleaguered heartland region that blankets much of eastern Ukraine, has been the front line of the country's conflict with Russia since 2014.", "url": "https://www.cnn.com/2022/04/15/europe/donbas-region-ukraine-war-russia-explainer-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413080717-01-donbas-conflict.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T04:09:48Z", "content": "Donbas, a sprawling and beleaguered heartland region that blankets much of eastern Ukraine, has been the front line of the countrys conflict with Russia since 2014.\r\nBut now its people, already scarr… [+13672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a> and <a href=\"/profiles/helen-regan\">Helen Regan</a>, CNN", "title": "Russia invades Ukraine", "description": "Russian preparations continue in the east for an offensive operation, training additional units and gathering aviation forces, according to Ukraine's armed forces. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-04-15-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414001151-mariupol-ukraine-burned-building-rivers-0412-super-tease.jpg", "publishedAt": "2022-04-15T04:04:59Z", "content": "The sinking of Russian guided-missile cruiser Moskva in the Black Sea comes days after Ukraine issued a stamp immortalizing the famous exchange on Snake Island between Russian and Ukrainian forces.\r\n… [+1712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Maeve Reston, CNN", "title": "Analysis: New York subway shooting shows Washington is failing to address America's mental health crisis", "description": "The videos from the alleged shooter in the NY subway have refocused America's attention on the acute mental health crisis that is gripping this country, from the vast number of untreated people in need of psychological help to the difficulty that Congress wil…", "url": "https://www.cnn.com/2022/04/15/politics/new-york-subway-shooting-mental-health/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413165939-04-subway-frank-james-arrest-super-tease.jpg", "publishedAt": "2022-04-15T04:00:42Z", "content": "(CNN)Investigators are continuing to pore through the extensive library of YouTube videos created by Frank James, the 62-year-old man accused of shooting 10 people on a New York City subway train, se… [+10587 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Springer, CNN", "title": "Her train broke down. Her phone died. And then she met her future husband", "description": "Divemaster Sarah Richard always imagined she'd marry a fellow scuba diver -- or at least someone with a similarly nomadic lifestyle. But a broken down train led her to a passionate asparagus farmer who would later become her husband.", "url": "https://www.cnn.com/travel/article/chance-encounters-couple-met-broken-train-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413171615-12-chance-encounters-sarah-gostling-super-tease.jpeg", "publishedAt": "2022-04-15T02:40:51Z", "content": "(CNN) For 33-year-old Sarah Richard, life has long revolved around scuba diving. As the founder of Girls that Scuba, billed as the world's largest scuba community for women, she traveled nonstop to h… [+10849 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe,Andy Rose", "title": "Rapper DaBaby was on a NC property when a man was shot for trespassing, police say", "description": "Rapper DaBaby was at a North Carolina home Wednesday when a person trespassing was shot, the Troutman Police Department said.", "url": "https://www.cnn.com/2022/04/14/entertainment/dababy-trespassing-shooting/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414175158-dababy-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-15T02:35:01Z", "content": "Rapper DaBaby was at a North Carolina home Wednesday when a person trespassing was shot, the Troutman Police Department said. \r\nA 26-year-old man allegedly climbed the fence surrounding the property … [+1412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Paul Callan", "title": "Opinion: NY subway shooting revives memories of 1980s crime wave", "description": "The recent surge in violent crimes in New York City, marked by Tuesday morning's subway shooting, may be a sign of a return to the crime-ridden 1980s, writes Paul Callan. He points it's time to strengthen policing and other measures.", "url": "https://www.cnn.com/2022/04/14/opinions/new-york-city-subway-shooting-police-1980s-callan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413175831-06-brooklyn-subway-shooter-search-super-tease.jpg", "publishedAt": "2022-04-15T00:48:59Z", "content": "Paul Callan is a CNN legal analyst, a former New York homicide prosecutor and counsel to the New York law firm of Edelman &amp; Edelman PC, focusing on wrongful conviction and civil rights cases. Fol… [+6983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathleen Toner, CNN", "title": "The Ukrainian refugee crisis is the latest mission for a CNN Hero, who leads teams of mobile medics responding to global disasters", "description": "A paramedic and nurse from Alaska, Teresa Gray and her non-profit have provided free medical care to more than 30,000 people on five continents.", "url": "https://www.cnn.com/2022/04/14/world/ukraine-refugee-emergency-medicine-responders-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414184519-cnnheroes-teresa-gray-card-image-super-tease.jpeg", "publishedAt": "2022-04-14T23:46:17Z", "content": "Know someone who inspires you? Click here to nominate them as a CNN Hero.\r\n (CNN)People around the globe have been moved by the horrible images of Ukrainians in distress, fleeing their homes after th… [+7376 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Entry is free at all National Park sites on Saturday", "description": "Saturday is the start of National Park Week 2022. And in celebration, the National Park Service is offering free entry to all 423 of its sites in the United States on April 18.", "url": "https://www.cnn.com/travel/article/national-park-week-2022-free-day-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413161648-01-national-park-week-rocky-mountain-np-top-super-tease.jpg", "publishedAt": "2022-04-14T23:16:56Z", "content": "(CNN) Yellowstone? Free. Yosemite? Free. Everglades? Free!\r\nActually, most NPS sites are free all year. Only 108 charge a fee. And as you'd suspect, it's the big names that ask you to pay to enter: P… [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster and Amir Vera, CNN", "title": "Harry and Meghan Markle visit Queen Elizabeth II on way to Invictus Games", "description": "A spokesperson for the Duke and Duchess of Sussex has confirmed to CNN that the couple visited Queen Elizabeth II on their way to The Hague to attend The Invictus Games, which begin on Saturday.", "url": "https://www.cnn.com/2022/04/14/uk/harry-megan-visit-queen-gbr-uk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414175725-prince-harry-meghan-markle-file-restricted-092321-super-tease.jpg", "publishedAt": "2022-04-14T22:53:40Z", "content": "(CNN)A spokesperson for the Duke and Duchess of Sussex has confirmed to CNN that the couple visited Queen Elizabeth II on their way to The Hague to attend The Invictus Games, which begin on Saturday.… [+1199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva McKend", "title": "Stacey Abrams loses bid to use same Georgia fundraising law that benefits Gov. Brian Kemp", "description": "A federal judge ruled Thursday that a fundraising committee associated with Democratic gubernatorial candidate Stacey Abrams' campaign cannot begin raising unlimited campaign contributions.", "url": "https://www.cnn.com/2022/04/14/politics/stacey-abrams-brian-kemp-georgia-fundraising/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414152554-stacey-abrams-0406.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T22:47:42Z", "content": "A federal judge ruled Thursday that a fundraising committee associated with Democratic gubernatorial candidate Stacey Abrams campaign cannot begin raising unlimited campaign contributions.\r\nAbrams an… [+2635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova,Sharon Braithwaite,Jorge Engels", "title": "UK announces controversial plan to send asylum-seekers to Rwanda", "description": "People seeking asylum in the UK could now be relocated to Rwanda under a controversial new scheme blasted by international human rights groups as \"shockingly ill-conceived\" and contrary to international obligations.", "url": "https://www.cnn.com/2022/04/14/europe/uk-rwanda-migrant-deal-gbr-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414165211-boris-johnson-illegal-migrants-041422.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T22:24:28Z", "content": "People seeking asylum in the UK could now be relocated to Rwanda under a controversial new scheme blasted by international human rights groups as shockingly ill-conceived and contrary to internationa… [+5154 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Sarisohn, CNN", "title": "WWII-era ship tilting into Lake Erie in Buffalo, New York, naval park", "description": "A WWII-era naval destroyer, an exhibit at the Buffalo and Erie County Naval & Military Park, is partially sinking into Lake Erie, according to the facility.", "url": "https://www.cnn.com/2022/04/14/us/buffalo-uss-the-sullivans-sinking/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414175415-01-buffalo-wwii-era-destroyer-sinking-super-tease.jpg", "publishedAt": "2022-04-14T22:05:44Z", "content": "(CNN)A WWII-era naval destroyer, an exhibit at the Buffalo and Erie County Naval &amp; Military Park, is partially sinking into Lake Erie, according to the facility.\r\nA statement from the park says, … [+465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy and Elizabeth Joseph, CNN", "title": "Ed Buck, once a prominent Democratic donor, sentenced to 30 years in prison", "description": "Democratic donor Ed Buck, who in 2021 was convicted by a federal jury of nine felonies, including giving methamphetamine to two men who died at his West Hollywood apartment after being injected with the drug, has been sentenced to 30 years in prison, a spokes…", "url": "https://www.cnn.com/2022/04/14/us/ed-buck-sentenced-30-years-federal-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191010145809-ed-buck-arraignment-0919-super-tease.jpg", "publishedAt": "2022-04-14T22:00:54Z", "content": "(CNN)Democratic donor Ed Buck, who in 2021 was convicted by a federal jury of nine felonies, including giving methamphetamine to two men who died at his West Hollywood apartment after being injected … [+818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter, CNN Business", "title": "David Zaslav lays out his vision for Warner Bros. Discovery: 'One platform that we take everywhere in the world in every language'", "description": "David Zaslav, the longtime leader of Discovery, sketched out his vision for the newly formed Warner Bros. Discovery in his first global town hall with the new company's employees on Thursday.", "url": "https://www.cnn.com/2022/04/14/media/david-zaslav-warner-bros-discovery-global-town-hall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414155115-warner-bros-discovery-global-town-hall-0414-super-tease.jpg", "publishedAt": "2022-04-14T21:54:13Z", "content": "New York (CNN Business)David Zaslav, the longtime leader of Discovery, sketched out his vision for the newly formed Warner Bros. Discovery in his first global town hall with the new company's employe… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz", "title": "House lawmakers voice 'serious concerns' about facial recognition used by contractor ID.me", "description": "Two top House lawmakers on Thursday began probing ID.me, a company that uses facial recognition technology to verify identities for many state and federal agencies, into the \"efficacy, privacy and security\" of its services and products. The move, which comes …", "url": "https://www.cnn.com/2022/04/14/tech/idme-facial-recognition-house-lawmakers/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210706084302-01-idme-stock.jpg?q=x_3,y_234,h_1403,w_2494,c_crop/w_800", "publishedAt": "2022-04-14T21:40:09Z", "content": "Two top House lawmakers on Thursday began probing ID.me, a company that uses facial recognition technology to verify identities for many state and federal agencies, into the efficacy, privacy and sec… [+5274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Russia seeks Brazil's help to prevent expulsion from IMF, World Bank", "description": "Russia has asked Brazil for support in the International Monetary Fund, the World Bank and the G20 group of top economies to help it counter crippling sanctions imposed by the West since it invaded Ukraine, according to a letter seen by Reuters.", "url": "https://www.cnn.com/2022/04/14/americas/russia-asks-brazil-support-imf-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414162306-anton-siluanov-file-011520-super-tease.jpg", "publishedAt": "2022-04-14T20:46:29Z", "content": "(CNN)Russia has asked Brazil for support in the International Monetary Fund, the World Bank and the G20 group of top economies to help it counter crippling sanctions imposed by the West since it inva… [+2330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Marja Heinonen", "title": "Opinion: My country shares an 800-mile border with Russia. The Ukraine invasion has utterly changed how I view NATO", "description": "Finnish writer Marja Heinonen says joining NATO has been debated in Finland for decades, but Russia's invasion of Ukraine makes it clear that there are no limits to what Vladimir Putin is willing to do to advance his geopolitical interests.", "url": "https://www.cnn.com/2022/04/14/opinions/finland-nato-russia-invasion-heinonen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414145308-nato-headquarters-file-052517-super-tease.jpg", "publishedAt": "2022-04-14T20:40:43Z", "content": "Marja Heinonen, a Finnish writer and author of several books, has more than three decades' experience as a journalist, editor and researcher. She has also worked in academia and has a doctoral degree… [+6931 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristina Sgueglia,Dalila-Johari Paul", "title": "New York revives gifted and talented program with major expansion", "description": "New York City is expanding its controversial gifted and talented student program by adding 100 kindergarten seats and 1,000 third-grade seats, expanding both entry points to all districts.", "url": "https://www.cnn.com/2022/04/14/us/new-york-gifted-talented-education-program-expansion/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414130903-01-gifted-and-talented-nyc.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T20:38:08Z", "content": "New York City is expanding its controversial gifted and talented student program.\r\nOn Wednesday, New York City Mayor Eric Adams and New York City Department of Education (DOE) Chancellor David C. Ban… [+4097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand", "title": "Dustin Thompson, US Capitol rioter who said he was following Trump's orders, is found guilty", "description": "A January 6 rioter who claimed he was following \"presidential orders\" when he stormed the US Capitol and stole liquor and a coat rack was convicted Thursday on all charges by a jury in Washington, DC.", "url": "https://www.cnn.com/2022/04/14/politics/dustin-thompson-january-6-trump/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413164531-dustin-thompson-capitol-riot.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T20:13:10Z", "content": "A January 6 rioter who claimed he was following presidential orders when he stormed the US Capitol and stole liquor and a coat rack was convicted Thursday on all charges by a jury in Washington, DC. … [+507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "US says three Russians offered congressman a free trip as part of a propaganda and disinformation campaign", "description": "Federal prosecutors in New York on Thursday unsealed an indictment charging a member of Russia's legislature and two of his staffers with orchestrating a propaganda and disinformation campaign targeting US lawmakers.", "url": "https://www.cnn.com/2022/04/14/politics/us-lawmakers-russians-duma-propaganda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414153151-alexander-babakov-file-restricted-022221-super-tease.jpg", "publishedAt": "2022-04-14T19:44:56Z", "content": "(CNN)Federal prosecutors in New York on Thursday unsealed an indictment charging a member of Russia's legislature and two of his staffers with orchestrating a propaganda and disinformation campaign t… [+2645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN | Manveena Suri, CNN", "title": "Bollywood mega-stars Alia Bhatt and Ranbir Kapoor wed in intimate Mumbai ceremony", "description": "Two of India cinema's best-paid stars tied the knot in a small-scale ceremony in Mumbai on Thursday.", "url": "https://www.cnn.com/style/article/alia-bhatt-ranbir-kapoor-wedding-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414143032-02-ranbir-kapoor-alia-bhatt-marriage-restricted-super-tease.jpg", "publishedAt": "2022-04-14T19:26:48Z", "content": "Two of Bollywood's biggest stars, Alia Bhatt and Ranbir Kapoor, tied the knot in Mumbai on Thursday in an intimateceremony attended by some of the greats of Indian cinema.\r\nIn one of India's most hot… [+2780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Sarisohn and Emma Tucker, CNN", "title": "Family of unarmed Black man fatally shot during traffic stop in Michigan calls for prosecution of officer", "description": "The family of a Michigan man who was shot and killed by a police officer earlier this month during a traffic stop reiterated their call for the termination and prosecution of the officer during a news conference on Thursday.", "url": "https://www.cnn.com/2022/04/14/us/patrick-lyoya-family-calls-for-officer-termination/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412200204-02-patrick-lyoya-grand-rapids-super-tease.jpg", "publishedAt": "2022-04-14T19:26:41Z", "content": "(CNN)The family of a Michigan man who was shot and killed by a police officer earlier this month during a traffic stop reiterated their call for the termination and prosecution of the officer during … [+3065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Elon Musk says his offer to buy Twitter is about 'the future of civilization,' not making money", "description": "Elon Musk defended his offer to purchase Twitter on Thursday, saying during an on-stage interview at the TED conference that he sees the acquisition as nothing less than a turning point for civilization.", "url": "https://www.cnn.com/2022/04/14/tech/musk-twitter-offer-explanation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827140252-elon-musk-file-030920-super-tease.jpg", "publishedAt": "2022-04-14T19:06:37Z", "content": "Washington (CNN Business)Elon Musk defended his offer to purchase Twitter on Thursday, sayingduring an on-stage interview at the TED conference that he sees the acquisition as nothing less than a tur… [+1905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "The RNC debate decision shows the not-so-hidden hand of Donald Trump", "description": "The Republican National Committee's decision Thursday to withdraw from its participation in the organization that has long managed presidential debates has Donald Trump's fingerprints all over it.", "url": "https://www.cnn.com/2022/04/14/politics/rnc-debate-donald-trump/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200210235620-donald-trump-new-hampshire-rally-fact-check-dale-sot-ctn-vpx-00003313.jpg?q=x_5,y_256,h_2775,w_4931,c_crop/w_800", "publishedAt": "2022-04-14T19:05:21Z", "content": "The Republican National Committees decision Thursday to withdraw from its participation in the organization that has long managed presidential debates has Donald Trumps fingerprints all over it.\r\nRNC… [+2994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Ray Sanchez, CNN", "title": "Criminal charges refiled against Missouri duck boat employees involved in fatal 2018 capsizing", "description": "Missouri's attorney general has refiled involuntary manslaughter charges against three tour boat employees involved in the 2018 duck boat sinking near Branson, Missouri, that left 17 people dead, court documents show.", "url": "https://www.cnn.com/2022/04/14/us/missouri-duck-boat-charges-refiled/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406093508-duck-boat-death-missouri-file-071918-super-tease.jpg", "publishedAt": "2022-04-14T19:01:34Z", "content": "(CNN)Missouri's attorney general has refiledinvoluntary manslaughter charges against three tour boat employees involved in the 2018 duck boat sinking near Branson, Missouri, that left 17 people dead,… [+4451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "OCD isn't just about being a neat freak. And for those with it, this next stage of the pandemic may be hard", "description": "Obsessive-compulsive disorder is a condition often mistakenly regarded as a mild nuisance with positive side effects — especially when it comes to being orderly and tidy — by people who don't have it. But it's much more than that, experts say, and the pandemi…", "url": "https://www.cnn.com/2022/04/14/health/ocd-pandemic-struggles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413160123-01-ocd-pandemic-wellness-super-tease.jpg", "publishedAt": "2022-04-14T18:51:14Z", "content": "April is Stress Awareness Month. Sign up for CNN's Stress, But Less newsletter and learn how to cope. Our six-part mindfulness guide will inform and inspire you to reduce stress while learning how to… [+5790 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Salma Abdelaziz, Sarah Dean and Li-Lian Ahlskog Hou, CNN", "title": "Some Belarusians want to fight Russians in Ukraine. They also hope to free their country from Putin's grip", "description": "In a wooded area on the Polish side of the Poland-Ukraine border, men dressed in crisp, clean, camouflage are given tourniquets. They kneel on the muddy ground and start to learn basic survival training.", "url": "https://www.cnn.com/2022/04/14/europe/belarus-ukraine-volunteers-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414135950-03-belarusians-fight-for-ukraine-super-tease.jpg", "publishedAt": "2022-04-14T18:45:05Z", "content": "(CNN)In a wooded area on the Polish side of the Poland-Ukraine border, men dressed in crisp, clean, camouflage are given tourniquets. They kneel on the muddy ground and start to learn basic survival … [+4615 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Daniel L. Davis", "title": "Opinion: Why the 'Battle of Donbas' will be a critical moment in the war's outcome", "description": "Russia is now preparing to launch a renewed push into eastern Ukraine's Donbas region in what could end up being the biggest tank battle in Europe since the Second World War. Former Lt. Col. in the US Army, Daniel L. Davis, looks at what Ukraine needs to do t…", "url": "https://www.cnn.com/2022/04/14/opinions/battle-donbas-ukraine-russia-military-davis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412061116-russian-column-telegram-04112022-super-tease.jpg", "publishedAt": "2022-04-14T18:35:44Z", "content": "Daniel L. Davis is a senior fellow and military expert at Defense Priorities and a former Lt. Col. in the US Army who fought in the largest tank battle of Desert Storm, the Battle of 73 Easting. He i… [+6640 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Frederik Pleitgen, Ben Wedeman, Vasco Cotovio and Ivana Kottasová, CNN", "title": "Atrocities are piling up across Ukraine. CNN witnessed some of the horrors.", "description": "Indiscriminate killings of civilians attempting to flee the violence. Victims found with their hands tied behind their backs. An attack on a maternity hospital, a theater turned shelter bombed. The list of atrocities and apparent war crimes allegedly committe…", "url": "https://www.cnn.com/2022/04/14/europe/ukraine-russia-atrocities-eyewitness-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413070055-bucha-mass-grave-04062022-super-tease.jpg", "publishedAt": "2022-04-14T18:25:57Z", "content": "By Clarissa Ward, Frederik Pleitgen, Ben Wedeman, Vasco Cotovio and Ivana Kottasová, CNN\r\nUpdated 2:25 PM ET, Thu April 14, 2022\r\nThis story contains graphic imagery.\r\n (CNN)Indiscriminate killings o… [+7645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright", "title": "Second Family to hold first known Passover Seder at vice president's residence", "description": "Vice President Kamala Harris and second gentleman Doug Emhoff on Friday will become the first known second family to host a Passover Seder at the vice president's residence, a White House official says, a continuation of their efforts to celebrate Emhoff's Je…", "url": "https://www.cnn.com/2022/04/14/politics/kamala-harris-doug-emhoff-seder-naval-observatory/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413112526-harris-emhoff-0325-super-tease.jpg", "publishedAt": "2022-04-14T17:45:54Z", "content": "(CNN)Vice President Kamala Harris and second gentleman Doug Emhoff on Friday will become the first known second family to host a PassoverSeder at the vice president's residence, a White House officia… [+2538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De La Fuente", "title": "Team GB ordered to return Olympic medal from Tokyo 2020 Games", "description": "The British Olympic Association (BOA) announced on Thursday the team was informed by the Court of Arbitration for Sport (CAS) that it must return the silver medals from the 4x100m relay event won during the Tokyo 2020 Olympic Games.", "url": "https://www.cnn.com/2022/04/14/sport/team-gb-return-2020-olympics-medal-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414122515-great-britain-4x100-relay-team-tokyo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T17:28:34Z", "content": "The British Olympic Association (BOA) announced on Thursday the team was informed by the Court of Arbitration for Sport (CAS) that it must return the silver medals from the 4x100m relay event won dur… [+1947 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer, Zachary Cohen and Pamela Brown, CNN", "title": "Stephen Miller expected to meet with January 6 committee today", "description": "Former Trump White House adviser Stephen Miller is expected to appear Thursday before the House committee investigating the Capitol Hill insurrection, a source familiar with the meeting tells CNN.", "url": "https://www.cnn.com/2022/04/14/politics/january-6-stephen-miller/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/171109160353-01-stephen-miller-file-super-tease.jpg", "publishedAt": "2022-04-14T17:28:15Z", "content": "(CNN)Former Trump White House adviser Stephen Miller is expected to appear Thursday before the House committee investigating the Capitol Hill insurrection, a source familiar with the meeting tells CN… [+1928 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand", "title": "ISIS 'Beatle' convicted in relation to kidnapping and deaths of four Americans", "description": "The last member of the ISIS cell known as the \"Beatles,\" a British group of fighters, was convicted by a jury Thursday of assisting in the kidnapping and deaths of four Americans between 2012 and 2015.", "url": "https://www.cnn.com/2022/04/14/politics/isis-beatle-convicted-on-all-counts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2022-04-14T17:24:29Z", "content": "(CNN)The last member of the ISIS cell known as the \"Beatles,\" a British group of fighters, was convicted by a jury Thursday of assisting in the kidnapping and deaths of four Americans between 2012 an… [+295 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr", "title": "Republicans may decide this year on host cities for 2024 and 2028 conventions", "description": "With Republicans narrowing their search to Milwaukee and Nashville as potential hosts for their 2024 nominating convention, the second-choice city may nab a contract after all -- just not until 2028.", "url": "https://www.cnn.com/2022/04/14/politics/republican-national-convention-2024-2028/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414095830-rnc-charlotte-2020.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T17:23:49Z", "content": "With Republicans narrowing their search to Milwaukee and Nashville as potential hosts for their 2024 nominating convention, the second-choice city may nab a contract after all just not until 2028.\r\nO… [+2757 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Video of mom at Elton John concert goes viral on TikTok", "description": "See the viral TikTok video of a mom's emotional reaction to Elton John in concert during his final tour.", "url": "https://www.cnn.com/videos/media/2022/04/14/elton-john-mom-tiktok-concert-tour-mxp-hln-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414125649-elton-john-tiktok-mom-super-tease.jpg", "publishedAt": "2022-04-14T17:08:11Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren", "title": "RNC unanimously votes to withdraw from commission that sponsors presidential debates", "description": "The Republican National Committee voted unanimously on Thursday to withdraw from its participation in the Commission on Presidential Debates, the organization that has long governed general-election presidential debates.", "url": "https://www.cnn.com/2022/04/14/politics/rnc-withdraws-from-presidential-debates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414123433-presidential-debate-2020-file-restricted-super-tease.jpg", "publishedAt": "2022-04-14T16:45:02Z", "content": "(CNN)The Republican National Committee voted unanimously on Thursday to withdraw from its participation in the Commission on Presidential Debates, the organization that has long governed general-elec… [+1029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden says he's deciding on whether to send a senior administration official to Ukraine", "description": "President Joe Biden said Thursday he was still working with his team to determine whether he should dispatch a senior member of his administration to Ukraine, a potentially dramatic show of support for the nation as it comes under attack from Russia.", "url": "https://www.cnn.com/2022/04/14/politics/biden-officials-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413094751-01-biden-ukraine-0412-super-tease.jpg", "publishedAt": "2022-04-14T16:37:45Z", "content": "Washington (CNN)President Joe Biden said Thursday he was still working with his team to determine whether he should dispatch a senior member of his administration to Ukraine, a potentially dramatic s… [+2733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'It's insane': Johnny Depp's friend breaks down during testimony", "description": "Johnny Depp's longtime friend, Isaac Baruch, took the witness stand in the actor's defamation trial against his ex-wife Amber Heard.", "url": "https://www.cnn.com/videos/media/2022/04/14/johnny-depp-friend-emotional-testimony-amber-heard-defamation-trial-mpx-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414090206-johnny-depp-courtroom-still-super-tease.jpeg", "publishedAt": "2022-04-14T16:24:56Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "Man convicted in Colombia of murdering his wife arrested after 27 years on the run, FBI says", "description": "A man who fled to the US from Colombia after the murder his wife in 1994 was arrested Wednesday in Massachusetts, the FBI said in a news release.", "url": "https://www.cnn.com/2022/04/14/us/william-hernando-usma-acosta-arrested/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414101251-02-fugitive-william-hernando-usma-acosta-arrested-super-tease.jpg", "publishedAt": "2022-04-14T16:20:30Z", "content": "(CNN)A man who fled to the US from Colombia after the murder his wife in 1994 was arrested Wednesday in Massachusetts, the FBI said in a news release. \r\nWilliam Hernando Usma Acosta, 61, had been liv… [+2158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kunyi Yang", "title": "5 savings mistakes people make when building their financial life", "description": "The road to financial independence is not easy, and usually requires patience and diligence early on.", "url": "https://www.cnn.com/2022/04/14/success/savings-mistakes/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413163910-young-people-savings-mistakes-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T16:19:12Z", "content": "The road to financial independence is not easy, andusually requires patience and diligence early on. \r\nFor young people still trying to establish their careers, focusing on retirement or saving for t… [+4739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amarachi Orie, CNN", "title": "Striking portraits of British queens to go on show to mark Platinum Jubilee", "description": "A showcase of portraits of queens who have ruled Britain will feature in a month-long program of exhibitions, events and auctions celebrating Queen Elizabeth II's Platinum Jubilee.", "url": "https://www.cnn.com/style/article/queens-portraits-platinum-jubilee-intl-scli-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414055432-andy-warhol-reigning-queens-1985-super-tease.jpg", "publishedAt": "2022-04-14T16:14:46Z", "content": "arts\r\nA showcase of portraits of queens who have ruled Britain will feature in a month-long program of exhibitions, events and auctions celebrating Queen Elizabeth II's Platinum Jubilee.\r\nThe London … [+2417 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "Opinion: What form Putin's revenge against the US could take", "description": "Frida Ghitis writes Russian President Vladimir Putin may try to exact revenge against the Biden administration for assisting Ukraine, and America's bruised democracy -- marked by its painfully inflamed political divisions -- is ripe for exploitation.", "url": "https://www.cnn.com/2022/04/14/opinions/putin-threat-american-elections-revenge-ukraine-ghitis/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220405234429-putin.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T15:59:59Z", "content": "Editors Note: Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washingto… [+7004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile, CNN", "title": "Fiona the hippo set to become a big sister after Cincinnati Zoo announces 'surprise pregnancy'", "description": "Fiona the hippo, the Cincinnati Zoo's social media darling, will soon be a big sister -- much to the zoo's surprise.", "url": "https://www.cnn.com/2022/04/14/us/cincinnati-zoo-hippo-pregnancy-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414093938-01-fiona-hippo-big-sister-super-tease.jpg", "publishedAt": "2022-04-14T15:57:49Z", "content": "(CNN)Fiona the hippo, the Cincinnati Zoo's social media darling, will soon be a big sister -- much to the zoo's surprise.\r\nThe zoo announced that Bibi, Fiona's 23-year-old mother, is pregnant. \r\n\"Bib… [+1956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See the heroic moment a teacher saves a choking student", "description": "A camera caught the moment a school teacher in Orange County, New Jersey, saved a third grade student with the Heimlich maneuver after the child accidentally swallowed a bottle cap and began choking.", "url": "https://www.cnn.com/videos/us/2022/04/14/teacher-saves-choking-student-meade-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414115050-teacher-saves-choking-student-nj-super-tease.jpg", "publishedAt": "2022-04-14T15:57:11Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, Kristin Wilson and Paul LeBlanc, CNN", "title": "Justices Ginsburg and O'Connor will get statues on US Capitol grounds", "description": "Former US Supreme Court Justices Sandra Day O'Connor and the late Ruth Bader Ginsburg will get statues on the grounds of the US Capitol after President Joe Biden on Wednesday signed a bipartisan bill into law to erect them.", "url": "https://www.cnn.com/2022/04/14/politics/biden-bill-sandra-day-oconnor-ruth-bader-ginsburg-statues-capitol/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414112230-ginsburg-oconnor-split-super-tease.jpg", "publishedAt": "2022-04-14T15:48:47Z", "content": "(CNN)Former US Supreme Court Justices Sandra Day O'Connor and the late Ruth Bader Ginsburg will get statues on the grounds of the US Capitol after President Joe Biden on Wednesday signed a bipartisan… [+1843 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis signs Florida's 15-week abortion ban into law", "description": "Florida Gov. Ron DeSantis signed into law on Thursday a Mississippi-style anti-abortion measure that bans the procedure after 15 weeks of pregnancy without exemptions for rape, incest or human trafficking.", "url": "https://www.cnn.com/2022/04/14/politics/desantis-signs-abortion-ban-florida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414100328-desantis-february-file-super-tease.jpg", "publishedAt": "2022-04-14T15:46:30Z", "content": "(CNN)Florida Gov. Ron DeSantis signed into law on Thursday a Mississippi-style anti-abortion measure that bans the procedure after 15 weeks of pregnancy without exemptions for rape, incest or human t… [+2776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden to focus on countering China during stop in North Carolina", "description": "President Joe Biden on Thursday is expected to push Congress to pass legislation aimed at countering China's growing economic influence by investing in US manufacturing, technology, research and development.", "url": "https://www.cnn.com/2022/04/14/politics/biden-competitiveness-north-carolina/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412170031-01-biden-iowa-0412-super-tease.jpg", "publishedAt": "2022-04-14T15:31:41Z", "content": "(CNN)President Joe Biden on Thursday is expected to push Congress to pass legislation aimed at countering China's growing economic influence by investing in US manufacturing, technology, research and… [+2459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See moment dolphin attacks trainer", "description": "Video footage shows the moment Sundance the dolphin attacked its trainer during a live show at the Miami Seaquarium.", "url": "https://www.cnn.com/videos/us/2022/04/14/dolphin-attacks-trainer-miami-seaquarium-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414080940-miami-seaquarium-dolphin-attack-super-tease.jpg", "publishedAt": "2022-04-14T15:25:40Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet and Austin Steele, CNN", "title": "In pictures: See life for Ukrainians waiting at the US-Mexico border", "description": "A Mexican border city thousands of miles from Ukraine has become a stopping point for many seeking refuge from the war.", "url": "https://www.cnn.com/2022/04/14/world/gallery/ukrainians-us-mexico-border/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413131501-01a-ukrainians-us-mexico-border-gallery-super-tease.jpg", "publishedAt": "2022-04-14T15:23:47Z", "content": "Ukrainians wait near the US-Mexico border on April 2 for a chance to enter the United States.\r\nBy Catherine E. Shoichet and Austin Steele, CNN\r\nUpdated 11:23 AM ET, Thu April 14, 2022\r\nUkrainians wai… [+1372 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Cooban", "title": "Christine Lagarde keeps options open as Europe grapples with 'stagflation'", "description": "The European Central Bank still won't say when it might start raising interest rates, even as inflation surges to another record high. Given war in Ukraine, as well as a Covid surge in China, it wants to keep its options open.", "url": "https://www.cnn.com/2022/04/14/economy/ecb-lagarde-inflation-interest-rates/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414064202-european-central-bank-germany-031022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T15:11:38Z", "content": "The European Central Bank still wont say when it might start raising interest rates, even as inflation surges to another record high. Given war in Ukraine, as well as a Covid surge in China, it wants… [+3921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Joe Biden's poll numbers just aren't getting any better", "description": "With just more than 200 days left until the 2022 election, there's little evidence that President Joe Biden's poll numbers are improving -- and there's some data to suggest things are getting worse.", "url": "https://www.cnn.com/2022/04/14/politics/biden-approval-rating-polls/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220118154339-02-biden-year-one-super-tease.jpg", "publishedAt": "2022-04-14T15:00:41Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "Powerful 'rivers in the sky' could cause Antarctic Peninsula's biggest ice shelf to collapse", "description": "Atmospheric rivers are destabilizing ice shelves on the Antarctic Peninsula. Their collapse could mean significant sea level rise.", "url": "https://www.cnn.com/2022/04/14/world/antarctica-larsen-c-ice-shelf-atmospheric-rivers-climate-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413125929-antarctica-larsen-ice-shelf-collapse-climate-super-tease.jpg", "publishedAt": "2022-04-14T14:59:43Z", "content": "(CNN)When temperatures in Antarctica soared to 38 degrees Celsius above normal -- around 70 Fahrenheit -- in March, a teetering ice shelf the size of Los Angeles collapsed. Scientists don't know what… [+5482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Senator Tom Carper and Senator John Cornyn for CNN Business Perspectives", "title": "Opinion: Revoking trade with Russia will deliver a powerful blow to its economy", "description": "When nations have preferential trade status, it allows them to trade openly by expanding market access and reducing tariffs. Cutting Russia off from this status will make it difficult for the Kremlin to continue trading necessary goods and commodities with th…", "url": "https://www.cnn.com/2022/04/14/perspectives/russia-trade-status-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412171559-restricted-russian-oil-production-file-super-tease.jpg", "publishedAt": "2022-04-14T14:06:13Z", "content": "Senator Tom Carper (D-Del.) is the chairman on the Finance Subcommittee on Trade, as well as the chairman of the Environment and Public Works Committee and a senior member of the Homeland Security an… [+3749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Blake Ellis and Melanie Hicken, CNN", "title": "Fake CPA who bought a new home using money he got through federal Covid-19 relief funding sentenced to four years", "description": "An Arizona businessman highlighted in a CNN investigation has been sentenced to four years in prison for fraudulently securing millions of dollars in federal Covid-19 relief funding -- using a chunk of the proceeds to buy a Porsche and a new home, according t…", "url": "https://www.cnn.com/2022/04/14/business/polzin-ppp-loan-fraud-prison/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413144404-paycheck-protection-program-form-stock-super-tease.jpeg", "publishedAt": "2022-04-14T14:06:01Z", "content": "(CNN)An Arizona businessman highlighted in a CNN investigation has been sentenced to four years in prison for fraudulently securing millions of dollars in federal Covid-19 relief funding -- using a c… [+1424 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta and Ariel Edwards-Levy, CNN", "title": "Pew poll: Being Black is central to sense of identity for most Black Americans", "description": "Black adults in America are nearly 40 points more likely than the general population to say that their racial background is central to the way they think about themselves, according to a new poll from the Pew Research Center, and how Black Americans view thei…", "url": "https://www.cnn.com/2022/04/14/politics/poll-black-american-identity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414012516-01-black-americans-identity-super-tease.jpg", "publishedAt": "2022-04-14T14:05:21Z", "content": "(CNN)Black adults in America are nearly 40 points more likely than the general population to say that their racial background is central to the way they think about themselves, according to a new pol… [+5492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "Avlon: Seems that Putin has succeeded in the thing he fears most", "description": "After Finland and Sweden's announcement the countries are considering joining NATO, Putin may be getting the thing he feared the most: NATO expansion. CNN's John Avlon has the Reality Check.", "url": "https://www.cnn.com/videos/world/2022/04/14/putin-ukraine-nato-russia-expansion-avlon-reality-check-vpx.cnn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414093822-putin-avlon-split-vpx.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T13:50:50Z", "content": "After Finland and Swedens announcement the countries are considering joining NATO, Putin may be getting the thing he feared the most: NATO expansion. CNNs John Avlon has the Reality Check."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lindsey Lopez", "title": "Create your personal outdoor oasis with Ashley", "description": "It's that time of year again, when we prep our springtime yards for warm weather hangouts. Sunshine is just around the corner, and curating an outdoor oasis is a top priority for many. Jump-start your outdoor living room, deck or patio with the foundation for…", "url": "https://www.cnn.com/2022/04/14/cnn-underscored/ashley-outdoor-furniture", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413163711-hero-ashley.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T13:27:56Z", "content": "Its that time of year again, when we prep our springtime yards for warm weather hangouts. Sunshine is just around the corner, and curating an outdoor oasis is a top priority for many. Jump-start your… [+4462 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Even small amounts of exercise fight depression, study says", "description": "Exercise improves mood, but just how much activity do you need to do to see a benefit? A new study sheds light.", "url": "https://www.cnn.com/2022/04/14/health/exercise-depression-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413142149-01-brisk-walk-stock-super-tease.jpeg", "publishedAt": "2022-04-14T13:16:33Z", "content": "(CNN)Get up and move -- even small doses of physical activity, such as brisk walking, may substantially lower the risk of depression, according to a new data analysis.\r\n\"Most benefits are realized wh… [+2876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet and Austin Steele, CNN", "title": "In pictures: What life is like for Ukrainians in Tijuana, Mexico", "description": "A Mexican border city thousands of miles from Ukraine has become a stopping point for many seeking refuge from the war.", "url": "https://www.cnn.com/2022/04/14/world/gallery/ukrainains-us-mexico-border/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413131501-01a-ukrainians-us-mexico-border-gallery-super-tease.jpg", "publishedAt": "2022-04-14T12:37:08Z", "content": "Ukrainians wait near the US-Mexico border on April 2 for a chance to enter the United States.\r\nBy Catherine E. Shoichet and Austin Steele, CNN\r\nUpdated 8:37 AM ET, Thu April 14, 2022\r\nUkrainians wait… [+1371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN | Lizzy Yee", "title": "Hong Kong TV series sparks 'brownface' controversy after actor darkens skin", "description": "A Hong Kong TV series has sparked controversy over the use of \"brownface\" after one of its actors darkened her skin with makeup to play the role of a Filipina domestic worker.", "url": "https://www.cnn.com/style/article/hong-kong-tv-series-brownface/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414053057-04-hong-kong-movie-brownface-super-tease.jpg", "publishedAt": "2022-04-14T12:07:37Z", "content": "arts\r\nA Hong Kong TV series has sparked controversy over the use of \"brownface\" after one of its actors darkened her skin with makeup to play a Filipina domestic worker. \r\nIn a video that was widely … [+4105 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN", "title": "NY AG launches gas price gouging investigation into the oil industry", "description": "New York Attorney General Letitia James launched a wide-ranging investigation Thursday into whether the oil industry has engaged in gas price gouging, a person familiar with the matter told CNN.", "url": "https://www.cnn.com/2022/04/14/energy/gas-price-gouging-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413203749-01-letitia-james-super-tease.jpg", "publishedAt": "2022-04-14T11:02:38Z", "content": "New York (CNN Business)New York Attorney General Letitia James launched a wide-ranging investigation Thursday into whether the oil industry has engaged in gas price gouging, a person familiar with th… [+4591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Eliza Anyangwe, Editor of CNN As Equals", "title": "The gender binary was always a story. Now we can tell ourselves a new one", "description": "There have always been people who identify as neither woman nor man. \"Gender X\" gives them visibility, but it's also a reminder that language is never neutral.", "url": "https://www.cnn.com/2022/04/14/world/gender-x-non-binary-language-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413093928-as-equals-newsletter-gender-passport-super-tease.jpg", "publishedAt": "2022-04-14T10:46:24Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)As of Monday it is possible for US citi… [+7119 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Covid-19 booster raises antibody levels against Omicron for children ages 5 through 11, Pfizer and BioNTech say", "description": "A third shot of the children's dose of Pfizer/BioNTech's Covid-19 vaccine raised Omicron-fighting antibodies by 36 times in kids 5 through 11 years of age, the companies said in a news release Thursday. The companies plan to request emergency use authorizatio…", "url": "https://www.cnn.com/2022/04/14/health/pfizer-booster-5-to-11-results/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211023095213-01-child-covid-19-vaccines-soon-super-tease.jpg", "publishedAt": "2022-04-14T10:45:17Z", "content": "(CNN)A third shot of the children's dose of Pfizer/BioNTech's Covid-19 vaccine raised Omicron-fighting antibodies by 36 times in kids 5 through 11 years of age, the companies said in a news release T… [+1898 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Sport staff", "title": "Daniel Kinahan: Alleged head of 'murderous organization' with links to boxing targeted by US government", "description": "The US Department of State is offering rewards of up to $5 million for information leading to each of the arrests of three Irish \"transnational organized criminals,\" notably Daniel Kinahan, who has wielded significant influence in the boxing world in recent y…", "url": "https://www.cnn.com/2022/04/14/sport/daniel-kinahan-us-department-of-state-reward-boxing-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413094331-01-daniel-kinahan-state-dept-reward-boxing-spt-intl-super-tease.jpg", "publishedAt": "2022-04-14T10:36:24Z", "content": "(CNN)The US Department of State is offering rewards of up to $5 million for information leading to each of the arrests of three Irish \"transnational organized criminals,\" notably Daniel Kinahan, who … [+6619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for April 14: Subway shooting, Ukraine, Covid, Groceries, South Africa", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/04/14/us/five-things-april-14-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413164508-02-subway-frank-james-arrest-super-tease.jpg", "publishedAt": "2022-04-14T10:31:36Z", "content": "(CNN)Amazon says that for the first time in company history it will charge sellers a 5% fuel and inflation surcharge. So, if it seems like your favorite Amazon items are getting pricier, it could be … [+6454 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Patrick Sung,Amy Woodyatt", "title": "Freddy Rincón: Former Colombia captain dies after car crash", "description": "Former Colombia soccer captain Freddy Rincón has died after being involved in a car crash in Cali, the hospital treating him said in a statement.", "url": "https://www.cnn.com/2022/04/14/football/freddy-rincon-dies-intl-spt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220412133627-freddy-rincon.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T09:47:34Z", "content": "Former Colombia soccer captain Freddy Rincón has died after being involved in a car crash in Cali, the hospital treating him said in a statement.\r\nThe 55-year-old Rincón was admitted to hospital on M… [+2731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald", "title": "Seven-time Olympic champion Allyson Felix announces plans to retire after 2022 season", "description": "Allyson Felix -- the most decorated US track and field athlete in Olympics history -- announced that she plans to retire following the conclusion of the 2022 season.", "url": "https://www.cnn.com/2022/04/14/sport/allyson-felix-announces-retirement-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220414022019-allyson-felix-2012-olympics-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T09:44:57Z", "content": "Allyson Felix the most decorated US track and field athlete in Olympics history announced that she plans to retire following the conclusion of the 2022 season.\r\nDuring her illustrious career, she won… [+2081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Inside the 30-hour search for the Brooklyn subway shooting suspect", "description": "A key, a neon construction jacket, a gun.", "url": "https://www.cnn.com/2022/04/14/us/brooklyn-subway-suspect-frank-james-inside-investigators-search/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413175618-04-brooklyn-subway-shooter-search-super-tease.jpg", "publishedAt": "2022-04-14T07:51:32Z", "content": "(CNN)A key, a neon construction jacket, a gun.\r\nThe items, left behind in a bloody crime scene at a Brooklyn subway station Tuesday morning, offered investigators some of their first clues as they wo… [+7759 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "'God's going to help us get through all of this.' A 165 mph tornado causes widespread devastation in Texas community", "description": "After a tornado packing 165 mph winds rolled through Bell County, Texas, Tuesday, JudyLynn Hughes began sifting through what was left of her belongings.", "url": "https://www.cnn.com/2022/04/14/weather/severe-weather-tornadoes-texas-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413185040-01-severe-weather-tornado-texas-super-tease.jpg", "publishedAt": "2022-04-14T07:41:22Z", "content": "(CNN)After a tornado packing 165 mph winds rolled through Bell County, Texas, Tuesday, JudyLynn Hughes began sifting through what was left of her belongings.\r\n\"We have found my stuff everywhere. I st… [+4262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Boyette, CNN", "title": "2 dead in New Mexico wildfire that forced evacuations and damaged homes", "description": "Two people have died in a wildfire raging in New Mexico that has scorched more than 5,000 acres in the Sierra Blanco mountain range, police said.", "url": "https://www.cnn.com/2022/04/14/weather/new-mexico-wildfires-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414012517-new-mexico-mcbride-fire-041222-super-tease.jpg", "publishedAt": "2022-04-14T06:57:23Z", "content": "(CNN)Two people have died in a wildfire raging in New Mexico that has scorched more than 5,000 acres in the Sierra Blanco mountain range, police said.\r\nThey were found Wednesday in a burned home in R… [+1412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brienne Walsh, CNN", "title": "In new pandemic novel, 'Station Eleven' author explores how the apocalypse is always now", "description": "In an interview about her new novel \"The Sea of Tranquility,\" science fiction author Emily St. John Mandel said she believes \"the world is always ending.\"", "url": "https://www.cnn.com/style/article/sea-of-tranquility-emily-st-john-mandel-books-culture-queue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412171235-01-sea-of-tranquility-emily-st-john-mandel-culture-queue-super-tease.jpg", "publishedAt": "2022-04-14T06:54:58Z", "content": "artsPublished 14th April 2022\r\nFans of Marvel movies love that the franchise encompasses a multiverse where well-known characters such as Captain America, Spiderman and Doctor Strange can shift ident… [+7519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brynn Gingras, Mark Morales, Shimon Prokupecz, Laura Ly, Kristina Sgueglia, Pervaiz Shallwani and Artemis Moshtaghian, CNN", "title": "Brooklyn subway shooting suspect is in custody, set to appear in court Thursday", "description": "Frank James, the man arrested on suspicion of setting off smoke grenades and shooting 10 people at a Brooklyn subway station Tuesday morning, will make his initial court appearance Thursday, authorities said.", "url": "https://www.cnn.com/2022/04/14/us/brooklyn-subway-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413143342-frank-james-ny-shooting-arrest-super-tease.jpg", "publishedAt": "2022-04-14T04:53:11Z", "content": "(CNN)Frank James, the man arrested on suspicion of setting off smoke grenades and shooting 10 people at a Brooklyn subway station Tuesday morning, will make his initial court appearance Thursday, aut… [+6247 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "Russian navy evacuates flagship in Black Sea. Ukraine claims it was hit by a missile", "description": "Russian sailors have evacuated the guided-missile cruiser Moskva, the flagship of its Black Sea fleet, after a fire that detonated ammunition aboard, Russian state media reported Wednesday.", "url": "https://www.cnn.com/2022/04/14/europe/russia-navy-cruiser-moskva-fire-abandoned-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413225245-02-russia-warship-satellite-041022-super-tease.jpg", "publishedAt": "2022-04-14T04:23:40Z", "content": "(CNN)Russian sailors have evacuated the guided-missile cruiser Moskva, the flagship of its Black Sea fleet, after a fire that detonated ammunition aboard, Russian state media reported Wednesday.\r\nSta… [+5083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Akanksha Sharma", "title": "Storm Megi death toll rises as hundreds of thousands displaced in Philippines", "description": "The death toll in the Philippines from tropical storm Megi has risen to 76 while hundreds of thousands of others remain displaced, authorities in the country said Wednesday.", "url": "https://www.cnn.com/2022/04/14/asia/philippines-storm-megi-agaton-deaths-floods-evacuations-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413195124-02-tropical-storm-megi-0413-landslie.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T04:22:39Z", "content": "The death toll in the Philippines from tropical storm Megi has risen to 76 while hundreds of thousands of others remain displaced, authorities in the country said Wednesday.\r\nMany of the deaths came … [+2617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "What images of Russian trucks say about its military's struggles in Ukraine", "description": "Experts say photographs of Russian trucks in Ukraine show tell-tale signs of Moscow's logistical struggles and suggest its efforts are being undermined by a reliance on conscripts and widespread corruption.", "url": "https://www.cnn.com/2022/04/14/europe/ukraine-war-russia-trucks-logistics-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407001246-01-russian-trucks-super-tease.jpg", "publishedAt": "2022-04-14T04:06:05Z", "content": "(CNN)Think about modern warfare and it's likely images of soldiers, tanks and missiles will spring to mind. But arguably more important than any of these is something on which they all rely: the humb… [+10789 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a>, CNN", "title": "Russia invades Ukraine", "description": "Russian troops are pouring into Ukraine, with a large column of military vehicles seen heading in the direction of the Donbas region. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-04-14-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220413165432-ukraine-refugees-poland-0316-super-tease.jpg", "publishedAt": "2022-04-14T04:00:27Z", "content": "Conflicting reports have emerged from the Russians and Ukrainians about an incident involving a Russian warship in the Black Sea. \r\nNo evidence has emerged to support either claim and CNN is unable t… [+1142 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe", "title": "What is the NYPD Crime Stoppers hotline?", "description": "A tip from the Crime Stoppers hotline aided in the arrest of the suspected Brooklyn subway train gunman Frank James, police say. Here's what you need to know about the program.", "url": "https://www.cnn.com/2022/04/13/us/nypd-crime-stoppers-explainer/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413184036-crime-stoppers-new-york.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T02:08:33Z", "content": "For decades, New Yorkers have contributed to thousands of arrests in suspected homicides, assaults and robberies by reporting information to the Crime Stoppers hotline. On Wednesday, a suspect became… [+2887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi,Amanda Musa", "title": "Kentucky legislature overrides governor's veto of sweeping abortion bill", "description": "Kentucky's GOP-controlled legislature on Wednesday overrode Democratic Gov. Andy Beshear's veto of a broad abortion bill that bans most abortions after 15 weeks of pregnancy, restricts access to medication abortion and makes it more difficult for a minor to o…", "url": "https://www.cnn.com/2022/04/13/politics/kentucky-abortion-bill-legislature-override-veto/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220413175818-kentucky-abortion-protest-0413.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-14T02:08:20Z", "content": "Kentuckys GOP-controlled legislature on Wednesday overrode Democratic Gov. Andy Beshears veto of a broad abortion bill that bans most abortions after 15 weeks of pregnancy, restricts access to medica… [+2999 chars]"}]}