{"status": "ok", "totalResults": 136, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone and Kristin Magaldi", "title": "CNN Underscored's Days of Deals are here — shop exclusive savings on 35 of our favorite products", "description": "Every day, CNN Underscored strives to bring you a smattering of the best deals to shop on the internet,  from discounted tech to home goods to fashion — not to mention our 24/7 coverage of the biggest days in shopping, like Amazon Prime Day and Black Friday.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805135251-underscored-days-of-deals-2021-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:24:41Z", "content": "Every day, CNN Underscored strives to bring you a smattering of the best deals to shop on the internet, from discounted tech to home goods to fashion not to mention our 24/7 coverage of the biggest d… [+21261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Biden's botched Afghan exit is a disaster at home and abroad long in the making", "description": "The debacle of the US defeat and chaotic retreat in Afghanistan is a political disaster for Joe Biden, whose failure to orchestrate an urgent and orderly exit will further rock a presidency plagued by crises and stain his legacy.", "url": "https://www.cnn.com/2021/08/16/politics/afghanistan-joe-biden-donald-trump-kabul-politics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210816002128-taliban-flag-ghazni-0815-super-tease.jpg", "publishedAt": "2021-08-16T04:24:01Z", "content": "(CNN)The debacle of the US defeat and chaotic retreat in Afghanistan is a political disaster for Joe Biden, whose failure to orchestrate an urgent and orderly exit will further rock a presidency plag… [+9494 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Modern and elegant jewelry brand Aurate New York is offering 20% off sitewide", "description": "Today, we want to share our Aurate obsession with you with 20% off sitewide when you use the code CNN20 as part of our Days of Deals promotion.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/aurate-new-york-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810143240-underscored-day-of-deal-2021-aurate-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:24:01Z", "content": "Finding a jewelry brand that meets the demand for high-quality pieces while still prioritizing durability, sustainability and affordability can seem like a tough mission. Thats why we both love and h… [+1733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get 25% off sofas or chairs at Allform during our Days of Deals", "description": "Naturally, our love of Allform made the brand a perfect contender for our Days of Deals, and now you can receive 25% off your entire order as an Underscored-exclusive offer, no coupon codes necessary.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/allform-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810140955-underscored-day-of-deal-2021-allform-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:23:54Z", "content": "Comfort and functionality can come in a box, and thats exactly what youre getting when you order furniture from Allform. Created by the same company that brought you Helix, Allform produces sofas, lo… [+1554 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Save 20% at this exclusive Adidas sitewide sale", "description": "There's never been a better time to gear up for a new season of workouts — indoor or outdoor — since Adidas is offering an exclusive 20% off sitewide with code CNN20.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/adidas-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810084527-underscored-day-of-deal-2021-adidas-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:23:48Z", "content": "Theres never been a better time to gear up for a new season of workouts indoor or outdoor since Adidas is offering an exclusive 20% off sitewide with code CNN20.\r\nThe entire site, including shoes, ap… [+1392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Take 30% off all products at Bear Mattress for Days of Deals", "description": "You'll get an additional 30% off on any Bear product today as part of Underscored's Days of Deals promotion when you use the code CNN30.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/bear-mattress-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810145313-underscored-day-of-deal-2021-bear-alt-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:22:34Z", "content": "Theres a reason Bear Mattress is a favorite bed-in-a-box brand among athletes the mattresses themselves are created with Celliant technology, which Bear claims can help increase tissue oxygen levels … [+2054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get your caffeine fix from Atlas Coffee Club for free", "description": "Typically, your first full-size bag would cost $14, but today, Underscored readers can score a free bag and only pay the cost of shipping.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/atlas-coffee-club-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810132618-underscored-day-of-deal-2021-atlas-coffee-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:22:29Z", "content": "For some people, coffee isnt just a morning energy source its a delicate process of discovering the perfect beans, blends and brew methods. If that sounds like you, then you should check out Atlas Co… [+1772 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Save 20% on Onsen's waffle-weave towels and more", "description": "Right now you can save 20% sitewide at Onsen, which means it's completely affordable to stock your entire bathroom with the waffle-weave linens.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/onsen-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810094204-underscored-day-of-deal-2021-onsen-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:19:32Z", "content": "If you have yet to get in on the singular bathing experience that is drying off with a waffle towel, take advantage of this exclusive deal on Onsen: Right now you can save 20% sitewide when you use c… [+948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Customize a map of your favorite place on Grafomap and get 30% off", "description": "Grafomap is offering Underscored readers 30% off sitewide on all items, excluding T-shirts, for our Days of Deals.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/grafomap-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810142258-underscored-day-of-deal-2021-grafomap-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:19:15Z", "content": "Grafomap creations dont just make good gifts theyre also the perfect keepsake to hang in your home for a daily reminder of a special time or place in your life. And now Grafomap is offering Underscor… [+1084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Helix Sleep mattresses are now 15% off, plus you get two free pillows for Days of Deals", "description": "Right now you can get an additional 15% off your mattress purchase for Underscored's Days of Deals, plus two free dream pillows with your order.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/helix-sleep-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810101709-underscored-day-of-deal-2021-helix-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:19:04Z", "content": "If youre looking for a mattress tailored to your sleeping position, Helix Sleep is your one-stop shop. Its one of our favorite mattress-in-a-box brands because it offers a varied selection of hybrid … [+1529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Keith Allen and Alaa Elassar, CNN", "title": "Texas Supreme Court sides with governor and temporarily blocks mask mandates", "description": "The Texas Supreme Court sided with Gov. Greg Abbott Sunday in a ruling that temporarily blocks local mask mandates recently issued in San Antonio and Dallas, however officials said they will continue to enforce at least a portion of the mask mandates, despite…", "url": "https://www.cnn.com/2021/08/16/us/texas-supreme-court-block-mask-mandates-greg-abbott/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815193301-texas-supreme-court-block-mask-mandates-greg-abbott-super-tease.jpg", "publishedAt": "2021-08-16T04:19:02Z", "content": "(CNN)The Texas Supreme Court sided with Gov. Greg Abbott Sunday in a ruling that temporarily blocks local mask mandates recently issued in San Antonio and Dallas, however officials said they will con… [+3118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Feel like you're floating with $15 off an already on-sale zero-gravity Moon Pod", "description": "For our Days of Deals event, Moon Pod is taking 20% off its revolutionary seating sitewide — plus, when you buy a Moon Pod, you'll also receive 30% off an outdoor cover, which will allow you to relax poolside for the rest of the season.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/moon-pod-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810134550-underscored-day-of-deal-2021-moon-pod-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:18:53Z", "content": "Take your summertime lounging out of this world with the Moon Pod, a zero-gravity, futuristic beanbag chair that feels akin to what we imagine floating on a cloud is like. For our Days of Deals event… [+906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Add The Mirror to your home gym for $400 off", "description": "With this exclusive deal, you can transform any room in your home into the fitness studio of your dreams: Take $150 off The Mirror, plus nab free shipping and installation (a total value of $400) with code CNN400﻿.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/mirror-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810093803-underscored-day-of-deal-2021-mirror-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:18:32Z", "content": "Its a mirror. Its a home gym. Its a stylish piece of decor. Its all of the above! The Mirror is a portal to thousands of home fitness classes, all of which appear on the devices reflective screen, wh… [+965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Drink in this discount on a Blue Bottle Coffee subscription", "description": "Fans of a bold cup of joe, look no further than this exclusive deal on a six-week renewable coffee sampler subscription from Blue Bottle Coffee, our pick for best coffee subscription service following a jittery two months of comprehensive sampling.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/blue-bottle-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810144801-underscored-day-of-deal-2021-blue-bottle-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:18:25Z", "content": "Fans of a bold cup of joe, look no further than this exclusive deal on a six-week renewable coffee sampler subscription from Blue Bottle Coffee, our pick for best coffee subscription service followin… [+752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get 25% off your first Bokksu box", "description": "Right now you can get 25% off your first box. Typically, a monthly box will run you $49.95, but you can try now for just $42.45.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/bokksu-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810145936-underscored-day-of-deal-2021-booksu-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:18:18Z", "content": "Mochi? Matcha-flavored Kit Kats? Lotus root chips? Delicious, but often hard to come by. Fortunately, Bokksu is making Japanese snacks more accessible and affordable without having to hop on a plane … [+1428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Save up to 80% on tons of Under Armour gear from Woot!", "description": "We've collaborated with Woot! to bring you exclusive savings on one of your favorite brands: Under Armour. At this link, you'll find dozens of UA items for men and women for up to 75% off, plus an additional 5% off with code CNN21.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/woot-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811070930-underscored-day-of-deal-2021-woot-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:08:00Z", "content": "Woot! is one of our favorite places to find incredible deals every day seriously, their daily deals are not to be missed (nor are our daily roundup of deals, by the way). But today, weve collaborated… [+1429 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Don't wait to score savings on Gravity Blankets' weighted blankets and more", "description": "Whether you're already a weighted blanket fan or you have yet to hop on the warm, cozy, anxiety-reducing bandwagon, you'll find something to love with this sitewide promo from Gravity Blankets, a leader in the weighted blanket space.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/gravity-blankets-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811110630-underscored-day-of-deal-2021-gravity-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:07:29Z", "content": "Whether youre already a weighted blanket fan or you have yet to hop on the warm, cozy, anxiety-reducing bandwagon, youll find something to love with this sitewide promo from Gravity Blankets, a leade… [+1647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get 40% off hundreds of Frisco products at Chewy", "description": "Typically, Chewy's 35% off on autoship orders is enough to make you want to stock up on goodies for your furry friend, but today CNN Underscored is offering an additional promotion of 40% off over 200 different Frisco items for our Days of Deals.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/chewy-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811084142-underscored-day-of-deal-2021-chewy-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:06:07Z", "content": "Chances are, if you have a pet, youre also a frequent Chewy shopper. The online retailer provides hundreds of necessities for pet parents in all categories, from medications, to food and toys. Typica… [+1967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get Brooklinen's Internet-famous sheets for 15% off", "description": "Because we love the brand so much, we've decided to partner with them for our exclusive Days of Deals promotion. Right now, you can get 15% off select Brooklinen sheet sets and bedding when you use the code CNN15 at checkout.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/brooklinen-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811103939-underscored-day-of-deal-2021-brooklinen-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:06:00Z", "content": "There are many reasons to love Brooklinen sheets beyond the absolute comfort they offer and 80,000-plus five-star reviews; the direct-to-consumer retailer focuses on quality of its materials, utilizi… [+1773 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Sleep soundly with savings on two Buffy comforters", "description": "Buffy is the bedding company that's disrupting how you sleep — in a good way — and today, you can save on the brand's two top-rated comforters.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/buffy-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811102526-underscored-day-of-deal-2021-buffy-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:05:28Z", "content": "Buffy is the bedding company thats disrupting how you sleep in a good way and today, you can save on the brands two top-rated comforters. Use code CNN20 to save 20% on both the Cloud and the Breeze, … [+1129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/brad-lendon\">Brad Lendon</a> and <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a>, CNN", "title": "The latest on Afghanistan", "description": "The Taliban took control of the presidential palace in Kabul Sunday after the country's president Ashraf Ghani fled the country. Follow here for the latest news.", "url": "https://www.cnn.com/world/live-news/afghanistan-taliban-us-news-08-16-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815041735-02-kabul-afghanistan-0815-super-tease.jpg", "publishedAt": "2021-08-16T04:04:22Z", "content": "After 20 years of US intervention, thousands of deaths and at least $1 trillion dollars, the Taliban's advance in the country has been strikingly swift heres a look back at how the situation evolved … [+3304 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Bring a bidet into your bathroom with 15% off at Tushy", "description": "Whether a past trip to Europe first piqued your interest in forsaking TP or you're simply feeling a little bidet-curious, it's time to take the plunge. Tushy, the Instagram-famous bidet company that makes easy-to-install toilet attachments, is offering up a d…", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/tushy-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811071308-underscored-day-of-deal-2021-tushy-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:04:21Z", "content": "Whether a past trip to Europe first piqued your interest in forsaking TP or youre simply feeling a little bidet-curious, its time to take the plunge. Tushy, the Instagram-famous bidet company that ma… [+1807 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Save 20% on Boll & Branch when you spend $175", "description": "Right now, you can get 20% off Boll & Branch when you spend $175 or more.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/boll-and-branch-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811084744-underscored-day-of-deal-2021-boll-branch-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:04:20Z", "content": "Direct-to-consumer brand Boll &amp; Branch isnt just popular for making amazingly comfortable bedding its also known for its eco-friendly production practices, ensuring a chemical-free supply chain t… [+1700 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Save even more on refurbished tech from Decluttr", "description": "Buying refurbished tech is both good for the planet and for your bank account, and now, it's even less expensive thanks to this exclusive offer from Decluttr.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/decluttr-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811084739-underscored-day-of-deal-2021-decluttr-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:04:04Z", "content": "Buying refurbished tech is both good for the planet and for your bank account, and now, its even less expensive thanks to this exclusive offer from Decluttr. The company, which also happens to buy an… [+965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Peacock Alley's entire product line is now 25% off for Days of Deals", "description": "Though typically an investment, Peacock Alley's product line has just become that much more affordable during Underscored's Days of Deals. During our promotion, you will receive 25% off sitewide when you use the code CNN25.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/peacock-alley-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811083355-underscored-day-of-deal-2021-peacock-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:03:46Z", "content": "When it comes to making luxury sheets, Peacock Alley is not the new kid on the block in fact, the brand has been churning out the stuff of dreams for 40 years. While its sheets sets and other linens … [+1798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Stock up on cozy Jambys for fall with this BOGO 50% off deal", "description": "As if you needed yet another reason to stock up on comfy clothes: Jambys, the line of \"performance inactivewear\" that's literally made to be worn while loafing around at home, is offering up a BOGO promo that's too cozy to pass up.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/jambys-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811060323-underscored-day-of-deal-2021-jambys-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:03:18Z", "content": "As if you needed yet another reason to stock up on comfy clothes: Jambys, the line of performance inactivewear thats literally made to be worn while loafing around at home, is offering up a BOGO prom… [+1329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Fenty Beauty Gloss Bombs are now 25% off", "description": "Right now, if you buy two or more Gloss Bombs from the collection and use the code CNN25, you'll get 25% off. That means two Gloss Bombs, which typically cost $38 total, will run you just $28.50 at checkout.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/fenty-beauty-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811065106-underscored-day-of-deal-2021-fenty-beauty-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:03:12Z", "content": "Chances are, if you have any awareness of beloved beauty products currently on the market, you know about Fenty Beauty. Created by the absurdly talented Rihanna, the beauty line first made waves for … [+651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Devour this 15% off deal on Omsom's meal starters", "description": "Hungry for a delectable deal? Now's your chance to score two bundles from Omsom — the Asian meal starters that prompted our reviewer to boldly state, \"This is one of the best cooking products I've ever tested\" — at a discount.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/omsom-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811065553-underscored-day-of-deal-2021-omsom-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:03:01Z", "content": "Hungry for a delectable deal? Nows your chance to score two bundles from Omsom the Asian meal starters that prompted our reviewer to boldly state, This is one of the best cooking products Ive ever te… [+1146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Stock up on ThirdLove bestsellers with $15 off when you spend $75 or more", "description": "For CNN Underscored's Days of Deals, we've partnered with ThirdLove to further get the word out on how amazing the brand's undergarments truly are. As part of the promotion, you will receive $15 off all orders of $75 or more.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/thirdlove-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811070430-underscored-day-of-deal-2021-thirdlove-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:02:55Z", "content": "Anyone who has ever owned a bra likely knows just how difficult it is to find one that fits you correctly. Thats why Instagram-famous underwear and loungewear brand ThirdLove has so many positive rev… [+2002 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Take 15% off some of our favorite bags from Paravel", "description": "To help you plan for future trips, Underscored readers can now get 15% off Paravel's Aviator Carry-On and Weekender bag, plus discounted bag personalization, as part of the Days of Deals Promotion.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/paravel-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811060326-underscored-day-of-deal-2021-paravel-lifestyle-lead-imag-super-169.jpg", "publishedAt": "2021-08-16T04:02:30Z", "content": "Paravel is a sustainable luggage brand with all the nostalgia of when traveling was a fashionable affair. Not only are the brands luggage pieces made from recycled materials, but they also feature an… [+1198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get a Wave Solo free when you buy a Theragun Pro", "description": "Right now, when you buy a Theragun PRO, you'll automatically get a free Wave Solo added to your cart at checkout. All you have to do is enter the code CNNUNDERSCORED before you make your purchase, and the $79 value is yours for free.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/theragun-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811072544-underscored-day-of-deal-2021-theragun-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:01:38Z", "content": "If youve been anywhere near the internet lately, chances are youve seen an ad for the Theragun. The therapeutic massaging device uses the power of percussive therapy to help alleviate muscle soreness… [+1546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Stock up on underwear from Parade with 25% off your order", "description": "Parade's cute, comfy underwear could be considered a cult favorite — more than 200,000 customers and counting agree that the size-inclusive brand is top-notch. And now CNN Underscored readers can shop Parade's colorful intimates at a discount.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/parade-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811100517-underscored-day-of-deal-2021-parade-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:01:21Z", "content": "Parades cute, comfy underwear could be considered a cult favorite more than 200,000 customers and counting agree that the size-inclusive brand is top-notch. And now CNN Underscored readers can shop P… [+1784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Save $250 at Saatva when you spend $1,000 or more", "description": "Typically, Saatva mattresses run between $840 to $2,099 depending on the model you choose, but today we're offering an additional $250 off your purchase of $1,000 or more as part of CNN Underscored's Days of Deals promotion.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/saatva-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811074318-underscored-day-of-deal-2021-saatva-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:01:19Z", "content": "If you have back issues or simply want to choose which firmness you prefer, Saatvas mattresses are the way to go. The company offers a variety of mattress-in-a-box options handcrafted in the United S… [+2055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: The sleek, versatile Proclamation Duo cookware set is $50 off", "description": "If you're looking for a cookware set that can truly do it all, consider the Proclamation Duo. With just three pieces — the pot, pan and universal lid — it can handle everything you need to achieve in the kitchen, from frying to double boiling.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/proclamation-goods-co-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811074556-underscored-day-of-deal-2021-proclamation-goods-lifestyle-lead-imag-super-169.jpg", "publishedAt": "2021-08-16T04:01:11Z", "content": "If youre looking for a cookware set that can truly do it all, consider the Proclamation Duo. With just three pieces the pot, pan and universal lid it can handle everything you need to achieve in the … [+1001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: The cult-favorite Always Pan is 20% off", "description": "The Always Pan by Our Place is the internet's favorite all-in-one cookware item — which means it's usually sold out. But right now not only is the Always Pan in stock in every color, but it's also on sale during our own Days of Deals event.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/our-place-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810154649-underscored-day-of-deal-2021-our-place-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:01:06Z", "content": "The Always Pan by Our Place is the internets favorite all-in-one cookware item which means its usually sold out. But right now not only is the Always Pan in stock in every color, but its also on sale… [+990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Get $20 off Logitech when you spend $120 or more", "description": "Now, as part of our Day of Deals promotion, you'll receive $20 off when you spend $120 or more sitewide on all products excluding MX products and video conferencing products; that means smart home accessories, home security items and more are all included.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/logitech-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810153344-underscored-day-of-deal-2021-logitech-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:00:53Z", "content": "There are quite a few Logitech products weve tried and still rave about. For starters, the Logitech G915 TKL is at the top of our list when it comes to the best mechanical keyboards, and the Logitech… [+1464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chelsea Stone", "title": "CNN Underscored exclusive: Save $30 on custom jeans from sustainable denim brand Lasso", "description": "Lasso makes sustainable denim that's customized to fit you to a T — without the designer price tag — and now, getting your ideal pair is even more affordable: ﻿﻿Take $30 off your entire purchase with code CNN30.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/lasso-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811075153-underscored-day-of-deal-2021-lasso-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:00:50Z", "content": "If finding the perfect pair of jeans feels like an eternal, impossible hunt, its time you try out Lasso. The L.A. brand makes sustainable denim thats customized to fit you to a T without the designer… [+1240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "CNN Underscored exclusive: Equator Coffees are now 20% off for Days of Deals", "description": "Whether you're an Equator convert or new to the coffee brand, we're here to make the experience even more enticing with a special promotion for our Days of Deals.", "url": "https://www.cnn.com/2021/08/16/cnn-underscored/equator-coffees-days-of-deals-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210810151445-underscored-day-of-deal-2021-equator-coffee-lifestyle-lead-image-super-169.jpg", "publishedAt": "2021-08-16T04:00:42Z", "content": "Equator Coffees has been around since 1995, and has since been making a name for itself as a one-stop shop for excellent coffee and espresso varieties that are sustainably and ethically sourced. In f… [+1670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "Why your old video games may be worth millions", "description": "The record for the world's most expensive video game, now held by a $2 million copy of \"Super Mario Bros,\" has been broken three times in under a month. Here's why.", "url": "https://www.cnn.com/style/article/most-expensive-video-games/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813043742-nintendo-super-famicom-file-2017-super-tease.jpg", "publishedAt": "2021-08-16T03:44:42Z", "content": "luxuryPublished 16th August 2021\r\nWhen Roberto Dillon began collecting retro video games more than 12 years ago, he scoured auction sites and connected with niche groups of hobbyists to amass a perso… [+5951 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Tourism Australia's new campaign isn't about travel -- it's about vaccination", "description": "Tourism Australia's latest ad isn't about going on vacation -- it's about getting vaccinated against the coronavirus. The \"It's Our Best Shot for Travel\" campaign launched on August 16 in newspapers, on TV, online and across social media.", "url": "https://www.cnn.com/travel/article/tourism-australia-vaccine-campaign-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815205254-02-tourism-australia-vaccine-campaign-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-16T03:12:46Z", "content": "Lilit Marcus, CNNPublished 16th August 2021\r\nBut Tourism Australia's new ad isn't about going on vacation -- it's about getting vaccinated against the coronavirus. \r\nThe \"It's Our Best Shot for Trave… [+2538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Video by Jane Sit and Alex Dicker; story by Anagha Subhash Nair, CNN", "title": "The FPV drone pilots taking cameras where humans can't go", "description": "From flying across lava to down the world's highest waterfall, drone videographers are pushing the limits of what cameras can record.", "url": "https://www.cnn.com/travel/article/fpv-drone-videography-spc-intl-hk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813131214-fpv-drone-angel-falls-ellis-van-jason-thumb-super-tease.jpg", "publishedAt": "2021-08-16T02:58:35Z", "content": "(CNN) Standing deep in the jungle of Venezuela, Ellis van Jason was surrounded by insects. \"These ants went into my ear, into my nose, like even inside the goggles,\" he tells CNN.\r\nBut van Jason coul… [+1978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Rumors of the Taliban's presence in Kabul rocketed across social media platforms as journalists posted videos of the US helicopter evacuation effort. Other videos showed traffic jams along major arteries and emptied-out neighborhoods elsewhere.(view.newslette…", "url": "https://view.newsletters.cnn.com/messages/162907688356544ea0010be19/raw", "urlToImage": null, "publishedAt": "2021-08-16T01:35:06Z", "content": "-- The AP described how \"an Italian journalist, Francesca Mannocchi, posted a video of an Italian helicopter carrying her to the airport, an armed soldier standing guard at a window... She captioned … [+5749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Sam Kiley, CNN", "title": "What will an Afghanistan under the Taliban look like? Its rise to power in the '90s paints a grim picture", "description": "In late 2001, the rolling hills to the west of Afghanistan's Maidan Shahr were scarred with the black eruptions of high explosives, as the last few Taliban fighters were pounded by Northern Alliance artillery and American bombers. Then, as suddenly as a thund…", "url": "https://www.cnn.com/2021/08/15/middleeast/afghanistan-taliban-rule-analysis-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815164748-taliban-presidential-palace-kabul-afghanistan-paton-walsh-nr-vpx-00020603-super-tease.jpg", "publishedAt": "2021-08-15T23:15:58Z", "content": "(CNN)In late 2001, the rolling hills to the west of Afghanistan's Maidan Shahr were scarred with the black eruptions of high explosives, as the last few Taliban fighters were pounded by Northern Alli… [+6268 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Chaos is unfolding in Afghanistan. Here's what you need to know.", "description": "The Taliban edged closer to solidifying control of Afghanistan on Sunday, including entering the presidential palace in Kabul hours after former President Ashraf Ghani fled the country.", "url": "https://www.cnn.com/2021/08/15/politics/taliban-kabul-afghanistan-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815065639-01-kabul-afghanistan-08-15-2021-us-embassy-smoke-super-tease.jpg", "publishedAt": "2021-08-15T22:57:41Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The Taliban edged closer to solidifying control of Afghanistan on S… [+5305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, Kylie Atwood and Priscilla Alvarez, CNN", "title": "US curtailing evacuation of Afghans who worked for US to prioritize Americans", "description": "The Biden administration has curtailed the number of government-sponsored flights to the United States for Afghans who worked alongside the US as it prioritizes the evacuation of American personnel from the country, three sources familiar with the situation t…", "url": "https://www.cnn.com/2021/08/15/politics/afghan-siv-flights-curtailed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150923125213-translator-afghanistan-super-tease.jpg", "publishedAt": "2021-08-15T22:54:17Z", "content": "(CNN)The Biden administration has curtailed the number of government-sponsored flights to the United States for Afghans who worked alongside the US as it prioritizes the evacuation of American person… [+1802 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "Some kids don't want to return to in-person schooling", "description": "As schools reopen across the US, many children are excited to get back into classrooms with their friends. But for some others, online learning was a respite from bullying and the stress of trying to fit in.", "url": "https://www.cnn.com/2021/08/15/us/back-to-school-anxieties-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813142249-taliyah-rice-remote-school-super-tease.jpg", "publishedAt": "2021-08-15T22:46:29Z", "content": "(CNN)Taliyah Rice returns next week for her final year of high school in suburban Chicago. She's anxious about going back to in-person learning, but it has little to do with coronavirus fears or firs… [+6604 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "Opinion: Afghanistan's first female ambassador to the US: 'It was avoidable'", "description": "Roya Rahmani is the first woman to serve as Afghanistan's ambassador to the United States, a position she held from 2018 until last month. Bergen spoke to her over the weekend about the fall of much of Afghanistan to the Taliban. Rahmani who is in the United …", "url": "https://www.cnn.com/2021/08/15/opinions/afghanistan-taliban-takeover-us-withdrawal-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815041320-01-kabul-afghanistan-0815-us-helicopters-super-tease.jpg", "publishedAt": "2021-08-15T20:10:10Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. Bergen has reported from Afghanistan since 1993. His new book… [+4926 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Zakaria: This is 'one of the greatest military collapses' in history - CNN Video", "description": "\"The fall of the Afghan army, the fall of Afghanistan, the fall of Kabul has happened at a speed that is really stunning.\" CNN's Fareed Zakaria says. He asks: \"What was the scale of intelligence failure in the United States, the U.S. military, how much were w…", "url": "https://www.cnn.com/videos/business/2021/08/15/zakaria-this-is-one-of-the-greatest-military-collapses-in-history.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815132002-rs-d-block-1-fareed-super-tease.jpg", "publishedAt": "2021-08-15T19:01:03Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Jennifer Hansler and Melanie Zanona, CNN", "title": "Top US general says terror groups could reconstitute in Afghanistan sooner than expected", "description": "Chairman of the Joint Chiefs of Staff Gen. Mark Milley said Sunday in a briefing for Senators that terrorist groups like al Qaeda could reconstitute in Afghanistan sooner than the two years defense officials had previously estimated to Congress because of the…", "url": "https://www.cnn.com/2021/08/15/politics/mark-milley-afghanistan-terror-groups/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815141356-mark-milley-07-21-2021-super-tease.jpg", "publishedAt": "2021-08-15T18:50:38Z", "content": "(CNN)Chairman of the Joint Chiefs of Staff Gen. Mark Milley said Sunday in a briefing for Senators that terrorist groups like al Qaeda could reconstitute in Afghanistan sooner than the two years defe… [+3115 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deanna Hackney", "title": "Singer and songwriter Nanci Griffith has died at 68", "description": "Folk and country singer and songwriter Nanci Griffith, whose album \"Other Voices, Other Rooms\" won the 1994 Grammy Award for Best Contemporary Folk Album, died on Friday. She was 68.", "url": "https://www.cnn.com/2021/08/15/entertainment/nanci-griffith-singer-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815132553-nanci-griffith-singer-dead-super-169.jpg", "publishedAt": "2021-08-15T18:39:26Z", "content": "Folk and country singer and songwriter Nanci Griffith, whose album Other Voices, Other Rooms won the 1994 Grammy Award for Best Contemporary Folk Album, died on Friday. She was 68.\r\nGriffith passed a… [+505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott", "title": "Muhammad Ali's grandson marks professional boxing debut with a victory", "description": "The continuation of a legacy was how Nico Ali Walsh -- the grandson of Muhammad Ali -- described making his professional boxing debut in the sport on Saturday.", "url": "https://www.cnn.com/2021/08/15/sport/nico-ali-walsh-muhammad-ali-grandson-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815124251-01-nico-ali-walsh-muhammad-ali-grandson-spt-intl-super-169.jpg", "publishedAt": "2021-08-15T18:10:01Z", "content": "The continuation of a legacy was how Nico Ali Walsh the grandson of Muhammad Ali -- described making his professional boxing debut in the sport on Saturday.\r\nWearing a pair of his grandfathers white … [+1425 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Ward: Afghan journalists are 'absolutely petrified' - CNN Video", "description": "Afghan journalists are \"absolutely petrified, particularly women journalists,\" as the Taliban regains control of Afghanistan, CNN's Clarissa Ward reports on \"Reliable Sources.\" Ward says these \"courageous\" journalists know that \"they're big targets because th…", "url": "https://www.cnn.com/videos/business/2021/08/15/ward-afghan-journalists-are-absolutely-petrified.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815131603-rs-a-block-1-brian-and-clarissa-super-tease.jpg", "publishedAt": "2021-08-15T18:01:11Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "No star striker, no problem as Tottenham Hotspur stuns Manchester City", "description": "No Harry Kane? No problem. Tottenham Hotspur stunned Manchester City on Sunday, grinding out a gritty 1-0 win, despite the absence of the London's club star striker, who has been linked with a move to the reigning Premier League champion.", "url": "https://www.cnn.com/2021/08/15/football/tottenham-hotspur-manchester-city-harry-kane-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815184715-son-heung-min-super-tease.jpg", "publishedAt": "2021-08-15T18:00:38Z", "content": "(CNN)No Harry Kane? No problem. Tottenham Hotspur stunned Manchester City on Sunday, grinding out a gritty 1-0 win, despite the absence of the London's club star striker, who has been linked with a m… [+993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gul Tuysuz, CNN", "title": "Death toll from Turkey floods rises to 58", "description": "Flash floods across Turkey's Black Sea coast have killed 58 people, officials said Sunday.", "url": "https://www.cnn.com/2021/08/15/europe/turkey-floods-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815124701-restricted-01-turkey-floods-08-15-2021-kastamonu-super-tease.jpg", "publishedAt": "2021-08-15T17:19:23Z", "content": "Istanbul (CNN)Flash floods across Turkey's Black Sea coast have killed 58 people, officials said Sunday. \r\nThe country's Natural Disasters and Emergency Directorate (AFAD) said in a statement that 48… [+1029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Murray, CNN", "title": "San Antonio sports bar shooting leaves 3 dead, 2 wounded, authorities say", "description": "An argument between two people at a bar in San Antonio, Texas, ended in a mass shooting early Sunday, with three people killed and two others gravely wounded, San Antonio Police Chief William McManus said.", "url": "https://www.cnn.com/2021/08/15/us/san-antonio-bar-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815105446-screengrab-san-antonio-shooting-press-conference-08-15-2021-super-tease.jpg", "publishedAt": "2021-08-15T17:07:13Z", "content": "(CNN)An argument between two people at a bar in San Antonio, Texas, ended in a mass shooting early Sunday, with three people killed and two others gravely wounded, San Antonio Police Chief William Mc… [+1114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Braner, CNN", "title": "More than a year later, America grapples with long Covid", "description": "\"I was told to go home and rest, that everything would be fine in two weeks. Sadly, those two weeks for me have never come,\" said Chimére Smith, 39, one of many Americans fighting long Covid.", "url": "https://www.cnn.com/2021/08/15/health/long-haulers-covid-19-year-mystery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813210303-02-chimere-smith-super-tease.jpg", "publishedAt": "2021-08-15T17:04:24Z", "content": "(CNN)\"I was told to go home and rest, that everything would be fine in two weeks. Sadly, those two weeks for me have never come,\" said Chimére Smith, 39, one of many Americans fighting long Covid.\r\nA… [+9258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "This $4.7 million racer will likely be Bugatti's last gas-powered supercar", "description": "Bugatti announced that it will be making a production version of its concept car called the Bolide, an 1,800-horsepower, 16-cylinder track-only supercar with a top speed of over 300 miles per hour. And this will likely be the last gasoline-powered car the Fre…", "url": "https://www.cnn.com/2021/08/15/success/bugatti-bolide-supercar-production/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814200403-01-bugatti-bolide-production-super-tease.jpg", "publishedAt": "2021-08-15T15:35:09Z", "content": "(CNN)Bugatti announced that it will be making a production version of its concept car called the Bolide, an 1,800-horsepower, 16-cylinder track-only supercar with a top speed of over 300 miles per ho… [+3314 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole and Daniella Diaz, CNN", "title": "Top Republican on foreign affairs committee slams Biden over 'unmitigated disaster' in Afghanistan", "description": "The top Republican on the House Foreign Affairs Committee slammed the Biden administration over the rapidly deteriorating situation in Afghanistan on Sunday, calling it an \"unmitigated disaster of epic proportions\" that could lead to dire consequences.", "url": "https://www.cnn.com/2021/08/15/politics/michael-mccaul-afghanistan-withdrawal-criticism-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210530134015-michael-mccaul-file-super-tease.jpg", "publishedAt": "2021-08-15T15:24:48Z", "content": "Washington (CNN)The top Republican on the House Foreign Affairs Committee slammed the Biden administration over the rapidly deteriorating situation in Afghanistan on Sunday, calling it an \"unmitigate… [+3028 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Hochul vows 'zero tolerance' in her administration once she becomes New York governor", "description": "New York Lt. Gov. Kathy Hochul, who will make history as the female governor of New York, on Sunday vowed to uphold integrity in her administration after Andrew Cuomo resigned following the state attorney general's investigation that found he sexually harasse…", "url": "https://www.cnn.com/2021/08/15/politics/kathy-hochul-zero-tolerance-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815104603-screengrab-kathy-hochul-cnn-08-15-2021-super-tease.jpg", "publishedAt": "2021-08-15T15:24:28Z", "content": "(CNN)New York Lt. Gov. Kathy Hochul, who will make history as the female governor of New York, on Sunday vowed to uphold integrity in her administration after Andrew Cuomo resigned following the stat… [+2584 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt", "title": "State Department 'pushing the envelope' by offering Dark Web informants cryptocurrency rewards for information on hackers attacking the United States", "description": "As hackers and cybersecurity experts descended on Las Vegas last week for the famous cyber conference Black Hat, they may have noticed an open Wi-Fi network called \"#Rewardsnotransoms.\" It's not the kind of place where a network is usually left unprotected bu…", "url": "https://www.cnn.com/2021/08/15/politics/state-department-dark-web-cryptocurrency-rewards/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811141959-02-rewards-not-ransoms-super-169.jpg", "publishedAt": "2021-08-15T15:09:06Z", "content": "As hackers and cybersecurity experts descended on Las Vegas last week for the famous cyber conference Black Hat, they may have noticed an open Wi-Fi network called #Rewardsnotransoms. Its not the kin… [+10170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Jason Hoffman, CNN", "title": "Biden administration struggles to project order as Taliban enters Kabul", "description": "President Joe Biden and his administration struggled Sunday to project order amid a race by American and other foreign personnel to evacuate Afghanistan as Taliban fighters entered Kabul.", "url": "https://www.cnn.com/2021/08/15/politics/biden-administration-taliban-kabul-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815102517-antony-blinken-august-15-2021-screengrab-super-tease.jpg", "publishedAt": "2021-08-15T15:03:53Z", "content": "(CNN)President Joe Biden and his administration struggled Sunday to project order amid a race by American and other foreign personnel to evacuate Afghanistan as Taliban fighters entered Kabul.\r\nThe r… [+6784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AnneClaire Stapleton and Mohammed Tawfeeq, CNN", "title": "7.2-magnitude earthquake strikes Haiti, leaving more than 300 people dead", "description": "The Haitian government declared a state of emergency after a 7.2-magnitude earthquake struck the country Saturday, leaving at least 304 people dead and destroying homes, roads and buildings, Prime Minister Ariel Henry announced.", "url": "https://www.cnn.com/2021/08/15/world/haiti-earthquake-news-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814191901-01-haiti-earthquake-gallery-super-tease.jpg", "publishedAt": "2021-08-15T14:26:05Z", "content": "(CNN)The Haitian government declared a state of emergency after a 7.2-magnitude earthquake struck the country Saturday, leaving at least 304 people dead and destroying homes, roads and buildings, Pri… [+7364 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Murray, CNN", "title": "Kalamazoo County deputy in critical condition after deadly police chase", "description": "Michigan State Police are investigating after a police chase in Galesburg on Saturday night that ended with a suspect dead and a sheriff's deputy in critical condition.", "url": "https://www.cnn.com/2021/08/15/us/kalamazoo-county-sheriff-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160221015825-michigan-random-shootings-kalamazoo-sot-vo-00002914-super-tease.jpg", "publishedAt": "2021-08-15T14:02:16Z", "content": "(CNN)Michigan State Police are investigating after a police chase in Galesburg on Saturday night that ended with a suspect dead and a sheriff's deputy in critical condition.\r\nThe chase began at a She… [+1305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "Gerd Müller: Legendary Bayern Munich striker mourned after death, aged 75", "description": "German soccer great Gerd Müller, who scored a remarkable 566 goals in 607 competitive appearances for Bayern Munich, died on Sunday at the age of 75, according to the Bundesliga club.", "url": "https://www.cnn.com/2021/08/15/football/gerd-mller-death-aged-75-bayern-munich-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815092304-gerd-muller-07-07-1974-super-tease.jpg", "publishedAt": "2021-08-15T13:57:10Z", "content": "(CNN)German soccer great Gerd Müller, who scored a remarkable 566 goals in 607 competitive appearances for Bayern Munich, died on Sunday at the age of 75, according to the Bundesliga club.\r\n\"Today is… [+3005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland", "title": "The infrastructure bill is more about maintaining train service than upgrading it", "description": "Don't expect any 200 mph trains that rival Europe and Asia's best, or even cheaper fares.", "url": "https://www.cnn.com/2021/08/15/tech/infrastructure-trains-railroad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812125445-amtrak-train-platform-dc-0718-super-169.jpg", "publishedAt": "2021-08-15T13:16:56Z", "content": "Dont expect any 200 mph trains that rival Europe and Asias best, or even cheaper fares. \r\nTransportation experts think the infrastructure bill could be the start of a turning point for the disadvanta… [+5803 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Start your week smart: Coronavirus ... Afghanistan ... Florida ... San Francisco ... New York City", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/08/15/us/five-things-august-15-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814195747-07-haiti-earthquake-gallery-super-tease.jpg", "publishedAt": "2021-08-15T12:57:44Z", "content": "Seven men and five women have been sworn in as jurors in the R. Kelly federal trial in New York. Opening statements begin Wednesday, and jurors will remain anonymous and partially sequestered. Kelly … [+1103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew", "title": "Why we can't get enough of watching rich and terrible characters in TV series like 'The White Lotus'", "description": "There's a scene in the very first episode of HBO's critically acclaimed prestige drama, \"Succession,\" that is about as viscerally unsettling to watch as a Jigsaw death trap in a \"Saw\" film.", "url": "https://www.cnn.com/2021/08/15/entertainment/white-lotus-succession-rich-characters-tv-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813115043-02-rich-people-tv-the-white-lotus-super-169.jpg", "publishedAt": "2021-08-15T12:43:06Z", "content": "Theres a scene in the very first episode of HBOs critically acclaimed prestige drama, Succession, that is about as viscerally unsettling to watch as a Jigsaw death trap in a Saw film. \r\nThe pilot see… [+11430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "As Pentagon prepares to make Covid-19 vaccine mandatory, some lawyers see a surge in calls", "description": "The messages began pouring into the law office of Joseph Jordan in Killeen, Texas, soon after the Pentagon announced it would seek to make the Covid-19 vaccines mandatory for troops. Service members wanted to know what their options were if they didn't want t…", "url": "https://www.cnn.com/2021/08/15/politics/military-reax-pentagon-covid-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401061941-01-moderna-covid-19-vaccine-texas-0329-super-tease.jpg", "publishedAt": "2021-08-15T12:34:26Z", "content": "(CNN)The messages began pouring into the law office of Joseph Jordan in Killeen, Texas, soon after the Pentagon announced it would seek to make the Covid-19 vaccines mandatory for troops. Service mem… [+6797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "Homophobic chanting mars Premier League win", "description": "Hundreds of thousands of fans attended English Premier League matches this weekend for the first time in nearly 18 months, though one game was marred by homophobic chanting and another by \"isolated incidents of disorder\" ahead of kick off.", "url": "https://www.cnn.com/2021/08/15/football/premier-league-homophobic-chant-liverpool-norwich-chelsea-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815080701-restricted-03-norwich-city-liverpool-08-14-2021-super-tease.jpg", "publishedAt": "2021-08-15T12:34:12Z", "content": "(CNN)Hundreds of thousands of fans attended English Premier League matches this weekend for the first time in nearly 18 months, though one game was marred by homophobic chanting and another by \"isola… [+3906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood", "title": "US completely pulling out of embassy in Afghanistan over the next 72 hours", "description": "The United States is pulling out all US personnel from its embassy in Kabul over the next 72 hours, including top officials, two sources familiar with the situation told CNN on Sunday.", "url": "https://www.cnn.com/2021/08/15/politics/us-embassy-kabul-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815065639-01-kabul-afghanistan-08-15-2021-us-embassy-smoke-super-169.jpg", "publishedAt": "2021-08-15T12:09:25Z", "content": "The United States is pulling out all US personnel from its embassy in Kabul over the next 72 hours, including top officials, two sources familiar with the situation told CNN on Sunday. \r\nThe withdraw… [+672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, CNN", "title": "US completely pulling out of embassy in Afghanistan over the next 72 hours", "description": "The United States is pulling out all US personnel from its embassy in Kabul over the next 72 hours, including top officials, two sources familiar with the situation told CNN on Sunday.", "url": "https://www.cnn.com/2021/08/15/politics/us-embassy-kabul-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815065639-01-kabul-afghanistan-08-15-2021-us-embassy-smoke-super-tease.jpg", "publishedAt": "2021-08-15T12:09:25Z", "content": "(CNN)The United States is pulling out all US personnel from its embassy in Kabul over the next 72 hours, including top officials, two sources familiar with the situation told CNN on Sunday. \r\nThe wit… [+683 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "On Covid, people are making the last mistake", "description": "With the US in a Covid spike caused by the Delta variant, the \"last mistake\" for many could be a failure to get one of the highly effective vaccines and to mask up. The two simple precautions are especially vital as the school year begins.", "url": "https://www.cnn.com/2021/08/15/opinions/covid-last-mistake-opinion-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815075032-ny-protest-against-vaccine-mandates-super-tease.jpg", "publishedAt": "2021-08-15T12:00:23Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)\"The winner of the game,\" said chess c… [+15452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Utah wildfire forces thousands of homes to evacuate as the nation's largest fire in California rages", "description": "Wildfires in Utah and California continued to rage on Saturday, forcing residents to evacuate from thousands of homes.", "url": "https://www.cnn.com/2021/08/15/weather/us-western-wildfires-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815021344-01-parleys-canyon-fire-utah-super-tease.jpg", "publishedAt": "2021-08-15T10:36:48Z", "content": "(CNN)Wildfires in Utah and California continued to rage on Saturday, forcing residents to evacuate from thousands of homes. \r\nAs the Parley's Canyon Fire grew, more than 6,000 homes were evacuated ea… [+3850 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Haley Brink and Travis Caldwell, CNN", "title": "Dual Atlantic storms may impact US, Haiti in the next 48 hours", "description": "While Gulf storm Fred is anticipated to strengthen as it moves north toward the Florida Panhandle, additional alerts have been levied in the Caribbean regarding Tropical Storm Grace, which may affect recovery efforts following a 7.2-magnitude earthquake that …", "url": "https://www.cnn.com/2021/08/15/weather/grace-fred-storms-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815052739-weather-grace-tropical-storm-satellite-sunday-morning-08152021-super-tease.jpg", "publishedAt": "2021-08-15T10:23:32Z", "content": "(CNN)While Gulf storm Fred is anticipated to strengthen as it moves north toward the Florida Panhandle, additional alerts have been levied in the Caribbean regarding Tropical Storm Grace, which may a… [+2872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Jones, CNN", "title": "The story behind the Trans-Iranian Railway, one of the greatest engineering feats of the 20th century", "description": "The spectacular Trans-Iranian Railway joined an illustrious club when it gained UNESCO World Heritage Site status in July. Here's why the accolade is richly deserved.", "url": "https://www.cnn.com/travel/article/trans-iranian-railway-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210801234440-02-trans-iranian-railway-unesco-super-tease.jpg", "publishedAt": "2021-08-15T10:16:51Z", "content": "Ben Jones, CNNPublished 15th August 2021\r\n(CNN) It may not be as long or as well-known as Russia's iconic Trans-Siberian Railway. But international recognition is long overdue for the 1,394-kilometer… [+11918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alaa Elassar, CNN", "title": "The US and Canada have a new dark sky park for stargazers to enjoy", "description": "Amateur astronomers take note: There's a new dark sky place to see the stars.", "url": "https://www.cnn.com/travel/article/dark-sky-waterton-glacier-international-peace-park-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813123323-glacier-national-park-night-file-2013-super-tease.jpg", "publishedAt": "2021-08-15T10:01:16Z", "content": "(CNN) Amateur astronomers take note: There's a new dark sky place to see the stars.\r\nWaterton-Glacier International Peace Park is now certified as an International Dark Sky Park, after meeting lighti… [+2266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Naomi Osaka to donate prize money to Haitian earthquake relief efforts", "description": "Naomi Osaka has pledged to donate her earnings from next week's Western & Southern Open to support earthquake relief efforts in Haiti, the Caribbean nation her father hails from.", "url": "https://www.cnn.com/2021/08/15/tennis/naomi-osaka-haitian-earthquake-relief-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727005812-11-olympics-072721-tennis-osaka-super-tease.jpg", "publishedAt": "2021-08-15T09:46:14Z", "content": "Naomi Osaka has pledged to donate her earnings from next week's Western &amp; Southern Open to support earthquake relief efforts in Haiti, the Caribbean nation her father hails from.\r\nThe four-time G… [+828 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis By John Blake, CNN", "title": "Obama poses a question that we still cannot answer", "description": "Between his 60th birthday and a new HBO series about his presidency, President Obama is back in the news. But given our toxic partisan politics, it's worth asking: Will we ever believe a leader who talks about hope and change again?", "url": "https://www.cnn.com/2021/08/15/politics/obama-poses-a-question-that-we-still-cannot-answer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813161420-01-obama-analysis-super-tease.jpg", "publishedAt": "2021-08-15T09:07:25Z", "content": "Analysis By John Blake, CNN\r\nUpdated 5:07 AM ET, Sun August 15, 2021\r\n (CNN)The \"Yes We Can!\" bumper sticker that seemed to be plastered on every passing car. The \"fired up, ready to go!\" chant that … [+9114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "The US health care system 'is breaking,' expert says as Covid-19 hospitalizations for people in their 30s hit new high", "description": "With primarily unvaccinated Covid-19 patients filling up hospitals and intensive care unit beds, the US health care system \"is breaking,\" one expert said, as new admissions hit another record.", "url": "https://www.cnn.com/2021/08/15/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814235031-02-louisiana-hospital-0810-super-tease.jpg", "publishedAt": "2021-08-15T08:27:55Z", "content": "(CNN)With primarily unvaccinated Covid-19 patients filling up hospitals and intensive care unit beds, the US health care system \"is breaking,\" one expert said, as new admissions hit another record.\r\n… [+5381 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/lauren-moorhouse\">Lauren Said-Moorhouse</a>, CNN", "title": "The latest on Afghanistan as the Taliban advances towards Kabul", "description": "The Taliban has made rapid gains and now controls most of Afghanistan's provincial capitals, leaving the capital of Kabul the only major city under government control. Follow here for the latest news.", "url": "https://www.cnn.com/world/live-news/afghanistan-taliban-us-troops-intl-08-15-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814160434-kandahar-afghanistan-taliban-0814-super-tease.jpg", "publishedAt": "2021-08-15T08:13:17Z", "content": "A US official tells CNN that evacuations are well underway in Afghanistan, with a goal to get US Embassy personnel out by Tuesday morning, if not sooner.\r\nThe Taliban is making rapid advances and is … [+598 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Multiracial population grew in almost every county in the US. It doesn't mean racism is over", "description": "Bárbara Abadía-Rexach spent months appearing in webinars and radio shows talking to Puerto Ricans about why they should identify as Black or more than one race on the 2020 Census.", "url": "https://www.cnn.com/2021/08/15/us/census-2020-multiracial-nation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813164501-04-census-2020-multiracial-nation-super-tease.jpg", "publishedAt": "2021-08-15T08:03:19Z", "content": "(CNN)Bárbara Abadía-Rexach spent months appearing in webinars and radio shows talking to Puerto Ricans about why they should identify as Black or more than one race on the 2020 Census.\r\n\"If you are c… [+6249 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung", "title": "Prominent Hong Kong civil rights group disbands, citing government pressure", "description": "Civil Human Rights Front (CHRF), the pro-democracy group that organized some of Hong Kong's biggest protests, announced Sunday that it was disbanding -- the latest of a string of civic organizations that have dissolved in the wake of a sweeping national secur…", "url": "https://www.cnn.com/2021/08/15/asia/hong-kong-chrf-disbands-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815025508-civil-human-rights-front-file-2020-super-169.jpg", "publishedAt": "2021-08-15T07:03:06Z", "content": "Civil Human Rights Front (CHRF), the pro-democracy group that organized some of Hong Kongs biggest protests, announced Sunday that it was disbanding the latest of a string of civic organizations that… [+7703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz, CNN", "title": "Teachers from states banning mask mandates are speaking out. Here's what they want you to know", "description": "Teachers are already struggling to do their job during a pandemic. But it's worse for those working in states where mask mandates are prohibited.", "url": "https://www.cnn.com/2021/08/15/us/teachers-mask-mandates-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812125316-20210812-teachers-covid-concerns-super-tease.jpg", "publishedAt": "2021-08-15T07:00:23Z", "content": "By Christina Zdanowicz, CNN\r\nUpdated 3:00 AM ET, Sun August 15, 2021\r\n (CNN)Teachers are already struggling to do their job during a pandemic. But it's worse for those working in states where mask ma… [+4980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Drayer", "title": "How your 'healthy' lifestyle can be making you tired", "description": "Here are a few ways that a supposedly \"healthy\" diet can make you sluggish -- and what you can do to get your energy back on track.", "url": "https://www.cnn.com/2021/08/15/health/tired-fatigue-causes-healthy-lifestyle-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812131334-woman-tired-while-eating-stock-super-169.jpg", "publishedAt": "2021-08-15T06:02:23Z", "content": "Editors Note: Lisa Drayer is a nutritionist, author and CNN health and nutrition contributor.\r\nLet me guess: Youre eating clean, enjoying lots of fruits and vegetables, cutting out meat and are much … [+6542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "At least 20 people killed after fuel tank explodes in Lebanon", "description": "At least 20 people were killed and 79 injured in a fuel tank explosion in the Akkar region in northern Lebanon, the Lebanese Red Cross said on its Twitter account early on Sunday.", "url": "https://www.cnn.com/2021/08/15/middleeast/lebanon-explosion-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815013620-01-lebanon-tanker-explosion-0815-super-tease.jpg", "publishedAt": "2021-08-15T05:51:11Z", "content": "Beirut, LebanonAt least 20 people were killed and 79 injured in a fuel tank explosion in the Akkar region in northern Lebanon, the Lebanese Red Cross said on its Twitter account early on Sunday.\r\nLeb… [+2645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson, CNN", "title": "Baseball star Trevor Bauer denies assault allegations detailed in The Washington Post", "description": "Los Angeles Dodgers pitcher Trevor Bauer, last year's National League Cy Young Award winner, is denying allegations made against him years ago by an Ohio woman that were reported Saturday by The Washington Post.", "url": "https://www.cnn.com/2021/08/15/us/trevor-bauer-denies-assault-allegations-ohio-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210815003453-trevor-bauer-file-0628-super-tease.jpg", "publishedAt": "2021-08-15T05:09:04Z", "content": "(CNN)Los Angeles Dodgers pitcher Trevor Bauer, last year's National League Cy Young Award winner, is denying allegations made against him years ago by an Ohio woman that were reported Saturday by The… [+3555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Vaughan, CNN", "title": "How two mothers, united in loss, hope to bring peace in the Israeli-Palestinian conflict", "description": "\"She's like a sister for me,\" Laila Alsheikh tells CNN, reflecting on colleague and friend Robi Damelin.", "url": "https://www.cnn.com/2021/08/15/us/iyw-israeli-palestinian-hth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729051109-restricted-split-iyw-parents-circle-families-forum-super-tease.jpg", "publishedAt": "2021-08-15T05:02:24Z", "content": "\"Strange, but I wasn't consumed by revenge. Years later I tried, somehow, to make sense of the loss. I guess this helped me survive.\"\r\nNir Yesod on his emotions after the death of his mother Tzipi. \r… [+148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "MLB pitcher Tyler Gilbert throws a no-hitter in his first career big league start", "description": "The modern-era record in Major League Baseball for most no-hitters thrown in a season was broken on Saturday in a sensational way, as a pitcher achieved the feat in his first career big league start.", "url": "https://www.cnn.com/2021/08/14/sport/no-hitter-mlb-tyler-gilbert-first-start-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814231847-02-tyler-gilbert-arizona-diamondbacks-no-hitter-0814-super-tease.jpg", "publishedAt": "2021-08-15T03:52:28Z", "content": "(CNN)The modern-era record in Major League Baseball for most no-hitters thrown in a season was broken on Saturday in a sensational way, as a pitcher achieved the feat in his first career big league s… [+961 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian, CNN", "title": "57 injured in crash of tour bus headed to Niagara Falls", "description": "A tour bus headed to Niagara Falls crashed Saturday, sending all 57 occupants, including the driver, to local hospitals to be treated for injuries, according to New York State Police and a spokesperson for an area hospital.", "url": "https://www.cnn.com/2021/08/14/us/bus-crash-niagara-falls-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814221347-niagara-falls-bus-crash-0814-super-tease.jpg", "publishedAt": "2021-08-15T03:02:38Z", "content": "(CNN)A tour bus headed to Niagara Falls crashed Saturday, sending all 57 occupants, including the driver, to local hospitals to be treated for injuries, according to New York State Police and a spoke… [+978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian, CNN", "title": "57 injured in crash of tour bus headed to Niagara Falls", "description": "A tour bus headed to Niagara Falls crashed Saturday, sending all 57 occupants, including the driver, to local hospitals to be treated for injuries, according to New York State Police and a spokesperson for an area hospital.", "url": "https://www.cnn.com/2021/08/14/us/bus-crash-niagara-falls-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814221347-niagara-falls-bus-crash-0814-super-tease.jpg", "publishedAt": "2021-08-15T03:02:38Z", "content": "(CNN)A tour bus headed to Niagara Falls crashed Saturday, sending all 57 occupants, including the driver, to local hospitals to be treated for injuries, according to New York State Police and a spoke… [+978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "The mysterious Chinese fashion app that's as popular as Amazon", "description": null, "url": "https://www.cnn.com/2021/08/14/business/shein-china-fast-fashion-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162321-restricted-01-shein-feature-super-tease.jpg", "publishedAt": "2021-08-15T00:15:47Z", "content": "By Michelle Toh, CNN Business\r\nUpdated 8:15 PM ET, Sat August 14, 2021\r\nEvery night before bed, Anushka Sachan whips out her phone to log into an app.\r\n\"It kind of becomes a habit,\" said the 20-year-… [+10961 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Joseph and Liam Reilly", "title": "Former SNL cast member Horatio Sanz has been accused of grooming and sexually assaulting a minor", "description": "Comedian and former \"Saturday Night Live\" cast member Horatio Sanz is accused of grooming and sexually assaulting a 17-year-old in 2002, according to a lawsuit filed in New York on Thursday.", "url": "https://www.cnn.com/2021/08/14/us/snl-horatio-sanz-sexual-assault-grooming-minor-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814161758-snl-horatio-sanz-sexual-assault-grooming-minor-trnd-restricted-super-169.jpg", "publishedAt": "2021-08-14T23:15:34Z", "content": "Comedian and former Saturday Night Live cast member Horatio Sanz is accused of grooming and sexually assaulting a 17-year-old in 2002, according to a lawsuit filed in New York on Thursday. \r\nThe plai… [+1738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mayra Cuevas, CNN", "title": "How to Help Haiti Earthquake Victims", "description": "A 7.2 magnitude earthquake hit Haiti Saturday morning, likely causing widespread disaster, according to the US Geological Survey.", "url": "https://www.cnn.com/2021/08/14/world/how-to-help-haiti-earthquake-victims/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814104409-01-haiti-quake-0814-super-tease.jpg", "publishedAt": "2021-08-14T21:49:28Z", "content": "(CNN)A 7.2 magnitude earthquake hit Haiti Saturday morning, likely causing widespread disaster, according to the US Geological Survey.\r\nHumanitarian officials worry about how quickly aid can be deplo… [+497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd and Barbara Starr, CNN", "title": "Biden announces he's authorized 5,000 troops to ensure \"orderly and safe drawdown\" in Afghanistan", "description": "President Joe Biden announced the authorization of a total of 5,000 troops to Afghanistan \"to make sure we can have an orderly and safe drawdown of US personnel and other allied personnel and an orderly and safe evacuation of Afghans who helped our troops dur…", "url": "https://www.cnn.com/2021/08/14/politics/biden-afghanistan-troops/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814115852-kabul-afghanistan-view-08-14-2021-super-tease.jpg", "publishedAt": "2021-08-14T21:34:55Z", "content": "(CNN)President Joe Biden announced the authorization of a total of 5,000 troops to Afghanistan \"to make sure we can have an orderly and safe drawdown of US personnel and other allied personnel and an… [+962 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "US border agents in Tennessee have seized thousands of counterfeit Covid-19 vaccination cards", "description": "US Customs and Border Protection officers in Memphis, Tennessee, have seized thousands of fake Covid-19 vaccination cards so far this year.", "url": "https://www.cnn.com/2021/08/14/us/memphis-fake-vaccination-cards-us-border-patrol/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814155913-01-memphis-fake-vaccination-cards-us-border-patrol-super-tease.jpg", "publishedAt": "2021-08-14T21:25:24Z", "content": "(CNN)US Customs and Border Protection officers in Memphis, Tennessee, have seized thousands of fake Covid-19 vaccination cards so far this year.\r\n\"Every night\" officers are seizing shipments from She… [+1845 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "In the largest Afghan enclave in the US, frustration, heartbreak and 'a sense of mourning'", "description": "The sense of hope that Afghan Americans had for repairing their fractured country is rapidly fading as provincial capital after provincial capital in their homeland falls to the Taliban.", "url": "https://www.cnn.com/2021/08/14/us/afghan-american-community-taliban-advance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814115852-kabul-afghanistan-view-08-14-2021-super-tease.jpg", "publishedAt": "2021-08-14T21:23:35Z", "content": "(CNN)Mizgon Darby was an 18-year-old college freshman when she started a journal 20 years ago giving voice to the growing numbers of Afghans living in the United States. \r\n\"There was a sense of hope,… [+8832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Former Iowa Democratic chair Troy Price hired as New Hampshire Democrats' executive director", "description": "Troy Price, the former chair of the Iowa Democratic Party during the chaotic 2020 Iowa caucuses, is the New Hampshire Democratic Party's new executive director, the party announced Friday.", "url": "https://www.cnn.com/2021/08/14/politics/troy-price-chair-iowa-caucuses-2020-new-hampshire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814155705-troy-price-file-super-tease.jpg", "publishedAt": "2021-08-14T21:04:33Z", "content": "(CNN)Troy Price, the former chair of the Iowa Democratic Party during the chaotic 2020 Iowa caucuses, is the New Hampshire Democratic Party's new executive director, the party announced Friday.\r\nPric… [+2657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Former Iowa Democratic chair Troy Price hired as New Hampshire Democrats' executive director", "description": "Troy Price, the former chair of the Iowa Democratic Party during the chaotic 2020 Iowa caucuses, is the New Hampshire Democratic Party's new executive director, the party announced Friday.", "url": "https://www.cnn.com/2021/08/14/politics/troy-price-chair-iowa-caucuses-2020-new-hampshire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210814155705-troy-price-file-super-tease.jpg", "publishedAt": "2021-08-14T21:04:33Z", "content": "(CNN)Troy Price, the former chair of the Iowa Democratic Party during the chaotic 2020 Iowa caucuses, is the New Hampshire Democratic Party's new executive director, the party announced Friday.\r\nPric… [+2657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dr. Lee Savio Beers", "title": "The right way to protect our children and return to in-person learning", "description": "As a pediatrician and a parent, I am still confident that children can safely return to learning in person in the coming weeks, writes Dr. Lee Savio Beers.", "url": "https://www.cnn.com/2021/08/14/opinions/the-right-way-to-protect-our-children-and-return-to-in-person-learning-beers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162107-01-children-covid-mask-stock-super-tease.jpg", "publishedAt": "2021-08-14T20:55:08Z", "content": "Dr. Lee Savio Beers is the president of the American Academy of Pediatrics. The views expressed belong to the author. View more opinion at CNN.\r\n (CNN)Like so many families, ours had been looking for… [+5034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kent Sepkowitz", "title": "Opinion: The blunt truth about what comes next with Covid-19", "description": "The only real certainty we have is this: the world's herd will eventually become immune to the Delta variant one way (via vaccine) or another (through infection, disease and possible death), writes Dr. Kent Sepkowitz. Humans can decide between the options but…", "url": "https://www.cnn.com/2021/08/14/opinions/blunt-truth-what-comes-next-covid-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813171902-covid-texas-camas-escasez-terapia-intensiva-pkg-ed-lavandera-00000730-super-tease.jpg", "publishedAt": "2021-08-14T20:47:06Z", "content": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View mo… [+8065 chars]"}]}