{"status": "ok", "totalResults": 76, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ramishah Maruf, CNN", "title": "'It's too late for me to be afraid:' Why this Russian journalist is staying in the country", "description": "In light of Russia's newly imposed draconian anti-press law, journalists are ceasing to report from inside Russia and many have left the country — including international reporters from outlets such as CNN and The New York Times.", "url": "https://www.cnn.com/2022/03/13/media/yevgenia-albats-reliable-sources/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313133527-russia-journalist-yevgenia-albats-super-tease.jpg", "publishedAt": "2022-03-13T20:32:06Z", "content": "New York (CNN)In light of Russia's newly imposed draconian anti-press law, journalists are ceasing to report from inside Russia and many have left the country including international reporters from o… [+1666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: The 2022 BAFTAs", "description": "The British Academy Film Awards, aka the BAFTAs, were handed out in London on Sunday. The BAFTAs are traditionally considered to be the film industry's last big stop before the Academy Awards.", "url": "https://www.cnn.com/2022/03/13/entertainment/gallery/2022-bafta-awards/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313134957-06-bafta-awards-2022-super-tease.jpg", "publishedAt": "2022-03-13T20:02:06Z", "content": "\"West Side Story\" star Ariana DeBose holds the BAFTA she won for best supporting actress on Sunday, May 13.\r\nUpdated 4:02 PM ET, Sun March 13, 2022\r\n\"West Side Story\" star Ariana DeBose holds the BAF… [+636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Claire Colbert, CNN", "title": "Patrick Mahomes marries high school sweetheart Brittany Matthews", "description": "Kansas City Chiefs quarterback Patrick Mahomes and his longtime girlfriend, Brittany Matthews, have tied the knot in Hawaii, according to posts on the couple's Instagram accounts.", "url": "https://www.cnn.com/2022/03/13/sport/patrick-mahomes-brittany-matthews-married/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313132600-patrick-mahomes-brittany-matthews-married-super-tease.jpg", "publishedAt": "2022-03-13T19:13:03Z", "content": "(CNN)Kansas City Chiefs quarterback Patrick Mahomes and his longtime girlfriend, Brittany Matthews, have tied the knot in Hawaii, according to posts on the couple's Instagram accounts.\r\nMahomes and M… [+889 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen and Holly Yan, CNN", "title": "A 4th dose of Covid-19 vaccine will be needed, Pfizer's CEO says, but the company is working on a shot to handle all variants", "description": "Pfizer is also hoping to make a vaccine that will protect against all variants. \"If we are able to achieve that, then I think it is very easy to follow and remember so that we can go back to really the way (we) used to live,\" th CEO told CBS on Sunday.", "url": "https://www.cnn.com/2022/03/13/health/pfizer-vaccine-4th-dose/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313124602-pfizer-vaccine-4th-dose-super-tease.jpg", "publishedAt": "2022-03-13T19:11:02Z", "content": "(CNN)To help fend off another wave of Covid-19, people will need a fourth dose of vaccine, Pfizer CEO Albert Bourla told CBS on Sunday.\r\n\"Many variants are coming, and Omicron was the first one that … [+2931 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Here's what could lie ahead for the third year of the pandemic", "description": "Things seem to be looking up as the US crosses into year three of the Covid-19 pandemic. Vaccines still do a good job of keeping people alive and out of the hospital. There's increasing access to tests and treatments. The numbers of cases, hospitalizations an…", "url": "https://www.cnn.com/2022/03/13/health/pandemic-year-three-predictions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220301140730-02-discarded-mask-dc-super-tease.jpg", "publishedAt": "2022-03-13T18:14:09Z", "content": "(CNN)Things seem to be looking up as the US crosses into year threeof the Covid-19 pandemic. Vaccines still do a good job of keeping people alive and out of the hospital. There's increasing access to… [+13636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'I'm not afraid': Russian journalist risking jail by staying in her country", "description": "Yevgenia Albats, a journalist in Moscow who is staying in Russia despite a new law that could jail journalists, speaks to CNN's Brian Stelter.", "url": "https://www.cnn.com/videos/media/2022/03/13/russian-journalist-yevgenia-albats-rs-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313125509-yevgenia-albats-russian-journalist-super-tease.jpg", "publishedAt": "2022-03-13T17:10:50Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Mick Krever, Brian Stelter and Lauren Kent, CNN", "title": "US journalist Brent Renaud killed by Russian forces in Ukraine, local police say", "description": "Award-winning American journalist Brent Renaud was killed by Russian forces in the Ukrainian city of Irpin, police in Kyiv said in social media posts on Sunday. Another American journalist was reported wounded.", "url": "https://www.cnn.com/2022/03/13/media/russia-ukraine-brent-renaud-death-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313111357-brent-renaud-file-2015-super-tease.jpg", "publishedAt": "2022-03-13T16:15:44Z", "content": "Kyiv, Ukraine (CNN)Award-winning American journalist Brent Renaud was killed by Russian forces in the Ukrainian city of Irpin, police in Kyiv said in social media posts on Sunday. Another American jo… [+3314 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg and Ella Nilsen, CNN", "title": "An 'excruciating year': Climate activists reset with Biden's agenda on life support", "description": "The story of Washington's failure over the past year to move major climate legislation with Democrats in full control of government is one fraught with slim congressional majorities, rising economic inflation and the breakout of war in Europe. Underlying it a…", "url": "https://www.cnn.com/2022/03/13/politics/biden-climate-agenda-activists/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311143152-climate-activists-white-house-file-super-tease.jpg", "publishedAt": "2022-03-13T16:12:19Z", "content": "(CNN)In a year weighted bydisappointment for the US climate movement, the lowest low of 2021 might have taken place nearly 3,500 miles away in Glasgow, Scotland, where world leaders gathered earlylas… [+14704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Thailand lays out fruit buffet for elephants in national celebration", "description": "Nearly 60 elephants enjoyed a huge fruit banquet at a Thai botanical park on Sunday as the Southeast Asian country marked its annual Elephant Day.", "url": "https://www.cnn.com/travel/article/thailand-elephant-day-national-celebration-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313113448-01-elephant-day-031322-super-tease.jpg", "publishedAt": "2022-03-13T16:02:17Z", "content": "(Reuters) Nearly 60 elephants enjoyed a huge fruit banquet at a Thai botanical park on Sunday as the Southeast Asian country marked its annual Elephant Day.\r\nElephants are a source of national pride … [+1158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Two wildfires in the Florida Panhandle are now 95% contained, forest service says", "description": "Two of three wildfires making up the Chipola Complex Fire in Florida's panhandle are 95% contained, after the trio of blazes scorched more than 34,000 acres, Florida's Forest Service said in a final update on Twitter Saturday.", "url": "https://www.cnn.com/2022/03/13/us/florida-panhandle-wildfires-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313110545-02-florida-wildfire-file-restricted-030922-super-tease.jpg", "publishedAt": "2022-03-13T15:45:34Z", "content": "(CNN)Two of three wildfires making up the Chipola Complex Fire in Florida's panhandle are 95% contained, after the trio of blazes scorched more than 34,000 acres, Florida's Forest Service said in a f… [+1524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Does spirituality belong at the doctor's office?", "description": "Modern medicine's focus on efficiency leaves out the broader view of patients' well-being and their spiritual and religious needs during illness, some doctors say.", "url": "https://www.cnn.com/2022/03/13/health/spirituality-in-medicine-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310171155-bpt101-health-spirituality-in-medicine-wellness-restricted-031022-super-tease.jpg", "publishedAt": "2022-03-13T15:00:49Z", "content": "(CNN)Life's big questions drew Dr. Victoria Sweet to a career in medicine. \"Your job is to deal with birth, suffering and death. It just captivated my imagination,\" said Sweet, now a bestselling auth… [+8463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet, CNN", "title": "Her son 'hated' her when he was a teen. Then a pandemic homecoming changed their relationship forever", "description": "Kerry Stutzman thought her son was coming home for two weeks when the coronavirus began. Two years later, he hasn't left -- and she's grateful. To really understand what her family gained, it's important to talk about what she almost lost.", "url": "https://www.cnn.com/2022/03/13/us/best-in-us-mom-son-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220304125112-04-mother-son-best-of-us-super-tease.jpg", "publishedAt": "2022-03-13T14:05:53Z", "content": "Two years ago, Covid-19 turned the world upside down. While the pandemic is not over, The Best in Us is a series that highlights people whose pandemic stories exemplify the resilience of the human sp… [+8566 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Fossum and Kaitlan Collins, CNN", "title": "Diplomacy: US national security adviser to meet with Chinese counterpart amid Ukraine invasion", "description": "White House national security adviser Jake Sullivan will meet with his Chinese counterpart, Yang Jiechi, in Rome on Monday as part of a follow-up conversation to President Joe Biden and Chinese President Xi Jinping's virtual meeting last November, according t…", "url": "https://www.cnn.com/2022/03/13/politics/jake-sullivan-meeting-chinese-counterpart-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312194008-jake-sullivan-meeting-chinese-counterpart-ukraine-super-tease.jpg", "publishedAt": "2022-03-13T14:02:35Z", "content": "Washington, DC (CNN)White House national security adviser Jake Sullivan will meet with his Chinese counterpart, Yang Jiechi, in Rome on Monday as part of a follow-up conversation to President Joe Bid… [+4458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "How this musician made beauty in isolation", "description": "Two years after his second project, the critically acclaimed \"Care For Me,\" rapper Saba was ready to release his third full-length album -- but the pandemic changed his plans and resulted in taking a more creative approach.", "url": "https://www.cnn.com/2022/03/13/entertainment/best-in-us-saba-few-good-things-pandemic-music-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308142105-01-saba-few-good-things-pandemic-super-tease.jpg", "publishedAt": "2022-03-13T13:55:52Z", "content": "Two years ago, Covid-19 turned the world upside down. While the pandemic is not over, The Best in Us is a series that highlights people whose pandemic stories exemplify the resilience of the human sp… [+5080 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Text by AJ Willingham; illustrations by Leanza Abucayan, CNN", "title": "Inside the magical world of Disney super runners", "description": "RunDisney races attract thousands to Disney parks throughout the year. Many of the runners have participated in dozens of races -- what keeps them going?", "url": "https://www.cnn.com/2022/03/13/us/rundisney-marathon-runners-disney-world-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311112640-20220311-rundisney-super-tease.jpg", "publishedAt": "2022-03-13T13:49:30Z", "content": "(CNN)The sun won't rise for hours in Celebration, Florida, but the party is already in full swing. Is it too early for bone-rattling cardio beats or a \"We Don't Talk About Bruno\" singalong? Objective… [+11287 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sara Goudarzi", "title": "As a child of war, I know what the Ukrainians are going through", "description": "In the early morning of February 24 in New York, hours after Russia started firing missiles near Kyiv, a tweet from The Economist read \"In parts of Ukraine, people woke to the sound of sirens and took to their basements; elsewhere some knelt on the streets to…", "url": "https://www.cnn.com/2022/03/13/opinions/children-of-war-in-ukraine-goudarzi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220302183115-16-ukraine-0302-super-tease.jpg", "publishedAt": "2022-03-13T13:31:45Z", "content": "Sara Goudarzi is a Brooklyn-based writer whose work has appeared in The New York Times and Scientific American, among others. Her debut novel, \"The Almond in the Apricot,\" is out now. The views expre… [+4921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "Start your week smart: Ukraine, Gas Prices, Saudi Executions, Winter Weather, Cristiano Rinaldo", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2022/03/13/us/five-things-march-13-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312132014-04-ukraine-0312-kyiv-super-tease.jpg", "publishedAt": "2022-03-13T13:02:29Z", "content": "If you're reading this right after waking up this morning, you've already lost an hour of your day. But don't be alarmed. The clock on your cell phone automatically sprang forward while you were asle… [+5211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Claire Colbert and Keith Allen, CNN", "title": "Soldier dies during training exercise at Fort Irwin", "description": "A 23-year-old soldier died Thursday in a training incident at Fort Irwin, California, the Army announced Saturday. Specialist Joseph M. Meitl, Jr., served as an armored cannon crewmember in the 1st Cavalry Division, based at Fort Hood, Texas.", "url": "https://www.cnn.com/2022/03/13/us/fort-irwin-training-exercise-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313081909-fort-irwin-training-exercise-death-super-tease.jpg", "publishedAt": "2022-03-13T12:43:05Z", "content": "(CNN)A 23-year-old soldier died Thursday in a training incident at Fort Irwin, California, the Army announced Saturday. Specialist Joseph M. Meitl, Jr., served as an armored cannon crewmember in the … [+593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maya Brown, CNN", "title": "'Alzheimer's disease is the only illness where the person passes away twice.' Latino caregivers say they're facing more barriers", "description": "Sarah Rodriguez spends most of her day multitasking as she switches from watching her mother on remote cameras to talking on video and phone calls with doctors and aides to organize proper care for the 67-year-old. The 40-year-old's life in Virginia has been …", "url": "https://www.cnn.com/2022/03/13/us/latinos-alzheimers-disparities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311144356-01-latinos-alzheimers-disparities-super-tease.jpg", "publishedAt": "2022-03-13T12:33:04Z", "content": "(CNN)Sarah Rodriguez spends most of her day multitasking as she switches from watching her mother on remote cameras to talking on video and phone calls with doctors and aides to organize proper care … [+10457 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "Katt Williams abruptly ends Nashville show because of bomb threat, venue says", "description": "Comedian Katt Williams ended his show in Nashville, Tennessee, early Saturday night because of a bomb threat, according to a statement from the Nashville Municipal Auditorium, where Williams was performing.", "url": "https://www.cnn.com/2022/03/13/us/katt-williams-bomb-threat-nashville/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313080300-katt-williams-2021-file-super-tease.jpg", "publishedAt": "2022-03-13T12:21:21Z", "content": "(CNN)Comedian Katt Williams ended his show in Nashville, Tennessee, early Saturday night because of a bomb threat, according to a statement from the Nashville Municipal Auditorium, where Williams was… [+501 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "More than 2.5 million Ukrainians have fled their country since Russia's invasion. Here's where they are now", "description": "In the span of just two weeks, millions of Ukrainian refugees have been forced to flee as the brutal Russian invasion of their homeland continues.", "url": "https://www.cnn.com/2022/03/13/world/ukraine-refugee-crisis-countries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311032834-ukraine-poland-refugees-03102022-super-tease.jpg", "publishedAt": "2022-03-13T12:15:23Z", "content": "(CNN)In thespan of just two weeks, millions of Ukrainian refugees have been forced to flee as the brutal Russian invasion of their homeland continues.\r\nThe amount of people on the move constitutes \"t… [+6371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Opinion: Putin's bombs aren't weakening Ukraine's resolve to fight", "description": "Hospitals, schools and apartment buildings were wrecked, as the civilian death toll mounted. Yet there's no sign the carnage is weakening Ukraine's resolve to fight. Studies of earlier air wars suggest they can strengthen resistance to an attacker.", "url": "https://www.cnn.com/2022/03/13/opinions/putin-bombs-and-ukraine-resists-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311031722-mariupol-ukraine-street-031022-super-tease.jpg", "publishedAt": "2022-03-13T12:04:42Z", "content": "Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)In 2011, three American researchers revea… [+17990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian, CNN", "title": "Two people shot, one fatally, while sleeping on New York City streets Saturday, police say", "description": "An armed suspect opened fire Saturday on two apparently homeless people who were sleeping on the streets of New York City, killing one and wounding the other, police said.", "url": "https://www.cnn.com/2022/03/13/us/new-york-city-homeless-shootings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313013513-02-new-york-homeless-shootings-0312-super-tease.jpeg", "publishedAt": "2022-03-13T10:12:29Z", "content": "(CNN)An armed suspect opened fire Saturday on two apparently homeless people who were sleeping on the streets of New York City, killing one and wounding the other, police said. \r\nThe shootings happen… [+2531 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Fall asleep faster with mental tricks that calm your racing mind", "description": "Use these relaxation tools to calm your racing mind and get to sleep -- or back to sleep if you wake in the night. Good news: The more you practice, the quicker sleep arrives.", "url": "https://www.cnn.com/2022/03/13/health/mental-tricks-for-sleep-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726175024-trouble-sleeping-stock-super-tease.jpg", "publishedAt": "2022-03-13T09:01:10Z", "content": "Sleep Awareness Week is March 13-19, and CNN's Life, But Better Sleep section will have daily tips and facts you need to get a better night's slumber. Join us!\r\n (CNN)You're exhausted, your body yawn… [+6178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "As winter storm exits the East, strong winds and blistering cold temperatures remain", "description": "A winter storm will continue to deliver strong winds and blistering freezing temperatures as it exits the eastern region Sunday after dumping heavy snow across parts of New England.", "url": "https://www.cnn.com/2022/03/13/weather/winter-storm-freeze-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313013514-late-season-winter-storm-pennsylvania-031222-super-tease.jpg", "publishedAt": "2022-03-13T08:47:04Z", "content": "(CNN)A winter storm will continue to deliver strong winds and blistering freezing temperatures as it exits the eastern region Sunday after dumping heavy snow across parts of New England. \r\nMore than … [+3214 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Stanford soccer star's death renews questions about student-athletes' mental health. The pressures they face present distinct challenges, experts say", "description": "After confirming her 22-year-old daughter Katie Meyer had died days earlier by suicide, Gina Meyer wondered aloud this month if the star goalkeeper for Stanford University's women's soccer team might have been overwhelmed by the pressure of sports and academi…", "url": "https://www.cnn.com/2022/03/13/us/student-athlete-mental-health-challenges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309130040-02-stanford-student-athlete-death-katie-meyer-restricted-super-tease.jpg", "publishedAt": "2022-03-13T08:02:16Z", "content": "If you or a loved one have contemplated suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 (TALK) or text HOME to 741741 to reach the Crisis Text Line. The International Associa… [+9712 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Mohammed Tawfeeq and Simone McCarthy, CNN", "title": "Russia threatens US over weapons deliveries as its forces strike targets in western Ukraine", "description": "Russia has raised the risk of further escalation with NATO powers, warning it will treat arms shipments to Ukraine as \"legitimate targets\" for military action as its forces start to expand their offensive near the northwestern city of Lviv.", "url": "https://www.cnn.com/2022/03/13/europe/russia-invasion-ukraine-03-13-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312132014-04-ukraine-0312-kyiv-super-tease.jpg", "publishedAt": "2022-03-13T07:49:02Z", "content": "Kyiv and Lviv, Ukraine (CNN)Russia has raised the risk of further escalation with NATO powers, warning it will treat arms shipments to Ukraine as \"legitimate targets\" for military action as its force… [+5213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "Fact Check: 5 times official Russian statements conflicted with intelligence and on the ground actions", "description": "As its troops fight on the ground in Ukraine, Russia is waging a parallel war of misinformation. Even before Russian forces crossed the border, Russian officials were crafting a narrative at odds with reality. Publicly claiming one thing while intelligence su…", "url": "https://www.cnn.com/2022/03/13/politics/fact-check-russia-misinformation-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309225232-01-mariupol-ukraine-030922-super-tease.jpg", "publishedAt": "2022-03-13T07:02:35Z", "content": "(CNN)As its troops fight on the ground in Ukraine, Russia is waging a parallel war of misinformation. Even before Russian forces crossed the border, Russian officials were crafting a narrative at odd… [+5522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Pakistan demands joint probe into 'accidental' missile fired by India", "description": "Pakistan on Saturday demanded a joint probe into a missile India said it accidentally fired into its territory, rejecting New Delhi's decision to hold an internal inquiry into the incident and calling on the international community to play a role.", "url": "https://www.cnn.com/2022/03/13/asia/pakistan-probe-india-missile-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311194255-india-pakistan-missile-03092022-handout-super-tease.jpg", "publishedAt": "2022-03-13T06:48:44Z", "content": "Pakistan on Saturday demanded a joint probe into a missile India said it accidentally fired into its territory, rejecting New Delhi's decision to hold an internal inquiry into the incident and callin… [+1593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and <a href=\"/profiles/steve-george\">Steve George</a>, CNN", "title": "Russia invades Ukraine", "description": "Russian forces inch toward the Ukrainian capital, with intensified fighting to the northeast and east of the city. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-03-13-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312111319-01-ukraine-0312-kyiv-super-tease.jpg", "publishedAt": "2022-03-13T05:03:07Z", "content": "Russian troops are moving closer to Kyiv and significant destruction is being seen in cities and towns as Moscow continues with its bombardment of Ukraine. Multiple explosions were heard by CNN teams… [+3026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Russian state TV: Commentator criticizes Putin's invasion on state-run channel", "description": "Karen Shakhnazarov, a Russian filmmaker, criticized Russia's invasion into Ukraine on the state-owned channel Russia 1.", "url": "https://www.cnn.com/videos/media/2022/03/13/ukraine-russia-state-tv-karen-shakhnazarov-ebof-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312223806-karen-shakhnazarov-russia-state-tv-split-super-tease.jpg", "publishedAt": "2022-03-13T03:49:06Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Ammon Bundy was arrested for trespassing at a hospital after a protest about a child", "description": "Ammon Bundy, the rancher who gained national attention for leading the armed occupation of federal land in Oregon, was arrested for trespassing at an Idaho hospital, police said Saturday.", "url": "https://www.cnn.com/2022/03/12/us/ammon-bundy-arrested-trespassing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312202358-01-ammon-bundy-arrested-trespassing-super-tease.jpg", "publishedAt": "2022-03-13T02:21:10Z", "content": "(CNN)Ammon Bundy, the rancher who gained national attention for leading the armed occupation of federal land in Oregon, was arrested for trespassing at an Idaho hospital, police said Saturday.\r\nThe i… [+1099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mayumi Maruyama, CNN", "title": "Tato and Mama gave me a home in Ukraine. Now they're under attack", "description": "They're not my parents, but after two years of living in Ukraine, they grew to become my Tato and Mama -- Ukrainian for \"mom\" and \"dad.\"", "url": "https://www.cnn.com/2022/03/12/europe/ukraine-chernihiv-tato-mama-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310025501-row-of-houses-maruyama-super-tease.jpg", "publishedAt": "2022-03-13T00:38:01Z", "content": "(CNN)They're not my parents, but after two years of living in Ukraine, they grew to become my Tato and Mama -- Ukrainian for \"mom\" and \"dad.\" \r\nFive years ago, they welcomed me into their home like a… [+7084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "'They got what they ordered, right?': Democrats search for a midterm message at party gatherings", "description": "At gatherings in Washington and Philadelphia this week, President Joe Biden sought to rally Democrats around a midterm message that the party has delivered on its domestic promises. What Democrats need to do, he and other party brass argued, is make sure Amer…", "url": "https://www.cnn.com/2022/03/12/politics/democrats-midterms-message-2022-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312130111-democrats-midterms-message-2022-super-tease.jpg", "publishedAt": "2022-03-13T00:28:47Z", "content": "(CNN)At gatherings in Washington and Philadelphia this week, President Joe Biden sought to rally Democrats around a midterm message that the party has delivered on its domestic promises. What Democra… [+8365 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Edward J. Markey and Marco Rubio", "title": "It's time to end the \"spring forward\" and \"fall back\" tired tradition", "description": "This weekend, Americans will change their clocks and lose an hour of sleep, all because of a senseless and outdated government policy. Changing between daylight saving time and standard time isn't just an inconvenience to people everywhere — it has real reper…", "url": "https://www.cnn.com/2022/03/12/opinions/daylight-saving-time-legislation-markey-rubio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/151030082334-daylight-saving-time-clock-super-tease.jpg", "publishedAt": "2022-03-13T00:18:40Z", "content": "Senator Edward J. Markey is the junior senator from the Commonwealth of Massachusetts. Senator Marco Rubio is the senior senator from Florida. The views expressed in this commentary are their own. Re… [+3415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ramishah Maruf", "title": "CVS removes managers after harassment allegations", "description": "CVS CEO Karen Lynch removed a regional manager and several employees after a harassment allegation was not treated seriously, the company said in a statement sent to CNN Business Friday.", "url": "https://www.cnn.com/2022/03/12/business/cvs-karen-lynch-sexual-harassment/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220312110408-cvs-store-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T23:40:34Z", "content": "CVS CEO Karen Lynch removed a regional manager and several employees after a harassment allegation was not treated seriously, the company said in a statement sent to CNN Business Friday. \r\nAt the end… [+1729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "A Kansas teacher is suing school officials for requiring her to address students by their preferred names, saying the policy violates her religious freedom", "description": "A Kansas teacher is suing her school district superintendent, board members and principal after being suspended for not using a student's preferred name.", "url": "https://www.cnn.com/2022/03/12/us/kansas-teacher-sues-pronouns-religion-transgender/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311160115-fort-riley-middle-school-restricted-super-tease.jpg", "publishedAt": "2022-03-12T22:07:04Z", "content": "(CNN)A Kansas teacher is suing her school district superintendent, board members and principal after being suspended for not using a student's preferred name. \r\nPamela Ricard, who teaches math at For… [+8361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Vargas Jones, Chloe Melas and Paul Vercammen, CNN", "title": "Alec Baldwin pointed gun 'against all rules and common sense,' movie armorer says", "description": "The armorer on the set of the film \"Rust\" said she was not called to inspect the gun that ultimately fired a live round,  fatally wounding cinematographer Halyna Hutchins.", "url": "https://www.cnn.com/2022/03/12/entertainment/alec-baldwin-rust-lawsuit-hannah-gutierrez-reed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220306105853-alec-baldwin-file-120921-super-tease.jpg", "publishedAt": "2022-03-12T21:25:57Z", "content": "(CNN)The armorer on the set of the film \"Rust\" said she was not called to inspect the gun that ultimately fired a live round, fatally wounding cinematographer Halyna Hutchins.\r\nArmorer Hannah Gutierr… [+4334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Patricia Nez Henderson and Catherine Saucedo", "title": "What happened when smoking was banned in American Indian casinos", "description": "American Indian tribes are joining the effort across the nation to ban smoking in casinos, write Patricia Nez Henderson and Catherine Saucedo. Smoke-free casinos are feasible and profitable.", "url": "https://www.cnn.com/2022/03/12/opinions/american-indian-casinos-smoking-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309174217-winstar-world-casino-super-tease.jpg", "publishedAt": "2022-03-12T19:39:53Z", "content": "Patricia Nez Henderson, M.D., MPH, vice president of the Black Hills Center for American Indian Health, is Diné (a citizen of the Navajo Nation) and an authority on commercial tobacco control in Amer… [+5979 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Nickeas, CNN", "title": "'Rudderless' city government faulted for Minneapolis protest response after George Floyd's murder", "description": "An outside review of Minneapolis' response to protests in the spring of 2020, following the murder of George Floyd by a city police officer, found widespread chaos and poor communication among city leaders that contributed to an unorganized police response to…", "url": "https://www.cnn.com/2022/03/12/us/minneapolis-protest-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311153155-01-minneapolis-floyd-protests-2020-super-tease.jpg", "publishedAt": "2022-03-12T19:20:38Z", "content": "(CNN)An outside review of Minneapolis' response to protests in the spring of 2020, following the murder of George Floyd by a city police officer, found widespread chaos and poor communication among c… [+11251 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jay Croft, CNN", "title": "Singer Traci Braxton of 'Family Values' dies at 50", "description": "Singer Traci Braxton, who appeared on the WE TV reality series \"Braxton Family Values\" with her sisters, including Grammy-winner Toni, died Friday at 50, the network said.", "url": "https://www.cnn.com/2022/03/12/entertainment/traci-braxton-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312105849-01-traci-braxton-restricted-super-tease.jpg", "publishedAt": "2022-03-12T17:53:59Z", "content": "(CNN)Singer Traci Braxton, who appeared on the WE TV reality series \"Braxton Family Values\" with her sisters, including Grammy-winner Toni, died Friday at 50, the network said.\r\nThis is a developing … [+25 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Olga Voitovych and Tara John, CNN", "title": "Russia intensifies strikes around Kyiv as it warns US against arming Ukraine", "description": "The Russian assault across Ukraine raged Saturday as explosions were heard in Kyiv and fighting intensified around the capital. Hours later, Russia warned the United States that it would fire on weapon shipments to Ukraine, raising the risk of direct confront…", "url": "https://www.cnn.com/2022/03/12/europe/russia-invasion-ukraine-03-12-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312064613-01-ukraine-0312-kyiv-super-tease.jpg", "publishedAt": "2022-03-12T17:42:16Z", "content": "Kyiv, Ukraine (CNN)The Russian assault across Ukraine raged Saturday as explosions were heard in Kyiv and fighting intensified around the capital. Hours later, Russia warned the United States that it… [+7543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Saudi Arabia executes 81 men in one day, the biggest mass execution in decades", "description": "Saudi Arabia executed 81 men on Saturday, including seven Yemenis and one Syrian, for terrorism and other offenses including holding \"deviant beliefs,\" authorities said, in the biggest mass execution in decades.", "url": "https://www.cnn.com/2022/03/12/middleeast/saudi-arabia-mass-execution-terrorism-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190513132817-saudi-arabia-flag-super-tease.jpg", "publishedAt": "2022-03-12T17:40:42Z", "content": "(Reuters)Saudi Arabia executed 81 men on Saturday, including seven Yemenis and one Syrian, for terrorism and other offenses including holding \"deviant beliefs,\" authorities said, in the biggest mass … [+1571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Outside firm to review Louisiana State Police after death of Ronald Greene", "description": "The Louisiana State Police has hired an outside consultant to conduct a \"comprehensive top-to-bottom assessment\" of the agency following the 2019 death of Ronald Greene while in the custody.", "url": "https://www.cnn.com/2022/03/12/us/ronald-greene-louisiana-state-police-independent-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201002191528-02-ronald-greene-super-tease.jpg", "publishedAt": "2022-03-12T17:13:24Z", "content": "(CNN)The Louisiana State Police has hired an outside consultant to conduct a \"comprehensive top-to-bottom assessment\" of the agency following the 2019 death of Ronald Greene while in the custody. \r\nT… [+1053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Russia's cyber offensive against Ukraine has been limited so far. Experts are divided on why", "description": "US officials warned that a wave of debilitating cyberattacks could accompany Russia's war on Ukraine. So far they haven't materialized, and US and Ukrainian officials are contemplating why as they prepare for the next phase of the war.", "url": "https://www.cnn.com/2022/03/12/europe/russia-ukraine-war-cyber-attacks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310132215-putin-meeting-0310-super-tease.jpg", "publishedAt": "2022-03-12T17:04:26Z", "content": "(CNN)US officials warned that a wave of debilitating cyberattacks could accompany Russia's war on Ukraine. So far they haven't materialized, and US and Ukrainian officials are contemplating why as th… [+6960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock", "title": "Bismack Biyombo to donate full NBA salary form this season to build hospital in DR Congo and honor late father", "description": "Bismack Biyombo will donate his NBA seasonal salary to build a hospital in his native Democratic Republic of the Congo (DRC) and honor his late father, the Phoenix Suns star said Friday.\nThe 29-year-old returned to the NBA in January, signing a contract for t…", "url": "https://www.cnn.com/2022/03/12/sport/bismack-biyombo-salary-hospital-congo-father-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220312101309-01-bismack-biyombo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T16:51:54Z", "content": "Bismack Biyombo will donate his NBA seasonal salary to build a hospital in his native Democratic Republic of the Congo (DRC) and honor his late father, the Phoenix Suns star said Friday.The 29-year-o… [+2708 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Acclaimed filmmaker Spike Lee", "description": "The Directors Guild of America is honoring Spike Lee this weekend during its annual awards show. The 64-year-old will become the first Black director to receive the guild's lifetime achievement award.", "url": "https://www.cnn.com/2022/03/12/entertainment/gallery/spike-lee-career/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312052517-01-splke-lee-gallery-super-tease.jpg", "publishedAt": "2022-03-12T16:27:31Z", "content": "Film director Spike Lee poses for a portrait during the Sundance Film Festival in 2012.\r\nUpdated 11:27 AM ET, Sat March 12, 2022\r\nFilm director Spike Lee poses for a portrait during the Sundance Film… [+1085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kirsten Powers, CNN Senior Political Analyst", "title": "Biden should ignore the lawmakers beating the drum of war", "description": "It's imperative that Biden acts cautiously to avoid escalating the conflict -- even if that means facing criticism here at home, writes Kirsten Powers.", "url": "https://www.cnn.com/2022/03/12/opinions/biden-should-ignore-lawmakers-beating-drum-of-war-powers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311150137-03-biden-0311-super-tease.jpg", "publishedAt": "2022-03-12T16:05:03Z", "content": "Kirsten Powers is a CNN senior political analyst and New York Times bestselling author of \"Saving Grace: Speak Your Truth, Stay Centered and Learn to Coexist with People Who Drive You Nuts.\" Follow h… [+5100 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jay Croft", "title": "Now, that's just icky: Border agents seize boxes of blood-sucking leeches", "description": "Customs and Border Protection officers in Philadelphia recently made a series of slimy discoveries -- some 300 leeches sent from Bulgaria and bound for points across the US.", "url": "https://www.cnn.com/2022/03/12/us/blood-sucking-leeches-seized-philadelphia-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220312093659-customs-leaches-trnd.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T15:56:41Z", "content": "Customs and Border Protection officers in Philadelphia recently made a series of slimy discoveries some 300 leeches sent from Bulgaria and bound for points across the US.\r\nThe bloodsuckers were buste… [+1367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "Russian internet users are learning how to beat Putin's internet crackdown", "description": "A digital Iron Curtain may be descending on Russia, as President Vladimir Putin struggles to control the narrative about his war in Ukraine. The Kremlin has already moved to block Facebook and Twitter, and its latest step in that direction came Friday as the …", "url": "https://www.cnn.com/2022/03/12/tech/russia-internet-censorship-circumvention/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311173418-signal-app-file-restricted-super-tease.jpg", "publishedAt": "2022-03-12T15:11:14Z", "content": "(CNN Business)A digital Iron Curtain may be descending on Russia, as President Vladimir Putin struggles to control the narrative about his war in Ukraine. The Kremlin has already moved to block Faceb… [+8177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianne Pepitone", "title": "Why are US gas prices soaring when America barely uses Russian oil?", "description": "There's pain at the pump for American drivers as US gas prices soar to record highs.", "url": "https://www.cnn.com/2022/03/12/energy/us-gas-prices-russia-oil/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311123049-gas-prices-new-york-0308.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T15:09:38Z", "content": "Theres pain at the pump for American drivers as US gas prices soar to record highs. \r\nAlthough the United States barely uses Russian oil, Russias invasion of Ukraine is still a big factor in the gas-… [+5399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brynn Gingras, Faith Karimi", "title": "She'd just celebrated her baby shower in Ukraine. Hours later, she was fleeing bombs", "description": "Hours before Russia started bombarding Ukraine, Olesya Ostafieva's family and friends had thrown her a surprise baby shower in the capital of Kyiv.", "url": "https://www.cnn.com/2022/03/12/us/pregnant-woman-flees-ukraine-new-york-city/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311215407-03-olesya-ostafieva.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T14:58:21Z", "content": "Hours before Russia started bombarding Ukraine, Olesya Ostafievas family and friends had thrown her a surprise baby shower in the capital of Kyiv. \r\nHeart-shaped pink and white balloons floated aroun… [+3992 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Musa, CNN", "title": "A 32-year-old man is accused of killing couple in Daytona Beach", "description": "A 32-year-old man has been charged with two counts of first-degree murder for the deaths of a couple last weekend in Daytona Beach, Florida, police said.", "url": "https://www.cnn.com/2022/03/12/us/daytona-beach-couple-murders-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312083959-jean-macean-mugshot-super-tease.jpg", "publishedAt": "2022-03-12T14:49:17Z", "content": "(CNN)A 32-year-old man has been charged with two counts of first-degree murder for the deaths of a couple last weekend in Daytona Beach, Florida, police said. \r\nJean R. Macean is accused of killing T… [+1123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Sinclair Scott, CNN", "title": "Paris Fashion Week: How luxury fashion responded to the war on Ukraine", "description": "A week of fashion shows in the French capital, against the backdrop of a full-scale crisis in Europe, saw symbolic gestures, quieter moments of reflection and pledges of financial support from a number of houses.", "url": "https://www.cnn.com/style/article/paris-fashion-week-highlights-fw-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311094956-16-paris-fashion-week-2022-highlights-super-tease.jpg", "publishedAt": "2022-03-12T14:11:48Z", "content": "Paris Fashion Week: How luxury fashion responded to the war on Ukraine \r\nA week of fashion shows in the French capital, against the backdrop of a full-scale crisis in Europe, saw symbolic gestures, q… [+12040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "A grieving surfer is taking hundreds of strangers' late loved ones for one last ride", "description": "In the midst of his own grief following the death of his father, surfer Dan Fischer started the One Last Wave project, through which he found a community of people going through similar pain amid the coronavirus pandemic.", "url": "https://www.cnn.com/2022/03/12/us/best-in-us-surfer-one-last-wave-dan-fischer-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220211153210-05-one-last-wave-project-super-tease.jpg", "publishedAt": "2022-03-12T14:09:21Z", "content": "Two years ago, Covid-19 turned the world upside down. While the pandemic is not over, The Best in Us is a series that highlights people whose pandemic stories exemplify the resilience of the human sp… [+6846 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catarina Buchatskiy", "title": "I never considered the importance of my Ukrainian identity -- until now", "description": "Catarina Buchatskiy, a Ukrainian student, writes about taking a leave of absence from Stanford University to fly to Poland and assist in humanitarian efforts. After Vladimir Putin invaded Ukraine, she says, \"None of my life back on campus seemed to matter any…", "url": "https://www.cnn.com/2022/03/12/opinions/ukrainian-identity-russia-invasion-buchatskiy/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/191007053455-03-ukraine-protest-1006.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T14:07:20Z", "content": "Editors Note: Catarina Buchatskiy is a student of international relations, with a focus on security, at Stanford University. She is also the co-founder of The Shadows Project, a Ukrainian cultural or… [+5895 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN Reporter, Crime and Justice", "title": "The 4 pillars to convicting alleged January 6 US Capitol rioters", "description": "Trials are already scheduled in the DC District Court through the end of the year, including for the far-right Oath Keepers charged with seditious conspiracy.", "url": "https://www.cnn.com/2022/03/12/politics/capitol-riot-prosecutions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216161019-01-capitol-riot-jan-6-super-tease.jpg", "publishedAt": "2022-03-12T14:05:40Z", "content": "(CNN)Federal prosecutors walked out of court this week with new confidence -- that a Washington, DC, jury would be willing to convict participants in the January 6 US Capitol attack for serious crime… [+9409 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Walgreens replaced some fridge doors with screens. And some shoppers absolutely hate it", "description": "Walgreens and other retailers have swapped out the clear fridge and freezer doors at thousands of stores, instead adding opaque doors with iPad-like screens showing what's inside. Some customers really, really aren't into it.", "url": "https://www.cnn.com/2022/03/12/business/walgreens-freezer-screens/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223125659-walgreens-store-0413-file-restricted-super-tease.jpg", "publishedAt": "2022-03-12T13:02:13Z", "content": "New York (CNN Business)Walgreens and other retailers have swapped out the clear fridge and freezer doors at thousands of stores, instead adding opaque doors with iPad-like screens showing what's insi… [+6152 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten, CNN", "title": "The Daylight Saving Time debate is nothing to lose sleep over", "description": "Daylight Saving Time begins Sunday. Here are five key facts that you should know about how we tell time.", "url": "https://www.cnn.com/2022/03/12/health/daylight-saving-time-2022-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310153222-daylight-saving-stock-super-tease.jpg", "publishedAt": "2022-03-12T12:10:11Z", "content": "Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\n (CNN)My least favorite weekend of the year is upon us. It's the weekend in which… [+7320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Chen and Aya Elamroussi, CNN", "title": "A community in mourning will gather Saturday to honor Katie Meyer, the Stanford star soccer player who died by suicide", "description": "Friends and loved ones of Stanford University star soccer player Katie Meyer, who died by suicide earlier this month, will pay their respects at a memorial service on Saturday.", "url": "https://www.cnn.com/2022/03/12/us/katie-meyer-memorial-service/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220312042053-katie-meyer-2019-file-restricted-super-tease.jpg", "publishedAt": "2022-03-12T12:07:54Z", "content": "If you or a loved one have contemplated suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text TALK to 741741. The International Association for Suicide Prevention and Befri… [+2926 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Russia's Investigative Committee opened up a criminal case against the company, alleging that it had engaged in \"extremist activities\" and could be guilty of providing \"assistance to terrorist activities.\" Those wild accusations were because of a temporary ex…", "url": "https://view.newsletters.cnn.com/messages/1647058452060b999feb23082/raw", "urlToImage": null, "publishedAt": "2022-03-12T12:05:01Z", "content": "The war between Russia and Meta sharply escalated on Friday. \r\nRussia's Investigative Committeeopened up a criminal case against the company, alleging that it had engaged in \"extremist activities\" an… [+3703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: How a false story about Leonardo DiCaprio donating $10 million to Ukraine spread around the world", "description": "A false story that actor Leonardo DiCaprio made a $10 million donation to Ukraine was repeated this week by media outlets around the world and shared by tens of thousands of people on social media.", "url": "https://www.cnn.com/2022/03/12/politics/fact-check-dicaprio-donation-10-million-ukraine/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220109065639-leonardo-dicaprio-2021-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T11:03:07Z", "content": "A false story that actor Leonardo DiCaprio made a $10 million donation to Ukraine was repeated this week by media outlets around the world and shared by tens of thousands of people on social media. \r… [+6939 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Shipwreck discoveries and a crowdfunded country: Travel news this week", "description": "From CNN Travel: Two century-old shipwrecks have been found in Antarctica and Lake Superior, plus we meet the people who crowdfunded the purchase of a Caribbean island to start their own country.", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-shipwrecks-micronations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220222164224-malaysia-travel-file-2021-super-tease.jpg", "publishedAt": "2022-03-12T09:53:53Z", "content": "Keen to make up for lost time? CNN Travel is here with our weekly roundup of news and inspiration. \r\nIt's been a good month for shipwreck hunters. \r\nPolar explorer Ernest Shackleton's ship HMS Endura… [+4004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barry Neild, CNN", "title": "The incredible story behind Shackleton's Endurance shipwreck", "description": "The discovery, after 107 years, of Ernest Shackleton's sunken ice breaker Endurance lying almost intact in the deep, icy waters of Antarctica is only the latest chapter in a gripping tale of perseverance, heroism and survival that has echoed down the decades …", "url": "https://www.cnn.com/travel/article/story-behind-shackleton-endurance-shipwreck/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311124734-endurancecrop-super-tease.jpg", "publishedAt": "2022-03-12T09:44:08Z", "content": "Barry Neild, CNNPublished 12th March 2022\r\n(CNN) Sometimes shipwrecks contain sunken treasure, cargoes of gold or jewelry that tempt bounty hunters to risk treacherous seas in pursuit of lucrative re… [+9703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet, CNN", "title": "What could be next for Brittney Griner", "description": "There are many details we still don't know about WNBA star Brittney Griner's recent arrest in Russia. But there's a lot we can learn from the experiences of Americans who were arrested there in the past.", "url": "https://www.cnn.com/2022/03/12/us/brittney-griner-detained-americans-history/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309185057-03-brittney-griner-russia-americans-detained-history-super-tease.jpg", "publishedAt": "2022-03-12T09:07:23Z", "content": "(CNN)There are many details we still don't know about WNBA star Brittney Griner's arrest in Russia. But there's a lot we can learn from the experiences of Americans who were detained there in the pas… [+10075 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "What the cratering ruble means for crypto and the future of money", "description": "The isolation of Russia by much of the world economy may or may not convince Vladimir Putin to recall his invading troops from Ukraine (probably not).", "url": "https://www.cnn.com/2022/03/12/politics/russia-ruble-bitcoin-crypto-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220222092211-bitcoin.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T08:03:06Z", "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nThe isolation of Russia by much of the world economy may or may not convince Vladimi… [+8622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Ward and Derrick Hinds, CNN", "title": "Cold blast brings deep freeze to the South, snow to the Northeast", "description": "A lobe of frigid air will sag deeply into the US, bringing freezing temperatures as far south as Florida while severe thunderstorms roll up the Mid-Atlantic and heavy snow hits parts of the Northeast.", "url": "https://www.cnn.com/2022/03/12/weather/winter-storm-freeze-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311164334-weather-freeze-warnings-031122-super-tease.jpg", "publishedAt": "2022-03-12T06:32:56Z", "content": "(CNN)A lobe of frigid air will sag deeply into the US, bringing freezing temperatures as far south as Florida while severe thunderstorms roll up the Mid-Atlantic and heavy snow hits parts of the Nort… [+4627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "Russia invades Ukraine", "description": "Russian forces are expanding their offensive in Ukraine to the west for the first time. Major cities, including Dnipro and Lutsk, were struck Friday, Ukrainian officials said, as fighting intensified closer to Kyiv. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-03-12-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311133414-03-ukraine-0311-super-tease.jpg", "publishedAt": "2022-03-12T05:03:20Z", "content": "Ukrainian authorities reported limited success in securing the evacuation of Ukrainian civilians from the worst affected areas Friday.\r\nAround Kyiv, volunteers and local authorities were able to help… [+2049 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Qiblawi, Mohammed Tawfeeq and Olga Voitovych, CNN", "title": "'Please stay strong.' For loved ones ripped apart by war in Ukraine, phone messages bring hope and despair", "description": "The separation and fracturing of families underpins many of the stories of displacement in Ukraine, where Russia's brutal attempts to wrest control of territory in the country's east, south and center has leveled entire neighborhoods.", "url": "https://www.cnn.com/2022/03/12/europe/ukraine-invasion-friends-family-separated-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311151649-20220311-ukraine-lviv-stories-group-illustration-super-tease.jpg", "publishedAt": "2022-03-12T05:03:08Z", "content": "By Tamara Qiblawi, Mohammed Tawfeeq and Olga Voitovych, CNN\r\nUpdated 12:03 AM ET, Sat March 12, 2022\r\nLviv, Ukraine In the midst of a days-long, chaotic cross-country train ride to the northwestern c… [+11248 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris", "title": "An Ohio grand jury declined to indict officer who fatally shot Ma'Khia Bryant, state AG says", "description": "A Franklin County, Ohio, jury declined to indict the police officer who fatally shot Ma'Khia Bryant, a Black teenager, last April, state Attorney General Dave Yost said in a news release Friday.", "url": "https://www.cnn.com/2022/03/11/us/makhia-bryant-columbus-officer-not-indicted/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210422153937-01-makhia-bryant-super-tease.jpg", "publishedAt": "2022-03-12T03:21:08Z", "content": "(CNN)A Franklin County, Ohio, jury declined to indict the police officer who fatally shot Ma'Khia Bryant, a Black teenager, last April, state Attorney General Dave Yost said in a news release Friday.… [+2013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Sarisohn. CNN", "title": "DA's office to drop criminal charges against Denver security guard who fatally shot a man last year after political rally", "description": "Prosecutors will drop a second-degree murder charge for a Denver security guard who shot a man at a political rally in October 2020, according to a statement from the Denver District Attorney's office.", "url": "https://www.cnn.com/2022/03/11/us/denver-protest-shooting-charge-dismissal/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311211119-denver-shooting-1010-restricted-dupe.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T02:47:04Z", "content": "Prosecutors will drop a second-degree murder charge for a Denver security guard who shot a man at a political rally in October 2020, according to a statement from the Denver District Attorneys office… [+1106 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, Jennifer Hansler and Jeremy Herb, CNN", "title": "No diplomatic off-ramp in sight for Russia's war in Ukraine", "description": "With Russia's war in Ukraine now in its third week, US and European officials have little optimism that the diplomatic channels can deliver a way out of the conflict at this point.", "url": "https://www.cnn.com/2022/03/11/politics/ukraine-russia-putin-diplomacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311133414-03-ukraine-0311-super-tease.jpg", "publishedAt": "2022-03-12T01:15:26Z", "content": "Washington (CNN)With Russia's war in Ukraine now in its third week, US and European officials have little optimism that the diplomatic channels can deliver a way out of the conflict at this point.\r\nT… [+7898 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul, CNN", "title": "In today's India, clothing choices signal a deepening religious divide", "description": "A visual confrontation between women wearing Islamic hijabs and men clad in saffron -- a color closely associated with Hinduism -- is symbolic of deepening divisions in the country caused, in part, by the rise of Hindu nationalism.", "url": "https://www.cnn.com/style/article/india-hijab-saffron-clothing-protests-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223235730-hijab-protest-kolkata-02112022-restricted-super-tease.jpg", "publishedAt": "2022-03-12T01:11:32Z", "content": "In a video that has since gone viral on social media, a group of men gather on a dusty street in India's southern Karnataka state.\r\nCarrying saffron-colored flags and matching scarves, the men chant … [+9825 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "India says it accidentally fired a missile into Pakistan", "description": "India said on Friday it had accidentally fired a missile into Pakistan this week because of a \"technical malfunction\" during routine maintenance, giving its version of events after Pakistan summoned India's envoy to protest.", "url": "https://www.cnn.com/2022/03/11/asia/india-pakistan-missile-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311194255-india-pakistan-missile-03092022-handout-super-tease.jpg", "publishedAt": "2022-03-12T00:55:42Z", "content": "(CNN)India said on Friday it had accidentally fired a missile into Pakistan this week because of a \"technical malfunction\" during routine maintenance, giving its version of events after Pakistan summ… [+3692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch", "title": "Gabby Petito's parents sue Brian Laundrie's parents, claiming they knew of her killing and were helping son escape", "description": "", "url": "https://www.cnn.com/2022/03/11/us/brian-laundrie-gabby-petito-parents-lawsuit/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311163207-joseph-petito-file-2021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-12T00:47:57Z", "content": "The family of Gabby Petito has filed a civil lawsuit against Christopher and Roberta Laundrie, alleging they knew their son Brian Laundrie killed Gabby Petito and were working to help him flee the co… [+2887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Report finds 'significant gaps' in DHS' ability to detect violent extremism in its ranks", "description": "The Department of Homeland Security has uncovered \"significant gaps\" in its ability to detect potential domestic violent extremist threats within its ranks, citing unresolved issues of funding, training and consistency, according to a report released Friday.", "url": "https://www.cnn.com/2022/03/11/politics/dhs-internal-report-domestic-violent-extremism/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210301193425-01-dhs-logo-file-super-tease.jpg", "publishedAt": "2022-03-12T00:46:32Z", "content": "(CNN)The Department of Homeland Security has uncovered \"significant gaps\" in its ability to detect potential domestic violent extremist threats within its ranks, citing unresolved issues of funding, … [+2881 chars]"}]}