{"status": "ok", "totalResults": 116, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, Dana Bash and Michael Warren, CNN", "title": "As Trump readies summer rallies and speeches, allies worry he's stuck in the past", "description": "A cadre of aides and advisers working to tame Donald Trump's obsession with the 2020 election, including his fixation with debunked voter fraud theories and ballot audits, are realizing the task at hand is much tougher than they thought.", "url": "https://www.cnn.com/2021/06/04/politics/trump-north-carolina-speech-2020-obsession/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603151659-donald-trump-cpac-2021-super-tease.jpg", "publishedAt": "2021-06-04T11:00:41Z", "content": "(CNN)A cadre of aides and advisers working to tame Donald Trump's obsession with the 2020 election, including his fixation with debunked voter fraud theories and ballot audits, are realizing the task… [+9443 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "Caught in a 'pickle,' tens of millions of Americans might not have had an adequate response to the Covid-19 vaccine", "description": "Tens of millions of Americans are taking immunosuppressive drugs that might weaken the effect of the Covid-19 vaccine, and they find themselves in uncharted territory, scared that their vaccinations might not have worked.", "url": "https://www.cnn.com/2021/06/04/health/covid-19-vaccine-immunosuppressants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512100735-johnson-johnson-covid-19-vaccine-super-tease.jpeg", "publishedAt": "2021-06-04T10:56:12Z", "content": "(CNN)It was a beautiful March afternoon, and as June Tatelman walked her dog in her Boston neighborhood, she was flying high. \r\nTatelman had recently received her second dose of Pfizer's Covid-19 vac… [+9488 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Few Israelis wanted a leader to the right of Netanyahu. Naftali Bennett is set to oust his old boss anyway", "description": "If Naftali Bennett becomes Israel's leader, he will carry into office a history of incendiary remarks about Palestinians and a well-documented ambition to annex part of the occupied West Bank.", "url": "https://www.cnn.com/2021/06/04/middleeast/naftali-bennett-israel-profile-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604094451-naftali-bennett-selfie-03-17-2021-super-tease.jpg", "publishedAt": "2021-06-04T10:45:03Z", "content": "(CNN)After the 2019 elections, Naftali Bennett's right-wing party failed to cross the electoral threshold and had no seats in Israel's parliament. \r\nTwo years later, he's on the verge of becoming the… [+6776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Few Israelis wanted a leader to the right of Netanyahu. Naftali Bennett is set to oust his old boss anyway.", "description": "If Naftali Bennett becomes Israel's leader, he will carry into office a history of incendiary remarks about Palestinians and a well-documented ambition to annex part of the occupied West Bank.", "url": "https://www.cnn.com/2021/06/04/middleeast/naftali-bennett-israel-profile-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604094451-naftali-bennett-selfie-03-17-2021-super-tease.jpg", "publishedAt": "2021-06-04T10:45:03Z", "content": "(CNN)After the 2019 elections, Naftali Bennett's right-wing party failed to cross the electoral threshold and had no seats in Israel's parliament. \r\nTwo years later, he's on the verge of becoming the… [+6776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "5 steps to free your mind from overthinking", "description": "You stare at your bedroom ceiling, willing yourself to go to sleep. Thoughts race through your head, holding your mind hostage. Or you ruminate on the awkward conversation you had with your boss on the way home from work.", "url": "https://www.cnn.com/2021/06/04/health/overthinking-worry-anxiety-tips-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602165109-anxiety-overthinking-stock-super-tease.jpg", "publishedAt": "2021-06-04T10:37:39Z", "content": "(CNN)You stare at your bedroom ceiling, willing yourself to go to sleep. Thoughts race through your head, holding your mind hostage. Or you ruminate on the awkward conversation you had with your boss… [+5440 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for June 4: Covid-19, Capitol riots, White House, cyberattacks, Belarus", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/06/04/us/five-things-june-4-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604014225-coronavirus-vaccine-site-washington-dc-0601-super-tease.jpg", "publishedAt": "2021-06-04T10:34:47Z", "content": "(CNN)Climate change doesn't just threaten the environment. It could ignite serious financial crises, an IMF official says, due to things like widespread damage and economic instability caused by natu… [+5627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Allison Hope", "title": "How a $5.95 dress can change a kid's life", "description": "When my four-year-old recently told me that he liked his friend's pink dress and wanted one of his own, I brought up a children's clothing site on my phone and let him pick one out. It was a small gesture -- the whole affair set me back roughly three minutes …", "url": "https://www.cnn.com/2021/06/04/opinions/gender-freedom-lgbtq-pride-supporting-kids-hope/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603173448-allison-hope-opinion-gender-affirmation-super-tease.jpg", "publishedAt": "2021-06-04T10:17:47Z", "content": "Allison Hope is a writer whose work has been featured by The New York Times, The Washington Post, CNN, Slate and elsewhere. The views expressed here are the author's. Read more opinion on CNN.\r\n (CNN… [+6644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Lionel Messi and Argentina pay tribute to Diego Maradona in first match since legend's death", "description": "The Argentina national team paid tribute to Diego Maradona in its first match since his death, unveiling a five-meter [16.4-foot] statue and wearing his image on their shirts ahead of kick-off.", "url": "https://edition.cnn.com/2021/06/04/football/argentina-diego-maradona-tribute-chile-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604094130-messi-maradona-chile-super-tease.jpg", "publishedAt": "2021-06-04T10:02:36Z", "content": "(CNN)The Argentina national team paid tribute to Diego Maradona in its first match since his death, unveiling a five-meter [16.4-foot] statue and wearing his image on their shirts ahead of kick-off.\r… [+698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Katelyn Polantz and Annie Grayer, CNN", "title": "House Democrats finally get to interview former White House counsel McGahn", "description": "Former Trump White House Counsel Don McGahn is testifying Friday before the House Judiciary Committee about former President Donald Trump's attempts to obstruct the Russia investigation, in a closed-door interview that's the culmination of a two-year court fi…", "url": "https://www.cnn.com/2021/06/04/politics/don-mcgahn-interview-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191125101752-01-don-mcgahn-file-super-tease.jpg", "publishedAt": "2021-06-04T10:00:54Z", "content": "(CNN)Former Trump White House Counsel Don McGahn is testifying Friday before the House Judiciary Committee about former President Donald Trump's attempts to obstruct the Russia investigation, in a cl… [+3989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "Italy is planning its own version of Alcatraz", "description": "Santo Stefano, one of the Pontine islands, was a place of imprisonment and exile since Roman times. Along with its neighbor Ventotene, it was home to political prisoners during the fascist regime. Previously abandoned, it's now to become a museum.", "url": "https://www.cnn.com/travel/article/santo-stefano-ventotene-island-jail/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601163035-santo-stefano-2-super-tease.jpg", "publishedAt": "2021-06-04T09:07:52Z", "content": "(CNN) It's spooky, crumbling and abandoned. Inhabited by seagulls, with only the odd day-trip by scuba divers to disturb them, Santo Stefano is a tiny volcanic island between Rome and Naples, where s… [+10636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts, CNN", "title": "US Marshals say a suspect was shot and killed avoiding arrest in Minneapolis", "description": "A person was shot and killed by authorities in Minneapolis and another person was injured, the US Marshals Service said in a statement Thursday, which led to a protest forming later in the evening.", "url": "https://www.cnn.com/2021/06/04/us/minneapolis-police-shooting-suspect/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604034922-us-marshals-shooting-minneapolis-0603-super-tease.jpg", "publishedAt": "2021-06-04T08:34:10Z", "content": "(CNN)A person was shot and killed by authorities in Minneapolis and another person was injured, the US Marshals Service said in a statement Thursday, which led to a protest forming later in the eveni… [+1077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Student leader at Tiananmen: This is one of the darkest times in Hong Kong", "description": "For the second year in a row, pro-democracy activists in Hong Kong are banned from organizing an annual candlelight vigil that remembers the bloody crackdown in Beijing on June 4, 1989. Wu'er Kaixi, one of the main student leaders of the protests, spoke with …", "url": "https://www.cnn.com/videos/world/2021/06/04/tiananmen-square-june-4-taiwan-wuer-kaixi-intv-ripley-intl-hnk-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604134443-screengrab-wuerkaixi-super-tease.jpg", "publishedAt": "2021-06-04T08:11:49Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Pakistani court overturns death row Christian couple's blasphemy conviction", "description": "A Pakistani court on Thursday overturned the death sentence of a Christian couple in a blasphemy case, acquitting them for lack of evidence after they had spent seven years on death row, lawyers said.", "url": "https://www.cnn.com/2021/06/04/asia/pakistan-blasphemy-conviction-overturned-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604033458-lahore-high-court-file-restricted-super-tease.jpg", "publishedAt": "2021-06-04T07:48:10Z", "content": "Lahore, PakistanA Pakistani court on Thursday overturned the death sentence of a Christian couple in a blasphemy case, acquitting them for lack of evidence after they had spent seven years on death r… [+1591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Philippine President Rodrigo Duterte sees boxer Manny Pacquiao as possible successor", "description": "Philippine President Rodrigo Duterte has drawn up a list of possible successors that includes his daughter Sara, boxing star Manny Pacquiao and the son of late dictator Ferdinand Marcos, the presidential spokesman said on Thursday.", "url": "https://www.cnn.com/2021/06/04/asia/duterte-pacquiao-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604143149-01-pacquiao-duterte-super-tease.jpeg", "publishedAt": "2021-06-04T06:51:42Z", "content": "Philippine President Rodrigo Duterte has drawn up a list of possible successors that includes his daughter Sara, boxing star Manny Pacquiao and the son of late dictator Ferdinand Marcos, the presiden… [+1286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "States that fall well below vaccinating 70% of adults are 'sitting ducks' for an outbreak, expert warns", "description": "The US is pushing to have 70% of adults get at least one dose of the Covid-19 vaccine by July 4, but an expert said that number is important to reach at the state level too -- and those states who are falling well below may be vulnerable to another outbreak.", "url": "https://www.cnn.com/2021/06/04/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604014027-coronavirus-vaccine-florida-0520-super-tease.jpg", "publishedAt": "2021-06-04T06:49:39Z", "content": "(CNN)The US is pushing to have 70% of adults get at least one dose of the Covid-19 vaccine by July 4, but an expert said that number is important to reach at the state level too -- and those states w… [+5270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths, CNN", "title": "Hong Kong's Tiananmen vigil always set the city apart from China. Those days may now be over", "description": "Editor's note: CNN will be launching the Meanwhile in China newsletter on June 21, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up here.", "url": "https://www.cnn.com/2021/06/04/china/hong-kong-june-4-tiananmen-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180605095955-tiananmen-1-super-tease.jpg", "publishedAt": "2021-06-04T05:24:41Z", "content": "Editor's note: CNN will be launching the Meanwhile in China newsletter on June 21, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. S… [+8516 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "LeBron James' perfect record in first-round playoff series ends with elimination loss to Phoenix Suns", "description": "LeBron James and the defending NBA champion Los Angeles Lakers lost 113-100 to the Phoenix Suns in Game 6 of their first-round series on Thursday, eliminating the Lakers and bringing an end to an impressive record in James' career.", "url": "https://edition.cnn.com/2021/06/04/sport/lebron-james-loss-lakers-suns-nba-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210604000845-01-lebron-james-0603-super-tease.jpg", "publishedAt": "2021-06-04T05:23:16Z", "content": "(CNN)LeBron James and the defending NBA champion Los Angeles Lakers lost 113-100 to the Phoenix Suns in Game 6 of their first-round series on Thursday, eliminating the Lakers and bringing an end to a… [+1504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Smith-Spark, CNN", "title": "Britain's worst serial killers haunt a city, decades after their grisly crimes", "description": "Police excavations at a cafe in the quiet English city of Gloucester revived a half-century-old puzzle: What happened to Mary Bastholm, a carefree 15-year-old girl who went missing in January 1968?", "url": "https://www.cnn.com/2021/06/04/europe/fred-rosemary-west-murders-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210520141816-fred-west-rose-west-split-restricted-super-tease.jpg", "publishedAt": "2021-06-04T04:00:17Z", "content": "Killed by Fred West:\r\nAnn McFall, 18, his children's nanny and pregnant by Fred, disappeared in 1967\r\nCatherine Costello, his first wife, last heard of in 1971\r\nKilled by Rose West:\r\nCharmaine West, … [+583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz and Caroline Kelly, CNN", "title": "Rep. Mo Brooks says he isn't hiding from an insurrection lawsuit after Rep. Eric Swalwell hired a private investigator to find him", "description": "Republican Rep. Mo Brooks pushed back Thursday on Democrat Rep. Eric Swalwell's account of having to hire a private investigator to locate Brooks for a lawsuit seeking to hold him accountable for the January 6 Capitol insurrection. The Alabama Republican argu…", "url": "https://www.cnn.com/2021/06/03/politics/mo-brooks-eric-swalwell-private-investigator-insurrection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603230524-mo-brooks-eric-swalwell-split-super-tease.jpg", "publishedAt": "2021-06-04T03:36:37Z", "content": "(CNN)Republican Rep. Mo Brooks pushed back Thursday on Democrat Rep. Eric Swalwell's account of having to hire a private investigator to locate Brooks for a lawsuit seeking to hold him accountable fo… [+4023 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Don Lincoln", "title": "Scientists are going back to Einstein to best Yoda -- and know the fate of the universe", "description": "Don Lincoln writes that the Dark Energy Spectroscopic Instrument seeks to make a precise three-dimensional map of the universe and help astronomers answer perhaps the most consequential of cosmological questions: How has the universe evolved and what is its f…", "url": "https://www.cnn.com/2021/06/03/opinions/desi-dark-energy-opinion-lincoln/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601165457-dark-energy-spectroscopic-instrument-file-super-tease.jpg", "publishedAt": "2021-06-04T03:32:40Z", "content": "Don Lincoln is a senior scientist at the Fermi National Accelerator Laboratory. He is the author of several science books for general audiences, including the best-selling audio book \"The Theory of E… [+6208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mirna Alsharif, CNN", "title": "A 'person of interest' has been named in the 2000 death of a Massachusetts teenager", "description": "A man who was previously convicted of sexual assault and kidnapping, and who died in 2016, has been named as a \"person of interest\" in the death in 2000 of a teenager in Warren, Massachusetts, officials said Thursday.", "url": "https://www.cnn.com/2021/06/03/us/molly-bish-person-of-interest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603191456-francis-p-sumner-sr--super-tease.jpg", "publishedAt": "2021-06-04T03:08:46Z", "content": "(CNN)A man who was previously convicted of sexual assault and kidnapping, and who died in 2016, has been named as a \"person of interest\" in the death in 2000 of a teenager in Warren, Massachusetts, o… [+1531 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Katie Bo Williams, CNN", "title": "US intelligence officials have no evidence confirming Navy pilot UFO encounters were alien spacecraft", "description": "US intelligence officials have found no evidence confirming that unidentified flying objects encountered by US Navy pilots in recent years were alien spacecraft but also have not reached a definitive assessment as to what these mysterious objects might be, ac…", "url": "https://www.cnn.com/2021/06/03/politics/intelligence-officials-navy-pilot-ufo-encounters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200814150830-ufo-super-tease.jpg", "publishedAt": "2021-06-04T02:52:06Z", "content": "Washington (CNN)US intelligence officials have found no evidence confirming that unidentified flying objects encountered by US Navy pilots in recent years were alien spacecraft but also have not reac… [+5120 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva Rothenberg, CNN", "title": "Why the 'brightest color on Earth' may also be the future of eco-conscious art", "description": "Art and science can seem two opposites on a spectrum. One is creative and interpretive, the other exact and empirical. But an emerging technology known as Pure Structural Colour -- dubbed the \"boldest, brightest color on Earth\" in a new exhibition -- shows ho…", "url": "https://www.cnn.com/style/article/pure-structural-color-kew-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603015318-01-pure-structural-color-exhibit-kew-gardens-super-tease.jpg", "publishedAt": "2021-06-04T01:25:09Z", "content": "Art and science can seem two opposites on a spectrum. One is creative and interpretive, the other exact and empirical. But an emerging technology known as Pure Structural Colour -- dubbed the \"boldes… [+5946 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Carrega, CNN", "title": "NC civil rights leaders request DOJ investigation into Andrew Brown Jr.'s death", "description": "Members of the North Carolina chapter of the NAACP met with Justice Department officials Thursday to request that they investigate the April shooting death of Andrew Brown Jr.", "url": "https://www.cnn.com/2021/06/03/politics/nc-naacp-meeting-doj/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603165654-nc-naacp-meeting-doj-super-tease.jpg", "publishedAt": "2021-06-04T01:05:15Z", "content": "(CNN)Members of the North Carolina chapter of the NAACP met with Justice Department officials Thursday to request that they investigate the April shooting death of Andrew Brown Jr.\r\nBrown, a 42-year-… [+3730 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz and Lauren M. Johnson, CNN", "title": "Texas high school valedictorian switches speech to speak out on state's abortion law", "description": "A high school valedictorian exhaled as she pulled a piece of paper from underneath her graduation gown.", "url": "https://www.cnn.com/2021/06/03/us/paxton-smith-texas-valedictorian-speech-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603130323-texas-hs-valedictorian-heartbeat-bill-speech-super-tease.jpg", "publishedAt": "2021-06-04T00:01:55Z", "content": "(CNN)A high school valedictorian exhaled as she pulled a piece of paper from underneath her graduation gown. \r\nGathering her courage, Paxton Smith started the speech she had worked so hard on for her… [+4875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar and Taylor Ward, CNN Meteorologists", "title": "India's critical wet monsoon season has started", "description": "The India Meteorological Department (IMD) has officially declared the onset of the monsoon over the state of Kerala. The monsoon, which usually starts on June 1, is a few days late. But while the onset date is important, the overall forecast is much more cruc…", "url": "https://www.cnn.com/2021/06/03/weather/weather-india-monsoon-rainfall-begins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414144338-weather-india-monsoon-onset-average-super-tease.jpg", "publishedAt": "2021-06-03T23:20:13Z", "content": "(CNN)The India Meteorological Department (IMD) has officially declared the onset of the monsoon over the state of Kerala. The monsoon, which usually starts on June 1, is a few days late. But while th… [+3468 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Microsoft wants to make voting more trustworthy. This partnership will help", "description": "In late February 2020, Microsoft carried out the first official test of its ElectionGuard voting security software in an election in Fulton, Wisconsin, for the local school board and a state supreme court seat. Developed as part of the tech giant's \"Defending…", "url": "https://www.cnn.com/2021/06/03/tech/microsoft-hart-intercivic-voting-security/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200221171310-02-microsoft-electionguard-super-tease.jpg", "publishedAt": "2021-06-03T22:47:00Z", "content": "New York (CNN Business)In late February 2020, Microsoft carried out the first official test of its ElectionGuard voting security software in an election in Fulton, Wisconsin, for the local school boa… [+4090 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Are Republicans better off without Ron Johnson?", "description": "Ron Johnson still hasn't made up his mind about whether he will run for a third Senate term in 2022 -- and he doesn't seem to be in any particular rush to do so.", "url": "https://www.cnn.com/2021/06/03/politics/ron-johnson-senate-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315173843-dusa-senator-rob-johnson-super-tease.jpg", "publishedAt": "2021-06-03T22:34:08Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, Manu Raju and Ali Zaslav, CNN", "title": "Manchin signals he's not ready to buck Republicans on key issues", "description": "West Virginia Democratic Sen. Joe Manchin, a pivotal swing vote for the party, is making very clear he's not ready to abandon Republicans for Democrats to try to push legislation on their own, as President Joe Biden's agenda faces a critical month in June.", "url": "https://www.cnn.com/2021/06/03/politics/manchin-interview-filibuster-reconciliation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601121923-joe-manchin-0420-super-tease.jpg", "publishedAt": "2021-06-03T22:28:02Z", "content": "(CNN)West Virginia Democratic Sen. Joe Manchin, a pivotal swing vote for the party, is making very clear he's not ready to abandon Republicans for Democrats to try to push legislation on their own, a… [+2448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peniel E. Joseph", "title": "'Master of None' offers a radical new take on Black love", "description": "'Moments of Love,' the third season of 'Master of None' starring Lena Waite Naomi Ackie, is a radical portrayal of Black queer love and longing that defies stereotype while pushing the envelope on representation at a crucial time in American life and art, say…", "url": "https://www.cnn.com/2021/06/03/opinions/master-of-none-moments-of-love-lena-waite-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210519114411-master-of-none-season-3-super-tease.jpg", "publishedAt": "2021-06-03T22:24:31Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+7881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "DOJ signals plans to coordinate anti-ransomware efforts with the same protocols as it does for terrorism", "description": "The Justice Department signaled Thursday it plans to coordinate its anti-ransomware efforts with the same protocols as it does for terrorism, following a slew of cyberattacks that have disrupted key infrastructure sectors ranging from gasoline distribution to…", "url": "https://www.cnn.com/2021/06/03/politics/doj-ransomware/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201029151522-ransomware-attacks-target-hospitals-election-voter-databases-ferrante-nr-vpx-00000102-super-tease.jpg", "publishedAt": "2021-06-03T21:32:41Z", "content": "(CNN)The Justice Department signaled Thursday it plans to coordinate its anti-ransomware efforts with the same protocols as it does for terrorism, following a slew of cyberattacks that have disrupted… [+3927 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "At least 10% of the world's giant sequoias lost in a single wildfire, report suggests", "description": "About 10 to 14% of the world's giant sequoia trees were destroyed by a single wildfire that swept through California's Sequoia National Forest last summer, a new draft report from the National Park Service indicates.", "url": "https://www.cnn.com/2021/06/03/us/sequoias-lost-california-wildfire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603161121-sequoias-lost-california-wildfire-restricted-super-tease.jpg", "publishedAt": "2021-06-03T21:27:04Z", "content": "(CNN)About 10 to 14% of the world's giant sequoia trees were destroyed by a single wildfire that swept through California's Sequoia National Forest last summer, a new draft report from the National P… [+2464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Klairmont, CNN", "title": "When the pandemic brought her business to a halt, this chef tackled food insecurity with farm-to-table meals", "description": "After closing down her supper club amid Covid, Chef Q. Ibraheem redirected her love of cooking to provide free, healthy meals to families at risk of going hungry in her Chicago community.", "url": "https://www.cnn.com/2021/06/03/us/chicago-covid-food-healthy-meals-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603150215-chicago-covid-food-healthy-meal-cnnheroes-00001611-super-tease.png", "publishedAt": "2021-06-03T21:22:57Z", "content": "Know someone who inspires you? Click here to nominate them as a CNN Hero.\r\n (CNN)Before the Covid-19 pandemic broke out, Chef Q. Ibraheem ran an upscale catering business and underground supper club … [+6571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Harwood", "title": "Biden spoke with prominent critic Larry Summers on economy after inflation warnings", "description": "President Joe Biden called prominent Democratic economist Larry Summers to discuss the economy after he raised several warnings recently over his inflation concerns, a source familiar with the call confirms to CNN.", "url": "https://www.cnn.com/2021/06/03/politics/larry-summers-joe-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190829144518-larry-summers-file-2015-super-tease.jpg", "publishedAt": "2021-06-03T21:20:22Z", "content": "(CNN)President Joe Biden called prominent Democratic economist Larry Summers to discuss the economy after he raised several warnings recently over his inflation concerns, a source familiar with the c… [+2358 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, Barbara Starr, Nicole Gaouette and Paul P. Murphy, CNN", "title": "US tracking Iranian ships that may be headed into the Atlantic and for Venezuela", "description": "The Pentagon and US intelligence agencies are closely tracking two Iranian ships that Tehran claims are bound for Venezuela.", "url": "https://www.cnn.com/2021/06/03/politics/us-iran-ships-venezuela/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603151957-03-iranian-ship-satellite-may-super-tease.jpg", "publishedAt": "2021-06-03T21:01:01Z", "content": "(CNN)The Pentagon and US intelligence agencies are closely tracking two Iranian ships that Tehran claims are bound for Venezuela.\r\nAt the Pentagon and other agencies, officials said that at the momen… [+5763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Ford could get hit with $1.3 billion penalty for importing vans from Europe", "description": "For years, Ford would build its Transit Connect vans in Turkey, then ship them to the United States, where the windows and seats were immediately stripped out of many of the vehicles to convert them into cargo vans.", "url": "https://www.cnn.com/2021/06/03/business/ford-transit-connect-penalty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603152555-ford-transit-connect-2010-file-super-tease.jpg", "publishedAt": "2021-06-03T20:59:29Z", "content": "New York (CNN Business)For years, Ford would build its Transit Connect vans in Turkey, then ship them to the United States, where the windows and seats were immediately stripped out of many of the ve… [+2513 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "First on CNN: Progressives push Biden to do more to distribute vaccines across the world", "description": "A group of more than 30 Democratic members of the House of Representatives have signed onto a letter to the White House encouraging the Biden administration to do even more to help distribute vaccines across the world.", "url": "https://www.cnn.com/2021/06/03/politics/progressive-reaction-biden-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330130504-01-rep-pramila-jayapal-0301-super-tease.jpg", "publishedAt": "2021-06-03T20:59:25Z", "content": "(CNN)A group of more than 30 Democratic members of the House of Representatives have signed onto a letter to the White House encouraging the Biden administration to do even more to help distribute va… [+3988 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kyle Blaine, CNN", "title": "Biden expands Trump's list of Chinese companies banned from US investment", "description": "President Joe Biden signed an executive order Thursday banning Americans from investing in 59 Chinese firms believed to be linked to China's military, expanding an earlier Trump administration order.", "url": "https://www.cnn.com/2021/06/03/economy/biden-china-executive-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210210215423-joe-biden-xi-jinping-split-0210-super-tease.jpg", "publishedAt": "2021-06-03T20:55:35Z", "content": "(CNN)President Joe Biden signed an executive order Thursday banning Americans from investing in 59 Chinese firms believed to be linked to China's military, expanding an earlier Trump administration o… [+682 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Trump and his crazies aren't done with us", "description": "It's important to stay on guard because the bar has now been lowered: we know that a pronouncement from Trump -- like his assertion about being \"reinstated\" by August -- has the potential (whether intended or not) to elicit violence from his most rabid follow…", "url": "https://www.cnn.com/2021/06/03/opinions/trump-not-done-with-us-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603160149-dantonio-op-ed-super-tease.jpg", "publishedAt": "2021-06-03T20:39:53Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Sarah Moon, CNN", "title": "Reward being offered in suspected road rage shooting that killed a 6-year-old boy in California increased to $450,000", "description": "The reward for information in the fatal shooting of a 6-year-old boy in a suspected road rage shooting in California has now risen to $450,000, thanks to another donation from the Costa Mesa City Council.", "url": "https://www.cnn.com/2021/06/03/us/aiden-leos-shooting-reward-money/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210524144117-aiden-leos-super-tease.jpg", "publishedAt": "2021-06-03T20:38:34Z", "content": "(CNN)The reward for information in the fatal shooting of a 6-year-old boy in a suspected road rage shooting in California has now risen to $450,000, thanks to another donation from the Costa Mesa Cit… [+1200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Here's how far apart the White House and GOP are on infrastructure", "description": "The White House and a group of Senate Republicans continued negotiating on an infrastructure package this week, more than two months after President Joe Biden first laid out his plan.", "url": "https://www.cnn.com/2021/06/03/politics/infrastructure-white-house-gop-proposals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210521164038-infrastructure-construction-0521-super-tease.jpg", "publishedAt": "2021-06-03T20:23:43Z", "content": "Washington (CNN)The White House and a group of Senate Republicans continued negotiating on an infrastructure package this week, more than two months after President Joe Biden first laid out his plan.… [+3639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Sturla, CNN", "title": "Eight high school football coaches suspended over allegations they made a Hebrew Israelite player eat a pizza that had contained pork", "description": "Eight high school football coaches in Canton, Ohio, have been suspended while police investigate allegations that they forced a Hebrew Israelite player to eat a pizza that previously had pork on it, despite knowing his beliefs forbade him from eating it, poli…", "url": "https://www.cnn.com/2021/06/03/us/ohio-football-coaches-suspended-for-forcing-student-to-eat-pork/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603160147-mckinley-senior-high-school-football-pizza-super-tease.jpg", "publishedAt": "2021-06-03T20:08:25Z", "content": "(CNN)Eight high school football coaches in Canton, Ohio, have been suspended while police investigate allegations that they forced a Hebrew Israelite player to eat a pizza that previously had pork on… [+2412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild and Jeremy Herb, CNN", "title": "'I thought I was going to lose my life': Capitol Police officers share their harrowing January 6 stories for the first time", "description": "US Capitol Police Sgt. Aquilino Gonell was beaten with a flagpole. His hand was sliced open. He was hit with so much chemical spray that the liquid soaked through to his skin. During intense hand-to-hand combat with rioters on the west front of the US Capitol…", "url": "https://www.cnn.com/2021/06/03/politics/capitol-police-officers-exclusive-interview-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603151807-uscp-officers-evans-gonell-super-tease.jpg", "publishedAt": "2021-06-03T20:01:44Z", "content": "Watch these exclusive interviews on CNN's \"The Lead with Jake Tapper\" at 5 P.M. ET\r\nWashington (CNN)US Capitol Police Sgt. Aquilino Gonell was beaten with a flagpole. His hand was sliced open. He was… [+9735 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten and Katelyn Polantz, CNN", "title": "Ted Cruz wins challenge to campaign reimbursement rules", "description": "A three-judge panel has struck down the federal cap on candidates using political contributions to repay personal loans they make to their campaigns, in a case that hands Texas Republican Sen. Ted Cruz a win and may have broader implications for campaign fina…", "url": "https://www.cnn.com/2021/06/03/politics/ted-cruz-campaign-finance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210422195545-ted-cruz-04-13-2021-super-tease.jpg", "publishedAt": "2021-06-03T19:57:45Z", "content": "(CNN)A three-judge panel has struck down the federal cap on candidates using political contributions to repay personal loans they make to their campaigns, in a case that hands Texas Republican Sen. T… [+2138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Boehner: GOP push to enact voting restrictions will undermine people's confidence in the electoral process", "description": "Former Republican House Speaker John Boehner on Thursday criticized his party for recently enacting strict voting rules in states around the country, saying the \"very partisan way\" it's happening will only undermine people's confidence in the electoral proces…", "url": "https://www.cnn.com/2021/06/03/politics/john-boehner-republican-voting-laws-voter-confidence-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603151647-john-boehner-super-tease.jpg", "publishedAt": "2021-06-03T19:48:19Z", "content": "Washington (CNN)Former Republican House Speaker John Boehner on Thursday criticized his party for recently enacting strict voting rules in states around the country, saying the \"very partisan way\" it… [+2716 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Covid-19 cases are falling, but experts say kids should still get a vaccine when they can. Here's why", "description": "As a pediatric infectious disease specialist, Dr. Amy Edwards has fielded a lot of questions from worried parents during the pandemic. As case numbers drop -- among children, Covid-19 cases have fallen to levels not seen since October -- the question she's ge…", "url": "https://www.cnn.com/2021/06/03/health/kids-covid-19-vaccine-cases-falling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210514023241-teen-vaccine-0513-super-tease.jpg", "publishedAt": "2021-06-03T19:45:43Z", "content": "(CNN)As a pediatric infectious disease specialist, Dr. Amy Edwards has fielded a lot of questions from worried parents during the pandemic. As case numbers drop -- among children, Covid-19 cases have… [+6271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Helicopters, a patrol car and virtual bodyguards: Inside Citizen's scattered push to upend public safety", "description": "Well before Citizen, a controversial real-time crime alerting app, raised eyebrows by testing a company-branded patrol car on the streets of Los Angeles, the startup's CEO teased an even more striking idea for a private security force: helicopters.", "url": "https://www.cnn.com/2021/06/03/tech/citizen-public-safety/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602135541-citizen-app-restricted-super-tease.jpg", "publishedAt": "2021-06-03T19:39:25Z", "content": "(CNN)Well before Citizen, a controversial real-time crime alerting app, raised eyebrows by testing a company-branded patrol car on the streets of Los Angeles, the startup's CEO teased an even more st… [+12437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "Gaetz associate Joel Greenberg scheduled to be sentenced in August", "description": "A federal judge in Orlando has scheduled Joel Greenberg, the former Florida tax collector with close ties to Rep. Matt Gaetz, to be sentenced August 19.", "url": "https://www.cnn.com/2021/06/03/politics/joel-greenberg-sentencing-scheduled/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517140415-joel-greenberg-file-restricted-super-tease.jpg", "publishedAt": "2021-06-03T19:38:00Z", "content": "(CNN)A federal judge in Orlando has scheduled Joel Greenberg, the former Florida tax collector with close ties to Rep. Matt Gaetz, to be sentenced August 19.\r\nGreenberg formally pleaded guilty last m… [+1257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Erica Orden, CNN", "title": "Former Treasury official sentenced to prison for leaking documents related to Russia and Manafort", "description": "A federal judge sentenced a former senior Treasury Department official to six months in prison after she pleaded guilty to one count of conspiracy for disclosing sensitive financial transaction reports related to people tied to former President Donald Trump a…", "url": "https://www.cnn.com/2021/06/03/politics/treasury-official-leaking-reports-sentenced-prison/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190812152607-us-treasury-department-building-super-tease.jpg", "publishedAt": "2021-06-03T19:29:48Z", "content": "(CNN)A federal judge sentenced a former senior Treasury Department official to six months in prison after she pleaded guilty to one count of conspiracy for disclosing sensitive financial transaction … [+1127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Manuel Oliver", "title": "A radical idea to wake up lawmakers on gun violence", "description": "Manuel Oliver, whose son, Joaquin, was killed in the Parkland school shooting points to the fact that school shootings in 2020 dramatically decreased as students moved to virtual learning. He says that until elected officials make meaningful progress on gun c…", "url": "https://www.cnn.com/2021/06/03/opinions/lawmakers-gun-control-school-shootings-lockdown-oliver/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603135841-manuel-oliver-op-ed-super-tease.jpg", "publishedAt": "2021-06-03T19:22:20Z", "content": "Manuel Oliver is the father of Joaquin \"Guac\" Oliver, who was killed at Marjory Stoneman Douglas High School in Parkland, Florida, in 2018 when he was 17 years old. Manuel and his wife, Patricia Oliv… [+6624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A Florida teacher is suing her school district for allegedly retaliating against her after she spoke out about racism", "description": "The Black Lives Matter flag Amy Donofrio hung outside her classroom, as well as her outspokenness on racial justice, would come to be a political flash point that reverberated across the state.", "url": "https://www.cnn.com/2021/06/03/us/florida-teacher-blm-flag-lawsuit-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602173846-robert-e-lee-high-school-file-super-tease.jpg", "publishedAt": "2021-06-03T18:39:25Z", "content": "(CNN)After the murder of George Floyd and the summer of protests that followed led to greater dialogue among her students, Amy Donofrio decided last fall to hang up a \"Black Lives Matter\" banner outs… [+8201 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicquel Terry Ellis, CNN", "title": "'It's shameful.' Massacre survivors' lawyers demand Tulsa be the next city to pay reparations", "description": "Two years after the Tulsa massacre left some 300 Black people dead and a once-booming neighborhood destroyed, another White mob attacked a Black enclave in Florida.", "url": "https://www.cnn.com/2021/06/03/us/tulsa-massacre-reparations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602164814-01-tulsa-memorial-0601-super-tease.jpg", "publishedAt": "2021-06-03T18:35:40Z", "content": "(CNN)Two years after the Tulsa massacre left some 300 Black people dead and a once-booming neighborhood destroyed, another White mob attacked a Black enclave in Florida. \r\nThe incident, known as the … [+10526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Bring style and color outdoors with Society6's summery selection of outdoor and lifestyle products", "description": "Every inch of your space should feel authentically you. That definitely applies to the inside of your home, but it shouldn't stop once you cross the threshold. Your porch, stoop, patio or yard is also an extension of your style; in fact, it's the first impres…", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/society6-outdoor-furniture-lifestyle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603141457-ss63-leadimage-super-169.jpg", "publishedAt": "2021-06-03T18:35:23Z", "content": "Every inch of your space should feel authentically you. That definitely applies to the inside of your home, but it shouldnt stop once you cross the threshold. Your porch, stoop, patio or yard is also… [+3271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Paul R. La Monica for CNN Business Perspectives", "title": "Everyone you know is talking about crypto. Uh oh", "description": "Just like we saw during the late 1990s dot-com/Nasdaq bubble, there are too many people who may not really realize the risks they are taking and are getting in over their heads.", "url": "https://www.cnn.com/2021/06/03/perspectives/crypto-dot-com-bubble/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602091416-02-bitcoin-cryptocurrency-super-tease.jpg", "publishedAt": "2021-06-03T18:31:39Z", "content": "Paul R. La Monica is a digital correspondent for CNN Business. He writes daily about the markets and blue chip companies and also appears regularly on CNNI's business programs. The opinions expressed… [+4515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Matt Egan, CNN Business", "title": "Why Republicans' main attack on Biden's infrastructure plan doesn't work", "description": "Since Covid-19 erupted last spring, Washington came to the rescue with more than $5 trillion of fiscal stimulus. That unprecedented rescue effort helped prevent the economy from plunging into a depression.", "url": "https://www.cnn.com/2021/06/03/business/inflation-biden-infrastructure-jobs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601161756-biden-infrastructure-plan-workers-0408-super-tease.jpg", "publishedAt": "2021-06-03T18:30:49Z", "content": "I do not expect Build Back Better to cause a return to 1970s-style inflation.\"\r\nJoe Brusuelas, chief economist at RSM"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, CNN", "title": "Joe Manchin is at the center of an extremely divided Washington. Here's how he got here.", "description": "Democratic Sen. Joe Manchin of West Virginia is a key vote crucial to President Joe Biden's agenda with Capitol Hill bitterly divided along partisan lines.", "url": "https://www.cnn.com/2021/06/03/politics/joe-manchin-biography-biden-agenda/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180124131356-joe-manchin-06-27-2017-super-tease.jpg", "publishedAt": "2021-06-03T18:19:52Z", "content": "(CNN)Democratic Sen. Joe Manchin of West Virginia is a key vote crucial to President Joe Biden's agenda with Capitol Hill bitterly divided along partisan lines. \r\nManchin has long been in the spotlig… [+4660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "The big test of America's great reopening is coming up", "description": "If the US -- which botched much of its pandemic response -- can all but come out of the other side, nations with the means and where mask wearing is not a political statement could do even better.", "url": "https://www.cnn.com/2021/06/03/world/meanwhile-in-america-june-3-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210529001112-08-memorial-day-weekend-0529-super-tease.jpg", "publishedAt": "2021-06-03T18:15:59Z", "content": "This was excerpted from the June 3 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)The big test of … [+5094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent", "title": "Sotheby's is auctioning a rare CryptoPunk NFT in another digital trailblazing move for the broker", "description": "A rare NFT is going up for auction and advanced bidding suggests that, like many NFTs, it won't be cheap.", "url": "https://www.cnn.com/style/article/sothebys-auction-cryptopunk-nft-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603114704-sothebys-auction-cryptopunk-nft-trnd-super-tease.jpg", "publishedAt": "2021-06-03T17:51:37Z", "content": "arts\r\nA rare NFT is going up for auction and advanced bidding suggests that, like many NFTs, it won't be cheap.\r\nSotheby's is auctioning CryptoPunk 7523, also known as \"Covid Alien,\" as part of its s… [+2044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "Senate Democrats face tough test of unity with voting rights bill", "description": "Senate Democrats will have to decide in upcoming weeks whether or not they will make changes to the For the People Act, a sweeping voting, ethics and campaign finance bill, in order to garner support when it comes to the floor later this month.", "url": "https://www.cnn.com/2021/06/03/politics/senate-democrats-voting-rights-bill-dynamic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205121011-07-chuck-schumer-file-super-tease.jpg", "publishedAt": "2021-06-03T17:43:29Z", "content": "(CNN)Senate Democrats will have to decide in upcoming weeks whether or not they will make changes to the For the People Act, a sweeping voting, ethics and campaign finance bill, in order to garner su… [+4961 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Tess Taylor", "title": "The pandemic has given us strange forms of amnesia", "description": "Tess Taylor writes that post-pandemic reopening -- amid a sense of confusion and troubling uptick of hate and violence in public places -- shows how out of practice we are being with others. We should stop trying to return to life as we knew it, she says, and…", "url": "https://www.cnn.com/2021/06/03/opinions/reopening-after-covid-is-like-amnesia-taylor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517014119-05-us-coronavirus-0515-super-tease.jpg", "publishedAt": "2021-06-03T17:21:33Z", "content": "Tess Taylor is the author of the poetry collections \"Work &amp; Days,\" \"The Forage House\" and most recently, \"Rift Zone\" and \"Last West: Roadsongs for Dorothea Lange.\" Views expressed in this comment… [+5742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter, CNN", "title": "Going for your annual checkup? Dr. Wen explains what health issues to pay attention to", "description": "Now that you're vaccinated, it's time to pay attention to other health issues that you may have been putting off. Here's what CNN Medical Analyst Dr. Leana Wen recommends.", "url": "https://www.cnn.com/2021/06/03/health/annual-checkup-reboot-wen-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210505214320-leana-wen-mask-explainer-1-super-tease.jpg", "publishedAt": "2021-06-03T16:39:07Z", "content": "(CNN)Many people have been putting off routine medical care during the Covid-19 pandemic. Now that many US adults are vaccinated and the rate of new infections is much lower, it's time to make sure y… [+7420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Holmes, CNN", "title": "DOJ investigating Trump-appointed Postmaster General Louis DeJoy", "description": "The Justice Department is investigating campaign contributions made by Postmaster General Louis DeJoy's private sector employees, his spokesman confirmed Thursday.", "url": "https://www.cnn.com/2021/06/03/politics/louis-dejoy-campaign-contributions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200824124226-17-postmaster-dejoy-hearing-0824-super-tease.jpg", "publishedAt": "2021-06-03T16:38:15Z", "content": "Washington (CNN)The Justice Department is investigating campaign contributions made by Postmaster General Louis DeJoy's private sector employees, his spokesman confirmed Thursday. \r\nMark Corallo, DeJ… [+868 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The best sales to shop today: Beats, Dyson, Macy's and more", "description": "Today, you'll find a deal on our runner up for best noise canceling headphones, discounted Supergoop! sunscreens and savings on standing desks. All that and more below.", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603115516-best-online-sales-lead-super-169.jpg", "publishedAt": "2021-06-03T16:30:02Z", "content": "Today, youll find a deal on our runner up for best noise canceling headphones, discounted standing desks and savings on Supergoop. All that and more below.\r\nOur runner-up for the best noise-canceling… [+9886 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frank Pallotta, CNN Business", "title": "AMC's stock is up 2,000% this year. But the theater chain's problems aren't solved", "description": "AMC's comeback, and then some — its stock price surged to a record high on Wednesday — has been fueled by Reddit's army of retail investors as well as some legitimate good news about customers returning to movie theaters. But that doesn't mean that AMC and th…", "url": "https://www.cnn.com/2021/06/03/media/amc-stock-reddit-box-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210528064318-amc-movie-theater-new-york-0506-super-tease.jpg", "publishedAt": "2021-06-03T16:25:18Z", "content": "New York (CNN Business)AMC's comeback, and then some its stock price surged to a record high on Wednesday has been fueled by Reddit's army of retail investors as well as some legitimate good news abo… [+4843 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Here's how to fly with a friend or family member for free through 2022", "description": "Start earning the coveted Southwest Companion Pass by using these Southwest credit card offers, and fly with a friend or family member for free through the end of 2022.", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/southwest-companion-pass/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200204190302-underscored-southwest-airlines-plane-takeoff-super-169.jpg", "publishedAt": "2021-06-03T16:05:12Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+14812 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "George P. Bush is totally cool dissing his family in hopes of making Trump happy", "description": "George P. Bush announced on Wednesday that he will run to be Texas' attorney general in 2022.", "url": "https://www.cnn.com/2021/06/03/politics/george-p-bush-texas-attorney-general/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602204641-george-p-bush-super-tease.jpg", "publishedAt": "2021-06-03T15:42:24Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Disappointment as Portugal cut from UK travel 'green list' -- and no new countries added", "description": "In the UK government's latest review of its travel \"traffic light system,\" a holiday favorite has dropped off the \"green list\" and no new countries have been added", "url": "https://www.cnn.com/travel/article/uk-green-list-portugal-removed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210507120625-tourists-on-the-beach---parede-beach-portugal---getty-images-super-tease.jpg", "publishedAt": "2021-06-03T15:27:55Z", "content": "(CNN) The UK government revealed on Thursday its first changes to travel \"traffic light system\" which it introduced last month, but there was disappointment for the travel and tourism industries and … [+3058 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden to meet with UK Prime Minister, Turkish President and other world leaders during first foreign trip", "description": "President Joe Biden will meet with United Kingdom Prime Minister Boris Johnson, Turkish President Recep Tayyip Erdogan and other world leaders during his first international trip as President next week, the White House announced Thursday.", "url": "https://www.cnn.com/2021/06/03/politics/biden-world-leaders-trip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602180257-02-biden-vaccine-remoarks-0602-super-tease.jpg", "publishedAt": "2021-06-03T15:16:12Z", "content": "(CNN)President Joe Biden will meet with United Kingdom Prime Minister Boris Johnson, Turkish President Recep Tayyip Erdogan and other world leaders during his first international trip as President ne… [+2725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The best above-ground pools, according to experts", "description": "An above-ground pool isn't as complicated or expensive as its in-ground counterpart, however, there's still lots to know before you buy. We talked to an expert to walk you through the process.", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/best-above-ground-pools/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200505101713-poollead-super-169.jpg", "publishedAt": "2021-06-03T15:13:57Z", "content": "Anyone who loves to laze in the sun, swim a few laps or just cool off when summers hottest rays are on full display has likely dreamt of installing an in-ground pool in the backyard. But expense, mai… [+13206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Alexis Drutchas", "title": "In America, is bodily autonomy a human right?", "description": "When it comes to American law and politics, transgender health, abortion access and aid-in-dying options for patients with terminal illnesses may seem like separate issues, writes Alexis Drutchas. But the same fundamental question of human rights underpinning…", "url": "https://www.cnn.com/2021/06/03/opinions/bodily-autonomy-abortion-access-transgender-health-paxton-smith-drutchas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603095813-alexis-drutchas-op-ed-super-tease.jpg", "publishedAt": "2021-06-03T15:13:39Z", "content": "Alexis Drutchas, MD, is an attending physician at Massachusetts General Hospital in the division of palliative care, and a Public Voices Fellow of The OpEd Project. She previously worked at Fenway He… [+8925 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Puppies are born primed to interact with people, study finds", "description": "Some puppies don't need training to know how to socialize and connect with people, a new study finds.", "url": "https://www.cnn.com/2021/06/03/health/puppy-social-skills-wellness-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602230802-01-puppy-social-skills-wellness-sci-super-tease.jpg", "publishedAt": "2021-06-03T15:02:21Z", "content": "(CNN)What's your favorite thing about puppies? Is it their cute yawns, wiggly bottoms or the sweet way they lick your nose? Or maybe it's those doleful eyes that stare into yours as if they know what… [+5341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Amazon thrived during the pandemic. These drivers say they paid the price", "description": "Massive turnover rates. Dissatisfaction with pay. Demanding bosses. Some workers who helped Amazon take advantage of the business opportunity the pandemic brought say they aren't pleased.", "url": "https://www.cnn.com/2021/06/03/tech/amazon-dsp-delivery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601151647-amazon-prime-delivery-van-us-0427-restricted-super-tease.jpg", "publishedAt": "2021-06-03T14:42:22Z", "content": "Where is the time to take a break, to hydrate properly, to use the bathroom, to do what a normal person would do during a workday?\r\nQuentin Sauls, DSP driver"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, Leyla Santiago and Sara Weisfeldt, CNN", "title": "Florida children's home pauses emergency shelter program after youths are charged with attempted murder of deputies", "description": "A central Florida children's group home says it is pausing its emergency shelter program after two children staying there allegedly broke into a nearby home and shot at responding deputies.", "url": "https://www.cnn.com/2021/06/03/us/florida-deputies-shooting-teen-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603151733-01-florida-united-methodist-childrens-home-super-tease.jpg", "publishedAt": "2021-06-03T14:39:51Z", "content": "(CNN)A central Florida children's group home says it is pausing its emergency shelter program after two children staying there allegedly broke into a nearby home and shot at responding deputies.\r\nThe… [+7795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "21 pairs of Tevas we're obsessed with this summer", "description": "Whether you want a multicolored chunky sandal, a water-resistant pop of color or just a shoe that can literally do it all this summer, Tevas have got you covered.", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/tevas-sandals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210526104905-tevalead-super-169.jpg", "publishedAt": "2021-06-03T14:34:49Z", "content": "Some might say that Tevas had their moment, and that moment was the summer of 1996. While theyre not wrong, Tevas are back and theyre more stylish than ever. In fact, the comfortable sport sandal, wh… [+4929 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Dr. Anthony Fauci says publicly released email about lab leak is being misconstrued", "description": "In an interview with CNN on Thursday, Dr. Anthony Fauci said that an email he received last year from an executive at the US-based EcoHealth Alliance has been misconstrued and offered a hint of regret about a February 2020 email downplaying the need to wear a…", "url": "https://www.cnn.com/2021/06/03/health/anthony-fauci-emails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603083441-dr-fauci-newday-vpx-super-tease.jpg", "publishedAt": "2021-06-03T14:27:39Z", "content": "(CNN)In an interview with CNN on Thursday, Dr. Anthony Fauci said that an email he received last year from an executive at the US-based EcoHealth Alliance has been misconstrued and offered a hint of … [+4029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, Ariane de Vogue and Devan Cole, CNN", "title": "Supreme Court sides with police officer who improperly searched license plate database", "description": "The Supreme Court on Thursday narrowed the scope of a federal cybercrime law, holding that a policeman who improperly accessed a license plate database could not be charged under the law.", "url": "https://www.cnn.com/2021/06/03/politics/supreme-court-cybercrime-law-case/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210524093346-scotus-0517-super-tease.jpg", "publishedAt": "2021-06-03T14:22:30Z", "content": "Washington (CNN)The Supreme Court on Thursday narrowed the scope of a federal cybercrime law, holding that a policeman who improperly accessed a license plate database could not be charged under the … [+1387 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Twitter will help you undo a tweet — for a fee", "description": "Twitter is not caving — yet — to users' demands for an \"edit\" button, but it is offering something close: an \"undo tweet\" option as part of its new subscription service, Twitter Blue, which debuts in Canada and Australia Thursday.", "url": "https://www.cnn.com/2021/06/03/media/twitter-blue-subscription/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602112212-20210602-twitter-blue-super-tease.jpg", "publishedAt": "2021-06-03T14:03:58Z", "content": "New York (CNN Business)Twitter(TWTR) is not caving yet to users' demands for an \"edit\" button, but it is offering something close: an \"undo tweet\" option as part of its new subscription service, Twit… [+2216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Bash and Veronica Stracqualursi, CNN", "title": "Trump is more obsessed than ever with 2020 election and is brushing off allies who are telling him to move on", "description": "Donald Trump is more obsessed than ever with the 2020 election and pushing his lie that there was widespread fraud that led to his defeat, according to several former advisers and allies still close to the former Republican president.", "url": "https://www.cnn.com/2021/06/03/politics/trump-mindset-2020-election-obsession/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210521102719-donald-trump-super-tease.jpg", "publishedAt": "2021-06-03T14:02:00Z", "content": "(CNN)Donald Trump is more obsessed than ever with the 2020 election and pushing his lie that there was widespread fraud that led to his defeat, according to several former advisers and allies still c… [+2982 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Climate change could ignite a financial crisis, IMF official says", "description": "Climate change poses serious risks to the stability of the financial system, a senior International Monetary Fund official told CNN Business.", "url": "https://www.cnn.com/2021/06/03/investing/climate-change-financial-crisis-imf/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602134841-01-tobias-adrian-file-super-tease.jpg", "publishedAt": "2021-06-03T14:00:44Z", "content": "The climate crisis is an existential crisis.\"\r\nTobias Adrian, director of the IMF's monetary and capital markets department"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Stephen King adapts his own book in 'Lisey's Story,' with disappointing results", "description": "Stephen King's usual policy of selling the rights to his books and washing his hands of the results goes out the window in \"Lisey's Story,\" which the prolific author adapted himself. But the Apple TV+ limited series lands in the shallow end of the King cinema…", "url": "https://www.cnn.com/2021/06/03/entertainment/liseys-story-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210528124315-liseys-story-apple-tv-super-tease.jpg", "publishedAt": "2021-06-03T13:50:04Z", "content": "(CNN)Stephen King's usual policy of selling the rights to his books and washing his hands of the results goes out the window in \"Lisey's Story,\" which the prolific author adapted himself. But the App… [+2357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "20 Amazon products our readers couldn't get enough of in May", "description": "From eco-friendly kitchen swaps to top-rated pimple patches, check out the 20 products Underscored readers loved most in May.", "url": "https://www.cnn.com/2021/06/03/cnn-underscored/underscored-favorite-amazon-products-may/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602102232-mayfavslead-super-169.jpg", "publishedAt": "2021-06-03T13:43:49Z", "content": "Curious about what your fellow CNN Underscored readers are buying? Every month well round up our readers favorite products those products readers like you scooped up the most over the past 30 days.\r\n… [+4226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Donald Trump is getting worse", "description": "The evidence is everywhere.", "url": "https://www.cnn.com/2021/06/03/politics/donald-trump-2020-election-fraud/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602130929-donald-trump-file-january-20-2021-super-tease.jpg", "publishedAt": "2021-06-03T13:31:51Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Jeremy Herb, CNN", "title": "New Senate report to detail security failures on January 6 but will fuel fight for probe over Trump's role", "description": "Two Senate committees plan to release a flurry of recommendations in a thorough 100-page-plus report about what went wrong on January 6, but they will stop short of examining former President Donald Trump's role in the run-up to the attack on the US Capitol, …", "url": "https://www.cnn.com/2021/06/03/politics/senate-report-january-6-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321231141-capitol-hill-riot-0106-super-tease.jpg", "publishedAt": "2021-06-03T13:24:03Z", "content": "(CNN)Two Senate committees plan to release a flurry of recommendations in a thorough 100-page-plus report about what went wrong on January 6, but they will stop short of examining former President Do… [+7257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "Booking a cruise from the US this summer? Here's what you need to know", "description": "There's hope for travelers who've been waiting to set sail on a cruise from ports in the United States. There are sailings slated to embark starting later this month -- here's what you need to know.", "url": "https://www.cnn.com/travel/article/cruise-travel-united-states-2021-need-to-know/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603085348-cruise-ship-explorer-of-the-seas-miami-super-tease.jpg", "publishedAt": "2021-06-03T13:08:17Z", "content": "(CNN) There's hope on the horizon for travelers who've been waiting to set sail on a cruise from the United States.\r\nA handful of sailings from US ports are slated to embark within the next month, ne… [+8019 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Are unemployment benefits causing a worker shortage? No one knows for sure.", "description": "Once considered a crucial safety net in the pandemic-fueled economic storm, enhanced unemployment benefits are now pitting the jobless who say they are still struggling to find work against businesses who argue they are now struggling to find employees.", "url": "https://www.cnn.com/2021/06/03/politics/unemployment-benefits-worker-shortage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602163530-01-us-worker-shortage-0521-super-tease.jpg", "publishedAt": "2021-06-03T12:13:45Z", "content": "(CNN)Once considered a crucial safety net in the pandemic-fueled economic storm, enhanced unemployment benefits are now pitting the jobless who say they are still struggling to find work against busi… [+5399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, CNN", "title": "The rest of the world is far from 'normal'", "description": "While rich nations enjoy their \"hot vax summer,\" other places are battling explosive case numbers, rising deaths and a lack of vaccines.", "url": "https://www.cnn.com/2021/06/03/world/coronavirus-newsletter-intl-06-03-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-06-03T12:13:19Z", "content": "A version of this story appeared in the June 3 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)As rich nations prep… [+6770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Bidens celebrate first lady's birthday at her favorite place", "description": "In a rare move for President Joe Biden and first lady Jill Biden, the first couple on Wednesday left Washington for a mid-week trip to their beach house in Rehoboth Beach, Delaware. It is the first time during Biden's presidency that he will pay a visit to th…", "url": "https://www.cnn.com/2021/06/03/politics/jill-biden-70th-birthday-rehoboth-beach/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210602164329-rehoboth-beach-july-2020-super-tease.jpg", "publishedAt": "2021-06-03T12:13:01Z", "content": "(CNN)In a rare move for President Joe Biden and first lady Jill Biden, the first couple on Wednesday left Washington for a mid-week trip to their beach house in Rehoboth Beach, Delaware. It is the fi… [+2543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Mike Hayes, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the Covid-19 pandemic and the US's reopening", "description": "About half of Americans having received at least one dose of a Covid-19 vaccine as more coronavirus mandates and restrictions ease. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-06-03-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-06-03T11:54:46Z", "content": "After months of deliberations, President Biden has finalized his plan to distribute millions of coronavirus vaccines worldwide. \r\nSecretary of State Antony Blinken hinted earlier that an announcement… [+2079 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Jacinda Ardern didn't feel like she was 'tough enough' for a career in politics", "description": "New Zealand Prime Minister Jacinda Ardern has said she didn't think she was \"tough enough\" for a life in politics, in a wide-ranging interview where she also discusses preparing for Covid-19 and how relations with the US have evolved.", "url": "https://www.cnn.com/2021/06/03/asia/axe-files-jacinda-ardern-interview-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210218071449-jacinda-ardern-0215-super-tease.jpg", "publishedAt": "2021-06-03T11:51:27Z", "content": "(CNN)New Zealand Prime Minister Jacinda Ardern has said she didn't think she was \"tough enough\" for a life in politics, in a wide-ranging interview where she also discusses preparing for Covid-19 and… [+3374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ramin Mostaghim and Hamdi Alkhshali, CNN", "title": "Firefighters battle massive fire at Iranian oil refinery", "description": "A huge blaze broke out at an Iranian oil refinery south of Tehran on Wednesday, a spokesman for Iran's emergency department said, according to state media.", "url": "https://www.cnn.com/2021/06/03/middleeast/iran-tondgooyan-oil-refinery-fire-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603051730-02-tehran-iran-oil-refinery-fire-0602-super-tease.jpg", "publishedAt": "2021-06-03T11:22:11Z", "content": "Tehran (CNN)A huge blaze broke out at an Iranian oil refinery south of Tehran on Wednesday, a spokesman for Iran's emergency department said, according to state media. \r\nSo far there have been no rep… [+1874 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Marquardt and Geneva Sands, CNN", "title": "First on CNN: White House pushes for companies to take ransomware more seriously after high-profile cyberattacks", "description": "The White House has issued a rare open letter to companies calling on them to treat the threat of ransomware attacks with greater urgency, following back-to-back attacks by Russian hackers on key oil and food processing companies.", "url": "https://www.cnn.com/2021/06/03/politics/white-house-open-letter-ransomware-attacks-businesses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210117075723-01-white-house-0116-super-tease.jpg", "publishedAt": "2021-06-03T11:14:17Z", "content": "(CNN)The White House has issued a rare open letter to companies calling on them to treat the threat of ransomware attacks with greater urgency, following back-to-back attacks by Russian hackers on ke… [+4900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Reid and David Shortell, CNN", "title": "Feds investigating obstruction as part of Gaetz probe, sources say", "description": "The Justice Department is investigating potential obstruction of justice connected to the ongoing probe of Rep. Matt Gaetz and his alleged sexual relationship with a minor.", "url": "https://www.cnn.com/2021/06/03/politics/feds-investigating-obstruction-gaetz-probe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423163611-matt-gaetz-probe-public-corruption-medical-marijuana-reid-lead-vpx-00000712-super-tease.jpg", "publishedAt": "2021-06-03T11:11:08Z", "content": "Washington (CNN)The Justice Department is investigating potential obstruction of justice connected to the ongoing probe of Rep. Matt Gaetz and his alleged sexual relationship with a minor. \r\nAccordin… [+7270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "The US has a problem with guns. Here's what to know.", "description": "Another spate of mass shootings this week continued to shake the US, adding to what feels like an increasingly violent time as the country emerges from shelter-in-place orders and restrictions imposed during the pandemic.", "url": "https://www.cnn.com/2021/06/03/politics/us-guns-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210526134038-08-san-jose-shooting-0526-super-tease.jpg", "publishedAt": "2021-06-03T11:06:55Z", "content": "(CNN)Another spate of mass shootings this week continued to shake the US, adding to what feels like an increasingly violent time as the country emerges from shelter-in-place orders and restrictions i… [+4364 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Investigators ask for surveillance video to help in their search for a missing 11-year-old", "description": "Authorities are seeking the public's help in the search for an 11-year-old boy who remains missing in central Iowa after hundreds of people spent part of Memorial Day weekend looking for him.", "url": "https://www.cnn.com/2021/06/03/us/missing-iowa-boy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603085628-iowa-missing-boy-xavior-harrelson-super-tease.jpg", "publishedAt": "2021-06-03T10:56:26Z", "content": "(CNN)Authorities are seeking the public's help in the search for an 11-year-old boy who remains missing in central Iowa after hundreds of people spent part of Memorial Day weekend looking for him.\r\nX… [+2115 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "Robert Bartini: The world's most mysterious aircraft designer", "description": "His life is such a mystery that even his real name is uncertain, but his legacy to the world of aviation is clear: Robert Oros di Bartini was a genius ahead of his time whose wondrous airplanes and bizarre flying boats still impress today.", "url": "https://www.cnn.com/travel/article/robert-bartini-mysterious-airplane-designer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210518125226-05-bartini-aviation-restricted-super-tease.jpg", "publishedAt": "2021-06-03T10:48:05Z", "content": "(CNN) His life is such a mystery that even his real name is uncertain, but his legacy to the world of aviation is clear: Robert Oros di Bartini -- as the inscription reads on his tombstone -- was a g… [+11727 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for June 3: Coronavirus, cyberattacks, Israel, Capitol riots, Taliban", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/06/03/us/five-things-june-3-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603004118-us-coronavirus-thursday-0603-super-tease.jpg", "publishedAt": "2021-06-03T10:23:27Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN", "title": "How a Capitol rioter cut his plea deal and what it means for others", "description": "When the Justice Department was ready to set the tone for hundreds of its US Capitol riot cases, it looked to a working-class Floridian who had gone into the Senate chamber with the crowd for 15 minutes on January 6.", "url": "https://www.cnn.com/2021/06/03/politics/capitol-riot-plea-deals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205104923-104-january-6-capitol-riots-super-tease.jpg", "publishedAt": "2021-06-03T10:06:00Z", "content": "(CNN)When the Justice Department was ready to set the tone for hundreds of its US Capitol riot cases, it looked to a working-class Floridian who had gone into the Senate chamber with the crowd for 15… [+4529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Karla Cripps, CNN", "title": "Qantas staff use 'wheel whackers' to scare off rattlesnakes drawn to A380s parked in California desert", "description": "Australian airline Qantas has revealed that engineers working on its fleet of A380 superjumbos stored in California's Mojave desert have had to come up with a simple but effective system to protect themselves from the area's venomous rattlesnakes.", "url": "https://www.cnn.com/travel/article/qantas-california-desert-a380s-rattlesnakes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603154121-tease-qantas-wheel-wacker-super-tease.jpg", "publishedAt": "2021-06-03T09:52:15Z", "content": "Karla Cripps, CNNPublished 3rd June 2021\r\n(CNN) Since the start of the pandemic, thousands of planes from airlines around the world have been grounded, with many temporarily moved to hot, arid desert… [+4083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "Two tennis players in quarantine after testing positive for Covid-19 at the French Open", "description": "Two men's doubles players at this year's French Open have tested positive for Covid-19 and are now in quarantine, organizers confirmed.", "url": "https://edition.cnn.com/2021/06/03/tennis/french-open-players-covid-isolation-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603101330-tennis-french-open-super-tease.jpg", "publishedAt": "2021-06-03T09:41:26Z", "content": "(CNN)Two men's doubles players at this year's French Open have tested positive for Covid-19 and are now in quarantine, organizers confirmed. \r\nThe players, both from the same team, have subsequently … [+1196 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Rare stamps and a US coin could fetch $37 million at auction", "description": "Two of the most coveted items in stamp-collecting and one of the world's rarest coins could break auction records within minutes of one another.", "url": "https://www.cnn.com/style/article/three-treasures-sothebys-coin-stamps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210601225950-02-guiana-stamp-auction-sothebys-super-tease.jpg", "publishedAt": "2021-06-03T09:29:52Z", "content": "Two of the most coveted items in stamp-collecting and one of the world's rarest coins could fetch a combined $37 million when they go under the hammer in New York next week.\r\nThe three collectibles -… [+3541 chars]"}]}