{"status": "ok", "totalResults": 88, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "The key moments from Elizabeth Holmes' trial", "description": "After nearly four months of court proceedings in one of the most high-profile tech trials in recent memory, Elizabeth Holmes has been found guilty on four out of 11 federal fraud and conspiracy charges.", "url": "https://www.cnn.com/2022/01/03/tech/theranos-trial-elizabeth-holmes-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211221150325-elizabeth-holmes-theranos-fraud-trial-1217-super-tease.jpg", "publishedAt": "2022-01-04T02:05:03Z", "content": "(CNN Business)After nearly four months of court proceedings in one of the most high-profile tech trials in recent memory, Elizabeth Holmes has been found guilty on four out of 11 federal fraud and co… [+8904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden will make 'brief remarks' Tuesday on rapid spread of the Omicron variant", "description": "President Joe Biden on Tuesday will make brief remarks addressing the rapid spread of the Omicron variant of the coronavirus in the US and the steps his administration is taking to address it, according to the White House.", "url": "https://www.cnn.com/2022/01/03/politics/biden-omicron-covid-remarks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211229130224-2021-top-stories-file-012021-super-tease.jpg", "publishedAt": "2022-01-04T02:01:57Z", "content": "(CNN)President Joe Biden on Tuesday will make brief remarks addressing the rapid spread of the Omicron variant of the coronavirus in the US and the steps his administration is taking to address it, a… [+1796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Twitter rallies in support of news anchor that received racist call", "description": "In St. Louis, Missouri, a viewer called news affiliate KSDK to complain about a Korean anchor who described her family's traditional New Year's meal.", "url": "https://www.cnn.com/videos/business/2022/01/04/viewer-complains-korean-anchor-very-asian-mc-mh-orig.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103191820-michelle-li-ksdk-thumb-2-super-tease.jpg", "publishedAt": "2022-01-04T01:00:52Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Judge blocks Navy vaccine policy for legal challengers citing religious objections", "description": "A federal judge in Texas on Monday ruled against the Biden administration's vaccine requirement for members of the military in a decision that took aim at how the Navy's policies handled those who sought religious exemptions from receiving the Covid-19 vaccin…", "url": "https://www.cnn.com/2022/01/03/politics/navy-covid-vaccine-policy-religious-objection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103183321-us-navy-vaccine-religious-objection-super-tease.jpg", "publishedAt": "2022-01-04T00:47:08Z", "content": "Washington (CNN)A federal judge in Texas on Monday ruled against the Biden administration's vaccine requirement for members of the military in a decision that took aim at how the Navy's policies hand… [+2628 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Elizabeth Holmes trial: The jury has reached a verdict", "description": "The jury in the criminal trial of Elizabeth Holmes, the former CEO and founder of Theranos, has reached a verdict. Holmes was found guilty on four charges — three counts of wire fraud and one count of conspiracy to commit wire fraud. The jury returned no verd…", "url": "https://www.cnn.com/2022/01/03/tech/elizabeth-holmes-verdict/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103180318-01-elizabeth-holmes-theranos-fraud-trial-0103-super-tease.jpg", "publishedAt": "2022-01-04T00:10:01Z", "content": "(CNN Business)The jury in the criminal trial of Elizabeth Holmes, the former CEO and founder of Theranos, has reached a verdict. Holmes was found guilty on four charges three counts of wire fraud and… [+5522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Republicans are in great shape to win the House majority", "description": "Republicans are in a very strong position to win back the House in November, according to new ratings released recently by the Cook Political Report, a nonpartisan political handicapping service based in Washington.", "url": "https://www.cnn.com/2022/01/03/politics/gop-house-2022-midterms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420081324-02-kevin-mccarthy-0415-super-tease.jpg", "publishedAt": "2022-01-03T23:43:32Z", "content": "(CNN)Republicans are in a very strong position to win back the House in November, according to new ratings released recently by the Cook Political Report, a nonpartisan political handicapping service… [+1920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Steve Almasy, CNN", "title": "Sheriff says work to find 2 missing people after destructive Colorado wildfire is hard given the heat and debris", "description": "Two people remain missing in Boulder County, Colorado, as authorities work to survey the damage left by a vicious wildfire, the cause of which is under investigation.", "url": "https://www.cnn.com/2022/01/03/us/colorado-wildfires-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220101131058-01-superior-colorado-fire-snow-1231-super-tease.jpg", "publishedAt": "2022-01-03T23:32:15Z", "content": "(CNN)Two people remain missing in Boulder County, Colorado, as authorities work to survey the damage left by a vicious wildfire, the cause of which is under investigation.\r\nSheriff Joe Pelle said at … [+4922 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Russian businessman's Kremlin ties could prove intelligence 'gold mine' for US, former official says", "description": "A Russian businessman who appeared in US court Monday on securities fraud charges could be a valuable asset in US efforts to gather more information on Russian interference in the 2016 election as well as other intelligence operations, former US officials tel…", "url": "https://www.cnn.com/2022/01/03/politics/vladislav-klyushin-kremlin-ties-federal-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103180740-doj-building-2021-restricted-super-tease.jpg", "publishedAt": "2022-01-03T23:11:40Z", "content": "(CNN)A Russian businessman who appeared in US court Monday on securities fraud charges could be a valuable asset in US efforts to gather more information on Russian interference in the 2016 election … [+5199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yassir Abdullah, Nima Elbagir and Hamdi Alkhshali, CNN", "title": "Sudanese Prime Minister's resignation triggered by military reneging on deal, sources say", "description": "Sudanese Prime Minister Abdalla Hamdok's resignation on Sunday was triggered after the military went back on a \"non-interference\" agreement struck in November and relaunched the feared national intelligence agency, according to Sudanese political sources spea…", "url": "https://www.cnn.com/2022/01/03/africa/sudan-pm-resignation-details-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103145816-abdalla-hamdok-112421-restricted-super-tease.jpg", "publishedAt": "2022-01-03T22:31:44Z", "content": "(CNN)Sudanese Prime Minister Abdalla Hamdok's resignation on Sunday was triggered after the military went back on a \"non-interference\" agreement struck in November and relaunched the feared national … [+4413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Paul LeBlanc, CNN", "title": "New polling shows rising acceptance of political violence 1 year after January 6 riot", "description": "Nearly one year after the January 6 Capitol Hill insurrection, Americans are increasingly likely to say political violence can be justified. This is the disturbing reality laid bare in two recent polls that capture a deeply divided country.", "url": "https://www.cnn.com/2022/01/03/politics/jan-6-capitol-riot-political-violence-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223150955-republicans-trump-2021-lies-super-tease.jpg", "publishedAt": "2022-01-03T22:11:51Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)A year after the January 6 Capitol Hill insurrection, Americans are… [+6438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "New Hampshire Secretary of State Bill Gardner announces retirement after 45 years as the state's top election official", "description": "New Hampshire Secretary of State Bill Gardner announced Monday that he will be retiring, ending his 45-year run as the state's top election official and the most vocal proponent of New Hampshire's status as the first in the nation primary state.", "url": "https://www.cnn.com/2022/01/03/politics/new-hampshire-secretary-of-state-retires/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170912113120-bill-gardner-new-hampshire-super-tease.jpg", "publishedAt": "2022-01-03T22:07:43Z", "content": "(CNN)New Hampshire Secretary of State Bill Gardner announced Monday that he will be retiring, ending his 45-year run as the state's top election official and the most vocal proponent of New Hampshire… [+2305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "'We're staying open': Adams bucks teacher's union request days into new administration", "description": "Eric Adams has started his tenure as New York City mayor by rejecting a request from the city's largest teachers' union to temporarily move public schools to remote learning, capping off a frenetic first 72 hours of his administration.", "url": "https://www.cnn.com/2022/01/03/politics/eric-adams-teachers-union-nyc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211210184634-eric-adams-file-110221-super-tease.jpg", "publishedAt": "2022-01-03T21:35:17Z", "content": "(CNN)Eric Adams has started his tenure as New York City mayor by rejecting a request from the city's largest teachers' union to temporarily move public schools to remote learning, capping off a frene… [+5779 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donie O'Sullivan, CNN", "title": "Rep. Marjorie Taylor Greene says Facebook blocked her account for 24 hours", "description": "Facebook has blocked Rep. Marjorie Taylor Greene from posting on its platform for 24 hours, the Georgia Republican said Monday.", "url": "https://www.cnn.com/2022/01/03/tech/marjorie-taylor-greene-facebook-account-blocked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211021173111-marjorie-taylor-greene-102121-super-tease.jpg", "publishedAt": "2022-01-03T21:14:36Z", "content": "(CNN)Facebook has blocked Rep. Marjorie Taylor Greene from posting on its platform for 24 hours, the Georgia Republican said Monday. \r\nThe congresswoman reacted to the temporary Facebook ban through … [+1655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The one Liz Cheney line every Republican should reflect on today", "description": "Nearly a year after rioters sought to overturn the free and fair presidential election of 2020, the Republican Party faces a stark choice -- framed perfectly by Wyoming Rep. Liz Cheney on Sunday.", "url": "https://www.cnn.com/2022/01/03/politics/liz-cheney-trump-republicans-constitution/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211016180459-liz-cheney-0727-file-super-tease.jpg", "publishedAt": "2022-01-03T20:16:09Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Kara Alaimo", "title": "Twitter's suspension of Marjorie Taylor Greene was the right move at the right time", "description": "On Sunday, Twitter confirmed it had permanently suspended the personal account of Republican Georgia Rep. Marjorie Taylor Greene for violating the company's policy against sharing misinformation about Covid-19. The decision, Kara Alaimo writes, was the right …", "url": "https://www.cnn.com/2022/01/03/opinions/twitter-suspended-marjorie-taylor-greene-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211125100451-marjorie-taylor-greene-1117-super-tease.jpg", "publishedAt": "2022-01-03T19:55:55Z", "content": "Kara Alaimo, an associate professor in the Lawrence Herbert School of Communication at Hofstra University, writes about women and social media. She was spokeswoman for international affairs in the Tr… [+5881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez and Elizabeth Stuart, CNN", "title": "Union vote could trigger 'electronic lockout' of Chicago teachers amid dispute over rising Covid-19 cases", "description": "The Chicago Teachers Union is planning to convene an emergency meeting to vote on whether its teachers should move to virtual teaching amid a surge in Covid-19 cases, according to a union official, setting up a potential \"electronic lockout\" by the school dis…", "url": "https://www.cnn.com/2022/01/03/us/chicago-schools-remote-learning-coronavirus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103140504-chicago-public-school-covid-tests-122821-restricted-super-tease.jpg", "publishedAt": "2022-01-03T19:34:33Z", "content": "(CNN)The Chicago Teachers Union is planning to convene an emergency meeting to vote on whether its teachers should move to virtual teaching amid a surge in Covid-19 cases, according to a union offici… [+3330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Elizabeth Holmes Trial: Jury is deadlocked on three counts, is told to continue deliberating", "description": "The jury tasked with determining the fate of Elizabeth Holmes, the former CEO and founder of failed blood testing startup Theranos in her criminal trial, said that it is unable to come to a unanimous verdict on three of the eleven counts.", "url": "https://www.cnn.com/2022/01/03/tech/elizabeth-holmes-deadlocked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211227163318-03-elizabeth-holmes-theranos-fraud-trial-1223-super-tease.jpg", "publishedAt": "2022-01-03T19:16:41Z", "content": "(CNN Business)The jury tasked with determining the fate of Elizabeth Holmes, the former CEO and founder of failed blood testing startup Theranos in her criminal trial, said that it is unable to come … [+3639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "AMC CEO vows on Twitter to refinance movie theater chain's debt load", "description": "Movie theater chain AMC was a darling of the meme stock crowd in 2021, soaring nearly 1,200% last year thanks to love from rowdy Reddit fans. So what does AMC plan to do for a sequel? For starters, it wants to clean up its balance sheet, which is scarier than…", "url": "https://www.cnn.com/2022/01/03/investing/amc-ceo-tweet-debt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210825091828-amc-movie-theater-0315-super-tease.jpg", "publishedAt": "2022-01-03T19:14:28Z", "content": "New York (CNN Business)Movie theater chain AMC(AMC) was a darling of the meme stock crowd in 2021, soaring nearly 1,200% last year thanks to love from rowdy Reddit fans. So what does AMC plan to do f… [+3095 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "The race to become France's first female president just got tighter", "description": "David A. Andelman writes that as France gears up for a presidential election, for the first time in the nation's history, female candidates occupy three of the principal axes of the political spectrum and may hold the key to the nation's future.", "url": "https://www.cnn.com/2022/01/03/opinions/french-presidential-election-female-future-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211228170844-20211228-french-women-of-politics-gfx-super-tease.jpg", "publishedAt": "2022-01-03T19:08:36Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+7187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Prince Andrew accuser Virginia Giuffre's 2009 settlement with Jeffrey Epstein released", "description": "A 2009 settlement agreement between sex offender Jeffrey Epstein and Virginia Roberts Giuffre -- the woman who accused him of sexual abuse and of trafficking her to Prince Andrew, among others -- was unsealed Monday.", "url": "https://www.cnn.com/2022/01/03/us/virginia-giuffre-jeffrey-epstein-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190906152149-prince-andrew-guifre-maxwell-super-tease.jpg", "publishedAt": "2022-01-03T18:56:18Z", "content": "(CNN)A 2009 settlement agreement between sex offender Jeffrey Epstein and Virginia Roberts Giuffre -- the woman who accused him of sexual abuse and of trafficking her to Prince Andrew, among others -… [+1014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Smith-Spark and Francesca Street, CNN", "title": "British Sikh Army officer becomes first woman of color to ski solo to the South Pole", "description": "Preet Chandi completed battled illness, isolation and extremely cold weather to complete the 700-mile trek to the South Pole in 40 days.", "url": "https://www.cnn.com/travel/article/preet-chandi-completes-south-pole-expedition-idnty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103123301-07b-preet-chandi-super-tease.jpg", "publishedAt": "2022-01-03T18:09:16Z", "content": "(CNN) British-born Sikh army officer Preet Chandi has become the first woman of color to complete a solo expedition to the South Pole\r\nChandi, who has spent the past few months skiing solo and unsupp… [+3351 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Mercedes says its electric concept has 620 miles of range and seats made with mushrooms", "description": "Mercedes has unveiled a new all-electric concept car, the EQXX, that the company claims can go 620 miles on a single charge. The futuristic luxury car is also made with a host of innovative recycled and sustainable materials including mushroom fibers, ground …", "url": "https://www.cnn.com/2022/01/03/business/mercedes-eqxx-concept/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103100434-03-mercedes-eqxx-concept-super-tease.jpeg", "publishedAt": "2022-01-03T17:53:29Z", "content": "(CNN)Mercedes has unveiled a new all-electric concept car, the EQXX, that the company claims can go 620 miles on a single charge. The futuristic luxury car is also made with a host of innovative recy… [+4722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Wall Street is getting greedy again", "description": "The calendar has flipped to 2022 but investors are still partying like it's 2021. Stocks remained near record levels Monday, the first trading day of the year, and investors are ramping up the greed.", "url": "https://www.cnn.com/2022/01/03/investing/stocks-fear-greed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103081120-01-nyse-1231-restricted-super-tease.jpg", "publishedAt": "2022-01-03T17:49:38Z", "content": "New York (CNN Business)The calendar has flipped to 2022 but investors are still partying like it's 2021. Stocks remained near record levels Monday, the first trading day of the year, and investors ar… [+3204 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "Starbucks mandates vaccinations or Covid tests for workers", "description": "To comply with the Biden administration's upcoming vaccine mandate, Starbucks is requiring its workers to be fully vaccinated against Covid-19 or undergo weekly testing, the company recently told employees.", "url": "https://www.cnn.com/2022/01/03/business/starbucks-vaccination-mandate-employees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103115009-us-starbucks-barista-file-restricted-super-tease.jpg", "publishedAt": "2022-01-03T17:43:55Z", "content": "New York (CNN Business)To comply with the Biden administration's upcoming vaccine mandate, Starbucks is requiring its workers to be fully vaccinated against Covid-19 or undergo weekly testing, the co… [+1592 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What does Marjorie Taylor Greene do all day?", "description": "The news that one of Marjorie Taylor Greene's Twitter accounts has been permanently suspended is a bigger blow to the Georgia Congresswoman than you might think.", "url": "https://www.cnn.com/2022/01/03/politics/marjorie-taylor-greene-twitter-permanent-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211125100451-marjorie-taylor-greene-1117-super-tease.jpg", "publishedAt": "2022-01-03T17:43:18Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Singer Omarion says he's definitely not a variant", "description": "Ever since the latest variant of Covid-19, Omicron, has gained ground in the US, jokes calling it the \"Omarion\" variant, after the R&B singer, have been rampant.", "url": "https://www.cnn.com/2022/01/03/entertainment/omarion-covid-19-omicron-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103162003-omarion-covid-19-omicron-cec-file-030520-super-tease.jpg", "publishedAt": "2022-01-03T17:37:45Z", "content": "(CNN)Ever since the latest variant of Covid-19, Omicron, has gained ground in the US, jokes calling it the \"Omarion\" variant, after the R&amp;B singer, have been rampant.\r\nBut Omarion is taking the j… [+1099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "From record high temperatures to snow, these towns are shivering in shock Monday", "description": "Millions woke up this morning with a weather whiplash like no other.", "url": "https://www.cnn.com/2022/01/03/weather/weather-news-snow-storm-cold-temperatures-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103112625-weather-drastic-temperature-drop-sunday-super-tease.jpg", "publishedAt": "2022-01-03T17:34:24Z", "content": "CNN Weather produces a weekly column, publishing Mondays, with the weather news you should be aware of as you plan out your week.Find updates each week here. If you enjoy this, sign up to get emailup… [+6239 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Niger police find cocaine worth nearly $9 million in mayor's truck", "description": "Police in northern Niger have seized more than 200 kilograms (440 pounds) of cocaine worth around $8.7 million that was being transported in the local mayor's official truck, two police sources said on Monday.", "url": "https://www.cnn.com/2022/01/03/africa/niger-mayor-cocaine-seize-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103165241-niger-mayor-cocaine-seize-intl-scli-file-2006-super-tease.jpg", "publishedAt": "2022-01-03T17:09:39Z", "content": "Niamey, NigerPolice in northern Niger have seized more than 200 kilograms (440 pounds) of cocaine worth around $8.7 million that was being transported in the local mayor's official truck, two police … [+1056 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, CNN", "title": "Schumer announces vote to change filibuster rules but faces resistance from Manchin and Sinema", "description": "Senate Majority Leader Chuck Schumer announced Monday that the chamber will take a vote on whether to change the Senate's legislative filibuster rules by Martin Luther King Jr. Day on January 17.", "url": "https://www.cnn.com/2022/01/03/politics/schumer-filibuster-rules-manchin-sinema/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210919210003-chuck-schumer-file-0914-super-tease.jpg", "publishedAt": "2022-01-03T16:55:19Z", "content": "(CNN)Senate Majority Leader Chuck Schumer announced Monday that the chamber will take a vote on whether to change the Senate's legislative filibuster rules by Martin Luther King Jr. Day on January 17… [+2257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "NY AG subpoenas Ivanka Trump and Donald Trump, Jr. in civil investigation", "description": "The New York attorney general's office has subpoenaed two of former President Donald Trump's children for testimony as part of its civil investigation into whether the Trump Organization manipulated the values of its properties.", "url": "https://www.cnn.com/2022/01/03/politics/ivanka-donald-trump-jr-subpoena/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201202190155-ivanka-trump-1027-super-tease.jpg", "publishedAt": "2022-01-03T16:47:52Z", "content": "(CNN)The New York attorney general's office has subpoenaed two of former President Donald Trump's children for testimony as part of its civil investigation into whether the Trump Organization manipul… [+1180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Why Emma Watson almost quit 'Harry Potter' franchise", "description": "The cast and crew of Harry Potter reunite to celebrate the 20th-anniversary release of the first film for an HBO Max special. HLN's Chloe Melas reports.", "url": "https://www.cnn.com/videos/business/2022/01/03/20th-anniversary-harry-potter-cast-revelations-hbo-max-special-mxp-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211227135847-01-harry-potter-20th-anniversary-special-super-tease.jpg", "publishedAt": "2022-01-03T16:45:04Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devon M. Sayers, CNN", "title": "Last parent of the Birmingham 16th Street Baptist Church bombing dies at 93", "description": "The last living parent of one of the four children killed in the terrorist bombing of an African American church in 1963 has died at 93.", "url": "https://www.cnn.com/2022/01/03/us/last-parent-birmingham-church-bombing-maxine-mcnair/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103141333-birmingham-church-bombing-parent-maxine-mcnair-dies-file-091013-super-tease.jpg", "publishedAt": "2022-01-03T16:31:29Z", "content": "(CNN)The last living parent of one of the four children killed in the terrorist bombing of an African American church in 1963 has died at 93.\r\nMaxine McNair died on Sunday, Birmingham Mayor Randall W… [+3076 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Cassano", "title": "Fabletics just launched its Any-Wear Collection, and it's as stylish as it is comfy", "description": "Over the past few years, we've all become very grateful for workout clothing and loungewear. Now we're learning to incorporate that same level of comfort into our everyday wardrobes, and Fabletics' new Any-Wear Collection is here to help with performance-read…", "url": "https://www.cnn.com/2022/01/03/cnn-underscored/fabletics-any-wear-collection-launch/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211230154333-fabletics-hero.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-01-03T16:00:02Z", "content": "Over the past few years, weve all become very grateful for workout clothing and loungewear. Now were learning to incorporate that same level of comfort into our everyday wardrobes, and Fabletics new … [+3831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mark Wolfe for CNN Business Perspectives", "title": "Opinion: We can't afford to let Build Back Better fail", "description": "The Build Back Better bill, the large social safety net and environmental spending bill being considered by Congress, is a once-in-a-generation opportunity to address the nation's growing wealth gap. It would raise taxes on the wealthy and large corporations …", "url": "https://www.cnn.com/2022/01/03/perspectives/build-back-better-wealth-gap-low-income-families/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103101758-02-build-back-better-capitol-child-tax-credit-1215-super-tease.jpg", "publishedAt": "2022-01-03T15:31:04Z", "content": "Mark Wolfe is an energy economist and serves as the executive director of the National Energy Assistance Directors' Association (NEADA), representing the state directors of the Low Income Home Energy… [+2513 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and Mike Hayes, CNN", "title": "Severe weather causes flight cancellations", "description": "More than 20 million people are under winter alerts and snow advisories today from Georgia to New England as strong but quick-moving storm impacts the regions. Follow here for the latest news updates.", "url": "https://www.cnn.com/us/live-news/weather-snow-cancellations-today-us-01-03-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103044234-daily-video-image-southeast-weather-alerts-super-tease.jpg", "publishedAt": "2022-01-03T15:18:46Z", "content": "Over 20 million people are under winter alerts today from Georgia to New England as strong but quick-moving storm impacts the regions.  \r\nThe heaviest snow is expected to fall across portions of the … [+773 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Patton Oswalt defends his longtime friendship with Dave Chappelle", "description": "Patton Oswalt shared a heartfelt letter on social media explaining his longtime friendship with fellow comic Dave Chappelle as controversy over Chappelle's jokes about trans people in his last Netflix special has continued.", "url": "https://www.cnn.com/2022/01/03/entertainment/patton-oswalt-and-dave-chappelle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170922201256-patton-oswalt-annihilation-super-tease.jpg", "publishedAt": "2022-01-03T14:44:51Z", "content": "(CNN)Patton Oswalt shared a heartfelt letter on social media explaining his longtime friendship with fellow comic Dave Chappelle as controversy over Chappelle's jokes about trans people in his last N… [+1956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "White House to invest $1 billion to boost competition in meat-processing industry and lower consumer prices", "description": "The White House on Monday announced it would allocate $1 billion in funding from the American Rescue Plan to independent meat and poultry producers as part of an effort to boost competition in the meat-processing industry and lower prices for consumers.", "url": "https://www.cnn.com/2022/01/03/politics/biden-meat-processing-industry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222111121-01-biden-supply-chain-1222-super-tease.jpg", "publishedAt": "2022-01-03T14:05:50Z", "content": "(CNN)The White House on Monday announced it would allocate $1 billion in funding from the American Rescue Plan to independent meat and poultry producers as part of an effort to boost competition in t… [+2411 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Park, Michael Y Park", "title": "Keep to your resolutions while indulging in delicious and flavorful Craft & Premium Meals", "description": "We don't need to tell you that most people's New Year's resolutions are about improving their wellness. And we don't need to follow up by noting that most people break their New Year's resolutions pretty quickly — after all, even the shiniest new barbell set …", "url": "https://www.cnn.com/2022/01/03/cnn-underscored/blue-apron-new-years-resolutions/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211229120911-blue-apron-new-years-resolutions-hero.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-01-03T14:05:03Z", "content": "We dont need to tell you that most peoples New Years resolutions are about improving their wellness. And we dont need to follow up by noting that most people break their New Years resolutions pretty … [+3137 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "Aoife Beary, Berkeley balcony collapse survivor, dies aged 27", "description": "Aoife Beary, one of the survivors of the 2015 Berkeley balcony collapse that killed six people, has died aged 27.", "url": "https://www.cnn.com/2022/01/03/world/aoife-beary-death-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103062403-aoife-beary-081016-file-super-tease.jpg", "publishedAt": "2022-01-03T13:46:20Z", "content": "(CNN)Aoife Beary, one of the survivors of the 2015 Berkeley balcony collapse that killed six people, has died aged 27.\r\nBeary was left with life-altering injuries after the fourth-floor balcony of an… [+2412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Disney needs a comeback year. Will it get it?", "description": "Disney did not have a magical 2021. Even as Covid-19 vaccines allowed countries around the world to lift restrictions, the company's business struggled. Attendance at its parks disappointed, and momentum from its Disney+ streaming service, once a bright spot,…", "url": "https://www.cnn.com/2022/01/03/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103082546-disney-043021-file-restricted-super-tease.jpg", "publishedAt": "2022-01-03T13:43:13Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6521 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "Wired's top editor: Metaverse 'feels like a terminological land grab'", "description": "The word \"metaverse\" is popping up everywhere. Facebook recently changed its name to Meta Platforms. Nike bought a virtual shoe company to help it expand to the metaverse. And other brands like Gucci and Ralph Lauren have been considering the future of fashio…", "url": "https://www.cnn.com/2022/01/03/media/wired-editor-gideon-lichfield/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211216091527-wired-editor-gideon-lichfield-super-tease.jpg", "publishedAt": "2022-01-03T13:30:12Z", "content": "New York (CNN Business)The word \"metaverse\" is popping up everywhere. Facebook(FB) recently changed its name to Meta Platforms. Nike(NKE) bought a virtual shoe company to help it expand to the metave… [+10618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "A reporter set out on a quest to solve her family's sleep crisis. Here's what she found", "description": "CNN's Chloe Melas is the mom of two young boys, ages 2 and 4. The kids haven't slept through the night except for a few months when they were infants, causing extreme sleep deprivation for her and her husband. Melas set out on a quest with a sleep guru to get…", "url": "https://www.cnn.com/2022/01/03/health/how-to-get-your-kids-to-sleep-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231171817-better-sleep-chloe-melas-1-crib-super-tease.jpg", "publishedAt": "2022-01-03T13:19:15Z", "content": "Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\n (CNN)I'm really tired.\r\nNo, seriously. I don't think I've slept through the nigh… [+6570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel, CNN", "title": "January 6 committee has 'firsthand' knowledge of Trump's behavior during the riot from multiple sources", "description": "The House select committee investigating the January 6 Capitol Hill insurrection has information from multiple sources with firsthand knowledge that describe what then-President Donald Trump was doing during the riot, according to a person familiar with the i…", "url": "https://www.cnn.com/2022/01/03/politics/january-6-committee-firsthand-knowledge-trump-actions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223213345-donald-trump-file-09252021-super-tease.jpg", "publishedAt": "2022-01-03T13:15:53Z", "content": "Washington (CNN)The House select committee investigating the January 6 Capitol Hill insurrection has information from multiple sources with firsthand knowledge that describe what then-President Donal… [+5016 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle L.D. Hanlon, University of Mississippi, and Greg Autry, Arizona State University", "title": "The rules of space haven't been upated in 50 years, and the UN says it's time", "description": "The UN created a working group last month to assess potential threats in space and provide recommendations of responsible behaviors in space.", "url": "https://www.cnn.com/2022/01/03/world/space-law-united-nations-partner-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211214134635-01-iss-exterior-super-tease.jpg", "publishedAt": "2022-01-03T12:37:37Z", "content": "The views expressed in this commentary are solely those of the writers. CNN is showcasing the work of The Conversation, a collaboration between journalists and academics to provide news analysis and … [+6997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kris Fordham, CNN", "title": "The best new hotels to book in 2022", "description": "Luxurious cottages in the Turks and Caicos. A Patagonian lodge in Argentina. Chic NoMad in London. Check out these and 19 other of the best new hotels to book in 2022.", "url": "https://www.cnn.com/travel/article/best-new-hotels-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224154126-new-hotels-rock-hourse-turks-and-caicos-super-tease.jpg", "publishedAt": "2022-01-03T12:08:04Z", "content": "(CNN) Though 2021 was not exactly the year of jet-setting travel that we'd hoped for, we have our fingers crossed for 2022. \r\nFrom cool urban hideaways in Oslo, Sydney and New York to far-flung islan… [+14093 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for January 3: Coronavirus, Capitol riot, Sudan, Ukraine, 5G", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/01/03/us/five-things-january-3-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103044803-covid-testing-line-orlando-file-12302021-restricted-super-tease.jpg", "publishedAt": "2022-01-03T11:29:22Z", "content": "(CNN)Well, it looks like none of us are waking up as multimillionaires. No one won the weekend's Powerball drawing, so tonight's drawing has shot up to a massive $522 million. \r\nHere's what you need … [+5385 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Can weight loss help protect against Covid-19?", "description": "In the holiday season, when the average American can easily pack on a few pounds, experts say there is another reason to pay attention to your weight: Covid-19.", "url": "https://www.cnn.com/2022/01/03/health/covid-weight-loss-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211124202546-02-weight-loss-stock-super-tease.jpg", "publishedAt": "2022-01-03T11:15:16Z", "content": "(CNN)In the holiday season, when the average American can easily pack on a few pounds, experts say there is another reason to pay attention to your weight: Covid-19.\r\nPeople who are overweight or obe… [+8290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Overwhelmed hospitals. Staffing shortages. Businesses closing. Here's how the Omicron wave is ravaging local communities", "description": "Over the weekend, at least five metro Atlanta school districts announced they would shift to remote learning for the first week of the new year as students return to school after a holiday break that saw the Omicron variant spread even further out of control.", "url": "https://www.cnn.com/2022/01/03/us/omicron-variant-covid-local-impacts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220101070508-covid-icu-122721-massachusetts-restricted-super-tease.jpg", "publishedAt": "2022-01-03T10:48:14Z", "content": "(CNN)Over the weekend, at least five metro Atlanta school districts announced they would shift to remote learning for the first week of the new year as students return to school after a holiday break… [+12270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Diksha Madhok, CNN Business", "title": "India is investigating a fake website that offered Muslim women for sale", "description": "The Indian government says it is investigating a website that purported to offer Muslim women for sale, the second time in less than a year that a fake online auction of this kind has sparked outrage in the country.", "url": "https://www.cnn.com/2022/01/03/tech/bulli-bai-india-muslim-women-sale-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103015909-muslim-woman-indian-kashmir-file-08062021-super-tease.jpg", "publishedAt": "2022-01-03T10:29:45Z", "content": "New Delhi (CNN Business)The Indian government says it is investigating a website that purported to offer Muslim women for sale, the second time in less than a year that a fake online auction of this … [+3414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Will Edmonds, CNN", "title": "Tom Stoltman harnesses 'superpower' of autism to become the World's Strongest Man", "description": "As Tom Stoltman crouched down to pick up the fifth and final Atlas Stone, a 210-kilogram (almost 463 pounds) spherical behemoth -- slightly heavier than an upright piano -- and lift it up to a platform at shoulder height, he knew it was the only thing standin…", "url": "https://www.cnn.com/2022/01/03/sport/tom-stoltman-strongest-man-autism-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231123728-tom-stoltman-extra-123121-super-tease.jpg", "publishedAt": "2022-01-03T09:21:06Z", "content": "(CNN)As Tom Stoltman crouched down to pick up the fifth and final Atlas Stone, a 210-kilogram (almost 463 pounds) spherical behemoth -- slightly heavier than an upright piano -- and lift it up to a p… [+5853 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Nectar Gan and Steve George, CNN", "title": "Outcry over Xi'an lockdown tests limits of China's zero-Covid policy", "description": "For residents in China's northwestern city of Xi'an, the start of 2022 is looking a lot like 2020 -- only worse.", "url": "https://www.cnn.com/2022/01/03/china/xian-covid-outbreak-lockdown-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103020935-xian-lockdown-12312021-restricted-super-tease.jpg", "publishedAt": "2022-01-03T08:44:56Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+5988 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Derrick Hinds, CNN", "title": "Severe winter weather grips millions across the eastern US", "description": "More than 14 million people are under winter storm watches and warnings, as a strong winter storm works its way across the eastern US.", "url": "https://www.cnn.com/2022/01/03/weather/us-winter-weather-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103014524-01-buffalo-bills-stadium-snow-01022022-super-tease.jpg", "publishedAt": "2022-01-03T08:17:03Z", "content": "(CNN)More than 14 million people are under winter storm watches and warnings, as a strong winter storm works its way across the eastern US.\r\nThe federal government in Washington, DC is closed Monday,… [+5186 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Derrick Hinds, CNN", "title": "After a muted New Year's weekend, US braces for more Covid disruptions as students return to school", "description": "After a weekend of muted celebrations, Americans face the uncertainty of a new year as the nation battles another coronavirus wave. And concerns are growing about the impact the virus could have over the next several weeks as students return to school.", "url": "https://www.cnn.com/2022/01/03/health/us-coronavirus-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103030637-child-vaccine-file-11222021-restricted-super-tease.jpg", "publishedAt": "2022-01-03T08:14:28Z", "content": "(CNN)After a weekend of muted celebrations, Americans face the uncertainty of a new year as the nation battles another coronavirus wave. And concerns are growing about the impact the virus could have… [+7092 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Map drawn from memory helps man reunite with family decades after abduction", "description": "A man who was abducted as a child in China more than 30 years ago has been reunited with his parents -- thanks to social media, online sleuths and a crude map drawn from memory.", "url": "https://www.cnn.com/2022/01/03/china/china-man-abducted-reunion-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103012849-li-jingwei-hand-drawn-map-01032022-super-tease.jpg", "publishedAt": "2022-01-03T07:25:18Z", "content": "Hong Kong (CNN)A man who was abducted as a child in China more than 30 years ago has been reunited with his parents -- thanks to social media, online sleuths and a crude map drawn from memory.\r\nLi Ji… [+3566 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "The latest on coronavirus pandemic and Omicron variant", "description": "The US kicked off 2022 amid a massive Covid-19 case spike — driven by the highly contagious Omicron variant — that some experts warn will be different than any other time in the pandemic.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-01-03-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175741-04-coronavirus-0213-super-tease.jpg", "publishedAt": "2022-01-03T06:03:18Z", "content": "Indias health minister Mansukh Mandaviya on Sunday urged states to tap into a $3.1 billion Covid-19 emergency fund set aside by the central government last July of which just 17% has been spent.\r\nThe… [+2182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Elizabeth Yuko", "title": "Betty White's legacy goes far beyond the screen", "description": "Many tributes to Betty White have focused on her iconic work as an actor and her award-winning performances. But, Elizabeth Yuko writes, the perpetually sweet (yet occasionally foul-mouthed) grande dame of television had a massive and often overlooked influen…", "url": "https://www.cnn.com/2022/01/02/opinions/betty-white-activism-legacy-yuko/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120117003757-betty-white-file-super-tease.jpg", "publishedAt": "2022-01-03T04:04:01Z", "content": "Elizabeth Yuko, Ph.D., is a bioethicist and writer whose work has appeared in The New York Times, Rolling Stone, The Washington Post, The Atlantic and elsewhere. She is also an adjunct professor at F… [+7376 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Dean Obeidallah", "title": "The question the GOP must answer about January 6", "description": "In the weeks after the 9/11 terrorist attack, then President George W. Bush famously stood before a joint session of Congress and declared to the nations of the world: \"Either you are with us or you are with the terrorists.\" As we approach the one-year annive…", "url": "https://www.cnn.com/2022/01/02/opinions/january-6-insurrection-question-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416124427-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2022-01-03T02:51:01Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5007 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Malaysia floods hit seven states forcing thousands to evacuate", "description": "Seven states in Malaysia were hit by floods on Sunday and thousands of people were evacuated, taking the total affected by heavy rain in the past two weeks to more than 125,000, the National Disaster Management Agency said.", "url": "https://www.cnn.com/2022/01/02/asia/malaysia-floods-evacuation-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102201617-01-malaysia-floods-evacuation-intl-hnk-super-tease.jpg", "publishedAt": "2022-01-03T02:44:16Z", "content": "Seven states in Malaysia were hit by floods on Sunday and thousands of people were evacuated, taking the total affected by heavy rain in the past two weeks to more than 125,000, the National Disaster… [+1960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc and Melanie Zanona, CNN", "title": "Former Democratic leader Harry Reid to lie in state at US Capitol on January 12", "description": "Former Senate Majority Leader Harry Reid will lie in state in the US Capitol Rotunda on January 12, according to a joint statement from House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer, an honor given to few statesmen.", "url": "https://www.cnn.com/2022/01/02/politics/harry-reid-lie-in-state/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211202214444-harry-reid-file-02152020-super-tease.jpg", "publishedAt": "2022-01-03T02:15:23Z", "content": "Washington (CNN)Former Senate Majority Leader Harry Reid will lie in state in the US Capitol Rotunda on January 12, according to a joint statement from House Speaker Nancy Pelosi and Senate Majority … [+2108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Emma Tucker, CNN", "title": "Delizza brand cream puffs recalled due to possible metal fragments", "description": "Dessert manufacturer Poppies International, Inc. is issuing a voluntary recall of the Delizza brand's Belgian Mini Cream Puffs due to the \"possible presence\" of small metal fragments, according to the US Food and Drug Administration.", "url": "https://www.cnn.com/2022/01/02/us/delizza-brand-cream-puffs-recall-metal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102182933-delizza-brand-cream-puffs-recall-metal-super-tease.jpg", "publishedAt": "2022-01-03T01:18:52Z", "content": "(CNN)Dessert manufacturer Poppies International, Inc. is issuing a voluntary recall of the Delizza brand's Belgian Mini Cream Puffs due to the \"possible presence\" of small metal fragments, according … [+1218 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc and Allie Malloy, CNN", "title": "Biden and Harris to deliver remarks on January 6 anniversary", "description": "President Joe Biden and Vice President Kamala Harris will deliver remarks on Thursday to mark the one-year anniversary of the January 6 attack on the US Capitol, the White House said Sunday.", "url": "https://www.cnn.com/2022/01/02/politics/biden-january-6-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223174030-biden-1223-super-tease.jpg", "publishedAt": "2022-01-03T00:14:25Z", "content": "Washington (CNN)President Joe Biden and Vice President Kamala Harris will deliver remarks on Thursday to mark the one-year anniversary of the January 6 attack on the US Capitol, the White House said … [+1864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Sharif Paget, CNN", "title": "One of the three missing people in the Colorado Marshall Fire has been accounted for, sheriff says", "description": "Boulder County Sheriff Joe Pelle said the search continues for the other two.", "url": "https://www.cnn.com/2022/01/02/us/colorado-wildfires-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220101131058-01-superior-colorado-fire-snow-1231-super-tease.jpg", "publishedAt": "2022-01-02T23:59:25Z", "content": "(CNN)One of the three missing people from the Marshall Fire in Colorado has been accounted for, Boulder County Sheriff Joe Pelle said in a news conference Sunday. \r\nThe Marshall Fire tore through Bou… [+4279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy, CNN", "title": "Biden tells Ukrainian president US 'will respond decisively if Russia further invades'", "description": "President Joe Biden told Ukrainian President Volodymyr Zelensky on Sunday that the US and its allies \"will respond decisively if Russia further invades Ukraine,\" according to a readout of a call between the two leaders provided by the White House.", "url": "https://www.cnn.com/2022/01/02/politics/biden-zelensky-call/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211209191312-biden-zelensky-seguridad-ucrania-amenaza-rusia-lkl-jose-levy-00001811-super-tease.png", "publishedAt": "2022-01-02T22:27:53Z", "content": "(CNN)President Joe Biden told Ukrainian President Volodymyr Zelensky on Sunday that the US and its allies \"will respond decisively if Russia further invades Ukraine,\" according to a readout of a call… [+630 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Harwood", "title": "Why Democrats haven't given up on Joe Manchin and voting rights", "description": "Manchin's inability to attract Republican support for his voting rights bill underscores how the filibuster halts action on contentious issues. That's why his Democratic colleagues keep trying to change his mind over his support of the filibuster.", "url": "https://www.cnn.com/2022/01/02/politics/joe-manchin-voting-rights-filibuster/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211219141644-joe-manchin-121721-super-tease.jpg", "publishedAt": "2022-01-02T21:03:30Z", "content": "Washington (CNN)In 1947, the year Joe Manchin was born, the US Senate killed voting-rights legislation -- again. The \"gravedigger,\" liberal Democrats complained, was filibuster rules empowering its o… [+4919 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Stelter: The story of January 6 keeps getting bigger - CNN Video", "description": "Brian Stelter says January 6 is a date that some want to forget, others are trying to deny, and still others are determined to remember. He plays clips from some of the harrowing news coverage of the Capitol attack and talks with Hunter Walker and Grace Seger…", "url": "https://www.cnn.com/videos/business/2022/01/02/stelter-the-story-of-january-6-keeps-getting-bigger.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102141406-rs-a-block-1-brian-super-tease.jpg", "publishedAt": "2022-01-02T20:05:31Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "AT&T, Verizon CEOs reject US request for 5G deployment delay", "description": "The chief executives of AT&T and Verizon Communications rejected a request to delay the planned Jan. 5 introduction of new 5G wireless service over aviation safety concerns but offered to temporarily adopt new safeguards.", "url": "https://www.cnn.com/2022/01/02/business/5g-deployment-verizon-att/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102140052-att-5g-tower-restricted-super-tease.jpg", "publishedAt": "2022-01-02T20:03:22Z", "content": "(CNN)The chief executives of AT&amp;T and Verizon Communications rejected a request to delay the planned Jan. 5 introduction of new 5G wireless service over aviation safety concerns but offered to te… [+2752 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arnaud Siad, CNN", "title": "World-renowned Kenyan conservationist Richard Leakey dies at 77", "description": "Kenyan paleoanthropologist and conservationist Richard Leakey, who unearthed evidence that helped prove humankind evolved in Africa, died on Sunday at the age of 77, Kenya's President Uhuru Kenyatta confirmed in a statement.", "url": "https://www.cnn.com/2022/01/02/world/richard-leakey-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102133038-01-richard-leakey-restricted-super-tease.jpg", "publishedAt": "2022-01-02T19:48:35Z", "content": "(CNN)Kenyan paleoanthropologist and conservationist Richard Leakey, who unearthed evidence that helped prove humankind evolved in Africa, died on Sunday at the age of 77, Kenya's President Uhuru Keny… [+1323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "34% of Americans say violence against government is sometimes justified, new poll finds", "description": "Thirty-four percent of Americans think violent action against the government is sometimes justified, according to a new poll from The Washington Post and the University of Maryland released days ahead of the one-year anniversary of the insurrection at the US …", "url": "https://www.cnn.com/2022/01/02/politics/january-6-poll-violence-against-government/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727153745-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2022-01-02T19:41:40Z", "content": "Washington (CNN)Thirty-four percent of Americans think violent action against the government is sometimes justified, according to a new poll from The Washington Post and the University of Maryland re… [+3451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Tinker and Rachel Janfaza, CNN", "title": "Further clarification 'coming very soon' to CDC Covid-19 isolation guidelines", "description": "Dr. Anthony Fauci said he anticipates \"further clarification\" on the US Centers for Disease Control and Prevention's updated guidelines to end the Covid-19 isolation period after just five days for people who are not exhibiting symptoms.", "url": "https://www.cnn.com/2022/01/02/politics/fauci-cdc-to-clarify-guidelines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102105136-anthony-fauci-sotu-0102-super-tease.jpg", "publishedAt": "2022-01-02T17:51:16Z", "content": "Washington, DC (CNN)Dr. Anthony Fauci said he anticipates \"further clarification\" on the US Centers for Disease Control and Prevention's updated guidelines to end the Covid-19 isolation period after … [+2381 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Cheung and Tara John, CNN", "title": "Independent Hong Kong news outlet Citizen News shuts down over safety fears", "description": "The independent Hong Kong news site Citizen News said it will be shutting down on Tuesday, citing the deteriorating media environment in the city and the need to protect its staff.", "url": "https://www.cnn.com/2022/01/02/media/hong-kong-citizen-news-shuts-down-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102113829-citizen-news-hong-kong-super-tease.jpg", "publishedAt": "2022-01-02T17:04:00Z", "content": "Hong Kong (CNN)The independent Hong Kong news site Citizen News said it will be shutting down on Tuesday, citing the deteriorating media environment in the city and the need to protect its staff.\r\nCi… [+2841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Reporter who covered Capitol riot describes moment that haunts him", "description": "Rolling Stone reporter Hunter Walker, who was at the Capitol before the January 6 insurrection, tells CNN's Brian Stelter the moment he realized rioters had breached the building.", "url": "https://www.cnn.com/videos/media/2022/01/02/hunter-walker-rolling-stone-reporter-capitol-riot-flashback-rs-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102114643-hunter-walker-super-tease.jpg", "publishedAt": "2022-01-02T17:01:56Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Around the World in Eighty Days' takes the Jules Verne classic in a different direction", "description": "What seems like a not-necessary idea actually turns into a pretty good one with \"Around the World in Eighty Days,\" adapting Jules Verne's novel into an eight-episode Masterpiece series, one already renewed for another voyage. David Tennant plays the unlikely …", "url": "https://www.cnn.com/2022/01/02/entertainment/around-the-world-in-eighty-days-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211230150514-around-the-world-in-80-days-pbs-super-tease.jpg", "publishedAt": "2022-01-02T16:55:48Z", "content": "(CNN)What seems like a not-necessary idea actually turns into a pretty good one with \"Around the World in Eighty Days,\" adapting Jules Verne's novel into an eight-episode Masterpiece series, one alre… [+2317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Foren Clark, CNN", "title": "From Bob Dylan to Harry Styles, these are some of the stars that made history at the Troubadour", "description": "The Troubadour, an iconic West Hollywood music venue, doesn't need much of an introduction. Since the club opened its doors in 1957, musical superstars have launched their careers and introduced the world to future best-selling records by playing to its intim…", "url": "https://www.cnn.com/2022/01/02/entertainment/the-troubadour-history-film/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211208175138-troubadour-april-2020-super-tease.jpg", "publishedAt": "2022-01-02T16:38:04Z", "content": "You can go behind the scenes with Carole King and James Taylor as they plan their Troubadour Reunion Tour in the new CNN Film \"Carole King &amp; James Taylor: Just Call Out My Name\" which premieres o… [+7539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "US education secretary warns of 'bumps in the road' as schools reopen amid Covid surge", "description": "There will be \"bumps in the road\" as schools attempt to reopen in the new year amid a record surge in Covid-19 cases, US Education Secretary Miguel Cardona said Sunday.", "url": "https://www.cnn.com/2022/01/02/politics/miguel-cardona-warns-school-reopening-covid-surge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102101307-miguel-cardona-file-super-tease.jpg", "publishedAt": "2022-01-02T15:46:25Z", "content": "Washington, DC (CNN)There will be \"bumps in the road\" as schools attempt to reopen in the new year amid a record surge in Covid-19 cases, US Education Secretary Miguel Cardona said Sunday.\r\nCardona, … [+2243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "Steph Curry makes a three-pointer for the 158th consecutive game to break his own NBA record", "description": "The records just keep on coming on for Steph Curry. The superstar guard made a three-pointer for the 158th consecutive game to break his own NBA record as the Golden State Warriors beat the Utah Jazz 123-116 in Salt Lake City on Saturday.", "url": "https://www.cnn.com/2022/01/02/sport/steph-curry-3-pointer-158th-consecutive-nba-record-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102094523-steph-curry-0101-super-tease.jpg", "publishedAt": "2022-01-02T15:14:10Z", "content": "(CNN)The records just keep on coming on for Steph Curry. The superstar guard made a three-pointer for the 158th consecutive game to break his own NBA record as the Golden State Warriors beat the Utah… [+624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donie O'Sullivan, CNN", "title": "One of Marjorie Taylor Greene's verified Twitter accounts permanently suspended from Twitter", "description": "Twitter has permanently suspended Georgia GOP Rep. Marjorie Taylor Greene's Twitter account @mtgreenee, the company confirmed to CNN Sunday morning.", "url": "https://www.cnn.com/2022/01/02/politics/marjorie-taylor-greene-twitter-suspension/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102092949-marjorie-taylor-greene-092221-file-super-tease.jpg", "publishedAt": "2022-01-02T15:07:42Z", "content": "(CNN)Twitter has permanently suspended Georgia GOP Rep. Marjorie Taylor Greene's Twitter account @mtgreenee, the company confirmed to CNN Sunday morning. \r\nThis story is breaking and will be updated."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "Start your week smart: Covid-19, North Korea, Betty White, Capitol riot, New Mexico", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2022/01/02/us/five-things-january-2-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231232726-32-new-year-2022-unf-super-tease.jpg", "publishedAt": "2022-01-02T13:53:28Z", "content": "Happy New Year! If you've made any resolutions, we hope they're off to a great start. If you still need some ideas, consider one of these financial resolutions to make your 2022 -- and beyond -- the … [+3779 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Can the stock market's momentum continue into 2022?", "description": "The stock market just wrapped up one of its best years on record. Can it repeat its stellar performance in 2022, even when faced with inflation concerns and rising interest rates?", "url": "https://www.cnn.com/2022/01/02/investing/stocks-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231091842-new-york-stock-exchange-121321-file-restricted-super-tease.jpg", "publishedAt": "2022-01-02T13:48:09Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)The stock market just wrapped up one of its bes… [+4416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gawon Bae, CNN", "title": "An unidentified person crossed the heavily militarized border from South Korea into North Korea", "description": "An unidentified person has crossed the heavily militarized border from South Korea into North Korea, the South Korean military said on Sunday.", "url": "https://www.cnn.com/2022/01/02/asia/north-korea-south-korea-border-crossing-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102073420-north-korea-south-korea-border-file-restricted-super-tease.jpg", "publishedAt": "2022-01-02T12:56:09Z", "content": "Seoul, South Korea (CNN)An unidentified person has crossed the heavily militarized border from South Korea into North Korea, the South Korean military said on Sunday.\r\nThe unidentified person was spo… [+1039 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a> and Mike Hayes, CNN", "title": "The latest on coronavirus pandemic and Omicron variant", "description": "The US kicked off 2022 amid a massive Covid-19 case spike — driven by the highly contagious Omicron variant — that some experts warn will be different than any other time in the pandemic.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-01-02-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175742-05-coronavirus-0213-super-tease.jpg", "publishedAt": "2022-01-02T12:55:24Z", "content": "At least five metro Atlanta school districts will begin with remote learning during the first week of the new year, as students prepare to return to school following the holiday break amid rising num… [+906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Mali proposes five-year election delay to West African bloc", "description": "Mali's interim authorities proposed to its West African neighbors that a transition back to democracy following a 2020 military coup be extended by five years, the foreign minister said in comments broadcast on Saturday.", "url": "https://www.cnn.com/2022/01/02/africa/mali-proposes-five-year-election-delay-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210529042841-assimi-goita-file-super-tease.jpg", "publishedAt": "2022-01-02T12:02:38Z", "content": "Bamako, MaliMali's interim authorities proposed to its West African neighbors that a transition back to democracy following a 2020 military coup be extended by five years, the foreign minister said i… [+1738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar and Haley Brink, CNN meteorologists", "title": "Tornadoes from rare supercell caused damage in Georgia", "description": "Rare \"low precipitation\" (LP) supercells spawned tornadoes across at least two Georgia counties on New Year's Eve. Even though Friday's forecast called for severe storms, including tornadoes, it was a highly unusual event.", "url": "https://www.cnn.com/2022/01/02/weather/weather-rare-georgia-new-years-eve-tornado/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220101121047-madison-georgia-storm-123121-super-tease.jpg", "publishedAt": "2022-01-02T11:58:42Z", "content": "(CNN)Rare \"low precipitation\" (LP) supercells spawned tornadoes across at least two Georgia counties on New Year's Eve. Even though Friday's forecast called for severe storms, including tornadoes, it… [+4823 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "Vancouver Canucks equipment manager thanks fan who noticed his melanoma at game against Seattle Kraken. 'You changed my life'", "description": "Two NHL teams have combined to give ice hockey fan Nadia Popovici a $10,000 scholarship for medical school as a thank you for advising Vancouver Canucks assistant equipment manager Brian \"Red\" Hamilton to get a mole behind his neck checked out.", "url": "https://www.cnn.com/2022/01/02/sport/vancouver-canucks-seattle-kraken-fan-melanoma-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220102110434-brian-hamilton-super-tease.jpg", "publishedAt": "2022-01-02T11:30:21Z", "content": "(CNN)Two NHL teams have combined to give ice hockey fan Nadia Popovici a $10,000 scholarship for medical school as a thank you for advising Vancouver Canucks assistant equipment manager Brian \"Red\" H… [+3306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia M. Chan, CNN", "title": "How to support animal lover Betty White's favorite cause", "description": "When it came to people, Betty White loved to make them laugh. When it came to animals, she loved to lend them a helping hand.", "url": "https://www.cnn.com/2022/01/02/us/betty-white-animal-charities-iyw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231153757-02-betty-white-animal-activism-super-tease.jpg", "publishedAt": "2022-01-02T11:00:44Z", "content": "(CNN)When it came to people, Betty White loved to make them laugh. When it came to animals, she loved to lend them a helping hand. \r\nA lifelong animal lover, White -- who died Friday at age 99 -- sai… [+5243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Elite Afghan military pilots resettled in US fear for family they had to leave behind", "description": "Belal Khohestani wishes the United States would feel like home. The former pilot for the Afghan Special Mission Wing -- the elite of Afghanistan's military -- recently moved from Fort Pickett in Virginia to Chicago, where he has found a place to live and a ro…", "url": "https://www.cnn.com/2022/01/02/politics/afghan-pilots-us-resettle-families/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231135924-02-drew-horn-super-tease.jpg", "publishedAt": "2022-01-02T09:01:37Z", "content": "(CNN)Belal Khohestani wishes the United States would feel like home. The former pilot for the Afghan Special Mission Wing -- the elite of Afghanistan's military -- recently moved from Fort Pickett in… [+6464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "'No worries,' 'you're on mute' and 'circle back' should be banished, annual list says", "description": "\"No worries,\" \"at the end of the day,\" \"you're on mute,\" and the dreaded \"supply chain\": These are the phrases thousands of English speakers  finally heard enough of over the past year, Lake Superior State University says.", "url": "https://www.cnn.com/2022/01/02/us/banished-words-2021-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190102162757-20190102-words-drop-from-vocabulary-gfx-super-tease.jpg", "publishedAt": "2022-01-02T08:04:57Z", "content": "(CNN)\"No worries,\" \"at the end of the day,\" \"you're on mute,\" and the dreaded \"supply chain\": These are the phrases thousands of English speakers have finally heard enough of. \r\nThey and several othe… [+2971 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Wallace and Matt McFarland, CNN", "title": "Holiday flight cancellations soar with Covid-19 disruptions and bad weather", "description": "Thousands of US flights were canceled over New Year's weekend as a combination of Covid-19 disruptions and wintry weather slowed travel. Flight cancellations have trended up steadily since Christmas Eve, hitting a new peak Saturday as millions travel over the…", "url": "https://www.cnn.com/2022/01/02/economy/holiday-flight-cancellations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211231081438-flight-cancellations-super-tease.jpg", "publishedAt": "2022-01-02T06:27:58Z", "content": "Washington, DC (CNN)Thousands of US flights were canceled over New Year's weekend as a combination of Covid-19 disruptions and wintry weather slowed travel. Flight cancellations have trended up stead… [+3262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget, CNN", "title": "Key West's Southernmost Point buoy damaged after men burn a Christmas tree in front of it, police say", "description": "The iconic Southernmost Point landmark, an anchored concrete buoy in Key West, Florida, sustained \"extensive damage\" early Saturday morning after vandals placed a Christmas tree in front of it which they lit on fire, Key West Police said in statement.", "url": "https://www.cnn.com/2022/01/01/us/key-west-southernmost-point-burned-vandals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220101221138-key-west-landmark-vandals-fire-super-tease.jpg", "publishedAt": "2022-01-02T04:35:10Z", "content": "(CNN)The iconic Southernmost Point landmark, an anchored concrete buoy in Key West, Florida, sustained \"extensive damage\" early Saturday morning after vandals placed a Christmas tree in front of it w… [+384 chars]"}]}