{"status": "ok", "totalResults": 119, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Raul A. Reyes", "title": "What we know so far about Adam Toledo's death is unacceptable", "description": "Raul Reyes writes that there has been a disproportionate focus on the circumstances surrounding the shooting, rather than on the fact that a police officer killed an unarmed child. Sadly, this kind of violence is familiar to Latino communities -- and that sho…", "url": "https://www.cnn.com/2021/04/19/opinions/adam-toledo-police-shooting-unacceptable-reyes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419133346-raul-reyes-op-ed-super-tease.jpg", "publishedAt": "2021-04-19T19:14:33Z", "content": "Raul A. Reyes is an attorney and a member of the USA Today board of contributors. Follow him on Twitter @RaulAReyes. The opinions expressed in this commentary are solely those of the author. View mor… [+4353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Whitson Gordon", "title": "Easily organize all of your gadgets with these essential tips", "description": "We like to keep things organized here at CNN Underscored. But if you're stuck working from home and don't have a lot of space to store your gear, you're probably finding yourself buried under a desk full of clutter.", "url": "https://www.cnn.com/2021/04/19/cnn-underscored/best-ways-to-organize-your-technology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419140812-2-best-way-to-organize-tech-super-169.jpg", "publishedAt": "2021-04-19T19:00:45Z", "content": "We like to keep things organized here at CNN Underscored. But if youre stuck working from home and dont have a lot of space to store your gear, youre probably finding yourself buried under a desk ful… [+6775 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Summer concerts are almost here, but will they be safe? What you should know", "description": "The US Centers for Disease Control and Prevention has recommended that both vaccinated and unvaccinated people avoid medium or large gatherings. But if you decide to attend a concert, here's what you should know to be as safe as possible.", "url": "https://www.cnn.com/travel/article/concert-music-festival-safety-pandemic-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210406162231-outdoor-concert-social-distancing-0321-restricted-super-tease.jpg", "publishedAt": "2021-04-19T18:56:44Z", "content": "Kristen Rogers, CNNPublished 19th April 2021\r\nEditor's Note There are few no-risk activities during the Covid-19 pandemic, but there are ways to mitigate risks. Fully vaccinated people are, of course… [+5609 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "CNN to host climate crisis town hall with Biden administration officials", "description": "Senior Biden administration officials this week will answer questions on how President Joe Biden plans to remake US climate policy in a globally broadcast CNN town hall, the network announced Monday.", "url": "https://www.cnn.com/2021/04/19/politics/cnn-climate-town-hall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419144802-cnn-climate-crisis-town-hall-split-super-tease.jpg", "publishedAt": "2021-04-19T18:31:12Z", "content": "Washington, DC (CNN)Senior Biden administration officials this week will answer questions on how President Joe Biden plans to remake US climate policy in a globally broadcast CNN town hall, the netwo… [+3087 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aditi Sangal", "title": "India will offer Covid-19 vaccines to everyone 18+ in May", "description": "Indian citizens who are 18 years or older will be eligible for the Covid-19 vaccines starting May 1. Here's how it will work.", "url": "https://www.cnn.com/2021/04/19/asia/india-coronavirus-vaccine-18-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419141517-01-vaccine-line-india-0412-super-tease.jpg", "publishedAt": "2021-04-19T18:25:39Z", "content": "(CNN)Indian citizens 18 or older will be eligible for the Covid-19 vaccines starting May 1, according to a statement released by the Ministry of Health and Family Welfare on the Press Information Bur… [+2527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackson Dill and Monica Garrett, CNN", "title": "Old Man Winter to bring unusual late-season snow and record cold this week", "description": "A late-season winter storm early this week will bring snow to over a dozen states, with some cities at risk of accumulations more than a month after their typical last date for snowfall.", "url": "https://www.cnn.com/2021/04/19/weather/snow-cold-winter-spring-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419094446-pattern-card-image-041921-super-tease.jpg", "publishedAt": "2021-04-19T18:12:16Z", "content": "A cold front heading south through the central U.S. packs a punch this week, bringing sub-freezing overnight temperatures all the way into south Texas by Wed morning. snow is likely, especially in th… [+150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Maria Santana, CNN", "title": "US immigration agencies ordered to end use of terms 'alien' and 'assimilation'", "description": "The leaders of two US immigration agencies issued new guidance Monday ordering staff to end the use of terms such as \"illegal alien\" and \"assimilation,\" according to two officials, words that immigration advocates had criticized as dehumanizing.", "url": "https://www.cnn.com/2021/04/19/politics/us-immigration-agencies-alien-assimilation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210316151003-102-border-crisis-0314-super-tease.jpg", "publishedAt": "2021-04-19T18:05:17Z", "content": "(CNN)The leaders of two US immigration agencies issued new guidance Monday ordering staff to end the use of terms such as \"illegal alien\" and \"assimilation,\" according to two officials, words that im… [+998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Harris pitches American Jobs Plan during first extended economic speech since becoming VP", "description": "Kamala Harris on Monday delivered her first extended economic speech since becoming vice president, making a pitch for the Biden administration's infrastructure plan and touting the White House's accomplishments since President Joe Biden was sworn in.", "url": "https://www.cnn.com/2021/04/19/politics/kamala-harris-economic-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419135329-harris-american-jobs-plan-0419-super-tease.jpg", "publishedAt": "2021-04-19T18:03:20Z", "content": "(CNN)Kamala Harris on Monday delivered her first extended economic speech since becoming vice president, making a pitch for the Biden administration's infrastructure plan and touting the White House'… [+2698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "Two Russian agents have been linked to a high-profile poisoning and a deadly explosion, but there's little Europe can do", "description": "That the Czech Republic is pointing the finger at two Russian agents for a deadly explosion at an ammunition depot in the country is remarkable. The fact that the agents in question are the same pair accused of trying to poison a former Russian spy on English…", "url": "https://www.cnn.com/2021/04/19/europe/salisbury-suspects-czech-republic-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419140522-alexander-petrov-ruslan-boshirov-split-super-tease.jpg", "publishedAt": "2021-04-19T17:26:10Z", "content": "(CNN)That the Czech Republic is pointing the finger at two Russian agents for a deadly explosion at an ammunition depot in the country is remarkable. The fact that the agents in question are the same… [+8161 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Maxine Waters just made a volatile situation much, much worse", "description": "Minnesota -- and the rest of the country -- is on a knife's edge waiting for a verdict in the murder trial of Derek Chauvin, the police officer charged in the death of George Floyd.", "url": "https://www.cnn.com/2021/04/19/politics/maxine-waters-derek-chauvin-blm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419102705-01-maxine-waters-protest-0417-super-tease.jpg", "publishedAt": "2021-04-19T17:22:41Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elinda Labropoulou, CNN", "title": "Greece opens its doors to Covid-free tourists", "description": "Greece has lifted quarantine requirements for vaccinated travelers and those testing negative for Covid-19 from key tourism markets, including Europe, the UK and the United States, in what officials called \"baby steps\" on the road back to normality.", "url": "https://www.cnn.com/travel/article/greece-opens-vaccinated-tourists/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200619144647-gettyimages-1220017112-super-tease.jpg", "publishedAt": "2021-04-19T17:06:45Z", "content": "(CNN) Greece has lifted quarantine requirements for vaccinated travelers and those testing negative for Covid-19 from key tourism markets, including Europe, the UK and the United States, in what offi… [+5578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ashley-strickland-profile\">Ashley Strickland</a>, Melissa Macaya, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "NASA's Mars helicopter takes its first flight", "description": "NASA's Ingenuity helicopter this morning successfully completed its historic flight on Mars and safely landed back on the surface. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/mars-helicopter-ingenuity-flight-04-19-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419065911-04-mars-helicopter-flight-0419-super-tease.jpg", "publishedAt": "2021-04-19T17:03:25Z", "content": "The Ingenuity helicopter has successfully completed its historic flight on Mars and safely landed back on the surface, according to NASA.\r\nThe first powered, controlled flight on another planet took … [+572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Kimberly Guilfoyle joins Eric Greitens' US Senate campaign in Missouri", "description": "Missouri Senate candidate Eric Greitens announced Monday that Kimberly Guilfoyle, a top official on former President Donald Trump's 2020 campaign, will serve as the national chair of his Senate bid.", "url": "https://www.cnn.com/2021/04/19/politics/kimberly-guilfoyle-eric-greitens-senate-campaign-missouri/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200825144357-01-rnc-ratings-super-tease.jpg", "publishedAt": "2021-04-19T17:01:41Z", "content": "(CNN)Missouri Senate candidate Eric Greitens announced Monday that Kimberly Guilfoyle, a top official on former President Donald Trump's 2020 campaign, will serve as the national chair of his Senate … [+1413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jolie Kerr", "title": "Your complete guide to spring cleaning", "description": "Spring cleaning can be totally overwhelming. To help you get started and to stay focused, we talked to experts about everything you need to end up with a sparkling clean home.", "url": "https://www.cnn.com/2021/04/19/cnn-underscored/spring-cleaning-checklist/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416125431-springcleaninglead-super-169.jpg", "publishedAt": "2021-04-19T16:59:02Z", "content": "Spring cleaning can be totally overwhelming there are so many jobs to be done, and most of them are labor- and time-intensive. If youre a person who doesnt know where to begin with your spring cleani… [+8567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Holmes, CNN", "title": "Biden White House removes Trump-era scientist from overseeing climate report", "description": "White House officials have transferred Trump-appointed scientist Betsy Weatherhead from her position overseeing the US government's report on the effects of climate change, a senior administration official told CNN.", "url": "https://www.cnn.com/2021/04/19/politics/white-house-removes-trump-era-scientist/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201020163629-white-house-file-1004-super-tease.jpg", "publishedAt": "2021-04-19T16:58:54Z", "content": "Washington, DC (CNN)White House officials have transferred Trump-appointed scientist Betsy Weatherhead from her position overseeing the US government's report on the effects of climate change, a seni… [+878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Waters calls for protesters to 'get more confrontational' if no guilty verdict is reached in Derek Chauvin trial", "description": "Rep. Maxine Waters on Saturday night called for protesters to \"stay on the street\" and \"get more confrontational\" if former Minneapolis police officer Derek Chauvin is acquitted in the killing of George Floyd.", "url": "https://www.cnn.com/2021/04/19/politics/maxine-waters-derek-chauvin-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419102705-01-maxine-waters-protest-0417-super-tease.jpg", "publishedAt": "2021-04-19T16:48:01Z", "content": "Washington (CNN)Rep. Maxine Waters on Saturday night called for protesters to \"stay on the street\" and \"get more confrontational\" if former Minneapolis police officer Derek Chauvin is acquitted in th… [+3940 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Uber is recruiting drivers. Some existing drivers are upset", "description": "When the coronavirus took hold in the United States, ride-hail drivers watched their income evaporate. With people largely staying at home, there were drastically fewer people to transport. Now facing renewed demand from passengers, Uber has announced a $250 …", "url": "https://www.cnn.com/2021/04/19/tech/uber-lyft-drivers-stimulus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416115537-uber-car-2020-file-super-tease.jpg", "publishedAt": "2021-04-19T16:43:22Z", "content": "(CNN Business)When the coronavirus took hold in the United States, ride-hail drivers watched their income evaporate. With people largely staying at home, there were drastically fewer people to transp… [+8658 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "LinkedIn billionaire: Cut off funding for politicians who limit voting rights", "description": "A growing number of CEOs are speaking out on voting rights. LinkedIn co-founder Reid Hoffman is urging business leaders to back up their verbal support with concrete action that will send a message to politicians.", "url": "https://www.cnn.com/2021/04/19/business/voting-rights-reid-hoffman-linkedin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416153643-reid-hoffman-2019-file-super-tease.jpg", "publishedAt": "2021-04-19T16:34:35Z", "content": "I believe that companies who show a strong support for American values and the right to vote for all citizens may gain more business and elevated brand value,\"\r\nLinkedIn co-founder Reid Hoffman"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kerry Flynn, CNN Business", "title": "The media unionization wave has come to Insider", "description": "Employees at Insider, the 13-year-old site formerly known as Business Insider, announced on Monday their intention to unionize with the NewsGuild.", "url": "https://www.cnn.com/2021/04/19/media/insider-union/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419085954-business-insider-app-file-restricted-super-tease.jpg", "publishedAt": "2021-04-19T16:19:17Z", "content": "New York (CNN Business)Employees at Insider, the 13-year-old site formerly known as Business Insider, announced on Monday their intention to unionize with the NewsGuild. \r\nInsider was one of the few … [+3057 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn, CNN Business", "title": "Trump wants people to boycott Coke. His properties are still serving it", "description": "Over the past few years former President Donald Trump has called for boycotts against a number of companies, so it's hardly unusual to see him add Coca-Cola, Delta and other corporate giants that recently spoke out against Georgia's laws restricting voting ac…", "url": "https://www.cnn.com/2021/04/19/business/donald-trump-coke-boycott/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415171107-donald-trump-201126-file-super-tease.jpg", "publishedAt": "2021-04-19T16:16:46Z", "content": "New York (CNN Business)Over the past few years former President Donald Trump has called for boycotts against a number of companies, so it's hardly unusual to see him add Coca-Cola, Delta and other co… [+5950 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, CNN", "title": "First on CNN: Ayanna Pressley launches policy pledge to help juice momentum for progressive movement", "description": "Rep. Ayanna Pressley is launching a new policy pledge for elected officials and candidates up and down the ballot in the hopes of highlighting support for progressive policies and channeling that popularity into momentum for the left's agenda.", "url": "https://www.cnn.com/2021/04/19/politics/ayanna-pressley-pledge-progressives/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200828115424-06-march-on-washington-2020-super-tease.jpg", "publishedAt": "2021-04-19T16:13:44Z", "content": "(CNN)Rep. Ayanna Pressley is launching a new policy pledge for elected officials and candidates up and down the ballot in the hopes of highlighting support for progressive policies and channeling tha… [+4329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Now you can adopt one of Notre-Dame's grotesque stone creatures to help fund rebuilding", "description": "A conservation group is offering members of the public the chance to donate to restore specific artifacts at the Notre-Dame cathedral in Paris, which was partially destroyed by fire in 2019.", "url": "https://www.cnn.com/style/article/notre-dame-cathedral-crowdfunder-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419091946-02-notre-dame-grotesques-super-tease.jpg", "publishedAt": "2021-04-19T16:00:27Z", "content": "A conservation group is offering members of the public the chance to donate to restore specific artifacts at the Notre-Dame cathedral in Paris, which was partially destroyed by fire in 2019.\r\nFriends… [+2235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan, CNN", "title": "A 7-year-old girl was fatally shot in the drive-thru lane of a Chicago McDonald's", "description": "Jaslyn Adams and her 29-year-old father were in the drive-thru lane of a McDonald's when someone shot into their car, family members told CNN affiliate WBBM.", "url": "https://www.cnn.com/2021/04/19/us/chicago-shooting-7-year-old/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419081004-01-chicago-girl-killed-drive-thru-super-tease.jpg", "publishedAt": "2021-04-19T15:59:13Z", "content": "(CNN)Chicago police are looking for whoever opened fire on a car Sunday afternoon, killing a 7-year-old girl in the city's West Side. \r\nJaslyn Adams and her 29-year-old father were in the drive-thru … [+461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "White House backtracks after Biden calls border situation a 'crisis'", "description": "The White House on Monday backtracked after President Joe Biden over the weekend described the influx of migrant children on the country's southern border as a \"crisis,\" in what appeared to be a notable shift in language.", "url": "https://www.cnn.com/2021/04/19/politics/biden-border-crisis-unaccompanied-minors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418073547-01-joe-biden-0417-super-tease.jpg", "publishedAt": "2021-04-19T15:55:12Z", "content": "(CNN)The White House on Monday backtracked after President Joe Biden over the weekend described the influx of migrant children on the country's southern border as a \"crisis,\" in what appeared to be a… [+5311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "The best sales to shop today: Best Buy, Roomba, Eero and more", "description": "Today, you'll find a deal on the Fitbit Inspire 2, a discounted Eero Mesh Wi-Fi System and savings on a range of Roomba robot vacuums. All that and more below.", "url": "https://www.cnn.com/2021/04/19/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419111112-0419lead-super-169.jpg", "publishedAt": "2021-04-19T15:51:37Z", "content": "Today, youll find a deal on the Fitbit Inspire 2, a discounted Eero Mesh Wi-Fi System and savings on a range of Roomba robot vacuums. All that and more below.\r\nFind savings on most any tech you need … [+8655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Christina Vercelletto", "title": "The best litter boxes — and litter — for your cat, according to vets", "description": "As you've no doubt noticed, there are enough kinds of litter and litter boxes to fill an Amazon warehouse. How do you know what to go with? We got guidance and tips from veterinarians on creating the best possible setup for your favorite feline.", "url": "https://www.cnn.com/2021/04/19/cnn-underscored/best-cat-litter-box/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414115737-litterleadchewy-super-169.jpg", "publishedAt": "2021-04-19T14:55:04Z", "content": "Much like dog walking is to our canine parent friends, tending to a litter pan is a part of your routine once you bring home that new fuzzy, meowing family member. But that doesnt mean it has to be a… [+7851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How 1 risky decision could hurt Republicans' Senate chances", "description": "Candidates matter.", "url": "https://www.cnn.com/2021/04/19/politics/rick-scott-nrsc-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210127172614-hponly-20210127-senate-map2022-super-tease.png", "publishedAt": "2021-04-19T14:44:18Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer and Kristin Wilson, CNN", "title": "Ohio GOP lawmaker to resign giving Republicans one fewer vote in the House", "description": "Republican Rep. Steve Stivers of Ohio announced Monday on Twitter that he is leaving Congress next month to become the president and CEO of the Ohio Chamber of Commerce, giving the GOP at least temporarily one fewer vote in the narrowly divided House of Repre…", "url": "https://www.cnn.com/2021/04/19/politics/steve-stivers-resigns-ohio-republican-congressman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419100303-02-rep-steve-stivers-super-tease.jpg", "publishedAt": "2021-04-19T14:18:38Z", "content": "(CNN)Republican Rep. Steve Stivers of Ohio announced Monday on Twitter that he is leaving Congress next month to become the president and CEO of the Ohio Chamber of Commerce, giving the GOP at least … [+1205 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden administration to provide $150 million to boost Covid response in underserved and vulnerable areas", "description": "The Biden administration on Monday will allocate $150 million from the American Rescue Plan to community-based health care providers across the nation to help boost their coronavirus response for \"underserved communities and vulnerable populations,\" an admini…", "url": "https://www.cnn.com/2021/04/19/politics/american-rescue-plan-funding-vulnerable-communities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419104614-vaccination-april-10-super-tease.jpg", "publishedAt": "2021-04-19T14:15:27Z", "content": "(CNN)The Biden administration on Monday will allocate $150 million from the American Rescue Plan to community-based health care providers across the nation to help boost their coronavirus response fo… [+1136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "Consumers have $5.4 trillion in excess savings. That could unleash a global spending boom", "description": "Consumers around the world have amassed an extra $5.4 trillion in savings since the coronavirus pandemic began, setting the stage for a spending boom that could power a strong uplift in economic growth this year.", "url": "https://www.cnn.com/2021/04/19/business/consumer-saving-spending-boom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419074125-01-retail-spending-0414-restricted-super-tease.jpg", "publishedAt": "2021-04-19T14:10:23Z", "content": "London (CNN Business)Consumers around the world have amassed an extra $5.4 trillion in savings since the coronavirus pandemic began, setting the stage for a spending boom that could power a strong up… [+3559 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Rachel Janfaza, CNN", "title": "Supreme Court tosses out another Republican 2020 election challenge", "description": "Five months after the presidential election, the Supreme Court said on Monday that it won't take up a case from several Republicans challenging changes to election rules in the battleground state of Pennsylvania.", "url": "https://www.cnn.com/2021/04/19/politics/supreme-court-tosses-gop-2020-election-challenge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200225123845-01-supreme-court-building-file-super-tease.jpg", "publishedAt": "2021-04-19T13:56:34Z", "content": "Washington (CNN)Five months after the presidential election, the Supreme Court said on Monday that it won't take up a case from several Republicans challenging changes to election rules in the battle… [+479 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "Earth Day programs come in many shades of green, but this year some seek rays of hope", "description": "There's no one way for documentary fare to acknowledge Earth Day, but the programs generally fall into one or more of four distinct buckets in regard to the health of the planet: Depressing, vaguely hopeful, star-studded, and celebrating the natural world to …", "url": "https://www.cnn.com/2021/04/19/entertainment/earth-day-programming/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414101231-secrets-of-the-whales-national-geographic-super-tease.jpg", "publishedAt": "2021-04-19T13:40:30Z", "content": "(CNN)There's no one way for documentary fare to acknowledge Earth Day, but the programs generally fall into one or more of four distinct buckets in regard to the health of the planet: Depressing, vag… [+4007 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Health officials considered issuing a warning before deciding to recommend a pause of the Johnson & Johnson Covid-19 vaccine", "description": "As health officials discussed how to handle reports of blood clots possibly linked to Johnson & Johnson's Covid-19 vaccine, one option considered was issuing a warning to health care providers without recommending a full pause, multiple sources told CNN.", "url": "https://www.cnn.com/2021/04/19/politics/johnson-and-johnson-warning-pause/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416133910-johnson-and-jonson-vaccine-march-03-super-tease.jpg", "publishedAt": "2021-04-19T13:39:05Z", "content": "(CNN)As health officials discussed how to handle reports of blood clots possibly linked to Johnson &amp; Johnson's Covid-19 vaccine, one option considered was issuing a warning to health care provide… [+1042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steven Poole, CNN", "title": "What is the new European Super League and how will it work?", "description": "Football fans, politicians and governing bodies are united in fury after 12 of the sport's biggest teams announced plans to breakaway from European football competitions and form their own \"Super League\" -- a move that poses an existential threat to the world…", "url": "https://edition.cnn.com/2021/04/19/football/explainer-european-super-league-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419070137-european-super-league-trophy-split-super-tease.jpg", "publishedAt": "2021-04-19T13:37:25Z", "content": "(CNN)Football fans, politicians and governing bodies are united in fury after 12 of the sport's biggest teams announced plans to breakaway from European football competitions and form their own \"Supe… [+7460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Yellin", "title": "Capital One adds new airline and hotel partners to its credit cards, improves transfer ratios", "description": "Capital One is adding four new transfer partners — three airlines and one hotel chain — to its credit card rewards program, and is improving the transfer ratios for several of its existing partners.", "url": "https://www.cnn.com/2021/04/19/cnn-underscored/capital-one-new-transfer-partners-improved-ratios/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419011935-underscored-capital-one-new-airline-transfer-partners-super-169.jpg", "publishedAt": "2021-04-19T13:01:47Z", "content": "Capital One credit card holders have reasons to rejoice. On Monday, the issuer announced the addition of four new transfer partners three airlines and one hotel chain to its credit card rewards progr… [+9889 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya and Mike Hayes, CNN", "title": "Derek Chauvin is on trial for George Floyd's death", "description": "Closing arguments are set to start in the trial of former Minneapolis Police officer Derek Chauvin, who has been charged in the death of George Floyd. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/derek-chauvin-trial-04-19-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg", "publishedAt": "2021-04-19T12:21:54Z", "content": "When closing arguments are delivered today in the trial of Derek Chauvin in the death of George Floyd, jurors will have sat through the testimony of seven witnesses for the defense and 38 for the pro… [+741 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Robert Klitzman", "title": "The 'Amazing Grace' of chaplains in the pandemic", "description": "Robert Klitzman writes about another frontline worker who has faced the isolation of watching patients dying alone in hospitals during the Covid-19 pandemic: Chaplains. They've been struggling to fill the void where family members and healthcare workers could…", "url": "https://www.cnn.com/2021/04/19/opinions/frontline-worker-pandemic-chaplain-klitzman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200427142410-nj-reverend-last-rites-in-window-super-tease.jpg", "publishedAt": "2021-04-19T12:11:18Z", "content": "Robert Klitzman is a professor of psychiatry and director of the masters in bioethics program at Columbia University. He is author of \"Designing Babies: How Technology is Changing the Ways We Create … [+7450 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Justin Gest", "title": "What America would look like with zero immigration", "description": "Justin Gest writes that if immigration remains at near-zero levels, within decades, the country could be older, smaller and poorer. But if the US government welcomed more newcomers, within decades, the country could be younger, more productive and richer.", "url": "https://www.cnn.com/2021/04/19/opinions/america-future-depends-immigration-gest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200925174822-trup-v-biden-immigration-super-tease.jpg", "publishedAt": "2021-04-19T12:08:17Z", "content": "Justin Gest (@_JustinGest) is an associate professor at George Mason University's Schar School of Policy and Government. He is the author of \"The New Minority: White Working Class Politics in an Age … [+5590 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Dean, CNN", "title": "Man detained as 'out of control' Cape Town fires continue to rage", "description": "A man has been detained in relation to the \"out of control\" fires in Cape Town, which began on Sunday morning and continues to blaze 24 hours later.", "url": "https://www.cnn.com/2021/04/19/africa/man-detained-cape-town-fires-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418120045-03-table-mountain-south-africa-fire-0418-super-tease.jpg", "publishedAt": "2021-04-19T11:29:38Z", "content": "(CNN)A man has been detained in relation to the \"out of control\" fires in Cape Town, which began on Sunday morning and continues to blaze 24 hours later.\r\n\"One suspect in his thirties was taken into … [+2597 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Football fan groups condemn 'ultimate betrayal' of European Super League", "description": "Football fan groups have reacted angrily to the prospect of the European Super League, calling it the \"ultimate betrayal\" and \"cynical greed.\"", "url": "https://edition.cnn.com/2021/04/19/football/european-super-league-fan-reaction-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419112657-manchester-united-champions-league-fans-super-tease.jpg", "publishedAt": "2021-04-19T11:18:15Z", "content": "(CNN)Football fan groups have reacted angrily to the prospect of the European Super League, calling it the \"ultimate betrayal\" and \"cynical greed.\"\r\nThe breakaway league, which has been announced by … [+3705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "Johnson & Johnson said blood clots have been reported with all Covid-19 vaccines. The author of the study they cited says they're wrong.", "description": "When news broke that Johnson & Johnson's Covid-19 vaccine might be linked to blood clots, the company responded by pointing a finger at Pfizer and Moderna's vaccines, issuing a media statement that said a study showed there were reports of blood clots with th…", "url": "https://www.cnn.com/2021/04/19/health/johnson-vaccine-blood-clots-statement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416133910-johnson-and-jonson-vaccine-march-03-super-tease.jpg", "publishedAt": "2021-04-19T11:17:38Z", "content": "(CNN)When news broke that Johnson &amp; Johnson's Covid-19 vaccine might be linked to blood clots, the company responded by pointing a finger at Pfizer and Moderna's vaccines, issuing a media stateme… [+5656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Drew Kann, video by Bryce Urbany and graphics by Renée Rigdon", "title": "As a megadrought persists, new projections show a key Colorado River reservoir could sink to a record low later this year", "description": "A megadrought that began around the year 2000 continues to grip much of West, and new projections show that key reservoirs on the Colorado River could sink to historically low levels later this year, potentially triggering water cutbacks in 2022.", "url": "https://www.cnn.com/2021/04/19/weather/western-drought-colorado-river-cutbacks-study/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415084022-lake-mead-2020-restricted-super-tease.jpg", "publishedAt": "2021-04-19T11:06:46Z", "content": "(CNN)Wracked by drought, climate change and overuse, a key reservoir on the Colorado River could sink to historically low levels later this year, new US government projections show, potentially trigg… [+7211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Alex Rogers, CNN", "title": "Trump's fight with Murkowski roils GOP with new Alaska Senate challenger emerging", "description": "The first major GOP rift in the post-Trump era centers on Alaska Sen. Lisa Murkowski, the maverick Republican who has the strong backing of GOP leaders in Washington but has been targeted for defeat by former President Donald Trump and his closest confidantes…", "url": "https://www.cnn.com/2021/04/19/politics/alaska-senate-race-2022-lisa-murkowski-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416231950-tump-murkowski-split-super-tease.jpg", "publishedAt": "2021-04-19T11:01:39Z", "content": "(CNN)The first major GOP rift in the post-Trump era centers on Alaska Sen. Lisa Murkowski, the maverick Republican who has the strong backing of GOP leaders in Washington but has been targeted for de… [+10118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeff Zeleny and Kevin Liptak, CNN", "title": "Biden preparing for 'tinderbox' with country on edge ahead of verdict in Chauvin trial", "description": "President Joe Biden is keeping a watchful eye on this week's closing arguments in the Minneapolis trial of Derek Chauvin, fearful that a controversial verdict could inflame new racial tensions and further escalate a deepening crisis in confidence with the nat…", "url": "https://www.cnn.com/2021/04/19/politics/joe-biden-chauvin-trial-preparations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416173011-01-biden-0414-super-tease.jpg", "publishedAt": "2021-04-19T10:59:29Z", "content": "(CNN)President Joe Biden is keeping a watchful eye on this week's closing arguments in the Minneapolis trial of Derek Chauvin, fearful that a controversial verdict could inflame new racial tensions a… [+8324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Thomas Page, CNN", "title": "How 'Sound of Metal' got in tune with deafness", "description": "Intensive and innovative sound design in the Oscar-nominated 'Sound of Metal' shows hearing audiences that deafness is anything but silent.", "url": "https://www.cnn.com/style/article/sound-of-metal-nicolas-becker-mikkel-nielsen-sound-design-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416094800-sound-of-metal-3-super-tease.jpg", "publishedAt": "2021-04-19T10:49:03Z", "content": "\"Spencer\" (directed by Pablo Larrain) -- Larrain's 2016 drama \"Jackie,\" featuring a never-better Natalie Portman as Jackie Kennedy, was not your average biopic, which leaves us intrigued as to what t… [+588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Mars helicopter Ingenuity attempts its historic first flight today", "description": "The Ingenuity helicopter took its historic flight on Mars Monday. The first powered, controlled flight on another planet happened at 3:30 a.m. ET on April 19, according to NASA. The agency has confirmed that the flight was successful, and Ingenuity safely tou…", "url": "https://www.cnn.com/2021/04/19/world/mars-helicopter-ingenuity-first-flight-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210409131224-01-mars-ingenuity-helicopter-blades-super-tease.jpeg", "publishedAt": "2021-04-19T10:46:35Z", "content": "I've driven about halfway to my overlook point, where I'll watch the #MarsHelicopter's flight test from a distance of about 200 feet (~60 meters).\r\nI'll have zoom cameras focused on the flight. Meanw… [+170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "HSBC's CEO is swapping his office for a hot desk", "description": "HSBC is scrapping the executive floor at its Canary Wharf headquarters in London, as one of the world's biggest banks slashes office space and moves towards new ways of working following the pandemic.", "url": "https://www.cnn.com/2021/04/19/business/hsbc-exec-office-canary-wharf/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419103716-hsbc-london-hq-restricted-super-tease.jpg", "publishedAt": "2021-04-19T10:36:40Z", "content": "London (CNN Business)HSBC is scrapping the executive floor at its Canary Wharf headquarters in London, as one of the world's biggest banks slashes office space and moves towards new ways of working f… [+1769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for April 19: Shootings, Covid, immigration, police violence, Russia", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/04/19/us/five-things-april-19-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418140650-01-ohio-vigil-shooting-super-tease.jpg", "publishedAt": "2021-04-19T10:21:22Z", "content": "(CNN)Some environmental lawyers have an interesting proposition: They want oil companies banned from advertising on TV and social media unless they include a health warning, like tobacco ads do.\r\nHer… [+5715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "White House expands federal vaccine programs, taking more control of coronavirus vaccination efforts", "description": "The Biden administration has ramped up its role in distributing and administering coronavirus vaccines, boosting federal pipelines in recent months with more doses and more vaccination sites in preparation for mounting US supply and the next phase of the US v…", "url": "https://www.cnn.com/2021/04/19/politics/covid-vaccine-federal-program-expanding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418164209-covid-vaccine-equity-white-house-super-tease.jpg", "publishedAt": "2021-04-19T10:07:39Z", "content": "(CNN)The Biden administration has ramped up its role in distributing and administering coronavirus vaccines, boosting federal pipelines in recent months with more doses and more vaccination sites in … [+10136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jack Guy, CNN", "title": "'Hot Instagrammers' Netflix show sparks protests", "description": "Thousands of locals in famed Australian beach town Byron Bay have signed a petition against a planned Netflix \"docu-soap\" set in the area.", "url": "https://www.cnn.com/travel/article/byron-bay-netflix-protest-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419095331-byron-bay-file-2020-super-tease.jpg", "publishedAt": "2021-04-19T10:01:40Z", "content": "(CNN) Thousands of locals in famed Australian beach town Byron Bay have signed a petition against a planned Netflix \"docu-soap\" set in the area.\r\nThe streaming company announced plans to film a serie… [+2070 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Matias Grez and John Sinnott, CNN", "title": "European Super League: 12 soccer giants intent on shaking up 'beautiful game'", "description": "Twelve top soccer clubs have announced plans to form a so-called European Super League. Follow the latest news here.", "url": "https://www.cnn.com/world/live-news/european-super-league-updates-live-cmd-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315101614-ronaldo-record-spt-intl-super-tease.jpg", "publishedAt": "2021-04-19T09:12:50Z", "content": "On Sunday, 12 of Europe's leading football clubs announced plans to form a so-called European Super League.\r\nThose involved are Premier League clubs Arsenal, Chelsea, Liverpool, Manchester City, Manc… [+511 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, Manu Raju and Alex Rogers, CNN", "title": "Inside the GOP's tense fallout with the big business lobby", "description": "What started as a polite discussion about small business soon turned into a heated confrontation between unusual opponents -- Republican members of the House and their party's old friends at the US Chamber of Commerce.", "url": "https://www.cnn.com/2021/04/19/politics/business-lobby-republican-lawmaker-breakup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418133929-02-business-lobby-republican-lawmaker-breakup-super-tease.jpg", "publishedAt": "2021-04-19T09:08:10Z", "content": "(CNN)What started as a polite discussion about small business soon turned into a heated confrontation between unusual opponents -- Republican members of the House and their party's old friends at the… [+13271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Closing arguments in Derek Chauvin's trial will contrast the prosecution's concise case with a more complex defense", "description": "Prosecutors and the defense will offer competing visions of Derek Chauvin's role in George Floyd's death during closing arguments Monday in the former Minneapolis officer's criminal trial.", "url": "https://www.cnn.com/2021/04/19/us/derek-chauvin-trial-george-floyd-closings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415103341-02-derek-chauvin-trial-0415-super-tease.jpg", "publishedAt": "2021-04-19T09:00:22Z", "content": "(CNN)Prosecutors and the defense will offer competing visions of Derek Chauvin's role in George Floyd's death during closing arguments Monday in the former Minneapolis officer's criminal trial.\r\nFor … [+7034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Jennings, CNN", "title": "Meet Diarra Bousso: One of Senegal's most promising designers", "description": "The ultimate multi-hyphenated creative, Diarra Bousso runs her fashion label Diarrablu while continuing to teach fullt-time.", "url": "https://www.cnn.com/style/article/diarrablu-diarra-bousso-senegal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415093121-05-diarrablu-super-tease.jpg", "publishedAt": "2021-04-19T08:52:36Z", "content": "When Diarra Bousso was a child she dreamed of being a fashion designer, artist, mathematician and ballerina when she grew up. Today she's achieved three out of four and added teacher to the list, too… [+5048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "European Super League: 12 soccer giants intent on shaking up 'beautiful game'", "description": "Twelve top soccer clubs have announced plans to form a so-called European Super League. Follow the latest news here.", "url": "https://www.cnn.com/football/live-news/european-super-league-updates-1-intl/index.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+rss%2Fcnn_latest+%28RSS%3A+CNN+-+Most+Recent%29", "urlToImage": null, "publishedAt": "2021-04-19T08:49:22Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "America's violent weekend: US rocked by back-to-back shootings across the country", "description": "At least nine people lost their lives in back-to-back shootings over the weekend.", "url": "https://www.cnn.com/2021/04/19/us/america-weekend-shootings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418080745-kenosha-wisconsin-shooting-super-tease.jpg", "publishedAt": "2021-04-19T08:47:01Z", "content": "(CNN)Americans awoke Friday to news of yet another mass shooting, this time at a FedEx facility in Indianapolis, where eight people were killed late Thursday.\r\nBy the end of the weekend, at least nin… [+5455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget and Claudia Dominguez, CNN", "title": "Hester Ford, the oldest living American, has died", "description": "Hester Ford, a North Carolina woman who was recognized as the oldest living American, died peacefully on Saturday in her home in Charlotte, North Carolina, her great-granddaughter Tanisha Patterson-Powe confirmed.", "url": "https://www.cnn.com/2021/04/19/us/hester-ford-oldest-living-american-dies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419033318-hester-ford-file-super-tease.jpg", "publishedAt": "2021-04-19T08:40:24Z", "content": "(CNN)Hester Ford, a North Carolina woman who was recognized as the oldest living American, died peacefully on Saturday in her home in Charlotte, North Carolina, her great-granddaughter Tanisha Patter… [+1206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Why Temple Grandin wants your kids to go outside", "description": "Before she became a famous scientist and inventor, Temple Grandin was a kid who liked to play outside. In her new children's book, \"The Outdoor Scientist: The Wonder of Observing the Natural World,\" now out, she encourages kids to follow her lead into the out…", "url": "https://www.cnn.com/2021/04/19/health/outdoor-science-temple-grandin-scn-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210408151404-04-outdoor-science-temple-grandin-wellness-super-tease.jpg", "publishedAt": "2021-04-19T08:10:43Z", "content": "(CNN)Before she became a famous scientist and inventor, Temple Grandin was a kid who liked to play outside. \r\n\"I absolutely loved flying kites,\" she said. \"We would just make up our own games go sit … [+7055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Duffy, CNN", "title": "A psychologist's advice: How to talk to your kids about social media and drug abuse", "description": "Psychologist John Duffy writes that while drug dealers on the street enticing kids to take a hit haven't disappeared, teenagers tell him that social media is increasingly an almost invisible way that dealers are reaching young people.", "url": "https://www.cnn.com/2021/04/19/opinions/kids-social-media-drug-abuse-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416160217-01-kid-phone-stock-restricted-super-tease.jpg", "publishedAt": "2021-04-19T08:08:45Z", "content": "Psychologist John Duffy, author of \"Parenting the New Teen in the Age of Anxiety,\" practices in Chicago. He specializes in working with teens, parents, couples and families.\r\n (CNN)While the drug dea… [+6226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sophie Jeong, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The pandemic has brought countries to a standstill. Meanwhile, vaccinations are underway as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-19-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-19T07:43:33Z", "content": "India reported 273,810 new cases of Covid-19 on Monday, a record-high and its fifth consecutive day of more than 200,000 new infections, according to a CNN tally of figures from the Indian Indian Min… [+1075 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths and Nectar Gan, CNN", "title": "Did China's former Premier just subtly criticize President Xi Jinping?", "description": "Under President Xi Jinping, China's former leaders have grown accustomed to keeping their heads down.", "url": "https://www.cnn.com/2021/04/19/china/wen-jiabao-xi-jinping-china-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210419141051-wen-jiabao-xi-jinping-2013-super-tease.jpg", "publishedAt": "2021-04-19T07:13:10Z", "content": "This is a wrap of several top stories from China for April 19, 2021.\r\nHong Kong (CNN)Under President Xi Jinping, China's former leaders have grown accustomed to keeping their heads down. \r\nBut in an … [+6524 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sophie Jeong, CNN", "title": "Australia opens quarantine-free travel bubble with New Zealand", "description": "A two-way travel bubble between Australia and New Zealand opened Monday, allowing passengers to move quarantine-free between both countries for the first time in more than a year.", "url": "https://www.cnn.com/travel/article/australia-new-zealand-travel-bubble-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418220648-australia-new-zealand-travel-bubble-0419-super-tease.jpg", "publishedAt": "2021-04-19T07:05:56Z", "content": "Sophie Jeong, CNNPublished 19th April 2021\r\n(CNN) A two-way travel bubble between Australia and New Zealand opened Monday, allowing passengers to move quarantine-free between both countries for the f… [+2872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "A year after Canada's worst mass shooting, a ban on assault-style guns has been in place for months", "description": "\"One year ago, 22 Canadians were senselessly killed and three more were injured when a gunman went on a rampage in small towns across Nova Scotia,\" Prime Minister Justin Trudeau said in a statement commemorating  the tragedy.", "url": "https://www.cnn.com/2021/04/18/americas/canada-worst-mass-shooting-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418234013-nova-scotia-mass-shooting-anniversary-041821-super-tease.jpg", "publishedAt": "2021-04-19T03:55:59Z", "content": "(CNN)In the First United Church in Truro, Nova Scotia, little has changed after an extraordinarily painful year. Parishioners are still wearing masks, physically distancing, and only a few dozen are … [+4177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story and photos by Austin Bush, CNN", "title": "After centuries of nomadic living, Thailand's 'sea people' adapt to life on land", "description": "Members of Thailand's Moken ethnic group -- known locally as \"sea people\" -- are famed for their ability to stay underwater for long periods of time. Pre-pandemic, they earned money by helping out on boats or doing odd jobs at the national park, but these job…", "url": "https://www.cnn.com/travel/article/thailand-tourism-sea-people-moken/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402143944-05-moken-sea-people-austin-bush-photos-restricted-super-tease.jpg", "publishedAt": "2021-04-19T02:32:38Z", "content": "Ko Surin, Thailand (CNN) These days, Salamak Klathalay, like most of us, lives in a house, on land. But this is a relatively new experience for the 78-year-old.\r\n\"As a kid, I lived on a boat part of … [+6301 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "See who won at the ACM Awards", "description": "The Academy of Country Music Awards, celebrating the best in country music, are being presented Sunday.", "url": "https://www.cnn.com/2021/04/18/entertainment/acm-awards-2021-winners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418184045-keith-urban-and-mickey-guyton-acm-awards-super-tease.jpg", "publishedAt": "2021-04-19T01:45:21Z", "content": "(CNN)The Academy of Country Music Awards, celebrating the best in country music, are being presented Sunday.\r\nKeith Urban and \"Black Like Me Singer\" Mickey Guyton are co-hosting the event.\r\nBelow is … [+1234 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "Pig's blood was smeared on the former home of the use-of-force expert who testified for the defense in Chauvin's trial, police say", "description": "The former California home of use-of-force expert Barry Brodd was smeared with pig's blood Saturday, four days after he testified for the defense in Derek Chauvin's trial in Minneapolis, Minnesota, police said.", "url": "https://www.cnn.com/2021/04/18/us/chauvin-witness-barry-brodd-pigs-blood-santa-rosa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418160752-01-barry-brodd-pigs-blood-santa-rosa-super-tease.jpg", "publishedAt": "2021-04-19T01:15:09Z", "content": "(CNN)The former California home of use-of-force expert Barry Brodd was smeared with pig's blood Saturday, four days after he testified for the defense in Derek Chauvin's trial in Minneapolis, Minneso… [+986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Biden and Obama urge Americans to get vaccinated in star-studded television special", "description": "President Joe Biden and former President Barack Obama joined a slate of celebrities Sunday evening in urging Americans to get vaccinated during an hour-long NBC special aimed at boosting confidence in the shots and raising awareness about eligibility.", "url": "https://www.cnn.com/2021/04/18/politics/biden-obama-covid-vaccine-roll-up-your-sleeves/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414151832-obama-biden-split-super-tease.jpg", "publishedAt": "2021-04-19T00:51:13Z", "content": "Washington (CNN)President Joe Biden and former President Barack Obama joined a slate of celebrities Sunday evening in urging Americans to get vaccinated during an hour-long NBC special aimed at boost… [+3438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Keith Allen, CNN", "title": "Police fatally shoot carjacking suspect near Minneapolis", "description": "Police said the man -- who is White in his 20s -- was suspected of carjacking a woman at gunpoint prior to the shootout.", "url": "https://www.cnn.com/2021/04/18/us/burnsville-minnesota-police-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418183541-01-burnsville-minnesota-police-shooting-super-tease.jpg", "publishedAt": "2021-04-18T23:57:32Z", "content": "(CNN)A man suspected of a carjacking was fatally shot by police in Burnsville, Minnesota, Sunday afternoon, according to a press release from the Burnsville Police Department.\r\nThe suspect, described… [+799 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dean Obeidallah", "title": "It's not enough to cancel Marjorie Taylor Greene's 'America First' caucus", "description": "Dean Obeidallah writes that Republicans can't be silent on \"replacement theory\" and the threat of white nationalism. While GOP leaders like Kevin McCarthy and Liz Cheney did criticize Rep. Marjorie Taylor Greene's now-cancelled plan to establish a caucus to c…", "url": "https://www.cnn.com/2021/04/18/opinions/marjorie-taylor-greene-america-first-caucus-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210310143921-marjorie-taylor-greene-march-10-2021-01-super-tease.jpg", "publishedAt": "2021-04-18T23:57:20Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+6018 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marlon Sorto and Caitlin Hu, CNN", "title": "Mexico's President will propose a migration agreement during US climate summit", "description": "Mexico's President Andrés Manuel López Obrador will propose a new migration agreement between the countries of North and Central America this week, he announced on Sunday.", "url": "https://www.cnn.com/2021/04/18/americas/mexican-president-amlo-migration-climate-summit-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418173000-amlo-propuesta-migratoria-parcela-visas-sot-00002009-super-tease.jpg", "publishedAt": "2021-04-18T23:43:19Z", "content": "(CNN)Mexico's President Andrés Manuel López Obrador will propose a new migration agreement between the countries of North and Central America this week, he announced on Sunday.\r\nHis proposal would as… [+2728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arlette Saenz", "title": "White House to promote vaccine eligibility with media blitz", "description": "As all Americans 16 years and older become eligible for the vaccine on Monday, the White House is launching a media blitz to raise awareness about Americans' vaccine eligibility, an administration official said.", "url": "https://www.cnn.com/2021/04/18/politics/white-house-media-blitz-vaccine-eligibility/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418164209-covid-vaccine-equity-white-house-super-tease.jpg", "publishedAt": "2021-04-18T22:55:42Z", "content": "(CNN)As all Americans 16 years and older become eligible for the vaccine on Monday, the White House is launching a media blitz to raise awareness about Americans' vaccine eligibility, an administrati… [+1663 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe and Dakin Andone, CNN", "title": "The US has reported at least 50 mass shootings since the Atlanta spa shootings", "description": "At least three people were killed and two were injured in a shooting in Kenosha, Wisconsin, early Sunday, continuing the long string of similar incidents that preceded it.", "url": "https://www.cnn.com/2021/04/18/us/mass-shootings-since-march-16/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401113405-gold-spa-atlanta-shooting-file-restricted-super-tease.jpg", "publishedAt": "2021-04-18T22:55:11Z", "content": "(CNN)At least three people were killed and two were injured in a shooting in Kenosha, Wisconsin, early Sunday, continuing the long string of similar incidents that preceded it. \r\nSince March 16, when… [+9557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Los Angeles Lakers will skip team's White House visit scheduled for this month, report says", "description": "The Los Angeles Lakers will miss the team's White House visit scheduled for later this month because of Covid-19 protocols and scheduling issues, according to ESPN.", "url": "https://www.cnn.com/2021/04/18/us/los-angeles-lakers-white-house-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418153307-los-angeles-lakers-white-house-trnd-restricted-super-tease.jpg", "publishedAt": "2021-04-18T21:46:56Z", "content": "(CNN)The Los Angeles Lakers will miss the team's White House visit scheduled for later this month because of Covid-19 protocols and scheduling issues, according to ESPN.\r\nThe 2020 NBA champions were … [+1150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "A Trump policy institute? Heaven help us", "description": "Michael D'Antonio writes that the recently-launched America First Policy Institute is perfectly named to lean on Donald Trump's campaign catchphrase, but is built on a shaky foundation apparently intended to offer insiders a chance to get paid for spreading T…", "url": "https://www.cnn.com/2021/04/18/opinions/trump-america-first-policy-institute-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210209160043-rba-trump-super-tease.jpg", "publishedAt": "2021-04-18T20:46:01Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Video shows child getting caught under Peloton treadmill", "description": "The US Consumer Product Safety Commission is warning people who use the Peloton Tread+ treadmill, saying there have been \"multiple reports of children becoming entrapped, pinned, and pulled under\" the device.", "url": "https://www.cnn.com/videos/business/2021/04/18/peloton-treadmill-child-injury-kj-eg-orig.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418162604-peloton-treadmill-child-super-tease.jpg", "publishedAt": "2021-04-18T20:42:40Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent and Elizabeth Joseph, CNN", "title": "Alma Wahlberg, mother of actors Donnie and Mark Wahlberg, dies at age 78", "description": "Alma Wahlberg, the mother of actors Donnie and Mark Wahlberg, has died, the brothers announced Sunday. She was 78.", "url": "https://www.cnn.com/2021/04/18/us/alma-wahlberg-death-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418131135-alma-wahlberg-dies-trnd-super-tease.jpg", "publishedAt": "2021-04-18T19:48:58Z", "content": "(CNN)Alma Wahlberg, the mother of actors Donnie and Mark Wahlberg, has died, the brothers announced Sunday. She was 78.\r\n\"My Angel. Rest in peace,\" Mark wrote in the caption of a photo of the family … [+871 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hoffman and Devan Cole, CNN", "title": "Trump calls Afghanistan withdrawal 'a wonderful and positive thing to do' and criticizes Biden's timeline", "description": "Former President Donald Trump on Sunday praised withdrawing US troops from Afghanistan, while knocking his successor's timeline for doing so.", "url": "https://www.cnn.com/2021/04/18/politics/trump-afghanistan-troop-withdrawal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303224724-donald-trump-file-201126-super-tease.jpg", "publishedAt": "2021-04-18T19:21:22Z", "content": "Washington (CNN)Former President Donald Trump on Sunday praised withdrawing US troops from Afghanistan, while knocking his successor's timeline for doing so.\r\nThough the former President offered his … [+2515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "A Minnesota National Guard and police team were shot at in a drive-by shooting, official says", "description": "A Minnesota National Guard and Minneapolis police team were fired upon in a drive-by shooting Sunday morning, the state National Guard said in a news release.", "url": "https://www.cnn.com/2021/04/18/us/minnesota-national-guard-police-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418140007-screengrab-01-minnesota-national-guard-shot-at-0418-super-tease.jpg", "publishedAt": "2021-04-18T18:49:26Z", "content": "(CNN)A Minnesota National Guard and Minneapolis police team were fired upon in a drive-by shooting Sunday morning, the state National Guard said in a news release. \r\nThe team was providing neighborho… [+1696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Washington Post: Trump-installed NSA lawyer resigns after being on administrative leave for three months", "description": "National Security Agency general counsel Michael Ellis, who was installed by Trump officials in the final days of the administration, resigned from his post on Friday after being on administrative leave since the start of the Biden administration, according t…", "url": "https://www.cnn.com/2021/04/18/politics/michael-ellis-resignation-nsa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213150327-pentagon-building-aerial-file-super-tease.jpg", "publishedAt": "2021-04-18T18:42:38Z", "content": "Washington (CNN)National Security Agency general counsel Michael Ellis, who was installed by Trump officials in the final days of the administration, resigned from his post on Friday after being on a… [+2244 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "America's newsrooms are reckoning with their mass shooting coverage", "description": "At least 45 mass shootings have occurred in the United States over the past month, and America's journalists are covering the stories as they unfold, both on the ground and from their computers.", "url": "https://www.cnn.com/2021/04/18/media/america-newsrooms-gun-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418132449-america-newsrooms-gun-violence-super-tease.jpg", "publishedAt": "2021-04-18T18:38:41Z", "content": "New York (CNN)At least 45 mass shootings have occurred in the United States over the past month, and America's journalists are covering the stories as they unfold, both on the ground and from their c… [+2574 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Journalists assaulted and arrested during Minnesota unrest - CNN Video", "description": "The Minnesota governor is vowing to implement changes after members of the media were mistreated and wrongfully arrested in Brooklyn Center, Minnesota. Brian Stelter recaps the recent incidents and talks with two CNN correspondents, Miguel Marquez and Sara Si…", "url": "https://www.cnn.com/videos/business/2021/04/18/journalists-assaulted-and-arrested-during-minnesota-unrest.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418131151-rs-b-block-1-miguel-super-tease.jpg", "publishedAt": "2021-04-18T18:02:48Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Remote workers can get paid $12,000 to move to West Virginia", "description": "During the pandemic, cities such as Tulsa, Oklahoma, and Natchez, Mississippi, have offered remote workers cash to relocate there, while exotic destinations like Aruba have promoted their islands for stay-at-home jobs.", "url": "https://www.cnn.com/2021/04/18/us/west-virginia-move-incentive-remote-workers-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210417190517-west-virginia-12000-dollars-remote-work-trnd-restricted-super-tease.jpg", "publishedAt": "2021-04-18T17:46:18Z", "content": "(CNN)During the pandemic, cities such as Tulsa, Oklahoma, and Natchez, Mississippi, have offered remote workers cash to relocate there, while exotic destinations like Aruba have promoted their island… [+2365 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hollie Silverman and Alaa Elassar, CNN", "title": "Three people are dead amid an active shooter incident in Austin, Texas", "description": "Three people have been pronounced dead on the scene of an active shooting incident in Austin, Texas, on Sunday, according to tweets from Austin-Travis County EMS.", "url": "https://www.cnn.com/2021/04/18/us/austin-shooting-three-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2021-04-18T17:35:04Z", "content": "(CNN)Three people were pronounced dead at the scene of an active shooting incident in Austin, Texas, on Sunday, according to tweets from Austin-Travis County EMS.\r\nThere are no reports of other patie… [+455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Max Verstappen wins at Imola but Lewis Hamilton stays ahead", "description": "Red Bull's Max Verstappen won a chaotic and crash-halted Emilia Romagna Grand Prix at Imola on Sunday, with Lewis Hamilton second for Mercedes and retaining the lead in the championship by a single point.", "url": "https://edition.cnn.com/2021/04/18/motorsport/max-verstappen-lewis-hamilton-imola-gp-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418173405-verstappen-super-tease.jpg", "publishedAt": "2021-04-18T16:43:19Z", "content": "(CNN)Red Bull's Max Verstappen won a chaotic and crash-halted Emilia Romagna Grand Prix at Imola on Sunday, with Lewis Hamilton second for Mercedes and retaining the lead in the championship by a sin… [+2241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicky Robertson and Chandelis Duster, CNN", "title": "Bush calls on Congress to tone down 'harsh rhetoric' about immigration", "description": "Former President George W. Bush on Sunday called on Congress to tone down the \"harsh rhetoric\" on immigration, adding that he hopes that doing so will \"set a tone that is more respectful\" of immigrants and lead to more reform.", "url": "https://www.cnn.com/2021/04/18/politics/george-w-bush-immigration-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319130751-george-bush-file-2019-super-tease.jpg", "publishedAt": "2021-04-18T16:22:12Z", "content": "(CNN)Former President George W. Bush on Sunday called on Congress to tone down the \"harsh rhetoric\" on immigration, adding that he hopes that doing so will \"set a tone that is more respectful\" of imm… [+2394 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, Kevin Liptak and Devan Cole, CNN", "title": "Blinken says it would be 'very hard' to meet 62,500 refugee cap this year", "description": "Secretary of State Antony Blinken said Sunday that it would be \"very hard\" to meet the 62,000 refugee cap pledged by President Joe Biden, arguing that the refugee system that was in place when the administration came in lacked \"the means to effectively proces…", "url": "https://www.cnn.com/2021/04/18/politics/antony-blinken-jake-sullivan-refugee-cap/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324083806-02-antony-blinken-nato-0324-super-tease.jpg", "publishedAt": "2021-04-18T16:09:04Z", "content": "(CNN)Secretary of State Antony Blinken said Sunday that it would be \"very hard\" to meet the 62,000 refugee cap pledged by President Joe Biden, arguing that the refugee system that was in place when t… [+2347 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fernando Alfonso III, CNN", "title": "World's next skateboard star is a 6-year-old girl riding ramps double her size", "description": "While her kindergarten classmates spend their free time playing with blocks and running around outside, Paige Tobin has been busy dropping into 12-foot high skateboard ramps, amassing a burgeoning online fanbase, and challenging gender stereotypes.", "url": "https://www.cnn.com/2021/04/18/world/skateboard-girl-instagram-video-paige-tobin-australia-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418104501-restricted-04-paige-tobin-skateboard-girl-video-australia-instagram-trnd-super-tease.jpg", "publishedAt": "2021-04-18T15:53:19Z", "content": "(CNN)While her kindergarten classmates spend their free time playing with blocks and running around outside, Paige Tobin has been busy dropping into 12-foot high skateboard ramps, amassing a burgeoni… [+4665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Anneken Tappe and Alicia Wallace, CNN Business", "title": "Joe Biden's infrastructure plan could leave too many women behind", "description": "President Joe Biden says his roughly $2 trillion infrastructure plan will help create millions of jobs. But many of the proposed jobs are in historically male-dominated fields and experts worry the plan won't do enough for America's women, who lost more jobs …", "url": "https://www.cnn.com/2021/04/18/economy/women-infrastructure-care-stimulus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413133507-us-women-infrastructure-care-investment-super-tease.jpg", "publishedAt": "2021-04-18T15:48:19Z", "content": "New York (CNN Business)President Joe Biden says his roughly $2 trillion infrastructure plan will help create millions of jobs. But many of the proposed jobs are in historically male-dominated fields … [+6008 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Blake, CNN", "title": "George Floyd's death did not spark a racial reckoning", "description": "We've heard a lot about a \"racial reckoning\" since the Floyd protests last summer. But the phrase has become a rhetorical decoy, a way to avoid facing the deepest problems about race in America.", "url": "https://www.cnn.com/2021/04/18/us/george-floyd-racial-reckoning-blake/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210417135519-file-george-floyd-protest-minneapolis-2020-super-tease.jpg", "publishedAt": "2021-04-18T15:46:23Z", "content": "Analysis by John Blake, CNN\r\nUpdated 11:46 AM ET, Sun April 18, 2021\r\n (CNN)They tell me I've experienced a \"racial reckoning.\" \r\nI keep seeing that phrase pop up in news stories. I hear politicians … [+14498 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "Bitcoin suffers flash crash following week of crypto hype", "description": "After a hype-filled week for cryptocurrencies, Bitcoin experienced a flash crash over the weekend, plunging nearly 14% in less than an hour, from about $59,000 to $51,000, on Saturday night before rebounding. Other popular cryptocurrencies including etherium …", "url": "https://www.cnn.com/2021/04/18/business/bitcoin-sharp-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418100509-restricted-bitcoin-0414-super-tease.jpg", "publishedAt": "2021-04-18T15:42:43Z", "content": "New York (CNN)After a hype-filled week for cryptocurrencies, Bitcoin experienced a flash crash over the weekend, plunging nearly 14% in less than an hour, from about $59,000 to $51,000, on Saturday n… [+1626 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "Fauci predicts J&J vaccine to come back to market with restrictions or warnings by Friday", "description": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that he expects a decision to be made about the Johnson & Johnson Covid-19 vaccine by Friday, predicting the vaccine would come back on the market with restr…", "url": "https://www.cnn.com/2021/04/18/politics/fauci-jj-vaccine-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418092228-dr-anthony-fauci-sotu-4-18-21-super-tease.jpg", "publishedAt": "2021-04-18T14:40:24Z", "content": "(CNN)Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said Sunday that he expects a decision to be made about the Johnson &amp; Johnson Covid-19 vaccine by Fr… [+1460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Doug Jones", "title": "Where hate finds safe harbor, accountability is the answer", "description": "It has taken different forms over time, but we are clearly still struggling to confront the influence of hateful ideologies within our public safety ranks and criminal justice system, former Alabama Senator and U.S. Attorney Doug Jones writes. One key to upro…", "url": "https://www.cnn.com/2021/04/18/opinions/confronting-hate-in-institutions-people-v-klan-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/130522104224-george-wallace-super-tease.jpg", "publishedAt": "2021-04-18T14:06:40Z", "content": "Doug Jones, a CNN political commentator, is a former Democratic US senator from Alabama and contributor to the CNN Original Series \"The People v. The Klan,\" airing tonight at 9 p.m. ET/PT. He was the… [+6904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Devan Cole, CNN", "title": "National security adviser says White House is looking at options if Navalny dies in Russian custody", "description": "The Biden administration is weighing options to punish Russia if imprisoned opposition leader Alexey Navalny dies in state custody, national security adviser Jake Sullivan said Sunday.", "url": "https://www.cnn.com/2021/04/18/politics/jake-sullivan-alexey-navalny-russian-consequences-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415074150-screengrab-jake-sullivan-cnn-0415-super-tease.jpg", "publishedAt": "2021-04-18T14:00:50Z", "content": "Washington (CNN)The Biden administration is weighing options to punish Russia if imprisoned opposition leader Alexey Navalny dies in state custody, national security adviser Jake Sullivan said Sunday… [+3067 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Fauci on gun violence: 'How can you say that's not a public health issue?'", "description": "Dr. Anthony Fauci, President Joe Biden's chief medical adviser, acknowledged Sunday that gun violence in the US is a public health emergency.", "url": "https://www.cnn.com/2021/04/18/politics/anthony-fauci-gun-violence-public-health-emergency-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418091740-screengrab-anthony-fauci-cnn-0418-super-tease.jpg", "publishedAt": "2021-04-18T13:43:50Z", "content": "(CNN)Dr. Anthony Fauci, President Joe Biden's chief medical adviser, acknowledged Sunday that gun violence in the US is a public health emergency.\r\n\"Myself, as public health person, I think you can't… [+816 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Chernova and Arnaud Siad, CNN", "title": "Russian politicians say Navalny's life is Putin's 'personal' responsibility", "description": "Nearly a dozen Russian politicians have published an open letter to President Vladimir Putin, saying that he was personally responsible for the life of Kremlin critic Alexey Navalny, who has been on a hunger strike in a penal colony in the Russian city of Pok…", "url": "https://www.cnn.com/2021/04/18/europe/navalny-vladimir-putin-letter-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210417224029-alexei-navalny-file-restricted-super-tease.jpg", "publishedAt": "2021-04-18T13:33:03Z", "content": "Moscow (CNN)Nearly a dozen Russian politicians have published an open letter to President Vladimir Putin, saying that he was personally responsible for the life of Kremlin critic Alexey Navalny, who … [+3539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, Harmeet Kaur and Eric Levenson, CNN", "title": "Indianapolis FedEx shooter bought two weapons used in killings legally last year despite FBI concerns", "description": "The 19-year-old who killed eight people at a FedEx facility in Indianapolis late Thursday night purchased the two assault rifles used in the attack legally months after being investigated by the FBI due to his potential for violence, according to the Indianap…", "url": "https://www.cnn.com/2021/04/18/us/indianapolis-shooting-fedex-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416105524-02-indianapolis-shooting-families-wait-0415-super-tease.jpg", "publishedAt": "2021-04-18T13:26:56Z", "content": "(CNN)The 19-year-old who killed eight people at a FedEx facility in Indianapolis late Thursday night purchased the two assault rifles used in the attack legally months after being investigated by the… [+6126 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Wall Street just showed the Reddit crowd how to really make money", "description": "In the early weeks of 2021, amateur traders backing meme stocks like GameStop, AMC Entertainment and BlackBerry captured the world's attention.", "url": "https://www.cnn.com/2021/04/18/investing/stocks-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416105024-01-nyse-0415-super-tease.jpg", "publishedAt": "2021-04-18T12:30:35Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)In the early weeks of 2021, amateur traders bac… [+5601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Arnaud Siad and Amy Woodyatt, CNN", "title": "Non-socially distanced music festival to be trialed", "description": "The United Kingdom is set to trial a non-socially distanced outdoor concert with 5,000 attendees in a bid to get audiences back to live events safely this summer, the British government announced in a statement on Sunday.", "url": "https://www.cnn.com/travel/article/covid-no-distancing-music-festival-intl-scli-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210418050650-liverpool-international-music-festival-in-sefton-park-file-restricted-super-tease.jpg", "publishedAt": "2021-04-18T12:16:15Z", "content": "(CNN) The United Kingdom is set to trial a non-socially distanced outdoor concert with 5,000 attendees in a bid to get audiences back to live events safely this summer, the British government announc… [+2150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "How the Trump era made redistricting more complicated", "description": "The political upheaval caused by the rise of former President Donald Trump has forced party operatives and elected officials tasked with laying out the nation's congressional districts for the next decade to determine whether those shifts were aberrations or …", "url": "https://www.cnn.com/2021/04/18/politics/redistricting-post-trump-era/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210212145220-102-trump-file-play-button-super-tease.jpg", "publishedAt": "2021-04-18T12:11:37Z", "content": "Washington (CNN)The political upheaval caused by the rise of former President Donald Trump has forced party operatives and elected officials tasked with laying out the nation's congressional district… [+9500 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Opinion: Joe Biden's audacious gambles", "description": "The President set a pattern of making big bets in January, days before he took office, by outlining a huge Covid relief package amounting to $1.9 trillion and then topped it last month with a proposal for a $2 trillion infrastructure bill. On Wednesday he mad…", "url": "https://www.cnn.com/2021/04/18/opinions/joe-bidens-audacious-gambles-opinion-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414144244-05-biden-afghanistan-remarks-0414-super-tease.jpg", "publishedAt": "2021-04-18T12:05:48Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)Tom Stoppard's play, \"Rosencrantz and … [+15644 chars]"}]}