{"status": "ok", "totalResults": 173, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Edward J. Markey and Mondaire Jones", "title": "Legislators: Add four justices to the Supreme Court", "description": "Sen. Edward J. Markey and Rep. Mondaire Jones write that adding four seats to the Supreme Court would help to stop Republicans' reliance on the highest court to govern and, consequently, help strengthen the country's democracy.", "url": "https://www.cnn.com/2021/04/15/opinions/supreme-court-expansion-markey-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210129144107-05-scotus-exterior-file-super-tease.jpg", "publishedAt": "2021-04-15T22:45:40Z", "content": "Senator Edward J. Markey is the junior senator from the Commonwealth of Massachusetts. Congressman Mondaire Jones represents New York's 17th Congressional District in the U.S. House of Representative… [+5940 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Defense Department confirms leaked video of unidentified aerial phenomena is real", "description": "The Defense Department has confirmed that leaked photos and video of \"unidentified aerial phenomena\" taken in 2019 are indeed legitimate images of unexplained objects.", "url": "https://www.cnn.com/2021/04/15/politics/unidentified-aerial-phenomena-defense-department/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415180904-ufo-navy-thumbnail-orig-super-tease.jpg", "publishedAt": "2021-04-15T22:36:58Z", "content": "(CNN)The Defense Department has confirmed that leaked photos and video of \"unidentified aerial phenomena\" taken in 2019 are indeed legitimate images of unexplained objects.\r\nPhotos and videos of tria… [+1570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lanhee J. Chen", "title": "The choice no president ever wants to make", "description": "This week, President Joe Biden sent a bipartisan group of former senior government officials to Taiwan as a \"personal signal\" of his support for and commitment to the self-governing island. The move comes after weeks of escalating tensions between the governm…", "url": "https://www.cnn.com/2021/04/15/opinions/taiwan-china-president-biden-choice-chen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210408120329-01-biden-gun-violence-prevention-0408-super-tease.jpg", "publishedAt": "2021-04-15T22:31:08Z", "content": "Lanhee J. Chen is a regular contributor to CNN Opinion and the David and Diane Steffy Fellow in American Public Policy Studies at the Hoover Institution. He has also spoken at events convened by The … [+6990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why Republicans should be talking about this issue nonstop", "description": "The first three months of Joe Biden's presidency have offered something of a moving target for Republicans.", "url": "https://www.cnn.com/2021/04/15/politics/immigration-us-mexico-border-partisan-issue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210204111336-11-immigration-file-us-mexico-border-super-tease.jpg", "publishedAt": "2021-04-15T22:30:11Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "Lawmakers vent at hearing over lack of clarity for who oversees Capitol Hill security", "description": "Months after the deadly insurrection at the US Capitol, Rep. Barry Loudermilk, a Republican from Georgia, made clear that confusion remains over who ultimately oversees Capitol Hill security.", "url": "https://www.cnn.com/2021/04/15/politics/capitol-police-inspector-general-michael-bolton-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415171705-01-michael-bolton-capitol-police-house-hearing-super-tease.jpg", "publishedAt": "2021-04-15T21:48:35Z", "content": "(CNN)Months after the deadly insurrection at the US Capitol, Rep. Barry Loudermilk, a Republican from Georgia, made clear that confusion remains over who ultimately oversees Capitol Hill security.\r\nD… [+6391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "FBI director says bureau is not investigating QAnon conspiracy 'in its own right'", "description": "For the second time in as many days, FBI director Christopher Wray acknowledged he remains concerned about potential violence incited by QAnon but despite telling lawmakers that the conspiracy theory is something \"we look at very seriously\" when it is tied to…", "url": "https://www.cnn.com/2021/04/15/politics/fbi-director-wray-qanon-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414213835-christopher-wray-210414-super-tease.jpg", "publishedAt": "2021-04-15T21:35:22Z", "content": "Washington (CNN)For the second time in as many days, FBI director Christopher Wray acknowledged he remains concerned about potential violence incited by QAnon but despite telling lawmakers that the c… [+8939 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, Nicole Gaouette and Allie Malloy, CNN", "title": "Biden says sanctions against Russia are proportionate response: 'Now is the time to de-escalate'", "description": "President Joe Biden said Thursday that the sanctions he announced on Russia are a proportionate response to cyber attacks against the US and interference in two different presidential elections, and said, \"Now is the time to de-escalate\"", "url": "https://www.cnn.com/2021/04/15/politics/russia-joe-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415170518-01-biden-russia-comments-0415-super-tease.jpg", "publishedAt": "2021-04-15T21:25:16Z", "content": "(CNN)President Joe Biden said Thursday that the sanctions he announced on Russia are a proportionate response to cyber-attacks against the US and interference in two different presidential elections,… [+3770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stella Chan, CNN", "title": "Man is arrested after trapping a police officer's arm in his truck window and speeding off, police say", "description": "A Minnesota man was arrested Wednesday after he allegedly trapped a police officer's arm in his truck window while attempting to flee, and then attacking him with the officer's own rescue hammer, police said.", "url": "https://www.cnn.com/2021/04/15/us/minnesota-oeltjenbruns-arrest-hammer-mask-dispute/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415163608-luke-alvin-oeltjenbruns-mugshot-super-tease.jpg", "publishedAt": "2021-04-15T21:20:29Z", "content": "(CNN)A Minnesota man was arrested Wednesday after he allegedly trapped a police officer's arm in his truck window while attempting to flee, and then attacking him with the officer's own rescue hammer… [+1298 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "White House releases $39 billion in relief funds to keep child care providers afloat", "description": "The Biden administration is funneling $39 billion in relief funds to states to help child care providers stay in business or reopen, which it says is the single largest investment in child care in US history.", "url": "https://www.cnn.com/2021/04/15/politics/child-care-providers-relief-funds/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415152723-closed-day-care-center-2020-super-tease.jpg", "publishedAt": "2021-04-15T21:12:35Z", "content": "(CNN)The Biden administration is funneling $39 billion in relief funds to states to help child care providers stay in business or reopen, which it says is the single largest investment in child care … [+2866 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liz Stark and Geneva Sands, CNN", "title": "More than 1 million calls inundated FEMA's new Covid-19 funeral assistance hotline on first day", "description": "More than 1 million callers dialed into the Federal Emergency Management Agency's new funeral assistance program hotline on its first day, the agency said, signaling an increased need for funeral aid as the nation's coronavirus death toll continues to climb.", "url": "https://www.cnn.com/2021/04/15/politics/fema-covid-19-funeral-assistance-calls/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210412212525-conclu-fema-super-tease.jpg", "publishedAt": "2021-04-15T20:56:10Z", "content": "(CNN)More than 1 million callers dialed into the Federal Emergency Management Agency's new funeral assistance program hotline on its first day, the agency said, signaling an increased need for funera… [+3273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "History shows we ignore Tucker Carlson at our peril", "description": "History demands that we pay more attention to Tucker Carlson's parroting of racist \"replacement\" theory, says Nicole Hemmer, because it shows there's every reason to believe Carlson and his acolytes could succeed in normalizing hate for a wider audience. Hemm…", "url": "https://www.cnn.com/2021/04/15/opinions/tucker-carlson-replacement-theory-peter-brimelow-republican-party-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311095359-tucker-carlson-file-2018-super-tease.jpg", "publishedAt": "2021-04-15T20:45:48Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+9456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "US and global vaccine alliance kick off Covid fundraising effort", "description": "The United States government and Gavi, the Vaccine Alliance, kicked off a pledging event Thursday aimed at raising an additional $2 billion to support vaccine distribution to lower income countries around the world.", "url": "https://www.cnn.com/2021/04/15/politics/gavi-us-event-covax/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201102232605-usaid-flag-super-tease.jpg", "publishedAt": "2021-04-15T20:45:18Z", "content": "(CNN)The United States government and Gavi, the Vaccine Alliance, kicked off a pledging event Thursday aimed at raising an additional $2 billion to support vaccine distribution to lower income countr… [+2548 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Kate Winslet classes up small-town secrets in 'Mare of Easttown'", "description": "Small towns harbor big secrets in prestige TV, and so it is in \"Mare of Easttown,\" a showcase for Kate Winslet that resembles \"Broadchurch\" in the broad strokes, before establishing its own distinct personality. Slow to start, the limited series gains momentu…", "url": "https://www.cnn.com/2021/04/15/entertainment/mare-of-easttown-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405175248-mare-of-easttown-kate-winslet-super-tease.jpg", "publishedAt": "2021-04-15T20:44:53Z", "content": "(CNN)Small towns harbor big secrets in prestige TV, and so it is in \"Mare of Easttown,\" a showcase for Kate Winslet that resembles \"Broadchurch\" in the broad strokes, before establishing its own dist… [+2339 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden puts his stamp on foreign policy with series of momentous decisions", "description": "After President Joe Biden declared Wednesday that the US must shift focus from a bloody and intractable war to more modern-day pursuits, it took less than 24 hours for him to put his words into practice.", "url": "https://www.cnn.com/2021/04/15/politics/foreign-policy-joe-biden-russia-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414150627-05-biden-afghanistan-remarks-0414-super-tease.jpg", "publishedAt": "2021-04-15T20:25:25Z", "content": "WASHINGTON (CNN)After President Joe Biden declared Wednesday that the US must shift focus from a bloody and intractable war to more modern-day pursuits, it took less than 24 hours for him to put his … [+10555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "San Antonio Airport put on lockdown after officer-involved shooting", "description": "San Antonio International Airport was put on lockdown Thursday afternoon following an officer-involved shooting, according to a tweet from police.", "url": "https://www.cnn.com/2021/04/15/us/san-antonio-texas-airport-lockdown-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415160744-san-antonio-airport-file-super-tease.jpg", "publishedAt": "2021-04-15T20:11:45Z", "content": "(CNN)San Antonio International Airport was put on lockdown Thursday afternoon following an officer-involved shooting, according to a tweet from police.\r\n\"There is no active threat to the public,\" San… [+172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Ada Wood, CNN", "title": "Meet Bearsun, the real-life teddy bear on a journey from Los Angeles to San Francisco", "description": "Bearsun is walking over 400 miles from Los Angeles to San Francisco, in just over a week. What started as an artistic project now has become an act of spontaneity, overcoming challenges and making people smile.", "url": "https://www.cnn.com/travel/article/bearsun-walk-to-san-francisco-travel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415143932-02-bearsun-walk-to-san-francisco-travel-restricted-super-tease.jpg", "publishedAt": "2021-04-15T20:11:37Z", "content": "(CNN) His name is Bearsun. And right now, he's walking more than 400 miles from Los Angeles to San Francisco with little more than his bear suit. While it's not this life-size teddy bear's first jour… [+3999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Hertling", "title": "Biden made the right call on Afghanistan", "description": "As we rightly end this war, the government and the people will move on, writes Mark Hertling, but those who fought will be haunted by so many thoughts and experiences, and by the faces of those who were lost. More than others, they will be plagued by doubts a…", "url": "https://www.cnn.com/2021/04/15/opinions/ending-afghanistan-war-is-right-call-hertling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414165327-30-afghanistan-war-unf-super-tease.jpg", "publishedAt": "2021-04-15T20:07:54Z", "content": "Retired Lt. Gen. Mark Hertling is a national security, intelligence and terrorism analyst for CNN. He served for 37 years in the Army, including three years in combat, and retired as commanding gener… [+5550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Julian Kheel", "title": "Is the Chase Sapphire Reserve worth the annual fee?", "description": "The Chase Sapphire Reserve is a popular credit card, but it comes with a high $550 price tag. Our in-depth analysis explores if the card is worth the cost.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/chase-sapphire-reserve-annual-fee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200108161947-chaselead-super-169.jpg", "publishedAt": "2021-04-15T20:01:11Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value, but does not review all financial companies or all available financial offers. We may r… [+13884 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "Putin and Biden are circling each other warily", "description": "Joe Biden had vowed that Putin would \"pay a price\" for his actions --interfering with America's elections, aggression and occupation in Ukraine, involvement in the SolarWinds hack, and more -- and is following through with a series of punishing sanctions, wri…", "url": "https://www.cnn.com/2021/04/15/opinions/russia-sanctions-biden-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200302230917-putin-autocrata-super-tease.jpg", "publishedAt": "2021-04-15T19:41:51Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+6519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Pence underwent successful surgery to have a pacemaker implanted", "description": "Former Vice President Mike Pence underwent a successful surgery Wednesday to have a pacemaker implanted to help combat a slow heart rate he's recently experienced, his office said in a statement.", "url": "https://www.cnn.com/2021/04/15/politics/mike-pence-pacemaker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115145314-01-mike-pence-0104-super-tease.jpg", "publishedAt": "2021-04-15T19:31:08Z", "content": "Washington (CNN)Former Vice President Mike Pence underwent a successful surgery Wednesday to have a pacemaker implanted to help combat a slow heart rate he's recently experienced, his office said in … [+1176 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "Top US general for Europe acknowledges vaccine distribution lag at overseas bases", "description": "The top American general responsible for troops in Europe said there has not been an equal distribution of vaccines between bases inside of the United States and overseas so far during a congressional hearing on Thursday.", "url": "https://www.cnn.com/2021/04/15/politics/top-general-uneven-distribution-europe-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415095914-vaccine-super-tease.jpg", "publishedAt": "2021-04-15T19:22:28Z", "content": "(CNN)The top American general responsible for troops in Europe said there has not been an equal distribution of vaccines between bases inside of the United States and overseas so far during a congres… [+2382 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Patrick Oppmann, CNN", "title": "Cuba's Raul Castro prepares to step down, ending the era of his famous clan at the country's helm", "description": "When Raul Castro announced three years ago that he would step down in 2021 as head of Cuba's all-powerful communist party, he surely envisioned the island on firmer economic footing and the transition to a new generation of leadership nearly complete.", "url": "https://www.cnn.com/2021/04/15/americas/cuba-raul-castro-communist-leader-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210412230605-cnne-raul-castro-super-tease.jpg", "publishedAt": "2021-04-15T19:21:41Z", "content": "Havana (CNN)When Raul Castro announced three years ago that he would step down in 2021 as head of Cuba's all-powerful communist party, he surely envisioned the island on firmer economic footing and t… [+5938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Whitson Gordon", "title": "Ditch your ugly tech with these nearly invisible smart gadgets", "description": "As much as modern gadgets try to be sleek and alluring, a lot of it still sticks out like a sore thumb. So if you want to deck out your home in smart gear, you usually have to deal with some big dials, dongles and doodads hanging on your doors and walls. Ther…", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/hidden-technology/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415131820-invisible-tech-lead-image-super-169.jpg", "publishedAt": "2021-04-15T19:02:07Z", "content": "As much as modern gadgets try to be sleek and alluring, a lot of it still sticks out like a sore thumb. So if you want to deck out your home in smart gear, you usually have to deal with some big dial… [+8008 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sherry Cola", "title": "Our beautiful Asian faces are not going anywhere", "description": "Sherry Cola writes that seeing little to no Asian representation in Hollywood brainwashed her into believing that her name could never be in lights and that in many ways the rise in anti-Asian hate crimes is a direct result of the scarce and inaccurate portra…", "url": "https://www.cnn.com/2021/04/15/opinions/asian-american-hollywood-sherry-cola/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210202151728-20210203-hollywood-visibility-awkwafina-kreider-dae-kim-super-tease.jpg", "publishedAt": "2021-04-15T19:00:44Z", "content": "Sherry Cola is an actress, standup comedian, and writer. She currently stars as \"Alice\" in Freeform's hit drama series, \"Good Trouble.\" The opinions expressed in this commentary are her own. View mor… [+4570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How the ugly, racist White 'replacement theory' came to Congress", "description": "Pennsylvania Republican Rep. Scott Perry used a House Foreign Affairs Committee meeting on Wednesday to spread an ugly, racist theory that \"native-born\" (read: White) Americans are being purposely replaced by immigrants as a way to alter the culture of the co…", "url": "https://www.cnn.com/2021/04/15/politics/scott-perry-white-replacement-theory-tucker-carlson-fox-news/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311095359-tucker-carlson-file-2018-super-tease.jpg", "publishedAt": "2021-04-15T19:00:10Z", "content": "(CNN)Pennsylvania Republican Rep. Scott Perry used a House Foreign Affairs Committee meeting on Wednesday to spread an ugly, racist theory that \"native-born\" (read: White) Americans are being purpose… [+4497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Dean, Betsy Klein and Annie Grayer, CNN", "title": "Talks over bill to overhaul policing intensify amid new urgency after Daunte Wright shooting", "description": "Active discussions are underway in Congress over a bipartisan bill to overhaul laws surrounding policing as the Biden administration made the decision earlier this week to let Congress tackle the issue, standing down on its campaign promise to create a White …", "url": "https://www.cnn.com/2021/04/15/politics/policing-reform-bill-congress-negotiations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414223934-01-brooklyn-center-protests-0414-super-tease.jpg", "publishedAt": "2021-04-15T18:53:02Z", "content": "(CNN)Active discussions are underway in Congress over a bipartisan bill to overhaul laws surrounding policing as the Biden administration made the decision earlier this week to let Congress tackle th… [+8001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rafael Romo", "title": "Chile's vaccination rollout was fast and broad. So why are Covid-19 cases spiking?", "description": "It was supposed to be Latin America's bright spot in the fight against Covid-19.", "url": "https://www.cnn.com/2021/04/15/americas/chile-coronavirus-vaccination-cases-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415123020-02-chile-coronavirus-vaccine-0324-super-tease.jpg", "publishedAt": "2021-04-15T18:43:48Z", "content": "(CNN)It was supposed to be Latin America's bright spot in the fight against Covid-19. \r\nChile, a country of 19 million on the Pacific coast of South America, had gotten a head start on vaccines by ma… [+7213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Veronica Stracqualursi, CNN", "title": "Maxine Waters tells Jim Jordan to 'shut your mouth' after Covid-19 hearing erupts", "description": "Republican Rep. Jim Jordan and the nation's top infectious disease expert Dr. Anthony Fauci got into a heated exchange Thursday over the country's Covid-19 mitigation measures, which ended with Democratic Rep. Maxine Waters telling Jordan to \"shut your mouth.\"", "url": "https://www.cnn.com/2021/04/15/politics/jim-jordan-anthony-fauci-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415135117-01-jim-jordan-0415-super-tease.jpg", "publishedAt": "2021-04-15T18:27:22Z", "content": "(CNN)Republican Rep. Jim Jordan and the nation's top infectious disease expert Dr. Anthony Fauci got into a heated exchange Thursday over the country's Covid-19 mitigation measures, which ended with … [+2660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Emmy Favilla", "title": "The best workout leggings of 2021", "description": "We rounded up 10 staffers to put more than a dozen pairs of leggings to the test — and found one pair that stood out as the best workout leggings of 2021.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/best-workout-leggings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415112937-best-leggings-lead-super-169.jpg", "publishedAt": "2021-04-15T17:57:12Z", "content": "We rounded up 10 staffers to put more than a dozen pairs of leggings to the test. Our testers (who wear a range of sizes and have some pretty strong opinions on leggings) judged each pair on quality,… [+19224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Julia Buckley, CNN", "title": "Cruise ships are heading back to Venice this year", "description": "The Italian government has voted to ban cruise ships from the Venice lagoon, but while authorities look at plans for a new terminal, 2021 will see ships back in the city.", "url": "https://www.cnn.com/travel/article/venice-cruise-ships-back/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401165140-venice-cruise-ship-stmarks-square-super-tease.jpg", "publishedAt": "2021-04-15T17:45:08Z", "content": "(CNN) It's set to be one of the first cruises to take to the waters after things start back up this summer. \r\nDeparting June 5, the sumptuous MSC Orchestra will take a week-long trip around the Adria… [+4762 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Brian Fung and Marshall Cohen, CNN", "title": "Six key takeaways from Biden's Russia sanctions announcement", "description": "The Biden administration slapped sweeping sanctions on Russia Thursday over Moscow's alleged interference in the 2020 election, the massive SolarWinds hack and the ongoing occupation of Crimea, signaling it is adopting a tougher posture toward the Kremlin and…", "url": "https://www.cnn.com/2021/04/15/politics/russia-sanctions-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201215031414-putin-biden-split-super-tease.jpg", "publishedAt": "2021-04-15T17:15:02Z", "content": "Washington (CNN)The Biden administration slapped sweeping sanctions on Russia Thursday over Moscow's alleged interference in the 2020 election, the massive SolarWinds hack and the ongoing occupation … [+8877 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette, Kylie Atwood and Jennifer Hansler, CNN", "title": "Biden administration expected to announce nine career diplomats will be US ambassadors", "description": "The Biden administration plans to announce the nominations of nine career diplomats to be United States ambassadors as soon as Thursday, marking the first selection of overseas envoys since President Joe Biden took office, according to an internal list review…", "url": "https://www.cnn.com/2021/04/15/politics/biden-ambassador-nominations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180502113209-president-trump-state-department-5-2-2018-super-tease.jpg", "publishedAt": "2021-04-15T17:14:11Z", "content": "Washington (CNN)The Biden administration plans to announce the nominations of nine career diplomats to be United States ambassadors as soon as Thursday, marking the first selection of overseas envoys… [+2993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Courtney Thompson", "title": "Skims' Fits Everybody line is the most comfortable underwear we've ever worn", "description": "Skims has just replenished the basics from its Fits Everybody core collection that had a waitlist of more than 250,000 people and dropped a few new bodysuit and T-shirt styles.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/skims-fits-everybody-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413174534-skims-lead-super-169.jpg", "publishedAt": "2021-04-15T17:01:59Z", "content": "Another week brings another new drop from Skims, Kim Kardashian Wests ultra-popular underwear/shapewear/loungewear brand. On the heels of its Cozy line restock (learn more about those fuzzy wares her… [+6911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What Liz Cheney has figured out about Donald Trump and 2024", "description": "On Wednesday, Rep. Liz Cheney was asked a straightforward question by Fox News' Neil Cavuto: \"If Donald Trump were the 2024 nominee, would you support him?\" And the Wyoming House Republican gave an equally straightforward answer: \"I would not.\"", "url": "https://www.cnn.com/2021/04/15/politics/liz-cheney-donald-trump-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210203173822-liz-cheney-0203-super-tease.jpg", "publishedAt": "2021-04-15T16:59:31Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "We want to hear about those you've lost to the coronavirus. Share their stories here", "description": "\"The Situation Room with Wolf Blitzer\" is sharing stories of people who have lost their lives to the coronavirus. Please tell us their story.", "url": "https://www.cnn.com/2021/04/15/us/covid-memorial-callout-sitroom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180105095755-the-situation-room-wolf-16x9-podcast-super-tease.jpg", "publishedAt": "2021-04-15T16:41:35Z", "content": "Updated 12:41 PM ET, Thu April 15, 2021\r\n (CNN)\"The Situation Room with Wolf Blitzer\" is sharing stories of people who have died of Covid-19. \r\nPlease tell us their story in the form below. We may fo… [+55 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Walmart invests in GM's self-driving car company, Cruise", "description": "Walmart is investing in GM's self-driving vehicle company, Cruise, as it works to build out its delivery network.", "url": "https://www.cnn.com/2021/04/15/tech/walmart-cruise/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415104933-walmart-cruise-super-tease.jpg", "publishedAt": "2021-04-15T16:25:51Z", "content": "Washington, DC (CNN)Walmart is investing in GM's(GM) self-driving vehiclecompany, Cruise, as it works to build out its delivery network. \r\nThe size of the investment was not disclosed, but it is less… [+1952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, Annie Grayer and Joan Biskupic, CNN", "title": "Private spat between McConnell and Pelosi regarding RBG's memorial at Capitol highlighted in new book", "description": "House Speaker Nancy Pelosi has never kept quiet about her distaste for Senate Minority Leader Mitch McConnell, but an anecdote from an upcoming book reveals details of a disagreement over the placement of the late Supreme Court Justice Ruth Bader Ginsburg's r…", "url": "https://www.cnn.com/2021/04/15/politics/mcconnell-ruth-bader-ginsburg/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191220122556-02-pelosi-mcconnell-split-super-tease.jpg", "publishedAt": "2021-04-15T16:17:11Z", "content": "(CNN)House Speaker Nancy Pelosi has never kept quiet about her distaste for Senate Minority Leader Mitch McConnell, but an anecdote from an upcoming book reveals details of a disagreement over the pl… [+2293 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Millions of children are still waiting for pandemic food aid as school year nears end", "description": "Congress last year extended the Pandemic-EBT program into the 2020-2021 school year, but millions of parents across the nation have yet to receive billions of dollars of federal nutrition assistance.", "url": "https://www.cnn.com/2021/04/15/politics/children-hunger-federal-pandemic-food-aid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414233732-p-ebt-card-illinois-super-tease.jpg", "publishedAt": "2021-04-15T16:11:36Z", "content": "(CNN)Andrew Francese depends on free school meals to help him feed his two children. But both of them are studying remotely this year, so the single dad had hoped to rely on a pandemic aid program th… [+7140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Hyundai reveals a new pickup truck, but please don't call it that", "description": "While it may have an open cargo bed in the back, Hyundai's new Santa Cruz is not a pickup truck. Or, at least, not according to Hyundai.", "url": "https://www.cnn.com/2021/04/15/success/hyundai-santa-cruz-pickup-truck/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414162910-02-hyundai-compact-pickup-truck-restricted-super-tease.jpg", "publishedAt": "2021-04-15T16:07:23Z", "content": "(CNN)While it may have an open cargo bed in the back, Hyundai's new Santa Cruz is not a pickup truck. Or, at least, not according to Hyundai. \r\nInstead, the automaker calls it a \"sport adventure vehi… [+2369 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "Everlane is diving into swimwear with a new, sustainable line of bathing suits", "description": "Everlane is making a splash in a whole new apparel category just in time for summertime beach days and poolside lounging: swimwear.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/everlane-swim-collection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414163737-everlane2-super-169.jpg", "publishedAt": "2021-04-15T16:01:10Z", "content": "Everlane already makes some of our favorite loungewear, leggings and sneakers just to name a few of the brands minimalist cool classics. And now Everlane is making a splash in a whole new apparel cat… [+1897 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, David Wilkinson and Lauren Said-Moorhouse, CNN", "title": "Buckingham Palace announces guest list for Philip's funeral", "description": "Buckingham Palace has revealed the 30 people who will make up the congregation at the Duke of Edinburgh's funeral service on Saturday.", "url": "https://www.cnn.com/2021/04/15/uk/prince-philip-funeral-arrangements-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180720150603-06-prince-philip-lead-image-2017-super-tease.jpg", "publishedAt": "2021-04-15T16:00:51Z", "content": "Windsor, England (CNN)Buckingham Palace has revealed the 30 people who will make up the congregation at the Duke of Edinburgh's funeral service on Saturday.\r\nPrince Philip, who died last Friday at th… [+4607 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Google Earth's new Timelapse feature shows 40 years of climate change in just seconds", "description": "Google Earth latest feature, Timelapse, lets users see how 40 years of climate change have impacted places all over the world.", "url": "https://www.cnn.com/videos/business/2021/04/15/google-earth-timelapse-zw-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415093938-03-google-earth-timelapse-super-tease.jpg", "publishedAt": "2021-04-15T15:57:39Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Are movie theaters safe at this point of the pandemic? What you should know", "description": "Here's what experts have said about the risks of going to movie theaters at this point of the pandemic and -- if you go -- what to plan for and expect.", "url": "https://www.cnn.com/2021/04/15/health/movie-theaters-safety-pandemic-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210406161315-01-movie-theater-covid-0315-super-tease.jpg", "publishedAt": "2021-04-15T15:37:26Z", "content": "There are few no-risk activities during the Covid-19 pandemic, but there are ways to mitigate risks. Fully vaccinated people are, of course, at much lower risk of contracting and spreading coronaviru… [+3897 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "Marvel shows off its deep bench of characters in 'Falcon' and 'WandaVision'", "description": "Marvel Comics was built on titles with a 60-year history, like Fantastic Four, Spider-Man and the Hulk. But some of the characters recently getting attention and lighting up social media have names like Sharon Carter, Jimmy Woo and the Dora Milaje.", "url": "https://www.cnn.com/2021/04/15/entertainment/marvel-deep-bench-column/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414161228-falcon-and-the-winter-soldier-anthony-mackie-emily-vancamp-super-tease.jpg", "publishedAt": "2021-04-15T15:31:15Z", "content": "(CNN)Marvel Comics was built on titles with a 60-year history, like Fantastic Four, Spider-Man and the Hulk. But some of the characters recently getting attention and lighting up social media have na… [+3814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Céline Gounder", "title": "An abundance of caution and good science are the right way to build trust in vaccines", "description": "All in all, the risk of blood clots from the J&J vaccine is extremely low when compared to the risk of blood clots in other contexts, writes Céline Gounder, who points to the fact that the six blood clot cases are out of over 1 million women in the 20-50 age …", "url": "https://www.cnn.com/2021/04/15/opinions/johnson-vaccine-risk-acip-meeting-gounder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413130350-01-us-covid-19-vaccine-dose-jj-0315-super-tease.jpg", "publishedAt": "2021-04-15T15:25:42Z", "content": "Céline Gounder, MD, ScM, FIDSA is an internist, infectious disease specialist, and epidemiologist. She's the host of the Epidemic and American Diagnosis podcasts, the CEO of Just Human Productions, a… [+6987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Williams, Jeremy Herb and Marshall Cohen, CNN", "title": "Biden administration confirms Russian agent shared 2016 Trump polling data as part of election interference efforts", "description": "The Biden administration on Thursday revealed new details about Russia's extensive interference in the 2016 and 2020 US elections, including disclosing for the first time that a Russian agent who received internal polling data from the Trump campaign in 2016 …", "url": "https://www.cnn.com/2021/04/15/politics/biden-russia-election-interference/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200318190038-panorama-kremlin-ue-campana-covid-super-tease.jpg", "publishedAt": "2021-04-15T15:23:29Z", "content": "(CNN)The Biden administration on Thursday revealed new details about Russia's extensive interference in the 2016 and 2020 US elections, including disclosing for the first time that a Russian agent wh… [+4970 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "The best sales to shop today: Samsung, Allswell, Apple and more", "description": "Today, you'll find a deal on our top external hard drive pick, a discounted Eufy robo vac and savings on Apple's AirPods Pro. All that and more below.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415103307-0415dealslead-super-169.jpg", "publishedAt": "2021-04-15T15:15:49Z", "content": "Today, youll find a deal on our top external hard drive pick, a discounted Eufy robo vac and savings on Apples AirPods Pro. All that and more below.\r\nSamsungs newest and best earbuds are down to one … [+8991 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Don't be fooled: The Supreme Court isn't expanding anytime soon", "description": "One of the most common mistakes in Washington is to confuse movement with action.", "url": "https://www.cnn.com/2021/04/15/politics/supreme-court-expansion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210408212351-16-stephen-breyer-super-tease.jpg", "publishedAt": "2021-04-15T15:07:28Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Habiba Sarabi, Fawzia Koofi and Sharifa Zurmati", "title": "As Afghan women, we finally have a seat at peace talks. Don't abandon us", "description": "After two decades of war, this can be a historic year of peace in Afghanistan. But, as Afghan negotiators, we are duty-bound to caution that peace must not come at the cost of our humanity. And it must not come at the cost of the rights of Afghan women, who h…", "url": "https://www.cnn.com/2021/04/15/opinions/afghanistan-peace-talks-koofi-sarabi-zurmati/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414160328-01-kabul-peace-talks-rally-0329-super-tease.jpg", "publishedAt": "2021-04-15T14:48:31Z", "content": "Dr. Habiba Sarabi, Fawzia Koofi and Sharifa Zurmati are members of the Islamic Republic of Afghan negotiations team engaged in peace talks with the Taliban. The views expressed in this commentary are… [+5427 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Delta stopped burning through cash in March", "description": "Since the pandemic hit the US airline industry last March, major carriers have been burning through millions of dollars a day. For Delta Air Lines, at least, that ended last month.", "url": "https://www.cnn.com/2021/04/15/business/delta-earnings-cash/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415065007-restricted-delta-plane-atlanta-0407-super-tease.jpg", "publishedAt": "2021-04-15T14:17:10Z", "content": "New York (CNN Business)Since the pandemic hit the US airline industry last March, major carriers have been burning through millions of dollars a day. For Delta Air Lines(DAL), at least, that ended la… [+1733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jack Guy, CNN", "title": "'High status' Roman villa and bath house found in England", "description": "Remains of a complex of Roman buildings have been uncovered during construction work on a new housing development near the northern coastal town of Scarborough.", "url": "https://www.cnn.com/travel/article/roman-villa-scarborough-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415084843-restricted-02-roman-villa-scarborough-scli-intl-gbr-super-tease.jpg", "publishedAt": "2021-04-15T13:53:03Z", "content": "(CNN) Remains of a complex of \"high-status\" Roman buildings have been uncovered during construction work on a new housing development in northern England.\r\nThe rare remains were discovered in Scarbor… [+1965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Dana Holmes", "title": "A beginner's guide to stargazing", "description": "We've been doing it for thousands of years, but stargazing is now a truly ideal socially distant activity. We spoke with a professional to get the lowdown on what stargazing and astronomy beginners need.", "url": "https://www.cnn.com/2021/04/15/cnn-underscored/stargazing-astronomy-for-beginners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413115716-starlead-super-169.jpg", "publishedAt": "2021-04-15T13:52:43Z", "content": "With warm nights ahead of us, stargazing is about to be your new favorite outdoor activity. \r\nTo get the full picture of whats needed to get better acquainted with the night skies, we spoke with astr… [+12336 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Cathie Wood's Ark funds bought a big stake in Coinbase", "description": "Ark Invest's Cathie Wood, known for her bullishness on momentum stocks, especially Tesla, is making another big bet: This time, on Coinbase Global.", "url": "https://www.cnn.com/2021/04/15/investing/coinbase-cathie-wood-ark-invest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415092142-cathie-wood-ark-investment-restricted-super-tease.jpg", "publishedAt": "2021-04-15T13:43:47Z", "content": "New York (CNN Business)Ark Invest's Cathie Wood, known for her bullishness on momentum stocks, especially Tesla, is making another big bet: This time, on Coinbase Global. \r\nThree of Ark's funds bough… [+2190 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Cat food company makes cookbook for humans", "description": "Fancy Feast has released a cookbook for humans to prepare meals that can pair with those of your cat. HLN's Robin Meade has more.", "url": "https://www.cnn.com/videos/business/2021/04/15/fancy-feast-cookbook-for-humans-cat-food-company-mxp-meade-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415085851-fancy-feast-cookbook-super-tease.jpg", "publishedAt": "2021-04-15T13:11:26Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Chicago police body camera footage to be released in fatal shooting of 13-year-old boy", "description": "The Chicago Civilian Office of Police Accountability will release body camera footage on Thursday from the fatal police shooting of 13-year-old Adam Toledo last month.", "url": "https://www.cnn.com/2021/04/15/us/adam-toledo-police-shooting-body-camera/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415085433-01-adam-toledo-super-tease.jpg", "publishedAt": "2021-04-15T13:02:13Z", "content": "(CNN)The Chicago Civilian Office of Police Accountability will release body camera footage on Thursday from the fatal police shooting of 13-year-old Adam Toledo last month. \r\nThe boy's family saw the… [+2435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Hayes, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Derek Chauvin is on trial for George Floyd's death", "description": "It's Day 14 of testimony in the trial of ex-Minneapolis police officer Derek Chauvin, who is charged in George Floyd's May 2020 death. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/derek-chauvin-trial-04-15-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg", "publishedAt": "2021-04-15T12:31:25Z", "content": "Maryland's former chief medical examiner testified for Derek Chauvin's defense on Wednesday that George Floyd died due to his underlying heart disease not the police restraint.\r\n\"In my opinion, Mr. F… [+1148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by K. \"Vish\" Viswanath for CNN Business Perspectives", "title": "The consequences will be deadly if we don't fight vaccine misinformation", "description": "Social media companies must do more to combat vaccine misinformation and disinformation. If they don't, the consequences could literally be deadly, as vaccinations are key to stemming the pandemic.", "url": "https://www.cnn.com/2021/04/15/perspectives/vaccine-misinformation-social-media/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414110235-us-vaccination-0408-super-tease.jpg", "publishedAt": "2021-04-15T12:17:05Z", "content": "K. \"Vish\" Viswanath, PhD, is director of the Harvard T.H. Chan School of Public Health India Research Center. He is also the Lee Kum Kee Professor of Health Communication at Harvard Chan. The opinion… [+5766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Hada Messia and Amy Woodyatt, CNN", "title": "Off-duty police discover stolen Roman statue in Belgian antiques shop", "description": "Italian police recovered a stolen Roman statue after off-duty officers noticed it in a Belgian antique shop almost a decade after it was looted from an archeological site, according to authorities.", "url": "https://www.cnn.com/style/article/italy-art-statue-stolen-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415121520-01-roman-statue-belgium-antique-shop-super-tease.jpg", "publishedAt": "2021-04-15T12:09:41Z", "content": "artsPublished 15th April 2021\r\nItalian police recovered a stolen Roman statue after off-duty officers noticed it in a Belgian antique shop almost a decade after it was looted from an archeological si… [+1418 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "The US could have 300M extra vaccines. Why won't it share?", "description": "The United States could have around 300 million excess Covid-19 shots by the end of July, health policy experts at Duke University estimated in a report Thursday, calling on the country to share doses more widely to address the stark inequality around global …", "url": "https://www.cnn.com/2021/04/15/world/coronavirus-newsletter-intl-04-15-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-04-15T12:07:00Z", "content": "A version of this story appeared in the April 14 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)The United States … [+8346 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz and Veronica Stracqualursi, CNN", "title": "House panel advances bill to study reparations for descendants of enslaved Americans", "description": "A House committee on Wednesday advanced a bill that would create a commission to study reparations for descendants of enslaved Americans, a major achievement for advocates of reparations as it marks the first time this bill would have a full House vote on the…", "url": "https://www.cnn.com/2021/04/15/politics/house-judiciary-reparations-commission/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415072504-screengrab-sheila-jackson-lee-0414-super-tease.jpg", "publishedAt": "2021-04-15T12:02:18Z", "content": "Washington (CNN)A House committee on Wednesday advanced a bill that would create a commission to study reparations for descendants of enslaved Americans, a major achievement for advocates of reparati… [+3622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "Here we go! Earnings season is underway", "description": "View more stock market news today.", "url": "https://www.cnn.com/business/live-news/first-quarter-earnings-news/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401120408-nyse-0323-super-tease.jpg", "publishedAt": "2021-04-15T11:29:33Z", "content": "Earnings season is underway, and the first signs are positive.\r\nJPMorgan (JPM), America's biggest bank measured by assets, reported $14.3 billion in net income in the first three months of the year, … [+975 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "Capitol Police inspector general to testify about lapses in planning ahead of Capitol 'takeover'", "description": "The inspector general overseeing a probe into the United States Capitol Police's preparation for and response to the January 6 insurrection is set to detail critical lapses in planning, policies and procedures resulting in the catastrophic failure that killed…", "url": "https://www.cnn.com/2021/04/15/politics/capitol-police-inspector-general-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413102700-us-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-04-15T11:08:12Z", "content": "(CNN)The inspector general overseeing a probe into the United States Capitol Police's preparation for and response to the January 6 insurrection is set to detail critical lapses in planning, policies… [+3525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priya Krishnakumar, CNN", "title": "This record-breaking year for anti-transgender legislation would affect minors the most", "description": "Thirty-three states have introduced more than 100 bills that aim to curb the rights of transgender people across the country, with advocacy groups calling 2021 a record-breaking year for such legislation.  Many of these bills are rapidly making their way thro…", "url": "https://www.cnn.com/2021/04/15/politics/anti-transgender-legislation-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414144907-hp-only-20210414-anti-trans-legislation-map-super-tease.png", "publishedAt": "2021-04-15T11:04:40Z", "content": "(CNN)Thirty-three states have introduced more than 100 bills that aim to curb the rights of transgender people across the country, with advocacy groups calling 2021 a record-breaking year for such le… [+10440 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Secretary of State Blinken visits Afghanistan day after US announces plans for withdrawal", "description": "Secretary of State Antony Blinken arrived in Kabul, Afghanistan, Thursday in an unannounced visit to the country where US troops have been fighting for nearly 20 years.", "url": "https://www.cnn.com/2021/04/15/politics/blinken-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210412154348-tony-blinken-file-november-2020-super-tease.jpg", "publishedAt": "2021-04-15T10:50:00Z", "content": "(CNN)Secretary of State Antony Blinken arrived in Kabul, Afghanistan, Thursday in an unannounced visit to the country where US troops have been fighting for nearly 20 years.\r\nBlinken touched down in … [+1759 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "They met at an airport and fell in love", "description": "A mutual friend put Finnish New Yorker Irja Uotila in touch with Mexican local Jesus Estrella during her 12-hour airport layover in Mexico City. Thirty years later Irja and Jesus are married with a daughter living in New York.", "url": "https://www.cnn.com/travel/article/airport-romance-mexico-city-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415113528-jesus-and-irja-tz-super-tease.jpg", "publishedAt": "2021-04-15T10:48:13Z", "content": "(CNN) August 1991. Irja Uotila, a Finnish publishing employee living in New York, decided to finally fulfill a long-held dream of visiting Latin America.\r\nShe'd fantasized about traveling through the… [+14226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faye Chiu, CNN", "title": "What to make of the Johnson & Johnson vaccine pause? Dr. Wen, who got J&J herself, says not to worry", "description": "CNN Medical Analyst Dr. Leana Wen explains what the Johnson & Johnson vaccine pause means, especially for people who have received that vaccine and those who are scheduled to receive it. Dr. Wen -- who herself got the J&J dose -- weighs in on what you should …", "url": "https://www.cnn.com/2021/04/15/health/johnson-and-johnson-vaccine-concerns-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414185138-johnson--johnson-vaccine-vial-file-super-tease.jpg", "publishedAt": "2021-04-15T10:46:10Z", "content": "(CNN)The US Food and Drug Administration and the Centers for Disease Control and Prevention said Tuesday that they were recommending a pause in the use of the Johnson &amp; Johnson Covid-19 vaccine. … [+7579 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "Real Madrid team bus window smashed by soccer fans ahead of Champions League tie in Liverpool", "description": "Liverpool has condemned \"a few individuals\" for their \"shameful behavior\" after fans smashed a window of the Real Madrid team bus ahead of the Champions League quarterfinal on Wednesday.", "url": "https://edition.cnn.com/2021/04/15/football/real-madrid-liverpool-team-bus-damage-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415054708-restricted-real-madrid-team-bus-damaged-0414-super-tease.jpg", "publishedAt": "2021-04-15T10:32:09Z", "content": "(CNN)Liverpool has condemned \"a few individuals\" for their \"shameful behavior\" after fans smashed a window of the Real Madrid team bus ahead of the Champions League quarterfinal on Wednesday. \r\nMerse… [+678 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Canada and USA have unveiled their Olympic uniforms and the internet -- of course -- has thoughts", "description": "A riff on the \"Canadian tuxedo\" or '80s high school apparel? The North American neighbors inspired plenty of online chatter when they revealed their Olympic and Paralymic closing ceremony uniforms this week.", "url": "https://www.cnn.com/style/article/team-canada-usa-olympic-uniforms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415034342-team-canada-team-usa-jackets-split-super-tease.jpg", "publishedAt": "2021-04-15T10:26:09Z", "content": "Team USA has unveiled its uniforms for the rescheduled Olympic and Paralympic closing ceremonies, which are due to take place in Tokyo later this year. \r\nCreated by quintessential American designer R… [+2478 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Jamie Dimon says 'American dream is fraying'", "description": "JPMorgan Chase CEO Jamie Dimon is bullish about the economy, but he remains concerned about the growing wealth gap, particularly for Black people, in the United States.", "url": "https://www.cnn.com/2021/04/15/investing/jamie-dimon-david-axelrod/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414085059-01-jamie-dimon-file-restricted-super-tease.jpg", "publishedAt": "2021-04-15T10:20:33Z", "content": "New York (CNN Business)JPMorgan Chase CEO Jamie Dimon is bullish about the economy, but he remains concerned about the growing wealth gap, particularly for Black people, in the United States. \r\n\"The … [+3879 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for April 15: Covid, White House, voter suppression, Russia, China", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/04/15/us/five-things-april-15-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414190703-pfizer-vacuna-covid-roma-italia-super-tease.jpg", "publishedAt": "2021-04-15T10:20:10Z", "content": "(CNN)It's Tax Day in the US, but don't freak out! You still have a month to file your 2020 return. There are other changes to this tax season you should know about, too. \r\nHere's what you need to kno… [+5582 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Manchester United change seat covering colors to improve home form after players complain", "description": "Whether it be baying fans, a particularly colorful outfit or even a pitch invader, it's not unheard of for football players to suffer distractions.", "url": "https://edition.cnn.com/2021/04/15/football/manchester-united-seat-color-ole-gunnar-solskjaer-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414111356-01-manchester-united-seat-color-restricted-super-tease.jpg", "publishedAt": "2021-04-15T08:36:45Z", "content": "(CNN)Whether it be baying fans, a particularly colorful outfit or even a pitch invader, it's not unheard of for football players to suffer distractions.\r\nThe latest apparent distraction are empty sea… [+1682 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tom Pilcher, for CNN", "title": "'The Short Game': Netflix documentary female stars are helping to change golf", "description": "\"How you like me now?\" say eight sassy golf whiz kids into the camera, accompanied by the catchy tune of the same name in the Netflix documentary, \"The Short Game.\"", "url": "https://edition.cnn.com/2021/04/15/golf/amari-avery-alexa-pano-netflix-the-short-game-spc-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329140013-07-amari-avery-alexa-pano-netflix-the-short-game-restricted-super-tease.jpg", "publishedAt": "2021-04-15T07:16:10Z", "content": "(CNN)\"How you like me now?\" say eight sassy golf whiz kids into the camera, accompanied by the catchy tune of the same name in the Netflix documentary, \"The Short Game.\"\r\nThe year is 2012 and the sta… [+8990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Fauci says this is a pause and not a cancellation of the J&J vaccine. Here's how long a final decision may take", "description": "Dr. Anthony Fauci, the nation's top infectious disease expert, says the recommended pause on the Johnson & Johnson Covid-19 vaccine is just  that: a pause -- and not a cancellation -- and will likely last days to weeks.", "url": "https://www.cnn.com/2021/04/15/health/us-coronavirus-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415001854-fauci-cnn-0414-super-tease.jpg", "publishedAt": "2021-04-15T07:03:48Z", "content": "(CNN)Dr. Anthony Fauci, the nation's top infectious disease expert, says the recommended pause on the Johnson &amp; Johnson Covid-19 vaccine is just that: a pause -- and not a cancellation -- and wil… [+6672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jessie Yeung, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-15-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-15T06:49:22Z", "content": "Banquet halls and hotels in the Indian capital region of Delhi are being converted into extended Covid hospitals as cases continue to surge during the country's second wave.\r\nA total of 23 hotels and… [+1327 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Former officer charged in the death of Daunte Wright to make first court appearance as tension eases at protests", "description": "While protesters gathered for the fourth night in a row in the Minneapolis suburb of Brooklyn Center to protest the fatal shooting of Daunte Wright, there was a palpable easing of tension, according to law enforcement officials, hours after a former police of…", "url": "https://www.cnn.com/2021/04/15/us/daunte-wright-minnesota-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414223934-01-brooklyn-center-protests-0414-super-tease.jpg", "publishedAt": "2021-04-15T06:20:49Z", "content": "(CNN)While protesters gathered for the fourth night in a row in the Minneapolis suburb of Brooklyn Center to protest the fatal shooting of Daunte Wright, there was a palpable easing of tension, accor… [+6243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Sony World Photography Award unveils the year's best photographers", "description": "See the work of the photographers who have been given the prestigious award this year, including the $25,000 top prize.", "url": "https://www.cnn.com/style/article/2021-sony-world-photography-award-winners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413170643-04b-2021-sony-world-photography-award-winners-restricted-super-tease.jpg", "publishedAt": "2021-04-15T06:16:51Z", "content": "artsPublished 15th April 2021\r\nThe annual Sony World Photography Awards has announced the winners of its 2021 competition, with two of the top prizes going to photographers who reexamined biases in h… [+3161 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by James Griffiths, CNN", "title": "John Kerry's Shanghai visit tests whether US and China can cooperate and disagree at the same time", "description": "The bipolar nature of the current US-China relationship is on full display this week, as envoys from Washington land in both Taipei and Shanghai, prompting Beijing to issue angry rebukes and hopes for greater engagement respectively.", "url": "https://www.cnn.com/2021/04/15/asia/john-kerry-shanghai-china-us-taiwan-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210415083328-john-kerry-bangladesh-0409-01-super-tease.jpg", "publishedAt": "2021-04-15T04:18:53Z", "content": "Hong Kong (CNN)The bipolar nature of the current US-China relationship is on full display this week, as envoys from Washington land in both Taipei and Shanghai, prompting Beijing to issue angry rebuk… [+8333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson and Maeve Reston, CNN", "title": "Biden starts to execute on policies Trump abandoned by crossing off another campaign promise", "description": "President Joe Biden is carrying out some of Donald Trump's biggest campaign promises by leaving America's longest war, targeting economic aid at forgotten Americans and building an infrastructure plan that may actually happen.", "url": "https://www.cnn.com/2021/04/15/politics/joe-biden-afghanistan-troop-withdrawal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414154553-02-biden-arlington-national-cemetery-0414-super-tease.jpg", "publishedAt": "2021-04-15T04:01:14Z", "content": "(CNN)President Joe Biden is carrying out some of Donald Trump's biggest campaign promises by leaving America's longest war, targeting economic aid at forgotten Americans and building an infrastructur… [+10262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Lujan Grisham settles with former campaign staffer who accused governor of sexual mistreatment", "description": "New Mexico Gov. Michelle Lujan Grisham and her gubernatorial campaign have settled with a former staffer who accused the Democrat of sexually mistreating him during a meeting, paying out at least $62,500 as part of the agreement.", "url": "https://www.cnn.com/2021/04/14/politics/michelle-lujan-grisham-former-staffer-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201202115440-01-michelle-lujan-grisham-file-2019-super-tease.jpg", "publishedAt": "2021-04-15T03:49:26Z", "content": "(CNN)New Mexico Gov. Michelle Lujan Grisham and her gubernatorial campaign have settled with a former staffer who accused the Democrat of sexually mistreating him during a meeting, paying out at leas… [+2468 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Kanye West's $1M Yeezys may be the world's most expensive sneakers", "description": "Valued at over $1 million, the first Yeezys worn in public by Kanye West will be among the most expensive sneakers ever to appear on the market, according to Sotheby's auction house.", "url": "https://www.cnn.com/style/article/kanye-west-yeezy-sothebys-auction/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414182247-01-yeezy-sothebys-super-tease.jpg", "publishedAt": "2021-04-15T03:32:35Z", "content": "The first Yeezy sneakers ever worn in public by Kanye West are going on sale for over $1 million.\r\nThe Nike Air Yeezy 1 Prototypes, which the American rapper debuted at the 50th Annual Grammy Awards … [+2638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sahar Akbarzai, CNN", "title": "New Yorker who allegedly waved a four-bladed glove at Black Lives Matter protesters indicted on charges of trying to hit them with an SUV", "description": "A New Yorker who prosecutors say yelled \"I will kill you\" at Black Lives Matter protesters and then allegedly drove an SUV onto a sidewalk toward them has been indicted on 39 charges, including nine counts of attempted second-degree murder, the Queens County …", "url": "https://www.cnn.com/2021/04/14/us/new-york-attack-on-blm-protesters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414204016-tease-only-queens-blm-attack-map-super-tease.jpg", "publishedAt": "2021-04-15T03:00:13Z", "content": "New York (CNN)A New Yorker who prosecutors say yelled \"I will kill you\" at Black Lives Matter protesters and then allegedly drove an SUV onto a sidewalk toward them has been indicted on 39 charges, i… [+1554 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "France cuts two nuclear-powered submarines in half to make one new one", "description": "A French nuclear-powered submarine severely damaged by fire last year has been saved from the scrapyard -- by cutting it in two and welding the salvageable half to part of another decommissioned sub.", "url": "https://www.cnn.com/2021/04/14/europe/france-submarines-cut-in-half-intl-hnk-scli-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414041423-perle-saphir-super-tease.jpg", "publishedAt": "2021-04-15T02:38:17Z", "content": "(CNN)A French nuclear-powered submarine severely damaged by fire last year has been saved from the scrapyard -- by cutting it in two and welding the salvageable half to part of another decommissioned… [+4855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "France cuts two nuclear-powered submarines in half to make new one", "description": "A French nuclear-powered submarine severely damaged by fire last year has been saved from the scrapyard -- by cutting it in two and welding the salvageable half to part of another decommissioned sub.", "url": "https://www.cnn.com/2021/04/14/europe/france-submarines-cut-in-half-intl-hnk-scli-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414041423-perle-saphir-super-tease.jpg", "publishedAt": "2021-04-15T02:38:17Z", "content": "(CNN)A French nuclear-powered submarine severely damaged by fire last year has been saved from the scrapyard -- by cutting it in two and welding the salvageable half to part of another decommissioned… [+4855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, CNN", "title": "US is expected to sanction Russia and expel Russian officials in response to hacks and election interference", "description": "The Biden administration is expected to announce sanctions as soon as Thursday targeting Russian individuals and entities, in addition to the expulsion of as many as a dozen Russian diplomats from the US in response to the hack of SolarWinds and election inte…", "url": "https://www.cnn.com/2021/04/14/politics/russia-sanctions-expel-officials-hacking-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201218161649-solarwinds-headquarters---stock-super-tease.jpg", "publishedAt": "2021-04-15T01:54:26Z", "content": "Washington (CNN)The Biden administration is expected to announce sanctions as soon as Thursday targeting Russian individuals and entities, in addition to the expulsion of as many as a dozen Russian d… [+1959 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Karla Cripps, CNN", "title": "Chrissy Teigen's mom Pepper talks cooking, family and why she has to eat Thai food once a day", "description": "Though best known as Chrissy Teigen's mom, Pepper Teigen hopes to make her own mark on the culinary world with the release of her new cookbook. We caught up with the passionate grandmother to find out how growing up inThailand inspired a lifelong passion for …", "url": "https://www.cnn.com/travel/article/pepper-teigen-thai-cookbook-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414205149-pepper-thai-book-cover-super-tease.jpg", "publishedAt": "2021-04-15T01:43:32Z", "content": "(CNN) As anyone who's visited Thailand knows, food is a key part of the experience.\r\nWhether you're street side in Chiang Mai slurping back a bowl of khao soi noodles or enjoying a Michelin-starred T… [+9875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Eric Garner's mother says Caron Nazario, who was pepper-sprayed in a Virginia traffic stop, is part of her family", "description": "Eric Garner's mother saw her son's last minutes after police put him in a chokehold six years ago. This week, she revealed that another family member -- US Army 2nd Lt. Caron Nazario -- was also involved in a controversial police encounter.", "url": "https://www.cnn.com/2021/04/14/us/eric-garner-caron-nazario-family-connection-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414191247-gwen-carr-march-2021-super-tease.jpg", "publishedAt": "2021-04-15T01:28:59Z", "content": "(CNN)Eric Garner's mother saw her son's last minutes after police put him in a chokehold six years ago. This week, she revealed that another family member -- US Army 2nd Lt. Caron Nazario -- was also… [+1739 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Meg Dunn, CNN", "title": "This Boston Marathon bombing survivor is on a mission to give fellow amputees the prosthetic legs insurance won't cover", "description": "Heather Abbott was severely injured in the Boston Marathon bombing. Today, she is helping fellow amputees of all ages receive customized prostheses that allow them to live full, active lives.", "url": "https://www.cnn.com/2021/04/14/us/boston-marathon-bombing-survivor-charity-prosthesis-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414151119-boston-marathon-bombing-survivor-charity-prosthesis-cnnheroes-00001728-super-tease.png", "publishedAt": "2021-04-15T01:12:29Z", "content": "(CNN)Eight years ago, on April 15, 2013, Heather Abbott set out on an annual tradition with friends in Boston. They attended a Red Sox game and then decided to walk over to watch the Boston Marathon.… [+6020 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Sanders says he disagrees with Tlaib's call for 'no more policing'", "description": "Independent Sen. Bernie Sanders said Wednesday evening that he disagreed with Michigan Rep. Rashida Tlaib, a fellow progressive, after she called for \"no more policing, incarceration, and militarization\" in the wake of Daunte Wright's fatal encounter with pol…", "url": "https://www.cnn.com/2021/04/14/politics/bernie-sanders-rashida-tlaib-police-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210220092938-bernie-sanders-210127-super-tease.jpg", "publishedAt": "2021-04-15T01:11:00Z", "content": "Washington (CNN)Independent Sen. Bernie Sanders said Wednesday evening that he disagreed withMichigan Rep. Rashida Tlaib, a fellow progressive, after she called for \"no more policing, incarceration, … [+2297 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "The mystery of Michigan's overwhelming Covid surge", "description": "Kent Sepkowitz writes that in Michigan, daily Covid cases are nearing their highest highs. There are a lot of factors including transmission among young, unvaccinated people and a premature return to normal life that could be fueling this spike.", "url": "https://www.cnn.com/2021/04/14/opinions/michigan-covid-surge-and-vaccines-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210407201545-covid-variant-young-people-hospitalized-file-super-tease.jpg", "publishedAt": "2021-04-15T01:02:49Z", "content": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View mo… [+6096 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Liz Cheney says she won't support Trump if he runs in 2024", "description": "Wyoming Rep. Liz Cheney, the No. 3 House Republican, said Wednesday she would not support Donald Trump if he decided to launch another White House bid in 2024.", "url": "https://www.cnn.com/2021/04/14/politics/liz-cheney-donald-trump-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200723145511-liz-cheney-trump-split-super-tease.jpg", "publishedAt": "2021-04-15T00:03:19Z", "content": "Washington (CNN)Wyoming Rep. Liz Cheney, the No. 3 House Republican, said Wednesday she would not support Donald Trump if he decided to launch another White House bid in 2024. \r\n\"I would not,\" Cheney… [+2254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Scottie Andrew, CNN", "title": "The vaccine passport debate isn't new. It started in 1897 during a plague pandemic", "description": "In the 1890s, the Government of British India enacted a series of measures in an attempt to stop the spread of the plague, which included requiring travelers in certain areas to prove they'd been vaccinated against the bacterial disease.", "url": "https://www.cnn.com/travel/article/vaccine-passports-debate-plague-wellness-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413133049-dr-waldemar-haffkine-super-tease.jpg", "publishedAt": "2021-04-14T23:27:46Z", "content": "Scottie Andrew, CNNPublished 14th April 2021\r\n(CNN) Vaccine passports have been touted by some as our ticket to normalcy -- easily accessible proof of immunization and a reward for those who got thei… [+5706 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, Jennifer Hansler and Oren Liebermann, CNN", "title": "US and other NATO members pledge support to Ukraine while walking fine line with Russia", "description": "The entire 30-member NATO alliance was united in its concern about the massive buildup of Russian forces near Crimea and along Ukraine's borders, US Secretary of State Antony Blinken said in Brussels, Belgium, on Wednesday.", "url": "https://www.cnn.com/2021/04/14/politics/us-nato-ukraine-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414182109-blinken-stoltenberg-austin-0414-super-tease.jpg", "publishedAt": "2021-04-14T23:25:39Z", "content": "(CNN)The entire 30-member NATO alliance was united in its concern about the massive buildup of Russian forces near Crimea and along Ukraine's borders, US Secretary of State Antony Blinken said in Bru… [+4213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Simko-Bednarski, CNN", "title": "Black Buffalo police officer fired for trying to stop chokehold wins ruling, to get pension", "description": "A Black police officer in Buffalo, New York, who was fired in 2008 for intervening when a White colleague employed a chokehold will be given back pay and a pension, a New York judge ruled.", "url": "https://www.cnn.com/2021/04/14/us/buffalo-officer-reinstated-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414144633-01-cariol-horne-2020-super-tease.jpg", "publishedAt": "2021-04-14T22:43:18Z", "content": "(CNN)A Black police officer in Buffalo, New York, who was fired in 2008 for intervening when a White colleague employed a chokehold will be given back pay and a pension, a New York judge ruled.\r\nThe … [+2652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "RIP, ticket-splitting", "description": "Ask anyone how they vote and you are likely to get an answer something like this: \"I vote for the best person -- regardless of party.\"", "url": "https://www.cnn.com/2021/04/14/politics/polarization-ticket-splitting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210301153953-03-voting-file-super-tease.jpg", "publishedAt": "2021-04-14T22:32:18Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Ray Sanchez, CNN", "title": "Virginia police chief calls controversial traffic stop of US Army officer 'a teaching moment'", "description": "The police chief of Windsor, Virginia, said Wednesday that a traffic stop in which two officers pointed guns at a US Army officer, pepper-sprayed him and pushed him to the ground was \"a teaching moment\" and that he wished the soldier had followed commands.", "url": "https://www.cnn.com/2021/04/14/us/virginia-police-stop-army-lieutenant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210410190900-02-windsor-va-traffic-stop-super-tease.jpg", "publishedAt": "2021-04-14T22:31:31Z", "content": "(CNN)The police chief of Windsor, Virginia, said Wednesday that a traffic stop in which two officers pointed guns at a US Army officer, pepper-sprayed him and pushed him to the ground was \"a teaching… [+6045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox and Jacqueline Howard, CNN", "title": "CDC vaccine advisers put off decision on Johnson & Johnson Covid-19 vaccine", "description": "Vaccine advisers to the US Centers for Disease Control and Prevention on Wednesday put off making any decision about the recommendations for Johnson & Johnson's coronavirus vaccine, saying they need more information about a rare type of blood clot.", "url": "https://www.cnn.com/2021/04/14/health/johnson-vaccine-cdc-acip-clots/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401062950-01-johnson-and-johnson-covid-19-vaccine-kentucky-0315-super-tease.jpg", "publishedAt": "2021-04-14T22:22:32Z", "content": "(CNN)Vaccine advisers to the US Centers for Disease Control and Prevention on Wednesday put off making any decision about the recommendations for Johnson &amp; Johnson's coronavirus vaccine, saying t… [+6321 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "20 years in Afghanistan: America's longest war", "description": "President Joe Biden has formally announced his decision to withdraw American troops from Afghanistan before September 11, the 20th anniversary of the terrorist attacks that led the United States into its longest war.", "url": "https://www.cnn.com/2021/04/14/middleeast/gallery/afghanistan-war/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414154336-01-afghanistan-war-unf-super-tease.jpg", "publishedAt": "2021-04-14T22:16:45Z", "content": "US soldiers fire artillery in Afghanistan's Kandahar province in June 2011. Operation Enduring Freedom was launched in October 2001 to stop the Taliban regime from providing a safe haven to al Qaeda … [+1414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, Ray Sanchez and Paul Vercammen, CNN", "title": "Kristin Smart, who disappeared in 1996, may have been raped and killed in a college dorm, prosecutor says", "description": "Kristin Smart, the California college student who vanished in 1996, was killed during a rape or attempted to rape in a dorm room, prosecutors alleged Wednesday.", "url": "https://www.cnn.com/2021/04/14/us/kristin-smart-case-district-attorney/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315152930-02-kristin-smart-search-super-tease.jpg", "publishedAt": "2021-04-14T22:10:49Z", "content": "(CNN)Kristin Smart, the California college student who vanished in 1996, was killed during a rape or attempted to rape in a dorm room, prosecutors alleged Wednesday. \r\nPaul Flores, 44, was formally c… [+4195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson and Caitlin Hu, CNN", "title": "America's top spies are coming in from the cold", "description": "America's top spies are coming in from the cold", "url": "https://www.cnn.com/2021/04/14/world/meanwhile-in-america-april-14-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190225105707-01-cia-symbol-file-super-tease.jpg", "publishedAt": "2021-04-14T21:59:27Z", "content": "This was excerpted from the April 14 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)America's top … [+4296 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "US Capitol rioter who tried to flee to Switzerland is jailed pre-trial", "description": "A geophysicist who allegedly beat police officers who were trying to help injured rioters during the US Capitol siege will be jailed before trial, a federal judge ruled Wednesday, citing the man's ham-handed attempt to flee to Switzerland as proof that he pos…", "url": "https://www.cnn.com/2021/04/14/politics/capitol-riot-switzerland-suicide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414170637-jeffrey-sabol-capitol-riot-super-tease.jpg", "publishedAt": "2021-04-14T21:57:24Z", "content": "Washington (CNN)A geophysicist who allegedly beat police officers who were trying to help injured rioters during the US Capitol siege will be jailed before trial, a federal judge ruled Wednesday, cit… [+2931 chars]"}]}