{"status": "ok", "totalResults": 152, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Dean and Manu Raju, CNN", "title": "Tensions rise in policing talks as negotiations hit a delicate phase", "description": "High-stakes talks over a major revamp of policing laws are at a precarious state, with influential law enforcement groups divided, lawmakers struggling to bridge a gap on long-standing sticking points and skepticism among many congressional Republicans about …", "url": "https://www.cnn.com/2021/06/29/politics/policing-reform-congress-negotiations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201014162909-25-barrett-hearing-1014-booker-super-tease.jpg", "publishedAt": "2021-06-29T22:00:44Z", "content": "(CNN)High-stakes talks over a major revamp of policing laws are at a precarious state, with influential law enforcement groups divided, lawmakers struggling to bridge a gap on long-standing sticking … [+8008 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jill Filipovic", "title": "GOP hypocrisy on Gwen Berry and the National Anthem", "description": "It doesn't matter whether I agree with the Olympic hopeful or not in her decision to turn away from the flag during the National Anthem, writes Jill Filipovic. What matters is that she's protected in having the full freedom to do so. That's American. Demandin…", "url": "https://www.cnn.com/2021/06/29/opinions/gwen-berry-gop-criticism-national-anthem-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628072259-01-gwendolyn-berry-olympic-trials-210626-super-tease.jpg", "publishedAt": "2021-06-29T21:37:40Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+7707 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Obama says rise of misinformation 'worries me' and should worry everyone", "description": "Former President Barack Obama said Tuesday that the rise in misinformation that led to the January 6 insurrection was apparent during his administration, but the speed and prevalence with which misinformation has increased in recent years \"worries\" him and sh…", "url": "https://www.cnn.com/2021/06/29/politics/obama-misinformation-comments-ala/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629162930-05-obama-2020-file-super-tease.jpg", "publishedAt": "2021-06-29T20:47:21Z", "content": "(CNN)Former President Barack Obama said Tuesday that the rise in misinformation that led to the January 6 insurrection was apparent during his administration, but the speed and prevalence with which … [+2988 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Fritz, Carma Hassan and Brisa Colon, CNN", "title": "Historic Northwest heat wave leads to hundreds of emergency room visits", "description": "Hundreds of people have visited emergency departments or urgent-care clinics in the Pacific Northwest since Friday as an excruciating heat wave smashed all-time temperature records in Oregon, Washington and Canada.", "url": "https://www.cnn.com/2021/06/29/weather/northwest-heat-illness-emergency-room/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629002752-01-northwest-heat-super-tease.jpg", "publishedAt": "2021-06-29T20:25:55Z", "content": "(CNN)Hundreds of people have visited emergency departments or urgent-care clinics in the Pacific Northwest since Friday as an excruciating heat wave smashed all-time temperature records in Oregon, Wa… [+5408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Kaczynski and Drew Myers, CNN", "title": "Top Oregon RNC official says he was unaware of pro-Nazi host and White national activist they discussed during YouTube chat", "description": "A top Republican Party official in Oregon appeared on a YouTube show hosted by a man with a history of racist, anti-Semitic and pro-Nazi statements, in which the official, Solomon Yue, spoke supportively of another man who espouses White nationalist rhetoric.", "url": "https://www.cnn.com/2021/06/29/politics/solomon-yue-on-white-nationalist/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628171239-02-solomon-yue-screengrab-super-tease.jpg", "publishedAt": "2021-06-29T20:13:59Z", "content": "(CNN)A top Republican Party official in Oregon appeared on a YouTube show hosted by a man with a history of racist, anti-Semitic and pro-Nazi statements, in which the official, Solomon Yue, spoke sup… [+5743 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Seamus Fagan, CNN", "title": "Serena Williams forced to retire from first-round Wimbledon match due to injury", "description": "Seven-time Wimbledon champion Serena Williams was forced to retire from her first-round match at the All England Club against Aliaksandra Sasnovich on Tuesday due to an injury suffered in the first set.", "url": "https://edition.cnn.com/2021/06/29/tennis/serena-williams-wimbledon-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629210444-serena-williams-super-tease.jpg", "publishedAt": "2021-06-29T20:11:02Z", "content": "(CNN)Seven-time Wimbledon champion Serena Williams was forced to retire from her first-round match at the All England Club against Aliaksandra Sasnovich on Tuesday due to an injury suffered in the fi… [+627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, Nicole Gaouette and Kevin Liptak, CNN", "title": "US days from completing formal Afghanistan withdrawal but 1,000 troops could remain", "description": "The US could complete its troop withdrawal from Afghanistan within days, according to multiple US officials, making this a critical week in President Joe Biden's campaign to end America's longest war even as US military officials warn the country could devolv…", "url": "https://www.cnn.com/2021/06/29/politics/afghanistan-accelerated-us-troop-pullout/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413121156-01-us-troops-afghanistan-file-super-tease.jpg", "publishedAt": "2021-06-29T20:04:55Z", "content": "(CNN)The US could complete its troop withdrawal from Afghanistan within days, according to multiple US officials, making this a critical week in President Joe Biden's campaign to end America's longes… [+6794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'America: The Motion Picture' works way too hard at being outrageous", "description": "Being outrageous can be harder than it looks, and \"America: The Motion Picture\" -- an animated Netflix satire with a star-studded vocal cast -- works way, way too hard at it. The result is a movie that's loud and annoying more than truly provocative, peppered…", "url": "https://www.cnn.com/2021/06/29/entertainment/america-the-motion-picture-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629071547-america-the-motion-picture-washington-and-lincoln-super-tease.jpg", "publishedAt": "2021-06-29T19:50:15Z", "content": "(CNN)Being outrageous can be harder than it looks, and \"America: The Motion Picture\" -- an animated Netflix satire with a star-studded vocal cast -- works way, way too hard at it. The result is a mov… [+2615 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kari Nixon", "title": "Opinion: My community is sizzling to a crisp", "description": "Kari Nixon, a Texas native living in Spokane, Washington, describes the measures she's taking for herself, her family, her animals and her community in the face of punishing temperatures -- a heat so intense, she says, it feels like poison.", "url": "https://www.cnn.com/2021/06/29/opinions/heat-dome-pacific-northwest-nixon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629002753-02-northwest-heat-super-tease.jpg", "publishedAt": "2021-06-29T18:39:46Z", "content": "Kari Nixon is an assistant professor of English at Whitworth University and the author of the book \"Quarantine Life from Cholera to COVID-19: What Pandemics Teach us About Parenting, Work, Life, and … [+6392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Josh Mackin", "title": "Outfit your home with Courant's interior-inspired wireless chargers", "description": "Courant is a company charting a more perfect path forward for our collective charging solutions. With Courant, Qi-compatible wireless charging meets high-end leather and Italian craftsmanship that only looks better with age.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/courant-wireless-chargers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629142736-courant-lead-image-super-169.jpg", "publishedAt": "2021-06-29T18:34:39Z", "content": "Life today is all about devices laptops, tablets, e-readers, smartwatches, smartphones and more that make the modern world go around. And while weve seen advancements with screen tech and speeds, you… [+3081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "'Zola' stars and director on making one of the summer's wildest films", "description": "When A'Ziah \"Zola\" King posted 148 tweets about an epic trip she said she took to Florida with a fellow exotic dancer, that dancer's boyfriend and a pimp back in 2015, who knew that it would turn into a must see summer film?", "url": "https://www.cnn.com/2021/06/29/entertainment/zola-stars-director/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629045416-01-zola-janicza-bravo-culture-queue-super-tease.jpg", "publishedAt": "2021-06-29T18:22:08Z", "content": "(CNN)When A'Ziah \"Zola\" King posted 148 tweets about an epic trip she said she took to Florida with a fellow exotic dancer, that dancer's boyfriend and a pimp back in 2015, who knew that it would tur… [+2416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Park", "title": "Like a bike helmet for your home, Lemonade will be there when you really need it", "description": "Like a bike helmet, renters insurance is one of those things that you don't think you actually need until you really need it — and that you don't realize you really needed until it's too late. Lemonade gets you insurance at an affordable price.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/lemonade-renters-insurance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629135450-lemonade-lead-image-super-169.jpg", "publishedAt": "2021-06-29T18:12:03Z", "content": "Like a bike helmet, renters insurance is one of those things that you dont think you actually need until you really need it and that you dont realize you really needed until its too late.\r\nAnd just l… [+3989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Haiti delays constitutional referendum to September", "description": "Haiti will hold a constitutional referendum on Sept. 26, the same date as presidential and legislative elections, authorities said, after postponing the date twice in part because of the pandemic, an official calendar showed Monday.", "url": "https://www.cnn.com/2021/06/29/americas/haiti-constitutional-referendum-delay-september-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629124442-haiti-referendum-delay-super-tease.jpg", "publishedAt": "2021-06-29T18:03:22Z", "content": "Port-au-Prince (CNN)Haiti will hold a constitutional referendum on Sept. 26, the same date as presidential and legislative elections, authorities said, after postponing the date twice in part because… [+1317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Fortuna Smukler", "title": "My friends are unaccounted for in the Surfside building collapse, but I'm holding on to hope", "description": "Fortuna Smukler shares a bit about her friendship with Arnie and Myriam Notkin, who are unaccounted for in the Surfside building collapse.", "url": "https://www.cnn.com/2021/06/29/opinions/myriam-arnie-notkin-unaccounted-surfside-building-collapse-smukler/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628224356-01-miami-dade-building-collapse-tuesday-super-tease.jpg", "publishedAt": "2021-06-29T18:00:16Z", "content": "Fortuna Smukler is a North Miami Beach Commissioner. The opinions expressed in this commentary are her own. The views expressed in this commentary are her own. View more opinion on CNN.\r\n (CNN)My hus… [+4168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Elon Musk touts SpaceX surging internet growth, but still says goal is to avoid bankruptcy", "description": "SpaceX has put more than 1,500 internet-beaming satellites into orbit, signed up more than 69,000 customers, installed ground stations in 12 countries and has plans to expand its one-of-a-kind network's coverage all over the world — except the North and South…", "url": "https://www.cnn.com/2021/06/29/tech/elon-musk-spacex-starlink-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629120143-01-elon-musk-keynote-speech-mobile-world-congress-0629-super-tease.jpg", "publishedAt": "2021-06-29T17:55:55Z", "content": "New York (CNN Business)SpaceX has put more than 1,500 internet-beaming satellites into orbit, signed up more than 69,000 customers, installed ground stations in 12 countries and has plans to expand i… [+3436 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "England stuns Germany with two late goals to book place in Euro 2020 quarterfinals", "description": "England gave Germany a lesson in ruthless finishing, converting its only two real chances of the match to finally end its decades-long inferiority complex against its old, historic rival.", "url": "https://edition.cnn.com/2021/06/29/football/england-germany-wembley-euro-2020-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629184313-raheem-sterling-super-tease.jpg", "publishedAt": "2021-06-29T17:51:53Z", "content": "Wembley Stadium, London (CNN)England gave Germany a lesson in ruthless finishing, converting its only two real chances of the match to finally end its decades-long inferiority complex against its old… [+276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maria Cassano", "title": "As the world opens back up, Shutterfly helps you showcase your favorite moments", "description": "Shutterfly makes it easy to celebrate any special occassion and has become a no-brainer go-to for holiday gifts, wedding gifts, announcements and creative holiday cards.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/shutterfly-personalized-decor-wall-art-photos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629131337-shutterfly-lead-image-super-169.jpg", "publishedAt": "2021-06-29T17:27:13Z", "content": "Take out your phone and navigate to your photos app. How many pictures do you have saved there? What are they pictures of? If you, like most people, use your phone to capture things you love, theyre … [+2800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Geneva Sands, CNN", "title": "More than 1 million migrants arrested at the US-Mexico border since October", "description": "More than 1 million migrants have been arrested after illegally crossing the US-Mexico border since last October, according to two US Department of Homeland Security officials, surpassing the 2019 border crisis tally with three months still left in the fiscal…", "url": "https://www.cnn.com/2021/06/29/politics/immigration-migrants-us-mexico-border/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210503125649-02-migrants-us-mexico-border-super-tease.jpg", "publishedAt": "2021-06-29T17:14:48Z", "content": "(CNN)More than 1 million migrants have been arrested after illegally crossing the US-Mexico border since last October, according to two US Department of Homeland Security officials, surpassing the 20… [+1517 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "No, there is no fourth stimulus check on the way", "description": "The federal government has sent out three rounds of stimulus checks to help people during the pandemic, but despite their political popularity, there's no proposal on the table to deliver a fourth round.", "url": "https://www.cnn.com/2021/06/29/politics/stimulus-check-no-fourth-round/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210113173026-us-stimulus-check---stock-super-tease.jpg", "publishedAt": "2021-06-29T17:13:48Z", "content": "Washington (CNN)The federal government has sent out three rounds of stimulus checks to help people during the pandemic, but despite their political popularity, there's no proposal on the table to del… [+3866 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Special Affordable Care Act subsidies available for unemployed Americans starting July 1", "description": "Unemployed Americans will be able to sign up for hefty subsidies for 2021 coverage on the federal Affordable Care Act exchange starting July 1, the Biden administration announced Tuesday.", "url": "https://www.cnn.com/2021/06/29/politics/biden-obamacare-unemployed-assistance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517095712-20210517-healthcare-illustration-2-super-tease.jpg", "publishedAt": "2021-06-29T17:00:46Z", "content": "(CNN)Unemployed Americans will be able to sign up for hefty subsidies for 2021 coverage on the federal Affordable Care Act exchange starting July 1, the Biden administration announced Tuesday.\r\nThe b… [+4625 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "NASA's moon-bound mannequin astronaut named after hero of troubled Apollo 13 mission", "description": "After a weeks-long challenge, the people have chosen the name of the mannequin expected to take off on NASA's uncrewed Artemis I moon mission slated to launch this November.", "url": "https://www.cnn.com/2021/06/29/us/nasa-artemis-moonikin-arturo-campos-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210616111335-01-nasa-name-moonikin-challenge-super-tease.jpg", "publishedAt": "2021-06-29T16:57:58Z", "content": "(CNN)After a weeks-long challenge to name NASA's moon-bound mannequin (or \"Moonikin\" as NASA has dubbed it), the people have chosen: Campos is expected to take off on the uncrewed Artemis I moon miss… [+3613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By James Briggs and Zamira Rahim, CNN", "title": "Car given to Princess Diana from Prince Charles sells for $72,000", "description": "A car given to Princess Diana by Prince Charles as an engagement present has sold for more than £52,000 ($72,000) at auction.", "url": "https://www.cnn.com/style/article/princess-diana-car-auction-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629121817-01-princess-diana-ford-escort-super-tease.jpg", "publishedAt": "2021-06-29T16:57:45Z", "content": "luxury\r\nA car given to Princess Diana by Prince Charles as an engagement present has sold for more than £52,000 ($72,000) at auction.\r\nThe 1981 Ford Escort Ghia sold for about $30,000 more than the l… [+1489 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Busari and Nimi Princewill, CNN", "title": "Nigerian separatist leader brought back to Nigeria to face trial", "description": "Nigerian separatist leader, Nnamdi Kanu, was located and brought back to Nigeria to face trial for terrorism, Nigeria's Minister of Justice, Abubakar Malami, said in a press conference Tuesday.", "url": "https://www.cnn.com/2021/06/29/africa/nnamdi-kanu-arrested-nigeria-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629122435-nigerian-separatist-kanu-rearrested-intl-super-tease.jpg", "publishedAt": "2021-06-29T16:48:25Z", "content": "Lagos, Nigeria (CNN)Nigerian separatist leader, Nnamdi Kanu, was located and brought back to Nigeria to face trial for terrorism, Nigeria's Minister of Justice, Abubakar Malami, said in a press confe… [+1309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kristin Magaldi", "title": "Away's latest launch is perfect for on-the-go makeup lovers", "description": "Today, Away is adding to its collection with the release of its next must-have: The Cosmetics Bag, which is designed to keep all makeup and skin care items safe and secure wherever you go.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/away-cosmetics-bag-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629110237-awaycosmeticslead-super-169.jpg", "publishedAt": "2021-06-29T16:31:39Z", "content": "Travel accessory brand Away has no shortage of sleek, stylish and well-made luggage, bags and carry-ons to choose from. The brand even has the market cornered on gear to help you pack efficiently, wi… [+1182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tina Burnside, CNN", "title": "A 9-year-old girl was killed and 2 boys wounded in back-to-back shootings in North Carolina. Police are now hunting for the shooters", "description": "A search for shooters is underway in North Carolina after a 9-year-old girl was killed and two boys wounded Monday evening in two drive-by shootings that unfolded minutes and blocks apart, the Statesville Police Department said.", "url": "https://www.cnn.com/2021/06/29/us/statesville-nc-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2021-06-29T16:22:28Z", "content": "(CNN)A search for shooters is underway in North Carolina after a 9-year-old girl was killed and two boys wounded Monday evening in two drive-by shootings that unfolded minutes and blocks apart, the S… [+1276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh, Bethlehem Feleke and Vasco Cotovio, CNN", "title": "Rebels in Tigray reject calls for ceasefire after Ethiopian government forces withdraw from regional capital", "description": "Rebel forces in the war-torn Ethiopian region of Tigray have rejected a ceasefire offer from the central government, raising fears of further violence a day after the fighters retook the regional capital Mekelle.", "url": "https://www.cnn.com/2021/06/29/africa/tigray-ethiopia-ceasefire-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629080758-02-ethiopian-army-mekelle-0508-file-super-tease.jpg", "publishedAt": "2021-06-29T16:16:59Z", "content": "(CNN)Rebel forces in the war-torn Ethiopian region of Tigray have rejected a ceasefire offer from the central government, raising fears of further violence a day after the fighters retook the regiona… [+6942 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jason Cipriani and Jacob Krol, CNN", "title": "Amazon's new Fire HD 10 is one of the best budget tablets you can buy", "description": "As we've written in the past, Amazon's Fire and Fire HD tablets aren't the sleekest, fastest or the coolest on the market, but what they lack in flare they exude in value. That's where the four — yes, count 'em four — new Fire HD 10 models come in. After week…", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/amazon-fire-hd-10-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629114214-1-amazon-fire-hd-10-review-super-169.jpg", "publishedAt": "2021-06-29T16:06:09Z", "content": "As weve written in the past, Amazons Fire and Fire HD tablets arent the sleekest, fastest or the coolest on the market, but what they lack in flare they exude in value. Thats where the four yes, coun… [+12509 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy, CNN", "title": "Official who created vaccination VIP list cleared of criminal wrongdoing", "description": "A Manatee County Sheriff's Office investigation has found that its county commissioner's actions did not rise to the \"level of a crime\" when she created a VIP list for Covid-19 vaccines, and limited a drive to two affluent ZIP codes in her district earlier in…", "url": "https://www.cnn.com/2021/06/29/us/manatee-county-florida-covid-vip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210218174531-02-chairman-vanessa-baugh-screengrab-super-tease.jpg", "publishedAt": "2021-06-29T15:53:04Z", "content": "(CNN)A Manatee County Sheriff's Office investigation has found that its county commissioner's actions did not rise to the \"level of a crime\" when she created a VIP list for Covid-19 vaccines, and lim… [+4936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Jill Biden in discussions to attend Olympics Opening Ceremony in Tokyo", "description": "The East Wing has been in discussions about first lady Jill Biden attending the Opening Ceremony for the Olympics in Tokyo next month, a White House official tells CNN.", "url": "https://www.cnn.com/2021/06/29/politics/jill-biden-tokyo-olympics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428181646-03-jill-biden-first-100-days-super-tease.jpg", "publishedAt": "2021-06-29T15:51:12Z", "content": "(CNN)The East Wing has been in discussions about first lady Jill Biden attending the Opening Ceremony for the Olympics in Tokyo next month, a White House official tells CNN. \r\nAsked by a reporter on … [+875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Fragonard painting 'forgotten' by its owners sells for $9 million", "description": "A \"forgotten\" painting kept in the same family for generations has sold for 7.68 million euros ($9.1 million) at auction after experts discovered it was the work of French painter Jean-Honoré Fragonard.", "url": "https://www.cnn.com/style/article/fragonard-philosopher-reading-auction-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629064224-01-philosopher-reading-painting-auction-032521-super-tease.jpg", "publishedAt": "2021-06-29T15:43:06Z", "content": "arts\r\nA \"forgotten\" painting kept in the same family for generations has sold for 7.68 million euros ($9.1 million) at auction after experts discovered it was the work of French painter Jean-Honoré F… [+2956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hanna Ziady, CNN Business", "title": "Highly educated Black and Asian Brits are disadvantaged at work", "description": "The children of immigrants from minority ethnic groups in the United Kingdom are better educated than their White British peers but less likely to be employed, according to new research published Tuesday.", "url": "https://www.cnn.com/2021/06/29/business/uk-ethnic-minorities-employment-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629101232-uk-commuters-file-restricted-super-tease.jpg", "publishedAt": "2021-06-29T15:37:20Z", "content": "London (CNN Business)The children of immigrants from minority ethnic groups in the United Kingdom are better educated than their White British peers but less likely to be employed, according to new r… [+4352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Holly Johnson", "title": "How to get a credit card with no credit", "description": "Building credit can seem impossible if you're just getting started, and that's especially true if you've never had a credit card. Fortunately, there are some unique credit card products geared toward consumers with a limited credit history, or even no credit …", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/credit-cards-for-people-with-no-credit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629010045-underscored-confused-concerned-woman-looking-at-laptop-super-169.jpg", "publishedAt": "2021-06-29T15:36:33Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+10004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Michael Andronico", "title": "Best Windows laptop of 2021: Get the right PC for you", "description": "After testing some of the most popular Windows laptops on the market, we've picked out the best one for work, play and everything in between.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/best-windows-laptop/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629105710-best-windows-laptop-dell-xps-13-rear-2-super-169.jpg", "publishedAt": "2021-06-29T15:01:33Z", "content": "From highly portable ultrabooks to heavy duty workstations, Windows laptops offer a bevy of choices to pick from. Thats why were here to help you find one thats worth buying. \r\nAfter testing some of … [+12214 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone and Kristin Magaldi, CNN", "title": "The best sales to shop today: Bio Bidet, Aerogarden, Apple and more", "description": "Today, you'll find a deal on our pick for best external hard drive, a discounted Bio Bidet toilet seat and savings on Marmot outdoor gear. All that and more below.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629101110-0629dealslead-super-169.jpg", "publishedAt": "2021-06-29T14:40:52Z", "content": "Today, youll find a deal on our pick for best external hard drive, a discounted Bio Bidet toilet seat and savings on Marmot outdoor gear. All that and more below.\r\nNows your chance to score the new M… [+10520 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden takes pitch for bipartisan infrastructure plan to Wisconsin after shaky start", "description": "President Joe Biden will argue the bipartisan infrastructure proposal would benefit working and middle-class families around the country when he travels to Wisconsin on Tuesday, according to a White House official.", "url": "https://www.cnn.com/2021/06/29/politics/biden-wisconsin-infrastructure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625150650-01-biden-pride-month-remarks-0625-super-tease.jpg", "publishedAt": "2021-06-29T14:10:32Z", "content": "(CNN)President Joe Biden will argue the bipartisan infrastructure proposal would benefit working and middle-class families around the country when he travels to Wisconsin on Tuesday, according to a W… [+3364 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Mouse thought extinct for 150 years found living on island", "description": "A mouse thought to have become extinct more than 150 years ago has been found alive on an island off the coast of Western Australia, researchers have discovered.", "url": "https://www.cnn.com/2021/06/29/australia/australia-gould-mouse-intl-scli-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629071715-gould-mouse-intl-scli-super-tease.jpg", "publishedAt": "2021-06-29T14:02:22Z", "content": "(CNN)A mouse thought to have become extinct more than 150 years ago has been found alive on an island off the coast of Western Australia, researchers have discovered.\r\nScientists compared DNA samples… [+3147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards", "title": "Nail art ideas for a gorgeous Fourth of July manicure", "description": "The Fourth of July is right around the corner, so get ready for a cookout with a festive manicure.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/4th-of-july-nails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200619101043-4nailslead-super-169.jpg", "publishedAt": "2021-06-29T13:55:29Z", "content": "At long last, summer is finally here. The temperature is rising and everyones heading outside to celebrate the warm weather, and of course the Fourth of July. Get ready for a cookout with a festive m… [+4978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\" target=\"_blank\">Melissa Mahtani,</a> Melissa Macaya, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a> and Mike Hayes CNN", "title": "The latest on the Covid-19 pandemic and the Delta variant", "description": "Experts now say that dangerous Delta variant could cause a full-on resurgence of coronavirus in the US in the coming months. Follow here for the latest updates on vaccines, variants and the global pandemic news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-06-25-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-06-29T13:46:51Z", "content": "Most Americans 84% have heard of the Delta coronavirus variant, but the number of people practicing safety measures such as social distancing and masking continues to decrease, according to new poll … [+2421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Noelle Ike", "title": "22 red, white and blue outfits you'll want to wear long after the 4th of July", "description": "We've rounded up Fourth of July-appropriate pieces for both women and men. From the perfect sundress to a stylish button-down, these holiday-appropriate pieces avoid cheesy, and are more than likely to become your next summer staple.", "url": "https://www.cnn.com/2021/06/29/cnn-underscored/4th-of-july-outfits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628114400-fourthofjulyoutfitslead-super-169.jpg", "publishedAt": "2021-06-29T13:31:27Z", "content": "Often regarded as the official kickoff to summer, the Fourth of July (and the long weekend that accompanies it) is a holiday full of enjoying the weather, eating great food and getting together with … [+9446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mark Zandi for CNN Business Perspectives", "title": "The hot housing market is heading for a cooling off period", "description": "Home prices have risen so far, so fast, that they have become overvalued.", "url": "https://www.cnn.com/2021/06/29/perspectives/housing-market-pandemic-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628121040-us-housing-market-restricted-super-tease.jpg", "publishedAt": "2021-06-29T13:14:40Z", "content": "Mark Zandi is chief economist of Moody's Analytics. The opinions expressed in this commentary are his own. \r\nWho would have thought that when the pandemic struck last spring that single-family housin… [+4956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Why these parents volunteered their young children for Covid-19 vaccine trials", "description": "As troubling new variants emerge, doctors say America's chances of winding down the Covid-19 pandemic in the US will largely depend on how many young adults and children get vaccinated.", "url": "https://www.cnn.com/2021/06/29/health/covid-vaccine-trials-babies-children/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623185232-03-bui-child-vaccine-trial-super-tease.jpg", "publishedAt": "2021-06-29T13:13:01Z", "content": "By Holly Yan, CNN\r\nUpdated 9:13 AM ET, Tue June 29, 2021\r\n (CNN)As troubling new variants emerge, doctors say America's chances of winding down the Covid-19 pandemic in the US will largely depend on … [+12496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher and Veronica Stracqualursi, CNN", "title": "Maricopa County will not reuse equipment turned over for partisan 2020 audit", "description": "Maricopa County, Arizona, announced Monday that it will not reuse any of the voting equipment that was in the hands of the contractors hired by the Republican-controlled state Senate to conduct its so-called audit of the 2020 presidential election results.", "url": "https://www.cnn.com/2021/06/29/politics/maricopa-county-equipment-audit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629081431-maricopa-county-audit-0615-super-tease.jpg", "publishedAt": "2021-06-29T13:11:13Z", "content": "(CNN)Maricopa County, Arizona, announced Monday that it will not reuse any of the voting equipment that was in the hands of the contractors hired by the Republican-controlled state Senate to conduct … [+3786 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, CNN", "title": "Progressive group launches $7 million effort to elect Democratic secretaries of state and attorneys general", "description": "The investment in down-ballot contests comes as election chiefs face growing attacks on their authority to oversee elections.", "url": "https://www.cnn.com/2021/06/29/politics/democrats-2022-ag-sos-end-citizens-united-let-america-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628213507-democratic-secretaries-of-state-attorneys-general-super-tease.jpg", "publishedAt": "2021-06-29T13:02:13Z", "content": "(CNN)A left-leaning group plans to spend $7 million to help elect Democratic secretaries of state and attorneys general in key battlegrounds -- a big investment in down-ballot races that loom large i… [+3732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zamira Rahim, CNN", "title": "Christina Aguilera declares support for Britney Spears: 'It is unacceptable'", "description": "Christina Aguilera and Britney Spears were young co-stars who became icons of the 1990s music scene, where they were often portrayed as rivals.", "url": "https://www.cnn.com/2021/06/29/entertainment/christina-aguilera-britney-spears-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629044754-christina-aguilera-britney-spears-vma-2000-restricted-super-tease.jpg", "publishedAt": "2021-06-29T12:11:16Z", "content": "These past few days I've been thinking about Britney and everything she is going through. \r\nIt is unacceptable that any woman, or human, wanting to be in control of their own destiny might not be all… [+102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alexandra Meeks and Hollie Silverman, CNN", "title": "A man faces federal charge for attempting to breach a cockpit before jumping out of taxiing airplane at LAX", "description": "A man is facing a federal charge of interfering with a flight crew after attempting to breach a cockpit and jumping out of a departing airplane at the Los Angeles International Airport on Friday, officials said.", "url": "https://www.cnn.com/travel/article/federal-charge-lax-airplane/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629015909-federal-charges-lax-airplane-super-tease.jpg", "publishedAt": "2021-06-29T11:56:46Z", "content": "Luis Antonio Victoria Dominguez, a 33-year-old Mexican national of La Paz, Mexico, is facing the charge after the incident which happened Friday on a SkyWest airlines flight that was scheduled to fly… [+2343 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawn Nottingham, CNN", "title": "Letter sent months before deadly Florida collapse warned damage to condo building was accelerating", "description": "A correspondence from the board president of Champlain Towers South, which unexpectedly crashed to the ground last week in Surfside, Florida, describes the progression of decay at the building since 2018 saying, \"the observable damage such as in the garage ha…", "url": "https://www.cnn.com/2021/06/29/us/florida-building-collapse-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629075809-05-surfside-building-collapse-0628-super-tease.jpg", "publishedAt": "2021-06-29T11:53:17Z", "content": "(CNN)A correspondence from the board president of Champlain Towers South, which unexpectedly crashed to the ground last week in Surfside, Florida, describes the progression of decay at the building s… [+1990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "At least 4 Catholic churches were destroyed on Indigenous land in a week", "description": "Canadian authorities are investigating multiple fires that destroyed four Catholic churches on Indigenous land in the past week.", "url": "https://www.cnn.com/2021/06/29/americas/canada-church-fires-indigenous-land/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628154534-sacred-heart-church-ca-0621-super-tease.jpg", "publishedAt": "2021-06-29T11:53:11Z", "content": "(CNN)Canadian authorities are investigating multiple fires that destroyed four Catholic churches on Indigenous land in the past week. \r\nThey are the latest in a string of recent events affecting the … [+5821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Where do coronavirus variants come from?", "description": "Coronavirus variants cannot arise without infected people. The more people there are with infections, and the longer they are infected, the more likely the virus is to evolve into multiple strains.", "url": "https://www.cnn.com/2021/06/29/health/how-coronavirus-variants-evolve/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625202427-how-coronavirus-variants-evolve-restricted-super-tease.jpg", "publishedAt": "2021-06-29T11:41:55Z", "content": "(CNN)The 30-something woman wasn't sick for very long.\r\nAdmitted to the hospital with Covid-19, she needed a little oxygen and was given steroids, but was well enough to go home after nine days.\r\nBut… [+7144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Messi scores two and assists once while becoming Argentina's most capped player", "description": "With his inauspicious Argentina debut nothing but a distant memory, Lionel Messi became his country's most capped player on Monday in their 4-1 Copa América victory over Bolivia.", "url": "https://edition.cnn.com/2021/06/29/football/messi-mascherano-argentina-most-capped-player-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629044005-01-lionel-messi-argentina-bolivia-copa-0628-super-tease.jpg", "publishedAt": "2021-06-29T11:16:26Z", "content": "(Reuters)With his inauspicious Argentina debut nothing but a distant memory, Lionel Messi became his country's most capped player on Monday in their 4-1 Copa América victory over Bolivia.\r\nA perennia… [+676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Mindfulness matters: 5 ways to get started with mindfulness", "description": "Mindfulness practices are about directing your attention to the present moment. Adding some to your routine can reduce stress, increase focus and improve sleep, among other health benefits.", "url": "https://www.cnn.com/2021/06/29/health/mindfulness-5-ways-get-started-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624110534-mindfulness-meditation-stock-super-tease.jpg", "publishedAt": "2021-06-29T10:40:37Z", "content": "(CNN)Noticing the here and now sounds simple, right? That's the core of mindfulness practices, which invite participants to direct their attention to the present. \r\n\"I define it as paying attention t… [+7944 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Greek police recover Picasso and Mondrian paintings stolen in museum heist", "description": "Missing artworks by Pablo Picasso and Piet Mondrian have been recovered by police almost a decade after they were taken from the National Art Gallery in Athens.", "url": "https://www.cnn.com/style/article/picasso-mondrian-athens-police-recovery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629060951-picasso-athens-art-heist-crop-super-tease.jpeg", "publishedAt": "2021-06-29T10:31:37Z", "content": "arts\r\nMissing artworks by Pablo Picasso and Piet Mondrian have been recovered by Greek police almost a decade after they were stolen in a daring museum heist.\r\nThe two paintings, which had been taken… [+2004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for June 29: Condo collapse, coronavirus, SCOTUS, Myanmar, heat wave", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/06/29/us/five-things-june-29-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628235100-01-surfside-collapse-0628-super-tease.jpg", "publishedAt": "2021-06-29T10:23:32Z", "content": "(CNN)An NCAA panel voted to support an interim policy letting college athletes profit from their name, image and likeness until federal legislation -- supported by a recent SCOTUS decision -- or new … [+5408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, Adrienne Vogt, Melissa Macaya, Mike Hayes and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on the partial building collapse near Miami", "description": "Search and rescue efforts continue after a building in Surfside, Florida, partially collapsed. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/miami-florida-building-collapse-06-29-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628020145-01-surfside-building-collapse-0628-super-tease.jpg", "publishedAt": "2021-06-29T10:14:33Z", "content": "Dozens of people remain unaccounted after the collapse of part of a 12-story residential building in Surfside, Florida, authorities have said. \r\nSearch and rescue teams have been feverishly scouring … [+1663 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Millions of jobs and a shortage of applicants. Welcome to the new economy", "description": "There's a problem at James Hook's chicken farms, and it has nothing to do with poultry.", "url": "https://www.cnn.com/2021/06/29/economy/global-worker-shortage-pandemic-brexit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628175107-restricted-singapore-labor-construction-migrant-workers-0529-super-tease.jpg", "publishedAt": "2021-06-29T09:43:29Z", "content": "By Julia Horowitz, CNN Business\r\nUpdated 5:43 AM ET, Tue June 29, 2021\r\nThere's a problem at James Hook's chicken farms, and it has nothing to do with poultry.\r\nP.D. Hook, a hatchery that supplies on… [+13219 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joan Biskupic, CNN legal analyst & Supreme Court biographer", "title": "Breyer watch intensifies as Supreme Court term nears its close", "description": "Justice Stephen Breyer has taken a commanding role in the final days of the Supreme Court session, writing decisions preserving Obamacare and bolstering student free speech and, when conservatives ruled against union organizing on agricultural land, forcefull…", "url": "https://www.cnn.com/2021/06/29/politics/breyer-retirement-plans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628165505-stephen-breyer-2018-super-tease.jpg", "publishedAt": "2021-06-29T09:11:49Z", "content": "(CNN)Justice Stephen Breyer has taken a commanding role in the final days of the Supreme Court session, writing decisions preserving Obamacare and bolstering student free speech and, when conservativ… [+7260 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "House votes to remove Confederate statues and replace Roger B. Taney bust", "description": "The House will vote Tuesday on a resolution to expel Confederate statues and replace the Capitol's bust of Roger B. Taney, the chief justice who wrote the Dred Scott decision, with one honoring Thurgood Marshall, the first African American Supreme Court Justi…", "url": "https://www.cnn.com/2021/06/29/politics/house-vote-confederate-statues/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628164252-roger-b-taney-bust-super-tease.jpg", "publishedAt": "2021-06-29T09:11:02Z", "content": "(CNN)The House will vote Tuesday on a resolution to expel Confederate statues and replace the Capitol's bust of Roger B. Taney, the chief justice who wrote the Dred Scott decision, with one honoring … [+2367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Pavlo Fedykovych, CNN", "title": "11 remote mountain huts to escape from it all", "description": "From the Canadian Rockies to the Austrian Alps, these isolated adventure refuges offer some of the planet's most panoramic places to spend the night.", "url": "https://www.cnn.com/travel/article/remote-mountain-huts-escape/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622161809-desolation-peak-super-tease.jpg", "publishedAt": "2021-06-29T09:02:25Z", "content": "(CNN) Occupying a special place in adventure lore, mountain huts have been offering a roof over travelers' heads since the dawn of exploration. \r\nIf you can reach them, they provide a thrilling and w… [+6472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "The pageant queen and the bloodied flag, how a Nigerian model used a Russian catwalk to protest police brutality", "description": "As Victoria Chiamaka Udeh strutted confidently down the runway during a beauty pageant in Russia, brandishing her country's red-stained flag, she thought only of one thing -- the young people who lost their lives during the #EndSars protests in Nigeria last y…", "url": "https://www.cnn.com/2021/06/29/africa/nigerian-model-russia-pageant-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628113212-01-nigerian-model-russia-pageant-intl-super-tease.jpg", "publishedAt": "2021-06-29T09:01:30Z", "content": "Abuja, Nigeria (CNN)As Victoria Chiamaka Udeh strutted confidently down the runway during a beauty pageant in Russia, brandishing her country's red-stained flag, she thought only of one thing -- the … [+4512 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ananda Pellerin, CNN", "title": "Highlights from the Paris Fashion Week menswear shows", "description": "Standout moments from the Spring-Summer 2022 menswear shows at Paris Fashion Week.", "url": "https://www.cnn.com/style/article/paris-fashion-week-menswear-highlights-spring-summer-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629033722-21b-pfw-menswear-ss22-highlights-super-tease.jpeg", "publishedAt": "2021-06-29T08:52:29Z", "content": "This story was produced as part of CNN Style's partnership with Paris Fashion Week. See more coverage from the events throughout the year here.\r\nDressed in a Hawaiian-style Valentino shirt, \"Schitt's… [+7745 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Myanmar's military has tightened its grip on the jade industry, report says", "description": "Myanmar's military has such strong control over the country's jade trade that it would be \"nearly impossible\" to buy the gemstone without enriching the generals and their allies, a new report said Tuesday.", "url": "https://www.cnn.com/2021/06/29/asia/myanmar-jade-military-report-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210626141947-03-myanmar-jade-trade-file-2016-super-tease.jpg", "publishedAt": "2021-06-29T08:33:03Z", "content": "Hong Kong (CNN)Myanmar's military has such strong control over the country's jade trade that it would be \"nearly impossible\" to buy the gemstone without enriching the generals and their allies, a new… [+9099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Delta variant is forcing officials to rethink Covid-19 measures, even for the vaccinated", "description": "The more dangerous and more transmissible Delta variant has spread to nearly every state in the US, feeding health experts' concern over potential Covid-19 spikes in the fall.", "url": "https://www.cnn.com/2021/06/29/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629010318-us-coronavirus-tuesday-0629-restricted-super-tease.jpg", "publishedAt": "2021-06-29T07:28:41Z", "content": "(CNN)The more dangerous and more transmissible Delta variant has spread to nearly every state in the US, feeding health experts' concern over potential Covid-19 spikes in the fall. \r\nThe variant was … [+5448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus and Shawn Deng, CNN", "title": "J Hotel Shanghai Tower: World's highest hotel opens in China", "description": "The J Hotel Shanghai Tower opened on June 19 in China's tallest building.", "url": "https://www.cnn.com/travel/article/j-hotel-shanghai-tower-china-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628225638-j-hotel-shanghai-tower-china-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-29T07:18:38Z", "content": "(CNN) Shanghai's already-hot hotel scene just keeps getting hotter.\r\nThe J Hotel Shanghai Tower, which opened on June 19, isn't just another high-end property. \r\nIt claims to be the highest hotel in … [+2418 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hollie Silverman, Deanna Hackney and Jamiel Lynch, CNN", "title": "Rescuers search through debris for the sixth day as families wait for answers about their loved ones and what caused the collapse", "description": "As rescuers begin their sixth day searching through the debris of a deadly Florida condo collapse, families of the missing are desperately seeking information about their loved ones and investigators are on the scene trying to figure out the cause.", "url": "https://www.cnn.com/2021/06/29/us/miami-dade-building-collapse-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628235100-01-surfside-collapse-0628-super-tease.jpg", "publishedAt": "2021-06-29T07:14:44Z", "content": "(CNN)As rescuers begin their sixth day searching through the debris of a deadly Florida condo collapse, families of the missing are desperately seeking information about their loved ones and investig… [+7617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Same county tops healthiest US community ranking for the second year in a row", "description": "Located roughly 40 miles from Sante Fe, New Mexico, Los Alamos County has been deemed the healthiest US community by U.S. News & World Report's 2021 Healthiest Communities rankings report.", "url": "https://www.cnn.com/2021/06/29/us/2021-healthiest-community-in-america-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628162350-01-los-alamos-county-new-mexico-super-tease.jpg", "publishedAt": "2021-06-29T06:44:50Z", "content": "(CNN)As the country reopens in an ongoing pandemic, Los Alamos County, New Mexico, has been ranked the healthiest US community for the second year in a row. \r\nLocated roughly 40 miles from Sante Fe, … [+6325 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "Kim Kardashian's label will supply Team USA with undergaments and loungewear", "description": "Kim Kardashian West's shapewear brand Skims will supply Team USA with undergarments, loungewear and pajamas for the Tokyo Olympics and Paralympics, the star announced Monday.", "url": "https://www.cnn.com/style/article/kim-kardashian-skims-olympics-team-usa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628215247-01-kim-kardashian-olympics-team-usa-skims-underwear-super-tease.jpg", "publishedAt": "2021-06-29T04:52:18Z", "content": "Kim Kardashian West's shapewear brand Skims will supply Team USA with undergarments, loungewear and pajamas for the Tokyo Olympics and Paralympics, the star announced Monday.\r\nThe womenswear collecti… [+2492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "What two US Democratic senators can learn from the Lincoln Republicans on voting rights", "description": "By the standards Democratic Sens. Joe Manchin and Kyrsten Sinema have set for federal action on voting rights, the 14th and 15th amendments to the Constitution -- two pillars of the post-Civil War effort to ensure equality for all Americans -- would never hav…", "url": "https://www.cnn.com/2021/06/29/politics/voting-rights-congress-filibuster/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210126110810-01-abraham-lincoln-super-tease.jpg", "publishedAt": "2021-06-29T04:09:22Z", "content": "If you are someone who thinks that the reforms of the 1860s and 1960s are good things, it's easy to look back at them as if they were templates and say, 'All good people today agree those are good th… [+192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Desperate expatriate workers storm Islamabad vaccination center", "description": "Pakistani expatriate workers, desperate to obtain a Pfizer/BioNTech, (22UAy.DE) or AstraZeneca Covid shot so they can travel to work in Saudi Arabia, stormed a vaccination center in Islamabad on Monday, witnesses said.", "url": "https://www.cnn.com/2021/06/28/asia/pakistan-expatriates-vaccination-center-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628221436-02-pakistan-expatriates-vaccination-center-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-29T03:31:11Z", "content": "Pakistani expatriate workers, desperate to obtain a Pfizer/BioNTech or AstraZeneca Covid shot so they can travel to work in Saudi Arabia, stormed a vaccination center in Islamabad on Monday, witnesse… [+1947 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "More than 10 million Australians go under lockdown in fight against Delta variant", "description": "Four of Australia's eight capital cities are now under Covid-19 lockdown, as authorities struggle to contain fresh outbreaks of the highly infectious Delta variant.", "url": "https://www.cnn.com/2021/06/28/australia/australia-capitals-lock-down-delta-variant-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628205402-australia-perth-lock-down-delta-variant-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-29T03:25:43Z", "content": "SydneyFour of Australia's eight capital cities are now under Covid-19 lockdown, as authorities struggle to contain fresh outbreaks of the highly infectious Delta variant.\r\nPerth, the capital of Weste… [+3130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "More than 10 million Australians go under lockdown in fight against Delta variant", "description": "Four of Australia's eight capital cities are now under Covid-19 lockdown, as authorities struggle to contain fresh outbreaks of the highly infectious Delta variant.", "url": "https://www.cnn.com/2021/06/28/australia/australia-capitals-lock-down-delta-variant-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628205402-australia-perth-lock-down-delta-variant-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-29T03:25:43Z", "content": "SydneyFour of Australia's eight capital cities are now under Covid-19 lockdown, as authorities struggle to contain fresh outbreaks of the highly infectious Delta variant.\r\nPerth, the capital of Weste… [+3130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, Julia Hollingsworth, Eliza Mackintosh and Helen Regan, CNN", "title": "The junta overthrew the government they represented. What happens next for Myanmar's diplomats in limbo?", "description": "In a townhouse on a leafy New York street, a political coup thousands of miles away has split the office in two. Downstairs, staffers at Myanmar's Permanent Mission to the United Nations work for the military junta. Upstairs, Kyaw Moe Tun is leading what is e…", "url": "https://www.cnn.com/2021/06/28/asia/myanmar-diplomats-limbo-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624160540-20210623-myanmar-junta-diplomats-new-super-tease.jpg", "publishedAt": "2021-06-29T02:16:08Z", "content": "<li></li><li>February 1Myanmar's military, led by Gen. Min Aung Hlaing, seizes power in a coup, detaining civilian leader Aung San Suu Kyi, President Win Myint and other senior officials.\r\n</li><li>F… [+1670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan, CNN", "title": "Condo owners in Surfside building were facing assessments for $15 million worth of repairs", "description": "Condo owners in the South Florida tower that collapsed last week were facing assessments for millions of dollars worth of repairs -- with payments set to begin a week after the building's deadly fall.", "url": "https://www.cnn.com/2021/06/28/us/surfside-condo-owners-assessments-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628210812-surfside-condo-owners-assessments-invs-super-tease.jpg", "publishedAt": "2021-06-29T02:12:48Z", "content": "(CNN)Condo owners in the South Florida tower that collapsed last week were facing assessments for millions of dollars worth of repairs -- with payments set to begin a week after the building's deadly… [+5401 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "'This is a moment like Katrina and like Andrew': Surfside condo collapse raises questions beyond South Florida", "description": "A Florida condominium's deadly collapse could force stunned engineers and architects, homeowners associations and local officials to address questions about whether they've done enough to maintain other decades-old buildings -- and who should foot the bill fo…", "url": "https://www.cnn.com/2021/06/28/us/building-codes-surfside-florida-condo-collapse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628202230-surfside-condo-collapse-building-codes-super-tease.jpg", "publishedAt": "2021-06-29T02:11:39Z", "content": "(CNN)A Florida condominium's deadly collapse could force stunned engineers and architects, homeowners associations and local officials to address questions about whether they've done enough to mainta… [+6499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Cohan, CNN", "title": "Zandile Ndhlovu calls herself the 'Black Mermaid,' and she's helping South Africans fall in love with the ocean", "description": "In South Africa, the free-spirited free diver is creating a more diverse and inclusive ocean for young kids in her home country.", "url": "https://www.cnn.com/2021/06/28/africa/zandile-ndhlovu-black-mermaid-south-africa-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624132950-07-zandile-mermaid-super-tease.jpg", "publishedAt": "2021-06-29T02:08:52Z", "content": "(CNN)If the blue hair wasn't already a giveaway, Zandile Ndhlovu is channeling her inner mermaid.\r\nA South African nine-to-fiver turned free diver, Ndhlovu says the ocean is the only place she's felt… [+5222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "July 4th fireworks events: Dazzling pyrotechnic shows are back on for 2021", "description": "CNN Travel has rounded up some of the top places to enjoy Fourth of July fireworks shows in 2021, along with some other Independence Day events. If you can't attend in person, many are being live streamed.", "url": "https://www.cnn.com/travel/article/july-4th-fireworks-events-2021-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628164700-01-july-fourth-fireworks-super-tease.jpg", "publishedAt": "2021-06-29T01:46:01Z", "content": "Editor's Note Watch CNN's \"Fourth in America Special,\" which will air starting 7 p.m. ET Sunday, July 4. Anchors Dana Bash, Don Lemon, Victor Blackwell and Ana Cabrera will host coverage as the Unite… [+6981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Former daughter-in-law of Trump Organization officer says she's prepared to testify to grand jury", "description": "The former daughter-in-law of a Trump Organization officer said Monday evening that she is prepared to testify before a grand jury convened by Manhattan's top prosecutor as part of the investigation into former President Donald Trump's sprawling company.", "url": "https://www.cnn.com/2021/06/28/politics/jennifer-weisselberg-trump-organization-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628200552-jennifer-weisselberg-intv-sot-vpx-screengrab-super-tease.jpg", "publishedAt": "2021-06-29T01:24:57Z", "content": "Washington (CNN)The former daughter-in-law of a Trump Organization officer said Monday evening that she is prepared to testify before a grand jury convened by Manhattan's top prosecutor as part of th… [+2670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Clare Foran, CNN", "title": "Moderate House Democrats are uneasy over Pelosi's infrastructure strategy", "description": "Speaker Nancy Pelosi's vow to hold up a bipartisan infrastructure deal until the Senate approves a larger Democratic bill has caused some anxiety in the ranks, with moderate Democrats uneasy over her tactic and concerned it could cause both efforts to collaps…", "url": "https://www.cnn.com/2021/06/28/politics/moderate-house-democrats-infrastructure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210520140051-pelosi-0520-super-tease.jpg", "publishedAt": "2021-06-29T00:59:43Z", "content": "(CNN)Speaker Nancy Pelosi's vow to hold up a bipartisan infrastructure deal until the Senate approves a larger Democratic bill has caused some anxiety in the ranks, with moderate Democrats uneasy ove… [+8234 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "UK-Russia naval flap shows Putin's on edge", "description": "David A. Andelman writes that after Russia's recent claim that it fired warning shots at a British warship in Crimea's territorial waters, \"Putin needs to see that the Atlantic alliance is standing together and standing firm in the face of any intimidation he…", "url": "https://www.cnn.com/2021/06/28/opinions/putin-russia-uk-navy-crimea-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210627080520-hms-defender-0626-super-tease.jpg", "publishedAt": "2021-06-29T00:39:57Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, and executive director of The Red Lines Project, is the author of \"A Red Line in the Sand: Diplomacy, Strategy, and t… [+6153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Kaitlan Collins, CNN", "title": "How Biden and his team rushed to save him from his infrastructure blunder", "description": "President Joe Biden planned to spend a peaceful weekend at Camp David -- but instead, he spent two days working to salvage the bipartisan infrastructure plan he had imperiled with a stray comment to reporters as he celebrated the announcement of the deal.", "url": "https://www.cnn.com/2021/06/28/politics/infrastructure-clean-up-biden-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210624125117-01-biden-senators-0624-super-tease.jpg", "publishedAt": "2021-06-29T00:36:04Z", "content": "(CNN)President Joe Biden planned to spend a peaceful weekend at Camp David -- but instead, he spent two days working to salvage the bipartisan infrastructure plan he had imperiled with a stray commen… [+7368 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact check: Sen. Ron Johnson (again) misleads on vaccines and reported deaths", "description": "During a news conference Monday calling into question the safety of the Covid-19 vaccines, Republican Sen. Ron Johnson of Wisconsin again incorrectly used figures from an early warning system by the federal government to support his argument that vaccines may…", "url": "https://www.cnn.com/2021/06/28/politics/senator-ron-johnson-vaers-covid-deaths/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210621223704-ron-johnson-heckled-juneteenth-event-wdjt-vpx-super-tease.jpg", "publishedAt": "2021-06-29T00:23:36Z", "content": "(CNN)During a news conference Monday calling into question the safety of the Covid-19 vaccines, Republican Sen. Ron Johnson of Wisconsin again incorrectly used figures from an early warning system by… [+3373 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN Meteorologist", "title": "July 4th weather: Temperatures soar in the West, rain drenches the South", "description": "The weather on the Fourth of July will either be too wet, too hot or too dry, depending on location, as many people look to get outside and celebrate Independence Day for the first time in two years.", "url": "https://www.cnn.com/2021/06/28/weather/july-fourth-weather-forecast-wxn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628115739-weather-fourth-of-july-weekend-outlook-card-super-tease.jpg", "publishedAt": "2021-06-28T23:52:46Z", "content": "CNN weather is launching a weekly column, publishing Mondays with the weather news you should be aware of and the week's hurricane outlook. Find updates each week here.\r\n (CNN)The weather on the Four… [+11552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De la Fuente, CNN", "title": "NCAA takes big step toward allowing athletes to profit from name, image or likeness", "description": "In a major step, the NCAA Division I Council voted Monday to support an interim policy that would allow college athletes to profit off their name, image and likeness (NIL) without violating NCAA rules until federal legislation or new NCAA rules are adopted.", "url": "https://www.cnn.com/2021/06/28/us/ncaa-name-image-likeness-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622153806-ncaa-logo-super-tease.jpg", "publishedAt": "2021-06-28T23:17:11Z", "content": "(CNN)In a major step, the NCAA Division I Council voted Monday to support an interim policy that would allow college athletes to profit off their name, image and likeness (NIL) without violating NCAA… [+1177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "The Northwest heat wave is 'unprecedented.' Here's what's pushing it into uncharted territory.", "description": "Portland and Seattle set all-time heat records multiple days in a row. Officials say ambulances are stretched thin due to heat exhaustion demands.", "url": "https://www.cnn.com/2021/06/28/weather/heat-waves-climate-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628180243-01-pacific-northwest-heat-0628-super-tease.jpg", "publishedAt": "2021-06-28T23:09:38Z", "content": "(CNN)As temperatures surged past 100 degrees, Bree Oswill gathered all the blankets and towels she could find and taped them to every window that didn't have a shade. She doesn't have central air con… [+7650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Leah Asmelash, CNN", "title": "UN rights chief urges US to 'stop denying and start dismantling racism'", "description": "The United Nations' human rights chief is calling on the US to reform its criminal justice system, reimagine policing nationwide and provide reparations for descendants of enslaved Africans.", "url": "https://www.cnn.com/2021/06/28/us/united-nations-human-rights-racism-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628165425-01-michelle-bachelet-file-super-169.jpg", "publishedAt": "2021-06-28T22:47:40Z", "content": "The United Nations human rights chief is calling on the US to reform its criminal justice system, reimagine policing nationwide and provide reparations for descendants of enslaved Africans. \r\nIn a re… [+2534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Spanking can worsen a child's behavior and do real harm, study finds", "description": "Spanking does not appear to improve a child's positive behavior or social competence, a review of global studies finds.", "url": "https://www.cnn.com/2021/06/28/health/spanking-worsens-child-behavior-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628154857-man-with-belt-stock-super-tease.jpg", "publishedAt": "2021-06-28T22:34:31Z", "content": "In an apparently staged performance whose date is unknown, a teacher \"strikes\" a child over her knee while the rest of the class grimaces. In-school corporal punishment is allowed in 22 states, accor… [+157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Lauren Dezenski, CNN", "title": "Greg Abbott's fight to keep Trump's border wall dream alive", "description": "Texas Gov. Greg Abbott is pulling out all the stops to build a border wall between his state and Mexico, and a new poll shows that his base is all for it.", "url": "https://www.cnn.com/2021/06/28/politics/greg-abbott-texas-border-wall-trump-crowdfunding/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210112115647-primera-trump-super-tease.jpg", "publishedAt": "2021-06-28T22:32:32Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "Morgan Stanley is doubling its dividend and buying back up to $12 billion of stock", "description": "Morgan Stanley is doubling its quarterly dividend from 35 cents a share to 70 cents a share, and buying back up to $12 billion of stock, the company announced Monday.", "url": "https://www.cnn.com/2021/06/28/business/morgan-stanley-double-dividend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628181225-02-morgan-stanley-file-super-tease.jpg", "publishedAt": "2021-06-28T22:16:56Z", "content": "New York (CNN Business)Morgan Stanley is doubling its quarterly dividend from 35 cents a share to 70 cents a share, and buying back up to $12 billion of stock, the company announced Monday.\r\nThe powe… [+912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "US Covid-19 response faces doozy of a challenge: Vaccinating kids", "description": "Dr. Kent Sepkowitz writes that the next phase of vaccination -- vaccinating little kids -- will be the hardest. While a scientifically sound and safe process, it's likely to give pause in even the most vaccine-enthused.", "url": "https://www.cnn.com/2021/06/28/opinions/vaccine-trials-young-children-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210616000039-us-coronavirus-wednesday-0616-super-tease.jpg", "publishedAt": "2021-06-28T21:57:14Z", "content": "Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View mo… [+7753 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Book bombshells reveal depths of Trump's 2020 delusions", "description": "Excerpts from three upcoming books revealed previously unknown efforts by former President Donald Trump to abuse the powers of his office to overturn the 2020 election, deploy the military against racial justice protests and prosecute his political opponents.", "url": "https://www.cnn.com/2021/06/28/politics/trump-book-bombshells-delusions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201222192749-04-bill-barr-profile-super-tease.jpg", "publishedAt": "2021-06-28T21:45:29Z", "content": "Washington (CNN)Excerpts from three upcoming books revealed previously unknown efforts by then-President Donald Trump to abuse the powers of his office to overturn the 2020 election, deploy the milit… [+4668 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Obama stresses protecting voting rights to avoid 'further delegitimizing' democracy", "description": "Former President Barack Obama said Monday that action to protect voting rights is even more important in the wake of the 2020 election, taking a swipe at his immediate successor as having violated a \"core tenet\" of the American election system and for spreadi…", "url": "https://www.cnn.com/2021/06/28/politics/barack-obama-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628153243-01-obama-file-2020-super-tease.jpg", "publishedAt": "2021-06-28T20:36:15Z", "content": "(CNN)Former President Barack Obama said Monday that action to protect voting rights is even more important in the wake of the 2020 election, taking a swipe at his immediate successor as having violat… [+2138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sonia Pruitt", "title": "Congress only having a 'framework' for police reform is unacceptable", "description": "Sonia Pruit asks: I wonder how George Floyd would feel, knowing that there is just a \"framework\" for the Justice in Policing Act, more than a year after his death? What is the hesitance to make difficult but appropriate decisions for crucial changes in police…", "url": "https://www.cnn.com/2021/06/28/opinions/congress-police-reform-framework-pruitt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628143811-sonia-pruitt-op-ed-police-reform-super-tease.jpg", "publishedAt": "2021-06-28T20:36:02Z", "content": "Sonia Pruitt is a retired Montgomery County, Maryland police captain. She is on the Board of Directors and a speaker with the Law Enforcement Action Partnership, which advocates for criminal justice … [+5282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste, CNN Business", "title": "Bitcoin climbs on Mexican billionaire's tweet", "description": "Bitcoin rose Monday after Ricardo Salinas Pliego, the owner of Mexico's Banco Azteca, said he was pushing his country to accept the cryptocurrency and encouraged his Twitter followers to buy it.", "url": "https://www.cnn.com/2021/06/28/business/bitcoin-price-mexican-billionaire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628145830-ricardo-salinas-pliego-file-super-tease.jpg", "publishedAt": "2021-06-28T20:18:55Z", "content": "New York (CNN)Bitcoin rose Monday after Ricardo Salinas Pliego, the owner of Mexico's Banco Azteca, said he was pushing his country to accept the cryptocurrency and encouraged his Twitter followers t… [+1821 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "Facebook hits $1 trillion market cap after federal court dismisses FTC antitrust complaint", "description": "A federal court has dismissed the Federal Trade Commission's antitrust complaint against Facebook, saying the agency had failed to provide evidence for its claim that the social media giant holds a monopoly in social networking.", "url": "https://www.cnn.com/2021/06/28/tech/facebook-trillion-ftc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628151819-01-mark-zuckerberg-1023-file-restricted-super-tease.jpg", "publishedAt": "2021-06-28T20:18:18Z", "content": "(CNN Business)A federal court has dismissed the Federal Trade Commission's antitrust complaint against Facebook, saying the agency had failed to provide evidence for its claim that the social media g… [+3224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, CNN", "title": "US airstrikes fuel congressional debate over war powers", "description": "President Joe Biden's decision to launch airstrikes targeting Iran-backed militia groups in the Iraq-Syria border region injects new urgency into the congressional debate over whether Congress should put curbs on the Executive Branch's war powers around the g…", "url": "https://www.cnn.com/2021/06/28/politics/airstrikes-congressional-debate-war-powers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628155401-iran-syria-border-us-airstrikes-super-tease.jpg", "publishedAt": "2021-06-28T20:12:29Z", "content": "(CNN)President Joe Biden's decision to launch airstrikes targeting Iran-backed militia groups in the Iraq-Syria border region injects new urgency into the congressional debate over whether Congress s… [+6248 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, CNN Pentagon Correspondent", "title": "US forces in Syria came under rocket fire a day after airstrikes on Iranian-backed militias", "description": "Rockets landed at a US military base in eastern Syria on Monday, a day after the US carried out airstrikes on Iranian-backed militias, according to a US defense official with direct knowledge of the early reports.", "url": "https://www.cnn.com/2021/06/28/politics/us-base-syria-iran-militia-rocket/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213150327-pentagon-building-aerial-file-super-tease.jpg", "publishedAt": "2021-06-28T19:49:44Z", "content": "(CNN)Rockets landed at a US military base in eastern Syria on Monday, a day after the US carried out airstrikes on Iranian-backed militias, according to a US defense official with direct knowledge of… [+1227 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "Remains of 20 people found in a boat in Turks and Caicos islands", "description": "The remains of 20 people have been discovered in a boat in the waters of the British overseas territory, the Turks and Caicos Islands.", "url": "https://www.cnn.com/2021/06/28/americas/turks-caicos-boat-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628154102-turk-and-caicos-islands-stock-super-tease.jpg", "publishedAt": "2021-06-28T19:48:31Z", "content": "(CNN)The remains of 20 people have been discovered in a boat in the waters of the British overseas territory, the Turks and Caicos Islands.\r\nWhat they were doing in the waters, who they are and how t… [+1721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden will travel to Michigan over July 4th weekend to celebrate progress in Covid-19 fight", "description": "President Joe Biden will travel to Traverse City, Michigan, on Saturday as the White House looks to use the July Fourth holiday weekend to mark progress in the fight against Covid-19 after more than a year of the pandemic, according to a White House official.", "url": "https://www.cnn.com/2021/06/28/politics/biden-july-4-michigan-trip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210627200716-joe-biden-0625-super-tease.jpg", "publishedAt": "2021-06-28T19:43:32Z", "content": "(CNN)President Joe Biden will travel to Traverse City, Michigan, on Saturday as the White House looks to use the July Fourth holiday weekend to mark progress in the fight against Covid-19 after more … [+2667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Jamie Lynn Spears says she supports her sister's request to end conservatorship", "description": "Jamie Lynn Spears says she's proud of her older sister Britney Spears for speaking out at a hearing last week in which the singer called for an end to her \"abusive\" court-ordered conservatorship.", "url": "https://www.cnn.com/2021/06/28/entertainment/jamie-lynn-spears-britney-spears-conservatorship/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/171226091730-jamie-lynn-spears-super-tease.jpg", "publishedAt": "2021-06-28T19:41:44Z", "content": "(CNN)Jamie Lynn Spears says she's proud of her older sister Britney Spears for speaking out at a hearing last week in which the singer called for an end to her \"abusive\" court-ordered conservatorship… [+1040 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Scottie Andrew, CNN", "title": "Pope Francis praised a priest's work with LGBTQ Catholics in a handwritten letter", "description": "Nearly halfway through a year that's seen the Catholic Church take a stance against LGBTQ members, Pope Francis wrote in support of an American priest's work with LGBTQ Catholics.", "url": "https://www.cnn.com/2021/06/28/us/pope-francis-letter-lgbtq-catholics-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628090838-pope-francis-210626-super-169.jpg", "publishedAt": "2021-06-28T19:35:05Z", "content": "Nearly halfway through a year thats seen the Catholic Church take a stance against LGBTQ members, Pope Francis wrote in support of an American priests work with LGBTQ Catholics. \r\nIn a handwritten le… [+4426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bethlehem Feleke, Richard Roth, Kristina Sgueglia and CNN Staff", "title": "Ethiopian forces withdraw from Tigray regional capital Mekelle", "description": "Less than a week into an intense offensive by Tigrayan forces, the Ethiopian military has withdrawn from the war-torn regional Tigrayan capital of Mekelle on Monday, a UN official told CNN.", "url": "https://www.cnn.com/2021/06/28/world/ethiopian-forces-mekelle-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201105172618-20201105-mekelle-hp-illo-super-tease.jpg", "publishedAt": "2021-06-28T18:21:02Z", "content": "(CNN)Less than a week into an intense offensive by Tigrayan forces, the Ethiopian military has withdrawn from the war-torn regional Tigrayan capital of Mekelle on Monday, a UN official told CNN. \r\nTh… [+2677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy, CNN", "title": "White House defends airstrikes as 'necessary, appropriate and a deliberate action'", "description": "President Joe Biden viewed precision airstrikes against Iran-backed militia groups on the Iraq-Syria border region as \"necessary, appropriate and a deliberate action,\" press secretary Jen Psaki said Monday, defending the administration's legal justification f…", "url": "https://www.cnn.com/2021/06/28/politics/white-house-justification-airstrike/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210506110639-01-jen-psaki-0420-super-tease.jpg", "publishedAt": "2021-06-28T18:20:18Z", "content": "(CNN)President Joe Biden viewed precision airstrikes against Iran-backed militia groups on the Iraq-Syria border region as \"necessary, appropriate and a deliberate action,\" press secretary Jen Psaki … [+1972 chars]"}]}