{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "'Billions' closes one major account as it pivots toward another", "description": "\"Billions\" closed a major account in its fifth-season finale, as the show pivots to a new billionaire and star.", "url": "https://www.cnn.com/2021/10/04/entertainment/damian-lewis-billions-season-5-finale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200428081255-billions-season-5-super-tease.jpg", "publishedAt": "2021-10-04T12:43:32Z", "content": "The following contains spoilers about the \"Billions\" season finale.\r\n (CNN)\"Billions\" closed a major account in its fifth-season finale, as the show pivots to a new billionaire and star.\r\nIn a major … [+1789 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, Melissa Macaya and Mike Hayes, CNN", "title": "Massive California oil spill threatens wildlife and closes beaches", "description": "A massive oil spill off the coast of Huntington Beach, Orange County, has devastated some local wildlife and forced beach closures, officials say. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/california-oil-spill-10-04-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211004065905-01-california-oil-spill-aerial-super-tease.jpg", "publishedAt": "2021-10-04T12:25:43Z", "content": "The US Coast Guard (USCG) says approximately 3,150 gallons of oil has been recovered from the water off the coast of Orange County.\r\nApproximately 3,150 gallons of oil have been recovered from the wa… [+545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Marie Cocco", "title": "Hiking tobacco taxes will help tame America's most enduring epidemic", "description": "Marie Cocco writes that alongside the Covid-19 pandemic, tobacco use continues to plague the nation as a major threat to public health.", "url": "https://www.cnn.com/2021/10/04/opinions/tobacco-tax-epidemic-cocco/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716163137-smoking-super-tease.jpg", "publishedAt": "2021-10-04T11:51:01Z", "content": "Marie Cocco is president of Seven Mile Communications, a public affairs and strategic communications firm specializing in health care. The views expressed in this commentary are her own. Read more op… [+4987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, CNN", "title": "'He should resign': Fired justice minister calls for Haiti PM to quit over murder investigation", "description": "Until just a few weeks ago, Rockefeller Vincent was the ultimate insider in the investigation into the still-unsolved assassination of Haiti's former president Jovenel Moise, who was brutally gunned down in his bedroom in July.", "url": "https://www.cnn.com/2021/10/04/americas/haiti-assassination-rockefeller-vincent-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003190214-rockefeller-vincent-07-11-2021-super-tease.jpg", "publishedAt": "2021-10-04T11:16:10Z", "content": "(CNN)Until just a few weeks ago, Rockefeller Vincent was the ultimate insider in the investigation into the still-unsolved assassination of Haiti's former president Jovenel Moise, who was brutally gu… [+4946 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Lava flow thickens on La Palma after volcanic crater collapses", "description": "A river of red-hot lava gushing from the Cumbre Vieja volcano on Spain's La Palma thickened on Monday, after the north side of the crater collapsed the previous night causing spectacular explosions, but authorities ruled out further evacuations.", "url": "https://www.cnn.com/2021/10/04/europe/canary-islands-la-palma-cumbre-vieja-volcano-eruption-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211004055648-03-spain-cumbre-vieja-canary-islands-100321-super-tease.jpg", "publishedAt": "2021-10-04T10:43:20Z", "content": "A river of red-hot lava gushing from the Cumbre Vieja volcano on Spain's La Palma thickened on Monday, after the north side of the crater collapsed the previous night causing spectacular explosions, … [+1349 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "Full FDA approval of Pfizer's Covid-19 vaccine had only a modest impact on uptake. Here's what's more important", "description": "Despite hopes that full approval of Pfizer's Covid-19 vaccine would convince large numbers of vaccine-hesitant Americans to roll up their sleeves, a federal government analysis provided to CNN suggests approval was not a silver bullet.", "url": "https://www.cnn.com/2021/10/04/health/pfizer-covid-19-vaccine-approval-bump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927051442-pfizer-vaccine-covid-19-california-052121-file-super-tease.jpg", "publishedAt": "2021-10-04T10:39:54Z", "content": "(CNN)Despite hopes that full approval of Pfizer's Covid-19 vaccine would convince large numbers of vaccine-hesitant Americans to roll up their sleeves, a federal government analysis provided to CNN s… [+5334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton and Susannah Cullinane, CNN", "title": "Orange County beaches closed after oil spill off California coast destroys wildlife habitat", "description": "Portions of popular beaches across a swathe of Southern California have been closed after a pipeline breach sent thousands of gallons of oil into the Pacific Ocean and dead wildlife began washing ashore.", "url": "https://www.cnn.com/2021/10/04/us/california-oil-spill-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003224648-13-california-oil-spill-1003-super-tease.jpg", "publishedAt": "2021-10-04T10:39:21Z", "content": "(CNN)Portions of popular beaches across a swathe of Southern California have been closed after a pipeline breach sent thousands of gallons of oil into the Pacific Ocean and dead wildlife began washin… [+5155 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for October 4: Congress, Covid-19, Facebook, Brazil, oil spill", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/10/04/us/five-things-october-4-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001160656-03-biden-capitol-hill-super-tease.jpg", "publishedAt": "2021-10-04T10:30:25Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By John Walton, CNN", "title": "Why superbusiness minisuites are the future of luxury flying", "description": "After a long, golden sunset of being installed on fewer and fewer aircraft, the retirement of older aircraft caused by the Covid-19 pandemic means that when air travel resumes, international first class will be very nearly a thing of the past.", "url": "https://www.cnn.com/travel/article/superbusiness-minisuites/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930114045-03-aviation-superbusiness-minisuites-super-tease.jpg", "publishedAt": "2021-10-04T09:48:17Z", "content": "(CNN) After a long, golden sunset of being installed on fewer and fewer aircraft, the retirement of older aircraft caused by the Covid-19 pandemic means that when air travel resumes, international fi… [+5670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "Nobel Prize in medicine awarded to David Julius and Ardem Patapoutian", "description": "The 2021 Nobel Prize in physiology and medicine has been awarded to David Julius and Ardem Patapoutian for their discoveries of receptors for temperature and touch.", "url": "https://www.cnn.com/2021/10/04/health/nobel-prize-medicine-physiology-winner-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211004054623-01-nobel-prize-medicine-winners-1004-super-tease.jpg", "publishedAt": "2021-10-04T09:35:48Z", "content": "The seminal discoveries by this year's #NobelPrize laureates in physiology or medicine have explained how heat, cold and touch can initiate signals in our nervous system. The identified ion channels … [+145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Inside the Waldorf Astoria's $1 billion makeover", "description": "The luxury hotel in Manhattan is 90 years old this month, and it is currently undergoing a years-long renovation that will include opulent private residences.", "url": "https://www.cnn.com/style/article/waldorf-astoria-renovation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930153416-11-waldorf-astoria-new-york-super-tease.jpg", "publishedAt": "2021-10-04T09:29:29Z", "content": "luxuryPublished 4th October 2021\r\nThis month marks 90 years since the Waldorf Astoria first opened its doors on New York's Park Avenue in 1931, becoming the tallest and largest luxury hotel in the wo… [+6697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "US Trade Rep Katherine Tai to condemn China's 'unfair trade practices'", "description": "US Trade Representative Katherine Tai is expected to condemn China's \"unfair trade practices\" during remarks at the Center for Strategic and International Studies in Washington, DC, on Monday, according to a senior administration official.", "url": "https://www.cnn.com/2021/10/04/politics/us-china-trade-katherine-tai/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003194947-katherine-tai-05-12-2021-super-tease.jpg", "publishedAt": "2021-10-04T09:04:58Z", "content": "(CNN)US Trade Representative Katherine Tai is expected to condemn China's \"unfair trade practices\" during remarks at the Center for Strategic and International Studies in Washington, DC, on Monday, a… [+3396 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Lars Vilks, Swedish cartoonist who depicted Mohammed, killed in car crash", "description": "Swedish artist Lars Vilks, who stirred worldwide controversy in 2007 with drawings depicting the prophet Mohammed with the body of a dog, was killed in a car crash near the southern town of Markaryd on Sunday, police said.", "url": "https://www.cnn.com/2021/10/04/europe/lars-vilks-cartoonist-death-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211004040634-01-lars-vilks-cartoonist-death-super-tease.jpg", "publishedAt": "2021-10-04T08:53:58Z", "content": "Swedish artist Lars Vilks, who stirred worldwide controversy in 2007 with drawings depicting the prophet Mohammed with the body of a dog, was killed in a car crash near the southern town of Markaryd … [+1113 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Tani Adewumi: How chess changed the fortunes of 11-year-old prodigy and his family", "description": "When Tanitoluwa \"Tani\" Adewumi mulls his next move on a chessboard, his instinct is to pile pressure on his opponent.", "url": "https://www.cnn.com/2021/10/04/sport/tani-adewumi-chess-spt-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927100529-01-tani-adewumi-restricted-super-tease.jpg", "publishedAt": "2021-10-04T08:42:02Z", "content": "(CNN)When Tanitoluwa \"Tani\" Adewumi mulls his next move on a chessboard, his instinct is to pile pressure on his opponent. \r\n\"I'm aggressive, I like to attack,\" he tells CNN Sport of his playing styl… [+5656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Nell Lewis, CNN", "title": "Giant inflatable sails could make shipping greener", "description": "Michelin has developed a new kind of sail for cargo ships, one of a number of sail innovations that could help the industry to reduce carbon emissions.", "url": "https://www.cnn.com/travel/article/cargo-ships-sails-michelin-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211004082720-michelin-wisamo-wings-card-restricted-super-tease.jpg", "publishedAt": "2021-10-04T08:13:01Z", "content": "(CNN) Sailing boats date back more than 5,000 years, when the ancient Egyptians floated up and down the Nile in wooden vessels powered by wind and oars. But when steam and diesel engines arrived and … [+7218 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Nectar Gan and Jessie Yeung, CNN", "title": "Analysis: He helped bring down one of China's most corrupt officials. So why is the country cheering his downfall?", "description": "Once a rising star in law enforcement and widely regarded ally of Xi Jinping, he was the man in charge of a special investigation that brought down the most powerful official in the Chinese President's sweeping anti-corruption campaign.", "url": "https://www.cnn.com/2021/10/04/china/china-fu-zhenghua-downfall-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003220059-fu-zhenghua-2019-super-tease.jpg", "publishedAt": "2021-10-04T07:01:02Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+5125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Bitterness festers as Democrats try again to pass Biden's economic agenda", "description": "A bitter duel between progressives and Senate centrists last week laid bare the mistrust, philosophical divides and practical governing constraints rocking Washington Democrats. And it only deepened the critical question of Joe Biden's term: Can the President…", "url": "https://www.cnn.com/2021/10/04/politics/president-joe-biden-congress-manchin-progressives/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001155746-01-biden-capitol-hill-1001-super-tease.jpg", "publishedAt": "2021-10-04T04:00:59Z", "content": "(CNN)A bitter duel between progressives and Senate centrists last week laid bare the mistrust, philosophical divides and practical governing constraints rocking Washington Democrats. And it only deep… [+10038 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeffrey Toobin", "title": "McConnell's Supreme Court", "description": "Jeffrey Toobin writes on the divide between the originalist and living Constitutionalist justices on the Supreme Court.", "url": "https://www.cnn.com/2021/10/03/opinions/supreme-court-mcconnell-toobin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630170105-02-scotus-0621-super-tease.jpg", "publishedAt": "2021-10-04T03:13:54Z", "content": "Jeffrey Toobin is chief legal analyst for CNN and the author of \"The Nine\" and \"The Oath.\" The opinions expressed in this commentary are his own. View more opinion at CNN.\r\n (CNN)Amy Coney Barrett, w… [+5182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "The husband-and-wife duo redefining cultural architecture in China", "description": "With China experiencing a museum boom, and cities of all sizes building cultural venues at unprecedented speed, there is something refreshingly modest about Li Hu and Huang Wenjing's approach to architecture.", "url": "https://www.cnn.com/style/article/open-architecture-li-hu-huang-wenjing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210926234202-02-open-architecture-china-hu-huang-crop-super-tease.jpg", "publishedAt": "2021-10-04T02:40:34Z", "content": "With China experiencing a museum boom, and cities of all sizes building cultural venues at unprecedented speed, there is something refreshingly modest about Li Hu and Huang Wenjing's approach to arch… [+8583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Farmers among 6 killed as India protest erupts in violence", "description": "Six people were killed when violence broke out in India's Uttar Pradesh state on Sunday after a car linked to a federal minister ran over two farmers taking part in a protest against controversial farm laws.", "url": "https://www.cnn.com/2021/10/03/asia/india-farm-protests-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003221019-map-lakhimpur-kheri-protest-super-tease.jpg", "publishedAt": "2021-10-04T02:30:26Z", "content": "Lucknow, India (CNN)Six people were killed when violence broke out in India's Uttar Pradesh state on Sunday after a car linked to a federal minister ran over two farmers taking part in a protest agai… [+788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Whistleblower: Facebook knows anger is most inspiring", "description": "The identity of the Facebook whistleblower who released tens of thousands of pages of internal research and documents was revealed on \"60 Minutes.\" CNN's Brian Stelter reports Frances Haugen, the former Facebook product manager who worked on civic integrity i…", "url": "https://www.cnn.com/videos/tech/2021/10/04/facebook-whistleblower-60-minutes-algorithm-profit-stelter-sot-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003205150-facebook-whistleblower-60-minutes-algorithm-profit-stelter-sot-nr-vpx-00000411-super-tease.jpeg", "publishedAt": "2021-10-04T01:04:11Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Patrick Oppmann, CNN", "title": "Cuba lashes out after young baseball players defect in Mexico", "description": "Cuba's state media on Sunday lashed out after nearly a dozen Cuban baseball players defected in Mexico -- believed to be one of the country's largest and most embarrassing known incidents of mass defection in years.", "url": "https://www.cnn.com/2021/10/03/americas/cuban-baseball-players-defect-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713152951-cuba-baseball-flag-deportes-cnne-super-tease.jpg", "publishedAt": "2021-10-04T00:41:51Z", "content": "Havana (CNN)Cuba's state media on Sunday lashed out after nearly a dozen Cuban baseball players defected in Mexico -- believed to be one of the country's largest and most embarrassing known incidents… [+910 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Andrew Yang", "title": "Andrew Yang: How to get our democracy working again", "description": "Andrew Yang writes that ever increasing polarization sweeping across the US is creating divides that are having devastating consequences. One solution to address the problem? Open primaries.", "url": "https://www.cnn.com/2021/10/03/opinions/polarization-democracy-open-primaries-yang/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630164116-voters-file-super-tease.jpg", "publishedAt": "2021-10-04T00:14:54Z", "content": "Andrew Yang was a 2020 Democratic presidential candidate and a 2021 candidate for mayor of New York. Named by President Barack Obama as a Presidential Ambassador of Global Entrepreneurship, he is the… [+4749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Dean Obeidallah", "title": "'SNL' is right. Democrats are toast without a deal", "description": "\"Saturday Night Live\" kicked off its 47th season this weekend with a very funny and politically insightful cold open -- one that accurately predicts what's next for Democrats if they can't deliver on their priorities, writes Dean Obeidallah.", "url": "https://www.cnn.com/2021/10/03/opinions/snl-sinema-manchin-democrats-screwed-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003160533-saturday-night-live-cold-open-10-02-2021-super-tease.jpg", "publishedAt": "2021-10-03T23:42:01Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5181 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Frehse, CNN", "title": "New York AG blasts NRA's decision to re-elect its embattled leader: 'The rot runs deep'", "description": "New York Attorney General Letitia James tore into the National Rifle Association on Sunday after it reelected its longtime leader, citing her ongoing financial abuse lawsuit against the pro-gun rights group.", "url": "https://www.cnn.com/2021/10/03/politics/nra-wayne-lapierre-reelected-letitia-james/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190429185229-nra-wayne-lapierre-super-tease.jpg", "publishedAt": "2021-10-03T22:13:34Z", "content": "Washington (CNN)New York Attorney General Letitia James tore into the National Rifle Association on Sunday after it reelected its longtime leader, citing her ongoing financial abuse lawsuit against t… [+2770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Harwood", "title": "Democrats have a numbers problem", "description": "Two principal questions swirling around President Joe Biden's budget bill highlight the problem: beyond a number, it's hard to describe exactly what it is.", "url": "https://www.cnn.com/2021/10/03/politics/social-spending-bill-cost-benefits-biden-democrats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002211349-restricted-joe-biden-09-24-2021-super-tease.jpg", "publishedAt": "2021-10-03T20:00:19Z", "content": "(CNN)Two principal questions swirling around President Joe Biden's budget bill highlight the problem: beyond a number, it's hard to describe exactly what it is.\r\nThe question of cost has dominated de… [+4731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez and Priya Krishnakumar, CNN", "title": "The influx of guns is 'ground zero for violence' at the end of a bloody summer in Chicago", "description": "More than 1,600 people were shot in a single three-month summer period, part of a grimly familiar dynamic in the city and one that leaders in law enforcement and public office see as \"unacceptable\" on the other side of an especially bloody season.", "url": "https://www.cnn.com/2021/10/03/us/chicago-gun-violence-summer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001114209-03-chicago-gun-violence-summer-super-tease.jpg", "publishedAt": "2021-10-03T19:20:29Z", "content": "By Omar Jimenez and Priya Krishnakumar, CNN\r\nUpdated 3:20 PM ET, Sun October 3, 2021\r\n (CNN)1,606 people were shot in a single three-month summer period in Chicago. That's the population equivalent t… [+14483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liam Reilly, CNN", "title": "Bronze bust of George Floyd defaced at New York City's Union Square", "description": "A bronze bust of George Floyd, part of Confront Art's \"SEEINJUSTICE\" exhibition, was defaced on Sunday morning, according to the New York City Police Department.", "url": "https://www.cnn.com/2021/10/03/us/george-floyd-bust-defaced-confront-art/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003140741-restricted-01-george-floyd-union-square-statue-defaced-1003-super-tease.jpg", "publishedAt": "2021-10-03T18:47:45Z", "content": "New York (CNN)A bronze bust of George Floyd, part of Confront Art's \"SEEINJUSTICE\" exhibition, was defaced on Sunday morning, according to the New York City Police Department. \r\nThe bust -- one of th… [+1838 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Top Democrats disagree on including Hyde Amendment in economic bill", "description": "Rep. Pramila Jayapal, the chair of the Congressional Progressive Caucus, said Sunday she would not support a sweeping economic bill if it includes the Hyde Amendment, adding another complicating factor to the ongoing negotiations among Democrats as they hash …", "url": "https://www.cnn.com/2021/10/03/politics/hyde-amendment-economic-bill-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003121716-dick-durbin-0929-super-tease.jpg", "publishedAt": "2021-10-03T18:04:02Z", "content": "(CNN)Rep. Pramila Jayapal, the chair of the Congressional Progressive Caucus, said Sunday she would not support a sweeping economic bill if it includes the Hyde Amendment, adding another complicating… [+2468 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop", "title": "Google celebrates Marine biologist Mara de los ngeles Alvario Gonzlez with latest Doodle", "description": "Google honored María de los Ángeles Alvariño González with a Doodle on Sunday, the 105th birthday of the marine research biologist \"widely regarded as one of the most important Spanish scientists of all time,\" Google said.", "url": "https://www.cnn.com/2021/10/03/us/mara-de-los-ngeles-alvario-gonzlez/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003125856-mara-de-los-ngeles-alvario-gonzlez-doodle-super-tease.jpg", "publishedAt": "2021-10-03T17:59:10Z", "content": "(CNN)Google honored María de los Ángeles Alvariño González with a Doodle on Sunday, the 105th birthday of the marine research biologist \"widely regarded as one of the most important Spanish scientist… [+1408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Facebook executive: 'Ludicrous' to blame Capitol riot on social media", "description": "Nick Clegg, Vice President of global affairs at Facebook, tells CNN's Brian Stelter that blaming social media for the January 6 Capitol insurrection is too simplistic of an explanation to a complicated problem.", "url": "https://www.cnn.com/videos/media/2021/10/03/facebook-spokesperson-social-media-january-6-riot-rs-stelter-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003115014-facebook-spokesperson-social-media-january-6-riot-rs-stelter-vpx-00011825-super-tease.jpg", "publishedAt": "2021-10-03T16:45:58Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Small plane crashes into empty building outside Milan, all 8 onboard die", "description": "A small private plane crashed into an empty building on the outskirts of Milan, northern Italy, on Sunday, killing all eight people onboard, police said.", "url": "https://www.cnn.com/2021/10/03/europe/milan-plane-crash-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003120521-01-milan-plane-crash-1003-restricted-super-tease.jpg", "publishedAt": "2021-10-03T16:18:47Z", "content": "(CNN)A small private plane crashed into an empty building on the outskirts of Milan, northern Italy, on Sunday, killing all eight people onboard, police said.\r\nThe plane, which took off from Milan's … [+427 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells, CNN", "title": "Several fires set, one arrested after University of Kentucky's win over Florida", "description": "Fan celebrations following the University of Kentucky's victory over the University of Florida in Saturday's football game resulted in several fires and at least one arrest, according to Lexington officials.", "url": "https://www.cnn.com/2021/10/03/us/kentucky-football-win-fires/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003103127-university-avenue-kentucky-wildcats-win-1002-super-tease.jpg", "publishedAt": "2021-10-03T15:25:58Z", "content": "(CNN)Fan celebrations following the University of Kentucky's victory over the University of Florida in Saturday's football game resulted in several fires and at least one arrest, according to Lexingt… [+974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Durbin on impending debt ceiling deadline: 'We're gonna get this done'", "description": "Senate Majority Whip Dick Durbin projected confidence that the Democratic majority in the Senate will not let the United States government run out of money October 18, when it's on track to hit the borrowing ceiling set by Congress.", "url": "https://www.cnn.com/2021/10/03/politics/durbin-democrats-debt-ceiling-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211003102033-dick-durbin-sotu-vpx-super-tease.jpg", "publishedAt": "2021-10-03T14:36:52Z", "content": "Washington, DC (CNN)Senate Majority Whip Dick Durbin projected confidence that the Democratic majority in the Senate will not let the United States government run out of money October 18, when it's o… [+1265 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Ready-to-eat spices and food additives exposed to widespread rodent infestation", "description": "View the latest news and breaking news today for U.S., world, weather, entertainment, politics and health at CNN.com.", "url": "https://lite.cnn.com/en/article/h_ed45a8d1417bc5cf238b5303665c51fb", "urlToImage": null, "publishedAt": "2021-10-03T14:11:45Z", "content": "By Ben Tinker and Rebekah Riess, CNN\r\nUpdated: Sat, 02 Oct 2021 05:20:21 GMT\r\nSource: CNN\r\nFDA-regulated spices and food additive products exposed to \"widespread rodent infestation\" as well as live a… [+1600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Strive Masiyiwa and Tom Frieden", "title": "This is what we owe the world's health and care workers, who put their lives on the line for us", "description": "Those on the pandemic's frontlines -- health and care workers, including nurses -- risk their lives every day to treat their patients. They face high risk of infection with Covid-19; the World Health Organization (WHO) estimated in May, almost certainly a sub…", "url": "https://www.cnn.com/2021/10/03/opinions/covid-19-vaccinations-health-and-care-workers-frieden-masiyiwa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622055449-04-vaccine-inequality-asia-super-tease.jpg", "publishedAt": "2021-10-03T13:30:00Z", "content": "Strive Masiyiwa is founder and Executive Chairman of Econet Group. An African technology entrepreneur and philanthropist, he currently serves as an African Union Special Envoy for COVID and on the AU… [+6977 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "Start your week smart: Nobel Prize ... Women's March ... Coronavirus ... Afghanistan ... Miya Marcano", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/10/03/us/five-things-october-3/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002135044-08-womens-march-2021-1002-los-angeles-super-tease.jpg", "publishedAt": "2021-10-03T13:11:28Z", "content": "A California couple visiting an Arkansas state park found a 4.38-carat diamond on the ground. \"I didn't know it was a diamond then, but it was clean and shiny, so I picked it up,\" the wife said. Here… [+2284 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alaa Elassar, CNN", "title": "Chicago residents are fighting to save Navy Pier's Crystal Gardens, one of the city's only indoor green spaces", "description": "Celine Wysgalla remembers the first time she stepped foot into Crystal Gardens as a 5-year-old, her tiny body overshadowed by ancient trees that towered above her.", "url": "https://www.cnn.com/travel/article/crystal-gardens-chicago-navy-pier-petition-illuminarium-trnd-travel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002124230-crystal-gardens-file-2018-super-tease.jpg", "publishedAt": "2021-10-03T13:07:28Z", "content": "(CNN) Celine Wysgalla remembers the first time she stepped foot into Crystal Gardens as a 5-year-old, her tiny body overshadowed by ancient trees that towered above her.\r\nFor more than two decades, t… [+6985 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Hira Humayun, Wayne Chang and Jeevan Ravindran, CNN", "title": "New Zealand says foreign nationals must have coronavirus vaccination to enter country from November", "description": "All foreign nationals entering New Zealand will need to be fully vaccinated from November 1, the government announced Sunday.", "url": "https://www.cnn.com/travel/article/new-zealand-travel-vaccination-covid-lockdown-ardern-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210831222922-new-zealand-covid-lockdown-0824-super-tease.jpg", "publishedAt": "2021-10-03T12:35:02Z", "content": "(CNN) All foreign nationals entering New Zealand will need to be fully vaccinated from November 1, the government announced Sunday. \r\nTravelers will have to declare their vaccination status when regi… [+3508 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Morrow, CNN Business", "title": "How America ruined Christmas", "description": "The supply chain nightmare that's been plaguing the global economy for over a year is about to snarl the holiday shopping season. Think barren shelves, massive shipping delays, and no small amount of sticker shock. Merry Christmas, everyone!", "url": "https://www.cnn.com/2021/10/03/investing/stocks-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001105006-02-us-christmas-shopping-file-super-tease.jpg", "publishedAt": "2021-10-03T12:34:15Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nNew York (CNN Business)The supply chain nightmare that's been plagui… [+4901 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Trump-fueled falsehoods have deep roots", "description": "Former President Donald Trump spread more than 30,000 falsehoods during his term, according to the Washington Post. But even tens of thousands are a drop in the bucket on social media, where misinformation is weaponized to drive engagement and achieve politic…", "url": "https://www.cnn.com/2021/10/03/opinions/trump-fueled-falsehoods-deep-roots-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914090403-trump-nov-2020-super-tease.jpg", "publishedAt": "2021-10-03T12:12:42Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)In January 1980, Mary McCarthy appeare… [+14958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells, CNN", "title": "A major oil spill threatens the California coast, officials say", "description": "A spill of about 3,000 barrels of oil -- or roughly 126,000 gallons of post-production crude -- off the coast of Southern California is a \"potential ecological disaster,\" Huntington Beach Mayor Kim Carr said Saturday.", "url": "https://www.cnn.com/2021/10/03/us/california-oil-spill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2021-10-03T12:07:55Z", "content": "(CNN)A spill of about 3,000 barrels of oil -- or roughly 126,000 gallons of post-production crude -- off the coast of Southern California is a \"potential ecological disaster,\" Huntington Beach Mayor … [+1121 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Pressure is growing on Biden to lift Trump's tariffs as supply chain problems worsen", "description": "There's a quick move President Joe Biden could make to immediately help relieve the stress the pandemic-related supply chain crisis is having on US companies: Lift the tariffs imposed by former President Donald Trump.", "url": "https://www.cnn.com/2021/10/03/politics/global-supply-chain-collapse-biden-tariffs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001122155-shipment-containers-china-restricted-super-tease.jpg", "publishedAt": "2021-10-03T12:03:35Z", "content": "Washington (CNN)There's a quick move President Joe Biden could make to immediately help relieve the stress the pandemic-related supply chain crisis is having on US companies: Lift the tariffs imposed… [+4490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez and Clare Duffy, CNN", "title": "Want to help the climate crisis? Don't toss your old iPhone, fix it", "description": "As taxing as the manufacturing process is on the environment, it's only made worse by how quickly most consumers discard their devices.", "url": "https://www.cnn.com/2021/10/03/tech/right-to-repair-climate-environmental-impact/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915143021-05-right-to-repair-environmental-impact-restricted-super-tease.jpg", "publishedAt": "2021-10-03T12:02:34Z", "content": "By Rachel Ramirez and Clare Duffy, CNN\r\nUpdated 8:02 AM ET, Sun October 3, 2021\r\nNew York (CNN Business)The life cycle of a smartphone begins in mines around the world. There, raw materials and rare … [+10543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen and Katie Bo Williams, CNN", "title": "GOP lawmakers push to uncover 'bias' in covid probe during contentious classified intel briefing", "description": "Frustrations boiled over during a closed-door intelligence briefing last week as Republican lawmakers sought to expose what they believe is bias against the lab leak theory amongst experts consulted by the Biden administration in its hunt for the origins of t…", "url": "https://www.cnn.com/2021/10/03/politics/gop-lawmakers-hearing-covid-origins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001191428-restricted-us-capitol-washington-dc-10-01-2021-super-tease.jpg", "publishedAt": "2021-10-03T12:00:18Z", "content": "(CNN)Frustrations boiled over during a closed-door intelligence briefing last week as Republican lawmakers sought to expose what they believe is bias against the lab leak theory amongst experts consu… [+4388 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "How to fall asleep more quickly -- the healthy way", "description": "Is falling asleep when your head hits the pillow what you're dreaming of? A fast fall into the land of nod may seem like nirvana, but it's not a sign of a healthy sleeper.", "url": "https://www.cnn.com/2021/10/03/health/fall-asleep-faster-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201022174912-insomnia-stock-super-tease.jpg", "publishedAt": "2021-10-03T11:37:53Z", "content": "(CNN)Is falling asleep when your head hits the pillow what you're dreaming of? A fast fall into the land of nod may seem like nirvana, but it's not a sign of a healthy sleeper.\r\n\"The well-rested pers… [+7593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez and Priya Krishnakumar, CNN", "title": "5 charts that illustrate why being Hispanic or Latino is more than speaking Spanish", "description": "James Bosquez grew up being singled out by his cousins for only speaking English and prompting surprised looks from his peers for not getting good grades in Spanish class.", "url": "https://www.cnn.com/2021/10/03/us/latino-hispanic-demographics-diversity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210910143933-20210910-latino-hispanic-population-demographics-super-tease.jpg", "publishedAt": "2021-10-03T10:01:49Z", "content": "By Nicole Chavez and Priya Krishnakumar, CNN\r\nUpdated 6:01 AM ET, Sun October 3, 2021\r\n (CNN)James Bosquez grew up being singled out by his cousins for only speaking English and prompting surprised l… [+8205 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "US immigration policies toward Haitians have long been racist, advocates say", "description": "The recent treatment of Haitian migrants only reinforces what some advocates say they have long known: Haitians fare differently under the US immigration system than migrants who aren't Black.", "url": "https://www.cnn.com/2021/10/03/us/haitian-migrants-us-immigration-policy-racism-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210921091555-mexico-us-border-haiti-091921-file-super-tease.jpg", "publishedAt": "2021-10-03T08:03:30Z", "content": "(CNN)The parallel was striking.\r\nImages from the banks of the Rio Grande last week depicted US Border Patrol agents on horseback, swinging long reins, as they attempted to round up Haitian migrants w… [+11423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "'Every one of those deaths is unnecessary,' expert says of rising Covid-19 US death toll as tens of millions remain unvaccinated", "description": "With a first-of-its-kind antiviral pill against Covid-19 potentially headed towards distribution, the health care community may soon have another tool to combat a virus that has claimed the lives of more than 700,000 Americans.", "url": "https://www.cnn.com/2021/10/03/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002235331-restricted-pfizer-covid-19-vaccine-alabama-08-28-2021-super-tease.jpg", "publishedAt": "2021-10-03T07:43:12Z", "content": "(CNN)With a first-of-its-kind antiviral pill against Covid-19 potentially headed towards distribution, the health care community may soon have another tool to combat a virus that has claimed the live… [+7342 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson, CNN", "title": "The tradition traces back to the 1700s. These women are fighting to keep it alive through online retail.", "description": "Many African cultures in the United States have been fighting to keep their traditions and unique way of life alive, and now, an online retail outlet is helping the Gullah community in Charleston, South Carolina, use tech to reach a wider audience.", "url": "https://www.cnn.com/2021/10/03/us/etsy-backs-gullah-weavers-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001192746-restricted-06-gullah-weavers-super-tease.jpg", "publishedAt": "2021-10-03T06:06:08Z", "content": "(CNN)Many African cultures in the United States have been fighting to keep their traditions and unique way of life alive, and now, an online retail outlet is helping the Gullah community in Charlesto… [+6129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, CNN", "title": "Police failures exposed by Sarah Everard murder underpin culture of misogyny in the force, activists say", "description": "When thousands gathered to mourn the death of Sarah Everard, a 33-year-old woman who was kidnapped, raped and murdered in March, London police responded with force.", "url": "https://www.cnn.com/2021/10/03/uk/everard-uk-police-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001101027-06-vigil-sarah-everard-0317-super-tease.jpg", "publishedAt": "2021-10-03T04:02:16Z", "content": "(CNN)When thousands gathered to mourn the death of Sarah Everard, a 33-year-old woman who was kidnapped, raped and murdered in March, London police responded with force. \r\nScenes of grieving women be… [+11228 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan, CNN", "title": "Winning numbers announced for Saturday's $635 million Powerball jackpot", "description": "The winning numbers for a Powerball jackpot estimated at $635 million were drawn on Saturday.", "url": "https://www.cnn.com/2021/10/02/us/powerball-drawing-saturday-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210530131851-stock-powerball-power-play-lottery-ticket-super-tease.jpg", "publishedAt": "2021-10-03T03:25:54Z", "content": "(CNN)The winning numbers for a Powerball jackpot estimated at $635 million were drawn on Saturday.\r\nThe numbers are 28-38-42-47-52 and the Powerball is 1.\r\nSaturday's jackpot is the 10th largest in U… [+855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jonny Hallam and Helen Regan, CNN", "title": "Thousands protest across Brazil calling for President Bolsonaro's impeachment", "description": "Protesters returned to the streets in major cities across Brazil on Saturday, calling for the impeachment of President Jair Bolsonaro amid worsening economic conditions, rising unemployment, and hunger in the Covid-wracked country.", "url": "https://www.cnn.com/2021/10/02/americas/brazil-bolsonaro-protests-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002224438-01-brazil-impeach-bolsonaro-protest-10-02-2021-super-tease.jpg", "publishedAt": "2021-10-03T03:07:51Z", "content": "(CNN)Protesters returned to the streets in major cities across Brazil on Saturday, calling for the impeachment of President Jair Bolsonaro amid worsening economic conditions, rising unemployment, and… [+2353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Cheung and Brad Lendon, CNN", "title": "China sends 77 warplanes into Taiwan defense zone over two days, Taipei says", "description": "Taiwan has reported a record number of incursions by Chinese warplanes into its air defense identification zone (ADIZ) for the second day in a row, Taiwan's Ministry of National Defense said on Saturday night.", "url": "https://www.cnn.com/2021/10/02/asia/china-warplanes-taiwan-air-defense-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200921000226-taiwan-intercepts-pla-h-6-bomber-super-tease.jpg", "publishedAt": "2021-10-03T01:23:27Z", "content": "Taipei, Taiwan (CNN)Taiwan has reported a record number of incursions by Chinese warplanes into its air defense identification zone (ADIZ) for the second day in a row, Taiwan's Ministry of National D… [+4164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jake Kwon, CNN Business", "title": "Why a hand gesture has South Korean companies on edge", "description": "Anti-feminists in South Korea are increasingly pushing companies to repent for what they see as a conspiracy within the government and private companies to promote a feminist agenda.", "url": "https://www.cnn.com/2021/10/02/business/south-korea-business-gender-war-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001144310-20211001-korean-feminism-gesture-illo-super-tease.jpg", "publishedAt": "2021-10-03T00:00:03Z", "content": "By Jake Kwon, CNN Business\r\nUpdated 8:00 PM ET, Sat October 2, 2021\r\nSeoul (CNN Business)It took three years for players to notice the \"offensive\" hand gesture lurking in one of South Korea's most po… [+11406 chars]"}]}