{"status": "ok", "totalResults": 126, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Aya Elamroussi and Kay Jones, CNN", "title": "Lawyers for Breonna Taylor's family sue Louisville police, saying they may have withheld bodycam footage", "description": "Attorneys who represent the family of Breonna Taylor have sued the Louisville Metro Police Department, saying they may have given \"misinformation\" to the public about the use of body cameras on the night the Black woman was killed in her home in Kentucky.", "url": "https://www.cnn.com/2021/07/09/us/breonna-taylor-body-camera-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201029192002-breonna-taylor-photo-super-169.jpg", "publishedAt": "2021-07-09T17:13:27Z", "content": "Attorneys who represent the family of Breonna Taylor have sued the Louisville Metro Police Department, saying they may have given misinformation to the public about the use of body cameras on the nig… [+4355 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Eric Ravenscraft", "title": "The best computer mice of 2021", "description": "To help you find the mouse that's comfortable enough to use all day and has the features that let you be most productive, we spent several weeks testing 15 different mice, from basic, budget-friendly models, to the tricked out ergonomic mice with customizable…", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-computer-mouse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709075130-best-computer-mouse-lead-super-169.jpg", "publishedAt": "2021-07-09T17:02:29Z", "content": "Your mouse is always there for you, right (or sometimes left) by your side. You might not give much thought to it, but a good mouse can make you more productive, feel more comfortable, and help you g… [+17361 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Yellin", "title": "These credit cards are offering the best limited-time bonuses in July", "description": "If you want to earn as many points or miles as possible when you sign up for a credit card, these cards are offering the best limited-time bonus opportunities.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-credit-card-signup-bonus-offers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708134909-underscored-stack-of-credit-cards-on-top-of-cash-super-169.jpg", "publishedAt": "2021-07-09T16:32:30Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+22366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Molano, CNN", "title": "Just one night of sleep loss harms your well-being, new study finds", "description": "A new study by Soomi Lee finds that even one night of sleep loss can harm your physical and mental well-being. It adds to existing research on the adverse effects of poor sleep, which include links to higher risks of stroke, cardiovascular disease and diabete…", "url": "https://www.cnn.com/2021/07/09/health/sleep-loss-harms-wellbeing-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708131949-stock-person-sleep-loss-super-tease.jpg", "publishedAt": "2021-07-09T16:27:21Z", "content": "(CNN)One night of sleep loss is enough to disrupt your day-to-day mental and physical well-being, according to a new study, and consecutive days of sleep loss can increase these negative impacts. \r\n\"… [+4576 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Liz Zack", "title": "The best smart exercise bikes of 2021", "description": "We tested smart bikes — indoor exercise equipment with a built-in screen to display and track cycling workouts — for months to find the best on the market.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-smart-exercise-bikes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709175345-smartbikes-lead-super-169.jpg", "publishedAt": "2021-07-09T16:22:24Z", "content": "Smart bikes indoor exercise equipment with a built-in screen to display and track cycling workouts arent exactly cheap. So to help you decide which machine is the best investment for you, we spent se… [+12506 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Mitch McConnell doesn't know the answer to the simplest question in the world", "description": "On Thursday, Mitch McConnell was asked about the sluggish Covid-19 vaccination rates among his fellow Kentuckians -- and why he believed it to be the case.", "url": "https://www.cnn.com/2021/07/09/politics/mitch-mcconnell-fox-news-donald-trump-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210202155426-mitch-mcconnell-for-bond-oped-super-tease.jpg", "publishedAt": "2021-07-09T16:19:00Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Daniel Toy", "title": "The best e-readers of 2021", "description": "Whether your home is crowded with too many books or you simply want to digitize your library to take with you on vacation, now's a great time to invest in an e-reader for your at-home and on-the-go reading pleasure. The displays are optimized for reading, and…", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-e-readers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708204036-ereaders-070821-lead-super-169.jpg", "publishedAt": "2021-07-09T16:00:54Z", "content": "Whether your home is crowded with too many books or you simply want to digitize your library to take with you on vacation, nows a great time to invest in an e-reader for your at-home and on-the-go re… [+9558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Toyin Owoseje, CNN", "title": "Why Delta Air Lines ditched its 'Queer Eye' safety video", "description": "US airline Delta has revealed that the pandemic not only disrupted the aviation industry but robbed its passengers of the chance to enjoy a \"Queer Eye\"-themed safety video.", "url": "https://www.cnn.com/travel/article/queer-eye-delta-airlines-video-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709085727-screengrab-delta-queer-eye-video-super-tease.jpg", "publishedAt": "2021-07-09T15:55:24Z", "content": "(CNN) US airline Delta has revealed that the pandemic not only disrupted the aviation industry but robbed its passengers of the chance to enjoy a \"Queer Eye\"-themed safety video.\r\nThe airline shared … [+1809 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Lead pipe replacement could be a big environmental win in bipartisan infrastructure deal", "description": "While some major climate provisions have been stripped out of a bipartisan infrastructure deal between the White House and a group of moderate senators, President Joe Biden's vow to replace all of the nation's lead pipes lines is a no-brainer, one of the pres…", "url": "https://www.cnn.com/2021/07/09/politics/lead-pipes-biden-infrastructure-epa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210331093852-04-infrastructure-proposal-super-tease.jpg", "publishedAt": "2021-07-09T15:45:28Z", "content": "(CNN)While some major climate provisions have been stripped out of a bipartisan infrastructure deal between the White House and a group of moderate senators, President Joe Biden's vow to replace all … [+4124 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "ICE issues new policy guidance discouraging detention of pregnant women", "description": "Immigration and Customs Enforcement has issued a new policy that states women known to be pregnant or nursing should not be detained, arrested or taken into custody unless release is prohibited, according to newly-released guidance.", "url": "https://www.cnn.com/2021/07/09/politics/immigration-detention-pregnant-women/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614185715-ice-hq-file-2018-super-tease.jpg", "publishedAt": "2021-07-09T15:34:43Z", "content": "(CNN)Immigration and Customs Enforcement has issued a new policy that states women known to be pregnant or nursing should not be detained, arrested or taken into custody unless release is prohibited,… [+2312 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Ly, CNN", "title": "Massachusetts files new hate crimes charges in stabbing of a rabbi, prosecutor says", "description": "A man accused of stabbing a rabbi in Boston's Brighton neighborhood was arraigned Thursday on new hate crime charges and has been ordered held without bail pending a \"dangerousness hearing\" later this month, says a news release from Suffolk County District At…", "url": "https://www.cnn.com/2021/07/09/us/rabbi-stabbing-hate-crime/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709074411-khaled-awad-brighton-boston-07-02-2021-super-tease.jpg", "publishedAt": "2021-07-09T15:33:25Z", "content": "(CNN)A man accused of stabbing a rabbi in Boston's Brighton neighborhood was arraigned Thursday on new hate crime charges and has been ordered held without bail pending a \"dangerousness hearing\" late… [+2204 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Lauren Fox, CNN", "title": "As fence comes down, Capitol Security forces face funding crunch", "description": "More than six months after the deadly Capitol insurrection, the final temporary security structure is coming down, but there are still plenty of concerns about how the campus will be protected going forward and if Capitol Police will have the resources they n…", "url": "https://www.cnn.com/2021/07/09/politics/fencing-removal-capitol-hill-security-fight/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115183809-washington-prep-capitol-razor-wire-super-tease.jpg", "publishedAt": "2021-07-09T15:16:13Z", "content": "(CNN)More than six months after the deadly Capitol insurrection, the final temporary security structure is coming down, but there are still plenty of concerns about how the campus will be protected g… [+1239 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alison Kosik, CNN", "title": "Toyota halts donations to Republicans who opposed election certification", "description": "Toyota said it would stop donating to Republican lawmakers who opposed certifying the 2020 presidential election results, after a political action committee called out the automaker's financial support for \"seditious politicians.\"", "url": "https://www.cnn.com/2021/07/09/cars/toyota-halts-donations-to-republicans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709105902-toyota-dealership-restricted-super-tease.jpg", "publishedAt": "2021-07-09T15:15:56Z", "content": "New York (CNN Business)Toyota said it would stop donating to Republican lawmakers who opposed certifying the 2020 presidential election results, after a political action committee called out the auto… [+1331 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone and Kristin Magaldi, CNN", "title": "The best sales to shop this weekend: Macy's, Reebok, Sur La Table and more", "description": "Today, you'll find a deal on Reebok apparel, a range of items at Macy's and savings at Sur La Table. All that and more below.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709104831-0709lead-super-169.jpg", "publishedAt": "2021-07-09T15:14:04Z", "content": "Today, youll find a deal on Reebok apparel, a range of items at Macys and savings at Sur La Table. All that and more below.\r\nMacys is giving you a taste of the most popular shopping holiday in July w… [+10084 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Everything you need to know about Richard Branson going to space this weekend", "description": null, "url": "https://www.cnn.com/2021/07/09/tech/richard-branson-virgin-galactic-space-flight-walkup-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708133230-02-vss-unity-virgin-galactic-file-2016-super-tease.jpg", "publishedAt": "2021-07-09T15:13:25Z", "content": "New York (CNN Business)Richard Branson will boldly go where no space baron has gone before on Sunday, when he steps onto the supersonic space plane from his rocket venture, Virgin Galactic.\r\nBranson'… [+7282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Mascarenhas, CNN", "title": "Updated CDC schools guidance prioritizes in-person learning, even if all Covid-19 safety measures aren't in place", "description": "The US Centers for Disease Control and Prevention on Friday updated its Covid-19 schools guidance to emphasize in-person schooling is a priority in the fall, regardless of whether all mitigation measures can be implemented. However, it remains important to la…", "url": "https://www.cnn.com/2021/07/09/health/cdc-covid-schools-guidance-update/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709104059-cdc-covid-schools-guidance-update-super-tease.jpg", "publishedAt": "2021-07-09T15:01:56Z", "content": "(CNN)The US Centers for Disease Control and Prevention on Friday updated its Covid-19 schools guidance to emphasize in-person schooling is a priority in the fall, regardless of whether all mitigation… [+2301 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, Kate Sullivan and Betsy Klein, CNN", "title": "Biden to target Big Tech and internet service providers with new executive order", "description": "President Joe Biden will sign a wide-ranging executive order on Friday aimed squarely at some of the most concentrated industries in America, including Internet service providers and Silicon Valley.", "url": "https://www.cnn.com/2021/07/09/politics/biden-big-tech-executive-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708143551-02-biden-afghanistan-remarks-0708-super-tease.jpg", "publishedAt": "2021-07-09T14:58:31Z", "content": "(CNN)President Joe Biden will sign a wide-ranging executive order on Friday aimed squarely at some of the most concentrated industries in America, including Internet service providers and Silicon Val… [+4452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The White Lotus' unpacks the staff-guest divide through the window of a luxury resort", "description": "If you're itching for a tropical vacation, \"The White Lotus\" might cool those jets. The latest product from the dark and twisty mind of Mike White (\"Enlightened\") deals with class in a way few recent TV productions have, in an edgy, engrossing six-part HBO li…", "url": "https://www.cnn.com/2021/07/09/entertainment/the-white-lotus-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707214125-02-the-white-lotus-super-tease.jpg", "publishedAt": "2021-07-09T14:13:49Z", "content": "(CNN)If you're itching for a tropical vacation, \"The White Lotus\" might cool those jets. The latest product from the dark and twisty mind of Mike White (\"Enlightened\") deals with class in a way few r… [+3569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards and Tanya Edwards", "title": "17 kitchen splurges that are actually worth it, according to experts", "description": "Whether you're looking to upgrade your kitchen with game-changing new tools, splurge on a gift for a foodie friend or just treat yourself to something new to cook with, we've rounded up 17 splurge-worthy kitchen tools for you to choose from.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/kitchen-products-worth-the-splurge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630080646-0708kitchensplurge-lead-super-169.jpg", "publishedAt": "2021-07-09T14:07:20Z", "content": "From pricey mixers to fancy dinnerware, its hard to know what products are actually worth the price and which arent. Whether were covering high-end juicers, or bestselling kitchen gadgets, we try to … [+8051 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Michael Andronico", "title": "Here's how rapper Mega Ran puts on awesome Twitch streams from home", "description": "Rapper and streamer Raheem \"Mega Ran\" Jarbo shows us the gear that allows him to put on awesome Twitch streams, and divulges some pro tips for folks looking to step up their content game.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/rapper-mega-ran/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709093257-mega-ran-influenced-lead-super-169.jpg", "publishedAt": "2021-07-09T14:01:36Z", "content": "Welcome to Influenced, where we interview creators of all kinds about the gear they use to do their job and their advice for aspiring influencers. This week, we caught up with Raheem Mega Ran Jarbo, … [+7005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster and Lauren Said-Moorhouse, CNN", "title": "Sunday's European football final will test Prince William", "description": "When the England football team sing the national anthem ahead of their Euro 2020 final against Italy on Sunday, Prince William will join in along with the rest of the crowd at Wembley, just as he has for other key games.", "url": "https://www.cnn.com/2021/07/09/uk/royal-news-newsletter-07-09-21-scli-gbr-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708133110-01-royal-newsletter-0709-super-tease.jpg", "publishedAt": "2021-07-09T13:53:05Z", "content": "A version of this story appeared in the July 9 edition of CNN's Royal News, a weekly dispatch bringing you the inside track on the royal family, what they are up to in public and what's happening beh… [+7174 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Bianca Pineda and Elizabeth Wallace", "title": "Upgrade your summer cocktail hour with these bar carts and accessories", "description": "Not only are bar carts space-saving, but they're versatile and portable so you can keep the party going no matter where you are in your home.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/best-bar-cart-ideas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708155734-bar-cart-ideas-1708-lead-super-169.jpg", "publishedAt": "2021-07-09T13:39:49Z", "content": "With summer comes longer days and, if youre like us, that means more time for pre-dinner cocktails (or mocktails!). For a killer at-home happy hour with friends, your bar cart setup can make a huge d… [+11491 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Fiona Tapp", "title": "Missing vacations? These products will make your bedroom feel like a hotel", "description": "Even if you can't travel, you can still treat yourself to luxury in your own home. Take notes from some of the best hotels in the world, and choose quality bedding, super soft towels, fluffy bathrobes and extras to make you feel like a VIP guest.", "url": "https://www.cnn.com/2021/07/09/cnn-underscored/canada-vacation-home-products/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210702090112-canada-vacation-products-lead-super-169.jpg", "publishedAt": "2021-07-09T13:24:50Z", "content": "International trips and vacations in exotic locations are off the table right now due to travel restrictions imposed during the Covid-19 lockdown, but you can still treat yourself to a little luxury … [+6630 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "Lionel Messi faces old friend Neymar in last bid for Copa America glory with Argentina", "description": "When Lionel Messi steps out onto the pitch for Saturday's Copa America final, it could be his last chance to win a trophy with Argentina.", "url": "https://edition.cnn.com/2021/07/09/football/copa-america-final-brazil-argentina-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709133959-messi-tease-super-tease.jpg", "publishedAt": "2021-07-09T12:43:35Z", "content": "167 cases of Covid-19 have been detected following 22 days of competition, according to CONMEBOL earlier this week\r\n 25,920 PCR tests have been conducted -- among players, delegation members, and ser… [+564 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Jill Biden travels the South to plead with hesitant Americans to get their Covid-19 vaccines", "description": "First lady Jill Biden is back on the road, heading to parts of the country disenchanted, disaffected and -- perhaps -- disbelieving of the benefits of Covid-19 vaccines.", "url": "https://www.cnn.com/2021/07/09/politics/jill-biden-southern-vaccine-push/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709081219-02-jill-biden-savannah-0708-super-tease.jpg", "publishedAt": "2021-07-09T12:40:56Z", "content": "Savannah, Georgia (CNN)First lady Jill Biden is back on the road, heading to parts of the country disenchanted, disaffected and -- perhaps -- disbelieving of the benefits of Covid-19 vaccines.\r\nBiden… [+5608 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Pfizer's Covid-19 booster and the latest on the pandemic", "description": "Pfizer says it's seeing waning immunity from its vaccine and is picking up efforts to develop a booster shot. Follow here for the latest updates on vaccines, variants and the global pandemic news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-07-09-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-07-09T12:33:46Z", "content": "Pfizer said Thursday it is seeing waning immunity from its coronavirus vaccine and says it is picking up its efforts to develop a booster dose that will protect people from variants.\r\nAs seen in real… [+2502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "How the American South is paying the price for Europe's 'green' energy - CNN", "description": "A growing industry pollutes American communities -- but an accounting method allows Europe to say the process is climate friendly", "url": "https://www.cnn.com/interactive/2021/07/us/american-south-biomass-energy-invs/", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706162337-01-north-carolina-biomass-invs-super-tease.jpg", "publishedAt": "2021-07-09T12:23:31Z", "content": "By Majlie de Puy Kamp, CNNPhotographs by Will Lanzoni, CNNVideo by Matthew Gannon, Demetrius Pipkin &amp; Nick Scott, CNN\r\nPublished July 9, 2021\r\nAndrea Macklin never turns off his TV. Its the only … [+27158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, CNN", "title": "McCarthy's management style tested by his conference's most extreme members", "description": "A key adviser to House Republican Leader Kevin McCarthy was involved in a behind-the-scenes effort last month to help rehabilitate the reputation of freshman Rep. Marjorie Taylor Greene, CNN has learned, discreetly facilitating her visit to the US Holocaust M…", "url": "https://www.cnn.com/2021/07/09/politics/kevin-mccarthy-conference-management/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210203111547-mccarthy-greene-split-super-tease.jpg", "publishedAt": "2021-07-09T11:22:38Z", "content": "(CNN)A key adviser to House Republican Leader Kevin McCarthy was involved in a behind-the-scenes effort last month to help rehabilitate the reputation of freshman Rep. Marjorie Taylor Greene, CNN has… [+8392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden administration will send 3 million vaccines to Indonesia amid Covid-19 surge", "description": "The White House will send three million doses of Moderna's coronavirus vaccine to Indonesia Friday, in what will amount to one of the largest single shipments yet, a White House official told CNN.", "url": "https://www.cnn.com/2021/07/09/politics/biden-vaccine-indonesia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201020163629-white-house-file-1004-super-tease.jpg", "publishedAt": "2021-07-09T11:12:53Z", "content": "(CNN)The White House will send three million doses of Moderna's coronavirus vaccine to Indonesia Friday, in what will amount to one of the largest single shipments yet, a White House official told CN… [+1221 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Police believe golf pro Gene Siller had no connection to the man suspected of killing him", "description": "Even after authorities arrested and charged a suspect in a triple homicide in which golf pro Gene Siller was killed at a north Georgia country club, many questions in the case remain.", "url": "https://www.cnn.com/2021/07/09/us/golf-pro-gene-siller-triple-homicide-suspect/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705103543-01-gene-siller-pro-golfer-shot-killed-georgia-golf-course-screengrab-super-tease.jpg", "publishedAt": "2021-07-09T10:48:54Z", "content": "(CNN)Even after authorities arrested and charged a suspect in a triple homicide in which golf pro Gene Siller was killed at a north Georgia country club, many questions in the case remain.\r\nBryan Ant… [+3145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill, CNN", "title": "$350M 'palace on rails' luxury train concept unveiled", "description": "French designer Thierry Gaugain plans to take the rail travel experience to a completely new level with his latest concept, a private luxury train made to measure for one lucky, and very wealthy, owner.", "url": "https://www.cnn.com/travel/article/worlds-first-private-luxury-train-concept/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707173016-palace-on-rails--g-train-in-the-desert-super-tease.jpg", "publishedAt": "2021-07-09T10:42:13Z", "content": "(CNN) Long distance rail travel looked like it could be on its way out just a few years ago, but a lot has changed then.\r\nThe classic style of traveling is now having something of a revival, as trave… [+5736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zeena Saifi and Becky Anderson, CNN", "title": "World Cup 2022: Ambitions of Qatar's grand project come with stark human cost", "description": "They're impossible to miss. On a drive around Qatar, at every turn, it seems, a new football stadium rises out of the desert -- each design offering a futuristic take on its traditional culture.", "url": "https://edition.cnn.com/2021/07/09/football/qatar-world-cup-2022-workers-rights-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705145233-04-qatar-world-cup-2022-workers-rights-super-tease.jpg", "publishedAt": "2021-07-09T10:39:41Z", "content": "First World Cup held in the Arab world\r\n First time the tournament is held in the winter \r\n Organizers say they are committed to delivering a carbon-neutral World Cup. \r\n FIFA estimates that one of t… [+455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for July 9: Covid-19, Haiti, voting rights, climate, condo collapse", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/07/09/us/five-things-july-9-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708003546-arkansas-vaccination-0425-restricted-super-tease.jpg", "publishedAt": "2021-07-09T10:24:09Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Giant pandas are no longer endangered, thanks to conservation efforts, China says", "description": "Giant pandas are no longer endangered, Chinese officials have said, after decades of work to save the creatures helped drive their population in the wild up to 1,800.", "url": "https://www.cnn.com/2021/07/09/asia/china-giant-pandas-endangered-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709050012-giant-panda-china-file-super-tease.jpg", "publishedAt": "2021-07-09T10:16:01Z", "content": "(CNN)Giant pandas are no longer endangered, Chinese officials have said, after decades of work to save the creatures helped drive their population in the wild up to 1,800.\r\nThe species will be re-cla… [+2078 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Katie Lobosco, CNN", "title": "Biden has canceled $1.5 billion in student debt for victims of for-profit school fraud", "description": "The Department of Education has canceled a total of $1.5 billion in student loan debt for nearly 92,000 students, who were victims of for-profit college fraud, since President Joe Biden took office.", "url": "https://www.cnn.com/2021/07/09/politics/biden-student-loan-debt-cancellation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200707101823-us-college-graduation-file-super-169.jpg", "publishedAt": "2021-07-09T10:01:03Z", "content": "The Department of Education has canceled a total of $1.5 billion in student loan debt for nearly 92,000 students, who were victims of for-profit college fraud, since President Joe Biden took office. … [+3137 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "Christian Pulisic under fire from animal rights group following stunt involving vulnerable species", "description": "Christian Pulisic has been criticized by conservationists for posting a video on Instagram of himself performing football tricks above a goliath grouper fish, before falling into the water and landing on top of the vulnerable marine species.", "url": "https://edition.cnn.com/2021/07/09/football/christian-pulisic-goliath-grouper-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707061908-03-christian-pulisic-screengrab-super-tease.jpg", "publishedAt": "2021-07-09T09:15:31Z", "content": "(CNN)Christian Pulisic has been criticized by conservationists for posting a video on Instagram of himself performing football tricks above a goliath grouper fish, before falling into the water and l… [+2419 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells, CNN", "title": "A man is dead and a woman injured after gunman opened fire on pair dining at a Houston restaurant", "description": "A man and a woman were finishing dinner at a restaurant at the Downtown Aquarium in Houston, Texas, Thursday night when a man seated at the other end of the bar got up, approached the pair and opened fire, officials said.", "url": "https://www.cnn.com/2021/07/09/us/houston-restaurant-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708211356-houston-aquarium-shooting-super-tease.jpg", "publishedAt": "2021-07-09T08:47:46Z", "content": "(CNN)A man and a woman were finishing dinner at a restaurant at the Downtown Aquarium in Houston, Texas, Thursday night when a man seated at the other end of the bar got up, approached the pair and o… [+1251 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Los Angeles County sees exponential growth in Covid-19 cases as Delta variant becomes dominant, worrying officials", "description": "Los Angeles County -- the most populous county in the US -- is seeing \"exponential growth\" of Covid-19 cases as Delta takes over as the dominant strain, according to local health officials.", "url": "https://www.cnn.com/2021/07/09/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708234812-us-coronavirus-friday-0709-super-tease.jpg", "publishedAt": "2021-07-09T08:06:09Z", "content": "(CNN)Los Angeles County -- the most populous county in the US -- is seeing \"exponential growth\" of Covid-19 cases as Delta takes over as the dominant strain, according to local health officials. \r\nTh… [+4936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "More than 50 million people under flash flood warnings as Tropical Storm Elsa moves up the East Coast", "description": "After walloping the Southeast, Tropical Storm Elsa is heading north and predicted to impact all major cities along the East Coast.", "url": "https://www.cnn.com/2021/07/09/weather/tropical-storm-elsa-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709014741-01-tropical-storm-elsa-friday-super-tease.jpg", "publishedAt": "2021-07-09T07:39:37Z", "content": "(CNN)After walloping the Southeast, Tropical Storm Elsa is heading north and predicted to impact all major cities along the East Coast.\r\nThe center of the storm will be over Dover, Delaware, early Fr… [+2915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Hu, Lionel Vital, Stefano Pozzebon and Helen Regan, CNN", "title": "Haiti assassination allegedly involved Americans and retired members of Colombian military, officials say", "description": "The armed group who assassinated Haiti's President, Jovenel Moise, were \"professional killers\" consisting of more than two dozen people, including two American citizens and retired members of the Colombian military, authorities have said.", "url": "https://www.cnn.com/2021/07/09/americas/haiti-moise-assassination-july-9-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708232552-01-haiti-moise-assassination-july-9-intl-hnk-super-tease.jpg", "publishedAt": "2021-07-09T07:17:09Z", "content": "Port-au-Prince, Haiti (CNN)The armed group who assassinated Haiti's President, Jovenel Moise, were \"professional killers\" consisting of more than two dozen people, including two American citizens and… [+7018 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David McKenzie, CNN", "title": "Southern Africa hoped it was through the worst of Covid-19. Then the Delta variant arrived", "description": "Patients are crammed into every corner of the hospital's emergency room ward. They lie on beds and gurneys, or sit slumped in wheelchairs. Many suck on oxygen, but nobody talks. Some die while waiting for a bed.", "url": "https://www.cnn.com/2021/07/09/africa/southern-africa-covid-delta-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708131651-zimbabwe-vaccination-0329-super-tease.jpg", "publishedAt": "2021-07-09T06:26:49Z", "content": "Johannesburg, South Africa (CNN)Patients are crammed into every corner of the hospital's emergency room ward. They lie on beds and gurneys, or sit slumped in wheelchairs. Many suck on oxygen, but nob… [+11776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Spanish, Lithuanian leaders' press conference interrupted by jet fighter scramble", "description": "A press conference of Spanish Prime Minister Pedro Sanchez and Lithuanian President Gitanas Nauseda at a Lithuanian air base was interrupted on Thursday when Spanish jets were scrambled to respond to the launch of a Russian warplane.", "url": "https://www.cnn.com/2021/07/09/europe/spain-lithuania-press-conference-fighter-scramble-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160714110432-eurofighter1-super-tease.jpg", "publishedAt": "2021-07-09T06:18:32Z", "content": "Vilnius, LithuaniaA press conference of Spanish Prime Minister Pedro Sanchez and Lithuanian President Gitanas Nauseda at a Lithuanian air base was interrupted on Thursday when Spanish jets were scram… [+891 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Crews will continue working in the Surfside rubble until every family's missing loved one is found, mayor says", "description": "Although authorities at the Surfside condo collapse site have lost hope of finding survivors in the rubble, they have not lost a commitment to recovering the 76 people still unaccounted for and reuniting them with their families, Surfside Mayor Charles Burket…", "url": "https://www.cnn.com/2021/07/09/us/miami-dade-building-collapse-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709000018-miami-dade-building-collapse-friday-0709-super-tease.jpg", "publishedAt": "2021-07-09T05:53:56Z", "content": "(CNN)Although authorities at the Surfside condo collapse site have lost hope of finding survivors in the rubble, they have not lost a commitment to recovering the 76 people still unaccounted for and … [+4946 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Westcott and Steven Jiang, CNN", "title": "China's LGBTQ community is fading from rainbow to gray", "description": "It's increasingly common worldwide for celebrities and high-profile sports stars to come out, often to widespread public support. But in China, women's soccer star Li Ying received a very different reaction.", "url": "https://www.cnn.com/2021/07/09/china/china-pride-month-lgbt-weibo-intl-mic-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190628160237-china-lgbt-rainbow-blinds-super-tease.jpg", "publishedAt": "2021-07-09T05:34:04Z", "content": "Hong KongEditor's note: CNN has launched the Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up … [+7725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Paula Newton, CNN", "title": "Canada will not open its border to non-essential visitors for quite a while, Trudeau says", "description": "Days after Canada dropped its quarantine requirement for fully vaccinated Canadians entering the country, Prime Minister Justin Trudeau rejected the idea that non-essential visitors will soon be allowed in.", "url": "https://www.cnn.com/travel/article/canada-covid-visitors-trudeau/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708233408-canada-covid-visitors-trudeau-super-tease.jpg", "publishedAt": "2021-07-09T05:17:18Z", "content": "(CNN) Days after Canada dropped its quarantine requirement for fully vaccinated Canadians entering the country, Prime Minister Justin Trudeau rejected the idea that non-essential visitors will soon b… [+1579 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Rafia Zakaria", "title": "Rachel Nichols' words confirm the fears faced by women of color", "description": "So many women of color face a terrible, nagging fear every day, at school or at work or in their everyday lives: that the White women who publicly profess their commitment to racial inclusion are only engaging in a pantomime. There is constant worry that in p…", "url": "https://www.cnn.com/2021/07/09/opinions/rachel-nichols-espn-zakaria/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150106164121-rachel-nichols-court-super-169.jpg", "publishedAt": "2021-07-09T04:10:01Z", "content": "Rafia Zakaria is a columnist for Dawn newspaper in Pakistan and The Baffler. She is the author of several books, including the forthcoming \"Against White Feminism: Notes of Disruption\" (W.W. Norton, … [+7042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The week in 36 photos", "description": "Take a look at 36 photos of the week from July 2 to July 8.", "url": "https://www.cnn.com/2021/07/08/world/gallery/photos-this-week-july-2-july-8/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708155741-18-photos-this-week-0709-super-tease.jpg", "publishedAt": "2021-07-09T02:57:24Z", "content": "Open Menu\r\nprevious image\r\nnext image\r\nA member of an Israeli search-and-rescue team salutes during a prayer ceremony held in front of the rubble that was once Champlain Towers South on Wednesday, Ju… [+8949 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN", "title": "How synesthesia helps artist Prince Gyasi turn his work into 'color therapy'", "description": "Creating emotive experiences through color comes naturally to Ghanaian Prince Gyasi, who wants his artwork to have a positive effect on its viewers.", "url": "https://www.cnn.com/style/article/prince-gyasi-ghana-photographer-visual-artist-hnk-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705065625-09b-prince-gyasi-photography-ghana-super-tease.jpg", "publishedAt": "2021-07-09T02:31:21Z", "content": "arts\r\nPaint, or pixels? That's the question that Prince Gyasi wants you to ask when you see his work. \r\n\"You should be confused whether it's a painting or a photograph,\" he said. \"If you're not confu… [+6322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "World's deepest pool, huge underwater city opens in Dubai", "description": "Already home to the world's tallest skyscraper and the world's largest mall, Dubai has just opened another record-breaking attraction -- the deepest dive pool in the world.", "url": "https://www.cnn.com/travel/article/deep-dive-dubai-worlds-deepest-dive-pool/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708161501-deep-dive-dubai-1-super-tease.jpg", "publishedAt": "2021-07-09T01:48:17Z", "content": "With a staggering depth of 60 meters (196 feet), the pool, part of the new Deep Dive Dubai attraction -- has stolen the record from Poland's Deepspot, which has a depth of over 45 meters. \r\nThe Deep … [+2553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Miguel Marquez, Meridith Edwards and Ray Sanchez, CNN", "title": "A Missouri couple say they dragged their feet on getting the Covid-19 vaccine. Then they got sick", "description": "Louie Michael and his wife, Pattie Bunch, were both hospitalized last month with Covid-19 in Springfield, Missouri.", "url": "https://www.cnn.com/2021/07/08/us/missouri-covid-surge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708212217-patty-and-louie-michael-bunch-super-tease.jpg", "publishedAt": "2021-07-09T01:24:33Z", "content": "Springfield, Missouri (CNN)Louie Michael and his wife, Pattie Bunch, were both hospitalized last month with Covid-19 in Springfield, Missouri.\r\nAn ambulance first had rushed her, with respiratory fai… [+7055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Sunlen Serfaty, CNN", "title": "White House helped form ethics agreement with art gallery that's selling Hunter Biden's paintings, sources say", "description": "Hunter Biden's artistic debut is sparking ethics concerns for the White House as some critics raise eyebrows over the high-priced pieces and whether they pose a conflict of interest.", "url": "https://www.cnn.com/2021/07/08/politics/hunter-biden-art-work-sale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708171703-hunter-biden-0522-super-tease.jpg", "publishedAt": "2021-07-09T00:47:15Z", "content": "(CNN)Hunter Biden's artistic debut is sparking ethics concerns for the White House as some critics raise eyebrows over the high-priced pieces and whether they pose a conflict of interest. \r\nSources t… [+5494 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Olympics 2021: NBC faces 'hell of a challenge' producing Tokyo Games after spectators are barred from competitions", "description": "NBC was presented with a new challenge producing the 2021 Olympic Games on Thursday after organizers said that spectators will be prohibited from the Tokyo venues, a move that eliminates a key component of live sports broadcasts and could give the competition…", "url": "https://www.cnn.com/2021/07/08/media/nbc-tokyo-olympics-spectators/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708194958-olympic-venue-0706-super-tease.jpg", "publishedAt": "2021-07-08T23:59:51Z", "content": "(CNN Business)NBC was presented with a new challenge producing the 2021 Olympic Games on Thursday after organizers said that spectators will be prohibited from the Tokyo venues, a move that eliminate… [+4122 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Arrest made in Georgia golf course killings", "description": "Cobb County Police Chief Tim Cox will host an 8 p.m. press conference on Thursday evening, in reference to an arrest of a suspect from the triple homicide on July 3 at the Pinetree Country Club, in which pro-golfer Gene Siller was killed, according to Cobb Co…", "url": "https://www.cnn.com/2021/07/08/us/arrest-made-triple-homicide-pinetree-country-club-gene-siller/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705103543-01-gene-siller-pro-golfer-shot-killed-georgia-golf-course-screengrab-super-tease.jpg", "publishedAt": "2021-07-08T22:57:58Z", "content": "(CNN)Cobb County Police Chief Tim Cox will host an 8 p.m. press conference on Thursday evening, in reference to an arrest of a suspect from the triple homicide on July 3 at the Pinetree Country Club,… [+1780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "A *very* unlikely leader of the Covid-19 vaccine push", "description": "In 2020, Donald Trump won West Virginia with 69% of the vote.", "url": "https://www.cnn.com/2021/07/08/politics/jim-justice-west-virginia-covid-19-vaccines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200428143738-jim-justice-super-tease.jpg", "publishedAt": "2021-07-08T22:30:52Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby and Daniella Diaz, CNN", "title": "Schumer, AOC push low-income families to register with IRS to receive expanded child tax credit payments", "description": "Low-income people should register for the expanded child tax credit with the Internal Revenue Service so they can receive up to $300 in monthly payments, which start July 15, Senate Majority Leader Chuck Schumer said Thursday.", "url": "https://www.cnn.com/2021/07/08/politics/child-tax-credit-low-income-families-registration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614160300-child-tax-credit-low-income-super-tease.jpg", "publishedAt": "2021-07-08T21:51:21Z", "content": "(CNN)Low-income people should register for the expanded child tax credit with the Internal Revenue Service so they can receive up to $300 in monthly payments, which start July 15, Senate Majority Lea… [+5101 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Let it brie: Inside Wisconsin's fight for an 'official' cheese", "description": "Quick, what's the first thing you think of when someone says \"Wisconsin?\"", "url": "https://www.cnn.com/2021/07/08/politics/wisconsin-cheese-official-state-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/120307122501-dnt-wi-cheesehead-honor-00010502-story-top.jpg", "publishedAt": "2021-07-08T21:33:01Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Jamie Spears says in new court filing that he and other family members have received death threats", "description": "Britney Spears' father, Jamie Spears, states in a new court filing that he and other family members have received death threats as a result of the legal battle surrounding the singer's nearly 13-year conservatorship.", "url": "https://www.cnn.com/2021/07/08/entertainment/jamie-spears-death-threats/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210209123502-jamie-spears-britney-father-2008-super-tease.jpg", "publishedAt": "2021-07-08T21:29:31Z", "content": "(CNN)Britney Spears' father, Jamie Spears, states in a new court filing that he and other family members have received death threats as a result of the legal battle surrounding the singer's nearly 13… [+1721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "9 million student loan borrowers will soon be getting a new servicer. Here's why", "description": "About 9 million people with federal student loans will start getting their bills from a new agency after one of the government's biggest servicers said Thursday that it will end its contract with the Department of Education in December.", "url": "https://www.cnn.com/2021/07/08/politics/federal-student-loan-servicing-contract-pheaa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200707101823-us-college-graduation-file-super-tease.jpg", "publishedAt": "2021-07-08T21:20:11Z", "content": "Washington (CNN)About 9 million people with federal student loans will start getting their bills from a new agency after one of the government's biggest servicers said Thursday that it will end its c… [+3310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Coronavirus variants: Here's what we know", "description": "The Delta variant of coronavirus is now the dominant lineage in the US, parts of Europe and elsewhere.", "url": "https://www.cnn.com/2021/07/08/health/variants-coronavirus-whats-known-update/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708164726-social-distancing-sign-0704-sydney-restricted-super-tease.jpg", "publishedAt": "2021-07-08T21:19:43Z", "content": "(CNN)The Delta variant of coronavirus is now the dominant lineage in the US, parts of Europe and elsewhere.\r\nAlso known as B.1.617.2, it is clearly more transmissible, but it is unclear if it causes … [+7170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Wallace and Pete Muntean, CNN", "title": "TSA found 70 guns at checkpoints over July 4th weekend", "description": "The number of guns found at airport checkpoints nationwide this year is fast approaching the number caught in all of 2020, officials say, and the uptick is slowing down screening lines as masses of passengers return to air travel.", "url": "https://www.cnn.com/2021/07/08/politics/tsa-guns-checkpoint-july-4-weekend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200211015557-tsa-uniform-file-super-tease.jpg", "publishedAt": "2021-07-08T21:10:51Z", "content": "(CNN)The number of guns found at airport checkpoints nationwide this year is fast approaching the number caught in all of 2020, officials say, and the uptick is slowing down screening lines as masses… [+2503 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, Martin Savidge and Angela Barajas, CNN", "title": "Their children vanished at an Indigenous boarding school. This tribe is bringing them home after 140 years", "description": "Rose Long Face was 18 years old when she was taken to the first government-run boarding school for Indigenous children in the United States. Within two years, she died and never returned home.", "url": "https://www.cnn.com/2021/07/08/us/indigenous-boarding-schools-rosebud-sioux-repatriation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623120749-01-carlisle-indian-industrial-school-remains-exhumed-super-tease.jpg", "publishedAt": "2021-07-08T21:10:36Z", "content": "Rosebud, South Dakota (CNN)Rose Long Face was 18 years old when she was taken to the first government-run boarding school for Indigenous children in the United States. Within two years, she died and … [+6722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Stellantis just made an 'aggressive' $35.5 billion commitment to electric vehicles", "description": "Stellantis, the giant automaker formed by the merger of Fiat Chrysler Automobiles and France's PSA, plans to invest €30 billion, or $35.5 billion, by the end of 2025 to expand its portfolio of electrified vehicles.", "url": "https://www.cnn.com/2021/07/08/cars/stellantis-electric-vehicle-investment-strategy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708144028-02-stellantis-electric-vehicle-strategy-super-tease.jpg", "publishedAt": "2021-07-08T21:05:47Z", "content": "(CNN)Stellantis, the giant automaker formed by the merger of Fiat Chrysler Automobiles and France's PSA, plans to invest €30 billion, or $35.5 billion, by the end of 2025 to expand its portfolio of e… [+4081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kyung Lah, CNN", "title": "AZ secretary of state asks for probe into whether Trump and allies tried to interfere in election results", "description": "Arizona Secretary of State Katie Hobbs wants the state attorney general to investigate whether allies of former President Donald Trump violated state laws by conducting a pressure campaign against county officials in the wake of the November 2020 election.", "url": "https://www.cnn.com/2021/07/08/politics/arizona-secretary-of-state-letter-2020-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210603205844-katie-hobbs-lah-dnt-super-tease.jpg", "publishedAt": "2021-07-08T20:46:26Z", "content": "(CNN)Arizona Secretary of State Katie Hobbs wants the state attorney general to investigate whether allies of former President Donald Trump violated state laws by conducting a pressure campaign again… [+3982 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianna Cerini, CNN", "title": "'Gossip Girl' and 5 more recommendations for some serious teen drama", "description": "\"Did you miss me?\" Kristen Bell's voice asks, almost threateningly, in the trailer of the new \"Gossip Girl.\" \"I know I have missed you.\"", "url": "https://www.cnn.com/style/article/gossip-girl-reboot-culture-queue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708093616-03-gossip-girl-hbo-max-super-tease.jpg", "publishedAt": "2021-07-08T20:17:33Z", "content": "arts\r\nKeeping you in the know, Culture Queue is an ongoing series of recommendations for timely books to read, films to watch and podcasts and music to listen to.\r\n\"Did you miss me?\" Kristen Bell's v… [+9003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "It's 'inescapable': Pacific Islanders have tried to flee the climate crisis, only to face new threats", "description": "Many Pacific Islanders have moved to the Western US, where climate change is appearing in different — though just as devastating — ways.", "url": "https://www.cnn.com/2021/07/08/us/pacific-islands-climate-change-refugees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708125519-0708-pacificislandclimatemigration3-super-tease.jpg", "publishedAt": "2021-07-08T20:09:45Z", "content": "(CNN)Selina Neirok Leem grew up listening to the Pacific Ocean at her home on the Marshall Islands. She watched high tides wash over the islands' seawalls, and her family trekked inland when the stor… [+6778 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Wojazer, CNN", "title": "Lil Baby in police custody in Paris, James Harden stopped by the police", "description": "Lil Baby, an American musician and rapper with a string of collaborative hits, and another individual are in police custody in France, suspected of transport of illicit drugs, the Paris prosecutor's office told CNN on Thursday.", "url": "https://www.cnn.com/2021/07/08/entertainment/lil-baby-paris/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708125438-lil-baby-super-tease.jpg", "publishedAt": "2021-07-08T20:06:14Z", "content": "(CNN)Lil Baby, an American musician and rapper with a string of collaborative hits, and another individual are in police custody in France, suspected of transport of illicit drugs, the Paris prosecut… [+583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Frater and Mia Alberti, CNN", "title": "European Union urged to punish Hungary over law criticized as homophobic", "description": "On Thursday the European Parliament condemned in the \"strongest possible terms\" a new law in Hungary which many critics say is homophobic, and urged the European Commission to impose punitive measures such as budget cuts.", "url": "https://www.cnn.com/2021/07/08/europe/european-lawmakers-condemn-hungary-law-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708145143-hungary-lgbt-protest-super-tease.jpg", "publishedAt": "2021-07-08T19:08:17Z", "content": "(CNN)On Thursday the European Parliament condemned in the \"strongest possible terms\" a new law in Hungary which many critics say is homophobic, and urged the European Commission to impose punitive me… [+2542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Democratic Senate candidates show fundraising strength in early 2nd quarter numbers", "description": "A series of Democratic Senate candidates announced substantial fundraising hauls this week, putting each campaign in strong financial positions ahead of races that will be critical to the Biden administration's goals.", "url": "https://www.cnn.com/2021/07/08/politics/democratic-senate-candidates-fundraising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201106112420-mark-kelly-az-1103-super-tease.jpg", "publishedAt": "2021-07-08T18:43:38Z", "content": "(CNN)A series of Democratic Senate candidates announced substantial fundraising hauls this week, putting each campaign in strong financial positions ahead of races that will be critical to the Biden … [+3360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez, CNN", "title": "Minnesota prosecutors ask judge in Derek Chauvin's trial to amend memo that downplayed witnesses' trauma", "description": "When Judge Peter Cahill sentenced former Minneapolis Police officer Derek Chauvin to 22.5 years in prison last month for the murder of George Floyd, the judge cited two aggravating factors for going above the recommended sentence of 12.5 years.", "url": "https://www.cnn.com/2021/07/08/us/derek-chauvin-judge-trauma/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625180924-derek-chauvin-judge-sentencing-split-super-tease.jpg", "publishedAt": "2021-07-08T18:42:36Z", "content": "(CNN)When Judge Peter Cahill sentenced former Minneapolis Police officer Derek Chauvin to 22.5 years in prison last month for the murder of George Floyd, the judge cited two aggravating factors for g… [+5012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "8 pivotal moments from NASA's Space Shuttle Program", "description": "July 8 marks one decade since the last NASA space shuttle flight launched. Here are eight pivotal moments from the space shuttle era.", "url": "https://www.cnn.com/2021/07/08/us/nasa-space-shuttle-pivotal-moments-anniversary-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708120008-07-nasa-space-shuttle-moments-scn-super-tease.jpg", "publishedAt": "2021-07-08T18:12:25Z", "content": "(CNN)Today through July 21 marks one decade since the last NASA space shuttle flight, with the Atlantis shuttle launching on July 8, 2011, to spend 13 days partly delivering supplies to the Internati… [+4160 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Black Widow' feels like Marvel's version of a Jason Bourne movie", "description": "\"Black Widow\" has crisp kinetic energy mixed with superhero-style pyrotechnics. Yet what really defines the film is meeting the title character's other \"family,\" whose members are equal parts colorfully eccentric and lethal.", "url": "https://www.cnn.com/2021/07/08/entertainment/black-widow-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210701123605-02-black-widow-movie-super-tease.jpg", "publishedAt": "2021-07-08T17:56:25Z", "content": "(CNN)\"Black Widow\" finally reaches screens big and small after a delay of more than 14 months, during which time Marvel's banner has been carried via streaming on Disney+. While that stretch has like… [+3467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jason Cipriani", "title": "The best video doorbells of 2021", "description": "Video doorbells offer a simple starting point for those interested in smart home security, and offer a little extra peace of mind for anyone anxious about unwanted visitors or stolen packages. For the last few weeks we've been testing an assortment of video d…", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/best-video-doorbell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708132540-final-best-video-doorbell-leads-super-169.jpg", "publishedAt": "2021-07-08T17:27:18Z", "content": "Video doorbells offer a simple starting point for those interested in smart home security, and offer a little extra peace of mind for anyone anxious about unwanted visitors or stolen packages. For th… [+18141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, Kate Bennett and Betsy Klein, CNN", "title": "First lady Jill Biden's team 'assessing the feasibility' of attending the Tokyo Olympics", "description": "First lady Jill Biden's team is still assessing whether it's feasible for her to attend the Olympics in Tokyo after Japan's Olympics Committee announced all spectators will be banned from the venues of the Games in the host city and the nation declared a stat…", "url": "https://www.cnn.com/2021/07/08/politics/jill-biden-tokyo-olympics/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210428181646-03-jill-biden-first-100-days-super-tease.jpg", "publishedAt": "2021-07-08T17:17:43Z", "content": "(CNN)First lady Jill Biden's team is still assessing whether it's feasible for her to attend the Olympics in Tokyo after Japan's Olympics Committee announced all spectators will be banned from the ve… [+2077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leyla Santiago, Sara Weisfeldt and Dakin Andone, CNN", "title": "'The lack of survivors' has been the hardest part of condo collapse search operation, captain says", "description": "Authorities continue to work around the clock in Surfside, Florida, searching for victims in the rubble of a collapsed condo, even as authorities have shifted from a rescue operation to a recovery effort.", "url": "https://www.cnn.com/2021/07/08/us/florida-search-and-recovery-captain-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708005647-02-surfside-memorial-0707-super-tease.jpg", "publishedAt": "2021-07-08T17:08:58Z", "content": "(CNN)Authorities continue to work around the clock in Surfside, Florida, searching for victims in the rubble of a collapsed condo, even as authorities have shifted from a rescue operation to a recove… [+3421 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "DOJ charges 5 Floridians accused of attacking 7 police officers during Capitol insurrection", "description": "The Justice Department unveiled a major indictment Thursday against five Floridians accused of attacking at least seven police officers during the US Capitol insurrection.", "url": "https://www.cnn.com/2021/07/08/politics/capitol-insurrection-charges-floridians-attacking-police-officers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2021-07-08T16:58:16Z", "content": "(CNN)The Justice Department unveiled a major indictment Thursday against five Floridians accused of attacking at least seven police officers during the US Capitol insurrection.\r\nProsecutors say the d… [+2618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, Jennifer Hansler, Nicole Gaouette and Barbara Starr, CNN", "title": "Biden has just a few weeks left to make key decisions that will shape the future of Afghanistan", "description": "With the Taliban advancing across rural parts of Afghanistan, and criticism mounting over what some view as an overly hasty departure, the Biden administration is staring down a few short weeks to make a handful of critical decisions it's put off until the la…", "url": "https://www.cnn.com/2021/07/08/politics/afghanistan-withdrawal-biden-crucial-decisions-last-minute/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705123633-02-bagram-air-base-0705-super-tease.jpg", "publishedAt": "2021-07-08T16:30:28Z", "content": "Washington (CNN)With the Taliban advancing across rural parts of Afghanistan, and criticism mounting over what some view as an overly hasty departure, the Biden administration is staring down a few s… [+9046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "House candidates declare campaigns for districts that don't exist yet amid redistricting delays", "description": "Loretta Smith and Wesley Hunt are members of different parties, separated by both distance and policy.", "url": "https://www.cnn.com/2021/07/08/politics/house-candidates-redistricting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708115613-diemer-hunt-smith-zinke-split-super-tease.jpg", "publishedAt": "2021-07-08T16:17:10Z", "content": "(CNN)Loretta Smith and Wesley Hunt are members of different parties, separated by both distance and policy.\r\nAnd yet, Smith, an Oregon Democrat, and Hunt, a Texas Republican, find themselves in simil… [+7088 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "The latest on voting rights in the US", "description": "The Biden administration is spotlighting voting rights today, as the Texas state legislature holds a special session to mount another push for restrictive new voting laws. Follow here for the latest.", "url": "https://www.cnn.com/politics/live-news/biden-harris-texas-voting-rights-07-08-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630164116-voters-file-super-tease.jpg", "publishedAt": "2021-07-08T15:40:49Z", "content": "President Biden and Vice President Kamala Harris will hold separate events Thursday to focus attention on Democratic efforts to combat voter suppression and protect voting rights nationwide, Democrat… [+1981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jeffrey Sachs", "title": "Climate change is about greed. It's time for big oil to pay us back", "description": "Jeffrey Sachs writes that America still has a chance to save itself from the dangers of climate change. President Joe Biden's plans to build a new 21st-century infrastructure based on renewable energy, electric vehicles, and other zero-carbon technologies is …", "url": "https://www.cnn.com/2021/07/08/opinions/biden-climate-corporate-greed-infrastructure-sachs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628195221-02-heatwave-0726-super-tease.jpg", "publishedAt": "2021-07-08T15:40:10Z", "content": "Jeffrey Sachs is a professor and director of the Center for Sustainable Development at Columbia University and president of the United Nations Sustainable Development Solutions Network. His most rece… [+7602 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Noah Coburn and Sediq Seddiqi", "title": "Afghans who aided US forces now desperately need help in return", "description": "As the troops withdraw, there is much that the US can do to support the Afghans who remain -- diplomatically and through financial support, write Noah Coburn and Sediq Seddiqi.", "url": "https://www.cnn.com/2021/07/08/opinions/afghans-aided-us-need-help-opinion-coburn-seddiqi/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180611100908-01-afghan-translators-petition-file-super-169.jpg", "publishedAt": "2021-07-08T15:31:58Z", "content": "Editors Note: Noah Coburn is a political anthropologist at Bennington College. Sediq Seddiqi is an Afghan social scientist and researcher with Assess Transform Reach Consulting. The views expressed i… [+6472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Analysis: 2 maps show partisanship poisoning the Covid fight", "description": "This is a map of the 2020 Electoral College results.", "url": "https://www.cnn.com/2021/07/08/politics/electoral-map-vaccine-map-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201214064358-12---14-electoral-college-voting-day-t1-map-super-tease.png", "publishedAt": "2021-07-08T15:23:55Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone and Kristin Magaldi, CNN", "title": "The best sales to shop today: Columbia, Ruggable, Cricut and more", "description": "Today, you'll find a deal on our favorite nonstick pan, a discounted Vitamix FoodCycler and savings on Columbia apparel. All that and more below.", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708105928-0708dealslead-super-169.jpg", "publishedAt": "2021-07-08T15:08:14Z", "content": "Today, youll find a deal on our favorite nonstick pan, a discounted Vitamix FoodCycler and savings on Columbia apparel. All that and more below.\r\nSummer weather has officially arrived, but theres sti… [+9169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta and Zahid Mahmood, CNN", "title": "Huge 1,174-carat diamond unearthed in Botswana", "description": "An enormous 1,174-carat diamond has been unearthed in Botswana, a mining company has said, the second massive diamond to be found in the country in the space of a few weeks.", "url": "https://www.cnn.com/style/article/botswana-diamond-unearthed-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708083248-01-botswana-diamond-unveiling-07-07-2021-super-tease.jpg", "publishedAt": "2021-07-08T14:42:31Z", "content": "An enormous 1,174-carat diamond has been unearthed in Botswana, a mining company has said, the second massive diamond to be found in the country in the space of a few weeks.\r\nThe rare rock was recove… [+1322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Noelle Ike", "title": "29 stylist-approved summer fashion finds at Amazon", "description": "Amazon is home to high-quality apparel basics, trendy accessories, and everything in between. Ahead, we've rounded up 29 stylist-approved or top-rated summer fashion finds, all available on Amazon right now.", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/amazon-fashion-finds-for-summer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706140653-amazon-fashion-finds-for-summer-lead-super-169.jpg", "publishedAt": "2021-07-08T14:30:16Z", "content": "Summer is in full swing, and theres no better time to evaluate your warm weather wardrobe. Bright colors, fun patterns and comfortable fabrics are all summer style staples that we cant get enough of.… [+11491 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Krystin Arneson", "title": "Away just added a ton of great bags to its collection", "description": "Away is known for its Instagram-worthy suitcases and carry-on bags — plus, of course, its line of hyper-organized totes and travel accessories. The luggage company has just added four new travel accessories to its line.", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/away-bags-accessories-launch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708102443-away-lead-super-169.jpg", "publishedAt": "2021-07-08T14:25:39Z", "content": "Away is known for its Instagram-worthy suitcases and carry-on bags plus, of course, its line of hyper-organized totes and travel accessories. And just in time for (vaccinated!) summer travel, the lug… [+2209 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kate Bratskeir", "title": "Our Place sets out to simplify meal prep with its new knives and cutting board", "description": "Our Place recently launched three beautiful chef's knives and a sturdy cutting board to go along with them. You can purchase each of the four products individually, or you can take advantage of the Fully Prepped Bundle, which will save you $35 total.", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/our-place-cutting-board-kitchen-knives-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706085108-our-place-knives-lead-super-169.jpg", "publishedAt": "2021-07-08T14:12:28Z", "content": "Our Place, the makers of that iconic, so-called kitchen magician Always Pan, recently launched three beautiful chefs knives and a sturdy cutting board to go along with them. You can purchase each of … [+8855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lesley Kennedy", "title": "20 of the most anticipated new books to read this July", "description": "Looking to read more this summer? We've rounded up 20 new July book releases to add to your reading lists now, all available to purchase or preorder on Amazon.", "url": "https://www.cnn.com/2021/07/08/cnn-underscored/best-books-july-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629160325-julybookslead-super-169.jpg", "publishedAt": "2021-07-08T14:01:20Z", "content": "Looking for a way to fill some of that July vacation time you finally have coming to you? Whether youre into rom-coms, true crime, edge-of-your-seat thrillers, historical fiction, memoirs or poetry, … [+7208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Scarlett Johansson explains how 'Black Widow' became Marvel's #MeToo movie", "description": "Scarlett Johansson says her highly anticipated movie \"Black Widow\" began to really take shape in 2017, amid the #MeToo movement.", "url": "https://www.cnn.com/2021/07/08/entertainment/scarlett-johansson-black-widow-metoo-movie-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629135011-black-widow-scarlett-johansson-super-tease.jpg", "publishedAt": "2021-07-08T13:58:16Z", "content": "(CNN)Scarlett Johansson says her highly anticipated movie \"Black Widow\" began to really take shape in 2017, amid the #MeToo movement.\r\nJohansson said in a new interview with Yahoo that she and the sc… [+1335 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Vanessa Kummer", "title": "Farmers like me want to join fight against climate change. But we need help", "description": "Vanessa Kummer says that sustainable farming is in the best interest of farmers because it's good for their bottom lines and for ensuring the land's viability for future generations, which makes giving farmers more funding a key to helping fight climate chang…", "url": "https://www.cnn.com/2021/07/08/opinions/farmers-climate-change-fight-support-kummer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625173037-16-western-drought-heat-super-tease.jpg", "publishedAt": "2021-07-08T13:56:38Z", "content": "Vanessa Kummer is a farmer from Colfax, North Dakota. She is a Farmer Ambassador with Farm Journal Foundation and a former chairperson of the United Soybean Board. The opinions expressed in this comm… [+6573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeevan Ravindran, CNN", "title": "A wildfire has destroyed 90% of this town. Indigenous communities have been hit the hardest", "description": "Lytton, Canada has long been home to the indigenous Nlaka'pamux community but has now been destroyed by a devastating wildfire. As they come to terms with this loss, the people feel betrayed by the government's inaction -- and they want answers.", "url": "https://www.cnn.com/2021/07/08/americas/canada-lytton-wildfire-climate-change-indigenous-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706162706-02-lytton-canada-wildfire-super-tease.jpg", "publishedAt": "2021-07-08T13:53:34Z", "content": "(CNN)Schoolteacher Katrina Sam has lived in Lytton in the Canadian province of British Columbia all her life, but a week after a disastrous wildfire, the town she grew up in is almost entirely gone.\r… [+10761 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Rabah Arezki and Per Magnus Nysveen for CNN Business Perspectives", "title": "The beginning of the end for Big Oil", "description": "After a pandemic and a price war sent petroleum prices tumbling in 2020, they are again on the rise. A new oil price super cycle -- an extended period during which prices exceed their long-term trend -- seems to be in the making.", "url": "https://www.cnn.com/2021/07/08/perspectives/imf-oil-industry/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707155033-oil-pump-russia-restricted-super-tease.jpg", "publishedAt": "2021-07-08T13:23:13Z", "content": "This article has been edited from its original version. It was originally published in its entirety in the International Monetary Fund's Summer 2021 issue of Finance &amp; Development magazine. Rabah… [+7437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, Elise Hammond and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Tokyo Olympic venues won't have spectators", "description": "Tokyo venues for Olympics will not have spectators as Japan battles the Covid-19 pandemic. Follow here for the latest.", "url": "https://www.cnn.com/asia/live-news/tokyo-summer-olympics-07-08-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708055514-01-tokyo-state-of-emergency-olympics-spt-intl-super-tease.jpg", "publishedAt": "2021-07-08T13:22:46Z", "content": "Tokyo venues for summer Olympics will not have spectators.\r\nEarlier today, Japanese Prime Minister Yoshide Suga confirmed the pandemic-delayed Tokyo 2020 Olympics will take place under a coronavirus … [+18 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan, Adrienne Broaddus and Keith Allen, CNN", "title": "Man arrested after guns were found in his Chicago hotel room. The mayor called them 'weapons of war'", "description": "An Iowa man is facing two felony charges after a loaded handgun and rifle were found in his Chicago hotel room July 4, near where hundreds of families were celebrating the holiday, prosecutors said.", "url": "https://www.cnn.com/2021/07/08/us/keegan-casteel-chicago-hotel-weapons-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708014905-keegan-casteel-super-tease.jpg", "publishedAt": "2021-07-08T13:15:39Z", "content": "(CNN)An Iowa man is facing two felony charges after a loaded handgun and rifle were found in his Chicago hotel room July 4, near where hundreds of families were celebrating the holiday, prosecutors s… [+2452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna and Amanda Watts, CNN", "title": "A 12-foot Burmese python missing from a mall aquarium has been found", "description": "Breathe easy, python fans: The search for Cara, a 12-foot serpent on the loose from her Louisiana mall aquarium exhibit, has ended happily.", "url": "https://www.cnn.com/2021/07/08/us/missing-python-found-louisiana-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707164757-louisiana-python-escape-file-super-tease.jpg", "publishedAt": "2021-07-08T13:03:22Z", "content": "(CNN)Breathe easy, python fans: The search for Cara, a 12-foot serpent on the loose from her Louisiana mall aquarium exhibit, has ended happily.\r\nCara, a yellow Burmese python, was found \"safe and he… [+1650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN", "title": "Haiti's president assassinated", "description": "Haiti's President Jovenel Moise was assassinated yesterday, plunging a country already gripped by rising poverty and violence into further uncertainty. Follow here for the latest.", "url": "https://www.cnn.com/americas/live-news/haiti-president-jovenel-moise-assassinated-07-08-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707173013-presidente-haiti-super-tease.jpg", "publishedAt": "2021-07-08T12:59:26Z", "content": "Haiti was in turmoil Thursday as police hunted for the suspects behind the assassination of its president and questions swirled over who would take charge of the impoverished Caribbean nation.\r\nFour … [+1239 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta and Denis Lapin, CNN", "title": "Ukraine to give female soldiers 'more comfortable' heels after sexism controversy", "description": "Ukraine's Ministry of Defense has said it will give female soldiers \"more comfortable\" heels with a different kind of lacing, following a sexism outcry over its decision to train troops to march in high heeled footwear.", "url": "https://www.cnn.com/2021/07/08/europe/ukraine-female-soldiers-new-heels-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705072545-ukraine-female-soldiers-heels-scli-intl-super-tease.jpg", "publishedAt": "2021-07-08T12:34:04Z", "content": "(CNN)Ukraine's Ministry of Defense has said it will give female soldiers \"more comfortable\" heels with a different kind of lacing, following a sexism outcry over its decision to train troops to march… [+2068 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Shalini Shankar", "title": "This year's National Spelling Bee is an amazing opportunity", "description": "Shalini Shankar celebrates the 2021 return of the Scripps National Spelling Bee and notes that while the finals may seem like a return to normal, pandemic measures taken to get there should be a catalyst for considering more enduring innovations that could pr…", "url": "https://www.cnn.com/2021/07/08/opinions/scripps-national-spelling-bee-equity-shankar/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707234737-scripps-national-spelling-bee-file-2019-super-tease.jpg", "publishedAt": "2021-07-08T12:18:25Z", "content": "Shalini Shankar is the author of \"Beeline: What Spelling Bees Reveal About Generation Z's New Path to Success\" and a professor of anthropology and Asian American studies at Northwestern University. T… [+7467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Extreme heat wave 'virtually impossible' without humans causing climate change, study finds", "description": "Hundreds dead in a historic heat wave. A Canadian village burned to the ground. Water shortages. Animals competing for food.", "url": "https://www.cnn.com/2021/07/08/weather/climate-change-extreme-heat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708053634-03-climate-change-extreme-heat-super-tease.jpg", "publishedAt": "2021-07-08T12:15:10Z", "content": "(CNN)Hundreds dead in a historic heat wave. A Canadian village burned to the ground. Water shortages. Animals competing for food. \r\nThe culprit? Humans, according to climate change scientists.\r\nThe h… [+4595 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Vanessa Yurkevich, CNN Business", "title": "America desperately needs 1 million more construction workers", "description": "Matthew Messer hauls solar panels on the roof of a home in Long Island, New York, hoisting them one by one in the 100-degree June heat. Messer is the owner of New York Solar Maintenance, but these days he's working right alongside his lead technician seven da…", "url": "https://www.cnn.com/2021/07/08/economy/construction-worker-shortage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210707085400-construction-worker-shortage-restricted-super-tease.jpg", "publishedAt": "2021-07-08T12:10:53Z", "content": "New York (CNN Business)Matthew Messer hauls solar panels on the roof of a home in Long Island, New York, hoisting them one by one in the 100-degree June heat. Messer is the owner of New York Solar Ma… [+4893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "She flew from Australia to England for a first date", "description": "Aussie Sara connected with UK student Laura on Twitter and they hit it off. After several months of non-stop chatting, Sara took a leap of faith and booked a plane ticket to London to meet Laura in person. Here's what happened next.", "url": "https://www.cnn.com/travel/article/laura-sara-australia-uk-twitter-romance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210708064236-laura-and-sara-tease-super-tease.jpg", "publishedAt": "2021-07-08T11:25:02Z", "content": "(CNN) British college student Laura was scrolling through social media one day in 2014, when a Tweet caught her eye, and changed her life.\r\nOne of her favorite Twitter accounts, which posted updates … [+14333 chars]"}]}