{"status": "ok", "totalResults": 192, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "Texas GOP consolidates power in new congressional maps as Senate again fails to act on voting rights", "description": "With Texas Republicans bolstering their congressional majorities in new maps they approved this week, Senate Republicans in Washington, DC, on Wednesday blocked yet another voting rights bill that would crack down on those kinds of gerrymanders.", "url": "https://www.cnn.com/2021/10/20/politics/texas-redistricting-senate-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210919091636-01b-austin-texas-state-capitol-07-08-2021-super-tease.jpg", "publishedAt": "2021-10-20T23:47:01Z", "content": "(CNN)With Texas Republicans bolstering their congressional majorities in new maps they approved this week, Senate Republicans in Washington, DC, on Wednesday blocked yet another voting rights bill th… [+8221 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by David Shortell and Stephen Collinson, CNN", "title": "The Amish country headquarters of the US missionaries kidnapped in Haiti", "description": "Missionary leaders from Christian Aid Ministries in Haiti likely feel at least a little at home in that island country's famous mountains — the streets of Millersburg, Ohio, a small community in the heart of the state's Amish country where the aid organizatio…", "url": "https://www.cnn.com/2021/10/20/world/meanwhile-in-america-october-20-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020191600-millersburg-ohio-super-tease.jpg", "publishedAt": "2021-10-20T23:43:24Z", "content": "This story was excerpted from the October 20 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)Missio… [+4235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden pitches unfinished economic agenda in personal hometown remarks", "description": "President Joe Biden made a pitch for his unfinished economic agenda as negotiations heat up in Congress, broadly touting its provisions as Democrats pare back the sweeping legislation to expand the social safety net in efforts to get it passed.", "url": "https://www.cnn.com/2021/10/20/politics/joe-biden-scranton-pennsylvania/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020183910-bifen-scranton-1020-super-tease.jpg", "publishedAt": "2021-10-20T22:55:54Z", "content": "Scranton, Pennsylvania (CNN)President Joe Biden made a pitch for his unfinished economic agenda as negotiations heat up in Congress, broadly touting its provisions as Democrats pare back the sweeping… [+4872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, Ryan Nobles and Annie Grayer, CNN", "title": "Republicans set to overwhelmingly oppose Bannon criminal contempt referral", "description": "The vast majority of House Republicans are expected to oppose an effort to hold Donald Trump ally Steve Bannon in contempt of Congress for defying a subpoena, brushing aside concerns about weakening the institution's future oversight authority and rejecting a…", "url": "https://www.cnn.com/2021/10/20/politics/republicans-bannon-criminal-contempt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020184015-steve-scalise-102021-super-tease.jpg", "publishedAt": "2021-10-20T22:48:09Z", "content": "(CNN)The vast majority of House Republicans are expected to oppose an effort to hold Donald Trump ally Steve Bannon in contempt of Congress for defying a subpoena, brushing aside concerns about weake… [+6999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Republican wants to start 'GOP 2.0' -- without Donald Trump", "description": "Something very interesting happened in New Hampshire this week that you might have missed: The Georgia Republican lieutenant governor made a trip to the state touting his plan to re-birth a post-Trump GOP.", "url": "https://www.cnn.com/2021/10/20/politics/geoff-duncan-gop-2-0/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201231153144-geoff-duncan-december-31-2020-01-super-tease.jpg", "publishedAt": "2021-10-20T22:40:34Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "Facebook, don't change your name -- change your CEO", "description": "Facebook's reported move to change its name is a smart PR move, says Kara Alaimo, but won't get to the root of the problem -- the company's bankrupt reputation -- or magically create a brand in which consumers will place blind faith. Replacing Mark Zuckerberg…", "url": "https://www.cnn.com/2021/10/20/opinions/facebook-name-change-ceo-zuckerberg-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201022112637-mark-zuckerberg-1023-file-super-tease.jpg", "publishedAt": "2021-10-20T22:35:27Z", "content": "Kara Alaimo, an associate professor in the Lawrence Herbert School of Communication at Hofstra University, writes about women and social media. She was spokeswoman for international affairs in the Tr… [+5731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "Trump is again upsetting the US system of checks and balances", "description": "The US court system is creating some accountability for hundreds of the people who attended the January 6 rally, which turned into the insurrection at the US Capitol, by charging them with criminal offenses and in some cases sending them to jail.", "url": "https://www.cnn.com/2021/10/20/politics/checks-and-balances-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018090608-01-trump-0925-super-tease.jpg", "publishedAt": "2021-10-20T22:18:32Z", "content": "(CNN)The US court system is creating some accountability for hundreds of the people who attended the January 6 rally, which turned into the insurrection at the US Capitol, by charging them with crimi… [+7232 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette, CNN", "title": "Rahm Emanuel, Biden's nominee to be envoy to Japan, indicates China would be a central focus of the job", "description": "Rahm Emanuel, the Biden administration's nominee to be ambassador to Japan, made clear Wednesday that he believes a core part of the envoy job is about countering China.", "url": "https://www.cnn.com/2021/10/20/politics/rahm-senate-nomination-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020153709-rahm-emanuel-10-20-2021-super-tease.jpg", "publishedAt": "2021-10-20T22:07:04Z", "content": "Washington (CNN)Rahm Emanuel, the Biden administration's nominee to be ambassador to Japan, made clear Wednesday that he believes a core part of the envoy job is about countering China. \r\nEmanuel app… [+6914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed and Jessica Schneider, CNN", "title": "Bannon January 6 probe referral puts Attorney General Merrick Garland in center of legal and political storm", "description": "Attorney General Merrick Garland -- whose nomination was premised on insulating the Justice Department from politics -- faces a decision that puts him at the center of a partisan firestorm, with the House's coming request that the department pursue criminal c…", "url": "https://www.cnn.com/2021/10/20/politics/garland-bannon-criminal-referral-house-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719113401-merrick-garland-0623-super-tease.jpg", "publishedAt": "2021-10-20T21:59:45Z", "content": "(CNN)Attorney General Merrick Garland -- whose nomination was premised on insulating the Justice Department from politics -- faces a decision that puts him at the center of a partisan firestorm, with… [+5723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso, CNN", "title": "A 4-year-old boy survived a 70-foot cliff fall with nothing but some bruises", "description": "A 4-year-old boy who slipped off a cliff and fell about 70 feet suffered just some scrapes and bruises, the Wolfe County, Kentucky, Search & Rescue Team said in a Facebook post.", "url": "https://www.cnn.com/2021/10/20/us/child-escapes-unscathed-after-cliff-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020164559-4-year-old-falls-off-cliff-unscathed-super-tease.jpg", "publishedAt": "2021-10-20T21:52:50Z", "content": "(CNN)A 4-year-old boy who slipped off a cliff and fell about 70 feet suffered just some scrapes and bruises, the Wolfe County, Kentucky, Search &amp; Rescue Team said in a Facebook post. \r\nThe boy wa… [+902 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe and Kara Scannell, CNN", "title": "Westchester County district attorney's office investigating Trump Organization golf course property taxes", "description": "The Westchester County, New York, district attorney's office has opened an investigation into the Trump Organization, looking into whether the company misled a local town over the property value of its golf course for tax purposes, multiple people familiar wi…", "url": "https://www.cnn.com/2021/10/20/politics/trump-organization-westchester-golf-course-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020173157-trump-national-golf-club-westchester-super-tease.jpg", "publishedAt": "2021-10-20T21:40:42Z", "content": "(CNN)The Westchester County, New York, district attorney's office has opened an investigation into the Trump Organization, looking into whether the company misled a local town over the property value… [+3263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, Lauren Fox and Manu Raju, CNN", "title": "Sinema's opposition to raising the corporate tax rate leaves White House scrambling to pay for Biden's agenda", "description": "Top Biden administration officials are now weighing a range of different ideas to finance a sweeping economic and climate package as opposition from Democratic Sen. Kyrsten Sinema has thrown initial plans to raise the corporate tax rate into doubt, according …", "url": "https://www.cnn.com/2021/10/20/politics/white-house-hill-tax-talks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811151422-05-wh-infrastructure-super-tease.jpg", "publishedAt": "2021-10-20T21:33:16Z", "content": "(CNN)Top Biden administration officials are now weighing a range of different ideas to finance a sweeping economic and climate package as opposition from Democratic Sen. Kyrsten Sinema has thrown ini… [+4454 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Fred Wertheimer and Norman Eisen", "title": "Two people could save US democracy", "description": "Today we face a full-blown national crisis for our democracy -- with the voting rights of millions of Americans about to be sacrificed solely for partisan gain, write Norman Eisen and Fred Wertheimer. Two senators have the power to overcome the challenge.", "url": "https://www.cnn.com/2021/10/20/opinions/two-people-who-could-save-us-democracy-eisen-wertheimer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211002012617-sinema-manchin-split-for-video-file-super-tease.jpg", "publishedAt": "2021-10-20T21:22:41Z", "content": "Fred Wertheimer is president of Democracy 21, a nonpartisan, non-profit organization that works to strengthen US democracy. Norman Eisen was former President Barack Obama's \"ethics czar\" from 2009 to… [+8916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Drone attack targets US troops at US base in Syria, initial assessment suggests no US injuries", "description": "A drone attack targeted US troops at the US base at At-Tanf in Syria, close to the border with Jordan, on Wednesday, according to a US defense official.", "url": "https://www.cnn.com/2021/10/20/politics/drone-attack-syria/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020170207-al-tanf-outpost-syria-super-tease.jpg", "publishedAt": "2021-10-20T20:57:55Z", "content": "(CNN)A drone attack targeted US troops at the US base at At-Tanf in Syria, close to the border with Jordan, on Wednesday, according to a US defense official.\r\nThe initial assessment is that there wer… [+588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, CNN", "title": "GOP Rep. Jeff Fortenberry steps down from committee assignments following indictment", "description": "GOP Rep. Jeff Fortenberry of Nebraska, who was recently indicted for concealing information and lying to the FBI regarding an investigation into illegal campaign contributions, has officially resigned from his committee assignments.", "url": "https://www.cnn.com/2021/10/20/politics/fortenberry-resigns-committee-assignments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020165014-jeff-fortenberry-file-2018-super-tease.jpg", "publishedAt": "2021-10-20T20:54:31Z", "content": "(CNN)GOP Rep. Jeff Fortenberry of Nebraska, who was recently indicted for concealing information and lying to the FBI regarding an investigation into illegal campaign contributions, has officially re… [+553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Biden's pick for US envoy to China backs more security assistance to Taiwan", "description": "President Joe Biden's pick to be US Ambassador to China called for a continued commitment to the longstanding \"One China\" Policy but defended the United States' right to increase security assistance to Taiwan amid Beijing's aggression towards the island.", "url": "https://www.cnn.com/2021/10/20/politics/nicholas-burns-confirmation-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020153509-nicholas-burns-hearing-1020-super-tease.jpg", "publishedAt": "2021-10-20T20:52:49Z", "content": "(CNN)President Joe Biden's pick to be US Ambassador to China called for a continued commitment to the longstanding \"One China\" Policy but defended the United States' right to increase security assist… [+3969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Blake, CNN", "title": "Dave Chappelle insulted another audience no one mentions", "description": "Dave Chapelle didn't just offend the LGBTQ community with his latest standup special. He betrayed the legacy of the Black comic tradition he inherited. Some of the most iconic Black comedians were either gay or affirmed them in their performances.", "url": "https://www.cnn.com/2021/10/20/entertainment/dave-chappelle-controversy-netflix-black-comic-tradition/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019160859-01-dave-chappelle-the-closer-super-tease.jpg", "publishedAt": "2021-10-20T20:49:39Z", "content": "Analysis by John Blake, CNN\r\nUpdated 4:49 PM ET, Wed October 20, 2021\r\n (CNN)Dave Chappelle's latest Netflix special may have attracted a barrage of criticism from the LGBTQ community, but there is a… [+7578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Yellin", "title": "Here's how to fly with a friend or family member for free through 2023", "description": "Start earning the coveted Southwest Companion Pass by using these record-high Southwest credit card offers, and fly with a friend or family member for free through the end of 2023.", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/southwest-companion-pass/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200204190302-underscored-southwest-airlines-plane-takeoff.jpg?q=x_3,y_0,h_1796,w_3193,c_crop/w_800", "publishedAt": "2021-10-20T20:05:33Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+16170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellen McAlpine", "title": "Cool, colorful and stylish bands to pair with your Apple Watch", "description": "Whether you need a durable band for working out or a cool, fashionable one for the office, there are plenty of Apple Watch bands to choose from. We rounded up our favorites from top brands including Apple, Nomad and more.", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/best-apple-watch-bands/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211020092737-best-apple-watch-bands-modern-slim-band.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_800", "publishedAt": "2021-10-20T20:05:21Z", "content": "You use your Apple Watch for just about everything. From keeping time and tracking workouts to taking calls and monitoring your blood oxygen level, the Apple Watch is a small but powerful wearable wi… [+8737 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Solange launches a library for rare books by Black authors", "description": "The singer's creative studio Saint Heron recently launched a free community library that aims to increase access to rare and out-of-print works by Black and brown authors.", "url": "https://www.cnn.com/2021/10/20/entertainment/solange-saint-heron-library-black-authors-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020123109-01-solange-file-super-tease.jpg", "publishedAt": "2021-10-20T20:05:04Z", "content": "(CNN)The thing about rare books is that they're, well, rare -- which means too many hidden gems are well out of reach for the everyday literary enthusiast.\r\nSolange is trying to change that. The sing… [+2335 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Tiny crab preserved in 100-million-year-old amber lived among dinosaurs", "description": "Fossils trapped in amber have been among paleontology's most fascinating finds in recent years -- globs of hardened ancient tree resin have captured tantalizing details about spiders, lizards, microscopic animals, insects, birds and even a tiny dinosaur that …", "url": "https://www.cnn.com/2021/10/20/asia/amber-crab-fossil-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020070955-01-amber-crab-fossil-scn-super-tease.jpg", "publishedAt": "2021-10-20T19:40:50Z", "content": "(CNN)Fossils trapped in amber have been among paleontology's most fascinating finds in recent years -- globs of hardened ancient tree resin have captured tantalizing details about spiders, lizards, m… [+3174 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stella Chan, CNN", "title": "Man accused of killing Kristin Smart pleads not guilty", "description": "The man accused of killing 19-year-old college student Kristin Smart in 1996 pleaded not guilty at his arraignment Wednesday.", "url": "https://www.cnn.com/2021/10/20/us/kristin-smart-killing-flores-arraignment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210413200730-kristin-smart-thumb-super-tease.jpg", "publishedAt": "2021-10-20T19:28:11Z", "content": "(CNN)The man accused of killing 19-year-old college student Kristin Smart in 1996 pleaded not guilty at his arraignment Wednesday. \r\nPaul Flores, 44, faces a first-degree murder charge for allegedly … [+631 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Dune' captures the book's epic scale while telling only half of the story", "description": "To anyone who remembers seeing David Lynch's 1984 version of \"Dune\" and thinking, \"OK, so that happened,\" director Denis Villeneuve has conjured a far more coherent narrative filled with stunning images and massive machinery. He has also split the book into t…", "url": "https://www.cnn.com/2021/10/20/entertainment/dune-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210919154021-dune-1-super-tease.jpeg", "publishedAt": "2021-10-20T19:24:10Z", "content": "(CNN)To anyone who remembers seeing David Lynch's 1984 version of \"Dune\" and thinking, \"OK, so that happened,\" director Denis Villeneuve has conjured a far more coherent narrative filled with stunnin… [+3708 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop and Rosa Flores, CNN", "title": "'Get out, get out,' people on Houston plane were told as it crashed, passenger says", "description": "One of the 21 people on a plane that crashed in Houston Tuesday was looking forward to \"the trip of a lifetime,\" the passenger told CNN affiliate KHOU.", "url": "https://www.cnn.com/2021/10/20/us/texas-plane-crash-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020134803-restricted-texas-plane-crash-10-20-2021-super-tease.jpg", "publishedAt": "2021-10-20T19:07:30Z", "content": "(CNN)One of the 21 people on a plane that crashed in Houston Tuesday was looking forward to \"the trip of a lifetime,\" the passenger told CNN affiliate KHOU. \r\nBut the plane, carrying Houston Astros f… [+2401 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "The Ford Mustang Mach-E GT amps up the power in the company's electric lineup", "description": "For a lot of people there is one real Ford Mustang. It's the Ford Mustang GT coupe with the big 5.0-liter gasoline-burning 460 horsepower V8 engine and just two doors. These people do not accept the validity of the Mustang Ecoboost with its 310 horsepower tur…", "url": "https://www.cnn.com/2021/10/20/business/ford-mustang-mach-e-gt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019150305-ford-mustang-mach-e-gt-super-tease.jpg", "publishedAt": "2021-10-20T19:07:09Z", "content": "Sausalito, California (CNN)For a lot of people there is one real Ford Mustang. It's the Ford Mustang GT coupe with the big 5.0-liter gasoline-burning 460 horsepower V8 engine and just two doors. Thes… [+5903 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "Mom of woman killed 22 years ago comes from Texas to Indiana to thank police officer who's taken care of her daughter's memorial", "description": "Indianapolis Police Officer Jeff Stagg wasn't expecting any fanfare when he would stop to pick up trash and clear away the weeds around a roadside memorial for Shelby Smith -- he just didn't want the young woman, who was killed 22 years ago by a drunk driver,…", "url": "https://www.cnn.com/2021/10/20/us/indianapolis-police-memorial-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019123538-02-indianapolis-memorial-police-trnd-super-tease.jpg", "publishedAt": "2021-10-20T19:01:15Z", "content": "(CNN)Indianapolis Police Officer Jeff Stagg wasn't expecting any fanfare when he would stop to pick up trash and clear away the weeds around a roadside memorial for Shelby Smith -- he just didn't wan… [+4540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Navy investigation says fire that destroyed US warship was caused by a chain of errors and was 'clearly preventable'", "description": "A fire that destroyed a US warship last year was \"clearly preventable\" and was the result of a series of systematic failures, according to a Navy investigation.", "url": "https://www.cnn.com/2021/10/20/politics/uss-bonhomme-richard-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200717144919-uss-bohhomme-richard-fire-04-super-tease.jpeg", "publishedAt": "2021-10-20T18:57:45Z", "content": "(CNN)A fire that destroyed a US warship last year was \"clearly preventable\" and was the result of a series of systematic failures, according to a Navy investigation.\r\nThe cascade of errors and breakd… [+4399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "Stasher's bestselling reusable baggies are all 20% off right now", "description": "Save your leftovers and save the earth at the same time: Stasher's whole line of silicone baggies are on sale right now. Snag some great deals on half-gallon, sandwich and snack-size bags — all currently 20% off.", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/stasher-20-percent-off-sale/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211020134519-stasher-20-percent-off-sale-lead.jpg?q=x_2,y_0,h_900,w_1599,c_crop/w_800", "publishedAt": "2021-10-20T18:11:51Z", "content": "Save your leftovers and save the earth at the same time: Stashers whole line of silicone baggies are on sale right now. Snag some great deals on half-gallon, sandwich and snack-size bags all currentl… [+2331 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "Over 40% of Afghan refugees at US bases are children, Pentagon says", "description": "44% of Afghan refugees housed temporarily at eight US military bases are children, according to a letter from Secretary of Defense Lloyd Austin to Sen. James Inhofe, the ranking member of the Senate Armed Services Committee.", "url": "https://www.cnn.com/2021/10/20/politics/afghan-children-at-us-bases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930171426-afghan-refugees-us-0930-super-tease.jpg", "publishedAt": "2021-10-20T17:59:35Z", "content": "(CNN)44% of Afghan refugees housed temporarily at eight US military bases are children, according to a letter from Secretary of Defense Lloyd Austin to Sen. James Inhofe, the ranking member of the Se… [+4013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Obama warns Virginia voters they're making 'statement about what direction we're headed in as a country' in new ad for McAuliffe", "description": "Former President Barack Obama speaks direct to camera in a new ad for Virginia Democratic gubernatorial nominee Terry McAuliffe, warning voters that their decision will make \"a statement about what direction we're headed in as a country.\"", "url": "https://www.cnn.com/2021/10/20/politics/barack-obama-terry-mcauliffe-virginia-governor-race/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211012085425-obama-mcauliffe-split-super-tease.jpg", "publishedAt": "2021-10-20T17:54:09Z", "content": "(CNN)Former President Barack Obama speaks direct to camera in a new ad for Virginia Democratic gubernatorial nominee Terry McAuliffe, warning voters that their decision will make \"a statement about w… [+529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, CNN", "title": "Fired Washington State head football coach to file lawsuit over 'unjust and unlawful' termination", "description": "Former Washington State Cougars football coach Nick Rolovich plans to take legal action against the university following his firing on Monday for failing to comply with the state's Covid-19 vaccine mandate, his attorney told CNN on Wednesday.", "url": "https://www.cnn.com/2021/10/20/sport/rolovich-washington-state-coach-firing-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018210722-01-nick-rolovich-1016-super-tease.jpg", "publishedAt": "2021-10-20T17:52:49Z", "content": "(CNN)Former Washington State Cougars football coach Nick Rolovich plans to take legal action against the university following his firing on Monday for failing to comply with the state's Covid-19 vacc… [+1969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Lillis", "title": "Escape from Kabul: Inside the volunteer effort by US troops to rescue their families from Afghanistan", "description": "An hour after a suicide bomb exploded outside the Kabul airport on August 26, killing 13 US service members and scores of Afghan civilians, Fahim Masoud, a US military intelligence officer, made a frantic call to his sister.", "url": "https://www.cnn.com/2021/10/20/politics/escape-afghanistan-private-efforts-military-service-family-members/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019152823-fahim-masoud-screengrab-super-tease.jpg", "publishedAt": "2021-10-20T17:52:37Z", "content": "Washington (CNN)An hour after a suicide bomb exploded outside the Kabul airport on August 26, killing 13 US service members and scores of Afghan civilians, Fahim Masoud, a US military intelligence of… [+15254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Brooklyn lawyers plead guilty to a charge in Molotov cocktail case tied to George Floyd protest", "description": "Two lawyers who federal prosecutors say took part during an anti-police brutality protest last year in making a Molotov cocktail and throwing it at an empty New York Police Department vehicle have each pleaded guilty to one charge related to the incident.", "url": "https://www.cnn.com/2021/10/20/us/new-york-lawyers-molotov-cocktail/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020120728-02-new-york-lawyers-molotov-cocktail-super-tease.jpg", "publishedAt": "2021-10-20T17:45:25Z", "content": "(CNN)Two lawyers who federal prosecutors say took part during an anti-police brutality protest last year in making a Molotov cocktail and throwing it at an empty New York Police Department vehicle ha… [+2625 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Jill Biden speaks candidly about being a first lady: 'Nothing can prepare you'", "description": "First lady Jill Biden on Wednesday spoke candidly about her new life, lamenting the enormous pressure a first lady can face.", "url": "https://www.cnn.com/2021/10/20/politics/jill-biden-speaks-about-being-a-first-lady/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210907150618-jill-biden-super-tease.jpg", "publishedAt": "2021-10-20T17:28:26Z", "content": "(CNN)First lady Jill Biden on Wednesday spoke candidly about her new life, lamenting the enormous pressure a first lady can face.\r\n\"We aren't elected. We have to define this role ourselves,\" said Bid… [+2498 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Magaldi", "title": "Solo Stove's bestselling fire pits are not available in five nature-inspired colors", "description": "Solo Stove just turned the heat up a notch on its bestselling fire pits with its latest launch. All three smokeless stoves — the Yukon, Bonfire and Ranger — are now available in five new colorways, which marks the first time the brand has offered a color coat…", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/solo-stove-elemental-color-series-launch/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211020125937-solostovelead.jpg?q=x_0,y_0,h_2633,w_4678,c_fill/w_800", "publishedAt": "2021-10-20T17:03:30Z", "content": "Solo Stove just turned the heat up a notch on its bestselling fire pits with its latest launch. All three smokeless stoves the Yukon, Bonfire and Ranger are now available in five new colorways, which… [+1330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, Mike Hayes and Melissa Macaya, CNN", "title": "The latest on the Gabby Petito investigation", "description": "\"Some articles\" belonging to Gabby Petito's finace Brian Laundrie were found off a trial that he frequented at a North Port, Florida, park, according to the family's attorney. Follow here for the latest news updates.", "url": "https://www.cnn.com/us/live-news/brian-laundrie-search-10-20-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211014022417-gabby-petito-vigil-0924-super-tease.jpg", "publishedAt": "2021-10-20T16:58:29Z", "content": "\"Some articles\" belonging to Brian Laundrie were found off a trial that he frequented at Myakkahatchee Creek Environmental Park, according to the family's attorney. \r\nBrian's parents, Chris and Rober… [+638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What Liz Cheney just said about January 6 is *really* important", "description": "At a meeting of the House select committee investigating the January 6 riot at the US Capitol, Wyoming Rep. Liz Cheney, a Republican and vice chair of the committee, said something very, very important about both Donald Trump and his former political svengali…", "url": "https://www.cnn.com/2021/10/20/politics/liz-cheney-january-6-steve-bannon-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630162208-capitol-insurrection-0106-super-tease.jpg", "publishedAt": "2021-10-20T16:44:28Z", "content": "(CNN)At a meeting of the House select committee investigating the January 6 riot at the US Capitol, Wyoming Rep. Liz Cheney, a Republican and vice chair of the committee, said something very, very im… [+4673 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Krystin Arneson", "title": "The Always Pan and Perfect Pot now come in a cool new color", "description": "Our Place, makers of the Instagram-famous Always Pan and brand new Perfect Pot, has been dropping some new colors recently, and now there's one more that's hit the virtual shelves: Smoky blue \"Blanch\" dropped today, and the color makes for a modern addition t…", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/our-place-always-pan-blanch-launch/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211020122646-our-place-always-pan-blanch-launch-lead.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_800", "publishedAt": "2021-10-20T16:42:31Z", "content": "Our Place, makers of the Instagram-famous Always Pan and brand new Perfect Pot, has been dropping some new colors recently, and now theres one more thats hit the virtual shelves: Smoky blue Blanch dr… [+763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Why some Netflix employees are demonstrating today", "description": "Hundreds of Netflix employees and supporters are expected to take part in a demonstration on Wednesday.", "url": "https://www.cnn.com/2021/10/20/entertainment/netflix-employees-walk-out/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019160859-01-dave-chappelle-the-closer-super-tease.jpg", "publishedAt": "2021-10-20T16:35:40Z", "content": "(CNN)Hundreds of Netflix employees and supporters are expected to take part in a demonstration on Wednesday.\r\nThe employees are protesting the streaming giant's handling of controversy surrounding Da… [+4388 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Supply chain stress is intensifying and showing no signs of fading, Moody's Analytics says", "description": "From port congestion and price spikes to widespread shortages, stress in US supply chains is intensifying and could slow the economy in the coming months, Moody's Analytics warns.", "url": "https://www.cnn.com/2021/10/20/business/supply-chain-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015122956-10-global-supply-chain-crisis-1012-super-tease.jpg", "publishedAt": "2021-10-20T16:31:44Z", "content": "New York (CNN Business)From port congestion and price spikes to widespread shortages, stress in US supply chains is intensifying and could slow the economy in the coming months, Moody's Analytics war… [+3239 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine and Eric Levenson, CNN", "title": "Items belonging to Brian Laundrie found near Florida trail he frequented, family attorney says", "description": "Investigators searching for Brian Laundrie, the missing fiancé of Gabby Petito, found \"some articles\" of his off a trail that he frequented at the Myakkahatchee Creek Environmental Park near his family's home in Florida on Wednesday, family attorney Steven Be…", "url": "https://www.cnn.com/2021/10/20/us/brian-laundrie-update-gabby-petito/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210925230026-01-brian-laundrie-super-tease.jpg", "publishedAt": "2021-10-20T16:29:18Z", "content": "(CNN)Investigators searching for Brian Laundrie, the missing fiancé of Gabby Petito, found \"some articles\" of his off a trail that he frequented at the Myakkahatchee Creek Environmental Park near his… [+1911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Tapp", "title": "All the last-minute Halloween essentials you need for spooky season", "description": "", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/canada-halloween-last-minute/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211020103821-canada-halloween-last-minute-lead.jpg?q=x_0,y_0,h_900,w_1601,c_fill/w_800", "publishedAt": "2021-10-20T16:06:54Z", "content": "Its the spookiest season of all! Thanks to lockdowns, last Halloween was a bit of a disappointment. Now that we seem to be turning a corner in the fight against Covid-19, Canadian kids (and their par… [+6701 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bethlehem Feleke, Katie Polglase and Gianluca Mezzofiore, CNN", "title": "Fresh airstrikes hit capital of Ethiopia's war-torn Tigray region", "description": "The capital of Ethiopia's war-torn Tigray region was covered in smoke on Wednesday as the city was hit by another day of airstrikes, eyewitnesses and authorities told CNN.", "url": "https://www.cnn.com/2021/10/20/africa/airstrikes-hit-mekelle-tigray-ethiopia-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018105523-03-tigray-airstrike-screengrab-super-tease.jpg", "publishedAt": "2021-10-20T15:59:47Z", "content": "(CNN)The capital of Ethiopia's war-torn Tigray region was covered in smoke on Wednesday as the city was hit by another day of airstrikes, eyewitnesses and authorities told CNN.\r\nThe airstrikes on Mek… [+801 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "How Verizon became the Dow's worst stock", "description": "Verizon reported earnings that topped forecasts Wednesday morning and issued a more upbeat outlook for 2022. That's some much-needed good news for the company, which has been the Dow's worst-performing stock this year, falling about 10%.", "url": "https://www.cnn.com/2021/10/20/investing/verizon-stock-earnings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020082222-verizon-0121-restricted-super-tease.jpg", "publishedAt": "2021-10-20T15:30:39Z", "content": "New York (CNN Business)Verizon reported earnings that topped forecasts Wednesday morning and issued a more upbeat outlook for 2022. That's some much-needed good news for the company, which has been t… [+3832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "A small Australian town's attempt to lure Chris Hemsworth has gone viral. Here's how the actor responded", "description": "A small Australian town's mission to convince actor Chris Hemsworth to visit has paid off. Here's how the actor responded to their creative campaign video.", "url": "https://www.cnn.com/travel/article/cowra-australia-chris-hemsworth-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020003835-02-cowra-campaign-chris-hemsworth-super-tease.jpg", "publishedAt": "2021-10-20T15:13:40Z", "content": "Lilit Marcus, CNNPublished 20th October 2021\r\n(CNN) In the past five years, the Australian town of Cowra has been hit by droughts, Covid and even a mouse plague.\r\nSo when it came to bringing tourists… [+3035 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Keep your brain sharp by finding your sleep 'sweet spot,' study says", "description": "Sleeping too little or sleeping too much may contribute to cognitive decline, a new study says, but sleeping just the \"right\" amount of hours may keep the brain sharp.", "url": "https://www.cnn.com/2021/10/20/health/sleep-sweet-spot-brain-health-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614023624-stock-man-sleeping-super-tease.jpg", "publishedAt": "2021-10-20T15:12:08Z", "content": "(CNN)You know the story of Goldilocks and the three bears, right? Papa Bear's bed was too hard and Mama Bear's bed too soft, but Baby Bear found Goldilock's bed to be \"just right.\"\r\nThat fable could … [+4952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Bitcoin surges to new record above $65,000", "description": "The bitcoin bull market is showing no signs of slowing down. Bitcoin, the world's most valuable cryptocurrency, hit a new all-time high above $66,000 Wednesday, topping the previous record set in April.", "url": "https://www.cnn.com/2021/10/20/investing/bitcoin-price-record-high/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015080501-01-bitcoin-0530-super-tease.jpg", "publishedAt": "2021-10-20T14:31:52Z", "content": "New York (CNN Business)The bitcoin bull market is showing no signs of slowing down. Bitcoin, the world's most valuable cryptocurrency, hit a new all-time high above $66,000 Wednesday, topping the pre… [+651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, Amanda Watts and Jason Hanna, CNN", "title": "Nikolas Cruz pleads guilty to murder charges for Parkland high school massacre", "description": "Nikolas Cruz, the gunman who carried out the massacre of students and faculty members at Marjory Stoneman Douglas High School in February 2018, pleaded guilty in a Florida courtroom Wednesday to 17 counts of murder and 17 counts of attempted murder.", "url": "https://www.cnn.com/2021/10/20/us/nikolas-cruz-parkland-shooting-guilty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020094443-01-nikolas-cruz-guilty-plea-1020-super-tease.jpg", "publishedAt": "2021-10-20T14:23:21Z", "content": "(CNN)Nikolas Cruz, the gunman who carried out the massacre of students and faculty members at Marjory Stoneman Douglas High School in February 2018, pleaded guilty in a Florida courtroom Wednesday to… [+3680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Mitch McConnell just sent a VERY clear message to Donald Trump about 2022", "description": "Mitch McConnell's entire being is -- and always has been -- focused on winning elections. Every move he makes and every thing he says is part of a broader effort to ensure that his side winds up with more seats -- and therefore more control -- than the other …", "url": "https://www.cnn.com/2021/10/20/politics/mitch-mcconnell-donald-trump-2022-midterms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211007190932-mitch-mcconnell-10-05-2021-super-tease.jpg", "publishedAt": "2021-10-20T13:51:36Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Busari and Nimi Princewill, CNN", "title": "Police fire tear gas in Lagos as protesters honoring victims of Lekki toll gate shooting spill on to streets", "description": "Police in Lagos fired tear gas Wednesday as hundreds of demonstrators turned up at the Lekki toll gate in a memorial car procession to honor those who died during protests last year in Nigeria's economic hub.", "url": "https://www.cnn.com/2021/10/20/africa/nigeria-lekki-toll-gate-anniversary-protests-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020064456-01-lekki-toll-gate-protest-2021-super-tease.jpg", "publishedAt": "2021-10-20T13:51:12Z", "content": "Lagos and Abuja, Nigeria (CNN)Police in Lagos fired tear gas Wednesday as hundreds of demonstrators turned up at the Lekki toll gate in a memorial car procession to honor those who died during protes… [+2876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Gregory Lemos, CNN", "title": "Miya Marcano's family files wrongful death lawsuit against her apartment complex", "description": "The family of 19-year-old Miya Marcano, who went missing from her apartment in Florida and was later found dead in a wooded area, has filed a wrongful death lawsuit against her apartment complex and the company that operates the complex in connection with her…", "url": "https://www.cnn.com/2021/10/20/us/miya-marcano-family-sues-apartment-complex/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210927211111-miya-marcano-missing-super-tease.jpg", "publishedAt": "2021-10-20T13:49:37Z", "content": "(CNN)The family of 19-year-old Miya Marcano, who went missing from her apartment in Florida and was later found dead in a wooded area, has filed a wrongful death lawsuit against her apartment complex… [+2803 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Travis Tritt cancels concerts at venues with Covid safety measures", "description": "Travis Tritt is canceling four concerts at venues that have Covid-19 safety protocols. The country singer has announced he will not be performing at planned stops in Indiana, Mississippi, Illinois and Kentucky.", "url": "https://www.cnn.com/2021/10/20/entertainment/travis-tritt-covid-cancellations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190519070549-travis-tritt-file-super-tease.jpg", "publishedAt": "2021-10-20T13:46:53Z", "content": "(CNN)Travis Tritt is canceling four concerts at venues that have Covid-19 safety protocols.The country singer has announced he will not be performing at planned stops in Indiana, Mississippi, Illinoi… [+723 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "Liz Cheney: Bannon refusal to cooperate suggests Trump was 'personally involved' in planning riot", "description": "Republican Rep. Liz Cheney blasted former President Donald Trump's ally Steve Bannon for refusing to cooperate with the House committee investigating the January 6 riot, saying that his claim of executive privilege is not only invalid, but suggests Trump was …", "url": "https://www.cnn.com/2021/10/20/politics/liz-cheney-trump-bannon-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211016180459-liz-cheney-0727-file-super-tease.jpg", "publishedAt": "2021-10-20T13:45:13Z", "content": "(CNN)Republican Rep. Liz Cheney blasted former President Donald Trump's ally Steve Bannon for refusing to cooperate with the House committee investigating the January 6 riot, saying that his claim of… [+1076 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Underscored Staff", "title": "9 snuggle-worthy blankets we've actually used", "description": "From light fleeces and weighted blankets to chunky knits and durable adventure throws, here are 9 of the coziest, comfiest blankets we've tried.", "url": "https://www.cnn.com/2021/10/20/cnn-underscored/cozy-blankets/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211019172142-cozy-blankets-rumpl-miso.jpg?q=x_2,y_0,h_902,w_1602,c_crop/w_800", "publishedAt": "2021-10-20T13:28:26Z", "content": "The weather is finally cooling down, and if youre in need of a new blanket to snuggle up in, youre in luck. We asked our editors to name their favorite blankets theyve ever used so you can stay warm … [+4393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Veronica Stracqualursi, CNN", "title": "HHS' Dr. Rachel Levine sworn in as US' first openly transgender four-star officer", "description": "Dr. Rachel Levine, the assistant secretary for health at the US Department of Health and Human Services, made history Tuesday as the first openly transgender four-star officer across the nation's eight uniformed services.", "url": "https://www.cnn.com/2021/10/20/politics/dr-rachel-levine-admiral-transgender/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020081328-rachel-levine-hhs-swearing-in-super-tease.jpg", "publishedAt": "2021-10-20T13:28:11Z", "content": "(CNN)Dr. Rachel Levine, the assistant secretary for health at the US Department of Health and Human Services, made history Tuesday as the first openly transgender four-star officer across the nation'… [+1345 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "For Pacific Islanders, a statue in Washington state recalls a dark chapter in history", "description": "The monument honoring the 19th century US Navy sailor John R. Monaghan in Spokane, Washington, is a reminder of the country's history of violence, colonialism and racism against the Samoan people. Members of the community want it to come down.", "url": "https://www.cnn.com/2021/10/20/us/spokane-wa-statue-pacific-islanders-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019180750-john-monaghan-statue-spokane-kxly-super-tease.jpg", "publishedAt": "2021-10-20T13:13:57Z", "content": "(CNN)In downtown Spokane, Washington, in front of a private social club, stands a statue honoring the 19th century US Navy sailor John R. Monaghan.\r\nMost of the city's residents have no idea who Mona… [+3862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Harry Styles appears post-credits in 'Eternals'", "description": "Harry Styles is reportedly joining MCU as Eros, brother of Thanos in \"Eternals.\"", "url": "https://www.cnn.com/2021/10/20/entertainment/harry-styles-eternals/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210129102800-05-harry-styles-birthday-evolution-2017-super-tease.jpg", "publishedAt": "2021-10-20T13:07:36Z", "content": "Big reveal from #TheEternals premiere -- Harry Styles has joined the MCU as Eros, brother of Thanos.\r\n— Matt Donnelly (@MattDonnelly) October 19, 2021"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Everything you're waiting for is in these containers", "description": "Virtually every US home contains items that came through the ports of Los Angeles or Long Beach.", "url": "https://www.cnn.com/2021/10/20/business/la-long-beach-port-congestion-problem-national-impact/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019142655-14-global-supply-chain-crisis-1016-restricted-super-tease.jpg", "publishedAt": "2021-10-20T12:16:01Z", "content": "By Chris Isidore, CNN Business\r\nUpdated 8:16 AM ET, Wed October 20, 2021\r\nNew York (CNN Business)Virtually every US home contains items that came through the ports of Los Angeles or Long Beach.\r\nThe … [+7668 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, Mike Hayes and Melissa Macaya, CNN", "title": "The latest on Covid-19 vaccines in the US", "description": "The White House unveiled its plans to roll out Covid-19 vaccines for children ages 5 to 11, pending US Food and Drug Administration authorization. Follow here for the latest news.", "url": "https://www.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-10-20-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-10-20T12:15:58Z", "content": "The US government likely will soon recommend booster shots to people as young as 40 who received either Moderna or Pfizers Covid-19 vaccine, according to a source familiar with the plan.\r\nI believe i… [+2506 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "White House explores deploying the National Guard to ease supply chain crisis but is unlikely to use this option", "description": "Facing a mounting supply chain crisis, the White House is exploring whether to deploy the National Guard to ease bottlenecks, though that option is viewed as unlikely, a person familiar with the matter told CNN.", "url": "https://www.cnn.com/2021/10/20/economy/supply-chain-crisis-national-guard/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019080947-06-supply-chain-backlog-super-tease.jpg", "publishedAt": "2021-10-20T11:55:18Z", "content": "New York (CNN Business)Facing a mounting supply chain crisis, the White House is exploring whether to deploy the National Guard to ease bottlenecks, though that option is viewed as unlikely, a person… [+2227 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "This is the secret to dealing with inflation", "description": "Procter & Gamble, the consumer goods giant that makes Pampers diapers, Crest toothpaste and Tide detergent, says that running its business is far from simple right now.", "url": "https://www.cnn.com/2021/10/20/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020073526-crest-prices-102020-file-super-tease.jpg", "publishedAt": "2021-10-20T11:45:30Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "New York City vaccine requirement will extend to 160,500 city workers, Mayor Bill de Blasio says", "description": "New York City's vaccine mandate will extend to 160,500 municipal workers, Mayor Bill de Blasio announced Wednesday.", "url": "https://www.cnn.com/2021/10/20/us/nyc-vaccine-mandate-extension/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020065553-02-bill-de-blasio-file-super-tease.jpg", "publishedAt": "2021-10-20T11:34:20Z", "content": "(CNN)New York City's vaccine mandate will extend to 160,500 municipal workers, Mayor Bill de Blasio announced Wednesday. \r\nPrior to de Blasio's announcement, all New York City public school teachers … [+311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "US surgeons successfully test pig kidney transplant in human patient", "description": "For the first time, a pig kidney has been transplanted into a human without triggering immediate rejection by the recipient's immune system, a potentially major advance that could eventually help alleviate a dire shortage of human organs for transplant.", "url": "https://www.cnn.com/2021/10/20/health/human-pig-kidney-transplant-scli-intl-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020064123-01-human-pig-kidney-transplant-scli-intl-super-tease.jpg", "publishedAt": "2021-10-20T11:20:29Z", "content": "For the first time, a pig kidney has been transplanted into a human without triggering immediate rejection by the recipient's immune system, a potentially major advance that could eventually help all… [+3377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jennifer Tucker", "title": "Now that guns can kill hundreds in minutes, Supreme Court should rethink the rights question", "description": "This fall, the US Supreme Court will decide New York State Rifle and Pistol Association v. Kevin Bruen, a case that may result in vastly expanded rights to carry firearms in public. In doing so, the Court will need to grapple with a key question that, until n…", "url": "https://www.cnn.com/2021/10/20/opinions/supreme-court-gun-rights-case-lethality-tucker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210630170103-01-scotus-0621-super-tease.jpg", "publishedAt": "2021-10-20T10:59:40Z", "content": "Jennifer Tucker is an associate professor of history at Wesleyan University, Vice President of the Association of Firearms History &amp; Museums, and co-editor of \"A Right to Bear Arms? The Contested… [+6832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By CNN Business", "title": "US stocks are sleepy", "description": "Here's the latest news on what stocks are doing.", "url": "https://www.cnn.com/business/live-news/stock-market-news-102021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211008085846-03-nyse-1005-super-tease.jpg", "publishedAt": "2021-10-20T10:39:18Z", "content": "Netflix now has 213.5 million subscribers globally, having added 4.4 million subscribers in the third quarter of 2021\r\n, the company reported on Tuesday.\r\nThat number beat the streaming service's own… [+439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for October 20: Covid, Congress, Capitol riot, supply chain, Haiti", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/10/20/us/five-things-october-20-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020045816-01-moderna-pfizer-johnson-vials-super-tease.jpg", "publishedAt": "2021-10-20T10:33:08Z", "content": "(CNN)Your morning routine could be getting a little pricier. Procter &amp; Gamble, one of the largest consumer goods manufacturers, is raising prices on some grooming, beauty and oral care products. … [+5147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Miss France pageant faces lawsuit for requiring all contestants to be at least 5-foot-5, unmarried and child-free", "description": "Miss France, the country's 101-year-old beauty pageant, is being sued by a feminist activist group over alleged discriminatory entry requirements.", "url": "https://www.cnn.com/style/article/miss-france-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019141050-02-miss-france-lawsuit-super-tease.jpg", "publishedAt": "2021-10-20T10:29:03Z", "content": "beautyPublished 20th October 2021\r\nMiss France, the country's 101-year-old beauty pageant, is being sued by a feminist activist group over alleged discriminatory entry requirements.\r\nAn appeal has be… [+3585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, CNN", "title": "Queen Elizabeth II cancels trip, advised to rest for a few days", "description": "Queen Elizabeth II has canceled a trip to Northern Ireland today and has \"reluctantly accepted medical advice to rest for the next few days\", Buckingham Palace said, Britain's PA Media news agency reported Wednesday.", "url": "https://www.cnn.com/2021/10/20/uk/queen-elizabeth-rest-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015035832-queen-elizabeth-1014-super-tease.jpg", "publishedAt": "2021-10-20T10:24:13Z", "content": "London (CNN)Queen Elizabeth II is resting at Windsor Castle after \"reluctantly\" accepting medical advice to cancel a trip to Northern Ireland, planned for Wednesday and Thursday, Buckingham Palace ha… [+567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Novak Djokovic will need to be vaccinated to play Australian Open: minister", "description": "Novak Djokovic will not be able to enter Australia to defend his Australian Open title unless he is fully vaccinated for Covid-19, the country's immigration minister said on Wednesday, putting the Serb's grand slam record bid in doubt.", "url": "https://www.cnn.com/2021/10/20/tennis/novak-djokovic-vaccinated-australian-open-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020055756-01-novak-djokovic-file-super-tease.jpg", "publishedAt": "2021-10-20T10:15:17Z", "content": "Novak Djokovic will not be able to enter Australia to defend his Australian Open title unless he is fully vaccinated for Covid-19, the country's immigration minister said on Wednesday, putting the Se… [+2935 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Kevin Liptak and Fredreka Schouten, CNN", "title": "White House under pressure to act on voting rights, but it's not ready to blow up the filibuster", "description": "The White House is under mounting pressure to get results on voting rights legislation, but sources tell CNN the Biden administration still isn't ready to try to jam it through the Senate by force -- even though the Senate's latest voting bill is expected to …", "url": "https://www.cnn.com/2021/10/20/politics/voting-rights-filibuster-biden-harris/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811151114-01-wh-infrastructure-super-tease.jpg", "publishedAt": "2021-10-20T10:10:54Z", "content": "(CNN)The White House is under mounting pressure to get results on voting rights legislation, but sources tell CNN the Biden administration still isn't ready to try to jam it through the Senate by for… [+11202 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Harlan, CNN", "title": "How CJ McCollum is using his love of wine to become a different type of trailblazer", "description": "It's not often an NBA star can quietly make his way through a crowd unnoticed. But with celebrities like William H. Macy, Martha Stewart, and Guy Fieri roaming the grounds of the Food & Wine Classic in Aspen, Colorado last month, Portland Trail Blazers guard …", "url": "https://www.cnn.com/2021/10/20/sport/cj-mccollum-wine-enthusiast-portland-trail-blazers-nba-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019084644-05-cj-mccollum-vineyard-super-tease.jpg", "publishedAt": "2021-10-20T09:19:12Z", "content": "(CNN)It's not often an NBA star can quietly make his way through a crowd unnoticed. But with celebrities like William H. Macy, Martha Stewart, and Guy Fieri roaming the grounds of the Food &amp; Wine… [+5406 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sandee LaMotte, CNN", "title": "A glorious way of eating in Greece", "description": "A CNN writer went to explore the real-life Mediterranean diet -- an award-winning style of healthy eating she had been covering for years as a health journalist -- in Greece.", "url": "https://www.cnn.com/travel/article/greek-food-mediterranean-diet-travel-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020044957-06b-mediterranean-diet-travel-super-tease.jpeg", "publishedAt": "2021-10-20T08:54:14Z", "content": "(CNN) The Greek islands! It was a bucket list trip, made even more precious as a getaway after the long pandemic travel drought. I'd been to Athens before, so this trip was all about the islands, inc… [+5661 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Esha Mitra, CNN", "title": "Dozens killed in India after heavy flooding and record rainfall", "description": "Record-breaking rains and heavy flooding have killed at least 73 people in India this week, according to disaster management officials.", "url": "https://www.cnn.com/2021/10/20/india/india-uttarakhand-kerala-flood-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020022951-04-uttrakhand-india-flooding-1020-super-tease.jpg", "publishedAt": "2021-10-20T08:15:06Z", "content": "(CNN)Record-breaking rains and heavy flooding have killed at least 73 people in India this week, according to disaster management officials.\r\nAt least 46 people have died in the northern state of Utt… [+2585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "California is under a statewide drought emergency as it sees its driest year in nearly a century", "description": "After California saw its driest year on record in nearly 100 years, the entire state is now under a drought emergency, officials said Tuesday.", "url": "https://www.cnn.com/2021/10/20/weather/california-drought-emergency-expanded/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019233101-01-california-drought-emergency-super-tease.jpg", "publishedAt": "2021-10-20T07:41:10Z", "content": "(CNN)After California saw its driest year on record in nearly 100 years, the entire state is now under a drought emergency, officials said Tuesday.\r\nCalifornia Gov. Gavin Newsom issued a statewide dr… [+4298 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joseph Ataman, CNN", "title": "Karim Benzema and Mathieu Valbuena: A ​blackmail ​allegation and a sex tape -- two French footballers face off in court", "description": "A sex-tape, alleged blackmail and two French soccer stars: as the trial of French striker Karim Benzema kicks off today, it was always going to draw attention.", "url": "https://www.cnn.com/2021/10/20/football/karim-benzema-mathieu-valbuena-trial-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019191622-benzema-valbuena-split-super-tease.jpg", "publishedAt": "2021-10-20T07:16:14Z", "content": "Paris (CNN)A sex-tape, alleged blackmail and two French soccer stars: as the trial of French striker Karim Benzema kicks off today, it was always going to draw attention. \r\nBenzema, who plays club fo… [+3148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon and Isa Soares, CNN", "title": "Brazilian senators abandon call for homicide charges against President Bolsonaro", "description": "Brazilian senators investigating President Jair Bolsonaro's handling of the pandemic decided late on Tuesday to withdraw recommendations for charges of mass homicide and genocide against him, CNN affiliate CNN Brasil reported.", "url": "https://www.cnn.com/2021/10/20/americas/brazil-bolsonaro-covid-19-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020021423-jair-bolsonaro-1019-super-tease.jpg", "publishedAt": "2021-10-20T06:52:18Z", "content": "(CNN)Brazilian senators investigating President Jair Bolsonaro's handling of the pandemic decided late on Tuesday to withdraw recommendations for charges of mass homicide and genocide against him, CN… [+2180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "First he fled North Korea. Now he's escaped from a Chinese prison", "description": "Chinese authorities have offered a bounty equivalent to more than $23,000 for the capture of a North Korean defector who broke out of prison in the northeastern city of Jilin on Monday.", "url": "https://www.cnn.com/2021/10/20/china/jilin-prison-break-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019223704-zhu-xianjian-super-tease.jpg", "publishedAt": "2021-10-20T06:33:50Z", "content": "Hong Kong (CNN)Chinese authorities have offered a bounty equivalent to more than $23,000 for the capture of a North Korean defector who broke out of prison in the northeastern city of Jilin on Monday… [+3142 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He, CNN Business", "title": "China's real estate crisis could kill growth into 2022. Beijing's undeterred", "description": "China's growth is seriously slowing down as the country lurches from one economic threat to another. And while some of the biggest pain points appear to be easing, an unfolding crisis in real estate is emerging as one of Beijing's toughest challenges in the c…", "url": "https://www.cnn.com/2021/10/20/economy/china-gdp-real-estate-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019204228-china-engine-factory-1018-super-tease.jpg", "publishedAt": "2021-10-20T06:08:05Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+6258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN\nVideo and Photos by Temujin Doran, CNN\nDesign by Carlotta Dotto, CNN", "title": "The world is banking on giant carbon-sucking fans to clean our climate mess. It's a big risk.", "description": "The windswept valleys surrounding the Hengill volcano in southwestern Iceland are dotted with hot springs and steam vents. Hikers from all over the world come here to witness its breath-taking scenery. Even the sheep are photogenic in the soft Nordic light.", "url": "https://www.cnn.com/2021/10/20/world/carbon-capture-storage-climate-iceland-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018110821-01-carbfix-climeworks-iceland-carbon-storage-super-tease.jpg", "publishedAt": "2021-10-20T06:06:37Z", "content": "About 800,000 years ago\r\n700,000 years ago\r\n600,000 years ago\r\n500,000 years ago\r\n400,000 years ago\r\n300,000 years ago\r\n200,000 years ago\r\n100,000 years ago\r\nSecond Industrial Revolution (1870)\r\nCO l… [+784 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lincoln Mitchell", "title": "Doing right isn't the secret to Democrats' success next year", "description": "We are frequently told that the key to the Democrats' chances in the 2022 midterm elections is for President Joe Biden's administration and the Democratic majority in Congress to deliver meaningful legislation for the American people.", "url": "https://www.cnn.com/2021/10/20/opinions/joe-biden-democrats-midterm-elections-2022-legislation-mitchell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211012203123-pelosi-schumer-infrastructure-super-tease.jpg", "publishedAt": "2021-10-20T04:30:01Z", "content": "Lincoln Mitchell (@LincolnMitchell) teaches in the School of International and Public Affairs at Columbia University. His most recent book is \"The Giants and Their City: Major League Baseball in San … [+6552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN Business", "title": "The world plans to produce far more fossil fuel than it should to stay under dangerous climate limits, UN says", "description": "New UN report shows that many of the world's largest fossil fuel producers are still planning to ramp up production through 2030, despite global climate pledges.", "url": "https://www.cnn.com/2021/10/20/business/fossil-fuel-production-gap-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019140454-india-dadri-power-plant-super-tease.jpg", "publishedAt": "2021-10-20T04:08:02Z", "content": "New York (CNN Business)Ahead of a critical global climate conference in November, a UN report released Wednesday shows that many of the world's largest fossil fuel producers are still planning to ram… [+5435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Boris Johnson declared the pandemic all but over. Now UK cases are soaring", "description": "Boris Johnson lifted almost all Covid-19 restrictions in July. Now, Britain's caseload is soaring as experts warn the country could be in for a rough winter.", "url": "https://www.cnn.com/2021/10/20/uk/uk-europe-covid-infections-cmd-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019055333-01-uk-coronavirus-autumn-surge-super-tease.jpg", "publishedAt": "2021-10-20T04:03:56Z", "content": "London (CNN)Last December, as the first of several worrying Covid-19 variants ripped through the United Kingdom, Prime Minister Boris Johnson made the unwelcome decision to cancel Christmas plans for… [+9803 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Republican candidates can ignore Trump -- but he won't go away", "description": "One Republican is trying his hand at lifting the curse that Donald Trump has inflicted on his party in America's suburbs -- by just pretending he doesn't exist.", "url": "https://www.cnn.com/2021/10/20/politics/donald-trump-glenn-youngkin-virginia-governor-race-suburbs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018205912-c2-trump-super-tease.jpg", "publishedAt": "2021-10-20T04:01:06Z", "content": "Burke, Virginia (CNN)One Republican is trying his hand at lifting the curse that Donald Trump has inflicted on his party in America's suburbs -- by just pretending he doesn't exist.\r\nBut even as Virg… [+9594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yoonjung Seo and Ben Westcott, CNN", "title": "North Korea says its latest ballistic missile test was launched from a submarine", "description": "North Korea said it successfully test-fired a new ballistic missile from a submarine on Tuesday, state news agency KCNA reported Wednesday.", "url": "https://www.cnn.com/2021/10/19/asia/north-korea-submarine-missile-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019210637-north-korea-missile-launch-1019-super-tease.jpg", "publishedAt": "2021-10-20T03:05:37Z", "content": "Seoul, South Korea (CNN)North Korea said it successfully test-fired a new ballistic missile from a submarine on Tuesday, state news agency KCNA reported Wednesday.\r\nKCNA said the submarine-launched b… [+3047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "'Mooncakes and Milk Bread': Celebrating the tastes of Chinese American bakeries", "description": "Kristina Cho's recently published cookbook, \"Mooncakes and Milk Bread: Sweet & Savoury Recipes Inspired by Chinese Bakeries,\" shines the culinary spotlight on the baked goods she grew up eating in Chinese American bakeries.", "url": "https://www.cnn.com/travel/article/mooncakes-and-milk-bread-chinese-american-bakeries-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211020082041-mooncakes-and-milk-bread-tease-2-super-tease.jpg", "publishedAt": "2021-10-20T01:44:41Z", "content": "An architecture graduate and interior designer, Cho turned to baking a few years ago when she couldn't find satisfaction at work, eventually starting her blog, Eat Cho Food. \r\nHer grandparents moved … [+5386 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Kuznia, Scott Bronstein, Curt Devine and Drew Griffin, CNN", "title": "They take an oath to do no harm, but these doctors are spreading misinformation about the Covid vaccine", "description": "They take an oath to do no harm, but these doctors are spreading misinformation about the Covid vaccine.", "url": "https://www.cnn.com/2021/10/19/us/doctors-covid-vaccine-misinformation-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211013184134-01-bukacek-rally-sign-super-tease.jpg", "publishedAt": "2021-10-20T00:32:04Z", "content": "(CNN)She was a frequent guest on The Oprah Winfrey Show -- an Ivy League-educated OB-GYN who often spoke about women's health and holistic medicine. \r\nShe was a media darling, and in 2013 made Reader… [+23109 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leyla Santiago and Sara Weisfeldt, CNN", "title": "Broward County reaches $25 million settlement with victims of Parkland massacre, attorney says", "description": "A $25 million settlement has been reached between the Broward County School Board and 52 victims of the February 2018 shooting at Marjory Stoneman Douglas High School in South Florida, according to an attorney for some of the victims.", "url": "https://www.cnn.com/2021/10/19/us/florida-parkland-massacre-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330114119-01-parkland-school-shooting-file-2018-super-tease.jpg", "publishedAt": "2021-10-20T00:03:26Z", "content": "(CNN)A $25 million settlement has been reached between the Broward County School Board and 52 victims of the February 2018 shooting at Marjory Stoneman Douglas High School in South Florida, according… [+2075 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "Iowa Democratic Party chairman says he was targeted by threatening messages after criticizing Trump", "description": "Ross Wilburn, the Iowa Democratic Party chairman, says he received racist threats in the days after he published an op-ed in the Des Moines Register that was critical of former President Donald Trump and Republicans who have aligned themselves with him.", "url": "https://www.cnn.com/2021/10/19/politics/iowa-democratic-party-chairman-threatening-messages/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019184611-ross-wilburn-super-tease.jpg", "publishedAt": "2021-10-19T23:14:13Z", "content": "(CNN)Ross Wilburn, the Iowa Democratic Party chairman, says he received racist threats in the days after he published an op-ed in the Des Moines Register that was critical of former President Donald … [+1783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "You'll never guess the 1 world power that thinks less of the US post-Trump", "description": "Back when he was president, Donald Trump used to tell anyone who would listen how hard he was on Russia.", "url": "https://www.cnn.com/2021/10/19/politics/us-leadership-international-perception-russia-trump-putin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190116015911-vladimir-putin-smiles-072018-super-tease.jpg", "publishedAt": "2021-10-19T23:12:10Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Judge who's criticized Capitol insurrection to hear Trump's challenge to House subpoena of presidential records", "description": "A federal judge who has strongly criticized the January 6 insurrection and handed down prison time to some convicted rioters is set to hear former President Donald Trump's challenge to a House subpoena of records from his time in office related to the siege.", "url": "https://www.cnn.com/2021/10/19/politics/tanya-chutkan-trump-records-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019133948-judge-tanya-chutkan-super-tease.jpg", "publishedAt": "2021-10-19T22:48:14Z", "content": "Washington (CNN)A federal judge who has strongly criticized the January 6 insurrection and handed down prison time to some convicted rioters is set to hear former President Donald Trump's challenge t… [+3416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Phil Mattingly, CNN", "title": "Biden tells House Democrats tuition-free community college is out of economic package", "description": "President Joe Biden informed House progressives Tuesday afternoon that the final bill to expand the social safety net is expected to drop tuition-free community college, a major White House priority, according to multiple sources familiar with the mater.", "url": "https://www.cnn.com/2021/10/19/politics/biden-house-democrats-tuition-free-community-college/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015150939-03-biden-connecticut-1015-super-tease.jpg", "publishedAt": "2021-10-19T22:04:54Z", "content": "(CNN)President Joe Biden informed House progressives Tuesday afternoon that the final bill to expand the social safety net is expected to drop tuition-free community college, a major White House prio… [+1494 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz, CNN", "title": "Parents and teachers voice concern at Texas school board meeting after Holocaust remark", "description": "Parents and teachers spoke out at the first school board meeting after a North Texas administrator told teachers if they have books about the Holocaust in their classroom libraries, they also need to include books with \"opposing\" views of the Holocaust.", "url": "https://www.cnn.com/2021/10/19/us/texas-school-board-holocaust-controversy-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019142847-carroll-independent-school-district-board-meetin-1018-super-tease.jpg", "publishedAt": "2021-10-19T22:03:14Z", "content": "(CNN)Parents and teachers spoke out at the first school board meeting after a North Texas administrator told teachers if they have books about the Holocaust in their classroom libraries, they also ne… [+3463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rodrigo Pedroso and Samantha Beech, CNN", "title": "Leaked Covid-19 report calls for mass homicide charges against Jair Bolsonaro", "description": "A Brazilian congressional panel is set to recommend mass homicide charges against President Jair Bolsonaro over his handling of the coronavirus pandemic, according a leaked government report seen by CNN on Tuesday.", "url": "https://www.cnn.com/2021/10/19/americas/bolsonaro-homicide-covid-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930092104-bolsonaro-medicos-super-tease.jpg", "publishedAt": "2021-10-19T21:58:00Z", "content": "(CNN)A Brazilian congressional panel is set to recommend mass homicide charges against President Jair Bolsonaro over his handling of the coronavirus pandemic, according a leaked government report see… [+1346 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Jill Filipovic", "title": "A woman is raped and onlookers record it: the story beyond the outrage", "description": "The story of a woman raped on a Southeastern Pennsylvania Transport Authority (SEPTA) train in Philadelphia while onlookers reportedly recorded video with their cellphones but did not intervene or call 911 is mind-bogglingly horrific. It suggests not only a t…", "url": "https://www.cnn.com/2021/10/19/opinions/philadelphia-train-rape-bystander-effect-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018134039-02-septa-train-file-super-tease.jpg", "publishedAt": "2021-10-19T21:47:02Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion By Jill Filipovic", "title": "A woman is raped and onlookers record it: the story beyond the outrage", "description": "The now-viral story of a sexual assault aboard a SEPTA train in Philadelphia is a brutal reminder that it remains too easy to turn away from violence against women, says Jill Filipovic. It's also a crucial moment for difficult questions, she writes - to pause…", "url": "https://www.cnn.com/2021/10/19/opinions/philadelphia-train-rape-bystander-effect-filipovic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211018134039-02-septa-train-file-super-tease.jpg", "publishedAt": "2021-10-19T21:47:02Z", "content": "Jill Filipovic is a journalist based in New York and author of the book \"OK Boomer, Let's Talk: How My Generation Got Left Behind.\" Follow her on Twitter. The opinions expressed in this commentary ar… [+6527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Analysis: Mix and match Covid vaccine policy would provide two advantages: stronger immune responses and less confusion", "description": "A mix-and-match Covid-19 booster vaccine policy would provide two distinct advantages: a stronger immune response to the extra shot, plus a lot less confusion for people seeking booster doses.", "url": "https://www.cnn.com/2021/10/19/health/covid-vaccines-mix-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211015123015-pfizer-covid-vaccine-1005-super-tease.jpg", "publishedAt": "2021-10-19T21:45:56Z", "content": "(CNN)A mix-and-match Covid-19 booster vaccine policy would provide two distinct advantages: a stronger immune response to the extra shot,plus a lot less confusion for people seeking booster doses.\r\nE… [+5934 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Crucial test for Boeing's Starliner, built to carry humans, delayed until 2022", "description": null, "url": "https://www.cnn.com/2021/10/19/tech/boeing-starliner-flight-test-delay-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210813145119-05-boeing-nasa-starliner-0730-super-tease.jpg", "publishedAt": "2021-10-19T21:36:06Z", "content": "New York (CNN Business)Boeing's long-awaited spacecraft, called Starliner, is still facing a long road ahead before it'll be ready to fly astronauts, the company said on Tuesday. It is still working … [+4297 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Holly Thomas", "title": "Tucker Carlson's insulting attack on Pete Buttigieg", "description": "Tucker Carlson's wasn't alone among right-wing commentators in taunting Pete Buttigieg for his parental leave. These homophobic attacks - and their perpetuation of the toxic idea that taking time to bond with children and care for one's family is something 'o…", "url": "https://www.cnn.com/2021/10/19/opinions/tucker-carlson-pete-buttigieg-paternity-leave-thomas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019171218-carlson-buttigieg-split-super-tease.jpg", "publishedAt": "2021-10-19T21:31:07Z", "content": "Holly Thomas is a writer and editor based in London. She is morning editor at Katie Couric Media. She tweets @HolstaT. The opinions expressed in this commentary are solely those of the author. View m… [+5898 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Fisher and Jackie Wattles, CNN", "title": "Former lead Virgin Galactic test pilot takes new gig at Blue Origin", "description": "Mark \"Forger\" Stucky, who for six years headed the test pilot program at space company Virgin Galactic before he says he was fired earlier this year, is taking a job with the company's chief competitor, Blue Origin.", "url": "https://www.cnn.com/2021/10/19/tech/virgin-galactic-blue-origin-mark-forger-stucky-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211019111318-mark-forger-stucky-file-super-tease.jpg", "publishedAt": "2021-10-19T21:26:34Z", "content": "New York (CNN Business)Mark \"Forger\" Stucky, who for six years headed the test pilot program at space company Virgin Galactic before he says he was fired earlier this year, is taking a job with the c… [+4938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Yellin", "title": "Earn up to 100,000 bonus points plus new perks with these Southwest credit card offers", "description": "If you want to earn travel points to fly on Southwest Airlines, you'll find that the current sign-up offers on the Southwest personal and business credit cards are worth a look.", "url": "https://www.cnn.com/2021/10/19/cnn-underscored/southwest-credit-card-bonus-offers/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200505164923-underscored-southwest-airlines-plane-in-blue-sky.jpg?q=x_0,y_0,h_1800,w_3198,c_fill/w_800", "publishedAt": "2021-10-19T21:20:48Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through the LendingTree affiliate network if you apply and … [+16220 chars]"}]}