{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hauser, CNN", "title": "Nurse goes beyond duty and rescues a hospitalized patient's dog from the shelter", "description": "It was right after Thanksgiving that registered nurse Jennifer Smith got an early morning phone call from John Burley, one of her favorite patients. He was distraught about his beloved dog, Boomer.", "url": "https://www.cnn.com/2021/12/25/us/nurse-rescue-dog-patient-hospital-rome-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223162607-02-nurse-rescues-patients-dog-super-tease.jpg", "publishedAt": "2021-12-25T13:22:57Z", "content": "(CNN)It was right after Thanksgiving that registered nurse Jennifer Smith got an early morning phone call from John Burley, one of her favorite patients. He was distraught about his beloved dog, Boom… [+3688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Pfizer CEO shares thoughts on boosters and the future of Covid - CNN Video", "description": "Pfizer CEO Albert Bourla spoke with CNN Business' Paul R. La Monica about annual Covid-19 vaccines, the future of the virus, and getting the vaccine to low-income countries.", "url": "https://www.cnn.com/videos/business/2021/12/19/albert-bourla-pfizer-ceo-interview-mc-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207174111-omicron-news-042321-super-tease.jpg", "publishedAt": "2021-12-25T12:54:49Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "The most powerful telescope ever built is ready to launch", "description": "The James Webb Space Telescope, NASA's premier observatory of the next decade, is ready to launch to space. The telescope, scheduled for liftoff Saturday, will study exoplanets in new ways and look deeper into the universe than we've ever been able to before.", "url": "https://www.cnn.com/2021/12/25/world/james-webb-space-telescope-launch-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211112194804-08-james-webb-space-telescope-super-tease.jpg", "publishedAt": "2021-12-25T10:58:21Z", "content": "(CNN)It's a moment that has been decades in the making. The James Webb Space Telescope, NASA's premier space observatory of the next decade, is ready to launch Saturday from French Guiana. \r\nLive cov… [+5614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "At least 16 people dead in Greek shipwreck", "description": "At least 16 people died when their boat overturned off the Greek island of Paros in the central Aegean Sea on Friday, in the third maritime disaster involving migrants this week, the country's coastguard said.", "url": "https://www.cnn.com/2021/12/25/europe/migrant-boat-capsized-greece-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211225112036-greece-coast-guard-super-tease.jpg", "publishedAt": "2021-12-25T10:42:07Z", "content": "(CNN)At least 16 people died when their boat overturned off the Greek island of Paros in the central Aegean Sea on Friday, in the third maritime disaster involving migrants this week, the country's c… [+1570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ivana-kottasova\">Ivana Kottasová</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Maureen Chowdhury, CNN", "title": "The latest on the coronavirus pandemic and Omicron variant", "description": "Millions of people  are dealing with renewed restrictions and travel disruption over the holidays as both the Delta and Omicron coronavirus variants fuel an uptick in cases around the world. Follow here for the latest news updates.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-12-25-21-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224090550-01-holiday-travel-1223-super-tease.jpg", "publishedAt": "2021-12-25T10:14:43Z", "content": "As the highly contagious Omicron coronavirus variant continues to spread, some experts say it's past time to reconsider your face mask options -- especially if you're still wearing the cloth variety.… [+971 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Daily Covid-19 case rates have now surpassed Delta's surge. Hospitalizations so far have yet to match", "description": "As the highly contagious Omicron coronavirus variant continues to spread across the US this holiday season, the rate of daily Covid-19 cases detected has eclipsed those fueled by the Delta variant over the summer.", "url": "https://www.cnn.com/2021/12/25/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224221919-covid-test-distribution-ny-1224-super-tease.jpg", "publishedAt": "2021-12-25T10:00:41Z", "content": "(CNN)As the highly contagious Omicron coronavirus variant continues to spread across the US this holiday season, the rate of daily Covid-19 cases detected has eclipsed those fueled by the Delta varia… [+6694 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, Lauren Said-Moorhouse and Max Foster, CNN", "title": "Duchess of Cambridge gives surprise piano performance during Christmas concert", "description": "The Duchess of Cambridge has surprised British TV audiences with a piano performance during a special Christmas service that was shown on TV on Christmas Eve.", "url": "https://www.cnn.com/2021/12/25/uk/royal-christmas-intl-gbr-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211210071327-02-royal-newsletter-12-10-2021-super-tease.jpg", "publishedAt": "2021-12-25T09:25:25Z", "content": "(CNN)The Duchess of Cambridge has surprised British TV audiences with a piano performance during a special Christmas service that was shown on TV on Christmas Eve. \r\nKate took to the piano as part of… [+2199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Andrei Kolesnikov", "title": "Thirty years after the Soviet Union collapsed, Putin exploits nostalgia for the old regime", "description": "On the 30th anniversary of the fall of the Soviet Union, Andrei Kolesnikov looks back at the moment the flag above the Kremlin was lowered for the last time. Over the next three decades Putin has pushed the pedal on Soviet nostalgia for his own political gain.", "url": "https://www.cnn.com/2021/12/25/opinions/30th-anniversary-soviet-union-collapse-andrei-kolesnikov/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222134542-soviet-union-collapse-30-year-anniversary-file-042221-super-tease.jpg", "publishedAt": "2021-12-25T09:05:32Z", "content": "Andrei Kolesnikov is a senior fellow at Carnegie Moscow Center, and the author of several books on the political and social history of Russia, including a biography of the Russian reformer Yegor Gaid… [+5385 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "2 of the world's wealthiest countries shoot to the top of 'very high' risk travel list", "description": "As Omicron continues to rage around the world, the tiny European countries of Monaco and San Marino have shot to the top of the CDC's \"very high\" risk travel list. Here is the latest news this week from CNN Travel.", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-monaco-san-marino/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223115239-monaco-file-super-tease.jpg", "publishedAt": "2021-12-25T08:47:21Z", "content": "CNN's Forrest Brown, Tamara Hardingham-Gill, Lilit Marcus, Sheena McKenzie, Andy Rose, Francesca Street and Yong Xiong contributed to this report. Top image: Monaco's natural harbor (Photo by Adobe S… [+4 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "Surfer killed in fatal shark attack at California beach, officials say", "description": "A male surfer was killed in a shark attack in Morro Bay, California, on Christmas Eve, the Morro Bay Harbor Department confirmed to CNN.", "url": "https://www.cnn.com/2021/12/24/us/morro-bay-shark-attack/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224191250-morro-bay-shark-attack-1224-super-tease.jpg", "publishedAt": "2021-12-25T00:33:25Z", "content": "(CNN)A male surfer was killed in a shark attack in Morro Bay, California, on Christmas Eve, the Morro Bay Harbor Department confirmed to CNN. \r\n\"Harbor, Police and Fire Departments responded to a rep… [+972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Sidner, CNN", "title": "On the first Christmas since their dad died of Covid-19, a brother and sister face grief and share 'some things we wish you were here for'", "description": "On the eve of their first Christmas without their dad, Alec and Gabriella Walker continue to find ways to work through their pain, including by talking with other kids who are facing death honestly, helped by grown-ups committed to supporting them.", "url": "https://www.cnn.com/2021/12/24/us/kids-covid-dad-death-christmas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224154444-restricted-walker-family-super-tease.jpg", "publishedAt": "2021-12-24T21:11:36Z", "content": "By Sara Sidner, CNN\r\nUpdated 4:11 PM ET, Fri December 24, 2021\r\n (CNN)They heard their dad take his last breath.\r\nWith little warning four months ago, Alec and Gabriella's father, Billy Walker -- who… [+8085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "How Biden coulda woulda shoulda saved BBB", "description": "Was there anything else President Joe Biden could have done? Biden should use all the tools President Lyndon B. Johnson deployed if he wants a shot at passing some version of the Build Back Better bill next year, writes Julian Zelizer.", "url": "https://www.cnn.com/2021/12/24/opinions/biden-manchin-build-back-better-lbj-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223174030-biden-1223-super-tease.jpg", "publishedAt": "2021-12-24T20:51:33Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book \"Abraham Joshua Heschel: A life of Radical Amazement.\" Follow him … [+6167 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "Biden calls NORAD and updates children on Santa's progress across the globe", "description": "President Joe Biden made a Christmas Eve call to North American Aerospace Defense Command on Friday at the White House, updating children on Santa's progress across the globe as part of what NORAD Commander Gen. Glen VanHerck on the call called \"DOD's largest…", "url": "https://www.cnn.com/2021/12/24/politics/joe-biden-christmas-santa-norad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224141024-biden-norad-1224-super-tease.jpg", "publishedAt": "2021-12-24T19:17:14Z", "content": "Washington (CNN)President Joe Biden made a Christmas Eve call to North American Aerospace Defense Command on Friday at the White House, updating children on Santa's progress across the globe as part … [+2358 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Carma Hassan and Jason Hanna, CNN", "title": "Carnival cruise ship with 'small number' of Covid-19 cases books a new port after being denied entry to 2", "description": "A Carnival cruise ship that departed Miami has \"a small number\" of people aboard who have tested positive for Covid-19, and it has been denied entry to ports at two Caribbean islands, the cruise line said.", "url": "https://www.cnn.com/travel/article/carnival-freedom-cruise-ship-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224120502-carnival-cruise-freedom-covid-outbreak-super-tease.jpg", "publishedAt": "2021-12-24T19:05:50Z", "content": "(CNN) A Carnival cruise ship that departed Miami has \"a small number\" of people aboard who have tested positive for Covid-19, and it has been denied entry to ports at two Caribbean islands, the cruis… [+1777 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Michigan shooting suspect's parents willfully disregarded signs that their son was a threat, prosecutors say", "description": "Prosecutors in a filing say the parents of alleged Oxford High School shooter Ethan Crumbley are at a \"greater risk of flight\" now than when they were arraigned on involuntary manslaughter charges earlier this month and allege the couple \"willfully ignored th…", "url": "https://www.cnn.com/2021/12/24/us/michigan-school-shooting-suspect-parents/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211204225055-crumbley-family-mugshots-split-super-tease.jpg", "publishedAt": "2021-12-24T18:51:39Z", "content": "(CNN)Prosecutors in a filing say the parents of alleged Oxford High School shooter Ethan Crumbley are at a \"greater risk of flight\" now than when they were arraigned on involuntary manslaughter charg… [+4671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Nedelman and Veronica Stracqualursi, CNN", "title": "CDC shortens isolation time for health care workers with Covid-19", "description": "The US Centers for Disease Control and Prevention is shortening the isolation time for health care workers who test positive for Covid-19, as it anticipates a surge in hospitalizations due to the Omicron variant.", "url": "https://www.cnn.com/2021/12/24/politics/cdc-updates-isolation-guidance-health-care-workers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224101123-us-healthcare-worker-covid-test-1214-restricted-super-tease.jpg", "publishedAt": "2021-12-24T18:08:55Z", "content": "(CNN)The US Centers for Disease Control and Prevention is shortening the isolation time for health care workers who test positive for Covid-19, as it anticipates a surge in hospitalizations due to th… [+4094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Winter weather across the northern US could mean hazardous holiday travel, while record-breaking springlike temperatures warm the south", "description": "Jack Frost is taking over the northern US for the holiday weekend, delivering heavy snowfall, plummeting temperatures, and a white Christmas to the Pacific Northwest. The northern cold stops short of the southern US, where balmy springlike temperatures will l…", "url": "https://www.cnn.com/2021/12/24/weather/weather-christmas-holiday-forecast-atmospheric-river-snow-flooding-heat-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224103722-weather-snow-accum-122421-card-super-tease.jpg", "publishedAt": "2021-12-24T16:58:16Z", "content": "(CNN)Jack Frost is taking over the northern US for the holiday weekend, delivering heavy snowfall, plummeting temperatures, and a white Christmas to the Pacific Northwest. The northern cold stops sho… [+4563 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Opinion: Donald Trump's influence is fading", "description": "You'd be forgiven for thinking that the first anniversary of the January 6 attack on the US Capitol would be a day reserved for solemn reflection. Former President Donald Trump, however, seems to think it should be a day we all pay attention to him. He plans …", "url": "https://www.cnn.com/2021/12/24/opinions/state-of-trump-influence-fading-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223120901-donald-trump-file-071121-super-tease.jpg", "publishedAt": "2021-12-24T16:55:14Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5351 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand and Hannah Rabinowitz, CNN", "title": "New January 6 video shows three hours of violent and chaotic assault on police", "description": "The Justice Department this week released a three-hour video of a battle between rioters and the police at the US Capitol Building on January 6 where rioters brandished weapons, officers were viciously beaten, and a member of the mob died on Capitol steps.", "url": "https://www.cnn.com/2021/12/24/politics/january-6-video-capitol-hill-riot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321231141-capitol-hill-riot-0106-super-tease.jpg", "publishedAt": "2021-12-24T16:52:50Z", "content": "(CNN)The Justice Department this week released a three-hour video of a battle between rioters and the police at the US Capitol Building on January 6 where rioters brandished weapons, officers were vi… [+5088 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Is a fourth Covid-19 vaccine dose needed? US health officials say not yet", "description": "As Covid-19 cases continue to rise and the Omicron variant sweeps the world, some nations are rolling out fourth doses of coronavirus vaccine for the most vulnerable people.", "url": "https://www.cnn.com/2021/12/24/health/fourth-dose-covid-19-vaccine-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224104337-01-pfizer-vaccine-ny-1130-super-tease.jpg", "publishedAt": "2021-12-24T16:30:55Z", "content": "(CNN)As Covid-19 cases continue to rise and the Omicron variant sweeps the world, some nations are rolling out fourth doses of coronavirus vaccine for the most vulnerable people.\r\nIsraeli Prime Minis… [+5094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gawon Bae, CNN", "title": "Suga of BTS tests positive for Covid-19", "description": "Suga, a member of the K-pop supergroup BTS, has tested positive for Covid-19, according to a BIGHIT Music statement published on global fan community platform Weverse.", "url": "https://www.cnn.com/2021/12/24/entertainment/suga-bts-covid-positive/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224080409-bts-suga-super-tease.jpg", "publishedAt": "2021-12-24T16:13:20Z", "content": "(CNN)Suga, a member of the K-pop supergroup BTS, has tested positive for Covid-19, according to a BIGHIT Music statement published on global fan community platform Weverse.\r\nThe company said that Sug… [+826 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, CNN", "title": "Daunte Wright's mother says she's thankful for the guilty verdicts against ex-officer Kim Potter", "description": "Daunte Wright's mother said Friday the guilty verdict against former police officer Kim Potter for fatally shooting Wright isn't quite justice, but it is accountability, and she's thankful for it.", "url": "https://www.cnn.com/2021/12/24/us/daunte-wright-mother-katie-bryant-kim-potter-verdicts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224092104-katie-bryant-reax-new-day-1224-super-tease.jpg", "publishedAt": "2021-12-24T16:05:56Z", "content": "(CNN)Daunte Wright's mother said Friday the guilty verdict against former police officer Kim Potter for fatally shooting Wright isn't quite justice, but it is accountability, and she's thankful for i… [+1782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Bus or train? World's first 'dual-mode vehicle' to begin operating in Japan", "description": "The world's first dual-mode vehicle, equally at home on road and rail, is set to make its public debut on Saturday in the town of Kaiyo in Japan's Tokushima prefecture.", "url": "https://www.cnn.com/2021/12/24/business/dual-mode-vehicle-japan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224104043-dual-mode-vehicle-kaiyo-japan-file-restricted-super-tease.jpg", "publishedAt": "2021-12-24T16:00:16Z", "content": "TokyoIt's a bus, it's a train, it's a DMV! The world's first dual-mode vehicle, equally at home on road and rail, is set to make its public debut on Saturday in the town of Kaiyo in Japan's Tokushima… [+1329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan and Homero De la Fuente, CNN", "title": "Washington Football Team player Deshazor Everett involved in a fatal crash", "description": "Washington Football Team player Deshazor Everett is being treated for \"serious but non-life-threatening injuries\" after he was involved in a fatal crash Thursday in Loudoun County, Virginia, according to the Loudoun County Sheriff's Office.", "url": "https://www.cnn.com/2021/12/24/football/deshazor-everett-fatal-wreck/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224102950-01-deshazor-everett-file-super-tease.jpg", "publishedAt": "2021-12-24T15:59:01Z", "content": "(CNN)Washington Football Team player Deshazor Everett is being treated for \"serious but non-life-threatening injuries\" after he was involved in a fatal crash Thursday in Loudoun County, Virginia, acc… [+686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "How a kind gesture and a strand of Christmas lights connected a community", "description": "In Towson, Maryland, there is a street called Dunkirk Road. There are 32 homes on Dunkirk, where families of various races, religions, and political views live. The neighbors are all close friends.", "url": "https://www.cnn.com/2021/12/24/entertainment/christmas-lights-towson-community/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224094511-03-neighborhood-christmas-lights-connecting-super-tease.jpg", "publishedAt": "2021-12-24T15:41:52Z", "content": "(CNN)In Towson, Maryland, there is a street called Dunkirk Road. There are 32 homes on Dunkirk, where families of various races, religions, and political views live. The neighbors are all close frien… [+3877 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Terry Ward, CNN", "title": "Acts of kindness make one terminally ill boy's French Polynesian dream come true", "description": "Strangers banded together to send 8-year-old Mathias Pascal and his family to French Polynesia after he was diagnosed with terminal brain cancer. He's dreamed of visiting the islands since he first saw the Disney film \"Moana.\"", "url": "https://www.cnn.com/travel/article/french-polynesia-mathias-pascal-dream-trip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223143222-05-french-polynesia-dream-trip-super-tease.jpg", "publishedAt": "2021-12-24T15:40:17Z", "content": "Top image: Mathias Pascal and his father, Eric (at front), with his uncle and aunt (standing). Photo courtesy Aline PascalTerry Ward is a Florida-based travel writer and scuba diver who loves French … [+74 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Tess Taylor", "title": "Joan Didion is a light in this disorienting time", "description": "For those of us who did count Joan Didion as a literary hero (and there are many), it didn't really matter when you opened her books...Didion's language would somehow match the moment, writes Tess Taylor", "url": "https://www.cnn.com/2021/12/24/opinions/joan-didion-taylor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223124501-01-joan-didion-file-2005-super-tease.jpg", "publishedAt": "2021-12-24T14:36:08Z", "content": "Tess Taylor is the author of the poetry collections \"Work &amp; Days,\" \"The Forage House\" and most recently, \"Rift Zone\" and \"Last West: Roadsongs for Dorothea Lange.\" Views expressed in this comment… [+6616 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Why you should upgrade your mask as the Omicron variant spreads", "description": "As the Omicron variant spreads, it's time to upgrade from your cloth face masks. Experts explain why medical-grade masks -- such as surgical/disposable masks and N95 and KN95 respirators -- are better options now and what people should do with the cloth masks…", "url": "https://www.cnn.com/2021/12/24/health/cloth-mask-omicron-variant-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222162410-k95-mask-covid-010621-file-super-tease.jpg", "publishedAt": "2021-12-24T14:22:34Z", "content": "(CNN)As the highly contagious Omicron coronavirus variant continues to spread, some experts say it's past time to reconsider your face mask options -- especially if you're still wearing the cloth var… [+7253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "TV OT: The best shows of 2021", "description": "From 'Succession' to 'The Sex Lives of College Girls,' 'WandaVision' to 'White Lotus,' streaming hits, reboots and network TV newcomers that worked, here's a look at some of the top television of 2021.", "url": "https://www.cnn.com/2021/12/24/entertainment/best-shows-tv-streaming-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211115142639-the-sex-lives-of-college-girls-hbo-max-super-tease.jpg", "publishedAt": "2021-12-24T13:46:17Z", "content": "TV OT is a weekly look at what CNN's entertainment team is watching since too much television has us all working overtime.\r\n (CNN)Assembling a \"best of\" TV list for 2021 represented a daunting task, … [+5824 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "Biden to lift travel restrictions on southern African countries that were put in place due to Omicron", "description": "The Biden administration is lifting travel restrictions on eight southern African countries that were put in place last month after the Omicron variant was first identified in South Africa, a White House official tells CNN.", "url": "https://www.cnn.com/2021/12/24/politics/travel-restrictions-african-countries-omicron/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211210112221-airport-security-check-point-washington-112221-super-tease.jpg", "publishedAt": "2021-12-24T13:45:56Z", "content": "(CNN)The Biden administration is lifting travel restrictions on eight southern African countries that were put in place last month after the Omicron variant was first identified in South Africa, a Wh… [+198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Don Lincoln", "title": "How the James Webb Space Telescope could change our understanding of the universe", "description": "Don Lincoln writes that there are questions about the universe that need answering, which require new capabilities.  That's why the James Webb Space Telescope is so important.  It will look further back in time than the Hubble can, and it will answer question…", "url": "https://www.cnn.com/2021/12/24/opinions/james-webb-space-telescope-launch-lincoln/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223134447-02-james-webb-space-telescope-roll-out-1223-super-tease.jpg", "publishedAt": "2021-12-24T13:45:47Z", "content": "Don Lincoln is a senior scientist at the Fermi National Accelerator Laboratory. He is the author of several science books for general audiences, including the best-selling audio book \"The Theory of E… [+7101 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nima Elbagir and Arnaud Siad, CNN", "title": "Ethiopia to lose access to lucrative US trade program following CNN investigation", "description": "The White House will eject Ethiopia from a trade program between sub-Saharan African countries and the United States over human rights violations, according to a statement Thursday.", "url": "https://www.cnn.com/2021/12/24/africa/ethiopia-us-trade-agoa-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211005231933-new-ethiopian-airlines-investigation-illustration-story-top-super-tease.jpg", "publishedAt": "2021-12-24T13:41:37Z", "content": "(CNN)The White House will eject Ethiopia from a trade program between sub-Saharan African countries and the United States over human rights violations, according to a statement Thursday. \r\nEthiopia w… [+2326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Latinos still scrambling due to Covid-19 in New Jersey are on high alert over Omicron", "description": "As she knocked on doors across New Jersey talking about Covid-19, Nayeli Salazar de Noguera couldn't forget about how the virus nearly killed her grandmother last year. She knew firsthand the toll the virus took on Latinos before the Omicron variant hit the s…", "url": "https://www.cnn.com/2021/12/24/us/new-jersey-omicron-coronavirus-latinos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222124831-01-new-jersey-omicron-coronavirus-latinos-super-tease.jpg", "publishedAt": "2021-12-24T13:16:40Z", "content": "(CNN)As she knocked on doors across New Jersey talking about Covid-19, Nayeli Salazar de Noguera couldn't forget about how the virus nearly killed her grandmother last year. She knew firsthand the to… [+7270 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, Danielle Herman and Justin Lape, CNN", "title": "There's a new drug to prevent Covid-19, but there won't be nearly enough for Americans who are eligible", "description": "For Americans who suffer from weak immune systems, it felt like a miracle occurred on December 8. That day, the US Food and Drug Administration authorized a drug to help keep immune-compromised people from getting infected with the coronavirus.", "url": "https://www.cnn.com/2021/12/24/health/prevent-covid-19-evusheld/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223161633-evushield-file-super-tease.jpg", "publishedAt": "2021-12-24T12:38:39Z", "content": "(CNN)For Americans who suffer from weak immune systems, it felt like a miracle occurred on December 8. That day, the US Food and Drug Administration authorized a drug to help keep immune-compromised … [+23467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez\nPhotos and reporting by Lynsey Addario", "title": "These women are fighting for their Indigenous land and the survival of the Amazon", "description": "Indigenous women in Brazil are fighting rampant deforestation, extractive activities and the worsening climate catastrophe in the Amazon.", "url": "https://www.cnn.com/2021/12/24/world/indigenous-women-amazon-climate-environment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211221144019-08-female-activists-amazon-restricted-super-tease.jpg", "publishedAt": "2021-12-24T12:13:12Z", "content": "By Rachel RamirezPhotos and reporting by Lynsey Addario\r\nUpdated 7:13 AM ET, Fri December 24, 2021\r\n (CNN)Indigenous women in Brazil have traditionally been excluded from taking on leadership roles t… [+9237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy and Emma Tucker, CNN", "title": "Local officials call on Idaho sheriff to resign after he allegedly made disparaging comments about Native Americans", "description": "Members of a southeastern Idaho youth church group were being driven around by their chaperone last month, delivering Thanksgiving cards in the neighborhood to those they were thankful for when they decided last minute to stop at the home of the county sherif…", "url": "https://www.cnn.com/2021/12/24/us/idaho-sheriff-disparaging-comments-native-americans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224010924-idaho-sheriff-craig-rowland-super-tease.jpg", "publishedAt": "2021-12-24T11:56:53Z", "content": "(CNN)Members of a southeastern Idaho youth church group were being driven around by their chaperone last month, delivering Thanksgiving cards in the neighborhood to those they were thankful for when … [+8732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "Omicron is a game-changer for Covid-19 vaccines", "description": "For triply vaccinated persons, the appearance of Omicron just as Christmas and New Year's celebrations are about to begin is extremely discouraging but health-wise, it may be miserable, but surely is not a catastrophe. For unvaccinated persons -- well, here w…", "url": "https://www.cnn.com/2021/12/24/opinions/omicron-and-covid-19-vaccines-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211221181650-israel-covid-vaccine-file-super-tease.jpg", "publishedAt": "2021-12-24T11:39:10Z", "content": "Kent Sepkowitz is a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View more opinion on CNN.\r\n (CNN)… [+5926 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "The top 10 business stories of 2021 - CNN", "description": "The billionaire space race, Facebook's biggest crisis, cyberattacks holding industries hostage -- all while the economy dashed to re-open. CNN's Christine Romans counts down the top 10 business stories of 2021.", "url": "https://www.cnn.com/videos/business/2021/12/23/top-10-business-stories-2021.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223140707-top-10-business-stories-2021-2-super-tease.jpg", "publishedAt": "2021-12-24T11:29:29Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Uncertainty United: Fans left in the lurch by Premier League's Covid crisis", "description": "It's a commonly held view that football is nothing without fans, but as the Premier League enters the traditional hectic Christmas and New Year period, supporters of the 20 top-flight clubs are left with the dilemma of whether to keep cheering on their teams …", "url": "https://www.cnn.com/2021/12/24/football/premier-league-fans-covid-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224095240-werner-tease-super-tease.jpg", "publishedAt": "2021-12-24T10:00:03Z", "content": "(CNN)It's a commonly held view that football is nothing without fans, but as the Premier League enters the traditional hectic Christmas and New Year period, supporters of the 20 top-flight clubs are … [+9767 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "The couple who met on a train on Christmas Day", "description": "Linda Wenger was traveling from New York City to Connecticut to visit family on Christmas Day, when she struck up a conversation with Michael McTwigan, who was on his way to volunteer at a food drive. The two strangers connected, and 10 years on they're marri…", "url": "https://www.cnn.com/travel/article/chance-encounters-train-christmas-romance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223050552-03-xmas-chance-encounter-b-super-tease.jpg", "publishedAt": "2021-12-24T09:47:27Z", "content": "(CNN) On Christmas morning 2011, Linda Wenger boarded a Metro-North train from New York's Grand Central Station to head upstate to Katonah.\r\nShe was in her mid-50s and had been divorced for 10 years.… [+10967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, Ray Sanchez and Adrienne Broaddus, CNN", "title": "Ex-officer Kim Potter wouldn't have been convicted in Daunte Wright's fatal shooting years ago, legal experts say", "description": "The conviction of former Minnesota police officer Kim Potter in the fatal shooting of Daunte Wright would not have happened just a few years ago, according to legal experts surprised by the jury's verdict.", "url": "https://www.cnn.com/2021/12/24/us/kim-potter-conviction-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223152122-01-potter-verdict-reaction-super-tease.jpg", "publishedAt": "2021-12-24T09:24:15Z", "content": "(CNN)The conviction of former Minnesota police officer Kim Potter in the fatal shooting of Daunte Wright would not have happened just a few years ago, according to legal experts surprised by the jury… [+6660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "What to do when those around you are not wearing masks? An expert weighs in about Christmas travel", "description": "With holiday travel returning to pre-pandemic levels, a health expert is offering advice for those planning to visit loved ones for Christmas, given the surge in Covid-19 cases in many parts of the country.", "url": "https://www.cnn.com/2021/12/24/health/us-coronavirus-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224013225-vaccination-file-12202021-restricted-super-tease.jpg", "publishedAt": "2021-12-24T09:17:37Z", "content": "(CNN)With holiday travel returning to pre-pandemic levels, a health expert is offering advice for those planning to visit loved ones for Christmas, given the surge in Covid-19 cases in many parts of … [+5746 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Flora Charner, CNN", "title": "Pel: Brazilian soccer legend out of hospital in time for Christmas", "description": "Brazilian soccer legend Pelé has been hospitalized for chemotherapy treatment of a colon tumor Wednesday, a spokesperson at Sao Paulo's Albert Einstein hospital confirmed to CNN.", "url": "https://www.cnn.com/2021/12/24/football/pele-out-of-hospital-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211001092051-pele-super-tease.jpg", "publishedAt": "2021-12-24T08:16:37Z", "content": "(CNN)Brazilian soccer legend Pelé has left the hospital where he was undergoing cancer treatment, he said in a tweet on Thursday.\r\n\"The photo of me smiling is not in vain. As promised, I'm going to s… [+1529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson, CNN", "title": "Here's how to track Santa around the world, thanks to NORAD", "description": "Santa Claus has packed his sleigh with toys for all the good girls and boys and he has made sure the reindeer are secured for takeoff. Now, they are traveling around the world to visit millions of households.", "url": "https://www.cnn.com/2021/12/24/us/norad-track-santa-2021-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223135340-02-norad-santa-tracker-2021-super-tease.jpg", "publishedAt": "2021-12-24T06:56:52Z", "content": "(CNN)Santa Claus has packed his sleigh with toys for all the good girls and boys and he has made sure the reindeer are secured for takeoff. Now, they are traveling around the world to visit millions … [+1781 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "At least 38 people killed in Bangladesh ferry fire", "description": "At least 38 people have died in Bangladesh after a fire swept through a launch on the Sugandha River in Bangladesh, an official said on Friday.", "url": "https://www.cnn.com/2021/12/24/asia/bangladesh-fire-deaths-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211224011542-jhalakathi-bangladesh-map-super-tease.jpg", "publishedAt": "2021-12-24T06:35:56Z", "content": "Dhaka, BangladeshAt least 38 people have died in Bangladesh after a fire swept through a launch on the Sugandha River in Bangladesh, an official said on Friday.\r\n\"We have recovered 38 bodies so far,\"… [+553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Helen Regan and Adam Renton, CNN", "title": "The latest on the coronavirus pandemic and Omicron variant", "description": "The Omicron variant has now been detected in every US state and health officials warn more people are expected to get infected as they gather ahead of the Christmas holiday. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-12-24-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-12-24T06:15:22Z", "content": "The US Food and Drug Administration on Thursday authorized Merck's antiviral pill, molnupiravir, to treat Covid-19.\r\nThis is the second Covid-19 antiviral pill authorized for ill people to take at ho… [+1918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Junko Ogura, CNN", "title": "Japan says it won't send government officials to Beijing 2022 Winter Olympics", "description": "Japan will not send any senior officials or Cabinet ministers to the Beijing Winter Olympics in February, the government said Friday -- but stopped short of calling the decision a diplomatic boycott.", "url": "https://www.cnn.com/2021/12/24/asia/japan-beijing-winter-olympics-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223223948-beijing-winter-olympics-file-12212021-super-tease.jpg", "publishedAt": "2021-12-24T05:07:14Z", "content": "Tokyo (CNN)Japan will not send any senior officials or Cabinet ministers to the Beijing Winter Olympics in February, the government said Friday -- but stopped short of calling the decision a diplomat… [+1758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "Trump pushes one truth and hides another", "description": "There are things that former President Donald Trump wants to talk about, like vaccines, and things he'd rather keep quiet, like what exactly happened in the White House leading up to January 6.", "url": "https://www.cnn.com/2021/12/24/politics/trump-vaccine-election-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223120901-donald-trump-file-071121-super-tease.jpg", "publishedAt": "2021-12-24T05:01:04Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here. \r\n (CNN)There are things that former President Donald Trump wants to talk about, lik… [+5431 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gawon Bae and Helen Regan, CNN", "title": "South Korea pardons disgraced former President Park Geun-hye", "description": "The South Korean government has pardoned former President Park Geun-hye, who was serving 22 years in prison for corruption, the country's Justice Ministry said on Friday.", "url": "https://www.cnn.com/2021/12/23/asia/south-korea-park-pardoned-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223214644-park-geun-hye-file-08072017-super-tease.jpg", "publishedAt": "2021-12-24T04:32:05Z", "content": "Seoul, South Korea (CNN)The South Korean government has pardoned former President Park Geun-hye, who was serving 22 years in prison for corruption, the country's Justice Ministry said on Friday.\r\nPar… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianna Cerinni, CNN", "title": "Qatar's ambitions to become 'the art Mecca of the Middle East'", "description": "Qatar has announced an ambitious plan to expand its public art program as it prepares to play host to the 2022 Fifa World Cup.", "url": "https://www.cnn.com/style/article/qatar-museums-outdoor-art/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211214144256-01-qatar-museums-outdoor-art-121421-super-tease.jpg", "publishedAt": "2021-12-24T03:37:25Z", "content": "artsPublished 24th December 2021\r\nThe Middle East nation of Qatar has announced an ambitious plan to expand its public art program as it prepares to play host to the 2022 Fifa World Cup. \r\nLeading th… [+7517 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Yara Enany, CNN", "title": "How a centuries-old tradition in the Maldives could safeguard tuna for the future", "description": "A group of Maldivian fishermen lines up at the back of a boat. As they cast their fishing rods and barbless hooks into the water, they lure in fish by throwing tiny baitfish on the surface. The trick is to create an illusion of prey for the tuna.", "url": "https://www.cnn.com/travel/article/maldives-pole-line-fishing-tuna-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211216095717-maldives-caught-tuna-super-tease.jpg", "publishedAt": "2021-12-24T03:23:30Z", "content": "Yara Enany, CNNPublished 24th December 2021\r\n(CNN) A group of Maldivian fishermen lines up at the back of a boat. As they cast their fishing rods and barbless hooks into the water, they lure in fish … [+2424 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Priya Singh", "title": "This holiday, let's stop this social media pretending", "description": "We've all shared this experience. The perfect red envelope with the green holly stamp arrives in our mailbox. Inside is a long holiday letter, dotted with the photos of flawless families. Everyone knows no one is that perfect. Don't get me wrong, I love my fr…", "url": "https://www.cnn.com/2021/12/23/opinions/social-media-pretend-in-the-holidays-singh/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211208164803-teenagers-social-media-vls-super-tease.jpeg", "publishedAt": "2021-12-24T02:39:56Z", "content": "Priya Singh is the chief strategy officer of Stanford Health Care and senior associate dean of Stanford Medicine. The opinions expressed in this commentary are hers. View more opinion at CNN.\r\n (CNN)… [+4412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "Federal prosecutors question legal fee arrangement in case against former Trump adviser", "description": "Federal prosecutors in New York have asked a judge to inquire about potential conflicts of interest in their case against an employee of Tom Barrack, a former adviser to then-President Donald Trump who is facing federal foreign lobbying charges.", "url": "https://www.cnn.com/2021/12/23/politics/trump-adviser-tom-barrack-matthew-grimes-legal-fee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223153841-thomas-barrack-april-2019-super-tease.jpg", "publishedAt": "2021-12-24T02:12:38Z", "content": "(CNN)Federal prosecutors in New York have asked a judge to inquire about potential conflicts of interest in their case against an employee of Tom Barrack, a former adviser to then-President Donald Tr… [+3547 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Thailand seizes $30 million of crystal meth hidden in boxing punch bags", "description": "Thai authorities have seized crystal methamphetamine with a street value of almost $30 million stuffed inside boxing punch bags bound for Australia, officials said on Thursday.", "url": "https://www.cnn.com/2021/12/23/asia/thailand-crystal-meth-punching-bags-intl-hnk-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223205857-01-thailand-crystal-meth-punching-bags-super-tease.jpg", "publishedAt": "2021-12-24T02:10:58Z", "content": "Bangkok, ThailandThai authorities have seized crystal methamphetamine with a street value of almost $30 million stuffed inside boxing punch bags bound for Australia, officials said on Thursday.\r\nCust… [+1565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Biden signs bill banning goods from China's Xinjiang over forced labor", "description": "US President Joe Biden on Thursday signed into law legislation that bans imports from China's Xinjiang region over concerns about forced labor, the White House said, provoking an angry Chinese condemnation.", "url": "https://www.cnn.com/2021/12/23/business/biden-bans-xinjiang-imports-china-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223174030-biden-1223-super-tease.jpg", "publishedAt": "2021-12-24T01:55:49Z", "content": "WashingtonUS President Joe Biden on Thursday signed into law legislation that bans imports from China's Xinjiang region over concerns about forced labor, the White House said, provoking an angry Chin… [+2668 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell", "title": "19-year-old charged in armed carjacking incident involving Democratic lawmaker", "description": "Federal prosecutors have charged a Delaware man with carjacking Democratic Rep. Mary Gay Scanlon of Pennsylvania and using a firearm during a crime of violence, the Justice Department announced Thursday.", "url": "https://www.cnn.com/2021/12/23/politics/mary-gay-scanlon-hijacking-suspect-charged/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223151856-mary-gay-scanlon-sept-2021-super-tease.jpg", "publishedAt": "2021-12-24T00:26:29Z", "content": "(CNN)Federal prosecutors have charged a Delaware man with carjacking Democratic Rep. Mary Gay Scanlon of Pennsylvania and using a firearm during a crime of violence, the Justice Department announced … [+1643 chars]"}]}