{"status": "ok", "totalResults": 112, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Rebecca Cairns; video by Megan Alldridge and Stefanie Blendis, CNN", "title": "This palm tree nearly went extinct. Now its super-berries are helping to save it", "description": "The juçara tree, native to Brazil's Atlantic Forest, was nearly harvested to extinction for its palm hearts. Now, a local startup is helping farmers sell the tree's berries instead -- keeping the trees standing and helping the forest to flourish.", "url": "https://www.cnn.com/2021/03/30/world/jucara-palm-tree-agroforestry-brazil-c2e-hnk-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324234641-04-jucara-berries-agroforestry-c2e-super-tease.jpg", "publishedAt": "2021-03-30T11:16:26Z", "content": "Call to Earth is a CNN initiative in partnership with Rolex. Laury Cullen is a Rolex Awards Laureate.\r\n (CNN)Small, round, and midnight blue, you'd be forgiven for mistaking the juçara berry for its … [+5550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Tuskegee isn't the only reason why some Black people are hesitant to get the coronavirus vaccine", "description": "Fewer Black people have received Covid-19 vaccines than White people. Some people have attributed these lower rates to distrust stemming from the Tuskegee Syphilis Study of the 1930s to 1970s -- but there are modern factors at play.", "url": "https://www.cnn.com/2021/03/30/health/tuskegee-syphilis-study-vaccine-distrust-reasons-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329130447-moderna-vaccination-0323-maryland-super-tease.jpg", "publishedAt": "2021-03-30T11:10:03Z", "content": "(CNN)To get more Black people vaccinated against coronavirus infections, Dr. Kimberly Manning is determined to keep doing what she has had a conviction to do since before the pandemic hit. \r\n\"I'm det… [+9813 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "The cost to fix America's crumbling infrastructure? Nearly $2.6 trillion, engineers say", "description": "With the money from his $1.9 trillion coronavirus relief law starting to flow, President Joe Biden is turning his attention to his next massive investment package -- a two-part infrastructure and jobs proposal that could total $3 trillion.", "url": "https://www.cnn.com/2021/03/30/politics/infrastructure-us-investment-cost-engineers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329163007-01-rail-construction-file-restricted-super-tease.jpg", "publishedAt": "2021-03-30T11:02:50Z", "content": "(CNN)With the money from his $1.9 trillion coronavirus relief law starting to flow, President Joe Biden is turning his attention to his next massive investment package -- a two-part infrastructure an… [+4093 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Danielle Campoamor", "title": "All pregnant people deserve a law like New Zealand's", "description": "Danielle Campoamor recalls her painful experience losing a pregnancy and going back to work the next day. She says that while New Zealand's recent policy allowing bereavement leave for pregnancy and infant loss is a wonderful step forward, it also makes her f…", "url": "https://www.cnn.com/2021/03/30/opinions/new-zealand-bereavement-leave-for-miscarriage-should-be-universal-campoamor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329202820-sad-woman-stock-super-tease.jpg", "publishedAt": "2021-03-30T11:01:19Z", "content": "Danielle Campoamor is a freelance editor and writer published in The New York Times, Washington Post, Vogue, Glamour and others. She received an award from Planned Parenthood for media excellence. Th… [+6732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz, CNN Business", "title": "Google Maps adding new features, including augmented reality for (eventually) getting around airports and malls", "description": "You may not be traveling or hanging out in malls much these days, but Google Maps is preparing for a return to such places in the not-so-distant future: It's rolling out a new feature that uses augmented reality to navigate malls, airports, and train stations.", "url": "https://www.cnn.com/2021/03/30/tech/google-maps-airport-mall-navigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329193511-05-google-maps-new-features-airport-mall-navigation-super-tease.jpg", "publishedAt": "2021-03-30T10:43:16Z", "content": "San Francisco (CNN Business)You may not be traveling or hanging out in malls much these days, but Google Maps is preparing for a return to such places in the not-so-distant future: It's rolling out a… [+3690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "See how tattoo art has changed since the 18th century", "description": "The practice of inking one's skin has a complex history, and like other forms of art, its own set of cultural traditions and ephemera.", "url": "https://www.cnn.com/style/article/tattoo-art-henk-schiffmacher-taschen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210318121323-06-tattoo-art-henk-schiffmacher-book-restricted-super-tease.jpg", "publishedAt": "2021-03-30T10:40:48Z", "content": "artsPublished 30th March 2021\r\nTattooing can be traced back over 5,000 years to a naturally mummified human named Ötzi, whose 61 charcoal-incised markings are believed to be the oldest tattoos in the… [+7236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for March 30: Coronavirus, White House, voter suppression, Hong Kong, Brazil", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/03/30/us/five-things-march-30-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329180307-03-oakland-homelessness-vaccine-story-super-tease.jpg", "publishedAt": "2021-03-30T10:28:53Z", "content": "Get '5 Things' in your inbox\r\nIf your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' n… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Cleveland Clinic and IBM hope their tech partnership could help prevent the next pandemic", "description": "After a year in which scientists raced to understand Covid-19 and to develop treatments and vaccines to stop its spread, Cleveland Clinic is partnering with IBM to use next-generation technologies to advance healthcare research — and potentially prevent the n…", "url": "https://www.cnn.com/2021/03/30/tech/ibm-cleveland-clinic-quantum-computing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329190622-ibm-cleveland-clinic-quantum-computing-super-tease.jpg", "publishedAt": "2021-03-30T10:19:32Z", "content": "New York (CNN Business)After a year in which scientists raced to understand Covid-19 and to develop treatments and vaccines to stop its spread, Cleveland Clinic is partnering with IBM to use next-gen… [+5426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dorit Reiss", "title": "When Trump's team tried to pressure the CDC, they crossed a line", "description": "As scientists like former CDC director Robert Redfield provide more details on how the Trump administration tried to change some of the CDC's reports on the pandemic, Americans must take steps to ensure that intervention doesn't happen again, writes Dorit Rei…", "url": "https://www.cnn.com/2021/03/30/opinions/covid-cdc-trump-pressure-reiss/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200529160300-05-robert-redfield-file-super-tease.jpg", "publishedAt": "2021-03-30T10:15:08Z", "content": "Dorit Reiss is the James Edgar Hervey Professor of Law at the University of California, Hastings College of the Law. The opinions expressed in this commentary are solely those of the author. View mor… [+4503 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "Meet the doctor on a quest to get the homeless vaccinated against Covid-19", "description": "When the British government released its guidance on who should be first in line for the Covid-19 vaccine last year, Dr. Zahid Chauhan was surprised to see that one particularly vulnerable group of his patients had been left off the priority list: The homeles…", "url": "https://www.cnn.com/2021/03/30/uk/coronavirus-homeless-vaccinations-intl-cmd-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210319181121-01-nhs-homeless-vaccinations-super-tease.jpg", "publishedAt": "2021-03-30T09:34:12Z", "content": "London (CNN)When the British government released its guidance on who should be first in line for the Covid-19 vaccine last year, Dr. Zahid Chauhan was surprised to see that one particularly vulnerabl… [+6324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "Community awareness thwarted attempted school attacks, new Secret Service report says", "description": "Vigilant community members attuned to warning signs from potential shooters were instrumental in thwarting many school attacks between 2006 and 2018, according to a report from the US Secret Service that gives new insight into how attention to concerning beha…", "url": "https://www.cnn.com/2021/03/30/politics/secret-service-mass-shootings-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210215141805-parkland-memorial-super-tease.jpg", "publishedAt": "2021-03-30T09:09:57Z", "content": "(CNN)Vigilant community members attuned to warning signs from potential shooters were instrumental in thwarting many school attacks between 2006 and 2018, according to a report from the US Secret Ser… [+4612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare and Paul Sillers, CNN", "title": "Supersonic airliner could fly LA to Tokyo in under three hours", "description": "The newly unveiled Aerion AS3 is a supersonic commercial airliner that promises to travel at Mach 4+ speeds, allowing it to jet between LA and Tokyo in under three hours.", "url": "https://www.cnn.com/travel/article/aerion-as3-supersonic-jet/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329185830-aerion-as31-super-tease.jpg", "publishedAt": "2021-03-30T09:04:53Z", "content": "(CNN) Right now, a lot of us can't even fly out of our own countries, but if Florida-based planemakers Aerion are to be believed, by the end of the decade we'll be able to jet between Los Angeles and… [+5519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "A South Dakota wildfire forced hundreds of evacuations while other blazes shut down Mount Rushmore", "description": "A wildfire burning near the outskirts of Rapid City, South Dakota, has forced the evacuation of 400 to 500 homes, officials said Monday.", "url": "https://www.cnn.com/2021/03/30/us/south-dakota-fires-homes-evacuated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330034931-03-south-dakota-fire-0329-super-tease.jpg", "publishedAt": "2021-03-30T08:54:24Z", "content": "(CNN)A wildfire burning near the outskirts of Rapid City, South Dakota, has forced the evacuation of 400 to 500 homes, officials said Monday.\r\nThe Schroeder Fire, burning in Pennington County, just a… [+2180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In photos: The Worm Moon around the world", "description": "This month's full moon will be the year's first supermoon, an astronomical phenomenon where the moon is slightly closer to Earth and therefore appears bigger and brighter in the sky.", "url": "https://www.cnn.com/2021/03/30/world/gallery/march-supermoon-worm-moon-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330023035-09-worm-moon-march-2021-unf-super-tease.jpg", "publishedAt": "2021-03-30T08:35:23Z", "content": "A bird is silhouetted against the full moon in St. Petersburg, Russia, on Monday, March 29.\r\nUpdated 4:35 AM ET, Tue March 30, 2021\r\nA bird is silhouetted against the full moon in St. Petersburg, Rus… [+549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Joshua Berlinger, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-03-30-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-03-30T07:54:17Z", "content": "Syrian President Bashar al-Assad and his wife, Asma, have recovered from Covid-19 and are no longer symptomatic, the president's office said in a statement on Tuesday.\r\nAssad's office said in a state… [+892 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hollie Silverman and Jamiel Lynch, CNN", "title": "Central Tennessee braces for more weather misery after weekend flooding killed 7 people and caused widespread damage", "description": "After enduring widespread flooding -- that killed seven people, knocked out power to thousands and damaged homes and businesses -- Central Tennessee is bracing for more potentially devastating rainfall.", "url": "https://www.cnn.com/2021/03/30/us/nashville-flooding-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330013748-01-tennessee-flooding-210329-super-tease.jpg", "publishedAt": "2021-03-30T07:28:25Z", "content": "(CNN)After enduring widespread flooding -- that killed seven people, knocked out power to thousands and damaged homes and businesses -- Central Tennessee is bracing for more potentially devastating r… [+2864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "CDC chief says latest Covid-19 numbers scare her. Here's what could be ahead and how to change the country's course", "description": "New Covid-19 cases, hospitalizations and deaths are beginning to rise in the US again, one of the country's top health leaders said Monday.", "url": "https://www.cnn.com/2021/03/30/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330004147-new-york-hospital-0329-super-tease.jpg", "publishedAt": "2021-03-30T07:20:58Z", "content": "(CNN)New Covid-19 cases, hospitalizations and deaths are beginning to rise in the US again, one of the country's top health leaders said Monday. \r\nThe latest findings, shared by Centers for Disease C… [+7280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Mansour, CNN", "title": "5 exercises to combat chronic aches from too much computer time", "description": "Combat chronic aches and stiffness from sitting at the computer with this stretch routine from fitness expert Stephanie Mansour. These exercises address different parts of your body, so you feel loose again after an excessive amount of screen time.", "url": "https://www.cnn.com/2021/03/30/health/exercises-for-computer-users-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210222135150-20210222-stretches-to-ease-chronic-computer-pain-super-tease.jpg", "publishedAt": "2021-03-30T07:10:02Z", "content": "(CNN)With virtual classes and at-home work, it's no wonder why many people are experiencing more pain in the neck and back than usual. Sitting in a chair all day, your back slouched and neck bent, is… [+5327 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kocha Olarn and Helen Regan, CNN", "title": "Thailand pushes back thousands fleeing Myanmar as death toll surpasses 500", "description": "Thailand has reportedly pushed back more than 2,000 people attempting to flee neighboring Myanmar following a series of air strikes carried out by the ruling junta in the southeast of the country.", "url": "https://www.cnn.com/2021/03/30/asia/thailand-myanmar-refugees-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330012132-01-fleeing-myanmar-0328-restricted-super-tease.jpg", "publishedAt": "2021-03-30T06:59:59Z", "content": "Bangkok (CNN)Thailand has reportedly pushed back more than 2,000 people attempting to flee neighboring Myanmar following a series of air strikes carried out by the ruling junta in the southeast of th… [+4334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "James Griffiths, CNN", "title": "Beijing passes new 'patriot' election law for Hong Kong that restricts opposition", "description": "China's government has passed a new law that will drastically restrict the right of Hong Kongers to stand for election and reshape the city's parliament, further entrenching Beijing's power over the supposedly semi-autonomous territory.", "url": "https://www.cnn.com/2021/03/30/asia/china-hong-kong-elections-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330125921-hong-kong-legco-flags-protest-super-tease.jpg", "publishedAt": "2021-03-30T06:16:33Z", "content": "Hong Kong (CNN)China's government has passed a new law that will drastically restrict the right of Hong Kongers to stand for election and reshape the city's parliament, further entrenching Beijing's … [+4618 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch, CNN", "title": "A small plane crash killed one person and knocked out power for more than 1,700 people", "description": "A pilot died after his single-engine plane crashed in northwest Georgia on Monday night, according to authorities.", "url": "https://www.cnn.com/2021/03/30/us/cave-spring-georgia-plane-crash/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330010514-cave-spring-plane-crash-0329-super-tease.jpg", "publishedAt": "2021-03-30T05:58:04Z", "content": "(CNN)A pilot died after his single-engine plane crashed in northwest Georgia on Monday night, according to authorities.\r\nThe single-engine Aviat Husky A-1 crashed in a field near Cave Springs around … [+989 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Toxic chemical 'Hall of Shame' calls out major retailers for failing to act", "description": "A dozen major companies earned an F for failing to publicly address the growing problem of toxic chemicals that may be in the products they sell to consumers, according to the 2021 Who's Minding the Store? A Report Card on Retailer Actions to Eliminate Toxic …", "url": "https://www.cnn.com/2021/03/30/health/shopping-toxic-chemicals-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327142037-shopping-toxic-chemicals-wellness-super-tease.jpg", "publishedAt": "2021-03-30T04:04:30Z", "content": "(CNN)A dozen major companies earned an F for failing to publicly address the growing problem of toxic chemicals that may be in the products they sell to consumers, according to the 2021 Who's Minding… [+11226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "When and where America's culture war was won", "description": "Even at their moments of maximum electoral influence -- the presidencies of Ronald Reagan and George W. Bush, the first years of Donald Trump's turbulent reign -- conservatives often lament that they have won the political battle but lost the culture. They're…", "url": "https://www.cnn.com/2021/03/30/politics/conservatives-culture-war-los-angeles-1970s/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329150939-01-nixon-file-1974-restricted-super-tease.jpg", "publishedAt": "2021-03-30T04:04:19Z", "content": "I've always been trying to express, from 'For Everyman' to 'The Pretender' and even some recent songs, the idea of arriving someplace with more consciousness and with more purpose than we have had in… [+173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson, CNN", "title": "A year ago, this frontline worker was fighting for his life. Now he's walking for the first time since Covid-19", "description": "It's been nearly a year since healthcare worker, Peter Woullard, has walked on his own.", "url": "https://www.cnn.com/2021/03/30/us/frontline-worker-walks-first-time-after-covid-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329130750-frontline-worker-walks-super-tease.jpg", "publishedAt": "2021-03-30T04:01:30Z", "content": "(CNN)It's been nearly a year since healthcare worker, Peter Woullard, has walked on his own.\r\nThe 53-year-old, who contracted Covid-19 last March, lost his ability to stand and walk after spending mo… [+3391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann and Ellie Kaufman, CNN", "title": "New head of diversity and inclusion at US Special Operations Command reassigned as military investigates social media posts", "description": "The newly hired head of diversity and inclusion at US Special Operations Command has been reassigned as the military conducts an investigation of his controversial social media posts, military spokesmen said Monday, including one that appeared to compare form…", "url": "https://www.cnn.com/2021/03/29/politics/richard-torres-estrada-social-media/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210106180953-pentagon-headquarters-file-super-tease.jpg", "publishedAt": "2021-03-30T03:27:59Z", "content": "(CNN)The newly hired head of diversity and inclusion at US Special Operations Command has been reassigned as the military conducts an investigation of his controversial social media posts, military s… [+4079 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Konstantin Toropin and Sara Sidner, CNN", "title": "St. Louis jurors return mixed verdict for officers accused of beating an undercover officer and then trying to cover it up", "description": "A federal jury in St. Louis returned a mixed verdict Monday in the case of three police officers accused of beating a fellow officer working undercover.", "url": "https://www.cnn.com/2021/03/29/us/st-louis-officers-undercover-assault-verdict/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329175015-01-st-louis-officers-undercover-assault-verdict-super-tease.jpg", "publishedAt": "2021-03-30T03:11:56Z", "content": "(CNN)A federal jury in St. Louis returned a mixed verdict Monday in the case of three police officers accused of beating a fellow officer working undercover. \r\nLuther Hall, who was identified in a ci… [+4522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Trump-backed candidate for Georgia elections chief begins campaign with false claims about 2020 election", "description": "Rep. Jody Hice, a Republican, announced last week that he is running for Georgia secretary of state, the state's top elections job. His 2022 campaign was immediately endorsed by former President Donald Trump, who has repeatedly launched dishonest attacks agai…", "url": "https://www.cnn.com/2021/03/29/politics/fact-check-hice-2020-election-claims-secretary-of-state-newsmax/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329174241-jody-hice-newsmax-210322-super-tease.jpg", "publishedAt": "2021-03-30T03:09:44Z", "content": "Washington (CNN)Rep. Jody Hice, a Republican, announced last week that he is running for Georgia secretary of state, the state's top elections job. His 2022 campaign was immediately endorsed by forme… [+6877 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Steve Almasy, CNN", "title": "Canada halting AstraZeneca vaccine shots for people 55 and younger", "description": "Canada's National Advisory Committee on Immunization recommended Monday that the AstraZeneca Covid-19 vaccine should not be used in adults under age 55 while rare cases of serious blood clots following vaccination are being investigated, according to a releas…", "url": "https://www.cnn.com/2021/03/29/americas/canada-astrazeneca-vaccine-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327163449-01-astrazeneca-covid-19-vaccine-italy-0325-super-tease.jpg", "publishedAt": "2021-03-30T02:53:19Z", "content": "(CNN)Canada's National Advisory Committee on Immunization recommended Monday that the AstraZeneca Covid-19 vaccine should not be used in adults under age 55 while rare cases of serious blood clots fo… [+3310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sunlen Serfaty and Caroline Kelly, CNN", "title": "Failed Nevada GOP congressional candidate pushes back on claims he turned up twang in new Texas run", "description": "As a congressional candidate last year in Nevada, Dan Rodimer pitched himself as \"a small business man, a family man, living in the suburbs.\"", "url": "https://www.cnn.com/2021/03/29/politics/dan-rodimer-campaign-ads-texas-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329175214-02-dan-rodimer-file-super-tease.jpg", "publishedAt": "2021-03-30T01:33:53Z", "content": "(CNN)As a congressional candidate last year in Nevada, Dan Rodimer pitched himself as \"a small business man, a family man, living in the suburbs.\"\r\nNow as a candidate for the US House of Representati… [+3425 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "How to visit two of Hong Kong's most remote islands in one day", "description": "Ap Chau and Kat O are located in Hong Kong's far north close to the border of Shenzhen in mainland China. With a little careful planning, it's possible to visit both in the same day.", "url": "https://www.cnn.com/travel/article/ap-chau-kat-o-hong-kong-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210320001031-03-ap-chau-super-tease.jpg", "publishedAt": "2021-03-30T01:30:53Z", "content": "(CNN) Although some travelers think of Hong Kong as just Hong Kong Island and the Kowloon peninsula, the city is home to hundreds of inhabited and uninhabited islands. \r\nStill, many of these islands … [+5776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "Why the first-in-the-nation Excelsior Pass isn't ready for prime time", "description": "Dr. Kent Sepkowitz writes that while New York's new digital vaccine pass sounds like a good idea, it will likely cause more problems than it solves. Some of this is due to bad science, some to perpetuation of health care inequality, and some is that it sends …", "url": "https://www.cnn.com/2021/03/29/opinions/covid-excelsior-pass-new-york-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210113102737-us-vaccine-rollout-ny-0110-super-tease.jpg", "publishedAt": "2021-03-30T01:29:04Z", "content": "Dr. Kent Sepkowitz is a CNN medical analyst and a physician and infection control expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. Vie… [+5069 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rodrigo Pedroso", "title": "Covid-19 cases in young people are rising in Brazil, report says", "description": "Covid-19 cases are on the rise among Brazil's younger population, a Brazilian research institute has found, as the country grapples with a deadly resurgence of the virus.", "url": "https://www.cnn.com/2021/03/29/americas/brazil-covid-young-people-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329165256-02-brazil-young-covid-super-tease.jpg", "publishedAt": "2021-03-29T23:46:51Z", "content": "Sao Paulo (CNN)Covid-19 cases are on the rise among Brazil's younger population, a Brazilian research institute has found, as the country grapples with a deadly resurgence of the virus. \r\n\"The countr… [+1911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Lawyer for House candidate pushes for panel to 'count every vote,' as Democrats grow skeptical of overturning election", "description": "Iowa Democratic candidate Rita Hart's legal counsel urged Congress on Monday to \"count every vote\" amid increasing pressure by Republicans to dismiss her case and growing skepticism by House Democrats of overturning the incredibly close 2020 race.", "url": "https://www.cnn.com/2021/03/29/politics/us-house-seat-iowa-briefs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329183123-02-rita-hart-file-super-tease.jpg", "publishedAt": "2021-03-29T22:59:43Z", "content": "(CNN)Iowa Democratic candidate Rita Hart's legal counsel urged Congress on Monday to \"count every vote\" amid increasing pressure by Republicans to dismiss her case and growing skepticism by House Dem… [+3346 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How bad a president was Donald Trump?", "description": "Donald Trump's presidency is now behind us. But the debate over how bad a president he was has only just begun.", "url": "https://www.cnn.com/2021/03/29/politics/trump-bad-president-rankings-legacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210322161933-primera-trump-super-tease.jpg", "publishedAt": "2021-03-29T22:31:38Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Former US Surgeon General defends Birx in tweets following CNN special report", "description": "Dr. Jerome Adams, former US surgeon general and White House coronavirus task force member under President Trump, took to Twitter on Monday to defend Dr. Deborah Birx, the White House's coronavirus response coordinator under Trump.", "url": "https://www.cnn.com/2021/03/29/health/jerome-adams-birx-covid-19-response-tweets-bn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201007112726-file-jerome-adams-0909-super-tease.jpg", "publishedAt": "2021-03-29T22:23:46Z", "content": "(CNN)Dr. Jerome Adams, former US surgeon general and White House coronavirus task force member under President Trump, took to Twitter on Monday to defend Dr. Deborah Birx, the White House's coronavir… [+3378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "Former US Surgeon General defends Birx in tweets following CNN special report", "description": "Dr. Jerome Adams, former US surgeon general and White House coronavirus task force member under President Trump, took to Twitter on Monday to defend Dr. Deborah Birx, the White House's coronavirus response coordinator under Trump.", "url": "https://www.cnn.com/2021/03/29/health/jerome-adams-birx-covid-19-response-tweets-bn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201007112726-file-jerome-adams-0909-super-tease.jpg", "publishedAt": "2021-03-29T22:23:46Z", "content": "(CNN)Dr. Jerome Adams, former US surgeon general and White House coronavirus task force member under President Trump, took to Twitter on Monday to defend Dr. Deborah Birx, the White House's coronavir… [+3378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "Federal prosecutors add sex trafficking charges against Ghislaine Maxwell", "description": "Federal prosecutors filed sex trafficking charges against Ghislaine Maxwell, the former associate of Jeffrey Epstein, alleging she recruited and groomed a 14-year-old girl to engage in sex acts with Epstein as recently as 2004.", "url": "https://www.cnn.com/2021/03/29/us/ghislaine-maxwell-sex-trafficking-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329172132-ghislaine-maxwell-2016-restricted-super-tease.jpg", "publishedAt": "2021-03-29T21:56:19Z", "content": "(CNN)Federal prosecutors filed sex trafficking charges against Ghislaine Maxwell, the former associate of Jeffrey Epstein, alleging she recruited and groomed a 14-year-old girl to engage in sex acts … [+3132 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez and Jill Martin, CNN", "title": "Georgia voting law leads to calls for some sports events to be moved or canceled", "description": "Georgia has a long history of attracting national sports events, but a controversial new voting law might have severe repercussions for that tradition.", "url": "https://www.cnn.com/2021/03/29/us/georgia-voting-law-sports-events/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329154553-01-georgia-voting-law-sports-events-super-tease.jpg", "publishedAt": "2021-03-29T21:08:43Z", "content": "(CNN)Georgia has a long history of attracting national sports events, but a controversial new voting law might have severe repercussions for that tradition.\r\nA leading Black civil rights group is cal… [+2807 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caroline Kelly", "title": "Buttigieg says no gas or mileage tax in Biden's infrastructure plan", "description": "Transportation Secretary Pete Buttigieg said Monday that neither a gas tax nor a mileage tax would be part of President Joe Biden's sweeping infrastructure plan to be detailed on Wednesday.", "url": "https://www.cnn.com/2021/03/29/politics/buttigieg-no-gas-tax-mileage-tax-biden-infrastructure-plan-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210222162224-pete-buttigieg-0121-super-tease.jpg", "publishedAt": "2021-03-29T20:59:56Z", "content": "(CNN)Transportation Secretary Pete Buttigieg said Monday that neither a gas tax nor a mileage tax would be part of President Joe Biden's sweeping infrastructure plan to be detailed on Wednesday.\r\n\"No… [+980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "This new P&G ad confronts stereotypes against Black Americans", "description": "P&G, which owns brands like Tide and Old Spice, just launched an ad campaign called \"Widen the Screen.\" It's part of a larger effort by the company to confront racial stereotypes in media and give opportunities to Black creators.", "url": "https://www.cnn.com/videos/business/2021/03/29/pg-widen-the-screen-new-commercial-racism-zw-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329160020-pg-widen-the-screen-1-super-tease.jpg", "publishedAt": "2021-03-29T20:59:48Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "Biden to lay out first piece of sweeping infrastructure and jobs package Wednesday", "description": "President Joe Biden will lay out the first of a sweeping two-pronged infrastructure and jobs proposal Wednesday, with the administration launching its expected months-long effort to pass proposals that will total between $3 trillion and $4 trillion, according…", "url": "https://www.cnn.com/2021/03/29/politics/infrastructure-jobs-package-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328201915-01-white-house-0328-super-tease.jpg", "publishedAt": "2021-03-29T20:49:11Z", "content": "(CNN)President Joe Biden will lay out the first of a sweeping two-pronged infrastructure and jobs proposal Wednesday, with the administration launching its expected months-long effort to pass proposa… [+3819 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "CDC study finds Pfizer, Moderna vaccines are 90% effective after two doses in real-world conditions", "description": "Under real world conditions, the Pfizer and Moderna Covid-19 vaccines provide highly effective protection, according to a new report from the US Centers for Disease Control and Prevention.", "url": "https://www.cnn.com/2021/03/29/health/pfizer-and-moderna-covid-19-vaccines-work-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325000952-us-coronavirus-vaccine-0318-super-tease.jpg", "publishedAt": "2021-03-29T20:47:38Z", "content": "(CNN)Under real world conditions, the Pfizer and Moderna Covid-19 vaccines provide highly effective protection, according to a new report from the US Centers for Disease Control and Prevention.\r\nAt f… [+3336 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox And Sandi Sidhu", "title": "Coronavirus likely came from animal, not a lab, WHO draft report finds", "description": "Covid-19 probably came to people through an animal, and likely started spreading no more than a month or two before it was noticed in December of 2019, a World Health Organization draft report finds.", "url": "https://www.cnn.com/2021/03/29/health/who-coronavirus-origin-draft-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210131141514-who-investigates-huanan-market-210131-super-tease.jpg", "publishedAt": "2021-03-29T20:38:30Z", "content": "(CNN)Covid-19 probably came to people through an animal, and likely started spreading no more than a month or two before it was noticed in December of 2019, a World Health Organization draft report f… [+5786 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rodrigo Pedroso, CNN", "title": "Brazil's defense minister resigns without explanation", "description": "Brazilian Defense Minister Fernando Azevedo e Silva has resigned from his position in a surprise move.", "url": "https://www.cnn.com/2021/03/29/americas/brazil-government-resignation-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329153342-fernando-azevedo-e-silva-file-super-tease.jpg", "publishedAt": "2021-03-29T20:33:23Z", "content": "Sao Paulo (CNN)Brazilian Defense Minister Fernando Azevedo e Silva has resigned from his position in a surprise move.\r\nIn a statement released Monday, Azevedo did not provide a reason for stepping do… [+1484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Brittany Vincent", "title": "These are our favorite games for the Nintendo Switch and Switch Lite", "description": "We already know the Switch itself is a home run — but what about the games? There's a little something for everyone, from colorful platformers to heartrending role-playing games with expansive worlds. Here are our favorite Switch games of 2021.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/best-nintendo-switch-games/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201113145517-best-switch-games-lead-super-169.jpg", "publishedAt": "2021-03-29T20:32:26Z", "content": "The Nintendo Switch may very well be one of the most versatile systems ever released. From its innovative hybrid console/handheld design to its expansive collection of game releases, its been a crowd… [+16214 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul P. Murphy, CNN", "title": "Evacuations underway in Black Hills of South Dakota as Schroeder wildfire grows", "description": "Several neighborhoods near Rapid City, South Dakota, were under evacuation Monday after being threatened by a new wildfire, named the Schroeder fire, that began late Monday morning.", "url": "https://www.cnn.com/2021/03/29/weather/black-hills-south-dakota-wildfire-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329151004-rapid-city-smoke-plume-super-tease.jpg", "publishedAt": "2021-03-29T20:31:29Z", "content": "(CNN)Several neighborhoods near Rapid City, South Dakota, were under evacuation Monday after being threatened by a new wildfire, named the Schroeder fire, that began late Monday morning. \r\nSouth Dako… [+2006 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, CNN", "title": "Mitch McConnell: 'I would encourage all Republican men' to get vaccinated", "description": "Senate Minority Leader Mitch McConnell on Monday encouraged \"all Republican men\" to get the Covid-19 vaccine, as new polls indicate many in the group are skeptical of getting the shot.", "url": "https://www.cnn.com/2021/03/29/politics/mitch-mcconnell-covid-19-vaccine-republican-men/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210215202426-mcconnell-210213-super-tease.jpg", "publishedAt": "2021-03-29T20:23:48Z", "content": "(CNN)Senate Minority Leader Mitch McConnell on Monday encouraged \"all Republican men\" to get the Covid-19 vaccine, as new polls indicate many in the group are skeptical of getting the shot.\r\n\"I can s… [+2366 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Park", "title": "Forget the flowers — Mom's earned a relaxing Mother's Day gift this year", "description": "The Bearaby weighted blanket is an eco-friendly gift that your mother will love this Mother's Day.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/bearaby-paid-spring/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329154913-bearaby-lead-super-169.jpg", "publishedAt": "2021-03-29T20:22:43Z", "content": "With spring, we traditionally start to think about what we can do for the two mothers we care so deeply about: the ones we take out to brunch on Mothers Day, and Mother Nature, who we celebrate on Ea… [+2822 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson", "title": "What to make of Georgia's new voting law", "description": "Georgia just made it a crime to hand a waiting voter a bottle of water.", "url": "https://www.cnn.com/2021/03/29/world/meanwhile-in-america-march-29-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210305122033-01-georgia-voting-2020-super-tease.jpg", "publishedAt": "2021-03-29T20:11:29Z", "content": "This was excerpted from the March 29 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\r\n (CNN)Georgia just m… [+4666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "opinion by Melissa Mahtani, CNN", "title": "Opinion: I got vaccinated -- but my family can't, and the guilt is killing me", "description": "Vaccine guilt is a real thing -- and although it may not make sense rationally, emotions aren't rational. Last Saturday, I got the Moderna vaccine against Covid-19. I had been eligible to get it under New York City guidelines due to underlying conditions. How…", "url": "https://www.cnn.com/2021/03/29/opinions/vaccine-guilt-opinion-mahtani/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327183309-02-johnson-and-johnson-covid-19-vaccine-pennsylvania-0326-super-tease.jpg", "publishedAt": "2021-03-29T20:06:52Z", "content": "Melissa Mahtani is a senior producer and reporter for CNN's live news team. The views expressed in this commentary are her own. Read more opinion articles on CNN.\r\n (CNN)Vaccine guilt is a real thing… [+7697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "A closed skating rink will be converted into a homeless shelter named after Alex Trebek", "description": "A skating rink in Los Angeles set to be converted into a homeless shelter will bear the name of the late Alex Trebek, the famed host of \"Jeopardy!\"", "url": "https://www.cnn.com/2021/03/29/us/alex-trebek-center-homeless-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329142505-alex-trebek-file-2017-super-tease.jpg", "publishedAt": "2021-03-29T20:02:26Z", "content": "(CNN)A skating rink in Los Angeles set to be converted into a homeless shelter will bear the name of the late Alex Trebek, the famed host of \"Jeopardy!\"\r\nTrebek, who hosted the popular game show for … [+1621 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Federal workers asked to volunteer for 'urgent' border effort amid influx of children", "description": "The Biden administration is asking for federal workers to assist with \"urgent efforts\" to care for and place unaccompanied migrant children who are arriving at the southern border in increasing numbers.", "url": "https://www.cnn.com/2021/03/29/politics/federal-workforce-to-volunteer-for-urgent-border-effort/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323130037-08-border-facility-donna-texas-super-tease.jpg", "publishedAt": "2021-03-29T19:56:07Z", "content": "(CNN)The Biden administration is asking for federal workers to assist with \"urgent efforts\" to care for and place unaccompanied migrant children who are arriving at the southern border in increasing … [+1110 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher, CNN", "title": "Groups file second lawsuit challenging new Georgia voting law", "description": "Several civil rights and voting rights groups have filed a lawsuit challenging the Georgia's new voting law, which was signed last week by Republican Gov. Brian Kemp.", "url": "https://www.cnn.com/2021/03/29/politics/georgia-second-lawsuit-voting-law/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327212105-georgia-voting-rights-protest-super-tease.jpg", "publishedAt": "2021-03-29T19:40:27Z", "content": "(CNN)Several civil rights and voting rights groups have filed a lawsuit challenging the Georgia's new voting law, which was signed last week by Republican Gov. Brian Kemp.\r\nThe suit -- filed by the G… [+1619 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Ex-officer Derek Chauvin knelt on George Floyd for 9 minutes and 29 seconds -- not 8:46", "description": "Former Minneapolis Police officer Derek Chauvin knelt on George Floyd for 9 minutes and 29 seconds, prosecutors said Monday, correcting the 8:46 timing that has become a symbol of police brutality.", "url": "https://www.cnn.com/2021/03/29/us/george-floyd-timing-929-846/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329103542-01-chauvin-trial-0329-super-tease.jpg", "publishedAt": "2021-03-29T19:18:20Z", "content": "(CNN)Former Minneapolis Police officer Derek Chauvin knelt on George Floyd for 9 minutes and 29 seconds, prosecutors said Monday, correcting the 8:46 timing that has become a symbol of police brutali… [+2520 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Republican Kelly Tshibaka launches Senate campaign against Lisa Murkowski", "description": "Republican Kelly Tshibaka, a former Alaska Department of Administration commissioner, launched her Senate campaign on Monday against Sen. Lisa Murkowski, pitching the election as an outsider versus a powerful, longtime insider.", "url": "https://www.cnn.com/2021/03/29/politics/lisa-murkowski-gop-challenger-tshibaka/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329122248-kelly-tshibaka-2019-file-super-tease.jpg", "publishedAt": "2021-03-29T19:16:00Z", "content": "(CNN)Republican Kelly Tshibaka, a former Alaska Department of Administration commissioner, launched her Senate campaign on Monday against Sen. Lisa Murkowski, pitching the election as an outsider ver… [+2551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Rental car shortage is a boon for Turo, the Airbnb of cars", "description": "Rental car companies have been slashing their fleets during the pandemic, but now that travel is picking up again supply is tight and prices are sky-high. That's a great opportunity for Turo, a sort of Airbnb for car rentals — which has been growing rapidly a…", "url": "https://www.cnn.com/2021/03/29/business/rental-car-shortage-turo-airbnb-of-cars/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329150719-turo-car-rental---stock-super-tease.jpg", "publishedAt": "2021-03-29T18:50:10Z", "content": "New York (CNN Business)Rental car companies have been slashing their fleets during the pandemic, but now that travel is picking up again supply is tight and prices are sky-high. That's a great opport… [+3905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "A little-known hedge fund caused widespread chaos on Wall Street", "description": "The names of the key players are different, but the lessons similar. The spectacular implosion of hedge fund Archegos Capital Management, much like the GameStop saga earlier this year, serves as a reminder of the dangers posed by extreme leverage, secret deri…", "url": "https://www.cnn.com/2021/03/29/investing/wall-street-hedge-fund-archegos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329125221-07-nyse-0323-super-tease.jpg", "publishedAt": "2021-03-29T18:28:51Z", "content": "New York (CNN Business)The names of the key players are different, but the lessons similar. The spectacular implosion of hedge fund Archegos Capital Management, much like the GameStop saga earlier th… [+6149 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly, CNN Business", "title": "Vaccine passport apps could help us return to normal. First they need to solve the trust problem", "description": "The next time you attend a wedding or concert, visit a place of worship, eat indoors at a restaurant or even go to work, you may need to show digital proof of vaccination or negative Covid-19 test results.", "url": "https://www.cnn.com/2021/03/29/tech/vaccine-passport-app-privacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324154623-01-new-york-excelsior-pass-ibm-super-tease.jpg", "publishedAt": "2021-03-29T18:23:05Z", "content": "(CNN)The next time you attend a wedding or concert, visit a place of worship, eat indoors at a restaurant or even go to work, you may need to show digital proof of vaccination or negative Covid-19 te… [+5455 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Three months after aflatoxin recall, Midwestern Pet Foods recalls dog and cat foods over salmonella risk", "description": "Three months after Midwestern Pet Foods recalled some of its products because of a risk of aflatoxin poisoning, the company is pulling dozens more of its pet foods off the shelves. The concern this time is salmonella.", "url": "https://www.cnn.com/2021/03/29/us/dog-cat-food-recall-salmonella-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329140657-01-midwestern-pet-food-recall-super-tease.jpg", "publishedAt": "2021-03-29T18:13:02Z", "content": "(CNN)Three months after Midwestern Pet Foods recalled some of its products because of a risk of aflatoxin poisoning, the company is pulling dozens more of its pet foods off the shelves. The concern t… [+1945 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Benji Stawski", "title": "Now with an 80,000-point bonus: A review of the Chase Sapphire Preferred credit card", "description": "The Chase Sapphire Preferred comes with a terrific sign-up bonus, but it also offers a solid return on travel and dining and earns some of the most valuable travel points around.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/chase-sapphire-preferred-credit-card-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200915164730-underscored-chase-sapphire-preferred-credit-card-on-background-super-169.jpg", "publishedAt": "2021-03-29T18:01:33Z", "content": "The Chase Sapphire Preferred Card is a favorite of frequent flyers\r\nNew card holders can earn 80,000 bonus points after spending $4,000 on the card in the first 3 months\r\nThe card's bonus categories … [+17995 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Blinken calls on UN Security Council to increase humanitarian access to Syria", "description": "Secretary of State Tony Blinken addressed the United Nations Security Council Monday in an at-times passionate plea to increase desperately needed humanitarian access to Syria.", "url": "https://www.cnn.com/2021/03/29/politics/blinken-unsc-syria/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311103218-01-blinken-diversity-state-dept-super-tease.jpg", "publishedAt": "2021-03-29T17:14:41Z", "content": "(CNN)Secretary of State Tony Blinken addressed the United Nations Security Council Monday in an at-times passionate plea to increase desperately needed humanitarian access to Syria.\r\nIn remarks deliv… [+4379 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Eric Trump wants you to know he is heartbroken", "description": "Eric Trump, the middle son of the former president of the United States, wants you to know that he is absolutely devastated at the way the country is being led by President Joe Biden", "url": "https://www.cnn.com/2021/03/29/politics/eric-trump-maria-bartiromo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201005114222-eric-trump-2019-file-super-tease.jpg", "publishedAt": "2021-03-29T17:11:06Z", "content": "(CNN)Eric Trump, the middle son of the former president of the United States, wants you to know that he is absolutely devastated at the way the country is being led by President Joe Biden -- in parti… [+3935 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Former 'Bachelor' star Ben Higgins discusses Chris Harrison controversy", "description": "Ben Higgins, who starred on season 20 of \"The Bachelor,\" is weighing in on the controversy surrounding longtime host Chris Harrison.", "url": "https://www.cnn.com/2021/03/29/entertainment/ben-higgins-bachelor-chris-harrison-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150825070232-bachelor-ben-higgins-super-tease.jpg", "publishedAt": "2021-03-29T16:59:20Z", "content": "(CNN)Ben Higgins, who starred on season 20 of \"The Bachelor,\" is weighing in on the controversy surrounding longtime host Chris Harrison.\r\nHiggins told CNN in a recent interview that he's been friend… [+2956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See How Well You Can Steer Through The Suez Canal In This Game", "description": "Navigating the Suez Canal is a high-stress, complicated feat that requires master piloting skills. Try your hand at it!", "url": "https://www.cnn.com/interactive/2021/03/cnnix-steership/", "urlToImage": "https://cdn.cnn.com/cnn/interactive/2021/03/cnnix-steership/images/ogimage2a.png", "publishedAt": "2021-03-29T16:45:45Z", "content": "Steer through the Suez Canal\r\nNavigating the Suez Canal is a high-stress, complicated feat that requires master piloting skills. To demonstrate, we worked with Master Mariner Andy Winbow and Captain … [+740 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicquel Terry Ellis", "title": "George Floyd's supporters kneel for 8 minutes, 46 seconds ahead of Derek Chauvin trial", "description": "George Floyd's family, attorneys and supporters knelt for 8 minutes and 46 seconds on Monday to mark the final moments of Floyd's life ahead of opening arguments in the trial of the former Minneapolis police officer charged in his death.", "url": "https://www.cnn.com/2021/03/29/us/george-floyd-supporters-kneel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329102323-05-floyd-family-presser-0329-super-tease.jpg", "publishedAt": "2021-03-29T16:43:15Z", "content": "(CNN)George Floyd's family, attorneys and supporters knelt for 8 minutes and 46 seconds on Monday to mark the final moments of Floyd's life ahead of opening arguments in the trial of the former Minne… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "New York Times: White House to probe Trump-era 'political influence' in government science", "description": "The Biden administration is planning to probe \"Trump-era political interference\" in government science in an effort to prevent abuses in the future, The New York Times reported Monday.", "url": "https://www.cnn.com/2021/03/29/politics/biden-administration-trump-science-political-influence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328201915-01-white-house-0328-super-tease.jpg", "publishedAt": "2021-03-29T16:36:06Z", "content": "Washington (CNN)The Biden administration is planning to probe \"Trump-era political interference\" in government science in an effort to prevent abuses in the future, The New York Times reported Monday… [+2683 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "US in for a weather roller coaster this week", "description": "More flooding, critical fire weather and a roller coaster of temperatures will inundate the United States this week. All this comes on the heels of deadly tornadoes and flooding.", "url": "https://www.cnn.com/2021/03/29/weather/us-temperature-swing-flooding-fire-threat-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329103547-weather-temperature-departure-card-image-20210329-super-tease.jpg", "publishedAt": "2021-03-29T16:09:18Z", "content": "(CNN)More flooding, critical fire weather and a roller coaster of temperatures will inundate the United States this week. All this comes on the heels of deadly tornadoes and flooding. \r\nA powerful co… [+3612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "Schumer eyes using budget tool twice to pass Biden's 2-part infrastructure plan", "description": "Senate Democrats are looking at potentially using an arcane budget process twice more this year in an effort to ensure they can pass President Joe Biden's massive infrastructure project with just a simple Democratic majority.", "url": "https://www.cnn.com/2021/03/29/politics/reconciliation-senate-democrats-plans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205121011-07-chuck-schumer-file-super-tease.jpg", "publishedAt": "2021-03-29T16:04:23Z", "content": "(CNN)Senate Democrats are looking at potentially using an arcane budget process twice more this year in an effort to ensure they can pass President Joe Biden's massive infrastructure project with jus… [+3541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lauren Caruso", "title": "20 Easter dresses you'll want to wear all spring long", "description": "Whether you're going to an outdoor service or just spending time with your family, the holiday offers a great excuse to add something festive to your closet. We've rounded up 20 dresses worthy of your Easter festivities.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/best-easter-dresses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324164558-best-easter-dresses-lead-super-169.jpg", "publishedAt": "2021-03-29T16:01:08Z", "content": "Easter Sunday traditions like egg hunts and cookouts may not be back in full force this season, but the opportunity to look your best is still on the table. Whether youre going to an outdoor service … [+5951 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Godzilla vs. Kong' turns the battle of 'alpha titans' into a C-level spectacle", "description": "Almost 60 years after they rumbled in a pretty awful 1962 movie -- featuring guys in monster suits destroying tiny models -- \"Godzilla vs. Kong\" reunite with all the wonders that modern special effects can offer and still don't much improve the results. After…", "url": "https://www.cnn.com/2021/03/29/entertainment/godzilla-vs-kong-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326082735-godzilla-vs-kong-super-tease.jpg", "publishedAt": "2021-03-29T15:51:05Z", "content": "(CNN)Almost 60 years after they rumbled in a pretty awful 1962 movie -- featuring guys in monster suits destroying tiny models -- \"Godzilla vs. Kong\" reunite with all the wonders that modern special … [+2997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "The best sales to shop today: Dyson, Nordstrom, Burrow and more", "description": "Today, you'll find a deal on a Dyson stick vac, a discounted Echo Show 10 and savings on furniture from Burrow. All that and more below.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329103927-0329dealslead-super-169.jpg", "publishedAt": "2021-03-29T15:32:07Z", "content": "Today, youll find a deal on a Dyson stick vac, a discounted Echo Show 10 and savings on furniture from Burrow. All that and more below.\r\nTheres only a week left to shop Nordstroms Spring Sale, featur… [+7617 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN staff", "title": "Travel to India during Covid-19: What you need to know before you go", "description": "If you're planning a trip to India, here's what you'll need to know and expect if you want to visit during the global coronavirus pandemic.", "url": "https://www.cnn.com/travel/article/india-travel-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328210341-taj-mahal-super-tease.jpg", "publishedAt": "2021-03-29T15:27:51Z", "content": "Editor's Note Coronavirus cases remain high across the globe. Health officials caution that travel increases your chances of getting and spreading the virus. Staying home is the best way to stem tran… [+4109 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "US suspends all trade with Myanmar after weekend of violence against pro-democracy protesters", "description": "The Biden administration announced the suspension of all trade engagement with Myanmar on Monday following a weekend of violence against pro-democracy protesters and the deadliest day since military seized power in a February 1 coup.", "url": "https://www.cnn.com/2021/03/29/politics/us-trade-suspension-myanmar/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328230911-03-myanmar-unrest-0328-super-tease.jpg", "publishedAt": "2021-03-29T15:15:30Z", "content": "Washington (CNN)The Biden administration announced the suspension of all trade engagement with Myanmar on Monday following a weekend of violence against pro-democracy protesters and the deadliest day… [+3305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Mike Park", "title": "Shop with confidence for your high-end timepiece through eBay's Authenticity Guarantee", "description": "eBay's Authenticity Guarantee gives you a reliable way to shop for expert-verified luxury watches.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/ebay-authenticity-guarantee-luxury-watches/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329100817-ebay-watches-paid-lead-super-169.jpg", "publishedAt": "2021-03-29T14:59:49Z", "content": "Weve all been doing more online shopping this past year, which is great for a lot of reasons: its incredibly convenient, usually saves us money and provides a way for us to get the things our familie… [+2377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Emma Andrews", "title": "I work at a Texas coffee shop. This is what it's been like trying to enforce our mask policy", "description": "\"If I call your manager right now, will he say the same thing?\" is just one example of the encounters Emma Andrews has had with maskless customers when she tries to enforce the mask mandate that her coffee shop where she works still has in place.  She writes …", "url": "https://www.cnn.com/2021/03/29/opinions/texas-coffee-shop-maskless-customers-andrews/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210304025640-face-mask-required-sign-texas-super-tease.jpg", "publishedAt": "2021-03-29T14:56:22Z", "content": "Emma Andrews is a graduate student in Texas State University's MFA Poetry program. As a native Texan, she has lived and worked in the Austin area all her life. The views expressed here are hers. View… [+6581 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See video of dislodged ship floating down Suez Canal", "description": "The ship blocking the Suez Canal has been fully dislodged, a Suez Canal Authority spokesperson told CNN. The Ever Given, a 224,000-ton vessel almost as long as the Empire State Building is tall, ran aground in the Egyptian canal on March 23. Crews from Egypt …", "url": "https://www.cnn.com/videos/world/2021/03/29/suez-canal-egypt-ever-given-container-ship-dislodged-floating-ctw-intl-ldn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329152046-ever-given-suez-canal-dislodged-super-tease.jpg", "publishedAt": "2021-03-29T14:34:32Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Why Lindsey Graham says he *has* to have an AR-15", "description": "In the wake of two (more) high-profile mass shootings, we're (again) talking about guns -- and whether Congress will do anything to restrict people from purchasing them.", "url": "https://www.cnn.com/2021/03/29/politics/lindsey-graham-ar-15-guns/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308113450-graham-trump-super-tease.jpg", "publishedAt": "2021-03-29T14:19:49Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Colorado's state lawmakers in 'early stages' of discussing gun reforms in wake of Boulder shooting", "description": "Colorado lawmakers are facing pressure to act from constituents and are in the \"early stages\" of discussing gun reform proposals after a man opened fire at a Boulder supermarket last week, the state's top Democratic senator told CNN.", "url": "https://www.cnn.com/2021/03/29/politics/colorado-lawmakers-gun-legislation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328131524-colorado-capitol-file-super-tease.jpg", "publishedAt": "2021-03-29T14:14:49Z", "content": "(CNN)Colorado lawmakers are facing pressure to act from constituents and are in the \"early stages\" of discussing gun reform proposals after a man opened fire at a Boulder supermarket last week, the s… [+10463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Devan Cole, CNN", "title": "Supreme Court leaves in place a ruling blocking Hillary Clinton deposition over private email server", "description": "The Supreme Court on Monday left in place a lower court order that blocked the conservative group Judicial Watch from deposing former Secretary of State Hillary Clinton about her use of a private email account in a lawsuit related to the 2012 attack on the US…", "url": "https://www.cnn.com/2021/03/29/politics/supreme-court-hillary-clinton-private-email-server/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190928191832-02-hillary-clinton-file-super-tease.jpg", "publishedAt": "2021-03-29T14:14:17Z", "content": "Washington (CNN)The Supreme Court on Monday left in place a lower court order that blocked the conservative group Judicial Watch from deposing former Secretary of State Hillary Clinton about her use … [+1445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tanya Edwards", "title": "20 adorable Easter basket ideas they'll love", "description": "We've curated a selection to help you fill their Easter baskets with sweet, creative gifts that will get help them celebrate spring — and their sweet tooth.", "url": "https://www.cnn.com/2021/03/29/cnn-underscored/easter-basket-ideas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210318110608-easterbasketslead-super-169.jpg", "publishedAt": "2021-03-29T14:03:54Z", "content": "Easter is just around the corner, and were getting back to a new normal, which may mean smaller gatherings with family and friends who are vaccinated, or getting together virtually. No matter what yo… [+5650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "President Barack Obama's step-grandmother and family matriarch dies in Kenya", "description": "Family matriach Sarah Obama passed away Monday while receiving treatment for an undisclosed ailment at a hospital in Kisumu, in Western Kenya, authorities said in a statement. She was 99.", "url": "https://www.cnn.com/2021/03/29/africa/barack-obama-grandmother-dies-kenya-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/121102235914-07-meet-the-obamas-1102-super-tease.jpg", "publishedAt": "2021-03-29T13:47:22Z", "content": "(CNN)Former US President Barack Obama's step-grandmother, Sarah Obama passed away Monday while receiving treatment for an undisclosed ailment at a hospital in Kisumu, Western Kenya, authorities said … [+1881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, Mike Hayes and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Derek Chauvin is on trial for George Floyd's death", "description": "It's the first day of former Minneapolis Police officer Derek Chauvin's murder trial in the death of George Floyd. Follow here for live updates.", "url": "https://www.cnn.com/us/live-news/derek-chauvin-trial-opening-statements-03-29-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323161839-02-chauvin-court-0322-super-tease.jpg", "publishedAt": "2021-03-29T12:57:58Z", "content": "Members of George Floyd's family, Rev. Al Sharpton and attorney Benjamin Crump will take a knee outside the courthouse for eight minutes and 46 seconds before entering the building for the beginning … [+1771 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Yan Carrière-Swallow and Vikram Haksar for CNN Business Perspectives", "title": "We need to create a global standard to protect and share data — before it's too late", "description": "Just as data have helped us monitor, adapt and respond to Covid-19, the pandemic has brought into focus two fundamental problems with how information flows in the global economy", "url": "https://www.cnn.com/2021/03/29/perspectives/global-data-privacy-imf/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210325161114-20210325-global-data-super-tease.jpg", "publishedAt": "2021-03-29T12:54:00Z", "content": "This article has been edited from its original version. It was originally published in its entirety in the International Monetary Fund's Spring 2021 issue of Finance &amp; Development magazine. Yan C… [+6957 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, Melissa Macaya and <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a>, CNN", "title": "The latest on the Suez Canal shipping crisis", "description": "The container ship that has been stuck in the Suez Canal for almost a week has been partially dislodged — but it's not yet fully free and the shipping crisis continues. Follow here for the latest.", "url": "https://www.cnn.com/africa/live-news/suez-canal-shipping-crisis-03-29-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329022534-02a-suez-canal-ever-given-0328-super-tease.jpg", "publishedAt": "2021-03-29T12:51:43Z", "content": "The Ever Given container ship has been partially dislodged after blocking the Suez Canal for almost a week, authorities say, but efforts to fully refloat it are likely to continue for some time.\r\nThe… [+1588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "There are 'definitely merits' to reparations, says the first Black Fed president", "description": "Raphael Bostic, president of the Federal Reserve Bank of Atlanta, is one of the most prominent government officials yet to publicly express support for reparations as a way to address the consequences of racism and inequality in America.", "url": "https://www.cnn.com/2021/03/29/business/reparations-hr-40-fed-bostic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326143247-raphael-bostic-file-restricted-super-tease.jpg", "publishedAt": "2021-03-29T12:26:33Z", "content": "\"We have African Americans today who have a lot less wealth in part because they have not been able to inherent the wealth that would have accrued had their ancestors been able to accrue that wealth.… [+38 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lina El Wardani, for CNN", "title": "All hands on deck as Suez locals ply food and wares to growing numbers of hungry, stranded crews", "description": "For the first time in 40 years, Wessam Hafez, a senior pilot at the Suez Canal, is not going to work. Traffic outside the canal that runs outside his house has stopped.", "url": "https://www.cnn.com/2021/03/29/world/suez-canal-block-impact-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326155944-01-suez-canal-container-ship-0326-super-tease.jpg", "publishedAt": "2021-03-29T12:01:07Z", "content": "Ismailia, Port Said and Suez, Egypt (CNN)For the first time in 40 years, Wessam Hafez, a senior pilot at the Suez Canal, is not going to work. Traffic outside the canal that runs outside his house ha… [+5080 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Why Virginia's abolition of the death penalty is a big deal for the state and the US", "description": "Virginia's decision to abolish capital punishment is a move that experts and death penalty abolition advocates is emblematic not only of the nationwide decline of capital punishment, but also a reckoning with its history as a tool of racial oppression.", "url": "https://www.cnn.com/2021/03/29/us/virginia-death-penalty-abolition-significance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327124659-03-virginia-death-penalty-abolition-super-tease.jpg", "publishedAt": "2021-03-29T11:56:33Z", "content": "(CNN)In 1608, Jamestown colonists executed a man named Capt. George Kendall, who had been accused of spying for Spain.\r\nIt was the first recorded execution in what would later become the Commonwealth… [+8993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "One in five Colorado high school students say they have easy access to firearms", "description": "One in five Colorado high school students say it is \"sort of easy\" or \"very easy\" to access a handgun, a study found.", "url": "https://www.cnn.com/2021/03/29/us/handgun-access-colorado-high-school-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326155747-handgun-safe-stock-super-tease.jpg", "publishedAt": "2021-03-29T11:45:54Z", "content": "(CNN)One in five Colorado high school students say it is \"sort of easy\" or \"very easy\" to access a handgun, a study found.\r\nNew research, published Monday in The Journal of Pediatrics, analyzed 2019 … [+2539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, CNN", "title": "The Covid-19 war in the Trump White House", "description": null, "url": "https://www.cnn.com/2021/03/29/world/coronavirus-newsletter-intl-03-29-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-03-29T11:32:58Z", "content": "A version of this story appeared in the March 29 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)No longer working … [+7649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Terence Moore", "title": "Sports world should boycott Georgia over racist voting law", "description": "Gov. Brian Kemp and a slew of Georgia Republican lawmakers sped a sweeping election bill into a Jim-Crow-like law Thursday, imposing new voting restrictions in the battleground state. The law, wrongfully dubbed The Election Integrity Act of 2021, is a poorly …", "url": "https://www.cnn.com/2021/03/29/opinions/georgia-voting-restrictions-sports-moore/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200713143126-02-atlanta-braves-tomahawk-super-tease.jpg", "publishedAt": "2021-03-29T11:04:00Z", "content": "Terence Moore is an Atlanta-based national sports columnist and commentator. He's a CNN sports contributor and a visiting professor of journalism at Miami University in Ohio. Follow him on Twitter @T… [+5749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Terence Moore", "title": "Sports world should boycott Georgia over racist voting law", "description": "As Georgia Republican lawmakers face mounting criticism for passing a sweeping new election law that imposes new hurdles for citizens to vote, Terence Moore writes sports leagues can play a significant role in fighting back the law.", "url": "https://www.cnn.com/2021/03/29/opinions/georgia-voting-restrictions-sports-moore/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200713143126-02-atlanta-braves-tomahawk-super-tease.jpg", "publishedAt": "2021-03-29T11:04:00Z", "content": "Terence Moore is an Atlanta-based national sports columnist and commentator. He's a CNN sports contributor and a visiting professor of journalism at Miami University in Ohio. Follow him on Twitter @T… [+5749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill, CNN", "title": "Superyacht feature transports passengers underwater in minutes", "description": "The Hydrosphere concept can be deployed underwater from the hull of a vessel, immersing the owner and their guests into the surrounding ocean environment within minutes.", "url": "https://www.cnn.com/travel/article/superyacht-underwater-feature/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326104820-underwater-observation-platform---rendering---gyd-hydrosphere-5-super-tease.jpg", "publishedAt": "2021-03-29T10:42:32Z", "content": "(CNN) The notion of hopping on an observation platform and being transported down to the ocean within minutes seems rather fanciful.\r\nBut superyacht owners may soon be able to do just that thanks to … [+3423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for March 29: Coronavirus, Suez Canal, Chauvin trial, Myanmar, LGBTQ rights", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/03/29/us/five-things-march-29-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328194612-france-covid-icu-3-super-tease.jpg", "publishedAt": "2021-03-29T10:23:43Z", "content": "(CNN)Flash floods tore through Nashville this weekend, leaving four dead, destroying homes and businesses and prompting hundreds of evacuations. \r\nHere's what you need to know to Get Up to Speed and … [+5321 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jake Auchincloss", "title": "The US needs a Marshall Plan for global vaccinations", "description": "As the US recovery effort picks up steam, we have an opportunity to save lives while rebuilding our moral standing in the world post-Trump, writes Rep. Jake Auchincloss. To turbocharge Biden's Build Back Better agenda at home and christen a new era of US fore…", "url": "https://www.cnn.com/2021/03/29/opinions/marshall-plan-for-global-vaccinations-auchincloss/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210320201612-01-covid-19-vaccine-washington-dc-0316-super-tease.jpg", "publishedAt": "2021-03-29T10:13:39Z", "content": "Rep. Jake Auchincloss is a Democratic member of Congress who represents Massachusetts' 4th District. He is also a former Newton City councilor and business leader, and a major in the Marine Corps Res… [+4459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "Pentagon could open itself to costly litigation from contractors if US pulls out Afghanistan this year", "description": "Despite the signing of the Doha agreement last February that called for a full drawdown of US troops and personnel from Afghanistan by May 1, the Department of Defense issued nearly a billion dollars in contracts to 17 different companies related to work in A…", "url": "https://www.cnn.com/2021/03/29/politics/pentagon-contractors-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326170839-01-afghanistan-contractor-file-2013-super-tease.jpg", "publishedAt": "2021-03-29T10:02:45Z", "content": "(CNN)Despite the signing of the Doha agreement last February that called for a full drawdown of US troops and personnel from Afghanistan by May 1, the Department of Defense issued nearly a billion do… [+6798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells and Christina Maxouris, CNN", "title": "Serial killer Joseph Edward Duncan dies", "description": "Serial killer Joseph Edward Duncan III, who was facing execution after being convicted for the 2005 kidnapping and killing of Dylan Groene, a 9-year-old Idaho boy, died Sunday morning, according to a news release from the United States Attorney's Office for t…", "url": "https://www.cnn.com/2021/03/29/us/joseph-edward-duncan-iii-dies-death-row/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329043754-joseph-edward-duncan-iii-file-2011-super-tease.jpg", "publishedAt": "2021-03-29T09:58:12Z", "content": "(CNN)Serial killer Joseph Edward Duncan III, who was facing execution after being convicted for the 2005 kidnapping and killing of Dylan Groene, a 9-year-old Idaho boy, died Sunday morning, according… [+2354 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Opening statements are set to begin in Derek Chauvin's trial for the death of George Floyd", "description": "In a first for Minnesota, the trial will be broadcast live in its entirety, giving the public a rare peek into the most important case of the Black Lives Matter era.", "url": "https://www.cnn.com/2021/03/29/us/derek-chauvin-george-floyd-trial-start/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg", "publishedAt": "2021-03-29T09:52:02Z", "content": "(CNN)Opening statements are set to begin Monday in former Minneapolis Police officer Derek Chauvin's trial, 10 months after George Floyd's death under his knee launched a summer of protest and unrest… [+6036 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "AI photo restoration shines a light on life in old Ireland", "description": "Combining digital technology with painstaking historical research, a new photo project is bringing Irish history to life in unprecedented color.", "url": "https://www.cnn.com/style/article/old-ireland-color-photos-breslin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323120636-01-old-ireland-in-color-photos-restricted-super-tease.jpg", "publishedAt": "2021-03-29T09:38:12Z", "content": "artsPublished 29th March 2021\r\nThousands of historical images from across Ireland are being brought to life in color for the first time, thanks to a new AI-led photo project.\r\nCombining digital techn… [+5027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandi Sidhu and Nectar Gan, CNN", "title": "Wildlife trade most likely pathway for coronavirus to arrive in Wuhan, WHO expert says", "description": "The wildlife trade in China is the most likely pathway through which Covid-19 was able to spread from the original animal source, possibly bats, to humans, according to one of the authors of a long-awaited World Health Organization report on the origin of the…", "url": "https://www.cnn.com/2021/03/29/asia/who-wuhan-report-preview-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201117213104-02-huanan-seafood-wholesale-market-file-super-tease.jpg", "publishedAt": "2021-03-29T08:40:59Z", "content": "Hong Kong (CNN)The wildlife trade in China is the most likelypathway through which Covid-19 was able to spread from the original animal source, possibly bats, to humans, according to one of the autho… [+4878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Adeline Chen, CNN", "title": "After $200 million acquisition deal, Nigeria's Paystack plans to get Africa paid", "description": "Recently acquired by US-based payment giant Stripe, Nigerian fintech company Paystack has big plans for expansion across the continent.", "url": "https://www.cnn.com/2021/03/29/africa/paystack-shola-akinlade-nigeria-mpa-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323163851-03-paystack-nigeria-super-tease.jpeg", "publishedAt": "2021-03-29T08:37:50Z", "content": "(CNN)Over the last year, the Covid-19 pandemic has fueled a shift towards digital banking and mobile money. In Africa, this change in habits has international investors eyeing the lucrative opportuni… [+5754 chars]"}]}