{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Tracy Tylka, The Ohio State University", "title": "Feeling anxiety about your body image coming out of lockdown? Here are 8 ways to combat it", "description": "After spending so many months in lockdown, a lot of people are struggling with their body image as they begin to socialize again. Here are eight ways to combat your body image anxiety.", "url": "https://www.cnn.com/2021/07/19/health/body-image-anxiety-lockdown-wellness-partner/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716092403-body-image-anxiety-lockdown-wellness-partner-super-tease.jpg", "publishedAt": "2021-07-19T09:29:04Z", "content": "The views expressed in this commentary are solely those of the writers. CNN is showcasing the work of The Conversation, a collaboration between journalists and academics to provide news analysis and … [+6538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ian Kerner, CNN", "title": "To prevent performance anxiety from interfering with a healthy sex life, mindfulness is an answer", "description": "There are any number of reasons why you might feel anxious about or during sex, but at their core, they usually involve a sense of being more concerned about the performance of sex than the actual act of it.", "url": "https://www.cnn.com/2021/07/19/health/sex-anxiety-mindfulness-kerner-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715173538-couple-talking-in-bed-stock-super-tease.jpg", "publishedAt": "2021-07-19T09:26:25Z", "content": "Ian Kerner is a licensed marriage and family therapist, writer and contributor on the topic of relationships for CNN. His most recent book is a guide for couples, \"So Tell Me About the Last Time You … [+7969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Lauren Fox, CNN", "title": "Infrastructure push on rocky ground as key Senate test vote looms", "description": "It could all come together, or it could all fall apart.", "url": "https://www.cnn.com/2021/07/19/politics/infrastructure-agenda-senate-test-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714102720-01-schumer-0713-super-tease.jpg", "publishedAt": "2021-07-19T09:00:08Z", "content": "Washington (CNN)It could all come together, or it could all fall apart.\r\nThose are the stakes for President Joe Biden's infrastructure agenda as it faces a critical week in the Senate that could prov… [+9280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "The Covid travel checklist: What to know before you go", "description": "While our suitcases have been gathering dust over the past 16 months, the travel industry has been rapidly adapting to cope with the demands of the new Covid era.", "url": "https://www.cnn.com/travel/article/covid-travel-checklist/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629204309-flight-credits-expiration-date-dot-super-tease.jpg", "publishedAt": "2021-07-19T08:58:37Z", "content": "(CNN) While our suitcases have been gathering dust over the past 16 months, the travel industry has been rapidly adapting to cope with the demands of the new Covid era. \r\nThis means that if you're ma… [+6201 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob McLean and Michelle Toh, CNN Business", "title": "Zoom buys Five9 in $14.7 billion deal to prepare for a post-pandemic world", "description": "Zoom, the video-conferencing platform that became hugely popular during the Covid-19 pandemic, is spending a whopping $14.7 billion on cloud-based software company Five9 to boost its appeal with business clients.", "url": "https://www.cnn.com/2021/07/19/tech/zoom-buys-five9-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718235204-zoom-stock-super-tease.jpg", "publishedAt": "2021-07-19T08:35:12Z", "content": "New York/Hong Kong (CNN Business)Zoom, the video-conferencing platform that became hugely popular during the Covid-19 pandemic, is spending a whopping $14.7 billion on cloud-based software company Fi… [+2427 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton, CNN", "title": "Arizona police investigate a deadly shooting rampage across three crime scenes, including a burning house where a body was found", "description": "Police in Tucson, Arizona, are investigating a deadly shooting rampage across three different crime scenes including a burning house where a charred body was found Sunday.", "url": "https://www.cnn.com/2021/07/19/us/arizona-tucson-deadly-rampage-shooting-fire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719030811-01-az-tucson-shooting-0718-super-tease.jpg", "publishedAt": "2021-07-19T07:30:52Z", "content": "(CNN)Police in Tucson, Arizona, are investigating a deadly shooting rampage across three different crime scenes including a burning house where a charred body was found Sunday.\r\nThe shooting rampage … [+2557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Don Riddell, CNN", "title": "Mark Spitz: Seven ways to survive the Olympic Games", "description": "A nine-time gold medalist, Mark Spitz knows a thing or two about how to successfully navigate the Olympic Games as an athlete.", "url": "https://edition.cnn.com/2021/07/19/sport/mark-spitz-tokyo-2020-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210705125914-01-mark-spitz-restricted-super-tease.jpg", "publishedAt": "2021-07-19T07:28:27Z", "content": "(CNN)A nine-time gold medalist, Mark Spitz knows a thing or two about how to successfully navigate the Olympic Games as an athlete. \r\nSpitz, now 71, held the record of seven gold medals in a single G… [+4260 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Three women said they found out they had the same cheating boyfriend, so they converted a school bus and went on a road trip", "description": "Bekah King, Abi Roberts, and Morgan Tabor have a lot in common. They describe themselves as free spirited adventurers and fearless risk takers, all obsessed with music and the movie \"Megamind.\"", "url": "https://www.cnn.com/2021/07/19/us/women-boyfriends-cheating-bam-bus-road-trip/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718160911-01-women-boyfriends-cheating-bam-bus-road-trip-super-tease.jpg", "publishedAt": "2021-07-19T06:55:51Z", "content": "(CNN)Bekah King, Abi Roberts, and Morgan Tabor have a lot in common. They describe themselves as free spirited adventurers and fearless risk takers, all obsessed with music and the movie \"Megamind.\"\r… [+5546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "China is spending billions on overseas projects. Does it need to fund security, too?", "description": "The death of nine Chinese workers in a bus explosion in Pakistan has underscored the security risks attached to China's overseas projects, as anti-China sentiment simmers in countries where official ties with Beijing are strong.", "url": "https://www.cnn.com/2021/07/19/china/china-pakistan-bus-explosion-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719004305-02-pakistan-bus-blast-0714-super-tease.jpg", "publishedAt": "2021-07-19T06:21:55Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+8680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "Investigation into the Surfside condo building collapse won't begin while the site remains a crime scene, expert says", "description": "The Surfside community in Florida is anxious to learn what caused the condo building collapse that has killed at least 97 people, but a structural engineer said the investigation will not reach full force until search crews have finished their work.", "url": "https://www.cnn.com/2021/07/19/us/miami-dade-building-collapse-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719005458-01-surfside-building-collapse-0710-super-tease.jpg", "publishedAt": "2021-07-19T05:58:00Z", "content": "(CNN)The Surfside community in Florida is anxious to learn what caused the condo building collapse that has killed at least 97 people, but a structural engineer said the investigation will not reach … [+3588 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Americans sentenced to prison for helping Carlos Ghosn flee Japan", "description": "A Tokyo court on Monday sentenced United States Army Special Forces veteran Michael Taylor to two years in prison and his son to one year and eight months for helping former Nissan Motor Company chairman Carlos Ghosn flee Japan, where he had faced charges of …", "url": "https://www.cnn.com/2021/07/19/asia/carlos-ghosn-accomplices-sentenced-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201001101600-04-carlos-ghosn-0929-restricted-super-tease.jpg", "publishedAt": "2021-07-19T05:25:19Z", "content": "TokyoA Tokyo court on Monday sentenced United States Army Special Forces veteran Michael Taylor to two years in prison and his son to one year and eight months for helping former Nissan Motor Company… [+467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "People unvaccinated against Covid-19 risk the most serious virus of their lives, expert says", "description": "With vaccination rates still not at the threshold needed to stop the spread of Covid-19, most Americans who have not previously been infected or received vaccinations will likely contract the rapidly spreading Delta variant, one expert said.", "url": "https://www.cnn.com/2021/07/19/health/us-coronavirus-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718232749-los-angeles-mask-signage-0718-super-tease.jpg", "publishedAt": "2021-07-19T05:23:26Z", "content": "(CNN)With vaccination rates still not at the threshold needed to stop the spread of Covid-19, most Americans who have not previously been infected or received vaccinations will likely contract the ra… [+6123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "More than 80% of the crew aboard a South Korean destroyer have tested positive for Covid-19", "description": "South Korea's military has recorded in biggest cluster of Covid-19 infections to date, with more than 80% of personnel aboard a navy destroyer on anti-piracy patrol in the Gulf of Aden testing positive.", "url": "https://www.cnn.com/2021/07/19/asia/south-korea-navy-destroyer-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210719000926-roks-munmu-the-great-file-2019-super-tease.jpg", "publishedAt": "2021-07-19T04:57:27Z", "content": "SeoulSouth Korea's military has recorded in biggest cluster of Covid-19 infections to date, with more than 80% of personnel aboard a navy destroyer on anti-piracy patrol in the Gulf of Aden testing p… [+1717 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Thai protesters clash with police as Covid-19 cases continue to surge", "description": "Police used tear gas, water cannon and rubber bullets to disperse protesters trying to march on Thai Prime Minister Prayuth Chan-ocha's office on Sunday to demand he resign over his handling of the coronavirus pandemic and its economic impact.", "url": "https://www.cnn.com/2021/07/19/asia/thailand-protests-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718233708-01-thailand-protests-0718-restricted-super-tease.jpg", "publishedAt": "2021-07-19T04:48:06Z", "content": "(CNN)Police used tear gas, water cannon and rubber bullets to disperse protesters trying to march on Thai Prime Minister Prayuth Chan-ocha's office on Sunday to demand he resign over his handling of … [+1804 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Six British athletes forced to self-isolate in Tokyo after close contact with Covid-19 case on flight to Games", "description": "Six British athletes and two staff members are self-isolating after coming into close contact with an individual who tested positive for Covid-19 on their flight to Japan, the British Olympic Association said Sunday.", "url": "https://edition.cnn.com/2021/07/19/sport/british-athletes-tokyo-2020-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717164451-tokio-2020-covid-deportes-cnn-super-tease.jpg", "publishedAt": "2021-07-19T04:04:22Z", "content": "(CNN)Six British athletes and two staff members are self-isolating after coming into close contact with an individual who tested positive for Covid-19 on their flight to Japan, the British Olympic As… [+2726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Bowllan and Artemis Moshtaghian, CNN", "title": "'Law & Order: SVU' guest actor indicted for murder of a man in 'brazen afternoon shooting,' Queens DA says", "description": "\"Law & Order: Special Victims Unit\" actor Isaiah Stokes was indicted on second-degree murder charges Friday, the Queens County, New York, district attorney's office said.", "url": "https://www.cnn.com/2021/07/18/us/isaiah-stokes-law-and-order-actor-indicted-murder/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718200816-isaiah-stokes-law--order-actor-indicted-murder-super-tease.jpg", "publishedAt": "2021-07-19T03:19:10Z", "content": "(CNN)Isaiah Stokes, an actor who appeared in one episode of \"Law &amp; Order: Special Victims Unit,\" has been indicted on a second-degree murder charge, the Queens County, New York, District Attorney… [+1352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood", "title": "About two dozen reports of mysterious health incidents on US personnel in Vienna", "description": "There have been about two dozen reports of symptoms of mysterious health incidents similar to the \"Havana syndrome\" among US diplomats, intelligence officials and other government personnel in Vienna since the beginning of the year, according to two sources f…", "url": "https://www.cnn.com/2021/07/18/politics/mysterious-health-incidents-us-personnel-vienna/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718223447-vienna-skyline-2020-file-restricted-super-tease.jpg", "publishedAt": "2021-07-19T02:42:57Z", "content": "(CNN)There have been about two dozen reports of symptoms of mysterious health incidents similar to the \"Havana syndrome\" among US diplomats, intelligence officials and other government personnel in V… [+1971 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc and Rachel Janfaza, CNN", "title": "Two more Texas House Democrats test positive for Covid-19 in Washington", "description": "Two more Texas state House Democrats who traveled to Washington, DC, last week have tested positive for Covid-19, the Texas House Democratic Caucus said in a statement Sunday evening, bringing the total number of infected legislators to five.", "url": "https://www.cnn.com/2021/07/18/politics/texas-house-democrats-covid-19/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181019110142-01-capitol-building-file-super-tease.jpg", "publishedAt": "2021-07-19T01:30:13Z", "content": "Washington (CNN)Two more Texas state House Democrats who traveled to Washington, DC, last week have tested positive for Covid-19, the Texas House Democratic Caucus said in a statement Sunday evening,… [+3080 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Researchers identify 14 living descendants of Leonardo da Vinci's family", "description": "Decades-long research into Leonardo da Vinci's purported remains has revealed how many people can claim to be descendants of the Renaissance master.", "url": "https://www.cnn.com/style/article/leonardo-da-vinci-descendants-trnd-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718112428-leonardo-da-vinci-1510-super-tease.jpg", "publishedAt": "2021-07-19T00:54:48Z", "content": "arts\r\nDecades-long research into Leonardo da Vinci's purported remains has revealed how many people currently alive can claim to be descendants of the family of the Renaissance genius and \"Mona Lisa\"… [+1792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Camille Furst and Keith Allen, CNN", "title": "80 large fires have consumed more than 1 million acres across western parts of the US", "description": "Twelve western states are currently reporting large fires, according to the NIFC.", "url": "https://www.cnn.com/2021/07/18/us/western-us-wildfires-heatwave-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718180431-western-us-wildfires-heatwave-sunday-super-tease.jpg", "publishedAt": "2021-07-19T00:35:42Z", "content": "(CNN)There are currently 80 large wildfires raging in 13 states across the US, burning more than 1 million acres, mostly in western states, according to the National Interagency Fire Center (NIFC). \r… [+2345 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "'We're tired of living like this': DACA ruling leads to frustration and devastation for young undocumented immigrants", "description": "After navigating life in the US for 17 years without legal status, Yazmin Bruno-Valdez was ushered into the Obama-era Deferred Action for Childhood Arrivals program less than a month ago, granting her long-awaited protection from deportation and opening poten…", "url": "https://www.cnn.com/2021/07/18/politics/daca-ruling-young-undocumented-immigrants-frustration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716222832-01-daca-protest-file-2020-super-tease.jpg", "publishedAt": "2021-07-19T00:19:58Z", "content": "(CNN)After navigating life in the US for 17 years without legal status, Yazmin Bruno-Valdez was ushered into the Obama-era Deferred Action for Childhood Arrivals program less than a month ago, granti… [+8788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Washington Post: Investigation finds Israeli-designed spyware was used to hack journalists and activists around the world", "description": "Thirty-seven smartphones owned by journalists, human rights activists, business executives and two women connected to the slain Saudi journalist Jamal Khashoggi were targeted by \"military-grade spyware\" licensed by an Israeli company to governments, according…", "url": "https://www.cnn.com/2021/07/18/politics/israeli-spyware-phone-list-hack-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718180832-israeli-spyware-phone-list-investigation-super-tease.jpg", "publishedAt": "2021-07-18T23:25:31Z", "content": "Washington (CNN)Thirty-seven smartphones owned by journalists, human rights activists, business executives and two women connected to the slain Saudi journalist Jamal Khashoggi were targeted by \"mili… [+5332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dean Obeidallah", "title": "Fox News' alarming vaccine disinformation is a danger to America", "description": "Dean Obeidallah argues that many Fox News hosts are leading a disinformation campaign against Covid vaccinations because they believe that hurting the Biden administration's efforts to vaccinate people will help Republicans win in the 2022 midterms -- and may…", "url": "https://www.cnn.com/2021/07/18/opinions/vaccine-disniformation-fox-news-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210709223916-vaccine-rejection-rhetoric-right-wing-media-republicans-stelter-dlt-vpx-00004218-super-tease.jpg", "publishedAt": "2021-07-18T22:27:02Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Boosted by the federal stimulus, these virtual learning companies are fighting to keep their new place in US education", "description": "If parents weren't familiar with Canvas or Schoology before the pandemic, they likely are now.", "url": "https://www.cnn.com/2021/07/18/politics/virtual-learning-federal-stimulus-money/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715150406-virtual-learning-file-restricted-2020-super-tease.jpg", "publishedAt": "2021-07-18T21:03:45Z", "content": "Washington (CNN)If parents weren't familiar with Canvas or Schoology before the pandemic, they likely are now. \r\nThe two biggest remote learning providers -- or, more officially, \"learning management… [+4555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Sidner, CNN", "title": "Virginia PTA official resigns after 'let them die' comment in response to Critical Race Theory critics", "description": "A leader in the Virginia Parent Teacher Association has resigned after saying \"let them die\" regarding a group of protesters opposed to Critical Race Theory being taught in schools.", "url": "https://www.cnn.com/2021/07/18/us/virginia-pta-critical-race-theory/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718143307-virginia-pta-critical-race-theory-super-tease.jpg", "publishedAt": "2021-07-18T20:27:09Z", "content": "(CNN)A leader in the Virginia Parent Teacher Association has resigned after saying \"let them die\" regarding a group of protesters opposed to Critical Race Theory being taught in schools.\r\nMichelle Le… [+4153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Shooting near Nationals Park puts renewed focus on another weekend of gun violence in US", "description": "A series of shootings over the weekend in Chicago, Philadelphia, Washington, DC, and other American cities underscored the ongoing rise in shootings and gun violence in the US this year.", "url": "https://www.cnn.com/2021/07/18/us/us-violence-weekend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717220335-01-nationals-park-dc-incident-0717-super-tease.jpg", "publishedAt": "2021-07-18T18:29:31Z", "content": "(CNN)A series of shootings over the weekend in Chicago, Philadelphia, Washington, DC, and other American cities underscored the ongoing rise in shootings and gun violence in the US this year.\r\nThe sh… [+6666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Breeanna Hare, CNN", "title": "Timeline: Six key moments that shaped Jerusalem", "description": "When there's news out of Jerusalem, reports often point to recent history to explain how such a complex web of communities came to reside in the Holy City. But as historians describe in the CNN Original Series \"Jerusalem: City of Faith and Fury,\" the capital'…", "url": "https://www.cnn.com/2021/07/18/middleeast/jerusalem-original-series-faith-and-fury-timeline/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/141030150900-temple-mount-story-top.jpg", "publishedAt": "2021-07-18T17:59:48Z", "content": "CNN Original Series \"Jerusalem: City of Faith and Fury\" premieres tonight at 10 p.m. ET/PT. \r\n (CNN)When there's news out of Jerusalem, reportsoftenpoint to recent history to explain how such a compl… [+9445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Breeanna Hare, CNN", "title": "Timeline: Six key moments that shaped Jerusalem", "description": "When there's news out of Jerusalem, reports often point to recent history to explain how such a complex web of communities came to reside in the Holy City. But as historians describe in the CNN Original Series \"Jerusalem: City of Faith and Fury,\" the capital'…", "url": "https://www.cnn.com/2021/07/18/middleeast/jerusalem-original-series-faith-and-fury-timeline/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/141030150900-temple-mount-story-top.jpg", "publishedAt": "2021-07-18T17:59:48Z", "content": "CNN Original Series \"Jerusalem: City of Faith and Fury\" premieres tonight at 10 p.m. ET/PT. \r\n (CNN)When there's news out of Jerusalem, reportsoftenpoint to recent history to explain how such a compl… [+9445 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexis Benveniste", "title": "OPEC+ is boosting oil production, ending dispute that shook energy markets", "description": "OPEC+ agreed to increase oil production Sunday, ending a dispute between the United Arab Emirates and Saudi Arabia.", "url": "https://www.cnn.com/2021/07/18/business/opec-oil-increase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718114355-restricted-saudi-aramco-ras-tanura-oil-refinery-10-01-2018-super-tease.jpg", "publishedAt": "2021-07-18T17:42:54Z", "content": "New York (CNN)OPEC+ agreed to increase oil production Sunday, as demand roars back and prices surge, ending a dispute between the United Arab Emirates and Saudi Arabia.\r\nOil prices soared about two w… [+1278 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Researchers identify 14 living descendants of Leonardo da Vinci", "description": "Decades-long research into Leonardo da Vinci's purported remains has revealed how many people currently alive can claim to be descendants of the Renaissance genius and Mona LIsa painter:", "url": "https://www.cnn.com/2021/07/18/us/leonardo-da-vinci-living-descendants-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718112428-leonardo-da-vinci-1510-super-tease.jpg", "publishedAt": "2021-07-18T17:25:51Z", "content": "(CNN)Decades-long research into Leonardo da Vinci's purported remains has revealed how many people currently alive can claim to be descendants of the Renaissance genius and Mona LIsa painter:\r\nThe co… [+1622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "Biden to welcome Super Bowl champion Buccaneers to White House", "description": "President Joe Biden will welcome the Super Bowl champion Tampa Bay Buccaneers to the White House on Tuesday, an official tells CNN, marking yet another return to normalcy after the coronavirus pandemic and years of tension between the NFL and Biden's predeces…", "url": "https://www.cnn.com/2021/07/18/politics/tampa-bay-buccaneers-white-house-visit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718104129-tampa-bay-buccaneers-super-bowl-win-02-07-2021-super-tease.jpg", "publishedAt": "2021-07-18T15:18:32Z", "content": "(CNN)President Joe Biden will welcome the Super Bowl champion Tampa Bay Buccaneers to the White House on Tuesday, an official tells CNN, marking yet another return to normalcy after the coronavirus p… [+1689 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "US surgeon general on tech companies' steps to fight Covid misinformation: 'It's not enough'", "description": "US Surgeon General Dr. Vivek Murthy on Sunday said social media platforms must recognize that they played \"a major role\" in the spread of misinformation about the Covid-19 pandemic and while they've taken some steps to fight back, it hasn't been enough.", "url": "https://www.cnn.com/2021/07/18/politics/vivek-murthy-surgeon-general-social-media-misinformation-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718093231-screengrab-vivek-murthy-cnn-07-18-2021-super-tease.jpg", "publishedAt": "2021-07-18T14:38:22Z", "content": "(CNN)US Surgeon General Dr. Vivek Murthy on Sunday said social media platforms must recognize that they played \"a major role\" in the spread of misinformation about the Covid-19 pandemic and while the… [+1952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Sinnott, CNN", "title": "Lewis Hamilton and Max Verstappen involved in high-speed collision in British Grand Prix", "description": "Formula One world champion Lewis Hamilton and Max Verstappen, who is leading the drivers' championship this season, were involved in a high-speed collision on the opening lap of the British Grand Prix on Sunday.", "url": "https://edition.cnn.com/2021/07/18/motorsport/british-grand-prix-max-verstappen-lewis-hamilton-collision-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718101957-01-british-grand-prix-07-18-2021-super-tease.jpg", "publishedAt": "2021-07-18T14:36:11Z", "content": "(CNN)Formula One world champion Lewis Hamilton and Max Verstappen, who is leading the drivers' championship this season, were involved in a high-speed collision on the opening lap of the British Gran… [+436 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "GOP negotiator: Senators ditch tougher IRS enforcement as way to pay for bipartisan infrastructure plan", "description": "A Republican senator who's helping to negotiate a bipartisan infrastructure proposal said Sunday that the group is no longer looking at toughening enforcement at the Internal Revenue Service as a way to pay for the massive bill.", "url": "https://www.cnn.com/2021/07/18/politics/infrastructure-bill-portman-irs-enforcement-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210302170409-sen-rob-portman-10-senate-seats-super-tease.jpg", "publishedAt": "2021-07-18T14:31:09Z", "content": "Washington (CNN)A Republican senator who's helping to negotiate a bipartisan infrastructure proposal said Sunday that the group is no longer looking at toughening enforcement at the Internal Revenue … [+2065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "#FreeBritney activists celebrate win for Britney Spears this week", "description": "When Britney Spears celebrated a win in court this week, she used the #FreeBritney for the first time. For some of her most loyal and vocal supporters, it the news gave them cause to celebrate on two fronts.", "url": "https://www.cnn.com/2021/07/18/entertainment/britney-spears-thanks-fans-free-britney-conservatorship-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623170526-03-britney-spears-conservatorship-hearing-rally-0623-super-tease.jpg", "publishedAt": "2021-07-18T14:11:02Z", "content": "(CNN)Outside the Los Angeles County Superior Courthouse on the day of Britney Spears' July 14 court hearing for her conservatorship, a dozens of some of the singer's most devoted fans gathered.\r\nThey… [+2501 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Start your week smart: Covid-19, Haiti, Britney Spears, Jeff Bezos, Nationals Park", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/07/18/us/five-things-july-18-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718083053-restricted-02b-nationals-park-dc-incident-07-17-2021-super-tease.jpg", "publishedAt": "2021-07-18T13:24:11Z", "content": "After over a year of empty dance floors, nightclubs across England will swing heir doors openMonday. The government is scrapping almost all remaining coronavirus restrictions even as experts urge cau… [+1211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jane Greenway Carr", "title": "Opinion: Donald Trump's big book party", "description": "\"The past is never dead. It's not even past,\" wrote William Faulkner. This week, a slew of bombshell books recounting the final days of Donald Trump's presidency crowded the headlines with jarring revelations from the recent past, writes Jane Greenway Carr. S…", "url": "https://www.cnn.com/2021/07/18/opinions/trumps-big-book-party-opinion-weekly-column-carr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711201210-trump-cpac-dallas-0711-super-tease.jpg", "publishedAt": "2021-07-18T13:22:06Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)\"The past is never dead. It's not even… [+13272 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Tokyo 2020: Two South African footballers test positive for Covid-19 in Olympic Village", "description": "Just days before the Olympics are set to begin, three members from South Africa's Olympic football team have tested positive for Covid-19 after arriving at the Tokyo Olympic Village, according to the South African Football Association.", "url": "https://edition.cnn.com/2021/07/18/asia/olympic-village-athletes-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718015118-02-tokyo-olympic-village-0717-super-tease.jpg", "publishedAt": "2021-07-18T13:14:33Z", "content": "(CNN)Just days before the Olympics are set to begin, three members from South Africa's Olympic football team have tested positive for Covid-19 after arriving at the Tokyo Olympic Village, according t… [+3569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale and Tara Subramaniam, CNN", "title": "Fact check: Arizona audit chief baselessly raises suspicion about 74,000 ballots", "description": "Arizona's Senate held a Thursday briefing on the ongoing Republican-initiated \"audit\" of the 2020 election in Maricopa County, where Joe Biden outperformed Donald Trump by enough of a margin to win the state.", "url": "https://www.cnn.com/2021/07/18/politics/fact-check-maricopa-audit-arizona-cyber-ninjas-74000/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716175826-doug-logan-cyber-ninjas-restricted-super-tease.jpg", "publishedAt": "2021-07-18T13:00:33Z", "content": "(CNN)Arizona's Senate held a Thursday briefing on the ongoing Republican-initiated \"audit\" of the 2020 election in Maricopa County, where Joe Biden outperformed Donald Trump by enough of a margin to … [+6968 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "Enormous scale of destruction is revealed as water subsides after historic western Europe flooding", "description": "More than 160 people are dead and hundreds more remain missing after catastrophic flooding hit large swaths of western Europe, with tens of thousands unable to return to their homes and many still left without access to power and drinking water.", "url": "https://www.cnn.com/2021/07/18/europe/western-europe-floods-sunday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718045928-11-western-europe-flooding-0717-belgium-super-tease.jpg", "publishedAt": "2021-07-18T12:20:56Z", "content": "(CNN)More than 160 people are dead and hundreds more remain missing after catastrophic flooding hit large swaths of western Europe, with tens of thousands unable to return to their homes and many sti… [+2831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Dozens of Black cultural sites will be preserved for years to come, thanks to a $3 million grant", "description": "The stories and legacies of Black Americans can be found throughout the US, each site and landmark helping illustrate a more complete picture of the nation we live in.", "url": "https://www.cnn.com/2021/07/18/us/black-cultural-heritage-sites-preservation-grant-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716160208-01-black-cultural-sites-preserved-super-tease.jpg", "publishedAt": "2021-07-18T11:21:54Z", "content": "(CNN)The stories and legacies of Black Americans can be found throughout the US, each site and landmark helping illustrate a more complete picture of the nation we live in.\r\nHistory lives on in the c… [+5907 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong, CNN", "title": "Grief-induced anxiety: Calming the fears that follow loss", "description": "People seeking help with anxiety disorders, now on the rise, don't realize unresolved grief can be a primary underpinning of anxiety. Claire Bidwell Smith, author of \"Anxiety: The Missing Stage of Grief,\" explains the physiology of anxiety and provides healin…", "url": "https://www.cnn.com/2021/07/18/health/grief-anxiety-healing-loss-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715213833-01-grief-anxiety-healing-loss-wellness-super-tease.jpg", "publishedAt": "2021-07-18T10:06:30Z", "content": "(CNN)Millions of Americans are grieving loved ones taken by Covid-19. Yet even outside of a pandemic with its staggering losses of lives, homes, economic security and normalcy grief is hard work.\r\n\"T… [+9064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Blake, CNN", "title": "We need Nelson Mandela's example more than ever today. How the South African leader's radical empathy can help the US today", "description": "As the world celebrates Nelson Mandela's 103rd birthday this Sunday, now is a good time to remember that he was a tough, cunning leader who faced challenges in South Africa that bear frightening parallels to the current political situation in the US.", "url": "https://www.cnn.com/2021/07/18/us/nelson-mandela-birthday-lessons-for-us-politics-today/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210714170832-01-mandela-lessons-for-us-politics-today-super-tease.jpg", "publishedAt": "2021-07-18T09:13:08Z", "content": "He took a political divide and racial divisions that go way beyond what you're living in the US right now, and he managed to build a bridge. \r\nJohn Carlin, journalist and author of \"Knowing Mandela.\""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Suspected candle thief in Florida injures dozens of people with bear spray during his escape, police say", "description": "A man in Doral, Florida, escaped from a mall store with stolen goods on Saturday by spraying everyone in his way with bear repellent, according to police.", "url": "https://www.cnn.com/2021/07/18/us/florida-candle-thief-bear-spray/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718030031-01-miami-international-mall-0717-super-tease.jpg", "publishedAt": "2021-07-18T09:12:56Z", "content": "(CNN)A man in Doral, Florida, escaped from a mall store with stolen goods on Saturday by spraying everyone in his way with bear repellent, according to police. \r\nAt least 30 people required treatment… [+717 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Denise Hurby and Jennifer Hansler, CNN", "title": "Austria probes reports of Havana Syndrome among US diplomats in Vienna", "description": "Austrian authorities said they are investigating reports that US diplomats in Vienna have experienced symptoms of a mystery illness known as Havana Syndrome.", "url": "https://www.cnn.com/2021/07/18/europe/austria-us-havana-syndrome-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718040603-vienna-skyline-2016-file-super-tease.jpg", "publishedAt": "2021-07-18T08:52:22Z", "content": "Vienna, Austria (CNN)Austrian authorities said they are investigating reports that US diplomats in Vienna have experienced symptoms of a mystery illness known as Havana Syndrome. \r\n\"We take these rep… [+1235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "All but 2 of the 97 victims found in the Surfside building collapse have been identified by authorities", "description": "Since the partial collapse of the Champlain Towers South building on June 24 in Surfside, Florida, the arduous process of finding and identifying victims among the wreckage has been shouldered by many, including search-and-rescue teams, first responders and p…", "url": "https://www.cnn.com/2021/07/18/us/miami-dade-building-collapse-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718012912-01-surfside-memorial-0715-super-tease.jpg", "publishedAt": "2021-07-18T08:31:09Z", "content": "(CNN)Since the partial collapse of the Champlain Towers South building on June 24 in Surfside, Florida, the arduous process of finding and identifying victims among the wreckage has been shouldered b… [+3638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "Doctors and health officials say their latest Covid-19 hospital patients are unvaccinated and increasingly younger", "description": "Covid-19 is putting younger, healthy and mostly unvaccinated people in hospitals at higher rates as cases continue to climb in much of the US, health experts say.", "url": "https://www.cnn.com/2021/07/18/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718020311-01-coronavirus-test-la-0714-super-tease.jpg", "publishedAt": "2021-07-18T07:36:36Z", "content": "(CNN)Covid-19 is putting younger, healthy and mostly unvaccinated people in hospitals at higher rates as cases continue to climb in much of the US, health experts say. \r\nOver the past week, 48 states… [+4218 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zeena Saifi, CNN", "title": "Qatar's Ras Abu Aboud stadium is the first built in World Cup history that was meant to be torn down", "description": "It was once a quiet waterfront, only enjoying the occasional sounds from the nearby Gulf shores. Now, it's a dizzying burst of color and life -- soon to be filled with up to 40,000 screaming fans.", "url": "https://edition.cnn.com/2021/07/18/football/ras-abu-aboud-stadium-2022-qatar-world-cup-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715112230-06-ras-abu-aboud-stadium-super-tease.jpg", "publishedAt": "2021-07-18T07:28:00Z", "content": "(CNN)It was once a quiet waterfront, only enjoying the occasional sounds from the nearby Gulf shores. Now, it's a dizzying burst of color and life -- soon to be filled with up to 40,000 screaming fan… [+4837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Certain types of fish are being renamed in the wake of anti-Asian hate crimes", "description": "Grass, bighead, silver and black carp have been commonly known as \"Asian\" carp since the 1970s, but officials say calling these invasive fishes \"Asian,\" and then promoting efforts to control their population, has xenophobic connotations.", "url": "https://www.cnn.com/2021/07/18/us/asian-invasive-carp-rename-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210716145459-invasive-carp-file-2012-super-tease.jpg", "publishedAt": "2021-07-18T07:03:01Z", "content": "(CNN)Throughout the country, the names of birds, moths, and geographical sites are being changed as Americans reconsider the outdated stereotypes and racist connotations some of these names may carry… [+3992 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul Vercammen, CNN", "title": "Opera singers are teaching long-term Covid-19 patients to breathe again", "description": "Covid-19 shoved Jeff Sweat into a medical coma for three weeks last winter, face down on a ventilator, on death's trap door.", "url": "https://www.cnn.com/2021/07/18/us/therapists-opera-treat-covid-patients/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717124458-06-therapists-opera-treat-covid-patients-super-tease.jpg", "publishedAt": "2021-07-18T06:05:29Z", "content": "(CNN)Covid-19 shoved Jeff Sweat into a medical coma for three weeks last winter, face down on a ventilator, on death's trap door.\r\n\"I took care of him when he was literally near death,\" said Dr. Nida… [+3541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Where to score some deals on National Ice Cream Day and what you should know about the holiday", "description": "It's hot out there, and all we're thinking about is ways to cool down -- or just finding any excuse to eat more ice cream.", "url": "https://www.cnn.com/2021/07/18/us/national-ice-cream-day-deals-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717185649-ice-cream-cones-file-super-tease.jpg", "publishedAt": "2021-07-18T05:10:30Z", "content": "(CNN)It's hot out there, and all we're thinking about is ways to cool down -- or just finding any excuse to eat more ice cream.\r\nNational Ice Cream Day is Sunday and we've got the scoop for you.\r\nWhe… [+4686 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "Two athletes in Tokyo's Olympic Village test positive for Covid-19", "description": "Two athletes in Tokyo's Olympic Village have tested positive for Covid-19, organizers confirmed Sunday, just days before the Games were set to begin.", "url": "https://www.cnn.com/2021/07/18/asia/olympic-village-athletes-covid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210620200856-tokyo-olympic-village-exterior-wang-super-tease.jpg", "publishedAt": "2021-07-18T04:58:58Z", "content": "(CNN)Two athletes in Tokyo's Olympic Village have tested positive for Covid-19, organizers confirmed Sunday, just days before the Games were set to begin.\r\nThree cases have now been confirmed in the … [+2496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Luke McGee, CNN", "title": "Boris Johnson is taking another huge gamble by lifting lockdowns in England. Even he admits it could lead to more deaths from Covid", "description": "On Monday, Boris Johnson will place English citizens at the center of an experiment that will give some indication of how well a highly populated country with surging cases of coronavirus copes when lockdown restrictions are lifted.", "url": "https://www.cnn.com/2021/07/18/uk/boris-johnson-covid-gamble-freedom-day-intl-gbr-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210217142830-01-boris-johnson-astrazeneca-0217-super-169.jpg", "publishedAt": "2021-07-18T04:04:55Z", "content": "On Monday, Boris Johnson will place English citizens at the center of an experiment that will give some indication of how well a highly populated country with surging cases of coronavirus copes when … [+7948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Harwood, CNN", "title": "The White House's inflation headache", "description": "Resurgent inflation gives President Joe Biden one of those signature White House headaches: rising public concern, limited ability to resolve it, and risks attached to potential steps he might take.", "url": "https://www.cnn.com/2021/07/18/politics/white-house-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715133120-01-biden-child-tax-credit-0715-super-tease.jpg", "publishedAt": "2021-07-18T04:02:07Z", "content": "(CNN)Resurgent inflation gives President Joe Biden one of those signature White House headaches: rising public concern, limited ability to resolve it, and risks attached to potential steps he might t… [+5095 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Camille Furst", "title": "Pilot dies in fall from hot air balloon, passengers carried across state line", "description": "The pilot of a hot air balloon died after becoming entangled under its basket and falling to the ground in Bradford, Vermont, Thursday afternoon, according to state police.", "url": "https://www.cnn.com/2021/07/17/us/hot-air-balloon-accident-vermont-new-hampshire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718140853-bradford-hot-air-balloon-crash-investigators-super-tease.jpg", "publishedAt": "2021-07-18T03:18:57Z", "content": "(CNN)The pilot of a hot air balloon died after becoming entangled under its basket and falling to the ground in Bradford, Vermont, Thursday afternoon, according to state police.\r\nVermont State Police… [+1720 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Clary", "title": "Nationals Park shooting: At least 4 shot outside stadium during baseball game Saturday night, police say", "description": "Fans and players were sent scrambling Saturday night at Nationals Park in Washington, DC, after at least four people were injured in a shooting outside the stadium, according to police.", "url": "https://www.cnn.com/2021/07/17/us/washington-nationals-park-shooting-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717220335-01-nationals-park-dc-incident-0717-super-tease.jpg", "publishedAt": "2021-07-18T02:29:03Z", "content": "(CNN)Fans and players were sent scrambling Saturday night at Nationals Park in Washington, DC, after at least four people were injured in a shooting outside the stadium, according to police.\r\nCNN jou… [+800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Ben Tinker and Alaa Elassar, CNN", "title": "Fauci says polio would still exist in the US if the 'false information' currently being spread existed decades ago", "description": "If the health misinformation currently spreading regarding coronavirus vaccines existed during the days of polio, it would have never been eradicated, Dr. Anthony Fauci, President Joe Biden's chief medical adviser, said Saturday.", "url": "https://www.cnn.com/2021/07/17/us/fauci-polio-coronavirus-false-information/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717192810-fauci-polio-coronavirus-false-information-super-169.jpg", "publishedAt": "2021-07-18T02:02:48Z", "content": "If the health misinformation currently spreading regarding coronavirus vaccines existed during the days of polio, it would have never been eradicated, Dr. Anthony Fauci, President Joe Bidens chief me… [+3114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Is Antarctica a country? The future of the world's least understood continent", "description": "The appeal of the unknown and the desire to set foot on every continent has encouraged travelers to try and make their way to Antarctica, but it's a difficult place to classify.", "url": "https://www.cnn.com/travel/article/is-antarctica-a-country-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713134348-02-antarctica-travel-file-restricted-super-tease.jpg", "publishedAt": "2021-07-18T01:45:23Z", "content": "(CNN) As long as humans have known of its existence, they have wanted to visit Antarctica.\r\nIt is the world's least visited, least populated continent. On the best day, it is extremely hard to get to… [+7047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Is Antarctica a country? The future of the world's least understood continent", "description": "The appeal of the unknown and the desire to set foot on every continent has encouraged travelers to try and make their way to Antarctica, but it's a difficult place to classify.", "url": "https://www.cnn.com/travel/article/is-antarctica-a-country-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210713134348-02-antarctica-travel-file-restricted-super-tease.jpg", "publishedAt": "2021-07-18T01:45:23Z", "content": "(CNN) As long as humans have known of its existence, they have wanted to visit Antarctica.\r\nIt is the world's least visited, least populated continent. On the best day, it is extremely hard to get to… [+7047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Wright and Will Ripley, CNN", "title": "Tokyo 2020: The Japanese superfan who spent $40,000 on Olympics tickets", "description": "Kazunori Takishima has been traveling the world to support Japan at every Olympic Games for the past 15 years, so it was a dream to see the event in his home city of Tokyo. But when a ban on spectators was announced last week due to Covid-19, that dream was o…", "url": "https://edition.cnn.com/2021/07/17/sport/japanese-superfan-olympics-tickets-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715141401-01-kazunori-takishima-super-tease.jpg", "publishedAt": "2021-07-18T00:46:58Z", "content": "(CNN)Kazunori Takishima has been traveling the world to support Japan at every Olympic Games for the past 15 years, so it was a dream to see the event in his home city of Tokyo. But when a ban on spe… [+3022 chars]"}]}