{"status": "ok", "totalResults": 89, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nathan Hodge, CNN", "title": "Putin and Xi call for halt to NATO expansion in show of unity at Beijing Olympics", "description": "Russian President Vladimir Putin and Chinese President Xi Jinping issued a call for NATO to halt further expansion during a meeting on the sidelines of the Olympics on Friday, according to a joint statement released by the Kremlin.", "url": "https://www.cnn.com/2022/02/04/world/china-russia-xi-putin-meeting-nato-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204040512-xi-jinping-putin-pre-olympics-02042022-unlimited-super-tease.jpg", "publishedAt": "2022-02-04T10:48:37Z", "content": "Moscow (CNN)Russian President Vladimir Putin and Chinese President Xi Jinping issued a call for NATO to halt further expansion during a meeting on the sidelines of the Olympics on Friday, according t… [+1287 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jonathan DeLise, CNN", "title": "Why airline route maps look the way they do", "description": "Airline route planning is a lot more than just flying a plane from A to B. Weather, geopolitics, how much a country charges for aircraft to fly over its territory, and even runway length all dictate the way we travel through the sky", "url": "https://www.cnn.com/travel/article/airline-route-maps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220120121840-airline-flying-blue-sky-restricted-super-tease.jpg", "publishedAt": "2022-02-04T10:14:49Z", "content": "(CNN) If you've ever played with the in-flight route maps on board a plane or browsed the destinations on an airline's website, it all looks pretty simple. \r\nTo get from A to B, you simply rise to 30… [+7203 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeff Zeleny, Kevin Liptak and Phil Mattingly, CNN", "title": "South Carolina judge is at the center of a political whirlwind around Biden's Supreme Court decision", "description": "Politics is never far removed from the selection of any Supreme Court justice, but the political winds are blowing with unusual ferocity around J. Michelle Childs, a federal judge from South Carolina who is among those on a short list to fill President Joe Bi…", "url": "https://www.cnn.com/2022/02/04/politics/j-michelle-childs-supreme-court-joe-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220126131947-03-scotus-j-michelle-childs-shortlist-super-tease.jpg", "publishedAt": "2022-02-04T10:00:35Z", "content": "(CNN)Politics is never far removed from the selection of any Supreme Court justice, but the political winds are blowing with unusual ferocity around J. Michelle Childs, a federal judge from South Car… [+9274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "What we know -- and don't -- about director Zhang Yimou's Winter Olympics opening ceremony", "description": "Chinese filmmaker Zhang Yimou is back to direct Beijing's Winter Games' opening and closing ceremonies, almost 14 years after his breathtaking 2008 Summer Olympics show.", "url": "https://www.cnn.com/style/article/zhang-yimou-olympics-opening-closing-ceremony/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204173701-beijing-olympics-rehearsal-fireworks-super-tease.jpg", "publishedAt": "2022-02-04T09:59:33Z", "content": "designPublished 4th February 2022\r\nFilmmaker Zhang Yimou's opening ceremony for the 2008 Beijing Olympics was, for many, the abiding memory of China's first ever Games. \r\nIn a display of color, coord… [+3164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Adam Pourahmadi and Eoin McSweeney, CNN", "title": "Ever wonder how athletes plan their lavish trips? Here's the man who organizes them", "description": "Luxury concierge Johnny Vegas works with sporting superstars to planning entire vacations, from accommodation to daily itineraries. Having already established himself in parts of the United States and Spain, Vegas is looking to expand his concierge empire in …", "url": "https://www.cnn.com/travel/article/johnny-vegas-qatar-world-cup-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202193336-johnny-vegas-dubai-concierge-spt-intl-00000620-super-tease.png", "publishedAt": "2022-02-04T09:30:10Z", "content": "Adam Pourahmadi and Eoin McSweeney, CNNPublished 4th February 2022\r\nDubai, UAE (CNN) Johnny Vegas strolls onto the balcony of a suite at the Five Palm Resort overlooking the glittering Dubai Marina a… [+6231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez, CNN", "title": "Body camera video shows Minneapolis officers shooting Black man during no-knock warrant. Attorneys say he wasn't the target", "description": "In the early morning hours Wednesday, Minneapolis police officers gently placed a key in a city apartment door before bursting through the doorway yelling \"Police! Search warrant!,\" according to body camera footage released by city officials Thursday night.", "url": "https://www.cnn.com/2022/02/04/us/minneapolis-police-shooting-no-knock-warrant-amir-locke/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203221928-01-minneapolis-pd-bodycam-ois-newser-super-tease.jpg", "publishedAt": "2022-02-04T07:53:07Z", "content": "(CNN)In the early morning hours Wednesday, Minneapolis police officers gently placed a key in a city apartment door before bursting through the doorway yelling \"Police! Search warrant!,\" according to… [+5895 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Winter storm heads toward Northeast after bringing dangerous conditions and power outages to South and Midwest", "description": "A sprawling winter storm that blanketed the central and southern US with ice and snow left hundreds of thousands in the dark before making its way toward the Northeast, promising more disruption Friday.", "url": "https://www.cnn.com/2022/02/04/weather/winter-snowstorm-midwest-south-northeast-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203235751-winter-storm-texas-aerial-02032022-super-tease.jpg", "publishedAt": "2022-02-04T07:44:13Z", "content": "(CNN)A sprawling winter storm that blanketed the central and southern US with ice and snow left hundreds of thousands in the dark before making its way toward the Northeast, promising more disruption… [+5362 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "Defying a raging pandemic and months of international controversy, the 2022 Winter Olympics is kicking-off as scheduled in the Chinese capital", "description": "The ice rinks have been smoothed out, the brown mountain slopes draped with artificial snow. The Olympic flame is on its final journey to the heart of Beijing, ready to light up the night sky.", "url": "https://www.cnn.com/2022/02/04/china/china-beijing-winter-olympics-challenges-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203214230-su-yiming-beijing-olympics-0203-restrticted-super-tease.jpg", "publishedAt": "2022-02-04T06:34:10Z", "content": "Beijing (CNN)The ice rinks have been smoothed out, the brown mountain slopes draped with artificial snow. The Olympic flame is on its final journey to the heart of Beijing, ready to light up the nigh… [+9607 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Crawford, National Security Producer", "title": "Atlanta Journal-Constitution: Atlanta-area DA expects special grand jury in Trump probe to see a lot of activity in June and July", "description": "An Atlanta-area district attorney investigating former President Donald Trump's efforts to overturn the 2020 election results in Georgia expects a special grand jury for the case to see a lot of activity in June and July, according to reporting from The Atlan…", "url": "https://www.cnn.com/2022/02/04/politics/fani-willis-fulton-county-georgia-investigation-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203194638-fani-willis-file-super-tease.jpg", "publishedAt": "2022-02-04T06:08:13Z", "content": "(CNN)An Atlanta-area district attorney investigating former President Donald Trump's efforts to overturn the 2020 election results in Georgia expects a special grand jury for the case to see a lot of… [+3436 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Hall of Famer Bill Fitch, who led Boston Celtics to NBA title in 1981, dies at 89", "description": "The basketball world is mourning the death of Bill Fitch, the legendary Hall of Fame NBA head coach who won the NBA Finals in 1981 with the Boston Celtics. He was 89.", "url": "https://www.cnn.com/2022/02/04/sport/nba-bill-fitch-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203221922-bill-fitch-boston-celtics-coach-file-super-tease.jpg", "publishedAt": "2022-02-04T05:16:44Z", "content": "(CNN)The basketball world is mourning the death of Bill Fitch, the legendary Hall of Fame NBA head coach who won the NBA Finals in 1981 with the Boston Celtics. He was 89.\r\n\"Bill served 25 seasons as… [+1473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "Beijing Winter Olympics 2022 opening ceremony", "description": "The Beijing 2022 Winter Olympics officially kicks off as the opening ceremony gets underway at the Beijing National Stadium on Friday.", "url": "https://www.cnn.com/world/live-news/beijing-winter-olympics-2022-opening-ceremony-spt-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203155648-beijing-national-stadium-file-super-tease.jpg", "publishedAt": "2022-02-04T05:00:25Z", "content": "Some 150,000 spectators will be invited to attend the 2022 Winter Games, vice president of the Beijing Organizing Committee Yang Shu'an said on Thursday.\r\nShu'an said Olympic venues will be split eve… [+791 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Tesla recalls 817,000 vehicles in U.S. over seat belt reminder alert", "description": "Tesla Inc is recalling more than 817,000 vehicles in the United States because an audible alert may not activate when a vehicle starts and the driver has not buckled the seat belt, a U.S. auto safety regulator said.", "url": "https://www.cnn.com/2022/02/03/business/tesla-recall-seat-belt-reminder-alert/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203185828-tesla-dealership-super-tease.jpg", "publishedAt": "2022-02-04T04:56:24Z", "content": "Tesla Inc is recalling more than 817,000 vehicles in the United States because an audible alert may not activate when a vehicle starts and the driver has not buckled the seat belt, a U.S. auto safety… [+793 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy and Rhea Mogul, CNN", "title": "India launches last-minute diplomatic boycott of Beijing Olympics over Chinese solider", "description": "India on Thursday announced a diplomatic boycott of the Winter Olympics in Beijing after a commander involved in 2020 border clashes between the two countries appeared as an Olympic torchbearer in the customary torch relay leading up to the Games.", "url": "https://www.cnn.com/2022/02/03/china/india-diplomatic-boycott-beijing-olympics-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203190734-qi-fabao-torch-0202-super-tease.jpg", "publishedAt": "2022-02-04T04:35:40Z", "content": "(CNN)India on Thursday announced a diplomatic boycott of the Winter Olympics in Beijing after a commander involved in 2020 border clashes between the two countries appeared as an Olympic torchbearer … [+3621 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "CDC to unveil its latest weapon in Covid-19 detection: wastewater", "description": "Wastewater-based epidemiology has proven to be so reliable that the government has invested millions to create the National Wastewater Surveillance System, a network of 400 testing sites spread across 19 states.", "url": "https://www.cnn.com/2022/02/03/health/cdc-covid-wastewater-detection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210811160710-wastewater-testing-covid-tucson-super-tease.jpg", "publishedAt": "2022-02-04T03:44:50Z", "content": "(CNN)Three days before Thanksgiving, a planeload of passengers from South Africa touched down in San Francisco. One of them was a woman who was in the early stages of a Covid-19 infection, though she… [+9560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Gregory McMichael will face trial on federal hate crime charges in Ahmaud Arbery killing after withdrawing plea deal", "description": "Gregory McMichael is expected to face trial on federal hate crime charges for his role in the 2020 killing of Ahmaud Arbery after withdrawing a plea agreement.", "url": "https://www.cnn.com/2022/02/03/us/gregory-mcmichael-arbery-hate-crime-federal-trial-proceeds/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203175051-gregory-mcmichael-1027-super-tease.jpg", "publishedAt": "2022-02-04T03:01:13Z", "content": "(CNN)Gregory McMichael is expected to face trial on federal hate crime charges for his role in the 2020 killing of Ahmaud Arbery after withdrawing a plea agreement.\r\nAttorneys for McMichael informed … [+832 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Jury hears opening statements in Sarah Palin's case against The New York Times", "description": "After a delay of more than a week due to the plaintiff's having tested positive for Covid, attorneys finally gave opening statements in former Alaska Governor Sarah Palin's defamation lawsuit against The New York Times on Thursday.", "url": "https://www.cnn.com/2022/02/03/media/sarah-palin-new-york-times-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203163450-01-sarah-palin-new-york-times-lawsuit-0203-super-tease.jpg", "publishedAt": "2022-02-04T02:48:46Z", "content": "(CNN Business)After a delay of more than a week due to the plaintiff's having tested positive for Covid, attorneys finally gave opening statements in former Alaska Governor Sarah Palin's defamation l… [+2736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose and Veronica Stracqualursi, CNN", "title": "Arizona Republican House speaker effectively dooms GOP bill to allow state legislature to reject election results", "description": "A Republican bill that would have overhauled elections in Arizona -- including giving the state legislature the power to reject election results -- proved to be too much even for state GOP leaders this week.", "url": "https://www.cnn.com/2022/02/03/politics/arizona-bill-reject-election-results-effectively-blocked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203163019-rusty-bowers-file-super-tease.jpg", "publishedAt": "2022-02-04T02:48:36Z", "content": "(CNN)A Republican bill that would have overhauled elections in Arizona -- including giving the state legislature the power to reject election results -- proved to be too much even for state GOP leade… [+2917 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Here's how the 3 NFL teams that Brian Flores accused of racial discrimination have responded", "description": "In a lawsuit that rocked America's most popular sport this week, former Miami Dolphins head coach Brian Flores accused the NFL and three of its teams of racial discrimination -- allegations they strongly deny.", "url": "https://www.cnn.com/2022/02/03/sport/nfl-teams-respond-brian-flores-allegations-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220110101225-01-nfl-football-file-super-tease.jpg", "publishedAt": "2022-02-04T02:29:48Z", "content": "(CNN)In a lawsuit that rocked America's most popular sport this week, former Miami Dolphins head coach Brian Flores accused the NFL and three of its teams of racial discrimination -- allegations they… [+4499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, CNN", "title": "State Department backs Team USA athletes' freedom of expression in Beijing", "description": "The State Department has shared information about China's human rights abuses with US Olympic athletes and defended athletes' right to express opposition to those violations on the eve of the Winter Olympic Games in Beijing.", "url": "https://www.cnn.com/2022/02/03/politics/olympics-beijing-us-athletes-freedom-expression-state-department/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203175408-olympic-rings-0203-super-tease.jpg", "publishedAt": "2022-02-04T02:11:14Z", "content": "(CNN)The State Department has shared information about China's human rights abuses with US Olympic athletes and defended athletes' right to express opposition to those violations on the eve of the Wi… [+5011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peter Bergen, CNN National Security Analyst", "title": "An abrupt about-face for Biden on using the military", "description": "This week, President Joe Biden made two decisions that belied his reputation as a dove, writes Peter Begen.", "url": "https://www.cnn.com/2022/02/03/opinions/biden-syria-raid-about-face-using-the-military-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203110808-01-syria-us-raid-020322-super-tease.jpg", "publishedAt": "2022-02-04T02:02:53Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. His new book is \"The Rise and Fall of Osama bin Laden.\" The v… [+5281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Biden and NYC Mayor Eric Adams seal their alliance as Democrats face a crossroads on crime", "description": "Their paths to the New York Police Department's downtown Manhattan headquarters on Thursday could hardly have been more different, but President Joe Biden and New York City Mayor Eric Adams are now -- by their choosing and at their own political risk -- incre…", "url": "https://www.cnn.com/2022/02/03/politics/eric-adams-joe-biden-new-york-democrats-crime/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203163401-adams-biden-0203-super-tease.jpg", "publishedAt": "2022-02-04T01:18:41Z", "content": "(CNN)Their paths to the New York Police Department's downtown Manhattan headquarters on Thursday could hardly have been more different, but President Joe Biden and New York City Mayor Eric Adams are … [+8829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "On crime, Biden should do what's right", "description": "Biden is wrestling with the volatile politics of crime, a controversial issue which may impact his popularity, writes Julian Zelizer. But it would a big mistake if he let the political temptations of the moment guide his position on an issue that is critical …", "url": "https://www.cnn.com/2022/02/03/opinions/biden-eric-adams-crime-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203130347-biden-police-headquarters-ny-0203-super-tease.jpg", "publishedAt": "2022-02-04T00:46:35Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book \"Abraham Joshua Heschel: A Life of Radical Amazement.\" Follow him … [+5881 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Why Wordle was perfect for this moment", "description": "Nicole Hemmer puts the Wordle craze in context, explaining why it works so well in our late-pandemic moment but also why it reflects familiar historical patterns of anxiety in American culture around enjoying games and pastimes for pure pleasure.", "url": "https://www.cnn.com/2022/02/03/opinions/wordle-craze-new-york-times-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201131428-wordle-file-0111-super-tease.jpg", "publishedAt": "2022-02-04T00:08:43Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+5525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Russian troop buildup in Belarus is a 'big worry' to US and European officials", "description": "US and European officials have expressed alarm at Russia's military build-up in Belarus, describing it as a significant and concerning development as the threat of a Russian invasion of Ukraine looms and calls for Moscow to de-escalate appear to be going unhe…", "url": "https://www.cnn.com/2022/02/03/politics/belarus-russian-troops-worries/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210528161358-lukashenko-putin-meeting-0528-super-tease.jpg", "publishedAt": "2022-02-03T22:43:05Z", "content": "(CNN)US and European officials have expressed alarm at Russia's military build-up in Belarus, describing it as a significant and concerning development as the threat of a Russian invasion of Ukraine … [+3817 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Snap recovers from Apple privacy changes, shares surge 50%", "description": "Snap Inc on Thursday said its advertising business bounced back from the effects of Apple Inc's privacy changes faster than it expected, and shares of the company skyrocketed 50% as it provided a first quarter outlook that surpassed analyst estimates.", "url": "https://www.cnn.com/2022/02/03/tech/snap-stock/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203173825-02-snapchat-stock-super-tease.jpg", "publishedAt": "2022-02-03T22:42:13Z", "content": "Snap(SNAP) Inc on Thursday said its advertising business bounced back from the effects of Apple Inc's privacy changes faster than it expected, and shares of the company skyrocketed 50% as it provided… [+2518 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Korn", "title": "MacKenzie Scott donates $133.5 million to educational nonprofit Communities in School", "description": "MacKenzie Scott has donated $133.5 million to educational nonprofit Communities in School, an organization that helps students navigate issues inside and outside of the classroom.", "url": "https://www.cnn.com/2022/02/03/tech/mackenzie-scott-cis-donation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201215150119-mackenzie-scott-file-super-tease.jpg", "publishedAt": "2022-02-03T22:14:18Z", "content": "New York (CNN Business)MacKenzie Scott has donated $133.5 million to educational nonprofit Communities in School, an organization that helps students navigate issues inside and outside of the classro… [+1097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Tinder Swindler' is the kind of true crime that mostly just steals your time", "description": "\"The Tinder Swindler\" has the feel of those documentaries that Investigation Discovery seems to churn out at a breakneck pace, only it's getting additional traction thanks to a platform on Netflix. Combining the qualities of a Lifetime movie with a catchy tit…", "url": "https://www.cnn.com/2022/02/03/entertainment/the-tinder-swindler-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203153104-01-tinder-swindler-super-tease.jpg", "publishedAt": "2022-02-03T21:30:58Z", "content": "(CNN)\"The Tinder Swindler\" has the feel of those documentaries that Investigation Discovery seems to churn out at a breakneck pace, only it's getting additional traction thanks to a platform on Netfl… [+1999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabe Cohen, CNN", "title": "New allegations detailed against NFL and Washington Commanders' owner Dan Snyder in Capitol Hill appearance", "description": "Former employees and cheerleaders from the NFL's Washington Commanders on Capitol Hill Thursday detailed their accusations of owner Dan Snyder, including asking staff to compile lewd video clips of cheerleaders without their knowledge or consent as well as a …", "url": "https://www.cnn.com/2022/02/03/sport/nfl-washington-commanders-dan-snyder-new-allegations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203123232-dan-snyder-2020-super-tease.jpg", "publishedAt": "2022-02-03T21:21:16Z", "content": "(CNN)Former employees and cheerleaders from the NFL's Washington Commanders on Capitol Hill Thursday detailed their accusations of owner Dan Snyder, including asking staff to compile lewd video clips… [+2920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeff Zeleny, Chief National Affairs Correspondent", "title": "Biden authorizes $15 million transfer from DNC to House and Senate campaign committees", "description": "President Joe Biden told party leaders at the White House on Wednesday that he has approved a transfer of $15 million from the Democratic National Committee to help boost the efforts of the party's House and Senate campaign committees, officials said.", "url": "https://www.cnn.com/2022/02/03/politics/cash-transfer-biden-dnc-house-senate-midterms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203104035-02-biden-syria-raid-0203-super-tease.jpg", "publishedAt": "2022-02-03T21:08:46Z", "content": "(CNN)President Joe Biden told party leaders at the White House on Wednesday that he has approved a transfer of $15 million from the Democratic National Committee to help boost the efforts of the part… [+3282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "'It is really dizzying for our community': Growing anti-Semitism forcing Jewish Americans to be more vigilant", "description": "Michael Igel had listened to his grandparents' memories of the Holocaust for years when as a tween, he first confronted a friend who had a swastika drawn on his shoe. At that moment, he quickly realized the atrocities his family survived were unknown to many.", "url": "https://www.cnn.com/2022/02/03/us/antisemitism-incidents-holocaust-education/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203150242-01-colleyville-0116-super-tease.jpg", "publishedAt": "2022-02-03T21:08:02Z", "content": "(CNN)Michael Igel had listened to his grandparents' memories of the Holocaust for years when as a tween, he first confronted a friend who had a swastika drawn on his shoe. At that moment, he quickly … [+6994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, CNN", "title": "Nearly 20 years after adopting the Rooney Rule, NFL's racial diversity effort is not what 'my father intended it to be'", "description": "In Brian Flores' discrimination lawsuit against the NFL, the fired Miami Dolphins coach spoke of the humiliation of being subjected to \"a sham interview\" appearing to give a Black candidate a legitimate chance at a head coaching job.", "url": "https://www.cnn.com/2022/02/03/sport/nfl-brian-flores-lawsuit-rooney-rule/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201165441-dan-rooney-1997-super-tease.jpg", "publishedAt": "2022-02-03T20:58:35Z", "content": "(CNN)In Brian Flores' discrimination lawsuit against the NFL, the fired Miami Dolphins coach spoke of the humiliation of being subjected to \"a sham interview\" appearing to give a Black candidate a le… [+12655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Former Tesla worker sues company alleging abuse 'reminiscent of the Jim Crow Era'", "description": "Kaylen Barker, a Black woman who worked at a Tesla manufacturing plant, filed a lawsuit this week in California claiming that the automaker tolerates \"rampant acts of racism\" in its factories.", "url": "https://www.cnn.com/2022/02/03/cars/tesla-racism-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203122358-tesla-factory-lathrop-ca-file-restricted-super-tease.jpg", "publishedAt": "2022-02-03T20:37:38Z", "content": "Washington, DC (CNN Business)Kaylen Barker, a Black woman who worked at a Tesla manufacturing plant, filed a lawsuit this week in California claiming that the automaker tolerates \"rampant acts of rac… [+2977 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan, CNN", "title": "Mount Everest has lost 2,000 years' worth of ice in less than three decades", "description": "The highest glacier on the world's tallest mountain is losing decades worth of ice every year because of human-induced climate change, a new study shows.", "url": "https://www.cnn.com/2022/02/03/asia/mount-everest-climate-ice-glacier-melt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203135111-mount-everest-2020-restricted-super-tease.jpg", "publishedAt": "2022-02-03T20:29:36Z", "content": "(CNN)The highest glacier on the world's tallest mountain is losing decades worth of ice every year because of human-induced climate change, a new study shows. \r\nThe findings serve as a warning that r… [+3089 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Edith Bracho-Sanchez", "title": "A Covid-19 vaccine may soon be available for young kids. Here's what parents should consider", "description": "New mom and pediatrician Edith Bracho-Sanchez reflects on the information -- like the high bar of safety and efficacy for clinical trials -- that helps her feel comfortable with the idea of vaccinating her baby when the time comes.", "url": "https://www.cnn.com/2022/02/03/opinions/pfizer-vaccine-young-kids-eua-request-bracho-sanchez/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201131153-pfizer-vaccine-children-file-super-tease.jpg", "publishedAt": "2022-02-03T20:26:05Z", "content": "Edith Bracho-Sanchez is a primary care pediatrician, director of pediatric telemedicine and assistant professor of pediatrics at Columbia University Irving Medical Center. She is also a member of the… [+5179 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr", "title": "Anti-Cheney and Kinzger resolution is 'watered down' at RNC winter meeting", "description": "A resolution calling for the expulsion of GOP Reps. Liz Cheney and Adam Kinzinger from the House Republican conference has been watered down by Republican National Committee members at the party's annual winter meeting, according to two sources familiar with …", "url": "https://www.cnn.com/2022/02/03/politics/rnc-resolution-cheney-kinzinger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201163012-cheney-kinzinger-file-2021-super-tease.jpg", "publishedAt": "2022-02-03T20:14:00Z", "content": "Salt Lake City, Utah (CNN)A resolution calling for the expulsion of GOP Reps. Liz Cheney and Adam Kinzinger from the House Republican conference has been watered down by Republican National Committee… [+2533 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Murderville' should have been an 'SNL' sketch, not a series", "description": "The playful idea trumps the hit-miss execution in \"Murderville,\" a semi-improvised comedy/murder-mystery that's every bit as odd and messy as that sounds. Will Arnett is the constant in this US version of a British format, which, in terms of the material's we…", "url": "https://www.cnn.com/2022/02/03/entertainment/murderville-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119162457-04-february-2022-streaming-murderville-super-tease.jpg", "publishedAt": "2022-02-03T19:43:20Z", "content": "(CNN)The playful idea trumps the hit-miss execution in \"Murderville,\" a semi-improvised comedy/murder-mystery that's every bit as odd and messy as that sounds. Will Arnett is the constant in this US … [+2004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney, CNN Business", "title": "Equity-rich homeowners are 'sitting pretty' amid sky high real estate prices", "description": "Sky high real estate prices have made a growing number of homeowners \"equity rich,\" according to a report on home equity. That means they have at least 50% equity in their property, or put another way, that the amount they owe on the home is no more than half…", "url": "https://www.cnn.com/2022/02/03/success/us-housing-market-equity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203094135-us-single-family-homes-file-restricted-super-tease.jpg", "publishedAt": "2022-02-03T19:38:44Z", "content": "Sky high real estate prices have made a growing number of homeowners \"equity rich,\" according to a report on home equity. That means they have at least 50% equity in their property, or put another wa… [+2869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The Los Angeles mayor's ridiculous explanation for his maskless photo", "description": "On Sunday, Eric Garcetti was on hand to see the Los Angeles Rams punch their ticket to the Super Bowl. As were plenty of the city's luminaries -- including Earvin \"Magic\" Johnson, who posted pictures on social media.", "url": "https://www.cnn.com/2022/02/03/politics/la-mayor-eric-garcetti-mask-rams-game/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200820021111-eric-garcetti-0320-super-tease.jpg", "publishedAt": "2022-02-03T19:38:13Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Carlo Pizzinelli and Ippei Shibata for CNN Business Perspectives", "title": "The big reason the US and UK are facing such a massive labor shortage", "description": "The potentially largest contributor to a lag in employment recovery is an exodus of older workers from the labor force. For some, this may reflect health concerns related to the pandemic. Others may have reconsidered their need to work as housing and financia…", "url": "https://www.cnn.com/2022/02/03/perspectives/imf-labor-shortage-employment-us-uk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202153407-uk-labor-force-retirement-restricted-super-tease.jpg", "publishedAt": "2022-02-03T19:37:01Z", "content": "This article has been edited from its original version. It was originally published in the International Monetary Fund's blog. Carlo Pizzinelli and Ippei Shibata are economists in the IMF's Research … [+6494 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Wag, a dog-walking startup that once raised $300 million from a single investor, is going public through a SPAC", "description": "Wag, a dog-walking startup that once received $300 million from a single investor only to stumble in executing its strategy, is set to go public in a deal valued not much higher than that one investment.", "url": "https://www.cnn.com/2022/02/03/tech/wag-spac/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203112634-02-wag-dog-walking-startup-super-tease.jpg", "publishedAt": "2022-02-03T19:32:45Z", "content": "(CNN Business)Wag, a dog-walking startup that once received $300 million from a single investor only to stumble in executing its strategy, is set to go public in a deal valued not much higher than th… [+2946 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar, CNN", "title": "Virginia's GOP governor wants to join parents' lawsuit against school mask mandates", "description": "Virginia Gov. Glenn Youngkin is asking a circuit court for one of the state's most populous counties to allow him to join in a lawsuit filed by a group of parents who oppose their local school board's mask mandate.", "url": "https://www.cnn.com/2022/02/03/politics/loudoun-county-schools-youngkin-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211101102459-03-glenn-youngkin-lead-image-super-tease.jpg", "publishedAt": "2022-02-03T18:53:16Z", "content": "(CNN)Virginia Gov. Glenn Youngkin is asking a circuit court for one of the state's most populous counties to allow him to join in a lawsuit filed by a group of parents who oppose their local school b… [+1112 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Moonfall' knocks the disaster epic on an orbit into the ridiculous", "description": "Director Roland Emmerich's latest disaster epic is loud, fast-paced and untethered by logic. While some might find it possible to have fun by surrendering to the silliness, this bad moon doesn't quite rise even to the level of a guilty pleasure.", "url": "https://www.cnn.com/2022/02/03/entertainment/moonfall-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220201144620-01-moonfall-movie-super-tease.jpg", "publishedAt": "2022-02-03T18:28:10Z", "content": "(CNN)\"Moonfall\" follows a familiar orbit into the ridiculous, as director Roland Emmerich's latest disaster epic is loud, fast-paced and untethered by logic, as well as gravity. While some might find… [+3205 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mark Clifford", "title": "This is what victory at the Beijing Games looks like", "description": "China's behavior -- threatening to punish athletes who speak freely and refusing to engage on issues from forced labor to human rights -- has caused the future of the Games themselves to be questioned. But China could seize control of the narrative by releasi…", "url": "https://www.cnn.com/2022/02/03/opinions/olympics-china-release-hong-kong-political-prisoners-clifford/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203121659-committee-for-freedom-hong-kong-london-super-tease.jpg", "publishedAt": "2022-02-03T18:21:44Z", "content": "Mark L. Clifford is the author of \"Today Hong Kong, Tomorrow the World: What China's Crackdown Reveals About Its Plans To End Freedom Everywhere\" and the president of the Committee for Freedom in Hon… [+5931 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "Lawmakers want to make Lunar New Year a federal holiday", "description": "Rep. Grace Meng of New York introduced a bill last week that if passed, would make Lunar New Year the nation's 12th federal holiday.", "url": "https://www.cnn.com/2022/02/03/us/lunar-new-year-federal-holiday-bill-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203102258-01-lunar-new-year-nyc-2022-super-tease.jpg", "publishedAt": "2022-02-03T18:18:08Z", "content": "(CNN)Millions of people in the US celebrate Lunar New Year, and as the Asian American population continues to grow, that number only stands to increase.\r\nDemocratic Rep. Grace Meng of New York wants … [+2174 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, CNN", "title": "US alleges Russia planning false flag operation against Ukraine using 'graphic' video", "description": "The US is alleging that Russia has been preparing to \"fabricate a pretext for an invasion\" of Ukraine, this time using a \"graphic\" video that would depict a fake attack against Russia.", "url": "https://www.cnn.com/2022/02/03/politics/us-alleges-russian-false-flag-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203130445-01-putin-0121-super-tease.jpg", "publishedAt": "2022-02-03T17:48:31Z", "content": "(CNN)The US is alleging that Russia has been preparing to \"fabricate a pretext for an invasion\" of Ukraine, this time using a \"graphic\" video that would depict a fake attack against Russia. \r\nA senio… [+3163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "Susan Sarandon facing backlash for \"mocking heroes\" in anti-cop Twitter post", "description": "Susan Sarandon is facing backlash from law enforcement for a Twitter post she shared comparing the officers gathered at slain NYPD Detective Jason Rivera's funeral to fascists.", "url": "https://www.cnn.com/2022/02/03/entertainment/susan-sarandon-anti-cop-twitter-post/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180121231446-susansarandon-sags-super-tease.jpg", "publishedAt": "2022-02-03T17:24:29Z", "content": "Of all the days for @SusanSarandon to share her true feelings towards police, she picks the day we bury our fallen brother to make such inflammatory &amp; brainless comments. When you spend more time… [+178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Spary and Hannah Ryan, CNN", "title": "Dürer drawing bought for $30 at yard sale worth more than $10 million, experts say", "description": "A 16th century drawing by one of the key figures of the German Renaissance has been valued in excess of $10 million after it was initially purchased at a yard sale for just $30 in 2017.", "url": "https://www.cnn.com/style/article/durer-drawing-yard-sale-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203114355-02-durer-drawing-bars-super-tease.jpg", "publishedAt": "2022-02-03T17:13:35Z", "content": "artsPublished 3rd February 2022\r\nA 16th century drawing by one of the key figures of the German Renaissance has been valued in excess of $10 million after it was initially purchased at a yard sale fo… [+3271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "EPA, White House warn Louis DeJoy to halt plan to replace USPS fleet with gas-powered trucks", "description": "Under the current plan, only 10% of the Postal Service's next generation delivery vehicles will be electric.", "url": "https://www.cnn.com/2022/02/03/politics/epa-postal-service-gas-electric-trucks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203102656-next-gen-postal-service-delivery-vehicles-super-tease.jpg", "publishedAt": "2022-02-03T15:55:28Z", "content": "(CNN)The White House and Environmental Protection Agency on Wednesday blasted the US Postal Service for its decision to replace the vast majority of its aging vehicle fleet with gas-powered trucks, r… [+3038 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "17 feet of snow sparked hope for quelling California's drought. Then precipitation 'flatlined' in January", "description": "January is expected to go down as the driest on record for many parts California.", "url": "https://www.cnn.com/2022/02/03/us/california-drought-snow-dry-january-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203092101-02-california-drought-snow-dry-january-climate-file-super-tease.jpg", "publishedAt": "2022-02-03T15:54:00Z", "content": "(CNN)After months of extreme drought in the West triggered unprecedented water cuts and primed the landscape for massive wildfires, the final stretch of 2021 gave a tiny glimpse of hope for drought-w… [+4513 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "US Army to begin discharging soldiers who refuse Covid-19 vaccination", "description": "The US Army will begin discharging soldiers who refuse to be vaccinated against the coronavirus, unless the service member has an approved exemption or pending request.", "url": "https://www.cnn.com/2022/02/03/politics/military-soldiers-vaccine-mandate-discharge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930125555-us-soldiers-file-2018-super-tease.jpg", "publishedAt": "2022-02-03T15:36:42Z", "content": "Washington (CNN)The US Army will begin discharging soldiers who refuse to be vaccinated against the coronavirus, unless the service member has an approved exemption or pending request.\r\n\"Army readine… [+1326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Rudy Giuliani hits rock bottom (again) with 'The Masked Singer' cameo", "description": "There was a time in the not-too-distant past when Rudy Giuliani was seen as a future face of the Republican Party. Now, he's a punchline.", "url": "https://www.cnn.com/2022/02/03/politics/masked-singer-rudy-giuliani-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210827144803-trump-giuliani-2-super-tease.jpg", "publishedAt": "2022-02-03T15:33:11Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Nintendo Switch tops lifetime sales of Wii console", "description": "Nintendo Co Ltd sold 18.95 million Switch video game consoles in the nine months to the end of December, the Japanese company said on Thursday, taking total sales past 100 million and beating the lifetime sales of its Wii console.", "url": "https://www.cnn.com/2022/02/03/tech/nintendo-switch-sales-wii/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203100939-nintendo-switch-console-store-japan-1008-file-restricted-super-tease.jpg", "publishedAt": "2022-02-03T15:24:05Z", "content": "TokyoNintendo Co Ltd(NTDOY) sold 18.95 million Switch video game consoles in the nine months to the end of December, the Japanese company said on Thursday, taking total sales past 100 million and bea… [+2012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Celine Alkhaldi and Eoin McSweeney, CNN", "title": "Will a new tax dent business-friendly Dubai?", "description": "The United Arab Emirates this week announced the introduction of a corporate tax for the first time. What does this mean for foreign companies and expatriates in the country? Here's what you need to know.", "url": "https://www.cnn.com/2022/02/03/business/mideast-summary-2-3-2022-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202103408-02-newsletter-super-tease.jpg", "publishedAt": "2022-02-03T15:23:16Z", "content": "Abu Dhabi, UAE (CNN Business)Almost 90% of Dubai's population is made up of foreigners who flocked to the Gulf business hub for its yearlong sunshine, a chance for prosperity and, of course, zero tax… [+6938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden urges Congress to come together at annual National Prayer Breakfast: 'How do we unite us again?'", "description": "President Joe Biden on Thursday stressed the importance of unifying the country at a \"moment of great division,\" as he delivered remarks at the National Prayer Breakfast at the US Capitol.", "url": "https://www.cnn.com/2022/02/03/politics/biden-harris-national-prayer-breakfast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220121122750-01-biden-0121-super-tease.jpg", "publishedAt": "2022-02-03T15:07:12Z", "content": "(CNN)President Joe Biden on Thursday stressed the importance of unifying the country at a \"moment of great division,\" as he delivered remarks at the National Prayer Breakfast at the US Capitol. \r\n\"As… [+3130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Rudy Giuliani unmasked on 'The Masked Singer' prompts judges to walk out", "description": "Two judges on \"The Masked Singer\" walked off after Rudy Giuliani unmasked himself at the end of a show taping, a source close to the show told CNN Wednesday.", "url": "https://www.cnn.com/2022/02/03/entertainment/rudy-giuliani-masked-singer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203094624-01-rudy-giuliani-file-super-tease.jpg", "publishedAt": "2022-02-03T14:57:48Z", "content": "(CNN)Two judges on \"The Masked Singer\" walked off after Rudy Giuliani unmasked himself at the end of a show taping, a source close to the show told CNN Wednesday.\r\nRobin Thicke and Ken Jeong walked o… [+413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Firefall at Yosemite: No reservations this time, but restrictions are in place", "description": "The glorious, orange-tinged nature show called \"Firefall\" at Yosemite's Horsetail Fall should be on display later in February. This year, you don't need to make a reservation.", "url": "https://www.cnn.com/travel/article/firefall-yosemite-preview-february-2022-california/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202162031-firefall-2021-super-tease.jpg", "publishedAt": "2022-02-03T14:40:10Z", "content": "(CNN) Sun and water can cooperate to make a visit to Yosemite National Park in California potentially extra special. \r\nIt's a glorious, orange-tinged nature show called \"Firefall.\" For the 2022 seaso… [+1696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell, CNN", "title": "San Francisco 49ers fan in coma after assault outside SoFi Stadium, police say", "description": "A man wearing a San Francisco 49ers jersey was assaulted outside the SoFi Stadium near Los Angeles on Sunday and was later placed in a medically induced coma, police said.", "url": "https://www.cnn.com/2022/02/03/us/49ers-fan-coma-sofi-stadium/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203083343-sofi-stadium-020222-super-tease.jpg", "publishedAt": "2022-02-03T14:16:46Z", "content": "(CNN)A man wearing a San Francisco 49ers jersey was assaulted outside the SoFi Stadium near Los Angeles on Sunday and was later placed in a medically induced coma, police said. \r\nAn Oakland, Californ… [+1255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Melissa Macaya, CNN", "title": "Massive winter storm dumps snow and ice across the US", "description": "More than 100 million people in 25 states stretching from the Mexican to Canadian borders were under winter weather alerts Thursday. Follow here for the latest news and forecasts.", "url": "https://www.cnn.com/us/live-news/winter-storm-snow-ice-02-03-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203031659-winter-storm-chicago-020222-super-tease.jpg", "publishedAt": "2022-02-03T13:47:03Z", "content": "A massive winter storm has airlines canceling thousands of flights from Texas to New York and the numbers are still climbing.\r\nAs of 7:30 a.m. ET today, FlightAware data shows that airlines canceled … [+887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Will McGough, CNN", "title": "Why this Caribbean archipelago is a prime spot to visit next", "description": "Puerto Rico has been through a lot -- storms, disease, quakes. But it's resilient and is now primed to offer travelers more than ever. Find out what's on the menu in 2022.", "url": "https://www.cnn.com/travel/article/puerto-rico-travel-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202150051-12-puerto-rico-travel-super-tease.jpg", "publishedAt": "2022-02-03T13:42:22Z", "content": "(CNN) Perhaps no travel destination in the world has had a rougher go of things these past few years than Puerto Rico.\r\nIn addition to the pandemic, the Caribbean archipelago has faced an eye-popping… [+6483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Exclusive: Medicare expects to start paying for home Covid-19 tests this spring", "description": "Medicare expects to start paying for home Covid-19 tests purchased at participating pharmacies and retailers in the early spring. Over-the-counter tests have not been covered by traditional Medicare before and setting up the process takes some time, which is …", "url": "https://www.cnn.com/2022/02/03/politics/medicare-home-covid-tests/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202142216-home-covid-test-restricted-super-tease.jpg", "publishedAt": "2022-02-03T13:33:22Z", "content": "(CNN)Medicare will start paying for home Covid-19 tests purchased at participating pharmacies and retailers, the Centers for Medicare and Medicaid Services told CNN on Wednesday. It anticipates the o… [+3706 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, Melissa Macaya and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Biden to address US operation in Syria that killed top ISIS leader", "description": "President Biden will deliver remarks about the US counterterrorism mission in northwest Syria that killed ISIS leader Abu Ibrahim al-Hashimi al-Qurayshi. Follow here for the latest news updates.", "url": "https://www.cnn.com/politics/live-news/isis-leader-killed-in-syria-02-03-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203110843-03-syria-us-raid-020322-super-tease.jpg", "publishedAt": "2022-02-03T13:22:31Z", "content": "At least 13 people were killed in clashes that took place during and after a US special forces raid that killed ISIS leader Abu Ibrahim al-Hashimi al-Qurayshi including six children and four women, a… [+1742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Watch sneak peek of 2022 Super Bowl commercials", "description": "Super Bowl regulars Doritos, Samuel Adams and Lay's are once again spending big on ad spots again this year, while Budweiser makes its return to the big game. Here are the Super Bowl commercials available so far.", "url": "https://www.cnn.com/videos/business/2022/02/02/super-bowl-ads-2022-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202154021-super-bowl-ads-2022-super-tease.jpg", "publishedAt": "2022-02-03T13:11:26Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter, CNN", "title": "How worried should we be about the new \"stealth\" Omicron? Our expert weighs in", "description": "A new subvariant of Omicron is spreading rapidly in some parts of the world. This spinoff from the original Omicron variant, called BA.2, has been found in at least 49 countries, including the United States. In some countries, like Denmark, BA.2 has already s…", "url": "https://www.cnn.com/2022/02/03/health/stealth-omicron-variant-wen-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202192820-covid-test-file-0118-california-super-tease.jpg", "publishedAt": "2022-02-03T13:06:18Z", "content": "(CNN)A new subvariant of Omicron is spreading rapidly in some parts of the world. This spinoff from the original Omicron variant, called BA.2, has been found in at least 49 countries, including the U… [+5930 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "The latest on the coronavirus pandemic and the Omicron variant", "description": "Beijing continues to record Covid-19 cases related to the Olympics ahead of the opening ceremony. Follow for live news updates.", "url": "https://www.cnn.com/world/live-news/omicron-variant-coronavirus-news-02-03-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2022-02-03T12:55:28Z", "content": "Sweden is set to remove most Covid-19 restrictions next week, according to the Swedish government on Thursday. \r\nIt comes after fellow Scandinavian countries Norway and Denmark announced the lifting … [+1775 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "Thousands more flights are canceled as a massive winter storm tears across the US", "description": "US airlines have canceled thousands more flights Thursday as a powerful winter storm packing ice, rain, sleet and several inches of snow is stretching from the Midwest to the South and eventually parts of the Northeast.", "url": "https://www.cnn.com/2022/02/03/business/winter-storm-flight-cancellations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203070007-detroit-aiport-snow-02022022-restricted-super-tease.jpg", "publishedAt": "2022-02-03T12:23:46Z", "content": "New York (CNN Business)US airlines have canceled thousands more flights Thursday as a powerful winter storm packing ice, rain, sleet and several inches of snow is stretching from the Midwest to the S… [+2185 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "This is a very strange story to cover. Outside these walls, Zucker is a larger-than-life figure in the news business, but here in the office, he was the boss right down the hall, always ready with a disarming joke or a story idea or a jab about the newsletter…", "url": "https://view.newsletters.cnn.com/messages/1643863217475b29f6bfecf82/raw", "urlToImage": null, "publishedAt": "2022-02-03T11:55:02Z", "content": "-- Zucker, the president of CNN Worldwide for the past nine years, was forced out of his job with very short notice. Zucker said he resigned, but if he had not, he would have been terminated, accordi… [+6758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Alisha Ebrahimji, CNN", "title": "The FBI has identified people suspected of making threats to HBCUs this week, official says", "description": "The Federal Bureau of Investigation has identified individuals suspected of making bomb threats this week directed at historically Black colleges and universities, according to a law enforcement official.", "url": "https://www.cnn.com/2022/02/03/us/hbcu-bomb-threats-fbi-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202183223-hbcu-bomb-threats-0201-super-tease.jpg", "publishedAt": "2022-02-03T11:43:21Z", "content": "(CNN)The Federal Bureau of Investigation has identified individuals suspected of making bomb threats this week directed at historically Black colleges and universities, according to a law enforcement… [+2604 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for Feb. 3: Big storm, Ukraine, Covid, Capitol riot, CNN president", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/02/03/us/five-things-february-3-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203031659-winter-storm-chicago-020222-super-tease.jpg", "publishedAt": "2022-02-03T11:37:11Z", "content": "(CNN) Remember the pre-iPhone era? If you're still holding on to your beloved older cell phone, you may be forced to upgrade soon. Major mobile networks are retiring 3G service and moving their subsc… [+5870 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Discovery and BT are close to a sports TV deal", "description": "Britain's BT Group has entered exclusive discussions with Discovery to create a joint venture between BT Sport and Eurosport, saying the move would keep it in the \"exciting\" content business while sharing expensive rights costs.", "url": "https://www.cnn.com/2022/02/03/media/discovery-bt-sport/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203061445-bt-group-hq-london-12022021-restricted-super-tease.jpg", "publishedAt": "2022-02-03T11:24:32Z", "content": "LondonBritain's BT Group(BTGOF) has entered exclusive discussions with Discovery to create a joint venture between BT Sport and Eurosport, saying the move would keep it in the \"exciting\" content busi… [+1782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Tainted cocaine in Argentina leaves 17 dead", "description": "At least 17 people have died in Argentina after consuming cocaine suspected of containing a poisonous substance, with the cases clustered around several towns in sprawling Buenos Aires province, officials and local media said on Wednesday.", "url": "https://www.cnn.com/2022/02/03/americas/tainted-cocaine-argentina-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203104627-01-tainted-cocaine-kills-17-argentine-intl-super-tease.jpg", "publishedAt": "2022-02-03T11:23:39Z", "content": "Buenos Aires, ArgentinaAt least 17 people have died in Argentina after consuming cocaine suspected of containing a poisonous substance, with the cases clustered around several towns in sprawling Buen… [+1949 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Simone Pathe, CNN", "title": "The 10 Senate seats most likely to flip in 2022", "description": "There's nothing like a Supreme Court vacancy to get people in Washington, DC, talking about the Senate. And with nine months to go until the midterm elections, here is CNN's latest look at the 10 Senate seats most likely to flip, as of right now.", "url": "https://www.cnn.com/2022/02/03/politics/senate-race-rankings-february/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210420124249-us-capitol-dome-0413-super-tease.jpg", "publishedAt": "2022-02-03T11:09:19Z", "content": "(CNN)There's nothing like a Supreme Court vacancy to get people in Washington talking about the Senate. \r\nIt's less clear, however, whether the voters who will decide control of the Senate nine month… [+20193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "From Queen Victoria to Cardi B, how this legacy watchmaker found itself in the zeitgeist", "description": "One of the most regularly name-dropped luxury brands in hip-hop lyrics, Patek Phillippe has become the ultimate status symbol for young people today.", "url": "https://www.cnn.com/style/article/patek-philippe-celebrity-popular-culture/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220120050951-06-patek-philippe-celebrities-cardib-restricted-super-tease.jpg", "publishedAt": "2022-02-03T11:01:40Z", "content": "luxuryPublished 3rd February 2022\r\nFrom Joe DiMaggio to Albert Einstein, Princess Diana to Victoria Beckham, watchmaker Patek Philippe has long been a celebrity favorite. But the Swiss brand's reputa… [+9318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Turkey's inflation soars to two-decade high of almost 49%", "description": "Turkey's annual inflation soared to a 20-year high of 48.7% in January, data showed on Thursday, fueled by President Recep Tayyip Erdogan's push for unorthodox interest rate cuts and a resulting crash in the currency late last year.", "url": "https://www.cnn.com/2022/02/03/business/turkey-inflation-two-decade-high/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203103123-turkey-inflation-two-decade-high-super-tease.jpg", "publishedAt": "2022-02-03T10:49:08Z", "content": "IstanbulTurkey's annual inflation soared to a 20-year high of 48.7% in January, data showed on Thursday, fueled by President Recep Tayyip Erdogan's push for unorthodox interest rate cuts and a result… [+2243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Andrew Cohen", "title": "Canada's trucker protesters aren't who Americans might think", "description": "For days, the army of truckers and their disciples has been honking, marching, demanding and posturing. The \"Freedom Convoy\" has come to this sleepy capital to protest a mandate that requires truckers entering the country to be vaccinated or comply with testi…", "url": "https://www.cnn.com/2022/02/03/opinions/canada-truckers-protests-covid-19-trudeau-cohen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202012554-05-ottawa-canada-convoy-protests-super-tease.jpg", "publishedAt": "2022-02-03T10:01:16Z", "content": "Andrew Cohen is a journalist, a professor at Carleton University, and author of \"Two Days in June: John F. Kennedy and the 48 Hours That Made History.\" The views expressed in this commentary are his … [+6170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judith Graham, Kaiser Health News", "title": "Pandemic-fueled shortages of home health aides strand patients without care", "description": "Home health and hospice agencies are experiencing extreme worker shortages, which means they can't provide services to all the patients seeking care at home.", "url": "https://www.cnn.com/2022/02/03/health/home-health-care-aide-shortage-khn-partner-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202173958-senior-home-care-stock-super-tease.jpg", "publishedAt": "2022-02-03T09:32:13Z", "content": "(CNN)Frail older adults are finding it harder than ever to get paid help amid acute staff shortages at home health agencies.\r\nSeveral trends are fueling the shortages: Hospitals and other employers a… [+8395 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Pallabi Munsi, CNN\nPhotos by Betty Laura Zapata for CNN", "title": "UK government bans virginity testing, but has still not apologised for past abuses on immigrants", "description": "The UK government has made virginity testing and hymenoplasties a criminal offence but in the 1970s, it conducted checks on the same demographic it is now trying to protect.", "url": "https://www.cnn.com/2022/02/03/uk/virginity-testing-hymenoplasty-ban-uk-asequals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202150556-05-virginity-testing-as-equals-hp-super-tease.jpg", "publishedAt": "2022-02-03T07:27:02Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)Last week the UK government added a cla… [+11329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Triple whammy of snow, ice and sleet in store for parts of the South and Midwest", "description": "A massive storm pummeling a large swath of the US has already dumped heavy snow and continues to threaten the parts of the country Thursday with a triple whammy of snow, ice and sleet that could make travel miserable and leave many in the dark.", "url": "https://www.cnn.com/2022/02/03/weather/winter-snowstorm-midwest-south-northeast-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202235458-chicago-snow-02022022-super-tease.jpg", "publishedAt": "2022-02-03T07:24:52Z", "content": "Caught in the path of the storm? Use CNN's lite site for low bandwidth.\r\n (CNN)A massive storm pummeling a large swath of the US has already dumped heavy snow and continues to threaten the parts of t… [+3834 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "US conducts counterterrorism raid in northwest Syria, but few details offered", "description": "US Special Forces conducted a \"successful\" counterterrorism mission in northwest Syria Wednesday evening, the Pentagon said, but offered few other details.", "url": "https://www.cnn.com/2022/02/03/world/syria-us-special-forces-raid-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082132-social-gfx-breaking-news-super-tease.jpg", "publishedAt": "2022-02-03T06:49:16Z", "content": "Washington (CNN)US Special Forces conducted a \"successful\" counterterrorism mission in northwest Syria Wednesday evening, the Pentagon said, but offered few other details.\r\nPentagon press secretary J… [+1217 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "DeSantis strategizes for his future while Trump obsesses over his election loss", "description": "Donald Trump is still waging his hopeless fight to win the last White House race. But his possible heir apparent, Florida Gov. Ron DeSantis, already seems to be trying to triumph in the next one.", "url": "https://www.cnn.com/2022/02/03/politics/donald-trump-ron-desantis-2024-election-republicans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220114184652-destantis-trump-split-super-tease.jpg", "publishedAt": "2022-02-03T05:02:27Z", "content": "(CNN)Donald Trump is still waging his hopeless fight to win the last White House race. But his possible heir apparent, Florida Gov. Ron DeSantis, already seems to be trying to triumph in the next one… [+9034 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "China's JD.com CEO joins billionaire charity rush with $2.3 billion share pledge", "description": "JD.com founder and CEO Richard Liu will donate company shares worth about $2.34 billion to charity, the Chinese e-commerce giant said on Wednesday, adding to a list of similar philanthropic pledges from the country's top tech billionaires.", "url": "https://www.cnn.com/2022/02/02/tech/jd-richard-liu-charity-shares-pledge-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202223138-richard-qiangdong-liu-2017-file-super-tease.jpg", "publishedAt": "2022-02-03T04:36:10Z", "content": "JD.com founder and CEO Richard Liu will donate company shares worth about $2.34 billion to charity, the Chinese e-commerce giant said on Wednesday, adding to a list of similar philanthropic pledges f… [+1219 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "Beneath the Great Wall of China lies the world's deepest high-speed railway station", "description": "Buried 102 meters (335 feet) below ground and covering an area of more than 36,000 square meters, the three-story Badaling Great Wall Station is said to be the world's deepest and largest underground high-speed railway station.", "url": "https://www.cnn.com/travel/article/badaling-great-wall-station-high-speed-railway-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220127091821-02-badaling-great-wall-station-highspeed-railway-super-tease.jpg", "publishedAt": "2022-02-03T03:46:54Z", "content": "(CNN) With the 2022 Beijing Winter Olympics fast approaching, the world's first self-driving high-speed train is already in action, transporting athletes and officials between the two main cities hos… [+4795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Julia Hollingsworth, CNN", "title": "New Zealand announces plans to reopen to the world", "description": "New Zealand has announced it will begin reopening to the world, signaling an end to nearly two years of tough border rules that have separated families and shut out almost all foreigners.", "url": "https://www.cnn.com/travel/article/new-zealand-borders-opening-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202221352-jacinda-ardern-012322-super-tease.jpg", "publishedAt": "2022-02-03T03:42:29Z", "content": "(CNN) New Zealand has announced it will begin reopening to the world, signaling an end to nearly two years of tough border rules that have separated families and shut out almost all foreigners.\r\nPrim… [+3296 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "What is it like to fly on a small plane compared to a big plane?", "description": "Everything you need to know about small plane safety, speed and more.", "url": "https://www.cnn.com/travel/article/flying-small-vs-big-airplane-explainer-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220130222304-cessna-airport-china-file-12292021-restricted-super-tease.jpg", "publishedAt": "2022-02-03T03:04:41Z", "content": "(CNN) What's the difference between flying on a small plane versus a large one, besides the price?\r\nMany misconceptions and preconceptions abound.Some people swear they only get airsickness on small … [+5315 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "Josh Hawley joins Tucker Carlson in ripping a gash in GOP's Ukraine stance", "description": "Frida Ghitis writes that GOP Sen. Josh Hawley's desire to block US support for Ukraine joining NATO proves the lawmaker has joined the Trump-Carlson branch of the party, which preaches isolationism and strongly advocates against US involvement abroad.", "url": "https://www.cnn.com/2022/02/02/opinions/josh-hawley-ukraine-russia-gop-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210119152918-01-hawley-dec2020-super-tease.jpg", "publishedAt": "2022-02-03T02:42:03Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washington Post and a c… [+6452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Newton, CNN", "title": "Ottawa's police chief says the city might need military's help to end the trucker protest", "description": "The ongoing protest by Canadian truckers over Covid-19 health restrictions is now an \"unlawful\" occupation of the country's capital, Ottawa officials said on Wednesday, adding it may take the military's help to bring it to an end.", "url": "https://www.cnn.com/2022/02/02/americas/ottawa-trucker-protest-military-help/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202164953-ottawa-trucker-protest-0201-super-tease.jpg", "publishedAt": "2022-02-03T02:04:45Z", "content": "(CNN)The ongoing protest by Canadian truckers over Covid-19 health restrictions is now an \"unlawful\" occupation of the country's capital, Ottawa officials said on Wednesday, adding it may take the mi… [+4323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann and Paul LeBlanc, CNN", "title": "Here's why presidents send US troops abroad", "description": "President Joe Biden has approved the deployment of 3,000 US troops to Poland, Germany and Romania to bolster NATO countries in Eastern Europe.", "url": "https://www.cnn.com/2022/02/02/politics/president-authority-deploy-us-troops-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220124114822-biden-oval-office-1209-super-tease.jpg", "publishedAt": "2022-02-03T02:04:04Z", "content": "Washington (CNN)President Joe Biden has approved the deployment of 3,000 US troops to Poland, Germany and Romania to bolster NATO countries in Eastern Europe. \r\nThe deployments, US officials have tol… [+4252 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Trump's growing recklessness is a ticking time bomb", "description": "Rep. Pete Aguilar of California, a Democrat who is a member of the House select committee investigating the January 6 attack, accused former President Donald Trump of tampering with witnesses by floating the possibility of pardoning those who took part in the…", "url": "https://www.cnn.com/2022/02/02/opinions/trump-pardon-jan-6-mass-protests-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220129223107-03-trump-rally-texas-012922-super-tease.jpg", "publishedAt": "2022-02-03T01:18:53Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "San Francisco becomes fourth city in California to apologize to Chinese community for racist past", "description": "San Francisco is formally apologizing to its Chinese residents for discriminatory actions taken during the city's storied history.", "url": "https://www.cnn.com/2022/02/02/us/san-francisco-apology-chinese-community/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202165724-san-francisco-skyline-super-tease.jpg", "publishedAt": "2022-02-03T01:09:17Z", "content": "(CNN)San Francisco is formally apologizing to its Chinese residents for discriminatory actions taken during the city's storied history.\r\nThe Board of Supervisors passed the apology resolution present… [+2134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "Brian Flores, who is accusing the NFL of racial discrimination, is not one to back down", "description": "Brian Flores grew up in a tough part of Brooklyn and worked long hours in his first football job as a scouting assistant. Now he's taking on the NFL -- and facing an uncertain future.", "url": "https://www.cnn.com/2022/02/02/us/brian-flores-coach-nfl-profile-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202115314-01-brian-flores-file-2021-super-tease.jpg", "publishedAt": "2022-02-03T01:05:36Z", "content": "(CNN)On February 4, 2019, the Miami Dolphins introduced Brian Flores as the team's 13th head coach at a press conference full of smiles and heady talk about the team's future. \r\nIt was the day after … [+7272 chars]"}]}