{"status": "ok", "totalResults": 78, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Bass", "title": "Women athletes powered Team USA's Olympic victory", "description": "Amy Bass reflects on the various ways that the Tokyo Olympics pushed boundaries -- in gender roles, in pandemic protocols, and more. Despite the increased pressure and dangers presented by the pandemic, Japan rose to the challenge to protect athletes from aro…", "url": "https://www.cnn.com/2021/08/08/opinions/olympics-closing-ceremony-tokyo-2020-bass/index.html", "urlToImage": null, "publishedAt": "2021-08-08T21:49:15Z", "content": "In June of 2013, Tokyos bid to host the Olympic Games in 2020 ranked first in the International Olympic Committees technical assessment, something that went a long way a few months later when it emer… [+10530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts and Camille Furst, CNN", "title": "California's Dixie Fire now second-largest in state's history", "description": "The Dixie Fire in California, the largest wildfire in the country, has grown to become the second-biggest in the state's history, according to CalFire.", "url": "https://www.cnn.com/2021/08/08/us/california-dixie-wildfire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808165044-01-western-wildfires-0807-dixie-fire-super-tease.jpg", "publishedAt": "2021-08-08T21:40:44Z", "content": "(CNN)The Dixie Fire in California, the largest wildfire in the country, has grown to become the second-biggest in the state's history, according to CalFire. \r\nThe blaze has scorched 463,477 acres of … [+1592 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackson Dill", "title": "Prolonged period of 'potentially dangerous heat' becoming more likely for the Northwest, weather service warns", "description": "More than 260 million people in the United States are forecast to experience highs of at least 90 degrees by the end of this week as a new heat wave envelops the Northwest, threatening the region with record-breaking, dangerous temperatures.", "url": "https://www.cnn.com/2021/08/08/weather/heat-high-temperatures-northwest-northeast/index.html", "urlToImage": null, "publishedAt": "2021-08-08T21:38:13Z", "content": "More than 260 million people in the United States are forecast to experience highs of at least 90 degrees by the end of this week as a new heat wave envelops the Northwest, threatening the region wit… [+5166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dean Obeidallah", "title": "Biden praises US Olympians while Trump is only vocal when they lose", "description": "Dean Obeidallah writes about the contrast between President Joe Biden's treatment of Olympians -- categorically celebrating their victories -- with former President Donald Trump, who's approval depends on whether the winner aligns with him politically.", "url": "https://www.cnn.com/2021/08/08/opinions/olympics-trump-uswnt-rapinoe-fox-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805075904-24-olympics-080521-football-super-tease.jpg", "publishedAt": "2021-08-08T21:11:35Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+4509 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson", "title": "6 members of a Florida church died of Covid-19 in 2 weeks, pastor says. On Sunday the church held a vaccination clinic", "description": "In just two weeks, six members of a Florida church died from Covid-19. All were unvaccinated, their pastor said.", "url": "https://www.cnn.com/2021/08/08/us/florida-church-covid-deaths-vaccination-clinic-trnd/index.html", "urlToImage": null, "publishedAt": "2021-08-08T20:40:09Z", "content": "In just two weeks, six members of a Florida church died from Covid-19. All were unvaccinated, their pastor said. \r\nNow the church is hosting a vaccination clinic.\r\nPastor George Davis at Impact Churc… [+1936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Olga Pavlova", "title": "Paul Whelan released from solitary confinement in Russian prison", "description": "Paul Whelan, a US citizen detained in Russia, has been released from solitary confinement in his Mordovian penal colony in the country, according to Russian state news agency TASS.", "url": "https://www.cnn.com/2021/08/08/politics/paul-whelan-solitary-confinement-russian-prison/index.html", "urlToImage": null, "publishedAt": "2021-08-08T19:49:03Z", "content": "Paul Whelan, a US citizen detained in Russia, has been released from solitary confinement in his Mordovian penal colony in the country, according to Russian state news agency TASS. \r\nTASS cited Whela… [+2377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Joseph", "title": "Executive assistant to Andrew Cuomo details allegations of sexual harassment by New York governor", "description": "An assistant to New York Gov. Andrew Cuomo, who until now has only been referred to as \"Executive Assistant 1,\" has publicly identified herself and detailed her claims of sexual harassment by the embattled Democratic governor.", "url": "https://www.cnn.com/2021/08/08/politics/brittany-commisso-andrew-cuomo/index.html", "urlToImage": null, "publishedAt": "2021-08-08T19:43:01Z", "content": "An assistant to New York Gov. Andrew Cuomo, who until now has only been referred to as Executive Assistant 1, has publicly identified herself and detailed her claims of sexual harassment by the embat… [+1123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Big Tech has its eyes set on the metaverse. Here's what that means - CNN", "description": "Facebook has many pressing problems, from proposed antitrust legislation to accusations that the company is contributing to vaccine misinformation. But when CEO Mark Zuckerberg joined a recent conference call with analysts to discuss its latest quarterly resu…", "url": "https://www.cnn.com/2021/08/08/tech/metaverse-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804124201-facebook-metaverse-oculus-vr-sets-file-restricted-super-tease.jpg", "publishedAt": "2021-08-08T19:28:00Z", "content": "New York (CNN Business)Facebook has many pressing problems, from proposed antitrust legislation to accusations that the company is contributing to vaccine misinformation. But when CEO Mark Zuckerberg… [+8713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Lemos", "title": "Trevor Moore, comedian and co-founder of The Whitest Kids U Know, dead at 41", "description": "Trevor Moore, comedian, actor, producer, and co-founder of the sketch comedy group The Whitest Kids U Know, has died at the age of 41.", "url": "https://www.cnn.com/2021/08/08/entertainment/trevor-moore-death/index.html", "urlToImage": null, "publishedAt": "2021-08-08T19:24:01Z", "content": "Trevor Moore, comedian, actor, producer, and co-founder of the sketch comedy group The Whitest Kids U Know, has died at the age of 41. \r\nHis death was confirmed by his manager, Kara Welker, in a stat… [+1261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster and Jasmine Wright, CNN", "title": "Education secretary pleads with politicians making it harder to control Covid-19 pandemic", "description": "Education Secretary Miguel Cardona issued a plea on Sunday to politicians making it harder to control the pandemic while two Republicans called for local officials to make decisions regarding masks in schools amid the fallout over state bans on masks as Covid…", "url": "https://www.cnn.com/2021/08/08/politics/school-mask-mandates-education-secretary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808124739-miguel-cardona-080521-super-tease.jpg", "publishedAt": "2021-08-08T18:48:19Z", "content": "(CNN)Education Secretary Miguel Cardona issued a plea on Sunday to politicians making it harder to control the pandemic while two Republicans called for local officials to make decisions regarding ma… [+3026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell", "title": "Race against time: Inside ATF's efforts to find shooters before they strike again", "description": "DC's police force and special agents from the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) have joined forces to surge resources towards stopping the next shooting. It is one of five ATF efforts underway across the nation in cities experiencing s…", "url": "https://www.cnn.com/2021/08/08/us/atf-police-shootings-partnership/index.html", "urlToImage": null, "publishedAt": "2021-08-08T18:35:46Z", "content": "Gunfire in broad daylight along a busy street in the nations capital last month sent bystanders running. \r\nThe guns were shooting all over, one eyewitness told CNNs Jim Acosta. It sounded like a war … [+7232 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Zdanowicz, CNN", "title": "This teacher is still dealing with symptoms of long Covid. She's going back to the classroom for her students", "description": "Halfway into a challenging school year of teaching second graders in-person with coronavirus safety protocols, a Massachusetts teacher fell ill with Covid-19.", "url": "https://www.cnn.com/2021/08/08/us/teacher-long-covid-back-to-school-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805135744-01-long-haul-covid-teacher-gilbert-super-tease.jpg", "publishedAt": "2021-08-08T18:01:28Z", "content": "(CNN)Halfway into a challenging school year of teaching second graders in-person with coronavirus safety protocols, a Massachusetts teacher fell ill with Covid-19.\r\nWhen Amie Gilbert got sick in mid-… [+7848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frank Pallotta", "title": "'The Suicide Squad' underwhelmed at the box office. Here's why", "description": "\"The Suicide Squad,\" a new, R-rated superhero film from Warner Bros., opened to an estimated $26.5 million at the North American box office this weekend. That number came in under industry expectations, which projected the film to make around $30 million. The…", "url": "https://www.cnn.com/2021/08/08/media/suicide-squad-box-office/index.html", "urlToImage": null, "publishedAt": "2021-08-08T17:36:44Z", "content": "The Suicide Squad, a new, R-rated superhero film from Warner Bros., opened to an estimated $26.5 million at the North American box office this weekend. That number came in under industry expectations… [+3013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frank Pallotta, CNN Business", "title": "'The Suicide Squad' underperformed at the box office. Here's why", "description": "\"The Suicide Squad,\" a new, R-rated superhero film from Warner Bros., opened to an estimated $26.5 million at the North American box office this weekend. That number came in under industry expectations, which projected the film to make around $30 million. The…", "url": "https://www.cnn.com/2021/08/08/media/suicide-squad-box-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623091025-01-suicide-squad-rain-screengrab-super-tease.jpg", "publishedAt": "2021-08-08T17:36:44Z", "content": "New York (CNN Business)\"The Suicide Squad,\" a new, R-rated superhero film from Warner Bros., opened to an estimated $26.5 million at the North American box office this weekend. That number came in un… [+3061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole", "title": "GOP senator breaks with DeSantis on school mask mandates: 'The local official should have control'", "description": "Louisiana Republican Sen. Bill Cassidy on Sunday said he disagrees with Florida Gov. Ron DeSantis' ban on local school officials imposing mask mandates amid a surge in Covid-19 cases in the state, arguing that local officials should control health safety meas…", "url": "https://www.cnn.com/2021/08/08/politics/bill-cassidy-masks-ron-desantis-cnntv/index.html", "urlToImage": null, "publishedAt": "2021-08-08T16:29:21Z", "content": "Louisiana Republican Sen. Bill Cassidy on Sunday said he disagrees with Florida Gov. Ron DeSantis ban on local school officials imposing mask mandates amid a surge in Covid-19 cases in the state, arg… [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Trump's acting attorney general revealed 'frightening' activity at Justice Department, Senate Judiciary chair says", "description": "Senate Judiciary Chairman Dick Durbin said Sunday that former acting Attorney General Jeffrey Rosen revealed in testimony this weekend \"frightening\" information about what had occurred at the Justice Department during the waning days of the Trump administrati…", "url": "https://www.cnn.com/2021/08/08/politics/dick-durbin-jeffrey-rosen-trump-doj-testimony-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324110033-01-dick-durbin-0323-super-tease.jpg", "publishedAt": "2021-08-08T16:16:10Z", "content": "Washington (CNN)Senate Judiciary Chairman Dick Durbin said Sunday that former acting Attorney General Jeffrey Rosen revealed in testimony this weekend \"frightening\" information about what had occurre… [+3465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza", "title": "Young people in West Virginia look to push Sen. Joe Manchin in hopes of passing federal voting rights legislation", "description": "Gabby Cipollone loves her home state of West Virginia. But the 23-year-old says that isn't the case for many young West Virginians.", "url": "https://www.cnn.com/2021/08/08/politics/joe-manchin-voting-rights-young-people/index.html", "urlToImage": null, "publishedAt": "2021-08-08T16:01:58Z", "content": "Gabby Cipollone loves her home state of West Virginia. But the 23-year-old says that isnt the case for many young West Virginians.\r\nOur population is fleeing, Cipollone said, adding that many of her … [+5981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten", "title": "Why Biden's seen a (slight) decline in his approval ratings", "description": "But for the first time in Biden's administration, you can see that there has been a slight but noticeable decline in his approval rating. This drop has coincided with a dip in how Americans view his handling of the coronavirus pandemic.", "url": "https://www.cnn.com/2021/08/08/politics/biden-approval-ratings-analysis/index.html", "urlToImage": null, "publishedAt": "2021-08-08T16:01:13Z", "content": "Poll of the week: A new Quinnipiac University poll finds that President Joe Bidens approval rating stands at 46%, while his disapproval rating sits at 43%. His approval rating in Quinnipiacs previous… [+3682 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicquel Terry Ellis, CNN", "title": "'The difference between life and death.' Black leaders step up vaccine campaigns as Delta variant hits the unvaccinated", "description": "Jeniffer Hall was hesitant to get vaccinated until early July when a Detroit pastor convinced her that she needed the shot to protect herself and her brother -- who she has cared for since he suffered an aneurysm -- from Covid-19.", "url": "https://www.cnn.com/2021/08/08/us/delta-surge-black-communities-vaccination/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804163559-barber-shop-vaccination-chicago-super-tease.jpg", "publishedAt": "2021-08-08T15:56:59Z", "content": "(CNN)Jeniffer Hall was hesitant to get vaccinated until early July when a Detroit pastor convinced her that she needed the shot to protect herself and her brother -- who she has cared for since he su… [+8045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Cori Bush urges tenants to apply for local assistance as CDC eviction moratorium faces legal challenges", "description": "Missouri Rep. Cori Bush, who captured national attention for her high-profile protest of a lapse in the federal eviction moratorium amid the Covid-19 pandemic, urged tenants on Sunday to apply for local assistance in case courts strike down the latest ban on …", "url": "https://www.cnn.com/2021/08/08/politics/cori-bush-rental-assistance-eviction-moratorium-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808074539-cori-bush-sotu-080821-super-tease.jpg", "publishedAt": "2021-08-08T15:53:09Z", "content": "(CNN)Missouri Rep. Cori Bush, who captured national attention for her high-profile protest of a lapse in the federal eviction moratorium amid the Covid-19 pandemic, urged tenants on Sunday to apply f… [+2645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Norman Eisen and Joanna Lydgate", "title": "The rule of law is pushing back against Trump's big lie", "description": ". Norm Eisen and Joanna Lydgate write that those alarmed by the attacks on democracy in the US can breathe a sigh of relief as the rule of law has begun to push back on those attempts -- most recently in Colorado, where a federal judge sanctioned two lawyers …", "url": "https://www.cnn.com/2021/08/08/opinions/the-rule-of-law-is-pushing-back-against-trumps-big-lie-eisen-lydgate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210711201210-trump-cpac-dallas-0711-super-tease.jpg", "publishedAt": "2021-08-08T15:06:47Z", "content": "Norman Eisen, a former ambassador to the Czech Republic and former President Barack Obama's \"ethics czar,\" was special impeachment counsel to House Judiciary Committee in 2019-2020. Joanna Lydgate is… [+6624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Bash and Abbie Sharpe, CNN", "title": "How Anita Dunn got 'to the table' and has helped other women follow", "description": "More than 40 years ago, Anita Dunn was walking into the White House as an intern in then-President Jimmy Carter's administration.", "url": "https://www.cnn.com/2021/08/08/politics/badass-women-anita-dunn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807201125-01-anita-dunn-super-tease.jpg", "publishedAt": "2021-08-08T13:46:10Z", "content": "By Dana Bash and Abbie Sharpe, CNN\r\nUpdated 9:46 AM ET, Sun August 8, 2021\r\n (CNN)More than 40 years ago, Anita Dunn was walking into the White House as an intern in then-President Jimmy Carter's adm… [+8713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Start your week smart: Tokyo Olympics, Chicago, Canada, coronavirus, BTS", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/08/08/us/five-things-august-8-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808072147-07-olympics-080821-closing-ceremony-super-tease.jpg", "publishedAt": "2021-08-08T13:43:40Z", "content": "Well, hello neighbors! Canada reopens its border to the US on Monday for people who are fully vaccinated. Last year, it prohibited Americans from making nonessential visits there because of the coron… [+1165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, Jacob Lev and Eric Levenson, CNN", "title": "Bobby Bowden, legendary Florida State University football coach, dies at 91", "description": "Bobby Bowden, the famed college football coach who led Florida State University for over 30 years and transformed the Tallahassee team into a powerhouse, died Sunday, the school said in a statement. He was 91.", "url": "https://www.cnn.com/2021/08/08/sport/bobby-bowden-death/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210722010634-bobby-bowden-terminal-illness-super-tease.jpg", "publishedAt": "2021-08-08T12:51:59Z", "content": "(CNN)Bobby Bowden, the famed college football coach who led Florida State University for over 30 years and transformed the Tallahassee team into a powerhouse, died Sunday, the school said in a statem… [+3017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church", "title": "Team USA finishes with the most golds and total medals for the third consecutive summer Olympics", "description": "For the third straight summer Olympics, Team USA won more gold medals -- and more medals overall -- than any other country.", "url": "https://www.cnn.com/2021/08/08/sport/olympics-usa-most-medals/index.html", "urlToImage": null, "publishedAt": "2021-08-08T12:26:29Z", "content": "For the third straight summer Olympics, Team USA won more gold medals and more medals overall than any other country.\r\nA total of 626 athletes competed for the USA at the Tokyo 2020 games, clinching … [+1645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Opinion: The culture war that's killing us", "description": "The pioneering 19th century German physician Rudolf Virchow saw medicine \"as the science of human beings\" with \"the obligation to point out problems\" and seek their \"theoretical solution.\" But it is up to politicians, he added, to \"find the means for their ac…", "url": "https://www.cnn.com/2021/08/08/opinions/culture-war-thats-killing-us-opinion-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806164737-florida-covid-testing-0806-super-tease.jpg", "publishedAt": "2021-08-08T12:05:55Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)The pioneering 19th century German phy… [+16558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Harwood", "title": "Safety net 'sugar' in Biden's Families Plan will be hard for Republicans to get rid of if it passes", "description": "The Republican senator emphasized the urgency of killing the Democratic President's program before new benefits locked in public support -- now, or never.", "url": "https://www.cnn.com/2021/08/08/politics/biden-families-plan-safety-net-republicans/index.html", "urlToImage": null, "publishedAt": "2021-08-08T12:02:48Z", "content": "The Republican senator emphasized the urgency of killing the Democratic Presidents program before new benefits locked in public support now, or never.\r\nThe administrations plan is simple, Sen. Ted Cr… [+5226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hauser, Tara John and Nick Paton Walsh", "title": "Taliban seizes Kunduz, first major Afghan city to fall in vacuum left by US troop withdrawal", "description": "The Taliban has seized control of Kunduz in northern Afghanistan, local officials told CNN on Sunday. It is the first major city to fall to the insurgent group since they began their offensive in May, and marks a big blow to the Afghan government.", "url": "https://www.cnn.com/2021/08/08/asia/afghanistan-taliban-kunduz-intl/index.html", "urlToImage": null, "publishedAt": "2021-08-08T12:01:49Z", "content": "The Taliban has seized control of Kunduz in northern Afghanistan, local officials told CNN on Sunday. It is the first major city to fall to the insurgent group since they began their offensive in May… [+4058 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, Manu Raju and Clare Foran, CNN", "title": "Senate moves toward final vote on massive $1.2 trillion bipartisan infrastructure package", "description": "The Senate will reconvene on Sunday at noon to resume consideration of the massive $1.2 trillion bipartisan infrastructure package.", "url": "https://www.cnn.com/2021/08/08/politics/senate-infrastructure-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729174051-infraestructura-dusa-super-tease.jpg", "publishedAt": "2021-08-08T11:03:48Z", "content": "Washington, DC (CNN)The Senate will reconvene on Sunday at noon to resume consideration of the massive $1.2 trillion bipartisan infrastructure package. \r\nThe chamber voted to break a filibuster and a… [+3378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Denver experienced the worst air quality of any major city in the world due to smoke from western wildfires", "description": "Denver experienced the worst air quality of any city in the world for several hours Saturday as heavy smoke from raging western wildfires polluted the city.", "url": "https://www.cnn.com/2021/08/08/weather/us-western-wildfires-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808052352-denver-air-quality-0807-super-tease.jpg", "publishedAt": "2021-08-08T10:22:07Z", "content": "(CNN)Denver experienced the worst air quality of any city in the world for several hours Saturday as heavy smoke from raging western wildfires polluted the city.\r\nIQAir, a Swiss air quality technolog… [+3286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Neelam Bohra and Justin Lear", "title": "More than 400 universities are requiring Covid-19 vaccines. But the murky threat of fake vaccination cards worries some students and experts", "description": "Students at the University of North Carolina at Chapel Hill can voluntarily share their Covid-19 vaccine status with administration, but those who show up on campus unvaccinated or choose not to disclose their vaccination status will have to get tested for co…", "url": "https://www.cnn.com/2021/08/08/us/university-vaccine-mandates-fake-vaccine-cards-trnd/index.html", "urlToImage": null, "publishedAt": "2021-08-08T09:06:18Z", "content": "Students at the University of North Carolina at Chapel Hill can voluntarily share their Covid-19 vaccine status with administration, but those who show up on campus unvaccinated or choose not to disc… [+4480 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "US average of daily Covid-19 cases hits highest level since February, fueled by the Delta variant", "description": "The US is averaging more than 100,000 new daily Covid-19 cases each day, the highest in nearly six months, according to data from Johns Hopkins University.", "url": "https://www.cnn.com/2021/08/08/health/us-coronavirus-sunday/index.html", "urlToImage": null, "publishedAt": "2021-08-08T08:05:40Z", "content": "The US is averaging more than 100,000 new daily Covid-19 cases each day, the highest in nearly six months, according to data from Johns Hopkins University. \r\nThe last time the seven-day average surpa… [+6086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Sierra Nevada red fox is now protected and listed as an endangered species", "description": "The Sierra Nevada red fox, a rare California species whose population is dramatically dwindling, has been listed as endangered.", "url": "https://www.cnn.com/2021/08/08/us/sierra-nevada-red-fox-endangered-species-trnd-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806192629-01-sierra-nevada-red-fox-super-tease.jpg", "publishedAt": "2021-08-08T08:00:56Z", "content": "(CNN)The Sierra Nevada red fox, a rare California species whose population is dramatically dwindling, has been listed as endangered.\r\nThe US Fish and Wildlife Service (FWS) announced in a news releas… [+2367 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Drayer, CNN", "title": "Get your kids to start cooking at home", "description": "Teaching kids how to prepare meals -- while it comes with its challenges -- can be rewarding and enjoyable for the whole family. Here's how to get started.", "url": "https://www.cnn.com/2021/08/08/health/how-to-teach-kids-cooking-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210801210337-04-teach-kids-to-cook-wellness-super-tease.jpg", "publishedAt": "2021-08-08T06:00:55Z", "content": "Lisa Drayer is a nutritionist, author and CNN health and nutrition contributor. In her free time, she enjoys cooking and baking with her two daughters, Brooke, 11, and Elle, 9.\r\n (CNN)As a busy paren… [+7242 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar", "title": "Meet Truffles, the special kitty who wears glasses to help kids feel better about wearing theirs", "description": "Nearly four years ago, Danielle Crull rescued a stray kitten from a forest in Pennsylvania.", "url": "https://www.cnn.com/2021/08/08/us/kitty-glasses-national-cat-day-trnd/index.html", "urlToImage": null, "publishedAt": "2021-08-08T05:01:20Z", "content": "Nearly four years ago, Danielle Crull rescued a stray kitten from a forest in Pennsylvania.\r\nNow, that spunky kitty is changing hundreds of lives by helping children with eye problems feel more confi… [+4839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Where to visit Olympics venues in Japan", "description": "Tourists can't attend the Tokyo Olympics, but when it becomes safer to go to Japan's largest city, fans will be able to connect to these legacy holdovers they're seeing on television now.", "url": "https://www.cnn.com/travel/article/japan-travel-post-olympics-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210808105202-02-tokyo-gate-bridge-super-tease.jpg", "publishedAt": "2021-08-08T04:54:29Z", "content": "(CNN) There's nothing like watching the Olympics on TV to give you a major case of wanderlust. \r\nDespite the mostly empty stadiums -- spectators were banned -- athletes from around the world have sti… [+9641 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and <a href=\"/profiles/brad-lendon\">Brad Lendon</a>, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-08-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-08T04:01:06Z", "content": "Heat, humidity and tropical systems have been the nemesis of athletes during these Olympic Games, and Sunday will bring more of the same.\r\nThe Olympics have already been plagued by one tropical syste… [+597 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells", "title": "2 Chicago officers are in critical condition after a shooting, police say", "description": "Two Chicago police officers were shot Saturday and brought to a local hospital, officials said.", "url": "https://www.cnn.com/2021/08/07/us/chicago-police-officers-shot/index.html", "urlToImage": null, "publishedAt": "2021-08-08T03:23:14Z", "content": "Two Chicago police officers were shot Saturday and brought to a local hospital, officials said.\r\nThe officers were listed in serious/critical condition following a shooting in the 6300 block of South… [+400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh, CNN", "title": "'A Band-Aid over a gaping hole': Booster shots for the rich world won't end the pandemic, experts warn", "description": "• Opinion: When you can't persuade the unvaccinated with facts, try this instead\n• What experts are learning about Lambda, a coronavirus 'variant of interest'\n• US airlines cancel hundreds of flights", "url": "https://www.cnn.com/2021/08/07/world/covid-vaccine-booster-shot-inequality-intl-gbr-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807135517-covid-vaccine-boosters-bribes-inequality-india-080221-super-tease.jpg", "publishedAt": "2021-08-08T02:02:19Z", "content": "London (CNN)The war against Covid-19 is changing, putting into stark relief the deepening divide between countries that have the weapons to fight the virus and those that don't. \r\nAs concerns mount o… [+11427 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, CNN", "title": "Athletes enter 'Faustian bargain' over track and shoe tech developments", "description": "A fast track and new developments in running shoe design have seen a number of records broken at the Tokyo Olympics, but a leading sports scientist has warned athletes that they could be entering into a \"Faustian bargain.\"", "url": "https://www.cnn.com/2021/08/07/sport/olympics-running-technology-tokyo-2020-scli-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807173322-tokyo-olympics-nike-shoes-super-tease.jpg", "publishedAt": "2021-08-08T01:23:25Z", "content": "(CNN)A fast track and new developments in running shoe design have seen a number of records broken at the Tokyo Olympics, but a leading sports scientist has warned athletes that they could be enterin… [+5576 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sophia Saifi, CNN", "title": "Beheading of a diplomat's daughter shows how badly Pakistan is failing its women", "description": "Few cases of femicide make headlines in Pakistan, but the beheading of an ambassador's daughter promises to test a legal system activists say has repeatedly failed victims of violence and needs urgent reform.", "url": "https://www.cnn.com/2021/08/07/asia/pakistan-noor-mukadam-murder-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803025337-01-noor-mukkadam-murder-pakistan-super-tease.jpg", "publishedAt": "2021-08-08T00:35:00Z", "content": "Islamabad, Pakistan (CNN)Few cases of femicide make headlines in Pakistan, but the beheading of an ambassador's daughter promises to test a legal system activists say has repeatedly failed victims of… [+11692 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and Katelyn Polantz", "title": "Interviews with former Justice Department officials provide new details on Trump efforts to undermine election results", "description": "Two top former Justice Department officials provided interviews to the Senate Judiciary Committee and provided detailed accounts of a tumultuous period in late December and early January during which a senior Justice Department lawyer sought to deploy the dep…", "url": "https://www.cnn.com/2021/08/07/politics/jeffrey-clark-richard-donoghue-jeffrey-rosen-justice-department-trump-election-results/index.html", "urlToImage": null, "publishedAt": "2021-08-07T23:16:09Z", "content": "Two top former Justice Department officials provided interviews to the Senate Judiciary Committee and provided detailed accounts of a tumultuous period in late December and early January during which… [+2507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza", "title": "'This is no way to make policy:' Cryptocurrency advocates express frustration with bipartisan infrastructure language", "description": "As the Senate prepares to vote on the final passage of the massive $1.2 trillion bipartisan infrastructure package, members of the cryptocurrency space -- those in favor of using blockchain technology for online transactions -- are ramping up advocacy efforts…", "url": "https://www.cnn.com/2021/08/07/politics/cryptocurrency-infrastructure-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726122316-cryptocurrencies-bitcoin-dogecoin-ethereum---stock-super-tease.jpg", "publishedAt": "2021-08-07T22:23:41Z", "content": "Washington, DC (CNN)As the Senate prepares to vote on the final passage of the massive $1.2 trillion bipartisan infrastructure package, members of the cryptocurrency space -- those in favor of using … [+5481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone", "title": "Guns N' Roses release their first new song in 13 years", "description": "Guns N' Roses fans are finally getting treated to new music after 13 years.", "url": "https://www.cnn.com/2021/08/07/entertainment/guns-n-roses-new-song-trnd/index.html", "urlToImage": null, "publishedAt": "2021-08-07T20:32:10Z", "content": "Guns N Roses fans are finally getting treated to new music after 13 years. \r\nThe legendary rockers released their new song Absurd this week, writing in a tweet early Friday morning, New. Fn. Song. Th… [+956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jay Parini", "title": "What the unruly Frontier Airlines passenger reveals", "description": "For starters: flights can be dangerous and terrifying enough without privileged young bullyboys making a scene and assaulting those charged with keeping order, writes Jay Parini.", "url": "https://www.cnn.com/2021/08/07/opinions/what-unruly-frontier-airlines-passenger-reveals-parini/index.html", "urlToImage": null, "publishedAt": "2021-08-07T19:57:40Z", "content": "Editors Note: Jay Parini, a poet and novelist, teaches at Middlebury College. His most recent book is Borges and Me, a memoir of his travels in the highlands of Scotland with Argentine writer Jorge L… [+5704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose and Veronica Stracqualursi, CNN", "title": "Arizona state lawmaker faces calls for resignation after arrest on child sexual abuse charges", "description": "Arizona's Republican governor and state lawmakers from both parties on Friday called on state Sen. Otoniel \"Tony\" Navarrete to resign, as he faces multiple felony charges in connection with allegedly sexually abusing a child.", "url": "https://www.cnn.com/2021/08/07/politics/arizona-state-senator-charged-resignation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807114544-restricted-otoniel-tony-navarrete-02-20-2018-super-tease.jpg", "publishedAt": "2021-08-07T18:56:03Z", "content": "(CNN)Arizona's Republican governor and state lawmakers from both parties on Friday called on state Sen. Otoniel \"Tony\" Navarrete to resign, as he faces multiple felony charges in connection with alle… [+2839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "New York Times: Trump 2020 campaign refunds millions to donors after using aggressive fundraising tactic", "description": "Former President Donald Trump and the Republican Party have refunded nearly $13 million to donors in the first half of the year, after deploying fundraising tactics in the 2020 election that duped donors into giving more money than they intended or believed t…", "url": "https://www.cnn.com/2021/08/07/politics/trump-refunds-millions-2020-campaign-fundraising/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807131902-donald-trump-pennsylvania-09-22-2020-super-tease.jpg", "publishedAt": "2021-08-07T18:14:04Z", "content": "(CNN)Former President Donald Trump and the Republican Party have refunded nearly $13 million to donors in the first half of the year, after deploying fundraising tactics in the 2020 election that dup… [+2627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "What experts are learning about Lambda, a coronavirus 'variant of interest'", "description": "As the coronavirus pandemic continues, infections caused by the Lambda variant have been emerging in the United States, including in Texas, where Houston Methodist Hospital last month reported its first case.", "url": "https://www.cnn.com/2021/08/07/health/lambda-coronavirus-variant-wellness-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210718020311-01-coronavirus-test-la-0714-super-tease.jpg", "publishedAt": "2021-08-07T18:11:55Z", "content": "(CNN)As the coronavirus pandemic continues, infections caused by the Lambda variant have been emerging in the United States, including in Texas, where Houston Methodist Hospital last month reported i… [+6338 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jane Levere, CNN", "title": "Canada is reopening to US tourists on Monday: Your guide to crossing the border", "description": "On Monday, August 9, Canada will reopens its borders to leisure travel from US tourists. Read CNN Travel's Q&A guide to find out all the essential information before you visit.", "url": "https://www.cnn.com/travel/article/canada-reopening-us-tourists-guide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190917100817-canada-flag-file-super-tease.jpg", "publishedAt": "2021-08-07T17:28:51Z", "content": "(CNN) It has been a long time, neighbor.\r\nThe Canadian government has prohibited Americans from taking nonessential trips there since March 2020 because of the Covid-19 pandemic. But that will change… [+6652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dennis Aftergut and Fred Wertheimer", "title": "How to loosen the hold rich people have on our elections", "description": "Dennis Aftergut and Fred Wertheimer  write about a New Yorker feature entitled \"The Big Money Behind the Big Lie\" which talks about two dangerous threats to American democracy today -- election subversion and dark money.", "url": "https://www.cnn.com/2021/08/07/opinions/rich-people-influence-on-elections-aftergut-wertheimer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150617183812-citizens-united-campaign-reform-super-169.jpg", "publishedAt": "2021-08-07T16:59:56Z", "content": "Dennis Aftergut is a former federal prosecutor and former Supreme Court advocate, currently of counsel at the Renne Public Law Group in San Francisco. Fred Wertheimer is president of Democracy 21, a … [+5393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Fact-checking claim Biden administration is pushing vaccine passport", "description": "Amid confusion over mask mandates, booster shots, and new guidance for those vaccinated, some Republicans have thrown fuel on the fire with false and misleading claims.", "url": "https://www.cnn.com/2021/08/07/politics/biden-vaccine-passport-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726095519-france-covid-pass-law-super-tease.jpg", "publishedAt": "2021-08-07T16:30:17Z", "content": "Washington (CNN)Amid confusion over mask mandates, booster shots, and new guidance for those vaccinated, some Republicans have thrown fuel on the fire with false and misleading claims. \r\nLast week th… [+3001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Gray, CNN meteorologist", "title": "Firefighters on the front lines of the Dixie Fire don't know if their own homes are still standing", "description": "As the Dixie Fire rages out of control in northern California, the largest wildfire currently burning in the US, the heroes on the front lines are fighting the biggest fight of their lives, in their own backyards.", "url": "https://www.cnn.com/2021/08/07/weather/dixie-fire-front-lines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210729142334-02-dixie-wildfire-lassen-national-forest-0726-file-super-tease.jpg", "publishedAt": "2021-08-07T16:00:59Z", "content": "An early version of this story was featured in CNN Weather's weekly column, which is released every Monday afternoon here.\r\n (CNN)As the Dixie Fire rages out of control in northern California, the la… [+6417 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Adrienne Vogt and Amy Woodyatt, CNN", "title": "Jessica Springsteen, Bruce Springsteen's daughter, wins silver medal in equestrian team jumping final", "description": "Talk about \"born to jump.\" Jessica Springsteen, Bruce Springsteen's daughter, helped her squad nab silver in the team jumping final at Equestrian Park at the Tokyo 2020 Olympics on Saturday.", "url": "https://www.cnn.com/2021/08/07/sport/jessica-springsteen-silver-tokyo-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807085956-jessica-springsteen-equestrian-gold-super-tease.jpg", "publishedAt": "2021-08-07T15:03:57Z", "content": "(CNN)Talk about \"born to jump.\" Jessica Springsteen, Bruce Springsteen's daughter, helped her squad nab silver in the team jumping final at Equestrian Park at the Tokyo 2020 Olympics on Saturday.\r\nDa… [+1348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez", "title": "TV OT: Why are my shows filled with mean girls? Plus, UFOs and the best lines from 'Cooking with Paris'", "description": "At some point between catching up on \"Gossip Girl,\" watching the latest episode of \"White Lotus\" and continuing to make my way through the new season of \"Never Have I Ever,\" I had a realization: If I was a teen girl right now, I'd be annoyed.", "url": "https://www.cnn.com/2021/08/07/entertainment/tv-ot-gossip-girl-white-lotus/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:58:07Z", "content": "Editors Note: TV OT is a weekly look at what CNNs entertainment team is watching since too much television has us all working overtime.\r\nIts the end of another week, end of another Olympics and the e… [+6958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop", "title": "What's next for gymnastics great Simone Biles after Tokyo?", "description": "Gymnastics superstar Simone Biles left Tokyo on Wednesday with her fame intact, but changed from the person she had been before the games.", "url": "https://www.cnn.com/2021/08/07/us/simone-biles-future-career/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:50:28Z", "content": "Gymnastics superstar Simone Biles left Tokyo on Wednesday with her fame intact, but changed from the person she had been before the games. \r\nSuffering from the twisties a mental condition in which gy… [+2992 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Val Kilmer documentary reveals deeply personal portrait of a Hollywood star", "description": "Seeing celebrities through their own eyes and stories can be fraught with ... exaggeration. Or, if the star has been particularly introspective, like Val Kilmer, a lot can be learned.", "url": "https://www.cnn.com/2021/08/07/entertainment/val-kilmer-celebs-plc/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:19:47Z", "content": "Seeing celebrities through their own eyes and stories can be fraught with exaggeration. Or, if the star has been particularly introspective, a lot can be learned.\r\nWhich brings me to actor Val Kilmer… [+4871 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Arianna LaPenne", "title": "Opinion: What a community of preppers taught me about survival", "description": "With no shortage of concerning headlines these days, America's preppers -- those who vigilantly prepare for disaster -- seem to be having an \"I told you so\" moment. With her documentary short \"The Bunker Boom: Better Safe Than Sorry,\" director Arianna LaPenne…", "url": "https://www.cnn.com/2021/08/07/opinions/the-bunker-boom-cnn-films-short-arianna-lapenne/index.html", "urlToImage": null, "publishedAt": "2021-08-07T13:00:14Z", "content": "Editors Note: Arianna LaPenne is a documentary filmmaker from New York City who has directed Emmy-nominated, and Peabody and Edward R. Murrow award-winning work in more than 50 countries. Her recent … [+5878 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby and Liz Stark", "title": "FEMA funeral assistance now flowing to families of Covid victims after a bumpy start", "description": "George Harrington applied for the Federal Emergency Management Agency's funeral assistance program soon after it launched in mid-April. He sent in all the documents related to the burial of his father, George III, 80, a veteran and registered nurse who had di…", "url": "https://www.cnn.com/2021/08/07/politics/fema-covid-funeral-assistance/index.html", "urlToImage": null, "publishedAt": "2021-08-07T12:03:51Z", "content": "George Harrington applied for the Federal Emergency Management Agencys funeral assistance program soon after it launched in mid-April. He sent in all the documents related to the burial of his father… [+5671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alyssa Kraus, CNN", "title": "Olympics schedule and events to watch Saturday", "description": "The Olympics are winding down this weekend, and medals will be awarded in baseball, basketball, football and more on Saturday.", "url": "https://www.cnn.com/2021/08/07/entertainment/olympics-schedule-events-today-spt-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806084245-12-olympics-080621-water-polo-super-tease.jpg", "publishedAt": "2021-08-07T11:57:09Z", "content": "(CNN)The Olympics are winding down this weekend, with the closing ceremony on Sunday. However, several events are still in full swing, with medals being awarded in baseball, basketball, football and … [+2473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "A romance writing group gave an award to a book criticized for romanticizing the killing of Native people. Then it took it back", "description": "Barely a year since the Romance Writers of America's course correction after a major scandal over racism and exclusion, controversy erupted when \"At Love's Command\" was given an award.", "url": "https://www.cnn.com/style/article/romance-writers-of-america-vivian-award-controversy-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806123849-book-store-stock-super-tease.jpg", "publishedAt": "2021-08-07T11:08:01Z", "content": "artsPublished 7th August 2021\r\nA new controversy has rocked the Romance Writers of America -- barely a year after a course correction that followed a major scandal over racism and exclusion.\r\nIn the … [+4550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Target will cover 100% of college tuition for its workers", "description": "Target has announced that it will begin paying the college tuition and textbook expenses for its US-based part-time and full-time employees who attend select schools.", "url": "https://www.cnn.com/2021/08/07/business/target-cover-free-college-tuition-employees-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806121631-01-target-store-file-super-tease.jpg", "publishedAt": "2021-08-07T10:03:19Z", "content": "(CNN)Target has announced that it will begin paying the college tuition and textbook expenses for its US-based part-time and full-time employees who attend select schools.\r\nThe retail giant is follow… [+1665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "They got a second chance at love in the middle of the Atlantic Ocean", "description": "American divorcee Jeannette Saqu﻿et met Scottish widower Graham McFarlane on a transatlantic sailing on board Cunard's Queen Mary 2. McFarlane invited Saqu﻿et to visit him in Scotland and their growing friendship deepened into something more.", "url": "https://www.cnn.com/travel/article/couple-who-met-middle-atlantic-ocean/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806123159-back-on-the-queen-mary-2-january-2018-super-tease.jpg", "publishedAt": "2021-08-07T10:01:45Z", "content": "(CNN) When Jeannette Saquet boarded the Queen Mary 2 ocean liner in January 2017, she was 71, and excited for a new adventure.\r\nSaquet had been divorced and single for a number of years. She enjoyed … [+11557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Blaze sweeps through Athens suburbs in fifth day of Greece wildfires", "description": "Flames swept through a residential town outside Athens overnight as wildfires burned across Greece for a fifth day on Saturday, and hundreds of people were evacuated by ferry from the island of Evia east of the capital.", "url": "https://www.cnn.com/2021/08/07/europe/greece-southern-europe-wildfires-heatwave-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210807045201-02-greece-fire-evia-super-tease.jpg", "publishedAt": "2021-08-07T09:43:59Z", "content": "(CNN)Flames swept through a residential town outside Athens overnight as wildfires burned across Greece for a fifth day on Saturday, and hundreds of people were evacuated by ferry from the island of … [+2851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN | Emiko Jozuka, CNN and Blake Essig, CNN and Daishi Kusunoki, CNN", "title": "'Each one has a story': Meet Japan's Olympic pin obsessives", "description": "Buying and trading Olympic pins has become a global phenomenon, but Tokyo 2020 is a Games like no other for Japan's memorabilia collectors.", "url": "https://www.cnn.com/style/article/olympic-pin-collectors-japan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210803222319-04-olympic-pin-trading-tokyo-072315-file-restricted-super-tease.jpg", "publishedAt": "2021-08-07T09:27:01Z", "content": "designPublished 7th August 2021\r\nWhen Shlomi Tsafrir moved to Nagano, Japan, in 1994, he had no idea the Olympic Games were going to change his life. \r\nThree years later, outside Nagano station, he b… [+5704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Bedlam on US airlines and more vaccine and mask mandates: What's new in Covid travel this week", "description": "Check out CNN's latest weekly news update on pandemic travel. There's bedlam on US airlines, wildfires in Greece and Turkey, and Canada and Japan are coming down hard on Covid rule-breakers", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-airline-chaos-vaccine-mask-mandates/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210804120838-spirit-airlines-jet-las-vegas-super-tease.jpg", "publishedAt": "2021-08-07T08:26:19Z", "content": "(CNN) There have been cancellations and chaos on US airlines, Canada and Japan have been cracking down on Covid rule-breakers, but the UK is opening up to more and more vaccinated visitors. \r\nHere's … [+6406 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Yes, children can be affected by Covid-19. Here's why doctors say they need to be protected", "description": "Doctors say keeping kids Covid-free is critical to ensure in-person learning, prevent unforeseen complications and help stave off more aggressive variants.", "url": "https://www.cnn.com/2021/08/07/health/children-covid-19-protection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805162107-01-children-covid-mask-stock-super-tease.jpg", "publishedAt": "2021-08-07T08:02:30Z", "content": "(CNN)The idea that kids don't get hit hard by Covid-19 is losing steam -- in part because of a variant more contagious than any we've seen before.\r\nSince this time last year, more than 45,000 childre… [+9004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Officials split on masking up children in schools as pediatric hospitals fill up with Covid-19 patients", "description": "The polarization surrounding mask mandates is deepening as some state and local officials spar on how to approach face coverings protocols in schools, a debate unfolding as more children contract Covid-19.", "url": "https://www.cnn.com/2021/08/07/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806235406-elementary-school-ga-0804-super-tease.jpg", "publishedAt": "2021-08-07T07:48:29Z", "content": "(CNN)The polarization surrounding mask mandates is deepeningas some state and local officials spar on how to approach face coverings protocols in schools, a debate unfolding as more children contract… [+8892 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "After latest suicide, the Vessel in New York City's Hudson Yards ponders its future", "description": "The Vessel's future as the Instagrammable centerpiece of New York City's newest neighborhood is in limbo after four suicides. Can it be saved?", "url": "https://www.cnn.com/2021/08/07/us/vessel-hudson-yards-suicide-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805120346-05-vessel-hudson-yards-suicide-super-tease.jpg", "publishedAt": "2021-08-07T07:04:06Z", "content": "(CNN)In a December 2016 article for The Architect's Newspaper, journalist Audrey Wachs noted a glaring issue with the Vessel, the 150-foot-tall tourist attraction that was set to open in New York Cit… [+7954 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sheena McKenzie, CNN", "title": "'Trainspotting' turned a spotlight on Scotland's heroin problem. 25 years on, it's Europe's drug death capital", "description": "It's one of the most famous monologues in cinema history. \"Choose life,\" says Ewan McGregor in the 1996 film adaptation of Irvine Welsh's gritty novel about a group of drug addict friends.", "url": "https://www.cnn.com/2021/08/07/europe/trainspotting-scotland-drug-related-deaths-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805153219-scotland-drug-safe-consumption-van-09-25-2020-super-tease.jpg", "publishedAt": "2021-08-07T07:00:05Z", "content": "(CNN)It's one of the most famous monologues in cinematic history: \"Choose life,\" says Ewan McGregor in the 1996 film adaptation of \"Trainspotting,\"Irvine Welsh's gritty novel about a group of drug ad… [+7568 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Eliud Kipchoge: Marathon world record holder has 'the qualities of an ascetic monk'", "description": "When filmmakers were invited to document Eliud Kipchoge's second attempt to run a marathon in under two hours, it was the runner, rather than the run, that captured their imagination.", "url": "https://www.cnn.com/2021/08/07/sport/eliud-kipchoge-tokyo-marathon-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805225152-06-eliud-kipchoge-2017-super-tease.jpg", "publishedAt": "2021-08-07T06:05:45Z", "content": "(CNN)When filmmakers were invited to document Eliud Kipchoge's second attempt to run a marathon in under two hours, it was the runner, rather than the run, that captured their imagination. \r\nAmid the… [+6814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jill Martin, CNN", "title": "Team USA wins gold in men's basketball for the fourth Olympics in a row", "description": "Team USA avenged its early Olympic loss to France by beating the French men's basketball team for the gold medal on Saturday in the Japanese city of Saitama.", "url": "https://www.cnn.com/2021/08/07/sport/team-usa-olympic-gold-intl-hnk-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806235951-02-olympics-080721-basketball-durant-super-tease.jpg", "publishedAt": "2021-08-07T04:58:27Z", "content": "(CNN)Team USA avenged its early Olympic loss to France by beating the French men's basketball team for the gold medal on Saturday in the Japanese city of Saitama.\r\nIt was the 100th medal won by Team … [+798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Jamie Crawford, CNN", "title": "Two men arrested in US over alleged plot to kill Myanmar's UN ambassador", "description": "Two Myanmar citizens have been charged in New York with allegedly plotting to kill or injure Myanmar's ambassador to the United Nations, Kyaw Moe Tun, the US Attorney's Office said Friday.", "url": "https://www.cnn.com/2021/08/07/asia/myanmar-kyaw-moe-tun-plot-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806214010-01-kyaw-moe-tun-2021-super-tease.jpg", "publishedAt": "2021-08-07T04:28:15Z", "content": "(CNN)Two Myanmar citizens have been charged in New York with allegedly plotting to kill or injure Myanmar's ambassador to the United Nations, Kyaw Moe Tun, the US Attorney's Office said Friday. \r\nThe… [+4341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a> and <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, CNN", "title": "The latest on the Tokyo Olympics", "description": "The Tokyo 2020 Summer Olympics are underway after the Games were delayed for almost a year because of the coronavirus pandemic. Follow here for the latest news on the Summer Olympics.", "url": "https://www.cnn.com/world/live-news/tokyo-2020-olympics-08-07-21-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210725235248-60-olympics-072521-olympic-rings-super-tease.jpg", "publishedAt": "2021-08-07T04:00:50Z", "content": "Heat, humidity and tropical systems have been the nemesis of athletes during these Olympic Games, and the closing weekend will bring more of the same.\r\nWhile heat and humidity in Japan in July are co… [+2373 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, CNN", "title": "Homeland Security warns of potential conspiracy theory-fueled violence in August", "description": "The Department of Homeland Security warned state and local authorities Friday about an increase in calls for violence online tied to election-related conspiracy theories, according to a law enforcement source.", "url": "https://www.cnn.com/2021/08/06/politics/homeland-security-warning-political-conspiracy-threat-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210727153745-capitol-riot-file-0106-super-tease.jpg", "publishedAt": "2021-08-07T02:53:30Z", "content": "(CNN)The Department of Homeland Security warned state and local authorities Friday about an increase in calls for violence online tied to election-related conspiracy theories, according to a law enfo… [+2766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores and Christina Maxouris", "title": "Florida Gov. Ron DeSantis' order on masks in schools faces its first legal challenge over constitutionality", "description": "Eight Florida attorneys have filed a lawsuit against Gov. Ron DeSantis over his executive order on masks in schools, said Charles Gallagher, an attorney working on the suit.", "url": "https://www.cnn.com/2021/08/06/us/florida-desantis-executive-order-school-masks-first-legal-challenge-constitutionality/index.html", "urlToImage": null, "publishedAt": "2021-08-07T02:09:00Z", "content": "Eight Florida attorneys have filed a lawsuit against Gov. Ron DeSantis over his executive order on masks in schools, said Charles Gallagher, an attorney working on the suit.\r\nThis is the first legal … [+2245 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, Yong Xiong and David Culver, CNN", "title": "A Trump-era policy that shut out top Chinese students could be hurting America more than Beijing", "description": "US visa bans for some Chinese students could have implications for the quality of American research and inspire talented STEM graduates to take their skills back to China, experts warn.", "url": "https://www.cnn.com/2021/08/06/asia/china-united-states-students-visa-ban-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210805212123-04-china-united-states-students-visa-ban-intl-hnk-super-tease.jpg", "publishedAt": "2021-08-07T01:16:13Z", "content": "Hong Kong (CNN)When Dennis Hu came home to China for the 2020 Lunar New Year, he thought it would be a brief visit. He planned to enjoy the festivities with his family, renew his United States visa, … [+16949 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Mary Anne Fox, CNN", "title": "9/11 families tell Biden to stay away from memorial service if he doesn't authorize release of records related to attacks", "description": "More than 1,600 people affected by the September 11 attacks are asking President Joe Biden to refrain from coming to Ground Zero to mark the 20th anniversary of the event unless he releases documents and information related to the attacks, according to a lett…", "url": "https://www.cnn.com/2021/08/06/politics/joe-biden-9-11-records-memorial-service/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200911154718-03-joe-biden-0911-super-tease.jpg", "publishedAt": "2021-08-07T00:48:23Z", "content": "(CNN)More than 1,600 people affected by the September 11 attacks are asking President Joe Biden to refrain from coming to Ground Zero to mark the 20th anniversary of the event unless he releases docu… [+3017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Fox, CNN", "title": "Ponytails and smiles: Pervasive language keeps sexism in Olympic sport at play", "description": "When Rebecca Smith sat down to watch New Zealand play the United States Women's National Team in a Tokyo 2020 football match last week, she was floored -- and not just because of the athletes' incredible prowess.", "url": "https://www.cnn.com/2021/08/06/sport/olympics-sexism-women-sport-cmd-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806154314-20210806-sports-feature-pagetop-super-tease.jpg", "publishedAt": "2021-08-07T00:32:40Z", "content": "(CNN)When Rebecca Smith sat down to watch New Zealand play the United States Women's National Team in a Tokyo 2020 football match last week, she was floored -- and not just because of the athletes' i… [+11728 chars]"}]}