{"status": "ok", "totalResults": 102, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Meta removes Facebook accounts to tackle misinformation ahead of Philippine election", "description": "Meta Platforms Inc on Wednesday suspended a network of over 400 accounts, pages and groups ahead of general elections in the Philippines as the Facebook parent moves to crack down on hate speech and misinformation.", "url": "https://www.cnn.com/2022/04/08/business/meta-facebook-philippines-election-misinformation-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407223710-facebook-meta-phone-stock-super-tease.jpg", "publishedAt": "2022-04-08T06:18:32Z", "content": "Meta Platforms Inc on Wednesday suspended a network of over 400 accounts, pages and groups ahead of general elections in the Philippines as the Facebook parent moves to crack down on hate speech and … [+841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Costa Rica airport reopens after plane skids off runway, splits in two", "description": "Costa Rica's Juan Santamaria International Airport reopened on Thursday hours after a Boeing 757-200 cargo aircraft operated by DHL made an emergency landing and skidded off the runway, separating its tail, aviation authorities said.", "url": "https://www.cnn.com/travel/article/costa-rica-airport-dhl-emergency-landing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220408013159-costa-rica-dhl-emergency-landing-040722-super-tease.jpg", "publishedAt": "2022-04-08T06:10:58Z", "content": "(Reuters) Costa Rica's Juan Santamaria International Airport reopened on Thursday hours after a Boeing 757-200 cargo aircraft operated by DHL made an emergency landing and skidded off the runway, sep… [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "'More beautiful than Europe': Indians flock to Kashmir's lakes, boats", "description": "Indian-administered Kashmir is attracting record tourists after the easing of pandemic restrictions and some improvement in the security situation, bolstering local businesses.", "url": "https://www.cnn.com/travel/article/india-kashmir-tourism-boost-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407230731-india-kashmir-tourism-boost-super-tease.jpg", "publishedAt": "2022-04-08T05:23:21Z", "content": "Srinagar, India (Reuters) Indian-administered Kashmir is attracting record tourists after the easing of pandemic restrictions and some improvement in the security situation, bolstering local business… [+3264 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "US prosecutors say alleged yakuza boss planned to sell missiles to Myanmar rebels", "description": "US authorities have arrested a leader of a Japanese crime syndicate on charges of plotting to distribute drugs in the United States and purchase weapons including US-made surface-to-air missiles, prosecutors said on Thursday.", "url": "https://www.cnn.com/2022/04/08/asia/yakuza-us-missiles-drugs-japan-myanmar-rebels-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407234403-01-takeshi-ebisawa.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-08T04:46:09Z", "content": "US authorities have arrested the alleged leader of a Japanese crime syndicate on charges of plotting to distribute drugs in the United States and purchase weapons including US-made surface-to-air mis… [+1193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee", "title": "Emmanuel Macron has a grand vision for the West. Putin has exposed the limits of his influence", "description": "On February 20, Emmanuel Macron held a phone call with Vladimir Putin. Shortly after it ended, the French President announced he would broker a summit between his Russian counterpart and US President Joe Biden, on the condition that Russia did not invade its …", "url": "https://www.cnn.com/2022/04/08/europe/macron-putin-french-election-analysis-intl-cmd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220209095252-04-putin-macron-crude-table-autocrat-language-ghitis.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-08T04:23:20Z", "content": "On February 20, Emmanuel Macron held a phone call with Vladimir Putin. Shortly after it ended, the French President announced he would broker a summit between his Russian counterpart and US President… [+11375 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "(view.newsletters.cnn.com)", "url": "https://view.newsletters.cnn.com/messages/16493902979524cf6f6370a64/raw", "urlToImage": null, "publishedAt": "2022-04-08T04:10:03Z", "content": "Twitter has been all over the news this week. The social platform takes up an inordinate amount of space in many journalists' brains. New York Times executive editor Dean Baquet wants to change that.… [+3110 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and Seán Federico O'Murchú, CNN", "title": "Russia invades Ukraine", "description": "UN member states voted Thursday to suspend Russia from the Human Rights Council after allegations of atrocities committed by Russian soldiers during the war in Ukraine. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-04-08-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407152037-mariupol-file-040322-super-tease.jpg", "publishedAt": "2022-04-08T04:07:52Z", "content": "CNN has geolocated a recent video that appears to show the execution of a Russian prisoner by Ukrainian forces following recent fighting in the Kyiv region.\r\nThe video first verified by the New York … [+1262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Democratic senators at CNN Citizen event say they're optimistic climate bill can pass this year", "description": "Democratic Sens. Martin Heinrich and Ed Markey on Thursday said they're optimistic that members of their party can still come together in the Senate to strike a deal on a climate and economic tax package this year.", "url": "https://www.cnn.com/2022/04/07/politics/climate-bill-democrats-optimism-cnn-citizen-event/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407223708-martin-heinrich-ed-markey-split-restricted-super-tease.jpg", "publishedAt": "2022-04-08T03:00:12Z", "content": "(CNN)Democratic Sens. Martin Heinrich and Ed Markey on Thursday said they're optimistic that members of their party can still come together in the Senate to strike a deal on a climate and economic ta… [+2018 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Bergen", "title": "Opinion: Why sanctions won't deter Putin", "description": "The Biden administration new set of sanctions on Russian President Vladimir Putin give the world the illusion that action is being taken against his invasion of Ukraine. But history suggests these don't tend to work as effectively, says Peter Bergen.", "url": "https://www.cnn.com/2022/04/07/opinions/us-sanctions-russia-putin-bergen/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407150010-putin-nye-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-08T02:33:13Z", "content": "Editors Note: Peter Bergen is CNNs national security analyst, a vice president at New America and a professor of practice at Arizona State University. His forthcoming paperback is The Cost of Chaos: … [+6292 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Why Russia might struggle to maintain its digital iron curtain", "description": "On March 14, the same day Russia banned Instagram, Russian tech entrepreneur Alexander Zobov announced he would soon launch a local version of the popular photo and video sharing app called Rossgram.", "url": "https://www.cnn.com/2022/04/07/tech/russia-digital-iron-curtain-rossgram-challenges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406164411-restricted-russia-social-media-internet-file-super-tease.jpg", "publishedAt": "2022-04-08T02:17:29Z", "content": "(CNN Business)On March 14, the same dayRussia banned Instagram, Russian tech entrepreneur Alexander Zobov announced he would soon launch a local version of the popular photo and video sharing app cal… [+9966 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "A week of history and rabid partisanship encapsulates an extreme Washington age", "description": "Ketanji Brown Jackson's shattering of a racial glass ceiling, in a week also marked by the naked ambition of the Republicans who smeared her, the delusional demagoguery of an ex-President and a touch of the bizarre, reflected an historic and extreme Washingto…", "url": "https://www.cnn.com/2022/04/07/politics/washington-week-history-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407141302-01-kbj-biden-vote-0407-super-tease.jpg", "publishedAt": "2022-04-08T02:08:29Z", "content": "(CNN)Ketanji Brown Jackson's shattering of a racial glass ceiling, in a week also marked by the naked ambition of the Republicans who smeared her, the delusional demagoguery of an ex-President and a … [+8400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Anita Hill calls Ketanji Brown Jackson confirmation an 'important cultural moment'", "description": "Brandeis University professor Anita Hill said Thursday that Ketanji Brown Jackson's confirmation to the US Supreme Court marked an \"important cultural moment\" for the court and the country.", "url": "https://www.cnn.com/2022/04/07/politics/anita-hill-ketanji-brown-jackson-supreme-court-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407172355-anita-hill-2021-super-tease.jpg", "publishedAt": "2022-04-08T02:07:05Z", "content": "Washington (CNN)Brandeis University professor Anita Hill said Thursday that Ketanji Brown Jackson's confirmation to the US Supreme Court marked an \"important cultural moment\" for the court and the co… [+2134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Medicare limits coverage of controversial Alzheimer's drug to those in clinical trials", "description": "Medicare will restrict coverage of the controversial and costly Alzheimer's drug Aduhelm to those enrolled in qualifying clinical trials, the Centers for Medicare and Medicaid Services announced Thursday.", "url": "https://www.cnn.com/2022/04/07/politics/alzheimers-drug-aduhelm-medicare-clinical-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220111162207-aduhelm-drug-file-super-tease.jpg", "publishedAt": "2022-04-08T01:14:55Z", "content": "(CNN)Medicare will restrict coverage of the controversial and costly Alzheimer's drug Aduhelm to those enrolled in qualifying clinical trials, the Centers for Medicare and Medicaid Services announced… [+5868 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "Russia's war is exposing the UN's imperfections", "description": "Frida Ghitis writes that while the UN General Assembly's vote to suspend Russia from the UN Human Rights Council was the right move, the fact that Russia had a seat on the UNHRC at a time when it is committing what many world leaders have deemed to be war cri…", "url": "https://www.cnn.com/2022/04/07/opinions/russia-ukraine-united-nations-flaws-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407141155-mariupol-destruction-super-tease.jpg", "publishedAt": "2022-04-08T00:16:28Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washington Post and a c… [+7407 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Serena Williams appears to announce she plans to play at Wimbledon", "description": "Serena Williams appeared to have announced she's returning to compete at Wimbledon this year.", "url": "https://www.cnn.com/2022/04/07/sport/serena-williams-wimbledon/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407192547-01-serena-williams-wimbledon-practice-2021-super-tease.jpg", "publishedAt": "2022-04-08T00:12:10Z", "content": "(CNN)Serena Williams appeared to have announced she's returning to compete at Wimbledon this year.\r\nThe 23-time grand slam champion strongly suggested in an Instagram story video with Green Bay Packe… [+1360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Appeals court revives Biden vaccine mandate for federal employees", "description": "The 5th US Circuit Court of Appeals on Thursday revived President Joe Biden's vaccine mandate for federal executive branch employees, lifting a district court's January injunction that had halted the requirement and ordering the lower court to dismiss the cas…", "url": "https://www.cnn.com/2022/04/07/politics/biden-vaccine-mandate-federal-employees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407193640-02-federal-covid-vaccine-mandate-super-tease.jpg", "publishedAt": "2022-04-08T00:06:23Z", "content": "(CNN)The 5th US Circuit Court of Appeals on Thursday revived President Joe Biden's vaccine mandate for federal executive branch employees, lifting a district court's January injunction that had halte… [+111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, CNN", "title": "Congress skips town without passing Covid relief", "description": "Congress punted once again on a massive Covid-19 relief package, leaving President Joe Biden's administration in limbo on one of its top requests from Congress this spring.", "url": "https://www.cnn.com/2022/04/07/politics/congress-covid-relief-recess/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191113111541-us-capitol-impeachment-hearing-1113-super-tease.jpg", "publishedAt": "2022-04-08T00:06:17Z", "content": "(CNN)Congress punted once again on a massive Covid-19 relief package, leaving President Joe Biden's administration in limbo on one of its top requests from Congress this spring.\r\nLawmakers departed W… [+4143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Valencia and Jade Gordon, CNN", "title": "Louisiana prosecutor gets green light from feds to pursue charges in death of Ronald Greene, says he'll move 'swiftly'", "description": "The local Louisiana district attorney with jurisdiction over the town where Ronald Greene died following an interaction with state troopers told state lawmakers Thursday that he plans to convene a special grand jury and pursue criminal charges against the tro…", "url": "https://www.cnn.com/2022/04/07/us/ronald-greene-grand-jury/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201002191528-02-ronald-greene-super-tease.jpg", "publishedAt": "2022-04-07T23:46:31Z", "content": "Baton Rouge, Louisiana (CNN)The local Louisiana district attorney with jurisdiction over the town where Ronald Greene died following an interaction with state troopers told state lawmakers Thursday t… [+3581 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Two coaches join Brian Flores' racial discrimination lawsuit against NFL", "description": "Former Arizona Cardinals head coach Steve Wilks and longtime NFL assistant Ray Horton have joined Brian Flores' racial discrimination lawsuit against the NFL and several teams, according to an amended complaint filed Thursday.", "url": "https://www.cnn.com/2022/04/07/sport/brian-flores-lawsuit-steve-wilks-ray-horton-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407175728-brian-flores-lawsuit-steve-wilks-ray-horton-spt-super-tease.jpg", "publishedAt": "2022-04-07T23:22:28Z", "content": "(CNN)Former Arizona Cardinals head coach Steve Wilks and longtime NFL assistant Ray Horton have joined Brian Flores' racial discrimination lawsuit against the NFL and several teams, according to an a… [+7800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Covid cases among Washington power brokers put new focus on White House's protocols for Biden", "description": "As President Joe Biden sat at a signing desk in a crowded room at the White House on Wednesday, he was flanked by lawmakers who stood shoulder to shoulder to celebrate a rare bipartisan win: a new law that will modernize the US Postal Service.", "url": "https://www.cnn.com/2022/04/07/politics/biden-white-house-covid-protocols/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407111152-pelosi-biden-0406-super-tease.jpg", "publishedAt": "2022-04-07T23:19:12Z", "content": "(CNN)As President Joe Biden sat at a signing desk in a crowded room at the White House on Wednesday, he was flanked by lawmakers who stood shoulder to shoulder to celebrate a rare bipartisan win: a n… [+5459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz and Holmes Lybrand, CNN", "title": "Cache of weapons seized from apartments of 2 men accused of impersonating DHS agents", "description": "Investigators said Thursday that they had seized a cache of weapons during a search of multiple Washington, DC, apartments belonging to two men accused of impersonating Department of Homeland Security agents for more than two years.", "url": "https://www.cnn.com/2022/04/07/politics/federal-officer-impersonation-case-weapons-seized/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407164924-arian-taherzadeh-haider-ali-affidavit-super-tease.jpg", "publishedAt": "2022-04-07T22:39:51Z", "content": "(CNN)Investigators said Thursday that they had seized a cache of weapons during a search of multiple Washington, DC, apartments belonging to two men accused of impersonating Department of Homeland Se… [+2014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "One tragic Ukraine story told with drones, satellites and social media", "description": "Tragic individual stories of 21st century war in Ukraine are coming into focus in 21st century ways, including through drone video and social media posts.", "url": "https://www.cnn.com/2022/04/07/politics/russia-ukraine-digital-technology-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220401074815-01-ukraine-gallery-update-040122.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T22:36:54Z", "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nTragic individual stories of 21st century war in Ukraine are coming into focus in 21… [+5801 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Mitch McConnell's answer on Trump 2024 makes zero sense", "description": "On February 13, 2021, Mitch McConnell said this on the floor of the Senate about Donald Trump's actions on January 6: \"Former President Trump's actions preceding the riot were a disgraceful dereliction of duty.\"", "url": "https://www.cnn.com/2022/04/07/politics/mcconnell-trump-2024-comments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190214165421-trump-mcconnell-national-emergency-04-super-tease.jpg", "publishedAt": "2022-04-07T22:34:55Z", "content": "(CNN)On February 13, 2021, Mitch McConnell said this on the floor of the Senate about Donald Trump's actions on January 6: \"Former President Trump's actions preceding the riot were a disgraceful dere… [+2082 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Tal", "title": "Two killed, many injured in Tel Aviv shooting", "description": "A shooting in Tel Aviv killed two people and wounded many others late Thursday, Israeli officials said.", "url": "https://www.cnn.com/2022/04/07/middleeast/tel-aviv-shooting-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407160456-01-tel-aviv-shooting-0407.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T22:18:04Z", "content": "A shooting in Tel Aviv killed two people and wounded many others late Thursday, Israeli officials said.\r\nA manhunt is currently underway to find the suspected shooter, Tel Aviv police commander Ami E… [+1980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Michelle Obama: Ketanji Brown Jackson gives Black women and girls 'a new dream to dream'", "description": "Former first lady Michelle Obama praised Ketanji Brown Jackson on Thursday, thanking the judge, newly confirmed to the US Supreme Court, for giving Black women and girls \"a new dream to dream, a new path to forge, and a future we can all be hopeful for.\"", "url": "https://www.cnn.com/2022/04/07/politics/michelle-obama-ketanji-brown-jackson-supreme-court-confirmation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407170509-kbj-michelle-obama-split-super-tease.jpg", "publishedAt": "2022-04-07T22:04:43Z", "content": "Washington (CNN)Former first lady Michelle Obama praised Ketanji Brown Jackson on Thursday, thanking the judge, newly confirmed to the US Supreme Court, for giving Black women and girls \"a new dream … [+1266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: How Elon Musk could change the course of the 2024 election", "description": "Twitter and former President Donald Trump are together in the news again.", "url": "https://www.cnn.com/2022/04/07/opinions/elon-musk-twitter-donald-trump-2024-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406141417-02-elon-musk-0210-super-tease.jpg", "publishedAt": "2022-04-07T21:54:10Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the forthcoming book \"The Presidency of Donald J. Trump: A First Historical… [+4436 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Meg Dunn, CNN", "title": "Free healthy grocery deliveries kept her community fed through the pandemic, but this chef's battle against food insecurity is far from over", "description": "Kim Calichio and her non-profit, The Connected Chef, are delivering free groceries to 550 households weekly across Queens, New York.", "url": "https://www.cnn.com/2022/04/07/us/covid-new-york-healthy-food-delivery-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407112958-cnnheroes-kim-calichio-portrait-super-tease.jpeg", "publishedAt": "2022-04-07T21:04:30Z", "content": "Know someone who inspires you? Click here to nominate them as a CNN Hero.\r\nNew York (CNN)When the Covid-19 pandemic hit, Kim Calichio and her husband, like many people, saw their lives change overnig… [+5352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Gregory Wallace, CNN", "title": "Storms are causing major flight delays on the East Coast", "description": "Thunderstorms and low clouds over the East Coast are complicating air travel. By 4:15 p.m. Thursday, more than 4,500 flights had been delayed, including more than 700 on Southwest.", "url": "https://www.cnn.com/travel/article/flight-delays-storms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407162824-plane-miami-sky-super-tease.jpg", "publishedAt": "2022-04-07T20:47:15Z", "content": "Top image: An American Airlines Boeing 787-9 Dreamliner approaches Miami International Airport in December 2021. (Photo by Joe Raedle/Getty Images)CNN's Andy Rose contributed to this report."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh, Oleksandra Ochman, Gianluca Mezzofiore, Katie Polglase, Teele Rebane and Anastasia Graham-Yooll, CNN", "title": "Russia or die: After weeks under Putin's bombs, these Ukrainians were given only one way out", "description": "When Russian forces and allied separatist soldiers arrived offering a path to safety, it felt like a sick twist of fate.", "url": "https://www.cnn.com/2022/04/07/europe/ukraine-mariupol-russia-deportation-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407132502-05-ukraine-mariupol-russia-deportation-super-tease.jpg", "publishedAt": "2022-04-07T20:43:10Z", "content": "By Eliza Mackintosh, Oleksandra Ochman, Gianluca Mezzofiore, Katie Polglase, Teele Rebane and Anastasia Graham-Yooll, CNN\r\nUpdated 4:43 PM ET, Thu April 7, 2022\r\nLviv, Ukraine When Russian forces and… [+19945 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Clea Shearer of The Home Edit has breast cancer", "description": "Clea Shearer, an expert organizer and one of the stars of Netflix's \"Get Organized with The Home Edit,\" has an aggressive form of breast cancer, she announced Thursday.", "url": "https://www.cnn.com/2022/04/07/entertainment/clea-shearer-the-home-edit-breast-cancer-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407160114-clea-shearer-file-032722-super-tease.jpg", "publishedAt": "2022-04-07T20:28:04Z", "content": "(CNN)Clea Shearer, an expert organizer and one of the stars of Netflix's \"Get Organized with The Home Edit,\" has an aggressive form of breast cancer, she announced Thursday.\r\nShearer broke the news o… [+1311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "Camila Cabello reveals her struggle with 'crippling' anxiety and her efforts to heal", "description": "Singer and actress Camila Cabello is opening up about the \"crippling\" anxiety she felt while making her new album, \"Familia.\"", "url": "https://www.cnn.com/2022/04/07/entertainment/camila-cabello-crippling-anxiety-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407155517-camila-cabello-march-2022-super-tease.jpg", "publishedAt": "2022-04-07T20:24:12Z", "content": "(CNN)Singer and actress Camila Cabello is opening up about the \"crippling\" anxiety she felt while making her new album, \"Familia.\"\r\nIn an interview with People, Cabello described it as \"the worst men… [+1145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "US consumer credit jumped by more than $40 billion in February", "description": "Americans got into a lot more debt in February as rampant inflation kept up the pressure, the Federal Reserve's consumer credit report showed Thursday.", "url": "https://www.cnn.com/2022/04/07/economy/federal-reserve-consumer-debt-february/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407152254-us-consumer-debt-february-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T20:23:02Z", "content": "Americans got into a lot more debt in February as rampant inflation kept up the pressure, the Federal Reserves consumer credit report showed Thursday.\r\nDebt levels jumped by nearly $42 billion to a t… [+1178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Virginia Langmaid, CNN", "title": "Police chief who took over Colorado department during fallout over Elijah McClain's death is fired", "description": "The chief of the embattled Aurora, Colorado, police department -- who took over during the fallout over death of Elijah McClain -- was fired Wednesday amid concerns that the city's manager said were about management and leadership.", "url": "https://www.cnn.com/2022/04/07/us/aurora-colorado-police-chief-fired/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406185228-01-aurora-colorado-police-chief-vanessa-wilson-super-tease.jpg", "publishedAt": "2022-04-07T20:19:25Z", "content": "(CNN)The chief of the embattled Aurora, Colorado, police department -- who took over during the fallout over death of Elijah McClain -- was fired Wednesday amid concerns that the city's manager said … [+9291 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The investigations into Donald Trump aren't going away", "description": "Thursday provided an important reminder that Donald Trump's legal problems are far from over.", "url": "https://www.cnn.com/2022/04/07/politics/trump-investigations-ny-jan-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220325144908-trump-orlando-0226-super-tease.jpg", "publishedAt": "2022-04-07T20:15:25Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney", "title": "Home affordability gets worse as prices and mortgage rates rise", "description": "As both home prices and mortgage rates rise, buying a home is increasingly unaffordable for a growing number of Americans.", "url": "https://www.cnn.com/2022/04/07/homes/us-home-affordability-gets-worse/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407083538-us-home-affordability.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T19:13:55Z", "content": "As both home prices and mortgage rates rise, buying a home is increasingly unaffordable for a growing number of Americans.\r\nHome prices in the first quarter were up by at least 10% from a year ago in… [+2569 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Opinion: This is bigger than Disney vs. DeSantis", "description": "Nicole Hemmer writes that we are witnessing the emergence of a full-on right-wing children's entertainment complex. Its sole mission: to fight what the right sees as liberal indoctrination with some indoctrination of its own.", "url": "https://www.cnn.com/2022/04/07/opinions/children-literature-disney-desantis-tuttle-twins-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331135857-01-desantis-parental-rights-in-education-0328-super-tease.jpg", "publishedAt": "2022-04-07T18:49:37Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+7400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Investigation into Trump Org. is ongoing despite resignations of top prosecutors, NY district attorney says", "description": "The Manhattan district attorney said Thursday the criminal investigation into former President Donald Trump and his company is continuing with prosecutors reviewing new evidence, dismissing speculation that the case was closed following the high-profile depar…", "url": "https://www.cnn.com/2022/04/07/politics/alvin-bragg-trump-investigation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220224172007-trump-alvin-bragg-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T18:29:53Z", "content": "The Manhattan district attorney said Thursday the criminal investigation into former President Donald Trump and his company is continuing with prosecutors reviewing new evidence, dismissing speculati… [+3798 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine Thorbecke", "title": "More than 8 million Cash App Investing customers potentially impacted by data breach linked to former employee", "description": "More than 8 million Cash App Investing customers may have had personal data compromised after a former employee downloaded internal reports without permission, parent company Block Inc revealed in a regulatory filing earlier this week.", "url": "https://www.cnn.com/2022/04/07/tech/cash-app-investing-breach/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220225101428-cash-app-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T18:24:49Z", "content": "More than 8 million Cash App Investing customers may have had personal data compromised after a former employee downloaded internal reports without permission, parent company Block Inc revealed in a … [+1733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Texas leads among 26 states with book bans, free speech group says", "description": "More than a 1,000 books have been banned in 86 school districts in 26 states across the United States, a new PEN America analysis shows.", "url": "https://www.cnn.com/2022/04/07/us/book-bans-pen-america-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407113409-texas-high-school-library-file-restricted-100118-super-tease.jpg", "publishedAt": "2022-04-07T17:38:33Z", "content": "(CNN)More than a 1,000 books have been banned in 86 school districts in 26 states across the United States, a new PEN America analysis shows.\r\nPEN America, a literary and free expression advocacy org… [+4104 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "New York AG asks court to hold Donald Trump in contempt", "description": "New York Attorney General Letitia James asked a New York court on Thursday to hold former President Donald Trump in civil contempt for allegedly failing to comply with a court order that he turn over certain documents for her investigation.", "url": "https://www.cnn.com/2022/04/07/politics/james-trump-contempt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220405114718-02-trump-0226.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T17:32:08Z", "content": "New York Attorney General Letitia James asked a New York court on Thursday to hold former President Donald Trump in civil contempt for allegedly failing to comply with a court order that he turn over… [+85 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "US likely to see a surge of Covid-19 in the fall, Fauci says", "description": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said on Wednesday that he thinks there will be an uptick in cases of Covid-19 over the next few weeks, and that it is likely that there could be a surge in the fall.", "url": "https://www.cnn.com/2022/04/07/health/fauci-covid-fall-surge/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407112831-covid-19-testing-033122-super-tease.jpg", "publishedAt": "2022-04-07T17:04:25Z", "content": "(CNN)Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said on Wednesday that he thinks there will be an uptick in cases of Covid-19 over the next few weeks, a… [+1849 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Abby Baggini, CNN", "title": "Artwork worth $46 million heading back to Russia seized by Finnish Customs", "description": "Artwork worth $46 million has been seized by Finnish Customs on its return to Russia, according to a statement from the government agency Wednesday.", "url": "https://www.cnn.com/style/article/finland-russia-seize-artwork-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407123909-finland-russia-seize-artwork-intl-scli-super-tease.jpg", "publishedAt": "2022-04-07T17:03:45Z", "content": "arts\r\nArtwork worth $46 million has been seized by Finnish Customs on its return to Russia, according to a statement from the government agency Wednesday.\r\nCustoms said that, due to European Union sa… [+2557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Russia has changed course. What is Putin's plan for eastern Ukraine?", "description": "As Russia's war in Ukraine enters a pivotal new phase, fighting is intensifying in the east of the country and officials have warned of a battle that \"will remind you of the Second World War.\" Here's what to know about what may come next.", "url": "https://www.cnn.com/2022/04/07/europe/russia-eastern-ukraine-strategy-explainer-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220402171839-russia-shifting-focus-super-tease.jpg", "publishedAt": "2022-04-07T16:42:59Z", "content": "(CNN)As Russia's war in Ukraine enters a pivotal new phase, fighting is intensifying in the east of the country and officials have warned of a battle that \"will remind you of the Second World War.\"\r\n… [+10700 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sophia Saifi,Rhea Mogul,CNN,journalist Azaz Syed", "title": "Pakistan's top court rules that blocking a no-confidence vote against Imran Khan was unconstitutional", "description": "Pakistan's Supreme Court has ruled that a decision to block a vote of no-confidence against Prime Minister Imran Khan was unconstitutional.", "url": "https://www.cnn.com/2022/04/07/asia/pakistan-imran-khan-constitution-vote-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220404003225-imran-khan-file-06042021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T16:05:25Z", "content": "Pakistans Supreme Court has ruled that a decision to block a vote of no-confidence against Prime Minister Imran Khan was unconstitutional.\r\nThe Supreme Court reached the decision after special procee… [+1138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn", "title": "This Walmart job starts at $95,000 a year", "description": "Walmart is raising pay for long-haul truck drivers, a taxing job that is increasingly difficult for companies to fill.", "url": "https://www.cnn.com/2022/04/07/business/walmart-truck-driver-pay/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407103159-walmart-truck-1114-file-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T16:01:50Z", "content": "Walmart is raising pay for long-haul truck drivers, a taxing job that is increasingly difficult for companies to fill.\r\nWalmart\r\n(WMT), one of the few retail chains that runs its own trucking fleet, … [+1328 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinon by Michael D'Antonio", "title": "Opinion: Ivanka, Jared go their own way on Jan. 6", "description": "Ivanka Trump's recent eight-hour testimony before the House select committee investigating the January 6, 2021, Capitol attack by her father's followers was perfectly \"on brand,\" as marketers say, for her personal image. Depending on what she said, it may als…", "url": "https://www.cnn.com/2022/04/07/opinions/ivanka-trump-jared-kushner-january-6-strategy-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115071514-file-01-jared-kushner-ivanka-trump-2020-super-tease.jpg", "publishedAt": "2022-04-07T15:52:46Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+5594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "'The Ultimatum' hosts Nick and Vanessa Lachey talk bumps in their relationship", "description": "Nick Lachey and Vanessa Lachey had a bit of a bumpy road before heading down the aisle together.", "url": "https://www.cnn.com/2022/04/07/entertainment/ultimatum-nick-lachey-vanessa-lachey-netflix/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220404120748-the-ultimatum-netflix-super-tease.jpg", "publishedAt": "2022-04-07T15:50:59Z", "content": "(CNN)Nick Lachey and Vanessa Lachey had a bit of a bumpy road before heading down the aisle together.\r\nThe couple, who host \"Love Is Blind\" spinoff \"The Ultimatum: Marry or Move On,\" which debuted We… [+1280 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer and Clare Foran, CNN", "title": "Nancy Pelosi tests positive for Covid-19, spokesman says", "description": "House Speaker Nancy Pelosi has tested positive for Covid-19, a spokesman for the California Democrat said Thursday.", "url": "https://www.cnn.com/2022/04/07/politics/nancy-pelosi-has-covid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407111153-nancy-pelosi-0311-super-tease.jpg", "publishedAt": "2022-04-07T15:18:11Z", "content": "(CNN)House Speaker Nancy Pelosi has tested positive for Covid-19, a spokesman for the California Democrat said Thursday.\r\n\"After testing negative this week, Speaker Pelosi received a positive test re… [+1141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "Jobless claims match 1968 low", "description": "America's labor market is on fire. There are far more available jobs than workers and the latest data on initial weekly unemployment claims underscores that imbalance.", "url": "https://www.cnn.com/2022/04/07/economy/unemployment-benefits-coronavirus/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407100631-us-career-fair-file-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T15:17:13Z", "content": "Americas labor market is on fire. There are far more available jobs than workers and the latest data on initial weekly unemployment claims underscores that imbalance.\r\nInitial claims for jobless bene… [+1900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Security guards in Qatar exposed to conditions 'amounting to forced labour,' says Amnesty report", "description": "With months to go until the 2022 World Cup in Qatar and less than a week since the draw took place, the country's treatment of migrant workers remains under scrutiny.", "url": "https://www.cnn.com/2022/04/07/football/qatar-world-cup-2022-amnesty-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407094312-qatar-stadium-person-file-040122-super-tease.jpg", "publishedAt": "2022-04-07T15:04:06Z", "content": "(CNN)With months to go until the 2022 World Cup in Qatar and less than a week since the draw took place, the country's treatment of migrant workers remains under scrutiny. \r\nAccording to a report rel… [+4587 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Melissa Macaya, CNN", "title": "Ketanji Brown Jackson's Senate confirmation vote", "description": "The Senate is expected to vote today to confirm Judge Ketanji Brown Jackson as the first Black woman Supreme Court justice. Watch live and follow the latest news updates and analysis here.", "url": "https://www.cnn.com/politics/live-news/ketanji-brown-jackson-senate-confirmation-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220321153541-28-ketanji-brown-jackson-swearing-in-0321-super-tease.jpg", "publishedAt": "2022-04-07T15:04:04Z", "content": "The Senate is set to hold a key vote Thursday to advance President Joe Biden's Supreme Court nominee, Ketanji Brown Jackson, toward a final confirmation vote.\r\nThursday's procedural vote to limit deb… [+880 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Roth and Kate Sullivan, CNN", "title": "UN set to vote on suspending Russia from Human Rights Council", "description": "The United Nations General Assembly is expected to vote Thursday on whether to suspend Russia from the Human Rights Council.", "url": "https://www.cnn.com/2022/04/07/politics/un-russia-human-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406113517-zelensky-un-file-040522-super-tease.jpg", "publishedAt": "2022-04-07T15:03:42Z", "content": "(CNN)The United Nations General Assembly is expected to vote Thursday on whether to suspend Russia from the Human Rights Council.\r\nA draft of the resolution seen by CNN says the General Assembly may … [+1658 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez", "title": "This incredibly potent planet-warming gas just set another record for the second year in a row", "description": "Atmospheric methane is a huge contributor to the climate crisis, and scientists have said reining in these emissions could lead to a swift decrease in the planet's warming trend.", "url": "https://www.cnn.com/2022/04/07/us/methane-record-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407092557-oil-pumpjack-permian-basin-0313-super-tease.jpg", "publishedAt": "2022-04-07T15:00:08Z", "content": "(CNN)A potent planet-warming gas set a record for the second year in a row, scientists reported Thursday, just as the UN's panel on climate change warned the world is running out of time to rein in f… [+4600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, CNN", "title": "Congress poised to pass two bills targeting Russia", "description": "Congress is poised to pass two bipartisan bills in response to the Russian invasion of Ukraine on Thursday, the latest move for lawmakers before they're set to begin a two-week recess on Friday.", "url": "https://www.cnn.com/2022/04/07/politics/congress-russia-ukraine-bipartisan-putin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220405234429-putin-super-tease.jpg", "publishedAt": "2022-04-07T14:23:44Z", "content": "(CNN)Congress is poised to pass two bipartisan bills in response to the Russian invasion of Ukraine on Thursday, the latest move for lawmakers before they're set to begin a two-week recess on Friday.… [+1483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "The Boston Marathon bans runners from Russia and Belarus 2 weeks before the race", "description": "Despite qualifying, runners living in Russia or Belarus are banned from participating in this year's Boston Marathon and Boston Athletic Association 5K, according to organizers.", "url": "https://www.cnn.com/2022/04/07/us/boston-marathon-ban-russia-belarus-runners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407090026-boston-marathon-2021-restricted-super-tease.jpg", "publishedAt": "2022-04-07T14:21:08Z", "content": "(CNN)Despite qualifying, runners living in Russia or Belarus are banned from participating in this year's Boston Marathon and Boston Athletic Association 5K, according to organizers. \r\nThe ban affect… [+736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See Florida teens get up close and personal with a great white shark", "description": "Two Florida teen divers ran into two great white sharks in the span of 48 hours. One of the teens was even able to touch the predator.", "url": "https://www.cnn.com/videos/travel/2022/04/07/teen-diver-touch-great-white-shark-florida-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407100805-teen-diver-2-super-tease.jpeg", "publishedAt": "2022-04-07T14:13:43Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney", "title": "Mortgage rates rise, inching closer to 5%", "description": "Mortgage rates rose again this week, inching closer to 5%. The 30-year fixed-rate mortgage averaged 4.72% in the week ending April 7, up from 4.67% the week before, according to Freddie Mac. That's the highest since December 2018.", "url": "https://www.cnn.com/2022/04/07/homes/us-mortgage-rates-april-7/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407083747-us-home-mortgages-rates-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T14:04:35Z", "content": "Mortgage rates rose again this week, inching closer to 5%. The 30-year fixed-rate mortgage averaged 4.72% in the week ending April 7, up from 4.67% the week before, according to Freddie Mac. Thats th… [+1890 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and Zachary Cohen, CNN", "title": "Justice Department blocking National Archives from sharing details on Mar-a-Lago boxes with congressional probe", "description": "The Justice Department is blocking the National Archives from sharing details with Congress on 15 boxes of records, including classified information that former President Donald Trump took to Mar-a-Lago after leaving office, the clearest indication yet that t…", "url": "https://www.cnn.com/2022/04/07/politics/justice-department-national-archives-mar-a-lago-boxes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406145601-02-merrick-garland-presser-0406-super-tease.jpg", "publishedAt": "2022-04-07T14:01:26Z", "content": "(CNN)The Justice Department is blocking the National Archives from sharing details with Congress on 15 boxes of records, including classified information that former President Donald Trump took to Ma… [+2402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Kaiser and Jennifer Gray, CNN", "title": "19 named storms expected this hurricane season, above average but becoming more common", "description": "After two consecutive years of exhausting the hurricane name list, forecasters are predicting 19 named storms this hurricane season, five more than normal.", "url": "https://www.cnn.com/2022/04/07/weather/april-hurricane-season-outlook-above-average/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406181025-20220406-hurricane-season-gfx-super-tease.jpg", "publishedAt": "2022-04-07T13:59:59Z", "content": "The best time to make a hurricane plan is when there is no hurricane! With 4 months until the start of the 2022 hurricane season, now is the time to 1) create an emergency plan, 2) determine whether … [+150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "People wrongly believe their friends will protect them from Covid -- but the opposite is true", "description": "Your good friends may be able to help you get out of a jam. They may be good listeners and they may be good at keeping you company over a meal or drink. But they are decidedly not good at keeping you from getting sick with Covid-19, new research shows.", "url": "https://www.cnn.com/2022/04/07/health/friends-infect-friends-covid-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201211114503-01-pandemic-rift-friendships-trnd-super-tease.jpg", "publishedAt": "2022-04-07T13:45:37Z", "content": "(CNN)Your good friends may be able to help you get out of a jam. They may be good listeners and they may be good at keeping you company over a meal or drink. But they are decidedly not good at keepin… [+7187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Donald Trump's big regret from January 6 will shock you", "description": "Donald Trump still hasn't learned his lesson.", "url": "https://www.cnn.com/2022/04/07/politics/trump-jan-6-riot-regret/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220125120405-the-point-24-hours-2-super-tease.jpg", "publishedAt": "2022-04-07T13:34:24Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Here's what the 'shadow docket' is and how the Supreme Court uses it", "description": "The shadow docket is simply the nickname for emergency actions taken by the Supreme Court that do not go through the full briefing and hearing process of a formal opinion. Here's what one expert who is writing a book on the shadow docket has to say.", "url": "https://www.cnn.com/2022/04/07/politics/shadow-docket-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406160412-scotus-0126-super-tease.jpg", "publishedAt": "2022-04-07T13:24:53Z", "content": "Washington (CNN)Chief Justice John Roberts turned heads this week when he criticized how the Supreme Court's conservatives used the emergency docket, referred to by some as the shadow docket.\r\nThe sh… [+5806 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan", "title": "Michigan governor sues county prosecutors and asks state Supreme Court to protect abortion access", "description": "Michigan Gov. Gretchen Whitmer on Thursday filed a lawsuit against several county prosecutors in her state and asked the state's Supreme Court to issue a decision on the constitutionality of abortion.", "url": "https://www.cnn.com/2022/04/07/politics/gretchen-whitmer-michigan-abortion-supreme-court/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220324202217-gretchen-whitmer-2020-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T13:05:05Z", "content": "Michigan Gov. Gretchen Whitmer on Thursday filed a lawsuit against several county prosecutors in her state and asked the states Supreme Court to issue a decision on the constitutionality of abortion.… [+3769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "The GMC Hummer EV is a brilliant execution of a terrible idea", "description": "With the GMC Hummer EV, General Motors designers and executives wanted to create a vehicle that would destroy stereotypes about electric vehicles and what they're capable of doing. On that count, the GMC Hummer EV is a remarkable success. It is unlike any EV …", "url": "https://www.cnn.com/2022/04/07/business/gmc-hummer-ev-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406131438-01-gmc-hummer-ev-super-tease.jpg", "publishedAt": "2022-04-07T13:02:48Z", "content": "(CNN)With the GMC Hummer EV, General Motors designers and executives wanted to create a vehicle that would destroy stereotypes about electric vehicles and what they're capable of doing. On that count… [+10792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz", "title": "Google now lets you search by combining images and words", "description": "Google wants to make it easier to search for things that are hard to describe with just a few words or an image.", "url": "https://www.cnn.com/2022/04/07/tech/google-lens-search-pictures-words/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220404041210-google-lens-handout.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T13:01:23Z", "content": "Google wants to make it easier to search for things that are hard to describe with just a few words or an image. \r\nOn Thursday, Google\r\n(GOOG) rolled out a new search optionthat lets you combine text… [+2374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Jen Psaki grilled on potential MSNBC move", "description": "During a White House press briefing on April 1, 2022, reporters asked White House Press Secretary Jen Psaki about her widely-reported deal to join MSNBC after leaving the White House.", "url": "https://www.cnn.com/videos/media/2022/04/07/psaki-msnbc-ethical-to-be-white-house-press-secretary-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407083709-jen-psaki-april-1-2022-super-tease.jpg", "publishedAt": "2022-04-07T12:39:11Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Warren Buffett is buying big again", "description": "For years, billionaire investor Warren Buffett has been sitting on a mountain of cash. But with stocks at record highs, he struggled to find deals that caught his eye.", "url": "https://www.cnn.com/2022/04/07/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407065630-warren-buffet-berkshire-hathaway-050619-restricted-super-tease.jpg", "publishedAt": "2022-04-07T12:10:19Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+5888 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "This romance novelist wrote a blog post on 'How to Murder Your Husband.' Now she's on trial in her husband's killing", "description": "Nancy Crampton-Brophy wrote steamy romance novels with shirtless men on the covers and titles like \"The Wrong Husband.\" Now, in a twist befitting one of her books, the Oregon woman is on trial for her husband's murder.", "url": "https://www.cnn.com/2022/04/07/us/nancy-brophy-husband-murder-trial-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220405142614-01-nancy-crampton-brophy-romance-novelist-trial-super-tease.jpg", "publishedAt": "2022-04-07T12:10:06Z", "content": "(CNN)Nancy Crampton-Brophy wrote steamy romance novels with muscular, often shirtless, men on their covers and titles like \"The Wrong Husband.\" Some carried a tagline that said, \"wrong never felt so … [+9082 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten", "title": "Why is baseball no longer America's Game?", "description": "Major League Baseball is finally back. Despite a lockout and delay in opening day, the players are actually going to take the field. When my father, born in 1927, was my age, Opening Day was one of the biggest events on the sports calendar.", "url": "https://www.cnn.com/2022/04/07/sport/mlb-opening-day-baseball-popularity-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220406123414-babe-ruth-file-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T11:48:20Z", "content": "Major League Baseball is finally back. Despite a lockout and delay in opening day, the players are actually going to take the field. When my father, born in 1927, was my age, Opening Day was one of t… [+7759 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann", "title": "Air Force delays hypersonic missile program after flight test 'anomalies'", "description": "The Air Force delayed its hypersonic missile program by up to a year after \"recent flight test anomalies\" pushed back the schedule for the weapon's completion, according to a statement from the Air Force.", "url": "https://www.cnn.com/2022/04/07/politics/air-force-hypersonic-missile-program-delay/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407072651-agm138-arrw-missile-08062022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T11:45:45Z", "content": "The Air Force delayed its hypersonic missile program by up to a year after recent flight test anomalies pushed back the schedule for the weapons completion, according to a statement from the Air Forc… [+1705 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso and Jason Hanna, CNN", "title": "Puerto Rican crews scramble to restore power after island-wide outage", "description": "Puerto Rico's power grid suffered an island-wide outage Wednesday, utility officials said, leaving an untold number of people without power overnight as workers scrambled to restore power into Thursday morning.", "url": "https://www.cnn.com/2022/04/07/us/puerto-rico-power-outage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407065321-puerto-rico-blackout-04062022-super-tease.jpg", "publishedAt": "2022-04-07T11:42:46Z", "content": "(CNN)Puerto Rico's power grid suffered an island-wide outage Wednesday, utility officials said, leaving an untold number of people without power overnight as workers scrambled to restore power into T… [+854 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand and Evan Perez, CNN", "title": "FBI arrests 2 men in DC accused of impersonating federal officers; 4 Secret Service agents placed on leave", "description": "The FBI arrested two men in Washington, DC, Wednesday for allegedly impersonating Department of Homeland Security agents for more than two years, giving expensive gifts to federal agents in DC, providing them apartments and offering to purchase a weapon for a…", "url": "https://www.cnn.com/2022/04/07/politics/fbi-arrests-federal-officer-impersonation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407061253-fbi-dhs-agent-arrest-04062022-super-tease.jpg", "publishedAt": "2022-04-07T11:19:56Z", "content": "(CNN)The FBI arrested two men in Washington, DC, Wednesday for allegedly impersonating Department of Homeland Security agents for more than two years, giving expensive gifts to federal agents in DC, … [+3580 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "Dozens of mysterious megalithic jars from an unknown civilization were excavated in India", "description": "While conducting research at three archeological sites with stone jars in India, a research team stumbled across four previously unknown areas with more of the megalithic artifacts . The stone jars measure up to nearly 10 feet tall and left researchers with m…", "url": "https://www.cnn.com/2022/04/07/world/megalithic-stone-jars-assam-india-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220401125730-01-indian-jars-assam-scn-super-tease.jpg", "publishedAt": "2022-04-07T11:12:45Z", "content": "(CNN)Dozens of megalithic jars have been unearthed in Assam, India, at four previously unknown sites, according to a study published in the journal Asian Archaeology.\r\nThe stone jars range from 1 to … [+3193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald, CNN", "title": "Tiger Woods: Eyes of the world on five-time Masters winner at Augusta", "description": "Tiger Woods is scheduled to tee off for the first round of the Masters on Thursday as he targets a remarkable comeback following a car crash in February 2021 in which he sustained serious leg injuries.", "url": "https://www.cnn.com/2022/04/07/golf/tiger-woods-masters-tee-off-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407060448-tiger-woods-masters-practice-04062022-super-tease.jpg", "publishedAt": "2022-04-07T11:12:34Z", "content": "(CNN)Tiger Woods is scheduled to tee off for the first round of the Masters on Thursday as he targets a remarkable comeback following a car crash in February 2021 in which he sustained serious leg in… [+1959 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, Ted Barrett and Ali Zaslav, CNN", "title": "Senate will hold key vote to advance Ketanji Brown Jackson's Supreme Court nomination", "description": "The Senate is set to hold a key vote Thursday to advance President Joe Biden's Supreme Court nominee, Ketanji Brown Jackson, toward a final confirmation vote.", "url": "https://www.cnn.com/2022/04/07/politics/ketanji-brown-jackson-senate-vote-latest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220404190859-02-kbj-nomination-advanced-0404-super-tease.jpg", "publishedAt": "2022-04-07T11:02:53Z", "content": "(CNN)The Senate is set to hold a key vote Thursday to advance President Joe Biden's Supreme Court nominee, Ketanji Brown Jackson, toward a final confirmation vote.\r\nThursday's procedural vote to limi… [+1713 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "They got illicit Covid-19 vaccine doses -- and say they'd do it again in a heartbeat", "description": "Last July, Andrea Ogg stood outside a pharmacy in Castle Rock, Colorado, fully prepared to lie to get herself a Covid-19 vaccine.", "url": "https://www.cnn.com/2022/04/07/health/illicit-covid-19-vaccine-doses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220405155256-andrea-ogg-covid-vaccine-02-super-tease.jpg", "publishedAt": "2022-04-07T10:43:25Z", "content": "(CNN)Last July, Andrea Ogg stood outside a pharmacy in Castle Rock, Colorado, fully prepared to lie to get herself a Covid-19 vaccine.\r\nHer stomach knotted in anxiety, Ogg was ready to say she was ge… [+14336 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for April 7: Ukraine, Immigration, Covid-19, USPS, Climate change", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/04/07/us/five-things-april-7-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407094354-5-things-040722-super-tease.jpg", "publishedAt": "2022-04-07T10:38:03Z", "content": "(CNN)Big changes are coming to your 401(k). A new bill, expected to hit President Joe Biden's desk this year, could require employers to automatically enroll all eligible workers into their retiremen… [+7014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Drew F. Lawrence and Katie Bo Lillis, CNN", "title": "Army report finds horses that carry the coffins of America's heroes live in 'unsatisfactory' conditions, after 2 die", "description": "The military horses that carry America's heroes to their final resting place in Arlington National Cemetery are living in unsanitary and potentially life-threatening conditions, according to a US Army report reviewed exclusively by CNN, consuming poor-quality…", "url": "https://www.cnn.com/2022/04/07/politics/army-horses-caisson-platoon-conditions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220325131626-military-horses-powell-funeral-super-tease.jpg", "publishedAt": "2022-04-07T10:25:18Z", "content": "Joint Base Myer-Henderson Hall, Va. (CNN)The military horses that carry America's heroes to their final resting place in Arlington National Cemetery are living in unsanitary and potentially life-thre… [+14122 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "10 of Europe's most beautiful train journeys", "description": "Europe's train lines are some of the most spectacular in the world. Here are some of the most beautiful, from Scotland's Harry Potter train to Italy's knockout views of Vesuvius.", "url": "https://www.cnn.com/travel/article/europe-most-beautiful-train-journeys/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331162257-09-europe-train-journeys-body-super-tease.jpg", "publishedAt": "2022-04-07T10:24:01Z", "content": "(CNN) It's where the \"flight shame\" movement was born and no wonder -- Europe is home to a superb rail network, including some truly spectacular journeys which are a vacation in themselves. Here are … [+8060 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Peniel Joseph", "title": "Opinion: KBJ's confirmation is one of the beautiful moments MLK described", "description": "Viewed through the lens of what has changed -- and hasn't -- since Martin Luther King Jr.'s words at Riverside Church 55 years ago this week, Jackson's confirmation represents one aspect of what he that day called a \"bitter, but beautiful struggle\" for Americ…", "url": "https://www.cnn.com/2022/04/07/opinions/ketanji-brown-jackson-confirmation-mlk-vietnam-riverside-speech-joseph/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220325153808-ketanji-brown-jackson-0322-super-tease.jpg", "publishedAt": "2022-04-07T10:19:29Z", "content": "Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affairs at the Univ… [+6954 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church,Patrick Snell", "title": "'Putin is a killer,' says Ukrainian goalkeeper as he sends a message of hope to his country", "description": "Anatoliy Trubin should be enjoying life as a professional footballer. Instead, the 20-year-old is doing his part to help Ukraine survive the Russian invasion.", "url": "https://www.cnn.com/2022/04/07/football/anatoliy-trubin-ukraine-goalkeeper-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220405121637-02-uefa-anatoliy-trubin-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T10:07:00Z", "content": "Anatoliy Trubin should be enjoying life as a professional footballer. Instead, the 20-year-old is doing his part to help Ukraine survive the Russian invasion.\r\nThe Shakhtar Donetsk goalkeeper, who ha… [+3344 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald, CNN", "title": "Scottish sports great Tom Smith dies aged 50", "description": "Former Scotland and British & Irish Lions rugby international Tom Smith has died aged 50, after being diagnosed with stage four colon cancer in 2019.", "url": "https://www.cnn.com/2022/04/07/sport/tom-smith-dies-scotland-rugby-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407043414-tom-smith-rugby-scotland-file-12051998-super-tease.jpg", "publishedAt": "2022-04-07T09:47:38Z", "content": "(CNN)Former Scotland and British &amp; Irish Lions rugby international Tom Smith has died aged 50, after being diagnosed with stage four colon cancer in 2019.\r\nDuring his career, Smith won 61 caps fo… [+1545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, Oleksandra Ochman, Eoin McSweeney and Gianluca Mezzofiore, CNN", "title": "A Ukrainian mother had plans to change her life this year. Russian forces shot her as she cycled home.", "description": "Iryna Filkina had big plans for this year, until Russia invaded Ukraine. In early March, her daughter begged her not to cycle to her home in Bucha. They never spoke again.", "url": "https://www.cnn.com/2022/04/07/europe/ukraine-mother-shot-russian-forces-bucha-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406135041-02-irina-bucha-ukraine-super-tease.jpg", "publishedAt": "2022-04-07T09:26:01Z", "content": "This story contains graphic images. \r\nLviv, Ukraine (CNN)Iryna Filkina had big plans for the year. She was turning 53 in April and planned to start focusing on herself after spending the past three d… [+5695 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "Ukrainian refugees housed on a cruise ship in Rotterdam", "description": "Volendam, a 237-meter Holland America line ship docked in the Dutch port is set to provide temporary refuge for up to 1,500 Ukrainians, including hot meals and housekeeping services.", "url": "https://www.cnn.com/travel/article/holland-america-volendam-accommodation-ukrainian-refugees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406100505-01-volendam-cruise-ship-super-tease.jpg", "publishedAt": "2022-04-07T09:16:59Z", "content": "(CNN) The travel industry has pitched in to help house some of the millions of people who have fled conflict in Ukraine over the past six weeks, with hotels and vacation home owners across Europe off… [+3442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva McKend, CNN", "title": "'We hear you': House Democrats' campaign arm touts early investment in Black voter outreach", "description": "The campaign arm of House Democrats is launching a new effort to reach Black voters ahead of the November midterm elections.", "url": "https://www.cnn.com/2022/04/07/politics/house-democrats-black-voters-outreach-radio-print/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406173538-01-house-democrats-black-voter-outreach-super-tease.jpg", "publishedAt": "2022-04-07T09:05:49Z", "content": "(CNN)The campaign arm of House Democrats is launching a new effort to reach Black voters ahead of the November midterm elections.\r\nBeginning in Virginia this week, the Democratic Congressional Campai… [+2994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Mahtani, CNN", "title": "'The Taliban cannot erase us' says winner of the International Women's Rights award", "description": "Former Afghan politician and women's rights activist Zarifa Ghafari spoke to CNN ahead of receiving the Geneva Summit's International Women's Rights Award this week.", "url": "https://www.cnn.com/2022/04/07/middleeast/zarifa-ghafari-women-afghanistan-taliban-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406113719-zarifa-ghafari-super-tease.jpg", "publishedAt": "2022-04-07T08:30:13Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)\"The Taliban cannot erase us, they can'… [+8060 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Shell could take $5 billion hit from Russia exit", "description": "Shell will write down up to $5 billion following its decision to exit Russia, more than previously disclosed, while soaring oil and gas prices boosted trading activities in the first quarter, the company said on Thursday.", "url": "https://www.cnn.com/2022/04/07/business/shell-russia-writedown/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407034904-shell-gas-station-moscow-restricted-super-tease.jpg", "publishedAt": "2022-04-07T07:59:17Z", "content": "LondonShell will write down up to $5 billion following its decision to exit Russia, more than previously disclosed, while soaring oil and gas prices boosted trading activities in the first quarter, t… [+2073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Sydney orders thousands to evacuate as heavy rains cause flash floods", "description": "Torrential downpours pummeled Australia's east coast on Thursday with Sydney receiving nearly a month's rain overnight, submerging the city's roads in flash floods and triggering evacuations as authorities warn of more to come through the day.", "url": "https://www.cnn.com/2022/04/07/australia/australia-floods-sydney-nsw-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407004706-01-sydney-heavy-rain-040722-super-tease.jpg", "publishedAt": "2022-04-07T06:24:35Z", "content": "SydneyTorrential downpours pummeled Australia's east coast on Thursday with Sydney receiving nearly a month's rain overnight, turning suburban roads into rivers and triggering evacuations as authorit… [+2846 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "After rounds of tornadoes across the South, storm threatens North Carolina, Virginia and Florida next", "description": "After dozens of tornadoes rolled through the South, another storm is threatening to deliver powerful winds and possibly more tornadoes Thursday to the coasts of North Carolina and Virginia along with parts of Florida.", "url": "https://www.cnn.com/2022/04/07/weather/severe-weather-south-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220407011541-georgia-storm-damage-04062022-super-tease.jpg", "publishedAt": "2022-04-07T06:09:47Z", "content": "(CNN)After dozens of tornadoes rolled through the South, another storm is threatening to deliver powerful winds and possibly more tornadoes Thursday to the coasts of North Carolina and Virginia along… [+2734 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'It's definitely a PR exercise': Expert on Russian oligarch sanctions", "description": "The UK government has claimed up to 60% of what it calls \"ill-gotten\" Russian gains and foreign reserves have been frozen and that there will soon be nowhere left for such money to hide. But as Nina dos Santos reports, sanctions on the super rich have yet to …", "url": "https://www.cnn.com/videos/business/2022/04/06/russia-oligarch-influence-putin-dos-santos-pkg-intl-ovn-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406224630-tom-keatinge-dos-santos-russia-oligarch-influence-super-tease.jpg", "publishedAt": "2022-04-07T04:41:04Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Megan Clement, for CNN", "title": "Analysis: What's at stake for women in the French election", "description": "At his final campaign event before the first round of the 2022 French presidential election, Emmanuel Macron told a packed stadium that gender equality would be the \"grand cause\" of his second term if he won. It was also the grand cause of his first.", "url": "https://www.cnn.com/2022/04/07/europe/macron-french-presidential-election-gender-equality-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406142339-macron-as-equals-040222-super-tease.jpg", "publishedAt": "2022-04-07T04:24:50Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)At his final campaign event before the … [+8879 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Dirty Dozen 2022: Produce with the most and least pesticides", "description": "Check this list of the most and least pesticide-laden fruits and vegetables before you go shopping for produce.", "url": "https://www.cnn.com/2022/04/07/health/dirty-dozen-produce-2022-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406211409-dirty-dozen-produce-2022-split-super-tease.jpg", "publishedAt": "2022-04-07T04:01:30Z", "content": "(CNN)Strawberries and spinach continue to top the annual list of the \"Dirty Dozen\" fruits and veggies that contain the highest levels of pesticides, followed by three greens -- kale, collard and must… [+6138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a> and <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, CNN", "title": "The latest on the invasion of Ukraine", "description": "A high-stakes NATO foreign ministers meeting kicked off in Brussels Wednesday, as US officials warn that Russia's war in Ukraine could be entering a protracted phase. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-04-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406114250-bucha-russian-armor-vehicle-file-040522-super-tease.jpg", "publishedAt": "2022-04-07T04:00:23Z", "content": "The \"age of engagement with Russia is over,\" UK Foreign Secretary Liz Truss said at a dinner with NATO foreign ministers in Brussels on Wednesday, according to a statement from the UK Foreign Office … [+1519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Kristi Noem, potential 2024 contender, says Biden's leadership style has emboldened Putin", "description": "South Dakota Gov. Kristi Noem accused President Joe Biden of projecting weakness on the world stage in a speech at the Reagan Library, charging that his leadership style has emboldened leaders such as Russian President Vladimir Putin.", "url": "https://www.cnn.com/2022/04/06/politics/kristi-noem-biden-ukraine-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406224808-kristi-noem-2021-file-restricted-super-tease.jpg", "publishedAt": "2022-04-07T03:41:06Z", "content": "(CNN)South Dakota Gov. Kristi Noem accused President Joe Biden in a speech Wednesday of projecting weakness on the world stage, saying he had been \"wrong on every major foreign policy decision that h… [+5698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Amy Simonson, CNN", "title": "Texas to send busloads of undocumented immigrants to the US Capitol, Gov. Greg Abbott says", "description": "Abbott's comments come after the Biden administration lifted the pandemic-era health that blocked migrants from entering the US.", "url": "https://www.cnn.com/2022/04/06/us/texas-immigrants-charter-buses-dc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406194410-01-texas-immigrants-charter-buses-dc-super-tease.jpg", "publishedAt": "2022-04-07T02:15:36Z", "content": "(CNN)Texas will send busloads of undocumented immigrants to the steps of the US Capitol, Gov. Greg Abbott announced Wednesday, in response to the Biden administration ending a pandemic-era health ord… [+3499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica", "title": "Obama: Ukraine war is a reminder of US complacency, taking democracy and 'rule of law' for granted", "description": "Former President Barack Obama spoke at length about the war in Ukraine on Wednesday, telling an audience in Chicago that the conflict is a \"bracing reminder for democracies that had gotten flabby and confused and feckless around the stakes of things that we t…", "url": "https://www.cnn.com/2022/04/06/politics/barack-obama-putin-russia-ukraine-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220406203845-01-barack-obama-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-07T01:53:19Z", "content": "Former President Barack Obama spoke at length about the war in Ukraine on Wednesday, telling an audience in Chicago that the conflict is a bracing reminder for democracies that had gotten flabby and … [+3237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Frehse", "title": "Man who lived in daughter's Sarah Lawrence College dorm room convicted of sex trafficking, forced labor and other federal crimes", "description": "The father who lived in his daughter's college dorm room has been convicted of sex trafficking, forced labor, tax evasion and money laundering after less than a day of jury deliberations, the US Attorney's Office of the Southern District of New York announced…", "url": "https://www.cnn.com/2022/04/06/us/sarah-lawrence-college-father-trafficking-case/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200211125417-lawrence-ray-mugshot.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "publishedAt": "2022-04-07T01:24:02Z", "content": "The father who lived in his daughters college dorm room has been convicted of sex trafficking, forced labor, tax evasion and money laundering after less than a day of jury deliberations, the US Attor… [+2777 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "NBC News journalists vexed by MSNBC's move to hire White House press secretary Jen Psaki", "description": "NBC News journalists are troubled by and have expressed dismay to network executives about MSNBC's intention to hire White House press secretary Jen Psaki when she exits the Biden administration, people familiar with the matter told CNN.", "url": "https://www.cnn.com/2022/04/06/media/jen-psaki-nbc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406171636-jen-psaki-0401-super-tease.jpg", "publishedAt": "2022-04-07T01:12:12Z", "content": "New York (CNN Business)NBC News journalists are troubled by and have expressed dismay to network executives about MSNBC's intention to hire White House press secretary Jen Psaki when she exits the Bi… [+4549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, CNN", "title": "Former Virginia police officer testifies against former colleague in January 6 trial", "description": "A former officer of the Rocky Mount Police in Virginia who went inside the US Capitol on January 6, 2021, took the stand Wednesday to testify against his former sergeant, Thomas Robertson.", "url": "https://www.cnn.com/2022/04/06/politics/thomas-robertson-jacob-fracker-january-6-trial-virginia-police/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220405145202-thomas-robertson-capitol-riot-super-tease.jpg", "publishedAt": "2022-04-07T00:49:46Z", "content": "Washington (CNN)A former officer of the Rocky Mount Police in Virginia who went inside the US Capitol on January 6, 2021, took the stand Wednesday to testify against his former sergeant, Thomas Rober… [+3144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon and Catherine E. Shoichet, CNN", "title": "Peru protests show the wide impact of Putin's war", "description": "An ongoing wave of violent protests in Peru shows how the Russian invasion of Ukraine is affecting markets around the world, sparking unrest and deepening political divides.", "url": "https://www.cnn.com/2022/04/06/americas/peru-protests-russia-ukraine-war-impact-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406180147-01-peru-protests-fuel-costs-super-tease.jpg", "publishedAt": "2022-04-07T00:47:22Z", "content": "(CNN)An ongoing wave of violent protests in Peru shows how the Russian invasion of Ukraine is affecting markets around the world, sparking unrest and deepening political divides.\r\nRising fuel costs o… [+4621 chars]"}]}