{"status": "ok", "totalResults": 101, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Voters say *this* is the biggest election problem in the country", "description": "Amid the ongoing fight over the recently passed Georgia election law -- and the subsequent decision by Major League Baseball to pull its All-Star Game out of Atlanta this summer --  you might reasonably conclude that efforts to restrict access to the ballot b…", "url": "https://www.cnn.com/2021/04/05/politics/gerrymandering-election-problem/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180110152016-20180110-nc-north-carolina-gerrymandering-hands-map-super-tease.jpg", "publishedAt": "2021-04-05T22:34:17Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Phylicia Rashād on the legacy of the AKAs highlighted in the 'Twenty Pearls' documentary", "description": "Phylicia Rashād pledged Alpha Kappa Alpha sorority at Howard University in Washington, DC in 1968, yet it took narrating a new documentary about the organization before she learned some of its earliest history.", "url": "https://www.cnn.com/2021/04/05/entertainment/phylicia-rashad-twenty-pearls-documentary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405164917-02-phylicia-rashad-twenty-pearls-documentary-super-tease.jpg", "publishedAt": "2021-04-05T21:41:09Z", "content": "(CNN)Phylicia Rashd pledged Alpha Kappa Alpha sorority at Howard University in Washington, DC in 1968, yet it took narrating a new documentary about the organization before she learned some of its ea… [+2352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren M. Johnson, CNN", "title": "Texas Gov. Greg Abbott declines to throw Rangers first pitch, citing MLB's stance against Georgia voting law", "description": "Texas Gov. Greg Abbott said Monday that he will not throw out the ceremonial first pitch at the Texas Rangers home opener because of Major League Baseball's stance on voter integrity laws.", "url": "https://www.cnn.com/2021/04/05/us/greg-abbott-declines-throwing-opening-pitch-rangers-game-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405162100-texas-gov-greg-abbott-file-2020-restricted-super-tease.jpg", "publishedAt": "2021-04-05T21:29:31Z", "content": "(CNN)Texas Gov. Greg Abbott said Monday that he will not throw out the ceremonial first pitch at the Texas Rangers home opener because of Major League Baseball's stance on voter integrity laws.\r\nAbbo… [+3235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Michael Andronico and Jacob Krol, CNN", "title": "These pet gadgets will make life better for you and your dog", "description": "Having a dog is one of life's great joys — though it can also come with messes, destroyed furniture and those ever-dreaded health issues. Fortunately, just like with us humans, there are plenty of gadgets out there that will allow your furry best friend to li…", "url": "https://www.cnn.com/2021/04/05/cnn-underscored/tech-for-dogs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190826121429-underscored-dog-tech-gadgets-lead-super-169.jpg", "publishedAt": "2021-04-05T21:13:53Z", "content": "Having a dog is one of lifes great joys though it can also come with messes, destroyed furniture and those ever-dreaded health issues. Fortunately, just like with us humans, there are plenty of gadge… [+4958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Biden administration officials falsely describe infrastructure jobs estimate", "description": "Top officials in President Joe Biden's administration have made a series of television and radio appearances to promote the infrastructure proposal Biden unveiled last week, a roughly $2 trillion package the White House has named the American Jobs Plan.", "url": "https://www.cnn.com/2021/04/05/politics/fact-check-biden-infrastructure-jobs-19-million-buttigieg-deese/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401093133-pete-buttigieg-0401-super-tease.jpg", "publishedAt": "2021-04-05T20:26:54Z", "content": "Washington (CNN)Top officials in President Joe Biden's administration have made a series of television and radio appearances to promote the infrastructure proposal Biden unveiled last week, a roughly… [+3862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "VP Harris is the latest White House official to appear with California Gov. Newsom amid recall effort", "description": "Top members of the Biden White House have appeared with California's embattled Democratic governor, Gavin Newsom, twice over the last week -- a signal of support for a politician who is likely to face a recall election.", "url": "https://www.cnn.com/2021/04/05/politics/kamala-harris-gavin-newsom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405145532-01-harris-newsom-0405-super-tease.jpg", "publishedAt": "2021-04-05T20:25:11Z", "content": "(CNN)Top members of the Biden White House have appeared with California's embattled Democratic governor, Gavin Newsom, twice over the last week -- a signal of support for a politician who is likely t… [+3370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ted Barrett and Nicky Robertson, CNN", "title": "Manchin warns Biden's infrastructure bill is in trouble over corporate tax hikes", "description": "Sen. Joe Manchin, an influential centrist Democrat, warned Monday that the Biden administration's massive infrastructure package can't pass in its current form because he and a handful of other Senate Democrats believe the corporate tax hikes proposed in the …", "url": "https://www.cnn.com/2021/04/05/politics/manchin-infrastructure-bill-tax-hikes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210223152543-joe-manchin-january-27-2021-super-tease.jpg", "publishedAt": "2021-04-05T20:18:07Z", "content": "Washington (CNN)Sen. Joe Manchin, an influential centrist Democrat, warned Monday that the Biden administration's massive infrastructure package can't pass in its current form because he and a handfu… [+1959 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette and Michael Conte, CNN", "title": "Blinken says US won't trade Covid shots for political favors", "description": "Secretary of State Tony Blinken said that the US would not \"trade shots in arms for political favors\" when outlining the State Department's plans to share supplies of Covid-19 vaccines with other countries, though he offered little detail on what that outreac…", "url": "https://www.cnn.com/2021/04/05/politics/blinken-state-covid-world/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210127095832-01-blinken-0127-super-tease.jpg", "publishedAt": "2021-04-05T20:00:05Z", "content": "Washington (CNN)Secretary of State Tony Blinken said that the US would not \"trade shots in arms for political favors\" when outlining the State Department's plans to share supplies of Covid-19 vaccine… [+5288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mirna Alsharif, CNN", "title": "April is Arab American Heritage Month, the US Department of State declares", "description": "The culture of Arab Americans will be honored this month, with the designation by the state department of April as Arab American Heritage Month, reflecting that the group's contributions to the US \"are as old as America itself,\" a spokesman said.", "url": "https://www.cnn.com/2021/04/05/us/arab-american-heritage-month/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405120936-department-of-state-arab-american-heritage-month-super-tease.jpg", "publishedAt": "2021-04-05T19:00:27Z", "content": "(CNN)The culture of Arab Americans will be honored this month, with the designation by the state department of April as Arab American Heritage Month, reflecting that the group's contributions to the … [+3148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Aaron David Miller", "title": "Israel's election aftermath: The good, the bad and the ugly", "description": "The good, the bad and the ugly. Aaron David Miller writes that Israel's fourth election in a little over two years may look like a repeat of the last three on the surface, the results reveal a trend that may have long term consequences in Israeli politics.", "url": "https://www.cnn.com/2021/04/05/opinions/israel-election-netanyahu-miller/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210323160207-01-israel-election-poster-0322-super-tease.jpg", "publishedAt": "2021-04-05T18:48:21Z", "content": "Aaron David Miller is a senior fellow at the Carnegie Endowment for International Peace and author of \"The End of Greatness: Why America Can't Have (and Doesn't Want) Another Great President.\" Miller… [+6356 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Arkansas' Republican governor vetoes anti-trans health care bill", "description": "Arkansas' Republican governor on Monday vetoed an anti-transgender health care bill that would've prohibited physicians in the state from providing gender-affirming \"procedures\" for trans people under age 18.", "url": "https://www.cnn.com/2021/04/05/politics/asa-hutchinson-arkansas-transgender-health-care-veto/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200523185737-asa-hutchinson-0523-super-tease.jpg", "publishedAt": "2021-04-05T18:43:15Z", "content": "Washington (CNN)Arkansas' Republican governor on Monday vetoed an anti-transgender health care bill that would've prohibited physicians in the state from providing gender-affirming \"procedures\" for t… [+1212 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Movie theater stocks are roaring thanks to 'Godzilla vs. Kong'", "description": "Even though HBO Max subscribers had the option to stream \"Godzilla vs. Kong\" in the comfort of their home, plenty of moviegoers went to see the blockbuster in a theater. And that's great news for the publicly traded owners of big multiplexes.", "url": "https://www.cnn.com/2021/04/05/investing/movie-theaters-godzilla-vs-kong/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405120339-movie-theaters-godzilla-kong-restricted-super-tease.jpg", "publishedAt": "2021-04-05T18:33:45Z", "content": "New York (CNN Business)HBO Max subscribers had the option to stream \"Godzilla vs. Kong\" in the comfort of their homes during Easter and Passover weekend, but plenty of moviegoers opted to see it in t… [+2333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "\"Staggering\" number of children have lost at least one parent to Covid-19, model estimates", "description": "More than a year into the pandemic, children's lives may be starting to look more normal as an increasing number of people get vaccinated and schools reopen. However, many children in the US are contending with the difficult reality that is irreparable: the l…", "url": "https://www.cnn.com/2021/04/05/health/parental-deaths-covid-19-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201113142013-children-covid-vls-super-tease.jpg", "publishedAt": "2021-04-05T18:01:29Z", "content": "(CNN)More than a year into the pandemic, children's lives may be starting to look more normal as an increasing number of people get vaccinated and schools reopen. However, many children in the US are… [+5393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jason Cipriani", "title": "The Fitbit Ace 3 is a great fitness tracker for your little one", "description": "The Ace 3 isn't the first Fitbit for kids. But as the third iteration, it's more capable and attractive than ever.", "url": "https://www.cnn.com/2021/04/05/cnn-underscored/fitbit-ace-3-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405123314-1-fitbit-ace-3-review-underscored-super-169.jpg", "publishedAt": "2021-04-05T18:00:41Z", "content": "The Ace 3 isnt the first Fitbit for kids. But as the third iteration, its more capable and attractive than ever. \r\nFitbits Ace 3 is available now for $79.95 and for the last three weeks, weve had not… [+10836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "Latin America's grueling battle with Covid-19 isn't letting up", "description": "More than 100 days since the first Covid-19 vaccinations in Latin America, the pandemic is still dangerously resurging in some areas. The region's recent battle with the coronavirus remains marked by disparities, with some countries boasting of positive vacci…", "url": "https://www.cnn.com/2021/04/05/americas/latin-america-covid-19-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402182217-05-coronavirus-gallery-update-0117-super-tease.jpg", "publishedAt": "2021-04-05T17:38:55Z", "content": "Bogota, Colombia (CNN)More than 100 days since the first Covid-19 vaccinations in Latin America, the pandemic is still dangerously resurging in some areas. The region's recent battle with the coronav… [+4459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "Latin America's grueling battle with Covid-19 isn't letting up", "description": "More than 100 days since the first Covid-19 vaccinations in Latin America, the pandemic is still dangerously resurging in some areas.", "url": "https://www.cnn.com/2021/04/05/americas/latin-america-covid-19-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402182217-05-coronavirus-gallery-update-0117-super-tease.jpg", "publishedAt": "2021-04-05T17:38:55Z", "content": "Bogota, Colombia (CNN)More than 100 days since the first Covid-19 vaccinations in Latin America, the pandemic is still dangerously resurging in some areas. The region's recent battle with the coronav… [+4459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "Head of Capitol security review calls for background checks on all congressional staff", "description": "The leader of a task force that reviewed security failures around the January 6 insurrection reiterated his call on Monday for background checks on all congressional staff following yet another deadly attack at the US Capitol.", "url": "https://www.cnn.com/2021/04/05/politics/honore-capitol-police-mission-congressional-staff-background-checks-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405114655-honore-sot-vpx-super-tease.jpg", "publishedAt": "2021-04-05T17:21:21Z", "content": "Washington (CNN)The leader of a task force that reviewed security failures around the January 6 insurrection reiterated his call on Monday for background checks on all congressional staff following y… [+4647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr, CNN Pentagon Correspondent", "title": "Army sends additional criminal investigators to Fort Sill following sexual assault allegation", "description": "Additional Army criminal investigators have been sent to Fort Sill, Oklahoma, in the wake of a soldier's allegation about sexual assault that may have involved multiple Army personnel in more than one incident, several Army officials told CNN.", "url": "https://www.cnn.com/2021/04/05/politics/fort-sill-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405124133-fort-sill-entrance-file-super-tease.jpg", "publishedAt": "2021-04-05T16:52:17Z", "content": "(CNN)Additional Army criminal investigators have been sent to Fort Sill, Oklahoma, in the wake of a soldier's allegation about sexual assault that may have involved multiple Army personnel in more th… [+839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lakshman Achuthan and Anirvan Banerji for CNN Business Perspectives", "title": "Trump shouldn't get credit for the economic rebound. Neither should Biden", "description": "Presidents typically get too much credit -- or blame -- for the US economy's current performance, while the unseen drivers of the economic cycle get way too little.", "url": "https://www.cnn.com/2021/04/05/perspectives/trump-biden-economic-rebound/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210331185052-us-restaurant-0329-restricted-super-tease.jpg", "publishedAt": "2021-04-05T16:50:54Z", "content": "Lakshman Achuthan and Anirvan Banerji are co-founders of the Economic Cycle Research Institute (ECRI). The opinions expressed in this commentary are their own.\r\nPresidents typically get too much cred… [+3978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Ahn, CNN", "title": "Illinois bar opening event linked to 46 Covid-19 cases, a school closure and hospitalization, CDC report says", "description": "A rural Illinois bar opening event in February was linked to a Covid-19 outbreak of at least 46 cases, a school closure and the hospitalization of a long-term care facility resident, according to a United States Centers for Disease Control and Prevention repo…", "url": "https://www.cnn.com/2021/04/05/health/illinois-bar-covid-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175729-01-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-05T16:43:19Z", "content": "(CNN)A rural Illinois bar opening event in February was linked to a Covid-19 outbreak of at least 46 cases, a school closure and the hospitalization of a long-term care facility resident, according t… [+2940 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "More stimulus money is on the way for people who lost their jobs last year", "description": "The Internal Revenue Service started sending what it calls \"plus-up\" payments last week to people who are owed a bigger stimulus check based on their actual 2020 income than they initially received.", "url": "https://www.cnn.com/2021/04/05/politics/stimulus-plus-up-payments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210113173026-us-stimulus-check---stock-super-tease.jpg", "publishedAt": "2021-04-05T16:21:35Z", "content": "Washington (CNN)The Internal Revenue Service started sending what it calls \"plus-up\" payments last week to people who are owed a bigger stimulus check based on their actual 2020 income than they init… [+3369 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Brent Swails and Scott McWhinnie, CNN", "title": "Myanmar's junta releases 8 of 11 people arrested after communicating with CNN", "description": "At least eight of 11 people who were detained after communicating with CNN journalists in Myanmar were released on Monday, according to three sources close to those detained, who spoke on condition of anonymity over fears of reprisal.", "url": "https://www.cnn.com/2021/04/05/asia/myanmar-military-arrests-release-cnn-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405163822-03-myanmar-clarissa-ward-live-super-tease.jpg", "publishedAt": "2021-04-05T16:20:01Z", "content": "Yangon, Myanmar (CNN)At least eight of 11 people who were detained after communicating with CNN journalists in Myanmar were released on Monday, according to three sources close to those detained, who… [+4378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kai Burkhardt", "title": "13 plants that are actually easy to keep alive, according to experts", "description": "Spring is here, and if you want to add a little green to your living space now's the perfect time. To get you started, we talked to plant experts and found the best indoor plants for beginners.", "url": "https://www.cnn.com/2021/04/05/cnn-underscored/best-indoor-plants-for-beginners/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200326121339-underscored-indoor-plants-lead-1-super-169.jpg", "publishedAt": "2021-04-05T16:03:58Z", "content": "Spring is here, and theres nothing like celebrating the season with a brand new plant. If you want to add a little green to your living space, there are tons of plants that are easy to take care of, … [+7918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "The NFT bubble might be bursting already", "description": "Non-fungible tokens, or NFTs, are all the rage. But their popularity may have already peaked. Prices of NFTs, the digital certificates that have taken the art and collectibles world by storm this year, have plunged about 70% from their high point in February.", "url": "https://www.cnn.com/2021/04/05/investing/nft-prices-falling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401141154-nft-digital-art-beeple---stock-super-tease.jpg", "publishedAt": "2021-04-05T16:03:27Z", "content": "New York (CNN Business)Non-fungible tokens, or NFTs, are all the rage. But their popularity may have already peaked. Prices of NFTs, the digital certificates that have taken the art and collectibles … [+2754 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hadas Gold, CNN", "title": "Netanyahu's corruption trial resumes as coalition talks heat up", "description": "Benjamin Netanyahu faced some of his biggest challenges to date, both legally and politically, in a historic split-screen day in Israel.", "url": "https://www.cnn.com/2021/04/05/middleeast/israel-benjamin-netanyahu-trial-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405041732-benjamin-netanyahu-hearing-0405-super-tease.jpg", "publishedAt": "2021-04-05T15:55:04Z", "content": "Jerusalem (CNN)Benjamin Netanyahu faced some of his biggest challenges to date, both legally and politically, in a historic split-screen day in Israel.\r\nShortly after 9 a.m. on Monday, the Israeli Pr… [+5375 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Kate Sullivan, CNN", "title": "Biden records video welcoming new US citizens for naturalization ceremonies", "description": "President Joe Biden recorded a video that will be played at naturalization ceremonies welcoming new US citizens in which he thanks them for choosing the United States and invokes his own ancestors who emigrated from Ireland.", "url": "https://www.cnn.com/2021/04/05/politics/biden-naturalization-ceremonies-video/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402113445-03-biden-jobs-0402-super-tease.jpg", "publishedAt": "2021-04-05T15:54:15Z", "content": "(CNN)President Joe Biden recorded a video that will be played at naturalization ceremonies welcoming new US citizens in which he thanks them for choosing the United States and invokes his own ancesto… [+2016 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chelsea Stone", "title": "The best sales to shop today: Best Buy, Under Armour, Chewy and more", "description": "Today, you'll find a deal on the best earbuds for Android users, discounted pet supplies from Chewy and savings on clearance and open-box tech from Best Buy. All that and more below.", "url": "https://www.cnn.com/2021/04/05/cnn-underscored/best-online-sales-right-now/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405112241-0405dealslead-super-169.jpg", "publishedAt": "2021-04-05T15:46:45Z", "content": "Today, youll find a deal on the best earbuds for Android users, discounted pet supplies from Chewy and savings on clearance and open-box tech from Best Buy. All that and more below.\r\nSamsungs newest … [+7490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Cassidy, CNN", "title": "Northern Ireland sees 3 nights of violence", "description": "Violent clashes in Northern Ireland erupted over the weekend amid increasing tensions in a region historically plagued with sectarian violence.", "url": "https://www.cnn.com/2021/04/05/uk/northern-ireland-violence-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405074921-02-northern-ireland-sectarian-violence-0403-super-tease.jpg", "publishedAt": "2021-04-05T15:03:23Z", "content": "(CNN)Violent clashes in Northern Ireland erupted over the weekend amid increasing tensions in a region historically plagued with sectarian violence. \r\nSunday marked a third night of disorder in the c… [+2552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jomana Karadsheh, CNN", "title": "Jordan's royal family drama sends shudders around the region. Here's what we know", "description": "For a country often seen as a bastion of relative calm in a troubled region, the events that unfolded in Jordan over the weekend were among the most dramatic in decades.", "url": "https://www.cnn.com/2021/04/05/middleeast/jordan-arrests-royal-family-explainer-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405151008-01-jordan-king-abdullah-ii-and-hamzah-bin-al-hussein-split-super-tease.jpg", "publishedAt": "2021-04-05T14:49:14Z", "content": "Amman, Jordan (CNN)For a country often seen as a bastion of relative calm in a troubled region, the events that unfolded in Jordan over the weekend were among the most dramatic in decades.\r\nAround 15… [+8326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores and Sara Weisfeldt, CNN", "title": "Border facilities holding migrant children are 'stretched beyond thin' with 'profound overcrowding,' court monitors say", "description": "Border processing facilities for migrant children are \"stretched beyond thin\" and experiencing \"profound overcrowding\" that make social distancing \"impossible,\" court-appointed monitors said in documents made public this weekend.", "url": "https://www.cnn.com/2021/04/05/politics/border-facilities-migrant-children/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405102009-04-border-facility-donna-texas-0330-super-tease.jpg", "publishedAt": "2021-04-05T14:44:21Z", "content": "McAllen, Texas (CNN)Border processing facilities for migrant children are \"stretched beyond thin\" and experiencing \"profound overcrowding\" that make social distancing \"impossible,\" court-appointed mo… [+4004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Hemingway' tackles the writer in a documentary as big as his tumultuous life", "description": "The long history of Ken Burns documentaries ranges from places to people to entire wars. His latest collaboration with Lynn Novick, \"Hemingway,\" falls in that middle category, portraying Ernest Hemingway's war-spanning, tumultuous life over six hours, which m…", "url": "https://www.cnn.com/2021/04/05/entertainment/hemingway-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402083052-hemingway-pbs-super-tease.jpg", "publishedAt": "2021-04-05T14:42:53Z", "content": "(CNN)The long history of Ken Burns documentaries ranges from places to people to entire wars. His latest collaboration with Lynn Novick, \"Hemingway,\" falls in that middle category, portraying Ernest … [+3613 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "Supreme Court hands Google a victory in a multibillion-dollar case against Oracle", "description": "The Supreme Court has handed Google a win in a decade-old case in software development, holding that the technology giant did not commit copyright infringement against Oracle when it copied snippets of programming language to build its Android operating syste…", "url": "https://www.cnn.com/2021/04/05/tech/google-oracle-supreme-court-ruling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405122518-google-android-phone-restricted-super-tease.jpg", "publishedAt": "2021-04-05T14:40:25Z", "content": "(CNN Business)The Supreme Court has handed Google a win in a decade-old case in software development, holding that the technology giant did not commit copyright infringement against Oracle when it co… [+3213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky, CNN Business", "title": "Was my Facebook data leaked? Here's how to tell", "description": "Over the weekend, cybersecurity experts revealed that about half a billion Facebook users' personal information was breached -- a treasure trove of data the includes full names, birthdays, phone numbers and their location.", "url": "https://www.cnn.com/2021/04/05/tech/facebook-data-leaked-how-to-tell/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200730155553-facebook-app-tablet---stock-super-tease.jpg", "publishedAt": "2021-04-05T14:40:16Z", "content": "New York (CNN Business)Over the weekend, cybersecurity experts revealed that about half a billion Facebook users' personal information was breached -- a treasure trove of data the includes full names… [+1460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The Trump fundraising scam is the least surprising part about his presidency", "description": "Desperate for money to finance a struggling presidential campaign, then-President Donald Trump's 2020 team reportedly turned to fundraising tactics that duped donors into giving far more money than they intended or believed they were.", "url": "https://www.cnn.com/2021/04/05/politics/donald-trump-fundraising-2020-campaign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170224121826-trump-products-super-tease.jpg", "publishedAt": "2021-04-05T14:20:12Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "How safe is it to go to the beach now? What you should know", "description": "Summer is near, and more people are getting Covid-19 vaccines, so is going to the beach safe now? Here's what you need to plan ahead and have a less risky trip.", "url": "https://www.cnn.com/travel/article/beach-safety-pandemic-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210114122655-dunedin-beach-stock-super-tease.jpg", "publishedAt": "2021-04-05T14:12:03Z", "content": "Editor's Note Since the pandemic continues, CNN is not advising that people do these activities. But if you're going to, there are ways to mitigate risks. Fully vaccinated people are, of course, at m… [+2972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kiana Murden", "title": "30 stylish lightweight jackets under $150 to transition into spring", "description": "Spring fashion can be so confusing. With that in mind, we've rounded up a selection of top-rated and stylist-recommended lightweight jackets you'll thank yourself for buying this spring.", "url": "https://www.cnn.com/2021/04/05/cnn-underscored/lightweight-jackets-women-men/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402134308-lightweight-jackets-women-men-lead-super-169.jpg", "publishedAt": "2021-04-05T14:08:41Z", "content": "Spring fashion can be so confusing, especially if you live in a place that truly experiences all four seasons. In the daytime its pushing 70 degrees, but once the sun sets, its chilly again. Every da… [+10573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Melissa Macaya, Mike Hayes, <a href=\"/profiles/melissa-mahtani\">Melissa Mahtani</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "Derek Chauvin is on trial for George Floyd's death", "description": "Witness testimony continues in the trial of former Minneapolis Police officer Derek Chauvin, who has been charged in the death of George Floyd. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/derek-chauvin-trial-04-05-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg", "publishedAt": "2021-04-05T12:18:24Z", "content": "The jury in Derek Chauvin's trial has heard from multiple witnesses so far, and they've been shown bystander and police footage of George Floyd's final moments. \r\nIf convicted, Chauvin could face up … [+1485 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "The US recovery is speeding up but the global economy isn't out of danger", "description": "The economic recovery in the United States and China is gaining steam, triggering a wave of upgraded forecasts and optimistic commentary. Meanwhile, economists watching other parts of the world are getting worried.", "url": "https://www.cnn.com/2021/04/05/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405113737-02-us-economy-0404-super-tease.jpg", "publishedAt": "2021-04-05T11:55:31Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)The economic recovery in the United States and … [+7081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zamira Rahim, CNN", "title": "A category five heath crisis", "description": "The US has hit \"category five hurricane status\" with the pandemic as the Midwest approaches a fourth wave of cases, Michael Osterholm, University of Minnesota Center for Infectious Disease Research and Policy director, said Sunday.", "url": "https://www.cnn.com/2021/04/05/world/coronavirus-newsletter-intl-04-05-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2021-04-05T11:40:42Z", "content": "A version of this story appeared in the April 5 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday.\r\n (CNN)The US has hit \"cat… [+7751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Justice Democrats jump into 2022 primaries with Tennessee House race endorsement", "description": "Justice Democrats, the progressive group that launched Rep. Alexandria Ocasio-Cortez's historic 2018 campaign, made its first splash of the 2022 midterms on Monday by endorsing Nashville activist Odessa Kelly as she kicked off her Democratic primary challenge…", "url": "https://www.cnn.com/2021/04/05/politics/justice-democrats-endorsement-odessa-kelly-tennessee-2022-midterm/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404155346-restricted-file-odessa-kelly-super-tease.jpg", "publishedAt": "2021-04-05T11:04:57Z", "content": "(CNN)Justice Democrats, the progressive group that launched Rep. Alexandria Ocasio-Cortez's historic 2018 campaign, made its first splash of the 2022 midterms on Monday by endorsing Nashville activis… [+3510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "This Amazon-backed startup is trying to save the planet, one motor at a time", "description": "Turntide Technologies is on a mission to save the planet, one motor at a time.", "url": "https://www.cnn.com/2021/04/05/business/turntide-technologies-amazon-smart-motor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402092921-20210402-v01-shaft-right-super-tease.jpg", "publishedAt": "2021-04-05T10:51:05Z", "content": "Our funding was extremely challenging for all of our history, until very recently. It was like crossing the desert. We managed to get through it, while others failed.\"\r\nTurntide CEO Ryan Morris"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "LG was a smartphone pioneer. Now it's quitting the business", "description": "LG is getting out of the \"incredibly competitive\" business of making smartphones.", "url": "https://www.cnn.com/2021/04/05/tech/lg-electronics-exiting-smartphone-business-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405060921-lg-phone-2020-restricted-super-tease.jpg", "publishedAt": "2021-04-05T10:45:48Z", "content": "Pour one out for LG Mobile. They're the reason we have ultrawides in every new phone right now. They didn't always ace every phone, but losing them means losing a competitor that was willing to try n… [+107 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong, CNN", "title": "'Then' is still 'now': Author Mary-Frances Winters weighs in on the high costs of living while Black in US", "description": "In \"Black Fatigue: How Racism Erodes the Mind, Body and Spirit,\" Mary-Frances Winters documents measures concerning economics, criminal justice and education, as well as the physical and mental health of Black Americans. Winters illuminates the myriad dire co…", "url": "https://www.cnn.com/2021/04/05/health/black-fatigue-mary-frances-winters-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402153852-blm-anti-racism-protest-file-2020-super-tease.jpg", "publishedAt": "2021-04-05T10:41:08Z", "content": "(CNN)For some, the decision to sidestep coverage of former police officer Derek Chauvin's murder trial is a matter of self-preservation. Having to choose between bearing witness to George Floyd's dea… [+7624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham, CNN", "title": "5 things to know for April 5: Covid-19, voter suppression, Facebook, Russia, Jordan", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2021/04/05/us/five-things-april-5-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404111446-01-easter-coronavirus-0403-poland-super-tease.jpg", "publishedAt": "2021-04-05T10:37:17Z", "content": "(CNN)Japan just saw the earliest bloom of its legendary cherry blossoms in 1,200 years. Pretty -- but also a sign of climate change.\r\nHere's what you need to know to Get Up to Speed and On with Your … [+6011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toyin Owoseje, CNN", "title": "Cher apologizes for 'not appropriate' George Floyd tweet", "description": "Music legend Cher has apologized for a tweet in which she theorized that she could have prevented George Floyd's death.", "url": "https://www.cnn.com/2021/04/05/entertainment/cher-george-floyd-tweet-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405041009-cher-file-2020-super-tease.jpg", "publishedAt": "2021-04-05T10:25:41Z", "content": "Wrestled With This Twt, Because I Thought some ppl wouldn't understand, Or Believe an Entertainer Could have Honest emotions about a human Being,suffering &amp; Dying,even if It's Only Shown On tv. Y… [+116 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Leukemia survivor Rikako Ikee defies odds by securing Olympics berth", "description": "Japanese swimming star Rikako Ikee defied the odds and secured an Olympics berth after the leukemia survivor won the women's 100-meter butterfly at the national championships on Sunday, less than eight months after she returned to competition.", "url": "https://edition.cnn.com/2021/04/05/sport/rikako-ikee-olympic-qualification-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210405111025-rikako-ikee-super-tease.jpg", "publishedAt": "2021-04-05T10:22:44Z", "content": "Japanese swimming star Rikako Ikee defied the odds and secured an Olympics berth after the leukemia survivor won the women's 100-meter butterfly at the national championships on Sunday, less than eig… [+1041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson, CNN", "title": "Here's what happened to George Floyd from every perspective and angle", "description": "Prosecutors told jurors in the opening statements of Derek Chauvin's criminal trial to \"believe your eyes.\" So far, the prosecution has given those eyes plenty to see.", "url": "https://www.cnn.com/2021/04/05/us/george-floyd-video-angle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404161944-split-derek-chauvin-trial-footage-super-tease.jpg", "publishedAt": "2021-04-05T10:01:20Z", "content": "(CNN)Prosecutors told jurors in the opening statements of Derek Chauvin's criminal trial to \"believe your eyes.\" So far, the prosecution has given those eyes plenty to see.\r\nIn the first week of the … [+6837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/ben-westcott\">Ben Westcott</a> and <a href=\"/profiles/brett-mckeehan\">Brett McKeehan</a>, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-05-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-05T07:23:23Z", "content": "India recorded 103,558 new Covid-19 cases on Monday, its highest single-day rise in infections so far in the pandemic.\r\nThe number of new daily cases in India has risen steadily since March 10, with … [+968 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Paton Walsh, CNN", "title": "Satellite images show huge Russian military buildup in the Arctic", "description": "Russia is amassing unprecedented military might in the Arctic and testing its newest weapons in a region freshly ice-free due to the climate emergency, in a bid to secure its northern coast and open up a key shipping route from Asia to Europe.", "url": "https://www.cnn.com/2021/04/05/europe/russia-arctic-nato-military-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210329151843-arctic-pagetop-super-tease.jpg", "publishedAt": "2021-04-05T05:06:09Z", "content": "(CNN)Russia is amassing unprecedented military might in the Arctic and testing its newest weapons in a region freshly ice-free due to the climate emergency, in a bid to secure its northern coast and … [+12698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Hollingsworth, CNN", "title": "Truck driver expresses 'deep remorse' after deadly Taiwan train crash", "description": "A driver whose truck was allegedly involved in a deadly train crash in eastern Taiwan has issued a tearful apology, saying he is \"deeply remorseful.\"", "url": "https://www.cnn.com/2021/04/05/asia/taiwan-train-apology-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402151234-23-taiwan-train-derailment-0402-super-tease.jpg", "publishedAt": "2021-04-05T04:31:51Z", "content": "(CNN)A driver whose truck was allegedly involved in a deadly train crash in eastern Taiwan has issued a tearful apology, saying he is \"deeply remorseful.\"\r\nAuthorities are investigating a crane truck… [+2433 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Alonso", "title": "One person killed and at least 5 others injured in a park shooting on Easter", "description": "A woman is dead and five others, including a 4-year-old, were injured at a shooting in a park in Birmingham, Alabama, on Easter Sunday, police said.", "url": "https://www.cnn.com/2021/04/05/us/birmingham-alabama-park-shooting-easter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404235310-birmingham-park-shooting-0404-super-tease.jpg", "publishedAt": "2021-04-05T04:28:38Z", "content": "(CNN)A woman is dead and five others, including a 4-year-old, were injured at a shooting in a park in Birmingham, Alabama, on Easter Sunday, police said.\r\nOfficers responded to a shooting at Patton P… [+660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Selina Wang and Derek Van Dam, CNN", "title": "Japan just recorded its earliest cherry blossom bloom in 1,200 years as impact of climate crisis intensifies", "description": "Think of Japan in the spring, and the image that comes to mind is likely the country's famous cherry blossoms, also known as \"sakura\" -- white and pink flowers, bursting across cities and mountains, petals covering the ground.", "url": "https://www.cnn.com/2021/04/05/asia/japan-cherry-blossoms-climate-change-intl-hnk-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402104912-04-japan-cherry-blossoms-2021-super-tease.jpg", "publishedAt": "2021-04-05T04:05:07Z", "content": "(CNN)Think of Japan in the spring, and the image that comes to mind is likely the country's famous cherry blossoms, also known as \"sakura\" -- white and pink flowers, bursting across cities and mounta… [+6093 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Jorgensen, CNN", "title": "How one of Detroit's churches is tackling vaccine hesitancy to help combat Michigan's Covid-19 surge", "description": "When Pastor Kenneth J. Flowers took to the pulpit on Easter Sunday, tapping a tambourine along with a choir singing \"he got up,\" the morning represented resurrection in more ways than one.", "url": "https://www.cnn.com/2021/04/04/us/detroit-michigan-church-easter-vaccine-hesitation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404222910-05-michigan-easter-spike-vaccine-hesitation-super-tease.jpg", "publishedAt": "2021-04-05T03:32:58Z", "content": "Detroit (CNN)When Pastor Kenneth J. Flowers took to the pulpit on Easter Sunday, tapping a tambourine along with a choir singing \"he got up,\" the morning represented resurrection in more ways than on… [+4092 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anjali Huynh and Saba Hamedy, CNN", "title": "The Weeknd says he is donating $1 million toward Ethiopian relief efforts", "description": "Grammy award-winning artist The Weeknd is stepping up to help Ethiopians amid violence in the country.", "url": "https://www.cnn.com/2021/04/04/entertainment/the-weeknd-donates-1-million-ethiopia-relief-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404191345-restricted-the-weeknd-0204-super-tease.jpg", "publishedAt": "2021-04-05T01:00:19Z", "content": "(CNN)Grammy award-winning artist The Weeknd is stepping up to help Ethiopians amid violence in the country.\r\nThe singer-songwriter, whose real name is Abel Makkonen Tesfaye, on Sunday said that he wi… [+2532 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Research exec: Far-right groups pushing vaccine as 'mark of the beast'", "description": "CNN's Pamela Brown and Devin Burghart, the head of the Institute for Research and Education on Human Rights, discuss a New York Times article about far-right extremist groups pivoting their focus to the anti-vaccine movement.", "url": "https://www.cnn.com/videos/media/2021/04/05/far-right-extremist-groups-shift-vaccine-misinformation-burghart-intv-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404201741-far-right-extremist-groups-shift-vaccine-misinformation-burghart-intv-nr-vpx-00022616-super-tease.jpeg", "publishedAt": "2021-04-05T00:29:03Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN", "title": "George Floyd's family describes heart-wrenching experience in the courtroom during Derek Chauvin's trial, attorney says", "description": "Attorney Ben Crump spoke to CNN's Jim Acosta on Sunday.", "url": "https://www.cnn.com/2021/04/04/us/george-floyd-family-derek-chauvin-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330144236-philonise-floyd-benjamin-crump-grab-super-tease.jpg", "publishedAt": "2021-04-05T00:08:27Z", "content": "(CNN)An attorney representing the family of George Floyd told CNN on Sunday being in the courtroom for the trial of the former police officer accused of killing Floyd has been \"heart-wrenching.\" \r\nTh… [+2973 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dean Obeidallah", "title": "MLK was killed 53 years ago. His fight for Black voting rights has yet to be won", "description": "Dean Obeidallah writes that those opposed to Republican efforts to pass voter suppression bills should channel Dr. Martin Luther King Jr, by calling for more boycotts such as those by Major League Baseball, which moved its All-Star game from Georgia in respon…", "url": "https://www.cnn.com/2021/04/04/opinions/martin-luther-king-assassination-voting-rights-obeidallah/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115201817-mlk-phone-super-tease.jpg", "publishedAt": "2021-04-04T23:44:43Z", "content": "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast. Follow him @DeanObeidallah. The opinions expressed in… [+5581 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "See who's nominated for a SAG Award", "description": "The 27th Annual Screen Actors Guild Awards, which honor some of the year's best performances in film and television, will air on Sunday night.", "url": "https://www.cnn.com/2021/04/04/entertainment/sag-award-winners-highlights-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201113091456-01-the-queens-gambit-taylor-joy-super-tease.jpg", "publishedAt": "2021-04-04T23:38:02Z", "content": "(CNN)The 27th Annual Screen Actors Guild Awards, which honor some of the year's best performances in film and television, will air on Sunday night.\r\nBelow is a full list of nominees. Check back for u… [+2523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "Restaurant owner offers a job to the burglar who broke into his business", "description": "After someone broke into an Augusta, Georgia, restaurant over the weekend, the owner of the business responded in an unusual way: He offered the suspect a job.", "url": "https://www.cnn.com/2021/04/04/us/business-owner-offers-job-burglar-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404173046-restricted-business-owner-offers-job-burglar-trnd-super-tease.jpg", "publishedAt": "2021-04-04T22:57:53Z", "content": "(CNN)After someone broke into an Augusta, Georgia, restaurant over the weekend, the owner of the business responded in an unusual way: He offered the suspect a job.\r\n\"No police, no questions. Let's s… [+1099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De la Fuente and Amir Vera, CNN", "title": "Atlanta Braves cover All-Star Game patch on jerseys after MLB's decision to move game", "description": "The Atlanta Braves altered their uniforms Saturday ahead of their game against the Philadelphia Phillies, with the All-Star Game patch the team sported on their jersey's for opening day noticeably sewn over.", "url": "https://www.cnn.com/2021/04/04/us/atlanta-braves-all-star-patch/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404153540-01-atlanta-braves-0403-super-tease.jpg", "publishedAt": "2021-04-04T20:23:59Z", "content": "(CNN)The Atlanta Braves altered their uniforms Saturday ahead of their game against the Philadelphia Phillies, with the All-Star Game patch the team sported on their jersey's for opening day noticeab… [+1401 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chuck Johnston and Alexis Benveniste, CNN Business", "title": "Delta opens middle seats ahead of schedule in response to flight cancellations", "description": "Citing several contributing factors, Delta Air Lines canceled approximately 100 flights Sunday.", "url": "https://www.cnn.com/2021/04/04/business/delta-flight-cancellations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404144222-delta-airline-file-super-tease.jpg", "publishedAt": "2021-04-04T20:15:20Z", "content": "New York (CNN Business)Citing several contributing factors, Delta Air Lines(DAL) canceled approximately 100 flights Sunday.\r\n\"Delta teams have been working through various factors, including staffing… [+1896 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "More than 500 million Facebook users' personal data leaked online", "description": "The personal information of about half a billion Facebook users, including their phone numbers, have been posted to a website used by hackers, cybersecurity experts say.", "url": "https://www.cnn.com/videos/business/2021/04/04/500-million-facebook-user-personal-data-leaked-online-osullivan-nr-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210315123831-facebook-super-tease.jpg", "publishedAt": "2021-04-04T20:09:03Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Claudia Rebaza, Jaide Timm-Garcia and Caitlin Hu, CNN", "title": "Argentina's President tests positive for Covid after vaccine", "description": "He said he'd take the Covid-19 vaccine first, as a role model for the rest of Argentina. A little over two months after receiving the Russian-made Sputnik V, Argentinian President Alberto Fernández has tested positive for the coronavirus.", "url": "https://www.cnn.com/2021/04/04/americas/argentina-alberto-fernndez-covid-19-sputnik-vaccine-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210327095856-alberto-fernndez-y-cfk-super-tease.jpg", "publishedAt": "2021-04-04T20:07:15Z", "content": "(CNN)He said he'd take the Covid-19 vaccine first, as a role model for the rest of Argentina. A little over two months after receiving the Russian-made Sputnik V, Argentinian President Alberto Fernán… [+3348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donie O'Sullivan, CNN Business", "title": "Half a billion Facebook users' information posted on hacking website, cyber experts say", "description": "The personal information of about half a billion Facebook users, including their phone numbers, have been posted to a website used by hackers, cybersecurity experts say.", "url": "https://www.cnn.com/2021/04/04/tech/facebook-user-info-leaked/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200922145804-01-facebook-phone-laptop---stock-super-tease.jpg", "publishedAt": "2021-04-04T18:31:58Z", "content": "New York (CNN Business)The personal information of about half a billion Facebook users, including their phone numbers, have been posted to a website used by hackers, cybersecurity experts say. \r\nTher… [+1647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "A man won $100,000 in the lottery two weeks after winning $5,000", "description": "A North Carolina man who won $5,000 with a scratch-off lottery ticket said he was \"extremely happy and surprised\" to learn he'd won another $100,000 just two weeks later.", "url": "https://www.cnn.com/2021/04/04/us/man-wins-lottery-twice-in-two-weeks-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404123605-man-wins-100000-lottery-two-weeks-trnd-super-tease.jpg", "publishedAt": "2021-04-04T17:47:25Z", "content": "(CNN)A North Carolina man who won $5,000 with a scratch-off lottery ticket said he was \"extremely happy and surprised\" to learn he'd won another $100,000 just two weeks later.\r\nHenry Harvey II, a sto… [+652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hoffman and Devan Cole, CNN", "title": "Hunter Biden says he's 'absolutely certain' he'll be cleared of wrongdoing in DOJ probe into business dealings", "description": "Hunter Biden says he is fully cooperating with the Justice Department's investigation into his business dealings in China and predicted that he will be cleared of any wrong doing in the probe.", "url": "https://www.cnn.com/2021/04/04/politics/hunter-biden-doj-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402131357-hunter-biden-cbs-interview-super-tease.jpg", "publishedAt": "2021-04-04T17:25:16Z", "content": "Washington (CNN)Hunter Biden says he is fully cooperating with the Justice Department's investigation into his business dealings in China and predicted that he will be cleared of any wrong doing in t… [+3414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "The Bidens encourage Americans to get vaccinated in Easter message", "description": "President Joe Biden and first lady Jill Biden shared well-wishes with Americans celebrating Easter on Sunday and encouraged them to get Covid-19 vaccinations as a moral obligation.", "url": "https://www.cnn.com/2021/04/04/politics/biden-easter-message-covid-vaccine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404113530-biden-easter-video-210404-super-tease.jpg", "publishedAt": "2021-04-04T17:03:13Z", "content": "(CNN)President Joe Biden and first lady Jill Biden shared well-wishes with Americans celebrating Easter on Sunday and encouraged them to get Covid-19 vaccinations as a moral obligation.\r\n\"We share th… [+2715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Harry Enten, CNN", "title": "Why Republicans can claim to be the party of the White working class", "description": "Iowa Democrat Rita Hart decided this week to withdraw her challenge to her defeat in Iowa's 2nd Congressional District last year. Her six-vote loss to Republican Rep. Mariannette Miller-Meeks capped off a successful year for Iowa Republicans who won the presi…", "url": "https://www.cnn.com/2021/04/04/politics/republicans-white-working-class-education/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402224728-republican-national-convention-2020-file-restricted-super-tease.jpg", "publishedAt": "2021-04-04T17:00:38Z", "content": "(CNN)Iowa Democrat Rita Hart decided this week to withdraw her challenge to her defeat in Iowa's 2nd Congressional District last year. Her six-vote loss to Republican Rep. Mariannette Miller-Meeks ca… [+5552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "A loose cow trotting along an Atlanta-area interstate ties up traffic for an hour", "description": "Atlanta-area drivers are used to sitting in traffic, but for those on Interstate 285 this weekend, the cause for their delay was unusual: a loose cow on the highway.", "url": "https://www.cnn.com/2021/04/04/us/loose-cow-interstate-atlanta-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404105447-loose-cow-interstate-atlanta-trnd-super-tease.jpg", "publishedAt": "2021-04-04T16:09:11Z", "content": "This morning, officers responded to a cow running on I-285 in Dunwoody. It was determined the cow fell out of a trailer and began running down the interstate. With the assistance of a citizen with a … [+158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Omar: Boycotts have 'allowed for justice' from civil rights to ending apartheid", "description": "Minnesota Rep. Ilhan Omar on Sunday said Major League Baseball's decision to pull its all-star game from Atlanta in response to Georgia's new restrictive voting law adds to a history of boycotts that have pushed for justice.", "url": "https://www.cnn.com/2021/04/04/politics/ilhan-omar-georgia-voting-boycott-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404102238-ilhan-omar-210311-super-tease.jpg", "publishedAt": "2021-04-04T16:05:37Z", "content": "(CNN)Minnesota Rep. Ilhan Omar on Sunday said Major League Baseball's decision to pull its all-star game from Atlanta in response to Georgia's new restrictive voting law adds to a history of boycotts… [+3766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Omar: Boycotts have 'allowed for justice' from civil rights to ending apartheid", "description": "Minnesota Rep. Ilhan Omar on Sunday said Major League Baseball's decision to pull its all-star game from Atlanta in response to Georgia's new restrictive voting law adds to a history of boycotts that have pushed for justice.", "url": "https://www.cnn.com/2021/04/04/politics/ilhan-omar-georgia-voting-boycott-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404102238-ilhan-omar-210311-super-tease.jpg", "publishedAt": "2021-04-04T16:05:37Z", "content": "(CNN)Minnesota Rep. Ilhan Omar on Sunday said Major League Baseball's decision to pull its all-star game from Atlanta in response to Georgia's new restrictive voting law adds to a history of boycotts… [+3766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "How long will coronavirus vaccines protect people?", "description": "There's news that coronavirus vaccines protect people for at least six months and likely longer. But how about the variants?", "url": "https://www.cnn.com/2021/04/04/health/covid-vaccine-protection-lasting-variants-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401061941-01-moderna-covid-19-vaccine-texas-0329-super-tease.jpg", "publishedAt": "2021-04-04T15:53:57Z", "content": "(CNN)Ian Haydon helped test Moderna's coronavirus vaccine last year. Now, he's helping test the tweaked version of that vaccine designed to fight a new, more contagious variant.\r\n\"A year ago I tried … [+7265 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story from Reuters", "title": "Floods, landslides, kill dozens in Indonesia and East Timor", "description": "Flash floods unleashed by torrential rains killed 41 people on the Indonesian island of Flores on Sunday, the disaster management agency BNPB said, and at least three more were reported killed in neighbouring East Timor.", "url": "https://www.cnn.com/2021/04/04/asia/floods-landslides-indonesia-east-timor-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404105858-01-floods-landslides-indonesia-east-timor-intl-super-tease.jpg", "publishedAt": "2021-04-04T15:28:18Z", "content": "Jakarta, Indonesia (CNN)Flash floods unleashed by torrential rains killed 41 people on the Indonesian island of Flores on Sunday, the disaster management agency BNPB said, and at least three more wer… [+710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Mississippi GOP governor pushes back on vaccine passports: 'I don't think it's a good thing to do in America'", "description": "Mississippi's Republican governor said Sunday that he doesn't support the potential use of so-called Covid-19 vaccine passports in his state, calling the credentials that could be key to a return to normalcy by the end of the year unnecessary.", "url": "https://www.cnn.com/2021/04/04/politics/tate-reeves-vaccine-passports-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210307101243-ms-gov-tate-reeves-super-tease.jpg", "publishedAt": "2021-04-04T15:23:40Z", "content": "Washington (CNN)Mississippi's Republican governor said Sunday that he doesn't support the potential use of so-called Covid-19 vaccine passports in his state, calling the credentials that could be key… [+2077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey, CNN", "title": "How to watch the 27th Annual SAG Awards", "description": "The 27th Annual Screen Actors Guild Awards, which honor achievement in film and television performances for 2020, will take place this weekend after multiple delays due to the coronavirus pandemic.", "url": "https://www.cnn.com/2021/04/04/entertainment/sag-awards/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200119215055-38-sag-awards-2020-red-carpet-style-super-tease.jpg", "publishedAt": "2021-04-04T14:58:57Z", "content": "(CNN)The 27th Annual Screen Actors Guild Awards, which honor achievement in film and television performances for 2020, will take place this weekend after multiple delays due to the coronavirus pandem… [+1337 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Biden calls his infrastructure plan bold. Bernie Sanders says more work must be done", "description": "President Joe Biden's roughly $2 trillion jobs proposal that is focused on infrastructure and the climate crisis is a \"serious proposal,\" Sen. Bernie Sanders said Sunday, but more work must be done on the plan to ensure it addresses major issues concerning th…", "url": "https://www.cnn.com/2021/04/04/politics/bernie-sanders-jennifer-granholm-infrastructure-plan-biden-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210324150649-bernie-sanders-donald-trump-twitter-ban-stelter-sot-nr-vpx-00001404-super-tease.jpeg", "publishedAt": "2021-04-04T14:53:04Z", "content": "Washington (CNN)President Joe Biden's roughly $2 trillion jobs proposal that is focused on infrastructure and the climate crisis is a \"serious proposal,\" Sen. Bernie Sanders said Sunday, but more wor… [+4045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Brooke Baldwin, Anchor", "title": "Brooke Baldwin: These women inspired me in the year since Covid-19 knocked me flat", "description": "Through all the body aches and sweat-soaked sheets and golf-ball sized glands, I learned a lot about vulnerability and connection. Being sick and weak was awful, but it did give me clarity about what I value in life, writes CNN anchor Brooke Baldwin.", "url": "https://www.cnn.com/2021/04/04/opinions/huddle-women-support-network-year-since-covid-baldwin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210403125208-02-brooke-baldwin-oped-super-tease.jpg", "publishedAt": "2021-04-04T14:20:46Z", "content": "Brooke Baldwin anchors the 2-4 p.m. edition of CNN Newsroom, based in New York. She is the author of the forthcoming book \"Huddle: How Women Unlock Their Collective Power.\" The views expressed here b… [+10043 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "How much further will fame, spectacle and controversy get Donald Trump?", "description": "Was there anyone in the world who believed that the attention-grabbing machine of Donald Trump would suddenly stop when he left the White House, asks Michael D'Antonio. \"Of course, some of the sprockets and springs are loose and broken. But the sputtering spe…", "url": "https://www.cnn.com/2021/04/04/opinions/donald-trump-controversies-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401105556-the-point-trump-post-presidency-super-tease.jpg", "publishedAt": "2021-04-04T14:12:15Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author with Peter Eisner of the book \"High Crimes: The Corruption, Impunity, and Impeachment… [+6461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Sara Ashley O'Brien, CNN Business", "title": "Amazon is on edge over Alabama union vote", "description": "For more than two decades, Amazon has bulldozed over bricks-and-mortar businesses, hired and churned through vast numbers of workers and even pitted cities against each other to bid for its second headquarters, all in service to its seemingly bottomless thirs…", "url": "https://www.cnn.com/2021/04/04/tech/amazon-tweets-bessemer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210403142125-01-amazon-bessemer-alabama-0330-super-tease.jpg", "publishedAt": "2021-04-04T14:08:26Z", "content": "New York (CNN Business)For more than two decades, Amazon has bulldozed over bricks-and-mortar businesses, hired and churned through vast numbers of workers and even pitted cities against each other t… [+7670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells, CNN", "title": "Virginia Beach police ask for the public's help after a triple shooting", "description": "A triple shooting in Virginia Beach, Virginia, left one person dead and two others injured Saturday night, police said.", "url": "https://www.cnn.com/2021/04/04/us/virginia-beach-triple-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404082505-virginia-beach-shootings-super-tease.jpg", "publishedAt": "2021-04-04T13:43:49Z", "content": "(CNN)A triple shooting in Virginia Beach, Virginia, left one person dead and two others injured Saturday night, police said. \r\nA caller reported gunfire in the 1600 block of Hiawatha Drive around 10 … [+1670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Start your week smart: Homicides, George Floyd, Beer Day, stimulus, robocalls", "description": "Here's what you need to know to Start Your Week Smart.", "url": "https://www.cnn.com/2021/04/04/us/five-things-april-4-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402185902-11-coronavirus-gallery-update-0307-super-tease.jpg", "publishedAt": "2021-04-04T13:26:44Z", "content": "The trial of Derek Chauvin enters week two on Monday. Last week, jurors heard from several people who witnessedGeorge Floyd's arrest in May last year. Some cried while describing their attempts to in… [+1382 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Saba Hamedy, CNN", "title": "The Great Depression led to many of the hobbies we enjoy now. The pandemic created a whole host of new ones", "description": "In the 1930s, it was the game of Bridge that kept people busy during the Great Depression.", "url": "https://www.cnn.com/2021/04/04/us/pandemic-hobbies-great-depression-wellness-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210328234048-04-pandemic-hobbies-super-tease.jpg", "publishedAt": "2021-04-04T11:54:59Z", "content": "(CNN)In the 1930s, it was the game of Bridge that kept people busy during the Great Depression. \r\nIn 2020, during the global pandemic, it was \"Animal Crossing.\"\r\nIt's no surprise that the pandemic ha… [+5701 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "The year that never ended", "description": "It was clearer than ever this week that we're still coming to terms with the trauma of 2020: a deadly pandemic, an economic plunge, a reckoning over race and a fraught election. In a Minneapolis courtroom, witnesses relived the pain of George Floyd's public d…", "url": "https://www.cnn.com/2021/04/04/opinions/the-year-that-never-ended-opinion-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401233403-george-floyd-death-details-coping-wellness-file-super-tease.jpg", "publishedAt": "2021-04-04T11:54:44Z", "content": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)The word \"trauma\" made its way into th… [+14833 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/fernando-alfonso-iii\">Fernando Alfonso III</a>, CNN", "title": "The latest on the coronavirus pandemic and vaccines", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-04-04-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-04-04T11:43:13Z", "content": "More than 161 million Covid-19 vaccine doses have been administered in the US, according to data published Saturday by the Centers for Disease Control and Prevention. \r\nThe CDC reported 161,688,422 a… [+402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by John Harwood", "title": "Democrats have a chance to invest in economic growth for all after years of frustration", "description": "For decades, Democrats and their economic advisers have agreed: broadly-shared growth requires more government investment. They've just lacked the power to invest.", "url": "https://www.cnn.com/2021/04/04/politics/democrats-economy-joe-biden-infrastructure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210331165419-03-biden-infrastructure-0331-super-tease.jpg", "publishedAt": "2021-04-04T11:02:02Z", "content": "(CNN)For decades, Democrats and their economic advisers have agreed: broadly-shared growth requires more government investment. They've just lacked the power to invest.\r\nThat's why President Joe Bide… [+5800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eoin McSweeney, CNN", "title": "UK government proposes pilots for Covid-19 passports as way out of lockdown", "description": "The UK government plans to trial Covid-19 passports at snooker tournaments, comedy clubs and football games over the coming weeks, it said Saturday.", "url": "https://www.cnn.com/2021/04/04/uk/covid-passport-pilots-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404040847-boris-johnson-0329-super-tease.jpg", "publishedAt": "2021-04-04T10:58:32Z", "content": "(CNN)The UK government says it plans to trial Covid-19 passports at snooker tournaments, comedy clubs and soccer matches over the coming weeks. \r\nAs the country reopens, ministers hope the \"covid-sta… [+3310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "He was lured to his death in a secluded park. In a pandemic, dating can be deadly for LGBTQ+ people", "description": "David P. was a 42-year-old gay man living in Beveren, Belgium. He worked as a crane operator, was loved by his family and friends and, a few weeks ago, he was found dead in an abandoned park.", "url": "https://www.cnn.com/2021/04/04/europe/belgium-david-p-murder-lgbtq-pandemic-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402133517-01-belgium-david-p-murder-0313-restricted-super-tease.jpg", "publishedAt": "2021-04-04T10:52:30Z", "content": "(CNN)David P. was a 42-year-old gay man living in Beveren, Belgium. He worked as a crane operator, was loved by his family and friends and, a few weeks ago, he was found dead in an abandoned park.\r\nT… [+8513 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "High fees and pricey cowboy boots: Why crypto spending isn't about to go mainstream", "description": "Last month, I set out to buy my father, an avid Before the Bell reader, a non-fungible token, or NFT.", "url": "https://www.cnn.com/2021/04/04/investing/stocks-week-ahead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402124905-digital-cryptocurrencies-bitcoin-ethereum-file-restricted-super-tease.jpg", "publishedAt": "2021-04-04T10:18:49Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.\r\nLondon (CNN Business)Last month, I set out to buy my father, an avid… [+6144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "The Rev. James Martin, Special to CNN", "title": "What Easter teaches us about heaven", "description": "Believing in the afterlife is a significant problem even for some devout believers, writes the Rev. James Martin. But Easter offers proof.", "url": "https://www.cnn.com/2021/04/04/opinions/easter-heaven-lessons-martin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160324132701-04-holy-week-around-the-world-0324-super-tease.jpg", "publishedAt": "2021-04-04T10:04:06Z", "content": "The Rev. James Martin is a Jesuit priest and editor at large at America magazine. This column includes excerpts from Martin's book, \"Seven Last Words.\" The views expressed in this column belong to Ma… [+6041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Cuomo's uncertain future adds fuel to a generational upheaval in New York", "description": "The last time New York Gov. Andrew Cuomo's name was on a primary ballot, in September 2018, more than 65% of Democratic voters backed him for a third term. In a defiant news conference the day after the vote, Cuomo brushed back suggestions that a progressive …", "url": "https://www.cnn.com/2021/04/04/politics/cuomo-new-york-politics-future/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200324110407-01-cuomo-presser-0324-screengrab-super-tease.jpg", "publishedAt": "2021-04-04T10:01:34Z", "content": "(CNN)The last time New York Gov. Andrew Cuomo's name was on a primary ballot, in September 2018, more than 65% of Democratic voters backed him for a third term. In a defiant news conference the day a… [+19327 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicquel Terry Ellis, CNN", "title": "Black families still reeling from verdicts in police brutality cases warn justice is not promised in Chauvin trial", "description": "Tiffany Crutcher still remembers the numbness she felt when a jury announced it was acquitting the Tulsa police officer charged with manslaughter in her twin brother Terence Crutcher's death.", "url": "https://www.cnn.com/2021/04/04/us/black-families-derek-chauvin-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210330161928-01-valerie-castile-file-super-tease.jpg", "publishedAt": "2021-04-04T09:07:41Z", "content": "By Nicquel Terry Ellis, CNN\r\nUpdated 5:07 AM ET, Sun April 4, 2021\r\n (CNN)Tiffany Crutcher still remembers the numbness she felt when a jury announced it was acquitting the Tulsa police officer charg… [+8869 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory McNamee, CNN", "title": "Neil deGrasse Tyson on stars, Santa's location and jokes for third graders", "description": "The famed astrophysicist Neil deGrasse Tyson, director of the Hayden Planetarium at the American Museum of Natural History, asks how many planets out there might harbor life forms -- and when they might visit -- in his new book, \"Cosmic Queries.\"", "url": "https://www.cnn.com/2021/04/04/world/neil-degrasse-tyson-cosmic-queries-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181201220327-01-neil-degrasse-tyson-file-super-tease.jpg", "publishedAt": "2021-04-04T07:09:13Z", "content": "(CNN)Neil deGrasse Tyson is a man of many parts, constantly on the go. In his day job, he is the director of the Hayden Planetarium at the American Museum of Natural History in New York, as well as a… [+6666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Trent, CNN", "title": "The pandemic forced her church to hold virtual services, but she still wears her Sunday best", "description": "The pandemic has not stopped one woman in Tulsa, Oklahoma, from wearing her Sunday best to church -- even though services in the last year have been virtual.", "url": "https://www.cnn.com/2021/04/04/us/woman-dresses-virtual-church-tulsa-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210331164835-02-woman-dresses-virtual-church-tulsa-trnd-super-tease.jpg", "publishedAt": "2021-04-04T05:01:14Z", "content": "(CNN)The pandemic has not stopped one woman in Tulsa, Oklahoma, from wearing her Sunday best to church -- even though services in the last year have been virtual.\r\nLa Verne Wimberly, 82, has posted p… [+710 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, Arlette Saenz, Jake Tapper and Maggie Fox, CNN", "title": "US government moves AstraZeneca out of vaccine plant that suffered contamination", "description": "The federal government moved to stop any further risk of contamination at a Baltimore contract vaccine manufacturer where 15 million potential doses of Johnson & Johnson vaccine were spoiled last month, telling rival drugmaker AstraZeneca it must move its pro…", "url": "https://www.cnn.com/2021/04/03/politics/covid-vaccine-emergent-hhs-astrazeneca-johnson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210308165622-johnson-vaccine-vls-super-tease.jpg", "publishedAt": "2021-04-04T03:58:45Z", "content": "(CNN)The federal government has moved to stop any further risk of contamination at a Baltimore contract vaccine manufacturer where 15 million potential doses of Johnson &amp; Johnson vaccine were spo… [+4843 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: March Madness 2021", "description": "The NCAA Tournament has seen some amazing buzzer-beaters over the years. Jalen Suggs just added a new one to the collection.", "url": "https://www.cnn.com/2021/03/18/us/gallery/march-madness-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210403233942-22-mens-final-four-super-tease.jpg", "publishedAt": "2021-04-04T03:56:07Z", "content": "Gonzaga's Jalen Suggs shoots a long 3-pointer to beat UCLA at the Final Four on Saturday. The buzzer-beater gave the Bulldogs a 93-90 overtime win.\r\nUpdated 11:56 PM ET, Sat April 3, 2021\r\nGonzaga's … [+1136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Ly, CNN", "title": "Rapper DMX is hospitalized and on life support following heart attack, longtime lawyer says", "description": "Rapper DMX is hospitalized and on life support at a hospital in White Plains, New York, his longtime attorney Murray Richman confirmed to CNN.", "url": "https://www.cnn.com/2021/04/03/us/dmx-hospitalized-life-support-heart-attack/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210403213641-01-dmx-file-2006-super-tease.jpg", "publishedAt": "2021-04-04T01:57:32Z", "content": "(CNN)Rapper DMX is hospitalized and on life support at a hospital in White Plains, New York, his longtime attorney Murray Richman confirmed to CNN.\r\nThe rapper suffered a heart attack Friday around 1… [+776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alaa Elassar and Sarah-Grace Mankarious, CNN", "title": "Ancient mummies are paraded through the streets of Cairo", "description": "Ancient mummies of Egypt's royal pharaohs emerged from their resting places Saturday and were paraded through the streets of Cairo in search of a new home.", "url": "https://www.cnn.com/travel/article/egypt-mummies-cairo-parade/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210403195302-02-egypt-mummies-cairo-parade-0403-super-tease.jpg", "publishedAt": "2021-04-04T01:44:52Z", "content": "(CNN) Ancient mummies of Egypt's royal pharaohs emerged from their resting places Saturday and were paraded through the streets of Cairo to a new home.\r\nWhat sounds like the plot of a movie was part … [+3357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "What it would take for the GOP to dump Gaetz", "description": "Julian Zelizer writes, \"This scandal has developed at a breakneck speed. But will his career come to an end? And will the GOP take a hit as a result?\"", "url": "https://www.cnn.com/2021/04/03/opinions/matt-gaetz-political-scandals-gop-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210331140547-01-matt-gaetz-file-2020-super-tease.jpg", "publishedAt": "2021-04-04T01:25:53Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the book, \"Burning Down the House: Newt Gingrich, the Fall of a Speaker, an… [+7286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Westcott, CNN", "title": "Australia's first international cricket team found fame in the UK. At home, they were betrayed", "description": "Until recently, most Australians didn't know anything about the journey that took 13 Aboriginal cricketers from farmsteads in Victoria to England in 1868 -- making them Australia's first sporting team to play overseas.", "url": "https://www.cnn.com/2021/04/03/australia/aboriginal-cricket-team-first-xi-dst-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210326144535-20210326-first-australia-aboriginal-cricket-team-illustration-super-tease.jpg", "publishedAt": "2021-04-04T00:28:30Z", "content": "Harrow, Australia (CNN)Growing up in the small community of Harrow in southern Australia, 86-year-old Lachie Turner spent his childhood hearing legends of the great Aboriginal cricketer Johnny Mullag… [+19461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Mena", "title": "Rep. Joaquin Castro: Security and public access must be balanced at Capitol after deadly attacks", "description": "Rep. Joaquin Castro, a member of the House Foreign Affairs and Intelligence Committees, said that when it comes to the security surrounding the US Capitol complex, there needs to be a balance between \"safety and transparency.\"", "url": "https://www.cnn.com/2021/04/03/politics/joaquin-castro-capitol-security-car-attack-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210402134446-02-capitol-security-threat-0402-super-tease.jpg", "publishedAt": "2021-04-04T00:18:40Z", "content": "(CNN)Rep. Joaquin Castro, a member of the House Foreign Affairs and Intelligence Committees, said that when it comes to the security surrounding the US Capitol complex, there needs to be a balance be… [+1201 chars]"}]}