{"status": "ok", "totalResults": 113, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "These stocks could get much cheaper", "description": "A single share of Amazon and Google owner Alphabet each trades at nearly $3,000 -- a pretty high price for average investors. But that will soon change: The companies will split their shares, reducing their stock prices sharply, in the next few months.", "url": "https://www.cnn.com/2022/03/11/investing/stock-splits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311083618-chipotle-store-file-super-tease.jpg", "publishedAt": "2022-03-11T16:42:32Z", "content": "New York (CNN Business)A single share of Amazon and Google owner Alphabet each trades at nearly $3,000 -- a pretty high price for average investors. But that will soon change: The companies will spli… [+3320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Geneva Sands, CNN", "title": "Immigration arrests in the US plunge under Biden administration, data show", "description": "Immigration arrests in the United States have plunged under President Joe Biden compared to his predecessor, who cast a wide net of who was eligible to be taken into custody, according to Immigration and Customs Enforcement data released Friday.", "url": "https://www.cnn.com/2022/03/11/politics/immigration-arrests-plunge-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180110144256-ice-agent-file-super-tease.jpg", "publishedAt": "2022-03-11T16:20:00Z", "content": "(CNN)Immigration arrests in the United States have plunged under President Joe Biden compared to his predecessor, who cast a wide net of who was eligible to be taken into custody, according to Immigr… [+3119 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrei Kolesnikov", "title": "In Moscow, McDonald's packs up, radio falls silent and the brain drain begins", "description": "The closure of McDonald's in Russia is about more than Big Macs, writes Andrei Kolesnikov. \"Thirty years after the collapse of the Soviet Union, we are not moving forward toward a normal market as it was in the 1990s, but back toward a primitive economy and w…", "url": "https://www.cnn.com/2022/03/11/opinions/moscow-mcdonalds-russia-global-brands-kolesnikov/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310101016-01-mcdonalds-russia.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T16:17:18Z", "content": "Editors Note: Andrei Kolesnikov is a senior fellow at the Carnegie Endowment for International Peace. He is the author of several books on the political and social history of Russia, including a biog… [+5868 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "This is no time to drop the ball on Covid-19", "description": "The failure to include a $15.6 billion pandemic aid package in the omnibus spending bill the House passed on Wednesday is a collective mistake that could come back to haunt us.", "url": "https://www.cnn.com/2022/03/11/opinions/covid-relief-funding-spending-bill-omnibus-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309163550-u-s-capitol-0309-super-tease.jpg", "publishedAt": "2022-03-11T16:00:40Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the forthcoming book \"The Presidency of Donald J. Trump: A First Historical… [+4645 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "Inflation, gas prices and the Russia-Ukraine conflict are weighing on America's consumers", "description": "American consumers are getting pummeled from all sides: Supply chain constraints and high demand mean delays for products and rising costs. Now gas prices are soaring on the back of the Russia-Ukraine conflict, creating an even more bitter cocktail.", "url": "https://www.cnn.com/2022/03/11/economy/march-consumer-sentiment/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311030033-gas-pump-03032022-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T15:55:33Z", "content": "American consumers are getting pummeled from all sides: Supply chain constraints and high demand mean delays for products and rising costs. Now gas prices are soaring on the back of the Russia-Ukrain… [+1579 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Ukraine halts half of world's neon output for chips, clouding outlook", "description": "Ukraine's two leading suppliers of neon, which produce about half the world's supply of the key ingredient for making chips, have halted their operations as Moscow has sharpened its attack on the country, threatening to raise prices and aggravate the semicond…", "url": "https://www.cnn.com/2022/03/11/tech/ukraine-neon-chips/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220127155659-01-semiconductor-file-2021-restricted-super-tease.jpeg", "publishedAt": "2022-03-11T15:49:19Z", "content": "(CNN Business)Ukraine's two leading suppliers of neon, which produce about half the world's supply of the key ingredient for making chips, have halted their operations as Moscow has sharpened its att… [+4184 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine Thorbecke, CNN Business", "title": "The US dollar could go digital. Here's what you need to know", "description": "As technology continues to revolutionize the way people live, work and spend, central banks around the globe have kicked off efforts to reinvent their local currencies for the digital era. Now, the United States is the latest to signal \"urgency\" in researchin…", "url": "https://www.cnn.com/2022/03/11/tech/us-digital-dollar-cbdc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309153401-us-dollar-cryptocurrencies-file-super-tease.jpg", "publishedAt": "2022-03-11T15:31:09Z", "content": "(CNN Business)As technology continues to revolutionize the way people live, work and spend, central banks around the globe have kicked off efforts to reinvent their local currencies for the digital e… [+6466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Bobbie Nelson, musician and Willie Nelson's beloved sister, dead at 91", "description": "Musician Bobbie Nelson, a pianist, bandmate and the beloved sister of singer Willie Nelson, has died at the age of 91.", "url": "https://www.cnn.com/2022/03/11/entertainment/willie-nelson-sister-bobbie-nelson-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311090956-01-bobbie-nelson-2018-super-tease.jpg", "publishedAt": "2022-03-11T15:29:43Z", "content": "(CNN)Musician Bobbie Nelson, a pianist, bandmate and the beloved sister of singer Willie Nelson, has died at the age of 91. \r\nNelson posted a heartfelt statement about his sister's passing to his Ins… [+874 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Abbas Al Lawati, CNN", "title": "Could Middle East nations come to the rescue as the Ukraine war drives up oil prices?", "description": "The UAE suggested that it may support an increase in oil output within the framework of OPEC+. We ask energy expert Amena Bakr how likely that is to happen.", "url": "https://www.cnn.com/2022/03/11/middleeast/mideast-summary-03-11-2022-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311095911-01-oil-tankers-dammam-port-file-super-tease.jpg", "publishedAt": "2022-03-11T15:16:20Z", "content": "Abu Dhabi, UAE (CNN)A bombshell announcement by a United Arab Emirates diplomat on Wednesday raised hopes that Gulf oil producers might come to the rescue as oil prices climbed to an eight-year high … [+9594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Blake, CNN", "title": "She had a near-death experience because of Covid. But it wasn't a glimpse of an afterlife that changed her", "description": "Two years into the pandemic, there's no single story of surviving severe Covid that can speak for everyone. But for people like Paige Deiner, a brush with death led to a spiritual transformation she never anticipated.", "url": "https://www.cnn.com/2022/03/11/us/best-in-us-covid-survivor-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310131044-01-covid-survivor-best-in-us-super-tease.jpg", "publishedAt": "2022-03-11T14:46:10Z", "content": "Two years ago, Covid-19 turned the world upside down. While the pandemic is not over, The Best in Us is a series that highlights people whose pandemic stories exemplify the resilience of the human sp… [+7903 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Style icon Iris Apfel launches H&M collection to celebrate 100th birthday", "description": "H&M has unveiled its \"playfully over-the-top\" collaboration with renowned interior designer and longtime fashion influencer Iris Apfel.", "url": "https://www.cnn.com/style/article/iris-apfel-hm-collaboration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311114607-hm-iris-apfel-2-super-tease.jpg", "publishedAt": "2022-03-11T14:41:39Z", "content": "H&amp;M has unveiled its \"playfully over-the-top\" collaboration with renowned interior designer and longtime style icon Iris Apfel, releasing images of the long-awaited collection on Wednesday. \r\nThe… [+1971 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "'I've come of age': Smitten Kyrgios turns up heat at Indian Wells", "description": "A smiling, smitten Nick Kyrgios said he has never felt better following his first round win at Indian Wells - and made it clear girlfriend Costeen Hatzi is a big reason why he feels he has come of age.", "url": "https://www.cnn.com/2022/03/11/tennis/nick-kyrgios-indian-wells-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311142844-kyrgios-tease.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T14:36:11Z", "content": "A smiling, smitten Nick Kyrgios said he has never felt better following his first round win at Indian Wells - and made it clear girlfriend Costeen Hatzi is a big reason why he feels he has come of ag… [+2044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Nick Cannon speaks out on his talk show being canceled", "description": "\"The Nick Cannon Show\" will finish out its first season but will not return for a second.", "url": "https://www.cnn.com/2022/03/11/entertainment/nick-cannon-talk-show/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210621043854-nick-cannon-2019-file.jpg?q=x_3,y_316,h_1629,w_2894,c_crop/w_800", "publishedAt": "2022-03-11T14:31:33Z", "content": "The Nick Cannon Show will finish out its first season but will not return for a second.\r\nOn Thursday Cannon spoke about his talk show cancellation, calling it the business part television.\r\nIts inter… [+799 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elaine Maag for CNN Business Perspectives", "title": "Prices just keep rising. It's time to revive the enhanced child tax credit", "description": "Over the past several months, consumer prices have risen across the board, especially for basic needs like food, gas and shelter. And low- and middle-income families are getting hit the hardest. Not only do they spend a larger share of their income meeting ba…", "url": "https://www.cnn.com/2022/03/11/perspectives/enhanced-child-tax-credit-inflation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220126235705-01-child-tax-credit.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T14:14:23Z", "content": "Editors Note: Elaine Maag is a senior fellow at the UrbanBrookings Tax Policy Center in Washington, D.C. The opinions expressed in this commentary are her own. \r\nOver the past several months, consume… [+3882 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How the Ukrainian rail system was able to move 90,000 people per day", "description": "The Ukrainian rail system has been a pivotal part of the safety of many refugees, transporting around 90,000 people per day. The CEO of the Ukrainian government-owned rail transport system joins CNN's New Day to discuss how this was accomplished.", "url": "https://www.cnn.com/videos/intl_business/2022/03/11/ukrainian-rail-system-ceo-transport-refugees-marquardt-intv-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220228175839-crowded-ukraine-train-station-super-tease.jpeg", "publishedAt": "2022-03-11T13:44:55Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Gianluca Mezzofiore, Paul Murphy and Laura Smith-Spark, CNN", "title": "Russia widens attack on Ukraine's cities, striking western airfields and Dnipro", "description": "Russian forces launched multiple missile attacks on a wide range of targets across Ukraine in the early hours of Friday, striking airfields in the far west of the country and, for the first time, hitting the central city of Dnipro, to which Ukrainians from ot…", "url": "https://www.cnn.com/2022/03/11/europe/russia-invasion-ukraine-03-11-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311071620-01-dnipro-airtrike-03112022-super-tease.jpg", "publishedAt": "2022-03-11T13:30:28Z", "content": "Kyiv, Ukraine (CNN)Russian forces launched multiple missile attacks on a wide range of targets across Ukraine in the early hours of Friday, striking airfields in the far west of the country and, for … [+7614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Paul P. Murphy, Gianluca Mezzofiore and Celine Alkhaldi, CNN", "title": "The 40-mile-long Russian convoy near Kyiv has moved. Here's what it means for the Ukrainian capital", "description": "A stalled 40-mile Russian military convoy, composed of Russian tanks, armored vehicles, and towed artillery, has sparked dread as it lumbered towards the Ukrainian capital, Kyiv.", "url": "https://www.cnn.com/2022/03/11/europe/kyiv-russian-convoy-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311060454-01-russian-convoy-kyiv-ozera-super-tease.jpg", "publishedAt": "2022-03-11T13:25:49Z", "content": "Kyiv, Ukraine (CNN)A 40-mile-long (64km) Russian military convoy, composed of tanks, armored vehicles and towed artillery, has sparked dread among defending Ukrainians as it lumbered towards their ca… [+5825 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Trilivas, CNN", "title": "Best boutique hotels opening in Europe in 2022", "description": "Whether you're looking for a home away from home, a hideaway from the bustle of the city, or somewhere in the center of it all, here are some of the most stylish new European boutique boltholes to watch out for in 2022.", "url": "https://www.cnn.com/travel/article/best-european-boutique-hotels-opening-in-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310000436-04-best-boutique-hotels-europe-2022-passalacqua-super-tease.jpg", "publishedAt": "2022-03-11T13:24:49Z", "content": "(CNN) Small, intimate and well-placed, a good boutique hotel offers far more than just a place to lay your head.\r\nThe best, especially those in the charm-filled cities of Europe, exhibit local flavor… [+5690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Exiled Russian oligarch says Putin's bankers need to be blocked", "description": "Exiled Russian oligarch Mikhail Khodorkovsky, who led Russia's largest private oil company, speaks with CNN's Alex Marquardt about the Russia and Ukraine conflict and how the West can aid in ending the war.", "url": "https://www.cnn.com/videos/business/2022/03/11/russia-exiled-oligarch-putin-ukraine-war-khodorkovsky-newday-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311075321-exiled-russian-oligarch-mikhail-khodorkovsky-super-tease.jpeg", "publishedAt": "2022-03-11T13:20:51Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Review: Even Samuel L. Jackson's star power can't can't bring 'The Last Days of Ptolemy' to life", "description": "Samuel L. Jackson's considerable star power can't can't breathe life into \"The Last Days of Ptolemy Grey,\" a slow-moving Apple TV+ limited series constrained by the disjointed nature of its plot. Just securing a project featuring Jackson (who produces as well…", "url": "https://www.cnn.com/2022/03/11/entertainment/the-last-days-of-ptolemy-grey-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220307162948-01-last-days-of-ptolemy-gray-series-super-tease.jpg", "publishedAt": "2022-03-11T13:09:41Z", "content": "(CNN)Samuel L. Jackson's considerable star power can't can't breathe life into \"The Last Days of Ptolemy Grey,\" a slow-moving Apple TV+ limited series constrained by the disjointed nature of its plot… [+2472 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Some states want to give drivers a gas tax holiday. But that might not be a wise move.", "description": "As Americans reel from skyrocketing gas prices, a growing number of states are looking to provide residents with a little relief by temporarily suspending their gas taxes. Gas taxes have come under scrutiny as prices spike, fueled in part by Russia's invasion…", "url": "https://www.cnn.com/2022/03/11/politics/states-gas-tax-holiday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310143120-gas-prices-california-0225-super-tease.jpg", "publishedAt": "2022-03-11T13:00:35Z", "content": "(CNN)As Americans reel from skyrocketing gasoline prices, a growing number of states are looking to provide residents with a little relief by suspending their gas taxes.\r\nNearly all states levy taxes… [+3462 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta, CNN Chief Medical Correspondent", "title": "Dr. Sanjay Gupta: Is America ready to take the next step in its Covid-19 recovery?", "description": "As we reach the second anniversary of the World Health Organization acknowledging Covid-19 as a pandemic on March 11, 2020, we appear to be standing on the edge of the endemic phase of this global health crisis. For many, that's the moment when we hope we can…", "url": "https://www.cnn.com/2022/03/11/health/covid-endemic-pandemic-anniversary-america-patient-gupta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310214901-us-covid-mask-dc-030122-super-tease.jpg", "publishedAt": "2022-03-11T12:36:20Z", "content": "(CNN)As we reach the second anniversary of the World Health Organization acknowledging Covid-19 as a pandemic on March 11, 2020, we appear to be standing on the edge of the endemic phase of this glob… [+15757 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Isaac Bailey", "title": "I know what self-censorship on campus looks like", "description": "\"It's not about having students, faculty and staff who can recite chapter and verse about the importance of free speech law -- but have little understanding about who on campus feels most compelled to self-silence and why,\" writes Issac Bailey about self-cens…", "url": "https://www.cnn.com/2022/03/11/opinions/self-censorship-college-campus-bailey/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310161724-black-college-student-stock-super-tease.jpg", "publishedAt": "2022-03-11T12:24:56Z", "content": "Issac Bailey is a longtime journalist based in South Carolina who writes for McClatchy and the Batten Professor of Public Policy at Davidson College. He's the author of \"My Brother Moochie: Regaining… [+9314 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Missing parts, old equipment: Russia's air industry is facing a dangerous situation", "description": "As Russia's economy gets pummeled by increasingly severe western sanctions for its invasion of Ukraine, the country's crucial airline industry could soon find itself on life support.", "url": "https://www.cnn.com/2022/03/11/business/russia-airlines-sanctions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310150355-aeroflot-planes-moscow-super-tease.jpg", "publishedAt": "2022-03-11T12:08:00Z", "content": "New York (CNN Business)As Russia's economy gets pummeled by increasingly severe western sanctions for its invasion of Ukraine, the country's crucial airline industry could soon find itself on life su… [+5473 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "Biden will tout one-year anniversary of Covid-19 education funding in Philadelphia", "description": "President Joe Biden on Friday is expected to tout the one-year anniversary of signing the American Rescue Plan into law when he visits an elementary school in the Philadelphia area, a White House official told CNN.", "url": "https://www.cnn.com/2022/03/11/politics/joe-biden-philadelphia-american-rescue-plan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220304135914-01-biden-made-in-america-0304-super-tease.jpg", "publishedAt": "2022-03-11T12:03:39Z", "content": "(CNN)President Joe Biden on Friday is expected to tout the one-year anniversary of signing the American Rescue Plan into law when he visits an elementary school in the Philadelphia area, a White Hous… [+3202 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church and Don Lemon, CNN", "title": "Colin Allred: US Representative says Brittney Griner case is 'extremely concerning' ​and that her consular access ​has been blocked", "description": "Two-time US Olympic basketball gold medalist Brittney Griner has been held in Russia for three weeks \"without official government access to her​,\" says US Representative Colin Allred, adding that was \"unusual and extremely concerning.\"", "url": "https://www.cnn.com/2022/03/11/sport/brittney-griner-us-colin-allred-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310103000-01-brittney-griner-file-083121-super-tease.jpg", "publishedAt": "2022-03-11T11:45:13Z", "content": "(CNN)Two-time US Olympic basketball gold medalist Brittney Griner has been held in Russia for three weeks \"without official government access to her,\" says US Representative Colin Allred, adding that… [+3062 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for March 11: Ukraine, Pandemic, MLB, North Korea, Facebook", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/03/11/us/five-things-march-11-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311043844-mariupol-damage-03102022-super-tease.jpg", "publishedAt": "2022-03-11T11:40:31Z", "content": "(CNN) America, the \"land of the free,\" is getting quite costly. Prices for gas, food and housing -- which are all necessary expenses -- are spiking across the country. Gas prices have risen 38% over … [+7203 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Megan Ranney", "title": "Opinion: What we can learn from rows of little tombstones", "description": "A few years ago, I visited a cemetery in an old mining town in Utah. My husband and I were struck by the rows of little tombstones. Each tombstone's death date was within a few weeks of each other in the early 1900s. They were all children who had died of dip…", "url": "https://www.cnn.com/2022/03/11/opinions/covid-19-vaccine-florida-kids-ranney/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220209163215-covid-vaccine-kids-california-0119-super-tease.jpg", "publishedAt": "2022-03-11T11:28:58Z", "content": "Megan Ranney, MD, MPH, is a professor of Emergency Medicine and associate dean at the School of Public Health at Brown University. The views expressed in this commentary are her own. Read more opinio… [+5055 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Toyin Owoseje", "title": "Grimes and Elon Musk secretly welcomed their second child in December", "description": "Singer Grimes and Tesla and SpaceX CEO Elon Musk have welcomed their second child together, a daughter named Exa Dark Sideræl Musk.", "url": "https://www.cnn.com/2022/03/11/entertainment/grimes-elon-musk-second-child-intl-scli/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220311044355-grimes-musk-file-05072018.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T11:15:19Z", "content": "Singer Grimes and Tesla and SpaceX CEO Elon Musk have welcomed their second child together, a daughter named Exa Dark Sideræl Musk. \r\nThe little girl was born via surrogate in December last year, Gri… [+1629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, Kylie Atwood", "title": "Inside the quiet US diplomacy to ramp down tensions with Saudis, UAE -- and ramp up oil production", "description": "An intense, closely guarded diplomatic effort by a core team of Biden energy and national security officials to raise global oil production amid surging prices from Russia's war in Ukraine has fostered a cautious sense of optimism inside the White House.", "url": "https://www.cnn.com/2022/03/11/politics/oil-diplomacy-saudi-uae-tensions-russia-ukraine/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220306192827-us-oil-prices-022822.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T11:05:10Z", "content": "An intense, closely guarded diplomatic effort by a core team of Biden energy and national security officials to raise global oil production amid surging prices from Russias war in Ukraine has fostere… [+10750 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Woman sues Cowboys owner Jerry Jones, saying he is her father", "description": "Dallas Cowboys owner Jerry Jones is being sued by a woman who claims he is her biological father; Dallas County court documents show. The lawsuit itself has been sealed, but the motion to seal it provides some details about the claims.", "url": "https://www.cnn.com/2022/03/11/sport/woman-sues-jerry-jones-says-hes-her-father-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311094122-jerry-jones-super-tease.jpg", "publishedAt": "2022-03-11T10:15:51Z", "content": "(CNN)Dallas Cowboys owner Jerry Jones is being sued by a woman who claims he is her biological father; Dallas County court documents show. The lawsuit itself has been sealed, but the motion to seal i… [+1600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "More than 50 million people in the US are under weather alerts as a potential bomb cyclone heads east, bringing heavy snow and winds", "description": "More than 50 million people are under winter weather warnings as a powerful storm heads east after delivering snow and frigid temperatures across the central US.", "url": "https://www.cnn.com/2022/03/11/weather/winter-storm-bomb-cyclone-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310235743-03-bomb-cyclone-topeka-03102022-restricted-super-tease.jpg", "publishedAt": "2022-03-11T10:00:29Z", "content": "1245 AM Update: Areas of snow continue south of I-40 to the Mogollon Rim and White Mtns. Expect winter driving conditions on many area roads, including Hwy 87 from Winslow south to the rim, and SR 26… [+126 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and CNN's Beijing bureau", "title": "Public frustration mounts as China faces biggest Covid outbreak since 2020", "description": "China is fighting its biggest Covid-19 outbreak since the early days of the pandemic, with discontent emerging on social media as restrictions and lockdowns take their toll.", "url": "https://www.cnn.com/2022/03/11/china/china-covid-jilin-university-mic-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310213050-02-meanwhile-in-china-03-11-intl-hnk-super-tease.jpg", "publishedAt": "2022-03-11T07:25:02Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+5760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul, Swati Gupta, Vedika Sud, Esha Mitra", "title": "India's ruling party soars to election victory in country's most populous state", "description": "India's ruling Bharatiya Janata Party (BJP) has claimed victory in four key state elections including the country's most populous state, consolidating support for Prime Minister Narendra Modi and his party's Hindu nationalist agenda.", "url": "https://www.cnn.com/2022/03/11/asia/uttar-pradesh-election-result-bjp-win-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310024406-india-bjp-supporters-uttar-padesh-031022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T05:12:21Z", "content": "Indias ruling Bharatiya Janata Party (BJP) has claimed victory in four key state elections including the countrys most populous state, consolidating support for Prime Minister Narendra Modi and his p… [+4159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/julia-hollingsworth\">Julia Hollingsworth</a>, <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "Russia invades Ukraine", "description": "Ukraine said it is opening evacuation routes in several parts of the country, including some Kyiv suburbs where officials have accused Russian forces of blocking evacuation convoys. Follow here for live news updates from on the ground in Ukraine.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-03-11-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310164235-01-mariupol-destruction-0310-super-tease.jpg", "publishedAt": "2022-03-11T05:11:19Z", "content": "Ukrainian President Volodymyr Zelensky said Thursday about 100,000 people have been evacuated via humanitarian corridors over the past two days.\r\nOne of the main tasks for us today was the organizati… [+2115 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson", "title": "Russia's misinformation offensive impedes diplomatic efforts to end the war", "description": "The Russian assault on Ukraine is not just an unprovoked attack on a sovereign nation that is producing horrific destruction and civilian torment. It's also the biggest war of the modern misinformation era.", "url": "https://www.cnn.com/2022/03/11/politics/russia-misinformation-putin-lavrov-ukraine-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310214900-russian-sergey-lavrov-turkey-031022-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T05:01:17Z", "content": "The Russian assault on Ukraine is not just an unprovoked attack on a sovereign nation that is producing horrific destruction and civilian torment. Its also the biggest war of the modern misinformatio… [+9998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Kamala Harris heads to Romania in her latest push to reassure US allies over Russia", "description": "Vice President Kamala Harris ventures farther toward NATO's eastern edge Friday with a stop in Romania, a country suddenly thrust into priority position for the United States as fighting rages over its border in Ukraine.", "url": "https://www.cnn.com/2022/03/11/politics/kamala-harris-romania/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310125549-02-kamala-harris-poland-super-tease.jpg", "publishedAt": "2022-03-11T05:01:00Z", "content": "Bucharest, Romania (CNN)Vice President Kamala Harris ventures farther toward NATO's eastern edge Friday with a stop in Romania, a country suddenly thrust into priority position for the United States … [+3654 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins", "title": "Biden to announce Friday that US will move to revoke 'most favored nation' status for Russia", "description": "President Joe Biden will announce Friday that the US, along with the G7 and European Union, will call for revoking \"most favored nation\" status for Russia, referred to as permanent normal trade relations in the US, sources familiar with the move tell CNN.", "url": "https://www.cnn.com/2022/03/10/politics/russia-trade-status-us-g7-eu-biden/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211203215453-02-joe-biden-1203.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-11T03:23:42Z", "content": "President Joe Biden will announce Friday that the US, along with the G7 and European Union, will call for revoking most favored nation status for Russia, referred to as permanent normal trade relatio… [+288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Killough, CNN", "title": "Texas confirms 9 investigations of transgender minors receiving gender-affirming health care", "description": "Texas has opened nine alleged abuse investigations of minors receiving gender-affirming health care, Patrick Crimmins, a Department of Family and Protective Services (DFPS) spokesman, confirmed to CNN Thursday.", "url": "https://www.cnn.com/2022/03/10/us/texas-nine-investigations-transgender-minors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310194123-01-texas-nine-investigations-minors-gender-affirming-care-super-tease.jpg", "publishedAt": "2022-03-11T01:05:19Z", "content": "(CNN)Texas has opened nine alleged abuse investigations of minors receiving gender-affirming health care, Patrick Crimmins, a Department of Family and Protective Services (DFPS) spokesman, confirmed … [+1373 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz and Paul LeBlanc, CNN", "title": "Michael Flynn pleads the Fifth in deposition with January 6 committee", "description": "Michael Flynn, former President Donald Trump's onetime national security adviser, invoked his Fifth Amendment right during a deposition before the January 6 committee on Thursday, declining to answer the panel's questions.", "url": "https://www.cnn.com/2022/03/10/politics/michael-flynn-january-6-fifth-amendment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210118141015-01-michael-flynn-1212-super-tease.jpg", "publishedAt": "2022-03-11T00:53:32Z", "content": "Washington (CNN)Michael Flynn, former President Donald Trump's onetime national security adviser, invoked his Fifth Amendment right during a deposition before the January 6 committee on Thursday, dec… [+2407 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Garrard Conley", "title": "What conversion therapy cost me", "description": "Conversion therapy is immensely detrimental and costly in countless ways, writes Garrard Conley, who underwent the practice. \"My parents say they would give anything to take back what happened to our family, to reverse the harmful effects of conversion therap…", "url": "https://www.cnn.com/2022/03/10/opinions/conversion-therapy-lgbtq-youth-conley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310125955-conversion-therapy-file-restricted-051721-super-tease.jpg", "publishedAt": "2022-03-11T00:49:07Z", "content": "Garrard Conley is an assistant professor of creative writing at Kennesaw State University. He is the author of the memoir \"Boy Erased,\" adapted into a film of the same name. He is also the producer o… [+5325 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "Emilio Delgado, 'Sesame Street's' Luis for more than 40 years, has died", "description": "Emilio Delgado, who spent more than 40 years entertaining generations of children playing the Fix-It Shop owner Luis on \"Sesame Street,\" has died, according to his manager.", "url": "https://www.cnn.com/2022/03/10/entertainment/emilio-delgado-obituary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310171934-emilio-delgado-file-restricted-super-tease.jpg", "publishedAt": "2022-03-11T00:46:40Z", "content": "(CNN)Emilio Delgado, who spent more than 40 years entertaining generations of children playing the Fix-It Shop owner Luis on \"Sesame Street,\" has died, according to his manager.\r\n\"We are saddened by … [+1722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand", "title": "Russia using Belarus as a launch point for many air operations in Ukraine, NATO says", "description": "Russia has been using Belarus as a springboard for many of its air operations in Ukraine, according to intelligence collected by NATO surveillance planes flying over the Polish-Ukrainian border and radar seen by CNN.", "url": "https://www.cnn.com/2022/03/10/politics/nato-surveillance-flight-russia-belarus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310184616-nato-surveillance-flight-super-tease.jpg", "publishedAt": "2022-03-10T23:53:05Z", "content": "ABOARD A NATO SURVEILLANCE PLANE ABOVE THE POLISH-UKRAINIAN BORDER (CNN)Russia has been using Belarus as a springboard for many of its air operations in Ukraine, according to intelligence collected b… [+4438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Facebook and Instagram to temporarily allow calls for violence against Russians", "description": "Meta Platforms will allow Facebook and Instagram users in some countries to call for violence against Russians and Russian soldiers in the context of the Ukraine invasion, according to internal emails seen by Reuters on Thursday, in a temporary change to its …", "url": "https://www.cnn.com/2022/03/10/tech/facebook-instagram-russians/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211215154243-02-facebook-phone-stock-super-tease.jpeg", "publishedAt": "2022-03-10T23:27:41Z", "content": "Meta Platforms will allow Facebook and Instagram users in some countries to call for violence against Russians and Russian soldiers in the context of the Ukraine invasion, according to internal email… [+1893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Parents of former US Marine detained in Russia say his health has deteriorated", "description": "The parents of Trevor Reed, a US citizen detained in Russia, said Thursday that his health has taken a further turn for the worse, and they fear he will be sent to solitary confinement rather than to medical care.", "url": "https://www.cnn.com/2022/03/10/politics/trevor-reed-health-decline/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211109115651-trevor-reed-2020-super-tease.jpg", "publishedAt": "2022-03-10T23:23:06Z", "content": "(CNN)The parents of Trevor Reed, a US citizen detained in Russia, said Thursday that his health has taken a further turn for the worse, and they fear he will be sent to solitary confinement rather th… [+2538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "What the bill dubbed 'Don't Say Gay' by critics actually says", "description": "In their quest to become the party of \"parental rights,\" Republicans in Florida and in other states are attempting to muzzle discussion of gay and civil rights in school.", "url": "https://www.cnn.com/2022/03/10/politics/florida-dont-say-gay-bill-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310130014-01-florida-dont-say-gay-bill-protest-0309-super-tease.jpg", "publishedAt": "2022-03-10T23:14:05Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\n (CNN)While there is no equivalency between the laws passed in Russia criminalizing… [+6552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Durham investigation: Judge pans filing that fueled right-wing firestorm", "description": "A federal judge on Thursday panned a recent court filing from special counsel John Durham, chastising him for including unnecessary information that fueled a firestorm in right-wing circles about supposed spying on former President Donald Trump.", "url": "https://www.cnn.com/2022/03/10/politics/durham-trump-spying-judge-sussmann/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217130326-john-durham-michael-sussmann-split-super-tease.jpg", "publishedAt": "2022-03-10T23:09:52Z", "content": "Washington (CNN)A federal judge on Thursday panned a recent court filing from special counsel John Durham, chastising him for including unnecessary information that fueled a firestorm in right-wing c… [+2426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "This season's flu vaccine seems to be a poor match, early CDC data shows, but it's been a mild flu season", "description": "The flu vaccine has not been a great a match for the predominant viruses this season, preliminary data from the US Centers for Disease Control and Prevention shows -- but the season isn't over, and the estimate could change, the agency told CNN on Thursday.", "url": "https://www.cnn.com/2022/03/10/health/flu-vaccine-bad-match/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210129121808-flu-vaccine-vls-super-tease.jpg", "publishedAt": "2022-03-10T23:08:54Z", "content": "(CNN)The flu vaccine has not been a great a match for the predominant viruses this season, preliminary data from the US Centers for Disease Control and Prevention shows -- but the season isn't over, … [+3895 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "GOP lawmaker calls Zelensky a 'thug' and Ukrainian government 'incredibly evil'", "description": "North Carolina Republican Rep. Madison Cawthorn recently called Ukrainian President Volodymyr Zelensky a \"thug\" and the Ukrainian government \"incredibly evil,\" criticizing the country and its leader as Russia invades it.", "url": "https://www.cnn.com/2022/03/10/politics/madison-cawthorn-volodymyr-zelensky-comments/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310165021-cawthorn-zelensky-split-super-tease.jpg", "publishedAt": "2022-03-10T22:42:07Z", "content": "(CNN)North Carolina Republican Rep. Madison Cawthorn recently called Ukrainian President Volodymyr Zelensky a \"thug\" and the Ukrainian government \"incredibly evil,\" criticizing the country and its le… [+2282 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Global food shortage and higher prices may result from war in Ukraine - CNN", "description": "<ol><li>Global food shortage and higher prices may result from war in Ukraine  CNN\r\n</li><li>Local bakeries concerned about price of wheat rising  WTNH.com\r\n</li><li>Explainer: India's wheat exports surge as world prices soar  Reuters.com\r\n</li><li>Ukraine wa…", "url": "https://www.cnn.com/videos/business/2022/03/10/food-prices-crisis-russia-ukraine-invasion-qmb-vpx.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211028131029-04-food-supply-shortage-super-tease.jpg", "publishedAt": "2022-03-10T22:33:40Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox and Jeremy Herb, CNN", "title": "Bipartisan pressure mounts for US to do more in Ukraine amid frustration over Polish jets", "description": "After two weeks of unity surrounding the Biden administration's swift and sweeping response to Russia's invasion of Ukraine, patience is quickly thinning on Capitol Hill, with Republicans -- and even some Democrats -- challenging the administration to go furt…", "url": "https://www.cnn.com/2022/03/10/politics/congress-reaction-ukraine-aid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190421153730-sen-jeanne-shaheen-121218-super-tease.jpg", "publishedAt": "2022-03-10T22:30:07Z", "content": "(CNN)After two weeks of unity surrounding the Biden administration's swift and sweeping response to Russia's invasion of Ukraine, patience is quickly thinning on Capitol Hill, with Republicans -- and… [+11123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet", "title": "The 2020 census undercounted Latino, Black and Native American people", "description": "Latino, Black and Native American populations were signficantly undercounted in the 2020 census, officials announced Thursday.", "url": "https://www.cnn.com/2022/03/10/us/2020-census-undercount-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310155418-03-2020-census-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T22:09:17Z", "content": "Latino, Black and Native American populations were significantly undercounted in the 2020 census, officials announced Thursday.\r\nThe undercount rate for the Latino population was more than three time… [+3354 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, Sonnet Swire and Jeremy Herb, CNN", "title": "US ambassador to UN says Russia's actions in Ukraine 'constitute war crimes'", "description": "US Ambassador to the United Nations Linda Thomas-Greenfield said Thursday that actions committed by Russia against the Ukrainian people constitute war crimes, marking the first time a senior US official has directly accused Moscow of war crimes since last mon…", "url": "https://www.cnn.com/2022/03/10/politics/thomas-greenfield-russia-war-crimes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220306111039-linda-thomas-greenfield-0302-super-tease.jpg", "publishedAt": "2022-03-10T22:03:24Z", "content": "(CNN)US Ambassador to the United Nations Linda Thomas-Greenfield said Thursday that actions committed by Russia against the Ukrainian people constitute war crimes, marking the first time a senior US … [+5085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "US assesses North Korea launches constitute use of new ICBM system", "description": "The US has assessed that recent ballistic missile launches by Pyongyang signal the use of a new missile system, a senior administration official said Thursday, adding that it marks a \"serious escalation\" from North Korea.", "url": "https://www.cnn.com/2022/03/10/politics/north-korea-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220119180723-kim-jong-un-0119-super-tease.jpg", "publishedAt": "2022-03-10T21:00:16Z", "content": "(CNN)The US has assessed that recent ballistic missile launches by Pyongyang signal the use of a new missile system, a senior administration official said Thursday, adding that it marks a \"serious es… [+2077 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Selma Blair granted a restraining order against former boyfriend", "description": "Actress Selma Blair has been granted a restraining order against her ex-boyfriend after he allegedly attacked her.", "url": "https://www.cnn.com/2022/03/10/entertainment/selma-blair-restraining-order-ex-boyfriend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310132417-selma-blair-2021-file-super-tease.jpg", "publishedAt": "2022-03-10T20:59:11Z", "content": "(CNN)Actress Selma Blair has been granted a restraining order against her ex-boyfriend after he allegedly attacked her.\r\nAccording to court documents obtained by CNN, the incident took place February… [+1416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "MLB reaches labor deal agreement with players union", "description": "Major League Baseball (MLB) and the MLB Players Association (MLBPA) have agreed to a tentative deal on a new collective bargaining agreement, two sources with knowledge of the situation told CNN.", "url": "https://www.cnn.com/2022/03/10/sport/mlb-labor-deal-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220304071540-04-mlb-lockout-atlanta-braves-030222-super-tease.jpg", "publishedAt": "2022-03-10T20:54:34Z", "content": "(CNN)Major League Baseball and the MLB Players Association have agreed to a tentative deal on a new collective bargaining agreement, two sources with knowledge of the situation told CNN. \r\nThe deal e… [+85 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Bociurkiw", "title": "If bombing a children's hospital isn't crossing a red line -- what is?", "description": "The indiscriminate shelling of what are meant to be safe havens for women and children needs to be set as a red line no thuggish regime should be allowed to cross, writes Michael Bociurkiw.", "url": "https://www.cnn.com/2022/03/10/opinions/war-in-ukraine-red-lines-bociurkiw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309144149-10-mariupol-hospital-bombing-0309-super-tease.jpg", "publishedAt": "2022-03-10T20:50:24Z", "content": "Michael Bociurkiw (@WorldAffairsPro) is a global affairs analyst. He is a senior fellow at the Atlantic Council and a former spokesperson for the Organization for Security and Cooperation in Europe. … [+7932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Nedelman, CNN", "title": "Over 2.5 million students were current users of tobacco products last year, survey shows", "description": "About 1 in 8 US high school students -- more than 2 million total -- said they had used tobacco products in the previous 30 days, the vast majority being e-cigarettes, according to results from the 2021 National Youth Tobacco Survey.", "url": "https://www.cnn.com/2022/03/10/health/national-youth-tobacco-survey-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210930142824-teen-vaping-stock-super-tease.jpg", "publishedAt": "2022-03-10T20:08:47Z", "content": "(CNN)About 1 in 8 US high school students -- more than 2 million total -- said they had used tobacco products in the previous 30 days, the vast majority being e-cigarettes, according to results from … [+3639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "How the heck did Donald Trump refinance a Trump Tower mortgage with a $100 million loan?", "description": "On Wednesday, news broke that Donald Trump had refinanced his mortgage on Trump Tower with a $100 million loan through a California bank whose president has been a donor to the former President's political campaigns.", "url": "https://www.cnn.com/2022/03/10/politics/donald-trump-tower-loan-mortgage/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220303194746-23-week-in-photos-0303.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T20:08:35Z", "content": "On Wednesday, news broke that Donald Trump had refinanced his mortgage on Trump Tower with a $100 million loan through a California bank whose president has been a donor to the former Presidents poli… [+5190 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz, CNN Business", "title": "Magic Leap raised billions but its headset flopped. Now it's trying again", "description": "Magic Leap is no longer aiming the product at developers and other early adopters who it had hoped would come up with compelling uses for it (and then, perhaps, drive consumers to pick it up). Instead, it's focusing on a narrow range of companies that might f…", "url": "https://www.cnn.com/2022/03/10/tech/magic-leap-new-headset/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309154052-magic-leap-headset-super-tease.jpg", "publishedAt": "2022-03-10T19:31:33Z", "content": "(CNN Business)In 2018, Magic Leap released an augmented reality headset that could show crisp, three-dimensional images as though they were right in front of you on a coffee table or living room floo… [+5001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "Jill Biden serves as her husband's emotional emissary over Ukraine", "description": "In her hotel suite at the Intercontinental in San Francisco last weekend, Jill Biden spontaneously scrapped a prepared fundraising pitch she was set to give later that day.", "url": "https://www.cnn.com/2022/03/10/politics/jill-biden-joe-biden-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310135318-01-jill-biden-nevada-0309-super-tease.jpg", "publishedAt": "2022-03-10T19:03:49Z", "content": "(CNN)In her hotel suite at the Intercontinental in San Francisco last weekend, Jill Biden spontaneously scrapped a prepared fundraising pitch she was set to give later that day. \r\nBut there was somet… [+5664 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, CNN", "title": "Former Vice President Pence visits Ukraine-Poland border and meets with Ukrainian refugees", "description": "Former Vice President Mike Pence visited the Ukraine-Poland border on Thursday, meeting with refugees from Ukraine escaping the Russian invasion of their country.", "url": "https://www.cnn.com/2022/03/10/politics/pence-ukraine-poland-border/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310131130-01-mike-pence-ukraine-border-super-tease.jpg", "publishedAt": "2022-03-10T18:37:53Z", "content": "(CNN)Former Vice President Mike Pence visited the Ukraine-Poland border on Thursday, meeting with refugees from Ukraine escaping the Russian invasion of their country.\r\nPence was joined by his wife, … [+2257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Charles Riley", "title": "Russia owes Western banks $120 billion. They won't get it back", "description": "Goldman Sachs is the first major Western bank to get out of Russia following the invasion of Ukraine. More are likely to follow at a cost of tens of billions of dollars.", "url": "https://www.cnn.com/2022/03/10/investing/banks-russia-exposure/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310112909-goldman-sachs-trading-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T18:25:41Z", "content": "Goldman Sachs is the first major Western bank to get out of Russia following the invasion of Ukraine. More are likely to follow at a cost of tens of billions of dollars.\r\nThe Wall Street giant said T… [+4525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Biden's sanctions of Russian energy give electric vehicle batteries a pass", "description": "Vladimir Potanin, the richest man in Russia, has watched his fortune shrink by $8 billion this year as his country invaded Ukraine. But the company he leads as CEO, Norilsk Nickel, can still sell nickel, a critical metal in electric vehicle batteries, even af…", "url": "https://www.cnn.com/2022/03/10/energy/russia-sanctions-energy-nickel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310120221-electric-car-charging-restricted-super-tease.jpg", "publishedAt": "2022-03-10T18:23:13Z", "content": "Washington, DC (CNN)Vladimir Potanin, the richest man in Russia, has watched his fortune shrink by $8 billion this year as his country invaded Ukraine. But the company he leads as CEO, Norilsk Nickel… [+3866 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Miller and Rachel Ramirez, CNN", "title": "More of the US is in drought than any time since 2012", "description": "The West is far from the only region experiencing remarkably dry weather so far this year. According to Thursday's report from the US Drought Monitor, more than 61% of the contiguous US is in some classification of drought.", "url": "https://www.cnn.com/2022/03/10/us/drought-west-california-us-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310122236-bpt101-drought-lake-meade-file-restricted-031022-super-tease.jpg", "publishedAt": "2022-03-10T18:05:53Z", "content": "(CNN)The West is far from the only region experiencing remarkably dry weather so far this year. According to Thursday's report from the US Drought Monitor, more than 61% of the contiguous US is in so… [+4105 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Amanda Bynes speaks out as she seeks to end her conservatorship", "description": "Amanda Bynes is thanking her supporters as she prepares to try and end her court-ordered conservatorship.", "url": "https://www.cnn.com/2022/03/10/entertainment/amanda-bynes-conservatorship/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310120255-amanda-bynes-conservatorship-instagram.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T17:42:03Z", "content": "Amanda Bynes is thanking her supporters as she prepares to try and end her court-ordered conservatorship.\r\nThe All That star posted a brief video on Instagram recently.\r\nWhats up Instagram, Amanda By… [+944 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "'The Masked Singer' wardrobe malfunction accidentally unmasks McTerrier", "description": "One of the \"The Masked Singer\" contestants accidentally became unmasked.", "url": "https://www.cnn.com/2022/03/10/entertainment/the-masked-singer-reveal-accident/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310100437-01-masked-singer-terrier.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T17:09:34Z", "content": "One of the The Masked Singer contestants accidentally became unmasked. \r\nMcTerriers head came completely off during a performance last night as he sang Working For The Weekend by Loverboy for the pan… [+890 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle, CNN", "title": "Victims of opioid crisis confront owners of OxyContin maker Purdue Pharma", "description": "Victims of opioid abuse and their families on Thursday confronted members of the family behind OxyContin maker Purdue Pharma, recounting their unmeasurable loss and pain.", "url": "https://www.cnn.com/2022/03/10/us/us-bankruptcy-purdue-pharma-sacklers-victims/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309211051-01-us-bankruptcy-judge-approves-purdue-pharma-sacklers-settlement-super-tease.jpg", "publishedAt": "2022-03-10T16:53:49Z", "content": "(CNN)Victims of opioid abuse and their families on Thursday confronted members of the family behind OxyContin maker Purdue Pharma, recounting their unmeasurable loss and pain. \r\nThe emotional hearing… [+2760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "Florida Senate passes ban on schools and businesses teaching people to feel guilty for racist history", "description": "The Florida Senate voted Thursday to ban public schools and private businesses from teaching people to feel guilty for historical events committed by people of their race, addressing a top priority of Republican Gov. Ron DeSantis.", "url": "https://www.cnn.com/2022/03/10/politics/florida-senate-crt-schools-businesses/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310100708-florida-capitol-tallahassee-super-tease.jpg", "publishedAt": "2022-03-10T16:50:13Z", "content": "(CNN)The Florida Senate voted Thursday to ban public schools and private businesses from teaching people to feel guilty for historical events committed by people of their race, addressing a top prior… [+3858 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein", "title": "Biden suggests Putin and Russia's war in Ukraine responsible for soaring inflation in new report", "description": "President Joe Biden on Thursday suggested the new consumer price index report showing soaring inflation reflected the pinch Americans are feeling due to the Russian invasion of Ukraine and other factors.", "url": "https://www.cnn.com/2022/03/10/politics/biden-inflation-consumer-price-index/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220309150536-02-biden-business-leaders-0309.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T16:37:19Z", "content": "President Joe Biden on Thursday suggested the new consumer price index report showing soaring inflation reflected the pinch Americans are feeling due to the Russian invasion of Ukraine and other fact… [+4188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Ali Zaslav, CNN", "title": "Schumer says Senate must pass funding bill with Ukraine aid quickly, 'hopefully tonight'", "description": "Senate Majority Leader Chuck Schumer said Thursday that Republicans and Democrats must work together to \"quickly\" pass a massive government funding bill with $13.6 billion in aid to Ukraine as soon as possible, \"hopefully tonight.\"", "url": "https://www.cnn.com/2022/03/10/politics/senate-spending-bill-ukraine-aid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211007045534-01-capitol-exterior-1006-super-tease.jpg", "publishedAt": "2022-03-10T16:21:41Z", "content": "(CNN)Senate Majority Leader Chuck Schumer said Thursday that Republicans and Democrats must work together to \"quickly\" pass a massive government funding bill with $13.6 billion in aid to Ukraine as s… [+3450 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Amazon and Alphabet could give the Dow a 21st century facelift", "description": "Amazon and Google owner Alphabet are two of the most dominant companies on Earth. Each is worth more than $1 trillion and is a leader in multiple industries. But neither stock is a member of Wall Street's most exclusive club: the Dow Jones Industrial Average.…", "url": "https://www.cnn.com/2022/03/10/investing/amazon-alphabet-google-dow/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310084517-pichai-jassy-split-super-tease.jpg", "publishedAt": "2022-03-10T16:11:56Z", "content": "New York (CNN Business)Amazon and Google owner Alphabet are two of the most dominant companies on Earth. Each is worth more than $1 trillion and is a leader in multiple industries. But neither stock … [+2237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Pete Muntean and Gregory Wallace, CNN", "title": "First on CNN: Biden administration set to extend travel mask mandate for another month", "description": "Federal officials have notified stakeholders in the airline industry that they will announce as soon as Thursday a 30-day extension of the federal transportation mask mandate, three sources told CNN.", "url": "https://www.cnn.com/2022/03/10/politics/travel-mask-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210903093211-masks-airport-super-tease.jpg", "publishedAt": "2022-03-10T16:06:28Z", "content": "(CNN)Federal officials have notified stakeholders in the airline industry that they will announce as soon as Thursday a 30-day extension of the federal transportation mask mandate, three sources told… [+678 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Turning Red' tackles puberty and periods in a way that's rare", "description": "In an early scene from the new Pixar film \"Turning Red,\" the character Mei hides out in the bathroom on a morning before school. Having spiraled from a particularly embarrassing encounter the night before, she's woken up to find that she's turned into a giant…", "url": "https://www.cnn.com/2022/03/10/entertainment/turning-red-puberty-periods-wellness-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220309181739-02-turning-red-movie.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T16:02:25Z", "content": "In an early scene from the new Pixar film Turning Red, the character Mei hides out in the bathroom on a morning before school. Having spiraled from a particularly embarrassing encounter the night bef… [+5209 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Pro-Russia social media accounts spread false claims that old videos show Ukrainian 'crisis actors'", "description": "Pro-Russia accounts on social media are trying to convince the public not to believe accurate news reports about Ukrainians suffering and dying.", "url": "https://www.cnn.com/2022/03/10/politics/fact-check-ukraine-not-actually-crisis-actor-fakes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220307044216-refugee-crossing-kyiv-03062022-super-tease.jpg", "publishedAt": "2022-03-10T15:52:27Z", "content": "Washington (CNN)Pro-Russia accounts on social media are trying to convince the public not to believe accurate news reports about Ukrainians suffering and dying.\r\nTo sow doubt, the pro-Russia accounts… [+6551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "This Italian destination will pay your wedding bills", "description": "So you've always wanted a destination wedding. Italy, maybe. In the Eternal City, perhaps. Or one of those hilltop towns -- think of the wedding photos! There's just one problem -- weddings are expensive at the best of times, destination weddings involve even…", "url": "https://www.cnn.com/travel/article/lazio-italy-wedding-fund/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310101845-rome-italy-wedding-stock-super-tease.jpg", "publishedAt": "2022-03-10T15:50:44Z", "content": "(CNN) So you've always wanted a destination wedding. Italy, maybe. In the Eternal City, perhaps. Or one of those hilltop towns -- think of the wedding photos! There's just one problem -- weddings are… [+2527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace, CNN Business", "title": "These business owners survived Covid. Now gas prices are surging", "description": "Earth & Sky Floral Designs, in west-central New Mexico, is the only florist for miles. Owner Shayai Lucero says record-high gas prices could mean she is no longer able to deliver to some rural clients.", "url": "https://www.cnn.com/2022/03/10/economy/small-business-gas-prices/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308154409-01-small-business-gas-prices-super-tease.jpg", "publishedAt": "2022-03-10T15:46:46Z", "content": "San Francisco (CNN Business)Earth &amp; Sky Floral Designs, located on the Laguna Pueblo reservation in New Mexico, is the only florist for miles. Owner Shayai Lucero says sheoften racks up the milea… [+6148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Weber, Kaiser Health News", "title": "People with disabilities left behind by telemedicine and other pandemic medical innovations", "description": "As the country enters Year 3 of the pandemic emergency, people with disabilities across the United States are still finding it difficult to use innovations in telemedicine, teleworking and testing.", "url": "https://www.cnn.com/2022/03/10/health/pandemic-medical-innovations-disabilities-khn-partner-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309144609-01-pandemic-medical-innovations-super-tease.jpg", "publishedAt": "2022-03-10T15:41:14Z", "content": "(KHN)Divya Goel, a 35-year-old deaf-blind woman in Orlando, Florida, has had two telemedicine doctors' appointments during the pandemic. Each time, she was denied an interpreter.\r\nHer doctors told he… [+7943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'The Adam Project' brings Ryan Reynolds back from the future in a 'Free Guy' reunion", "description": "Reuniting star-producer Ryan Reynolds and director Shawn Levy after their winning collaboration on \"Free Guy,\" \"The Adam Project\" has the generic feel of a project created by committee, combining action, humor and smart-alecky one-liners in a way that's at be…", "url": "https://www.cnn.com/2022/03/10/entertainment/the-adam-project-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220224143946-25-march-2022-streaming-adam-project-super-tease.jpg", "publishedAt": "2022-03-10T15:03:07Z", "content": "(CNN)Reuniting star-producer Ryan Reynolds and director Shawn Levy after their winning collaboration on \"Free Guy,\" \"The Adam Project\" has the generic feel of a project created by committee, combinin… [+3035 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Kim Kardashian's advice for working women sparks backlash", "description": "Kim Kardashian's interview with Variety magazine is sparking outrage after she offered some advice to women in business: \"get your f*cking a** up and work.\"", "url": "https://www.cnn.com/videos/media/2022/03/10/kim-kardashian-advice-working-women-backlash-mxp-hln-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310093344-kim-kardashian-mxp-hln-vpx-super-tease.jpg", "publishedAt": "2022-03-10T14:43:26Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "AG Merrick Garland says avoiding politically sensitive cases could 'undermine' the rule of law", "description": "Attorney General Merrick Garland said Thursday that when it comes to politically sensitive investigations, the Justice Department does \"not shy away from cases that are controversial or sensitive or political.\"", "url": "https://www.cnn.com/2022/03/10/politics/merrick-garland-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220105153545-merrick-garland-01052022-super-tease.jpg", "publishedAt": "2022-03-10T14:40:13Z", "content": "(CNN)Attorney General Merrick Garland said Thursday that when it comes to politically sensitive investigations, the Justice Department does \"not shy away from cases that are controversial or sensitiv… [+831 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alice McCool", "title": "Why have women been so disproportionately affected by Covid-19? Experts explain", "description": "A new CNN poll revealed the main areas of disruption in women's lives caused by Covid-19. But why have women been so adversely affected? Experts explain", "url": "https://www.cnn.com/2022/03/10/world/covid-pandemic-gender-women-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309113350-20220207-as-equals-newsletter-g7-hero-gfx-super-tease.jpg", "publishedAt": "2022-03-10T13:30:18Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs. \r\n (CNN)On March 8 -- International Women's Da… [+13302 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John", "title": "Denmark opens its arms to Ukrainians, while trying to send Syrian refugees home", "description": "When Denmark became the first liberal democracy to tell Syrian refugees to return to their war-torn home in 2019, Russian jets were still dropping missiles in Syria, in an effort to help President Bashar al-Assad's regime regain control of the country.", "url": "https://www.cnn.com/2022/03/10/europe/denmark-refugees-ukraine-syrian-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220309093815-03-denmark-ukraine-syria-refugees.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T12:49:47Z", "content": "When Denmark became the first liberal democracy to tell Syrian refugees to return to their war-torn home in 2019, Russian jets were still dropping missiles in Syria, in an effort to help President Ba… [+9129 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Why record-high gas prices won't be solved by drilling more oil in the US", "description": "As gas prices skyrocket, politicians in both parties have called for a seemingly easy solution: Drill our way out of the problem.", "url": "https://www.cnn.com/2022/03/10/politics/record-gas-prices-wont-be-solved-by-drilling-more-oil-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309173829-01-gas-prices-0304-super-tease.jpg", "publishedAt": "2022-03-10T12:08:32Z", "content": "(CNN)As US oil and gasoline prices skyrocket, politicians in both parties have called for a seemingly easy solution: Drill our way out of the problem to ease prices at the pump and supply additional … [+7332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Laura Smith-Spark and Olga Voitovych, CNN", "title": "Russia condemned over deadly Mariupol children's hospital bombing as WHO highlights pattern of strikes on medical facilities", "description": "An injured woman, heavily pregnant, is carried on a stretcher past the smoldering wreckage of Mariupol's maternity and children's hospital. Her face is pale, one hand cradles her belly in a protective gesture. Every window on that side of the building appears…", "url": "https://www.cnn.com/2022/03/10/europe/russia-invasion-ukraine-03-10-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310051515-mariupol-hospital-bombing-03092022-super-tease.jpg", "publishedAt": "2022-03-10T11:57:13Z", "content": "Kyiv, Ukraine (CNN)An injured woman, heavily pregnant, is carried on a stretcher past the smoldering wreckage of Mariupol's maternity and children's hospital. Her face is pale, one hand cradles her b… [+7746 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed", "title": "Baby gets first heart and thymus transplant, possibly eliminating need for dangerous lifelong medication", "description": "An immune deficiency meant Easton Sinnamon was uniquely qualified for a novel surgery to receive both a new heart and a processed thymus from the same donor, potentially eliminating the need for him to take immune-suppressing medications for the rest of his l…", "url": "https://www.cnn.com/2022/03/10/health/baby-heart-and-thymus-transplant/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220309154901-01-baby-heart-thymus-transplant.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T11:51:51Z", "content": "When Kaitlyn Sinnamon was 20 weeks pregnant with her second child, doctors told her that her baby would be born with a heart defect that would require surgery at the beginning of his life. \r\nEaston S… [+7360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for March 10: Ukraine, Congress, South Korea, Capitol riot, crypto", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/03/10/us/five-things-march-10-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309145914-17-mariupol-hospital-bombing-0309-super-tease.jpg", "publishedAt": "2022-03-10T11:41:17Z", "content": "(CNN)A friendly reminder: Don't wait until the last minute to file your taxes. The deadline is April 18, but get going now because it'll be a pain if you need to reach the IRS. The agency is dealing … [+6311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Alex Rogers, CNN", "title": "Murkowski on tough Supreme Court choice: 'This is a different game'", "description": "Last year, Sen. Lisa Murkowski was one of just three Republicans who voted to elevate Judge Ketanji Brown Jackson to the second most important court in the country. Now, in the middle of an election year, she is faced with a new choice: Promoting her to the h…", "url": "https://www.cnn.com/2022/03/10/politics/lisa-murkowski-ketanji-brown-jackson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309200516-lisa-murkowski-ketanji-brown-jackson-split-restricted-super-tease.jpg", "publishedAt": "2022-03-10T11:00:25Z", "content": "(CNN)Last year, Sen. Lisa Murkowski was one of just three Republicans who voted to elevate Judge Ketanji Brown Jackson to the second most important court in the country. Now, in the middle of an elec… [+8648 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Rio Tinto slashes ties with Russian businesses over Ukraine war", "description": "Rio Tinto on Thursday became the first major mining company to announce it was cutting all ties with Russian businesses, joining a raft of leading Western companies in a pullout following Moscow's invasion of Ukraine.", "url": "https://www.cnn.com/2022/03/10/business/rio-tinto-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310054341-rio-tinto-perth-file-05232016-super-tease.jpg", "publishedAt": "2022-03-10T11:00:17Z", "content": "Rio Tinto(RIO) on Thursday became the first major mining company to announce it was cutting all ties with Russian businesses, joining a raft of leading Western companies in a pullout following Moscow… [+2260 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Richard Collett, CNN", "title": "They bought a Caribbean island to start their own country", "description": "\"Who wouldn't want to buy an island?\" Marshall Mayer asks above the roar of the engine as the boat cuts through the still waters of the Caribbean Sea. Belize City is fast disappearing behind, as a group of mangrove-covered islands grows larger on the horizon.", "url": "https://www.cnn.com/travel/article/islandia-lets-buy-an-island-micronation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308151714-5-x-investors-on-islandia-super-tease.jpg", "publishedAt": "2022-03-10T10:55:55Z", "content": "(CNN) \"Who wouldn't want to buy an island?\" Marshall Mayer asks above the roar of the engine as the boat cuts through the still waters of the Caribbean Sea. Belize City is fast disappearing behind, a… [+11046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Original Buzz Aldrin moon walk photo sells for $7,700 at auction", "description": "A series of original NASA photographs from the Apollo missions sold at an auction in Copenhagen, including an iconic photograph of Buzz Aldrin.", "url": "https://www.cnn.com/style/article/moon-walk-apollo-photo-auction-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310102334-01-moon-walk-photo-super-tease.jpg", "publishedAt": "2022-03-10T10:50:50Z", "content": "artsPublished 10th March 2022\r\nA series of original NASA photographs from the Apollo missions sold for a total of 1.16 million Danish crowns ($171,831) in an auction in Copenhagen on Wednesday.\r\nThe … [+1482 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "Inside the effort to disbar attorneys who backed bogus election lawsuits", "description": "Lawyers who backed former President Donald Trump's bogus election reversal gambits are facing fresh opposition for their involvement -- in the form of a flashy new campaign, launched this week by fellow members of the legal community, aimed at potentially dis…", "url": "https://www.cnn.com/2022/03/10/politics/ethics-complaints-attorney-misconduct-trump-election-reversal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309113518-01-giuliani-ellis-file-2020-super-tease.jpg", "publishedAt": "2022-03-10T10:08:09Z", "content": "(CNN)Lawyers who backed former President Donald Trump's bogus election reversal gambits are facing fresh opposition for their involvement -- in the form of a flashy new campaign, launched this week b… [+9753 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Fossum, CNN", "title": "Biden's meeting with Colombian President will heavily focus on migration, officials say", "description": "President Joe Biden's meeting with Colombian President Iván Duque on Thursday will focus heavily on migration, with the two leaders discussing issues like expanding legal pathways for migrants and providing support for countries that welcome large numbers of …", "url": "https://www.cnn.com/2022/03/10/politics/biden-meeting-duque-migration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210121221205-conclu-duque-split-biden-super-tease.jpg", "publishedAt": "2022-03-10T10:06:12Z", "content": "Washington (CNN)President Joe Biden's meeting with Colombian President Iván Duque on Thursday will focus heavily on migration, with the two leaders discussing issues like expanding legal pathways for… [+1966 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, CNN", "title": "1 out of 5 local election officials say they could quit before 2024 presidential election, new report finds", "description": "About 1 in 5 local election officials included in a new survey say they are likely to leave their jobs before the 2024 presidential election, with a third of that group citing false political attacks on the election system as the top reason for their departur…", "url": "https://www.cnn.com/2022/03/10/politics/local-election-officials-polling-threats-survey/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210917203908-georgia-ballot-counting-super-tease.jpg", "publishedAt": "2022-03-10T10:04:48Z", "content": "(CNN)About 1 in 5 local election officials included in a new survey say they are likely to leave their jobs before the 2024 presidential election, with a third of that group citing false political at… [+2876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt", "title": "Vladimir Putin: The world of sport has shunned the Russian president. So what?", "description": "As Russia continues its invasion of Ukraine, the grim reality of war has taken center stage, with more than two million Ukrainians fleeing the country and hundreds dead, according to the UN.", "url": "https://www.cnn.com/2022/03/10/sport/ukraine-russia-putin-sports-sanctions-intl-spt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220304103946-20220304-sports-putin.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T09:50:57Z", "content": "As Russia continues its invasion of Ukraine, the grim reality of war has taken center stage, with more than two million Ukrainians fleeing the country and hundreds dead, according to the UN.\r\nRussia … [+10053 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Niamh Kennedy", "title": "UK sanctions Russian oligarch and Chelsea owner Roman Abramovich", "description": "The UK has added Russian oligarch and Chelsea football club owner Roman Abramovich to its list of sanctioned individuals.", "url": "https://www.cnn.com/2022/03/10/sport/roman-abramovich-sanctions-uk-list-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220310043145-roman-abramovich-05292021-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-10T09:34:06Z", "content": "The UK has added Russian oligarch and Chelsea football club owner Roman Abramovich to its list of sanctioned individuals.\r\nIn a statement Thursday, the UK government said it was adding seven further … [+529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Powerful storm threatens central US with snow and could become a bomb cyclone as it moves east", "description": "A strong winter storm is expected to impact a large swath of the US, bringing snow Thursday to the central region before forming into a bomb cyclone on its way east over the weekend.", "url": "https://www.cnn.com/2022/03/10/weather/winter-storm-bomb-cyclone-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310034039-winter-weather-central-us-super-tease.jpg", "publishedAt": "2022-03-10T09:20:30Z", "content": "(CNN)A strong winter storm is expected to impact a large swath of the US, bringing snow Thursday to the central region before forming into a bomb cyclone on its way east over the weekend. \r\nAbout 11 … [+2734 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Newly discovered rainbow-colored fish lives in the ocean's 'twilight zone'", "description": "Far beneath the waves surrounding the Maldives, there's a living rainbow in the ocean's \"twilight zone.\" Say hello to the rose-veiled fairy wrasse, a colorful species of fish that's new to science.", "url": "https://www.cnn.com/2022/03/10/world/rose-fairy-wrasse-rainbow-fish-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309153016-02-rose-veiled-fairy-wrasse-discovery-super-tease.jpg", "publishedAt": "2022-03-10T08:47:58Z", "content": "(CNN)Far beneath the waves surrounding the Maldives, there's a living rainbow in the ocean's \"twilight zone.\" Say hello to the rose-veiled fairy wrasse, a colorful species of fish that's new to scien… [+5762 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Details trickled in this week on Brittney Griner's February arrest in Russia. But many questions remain unanswered", "description": "Basketball star Brittney Griner's arrest in Russia on allegations of drug smuggling has brought widespread condemnation in the US but few details from Russian authorities on her status and the investigation.", "url": "https://www.cnn.com/2022/03/10/world/brittney-griner-arrest-russia-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310014905-brittney-griner-10032021-super-tease.jpg", "publishedAt": "2022-03-10T08:37:19Z", "content": "(CNN)Basketball star Brittney Griner's arrest in Russia on allegations of drug smuggling has brought widespread condemnation in the US but few details from Russian authorities on her status and the i… [+6162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alta Spells, CNN", "title": "Travis and Gregory McMichael seek acquittal of hate crimes convictions in Ahmaud Arbery's murder", "description": "Travis McMichael and his father Gregory McMichael are seeking acquittal of their federal hate crimes convictions related to the murder of Ahmaud Arbery, arguing the 25-year-old Black man's killing didn't happen on public streets, according to court documents …", "url": "https://www.cnn.com/2022/03/10/us/ahmaud-arbery-hate-crime-acquittal-request/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220309222003-01-ahmaud-arbery-hate-crime-acquittal-request-super-tease.jpg", "publishedAt": "2022-03-10T06:36:28Z", "content": "(CNN)Travis McMichael and his father Gregory McMichael are seeking acquittal of their federal hate crimes convictions related to the murder of Ahmaud Arbery, arguing the 25-year-old Black man's killi… [+3710 chars]"}]}