{"status": "ok", "totalResults": 164, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Caroll Alvarado and Rebekah Riess, CNN", "title": "Chicago school district investigating after teacher hung stuffed Black doll on a string from a projector screen", "description": "An investigation is underway at Chicago Public Schools after a teacher hung a small stuffed Black football player doll on a string from a projector screen in their classroom, according to a letter sent to parents by the school's principal and obtained by CNN.", "url": "https://www.cnn.com/2022/03/31/us/chicago-school-teacher-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331154316-whitney-young-magnet-high-school-file-super-tease.jpg", "publishedAt": "2022-03-31T23:53:26Z", "content": "(CNN)An investigation is underway at Chicago Public Schools after a teacher hung a small stuffed Black football player doll on a string from a projector screen in their classroom, according to a lett… [+2540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Sarisohn, CNN", "title": "Parents reach $250,000 settlement with Texas city after son, 3, dies after contracting brain-eating amoeba at splash pad", "description": "The parents of a 3-year-old boy who died last year after a contracting a rare brain-eating amoeba at a splash pad in Arlington, Texas, have reached a $250,000 settlement with the city.", "url": "https://www.cnn.com/2022/03/31/us/brain-eating-amoeba-texas-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331172339-don-misenhimer-park-file-restricted-092821-super-tease.jpg", "publishedAt": "2022-03-31T23:48:55Z", "content": "(CNN)The parents of a 3-year-old boy who died last year after a contracting a rare brain-eating amoeba at a splash pad in Arlington, Texas, have reached a $250,000 settlement with the city.\r\nBakari W… [+4997 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose, CNN", "title": "Chris Rock insisted he did not want to press charges against Will Smith, Oscar show producer says", "description": "After Will Smith slapped comedian Chris Rock on stage Sunday at the Academy Awards ceremony, Los Angeles police officers were prepared to arrest Smith, according to an interview with the award show's producer, but the comedian was adamant he did not want to p…", "url": "https://www.cnn.com/2022/03/31/entertainment/oscar-show-producer-chris-rock-will-smith/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331163742-chris-rock-oscars-super-tease.jpg", "publishedAt": "2022-03-31T23:41:43Z", "content": "(CNN)After Will Smith slapped comedian Chris Rock on stage Sunday at the Academy Awards ceremony, Los Angeles police officers were prepared to arrest Smith, according to an interview with the award s… [+1001 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, Katelyn Polantz, Ryan Nobles, Annie Grayer and Ashley Semler, CNN", "title": "The mystery gap in Trump phone logs has many possible explanations", "description": "In the seven hours during which White House records show no phone calls to or from then-President Donald Trump on January 6, 2021, among the calls that are conspicuously absent is one Trump made to then-Vice President Mike Pence that morning from the Oval Off…", "url": "https://www.cnn.com/2022/03/31/politics/mystery-call-gap-trump-jan-6-white-house-phone-logs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220329081521-jan-6-donald-j-trump-washington-super-tease.jpg", "publishedAt": "2022-03-31T23:30:59Z", "content": "Washington (CNN)In the seven hours during which White House records show no phone calls to or from then-President Donald Trump on January 6, 2021, among the calls that are conspicuously absent is one… [+8573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox and Priscilla Alvarez, CNN", "title": "Democrats grow worried about Biden immigration move as midterms loom", "description": "A number of Democratic senators are growing increasingly wary of the administration's plan to repeal Trump-era pandemic restrictions on the US-Mexico border that effectively blocked migrants from entering the US, setting up a rare clash between President Joe …", "url": "https://www.cnn.com/2022/03/31/politics/democrats-reaction-biden-immigration-plans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220202110852-02-senate-manchin-super-tease.jpg", "publishedAt": "2022-03-31T23:22:42Z", "content": "(CNN)A number of Democratic senators are growing increasingly wary of the administration's plan to repeal Trump-era pandemic restrictions on the US-Mexico border that effectively blocked migrants fro… [+5550 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kirsten Powers, CNN Senior Political Analyst", "title": "Opinion: The Pope puts a crack in the Catholic Church's 'stained glass ceiling'", "description": "Kirsten Powers writes last week Pope Francis announced reforms allowing women to head some Vatican offices -- an incremental, but important step. Now he needs to make a more significant one, by ordaining women to be bishops, priests and deacons.", "url": "https://www.cnn.com/2022/03/31/opinions/pope-francis-catholic-church-women-powers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316102112-papa-okok-super-tease.jpg", "publishedAt": "2022-03-31T23:11:17Z", "content": "Kirsten Powers is a CNN senior political analyst and New York Times bestselling author of \"Saving Grace: Speak Your Truth, Stay Centered and Learn to Coexist with People Who Drive You Nuts.\" Follow h… [+6222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, Melanie Zanona, Manu Raju, Alex Rogers and Marshall Cohen, CNN", "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?", "description": "Rep. Madison Cawthorn -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the center of chaos within the GOP.", "url": "https://www.cnn.com/2022/03/31/politics/madison-cawthorn-background-controversy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331180604-madison-cawthorn-file-051221-super-tease.jpg", "publishedAt": "2022-03-31T22:50:24Z", "content": "Washington, DC (CNN)Rep. Madison Cawthorn -- the freshman Republican representing North Carolina's 11th Congressional District in the US House of Representatives -- has in recent weeks become the cen… [+6560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Disney says character hugs and other interactions will return soon at US sites", "description": "As early as April 18, Disney \"will start reintroducing traditional character greetings at Disneyland (in California) and Walt Disney World Resorts, as well as aboard Disney Cruise Line and at Aulani Resort in Hawaii,\" the company said Thursday.", "url": "https://www.cnn.com/travel/article/us-disney-parks-character-interactions-returning/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200801000430-mickey-mouse-file-super-tease.jpg", "publishedAt": "2022-03-31T22:46:15Z", "content": "(CNN) Of the many safety measures that Disney Parks had to set up to operate during the Covid-19 pandemic, requiring guests to keep a six-foot distance from the costumed characters must have been one… [+3414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Hillary Clinton campaign lawyer argues case brought by special counsel Durham against him should be dismissed", "description": "One of Hillary Clinton's campaign lawyers argued in court Thursday that he never had any reason to doubt the accuracy of internet data he passed to the FBI in 2016 about strange cyber links between Donald Trump and Russia -- and pointed out that the special c…", "url": "https://www.cnn.com/2022/03/31/politics/michael-sussmann-russia-case-john-durham/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217130326-john-durham-michael-sussmann-split-super-tease.jpg", "publishedAt": "2022-03-31T22:30:14Z", "content": "Washington (CNN)One of Hillary Clinton's campaign lawyers argued in court Thursday that he never had any reason to doubt the accuracy of internet data he passed to the FBI in 2016 about strange cyber… [+4197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung", "title": "Former top national security officials side with Apple in app store antitrust case", "description": "Former senior national security officials, including two ex-CIA directors and a past NSA director, are backing Apple's app store practices as the iPhone maker fights a critical antitrust case.", "url": "https://www.cnn.com/2022/03/31/tech/apple-app-store-national-security-officials/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331165355-apple-app-store-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T22:00:50Z", "content": "Former senior national security officials, including two ex-CIA directors and a past NSA director, are backing Apple\r\n(AAPL)s app store practices as the iPhone maker fights a critical antitrust case.… [+2749 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kyung Lah and Sarah Boxer, CNN", "title": "Ukrainian women escaped to give birth in a country free of war. They want their children to know why Putin forced them to flee", "description": "Khrystyna Pavluchenko strokes the tiny hand of her newborn, Adelina. She had anticipated the profound joy of becoming a mother for the first time -- but not the guilt.", "url": "https://www.cnn.com/2022/03/31/europe/ukraine-women-babies-hospital-poland-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331134722-03-babies-in-poland-super-tease.jpeg", "publishedAt": "2022-03-31T21:42:17Z", "content": "Warsaw, Poland (CNN)Khrystyna Pavluchenko strokes the tiny hand of her newborn, Adelina. She had anticipated the profound joy of becoming a mother for the first time -- but not the guilt. \r\n\"(That's)… [+6521 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Vasco Cotovio, Frederik Pleitgen and Byron Blunt, CNN", "title": "Ukrainians have retaken Irpin from the Russian invaders. But it's a city that now lies in ruins", "description": "A child's doll lies curb side, covered in dirt and debris, in the war-torn Kyiv suburb of Irpin.", "url": "https://www.cnn.com/2022/03/31/europe/irpin-ukraine-war-destruction-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331155443-05-irpin-ukraine-destruction-vasco-super-tease.jpg", "publishedAt": "2022-03-31T21:13:02Z", "content": "Irpin, Ukraine (CNN)A child's doll lies curb side, covered in dirt and debris, in the war-torn Kyiv suburb of Irpin. \r\nThere's not a sign of the child who owned it, or of any of the residents of the … [+4064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "Academy leaders told Smith's publicist he should leave Oscars after slap, but he refused, source says", "description": "In the moments following Will Smith's stunning on-stage slap of Chris Rock during Sunday's Oscars telecast, members of the Academy of Motion Picture and Arts and Sciences leadership \"firmly asked\" Will Smith's publicist for the actor to leave the ceremony, ac…", "url": "https://www.cnn.com/2022/03/31/entertainment/academy-will-smith-oscars/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220328184557-will-smith-file-032722-super-tease.jpg", "publishedAt": "2022-03-31T20:21:29Z", "content": "(CNN)In the moments following Will Smith's stunning on-stage slap of Chris Rock during Sunday's Oscars telecast, members of the Academy of Motion Picture and Arts and Sciences leadership \"firmly aske… [+1544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "They fell in love on a Greyhound Bus 35 years ago. They've been together ever since", "description": "Tiffany Woods met her wife-to-be Bridgette in line at Sacramento Greyhound Bus Station in February 1987. Over their decades-long relationship, they've navigated life side by side, including when Tiffany, who is trans, transitioned.", "url": "https://www.cnn.com/travel/article/chance-encounters-greyhound-bus/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331034314-10-chance-encounters-tiffany-bridgette-greyhound-body-super-tease.jpeg", "publishedAt": "2022-03-31T20:15:04Z", "content": "(CNN) When Tiffany Woods met Bridgette, she was at a crossroads. \r\nIt was February 1987 and Tiffany was 23. She'd got married two years previously. Now her marriage was on the rocks and divorce seeme… [+11164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lindsey Lopez", "title": "Spring has sprung at Build-A-Bear, with sweet stuffed pals for every occasion", "description": "Spring brings flowers — and its own special gifting occasions. Easter, Mother's Day, graduations, and of course our Taurus and Gemini birthdays! Plus there could be bridal showers, there's Father's Day...need we go on? You may have quite the shopping list, bu…", "url": "https://www.cnn.com/2022/03/31/cnn-underscored/build-a-bear-easter-mothers-day/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220330162639-hero-build-a-bear.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T20:13:09Z", "content": "Spring brings flowers and its own special gifting occasions. Easter, Mothers Day, graduations, and of course our Taurus and Gemini birthdays! Plus there could be bridal showers, theres Fathers Daynee… [+3240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Chris Paul and Taraji P. Henson appointed to Biden's HBCU advisory board", "description": "President Joe Biden will announce Thursday that he is appointing more than a dozen top education leaders, celebrities and athletes to his board of advisers on historically Black colleges and universities, the White House said.", "url": "https://www.cnn.com/2022/03/31/politics/biden-hbcu-advisory-board-appointees/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331144030-01-biden-hbcu-advisory-board-appointees-split-super-tease.jpg", "publishedAt": "2022-03-31T20:12:11Z", "content": "(CNN)President Joe Biden will announce Thursday that he is appointing more than a dozen top education leaders, celebrities and athletes to his board of advisers on historically Black colleges and uni… [+2364 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael D'Antonio", "title": "Opinion: Even Russia's ruthless war in Ukraine can't get Trump to give up his Putin fixation", "description": "Michael D'Antonio writes former President Donald Trump is resorting to a desperate, yet painfully familiar strategy in a bid to hurt President Joe Biden. It seems Trump is only getting worse -- and closer to the extreme point where his gross insensitivity cou…", "url": "https://www.cnn.com/2022/03/31/opinions/trump-putin-russia-fixation-dantonio/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220315233834-trump-putin-super-tease.jpg", "publishedAt": "2022-03-31T20:07:40Z", "content": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author, with Peter Eisner, of the book \"High Crimes: The Corruption, Impunity, and Impeachme… [+4660 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Would-be star witness Michael Cohen slams unraveling of Manhattan criminal probe into Trump", "description": "Michael Cohen, formerly one of Donald Trump's top confidantes before turning against him to become the star witness in the investigation into the New York real estate mogul's business and finances, is \"disappointed\" by reports that the Manhattan district atto…", "url": "https://www.cnn.com/2022/03/31/politics/michael-cohen-trump-new-york-investigation-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331113546-michael-cohen-screengrab-0331-cnn-super-tease.jpg", "publishedAt": "2022-03-31T20:06:36Z", "content": "(CNN)Michael Cohen, formerly one of Donald Trump's top confidantes before turning against him to become the star witness in the investigation into the New York real estate mogul's business and financ… [+4253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Sam Fossum, CNN", "title": "Biden says US still looking for clear answers on Putin's next moves", "description": "President Joe Biden said Thursday that he remains \"skeptical\" that Russian President Vladimir Putin will withdraw all of his forces from around the Ukrainian capital of Kyiv, suggesting the United States is still working to fully understand the Russian milita…", "url": "https://www.cnn.com/2022/03/31/politics/biden-russia-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220326185548-biden-file-0315-super-tease.jpg", "publishedAt": "2022-03-31T19:59:08Z", "content": "(CNN)President Joe Biden said Thursday that he remains \"skeptical\" that Russian President Vladimir Putin will withdraw all of his forces from around the Ukrainian capital of Kyiv, suggesting the Unit… [+2920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Razzies rescind Bruce Willis award after family reveals actor has aphasia", "description": "The Razzies, a tongue-in-cheek award show that hands out honors to the worst cinema of the year, has rescinded its prize for Bruce Willis after the actor's family revealed he is struggling with aphasia, a medical condition that affects his cognitive abilities.", "url": "https://www.cnn.com/2022/03/31/entertainment/razzies-bruce-willis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331151759-cosmic-sin-bruce-willis-super-tease.jpg", "publishedAt": "2022-03-31T19:37:02Z", "content": "(CNN)The Razzies, a tongue-in-cheek award show that hands out honors to the worst cinema of the year, has rescinded its prize for Bruce Willis after the actor's family revealed he is struggling with … [+2414 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Allison Hope", "title": "Tremendous news for women's sports", "description": "I am hopeful that the toddlers, both boys and girls, playing together on the tee ball fields across America today, will see themselves reflected in equal numbers -- in representation, treatment and earning potential -- when they are grown, writes Allison Hope", "url": "https://www.cnn.com/2022/03/31/opinions/womens-sports-gap-hope/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220325102911-alexis-hopkins-first-woman-professioinal-baseball-super-tease.jpg", "publishedAt": "2022-03-31T19:28:56Z", "content": "Allison Hope is a writer whose work has been featured by The New York Times, The Washington Post, CNN, Slate and elsewhere. The views expressed here are the author's. Read more opinion on CNN.\r\n (CNN… [+7984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Federal judge strikes down several provisions of the Florida election rules overhaul passed by Republicans last year", "description": "A federal judge in Florida on Thursday struck down several aspects of the election rules overhaul passed by Republicans in the state last year.", "url": "https://www.cnn.com/2022/03/31/politics/florida-voting-overhaul-judge-strikes-down/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220324134516-florida-election-workers-2020.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T19:15:28Z", "content": "A federal judge in Florida on Thursday struck down several aspects of the election rules overhaul passed by Republicans in the state last year.\r\nUS District Judge Mark Walkers scathing, 288-page opin… [+3324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby", "title": "Senators push to extend pandemic school lunch waivers", "description": "A bipartisan group of senators is trying to extend pandemic school meal waivers that gave districts extra federal funds and flexibilities to provide free food to more kids and to cope with supply chain and labor issues.", "url": "https://www.cnn.com/2022/03/31/politics/school-lunch-covid-waivers-extension-congress/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220329162139-school-lunch-nyc-0204.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T19:03:57Z", "content": "A bipartisan group of senators is trying to extend pandemic school meal waivers that gave districts extra federal funds and flexibilities to provide free food to more kids and to cope with supply cha… [+4528 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Chatterley", "title": "World Bank President: How we can ease food shortages", "description": "CNN's Julia Chatterley spoke with World Bank Group President David Malpass on Wednesday about the aid, and what else can be done to address global hunger.", "url": "https://www.cnn.com/2022/03/31/perspectives/world-bank-president-russia-ukraine-food/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331142525-restricted-ukraine-food-supplies-kyiv-0301.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T18:58:48Z", "content": "Editors Note: This interview has been edited for length and clarity.\r\nRussias invasion of Ukraine has the world heading toward a global food crisis that could impact millions of people. \r\nBut things … [+6654 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "Scientists sequence the complete human genome for the first time", "description": "In 2003, the Human Genome Project made history when it sequenced 92% of the human genome. But for nearly two decades since, scientists have struggled to decipher the remaining 8%. Now, a team has unveiled the complete human genome.", "url": "https://www.cnn.com/2022/03/31/health/first-complete-human-genome-sequence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/140916135749-01-dna-helix-0916-story-top.jpg", "publishedAt": "2022-03-31T18:53:40Z", "content": "(CNN)In 2003, the Human Genome Project made history when it sequenced 92% of the human genome. But for nearly two decades since, scientists have struggled to decipher the remaining 8%. Now, a team of… [+4810 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "US and coalition forces could have done more to decrease civilian harm in 2017 battle for Raqqa, Syria, think tank report finds", "description": "US and coalition forces that fought in Syria in 2017 to recapture the city of Raqqa from ISIS could have done more to decrease harm done to civilians living in the city during the months-long battle, a think tank report released on Thursday found.", "url": "https://www.cnn.com/2022/03/31/politics/raqqa-civilian-casualties-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190129160900-02-fall-of-raqqa-file-super-tease.jpg", "publishedAt": "2022-03-31T18:44:47Z", "content": "Washington (CNN)US and coalition forces that fought in Syria in 2017 to recapture the city of Raqqa from ISIS could have done more to decrease harm done to civilians living in the city during the mon… [+3399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what's streaming in April", "description": "A look at some of the shows and movies streaming on Netflix, Amazon, Hulu and Disney+ in April.", "url": "https://www.cnn.com/2022/03/31/entertainment/gallery/new-april-streaming-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220329222554-08-netflix-grace-and-frankie-super-tease.jpg", "publishedAt": "2022-03-31T18:32:13Z", "content": "Updated 2:32 PM ET, Thu March 31, 2022"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathan Hodge, CNN", "title": "Chernobyl: Russian forces have left, Ukraine says", "description": "Russian forces have withdrawn from Chernobyl, the site of the world's worst nuclear disaster, the state enterprise overseeing Ukraine's nuclear power plants said on Thursday.", "url": "https://www.cnn.com/2022/03/31/europe/ukraine-chernobyl-russia-withdrawal-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220224135422-02-chernobyl-russian-tanks-0224-super-tease.jpg", "publishedAt": "2022-03-31T18:16:28Z", "content": "Lviv, Ukraine (CNN)Russian forces have withdrawn from Chernobyl, the site of the world's worst nuclear disaster, the state enterprise overseeing Ukraine's nuclear power plants said on Thursday. \r\n\"It… [+3353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox and Manu Raju, CNN", "title": "Bipartisan deal struck 'in principle' on $10 billion Covid-19 aid package, Romney says", "description": "Utah GOP Sen. Mitt Romney said Thursday that Republicans have struck an \"agreement in principle\" with Democrats on a $10 billion package to help US efforts to combat the Covid-19 pandemic, a breakthrough that could pave the way for new funds to help the Unite…", "url": "https://www.cnn.com/2022/03/31/politics/covid-relief-negotiations-congress-mitt-romney/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220227160527-mitt-romney-file-2021-super-tease.jpg", "publishedAt": "2022-03-31T18:13:52Z", "content": "(CNN)Utah GOP Sen. Mitt Romney said Thursday that Republicans have struck an \"agreement in principle\" with Democrats on a $10 billion package to help US efforts to combat the Covid-19 pandemic, a bre… [+3681 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Nickeas, CNN", "title": "'The answer is not to defund.' Here's what's in President Biden's increased budget for policing", "description": "Billions of dollars to address America's exploding gun trafficking problem, to catch dangerous fugitives, and to fund initiatives at local law enforcement agencies. The increased funding for those items are at the heart of President Joe Biden's expanded polic…", "url": "https://www.cnn.com/2022/03/31/us/biden-police-budget-increase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331071741-01-chicago-police-file-super-tease.jpg", "publishedAt": "2022-03-31T18:05:18Z", "content": "(CNN)Billions of dollars to address America's exploding gun trafficking problem, to catch dangerous fugitives, and to fund initiatives at local law enforcement agencies.\r\nThe increased funding for th… [+4558 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathaniel Meyersohn", "title": "The battle for Kohl's is heating up", "description": "Kohl's is pushing back against intense pressure from Wall Street to make changes or sell the company.", "url": "https://www.cnn.com/2022/03/31/business/kohls-stock-activist-investor/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331104433-01-kohls-store-0124.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T18:00:56Z", "content": "Kohls is pushing back against intense pressure from Wall Street to make changes or sell the company.\r\nThe retailer sent a sharply worded letter to shareholders Thursday ahead of the its annual meetin… [+2769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Chris Pine told a confused Oscars partygoer that he was Chris Evans of 'Captain America'", "description": "Pine, star of \"Wonder Woman\" and \"Star Trek,\" told Jimmy Kimmel that he lied to a partygoer and told him he was in fact Chris Evans, who played Captain America in many a Marvel film, after the man mistook him for Joey Lawrence.", "url": "https://www.cnn.com/2022/03/31/entertainment/chris-pine-jimmy-kimmel-chris-evans-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331121143-chris-pine-0327-restricted-super-tease.jpg", "publishedAt": "2022-03-31T17:36:45Z", "content": "(CNN)Many know Chris Pine as the blue-eyed, Captain Kirk-portraying member of the Hollywood Chrises (other members: Evans, Hemsworth, Pratt). \r\nA partygoer at an Oscars shindig over the weekend knew … [+1262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine E. Shoichet, CNN", "title": "We're expecting a big increase in migrants at the US-Mexico border. But this time is different. Here's why", "description": "A big increase of migrants is expected at the US-Mexico border. But some key details are different this time. Here's a look at what's changing and why it's happening now.", "url": "https://www.cnn.com/2022/03/31/politics/border-title-42-whats-next-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331115021-01-us-mexico-border-super-tease.jpg", "publishedAt": "2022-03-31T17:33:17Z", "content": "(CNN)More migrants are coming to the US-Mexico border, and officials say they expect the number to grow. \r\nThis is something we've seen many times before. But some key details are different this time… [+6224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "First lawsuit filed over Florida law restricting certain LGBTQ topics in the classroom", "description": "Two LGBTQ rights advocacy groups, as well as students, parents and a teacher in Florida, filed a federal lawsuit Thursday, challenging the state's new law banning certain instruction about sexual orientation and gender identity in the classroom.", "url": "https://www.cnn.com/2022/03/31/politics/florida-dont-say-gay-lgbtq-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331132501-dont-say-gay-protest-florida-0306-super-tease.jpg", "publishedAt": "2022-03-31T17:32:23Z", "content": "(CNN)Two LGBTQ rights advocacy groups, as well as students, parents and a teacher in Florida, filed a federal lawsuit Thursday, challenging the state's new law banning certain instruction about sexua… [+2814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien", "title": "Amazon union vote counts are underway for two warehouses", "description": "Amazon has gone 27 years without a union in the United States. Now it's about to find out whether workers at two warehouses have voted to unionize.", "url": "https://www.cnn.com/2022/03/31/tech/amazon-union-elections-bessemer-staten-island/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220329130202-amazon-bessemer-alabama-rwdsu-rally-0226-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T17:25:33Z", "content": "Amazon has gone 27 years without a union in the United States. Now its about to find out whether workers at two warehouses have voted to unionize.\r\nVote tallies in a union election at an Amazon wareh… [+4887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "The *real* reason so many Republicans are mad at Madison Cawthorn", "description": "Last month, Republican Reps. Marjorie Taylor Greene and Paul Gosar addressed a conference organized by a well-known White nationalist.", "url": "https://www.cnn.com/2022/03/31/politics/madison-cawthorn-republicans-cocaine-orgy-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331114101-03-rep-madison-cawthorn-sotu-super-tease.jpg", "publishedAt": "2022-03-31T17:00:55Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash", "title": "'Summer of Soul' producer says Will Smith and Chris Rock robbed the documentary of its moment", "description": "Joseph Patel, one of the producers behind Oscar-winning documentary \"Summer of Soul,\" has spoken out about the slapping incident for the first time, calling Will Smith's actions \"selfish\" and admonishing Chris Rock for comments he made when awarding the film.", "url": "https://www.cnn.com/2022/03/31/entertainment/summer-of-soul-oscars-slap-joseph-patel-rock-smith-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331111910-02-patel-summer-of-soul-oscars.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T16:14:54Z", "content": "Joseph Patel, one of the producers behind Oscar-winning documentary Summer of Soul, has spoken out about the slapping incident for the first time, calling Will Smiths actions selfish and admonishing … [+2290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caitlin Kaiser,Brandon Miller", "title": "This month set another record for most tornadoes in March. It may be a sign of more disastrous outbreaks", "description": "This month has seen more tornadoes in the US than any March on record following this week's severe weather outbreak.", "url": "https://www.cnn.com/2022/03/31/weather/march-tornado-record-climate/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331102315-01-louisiana-tornado-damage-0323.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T16:11:38Z", "content": "This month has seen more tornadoes in the US than any March on record following this weeks severe weather outbreak. \r\nIts the second year in a row the country has endured a record number of tornadoes… [+3743 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez, CNN", "title": "She helped rebuild Kyiv after World War II. Now, she's had to flee it", "description": "Even as the bombs began to fall, Yevhenia Khomenko didn't want to leave her home in Kyiv, Ukraine. \"I would rather die there,\" the 94-year-old said. But eventually, it became too much, and her daughter convinced her to leave the home she had known her entire …", "url": "https://www.cnn.com/2022/03/31/us/ukraine-russia-war-refugees-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330161705-01-khomenko-ukraine-flee-russia-invasion-super-tease.jpg", "publishedAt": "2022-03-31T16:04:00Z", "content": "(CNN)Even as the bombs began to fall, Yevhenia Khomenko didn't want to leave her home in Kyiv, Ukraine. \"I would rather die there,\" the 94-year-old said. But eventually, it became too much, and her d… [+5620 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Turkish prosecutor requests transfer of Khashoggi trial to Saudi Arabia", "description": "A Turkish prosecutor called on Thursday for the trial in Istanbul of Saudi suspects over the killing of journalist Jamal Khashoggi to be halted and transferred to Saudi authorities, a move which comes as Turkey seeks to mend ties with Riyadh.", "url": "https://www.cnn.com/2022/03/31/europe/turkish-prosecutor-khashoggi-trial-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331105244-01-kashoggi-vigil-2018-super-tease.jpg", "publishedAt": "2022-03-31T15:29:53Z", "content": "A Turkish prosecutor called on Thursday for the trial in Istanbul of Saudi suspects over the killing of journalist Jamal Khashoggi to be halted and transferred to Saudi authorities, a move which come… [+2893 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Georgia says 'unacceptable' for breakaway region to vote on joining Russia", "description": "Georgia said on Thursday that plans by the Russian-backed breakaway region of South Ossetia to hold a referendum on joining Russia were unacceptable, while the Kremlin stressed no action had been taken to make that happen.", "url": "https://www.cnn.com/2022/03/31/europe/georgia-south-ossetia-russia-vote-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331110212-georgia-south-ossetia-russia-vote-intl-super-tease.jpg", "publishedAt": "2022-03-31T15:27:20Z", "content": "Georgia said on Thursday that plans by the Russian-backed breakaway region of South Ossetia to hold a referendum on joining Russia were unacceptable, while the Kremlin stressed no action had been tak… [+1711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "American teacher who taught Ukrainian mom English raises funds to help her flee", "description": "A Ukrainian mom shares her story of fleeing to safety and the Maryland teacher who is trying to help.", "url": "https://www.cnn.com/2022/03/31/us/teacher-connection-with-ukrainian-family/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220327163051-01-ukraine-mom-gets-help-from-american-teacher-super-tease.jpg", "publishedAt": "2022-03-31T15:25:30Z", "content": "(CNN)Julia Temchenko and her two young children were in their living room in Kyiv, Ukraine when a rocket flew past, shattering the window. For so long, she believed Russia wouldn't actually invade. T… [+2870 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, Zachary Cohen, Paula Reid and Whitney Wild, CNN", "title": "Federal prosecutors expand criminal probe into January 6, examining rally planning and fake electors", "description": "Federal criminal investigators have expanded the January 6 investigation to gather information about fundraising and organizing for the political rally immediately before Trump supporters stormed the US Capitol, as well as the effort to subvert the Electoral …", "url": "https://www.cnn.com/2022/03/31/politics/january-6-criminal-probe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220105134040-04-jan-6-committee-pivotal-year-trump-super-tease.jpg", "publishedAt": "2022-03-31T15:24:43Z", "content": "Washington (CNN)Federal criminal investigators have expanded the January 6 investigation to gather information about fundraising and organizing for the political rally immediately before Trump suppor… [+3453 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay", "title": "Lewis Hamilton opens up on struggling 'mentally and emotionally for a long time'", "description": "Formula One driver Lewis Hamilton said he has \"struggled mentally and emotionally for a long time\" in a candid social media post on Thursday.", "url": "https://www.cnn.com/2022/03/31/motorsport/lewis-hamilton-mental-health-f1-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331153713-lewis-hamilton.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T14:56:34Z", "content": "Formula One driver Lewis Hamilton said he has struggled mentally and emotionally for a long time in a candid social media post on Thursday. \r\nWriting in an Instagram Story, the seven-time F1 champion… [+1767 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathan Hodge", "title": "Russia says its military is regrouping. A ramped-up assault on eastern Ukraine could be next", "description": "Russia's military says it has moved on to a new phase of its so-called \"special military operation\" in Ukraine, claiming that it is shifting its focus to the Donbas region in Ukraine's east.", "url": "https://www.cnn.com/2022/03/31/europe/ukraine-russia-troops-regrouping-intl-cmd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331095033-01-russian-soldiers-volnovakha-0326.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T14:48:53Z", "content": "Russias military says it has moved on to a new phase of its so-called special military operation in Ukraine, claiming that it is shifting its focus to the Donbas region in Ukraines east.\r\nIs this reg… [+6668 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Here's *exactly* why Joe Biden's poll numbers aren't getting better", "description": "Usually when the United States is involved in an international crisis, the president of the United States experiences a bit of a poll bump -- a rally 'round the flag effect that politically benefits the commander-in-chief.", "url": "https://www.cnn.com/2022/03/31/politics/biden-polling-inflation-russia-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220311150137-03-biden-0311-super-tease.jpg", "publishedAt": "2022-03-31T14:46:33Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter", "title": "Who should be getting a 2nd coronavirus booster shot? Our medical expert explains", "description": "CNN Medical Analyst Dr. Leana Wen answers questions about who should get an additional vaccine dose and what are the factors people might want to consider.", "url": "https://www.cnn.com/2022/03/31/health/vaccine-covid-booster-omicron-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331092443-covid-booster-california-0330-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T14:23:46Z", "content": "On Tuesday, the US Food and Drug Administration expanded its authorization of the Pfizer/BioNTech and Moderna Covid-19 vaccines. Now, adults ages 50 and older are able to get a second booster if at l… [+7164 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner", "title": "How restaurants charge more but make you feel like you're getting a bargain", "description": "Restaurants are raising menu prices as wages grow and inflation hits ingredients and packaging. But they still want customers to feel like they're getting a good deal.", "url": "https://www.cnn.com/2022/03/31/business/restaurant-prices-value/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220330202740-03-restaurant-prices-value.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T14:16:32Z", "content": "Restaurants are raising menu prices as wages grow and inflation hits ingredients and packaging. But they still want customers to feel like theyre getting a good deal. \r\nThats a tricky proposal, espec… [+5054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, CNN", "title": "Former Vice President Mike Pence rolls out new policy agenda for GOP leaders, candidates", "description": "Former Vice President Mike Pence has debuted a new conservative policy platform that aims to give Republicans a road map as they campaign for reelection this fall -- but it could also become his own platform should he run for president in 2024.", "url": "https://www.cnn.com/2022/03/31/politics/mike-pence-republican-agenda-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331092636-mike-pence-0217-super-tease.jpg", "publishedAt": "2022-03-31T14:00:39Z", "content": "(CNN)Former Vice President Mike Pence has debuted a new conservative policy platform that aims to give Republicans a road map as they campaign for reelection this fall -- but it could also become his… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Apollo 10 1/2' turns Richard Linklater's space-age memories into warm '60s nostalgia", "description": "Deeply personal in a way that should resonate with anyone who lived through the era (and maybe few others), Richard Linklater's \"Apollo 10 ½: A Space Age Childhood\" captures the infinite possibilities the space program conjured and the quirks associated with …", "url": "https://www.cnn.com/2022/03/31/entertainment/apollo-10-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330024157-apollo-10-1-2-still-netflix-super-tease.jpg", "publishedAt": "2022-03-31T13:48:22Z", "content": "(CNN)Deeply personal in a way that should resonate with anyone who lived through the era (and maybe few others), Richard Linklater's \"Apollo 10 ½: A Space Age Childhood\" captures the infinite possibi… [+2865 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Morbius' is better than 'Venom,' but the villain origin story is still a little anemic", "description": "As Marvel movies go, \"Morbius\" is more a sip than a gulp, a relatively small-boned Jekyll-and-Hyde tale that moves another Spider-Man villain into the spotlight. Significantly better than \"Venom\" but still somewhat lacking in bite, this origin story perhaps i…", "url": "https://www.cnn.com/2022/03/31/entertainment/morbius-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220328132952-03-morbius-super-tease.jpg", "publishedAt": "2022-03-31T13:39:42Z", "content": "(CNN)As Marvel movies go, \"Morbius\" is more a sip than a gulp, a relatively small-boned Jekyll-and-Hyde tale that moves another Spider-Man villain into the spotlight. Significantly better than \"Venom… [+2904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy", "title": "Nearly all American women agree the pandemic changed their lives, but their experiences vary drastically. Here's why.", "description": "Results from recent CNN As Equals poll show the complicated demographic and partisan divides that shaped the Covid-19's impact across the US.", "url": "https://www.cnn.com/2022/03/31/us/us-women-covid-pandemic-experiences-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220324091915-20220324-us-international-womens-day-poll-super-tease.jpg", "publishedAt": "2022-03-31T13:34:41Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)It's hard to believe more than two year… [+9461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "X gender marker option on passport applications to be available in April, Blinken says", "description": "US citizens will have the option to select \"X\" when identifying their gender on US passport applications starting in April and on other documents, Secretary of State Antony Blinken said Thursday.", "url": "https://www.cnn.com/2022/03/31/politics/gender-x-passport-applications/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331082430-03-us-passport-file-super-tease.jpg", "publishedAt": "2022-03-31T13:22:11Z", "content": "(CNN)US citizens will have the option to select \"X\" when identifying their gender on US passport applications starting in April and on other documents, Secretary of State Antony Blinken said Thursday… [+1981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz", "title": "3 Democrats join Republicans in sinking Biden nominee to lead Labor division", "description": "Three moderate Senate Democrats joined Republicans on Wednesday night in voting against advancing President Joe Biden's nominee to head the Labor Department's Wage and Hour Division.", "url": "https://www.cnn.com/2022/03/31/politics/sinema-manchin-kelly-democratic-senators-republicans-david-weil/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331085602-manchin-sinema-kelly-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T13:07:24Z", "content": "Three moderate Senate Democrats joined Republicans on Wednesday night in voting against advancing President Joe Bidens nominee to head the Labor Departments Wage and Hour Division.\r\nDemocratic Sens. … [+1222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Cooban", "title": "Germans 'will be poorer' because of the war in Ukraine", "description": "Germany \"will be poorer\" because of Russia's assault on Ukraine, the government's economy minister has warned, as soaring energy prices fuel record inflation and threaten to tip Europe's biggest economy into a recession.", "url": "https://www.cnn.com/2022/03/31/business/germany-economy-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331062757-robert-habeck-presser-03302022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T12:55:04Z", "content": "Germany will be poorer because of Russias assault on Ukraine, the governments economy minister has warned, as soaring energy prices fuel record inflation and threaten to tip Europes biggest economy i… [+1912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "She's up for two Grammys. Her bestseller will be a movie. Meet the Korean American who's shaking up entertainment", "description": "Michelle Zauner fronts the rock band Japanese Breakfast -- up for best new artist at Sunday's Grammys -- and is writing the screenplay for \"Crying in H Mart,\" based on her bestselling memoir.", "url": "https://www.cnn.com/2022/03/31/entertainment/michelle-zauner-grammys-book-movie-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220328135303-03-michelle-zauner.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T12:45:34Z", "content": "As Covid cases decline and the world reopens, Michelle Zauner is having a moment.\r\nHer indie rock band, Japanese Breakfast, has been nominated for two Grammys best new artist and best alternative mus… [+8158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "A Covid-19 spike like the one in China is unlikely in the US, experts say. Here's why", "description": "The Omicron coronavirus variant may be reaching around the world, but different places are seeing significantly different effects.", "url": "https://www.cnn.com/2022/03/31/health/covid-19-china-us-different/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220329180612-04-covid-19-china-and-us-super-tease.jpg", "publishedAt": "2022-03-31T11:29:42Z", "content": "(CNN)The Omicron coronavirus variant may be reaching around the world, but different places are seeing significantly different effects.\r\nIn the United States, Covid-19 case numbers have been falling … [+9567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace", "title": "America's home builders are getting squeezed by the war in Ukraine. Here's how", "description": "The geopolitical conflict on the other side of the world is hitting commodities such as oil and metals, leaving US home builders to brace for further cost hikes and delays.", "url": "https://www.cnn.com/2022/03/31/economy/home-construction-oil-commodities-volatility/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220328163047-home-construction-california-0323.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T10:57:23Z", "content": "For the past few years, developer and home builder Estridge Homes could bank on the price quotes it received for asphalt holding steady for at least nine months. \r\nThat window is now 15 days.\r\nFor ma… [+7652 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadia Kounang,Deidre McPhillips", "title": "In about half of US counties, less than 10% of children ages 5 to 11 are fully vaccinated against Covid-19", "description": "The youngest group eligible to be vaccinated against Covid-19 in the US, children ages 5 to 11, is also the least vaccinated one.", "url": "https://www.cnn.com/2022/03/31/health/kids-low-covid-vaccination-rates/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220330134643-hp-only-20220330-us-vax-rate-map-children.png?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T10:46:21Z", "content": "The youngest group eligible to be vaccinated against Covid-19 in the US, children ages 5 to 11, is also the least vaccinated one.\r\nIn about half of US counties, less than 10% of children 5 to 11 are … [+7173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "Here's when you'll get some relief from high energy prices", "description": "Oil prices will probably stay near triple-digits and could even spike to $150 a barrel if the war in Ukraine severely disrupts Russia's energy supplies, Joe McMonigle, the secretary general of the International Energy Forum, told CNN.", "url": "https://www.cnn.com/2022/03/31/energy/gas-prices-russia-ukraine-war/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330153214-02-russia-oil-recession-super-tease.jpg", "publishedAt": "2022-03-31T10:31:12Z", "content": "New York (CNN Business)Oil prices will probably stay near triple-digits and could even spike to $150 a barrel if the war in Ukraine severely disrupts Russia's energy supplies, Joe McMonigle, the secr… [+3838 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "AJ Willingham", "title": "5 things to know for March 31: Ukraine, Abortion, Gas prices, Immigration, Iran", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/03/31/us/five-things-march-31-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331094200-lukianivka-attack.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T10:22:42Z", "content": "Housing prices are continuing to inflate wildly in the US. While that doesnt always mean a housing bubble is brewing, unfortunately in this case, some economists fear it does. \r\nHeres what you need t… [+5984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Douglas London", "title": "Why Russia's elite are the key to Putin's downfall", "description": "In the multi-level chess game of internal Russian power dynamics, the last thing those within the Kremlin who might consider moving against Vladimir Putin need -- whether to alter his direction on the war or remove him outright -- is public encouragement from…", "url": "https://www.cnn.com/2022/03/31/opinions/russia-elite-putin-opinion-london/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220325191418-amanpour-putin.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T10:07:19Z", "content": "Editors Note: Douglas London is the author of The Recruiter: Spying and the Lost Art of American Intelligence. He teaches intelligence studies at Georgetown Universitys School of Foreign Service and … [+8764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tamara Hardingham-Gill, CNN", "title": "The traveler who's been globetrotting for nearly 10 years", "description": "Dutch traveler Tom Grond set off on a round-the-world trip in December 2012 and has since visited nearly 130 countries, including Syria and Niger. He now describes himself as a \"nomad\" and says he has no plans to return to his former life.", "url": "https://www.cnn.com/travel/article/traveler-globetrotting-for-nearly-a-decade/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331103922-travel-tom-tz-super-tease.jpg", "publishedAt": "2022-03-31T09:44:28Z", "content": "(CNN) He set off on a round-the-world trip in December 2012 and, nearly a decade later, traveler Tom Grond is still globetrotting. \r\nThe Dutch blogger, who previously worked for the Netherlands gover… [+8511 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "China's economy hit by double whammy in March", "description": "Activity in Chinese manufacturing and services simultaneously contracted in March for the first time since the height of the country's Covid-19 outbreak in 2020, adding to the urgency for more policy intervention to stabilize the economy.", "url": "https://www.cnn.com/2022/03/31/economy/china-economy-pmi-contraction-hnk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331044237-02-china-factory-03302022-super-tease.jpg", "publishedAt": "2022-03-31T09:36:22Z", "content": "BeijingActivity in Chinese manufacturing and services simultaneously contracted in March for the first time since the height of the country's Covid-19 outbreak in 2020, adding to the urgency for more… [+3537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "Tennessee wildfire near Gatlinburg area prompts evacuations and school closures", "description": "A wildfire in Sevier County, Tennessee, has quickly grown to about 1,000 acres, prompting officials to close schools in the county Thursday.", "url": "https://www.cnn.com/2022/03/31/weather/tennessee-brush-fire-evacuations/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331032125-tennessee-brushfire-03302022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T09:32:27Z", "content": "A wildfire in Sevier County, Tennessee, has quickly grown to about 1,000 acres, prompting officials to close schools in the county Thursday.\r\nThe Sevier County School System is canceling classes out … [+1910 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Tornado conditions possible in parts of Mississippi and Alabama as storm heads east", "description": "The forceful storm that flattened buildings in a northwest Arkansas city Wednesday is taking aim Thursday at parts of Mississippi and Alabama, where some areas are being warned of the potential for dangerous tornadoes.", "url": "https://www.cnn.com/2022/03/31/weather/tornado-forecast-storm-threat-south-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331011335-mississippi-tornado-warning-03302022-super-tease.jpg", "publishedAt": "2022-03-31T08:43:24Z", "content": "(CNN)The forceful storm that flattened buildings in a northwest Arkansas city Wednesday is taking aim Thursday at parts of Mississippi and Alabama, where some areas are being warned of the potential … [+3843 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kikue Higuchi,Ben Church", "title": "Record crowd watches Barcelona thrash Real Madrid in Women's Champions League", "description": "History was made on Wednesday as 91,553 fans packed into Camp Nou -- the largest football stadium in Europe -- to watch the second leg of the UEFA Women's Champions League quarterfinal between Barcelona and Real Madrid.", "url": "https://www.cnn.com/2022/03/31/football/barcelona-real-madrid-womens-record-attendance-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220331083124-barcelona-celebrate.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T08:30:33Z", "content": "History was made on Wednesday as 91,553 fans packed into Camp Nou the largest football stadium in Europe to watch the second leg of the UEFA Womens Champions League quarterfinal between Barcelona and… [+2172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "Back from the brink: How 'frozen zoos' could save dying species", "description": "When Kurt Benirschke started collecting skin samples from rare and endangered animals in 1972, he didn't have a firm plan on what to do with them. As a researcher at the University of California San Diego, he believed that one day the tools would be developed…", "url": "https://www.cnn.com/2022/03/31/world/frozen-zoo-save-species-scn-c2e-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200226152607-captive-breeding-horse-intl-super-tease.jpg", "publishedAt": "2022-03-31T08:15:11Z", "content": "(CNN)When Kurt Benirschke started collecting skin samples from rare and endangered animals in 1972, he didn't have a firm plan on what to do with them. As a researcher at the University of California… [+8165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dorottya Rédai", "title": "How children became a tool in Orban's anti-LGBTQ propaganda", "description": "Ahead of a Hungarian referendum on content relating to sexual orientation in schools happening Sunday, LGBTQ activist Dorottya Rédai discusses the devastating impact of the government's rhetoric on her community.", "url": "https://www.cnn.com/2022/03/31/opinions/hungary-orban-lgbtq-referendum-redai/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210615090354-01-hungary-protest-lgbtq-rights-0614-super-tease.jpg", "publishedAt": "2022-03-31T08:00:15Z", "content": "Dorottya Rédai is an activist and academic who holds a PhD in gender studies from Central European University. She spearheaded the children's book \"A Fairytale for Everyone,\" which includes LGBTQ cha… [+7287 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Jessie Yeung, CNN", "title": "Russian Foreign Minister Sergey Lavrov visits China and India under shadow of Ukraine war", "description": "Russian Foreign Minister Sergey Lavrov is meeting his counterparts in China and India this week -- two countries under pressure to condemn Russia's actions in Ukraine as the death toll from the unprovoked conflict rises.", "url": "https://www.cnn.com/2022/03/31/asia/lavrov-russia-visits-china-india-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330224010-sergey-lavrov-wang-yi-0330-super-tease.jpg", "publishedAt": "2022-03-31T07:35:39Z", "content": "Hong Kong (CNN)Russian Foreign Minister Sergey Lavrov is meeting his counterparts in China and India this week -- two countries under pressure to condemn Russia's actions in Ukraine as the death toll… [+7330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon and Gawon Bae, CNN", "title": "North Korea not telling the whole truth about latest ICBM test, South Korean official says", "description": "North Korea's launch last week of an intercontinental ballistic missile (ICBM), reported to be its most formidable yet, may have been a less advanced weapon than previously believed, according to a South Korean military official.", "url": "https://www.cnn.com/2022/03/31/asia/north-korea-missile-test-misinformation-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330180600-kiim-jong-un-0324-super-tease.jpg", "publishedAt": "2022-03-31T06:12:02Z", "content": "Seoul, South Korea (CNN)North Korea's launch last week of an intercontinental ballistic missile (ICBM), reported to be its most formidable yet, may have been a less advanced weapon than previously be… [+5183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "'KPOP' musical set to debut on Broadway later this year", "description": "South Korea's distinctive music genre K-pop has been turned into a musical. \"KPOP\" will open on Broadway in New York later this year.", "url": "https://www.cnn.com/style/article/kpop-musical-broadway/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331001559-02-kpop-broadway-announcement-03302022-super-tease.jpg", "publishedAt": "2022-03-31T04:45:31Z", "content": "artsPublished 31st March 2022\r\nSouth Korea's distinctive music genre K-pop has been turned into a musical, \"KPOP,\" that will open on Broadway in New York later this year.\r\nLuna, a former member of K-… [+1288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas and Taylor Romine, CNN", "title": "Paul Herman, actor known for 'The Sopranos' and 'Goodfellas,' has died", "description": "Paul Herman, an actor known for his roles in \"The Sopranos,\" \"Goodfellas\" and \"The Irishman,\" has died, according to his manager.", "url": "https://www.cnn.com/2022/03/31/entertainment/paul-herman-actor-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220331000021-paul-herman-file-02202013-super-tease.jpg", "publishedAt": "2022-03-31T04:15:00Z", "content": "(CNN)Paul Herman, an actor known for his roles in \"The Sopranos,\" \"Goodfellas\" and \"The Irishman,\" has died, according to his manager. \r\nHe was 76, his IMDb page says. \r\n\"We are deeply saddened at th… [+424 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a> and Seán Federico O'Murchú, CNN", "title": "Russia invades Ukraine", "description": "Russian forces bombarded Kyiv and Chernihiv Wednesday -- a day after Moscow said it would \"drastically reduce\" its military assault on the two cities. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-03-31-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330124322-01-red-cross-warehouse-mariupol-super-tease.jpg", "publishedAt": "2022-03-31T04:01:47Z", "content": "Some European countries are heavily dependent on Russia for their gas supply. \r\nEuropean Commission President Ursula von der Leyen said earlier this month that EU leaders had agreed to spend the next… [+2583 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Seán Federico-O'Murchú", "title": "After an 8-year wait, the US men's soccer team will once again compete in a World Cup", "description": "After an eight-year wait, the US Men's National team secured a spot Wednesday in the 2022 FIFA World Cup, although not in a way the team would have preferred.", "url": "https://www.cnn.com/2022/03/30/sport/us-mens-soccer-world-cup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330233654-usa-soccer-03302022-restrcited-super-tease.jpg", "publishedAt": "2022-03-31T03:43:42Z", "content": "(CNN)After an eight-year wait, the US Men's National team secured a spot Wednesday in the 2022 FIFA World Cup, although not in a way the team would have preferred.\r\nIn its 14th and final match of CON… [+1098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Mena", "title": "Arizona GOP governor signs legislation requiring proof of citizenship to register to vote", "description": "Arizona Republican Gov. Doug Ducey on Wednesday signed legislation that would require all Arizonans to provide proof of citizenship and residency to register to vote, sparking criticism from voting rights advocates who say it will potentially cancel thousands…", "url": "https://www.cnn.com/2022/03/30/politics/arizona-proof-of-citizenship-voter-registration-law/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330181011-01-ducey-super-tease.jpg", "publishedAt": "2022-03-31T03:06:52Z", "content": "(CNN)Arizona Republican Gov. Doug Ducey on Wednesday signed legislation that would require all Arizonans to provide proof of citizenship and residency to register to vote, sparking criticism from vot… [+3014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar", "title": "Body of Naomi Irion, reported missing more than 2 weeks ago, has been found, police say", "description": "The body of Naomi Irion, a Nevada woman missing for more than two weeks, has been discovered, authorities in Nevada said Wednesday.", "url": "https://www.cnn.com/2022/03/30/us/naomi-irion-body-found-nevada/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220322172258-01-naomi-irion.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T03:05:47Z", "content": "The body of Naomi Irion, a Nevada woman missing for more than two weeks, has been discovered, authorities in Nevada said Wednesday.\r\nInvestigators were called to a remote part of Churchill County Tue… [+2235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch, CNN", "title": "Brian Laundrie's parents ask a court to dismiss the lawsuit filed by the family of Gabby Petito", "description": "In a motion filed Wednesday, the parents of Brian Laundrie asked a Florida court to dismiss a civil lawsuit brought by Gabby Petito's parents earlier this month.", "url": "https://www.cnn.com/2022/03/30/us/brian-laundrie-parents-motion-dismiss-civil-suit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210921094157-04-petito-laundrie-super-tease.jpg", "publishedAt": "2022-03-31T02:53:01Z", "content": "(CNN)In a motion filed Wednesday, the parents of Brian Laundrie asked a Florida court to dismiss a civil lawsuit brought by Gabby Petito's parents earlier this month.\r\nIn their lawsuit, Petito's pare… [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev and Travis Caldwell, CNN", "title": "Tampa Bay Buccaneers head coach Bruce Arians is stepping down and will join front office, team says", "description": "Tampa Bay Buccaneers head coach Bruce Arians has stepped down from the role and will join the team's front office, the Buccaneers announced Wednesday.", "url": "https://www.cnn.com/2022/03/30/sport/bruce-arians-retire-coach-tampa-bay-bucs-nfl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330211150-bruce-arians-030122-restricted-super-tease.jpg", "publishedAt": "2022-03-31T02:48:10Z", "content": "(CNN)Tampa Bay Buccaneers head coach Bruce Arians has stepped down from the role and will join the team's front office, the Buccaneers announced Wednesday.\r\nArians -- who led quarterback Tom Brady an… [+2984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "In China, luxury hotels are offering babysitting services to stressed out parents working from home", "description": "Several luxury hotels in Chinese cities are offering a solution for stressed out parents tryiing to work from home while also managing their kids' online learning during lockdowns: Studycations.", "url": "https://www.cnn.com/travel/article/china-luxury-hotels-studycations-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330112559-02-chinese-hotel-studycation-super-tease.jpg", "publishedAt": "2022-03-31T02:26:41Z", "content": "Maggie Hiufu Wong, CNNUpdated 31st March 2022\r\n(CNN) Though people in many parts of the world are heading back to the office and kids have returned to school, lockdowns continue across China as the c… [+4548 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Written by Julia Hollingsworth \nGraphics by Henrik Pettersson and Krystina Shveda", "title": "They were Covid-19 success stories -- then they saw massive outbreaks. These charts show what's really going on", "description": "Millions of people in China are under lockdown. Hong Kong morgues are overwhelmed. And South Korea is reporting the most cases per capita worldwide.", "url": "https://www.cnn.com/2022/03/30/asia/covid-case-asia-data-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220328061715-hong-kong-covid-031622-super-tease.jpg", "publishedAt": "2022-03-31T01:35:58Z", "content": "Written by Julia HollingsworthGraphics by Henrik Pettersson and Krystina Shveda\r\nUpdated 9:35 PM ET, Wed March 30, 2022\r\nHong Kong (CNN)Millions of people in China are under lockdown. Hong Kong morgu… [+7013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Grammy-winning singer Lizzo is launching a shapewear line called Yitty", "description": "The form-fitting bodysuits and undergarments that make up shapewear have become a lucrative business, with Spanx valued at $1.2 billion and Kim Kardashian's Skims brand propelling her to billionaire status. Now, singer and rapper Lizzo will enter the market n…", "url": "https://www.cnn.com/style/article/lizzo-shapewear-yitty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330144202-02-lizzo-shapeware-yitty-super-tease.jpg", "publishedAt": "2022-03-31T01:19:33Z", "content": "The form-fitting bodysuits and undergarments that make up shapewear have become a lucrative business, with Spanx valued at $1.2 billion and Kim Kardashian's Skims brand propelling her to billionaire … [+2173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg, CNN", "title": "Manson family member Leslie Van Houten parole reversed for the fifth time", "description": "California Gov. Gavin Newsom rejected the state's parole board recommendation to release Leslie Van Houten, a former Charles Manson follower and convicted murderer, from prison, saying she continues to pose a threat to public safety.", "url": "https://www.cnn.com/2022/03/30/us/leslie-van-houten-manson-follower-newsom-denies-parole-fifth-time/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330194957-01-leslie-van-houten-super-tease.jpg", "publishedAt": "2022-03-31T01:14:08Z", "content": "(CNN)California Gov. Gavin Newsom rejected the state's parole board recommendation to release Leslie Van Houten, a former Charles Manson follower and convicted murderer, from prison, saying she conti… [+1801 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kasie Hunt and Paul LeBlanc, CNN", "title": "January 6 committee member says panel is 'triangulating' to get 'fulsome picture' of Trump's actions", "description": "A member of the House select committee investigating the January 6, 2021, attack on the US Capitol said Wednesday that the panel is \"triangulating\" to get a \"fulsome picture\" of then-President Donald Trump's actions in the lead-up to the attack.", "url": "https://www.cnn.com/2022/03/30/politics/january-6-committee-trump-phone-logs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330163603-trump-jan-6-rally-super-tease.jpg", "publishedAt": "2022-03-31T01:06:00Z", "content": "Washington (CNN)A member of the House select committee investigating the January 6, 2021, attack on the US Capitol said Wednesday that the panel is \"triangulating\" to get a \"fulsome picture\" of then-… [+2309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Baier,Vanessa Lamers", "title": "We want our kids vaccinated -- but we can't rush the process", "description": "Rosa Baier and Vanessa Lamers write that following the data on Pfizer and Moderna's vaccines -- and the rigorous FDA authorization process -- has given them confidence in the vaccines' safety.", "url": "https://www.cnn.com/2022/03/30/opinions/moderna-vaccine-children-covid-19-fda-baier-lamers/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220209163215-covid-vaccine-kids-california-0119.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-31T00:16:27Z", "content": "Editors Note: Rosa Baier, MPH, is an associate professor of practice at the Brown University School of Public Health. Her children are participating in Modernas Covid-19 vaccine trial. Vanessa Lamers… [+5362 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Virginia Langmaid and Nick Valencia, CNN", "title": "State police won't comment on audio obtained by AP of investigators grilling state trooper at center of Ronald Greene killing", "description": "A former Louisiana State Police officer, who on body camera video can be heard saying that he \"beat the ever-living f**k out of\" dead Black motorist Ronald Greene, told investigators during an interview 16 months after the incident that he was \"scared,\" portr…", "url": "https://www.cnn.com/2022/03/30/us/ronald-greene-louisiana-hollingsworth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330180351-01-ronald-green-death-audio-super-tease.jpg", "publishedAt": "2022-03-30T22:39:34Z", "content": "(CNN)A former Louisiana State Police officer, who on body camera video can be heard saying that he \"beat the ever-living f**k out of\" dead Black motorist Ronald Greene, told investigators during an i… [+4742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Judge holds Alex Jones in contempt of court for refusing to appear for Sandy Hook depositions", "description": "A Connecticut judge is holding notorious conspiracy theorist Alex Jones in contempt of court after he failed to comply with multiple orders for Jones to sit for a deposition in a defamation suit brought against him by families of victims of the Sandy Hook sho…", "url": "https://www.cnn.com/2022/03/30/media/sandy-hook-alex-jones-contempt-of-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330162203-03-alex-jones-2020-file-super-tease.jpg", "publishedAt": "2022-03-30T21:51:54Z", "content": "New York (CNN Business)A Connecticut judge is holding notorious conspiracy theorist Alex Jones in contempt of court after he failed to comply with multiple orders for Jones to sit for a deposition in… [+3993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "The Hunter Biden soap opera is far from over", "description": "A federal investigation into the President's son is gaining steam, there are new details about his foreign business dealings, and he is again the subject of Republican scrutiny.", "url": "https://www.cnn.com/2022/03/30/politics/hunter-biden-investigation-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330151312-hunter-biden-2016-super-tease.jpg", "publishedAt": "2022-03-30T21:51:45Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\n (CNN)These are some of the broad outlines of the sad, sordid soap opera of Hunter … [+5907 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Arizona governor signs bill outlawing gender-affirming care for transgender youth and approves anti-trans sports ban", "description": "Republican Gov. Doug Ducey of Arizona on Wednesday signed two bills into law targeting transgender youth in the state, including one that restricts access to gender-affirming health care for minors.", "url": "https://www.cnn.com/2022/03/30/politics/arizona-transgender-health-care-ban-sports-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330153031-01-doug-ducey-file-super-tease.jpg", "publishedAt": "2022-03-30T21:35:48Z", "content": "Washington (CNN)Republican Gov. Doug Ducey of Arizona on Wednesday signed two bills into law targeting transgender youth in the state, including one that restricts access to gender-affirming health c… [+5976 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "FEC fines Hillary Clinton campaign and DNC over Trump-Russia dossier research", "description": "Federal election regulators fined Hillary Clinton's 2016 presidential campaign and the Democratic National Committee earlier this month for not properly disclosing the money they spent on controversial opposition research that led to the infamous Trump-Russia…", "url": "https://www.cnn.com/2022/03/30/politics/clinton-dnc-steele-dossier-fusion-gps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160729002305-34-dnc-gallery-0728-super-tease.jpg", "publishedAt": "2022-03-30T21:29:04Z", "content": "Washington (CNN)Federal election regulators fined Hillary Clinton's 2016 presidential campaign and the Democratic National Committee earlier this month for not properly disclosing the money they spen… [+2620 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "US satellite operator says persistent cyberattack at beginning of Ukraine war affected tens of thousands of customers", "description": "A multi-faceted cyberattack at the onset of Russia's war on Ukraine knocked out internet service for tens of thousands of satellite modems in Ukraine and elsewhere in Europe, the US-based telecommunications provider that owns the network said Wednesday.", "url": "https://www.cnn.com/2022/03/30/politics/ukraine-cyberattack-viasat-satellite/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330165448-viasat-hq-super-tease.jpg", "publishedAt": "2022-03-30T21:14:24Z", "content": "Washington (CNN)A multi-faceted cyberattack at the onset of Russia's war on Ukraine knocked out internet service for tens of thousands of satellite modems in Ukraine and elsewhere in Europe, the US-b… [+2998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "Chris Rock set to perform for the first time since the Oscars", "description": "Chris Rock will return to the stage for the first time since Will Smith slapped him at Sunday's Academy Awards. Smith slapped him at Sunday's Academy Awards.", "url": "https://www.cnn.com/2022/03/30/entertainment/chris-rock-oscars-boston-show/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220330155138-chris-rock-2020-file-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-30T21:06:23Z", "content": "Chris Rock will return to the stage for the first time since Will Smith slapped him at Sundays Academy Awards.\r\nRock, who has yet to publicly address the incident, will perform two standup shows as p… [+1111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung", "title": "Senate votes to advance Alvaro Bedoya's FTC confirmation", "description": "One of President Joe Biden's key administrative nominees is a step closer to confirmation after Alvaro Bedoya, Biden's pick for Federal Trade Commissioner, narrowly cleared a key procedural vote in the Senate on Wednesday.", "url": "https://www.cnn.com/2022/03/30/tech/ftc-bedoya-advance/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220330153438-alvaro-bedoya-headshot.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-03-30T20:28:44Z", "content": "One of President Joe Bidens key administrative nominees is a step closer to confirmation after Alvaro Bedoya, Bidens pick for Federal Trade Commissioner, narrowly cleared a key procedural vote in the… [+2156 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, CNN", "title": "Ukrainian members of parliament slam Russia peace talks as a 'smokescreen'", "description": "A delegation of Ukrainian lawmakers visiting Washington, DC, on Wednesday said they believe Russia is just using peace talks with Ukraine as a \"smokescreen\" for their forces to regroup and re-strategize in Ukraine.", "url": "https://www.cnn.com/2022/03/30/politics/ukraine-parliament-russia-skepticism/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220325152351-ukraine-rally-white-house-super-tease.jpg", "publishedAt": "2022-03-30T20:26:01Z", "content": "(CNN)A delegation of Ukrainian lawmakers visiting Washington, DC, on Wednesday said they believe Russia is just using peace talks with Ukraine as a \"smokescreen\" for their forces to regroup and re-st… [+4134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Abortion providers ask Idaho Supreme Court to block state's new 6-week ban", "description": "Abortion providers are asking the Idaho Supreme Court to strike down the state's new six-week abortion ban which mimics a controversial Texas law.", "url": "https://www.cnn.com/2022/03/30/politics/lawsuit-idaho-abortion-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220323165551-01-idaho-abortion-super-tease.jpg", "publishedAt": "2022-03-30T20:25:06Z", "content": "(CNN)Abortion providers are asking the Idaho Supreme Court to strike down the state's new six-week abortion ban which mimics a controversial Texas law.\r\nThe providers said in a lawsuit filed Wednesda… [+4156 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann and Barbara Starr, CNN", "title": "'Hurricane Hunters' Air Force unit investigating flight that landed at Martha's Vineyard to pick up motorcycle", "description": "The \"Hurricane Hunters\" Air Force unit that flies specially equipped aircraft directly into severe weather has opened an investigation after one of its training flights landed at Martha's Vineyard to pick up a motorcycle belonging to one of the crew members, …", "url": "https://www.cnn.com/2022/03/30/politics/air-force-marthas-vineyard-flight-bike/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330155722-01-marthas-vineyard-airport-super-tease.jpg", "publishedAt": "2022-03-30T20:23:31Z", "content": "(CNN)The \"Hurricane Hunters\" Air Force unit that flies specially equipped aircraft directly into severe weather has opened an investigation after one of its training flights landed at Martha's Vineya… [+2553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "What is aphasia, the condition impacting Bruce Willis' acting career?", "description": "Bruce Willis has been diagnosed with a brain disorder called aphasia and is stepping away from his career. Just what is aphasia and what causes it?", "url": "https://www.cnn.com/2022/03/30/health/aphasia-explainer-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330145815-02-bruce-willis-2019-file-super-tease.jpg", "publishedAt": "2022-03-30T20:14:43Z", "content": "(CNN)Bruce Willis is taking a break from acting due to a brain disorder called aphasia, \"which is impacting his cognitive abilities,\" his family announced Wednesday.\r\n\"As a result of this and with mu… [+2923 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Senator Markey and Mark Wolfe for CNN Business Perspectives", "title": "Ditching fossil fuels makes even more sense now", "description": "The surging and volatile oil and gas prices created by Russian President Vladimir Putin's war on Ukraine highlights the urgent need for the US to reduce its dependence on foreign oil and natural gas and accelerate its move to cleaner energy sources.", "url": "https://www.cnn.com/2022/03/30/perspectives/fossil-fuels-clean-energy-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330160149-electric-car-charging-file-restricted-092420-super-tease.jpg", "publishedAt": "2022-03-30T20:11:36Z", "content": "Senator Markey is the junior senator from Massachusetts and co-author of the Green New Deal congressional resolution. He is chair of the Climate Change, Clean Air, and Nuclear Safety Subcommittee of … [+4676 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "World's longest wooden roller coaster is getting longer", "description": "Kings Island, outside Cincinnati, Ohio, announces that it's extending the length of The Beast roller coaster by 2 feet, solidifying its grip on the record of world's longest wooden roller coaster.", "url": "https://www.cnn.com/travel/article/beast-wooden-roller-coaster-kings-island-ohio-longer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330145155-01-beast-kings-island-super-tease.jpg", "publishedAt": "2022-03-30T20:08:27Z", "content": "(CNN) It's pretty much a yearly occurrence these days -- some amusement park is setting a new roller coaster record. Maybe it's for speed. Maybe it's for a special design feature.\r\nThe Beast apparent… [+2722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Ohio Senate candidate Mike Gibbons keeps falsely saying millions more people voted in 2020 than were registered to vote", "description": "Businessman Mike Gibbons has gained ground in Ohio's competitive Republican primary for the state's open US Senate seat. And like some of his rivals, Gibbons has been making wildly inaccurate claims about the 2020 election.", "url": "https://www.cnn.com/2022/03/30/politics/fact-check-ohio-senate-mike-gibbons-five-million-2020/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220330132604-mike-gibbons-ohio-0328-super-tease.jpg", "publishedAt": "2022-03-30T19:58:33Z", "content": "Washington (CNN)Businessman Mike Gibbons has gained ground in Ohio's competitive Republican primary for the state's open US Senate seat. And like some of his rivals, Gibbons has been making wildly in… [+7276 chars]"}]}