{"status": "ok", "totalResults": 152, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "San Francisco School Board recall election was partially funded by billionaires", "description": "The more than $1.9 million effort that ousted three San Francisco School Board members from their positions Tuesday was funded in large part by Silicon Valley-area billionaires, records show.", "url": "https://www.cnn.com/2022/02/17/politics/san-francisco-school-board-recall-election-funding-billionaires/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217170646-02-sf-school-board-recall-campaign-0212-super-tease.jpg", "publishedAt": "2022-02-17T23:26:56Z", "content": "Washington (CNN)The more than $1.9 million effort that ousted three San Francisco School Board members from their positions Tuesday was funded in large part by Silicon Valley-area billionaires, recor… [+6837 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Manu Raju and Melanie Zanona, CNN", "title": "McCarthy endorses Cheney foe in Wyoming GOP primary", "description": "House Minority Leader Kevin McCarthy has endorsed Harriet Hageman, the Trump-backed opponent of incumbent Rep. Liz Cheney of Wyoming -- a rare endorsement from leadership in a divisive GOP primary, and one that marks the culmination of a simmering feud betwee…", "url": "https://www.cnn.com/2022/02/17/politics/kevin-mccarthy-harriet-hageman-endorsement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217171357-mccarthy-cheney-hageman-super-tease.jpg", "publishedAt": "2022-02-17T23:09:31Z", "content": "(CNN)House Minority Leader Kevin McCarthy has endorsed Harriet Hageman, the Trump-backed opponent of incumbent Rep. Liz Cheney of Wyoming -- a rare endorsement from leadership in a divisive GOP prima… [+4794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Austin Butler thrust into spotlight as the King in 'Elvis' trailer", "description": "Austin Butler has some big blue suede shoes to step into for his role as Elvis Presley, but if the first trailer for the biopic about the King is any indication, he's ready.", "url": "https://www.cnn.com/2022/02/17/entertainment/elvis-trailer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217165849-elvis-trailer-austin-butler-super-tease.jpg", "publishedAt": "2022-02-17T22:57:44Z", "content": "(CNN)Austin Butler has some big blue suede shoes to step into for his role as Elvis Presley, but if the first trailer for the biopic about the King is any indication, he's ready. \r\nWarner Bros. (whic… [+348 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Hillary Clinton sidesteps Cuomo, hits out at Fox News and GOP lies in New York speech", "description": "On Thursday, as she introduced Gov. Kathy Hochul at the New York State Democratic Party convention, Hillary Clinton never mentioned former Gov. Andrew Cuomo's name -- even as the possibility of him attempting a political comeback looms over the party's immedi…", "url": "https://www.cnn.com/2022/02/17/politics/hillary-clinton-andrew-cuomo-republicans-fox-news-kathy-hochul/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217170458-01-hillary-clinton-0217-super-tease.jpg", "publishedAt": "2022-02-17T22:49:48Z", "content": "(CNN)Four years ago, Hillary Clinton was greeted with a bouquet by then-Gov. Andrew Cuomo when she endorsed him at the New York State Democratic Party convention.\r\nBut a lot has changed since then an… [+3313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole and Paradise Afshar, CNN", "title": "Louisville mayor candidate says his family is 'traumatized again' after campaign HQ shooting suspect is released on bond", "description": "The mayoral candidate in Louisville, Kentucky, who survived a shooting at his campaign headquarters earlier this week said Thursday that his family and campaign team are \"traumatized again\" after the suspected shooter was released from jail on bond.", "url": "https://www.cnn.com/2022/02/17/politics/craig-greenberg-shooting-suspect-released/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217133342-craig-greenberg-louisville-mayoral-super-tease.jpg", "publishedAt": "2022-02-17T22:48:18Z", "content": "Washington (CNN)The mayoral candidate in Louisville, Kentucky, who survived a shooting at his campaign headquarters earlier this week said Thursday that his family and campaign team are \"traumatized … [+4809 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Johnson", "title": "Here’s how small-business owners can earn 75,000 bonus points with the Marriott Business credit card - CNN", "description": "The Marriott Bonvoy Business American Express Card makes it easy to earn Marriott points on business travel and other business spending, and you can easily recoup the annual fee in the first year with the card's welcome bonus offer.", "url": "https://www.cnn.com/2022/02/17/cnn-underscored/money/marriott-bonvoy-business-credit-card-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211022145635-underscored-marriott-sign-on-pearson-airport-hotel.jpg?q=w_3200,h_1800,x_0,y_0,c_fill", "publishedAt": "2022-02-17T22:15:00Z", "content": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value, but does not review all financial companies or all available financial offers. We may r… [+13064 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chuck Johnston, CNN", "title": "Former Angels' official convicted in overdose death of MLB pitcher Tyler Skaggs", "description": "Eric Prescott Kay, a former communications director for the Los Angeles Angels, has been found guilty of two charges in the 2019 overdose death of Angels' pitcher Tyler Skaggs, the US Attorney for the Northern District of Texas said Wednesday.", "url": "https://www.cnn.com/2022/02/17/sport/tyler-skaggs-death-eric-kay-conviction-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200807211346-los-angeles-angels-pitcher-tyler-skaggs-orig-mss-00000000-super-tease.jpg", "publishedAt": "2022-02-17T21:30:52Z", "content": "(CNN)Eric Prescott Kay, a former communications director for the Los Angeles Angels, has been found guilty of two charges in the 2019 overdose death of Angels' pitcher Tyler Skaggs, the US Attorney f… [+696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Florida state House passes bill banning abortions after 15 weeks", "description": "Florida's state House on Thursday passed a Republican-sponsored bill that would prohibit abortion in the state after 15 weeks of pregnancy, allowing only for exceptions involving \"serious risk\" to the pregnant person and fatal fetal abnormality, but with no e…", "url": "https://www.cnn.com/2022/02/17/politics/florida-house-abortion-bill-15-week-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217133930-florida-house-of-representatives-file-2021-super-tease.jpg", "publishedAt": "2022-02-17T21:29:01Z", "content": "(CNN)Florida's state House on Thursday passed a Republican-sponsored bill that would prohibit abortion in the state after 15 weeks of pregnancy, allowing only for exceptions involving \"serious risk\" … [+3182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Wilson", "title": "All members of Congress will be invited to attend the State of the Union in person", "description": "All members of Congress would be invited to President Joe Biden's State of the Union address on March 1, according to the House sergeant-at-arms, a return to a full House chamber after last year's socially distant speech.", "url": "https://www.cnn.com/2022/02/17/politics/state-of-the-union-all-members/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210502211626-joe-biden-0428-super-tease.jpg", "publishedAt": "2022-02-17T21:17:16Z", "content": "(CNN)All members of Congress would be invited to President Joe Biden's State of the Union address on March 1, according to the House sergeant-at-arms, a return to a full House chamber after last year… [+1022 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nathan Hodge", "title": "Analysis: Russian-US diplomacy stalls, with a shelled Ukrainian kindergarten a stark reminder of the lives at stake", "description": "On any other week, the high-level diplomatic drama that unfolded in Moscow on Thursday should have been the main headline. But the images of a shelled kindergarten in eastern Ukraine shifted international focus to the Donbas region, where the world braced its…", "url": "https://www.cnn.com/2022/02/17/europe/russia-us-diplomacy-ukraine-analysis-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220217071214-ukraine-donbas-footage.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-17T21:11:02Z", "content": "On any other week, the high-level diplomatic drama that unfolded in Moscow on Thursday should have been the main headline. But the images of a shelled kindergarten in eastern Ukraine shifted internat… [+2750 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "Fact Check: Biden admin isn't funding crack pipes", "description": "Last week, an article claiming that the Biden administration planned to give away crack pipes to drug addicts went viral, eliciting outrage on the right and prompting a series of clarifications from the administration.", "url": "https://www.cnn.com/2022/02/17/politics/federal-funds-crack-pipe-fact-check/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622174914-crack-pipe-super-tease.jpg", "publishedAt": "2022-02-17T20:46:16Z", "content": "Washington (CNN)Last week, an article claiming that the Biden administration planned to give away crack pipes to drug addicts went viral, eliciting outrage on the right and prompting a series of clar… [+4983 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "US government investigates Tesla cars after reports of unexpected braking", "description": "The National Highway Traffic Safety Administration is investigating reports of Teslas braking unexpectedly while using Autopilot.", "url": "https://www.cnn.com/2022/02/17/cars/tesla-phantom-braking-nhtsa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210608161741-tesla-model-3-cars-file-super-tease.jpg", "publishedAt": "2022-02-17T20:30:26Z", "content": "Washington, DC (CNN)The National Highway Traffic Safety Administration is investigating reports of Teslas braking unexpectedly while using Autopilot. \r\nThe braking occurs \"without warning, at random,… [+2537 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Millions of children could lose Medicaid coverage once the public health emergency ends", "description": "The number of kids covered by Medicaid or the Children's Health Insurance Program has soared to a record 40 million during the pandemic. However, at least 6.7 million children are at risk of losing that coverage and going uninsured for a period once the emerg…", "url": "https://www.cnn.com/2022/02/17/politics/children-medicaid-public-health-emergency/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216015354-children-uninsured-medicaid-stock-super-tease.jpg", "publishedAt": "2022-02-17T20:21:16Z", "content": "(CNN)The number of kids covered by Medicaid or the Children's Health Insurance Program has soared to a record40 million during the pandemic, aided by a congressional provision that bars states from d… [+3919 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe", "title": "Are rising prices affecting your household and financial decisions? Share your story", "description": "Prices are soaring in America.", "url": "https://www.cnn.com/2022/02/17/economy/inflation-impact-callout/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220216131242-us-inflation-prices-0210.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-17T20:17:33Z", "content": "Prices are soaring in America.\r\nThe pandemic has spurred inflation not seen in decades. Used and new cars, gas, housing, furniture and food cost more every month.\r\nEven though salaries are also risin… [+332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Nickeas and Mark Morales, CNN", "title": "The Paislee Shultis case shows missing persons investigations, especially involving children, can be complicated", "description": "The circumstances surrounding the discovery of Paislee Shultis cast a spotlight on the murky issues surrounding missing persons cases. Ultimately, in this case, and others, the authorities are limited by the Fourth Amendment.", "url": "https://www.cnn.com/2022/02/17/us/paislee-shultis-missing-persons-cases/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217125213-video-thumbnail-police-chief-missing-girl-ny-super-tease.jpeg", "publishedAt": "2022-02-17T20:15:55Z", "content": "(CNN)A 6-year-old girl who had been reported missing in 2019 was found alive with her non-custodial parents living in a home police had visited several times during the two-plus-year search for the g… [+9169 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Trump and his children may be deposed by New York attorney general, judge rules", "description": "Former President Donald Trump, as well his children Ivanka and Donald Jr., must sit for depositions in the New York attorney general's civil investigation of their business practices, a New York judge ruled Thursday.", "url": "https://www.cnn.com/2022/02/17/politics/trump-subpoena-james-new-york-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217111120-trump-ivanka-don-jr-file-super-tease.jpg", "publishedAt": "2022-02-17T20:08:28Z", "content": "(CNN)Former President Donald Trump, as well his children Ivanka and Donald Jr., must sit for depositions in the New York attorney general's civil investigation of their business practices, a New York… [+883 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "'Peacemaker' flexes its muscles with crazy surprises in its finale", "description": "Spoiler alert: Writer-director James Gunn flexed his creative muscles with a genuinely surprising cameos, reflecting the extent to which he has been turned loose to play in the DC Comics sandbox.", "url": "https://www.cnn.com/2022/02/17/entertainment/peacemaker-finale-cameos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220103104556-03-peacemaker-john-cena-hbo-max-super-tease.jpg", "publishedAt": "2022-02-17T19:55:47Z", "content": "The following contains spoilers about the \"Peacemaker\" season finale.\r\n (CNN)Given how protective outfits like Marvel and DC are when it comes to their major characters, the \"Peacemaker\" finale on HB… [+2390 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz, Holmes Lybrand", "title": "Chief DC federal judge blasts GOP's 'legitimate political discourse' description of Capitol attack", "description": "The chief judge of Washington, DC's federal court lambasted the Republican Party Thursday for saying that the January 6, 2021, attack at the US Capitol was \"legitimate political discourse.\"", "url": "https://www.cnn.com/2022/02/17/politics/chief-dc-federal-judge-blasts-gop-legitimate-political-discourse-january-6/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211028153757-beryl-a-howell.jpg?q=x_97,y_400,h_1536,w_2731,c_crop/w_800", "publishedAt": "2022-02-17T19:46:29Z", "content": "The chief judge of Washington, DCs federal court lambasted the Republican Party Thursday for saying that the January 6, 2021, attack at the US Capitol was legitimate political discourse. \r\nA major po… [+2392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Stocks slide again as Russia-Ukraine invasion fears resurface", "description": "President Joe Biden and Secretary of State Antony Blinken believe a Russian invasion of Ukraine could happen in a matter of days. The news rattled investors, sending the Dow down 500 points in mid-afternoon trading Thursday.", "url": "https://www.cnn.com/2022/02/17/investing/dow-stock-market-today-russia-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217140405-01-nyse-0216-super-tease.jpg", "publishedAt": "2022-02-17T19:35:33Z", "content": "New York (CNN Business)President Joe Biden and Secretary of State Antony Blinken believe a Russian invasion of Ukraine could happen in a matter of days. The news rattled investors, sending the Dow do… [+788 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "More US adults identify as LGBTQ now than at any time in the past decade, a new poll says", "description": "According to a new Gallup poll, more than 7% of American adults identify as LGBTQ, a new high. The increase is being propelled by Gen Z adults, as 21% of them self-identified as LGBTQ, per the poll.", "url": "https://www.cnn.com/2022/02/17/us/lgbtq-population-increase-gallup-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217113220-pride-parade-palm-springs-file-2021-super-tease.jpg", "publishedAt": "2022-02-17T19:34:43Z", "content": "(CNN)More adults in the US say they identify as LGBTQ than they did a decade ago, according to a new Gallup poll, a trend largely propelled by Gen Z adults. \r\nThe percentage of adults who told Gallup… [+2698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Eliza Anyangwe, Editor of CNN As Equals", "title": "This global public health challenge affects one in four women. Where's the outrage or the plan?", "description": "A new report in the Lancet finds more than a quarter of women aged 15-49 have been victims of domestic violence. The problem is patriarchy but the authors say there's a way to address it.", "url": "https://www.cnn.com/2022/02/17/health/intimate-partner-violence-lancet-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216165054-02-intimate-partner-violence-women-stock-super-tease.jpg", "publishedAt": "2022-02-17T19:33:51Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)On Wednesday, a new study in The Lancet… [+5086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "As BA.2 subvariant of Omicron rises, lab studies point to signs of severity", "description": "The BA.2 virus -- a subvariant of the Omicron coronavirus variant -- isn't just spreading faster than its distant cousin, it may also cause more severe disease and appears capable of thwarting some of the key weapons we have against Covid-19, new research sug…", "url": "https://www.cnn.com/2022/02/17/health/ba-2-covid-severity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217135829-covid-testing-denmark-file-super-tease.jpg", "publishedAt": "2022-02-17T19:30:24Z", "content": "(CNN)The BA.2 virus -- a subvariant of the Omicron coronavirus variant -- isn't just spreading faster than its distant cousin, it may also cause more severe disease and appears capable of thwarting s… [+5574 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Justice Department to focus more on thwarting cybercrime, even if it means jeopardizing arrests", "description": "The Justice Department is shifting its approach to cybercrime to focus more on preventing further harm to victims, even if in some cases it means tipping off suspects and jeopardizing arrests, Deputy Attorney General Lisa Monaco announced Thursday.", "url": "https://www.cnn.com/2022/02/17/politics/justice-department-cybercrime-ransomware-victims/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210611123247-lisa-monaco-doj-super-tease.jpg", "publishedAt": "2022-02-17T19:28:53Z", "content": "Washington (CNN)The Justice Department is shifting its approach to cybercrime to focus more on preventing further harm to victims, even if in some cases it means tipping off suspects and jeopardizing… [+3487 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Murphy Kelly", "title": "We tested Apple's new option to unlock an iPhone while wearing a mask", "description": "I stood outside a busy New York City subway stop recently, dressed like a celebrity trying not to be recognized. My face was covered with sunglasses, a baseball cap and my black KN95 mask.", "url": "https://www.cnn.com/2022/02/17/tech/apple-face-id-mask/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220216172226-apple-iphone-face-id-with-mask-sam-kelly-screengrab-02.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-17T18:55:48Z", "content": "I stood outside a busy New York City subway stop recently, dressed like a celebrity trying not to be recognized. My face was covered with sunglasses, a baseball cap and my black KN95 mask.\r\nBut my iP… [+3305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "A new drug shows promise against respiratory virus, study shows", "description": "A new antiviral medication against respiratory syncytial virus, or RSV, appears to be safe and lowered viral levels and symptoms significantly more than a placebo, according to the results of a study published Wednesday in The New England Journal of Medicine.", "url": "https://www.cnn.com/2022/02/17/health/rsv-potential-new-drug/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210610155623-respiratory-syncytial-virus-stock-super-tease.jpg", "publishedAt": "2022-02-17T18:39:17Z", "content": "(CNN)A new antiviral medication against respiratory syncytial virus, or RSV, appears to be safe and lowered viral levels and symptoms significantly more than a placebo, according to the results of a … [+5192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "Victoria's Secret campaign features first model with Down syndrome", "description": "In a new campaign starring 18 women of diverse backgrounds, 24-year-old Sofia Jirau became the first person with Down Syndrome to model for the lingerie brand.", "url": "https://www.cnn.com/style/article/victorias-secret-sofia-jirau-love-cloud-campaign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217121832-01b-victorias-secret-love-cloud-collection-crop-super-tease.jpg", "publishedAt": "2022-02-17T18:35:39Z", "content": "artsPublished 17th February 2022\r\nThis week, 24-year-old model Sofia Jirau became the first person with Down syndrome to appear in a campaign for Victoria's Secret. \r\nThe Puerto Rican model appeared … [+3003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "The 'next Chevrolet Bolt' could have airless tires", "description": "Michelin has been working with General Motors to develop airless tires that will be sold on a next-generation Chevrolet Bolt electric car, expected to go on sale in the next few years, a Michelin executive said. It could mark the decline of over 130 years of …", "url": "https://www.cnn.com/2022/02/17/business/michelin-airless-tire/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217125605-01-michelin-uptis-airless-tires-super-tease.jpeg", "publishedAt": "2022-02-17T18:32:46Z", "content": "(CNN)Michelin has been working with General Motors to develop airless tires that will be sold on a next-generation Chevrolet Bolt electric car, expected to go on sale in the next few years, a Micheli… [+5384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner", "title": "Coca-Cola introduces a first-of-its-kind flavor", "description": "Coke's new flavor is out of this world.", "url": "https://www.cnn.com/2022/02/17/business/coke-new-flavor/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220217102027-20220217-coke-new-flavor.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-17T18:01:15Z", "content": "Cokes new flavor is out of this world. \r\nAt least, thats the idea behind Coca-Cola Starlight, a new limited-edition, zero-sugar version of the classic soda. \r\nAfter deciding to discontinue half of it… [+3318 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Steve Contorno, CNN", "title": "How Rubio navigated Trump as he's favored to keep his seat", "description": "Six years ago, Sen. Marco Rubio offered a blunt warning about the \"reckless and dangerous\" Donald Trump: He would do \"damage to America.\"", "url": "https://www.cnn.com/2022/02/17/politics/marco-rubio-reelection-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215155322-rubio-trump-split-super-tease.jpg", "publishedAt": "2022-02-17T17:52:03Z", "content": "(CNN)Six years ago, Sen. Marco Rubio offered a blunt warning about the \"reckless and dangerous\" Donald Trump: He would do \"damage to America.\" \r\n\"We have a con artist as the frontrunner in the Republ… [+13290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kaitlyn Weaver", "title": "My Olympic figure skating dream came true. Don't let others get ruined", "description": "To think that doping was happening under the nose of so many at the Olympics is deeply disturbing. I understand that standing up to Russia is complicated and hard, but for the IOC, their responsibility is clear, writes Canadian ice dancer Kaitlyn Weaver.", "url": "https://www.cnn.com/2022/02/17/opinions/olympic-figure-skating-doping-weaver/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217100426-03-kaitlyn-weaver-file-2014-super-tease.jpg", "publishedAt": "2022-02-17T17:50:58Z", "content": "Kaitlyn Weaver is a Canadian ice dancer who, with partner Andrew Poje, competed in the Olympic Games in Sochi in 2014 and PyeongChang in 2018. She is a three-time World Championship medalist and thre… [+7047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeevan Ravindran, CNN", "title": "Oldest buildings in UAE discovered, dating back 8,500 years", "description": "Archaeologists in the United Arab Emirates have uncovered the country's oldest known buildings, dating back at least 8,500 years.", "url": "https://www.cnn.com/travel/article/uae-buildings-archaeology-scli-scn-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217105252-01-abu-dhabi-building-archaeology-discovery-super-tease.jpg", "publishedAt": "2022-02-17T17:43:19Z", "content": "(CNN) Archaeologists in the United Arab Emirates have uncovered the country's oldest known buildings, dating back at least 8,500 years.\r\nThis is more than 500 years older than the previous record-bre… [+2098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Spary, CNN", "title": "UK bracing for possible 'sting jet' as rare threat-to-life warning issued in back-to-back storms", "description": "Meteorologists in the UK have issued a rare danger-to-life alert as Storm Eunice is forecast to batter parts of the country Friday, potentially creating a \"sting jet\" that could bring havoc to streets.", "url": "https://www.cnn.com/2022/02/17/uk/uk-storm-eunice-dudley-scli-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217101438-weather-europe-forecast-winds-friday-card-super-tease.jpg", "publishedAt": "2022-02-17T17:34:29Z", "content": "(CNN)Meteorologists in the UK have issued a rare danger-to-life alert as Storm Eunice is forecast to batter parts of the country Friday, potentially creating a \"sting jet\" that could bring havoc to s… [+2769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Schneider and Devan Cole, CNN", "title": "Judge rules DC AG can question former Trump Organization CFO in inaugural committee suit", "description": "Former Trump Organization Chief Financial Officer Allen Weisselberg will be questioned by lawyers from the Washington, DC, attorney general's office, which has sued the company and former President Donald Trump's 2017 Inaugural Committee.", "url": "https://www.cnn.com/2022/02/17/politics/trump-inaugural-committee-lawsuit-washington-dc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180824110948-allen-weisselberg-file-super-tease.jpg", "publishedAt": "2022-02-17T17:33:56Z", "content": "Washington (CNN)Former Trump Organization Chief Financial Officer Allen Weisselberg will be questioned by lawyers from the Washington, DC, attorney general's office, which has sued the company and fo… [+3440 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, CNN", "title": "Nick Kristof cannot run for governor in Oregon, state Supreme Court says", "description": "The Oregon Supreme Court on Thursday said Nick Kristof cannot run for governor because he does not meet residency requirements in the state, a decision that the former New York Times journalist said he would not challenge.", "url": "https://www.cnn.com/2022/02/17/politics/nick-kristof-cannot-run-oregon-governor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217120420-kristof-oregon-2021-super-tease.jpg", "publishedAt": "2022-02-17T17:15:36Z", "content": "Washington, DC (CNN)The Oregon Supreme Court on Thursday said Nick Kristof cannot run for governor because he does not meet residency requirements in the state, a decision that the former New York Ti… [+1454 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allegra Goodwin, CNN", "title": "Dogs can recognize their owners just by their voice", "description": "You might already be sure your dog can recognize you by your voice, but they might not even need their vision or smell to guide them, according to a new study.", "url": "https://www.cnn.com/2022/02/17/europe/dog-owner-recognize-voice-scn-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217115538-dog-pet-owner-recognition-voice-scn-scli-intl-super-tease.jpg", "publishedAt": "2022-02-17T17:06:58Z", "content": "(CNN)You might already be sure your dog can recognize you by your voice, but they might not even need their vision or smell to guide them, according to a new study.\r\nDogs can recognize their owners b… [+3136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood and Jennifer Hansler, CNN", "title": "US says Moscow has expelled deputy chief of mission at US embassy Moscow in 'escalatory' move", "description": "The United States on Thursday accused Russia of having expelled the second-most senior diplomat at the US embassy in Moscow without any justification, calling it an \"escalatory\" move at a time of heightened alert over the Ukraine crisis.", "url": "https://www.cnn.com/2022/02/17/politics/russia-expels-deputy-us-official/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217095059-us-embassy-russia-bart-gorman-file-042121-restricted-super-tease.jpg", "publishedAt": "2022-02-17T17:00:24Z", "content": "(CNN)The United States on Thursday accused Russia of having expelled the second-most senior diplomat at the US embassy in Moscow without any justification, calling it an \"escalatory\" move at a time o… [+812 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "143 Republicans are running for Congress in Texas. Only 13 say the 2020 election was legitimate.", "description": "With the Texas primary looming in less than two weeks, the Houston Chronicle did something very interesting: They asked every Republican candidate running for Congress whether or not they believed the 2020 election was stolen or fraudulent.", "url": "https://www.cnn.com/2022/02/17/politics/texas-primary-republican-party/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217112849-tx-voting-2020-super-tease.jpg", "publishedAt": "2022-02-17T16:42:13Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Cities trying to cut planet-warming emissions are being blocked by GOP legislatures and a powerful gas lobby", "description": "Twenty states with GOP-controlled legislatures have passed so-called \"preemption laws\" that ban cities from banning natural gas.", "url": "https://www.cnn.com/2022/02/17/politics/natural-gas-ban-preemptive-laws-gop-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217094013-01-cities-fossil-fuel-emissions-super-tease.jpg", "publishedAt": "2022-02-17T16:29:40Z", "content": "(CNN)In 2019, the city council in Berkeley, California, held a stunning vote: it would ban natural gas hookups in all new building construction to reduce greenhouse gas emissions and the city's impac… [+8799 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ted Barrett, Clare Foran and Ali Zaslav, CNN", "title": "Funding deadline looms as GOP demands and Democratic absences slow effort to lock in vote", "description": "Government funding is set to expire Friday and, though lawmakers have expressed confidence there won't be a shutdown, it's still not clear when the Senate will vote to approve a stop-gap spending measure.", "url": "https://www.cnn.com/2022/02/17/politics/senate-government-funding-vote/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211215101330-01-mcconnell-1214-super-tease.jpg", "publishedAt": "2022-02-17T16:15:05Z", "content": "(CNN)Government funding is set to expire Friday and, though lawmakers have expressed confidence there won't be a shutdown, it's still not clear when the Senate will vote to approve a stop-gap spendin… [+3829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Severance' puts a creepy sci-fi spin on the idea of work-life balance", "description": "The best kind of science fiction sometimes feels set about 10 minutes in the future, and so it is with \"Severance,\" an extremely creepy, slow-moving but instantly engrossing Apple TV+ series.", "url": "https://www.cnn.com/2022/02/17/entertainment/severance-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215162750-01-severance-apple-tv-super-tease.jpg", "publishedAt": "2022-02-17T16:12:37Z", "content": "(CNN)The best kind of science fiction sometimes feels set about 10 minutes in the future, and so it is with \"Severance,\" an extremely creepy, slow-moving but instantly engrossing Apple TV+ series. Pr… [+2782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell and Katelyn Polantz, CNN", "title": "House committee asks government to end Trump hotel lease before Trump can sell it for $370 million", "description": "The House Oversight Committee is asking the General Services Administration to consider terminating the lease for the Trump International Hotel in Washington, DC, before the former president's business can sell it, in light of allegations that the Trump Organ…", "url": "https://www.cnn.com/2022/02/17/politics/trump-hotel-old-post-office/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200415152236-trump-hotel-super-tease.jpg", "publishedAt": "2022-02-17T16:00:34Z", "content": "(CNN)The House Oversight Committee is asking the General Services Administration to consider terminating the lease for the Trump International Hotel in Washington, DC, before the former president's b… [+2259 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales and Dakin Andone, CNN", "title": "'There was something about the staircase that bothered him.' Inside the search for Paislee Shultis", "description": "Police had gone up and down the basement stairs several times while searching a home in the Saugerties, New York, area Monday for any trace of 6-year-old Paislee Shultis, who had been missing for more than two years.", "url": "https://www.cnn.com/2022/02/17/us/paislee-shultis-6-year-old-found-new-york-saugerties/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216011420-01-missing-girl-found-super-tease.jpg", "publishedAt": "2022-02-17T16:00:17Z", "content": "(CNN)Police had gone up and down the basement stairs several times while searching a home in the Saugerties, New York, area Monday for any trace of 6-year-old Paislee Shultis, who had been missing fo… [+3506 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi and Jenn Selva, CNN", "title": "Virginia court rules masks will be optional in Loudoun County Public Schools", "description": "Masks will be optional at public schools in Loudoun County, Virginia, starting Thursday, following a ruling by a county circuit court judge.", "url": "https://www.cnn.com/2022/02/17/politics/virginia-loudoun-county-masks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217073308-virginia-mask-mandate-demonstration-011822-file-restricted-super-tease.jpg", "publishedAt": "2022-02-17T15:38:02Z", "content": "(CNN)Masks will be optional at public schools in Loudoun County, Virginia, starting Thursday, following a ruling by a county circuit court judge.\r\nThe ruling comes as a statewide law goes into effect… [+2770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathryn Vasel", "title": "A shorter work week, cash to invest: Companies add perks to attract workers", "description": "Companies are stepping up their perks when it comes to recruiting and retaining talent.", "url": "https://www.cnn.com/2022/02/17/success/companies-perks-recruit-and-retention/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215172515-job-benefits-work-perks-super-tease.jpg", "publishedAt": "2022-02-17T15:24:53Z", "content": "(CNN)It's a job seekers' market, and employers are stepping up their benefits in a bid to attract and retain workers. \r\nPeople are walking away from their jobs in droves, with a record number of work… [+5074 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "How rich is Donald Trump really?", "description": "Earlier this week, Donald Trump sent The New York Times an email. In it, he claimed that he was very rich -- pointing to a \"June 30, 2014 Statement of Financial Condition\" that said he was worth $5.8 billion in the year before he started running for president.", "url": "https://www.cnn.com/2022/02/17/politics/donald-trump-wealth-rich/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201105103026-02-centered-main-bar-final-trump-super-tease.jpg", "publishedAt": "2022-02-17T14:52:26Z", "content": "(CNN)Earlier this week, Donald Trump sent The New York Times an email. In it, he claimed that he was very rich -- pointing to a \"June 30, 2014 Statement of Financial Condition\" that said he was worth… [+4624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "San Francisco school board recall sends a dangerous message", "description": "While the results in San Francisco school board recall may resist simple analysis, the politics swirling around the recall tell us something important about a process underway across the country - and the long history of 'parents' rights' rhetoric, writes Nic…", "url": "https://www.cnn.com/2022/02/17/opinions/san-francisco-school-board-recall-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216062134-san-francisco-school-board-recall-protest-super-tease.jpeg", "publishedAt": "2022-02-17T14:48:46Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+7420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "The health benefits of a random act of kindness", "description": "Random Acts of Kindness Day doesn't have to be limited to one day a year. A simple act of kindness does much more than help the receiver, studies show, and any kindness you give to others is also a gift to yourself.", "url": "https://www.cnn.com/2022/02/17/health/random-acts-of-kindness-day-2022-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200217144830-kindness-sticky-note-stock-super-tease.jpg", "publishedAt": "2022-02-17T14:45:12Z", "content": "(CNN)This year's Random Acts of Kindness Day falls during a pandemic for a second year in a row, but the foundation behind it wants you to consider being kind every day.\r\nThey want you to be a \"RAKti… [+4174 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden: 'Every indication' is that Russia will attack Ukraine 'within the next several days'", "description": "President Joe Biden on Thursday morning said the US believes that Russia could be \"engaged in a false flag operation\" in order to spark a military conflict with Ukraine, despite Kremlin claims that they are withdrawing forces.", "url": "https://www.cnn.com/2022/02/17/politics/joe-biden-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217092940-01-biden-south-lawn-0217-super-tease.jpg", "publishedAt": "2022-02-17T14:34:04Z", "content": "(CNN)President Joe Biden on Thursday morning said the US believes that Russia could attack Ukraine in the next several days, despite Kremlin claims that they are withdrawing forces.\r\n\"Every indicatio… [+309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Erik Lundh for CNN Business Perspectives", "title": "Why inflation is about to peak", "description": "With fewer people getting sick, there should be more workers in the transportation sector (truckers and dock workers, for instance) — helping to get goods from producers to consumers.", "url": "https://www.cnn.com/2022/02/17/perspectives/inflation-cpi-economy-pandemic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216131242-us-inflation-prices-0210-super-tease.jpg", "publishedAt": "2022-02-17T14:32:21Z", "content": "Erik Lundh is a principal economist at The Conference Board. The opinions expressed in this commentary are his own. \r\nLast year was a tough one for American consumers. Prices for just about everythin… [+3908 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Kamila Valieva falls multiple times in free skate program, finishes fourth in the women's individual event", "description": "Russia Olympic Committee (ROC) figure skater Kamila Valieva, who is at the center of a doping scandal, finished fourth in the women's individual figure skating event with 224.09 points.", "url": "https://www.cnn.com/2022/02/17/sport/kamila-valieva-results-free-skating-olympics-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217081928-02-kamila-valieva-olympics-021722-super-tease.jpg", "publishedAt": "2022-02-17T14:03:00Z", "content": "(CNN)Russia Olympic Committee (ROC) figure skater Kamila Valieva, who is at the center of a doping scandal, finished fourth in the women's individual figure skating event with 224.09 points.\r\nThe ROC… [+596 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Trump app opens to hundreds of testers ahead of expected launch", "description": "Details about former U.S. President Donald Trump's new social media app are trickling out as about 500 beta testers have begun using an early version of \"Truth Social,\" two sources told Reuters.", "url": "https://www.cnn.com/2022/02/17/tech/trump-app-beta/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211021100750-donald-trump-100617-file-super-tease.jpg", "publishedAt": "2022-02-17T13:26:22Z", "content": "(Reuters)Details about former U.S. President Donald Trump's new social media app are trickling out as about 500 beta testers have begun using an early version of \"Truth Social,\" two sources told Reut… [+3487 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Do supply chains hold the key to reducing inflation?", "description": "Economists and investors have been closely watching climbing producer prices and wages for clues on where inflation is heading. They're rising, which could add to inflationary pressure in the coming months.", "url": "https://www.cnn.com/2022/02/17/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217072750-port-of-los-angeles-011922-file-restricted-super-tease.jpg", "publishedAt": "2022-02-17T13:07:57Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6607 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Sleep apnea and snoring: 8 warning signs to look for", "description": "Everyone snores at one time or another, but do you know the warning signs of more serious, potentially life-threatening sleep disorders such as obstructive sleep apnea? Sleep experts explain here.", "url": "https://www.cnn.com/2022/02/17/health/sleep-apnea-snoring-danger-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111194941-loud-snoring-stock-super-tease.jpg", "publishedAt": "2022-02-17T12:50:45Z", "content": "This story was original published in November 2021. It has been updated. \r\n (CNN)Obstructive sleep apnea is a serious sleep disorder in which people stop breathing for 10 seconds or more at a time. \r… [+9943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Shailene Woodley and Aaron Rodgers call off their engagement", "description": "Shailene Woodley and Aaron Rodgers have called off their engagement, a source close to Woodley told CNN.", "url": "https://www.cnn.com/2022/02/17/entertainment/shailene-woodley-aaron-rodgers-break-up/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217060746-rodgers-woodley-split-super-tease.jpg", "publishedAt": "2022-02-17T12:07:44Z", "content": "(CNN)Shailene Woodley and Aaron Rodgers have called off their engagement, a source close to Woodley told CNN. \r\n\"They grew apart, both have busy careers and unfortunately their relationship took a ba… [+912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN Sport staff", "title": "Tiger Woods won't be drawn on Masters appearance as he admits he's 'frustrated' with recovery", "description": "Speaking at a press conference at the Genesis Invitational, Woods discussed his recovery, tour ambitions and whether we could see him at the next major.", "url": "https://www.cnn.com/2022/02/17/golf/tiger-woods-injury-recovery-pga-tour-masters-spc-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217100742-tiger-woods-0216222-super-tease.jpg", "publishedAt": "2022-02-17T11:28:25Z", "content": "(CNN)Tiger Woods still hopes for a return to the PGA Tour but admits he's \"frustrated\" with the timeline of his recovery since the February 2021 car crash that left the 15-time major winner with seri… [+2206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Mansour, CNN", "title": "5 ways to recover from resolution mistakes", "description": "It's only one month into your resolution, but you already feel like you've blown it. Wellness and fitness expert Stephanie Mansour gives us some motivation with five ways to get back on track after making mistakes with your resolution.", "url": "https://www.cnn.com/2022/02/17/health/resolutions-workouts-fitness-diet-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204144052-05-fix-resolution-mistakes-wellness-super-tease.jpg", "publishedAt": "2022-02-17T11:20:40Z", "content": "(CNN)Many of us enter into a new year with high hopes for our health and wellness goals. Perhaps vowing to exercise daily, getting more sleep or cutting down on your dessert intake were some of your … [+4794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Family and friends to mourn Amir Locke at Minneapolis funeral after he was killed by police executing a no-knock warrant", "description": "Members of the Minneapolis community will gather Thursday to honor the life of Amir Locke, a 22-year-old Black man whose killing at the hands of police during the execution of a no-knock warrant has reignited debate around the controversial practice.", "url": "https://www.cnn.com/2022/02/17/us/amir-locke-funeral-minneapolis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217025054-amir-locke-student-walkout-02082022-super-tease.jpg", "publishedAt": "2022-02-17T11:09:48Z", "content": "(CNN)Members of the Minneapolis community will gather Thursday to honor the life of Amir Locke, a 22-year-old Black man whose killing at the hands of police during the execution of a no-knock warrant… [+4144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Advert for women train drivers in Saudi Arabia gets 28,000 applicants", "description": "A job advert to recruit 30 female train drivers in Saudi Arabia has attracted 28,000 applicants, highlighting the scale of pent up demand as the conservative kingdom opens up more opportunities to women.", "url": "https://www.cnn.com/travel/article/saudi-women-job-ad-scli-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217045319-saudi-arabia-railway-station-082119-file-super-tease.jpg", "publishedAt": "2022-02-17T11:08:11Z", "content": "A job advert to recruit 30 female train drivers in Saudi Arabia has attracted 28,000 applicants, highlighting the scale of pent up demand as the conservative kingdom opens up more opportunities to wo… [+1610 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Paul P. Murphy, Gianluca Mezzofiore and Katie Polglase, CNN", "title": "Russia says its units are going home after exercises near Ukraine. Evidence suggests otherwise", "description": "Don't Trust -- Do Verify: That's the unofficial mantra from Western officials in response to Russia's declarations that some of their units that have been encircling Ukraine are now returning to base.", "url": "https://www.cnn.com/2022/02/17/europe/russia-military-video-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217031045-02-new-bridge-construction-belarus-super-tease.jpg", "publishedAt": "2022-02-17T10:36:41Z", "content": "Russian army T80 main battle tanks, possibly of the 4th Guards Tank Division. They arrived yesterday, near Belgorod (30km from Ukraine), by train, from Naro-Fominsk, south-west of Moscow (700km). Tod… [+160 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/tara-john\">Tara John</a>, CNN", "title": "The latest on the Ukraine-Russia border crisis", "description": "The United States says Russia has added thousands of troops to its buildup on Ukraine's border, despite Moscow's claims that some troops were being sent back to base. Follow here for the latest.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-news-02-17-22-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216160128-03-ukraine-tension-gallery-021622-super-tease.jpg", "publishedAt": "2022-02-17T10:16:59Z", "content": "The number of Russian troops massed along Ukraine's borders has increased by approximately 7,000 in recent days, the United States alleged Wednesday evening, despite claims from Moscow it was pulling… [+1685 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "Biden will announce $1 billion in infrastructure funding to clean up the Great Lakes", "description": "President Joe Biden on Thursday will announce $1 billion in funding from his administration's signature bipartisan infrastructure law for cleanup and restoration of the Great Lakes in remarks from Lorain, Ohio.", "url": "https://www.cnn.com/2022/02/17/politics/great-lakes-infrastructure-biden-announcement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220208153628-01-biden-ev-remarks-0208-super-tease.jpg", "publishedAt": "2022-02-17T10:04:31Z", "content": "(CNN)President Joe Biden on Thursday will announce $1 billion in funding from his administration's signature bipartisan infrastructure law for cleanup and restoration of the Great Lakes in remarks fr… [+3355 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Buckley, CNN", "title": "How this avgeek turned his hobby into a job", "description": "Canadian Laird Kay trained as a designer -- but he always loved planes. Now he's combined the two, having become an aircraft photographer, specializing in bringing to life the small design elements of airplanes.", "url": "https://www.cnn.com/travel/article/aircraft-photographer-laird-kay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216093442-21-laird-kay-airplane-photographer-super-tease.jpg", "publishedAt": "2022-02-17T09:38:50Z", "content": "(CNN) Asked to choose an icon of beauty, most people might think of a landscape, a city skyline or a work of art. \r\nLaird Kay, on the other hand, would say an airplane. \r\nThe avgeek -- who fell in lo… [+9017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "The artist behind 'Fearless Girl' wants to spread her message far and wide. A lawsuit is getting in the way", "description": "As she prepares to launch a new NFT collection, the artist behind Wall Street's famous \"Fearless Girl\" statue remains locked in a legal battle with the asset management firm that originally sponsored it.", "url": "https://www.cnn.com/style/article/fearless-girl-statue-lawsuit-nfts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216181829-05-fearless-girl-nyse-super-tease.jpg", "publishedAt": "2022-02-17T08:52:03Z", "content": "artsPublished 17th February 2022\r\nFive years after first appearing on the cobblestones of Wall Street, the \"Fearless Girl\" statue -- a petite but controversial symbol for gender equality -- is taking… [+7572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Surprising world of Stonehenge revealed in new exhibition", "description": "Stonehenge and the world it encapsulated remains profoundly mysterious, since there are no written records that shed light on its meaning and significance. A new exhibition aims to reveal some of its secrets.", "url": "https://www.cnn.com/style/article/stonehenge-british-museum-exhibition-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215100813-09-stonehenge-british-museum-handout-restricted-super-tease.jpg", "publishedAt": "2022-02-17T08:43:24Z", "content": "artsPublished 17th February 2022\r\nThe distinctive silhouette of Stonehenge in the flat landscape of Salisbury plain in southwest England is instantly and iconically familiar.\r\nHowever, the 4,500-year… [+4198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadia Leigh-Hewitson, CNN", "title": "Myth, magic and monsters: This photographer is creating Black fantasy water creatures", "description": "Austrian Nigerian visual artist and photographer David Ụzọchukwu wants to change the way we see the sea.", "url": "https://www.cnn.com/style/article/david-uzochukwu-photography-black-fantasy-water-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216105407-card-david-uzochukwu-photography-restricted-super-tease.jpg", "publishedAt": "2022-02-17T08:39:51Z", "content": "artsPublished 17th February 2022\r\nWhen you think of mermaids, it's hard not to picture the fish-tailed princess imagined by Hans Christian Andersen in his classic fairy tale: \"her skin was as clear a… [+6452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Paradise Afshar, CNN", "title": "The last of Canada's Covid-19 demonstrations may end soon as Ottawa police warn of consequences of staying", "description": "A nearly three-week protest in Ottawa over mandated Covid-19 precautions in Canada may be approaching its end as police tell demonstrators to either leave immediately or face legal consequences.", "url": "https://www.cnn.com/2022/02/17/americas/canada-trucker-protests-covid-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216231809-ottawa-parked-trucks-02162022-restricted-super-tease.jpg", "publishedAt": "2022-02-17T07:40:42Z", "content": "(CNN)A nearly three-week protest in Ottawa over mandated Covid-19 precautions in Canada may be approaching its end as police tell demonstrators to either leave immediately or face legal consequences.… [+5956 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Swati Gupta and Rhea Mogul, CNN", "title": "At least 13 dead after wedding guests fall into well at Indian ceremony", "description": "At least 13 people, including a one-year-old child, have died after falling into a well during a wedding ceremony in northern India, authorities from Uttar Pradesh state said on Wednesday.", "url": "https://www.cnn.com/2022/02/17/india/india-deaths-well-collapse-kushinagar-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnn/.e/img/4.0/logos/cnn_logo_social.jpg", "publishedAt": "2022-02-17T06:07:17Z", "content": "New Delhi (CNN)At least 13 people, including a one-year-old child, have died after falling into a well during a wedding ceremony in northern India, authorities from Uttar Pradesh state said on Wednes… [+1183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Musa, CNN", "title": "Florida appeals court overturns conviction of Miami police officer who shot autistic man's caretaker", "description": "A South Florida appeals court Wednesday overturned the conviction of a former North Miami Police Department officer who was found guilty of negligence for shooting an autistic man's caretaker in 2016, court documents show.", "url": "https://www.cnn.com/2022/02/17/us/florida-police-officer-conviction-overturned/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/160722142920-officer-jonathan-aledda-super-tease.jpg", "publishedAt": "2022-02-17T05:14:53Z", "content": "(CNN)A South Florida appeals court Wednesday overturned the conviction of a former North Miami Police Department officer who was found guilty of negligence for shooting an autistic man's caretaker in… [+3724 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "US cranks up the information warfare against Putin", "description": "Far from buying into claims the Ukraine showdown is easing, the United States is cranking up its relentless informational warfare campaign against Russia, keeping the world on high alert for a possible invasion of Ukraine.", "url": "https://www.cnn.com/2022/02/17/politics/russia-ukraine-us-biden-putin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220210170701-04-biden-putin-split-super-tease.jpg", "publishedAt": "2022-02-17T05:01:14Z", "content": "(CNN)Far from buying into claims the Ukraine showdown is easing, the United States is cranking up its relentless informational warfare campaign against Russia, keeping the world on high alert for a p… [+9103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "Here's how women's figure skating is now scored (and why stamina often leads to more points)", "description": "Gone are the days when Olympic figure skating was scored solely at the judges' discretion, with subjective points awarded on a 6.0 scale.", "url": "https://www.cnn.com/2022/02/17/sport/womens-figure-skating-scoring-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216174926-woman-figure-skating-stock-super-tease.jpg", "publishedAt": "2022-02-17T05:00:10Z", "content": "(CNN)Gone are the days when Olympic figure skating was scored solely at the judges' discretion, with subjective points awarded on a 6.0 scale.\r\nA 2002 Olympic figure skating scandal -- with allegatio… [+4551 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Justice Department sues Missouri over controversial gun law", "description": "The US Justice Department on Wednesday filed a lawsuit against Missouri in an effort to prevent the state from enforcing a controversial law aimed at protecting gun rights.", "url": "https://www.cnn.com/2022/02/16/politics/missouri-gun-rights-law-doj-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210915142700-01-doj-emblem-file-super-tease.jpg", "publishedAt": "2022-02-17T01:51:34Z", "content": "Washington (CNN)The US Justice Department on Wednesday filed a lawsuit against Missouri in an effort to prevent the state from enforcing a controversial law aimed at protecting gun rights.\r\nThe law, … [+2724 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and Adam Renton, CNN", "title": "Day 13 of the 2022 Beijing Winter Olympics", "description": "The 2022 Beijing Winter Olympics continue with gold medal events in women's hockey, women's alpine skiing, and women's figure skating. Follow here for the latest news, results and updates.", "url": "https://www.cnn.com/world/live-news/beijing-winter-olympics-02-17-22-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220204060019-birds-nest-beijing-02042022-super-tease.jpg", "publishedAt": "2022-02-17T01:00:54Z", "content": "Top figure skaters spin at such unbelievably fast speeds as many as six revolutions per second  that it can make even spectators feel a little woozy. \r\nCurious viewers of the Beijing Winter Olympics … [+1876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "Prince Andrew proves no man can act with impunity", "description": "Kara Alaimo writes that the fact that Prince Andrew has apparently been made to pay reparations for his alleged involvement in Jeffrey Epstein's sex trafficking scheme, is an important outcome, not just for Giuffre, but for all women.", "url": "https://www.cnn.com/2022/02/16/opinions/prince-andrew-settlement-message-for-all-women-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220206040635-prince-andrew-2019-file-super-tease.jpg", "publishedAt": "2022-02-17T00:44:28Z", "content": "Kara Alaimo, an associate professor of public relations at Hofstra University, is the author of \"Pitch, Tweet, or Engage on the Street: How to Practice Global Public Relations and Strategic Communica… [+6184 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson, CNN", "title": "Florida wildlife officials are distributing 3,000 pounds of lettuce a day to save starving manatees", "description": "Florida's manatees -- which are dying at an alarming rate, largely from starvation -- are being treated to tons of lettuce a week as part of a new feeding program that state wildlife officials say is showing signs of success.", "url": "https://www.cnn.com/2022/02/16/us/florida-starving-manatee-feeding-program-trnd-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216141453-01-florida-manatee-feeding-program-super-tease.jpg", "publishedAt": "2022-02-17T00:28:59Z", "content": "(CNN)Florida's manatees -- which are dying at an alarming rate, largely from starvation -- are being treated to tons of lettuce a week as part of a new feeding program that state wildlife officials s… [+2729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Frehse and Laura Studley, CNN", "title": "Video showing police breaking up a fight between a Black teen and a White teen in a New Jersey mall prompts outrage", "description": "A video showing police officers breaking up a fight between a Black teenager and a White teenager at a New Jersey mall has prompted outrage over the police response.", "url": "https://www.cnn.com/2022/02/16/us/video-new-jersey-police-black-and-white-teen-fight-outrage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216154954-police-break-up-teen-fight-in-mall-super-tease.jpg", "publishedAt": "2022-02-17T00:25:05Z", "content": "(CNN)A video showing police officers breaking up a fight between a Black teenager and a White teenager at a New Jersey mall has prompted outrage over the police response. \r\nNew Jersey Governor Phil M… [+4302 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, CNN", "title": "Education Department cancels $415 million in student debt for victims of for-profit college fraud", "description": "The Education Department announced that it has canceled another $415 million in federal student loan debt owed by nearly 16,000 borrowers who were misled by for-profit colleges.", "url": "https://www.cnn.com/2022/02/16/politics/biden-for-profit-student-loan-debt-forgiveness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216162023-devry-university-file-super-tease.jpg", "publishedAt": "2022-02-17T00:24:11Z", "content": "Washington (CNN)The Education Department announced Wednesday that it has canceled another $415 million in federal student loan debt owed by nearly 16,000 borrowers who were misled by for-profit colle… [+5408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "White House announces new temporary leadership in key agency after resignation of top science adviser", "description": "The White House announced new temporary leadership at the White House Office of Science and Technology Policy, just one week after Biden's top science adviser, Dr. Eric Lander, resigned following an investigation into his office behavior.", "url": "https://www.cnn.com/2022/02/16/politics/ostp-temporary-leadership/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190222184317-white-house-exterior-super-tease.jpg", "publishedAt": "2022-02-17T00:22:48Z", "content": "(CNN)The White House announced new temporary leadership at the White House Office of Science and Technology Policy, just one week after Biden's top science adviser, Dr. Eric Lander, resigned followin… [+3281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright, CNN", "title": "Harris to meet with Ukrainian President for first time when she leads US delegation to Munich Security Conference", "description": "Vice President Kamala Harris will meet with Ukrainian President Volodymyr Zelensky this weekend when she embarks on her latest high-stakes trip to the Munich Security Conference in Germany, senior administration officials said Wednesday, as Russia amasses for…", "url": "https://www.cnn.com/2022/02/16/politics/kamala-harris-to-meet-volodymyr-zelensky/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211217203219-kamala-harris-1214-super-tease.jpg", "publishedAt": "2022-02-17T00:18:40Z", "content": "(CNN)Vice President Kamala Harris will meet with Ukrainian President Volodymyr Zelensky this weekend when she embarks on her latest high-stakes trip to the Munich Security Conference in Germany, seni… [+3086 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Schumer jokes about making history hosting the Oscars", "description": "After years without a host, the Academy Awards aim to make history with three women emcees in Wanda Sykes, Amy Schumer and Regina Hall. It will also be the first time since 1987 that the Oscars has had three hosts.", "url": "https://www.cnn.com/videos/business/2022/02/16/amy-schumer-wanda-sykes-regina-hall-oscars-hosts-academy-awards-orig-ht.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216190958-schumer-sykes-hall-super-tease.jpg", "publishedAt": "2022-02-17T00:15:59Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Natasha Chen, CNN", "title": "Disney wants to build your dream neighborhood. And no, Mickey Mouse won't be the doorman", "description": "The Disney company has plans to create residential neighborhoods across the US, the first of which is expected to break ground in Rancho Mirage, California. \"Cotino\" is the first project in its Storyliving by Disney venture.", "url": "https://www.cnn.com/travel/article/disney-storyliving-communities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216183912-disney-storyliving-cotino-town-center-super-tease.jpg", "publishedAt": "2022-02-17T00:13:08Z", "content": "Los Angeles (CNN) The Disney company announced plans on Wednesday to create multiple residential neighborhoods across the United States, the first of which is expected to break ground this year in Ra… [+3342 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "US says Russia has added 7,000 troops along Ukraine border, despite claims of pullback", "description": "Russian forces massed along Ukraine's borders have increased by approximately 7,000 troops in recent days, the United States alleged Wednesday evening, despite claims from Moscow it was pulling back its troops.", "url": "https://www.cnn.com/2022/02/16/politics/russian-troops-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215101918-russian-troops-exit-handout-super-tease.jpg", "publishedAt": "2022-02-16T23:52:12Z", "content": "(CNN)Russian forces massed along Ukraine's borders have increased by approximately 7,000 troops in recent days, the United States alleged Wednesday evening, despite claims from Moscow it was pulling … [+2273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "Hybrid immunity offers increased protection that is longer-lasting against Covid-19 reinfection, studies show", "description": "Pfizer/BioNTech's Covid-19 mRNA vaccine provides an added layer of protection against reinfection for people who have been previously infected with Covid-19, as well as increased immune durability over time, according to two studies published Wednesday in the…", "url": "https://www.cnn.com/2022/02/16/health/hybrid-immunity-studies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200522201450-coronavirus-colorized-scan-0522-super-tease.jpg", "publishedAt": "2022-02-16T23:23:20Z", "content": "(CNN)Pfizer/BioNTech's Covid-19 mRNA vaccine provides an added layer of protection against reinfection for people who have been previously infected with Covid-19, as well as increased immune durabili… [+4622 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaanita Iyer, CNN", "title": "'Devastating implications': GOP redistricting battles in Alabama and other states raise concerns about voter suppression", "description": "Legal challenges are expected to continue in this case, and similar lawsuits have been filed in Texas and Georgia, which will bring the issue of voting rights, racial gerrymandering and discriminatory election practices to the forefront ahead of the midterm e…", "url": "https://www.cnn.com/2022/02/16/politics/alabama-redistricting-black-voters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216125109-alabama-redistricting-2021-file-super-tease.jpg", "publishedAt": "2022-02-16T23:10:34Z", "content": "(CNN)Kenya Goodson, a 46-year-old Black woman from Tuscaloosa, Alabama, has voted in every election since she was 19. \r\nBut last week's Supreme Court decision to allow Alabama's new congressional map… [+7522 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Janelle Davis, CNN", "title": "The most surprising moments from LBJ's secretly recorded calls", "description": "Lyndon B. Johnson is one of the most consequential US presidents, responsible for passing some of the most significant pieces of legislation in modern history, including the Civil Rights Act of 1964 and the Voting Rights Act of 1965.", "url": "https://www.cnn.com/2022/02/16/politics/lyndon-b-johnson-secret-audio-origseriesfilms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181008174452-lyndon-johnson-mlk-signing-of-civil-rights-act-super-tease.jpg", "publishedAt": "2022-02-16T22:43:32Z", "content": "CNN's new four-part series \"LBJ: Triumph and Tragedy\" reveals dramatic first-hand accounts from the last surviving members of President Johnson's inner circle, never-before-broadcast archival materia… [+10065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "The top 10 most visited US National Park sites in 2021 are ...", "description": "Visitors poured into US national parks and related sites in 2021 -- especially paying calls to the marquee names. No. 10 was Zion National Park in Utah. Find out the nine places that beat it.", "url": "https://www.cnn.com/travel/article/most-visited-us-national-park-sites-2021/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216160813-01-most-popular-national-parks-2021-super-tease.jpg", "publishedAt": "2022-02-16T22:32:08Z", "content": "(CNN) Stir-crazy from the pandemic, visitors poured into US national parks and related sites last year -- and they especially paid calls to the marquee names.\r\nRoughly 297.1 million total visits were… [+3726 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Choi Min-Jeong: 'Queen of Korean Short Track' bounces back from tearful silver to defend women's 1500m speed skating title", "description": "South Korean speed skater Choi Min-Jeong successfully defended her women's 1,500m Olympic title in Beijing on Wednesday, easing the disappointment of being agonizingly pipped to 1,000m gold on Friday.", "url": "https://www.cnn.com/2022/02/16/sport/choi-min-jeong-south-korea-beijing-gold-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216143321-01-choi-min-jeong-olympics-0216-super-tease.jpg", "publishedAt": "2022-02-16T22:30:39Z", "content": "(CNN)South Korean speed skater Choi Min-Jeong successfully defended her women's 1,500m Olympic title in Beijing on Wednesday, easing the disappointment of being agonizingly pipped to 1,000m gold on F… [+2653 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Marshall Cohen, CNN", "title": "Unspooling the latest twists in special counsel John Durham's investigation", "description": "Special counsel John Durham, who has been investigating the origins of the FBI's Trump-Russia probe, ignited a firestorm in right-wing circles last weekend with a cryptic court filing.", "url": "https://www.cnn.com/2022/02/16/politics/durham-allegations-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215180845-john-durham-trump-split-super-tease.jpg", "publishedAt": "2022-02-16T22:16:43Z", "content": "(CNN)Special counsel John Durham, who has been investigating the origins of the FBI's Trump-Russia probe, ignited a firestorm in right-wing circles last weekend with a cryptic court filing. \r\nThe new… [+7441 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Mo Salah strikes to cap Liverpool late show against Inter Milan in Champions League", "description": "Amidst all the talk of Liverpool's new age stars, it was two of the club's long-time heroes that delivered a late smash and grab raid in the first leg of the Champions League last-16 tie against Inter Milan on Wednesday.", "url": "https://www.cnn.com/2022/02/16/football/mo-salah-liverpool-inter-champions-league-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216215041-salah-super-tease.jpg", "publishedAt": "2022-02-16T22:15:23Z", "content": "(CNN)Amidst all the talk of Liverpool's new age stars, it was two of the club's long-time heroes that delivered a late smash and grab raid in the first leg of the Champions League last-16 tie against… [+456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "Federal judge rules Air Force officer does not have to receive Covid-19 vaccine", "description": "A federal judge in Georgia ruled that an anonymous Air Force officer does not have to receive a Covid-19 vaccine, despite the military's vaccine mandate, because of her religious beliefs.", "url": "https://www.cnn.com/2022/02/16/politics/air-force-officer-vaccine-mandate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210920230730-03-pfizer-vaccine-file-0811-super-tease.jpg", "publishedAt": "2022-02-16T22:12:19Z", "content": "(CNN)A federal judge in Georgia ruled that an anonymous Air Force officer does not have to receive a Covid-19 vaccine, despite the military's vaccine mandate, because of her religious beliefs.\r\nThe j… [+3044 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, CNN", "title": "Texas sues Biden administration in longshot bid to overturn federal mask mandate for public transport", "description": "The state of Texas filed a lawsuit Wednesday seeking to overturn President Joe Biden's mask mandate for public transport, marking the latest longshot bid to scrap one of the President's key Covid-19 health measures.", "url": "https://www.cnn.com/2022/02/16/politics/texas-lawsuit-biden-mask-mandate-travel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211221120802-airport-mask-sign-phoenix-super-tease.jpg", "publishedAt": "2022-02-16T22:06:56Z", "content": "Washington (CNN)The state of Texas filed a lawsuit Wednesday seeking to overturn President Joe Biden's mask mandate for public transport, marking the latest longshot bid to scrap one of the President… [+2173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "NY Times faces controversy after making changes to Wordle", "description": "Some Wordle players have complained that the puzzle's most recent solutions seemed more difficult than before The New York Times took over. The newspaper stated that it would not make any changes, but players discovered that more than one solution to the game…", "url": "https://www.cnn.com/videos/business/2022/02/16/wordle-changes-controversy-new-york-times-mxp-vpx.hln", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220108133511-01-wordle-game-super-tease.jpg", "publishedAt": "2022-02-16T21:15:54Z", "content": "Morning Express with Robin Meade"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy, CNN", "title": "Are Americans ready for a return to pre-pandemic normal? Depends on what 'normal' means.", "description": "Most Americans are weary of Covid-19, recent polling shows, but there's less consensus over how that exhaustion should translate into policy. Public opinion, these surveys suggest, isn't a struggle between two clearly defined opposing camps -- one favoring an…", "url": "https://www.cnn.com/2022/02/16/politics/covid-pandemic-americans-normal-polls/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216130001-covid-restrictions-ny-mall-1213-super-tease.jpg", "publishedAt": "2022-02-16T21:08:51Z", "content": "(CNN)Most Americans are weary of Covid-19, recent polling shows, but there's less consensus over how that exhaustion should translate into policy. Public opinion, these surveys suggest, isn't a strug… [+4293 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, Pamela Kirkland and Alta Spells, CNN", "title": "Two of the men convicted of killing Ahmaud Arbery used racist slurs in messages, a witness testifies at their federal hate crime trial", "description": "Texts and social media messages from two of the White men convicted of murdering Ahmaud Arbery included racist insults about African Americans, an FBI intelligence analyst testified Wednesday in their federal hate crime trial in Georgia.", "url": "https://www.cnn.com/2022/02/16/us/ahmaud-arbery-hate-crime-trial-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216141355-travis-mcmichael-william-bryan-split-super-tease.jpg", "publishedAt": "2022-02-16T20:56:46Z", "content": "(CNN)Texts and social media messages from two of the White men convicted of murdering Ahmaud Arbery included racist insults about African Americans, an FBI intelligence analyst testified Wednesday in… [+9097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Stelter, CNN Business", "title": "Right-wing media said it was exposing a scandal. What it really revealed is how bad information spreads in MAGA world", "description": "On Saturday night former President Donald Trump declared that he was the victim of a scandal \"far greater\" than Watergate. He called for criminal prosecutions and \"reparations.\" He said \"in a stronger period of time in our country, this crime would have been …", "url": "https://www.cnn.com/2022/02/16/media/durham-report-trump-maga-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215180845-john-durham-trump-split-super-tease.jpg", "publishedAt": "2022-02-16T20:49:41Z", "content": "New York (CNN Business)On Saturday night former President Donald Trump declared that he was the victim of a scandal \"far greater\" than Watergate. He called for criminal prosecutions and \"reparations.… [+8945 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Corinne Dorsey and Liz Stark, CNN", "title": "Trump-era Interior Secretary Ryan Zinke violated ethics rules while in office, watchdog report finds", "description": "Trump-era Interior Secretary Ryan Zinke violated ethics rules by being involved in negotiations over a land development project in Montana during his time in office and by failing to fully disclose his involvement after questioning from an ethics official, ac…", "url": "https://www.cnn.com/2022/02/16/politics/ryan-zinke-trump-interior-secretary-ethics-violation-watchdog-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216151549-ryan-zinke-file-2018-super-tease.jpg", "publishedAt": "2022-02-16T20:35:45Z", "content": "(CNN)Trump-era Interior Secretary Ryan Zinke violated ethics rules by being involved in negotiations over a land development project in Montana during his time in office and by failing to fully discl… [+4864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar and Veronica Stracqualursi, CNN", "title": "Virginia governor to sign bill allowing parents to opt out of school mask mandates", "description": "Virginia Republican Gov. Glenn Youngkin is slated to sign a bill Wednesday that allows parents to opt their children out of school mask mandates, his office announced.", "url": "https://www.cnn.com/2022/02/16/politics/virginia-bill-parent-opt-out-school-masks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216130510-gov-glenn-youngkin-0215-super-tease.jpg", "publishedAt": "2022-02-16T19:43:56Z", "content": "(CNN)Virginia Republican Gov. Glenn Youngkin is slated to sign a bill Wednesday that allows parents to opt their children out of school mask mandates, his office announced. \r\nThe bill, Senate Bill 73… [+3193 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "CDC lowers its risk advisory for cruises from 'very high' to 'high'", "description": "The US Centers for Disease Control and Prevention has moved cruise travel out of the \"very high\" risk category (Level 4) of its travel health notices down to \"high\" risk (Level 3).", "url": "https://www.cnn.com/travel/article/cdc-lowers-cruise-travel-warning/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220214114348-portmiami-cruise-ship-super-tease.jpg", "publishedAt": "2022-02-16T19:21:31Z", "content": "(CNN) The US Centers for Disease Control and Prevention has moved cruise travel out of the \"very high\" risk category of its travel health notices. \r\nCruise travel was moved from Level 4 into the CDC'… [+1629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "What the San Francisco school board recalls tell us about 2022 (and what they don't)", "description": "On Tuesday, San Francisco voters recalled three members of the city's school board, CNN projected, a result that many national figures -- especially on the Republican side -- seized on as a sign of things to come this fall.", "url": "https://www.cnn.com/2022/02/16/politics/san-francisco-school-board-recall-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216062134-san-francisco-school-board-recall-protest-super-tease.jpeg", "publishedAt": "2022-02-16T19:17:01Z", "content": "(CNN)On Tuesday, San Francisco voters recalled three members of the city's school board, CNN projected, a result that many national figures -- especially on the Republican side -- seized on as a sign… [+4797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "GOP Sen. Ron Johnson flip-flops to block Biden judicial nominee", "description": "Wisconsin Republican Sen. Ron Johnson said Tuesday he would not support a federal court nominee he had previously recommended to President Joe Biden -- a move that could stop the nominee, Wisconsin state court Judge William Pocan, from being confirmed.", "url": "https://www.cnn.com/2022/02/16/politics/ron-johnson-pocan-judge-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220106211851-ron-johnson-file-021221-super-tease.jpg", "publishedAt": "2022-02-16T18:50:27Z", "content": "(CNN)Wisconsin Republican Sen. Ron Johnson said Tuesday he would not support a federal court nominee he had previously recommended to President Joe Biden -- a move that could stop the nominee, Wiscon… [+4951 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood and Jennifer Hansler, CNN", "title": "American detained in Russia says he is coughing up blood, has not received medical care", "description": "Trevor Reed, an American who has been detained in Russia for more than two years, says he is coughing up blood and has not received medical care after prolonged exposure to tuberculosis in Russian prison, according to the US Embassy in Moscow.", "url": "https://www.cnn.com/2022/02/16/politics/trevor-reed-sick-medical-care/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211109115651-trevor-reed-2020-super-tease.jpg", "publishedAt": "2022-02-16T18:22:24Z", "content": "(CNN)Trevor Reed, an American who has been detained in Russia for more than two years, says he is coughing up blood and has not received medical care after prolonged exposure to tuberculosis in Russi… [+2731 chars]"}]}