{"status": "ok", "totalResults": 229, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Emma Colton", "title": "#MeToo, feminist organizations silent on Chinese tennis star’s disappearance after assault allegations", "description": "Feminist organizations in the U.S. have remained silent on the disappearance and ongoing concern over Chinese tennis star Peng Shuai", "url": "https://www.foxnews.com/world/feminist-organizations-silent-peng-shuai-ccp-tennis", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21308340850503.jpg", "publishedAt": "2021-11-22T17:30:22Z", "content": "Prominent feminist organizations in the U.S. have so far remained silent on the disappearance and ongoing concern over Chinese tennis star Peng Shuai, who accused a former member of the Communist Par… [+5660 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "Paris Hilton says mother Kathy changes the subject when she brings up boarding school abuse", "description": "Paris Hilton revealed that she has struggled to discuss the abuse allegations she laid out in the recent documentary “This is Paris.”", "url": "https://www.foxnews.com/entertainment/paris-hilton-mother-kathy-changes-subject-abuse-boarding-school", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/kathy-paris-hilton.jpg", "publishedAt": "2021-11-22T17:30:00Z", "content": "Paris Hilton revealed that she has struggled to discuss the abuse allegations she laid out in the recent documentary \"This is Paris.\" \r\nHilton detailed her experience at Provo Canyon School in her Yo… [+3841 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "95% of federal workforce is in compliance with Biden vaccine requirement: senior administration official", "description": "95% of the federal workforce is in compliance with President Biden’s vaccine requirement for employees of the federal government, a senior administration official said Monday.", "url": "https://www.foxnews.com/politics/95-of-federal-workforce-is-in-compliance-with-biden-vaccine-requirement-senior-administration-official", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/fbc602e8-7840-4e78-bf49-fd181a36abbc/1c0e9b98-2cc9-4147-ac40-7a6a1dd214e8/1280x720/match/image.jpg", "publishedAt": "2021-11-22T17:27:25Z", "content": "95% of the federal workforce is in compliance with President Bidens vaccine requirement for employees of the federal government, a senior administration official said Monday.\r\nNov. 22 marked the dead… [+2262 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "DeSantis spox calls out AP for evoking Florida governor in story on COVID surge in cold weather states", "description": "The Associated Press was called out last week for evoking Republican Florida Gov. Ron DeSantis, but not Democratic Michigan Gov. Gretchen Whitmer, in a story about Michigan and other northern states seeing an uptick in COVID-19 cases.", "url": "https://www.foxnews.com/media/ap-florida-governor-covid", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/Desantis-AP.jpg", "publishedAt": "2021-11-22T17:20:30Z", "content": "The Associated Press was called out last week for evoking Republican Florida Gov. Ron DeSantis, but not Democratic Michigan Gov. Gretchen Whitmer, in a story about Michigan and other northern states … [+2434 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Chasmar", "title": "NY assembly finds 'overwhelming evidence' Cuomo engaged in sexual harassment", "description": "The New York state Assembly Judiciary Committee said Monday it found \"overwhelming evidence\" that disgraced former Gov. Andrew Cuomo \"engaged in multiple instances of sexual harassment, including by creating a hostile work environment and engaging in sexual m…", "url": "https://www.foxnews.com/politics/ny-assembly-overwhelming-evidence-cuomo-sexual-harassment", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/Andrew-cuomo-disgraced-2.jpg", "publishedAt": "2021-11-22T16:57:18Z", "content": "The New York state Assembly Judiciary Committee said Monday it found \"overwhelming evidence\" that disgraced former Gov. Andrew Cuomo engaged in sexual harassment while in office, concluding an eight-… [+2669 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "Jussie Smollett makes rare public appearance at his film's premiere days before next court date", "description": "The former \"Empire\" star has been the subject of controversy for years after he allegedly faked a hate crime incident in 2019.", "url": "https://www.foxnews.com/entertainment/jussie-smollett-public-appearance-film-premiere-court-date", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/Jussie-Smollett.jpg", "publishedAt": "2021-11-22T16:53:57Z", "content": "Jussie Smollett made his first red carpet appearance since stepping back from life in the public eye as he deals with ongoing legal issues. \r\nThe former \"Empire\" star has been the subject of controve… [+2525 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Napoli", "title": "Jennifer Lawrence recalls 'trauma' from nude photo leak: 'Anybody can go look at my naked body'", "description": "Other high-profile women including Rihanna, Selena Gomez, and Kim Kardashian also had photos leaked when their iCloud accounts were hacked.", "url": "https://www.foxnews.com/entertainment/jennifer-lawrence-trauma-nude-photo-leak", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/ap18049660161273-5199.jpg", "publishedAt": "2021-11-22T16:39:58Z", "content": "Jennifer Lawrence said she'll never really get over having her privacy breached when nude photos of hers were leaked on the Internet in 2014.\r\nThe 31-year-old Oscar winner told Vanity Fair she cringe… [+3511 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler Olson", "title": "Liberals attack Supreme Court after it puts off ruling in Texas abortion case", "description": "The Supreme Court didn't rule on a procedural issue in the Texas abortion law case Monday, but it did decide a water rights dispute between Tennessee and Mississippi.", "url": "https://www.foxnews.com/politics/supreme-court-democrats-attack-texas-abortion", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/Supreme-Court.jpg", "publishedAt": "2021-11-22T16:37:54Z", "content": "Just minutes after it became clear that the Supreme Court was not issuing an opinion on Texas's abortion law Monday morning when many thought it might Democrats attacked the justices for failing to t… [+4029 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "CNN’s Brian Stelter ignores MSNBC getting banned from Rittenhouse trial on show that claims to cover media", "description": "CNN’s ratings-challenged \"Reliable Sources\" claims to examine the top media stories on a weekly basis, but left-wing host Brian Stelter gave MSNBC a pass on Sunday and ignored the liberal network being banned from the Kyle Rittenhouse trial.", "url": "https://www.foxnews.com/media/cnn-brian-stelter-ignores-msnbc-rittenhouse-trial", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Brian-Stelter.jpg", "publishedAt": "2021-11-22T16:24:15Z", "content": "CNNs ratings-challenged \"Reliable Sources\" claims to examine the top media stories on a weekly basis, but left-wing host Brian Stelter gave MSNBC a pass on Sunday and ignored the liberal network bein… [+4629 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Study reveals how warmer summers worsen tick infestation for moose", "description": "It’s a ghastly sight: ticks by tens of thousands burrowed into a moose’s broad body, sucking its lifeblood as the agonized host rubs against trees so vigorously that much of its fur wears away.", "url": "https://www.foxnews.com/us/study-warmer-summers-worsen-tick-infestation-moose", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/moose.jpg", "publishedAt": "2021-11-22T16:20:31Z", "content": "Its a ghastly sight: ticks by tens of thousands burrowed into a mooses\r\n broad body, sucking its lifeblood as the agonized host rubs against trees so vigorously that much of its fur wears away. \r\nWin… [+5869 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "COVID vaccine mandate 'will not impact holiday travel,' TSA says, reporting 93% of employees in compliance", "description": "Approximately 93% of Transportation and Security Administration employees are in compliance with President Biden’s deadline for federal employees to have received at least one dose of a COVID-19 vaccine or an approved exemption, quelling concerns that the man…", "url": "https://www.foxnews.com/politics/tsa-says-vaccine-mandate-will-not-impact-holiday-travel", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5fc3e7cf-2f32-487a-9dcd-c7b8d514303e/e7c340fe-c601-46e5-a853-7d72f16c23b0/1280x720/match/image.jpg", "publishedAt": "2021-11-22T16:09:07Z", "content": "Approximately 93% of Transportation and Security Administration employees are in compliance with President Bidens deadline for federal employees to have received at least one dose of a COVID-19 vacci… [+4298 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Amy Nelson", "title": "Waukesha Christmas parade witness describes \"surreal\" moment SUV crashed into a marching band", "description": "Angela O'Boyle watched from her balcony as a red SUV drove through crowds at the Waukesha, Wisconsin Christmas parade. O'Boyle was recording a video of the parade with the intent of showing her children and captured the moment the car ran into a marching band.", "url": "https://www.foxnews.com/media/waukesha-christmas-parade-witness-describes-surreal-moment-suv-crashed-into-a-marching-band", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/7182ccad-93a7-4fd4-a048-483956d2a8d2/7e7a3546-124a-4909-90e4-3e8e152f7ee3/1280x720/match/image.jpg", "publishedAt": "2021-11-22T16:08:14Z", "content": "Angela OBoyle was watching the Christmas parade in Waukesha, Wisconsin, from her balcony when a red SUV sped through the crowd and ran into a marching band. OBoyle described the event, which ultimate… [+2098 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Stephen Sorace", "title": "'Superhero' California mom helps rescue missing children: 'Trust your instinct'", "description": "Julia Bonin was hailed as a \"superhero\" after her actions led authorities to safely locate missing children Amber Clare, 16, and Noah Clare, 3, at Doheny State Beach in Dana Point, California, on Thursday.", "url": "https://www.foxnews.com/us/california-mom-rescue-missing-children-amber-clare-noah", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/julia-bonin-amber-noah-clare.jpg", "publishedAt": "2021-11-22T16:07:09Z", "content": "A California mom says to trust your gut after her heroic actions helped rescue two missing children last week.\r\nOrange County Sheriff Don Barnes called Julia Bonin a \"superhero\" after she spoke to re… [+2510 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joe Concha", "title": "Joe Concha: Rittenhouse acquitted, but media guilty of another rush to judgment", "description": "Fox News contributor Joe Concha on the Kyle Rittenhouse acquittal and yet another mainstream media failure.", "url": "https://www.foxnews.com/opinion/joe-concha-rittenhouse-acquitted-media-guilty", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/concha-rittenhouse-thumb-new.png", "publishedAt": "2021-11-22T15:55:38Z", "content": "This article is adapted from Joe Concha's video commentary.\r\nKyle Rittenhouse, the medias racist vigilante, is now a free man. How did that happen? \r\nThe old mantra in media was once get it first, bu… [+2698 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Germany's health minister urges people to get vaccinated", "description": "Germany's health minister said Monday that the rapid rise in coronavirus cases means it's likely everyone in the country who isn't vaccinated will have caught COVID-19 by the end of the winter — and some of those will die.", "url": "https://www.foxnews.com/world/germany-health-minister-vaccinations", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/vaccinegermany.jpg", "publishedAt": "2021-11-22T15:50:19Z", "content": "Germany's\r\n health minister said Monday that the rapid rise in coronavirus cases means it's likely everyone in the country who isn't vaccinated will have caught COVID-19 by the end of the winter and … [+5043 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Rutz", "title": "'Race pimp' Biden's reaction to Rittenhouse verdict shows how he uses Black community: David Webb", "description": "Fox News contributor David Webb accused President Biden on Monday of using the Black community for his own benefit, telling \"Fox & Friends First\" he was a \"race pimp.\"", "url": "https://www.foxnews.com/media/race-pimp-bidens-reaction-rittenhouse-verdict-webb", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Biden-Rittenhouse.jpg", "publishedAt": "2021-11-22T15:43:16Z", "content": "Fox News contributor David Webb accused President Biden on Monday of using the Black community for his own benefit, telling \"Fox &amp; Friends First\" he was a \"race pimp.\"\r\nWebb reacted to calls for … [+2967 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Baker Mayfield's wife, Emily, shares post criticizing Browns players, quickly deletes it", "description": "Emily Mayfield, the wife of Baker Mayfield, was caught expressing her frustrations with her husband’s Browns' teammates after they barely beat the Detroit Lions.", "url": "https://www.foxnews.com/sports/baker-mayfield-wife-emily-criticizing-browns-players", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Baker-Emily-Mayfield.jpg", "publishedAt": "2021-11-22T15:40:10Z", "content": "Baker Mayfield played through three injuries and the Cleveland Browns barely eked out a victory over the winless Detroit Lions on Sunday, 13-10.\r\nEmily Mayfield, the wife of the Browns quarterback, w… [+2118 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Pilar Arias", "title": "New York burglar who targeted families' homes who were at funerals will be sentenced", "description": "A burglar who targeted Westchester County, New York, homes as families attended funerals will soon be sentenced after being convicted last month.", "url": "https://www.foxnews.com/us/new-york-burglar-who-targeted-families-homes-who-were-at-funerals-will-be-sentenced", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Latonia-Shelecia-Stewart.jpg", "publishedAt": "2021-11-22T15:32:30Z", "content": "A burglar who targeted Westchester County, New York, homes as families attended funerals will be sentenced Monday after being convicted last month.\r\nLatonia Stewart, 30, was found guilty of burglariz… [+1856 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Austria's COVID lockdown is dampening the mood during this holiday season", "description": "Austrians savored one last mulled wine in packed Christmas markets before the curtain came down on the holiday season that was just getting underway, plunging the country that gave the world “Silent Night” into its fourth lockdown of this pandemic on Monday.", "url": "https://www.foxnews.com/world/austrias-covid-lockdown-holiday-season", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/austrianchristmas.jpg", "publishedAt": "2021-11-22T15:29:55Z", "content": "Austrians\r\n savored one last mulled wine in packed Christmas markets before the curtain came down on the holiday season that was just getting underway, plunging the country that gave the world \"Silen… [+4973 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paul Steinhauser, Andrew Murray", "title": "Michigan Republican businessman Rinke vows to spend at least $10 million to challenge Gov. Whitmer", "description": "Kevin Rinke on Monday jumped into the increasingly crowded GOP gubernatorial primary field in Michigan, in the race to challenge Democratic Gov. Gretchen Whitmer in 2022.", "url": "https://www.foxnews.com/politics/michigan-republican-businessman-rinke-vows-to-spend-at-least-10-million-to-challenge-gov-whitmer", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Kevin-Rinke.jpg", "publishedAt": "2021-11-22T15:23:24Z", "content": "Republican businessman and auto dealership executive Kevin Rinke on Monday jumped into the increasingly crowded GOP gubernatorial primary battle in Michigan, in the race to challenge Democratic Gov. … [+2864 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Houston Keene", "title": "Republicans warn ATF taking 'giant leap toward a federal firearm registry'", "description": "Rep. Michael Cloud led colleagues in a letter to acting ATF Director Marvin Richardson on Monday, expressing their concern over a potential backdoor gun registry around Congress’ prohibition.", "url": "https://www.foxnews.com/politics/republicans-atf-groundwork-backdoor-federal-gun-registry", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/GettyImages-1231770123.jpg", "publishedAt": "2021-11-22T15:21:26Z", "content": "A group of House Republicans\r\n is warning that the Bureau of Alcohol, Tobacco, Firearms and Explosives\r\n (ATF) could be laying the groundwork for a backdoor federal gun registry\r\n.\r\nRepublican Rep. M… [+4281 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Ruiz", "title": "Waukesha Christmas parade: Career criminal out on bail Darrell Brooks questioned by police", "description": "The man being questioned after a red SUV plowed through Waukesha's Christmas parade, killing at least five people and injuring dozens, has been identified as Darrell E. Brooks Jr., a Milwaukee man with a criminal history dating back to 1999 – with numerous vi…", "url": "https://www.foxnews.com/us/waukesha-christmas-parade-darrell-brooks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/1-waukesha-suspect-thumb.png", "publishedAt": "2021-11-22T15:21:01Z", "content": "The man being questioned after a red SUV plowed through Waukesha's Christmas parade, killing at least five people and injuring dozens, has been identified as Darrell E. Brooks Jr., a Milwaukee man wi… [+2875 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Anthony Davis defends LeBron James, takes jab at Isaiah Stewart after on-court fight", "description": "Los Angeles Lakers center Anthony Davis came to the defense of LeBron James after the superstar was ejected from Sunday’s game against the Detroit Pistons when he threw an elbow at Isaiah Stewart and caught him in the nose and sparked a brouhaha.", "url": "https://www.foxnews.com/sports/anthony-davis-lebron-james-jab-isaiah-stewart", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Anthony-Davis4.jpg", "publishedAt": "2021-11-22T15:15:42Z", "content": "Los Angeles Lakers center Anthony Davis came to the defense of LeBron James after the superstar was ejected from Sundays game against the Detroit Pistons when he threw an elbow at Isaiah Stewart and … [+2048 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "Vaccine mandate deadline raises concerns of TSA understaffing heading into holiday travel", "description": "The deadline for federal workers, including Transportation and Security Administration agents, to be fully vaccinated against COVID-19 is Monday, prompting concerns of understaffing at airports across the nation as millions plan to travel for Thanksgiving and…", "url": "https://www.foxnews.com/politics/vaccine-mandate-deadline-raises-concerns-of-tsa-understaffing-heading-into-holiday-travel", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5fc3e7cf-2f32-487a-9dcd-c7b8d514303e/e7c340fe-c601-46e5-a853-7d72f16c23b0/1280x720/match/image.jpg", "publishedAt": "2021-11-22T15:10:10Z", "content": "The deadline for federal workers, including Transportation and Security Administration agents, to be fully vaccinated against COVID-19 is Monday, prompting concerns of understaffing at airports acros… [+4290 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Emma Colton", "title": "3 flash mobs target high-end San Francisco area stores in 3 days span", "description": "Three flash mobs targeted high-end retail stores in the San Francisco area from Friday night to Sunday evening", "url": "https://www.foxnews.com/us/3-flash-mobs-target-francisco-area-stores-weekend", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Southland-Mall.png", "publishedAt": "2021-11-22T15:08:57Z", "content": "There were three flash mobs\r\n that targeted high-end retail stores from Friday evening to Sunday evening in the San Francisco\r\n area. \r\n\"A large mob robbed Sams Jewelers inside Southland Mall, Haywar… [+3504 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Guadeloupe schools close following COVID rioting", "description": "France's president warned of a \"very explosive\" situation in the Caribbean island of Guadeloupe after protests against COVID-19 rules and vaccinations descended into days of rioting and looting.", "url": "https://www.foxnews.com/world/guadeloupe-schools-close-covid-rioting", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/covidrioting.jpg", "publishedAt": "2021-11-22T14:55:29Z", "content": "Schools\r\n closed across the French Caribbean island of Guadeloupe on Monday and France's president warned of a \"very explosive\" situation in the territory, after protests against COVID-19 rules and v… [+3505 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Greg Norman", "title": "Waukesha Christmas parade horror: Who are the victims?", "description": "At least five people are dead and more than 40 are injured, officials say, after a vehicle plowed through a Christmas parade in Waukesha, Wisconsin, over the weekend.", "url": "https://www.foxnews.com/us/waukesha-christmas-parade-disaster-who-are-the-victims", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/horror-in-wisconsin-pic.png", "publishedAt": "2021-11-22T14:54:54Z", "content": "At least five people are dead and more than 40 are injured, officials say, after a vehicle plowed through a Christmas parade in Waukesha, Wisconsin, over the weekend. \r\nAs of early Monday, none of th… [+1658 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "Mickey Guyton reveals her infant son is recovering well after scary ICU visit ahead of AMAs", "description": "Mickey Guyton revealed that her infant son is on the mend after a scary hospitalization that saw him taken to the ICU.", "url": "https://www.foxnews.com/entertainment/mickey-guyton-infant-son-recovering-amas-performance", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Mickey-Guyton-AP.jpg", "publishedAt": "2021-11-22T14:43:12Z", "content": "Mickey Guyton revealed that her infant son is on the mend after a scary hospitalization that saw him taken to the ICU. \r\nThanks to the help of doctors and the support of her fans, the star revealed t… [+2748 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler Olson", "title": "'Squad' Democrat Tlaib warns 'corporate Dems' Manchin, Sinema, may cut reconciliation in Senate: report", "description": "Rep. Rashida Tlaib called Sens. Joe Manchin and Kyrsten Sinema \"corporate Dems\" in an Axios interview released Sunday.", "url": "https://www.foxnews.com/politics/tlaib-manchin-sinema-reconciliation", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/GettyImages-1233616428.jpg", "publishedAt": "2021-11-22T14:41:52Z", "content": "Progressive Rep. Rashida Tlaib, D-Mich., is \"fearful\" about what could happen to Democrats' massive reconciliation spending plan in the Senate, she told Axios, because moderate Sens. Joe Manchin, D-W… [+3400 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Perri Blumberg", "title": "Sweet and tangy blackberry cranberry sauce for Thanksgiving: Try the recipe", "description": "If you’re looking for an amazing cranberry sauce to add to your repertoire, this blackberry cranberry sauce is vying for a spot on your Thanksgiving day lineup.", "url": "https://www.foxnews.com/food-drink/sweet-tangy-blackberry-cranberry-sauce-recipe", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Blackberry-Cranberry-Sauce_Favorite-Cranberry-Sauce-by-Studio-Delicious.com-1.jpg", "publishedAt": "2021-11-22T14:40:31Z", "content": "If youre looking for an amazing cranberry sauce to add to your repertoire, this blackberry cranberry sauce is vying for a spot on your Thanksgiving day lineup.\r\n\"This cranberry sauce recipe is a deli… [+1509 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler Olson", "title": "Government agencies tell Americans: Downsize Thanksgiving, mask up around family if not vaxxed", "description": "State and local governments are warning that Americans could spread COVID-19 over Thanksgiving, and saying they should keep gatherings small to reduce risk.", "url": "https://www.foxnews.com/politics/government-agencies-tell-americans-downsize-thanksgiving-mask-up-around-family-vaxxed", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/Mask-Kid.jpg", "publishedAt": "2021-11-22T14:34:05Z", "content": "With coronavirus cases in the United States ticking up before  Thanksgiving despite the proliferation of vaccines, many state and local health officials say Americans' Thanksgiving gatherings cannot … [+5421 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "JayLeen Murray", "title": "McEnany shares how faith guided her through politics: God puts certain desires in our hearts for a reason", "description": "Former White House press secretary Kayleigh McEnany joins Fox Nation's 'Ainsley's Bible Study' and opens up about her faith through her political career.", "url": "https://www.foxnews.com/media/mcenany-shares-faith-guided-through-politics-god-puts-certain-desires-hearts-reason", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/kayleigh.png", "publishedAt": "2021-11-22T14:33:16Z", "content": "\"Fox &amp; Friends\" co-host Ainsley Earhardt sat down with Former White House press secretary Kayleigh McEnany on a new episode of Fox Nations\r\n \"Ainsleys Bible Study.\"\r\nMcEnany shared how her faith … [+2299 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Poole, Wiggins have 30-point outings, Warriors beat Raptors", "description": "Jordan Poole had his second straight 30-point performance with 33, Andrew Wiggins added 32 points and seven rebounds, and the Golden State Warriors beat the Toronto Raptors 119-104 on Sunday night with Stephen Curry's supporting cast taking pressure off the r…", "url": "https://www.foxnews.com/sports/poole-wiggins-have-30-point-outings-warriors-beat-raptors", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326079620337.jpg", "publishedAt": "2021-11-22T14:22:31Z", "content": "Jordan Poole had his second straight 30-point performance with 33, Andrew Wiggins added 32 points and seven rebounds, and the Golden State Warriors beat the Toronto Raptors 119-104 on Sunday night wi… [+2948 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Fleury notches 1st shutout of season in win over Canucks", "description": "Marc-Andre Fleury stopped 40 shots in his first shutout of the season and the Chicago Blackhawks blanked the Vancouver Canucks 1-0 on Sunday night.", "url": "https://www.foxnews.com/sports/fleury-notches-1st-shutout-of-season-in-win-over-canucks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326111386219.jpg", "publishedAt": "2021-11-22T14:10:03Z", "content": "Marc-Andre Fleury stopped 40 shots in his first shutout of the season and the Chicago Blackhawks blanked the Vancouver Canucks 1-0 on Sunday night.\r\nBrandon Hagel scored the games lone goal with a th… [+2735 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Schwartz, Kraken top Capitals 5-2 to end six-game skid", "description": "Jaden Schwartz had a goal and three assists and the Seattle Kraken beat the Washington Capitals 5-2 on Sunday night to snap a six-game losing streak.", "url": "https://www.foxnews.com/sports/schwartz-kraken-top-capitals-5-2-to-end-six-game-skid", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326112755798.jpg", "publishedAt": "2021-11-22T14:04:52Z", "content": "Jaden Schwartz had a goal and three assists and the Seattle Kraken beat the Washington Capitals 5-2 on Sunday night to snap a six-game losing streak.\r\nCalle Jarnkrok and Yanni Gorde each added a goal… [+3303 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Vejmelka gets first win, Coyotes knock off Kings 2-1 in OT", "description": "Kyle Capobianco scored with 1:34 remaining in overtime, Karel Vejmelka stopped 37 shots for his first career win and the Arizona Coyotes defeated the Los Angeles Kings 2-1 on Sunday night.", "url": "https://www.foxnews.com/sports/vejmelka-gets-first-win-coyotes-knock-off-kings-2-1-in-ot", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326140032120.jpg", "publishedAt": "2021-11-22T13:58:50Z", "content": "Kyle Capobianco scored with 1:34 remaining in overtime, Karel Vejmelka stopped 37 shots for his first career win and the Arizona Coyotes defeated the Los Angeles Kings 2-1 on Sunday night.\r\nTravis Bo… [+3552 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Analysis: Some teams just needed more time to bloom", "description": "Patrick Mahomes and the Kansas City Chiefs are back in a familiar spot. Same for Bill Belichick and the New England Patriots.", "url": "https://www.foxnews.com/sports/analysis-some-teams-just-needed-more-time-to-bloom", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325793104891.jpg", "publishedAt": "2021-11-22T13:54:58Z", "content": "Patrick Mahomes and the Kansas City Chiefs are back in a familiar spot. Same for Bill Belichick and the New England Patriots.\r\nThe Chiefs and Patriots have surged to first place in their respective d… [+3877 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "AP Top 25 Reality Check: Places change but teams remain same", "description": "It took 12 weeks of regular-season play to have a turnover-free AP Top 25.", "url": "https://www.foxnews.com/sports/ap-top-25-reality-check-places-change-but-teams-remain-same", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21324700450253.jpg", "publishedAt": "2021-11-22T13:52:01Z", "content": "It took 12 weeks of regular-season play to have a turnover-free AP Top 25.\r\nFor the first time in 2021 all the teams that were ranked in The Associated Press college football poll presented by Region… [+7629 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Kyle Rittenhouse tells Tucker Carlson case had ‘nothing to do with race’ in first interview after acquittal", "description": "Kyle Rittenhouse, who a Wisconsin jury found not guilty on all five charges last week to conclude a high-profile murder trial that polarized the nation, sat down with Tucker Carlson for his exclusive first interview following his acquittal.", "url": "https://www.foxnews.com/media/kyle-rittenhouse-tucker-carlson-first-interview-after-acquittal", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/KYLE-RITTENHOUSE-INTERVIEW-FOX-NEWS.jpg", "publishedAt": "2021-11-22T13:51:49Z", "content": "Kyle Rittenhouse, who a Wisconsin jury found not guilty on all five charges last week to conclude a high-profile murder trial that polarized the nation, sat down with Tucker Carlson for his exclusive… [+2027 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Rebecca Rosenberg", "title": "Ahmaud Arbery trial: Georgia jurors not permitted to hear explosive evidence", "description": "Closing arguments are slated to begin Monday in the trial of three White men accused of the slaying of Ahmaud Arbery — and this is the explosive evidence jurors didn’t hear.", "url": "https://www.foxnews.com/us/ahmaud-arbery-trial-what-georgia-jurors-didnt-hear", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AHMAUDTRIALDAYONE.jpg", "publishedAt": "2021-11-22T13:50:42Z", "content": "Closing arguments are slated to begin Monday in the trial of three White men accused of the slaying of Ahmaud Arbery\r\n and this is the explosive evidence jurors didnt hear.\r\nTravis McMichael, 35, his… [+5315 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brandon Gillespie", "title": "Critics pan Thanksgiving advice in New York Times that kids who aren't fully vaccinated should 'eat quickly'", "description": "An article for The New York Times offering advice on how to mitigate coronavirus risks at family Thanksgiving gatherings featured an expert calling on kids aren't fully vaccinated to \"eat quickly.\"", "url": "https://www.foxnews.com/media/critics-new-york-times-thanksgiving-advice-kids-vaccinated", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Thanksgiving-nyt.jpg", "publishedAt": "2021-11-22T13:45:55Z", "content": "An article for The New York Times offering advice on how to mitigate coronavirus risks at family Thanksgiving gatherings featured an expert calling on kids aren't fully vaccinated to \"eat quickly.\"\r\n… [+2827 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "IOC call with Chinese tennis star Peng raises more questions", "description": "A video call between Olympic officials and Chinese tennis player Peng Shuai, whose nearly three-week disappearance from public view sparked an outcry, was meant to reassure the world that she was safe — but instead has raised more questions.", "url": "https://www.foxnews.com/sports/ioc-call-with-chinese-tennis-star-peng-raises-more-questions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/2021-11-18T202618Z_98968081_RC28XQ9ZOTEG_RTRMADP_3_TENNIS-CHINA-PENG.jpg", "publishedAt": "2021-11-22T13:41:46Z", "content": "A video call between Olympic officials and Chinese tennis player Peng Shuai, whose nearly three-week disappearance from public view sparked an outcry, was meant to reassure the world that she was saf… [+5729 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Dutch leader slams rioters across Netherlands as 'idiots'", "description": "Dutch caretaker Prime Minister Mark Rutte on Monday condemned rioters in Rotterdam and other towns and cities across the Netherlands over the weekend as “idiots” and said police and prosecutors would bring them to justice.", "url": "https://www.foxnews.com/world/dutch-leader-rioters-netherlands-idiots", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/protestsnetherlands.jpg", "publishedAt": "2021-11-22T13:39:53Z", "content": "Dutch caretaker Prime Minister Mark Rutte on Monday condemned rioters in Rotterdam and other towns and cities across the Netherlands over the weekend as \"idiots\" and said police\r\n and prosecutors wou… [+2729 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "2021 AMAs red carpet: The top 5 best looks from the 49th annual show", "description": "Celebrities gathered at the Microsoft Theater in Los Angeles on Sunday for the 2021 American Music Awards.", "url": "https://www.foxnews.com/entertainment/2021-amas-red-carpet-top-5-looks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Chloe-Bailey-AMA-AP.jpg", "publishedAt": "2021-11-22T13:29:07Z", "content": "Celebrities gathered at the Microsoft Theater in Los Angeles on Sunday for the 2021 American Music Awards. \r\nThe venue, which plays home to many prominent awards shows for celebrities, is no stranger… [+3559 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News Staff", "title": "Joe Concha: Donors ‘really’ want Pete Buttigieg as Democratic Party presidential nominee in 2024", "description": "Addressing speculation that there is a rivalry between Department of Transportation Secretary Pete Buttigieg and Vice President Kamala Harris, Fox News contributor Joe Concha argued on Monday that donors \"really\" want Pete Buttigieg as the next Democratic Par…", "url": "https://www.foxnews.com/media/joe-concha-donors-really-want-pete-buttigieg-as-democratic-party-presidential-nominee-in-2024", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Joe-Concha-Donors-really-want-Pete-Buttigieg-as-Democratic-Party-presidential-nominee-in-2024.jpeg", "publishedAt": "2021-11-22T13:26:28Z", "content": "Addressing speculation that there is a rivalry between Department of Transportation Secretary Pete Buttigieg and Vice President Kamala Harris, Fox News contributor Joe Concha argued Monday on Fox &am… [+1072 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Emma Colton", "title": "Back to back flash mob lootings in San Francisco area alarming experts", "description": "California security experts are alarmed by the increase in flash mobs targeting high-end retail stores after back-to-back incidents", "url": "https://www.foxnews.com/us/repeated-organized-flash-mob-robberies-san-francisco-security-experts", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/walnut-creek-nordstrom.png", "publishedAt": "2021-11-22T13:13:53Z", "content": "The San Francisco area saw back-to-back flash mobs ransack a Nordstrom and a Louis Vuitton over a 24-hour period, alarming security experts in a city that has already been struggling with rampant sma… [+4711 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Queen Elizabeth II attends double christening of great-grandsons", "description": "Queen Elizabeth II attended a double christening on Sunday for two of her great-grandchildren.", "url": "https://www.foxnews.com/entertainment/queen-elizabeth-ii-double-christening-great-grandsons", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/queenelizabethcar.jpg", "publishedAt": "2021-11-22T12:27:59Z", "content": "Queen Elizabeth II\r\n attended a double christening on Sunday for two of her great-grandchildren. \r\nThe 95-year-old British monarch, who has canceled several recent public appearances on her doctors a… [+1993 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "President Xi Jinping says China won't seek dominance over Southeast Asia or bully smaller countries", "description": "Chinese leader Xi Jinping on Monday said his country will not seek dominance over Southeast Asia or bully its smaller neighbors, amid ongoing friction over the South China Sea.", "url": "https://www.foxnews.com/world/president-xi-jinping-china-wont-seek-dominance-over-southeast-asia-bully-smaller-countries", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/xichinapresident.jpg", "publishedAt": "2021-11-22T12:10:02Z", "content": "Chinese\r\n leader Xi Jinping on Monday said his country will not seek dominance over Southeast Asia or bully its smaller neighbors, amid ongoing friction over the South China Sea. \r\nXi made the remark… [+7234 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nikki Haley", "title": "Diverse conservative candidates should run for office. Here's why", "description": "\"Nikki who?\" That was the number-one response I heard when I first ran to represent the people of South Carolina.", "url": "https://www.foxnews.com/opinion/diverse-conservative-candidates-run-office-nikki-haley", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f3925156-f9da-4c3a-9baa-395cec409f76/ee81c4fc-14ef-457f-900e-2003eda148a6/1280x720/match/image.jpg", "publishedAt": "2021-11-22T12:00:50Z", "content": "\"Nikki who?\" \r\nThat was the number-one response I heard when I first ran to represent the people of South Carolina. At the time, I was an accountant and small businesswoman who saw how hard it was to… [+5173 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Perri Blumberg", "title": "Pumpkin bread with dark chocolate chips and almonds: Try the recipe", "description": "Bonnie Taub-Dix, RDN, nutrition consultant, media trainer, and author of Read It Before You Eat It - Taking You from Label to Table shared this recipe with Fox News.", "url": "https://www.foxnews.com/food-drink/pumpkin-bread-dark-chocolate-chips-almonds-recipe", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2021-11-22T11:55:20Z", "content": "Pumpkin bread season is here. What better way to start your day than with a slice of pumpkin bread, a cup of coffee, and a moment of gratitude.\r\nIf you like this recipe, it may quickly become a year-… [+2229 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "American Music Awards crown South Korean band BTS artist of the year", "description": "South Korean superstars BTS were crowned artist of the year at the American Music Awards on Sunday, brushing aside challenges from Taylor Swift, Drake and The Weeknd as they took home a total of three awards and teamed up with Coldplay for a raucous “My Unive…", "url": "https://www.foxnews.com/entertainment/american-music-awards-crown-south-korean-band-bts-artist-of-the-year", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/BTS-AP.jpg", "publishedAt": "2021-11-22T11:39:32Z", "content": "South Korean superstars BTS were crowned artist of the year at the American Music Awards on Sunday, brushing aside challenges from Taylor Swift, Drake and The Weeknd as they took home a total of thre… [+5045 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ronn Blitzer", "title": "Nat’l Economic Council Dir claims social spending bill will lower deficit by $2T, while experts say otherwise", "description": "Brian Deese, director of the White House's National Economic Council, insisted that the Build Back Better Act is fiscally responsible and truly pays for itself over time, despite contrary claims from Obama administration experts.", "url": "https://www.foxnews.com/politics/natl-economic-council-dir-claims-social-spending-bill-will-lower-deficit-despite-experts-stating-otherwise", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/12/Brian-Deese.jpg", "publishedAt": "2021-11-22T11:38:12Z", "content": "Brian Deese, director of the White House's National Economic Council, insisted that the Build Back Better Act is fiscally responsible and truly pays for itself over time, despite contrary claims from… [+2043 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gary Gastelu", "title": "NASCAR'S Knockout: Series brings back qualifying with new format for 2022", "description": "NASCAR is launching a new knockout-style qualifying format in 2022. Different versions will be used at the various track types the series visits.", "url": "https://www.foxnews.com/auto/nascars-knockout-qualifying-format-2022", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/nascar-1.jpg", "publishedAt": "2021-11-22T11:21:12Z", "content": "NASCAR is bringing back practice and qualifying to all of its races in 2022 after suspending both for the majority of events since the outbreak of the coronavirus pandemic.\r\nKyle Larson won the pole … [+1238 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler O'Neil", "title": "Democrats celebrate SPLC anniversary, ignore race, sex, fundraising scandals", "description": "Prominent Democratic legislators congratulated the Southern Poverty Law Center on its fiftieth anniversary on Thursday, without once mentioning the leftist organization's 2019 sexual harassment and racial discrimination scandal, claims of a deceptive fundrais…", "url": "https://www.foxnews.com/politics/democrats-celebrate-splc-anniversary-ignore-race-sex-fundraising-scandals", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/ap18264824899654.jpg", "publishedAt": "2021-11-22T11:19:59Z", "content": "Prominent Democratic legislators congratulated the Southern Poverty Law Center on its fiftieth anniversary on Thursday, without once mentioning the leftist organization's 2019 scandal involving claim… [+4945 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gary Gastelu", "title": "1987 Buick GNX muscle car sold for near-record $206,000", "description": "A 1987 Buick GNX Muscle car with 1,190 miles on the odometer was sold for the second-highest price ever for the model on the Bring A Trailer auction website at $206,000.", "url": "https://www.foxnews.com/auto/1987-buick-gnx-muscle-car-sold-206000", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/gnx-1.jpg", "publishedAt": "2021-11-22T11:19:03Z", "content": "A 1987 Buick GNX muscle car with 1,190 miles on the odometer has been sold for a near-record $206,000.\r\nThe price paid for the black two-door was the second highest ever for a sale on the Bring A Tra… [+711 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Rick Scott", "title": "Democrats reeling year before midterm elections – here's how Republicans stay on top and win big in 2022", "description": "I said in March there was going to be a lot of buyer’s remorse when voters saw what Joe Biden and the Democrats were up to with total control of Washington. That was an understatement.", "url": "https://www.foxnews.com/opinion/democrats-reeling-2022-midterms-republicans-win-sen-rick-scott", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/333be899-6841-4cc6-8501-103018b1ea0a/baeec7e9-da31-4c59-9f4b-446eaa6a9923/1280x720/match/image.jpg", "publishedAt": "2021-11-22T11:00:29Z", "content": "I said in March there was going to be a lot of buyers remorse when voters saw what Joe Biden and the Democrats were up to with total control of Washington. That was an understatement. \r\nIn a recent s… [+3828 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler O'Neil", "title": "Christians from different races, denominations, and parties gather to pray before Supreme Court abortion case", "description": "Blacks and Whites, Catholics and Protestants, Democrats and Republicans will gather at a historically Black church in Mississippi and at the four corners of the United States to pray two days before the Supreme Court takes up the case Dobbs v. Jackson Women's…", "url": "https://www.foxnews.com/faith-values/christians-from-different-races-denominations-and-parties-gather-to-pray-before-supreme-court-abortion-case", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Abortions091819.jpg", "publishedAt": "2021-11-22T10:40:49Z", "content": "FIRST ON FOX Blacks and Whites, Catholics and Protestants, Democrats and Republicans will gather at a historically Black church in Mississippi and at locations across the United States to pray two da… [+4525 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Matt Wall, Lisa Bennatan", "title": "Waukesha parade horror: Wisconsin police union official reveals what's next in investigation", "description": "EXCLUSIVE: The public needs to be cautious about speculating on a motive for Sunday evening's Christmas parade horror in Waukesha, the president of the Wisconsin Fraternal Order of Police told Fox News in an interview .", "url": "https://www.foxnews.com/us/waukesha-parade-horror-wisconsin-police-union-investigation", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/2021-11-22T022745Z_326586140_RC27ZQ9CVBM3_RTRMADP_3_WISCONSIN-PARADE.jpg", "publishedAt": "2021-11-22T10:02:24Z", "content": "EXCLUSIVE: The public needs to be cautious about speculating on a motive for Sunday evening's Christmas parade horror in Waukesha, the president of the Wisconsin Fraternal Order of Police told Fox Ne… [+2851 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Liz Peek", "title": "Bernie Sanders gets his $5T bill", "description": "We thought Joe Biden was supposed to care about the \"little guy.\" But it’s the little guy who’s taking it on the chin. And for what? To satisfy the long-held ambitions of Bernie Sanders.", "url": "https://www.foxnews.com/opinion/bernie-sanders-gets-his-5t-bill", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6cb8d5a5-e43f-4577-9843-4c8a2bca8622/4be83de5-98e1-4f6c-8782-f9d90d7aa68c/1280x720/match/image.jpg", "publishedAt": "2021-11-22T10:00:38Z", "content": "Does Joe Biden actually want to crush low-income Americans with high inflation?  \r\nYou have to wonder. Since Biden took office, it seems his every decision has tilted toward driving prices higher.  \r… [+5631 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "William Sanchez", "title": "Rep. Hartzler Talks Inflation, Selective Military Service, and GOP Midterms Confidence", "description": "On Friday, November 19th the House was able to pass President Biden’s nearly $2 trillion social spending bill, now moving on to the Senate where it will need the support of all 50 Democrats to pass, one of the last opportunities for sweeping legislation befor…", "url": "https://radio.foxnews.com/2021/11/22/the-fox-news-rundown-11-22-2021/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2020/05/Rundown-Featured-Image-NEW.png", "publishedAt": "2021-11-22T10:00:01Z", "content": "On Friday, November 19th the House was able to pass President Biden’s nearly $2 trillion social spending bill, now moving on to the Senate where it will need the support of all 50 Democrats to pass, … [+1161 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Wisconsin Christmas parade tragedy results in multiple deaths, injuries; suspect in custody", "description": "", "url": "https://www.foxnews.com/us/wisconsin-christmas-parade-tragedy-multiple-deaths-injuries-suspect-custody-fox-news-first", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/3a488174-Waukesha-thumb-3.jpg", "publishedAt": "2021-11-22T09:57:05Z", "content": "Good morning and welcome to Fox News First. Here's what you need to know as you start your day \r\nMultiple deaths, injuries reported after SUV plows into Wisconsin Christmas paradeAuthorities in a Mil… [+8018 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bradford Betz", "title": "Illinois Democrat ties Waukesha tragedy to Rittenhouse case in mocking posts: ‘It was probably self-defense’", "description": "After Sunday’s Christmas parade horror in Waukesha, Wisconsin, an Illinois Democrat appeared to portray the tragedy as a form of payback for Friday’s acquittal of Kyle Rittenhouse in Kenosha.", "url": "https://www.foxnews.com/us/illinois-democrat-waukesha-tragedy-rittenhouse-mocking-twitter-self-defense", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Mary-Lemanski-tweet.jpg", "publishedAt": "2021-11-22T09:20:52Z", "content": "After Sundays Christmas parade horror in Waukesha, Wisconsin, an Illinois Democrat appeared to portray the tragedy as a form of payback for Fridays acquittal of Kyle Rittenhouse in Kenosha.\r\n\"It was … [+2175 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dom Calicchio", "title": "Waukesha parade tragedy draws responses from White House, Wisconsin leaders, sports teams", "description": "As news spread late Sunday about the Christmas parade tragedy in Waukesha, Wisconsin, it didn’t take long for messages of concern and support for the community to begin circulating.", "url": "https://www.foxnews.com/us/waukesha-parade-tragedy-responses-white-house-wisconsin-leaders-sports-teams", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/2021-11-22T021257Z_1144136734_RC28ZQ9H7LWI_RTRMADP_3_WISCONSIN-PARADE.jpg", "publishedAt": "2021-11-22T08:05:51Z", "content": "As news spread late Sunday about the Christmas parade tragedy in Waukesha, Wisconsin, it didnt take long for messages of concern and support for the community to begin circulating.\r\nThose posting mes… [+1386 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Roman Reigns, Becky Lynch highlight Survivor Series, Raw tops SmackDown", "description": "Roman Reigns and Becky Lynch left Survivor Series with big wins as Raw picked up brand supremacy at the annual WWE pay-per-view on Sunday night at the Barclays Center in Brooklyn N.Y.", "url": "https://www.foxnews.com/sports/roman-reigns-becky-lynch-survivor-series-raw-smackdown", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Roman-Reigns3.jpg", "publishedAt": "2021-11-22T07:51:33Z", "content": "Roman Reigns and Becky Lynch left Survivor Series with big wins as Raw picked up brand supremacy at the annual WWE pay-per-view on Sunday night at the Barclays Center in Brooklyn N.Y.\r\nReigns, the WW… [+3341 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Herbert throws for 382 yards, Chargers hold off Steelers", "description": "Justin Herbert and the Los Angeles Chargers had the uncanny knack of blowing double-digit leads and losing in the last minute.", "url": "https://www.foxnews.com/sports/herbert-throws-382-yards-chargers-hold-off-steelers", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Justin-Herbert.jpg", "publishedAt": "2021-11-22T06:55:46Z", "content": "Justin Herbert and the Los Angeles Chargers had the uncanny knack of blowing double-digit leads and losing in the last minute.\r\nNot anymore.\r\nHerbert threw a 53-yard touchdown pass to Mike Williams w… [+5485 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Dom Calicchio", "title": "Waukesha parade horror: Person of interest in custody, fatalities reported", "description": "Authorities in a Milwaukee suburb continued overnight to deal with the aftermath after a red SUV plowed into Christmas parade marchers and spectators Sunday evening, striking more than 20 adults and children.", "url": "https://www.foxnews.com/us/waukesha-parade-horror-person-interest-custody-fatalities", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Waukesha-thumb-2.jpg", "publishedAt": "2021-11-22T05:57:49Z", "content": "Authorities in a Milwaukee suburb continued overnight to deal with the aftermath after a red SUV plowed into Christmas parade marchers and spectators Sunday evening, striking more than 20 adults and … [+3889 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler O'Neil", "title": "Rittenhouse posts from Virginia university slammed as 'politicized rhetoric'", "description": "When a Wisconsin jury acquitted Kyle Rittenhouse of murder charges last week, that development hampered the progress of science, a Virginia university's chemistry department suggested in a series of online posts that at least one critic is deriding as inappro…", "url": "https://www.foxnews.com/politics/rittenhouse-posts-james-madison-virginia-university-politicized-rhetoric", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/iStock-613314980.jpg", "publishedAt": "2021-11-22T04:29:49Z", "content": "When a Wisconsin jury acquitted Kyle Rittenhouse of murder charges last week, that development hampered the progress of science, a Virginia university's chemistry department suggested in a series of … [+5451 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paul Best", "title": "California police release video, new info on Silicon Valley-area shootout with suspect in stolen vehicle", "description": "Police in California's Silicon Valley area released new information this weekend about an extensive shootout last month involving an armed suspect in a stolen vehicle.", "url": "https://www.foxnews.com/us/california-police-milpitas-video-silicon-valley-shootout-suspect-stolen-vehicle", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/CALI-SHOOTING-FIN.png", "publishedAt": "2021-11-22T03:35:04Z", "content": "Police in California's Silicon Valley area released new information this weekend about an extensive shootout last month involving an armed suspect in a stolen vehicle.\r\nThe suspect, identified as Mic… [+2038 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paul Best", "title": "New York man stabbed to death on subway train in 'unprovoked' attack: police", "description": "The NYPD is searching for a suspect who stabbed a 32-year-old man to death on a subway train in the early hours of Sunday morning.", "url": "https://www.foxnews.com/us/new-york-man-stabbed-to-death-on-subway-train-in-unprovoked-attack-police", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/subway-fin.png", "publishedAt": "2021-11-22T02:57:55Z", "content": "The NYPD is searching for a suspect who allegedly stabbed a 32-year-old man to death on a subway train in the early hours of Sunday morning. \r\nThe northbound 2 train was pulling into the 34th Street-… [+952 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Sabes", "title": "Massachusetts university hosts segregated 'processing' spaces for responding to Rittenhouse verdict", "description": "Fitchburg State University in Massachusetts hosted several “processing” spaces segregated by race in response to the Kyle Rittenhouse trial verdict, which found Rittenhouse not guilty on all charges.", "url": "https://www.foxnews.com/us/massachusetts-university-hosts-segregated-processing-spaces-for-responding-to-rittenhouse-verdict", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/KYLE-RITTENHOUSE-COURTROOM-NOT-GUILTY-VERDICT.jpg", "publishedAt": "2021-11-22T02:54:31Z", "content": "Fitchburg State University in Massachusetts hosted several \"processing\" spaces segregated by race in response to the Kyle Rittenhouse trial verdict, which found Rittenhouse not guilty on all charges.… [+3454 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Ruiz", "title": "Waukesha Christmas parade witnesses describe chaos, blood after SUV strikes nearly 2 dozen", "description": "Waukesha authorities say a driver slammed into almost two dozen people, half of them children, at the community’s Christmas parade Sunday evening.", "url": "https://www.foxnews.com/us/waukesha-christmas-parade-witnesses-chaos-blood", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/horror-in-wisconsin-pic.png", "publishedAt": "2021-11-22T02:29:44Z", "content": "Waukesha, Wisconsin, authorities say a driver slammed into almost two dozen people, half of them children, at the communitys Christmas parade Sunday evening.\r\nPolice confirmed multiple fatalities and… [+4608 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Sabes", "title": "Nebraska governor blasts state university for 'anti-racism' plan: 'Drop the Ideological Indoctrination'", "description": "Nebraska Governor Pete Ricketts is blasting the University of Nebraska - Lincoln after they released a “Commitment to Action” toward its “Journey for Anti-Racism and Racial Equity.”", "url": "https://www.foxnews.com/us/ne-governor-blasts-state-university-for-anti-racism-plan-drop-the-ideological-indoctrination", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Pete-Ricketts-thumb.png", "publishedAt": "2021-11-22T02:15:09Z", "content": "Nebraska Governor Pete Ricketts is blasting the University of Nebraska - Lincoln after it released a \"Commitment to Action\" toward its \"Journey for Anti-Racism and Racial Equity.\"\r\nThe plan was inspi… [+3036 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Lakers' LeBron James, Pistons' Isaiah Stewart ejected following brawl", "description": "Lakers superstar LeBron James was ejected from the team’s game against the Pistons after he drilled Detroit’s Isaiah Stewart in the head with an elbow while the two players were fighting for a rebound in the third quarter of Sunday’s matchup.", "url": "https://www.foxnews.com/sports/lakers-lebron-james-pistons-isaiah-stewart-ejected-following-brawl", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326025985406.jpg", "publishedAt": "2021-11-22T02:06:04Z", "content": "Lakers superstar LeBron James was ejected from the teams game against the Pistons after he drilled Detroits Isaiah Stewart in the head with an elbow while the two players were fighting for a rebound … [+1330 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lindsay Kornick", "title": "Dr. Ben Carson speaks out on 'unthinkable' tragedy in Wisconsin", "description": "Former Housing and Urban Development Secretary Dr. Ben Carson reacted to the news of an SUV plowing through a Christmas parade in Waukesha, Wisconsin.", "url": "https://www.foxnews.com/media/dr-ben-carson-unthinkable-tragedy-wisconsin", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Red-Car-2.jpg", "publishedAt": "2021-11-22T01:55:24Z", "content": "Initially appearing for a segment on education, former Housing and Urban Development Secretary Dr. Ben Carson gave his reaction to the tragedy in Wisconsin on \"Sunday Night in America\" with Trey Gowd… [+3035 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Chiefs rely on defense in victory over Dak Prescott, Cowboys", "description": "The Kansas City Chiefs' defense was getting a lot of criticism early this season. After a dominating performance against the NFC East-leading Dallas Cowboys, it may have finally put the doubts to rest.", "url": "https://www.foxnews.com/sports/chiefs-defense-victory-over-dak-prescott-cowboys", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325804696149.jpg", "publishedAt": "2021-11-22T01:22:31Z", "content": "The Kansas City Chiefs' defense was getting a lot of criticism early this season. After a dominating performance against the NFC East-leading Dallas Cowboys, it may have finally put the doubts to res… [+1980 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Venezuela votes in regional election under international eye", "description": "Venezuela’s electoral system was being put to the test Sunday, with millions of people casting ballots for thousands of races — the first in four years with major opposition participation following a series of boycotts over unfair conditions.", "url": "https://www.foxnews.com/world/venezuela-regional-election-international-eye", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP213255082066281.jpg", "publishedAt": "2021-11-22T00:53:17Z", "content": "Venezuelas electoral system was being put to the test Sunday, with millions of people casting ballots for thousands of races the first in four years with major opposition participation following a se… [+6900 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "McCoy leads Cardinals to decisive 23-13 win over Seahawks", "description": "Colt McCoy was outstanding filling in for Kyler Murray, throwing for 328 yards and two touchdowns, and the Arizona Cardinals beat the Seattle Seahawks 23-13 on Sunday.", "url": "https://www.foxnews.com/sports/mccoy-leads-cardinals-to-decisive-23-13-win-over-seahawks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21326018969405.jpg", "publishedAt": "2021-11-22T00:50:04Z", "content": "Colt McCoy was outstanding filling in for Kyler Murray, throwing for 328 yards and two touchdowns, and the Arizona Cardinals beat the Seattle Seahawks 23-13 on Sunday.\r\nFor the second straight season… [+3240 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Bengals snap skid, topple slumping Raiders 32-13", "description": "Joe Mixon rushed for 123 yards and scored two touchdowns and the Cincinnati Bengals defeated the Las Vegas Raiders 32-13 on Sunday.", "url": "https://www.foxnews.com/sports/bengals-snap-skid-topple-slumping-raiders-32-13", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325855889386.jpg", "publishedAt": "2021-11-22T00:35:08Z", "content": "Joe Mixon rushed for 123 yards and scored two touchdowns and the Cincinnati Bengals defeated the Las Vegas Raiders 32-13 on Sunday.\r\nThe well-rested Bengals (6-4) came out of their bye week and snapp… [+2571 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew Mark Miller", "title": "Christmas parade: SUV mows down crowd, several killed, person of interest in custody: LIVE UPDATES", "description": "A parade in Waukesha, Wisconsin was interrupted after a car could be seen in a live stream zooming by a parade and reportedly crashed into bystanders.", "url": "https://www.foxnews.com/live-news/waukesha-christmas-parade", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2021-11-22T00:14:39Z", "content": "A Wisconsin man attending the Waukesha Christmas parade said the red SUV that slammed into participants Sunday struck at least 10 people as he was stepping out of a pub along the parade route.\r\nAs I … [+1051 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Vikings, Kirk Cousins outduel Packers, Aaron Rodgers in NFC North showdown", "description": "Vikings quarterback Kirk Cousins threw for 341 yards and three touchdowns, and kicker Greg Joseph booted a 29-yard game-winning field goal as time expired to lead Minnesota to a 34-31 victory over the Packers Sunday afternoon.", "url": "https://www.foxnews.com/sports/vikings-kirk-cousins-outduel-packers-aaron-rodgers-nfc-north-showdown", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325761164903.jpg", "publishedAt": "2021-11-21T23:55:22Z", "content": "Vikings quarterback Kirk Cousins threw for 341 yards and three touchdowns, and kicker Greg Joseph booted a 29-yard game-winning field goal as time expired to lead Minnesota to a 34-31 victory over th… [+2053 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew Miller", "title": "Wisconsin Christmas parade interrupted after vehicle reportedly plows into crowd", "description": "A parade in Waukesha, Wisconsin was interrupted when a car reportedly plowed through the crowd leaving several injured.", "url": "https://www.foxnews.com/us/wisconsin-christmas-parade-interrupted-after-vehicle-reportedly-plows-into-crowd", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Red-Car-2.jpg", "publishedAt": "2021-11-21T23:30:20Z", "content": "A parade in Waukesha, Wisconsin was interrupted after a car could be seen in a live stream zooming by a parade and reportedly crashed into bystanders.\r\nOn Sunday afternoon, a car could be seen speedi… [+641 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "No. 1 South Carolina routs No. 9 Oregon 80-63, faces UConn", "description": "After running past Oregon, top-ranked South Carolina is ready to face No. 2 UConn.", "url": "https://www.foxnews.com/sports/no-1-south-carolina-routs-no-9-oregon-80-63-faces-uconn", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325736226721.jpg", "publishedAt": "2021-11-21T23:03:55Z", "content": "After running past Oregon, top-ranked South Carolina is ready to face No. 2 UConn.\r\nZia Cooke scored 20 points and Laeticia Amihere added 18 to help South Carolina rout No. 9 Oregon 80-63 on Sunday i… [+3186 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "William Sanchez", "title": "FOX News Rundown EXTRA: Pete Hegseth On The Importance Of Honoring Patriotism", "description": "This past Wednesday, FOX Nation aired its third annual Patriot Awards to honor America’s true heroes, including military veterans, first responders and other inspirational and everyday American patriots. It will also re-air tonight on the FOX News Channel. FO…", "url": "https://radio.foxnews.com/2021/11/21/the-fox-news-rundown-11-20-2021/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2020/05/Rundown-Featured-Image-NEW.png", "publishedAt": "2021-11-21T23:00:03Z", "content": "This past Wednesday, FOX Nation aired its third annual Patriot Awards to honor America’s true heroes, including military veterans, first responders and other inspirational and everyday American patri… [+824 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Bueckers, No. 2 UConn hold off No. 23 South Florida 60-53", "description": "Connecticut's Geno Auriemma keeps pushing for Paige Bueckers and freshman Azzi Fudd to shoot more.", "url": "https://www.foxnews.com/sports/bueckers-no-2-uconn-hold-off-no-23-south-florida-60-53", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325705452850.jpg", "publishedAt": "2021-11-21T22:58:25Z", "content": "Connecticut's Geno Auriemma keeps pushing for Paige Bueckers and freshman Azzi Fudd to shoot more.\r\nGames like Sunday are only going to make the Hall of Fame coach more persistent especially consider… [+4131 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Daniel Canova", "title": "Jonathan Taylor scores 5 TDs, leads Colts to blowout victory over Bills", "description": "It was Jonathan Taylor’s day Sunday afternoon.", "url": "https://www.foxnews.com/sports/jonathan-taylor-5-tds-leads-colts-blowout-victory-bills", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325734427172.jpg", "publishedAt": "2021-11-21T22:41:30Z", "content": "It was Jonathan Taylors day Sunday afternoon.\r\nThe Colts star running back finished with 204 total yards from scrimmage and set a franchise record by scoring five touchdowns as Indianapolis cruised t… [+1826 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "'I lost everything': Guadeloupe riots overtake COVID protest", "description": "Residents in the Caribbean island of Guadeloupe, an overseas territory of France, expressed dismay Sunday after protests against COVID-19 restrictions erupted into rioting and looting for the third day in a row, prompting French authorities to send in police …", "url": "https://www.foxnews.com/world/everything-guadeloupe-riots-covid-protest", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP213256860751461.jpg", "publishedAt": "2021-11-21T22:20:14Z", "content": "Residents in the Caribbean island of Guadeloupe, an overseas territory of France, expressed dismay Sunday after protests against COVID-19 restrictions erupted into rioting and looting for the third d… [+5791 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lindsay Kornick", "title": "Associated Press accuses Republicans of using Rittenhouse case 'to exploit national divide' on race", "description": "The Associated Press accused Republicans of wanting “to exploit the national divide over matters of grievance and race” through the Kyle Rittenhouse trial.", "url": "https://www.foxnews.com/media/associated-press-republicans-rittenhouse-case-national-divide-race", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/Tiffany-Cross.jpg", "publishedAt": "2021-11-21T22:19:33Z", "content": "An Associated Press reporter appeared to target Republicans in the wake of the Rittenhouse trial ruling, with a headline on Sunday that read, \"Rittenhouse acquittal tightens the political vise for Bi… [+2807 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paul Best, Adam Sabes", "title": "California memorial service held for model whose lifeless body was dumped at hospital after night of parties", "description": "Friends and family of Christy Giles, a Los Angeles model whose lifeless body was dropped by masked men at a hospital last week, are gathering on Sunday to remember the 24-year-old.", "url": "https://www.foxnews.com/us/california-memorial-model-christy-giles", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Christy-Giles.jpg", "publishedAt": "2021-11-21T22:16:02Z", "content": "Friends and family of Christy Giles, a Los Angeles model whose lifeless body was dropped by masked men at a hospital last week, were set to gather on Sunday to remember the 24-year-old. \r\n\"She was on… [+2940 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Freeman TD lifts Ravens over Bears with Jackson sidelined", "description": "Subbing for star quarterback Lamar Jackson, Tyler Huntley led a winning drive capped by Devonta Freeman's 3-yard run with 22 seconds remaining, and the Baltimore Ravens beat the Chicago Bears 16-13 on Sunday.", "url": "https://www.foxnews.com/sports/freeman-td-lifts-ravens-over-bears-jackson-sidelined", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325715140655.jpg", "publishedAt": "2021-11-21T22:09:03Z", "content": "Subbing for star quarterback Lamar Jackson, Tyler Huntley led a winning drive capped by Devonta Freeman's 3-yard run with 22 seconds remaining, and the Baltimore Ravens beat the Chicago Bears 16-13 o… [+2972 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler O'Neil", "title": "SPLC ties Rittenhouse acquittal to 'systemic racism,' claims it will embolden 'far-right extremists'", "description": "The Southern Poverty Law Center claimed that a Kenosha, Wisconsin, jury's decision to acquit Kyle Rittenhouse of murder charges highlights America's “systemic racism” and will embolden “far-right extremists.” Critics say the SPLC's \"Learning for Justice\" prog…", "url": "https://www.foxnews.com/politics/splc-rittenhouse-acquittal-systemic-racism-claims-embolden-far-right-extremists", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/rittenhouse1.png", "publishedAt": "2021-11-21T22:06:28Z", "content": "The Southern Poverty Law Center claimed that a Wisconsin jury's decision to acquit Kyle Rittenhouse of murder charges highlights America's \"systemic racism\" and will embolden \"far-right extremists.\"\r… [+3382 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Dolphins win third straight, top Jets 24-17", "description": "Tua Tagovailoa threw a go-ahead 5-yard touchdown pass to Myles Gaskin early in the fourth quarter and the Miami Dolphins hung on to beat the New York Jets 24-17 on Sunday for their third straight victory.", "url": "https://www.foxnews.com/sports/dolphins-win-third-straight-top-jets-24-17", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325748519413.jpg", "publishedAt": "2021-11-21T22:02:52Z", "content": "Tua Tagovailoa threw a go-ahead 5-yard touchdown pass to Myles Gaskin early in the fourth quarter and the Miami Dolphins hung on to beat the New York Jets 24-17 on Sunday for their third straight vic… [+4208 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Cortney O'Brien", "title": "NBC's Maria Shriver sparks outrage after asking 'how it's possible' Rittenhouse walked out of court a free man", "description": "NBC anchor Maria Shriver tweeted that it was 'stunning' the jury let Rittenhouse walk", "url": "https://www.foxnews.com/media/maria-shriver-sparks-outrage-over-rittenhouse-trial-tweet", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/MariaShriver1.jpg", "publishedAt": "2021-11-21T22:02:00Z", "content": "NBC anchor Maria Shriver sparked online outrage for tweeting her controversial thoughts on Friday's verdict in the Kyle Rittenhouse trial.\r\nRittenhouse, who is now 18, was charged with first-degree r… [+4495 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Catherine Caban", "title": "Sandra Smith & Juan Williams Top 5 Dinner Party Guests", "description": "This week, Co-Anchor of American Reports on Fox News Channel, Sandra Smith, and Fox News Political Analyst Juan Williams, share their Top 5 Dinner Party Guests.", "url": "https://radio.foxnews.com/2021/11/21/sandra-smith-juan-williams-top-5-dinner-party-guests/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2020/04/COVER-foxtop5.jpg", "publishedAt": "2021-11-21T22:00:24Z", "content": "The FOX Top 5 podcast. From greatest Presidential quotes to favorite family traditions, to guilty pleasures… Join your favorite FOX News anchors, reporters, and personalities every week, as they pair… [+221 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew Miller", "title": "Cruz blasts MSNBC over segment tying Thanksgiving to 'white supremacy' and 'genocide'", "description": "Sen. Ted Cruz blasted MSNBC over the weekend after it aired an essay on the “real story” of Thanksgiving which claimed the national holiday was a day of “genocide and violence.”", "url": "https://www.foxnews.com/politics/cruz-blasts-msnbc-thanksgiving-white-supremacy-genocide", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Sen-Cruz-Cubans-are-the-only-immigrants-the-Biden-admin-doesnt-want.jpg", "publishedAt": "2021-11-21T21:55:17Z", "content": "Sen. Ted Cruz blasted MSNBC over the weekend after it aired an essay on the \"real story\" of Thanksgiving which claimed the national holiday was a day of \"genocide and violence.\"\r\n\".@msnbc corporate m… [+2304 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Heinicke, Washington spoil Newton's homecoming 27-21", "description": "Taylor Heinicke threw for 206 yards and three touchdowns against the league’s top-ranked pass defense, and Washington spoiled Cam Newton’s return to Bank of America Stadium with a 27-21 win over the Carolina Panthers on Sunday.", "url": "https://www.foxnews.com/sports/heinicke-washington-spoil-newtons-homecoming-27-21", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325674340390.jpg", "publishedAt": "2021-11-21T21:54:11Z", "content": "Taylor Heinicke threw for 206 yards and three touchdowns against the leagues top-ranked pass defense, and Washington spoiled Cam Newtons return to Bank of America Stadium with a 27-21 win over the Ca… [+3288 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Sabes", "title": "Haitian gang releases 2 Christian missionaries held hostage, 15 still being held", "description": "A Christian missionary group announced that two of the 17 missionaries of their group have been released after being held hostage by a Hatian gang.", "url": "https://www.foxnews.com/us/christian-missionary-group-announces-two-hostages-released-from-haiti", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/missionarieskidnappedHaiti.jpg", "publishedAt": "2021-11-21T21:52:11Z", "content": "A Christian missionary group announced that two of the 17 missionaries of their group have been released after being held hostage by a Haitian gang.\r\nChristian Aid Missionaries, which is based out of… [+2219 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Chasmar", "title": "Biden says house burned ‘with my wife in it,’ adding to long list of embellished stories", "description": "President Biden said in New Hampshire on Tuesday that his house burned down with his wife Jill Biden inside, adding to a long list of personal stories he’s embellished over the years.", "url": "https://www.foxnews.com/politics/biden-house-burned-wife-embellished-stories", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/biden_new_-1.jpg", "publishedAt": "2021-11-21T21:49:22Z", "content": "President Biden said last week that his house burned down with his wife Jill Biden inside before trying to correct himself, adding to a long list of personal stories hes embellished over the years.\r\n… [+3455 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "Kanye West, Drake team up for benefit concert to free Chicago gang leader Larry Hoover", "description": "After seemingly squashing their beef, Kanye West and Drake are teaming up for a benefit concert to get Chicago gang leader Larry Hoover out of prison.", "url": "https://www.foxnews.com/entertainment/kanye-west-drake-benefit-concert-chicago-larry-hoover", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/drake-kanye-west.jpg", "publishedAt": "2021-11-21T21:47:07Z", "content": "After seemingly squashing their beef, Kanye West and Drake are teaming up for a benefit concert to get Chicago gang leader Larry Hoover out of prison. \r\nWest announced on Instagram Saturday that he a… [+2075 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Jalen Hurts runs for 3 scores, Eagles beat Saints 40-29", "description": "Jalen Hurts ran for three touchdowns, Darius Slay returned an interception for a score and the Philadelphia Eagles beat the New Orleans Saints 40-29 on Sunday.", "url": "https://www.foxnews.com/sports/jalen-hurts-runs-for-3-scores-eagles-beat-saints-40-29", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AP21325691812428.jpg", "publishedAt": "2021-11-21T21:40:50Z", "content": "Jalen Hurts ran for three touchdowns, Darius Slay returned an interception for a score and the Philadelphia Eagles beat the New Orleans Saints 40-29 on Sunday.\r\nThe Eagles (5-6) have won two in a row… [+3163 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jon Brown", "title": "'The Mandalorian' star Pedro Pascal memorializes Rittenhouse attackers, says they were 'murdered'", "description": "Pedro Pascal, the lead actor in the Disney+ series \"The Mandalorian,\" tweeted in memory of Kyle Rittenhouse's attackers Saturday and claimed they were \"murdered.\"", "url": "https://www.foxnews.com/entertainment/mandalorian-star-pedro-pascal-memorializes-rittenhouse-attackers-says-they-were-murdered", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/GettyImages-1311949044.jpg", "publishedAt": "2021-11-21T21:37:39Z", "content": "Pedro Pascal, the lead actor in the Disney+\r\nStar Wars series \"The Mandalorian\r\n,\" tweeted in memory of Kyle Rittenhouse's attackers Saturday and claimed they were \"murdered.\"\r\n\"Joseph Rosenbaum, 36,… [+3807 chars]"}]}