{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Announcing the Sustainable Monetized Websites video series", "description": "The new series Sustainable Monetized Websites is now available on the Search Central and the Google AdSense YouTube channels.\n This series focuses on the best practices for people who create or manage content online and monetize it, acknowledging how\n challen…", "url": "https://developers.google.com/search/blog/2021/04/sustainable-monetized-websites", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-04-12T02:00:00Z", "content": "Monday, April 12, 2021\r\nThe new series Sustainable Monetized Websites\r\n is now available on the Search Central\r\n and the Google AdSense YouTube channels. This series focuses on the best practices\r\n f… [+1316 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "B2b Content Marketing: The Content Callout Podcast", "title": "B2B Content Marketing: The Content Callout Podcast - Jesus Corona Makes Bank with TikTok—You Can Too, Ep #35", "description": "In February 2019, Jesus Corona dropped out of college, unsure about the direction his life would take. So he went on YouTube looking for motivational content and ran into none other than GaryVee. At the time, there wasn’t a video where he wasn’t calling you d…", "url": "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5jYXN0ZWQudXMvNjcvQ29udGVudC1DYWxsb3V0LTkyOWJlYTJmL2ZlZWQ=/episode/YTQ1YmYzMTMtY2RmOC00ODgzLTk5NTAtNDU4ODY1ZDgwMDIw", "urlToImage": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSQXCAZqZ3EITWanMd-NVKppC-82gErIibfCU1qOOqBtus-hAM", "publishedAt": "2021-04-11T02:19:05Z", "content": "In February 2019, Jesus Corona dropped out of college, unsure about the direction his life would take. So he went on YouTube looking for motivational content and ran into none other than GaryVee. At … [+1031 chars]"}]}