{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Prevent portions of your site from being abused by spam", "description": "As a website owner, you might provide a few channels where your users can interact.\n Unfortunately, spammers often take advantage of these types of services to generate hundreds\n of spam pages that add little or no value to the web. Learn how to prevent spamm…", "url": "https://developers.google.com/search/blog/2021/05/prevent-portions-of-site-from-spam", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-05-26T12:00:00Z", "content": "Wednesday, May 26, 2021\r\nAs a website owner, you might provide a few channels where your users can interact, such as forums,\r\n guestbooks, social media platforms, file uploaders, free hosting service… [+7080 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "How we worked with you towards a safe and spam-free Search experience in 2020", "description": "Making sure your Search experience is safe and free of spam is important to us and we can’t\n achieve this mission without you! Here’s how we worked with you in 2020 towards safe and\n spam-free search results.", "url": "https://developers.google.com/search/blog/2021/05/working-with-you-for-safe-and-spam-free-search-2020", "urlToImage": "https://developers.google.com/search/blog/images/webspamreport2020/webspamCommunity2020-2.png", "publishedAt": "2021-05-26T05:00:00Z", "content": "Wednesday, May 26, 2021\r\nMaking sure your Google Search experience is safe and free of spam is always important to us. In 2020, we invested in many innovations to keep Google Search results clean and… [+4832 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Google News policies", "description": "We strive to make it easy for users to find news from publishers that consistently produce independent and original work, containing a significant source of fresh, original and purposeful content. Our content and behavior policies play an important role in en…", "url": "https://support.google.com/news/publisher-center/answer/6204050?hl=en", "urlToImage": null, "publishedAt": "2021-05-26T03:20:07Z", "content": "We strive to make it easy for users to find news from publishers that consistently produce independent and original work, containing a significant source of fresh, original and purposeful content. Ou… [+5632 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Sunsetting the generic rich results search appearance on Search Console", "description": "A few years ago we created a generic \"rich results\" search appearance group in Search Console that included multiple rich result types,\n including those that didn't have their own breakout row on Search Console. This is not required anymore, since we now have…", "url": "https://developers.google.com/search/blog/2021/05/rich-results-search-appearance-sunsetting", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-05-25T08:00:00Z", "content": "Tuesday, May 25, 2021\r\nOver the last few years, we have been hard at work adding more and more specific rich results search appearances to the Search Console Performance\r\n reports. Today we have 19 s… [+1245 chars]"}]}