{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Djokovic jumps into prime position for GOAT title", "description": "Get a daily dose of Paris Guardian news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\n\nPublish news of your business, community or sports group, personnel appointments, major event and more by …", "url": "http://feedproxy.google.com/~r/IndependentAustralia/~3/1DVY4Gh2hc4/djokovic-jumps-into-prime-position-for-goat-title,15195", "urlToImage": "https://cdn.bignewsnetwork.com/iau1623826335.jpg", "publishedAt": "2021-06-16T11:38:00Z", "content": "Arguably the \"greatest [tennis player] of all time\", Novak Djokovic's 2021 French Open win makes him the only man in the Open Era to conquer all four Grand Slam tournaments twice, writes Ronny Lerner… [+5057 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "How do I opt my access point out of Google Location services?", "description": "To improve Location services and estimate the location of a device, Google uses publicly broadcast Wi-Fi information from wireless access points and GPS, cell tower, and sensor data. This data is limi", "url": "https://support.google.com/maps/answer/1725632?hl=en", "urlToImage": null, "publishedAt": "2021-06-15T16:14:21Z", "content": "To improve Location services and estimate the location of a device, Google uses publicly broadcast Wi-Fi information from wireless access points and GPS, cell tower, and sensor data. This data is lim… [+2230 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Learn how to improve your content with Search Console Insights", "description": "To help you better understand which content of yours resonates with your audiences, we are introducing a new experience called Search Console Insights.\n This experience joins data from both Search Console and Google Analytics with a goal of making it easy to …", "url": "https://developers.google.com/search/blog/2021/06/search-console-insights", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-06-15T04:00:00Z", "content": "Tuesday, June 15, 2021\r\nProducing great content is an effective way to build a loyal and engaged audience that can help you achieve your goals, such as helping to grow\r\n your business and brand, rais… [+2671 chars]"}]}