{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Meteoric rise in Warren Buffett's Berkshire Hathaway share price requires Nasdaq to soon upgrade system - Moneycontrol", "description": "Berkshire Hathaway share price is almost close to the highest level which Nasdaq can handle on its computer screen. Till now, the biggest possible number that Nasdaq can handle is $4,294,967,295.", "url": "https://www.moneycontrol.com/news/business/meteoric-rise-in-warren-buffetts-berkshire-hathaway-share-price-requires-nasdaq-to-soon-upgrade-system-6867931.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/05/Warren-Buffett-770x435.jpg", "publishedAt": "2021-05-07T17:14:53Z", "content": "The stellar rally in share price of Berkshire Hathaway, the American conglomerate led by business tycoon Warren Buffett, requires Nasdaq to soon upgrade its computer system. The share prices on May 7… [+1059 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "WHO lists additional COVID-19 vaccine for emergency use and issues interim policy recommendations - World Health Organization", "description": "<p>WHO today listed the Sinopharm COVID-19 vaccine for emergency use, giving the green light for this vaccine to be rolled out globally. The Sinopharm vaccine is produced by Beijing Bio-Institute of Biological Products Co Ltd, subsidiary of China National\r\n  …", "url": "https://www.who.int/news/item/07-05-2021-who-lists-additional-covid-19-vaccine-for-emergency-use-and-issues-interim-policy-recommendations", "urlToImage": null, "publishedAt": "2021-05-07T16:12:46Z", "content": "WHO today listed the Sinopharm COVID-19 vaccine for emergency use, giving the green light for this vaccine to be rolled out globally. The Sinopharm vaccine is produced by Beijing Bio-Institute of Bio… [+5902 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pfizer, BioNTech Seeks Full US Approval For Covid Vaccine - NDTV", "description": "Pfizer and BioNTech said Friday they were launching an application requesting full US regulatory approval for their game-changing Covid-19 vaccine for individuals 16 years and older.", "url": "https://www.ndtv.com/world-news/pfizer-biontech-seeks-full-us-approval-for-covid-19-vaccine-2437330", "urlToImage": "https://c.ndtvimg.com/2021-02/1599ak3o_pfizer-and-biontech-_625x300_22_February_21.jpg", "publishedAt": "2021-05-07T15:00:32Z", "content": "The companies are now seeking a \"Biologics License Application\" for permanent regulatory approval (File)\r\nNew York: Pfizer and BioNTech said Friday they were launching an application requesting full … [+1544 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Renault Duster 7-seater spotted during TVC shoot - CarToq.com", "description": "The Duster was the most successful product for Renault. However, now the popularity of the Duster has diminished because of other mid-size SUVs that have been launched in our country. Another reason why the sales of the Duster diminished is that Renault never…", "url": "https://www.cartoq.com/renault-duster-7-seater-spotted-during-tvc-shoot/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Renault-2021-Duster-spied-featured-1019x530.jpg", "publishedAt": "2021-05-07T13:52:58Z", "content": "The Duster was the most successful product for Renault. However, now the popularity of the Duster has diminished because of other mid-size SUVs that have been launched in our country. Another reason … [+2922 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "India to receive between 190-250 mn fully subsidised Covid vaccines; $30 mn fin assistance: Gavi - Hindustan Times", "description": "Gavi is a public-private global health partnership that is leading the global effort to provide vaccines to low- and middle-income countries.", "url": "https://www.hindustantimes.com/india-news/india-to-receive-between-190-250-million-fully-subsidised-covid-vaccines-gavi-101620394755668.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/07/1600x900/e70a94201dce49fa8a50fc2147bd65e0-e70a94201dce49fa8a50fc2147bd65e0-1_1620395105604_1620395127556.jpg", "publishedAt": "2021-05-07T13:48:56Z", "content": "Gavi, a global alliance on vaccines, on Friday said that India would receive between 190 and 250 million fully subsidised doses of Covid-19 vaccine and funds up to USD 30 million for urgent technical… [+2352 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "National Payments Corporation of India Says It Will Not Ban Cryptocurrencies Through UPI – Regulation Bitcoin News - Bitcoin News", "description": "India's payments authority, the National Payments Corporation of India, has reportedly said that it will not ban cryptocurrency transactions. Banks are to make their own decision whether to allow crypto transactions.", "url": "https://news.bitcoin.com/national-payments-corporation-of-india-not-ban-cryptocurrencies-upi/", "urlToImage": "https://news.bitcoin.com/wp-content/uploads/2021/05/ncpi.jpg", "publishedAt": "2021-05-07T13:42:03Z", "content": "India’s payments authority, the National Payments Corporation of India, has reportedly said that it will not ban cryptocurrency transactions. Banks are to make their own decision whether to allow cry… [+2554 chars]"}, {"source": {"id": null, "name": "newsBTC"}, "author": null, "title": "New U.S Regulatory Agency Possibly In The Works To Oversee Crypto Exchanges Directly - NewsBTC", "description": "The U.S. Securities and Exchange Commission (SEC) Chair, Gary Gensler, said Congress needs new regulatory frameworks for crypto exchanges. At present, no", "url": "https://www.newsbtc.com/news/new-u-s-regulatory-agency-possibly-in-the-works-to-oversee-crypto-exchanges-directly/", "urlToImage": "https://www.newsbtc.com/wp-content/uploads/2021/05/markus-winkler-wpOa2i3MUrY-unsplash-860x573.jpg", "publishedAt": "2021-05-07T13:02:29Z", "content": "The U.S. Securities and Exchange Commission (SEC) Chair, Gary Gensler, said Congress needs new regulatory frameworks for crypto exchanges. At present, no single agency is directly responsible for the… [+3099 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "WhatsApp Scraps May 15 Deadline For Accepting New, Controversial Privacy Policy: Report - NDTV", "description": "WhatsApp has scrapped its May 15 deadline for users to accept its controversial privacy policy update and said not accepting the terms will not lead to deletion of accounts.", "url": "https://www.ndtv.com/india-news/whatsapp-scraps-may-15-deadline-for-accepting-new-controversial-privacy-policy-report-2437246", "urlToImage": "https://c.ndtvimg.com/2021-01/o99fmm5s_whatsapp-generic-afp_625x300_19_January_21.jpg", "publishedAt": "2021-05-07T12:59:35Z", "content": "WhatsApp faced severe backlash over user concerns that data was being shared with parent company Facebook\r\nNew Delhi: WhatsApp has scrapped its May 15 deadline for users to accept its controversial p… [+3610 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Missed the metals rally? 2 steel stocks that may continue to shine - Economic Times", "description": "I think all steel stocks will continue to go up in the next few months,  says market expert Rahul Shah.", "url": "https://economictimes.indiatimes.com/markets/expert-view/missed-the-metals-rally-2-steel-stocks-that-may-continue-to-shine/articleshow/82456341.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82457135,width-1070,height-580,imgsize-152520,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-07T12:35:00Z", "content": "Rahul Shah of Motilal Oswal Financial Services says some steam is still left in steel stocks. SAIL and JSW Steel are his two preferred bets. Edited excerpts from an interview:What is your take on HDF… [+1887 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Sebi notifies relaxed rules for listing start-ups - Moneycontrol", "description": "Currently, the issuer company is not permitted to make discretionary allotment. In line with the provisions of main board IPO, issuer companies which have issued superior voting rights (SR) equity shares to promoters and founders will be allowed to do listing…", "url": "https://www.moneycontrol.com/news/business/sebi-notifies-relaxed-rules-for-listing-start-ups-6867141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/SEBI-770x433.jpg", "publishedAt": "2021-05-07T12:30:59Z", "content": "With an aim to boost listing of start-ups, markets regulator Sebi has notified a slew of relaxations to norms, including reducing holding period for pre-issue capital and allowing discretionary allot… [+4141 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Advises Under-40s Get Alternative To AstraZeneca Covid Vaccine - NDTV", "description": "The scientific committee overseeing Britain's coronavirus vaccination programme on Friday recommended that under-40s are offered an alternative to the Oxford-AstraZeneca Covid jab.", "url": "https://www.ndtv.com/world-news/uk-advises-under-40s-get-alternative-to-astrazeneca-covid-19-vaccine-2437211", "urlToImage": "https://c.ndtvimg.com/2021-04/las1uf2_astrazeneca_625x300_26_April_21.jpg", "publishedAt": "2021-05-07T12:28:21Z", "content": "UK recommended that under-40s are offered an alternative to AstraZeneca vaccine. (File)\r\nLondon: The scientific committee overseeing Britain's coronavirus vaccination programme on Friday recommended … [+2681 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Unnati Sharma", "title": "Struggling to find an open Covid vaccination slot on CoWin? Get help from these websites, apps - ThePrint", "description": "As people struggle to find slots at Covid vaccination centres, many software developers and tech companies are providing real-time updates to help people book appointments.", "url": "https://theprint.in/health/struggling-to-find-an-open-covid-vaccination-slot-on-cowin-get-help-from-these-websites-apps/654013/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/05/Vaccination.jpg", "publishedAt": "2021-05-07T12:06:12Z", "content": "New Delhi: Chennai-based Berty Thomas, who works with an investment bank, tried booking a slot when the Covid-19 vaccine drive opened up for all adults across the country from 1 May. But he was unabl… [+4467 chars]"}, {"source": {"id": null, "name": "Www.crn.in"}, "author": null, "title": "Savex Technologies makes a strategic investment in Inflow Technologies, forging the largest strategic investment in the IT distribution sector in India - CRN - India - CRN.in", "description": "Read Article Mumbai-based Savex Technologies, the 3rd largest IT distributor in the country with a revenue of USD 2.5 billion has entered into definitive agreements to make a strategic investment in Bangalore based Inflow Technologies, a leading value-added d…", "url": "https://www.crn.in/news/savex-technologies-makes-a-strategic-investment-in-inflow-technologies-forging-the-largest-strategic-investment-in-the-it-distribution-sector-in-india/", "urlToImage": "https://cdn.crn.in/wp-content/uploads/2021/05/07173051/CRN_Byju_J_696-1.jpg", "publishedAt": "2021-05-07T12:00:09Z", "content": "Mumbai-based Savex Technologies, the 3rd largest IT distributor in the country with a revenue of USD 2.5 billion has entered into definitive agreements to make a strategic investment in Bangalore bas… [+3729 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Ashwin Ramarathinam", "title": "BSE-listed companies' market capitalization hits record high at ₹211 trillion - Mint", "description": "In the last three days, the market capitalization of BSE-listed firms jumped by Rs4.39 trillion", "url": "https://www.livemint.com/market/stock-market-news/bselisted-companies-market-capitalization-hits-record-high-at-rs211-trillion-11620387717401.html", "urlToImage": "https://images.livemint.com/img/2021/05/07/600x338/2021-03-03T040609Z_1_LYNXNPEH2204F_RTROPTP_3_MARKETS-INDIA-STOCKS_1616596552575_1620388447428.JPG", "publishedAt": "2021-05-07T11:57:07Z", "content": "MUMBAI :\r\nMarket capitalization of Bombay Stock Exchange (BSE)-listed companies touched a new high of Rs211 trillion on Friday, tracking gains in the equity market.In the last three days, the market … [+2558 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Vaccination Only Way Forward as Covid Infections Surge in Rural Areas: Report - News18", "description": "According to a report by SBI Research, accelerated vaccination is the only solution to contain the raging pandemic.", "url": "https://www.news18.com/news/india/vaccination-only-way-forward-as-covid-infections-surge-in-rural-areas-report-3715883.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620018550_vaccination1.jpg", "publishedAt": "2021-05-07T11:03:42Z", "content": "As COVID-19 infections surge across the country with nearly half of the fresh cases now being in rural areas, accelerated vaccination is the only solution to contain the raging pandemic, according to… [+3406 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Air India to operate flights connecting London to Mumbai, Delhi, Bengaluru from May 16 - Moneycontrol.com", "description": "Though Air India flights connecting Mumbai to London Heathrow will operate from May 16 to May 30, flights on this route will not be available on May 17, 19, 24, and 26. Similarly, Air India flights from London Heathrow to Mumbai will operate from May 17 to Ma…", "url": "https://www.moneycontrol.com/news/coronavirus/air-india-to-operate-flights-connecting-london-to-mumbai-delhi-bengaluru-from-may-16-6866401.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/09/Air-India-Airbus-A320-200-aircraf-770x433.jpg", "publishedAt": "2021-05-07T10:51:05Z", "content": "Air India on May 7 announced that it will operate flights between London Heathrow airport to Mumbai, Delhi, and Bengaluru from May 16 to May end.\r\nThe national airliner has issued a list of days on w… [+3360 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Top 25 Selling Cars In April 2021 - Wagon R, Swift, Creta, i10, Nexon, Amaze - GaadiWaadi.com", "description": "Maruti Suzuki had the Wagon R at the top of the sales charts with 18,656 units ahead of Swift, Alto, Baleno, Dzire and others", "url": "https://gaadiwaadi.com/top-25-selling-cars-in-april-2021-wagon-r-swift-creta-i10-nexon-amaze/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/02/2021-Swift-Facelift-1.jpg", "publishedAt": "2021-05-07T10:34:08Z", "content": "The Maruti Suzuki Wagon R topped the overall passenger vehicle sales charts in the month of April 2021 as 18,656 units were sold. The Swift finished in the second position with 18,316 units as Maruti… [+3307 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Bank alert! SBI, PNB and ICICI have special warning for customers, check here - Zee News", "description": "India is currently faced with the second wave of Covid-19 pandemic, which is far more ruthless than the first one.", "url": "https://zeenews.india.com/personal-finance/bank-alert-sbi-pnb-and-icici-have-special-warning-for-customers-check-here-2360385.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/05/07/934827-untitled-design-30.png", "publishedAt": "2021-05-07T10:30:25Z", "content": "New Delhi: India is currently faced with the second wave of Covid-19 pandemic, which is far more ruthless than the first one. While Indians are already facing issues related to mental, physical or fi… [+1549 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Stick to market leaders, recovery won't help second-rung stocks: Saurabh Mukherjea - Economic Times", "description": "Barring pharma and FMCG, all other types of consumption will see a pretty significant hit, says star fund manager Saurabh Mukherjea.", "url": "https://economictimes.indiatimes.com/markets/expert-view/stick-to-market-leaders-recovery-wont-help-second-rung-stocks-saurabh-mukherjea/articleshow/82452735.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82455811,width-1070,height-580,imgsize-36955,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-07T09:42:00Z", "content": "Saurabh Mukherjea, Founder, Marcellus Investment Managers, says that investing in market leading franchises remains a very durable proposition in the second wave of Covid. Edited excerpts from an int… [+6180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ralph Alex Arakal", "title": "DRDO develops artificial intelligence algorithm to detect Covid-19 presence from chest X-rays - The Indian Express", "description": "\"It can be a very useful tool especially in smaller towns in our country owing to lack of easy access to CT scans.\"", "url": "https://indianexpress.com/article/india/drdo-develops-artificial-intelligence-algorithm-to-detect-covid-19-presence-from-chest-x-rays-7305758/", "urlToImage": "https://images.indianexpress.com/2021/05/delhi-hospital.jpg", "publishedAt": "2021-05-07T09:14:57Z", "content": "In a development expected to help diagnose Covid-19 in suspected patients faster, the Defence Research and Development Organisation (DRDO) and Centre for Artificial Intelligence and Robotics (CAIR) h… [+2333 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Nikita Vashisht", "title": "HDFC Q4 PAT up 42% YoY at Rs 3,180 cr; Board re-appoints Keki Mistry as MD - Business Standard", "description": "HDFC has recommended a final dividend of Rs 23 per equity share", "url": "https://www.business-standard.com/article/companies/hdfc-q4-pat-up-42-yoy-at-rs-3-180-cr-board-re-appoints-keki-mistry-as-md-121050700615_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-05/19/full/1589831292-617.jpg", "publishedAt": "2021-05-07T08:35:00Z", "content": "India’s leading housing financier HDFC on Friday reported a 42.43 per cent year-on-year growth in standalone net profit at Rs 3,179.83 for January-March quarter of FY21 (Q4FY21). This compares with p… [+3757 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "JSW Steel shares gain over 3% on JV with JFE Steel - Moneycontrol.com", "description": "This feasibility study for a JV with JFE Steel will strengthen company's position as India's leading manufacturer of advanced steel products that lead to reduced CO2 emissions and a more sustainable world, said Seshagiri Rao of JSW Steel.", "url": "https://www.moneycontrol.com/news/business/markets/jsw-steel-shares-gain-over-3-on-jv-with-jfe-steel-6865911.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/10/steel-770x433.jpg", "publishedAt": "2021-05-07T08:34:01Z", "content": "JSW Steel share price gained 3.4 percent intraday on May 7 after entering into a joint venture with JFE Steel for manufacturing grain-oriented electrical steel sheet.\r\nThe stock was trading at Rs 749… [+1292 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Special Correspondent", "title": "COVID-19 surge | Finance Ministry pushes for speedier vaccination - The Hindu", "description": "Ministry concedes Q1 growth to be hit, but not in favour of national lockdown", "url": "https://www.thehindu.com/news/national/covid-19-surge-finance-ministry-pushes-for-speedier-vaccination/article34505097.ece", "urlToImage": "https://www.thehindu.com/news/national/epp8v2/article34505096.ece/ALTERNATES/LANDSCAPE_615/vaccine", "publishedAt": "2021-05-07T08:01:48Z", "content": "The second COVID-19 wave which is spreading fast beyond the worst-affected districts in the country, could dent economic activity till June this year, and expanding vaccination pace in the country is… [+3444 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Fuel prices at record high after 4th straight hike; petrol crosses Rs 100/litre - India Today", "description": "Fuel prices have now been hiked for four days in a row, erasing all reductions that came between March 24 and April 15. Petrol and diesel rates have been hiked sharply by 28 paise and 31 paise, respectively. Check the latest rates in your city.", "url": "https://www.indiatoday.in/business/story/fuel-prices-at-record-high-after-4th-straight-hike-petrol-crosses-rs-100-litre-1799859-2021-05-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/Screenshot_2021-05-07_at_1.11.-647x363.png?r6Jc8G1OpE4RIXNoe.Buj_JaUELoGyw0", "publishedAt": "2021-05-07T07:47:07Z", "content": "Petrol and diesel rates have touched fresh record highs across the country after state-run oil marketing companies (OMCs) hiked prices on Friday. Fuel prices have now been hiked for four days in a ro… [+1832 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Near-Production Husqvarna Vektorr Concept Unveiled; Likely Based On Chetak - GaadiWaadi.com", "description": "Husqvarna Vektorr will more likely enter production next year and is expected to be manufactured in India for the European market", "url": "https://gaadiwaadi.com/near-production-husqvarna-vektorr-concept-unveiled-likely-based-on-chetak/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/Husqvarna-Vektorr-Concept-4.jpg", "publishedAt": "2021-05-07T07:20:01Z", "content": "Husqvarna Motorcycles unveiled the promising E-Pilen concept just over a week ago and has backed it up with yet another electric vehicle concept. Christened the Vektorr, it has a claimed riding range… [+1849 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Tata Motors’ ex-head designer Pratap Bose to lead Mahindra’s design from UK facility - CarToq.com", "description": "As we know that Pratap Bose left Tata Motors as Vice President of Global Design and was heading somewhere else. Well, as per the latest rumours, Pratap Bose will be joining Mahindra soon. He will be the new head of design and he will be leading the Mahindra A…", "url": "https://www.cartoq.com/pratap-bose-mahindra-design/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/pratap-bose-mahindra-design-head-featured-1019x530.jpg", "publishedAt": "2021-05-07T07:14:04Z", "content": "As we know that Pratap Bose left Tata Motors as Vice President of Global Design and was heading somewhere else. Well, as per the latest rumours, Pratap Bose will be joining Mahindra soon. He will be … [+3151 chars]"}, {"source": {"id": null, "name": "Gulte"}, "author": "Satya", "title": "Pay Rs 1.5 crore For A Few Mins Space Travel - Gulte", "description": "Soon private commercial space travel is going to be a reality and some big names are coming forward to bid for it. Amazon founder and CEO Jeff Bezos whose space company, Blue Origin has been making news for quite some time now, is targeting the bidding proces…", "url": "https://www.gulte.com/trends/85645/pay-rs-1-5-crore-for-a-few-mins-space-travel", "urlToImage": "https://cdn.gulte.com/wp-content/uploads/2021/05/Blue-660x330.jpg", "publishedAt": "2021-05-07T07:13:31Z", "content": "Soon private commercial space travel is going to be a reality and some big names are coming forward to bid for it. Amazon founder and CEO Jeff Bezos whose space company, Blue Origin has been making n… [+1600 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Neil Nair", "title": "Honda H’ness CB350 prices revised; costs more than Royal Enfield Meteor 350 - BikeWale", "description": "Honda has hiked the prices of both CB350 variants by Rs 3,405", "url": "https://www.bikewale.com/news/honda-hness-cb350-prices-revised-costs-more-than-royal-enfield-meteor-350/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/58341/right-side-view0.jpeg?q=85&art=2", "publishedAt": "2021-05-07T07:02:09Z", "content": "- Honda Hness CB350 now priced from Rs 1.89 lakh\r\n- Both variants receive a price hike\r\n- Costs nearly Rs 5,500 more than Meteor 350.\r\nHonda has finally revealed the new price list for the Hness CB35… [+833 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "India holds up wireless approvals for China-made devices, delaying launches - Moneycontrol", "description": "Imports from China of finished electronic devices - like bluetooth speakers, wireless earphones, smartphones, smartwatches and laptops - containing wifi modules are being delayed, the sources said.", "url": "https://www.moneycontrol.com/news/india/india-holds-up-wireless-approvals-for-china-made-devices-delaying-launches-6865341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/antenna-5506557_1280-770x433.jpg", "publishedAt": "2021-05-07T06:27:01Z", "content": "India has held up approvals for import of wifi modules from China for months, driving companies such as U.S. computer makers Dell and HP and China's Xiaomi, Oppo, Vivo and Lenovo to delay product lau… [+3236 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Vaibhav Global trades ex-split; stock zooms 19%, scales new high - Business Standard", "description": "The company has split the stock in the ratio of 1:5, i.e. equity share of face value Rs 10 has been split into five shares of face value Rs 2", "url": "https://www.business-standard.com/article/markets/vaibhav-global-trades-ex-split-stock-zooms-19-hit-new-high-121050700375_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2015-06/24/full/1435146306-7471.jpg", "publishedAt": "2021-05-07T06:04:00Z", "content": "Shares of Vaibhav Global hit an all-time high in Friday's trade after they rallied 19 per cent to Rs 1,037.90 on the BSE as investors lapped up the stock after it turned ex-split. The company has spl… [+3386 chars]"}, {"source": {"id": null, "name": "Ericsson"}, "author": null, "title": "Ericsson and Samsung sign global patent license agreement - Ericsson", "description": "· Agreement includes global patent cross license of cellular technologies, including 5G\r\n  · Settlement ends all ongoing patent related legal disputes between the parties\r\n  · In the second quarter 2021, IPR licensing revenues are expected to be SEK 2.0 b. to…", "url": "https://www.ericsson.com/en/press-releases/2021/5/ericsson-and-samsung-sign-global-patent-license-agreement", "urlToImage": "https://www.ericsson.com/49647e/assets/global/qbank/2019/03/29/mp_ericsson_hq_signage_28-87382crop076252692964resize1500844autoorientquality90stripbackground23ffffffextensionjpgid8.jpg", "publishedAt": "2021-05-07T06:00:00Z", "content": "Ericsson (NASDAQ: ERIC) and Samsung have reached a multi-year agreement on global patent licenses between the two companies, including patents relating to all cellular technologies. The cross-license… [+6605 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Safari to Altroz, Tata Motors to hike prices of cars from May 8 - HT Auto", "description": "Tata Motors has assured that the price of cars booked till today will not be affected by this hike.", "url": "https://auto.hindustantimes.com/auto/news/safari-to-altroz-tata-motors-to-hike-prices-of-cars-from-may-8-41620364770199.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/07/600x338/PTI02_22_2021_000028B_1620364944051_1620364964064.jpg", "publishedAt": "2021-05-07T05:33:15Z", "content": "Tata Motors has decided to increase prices of its passenger vehicles across its fleet starting on May 8. The Indian vehicle manufacturer said that price of Tata cars will go up by an average of 1.8% … [+1946 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "Web Report", "title": "Covid: Only vaccinated employees allowed to attend workplaces, says Saudi - Khaleej Times", "description": "Saudi Arabia on Friday announced that only vaccinated workers would be allowed to attend their workplaces.\r\nAccording to state TV Al Ekhbar...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/covid-only-vaccinated-employees-allowed-to-attend-workplaces-says-saudi", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20210507/ARTICLE/210509317/AR/0/AR-210509317.jpg&NCS_modified=20210507071830&exif=.jpg", "publishedAt": "2021-05-07T05:22:42Z", "content": "Saudi Arabia on Friday announced that only vaccinated workers would be allowed to attend their workplaces.\r\nAccording to state TV Al Ekhbariya, the Saudi Ministry of Human Resources and Development s… [+352 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Sanchita Dash", "title": "Here’s why Zomato is reportedly cutting a $300 million cheque for Grofers - Business Insider India", "description": "Zomato is reportedly in talks to invest $300 million in grocery delivery startup Grofers, a company it was once planning to acquire. Zomato had recently announced", "url": "https://www.businessinsider.in/business/startups/news/heres-why-zomato-is-reportedly-cutting-a-300-million-cheque-for-grofers/articleshow/82450062.cms", "urlToImage": "https://www.businessinsider.in/photo/82450062/heres-why-zomato-is-reportedly-cutting-a-300-million-cheque-for-grofers.jpg?imgsize=75424", "publishedAt": "2021-05-07T04:38:00Z", "content": "IPO-bound foodtech unicorn Zomato had a short-lived stint in grocery retail in 2020, but it looks like the Deepinder Goyal-led startup still has one eye on the sector. According to an \r\nET report, Zo… [+3098 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Isuzu To Launch 3 BS6 Vehicles On 10th May - Hi-Lander To MU-X - GaadiWaadi.com", "description": "2021 Isuzu D-Max V-Cross will be offered in two variants and it will be powered by a 1.9-litre diesel engine producing 161 bhp and 360 Nm", "url": "https://gaadiwaadi.com/isuzu-to-launch-3-bs6-vehicles-on-10th-may-hi-lander-to-mu-x/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/2021-Isuzu-V-Cross-Hi-Lander-MU-X.jpg", "publishedAt": "2021-05-07T04:36:58Z", "content": "Isuzu’s India division is gearing up for a trio of launches on May 10, 2021 at 12:00 noon for the domestic market as the updated versions of the D-Max V-Cross and MU-X along with new V-Cross Hi-Lande… [+2331 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Tata Consumer shares fall 5% on missing expectations in Q4; global brokerage remains underweight - Moneycontrol.com", "description": "The exceptional loss for the current quarter (at Rs 63.93 crore) mainly represent costs relating to the business restructure and reorganisation of Rs 18 crore and loss on disposal of an overseas subsidiary/joint venture of Rs 46 crore, the company said.", "url": "https://www.moneycontrol.com/news/business/stocks/tata-consumer-shares-fall-5-on-missing-expectations-in-q4-global-brokerage-remains-underweight-6864821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/TATA-CONSUMER-PRODUCTS-770x433.jpg", "publishedAt": "2021-05-07T04:18:05Z", "content": "Tata Consumer Products share price was down over 4 percent in the morning session on May 7, a day after the company declared its Q4 results.\r\nDespite the company reporting profit of Rs 53.9 crore for… [+2427 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Three Indian-American CEOs join task force to help India fight COVID-19 - The Hindu", "description": "Sunder Pichai from Google, Punit Renjen from Deloitte and Shantanu Narayen from Adobe have joined the steering committee of the Global Task Force on Pandemic Response.", "url": "https://www.thehindu.com/news/international/three-indian-american-ceos-join-task-force-to-help-india-fight-covid-19/article34504107.ece", "urlToImage": "https://www.thehindu.com/news/international/jvin3g/article31746256.ece/ALTERNATES/LANDSCAPE_615/SUNDERPICHAI", "publishedAt": "2021-05-07T04:03:34Z", "content": "Three Indian-American CEOs Sunder Pichai from Google, Punit Renjen from Deloitte and Shantanu Narayen from Adobe have joined the steering committee of the Global Task Force on Pandemic Response, whic… [+3209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "COVID-19: Understanding the difference between oxygen concentrator and oxygen cylinder - The Indian Express", "description": "While a continuous flow oxygen concentrator provides the same flow of oxygen in a minute until it’s been turned off, pulse dose identifies the patient's breathing pattern and gives out oxygen when it detects inhalation, explained Dr Tushar Tayal, department o…", "url": "https://indianexpress.com/article/lifestyle/health/covid-19-understanding-the-difference-between-an-oxygen-concentrator-and-oxygen-cylinder-7304017/", "urlToImage": "https://images.indianexpress.com/2014/03/Indiaoxygencrisis.jpg", "publishedAt": "2021-05-07T03:40:05Z", "content": "It has been a year since the COVID-19 outbreak happened, but at this point, the country is experiencing the worst phase which accounts for the second wave. With over four lakh cases being reported da… [+2657 chars]"}, {"source": {"id": null, "name": "PhoneArena"}, "author": "Alan Friedman", "title": "World's first 2nm chip is produced by IBM - PhoneArena", "description": "IBM today announced the world's first 2nm chip produced using a nanoslate Gate-All-Around architecture. IBM says that it is still a few years away from being mass produced.", "url": "https://www.phonearena.com/news/first-2nm-chip-announced-by-ibm_id131953", "urlToImage": "https://m-cdn.phonearena.com/images/article/131953-wide-two_1200/Worlds-first-2nm-chip-is-produced-by-IBM.jpg", "publishedAt": "2021-05-07T03:13:38Z", "content": null}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Sameer Bhardwaj", "title": "India’s Fuel Prices Seen Rising Despite Falling Demand - BloombergQuint", "description": "State-run oil firms, after a pause of 65  have started increasing prices of petrol and diesel to recover losses.", "url": "https://www.bloombergquint.com/business/indias-fuel-prices-seen-rising-despite-falling-demand", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-06%2Fa9077994-f18f-4f25-bd1c-b49a990a2f2f%2F228205588.jpg?rect=0%2C0%2C3000%2C1575&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-07T02:54:22Z", "content": "Because of the state polls and small dips in crude prices in March and April, oil firms marginally cut petrol and diesel rates four times. Yet, so far this year, the Indian basket of crude has jumped… [+2586 chars]"}, {"source": {"id": null, "name": "Indiainfoline"}, "author": "India Infoline News Service", "title": "Top stocks in focus: Hero MotoCorp, Tata Consumer, Adani Group, HDFC, Ultratech Cement - Indiainfoline", "description": "Check out the stocks that will be in focus during trade today based on recent and latest news developments.", "url": "https://www.indiainfoline.com/article/news-top-story/top-stocks-in-focus-hero-motocorp-tata-consumer-adani-group-hdfc-ultratech-cement-121050700163_1.html", "urlToImage": "https://content.indiainfoline.com/_media/iifl/img/misc/2019-08/22/full/stocks-in-focus-1566451994-79251350.jpg", "publishedAt": "2021-05-07T01:35:00Z", "content": "Hero MotoCorp Q4FY21: The Company's Revenue from Operations for the quarter stood at Rs8,686cr vs Rs6238cr in Q4FY20 and Profit after Tax (PAT) at Rs865cr vs Rs621cr in Q4FY20.Tata Consumer Products … [+2159 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Volkswagen Tiguan Allspace Facelift Teased Ahead Of Debut On May 12 - GaadiWaadi.com", "description": "Volkswagen Tiguan Allspace facelift gets a host of exterior changes and the cabin will also receive a number of changes this time around", "url": "https://gaadiwaadi.com/volkswagen-tiguan-allspace-facelift-teased-ahead-of-debut-on-may-12/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/Volkswagen-Tiguan-Allspace-Facelift-Teased-2.jpg", "publishedAt": "2021-05-07T01:00:37Z", "content": "The 2021 Volkswagen Tiguan facelift will be launched in India in the coming months, based on the mid-cycle update introduced late last year in the international markets. Besides the debut of the prod… [+1920 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Shivani Shinde", "title": "At 21%, Cognizant sees highest IT attrition in January-March quarter - Business Standard", "description": "In the previous quarter, the company's attrition rate was lower at 19 per cent, though the level was 22 per cent in the January-March 2020", "url": "https://www.business-standard.com/article/companies/at-21-cognizant-sees-highest-it-attrition-in-january-march-quarter-121050700037_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-08/04/full/1501786901-4032.jpg", "publishedAt": "2021-05-07T00:40:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Amazon postpones Prime Day sale in India due to Covid-19 - Mint", "description": "India, which is suffering severe shortages of medical equipment, on Thursday reported 412,262 new virus cases and 3,980 deaths, both daily records", "url": "https://www.livemint.com/companies/news/amazon-postpones-prime-day-sale-in-india-due-to-covid19-11620346244145.html", "urlToImage": "https://images.livemint.com/img/2021/05/07/600x338/43e88680-ace2-11eb-a936-0e5204611abd_1620154909376_1620346400403.jpg", "publishedAt": "2021-05-07T00:15:26Z", "content": "Amazon.com Inc. is pausing plans for its annual sale Prime Day in Canada and India due to concerns about Covid-19, the company confirmed on Thursday. The pause wont affect Prime Day in the U.S., whic… [+1402 chars]"}, {"source": {"id": null, "name": "FX Empire"}, "author": null, "title": "Gold Price Futures (GC) Technical Analysis – $1858.90 Comes into Play as Long as $1788.50 Holds as Support - FX Empire", "description": "The market is now trading on the strong side of the long-term 50% level at $1788.50, making this level major support.", "url": "https://www.fxempire.com/forecasts/article/gold-price-futures-gc-technical-analysis-1858-90-comes-into-play-as-long-as-1788-50-holds-as-support-727540", "urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2021/05/Federal-Reserve-Gold.jpeg", "publishedAt": "2021-05-06T20:48:06Z", "content": "Gold bulls appear to be showing no fear in adding to already established long positions ahead of Fridays jobs report that is expected to show the U.S. economy added 990K jobs in April, while the unem… [+678 chars]"}, {"source": {"id": null, "name": "DailyFX"}, "author": "Rich Dvorak", "title": "Gold Price Tops $1,800 with Conviction – More Gains Ahead? - DailyFX", "description": "Gold price action has been ripping higher over recent trading sessions alongside silver. The precious metals are up 2.6% and 5.9% respectively this month, but could more gains be in store?", "url": "https://www.dailyfx.com/forex/market_alert/2021/05/06/gold-price-tops-1800-with-conviction-more-gains-ahead.html", "urlToImage": "https://a.c-dn.net/b/2kU400/headline_GOLD_16.jpg", "publishedAt": "2021-05-06T19:50:00Z", "content": "GOLD PRICE FORECAST: XAU/USD BREAKS ABOVE $1,800 AS BULLS DRIVE THE BID\r\n<ul><li>Gold price action explodes 1.7% higher as bulls make a strong push above $1,800/oz</li><li>Silver prices are also gain… [+1879 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "Chris Katje", "title": "5 Things You Might Not About Melinda Gates Benzinga - Benzinga", "description": "Melinda Gates is well-known as the husband of Microsoft Corporation (NASDAQ: MSFT) co-founder Bill Gates. The couple announced this week they will be ...", "url": "https://www.benzinga.com/news/21/05/20968876/5-things-you-might-not-about-melinda-gates", "urlToImage": "https://cdn.benzinga.com/files/imagecache/og_image_social_share_1200x630/images/story/2012/15222588424_b699a78e2a_o.jpg", "publishedAt": "2021-05-06T18:25:56Z", "content": null}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Pinkvilla Desk", "title": "Bill & Melinda Gates’ breakup ‘not a friendly split’? Family ‘FURIOUS at Bill for various things’ - PINKVILLA", "description": "Adding to the drama that has followed Bill and Melinda Gates2019 divorce, an insider recently claimed that their split was not as friendly as the duo is making it seem. Scroll down for more on this.", "url": "https://www.pinkvilla.com/entertainment/hollywood/bill-melinda-gates-breakup-not-friendly-split-family-furious-bill-various-things-727739", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/bill_melinda_gates_breakup_not_a_friendly_split_-social.jpg?itok=Mxgivk8j", "publishedAt": "2021-05-06T17:47:03Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Praj Industries consolidated Q4 PAT at Rs 52 crore - Moneycontrol.com", "description": "The company's PAT stood at Rs 24.86 crore in the year-ago period, Praj said in a statement.", "url": "https://www.moneycontrol.com/news/business/earnings/praj-industries-consolidated-q4-pat-at-rs-52-crore-6863761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/10/Earnings-Image-462x435.jpg", "publishedAt": "2021-05-06T17:39:03Z", "content": "Industrial biotechnology company Praj Industries on Thursday reported a consolidated profit after tax (PAT) of Rs 52 crore for the quarter ended March 2021.\r\nThe company's PAT stood at Rs 24.86 crore… [+802 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dow Jones hits fresh record high as cyclicals rise on jobless claims data - Moneycontrol.com", "description": "Investors are now awaiting a more comprehensive non-farm payrolls report on Friday for clues on the strength of the labor market and potentially the U.S. Federal Reserve's stance on monetary policy.", "url": "https://www.moneycontrol.com/news/business/markets/dow-jones-hits-fresh-record-high-as-cyclicals-rise-on-jobless-claims-data-6863651.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/wall-street-US-market-770x433.jpg", "publishedAt": "2021-05-06T17:07:01Z", "content": "The Dow Jones Industrials hit a record high on Thursday, as economically sensitive stocks rose after an upbeat weekly jobless claims report, while vaccine makers fell as President Joe Biden backed pl… [+2648 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "MCX Aluminium hits lifetime high, LME price nears $2,500/tonne amid supply disruption - Moneycontrol.com", "description": "Mounting supply side stress amid an improved demand outlook for aluminium and other industrial metals might continue to support the prices in the near term.", "url": "https://www.moneycontrol.com/news/business/commodities/mcx-aluminium-hits-lifetime-high-on-mcx-lme-price-nears-2500tonne-amid-supply-disruption-6863411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/10/foil-770x433.jpg", "publishedAt": "2021-05-06T17:02:50Z", "content": "Aluminium prices touched a fresh lifetime high on the MCX and near 10-year high on LME near $2,500/tonne on weaker dollar, tightness in the physical market, supply concerns in China and decline in st… [+2915 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Iron ore price tops $200 amid further deterioration of China-Australia relations - MINING.COM - MINING.com", "description": "", "url": "https://www.mining.com/iron-ore-price-tops-200-as-china-australia-relations-break-down-further/", "urlToImage": "https://www.mining.com/wp-content/uploads/2021/05/steel-china-1024x576.jpeg", "publishedAt": "2021-05-06T16:47:06Z", "content": "“Recently, some Australian Commonwealth Government officials launched a series of measures to disrupt the normal exchanges and cooperation between China and Australia out of Cold War mindset and ideo… [+3581 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "Hero MotoCorp Q4 Results: Profit Beats Estimates Despite A Decline - BloombergQuint", "description": "Hero MotoCorp.’s Q4 profit fell as high ownership cost hurt two-wheeler demand.", "url": "https://www.bloombergquint.com/quarterly-earnings/hero-motocorp-q4-results-profit-beats-estimates-despite-a-decline", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-08%2F7c0a85df-0de8-4275-950b-a49c00a4b007%2F323715697.jpg?rect=0%2C0%2C3999%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-06T16:06:36Z", "content": "Hero MotoCorp Ltd.s quarterly profit fell as higher ownership cost hurt two-wheeler demand.\r\nNet profit of Indias largest two-wheeler maker fell 17% sequentially to Rs 865 crore in the quarter ended … [+2288 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "News18", "title": "New Covid-19 Strains to Emerge in 6 Months, Booster Shots Will Be Needed: Moderna CEO - Yahoo India News", "description": "The comment comes a day after Moderna announced a third dose of either its current COVID-19 shot or an experimental new vaccine candidate increases immunity ...", "url": "https://in.news.yahoo.com/covid-19-strains-emerge-6-135200658.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.q0RoU6JbFuREcjLDrvgyg--~B/aD04MDA7dz0xMjAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/news18_coronavirus_edition_222/a46beaed8e9024d765ab2d681d6ad744", "publishedAt": "2021-05-06T13:52:00Z", "content": "Moderna CEO on Thursday said new coronavirus strains are likely to emerge and countries will be required to get booster shots of the two-dose covid-19 vaccine as the southern hemisphere heads toward … [+2493 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Renault teases its first electric SUV Megan E-Tech ahead of global debut - HT Auto", "description": "The Renault Megan E-Tech will be the brand's first model based on the new CMF-EV platform.", "url": "https://auto.hindustantimes.com/auto/cars/renault-teases-its-first-electric-suv-megane-e-ahead-of-global-debut-41620306662035.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/06/600x338/E0tExeOXMAAUf9__1620306673379_1620306746798.jpeg", "publishedAt": "2021-05-06T13:37:30Z", "content": "Renault is gearing up to launch its first electric SUV Megan E-Tech early next year. Before that Renault gave the first glimpse of the production version of the electric SUV. The fully electric compa… [+1707 chars]"}, {"source": {"id": null, "name": "Gulte"}, "author": "Suman", "title": "Bill Gates’s Cascade Transfers $2.4 Billion Of Stock To Melinda - Gulte", "description": "Bill Gates has come a long way to stake his claim as one of the richest men on planet Earth. As Bill Gates ad his wife Melinda French Gates are heading for a divorce, she is reportedly receiving billions from Cascade Investment, the holding company created by…", "url": "https://www.gulte.com/trends/85528/bill-gatess-cascade-transfers-2-4-billion-of-stock-to-melinda", "urlToImage": "https://cdn.gulte.com/wp-content/uploads/2021/05/Bill-Melinda-660x330.jpg", "publishedAt": "2021-05-06T13:16:22Z", "content": "Bill Gates has come a long way to stake his claim as one of the richest men on planet Earth. As Bill Gates ad his wife Melinda French Gates are heading for a divorce, she is reportedly receiving bill… [+1360 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Sharleen Dsouza", "title": "Tata Consumer Q4 Results: Net Profit Slumps 44%, Margin Contracts - BloombergQuint", "description": "Net profit of Tata Tea and Tata Salt maker declined 44% sequentially to Rs 133.34 crore in quarter ended March.", "url": "https://www.bloombergquint.com/quarterly-earnings/tata-consumer-q4-results-net-profit-slumps-44-margin-contracts", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-05%2F06685eab-5953-4629-b616-3432ca5ba62e%2F228136282.jpg?rect=0%2C48%2C3000%2C1575&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-06T12:13:21Z", "content": "While India beverages and foods businesses maintained revenue, the international beverage business revenue declined versus the December quarter. Consolidated Ebitda growth for the quarter was impacte… [+2114 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "After The Bell: Nifty back above 14700; what should investors do on Friday? - Moneycontrol.com", "description": "For the time being, it looks prudent to remain neutral on the index by shifting focus towards stock-specific opportunities whereas traders with long side bias on Nifty are advised to maintain a stop below 14600 levels.", "url": "https://www.moneycontrol.com/news/business/markets/after-the-bell-nifty-back-above-14700-what-should-investors-do-on-friday-6862401.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/stocks_sensex_nifty_stockmarkets-770x433.jpg", "publishedAt": "2021-05-06T10:47:24Z", "content": "Positive global cues, hopes of recovery through vaccine drive amid a rise in COVID cases helped bulls to put up a strong show for the second consecutive day in a row.\r\nThe S&amp;P BSE Sensex rallied … [+3175 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "All-New Skoda Fabia Premium Hatchback Unveiled with Avant-Garde Technology and Features - News18", "description": "Besides the standard model, the fourth generation Fabia will also be available in Combi Clever, Combi Monte Carlo, Black Edition Combi Scoutline Clever, Monte Carlo and Combi body styles.", "url": "https://www.news18.com/news/auto/all-new-skoda-fabia-premium-hatchback-unveiled-with-avant-garde-technology-and-features-3711869.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620297263_20210505103656_skoda_fabia_2022_front_4.jpg", "publishedAt": "2021-05-06T10:35:02Z", "content": "Czech Republic-headquartered Skoda has finally unveiled its much-awaited Fabia model. The vehicle comes as the fourth generation of the popular Fabia model and boasts avant-garde safety and technolog… [+1860 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Maruti Suzuki NEXA Discounts May 2021 – Ignis, Baleno, Ciaz - GaadiWaadi.com", "description": "Maruti Suzuki is offering benefits worth up to a maximum of Rs. 35,000 on its NEXA range of vehicles this month, i.e., in May 2021", "url": "https://gaadiwaadi.com/maruti-suzuki-nexa-discounts-may-2021-ignis-baleno-ciaz/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/02/maruti-s-cross-petrol-1.5L-AT-1.jpg", "publishedAt": "2021-05-06T10:00:36Z", "content": "Maruti Suzuki is offering some extremely lucrative deals and discounts on its vehicles during this month (May 2021). Here, we have listed all the offers available on Maruti NEXA cars. If youre intere… [+2487 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "IT shares in focus; Wipro, Coforge, Mindtree, Mphasis hit new highs - Business Standard", "description": "Mastek, Intellect Design Arena, Sasken Technologies, Newgen Software Technologies, Nucleus Software Services and Sonata Software were up in the range of 5 per cent to 11 per cent in intra-day deals", "url": "https://www.business-standard.com/article/markets/it-shares-in-focus-wipro-coforge-mindtree-mphasis-hit-new-highs-121050600655_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-05/31/full/1559322260-0276.jpg", "publishedAt": "2021-05-06T08:34:00Z", "content": "Shares of information technology (IT) companies were in focus at the bourses, on Thursday, with Coforge rallying 18 per cent to Rs 3,399.85, also its new high, on the BSE after the company reported a… [+4626 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Explained: Who can opt for loan repayment relief under RBI’s ‘Resolution Framework 2.0' - India Today", "description": "One key announcement made by RBI Governor Shaktikanta Das was regarding the Resolution Framework 2.0 for individual borrowers, small businesses and MSMEs. Find out if you are eligible to opt for it.", "url": "https://www.indiatoday.in/business/story/explained-who-can-opt-for-loan-repayment-relief-under-rbi-s-resolution-framework-2-0-1799486-2021-05-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/Screenshot_2021-05-06_at_1.23.-647x363.png?C8xztWA85AZO7CTjCf9Pdf6YVM7Y8wV9", "publishedAt": "2021-05-06T07:56:12Z", "content": "The Reserve Bank of India (RBI) on Wednesday announced several relief measures to help citizens, small businesses, healthcare providers and vaccine makers to tackle the second wave of the pandemic.\r\n… [+4180 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now", "title": "Vaccine trackers: These websites will tell you when there's an open slot that you can book - Gadgets Now", "description": "India has opened the Covid-19 vaccination programme to all citizens above the age of 18 years. While the entire process is digital and quite easy to register, the biggest challenge is to get a confirmed appointment. With limited open slots, due to the shortag…", "url": "https://www.gadgetsnow.com/slideshows/vaccine-trackers-these-websites-will-tell-you-when-theres-an-open-slot-that-you-can-book/photolist/82424146.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82424166,width-800,resizemode-4,imgsize-38045/share.jpg", "publishedAt": "2021-05-06T03:58:00Z", "content": "If you use Paytm, just scroll down to the Discover with Paytm section and over here you will find the Vaccine Finder feature. With this Covid-19 Vaccine Slot Finder, you can check the availability of… [+110 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: RBI’s Rs 50,000 crore fund support to healthcare; liquidity push - The Indian Express", "description": "The RBI has opened an on-tap liquidity window of Rs 50,000 crore with tenors of up to three years at the repo rate – four per cent -- till March 31, 2022 to boost provision of immediate liquidity for ramping up Covid-related healthcare infrastructure and serv…", "url": "https://indianexpress.com/article/explained/explained-rbi-unveils-rs-50000-crore-fund-support-to-healthcare-liquidity-push-7302704/", "urlToImage": "https://images.indianexpress.com/2020/12/rbi-shaktikanta-das-tashi-tobgyal-delhi-1200-explained.jpg", "publishedAt": "2021-05-06T03:12:45Z", "content": "With the raging Covid pandemic putting severe stress on the economy, the Reserve Bank of India (RBI) on Wednesday unveiled a host of measures to boost fund flow to the healthcare sector and ease the … [+5972 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Govt, LIC ready for strategic sale of IDBI Bank - Times of India", "description": "India Business News: NEW DELHI: After years of debate, the government on Wednesday cleared the strategic sale of IDBI Bank, in what will be the first instance of the disin.", "url": "https://timesofindia.indiatimes.com/business/india-business/govt-lic-ready-for-strategic-sale-of-idbi-bank/articleshow/82423107.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82423106,width-1070,height-580,imgsize-59883,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-06T01:56:00Z", "content": "Govt, LIC ready for strategic sale of IDBI Bank"}]}