{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "In a first, premium hydrogen fuel bus to start in Delhi-Jaipur route - Mint", "description": "The service will be the first of its kind in India to be used for intercity commute. Previously, similar bus services were seen testing in metro cities like Mumbai", "url": "https://www.livemint.com/news/india/ntpc-to-run-premium-hydrogen-fuel-bus-from-delhi-to-jaipur-11613834979414.html", "urlToImage": "https://images.livemint.com/img/2021/02/20/600x338/2021-02-17T060221Z_1952224039_RC26UL9L85HI_RTRMADP_3_EU-ENERGY-HYDROGEN_1613835763284_1613835777726.JPG", "publishedAt": "2021-02-20T15:43:29Z", "content": "Giving a boost to green mobility, state-run National Thermal Power Corporation Limited is planning to start a premium hydrogen fuel bus service on Delhi to Jaipur route.A feasibility study for the se… [+1246 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Utpal Bhaskar", "title": "Torrent Power' bid highest for Dadra and Nagar Haveli, and Daman and Diu discoms - Mint", "description": "Torrent Power bid around Rs555 crore for acquiring 51% stake in these two discoms; as part of the discom privatization exercise for eight Union territories.This comes in the backdrop of India working on next-generation power sector reforms as articulated by P…", "url": "https://www.livemint.com/news/india/torrent-power-bid-highest-for-dadra-and-nagar-haveli-and-daman-and-diu-discoms-11613831880111.html", "urlToImage": "https://images.livemint.com/img/2021/02/20/600x338/power-kaCH--621x414@LiveMint_1613832090047.JPG", "publishedAt": "2021-02-20T14:43:29Z", "content": "New Delhi: Torrent Power has placed the highest bid for power distribution companies (discoms) of Dadra and Nagar Haveli, and Daman and Diu, the company said in a statement.According to two people aw… [+4262 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Bitcoin and Ethereum 'seem high', says Elon Musk after his 'less dumb form of cash' tweet drives up rates - Moneycontrol", "description": "Following Elon Musk's previous tweet, Bitcoin witnessed another surge, as the prices peaked to $56,581.57 in Singapore, in the early hours of February 20. Ethereum rate reached a high of $2,041, according to Bitstamp.", "url": "https://www.moneycontrol.com/news/business/bitcoin-and-ethereum-seem-high-says-elon-musk-after-his-less-dumb-form-of-cash-tweet-drives-up-rates-6549311.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Elon-Musk-2-653x435.jpg", "publishedAt": "2021-02-20T14:30:00Z", "content": "The prices of Bitcoin and Ethereum \"seem high\", billionaire Elon Musk said on February 20, a day after his \"less dumb form of cash\" tweet drove up the prices of cryptocurrency.\r\nMusk, while respondin… [+1144 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Aditya Nadkarni", "title": "Nissan India confirms Magnite sold in India is safe - Team-BHP", "description": "Nissan has confirmed that the Magnite sold in India has earned 4 stars in crash tests conducted by ASEAN NCAP. The company tweeted the message as a response to a question asking whether the ASEAN NCAP rating was applicable to cars sold in India as well.", "url": "https://www.team-bhp.com/news/nissan-india-confirms-magnite-sold-india-safe", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Tweet.jpg", "publishedAt": "2021-02-20T13:28:05Z", "content": "Nissan has confirmed that the Magnite sold in India has earned 4 stars in crash tests conducted by ASEAN NCAP. The company tweeted the message as a response to a question asking whether the ASEAN NCA… [+1285 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "Renault Kiger Price Comparison With Rivals – Venue, Magnite, Sonet - GaadiWaadi.com", "description": "The Renault Kiger has become the most affordable car in the sub-4m SUV segment, but it should be noted that the prices are introductory", "url": "https://gaadiwaadi.com/renault-kiger-price-comparison-with-rivals-venue-magnite-sonet/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/01/Renault-Kiger-Vs-Tata-Nexon.jpg", "publishedAt": "2021-02-20T13:00:49Z", "content": "The Renault Kiger is the latest car to join the sub-4m SUV segment, and the Kiger has also become the most affordable car in the said segment. That said, the sub-compact SUV segment is currently the … [+3971 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Nikhil Puthran", "title": "India-bound next-gen Renault Duster will be based on a new global platform - CarWale", "description": "Renault plans to expand its market share from 3.4 per cent to 4.0 per cent by next year.", "url": "https://www.carwale.com/news/nextgen-renault-duster-will-be-based-on-a-new-global-platform/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/54329/left-rear-three-quarter0.jpeg?art=1&q=85", "publishedAt": "2021-02-20T11:49:21Z", "content": "- Renault plans to expand its market share from 3.4 per cent to 4.0 per cent by next year\r\n- New Renault Duster will be based on the global platform and not CMF-A. \r\nRenault has emerged strongly in t… [+1348 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Laxmi Organic, MTAR Technologies receive SEBI approval for IPO; likely to hit market by early March - Moneycontrol.com", "description": "While Laxmi Organics' IPO consists of a fresh issue of Rs 500 crore and an offer for sale of Rs 300 crore by promoter Yellow Stone Trust, MTAR Technologies' IPO consists of a fresh issuance of 40 lakh shares and an offer for sale of 82,24,270 equity shares by…", "url": "https://www.moneycontrol.com/news/business/ipo/laxmi-organic-mtar-technologies-receive-sebi-approval-for-ipo-likely-to-hit-market-by-early-march-6549031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/IPO-770x433.jpg", "publishedAt": "2021-02-20T11:24:00Z", "content": "Specialty chemicals company Laxmi Organics and precision engineering solutions company MTAR Technologies received SEBI (Securities and Exchange Board of India) approval for their initial public offer… [+1404 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "4th-gen Mitsubishi Outlander revealed - Team-BHP", "description": "Mitsubishi has revealed the fourth generation Outlander. The SUV shares its underpinnings with the Nissan Rogue. The new Outlander features a unique exterior based on Mitsubishi's latest design philosophy. It has a large grille with U-shaped chrome elements o…", "url": "https://www.team-bhp.com/news/4th-gen-mitsubishi-outlander-revealed", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2022-Mitsubishi-Outlander.jpg", "publishedAt": "2021-02-20T10:44:32Z", "content": "Mitsubishi has revealed the fourth generation Outlander. The SUV shares its underpinnings with the Nissan Rogue.\r\nThe new Outlander features a unique exterior based on Mitsubishi's latest design phil… [+1204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "Explained: Will UK ruling on Uber drivers have an impact on India? - The Indian Express", "description": "The UK Supreme Court, however, turned down this plea and that the lack of a legal agreement as such between Uber and the drivers on its platform would not be an impediment in its being considered an employer.", "url": "https://indianexpress.com/article/explained/explained-will-uk-ruling-on-uber-drivers-have-an-impact-on-india-7197086/", "urlToImage": "https://images.indianexpress.com/2021/02/Uber-.jpg", "publishedAt": "2021-02-20T10:25:30Z", "content": "The UK Supreme Court Friday ruled that Uber drivers were to be considered workers and not freelance contractors, thereby making them eligible for all employment related benefits such as minimum wage,… [+5125 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Suneera Tandon", "title": "The world should not forget about action on climate and healthcare: HUL MD Sanjiv Mehta - Mint", "description": "HUL chairman and MD Sanjiv Mehta said businesses we have to adopt sustainability as a business goal.Mehta urged industry to start manufacturing API's again", "url": "https://www.livemint.com/companies/people/the-world-should-not-forget-about-action-on-climate-and-healthcare-sanjiv-mehta-11613809325245.html", "urlToImage": "https://images.livemint.com/img/2021/02/20/600x338/SM_1588348296922_1588348297139_1613809640875.jpg", "publishedAt": "2021-02-20T08:44:57Z", "content": "New Delhi: Sanjiv Mehta, chairman and managing director, Hindustan Unilever Ltd (HUL), Indias top fast moving consumer goods company, said climate crisis and healthcare are the two big lessons that b… [+3122 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Harshita Tyagi", "title": "Azim Premji receives AIMA lifetime achievement award - Times Now", "description": "Philanthropy must come from within and it cannot be mandated from outside. Individual/personal philanthropy must be separate from a company's Corporate Social Responsibility, said Azim Premji", "url": "https://www.timesnownews.com/business-economy/companies/article/azim-premji-receives-aima-lifetime-achievement-award/722783", "urlToImage": "https://imgk.timesnownews.com/story/Azim_Premji_PTI.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-20T08:43:00Z", "content": "New Delhi: Wipro Limited founder Azim Premji received the AIMA Life Time Achievement Award for Management on Saturday. All India Management Association (AIMA), the apex body for Management in the cou… [+2554 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Aditya Nadkarni", "title": "Kiger effect: PPS opens 5 new Renault showrooms in Telangana - Team-BHP", "description": "Renault dealer PPS Motors has opened five brand new showrooms in LB Nagar, Kompally, Malakpet, Warangal and Nizamabad in Telangana state. These new showrooms have been opened to cater to an overwhelming response that PPS Renault claims to have received for th…", "url": "https://www.team-bhp.com/news/kiger-effect-pps-opens-5-new-renault-showrooms-telangana", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/LB NAGAR RENAULT.jpg", "publishedAt": "2021-02-20T08:13:40Z", "content": "Renault dealer PPS Motors has opened five brand new showrooms in LB Nagar, Kompally, Malakpet, Warangal and Nizamabad in Telangana state. These new showrooms have been opened to cater to an overwhelm… [+999 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "Honda H'ness Vs CB350 RS Features & Design Comparison - Video - GaadiWaadi.com", "description": "Honda CB350 RS is a scrambler take on the regular H'ness CB350 with a number of notable differences that are explained in detail here", "url": "https://gaadiwaadi.com/honda-hness-vs-cb350-rs-features-design-comparison-video/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/02/xionrv8pei8.jpg", "publishedAt": "2021-02-20T06:47:17Z", "content": "Honda expanded the H’ness CB350’s range only a few days ago with the arrival of the CB350 RS. Priced around Rs. 4,000 more than the H’ness, at Rs. 1.96 lakh (ex-showroom), the Honda CB350 RS is a scr… [+2266 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "What will Indian investors lose if govt really bans cryptocurrency - Economic Times", "description": "Banning ‘cryptocurrencies, better termed crypto assets, would also stop investment in companies that use crypto tokens to power their technology.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/what-will-indian-investors-lose-if-govt-really-bans-cryptocurrency/articleshow/81123184.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81123183,width-1070,height-580,imgsize-407966,overlay-etmarkets/photo.jpg", "publishedAt": "2021-02-20T06:39:00Z", "content": "By Rahul PagidipatiIf the rumours are true, Indians will soon be banned from doing what investors in China as well as those in fellow democracies like the US and UK are safely doing: investing in cry… [+3488 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Vlad", "title": "WhatsApp explains what happens to people who won't agree to its privacy changes - GSMArena.com news - GSMArena.com", "description": "The deadline for accepting the new terms and conditions had been moved to May 15.", "url": "https://www.gsmarena.com/whatsapp_explains_what_happens_to_people_who_wont_agree_to_its_privacy_changes-news-47846.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/02/whatsapp-explanations/-476x249w4/gsmarena_000.jpg", "publishedAt": "2021-02-20T06:19:01Z", "content": "Back in January, WhatsApp stirred up a huge backlash after announcing that it would be forcing its users to agree to new terms and conditions for its privacy policy. The updated wording made people t… [+1634 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Supreme Court tells RBI to frame new rules of bank locker management within 6 months - CNBCTV18", "description": "On Friday, the Supreme Court (SC) directed the Reserve Bank of India (RBI) to set new regulations within six months on locker facility management, which will be followed by banks across the country. Get latest Economy online at cnbctv18.com", "url": "https://www.cnbctv18.com/economy/supreme-court-tells-rbi-to-frame-new-rules-of-bank-locker-management-within-6-months-8370991.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/07/2018-07-17T121659Z_1_LYNXMPEE6G0RL_RTROPTP_3_INDIA-CORRUPTION.jpg", "publishedAt": "2021-02-20T06:04:26Z", "content": "On Friday, the Supreme Court (SC) directed the Reserve Bank of India (RBI) to set new regulations within six months on locker facility management, which will be followed by banks across the country.\r… [+2580 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "Chakri K", "title": "Vodafone Idea Lost a Whopping 5.6 Million Users in December 2020, Airtel Gains 4 Million: Trai - TelecomTalk", "description": "Trai has released Telecom Subscription Data as of December 31, 2020, in which it revealed that Vodafone Idea lost a whopping 5.6 million users", "url": "https://telecomtalk.info/vodafone-idea-airtel-trai-december-data/336840/", "urlToImage": "https://images.telecomtalk.info/wp-content/uploads/2021/02/vodafone-idea-airtel-trai-december-data.jpg", "publishedAt": "2021-02-20T05:15:11Z", "content": "The Telecom Regulatory Authority of India (Trai) has released Telecom Subscription Data as of December 31, 2020, in which it revealed that Vodafone Idea lost a whopping 5.6 million users. Vi ended 20… [+1828 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Karnataka Bank reports Rs 34.16-crore fraud to RBI - CNBCTV18", "description": "The lender said IL&FS Transportation had availed credit from it during 2016 under multiple banking arrangements in which Karnataka Bank was one of the members. Get latest Finance online at cnbctv18.com", "url": "https://www.cnbctv18.com/finance/karnataka-bank-reports-rs-3416-crore-fraud-to-rbi-8370671.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/10/Karnataka-Bank1.jpeg", "publishedAt": "2021-02-20T04:55:04Z", "content": "Private sector lender Karnataka Bank on Friday said it has reported to the RBI a fraud of about Rs 34.16 crore in credit facilities extended to IL&amp;FS Transportation Networks, which is a dud accou… [+619 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Are you buying more during the pandemic? Boredom could be the reason behind it - Economic Times", "description": "By limiting social engagements, leisure activities and travel, the pandemic has forced many people to live a more muted life, without the normal deviations from daily monotony. The result is a collective sense of ennui — one that is shaping what we do and wha…", "url": "https://economictimes.indiatimes.com/news/international/world-news/are-you-buying-more-during-the-pandemic-boredom-could-be-the-reason-behind-it/articleshow/81121531.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81121588,width-1070,height-580,imgsize-1056420,overlay-economictimes/photo.jpg", "publishedAt": "2021-02-20T04:21:00Z", "content": "Mark Hawkins is an expert on being bored.\r\nWhen he was getting his counseling degree, he was fascinated by articles on the therapeutic benefits of boredom. He has written a book whose title is The Po… [+9635 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Google Artificial Intelligence Chief Apologises For Firing Black Woman Employee - NDTV", "description": "Google will start grading executives based on workforce diversity goals and increase human resources staffing, acknowledging fault in its acrimonious split with Timnit Gebru, a prominent former employee and one of the few Black women in the field of artificia…", "url": "https://www.ndtv.com/world-news/google-artificial-intelligence-chief-apologises-for-researchers-acrimonious-exit-sundar-pichai-sends-email-to-employees-2374600", "urlToImage": "https://c.ndtvimg.com/2020-10/6388vkr_google-650_650x400_05_October_20.jpg", "publishedAt": "2021-02-20T04:02:40Z", "content": "At Google, the changes came after turmoil stemming from Gebru's departure.\r\nGoogle will start grading executives based on workforce diversity goals and increase human resources staffing, acknowledgin… [+2953 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "Maruti Suzuki Jimny Considered For Launch In India - Report - GaadiWaadi.com", "description": "Maruti Suzuki Jimny could be powered by a 1.5-litre mild-hybrid petrol engine developing 104.7 PS and 138 Nm of peak torque", "url": "https://gaadiwaadi.com/maruti-suzuki-jimny-considered-for-launch-in-india-report/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/12/Suzuki-Jimny-production.jpg", "publishedAt": "2021-02-20T04:00:07Z", "content": "According to a recent report that emerged on the internet, Maruti Suzuki India Limited (MSIL) is conducting the feasibility study of introducing the Jimny in the local market. The off-roader, current… [+2004 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "Debt mutual funds v/s VPF: Which is better for high-salaried individuals post Budget rule-change - Times Now", "description": "Interest on employee’s contribution towards Provident Fund (PF) account above Rs 2.5 lakh per annum will be taxable with effect from April 1. This will affect VPF investors", "url": "https://www.timesnownews.com/business-economy/personal-finance/article/debt-mutual-funds-vs-vpf-which-is-better-for-high-salaried-individuals-post-budget-rule-change/722588", "urlToImage": "https://imgk.timesnownews.com/story/ipo_investing.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-02-20T03:51:53Z", "content": "One proposal in the Union Budget 2021 which is likely to hit wealthy investors in voluntary provident fund (VPF) may prompt them to instead move to debt mutual funds.   \r\nAccording to the proposal wh… [+2802 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "Ford Evaluating New Working Relationship With Mahindra - Report - GaadiWaadi.com", "description": "The earlier proposed JV was said to spawn three SUVs and Ford is currently working out a new relationship with Mahindra or end it altogether", "url": "https://gaadiwaadi.com/ford-evaluating-new-working-relationship-with-mahindra-report/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/12/2021-mahindra-xuv500-ford-c-suv-1.jpg", "publishedAt": "2021-02-20T03:00:03Z", "content": "Ford and Mahindra announced a while ago that their proposed joint venture would not come to fruition and it did send shockwaves across the Indian automotive industry despite reeling from an economica… [+2020 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Gold prices slide to lowest in 8 months, silver rates face volatility - Hindustan Times", "description": "Gold prices hit an eight-month low on Friday as prices in India followed global cues.", "url": "https://www.hindustantimes.com/business/gold-prices-slide-to-lowest-in-8-months-silver-rates-face-volatility-101613789792353.html", "urlToImage": "https://images.hindustantimes.com/img/2021/02/20/550x309/2021-02-16T192519Z_1119005445_RC2VTL9BT3J3_RTRMADP_3_GLOBAL-PRECIOUS_1613789829209_1613789835456.jpg", "publishedAt": "2021-02-20T02:59:03Z", "content": "Gold prices plunged throughout the week and the precious metal recorded a huge fall in prices witnessing an eight-month low on Friday, which experts say has come on the back of the rise in the US Tre… [+1570 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shalabh", "title": "IKEA to open its first India mall in Noida, pays Rs 850 crore for land - Times of India", "description": "The UP government on Friday allotted 12.3 acres in the city to IKEA for what will be the Swedish furniture giant’s first ‘meeting place’ venture in In", "url": "https://timesofindia.indiatimes.com/city/noida/ikea-to-open-its-first-india-mall-in-noida-pays-rs-850-crore-for-land/articleshow/81117633.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81121215,width-1070,height-580,imgsize-277720,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-20T02:20:00Z", "content": null}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "Chakri K", "title": "BSNL Intros FRC 47 for Prepaid Users With 28 Days Validity and 14GB Data - TelecomTalk", "description": "State-run Bharat Sanchar Nigam Limited (BSNL) has introduced a new First Recharge (FRC) of Rs 47 for the prepaid subscribers.", "url": "https://telecomtalk.info/bsnl-frc-47-introduced-prepaid-users/336799/", "urlToImage": "https://images.telecomtalk.info/wp-content/uploads/2021/02/bsnl-frc-47-introduced-prepaid-users.jpg", "publishedAt": "2021-02-20T01:32:31Z", "content": "State-run Bharat Sanchar Nigam Limited (BSNL) has introduced a new First Recharge (FRC) of Rs 47 for the prepaid subscribers. The FRC 47 is applicable only to new customers who are performing their f… [+2237 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shephali Bhatt and Ashwin Manikandan", "title": "A 'crypto' scam is brewing on Twitter, and social media at large - Economic Times", "description": "Cryptocurrency handles on Twitter are gaining followers by targeting fan communities with giveaway contests.", "url": "https://economictimes.indiatimes.com/tech/technology/a-crypto-scam-is-brewing-on-twitter-and-social-media-at-large/articleshow/81120014.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81120011,width-1070,height-580,imgsize-2109610,overlay-ettech/photo.jpg", "publishedAt": "2021-02-20T01:31:00Z", "content": "Two weeks ago, a Mumbai-based fan of the Korean pop (K-pop) band BTS realised that she and her connections had been inadvertently following a cryptocurrency account on Twitter. \r\nOver the next few da… [+8460 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Posted by Ridhima Shukla", "title": "Latest News Live Updates: Over 1.08 Crore COVID-19 Vaccine Doses Administered, Says Centre - NDTV", "description": "A total of 1.08 crore COVID-19 vaccine doses have been administered till now with 1.86 lakh jabs given today, the Union Health Ministry said. Of the 1,08,38,323 doses administered, Joint Secretary in the Union Health ministry Mandeep Bhandari said 72,26,653 v…", "url": "https://www.ndtv.com/india-news/latest-news-live-updates-india-records-13-193-new-covid-19-cases-2374556", "urlToImage": "https://c.ndtvimg.com/2021-02/oiaip56g_coronavirus-vaccine-generic650_625x300_15_February_21.jpg", "publishedAt": "2021-02-20T01:05:26Z", "content": "Daily COVID-19 cases in the country climbed to about 14,000. (File)\r\nNew Delhi: A total of 1.08 crore COVID-19 vaccine doses have been administered till now with 1.86 lakh jabs given today, the Union… [+25995 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mamtha Asokan", "title": "‘Altcoins’ up 5x on hunt for next Bitcoin - Times of India", "description": "India Business News:  Altcoins, or alternate cryptocurrencies, are gaining traction because buyers find them cheaper than Bitcoins, which have been reaching new highs ever", "url": "https://timesofindia.indiatimes.com/business/india-business/altcoins-up-5x-on-hunt-for-next-bitcoin/articleshow/81116018.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81120796,width-1070,height-580,imgsize-1125193,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-19T22:30:00Z", "content": null}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Tom Kool", "title": "Oil Prices Fall Back Below $60 - OilPrice.com", "description": "Oil prices have fallen back below $60 but remain at levels not seen since January 2020", "url": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Fall-Back-Below-60.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-02-19_hcxa2jfi4a.jpg", "publishedAt": "2021-02-19T20:00:00Z", "content": "Sign Up To Our Free Newsletter\r\nThanks for subscribing to our free newsletter!\r\nERROR\r\nThe electricity shortage in Texas…\r\nThe expected recovery of global…\r\nFlying cars are no longer…\r\nBy Tom Kool - … [+5466 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Isro keen on formulating exclusive space start-up programme, says chief K Sivan - India Today", "description": "K Sivan, Chairman of the Indian Space Research Organisation (Isro), said the space agency is keen on formulating an exclusive space startup programme -- \"Space Entrepreneurship & Enterprise Development (SEED)\".", "url": "https://www.indiatoday.in/science/story/isro-keen-on-formulating-exclusive-space-start-up-programme-says-chief-k-sivan-1771142-2021-02-20", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202102/000_1NE0AA-647x363.jpeg?25zwI8Wpmo7fq0n09Ie6RlB5CkJgFjRu", "publishedAt": "2021-02-19T19:39:43Z", "content": "The Indian Space Research Organisation (Isro) has embarked on a mission to take startups in the space sector to a higher orbit with a string of initiatives to help them realise their business potenti… [+3893 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Bitcoin market hits $1.0 trillion in value - India Today", "description": "Bitcoin has hit a market value of $1 trillion.", "url": "https://www.indiatoday.in/business/story/bitcoin-market-hits-1-0-trillion-in-value-1771111-2021-02-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202102/bitcoin_reuters-647x363.png?VNuvwbHkKbMC9yQjxSTMc4spc1IB_2En", "publishedAt": "2021-02-19T16:52:25Z", "content": "Bitcoin has hit a market value of $1 trillion.\r\nAs per a report, speculators, corporate treasurers and institutional investors are thought to have stoked Bitcoins volatile ascent.\r\nBitcoin traded at … [+885 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Eric Lam", "title": "Bitcoin Hits $1 Trillion Value as Crypto Leads Other Assets - BloombergQuint", "description": "The largest token has added more than $415 billion of value in 2021 to about $956 billion, data compiled by Bloomberg show.", "url": "https://www.bloombergquint.com/crypto/bitcoin-nears-1-trillion-value-as-crypto-jump-tops-other-assets", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-02%2F0ff9b5d4-9694-466f-851b-4b4e7b79f34f%2F323461150_1-8.jpg?rect=0%2C270%2C5000%2C2625&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-02-19T16:34:06Z", "content": "(Bloomberg) -- Bitcoins market value reached $1 trillion for the first time, a surge thats helping cryptocurrency returns far outstrip the performance of more traditional assets like stocks and gold.… [+2770 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Bloomberg", "title": "Star commodity becomes a laggard: Golds worst start to a year since 1991 - Business Standard", "description": "Spot prices touched a seven-month low on Friday, deepening a slump and breaching through a support level that analysts say could portend further losses", "url": "https://www.business-standard.com/article/markets/star-commodity-becomes-a-laggard-gold-s-worst-start-to-a-year-since-1991-121021901220_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-09/28/full/1601273900-0942.jpg", "publishedAt": "2021-02-19T14:31:00Z", "content": "Gold began the year with lofty expectations on the back of a record high and its biggest annual gain in a decade. Instead, the precious metal is off to its worst start in 30 years.\r\nSpot prices touch… [+4437 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Pfizer submits data showing Covid-19 vaccine's stability in refrigerators - Times of India", "description": "US News: Pfizer Inc and partner BioNTech SE said on Friday they have submitted new data to the US health regulator showing the stability of their Covid-19 vacc.", "url": "https://timesofindia.indiatimes.com/world/us/pfizer-submits-data-showing-covid-19-vaccines-stability-in-refrigerators/articleshow/81111240.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81111232,width-1070,height-580,imgsize-55328,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-19T12:36:00Z", "content": null}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Nithyanandh Karuppaswamy", "title": "New Mahindra XUV500 Based Ford C-SUV Faces Uncertainty - RushLane", "description": "The Ford C-SUV project has been temporarily put on hold as the automaker and Mahindra review their options following the JV breakup.", "url": "https://www.rushlane.com/ford-c-suv-mahindra-xuv500-faces-uncertainty-12394377.html/", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/02/ford-suv-based-on-mahindra-xuv500.jpg", "publishedAt": "2021-02-19T12:32:24Z", "content": "New Ford SUV For India – Render\r\nWe all know that Ford and Mahindra decided to call off their joint venture just before entering the new year. The pandemic induced slowdown and uncertain future prosp… [+2820 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dr Reddy's begins process to obtain emergency use authorisation for Sputnik V - Moneycontrol", "description": "Sputnik V has demonstrated an efficacy rate of 91.6 per cent in the interim analysis of phase 3 clinical trial, which included data on 19,866 volunteers in Russia, the statement said.", "url": "https://www.moneycontrol.com/news/business/dr-reddys-begins-process-to-obtain-emergency-use-authorisation-for-sputnik-v-6546401.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/Sputnik-V-vaccine-770x433.jpg", "publishedAt": "2021-02-19T12:30:00Z", "content": "Dr Reddy's Laboratories on Friday said it has approached drugs regulator DCGI for emergency use authorisation (EUA) for COVID-19 vaccine Sputnik V.\r\nAs part of the review process, the drug major will… [+1844 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol breaches Rs 90/litre mark in Delhi: Here’s are auto fuel prices in your city today - The Indian Express", "description": "Petrol and Diesel price today: Petrol today breached the Rs 90-mark in Delhi and is now retailing at Rs 90.19 a litre while diesel is selling at Rs 80.60. In the financial capital Mumbai, petrol price now stands at Rs 96.62 while diesel costs Rs 87.67.", "url": "https://indianexpress.com/article/business/commodities/petrol-price-hits-rs-90-per-litre-in-delhi-diesel-auto-fuel-price-new-all-time-high-in-your-city-today-mumbai-kolkata-chennai-bengaluru-february-19-7195299/", "urlToImage": "https://images.indianexpress.com/2021/02/petrol-diesel-price-today-express-photo-1200.jpg", "publishedAt": "2021-02-19T12:29:17Z", "content": "Petrol and diesel prices continued to rise for the 11th straight day and touch new highs across the country on Friday, February 19, 2021. In the national capital, petrol price was hiked by 31 paise p… [+3411 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Sharleen Dsouza", "title": "Jubilant Foodworks To Buy Stake In Master Franchisee Of Domino’s Pizza In Four Countries - BloombergQuint", "description": "It will buy 32.8% stake in DP Eurasia, which holds franchise for Domino’s Pizza  in Turkey, Russia, Azerbaijan and Georgia.", "url": "https://www.bloombergquint.com/business/jubilant-foodworks-to-buy-stake-in-master-franchisee-of-dominos-pizza-in-four-countries", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-04%2F4efa0bbd-5782-450e-b482-57b9e36750ca%2F325476388_1_18.jpg?rect=0%2C0%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-02-19T12:22:02Z", "content": "The operator of Dominos Pizza chain in India has agreed to acquire stake in the franchisee holder for its restaurants in Turkey, Russia, Azerbaijan and Georgia.\r\nJubilant Foodworks Ltd. will buy 32.8… [+1266 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Nifty gives up 15,000 as SBI joins selloff in banking stocks. What analysts say - Mint", "description": "Global markets have pulled back from recent record highs as rising bond yields and disappointing U.S. jobless data hurt investor confidence", "url": "https://www.livemint.com/market/stock-market-news/nifty-gives-up-15-000-as-sbi-joins-selloff-in-banking-stocks-what-analysts-say-11613735850950.html", "urlToImage": "https://images.livemint.com/img/2021/02/19/600x338/367429083_0-15_1613735868726_1613736153469.jpg", "publishedAt": "2021-02-19T12:12:48Z", "content": "Indian markets drifted lower for the fourth successive session led by losses in lenders. After a weak start, the benchmark indices tried to recovery but profit-taking in banking, auto, metal and heal… [+3071 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Reskilling a key aspect of doing sustainable business: Accenture CEO Julie Sweet - Moneycontrol", "description": "Accenture's commitment to sustainability includes achieving net-zero emission by 2025, 100 percent recycling of e-waste such as computers and reducing consumption of water in high-risk areas.", "url": "https://www.moneycontrol.com/news/business/reskilling-a-key-aspect-of-doing-sustainable-business-accenture-ceo-julie-sweet-6546011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/Julie-Sweet-770x433.jpg", "publishedAt": "2021-02-19T11:44:00Z", "content": "Reskilling is one of the key aspects of building a sustainable business that will make an organisation agile and profitable, Accenture CEO Julie Sweet said at an industry forum today.\r\nSustainable bu… [+1663 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Siddharth Prabhakar", "title": "CBI arrests Standard Chartered Bank official for bribe, recovers Rs 18 lakh from his Chennai premises - Times of India", "description": "CHENNAI: The Central Bureau of Investigation arrested a Standard Chartered Bank official in connection with a bribe case and recovered Rs 18 lakh, pro.", "url": "https://timesofindia.indiatimes.com/city/chennai/cbi-arrests-standard-chartered-bank-official-for-bribe-recovers-rs-18-lakh-from-his-chennai-premises/articleshow/81110125.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81110125,width-1070,height-580,imgsize-12577,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-19T11:39:00Z", "content": null}, {"source": {"id": null, "name": "Business Standard"}, "author": "Viveat Susan Pinto", "title": "After honey, Marico gets into instant noodles under Saffola brand - Business Standard", "description": "Takes on Nestle, ITC in a Rs 4,000 cr market; first big launch after Maggi crisis", "url": "https://www.business-standard.com/article/companies/after-honey-marico-gets-into-instant-noodles-under-saffola-brand-121021900928_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-02/19/full/1613734499-4178.jpg", "publishedAt": "2021-02-19T11:31:00Z", "content": "Consumer goods major Marico on Friday said that it had entered the Rs 4,000-crore instant noodles category in India, launching a new line of products under its Saffola brand.\r\n The entry is the first… [+3591 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "https://www.facebook.com/kshitij.rawat1/", "title": "Ford Ecosport SE Spied Without Boot-Mounted Spare Wheel, Launch Soon - GaadiWaadi.com", "description": "A new special edition model of Ford EcoSport has been spotted at a dealer yard, and this variant doesn’t get a tail-mounted spare", "url": "https://gaadiwaadi.com/2021-ford-ecosport-se-spied-in-india-without-tail-mounted-spare-wheel/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/02/Ford-Ecosport-SE-1.jpg", "publishedAt": "2021-02-19T10:02:28Z", "content": "Ford EcoSport is the most popular vehicle in the American manufacturers Indian lineup, despite being almost 9 years old in our market. Last month, Ford had updated the vehicle, offering enhanced conn… [+1894 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Suvashree Ghosh", "title": "Warburg-Backed Indian Bank Hits 3-Year High on Share Sale Plans - BloombergQuint", "description": "The company’s board approved the plan to help spur growth at the bank.", "url": "https://www.bloombergquint.com/business/warburg-backed-idfc-first-to-raise-413-million-to-boost-lending", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-11%2Fd291e1e1-6161-472c-b995-51c500844604%2FExterior_of_IDFC_First_Bank_Nerul_Branch__Photographer_Vijay_Sartape_BloombergQuint__061020.jpeg?rect=0%2C0%2C1280%2C672&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-02-19T09:56:15Z", "content": "(Bloomberg) -- Shares in IDFC First Bank Ltd. rose to their highest in more than three years after the Warburg Pincus-backed private lender said it plans to raise as much as 30 billion rupees ($413 m… [+2001 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Buy Repco Home Finance; target of Rs 400: Sharekhan - Moneycontrol", "description": "Sharekhan is bullish on Repco Home Finance has recommended buy rating on the stock with a target price of Rs 400 in its research report dated February 17, 2021.", "url": "https://www.moneycontrol.com/news/business/buy-repco-home-finance-target-of-rs-400-sharekhan-6545421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_1-770x433.jpg", "publishedAt": "2021-02-19T09:17:00Z", "content": "Sharekhan's research report on Repco Home Finance\r\nRepco Home Finance Limited (RHFL) is an attractive HFC with a niche loan book (salaried and professional class borrowers), stable asset quality, str… [+1008 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Rakesh Jhunjhunwala Portfolio: Big bull enters 5 new stocks, cuts stake in 5 shares in December quarter - Moneycontrol.com", "description": "Rakesh Jhunjhunwala and his wife Rekha Jhunjhunwala owned 40 listed stocks in their portfolio at the end of December 2020.", "url": "https://www.moneycontrol.com/news/business/markets/rakesh-jhunjhunwala-portfolio-big-bull-enters-5-new-stocks-cuts-stake-in-5-shares-in-december-quarter-6540161.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/06/rakesh_jhunjhunwala-770x433.jpg", "publishedAt": "2021-02-19T08:15:00Z", "content": "Following the market's sensational run since the COVID-led sell-off in March 2020, the portfolio value of most big investors has ballooned, and Rakesh Jhunjhunwala's portfolio was no different. The b… [+3783 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Neutral PVR; target of Rs 1620: Motilal Oswal - Moneycontrol.com", "description": "Motilal Oswal recommended Neutral rating on PVR with a target price of Rs 1620 in its research report dated February 18, 2021.", "url": "https://www.moneycontrol.com/news/business/stocks/neutral-pvr-target-of-rs-1620-motilal-oswal-2-6543821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/neutral2-770x433.jpg", "publishedAt": "2021-02-19T07:41:00Z", "content": "Motilal Oswal's research report on PVR\r\nAfter remaining severely impacted for nearly a year, weighed by the COVID-19 disruption, the Cinema industrys plea has finally been heard by the central govern… [+1307 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "T E Narasimhan", "title": "Ashok Leyland commences production at new bus facility in Andra Pradesh - Business Standard", "description": "The plant, spread over 75 acres, will include latest technology to deliver the high quality standards of the Ashok Leyland brand", "url": "https://www.business-standard.com/article/companies/ashok-leyland-commences-production-at-new-bus-facility-in-andra-pradesh-121021900507_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2016-10/17/full/1476688019-3994.jpg", "publishedAt": "2021-02-19T07:38:00Z", "content": "Ashok Leyland has started production of buses at its new plant in Andhra Pradesh. The development comes at a time when the company's bus volume continues to be under pressure.\r\nIn a disclosure to BSE… [+3221 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Cadila Healthcare stock trades lower even after USFDA nod for blood pressure drug - Moneycontrol.com", "description": "The drug will be manufactured at the group’s formulation facility in Ahmedabad.", "url": "https://www.moneycontrol.com/news/business/stocks/cadila-healthcare-stock-trades-lower-even-after-usfda-nod-for-blood-pressure-drug-6543691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/Pharma_drugs_cadila_sun_pharma_1280-770x433.jpg", "publishedAt": "2021-02-19T05:39:00Z", "content": "Cadila Healthcare share price fell intraday on February 19 even after the pharma firm received final approval from the US Food and Drug Administration (FDA) to market droxidopa capsules for treating … [+1378 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "RBI Kehta Hai: Watch Reserve Bank's innovative rap video warning against banking frauds - Moneycontrol", "description": "As part of the Public Awareness initiative by the RBI, its Twitter and Facebook page called 'RBI says' usually puts out pictures and messages in multiple Indian languages.", "url": "https://www.moneycontrol.com/news/business/rbi-kehta-hai-watch-reserve-banks-innovative-rap-video-warning-against-banking-frauds-6543431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Capture_1280x720-770x433.png", "publishedAt": "2021-02-19T05:06:00Z", "content": "The Reserve Bank of India (RBI) has found a new approach to warn the public of growing bank-related frauds-- using a rap song shared on the central bank's social media.\r\nAs part of the Public Awarene… [+1589 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sam Byford", "title": "Apple reportedly negotiating to build iPads in India - The Verge", "description": "Apple is reportedly planning to move some iPad manufacturing to India. The company is said to be motivated by a new export incentives scheme as well as a desire to diversify away from China.", "url": "https://www.theverge.com/2021/2/19/22290657/apple-ipad-manufacturing-india-negotiation-report", "urlToImage": "https://cdn.vox-cdn.com/thumbor/CTVs6-qiiXEkriKSl4BGrM_1K1M=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19258333/vpavic_190829_3709_1164.jpg", "publishedAt": "2021-02-19T05:04:18Z", "content": "The drive to diversify from China continues\r\nApple is said to be lobbying the Indian government in a move that could see the company manufacture iPads in the country for the first time. Reuters repor… [+1091 chars]"}, {"source": {"id": null, "name": "Zigwheels.com"}, "author": null, "title": "2021 Mahindra XUV500 2.0-litre Turbo-Petrol Version Spied Testing - Zigwheels.com", "description": "Mahindra’s new 2.0-litre mStallion turbo-petrol engine is likely to make 190PS in the new XUV500, making it the most powerful SUV in the segment", "url": "https://www.zigwheels.com/news-features/news/2021-mahindra-xuv500-20-litre-turbo-petrol-version-spied-testing/41207/", "urlToImage": "https://media.zigcdn.com/media/content/2021/Feb/zw-xuv500petrol-1-1-1.jpg", "publishedAt": "2021-02-19T04:36:46Z", "content": "<ul><li>The new XUV500 will be redesigned inside and out.\r\n</li><li>The second-gen XUV500 will get a Mercedes-inspired twin-screen floating display.\r\n</li><li>It will also get a panoramic sunroof for… [+1501 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Four years of N Chandrasekaran: The marathoner builds his legacy at Tata Sons, one step at a time - Moneycontrol", "description": "Even as the Chairman of Tata Sons bets on new areas such as electric vehicles, digital and healthcare, legacy challenges continue to shadow the $106 billion conglomerate.", "url": "https://www.moneycontrol.com/news/business/four-years-of-n-chandrasekaran-the-marathoner-builds-his-legacy-at-tata-sons-one-step-at-a-time-6537561.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/Chairman-Tata-Group-N-Chandrasekaran-during-the-launch-of-Nexon-EV-in-Mumbai-Jan-28-2020-PTI-770x433.jpg", "publishedAt": "2021-02-19T04:33:00Z", "content": "It is not known if Tata Sons Chairman N Chandrasekaran is one to celebrate work anniversaries. But the news around various Tata companies as it nears February 21, which marks the four years since he … [+11610 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Centre to appeal against Cairn's $1.2 billion arbitration award - Moneycontrol", "description": "The decision comes despite the Indian government having 'welcomed' Cairn Energy’s efforts to reach out for a dispute resolution", "url": "https://www.moneycontrol.com/news/business/centre-to-appeal-against-cairns-1-2-billion-arbitration-award-6542931.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/RTX36Z84-770x433.jpg", "publishedAt": "2021-02-19T03:59:00Z", "content": "The Cairn Energy dispute appears no closer to settlement than when it had begun. The Centre has decided to file an appeal against the global energy major's $1.2 billion arbitration award, CNBC-TV18 r… [+2284 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "It's So Cold In US That Calves' Ears Are Falling Off - NDTV", "description": "In Arkansas, ranchers are fitting pantyhose over the heads of calves in a desperate attempt to keep them warm. In Montana, they've been duct-taping calves' ears to their necks to stop them from falling off. In Oklahoma, newborns arrived onto snow-packed froze…", "url": "https://www.ndtv.com/world-news/its-so-cold-in-us-that-calves-ears-are-falling-off-2373784", "urlToImage": "https://c.ndtvimg.com/2021-02/vtq5tupo_us-cold-ranchers-bloomberg-650_625x300_19_February_21.jpg", "publishedAt": "2021-02-19T03:34:44Z", "content": "The unprecedented cold has been disastrous for flora and fauna and those making living cultivating them\r\nIn Arkansas, ranchers are fitting pantyhose over the heads of calves in a desperate attempt to… [+2886 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dipak K Dash", "title": "Jam on FASTag lanes? You may get a free ride - Times of India", "description": "India Business News: Commuters at several toll plazas on national highways are facing a long wait — stretching up to half-anhour at some toll plazas — due to glitches in t", "url": "https://timesofindia.indiatimes.com/business/india-business/jam-on-fastag-lanes-you-may-get-a-free-ride/articleshow/81102076.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81102094,width-1070,height-580,imgsize-1249328,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-19T02:56:00Z", "content": null}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Upcoming IPO's of 2021: As economy recovers, investors should track these public offers - CNBCTV18", "description": "With the economy making a recovery post-pandemic, here is a look at some of the upcoming IPOs of 2021 that investors should keep an eye on.Get latest Business online at cnbctv18.com", "url": "https://www.cnbctv18.com/photos/market/upcoming-ipos-of-2021-as-economy-recovers-investors-should-track-these-public-offers-8346871.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/08/IPO1-768x432.jpg", "publishedAt": "2021-02-19T02:36:08Z", "content": "Data is a real-time snapshot\r\n©TV18 Broadcast Limited. All rights reserved."}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Ikram Junaidi", "title": "2.8m doses of AstraZeneca vaccine to arrive on March 2 - DAWN.com", "description": "Registration and inoculation of healthcare workers, other than frontline workers, will start from February 22.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2021/02/602f210db1652.png", "publishedAt": "2021-02-19T02:04:20Z", "content": "ISLAMABAD: As 2.8 million doses of Oxford AstraZeneca Covid-19 vaccine will be received on March 2, the government has decided to start vaccination of people over 65 years of age in the first week of… [+5382 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "GameStop hearing; what happens next to Robinhood CEO and 'Roaring Kitty'? - Kitco NEWS", "description": "", "url": "https://www.kitco.com/news/2021-02-18/GameStop-hearing-what-happens-next-to-Robinhood-CEO-and-Roaring-Kitty.html", "urlToImage": "https://www.kitco.com/news/2021-02-18/images/21_02_18_Horwitz_YT.jpg", "publishedAt": "2021-02-18T23:46:00Z", "content": "Robinhood should compensate traders for any losses incurred from trading restrictions, and Keith Gill, also known on Twitter and YouTube as 'Roaring Kitty', would likely face penalties for initiating… [+1432 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "RBI tightens norms for e-payments - Times of India", "description": "India Business News: The Reserve Bank of India (RBI) has tightened payment security norms, making banks and other regulated entities more responsible for apps provided by", "url": "https://timesofindia.indiatimes.com/business/india-business/rbi-tightens-norms-for-e-payments/articleshow/81098600.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81102799,width-1070,height-580,imgsize-118318,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-18T22:30:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kaavya Chandrasekaran, ET EnergyWorld", "title": "Gadkari urges power minister to reconsider restriction on solar rooftop projects - ETEnergyworld.com", "description": "The power ministry had recently issued a gazette notification directing states to henceforth allow net metering only for solar rooftop projects with capacity lower than 10 KW.", "url": "https://energy.economictimes.indiatimes.com/news/renewable/gadkari-urges-power-minister-to-reconsider-restriction-on-solar-rooftop-projects/81101840", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-81101840,imgsize-97314,width-800,height-434,overlay-etenergyworld/gadkari-urges-power-minister-to-reconsider-restriction-on-solar-rooftop-projects.jpg", "publishedAt": "2021-02-18T16:49:00Z", "content": "BENGALURU: Union micro, small and medium industries minister Nitin Gadkari has urged power minister R K Singh to reconsider a recent controversial decision to restrict net metering in solar rooftop p… [+2976 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "RailTel IPO updates: Issue subscribed over 42 times - Mint", "description": "The share allocation in RailTel IPO is likely to be finalised on February 23 and listing may happen on February 26, according to brokerages", "url": "https://www.livemint.com/market/ipo/railtel-ipo-subscription-status-allocation-dates-grey-market-premium-11613547126639.html", "urlToImage": "https://images.livemint.com/img/2021/02/17/600x338/railways-kla--621x414@LiveMint_1613547194082.jpg", "publishedAt": "2021-02-18T16:40:33Z", "content": "The IPO of RailTel Corporation of India has attracted strong demand and the issue was fully subscribed in just few hours after it opened on Tuesday. The price range has been fixed at 93-94 per share.… [+3284 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: How the ground is being set for LIC IPO - The Indian Express", "description": "LIC IPO Launch Date, Share Price: While the government is clearing the hurdles before the IPO, one after another, market regulator Sebi has relaxed the norms to make the listing process easier and smooth.", "url": "https://indianexpress.com/article/explained/lic-ipo-progress-date-share-price-listing-sebi-norms-7193819/", "urlToImage": "https://images.indianexpress.com/2021/02/nirmala-4.jpg", "publishedAt": "2021-02-18T07:09:19Z", "content": "Decks are being cleared for the mega listing of Life Insurance Corporation of India (LIC), Indias largest financial institution with assets of over Rs 32 lakh crore. The government is systematically … [+6446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Karunjit Singh", "title": "Explained: Why are petrol, diesel prices rising in India? - The Indian Express", "description": "Petrol and Diesel price today: Retail prices of automobile fuels have reached record highs across the country. Petrol and diesel are taxed heavily in India, and oil price decontrol is a one-way street — the consumer never benefits.", "url": "https://indianexpress.com/article/explained/why-are-petrol-diesel-rising-crude-oil-inflation-modi-govt-7190312/", "urlToImage": "https://images.indianexpress.com/2021/02/petrol-1.jpg", "publishedAt": "2021-02-18T07:03:40Z", "content": "Diesel and petrol prices have hit record highs across the country, with petrol touching Rs 89 per litre in Delhi on Monday, and diesel reaching a new high of Rs 86.30 per litre in Mumbai.The governme… [+7103 chars]"}]}