{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "OilPrice.com"}, "author": "Irina Slav", "title": "Russia Oil Exports To India Soar On Sanctions - OilPrice.com", "description": "Exports of Russian crude oil to India have surged since the start of the month as sanctions bit in, forcing traders in Europe to avoid Russian cargos", "url": "https://oilprice.com/Energy/Crude-Oil/Russia-Oil-Exports-To-India-Soar-On-Sanctions.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-03-18_w8tm5lne4s.jpg", "publishedAt": "2022-03-18T15:00:00Z", "content": "Western sanctions on Russia have…\r\nThe West is hitting Moscow…\r\nThe UAE has taken a…\r\nBy Irina Slav - Mar 18, 2022, 10:00 AM CDTExports of Russian crude oil to India have surged since the start of th… [+1866 chars]"}, {"source": {"id": null, "name": "FXStreet"}, "author": "Sagar Dua", "title": "Gold Price Forecast: XAUUSD under pressure as investors seek safety - FXStreet", "description": "Gold (XAU/USD) witnessed a juggernaut upside move from the recent lows of $1,895.15 on Wednesday. The precious metal bounced sharply after the Federal", "url": "https://www.fxstreet.com/news/gold-price-forecast-xau-usd-awaits-a-pullback-near-1-930-on-a-minor-rebound-in-dxy-202203180012", "urlToImage": "https://editorial.fxstreet.com/images/Markets/Commodities/Metals/Gold/stacked-gold-bars-13094022_Large.jpg", "publishedAt": "2022-03-18T13:33:44Z", "content": "<ul><li>Gold Price is under pressure, despite a souring market mood amid continued tensions in Eastern Europe.</li><li>The Federal Reserve decision had a limited lasting impact on financial markets. … [+2591 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Shiba Inu Price Tumble, While Bitgert Up By 10% - Analytics Insight", "description": "The Bitgert price is currently bullish, but most cryptocurrencies, including Bitcoin, Shiba Inu, and many others, are tumbling. Centcex is among the cryptocurrencies doing well when most coins are tumbling.", "url": "https://www.analyticsinsight.net/shiba-inu-price-tumble-while-bitgert-up-by-10/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/03/shiba-inu-2.jpg", "publishedAt": "2022-03-18T12:50:41Z", "content": "Bitgert (BRISE) has continued to make a strong foothold in the crypto industry. Even when the crypto markets were crashing, Bitgert has been posting impressive growth. In fact, Bitgert price has been… [+2465 chars]"}, {"source": {"id": null, "name": "Finbold.com"}, "author": null, "title": "Just in: Here are the top 10 most-downloaded crypto apps in 2021 - Finbold - Finance in Bold", "description": "Digital assets like Bitcoin, NFTs, and metaverse have emerged as one of the most talked-about technological trends of 2021.", "url": "https://finbold.com/just-in-here-are-the-top-10-most-downloaded-crypto-apps-in-2021/", "urlToImage": "https://finbold.com/wp-content/uploads/2022/03/Just-in-Here-are-the-top-10-most-downloaded-crypto-apps-in-2021.jpg", "publishedAt": "2022-03-18T10:55:07Z", "content": "Digital assets like Bitcoin, non-fungible tokens (NFTs), and metaverse have emerged as one of the most talked-about technological trends of 2021, and this has been reflected by a more than 400% incre… [+2348 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Shiba Inu Could Be Listed on Leading Middle Eastern Exchange - U.Today", "description": "Middle East cryptocurrency exchange Rain is intending to add support for Shiba Inu cryptocurrency", "url": "https://u.today/shiba-inu-could-be-listed-on-leading-middle-eastern-exchange", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-03/13385.jpg", "publishedAt": "2022-03-18T08:49:04Z", "content": "Middle East cryptocurrency exchange Rain has announced that it is considering listing the Shiba Inu cryptocurrency, according to a recent tweet.\r\nRain Financial, the operator of the trading platform,… [+1412 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Rs 2,000 in co-founder's home, no unaccounted cash, assets at any location: What Income Tax sleuths found... - Moneycontrol", "description": "The department is also learned to have conducted similar searches on the offices and residences of another B2B unicorn, Zetwerk, within a day of its searches at Infra.Market", "url": "https://www.moneycontrol.com/news/business/startup/rs-2000-in-co-founders-home-no-unaccounted-cash-assets-at-any-location-what-income-tax-sleuths-found-after-a-3-day-raid-on-infra-marke-8247701.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Startup-1-770x433.jpg", "publishedAt": "2022-03-18T08:00:54Z", "content": "From March 9 to 12, officials from the income tax department raided offices of Infra.Market, one of India's fastest growing unicorns, and the residences of its Mumbai-based founders Souvik Sengupta a… [+4214 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Nine best stocks for your portfolio to secure healthy returns by next Holi - Moneycontrol", "description": "Here are nine picks (mix of largecap, midcap, and smallcap) suggested by the market experts and portfolio managers that can be added to your portfolio to gain healthy returns by next Holi.", "url": "https://www.moneycontrol.com/news/business/markets/nine-best-stocks-for-your-portfolio-to-secure-healthy-returns-by-next-holi-8247921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_527211817-1-770x433.jpg", "publishedAt": "2022-03-18T07:58:46Z", "content": "Despite several risks emerged in the second half, the market has delivered solid returns of 19 percent since last Holi festival though it is still 7.5 percent off its record highs reached in October … [+9150 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "South Indian moviestar Dhanush’s Rolls Royce caught on camera for the first time - CarToq.com", "description": "South Indian actress, Dhanush bought a Rolls Royce Ghost in 2015. Now the luxury car has been caught on camera. It is the Series 2 version of the Ghost which was launched back in 2014. The images of the Ghost are shared on Instagram by Ajay Sharan. Series 2 w…", "url": "https://www.cartoq.com/south-indian-moviestar-dhanushs-rolls-royce-caught-on-camera-for-the-first-time/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/dhanush-rolls-royce-ghost-series-ii.jpg", "publishedAt": "2022-03-18T07:17:29Z", "content": "South Indian actress, Dhanush bought a Rolls Royce Ghost in 2015. Now the luxury car has been caught on camera. It is the Series 2 version of the Ghost which was launched back in 2014. The images of … [+2927 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "How the war in Ukraine has affected automotive supply chains - Moneycontrol", "description": "Existing supply chain issues are likely to exacerbate as the crisis in Ukraine continues", "url": "https://www.moneycontrol.com/news/automobile/how-the-war-in-ukraine-has-affected-automotive-supply-chains-8247241.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/07/India_Auto-cars-770x433.jpg", "publishedAt": "2022-03-18T06:15:44Z", "content": "The Russia-Ukraine conflict has, expectedly, worsened the existing logistical and supply chain issue that has already been plaguing the global automotive industry. Reports from all quarters are point… [+3908 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Tata Motors to soon buy Ford’s Sanand car factory - CarToq.com", "description": "According to ET Auto, Tata Motors and Ford India have submitted a proposal Gujarat Government for transfer of ownership of the Sanand manufacturing plant. The plant belongs to Ford India right now, it was used for manufacturing 2.4 lakh units of vehicles and …", "url": "https://www.cartoq.com/tata-motors-to-soon-buy-fords-sanand-car-factory/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/Fords-plant-taken-by-Tata-featured.jpg", "publishedAt": "2022-03-18T06:10:13Z", "content": "According to ET Auto, Tata Motors and Ford India have submitted a proposal Gujarat Government for transfer of ownership of the Sanand manufacturing plant. The plant belongs to Ford India right now, i… [+2919 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Goh Chiew Tong", "title": "Indian beauty company Nykaa looks to physical retail expansion to meet consumer demand for offline sales - CNBC", "description": "\"A lot of beauty is sold offline and Nykaa has become such a big brand that we cannot ignore our offline channel as well as offline consumers,\" she said.", "url": "https://www.cnbc.com/2022/03/18/indian-beauty-company-nykaa-looks-to-physical-retail-expansion.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107031845-1647496106748-gettyimages-1237476754-AFP_9VC6P4.jpeg?v=1647580159&w=1920&h=1080", "publishedAt": "2022-03-18T05:09:48Z", "content": "While Nykaastarted as an e-commerce platform, founder and CEO Falguni Nayar is a \"big believer\" in physical retail and said there is demand from consumers.\r\n\"The last two years have been very much im… [+2235 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Reuters", "title": "Oil jumps as Russia-Ukraine talks stall - CNBC", "description": "Oil prices extended their rally on Friday at the end of a third volatile week of trade after slim progress in peace talks between Russia and Ukraine.", "url": "https://www.cnbc.com/2022/03/18/oil-markets-russia-ukraine-talks.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106909589-1626106040884-gettyimages-1233942663-CALIFORNIA_OIL.jpeg?v=1647575049&w=1920&h=1080", "publishedAt": "2022-03-18T04:44:18Z", "content": "Oil prices were set for a second straight weekly loss, but found a floor above $100 a barrel on Friday after volatile trading this week with no easy replacement for Russian barrels in sight in a mark… [+1936 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "6 new Maruti Suzuki cars launching in the next 3 months - CarToq.com", "description": "Maruti Suzuki is bringing a slew of cars to the Indian market. The brand has already launched new cars like the new-gen Baleno, WagonR and Dzire CNG. Yet, the largest carmaker in the country is not done. Maruti Suzuki plans to bring in many more models in the…", "url": "https://www.cartoq.com/6-new-maruti-suzuki-cars-launching-in-the-next-3-months/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/upcoming-maruti-cars.jpg", "publishedAt": "2022-03-18T03:16:35Z", "content": "Maruti Suzuki is bringing a slew of cars to the Indian market. The brand has already launched new cars like the new-gen Baleno, WagonR and Dzire CNG. Yet, the largest carmaker in the country is not d… [+3052 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "EU Regulators Warn Crypto Unsuitable as Investment or Means of Payment for Most Retail Consumers – Regulation Bitcoin News - Bitcoin News", "description": "Several European regulators have issued a joint warning on crypto assets. “These assets are not suited for most retail consumers as an investment or as a means of payment or exchange,\" they stressed.", "url": "https://news.bitcoin.com/eu-regulators-warn-crypto-unsuitable-as-investment-or-means-of-payment-for-most-retail-consumers/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/03/eu.jpg", "publishedAt": "2022-03-18T03:03:20Z", "content": "Several European regulators have issued a joint warning on crypto assets. “These assets are not suited for most retail consumers as an investment or as a means of payment or exchange,” they stressed.… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ashutosh Shyam", "title": "Merger of Ashok Leyland group companies may create value - Economic Times", "description": "The merger of Ashok Leyland subsidiary Hinduja Leyland Finance (HLF) with NxtDigital, the media company of the Hinduja Group, is likely to create incremental value for the shareholders of Ashok Leyland. As a result, investor sentiment around the stock of Asho…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/merger-of-ashok-leyland-group-companies-may-create-value/articleshow/90302663.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90302676,width-1070,height-580,imgsize-190192,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-18T02:44:00Z", "content": "ET Intelligence Group: The merger of Ashok Leyland subsidiary Hinduja Leyland Finance (HLF) with NxtDigital, the media company of the Hinduja Group, is likely to create incremental value for the shar… [+1404 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rakesh Jhunjhunwala earns ₹861 crore from these two stocks in one day - Mint", "description": "Rakesh Jhunjhunwala holds 4,52,50,970 Titan Company shares and Titan share price ascended  ₹118.70 on Thursday. So, net rise in Rakesh Jhunjhunwala's net worth is around  ₹537 crore", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-net-worth-rises-rs-861-crore-from-these-two-stocks-in-one-day-11647570936239.html", "urlToImage": "https://images.livemint.com/img/2022/03/18/600x338/5244bf12-7a11-11ec-9eea-9c1e2652c262_1644643836353_1647571092359.jpg", "publishedAt": "2022-03-18T02:42:31Z", "content": "Rakesh Jhunjhunwala portfolio: Amid sharp upside movement on Thursday trade session, ace Indian investor Rakesh Jhunjhunwala's net worth grew around 861 crore after decent rise in his two portfolio s… [+1792 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Maruti Ertiga and Kia Carens interior space and comfort comparison [Video] - CarToq.com", "description": "7-seater SUVs and MPVs are slowly gaining buyers attention in Indian market and manufacturer like Maruti have been selling Ertiga which is a budget MPV in the market for a very long time. It is considered a value for money option and is a popular MPV among bu…", "url": "https://www.cartoq.com/maruti-ertiga-and-kia-carens-interior-space-and-comfort-comparison/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/carens-vs-ertiga-featured.jpg", "publishedAt": "2022-03-18T02:15:52Z", "content": "7-seater SUVs and MPVs are slowly gaining buyers attention in Indian market and manufacturer like Maruti have been selling Ertiga which is a budget MPV in the market for a very long time. It is consi… [+3425 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Why Biden’s idea of digital dollar is good news for cryptocurrency investors in India - Moneycontrol", "description": "A month after India’s union Budget 2022 announced the arrival of a digital Rupee, US President Joe Biden signed an executive order in the US to lay out a national policy for digital assets and a digital dollar.", "url": "https://www.moneycontrol.com/news/business/personal-finance/why-bidens-idea-of-digital-dollar-is-good-news-for-cryptocurrency-investors-in-india-8243361.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/09/Cryptocurrency-Bitcoin-770x433.jpg", "publishedAt": "2022-03-18T01:36:05Z", "content": "On March 9, US President Joe Biden signed an executive order directing various government agencies to address the risks and harness the potential benefits of digital assets, including cryptocurrencie… [+5511 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "What are potential side-effects of a bad credit score? - Moneycontrol", "description": "A bad credit score can reduce your chances of getting a fresh credit line", "url": "https://www.moneycontrol.com/news/business/personal-finance/what-are-potential-side-effects-of-a-bad-credit-score-8244151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Debt-770x433.jpg", "publishedAt": "2022-03-18T01:32:18Z", "content": "Banks, non-banking finance companies (NBFCs) and micro-financiers analyse the credit scores of individuals to ascertain their creditworthiness and attitude towards repaying debt. Credit reports are v… [+3886 chars]"}, {"source": {"id": null, "name": "CryptoGlobe"}, "author": "Francisco Memoria", "title": "Bitcoin ($BTC) Is Likely Going to Keep ‘Outperforming Gold, Stock Market’, Says Bloomberg Analyst - CryptoGlobe", "description": "Bloomberg commodity strategist Mike McGlone has weighed in on Bitcoin’s performance as inflation surges, interest rates rise, and Ukraine deals with a large-scale invasion from Russia. In a tweet shared with his followers on social media, McGlone noted that t…", "url": "https://www.cryptoglobe.com/latest/2022/03/bitcoin-btc-is-likely-going-to-keep-outperforming-gold-stock-market-says-bloomberg-analyst/", "urlToImage": "https://cryptoglobe.s3.eu-west-2.amazonaws.com/2021/09/gold-and-red-bitcoin-on-table-768x576.jpg", "publishedAt": "2022-03-18T01:24:08Z", "content": "Bloomberg commodity strategist Mike McGlone has weighed in on Bitcoins performance as inflation surges, interest rates rise, and Ukraine deals with a large-scale invasion from Russia.\r\nIn a tweet sha… [+2312 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "2022 Toyota Glanza CNG variant launch confirmed - CarToq.com", "description": "Toyota Kirloskar Motor recently launched the 2022 version of Toyota Glanza which is based on the new age Maruti Baleno. With fuel prices likely to go up in the coming times, Toyota is now planning to introduce CNG in their vehicles. The first model to get a f…", "url": "https://www.cartoq.com/2022-toyota-glanza-cng-variant-launch-confirmed/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/glanza-featured.jpg", "publishedAt": "2022-03-18T01:18:45Z", "content": "Toyota Kirloskar Motor recently launched the 2022 version of Toyota Glanza which is based on the new age Maruti Baleno. With fuel prices likely to go up in the coming times, Toyota is now planning to… [+2982 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Mike Novogratz Expects Bitcoin to Hit $500K — Says BTC Is a Great Alternative in Economies With Poor Stewardship – Markets and Prices Bitcoin News - Bitcoin News", "description": "Galaxy Digital CEO Mike Novogratz says bitcoin is a great alternative and a lifeline to people in countries with poor stewardship of the economy. He expects the price of the cryptocurrency to hit $500K.", "url": "https://news.bitcoin.com/mike-novogratz-expects-bitcoin-to-hit-500k-btc-great-alternative-in-economies-with-poor-stewardship/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/03/novogratz.jpg", "publishedAt": "2022-03-18T00:37:05Z", "content": "Galaxy Digital CEO Mike Novogratz says bitcoin is a great alternative and a lifeline to people in countries with poor stewardship of the economy. He expects the price of the cryptocurrency to hit $50… [+3519 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Apoorva Mittal", "title": "Zomato in talks with restaurants, cloud kitchens for 10-minute deliveries - Economic Times", "description": "The company is likely to launch a pilot programme from April in a few cities, with Gurgaon likely being the first, the people said, speaking on the condition of anonymity since the experiment has not yet started.", "url": "https://economictimes.indiatimes.com/tech/startups/zomato-in-talks-with-restaurants-cloud-kitchens-for-10-minute-deliveries/articleshow/90297503.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90310561,width-1070,height-580,imgsize-1387390,overlay-ettech/photo.jpg", "publishedAt": "2022-03-18T00:30:00Z", "content": "Mumbai: Food delivery platform Zomato is in discussions with multiple restaurant partners and cloud kitchen companies to launch ultra-fast delivery, five people directly aware of the talks said.\r\nThe… [+6201 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Tsvetana Paraskova", "title": "The World Could See A Record-Breaking Oil Supply Shock - OilPrice.com", "description": "The IEA warned this week that oil markets could face the largest supply shock in decades as the market could lose around 3 million bpd of supply from Russia", "url": "https://oilprice.com/Energy/Energy-General/The-World-Could-See-A-Record-Breaking-Oil-Supply-Shock.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-03-17_iuqpqlx5sb.jpg", "publishedAt": "2022-03-18T00:00:00Z", "content": "Russias war in Ukraine is…\r\nA major supply-chain disruption may…\r\nHarsh sanctions on Russia could…\r\nBy Tsvetana Paraskova - Mar 17, 2022, 7:00 PM CDTThe global oil market could lose 3 million barrels… [+5826 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft Data Centres To Heat Homes In Finland, Cutting Carbon Emissions - NDTV", "description": "Finnish utility Fortum said on Thursday it will use waste heat from two new Microsoft data centres to warm homes and businesses in and around the capital Helsinki, while also cutting carbon emissions.", "url": "https://www.ndtv.com/world-news/microsoft-data-centres-to-heat-homes-in-finland-cutting-carbon-emissions-2829518", "urlToImage": "https://c.ndtvimg.com/2021-05/kr18cd1g_microsoftafp_625x300_21_May_21.jpg", "publishedAt": "2022-03-17T21:19:11Z", "content": "Fortum said its investment for heat capture side from data centres was estimated at 200 million euros.\r\nOslo: Finnish utility Fortum said on Thursday it will use waste heat from two new Microsoft dat… [+1512 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Zhiyuan Sun", "title": "RBI seemingly wants to ban cryptocurrencies, but not for the reasons you might think - Cointelegraph", "description": "\"Digital assets threaten the financial sovereignty of a country and make it susceptible to strategic manipulation,\" writes the RBI report.", "url": "https://cointelegraph.com/news/rbi-seemingly-wants-to-ban-cryptocurrencies-but-not-for-the-reasons-you-might-think", "urlToImage": "https://images.cointelegraph.com/images/1200_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDMvNDExOWFiMmEtYzMzNS00ODEzLWFlNGItZjI1ZWJmYWUxNGY0LmpwZw==.jpg", "publishedAt": "2022-03-17T20:30:36Z", "content": "On Thursday, the Reserve Bank of India, or RBI, the country's central bank, published a critical bulletin regarding the cryptocurrency industry. While the report praised the innovative distributed le… [+1953 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarita C Singh", "title": "Solar PLI scheme may be split - Economic Times", "description": "The pilot round of the scheme with ₹4,500 crore budgetary allocation was proposed to promote the integration of the process and was awarded to three companies - Reliance New Energy, Shirdi Sai Electricals and Jindal India Solar - that committed module manufac…", "url": "https://economictimes.indiatimes.com/industry/renewables/solar-pli-scheme-may-be-split/articleshow/90299610.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90299713,width-1070,height-580,imgsize-56554,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-17T18:47:00Z", "content": "The 19,500 crore production-linked incentive (PLI) scheme for solar power equipment is likely to be split into two or three buckets to include various companies that are at different levels of indige… [+1243 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "PancakeSwap (CAKE) vs Hedera (HBAR) vs Seesaw Protocol (SSW) - Crypto Investments in March - Analytics Insight", "description": "Hedera (HBAR) and PancakeSwap (CAKE) are two coins that are not in the top 25 on the prominent cryptocurrency listing platform CoinMarketCap that may be worth looking into. In addition to these two initiatives, there is a new release that is causing quite a c…", "url": "https://www.analyticsinsight.net/pancakeswap-cake-vs-hedera-hbar-vs-seesaw-protocol-ssw-crypto-investments-in-march/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/03/PancakeSwap.jpeg", "publishedAt": "2022-03-17T18:33:11Z", "content": "PancakeSwap\r\nSeveral cryptocurrencies, ranging from Bitcoin (BTC) to Curve DAO Token (CRV), experienced both dips and rises throughout the week of March 5th-11th. The volatility of the cryptocurrency… [+3376 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Jaiveer Mehra", "title": "carandbike Awards 2022: Two Wheeler of the Year - Hero XPulse 200 4V - carandbike", "description": "Hero's adventure bike took the crown ahead of the TVS Raider 125.", "url": "https://www.carandbike.com/news/carandbike-awards-2022-two-wheeler-of-the-year-hero-xpulse-200-4v-2829397", "urlToImage": "https://c.ndtvimg.com/2022-03/6jhkghkg_hero-xpulse-200_625x300_17_March_22.jpg", "publishedAt": "2022-03-17T17:55:43Z", "content": "Hero's entry adventure bike the Xpulse 200 4V took home top honours at the carandbike Awards 2022. Not only was the motorcycle adjudged the Adventure Motorcycle of the Year but it also walked away wi… [+1057 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "US dollar hits lowest in week as investors gauge Fed policy, euro firmer - Moneycontrol", "description": "The Fed's monetary policy turned hawkish with its quarter-percentage-point rate increase Wednesday and projection that the federal funds rate would reach a range of 1.75% to 2% by the end of 2022 and 2.8% next year, but the central bank did not deliver a toug…", "url": "https://www.moneycontrol.com/news/business/us-dollar-hits-lowest-in-week-as-investors-gauge-fed-policy-euro-firmer-8246321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Dollar-Bill_AP-770x433.jpg", "publishedAt": "2022-03-17T17:10:22Z", "content": "The United States dollar fell on Thursday and hit its lowest in a week as investors digested the Federal Reserve's monetary policy outlook a day after the U.S. central bank's expected interest rate h… [+2249 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Varinder Singh", "title": "BAYC’s ApeCoin ($APE) Price Falls By 80% On First Day Of Trading - CoinGape", "description": "Bored Ape Yacht Club (BAYC) NFT collection's ApeCoin (APE) native token surged to $40 before falling back to $6.4 after its listing on crypto various crypto exchanges. Currently, the ApeCoin price is fluctuating between $10-$20. The fully diluted volume (FDV)…", "url": "https://coingape.com/bayc-apecoin-ape-price-falls-by-80-percent-first-day/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/03/17194826/unnamed-122.png", "publishedAt": "2022-03-17T16:30:37Z", "content": "Bored Ape Yacht Club (BAYC) NFT collection’s ApeCoin (APE) native token surged to $40 before falling back to $6.4 after its listing on crypto various crypto exchanges. Currently, the ApeCoin price is… [+2754 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Jio Launches New Rs 2878 and Rs 2998 WFH Prepaid Plans, Check Details - TelecomTalk", "description": "The Rs 2878 prepaid plan from Reliance Jio offers customers 2GB of daily data for 365 days. This means, the total amount of data offered by this plan is 730GB.", "url": "https://telecomtalk.info/jio-launches-new-rs-2878-and-rs/505464/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2022/03/jio-launches-new-rs-2878-and-rs.jpeg", "publishedAt": "2022-03-17T16:26:07Z", "content": "Reliance Jio has launched two new work from home (WFH) prepaid plans for users across India. These plans are listed under the Work From Home Data Packs category. The denominations of these two new pl… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: What is Ukraine’s new law on cryptocurrencies? - The Indian Express", "description": "Ukraine's President Volodymyr Zelenskyy has signed a law to legalise cryptocurrencies. What is the law, and why has it been signed now? What are the global experiences in legalising cryptocurrencies?", "url": "https://indianexpress.com/article/explained/ukraine-cryptocurrency-law-regulation-explained-7824014/", "urlToImage": "https://images.indianexpress.com/2022/03/Ukraine-1-16.jpg", "publishedAt": "2022-03-17T16:22:44Z", "content": "Ukraine, which is at war with Russia, has decided to establish a legal framework through which cryptocurrencies can be operated in the country in a regulated ecosystem. The countrys parliament had in… [+4087 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Shark Tank-fame Ashneer Grover says Paytm stock is a `screaming BUY`; netizens reply with hilarious memes - Zee News", "description": "Shark Tank-fame and BharatPe co-founder Ashneer Grover said that Paytm is a screaming buy at the current price of about Rs 600.", "url": "https://zeenews.india.com/companies/shark-tank-fame-ashneer-grover-says-paytm-stock-is-a-screaming-buy-netizens-reply-with-hilarious-memes-2446094.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/03/17/1023648-untitled-design-98.jpg", "publishedAt": "2022-03-17T16:10:17Z", "content": "New Delhi: Shark Tank-fame and BharatPe co-founder Ashneer Grover said that Paytm is a screaming buy at the current price of about Rs 600. Paytm stock had closed todays (March 17), trading session at… [+2346 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dia Rekhi", "title": "An 'India plus' is going to happen in every industry: Tata Sons Chairman N Chandrasekaran - Economic Times", "description": "An India plus is going to happen in every industry,  he said.  I don't want to say an alternative to China but an India plus. And the push will come. It will happen in materials, it is going to happen in chemicals, it is going to happen in electronics, semico…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/an-india-plus-is-going-to-happen-in-every-industry-tata-sons-chairman-n-chandrasekaran/articleshow/90297606.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90297974,width-1070,height-580,imgsize-143680,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-17T15:41:00Z", "content": "Tata Sons Chairman, N Chandrasekaran said that there is going to be an \"India plus\" that is going to happen in every industry while delivering his keynote speech on Thursday in Chennai at United Way … [+3230 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "Ola Electric, RIL Among Four Firms To Win Bids To Make Tesla-Style Gigafactories - BloombergQuint", "description": "The winning bidders will manufacture a total of 50 gigawatt hours of advanced chemistry cells.", "url": "https://www.bloombergquint.com/business/ola-electric-ril-among-four-firms-to-win-bids-to-make-tesla-style-gigafactories", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-11%2F1f8683b1-12a6-454b-a9bd-18e55d9793b9%2FCables_and_lithium_ion_battery_components_sit_on_the_production_line__Photographer_Krisztian_BocsiBl.jpg?rect=0%2C126%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-17T14:07:07Z", "content": "According to the production-linked incentive scheme for battery cells, the selected companies will have to set up their factories within two years. Incentives will be disbursed over a span of five ye… [+974 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Ola S1 Pro price to be hiked post current purchase window - HT Auto", "description": "Ola S1 Pro India price: The purchase window for Ola S1 Pro opens for everyone interested on Friday while those who have reserved a unit have an early bird access.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/ola-s1-pro-price-to-be-hiked-post-current-purchase-window-41647524494453.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/03/17/600x338/Ola_S1_Pro_HT_Auto_5_1636954948381_1647524745820.jpg", "publishedAt": "2022-03-17T13:46:54Z", "content": "Ola S1 Pro has managed to once again sell like hotcakes according to Ola Electric and CEO Bhavish Aggarwal took to Twitter to announce that price for the Ola S1 Pro would be hiked once the current pu… [+1468 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Oyo rejigs top brass amid delay in IPO - Moneycontrol", "description": "The timing is crucial as the company has been delaying its much awaited $1.2-billion initial public offer.", "url": "https://www.moneycontrol.com/news/business/startup/oyo-rejigs-top-brass-amid-delay-in-ipo-8245251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Oyo-1-770x433.jpg", "publishedAt": "2022-03-17T13:43:26Z", "content": "In a major rejig, Softbank-backed Oyo has elevated Ankit Gupta to be the chief executive officer of India, transitioning existing chief executive Rohit Kapoor to the position of company's global mark… [+2896 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Toyota Mirai | India’s first hydrogen fuel cell vehicle is here - Moneycontrol", "description": "The Toyota Mirai has just been launched as a pilot project.", "url": "https://www.moneycontrol.com/news/business/indias-first-hydrogen-fuel-cell-vehicle-is-here-8245151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/Mirai-1-652x435.jpeg", "publishedAt": "2022-03-17T13:21:17Z", "content": "Toyota has launched the Mirai, making it Indias first hydrogen fuel cell EV (FCEV). Union Minister of Road Transport and Highways Nitin Gadkari, who unveiled the sedan, also announced that Toyotas re… [+2390 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Audi A6 Avant e-tron Concept Unveiled With A Jaw-Dropping Design - GaadiWaadi.com", "description": "Audi A6 Avant e-tron Concept is based on the PPE (Premium Platform Electric) architecture jointly developed with Porsche", "url": "https://gaadiwaadi.com/audi-a6-avant-e-tron-concept-unveiled-with-a-jaw-dropping-design/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/03/Audi-A6-e-tron-Avant-Concept.jpg", "publishedAt": "2022-03-17T13:00:08Z", "content": "Audi has unveiled the A6 Avant e-tron concept and is not a one-off display design giving rise to a possible production electric estate in 2024. It is based on the A6 Sportback e-tron concept displaye… [+1900 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Netflix may soon charge you extra for sharing your account password - The Indian Express", "description": "Netflix is testing charging accounts extra money for adding sub-accounts that login from outside the household.", "url": "https://indianexpress.com/article/technology/tech-news-technology/netflix-may-soon-charge-you-extra-for-sharing-your-password-7823947/", "urlToImage": "https://images.indianexpress.com/2022/03/Netflix.jpg", "publishedAt": "2022-03-17T12:52:21Z", "content": "Netflix password sharing is very common, with multiple people sharing the same subscription not just across devices, but also across households. Netflix is adding features like separate user profiles… [+1962 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "BPCL launches voice-based LPG booking, payment facility - Economic Times", "description": "BPCL has launched a voice-based digital payment facility for its cooking gas (LPG) consumers, who do not have smartphones or internet. BPCL said it has partnered UltraCash Technologies Pvt Ltd to offer a voice-based digital payment facility that allows its Bh…", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/bpcl-launches-voice-based-lpg-booking-payment-facility/articleshow/90293289.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90293325,width-1070,height-580,imgsize-67362,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-17T12:27:00Z", "content": "Bharat Petroleum Corporation Ltd (BPCL) on Thursday launched a voice-based digital payment facility for its cooking gas (LPG) consumers, who do not have smartphones or internet. BPCL said it has part… [+2066 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Hyundai Venue Facelift spotted on Indian roads: Launch in July - CarToq.com", "description": "Hyundai India launched its first sub-compact SUV, Venue back in 2019. So, it now needs a mid-cycle refresh to stay competitive in the Indian market. Fortunately, the Korean manufacturer is already working on a facelift version of the Venue. It is slated to la…", "url": "https://www.cartoq.com/hyundai-venue-facelift-spotted-on-indian-roads-launch-in-july/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/venue-facelift-spotted-in-india-featured.jpg", "publishedAt": "2022-03-17T12:05:37Z", "content": "Hyundai India launched its first sub-compact SUV, Venue back in 2019. So, it now needs a mid-cycle refresh to stay competitive in the Indian market. Fortunately, the Korean manufacturer is already wo… [+2924 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Elliot Smith", "title": "Bank of England hikes rates again, adopts dovish tone as Ukraine war adds to inflation concerns - CNBC", "description": "The Bank of England on Thursday raised interest rates for the third consecutive meeting as the Russia-Ukraine conflict is expected to keep inflation higher for longer.", "url": "https://www.cnbc.com/2022/03/17/bank-of-england-hikes-rates-for-third-time-in-a-row.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107011893-1644238689165-gettyimages-1368402214-dk1_6607_5e7cc21d-3daf-4711-bed6-866b4c66f5ae.jpeg?v=1647516792&w=1920&h=1080", "publishedAt": "2022-03-17T12:01:00Z", "content": "LONDON The Bank of England on Thursday raised interest rates for the third consecutive meeting but struck a more dovish tone as the Russia-Ukraine conflict is expected to keep inflation higher for lo… [+4005 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Tata Housing starts sale of plots in 140-acre project near Bengaluru airport - Mint", "description": "The 140-acre site will house residential complexes, commercial institutions, parks, green spaces, clubhouses, and other amenities, according to the official statement.", "url": "https://www.livemint.com/companies/news/tata-housing-starts-sale-of-plots-in-140-acre-project-near-bengaluru-airport-11647514748494.html", "urlToImage": "https://images.livemint.com/img/2018/12/28/600x338/Companies_-_News_1545993790355.jpg", "publishedAt": "2022-03-17T11:30:13Z", "content": "BENGALURU :\r\nTATA Housing has started sale of pre-engineered plots under the name and style Swaram. These plots are located near Bengaluru airport , within the upcoming 140 acres megacity, an officia… [+3650 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikunj Dalmia", "title": "Rising rate cycle may crush overpriced largecaps & new age listings: Shankar Sharma - Economic Times", "description": "“While conventionally smallcaps gets crushed in a rising interest rate cycle, what will get crushed in the Indian market and what will underperform the markets will be the largecaps and the new age listings, not the smallcap stocks. Both the largecaps and new…", "url": "https://economictimes.indiatimes.com/markets/expert-view/rising-rate-cycle-may-crush-overpriced-largecaps-new-age-listings-shankar-sharma/articleshow/90291318.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90291283,width-1070,height-580,imgsize-99237,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T11:08:00Z", "content": "On individual companies in the smallcap space, the worst is over for a number of them. They have made their lows 15-20 days back, says Shankar Sharma, Co-founder, First Global.If we are moving toward… [+6835 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Sensex Today: Sensex surges 1,047 points on firm global cues; Nifty settles at 17,287 | Business - Times of India", "description": "Markets News: Equity indices surged yet again on Thursday with the benchmark BSE sensex rising over 1,000 points led by gains in realty, financial stocks amid posit", "url": "https://timesofindia.indiatimes.com/business/markets/sensex/sensex-surges-1047-points-on-firm-global-cues-nifty-settles-at-17287/articleshow/90289454.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-90290386,width-1070,height-580,imgsize-105142,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-03-17T10:32:00Z", "content": "Sensex surges 1,047 points on firm global cues; Nifty settles at 17,287"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The Pune Techie Who Hears Regularly From Elon Musk - NDTV", "description": "Mr Pathole's follower count on Twitter has surged and he now has over one lakh followers but he says he is not doing it to create clout on social media.", "url": "https://www.ndtv.com/india-news/the-pune-techie-who-hears-regularly-from-elon-musk-2828096", "urlToImage": "https://c.ndtvimg.com/2022-03/hdfsoktg_pranay-pathole_625x300_17_March_22.jpg", "publishedAt": "2022-03-17T10:08:00Z", "content": "Mr Pathole's follower count on Twitter has surged and he now has over one lakh followers.\r\nNew Delhi: A 23-year-old Indian techie, who is in touch with the Twitter-savvy Tesla and SpaceX CEO Elon Mus… [+4055 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "JP Morgan cuts Indian shares to 'underweight', trims target for MSCI EM index - Moneycontrol", "description": "The brokerage, which previously had a \"neutral\" rating on Indian equities, cited a slew of factors, including a weaker rupee and its impact on growth, a spike in prices of commodities such as oil, potential portfolio outflows and the domestic monetary tighten…", "url": "https://www.moneycontrol.com/news/business/markets/jp-morgan-cuts-indian-shares-to-underweight-trims-target-for-msci-em-index-8244271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/05/JPMorgan-770x433.jpg", "publishedAt": "2022-03-17T10:06:33Z", "content": "J.P.Morgan downgraded Indian equities to \"underweight\" and cut its full-year forecast for the MSCI Emerging Markets index, as geopolitical tensions fuel inflation worries, roiling global financial ma… [+1233 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "V K Vijayakumar", "title": "3 reasons why the stock market is rallying in spite of a hawkish Fed - Economic Times", "description": "Even though the correction in Nifty by 15% from the peak had cooled valuations a bit, the recent recovery has again pushed the valuations up. Therefore, investors should prefer value to growth in these times of uncertainty. Preference for value over growth is…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/3-reasons-why-the-stock-market-is-rallying-despite-a-hawkish-fed/articleshow/90286660.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90287483,width-1070,height-580,imgsize-117772,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T08:17:00Z", "content": "Federal Reserves rate hike of 25 basis points was on expected lines, but the projection of another six rate hikes this year to take the rate to 1.75 to 2 per cent by the end of 2022 was not completel… [+2557 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Rohit", "title": "Tata Nexon EV Gets Pricier By Rs 25,000 - CarDekho", "description": "All variants of the electric SUV – including the Dark version – have been subjected to the increment     Prices of all variants have gone up uniformly.    The Nexon EV is now priced between Rs 14.54 lakh and Rs 17.15 lakh.    It’s currently powered by a 30.2k…", "url": "https://www.cardekho.com/india-car-news/tata-nexon-ev-gets-pricier-by-rs-25000-28775.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/28774/1647499536524/GeneralNews.jpg", "publishedAt": "2022-03-17T06:16:00Z", "content": "<ul><li>Prices of all variants have gone up uniformly.\r\n</li><li>The Nexon EV is now priced between Rs 14.54 lakh and Rs 17.15 lakh.\r\n</li><li>Its currently powered by a 30.2kWh battery pack paired w… [+1837 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "2022 Renault Kwid hatchback: New TVC released - CarToq.com", "description": "Renault India recently launched the 2022 Kwid hatchback in India. Renault Kwid was first launched back in 2015 and ever since then it has been a popular choice among small family car buyers. Renault Kwid is actually one of the product that popularised Renault…", "url": "https://www.cartoq.com/2022-renault-kwid-hatchback-new-tvc-released/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/kwid-tvc-featured.jpg", "publishedAt": "2022-03-17T06:15:53Z", "content": "Renault India recently launched the 2022 Kwid hatchback in India. Renault Kwid was first launched back in 2015 and ever since then it has been a popular choice among small family car buyers. Renault … [+3038 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Future Group stocks hit 52-week lows as FRL clarifies on RIL takeover - Business Standard", "description": "Future Retail on Wednesday said that it was committed to taking all actions necessary to seek value \r\n\r\nadjustments and reversal of takeover of stores by the Reliance group.", "url": "https://www.business-standard.com/article/markets/future-group-stocks-hit-52-week-lows-as-frl-clarifies-on-ril-takeover-122031700281_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/18/full/1618743812-5072.jpg", "publishedAt": "2022-03-17T05:07:00Z", "content": "Shares of Kishore Biyani-led Future Group companies tanked up to 19 per cent, hitting respective 52-week lows on the BSE in Thursday’s intra-day trade after Future Retail (FRL) said on Wednesday that… [+3281 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Next-gen Royal Enfield Bullet 350 spied - Team-BHP", "description": "Spy images of what is believed to be the next-generation Royal Enfield Bullet 350 have surfaced online. The 2023 Bullet 350 is expected to be based on the new J-platform, which consists of a double-cradle frame with the engine being a stressed member. The tes…", "url": "https://www.team-bhp.com/news/next-gen-royal-enfield-bullet-350-spied", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2023-royal-enfield-bullet-350-spied-new-gen-first-9-846x1125.jpg", "publishedAt": "2022-03-17T05:01:03Z", "content": "Spy images of what is believed to be the next-generation Royal Enfield Bullet 350 have surfaced online.\r\nThe 2023 Bullet 350 is expected to be based on the new J-platform, which consists of a double-… [+708 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Dave Lee", "title": "Mukesh Ambani corners Jeff Bezos in battle for retail stores in India - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/fd628dfe-1e20-45cf-ba6e-950a11ae9e4c", "urlToImage": null, "publishedAt": "2022-03-17T05:00:09Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Preeti Motiani and Sneha Kulkarni", "title": "These NPS investors can exit from scheme after 5 years lock-in period only - Economic Times", "description": "As per the new regulation inserted in the NPS scheme, certain individuals can close their Tier-I NPS account after they have completed five years with the pension scheme from the date of opening of the account. Do note that this facility of a lower lock-in pe…", "url": "https://economictimes.indiatimes.com/wealth/invest/these-nps-investors-can-exit-from-scheme-after-5-years-lock-in-period-only/articleshow/90219947.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90219946,width-1070,height-580,imgsize-346937,overlay-etwealth/photo.jpg", "publishedAt": "2022-03-17T04:54:00Z", "content": "The Pension Fund Regulatory and Development Authority (PFRDA) has reduced the lock-in period for NPS investments from 10 years to 5 years for self-employed individuals and others not having employer-… [+4263 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "The global fight over semiconductors is about to get even worse - Economic Times", "description": "The dearth of semiconductors has brought some car manufacturing to a halt and delayed shipments of game consoles and smartphones, waking Washington and Brussels up to the fact that their continents are dependent on a handful of regions for the key parts.", "url": "https://economictimes.indiatimes.com/small-biz/trade/exports/insights/the-global-fight-over-chips-is-about-to-get-even-worse/articleshow/90282485.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90282469,width-1070,height-580,imgsize-120898,overlay-etrise/photo.jpg", "publishedAt": "2022-03-17T04:30:00Z", "content": "Magdeburg in former East Germany is famous for its towering gothic cathedral, and not a lot else. Its now about to play a key role in U.S. and European efforts to tilt the global balance of power.\r\nI… [+12189 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Godrej Properties rises 3% after reporting Rs 1,650 cr sales for Noida project - Moneycontrol", "description": "Godrej Properties has sold 855 homes worth Rs 1,650 crore within a year of the launch of Godrej Woods in March 2021", "url": "https://www.moneycontrol.com/news/business/stocks/godrej-properties-rises-3-after-reporting-rs-1650-cr-sales-for-noida-project-8242231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Pune-real-estate-770x433.jpg", "publishedAt": "2022-03-17T04:14:35Z", "content": "Godrej Properties share price rose 3 percent in early trade on March 17 after the company reported sales of Rs 1,650 crore for its Godrej Woods project in Noida.\r\n\"Godrej Properties has sold 855 home… [+799 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Petrol, Diesel Price Today: Fresh Fuel Rates Announced. Check Fuel Rates - News18", "description": "In Delhi, petrol costs Rs 95.41 a litre while the rate of diesel was Rs 86.67 per litre.", "url": "https://www.news18.com/news/business/petrol-diesel-price-today-fresh-fuel-rates-announced-check-fuel-rates-4882448.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-design-5-3-163596211116x9.jpg", "publishedAt": "2022-03-17T03:52:00Z", "content": "Petrol, Diesel Price Today: Petrol price today in India remained unchanged, while diesel price was also kept constant across the nation on the day. Petrol prices in cities such as New Delhi, Kolkata,… [+2952 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "₹10,000 monthly turns to ₹11.98 lakh in 5 years in this mutual fund SIP plan - Mint", "description": "Mutual fund calculator: If an investor had invested  ₹10,000 per month in this mutual fund SIP plan, its  ₹10,000 monthly investment would have grown up to  ₹1.25 lakh in one year", "url": "https://www.livemint.com/money/personal-finance/rs-10-000-monthly-turns-to-rs-11-98-lakh-in-5-years-in-this-mutual-fund-sip-plan-11647487789325.html", "urlToImage": "https://images.livemint.com/img/2022/03/17/600x338/Rupee_Reuters_1624616048749_1647487881452.jpg", "publishedAt": "2022-03-17T03:36:16Z", "content": "Mutual funds SIP (Systematic Investment Plan) is one of the investment tool that helps an investor overcome volatility of the equity markets without bothering about the right time to start. Its compo… [+2364 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gautam Adani's Wealth Jumps By $49 Billion, Higher Than Jeff Bezos, Elon Musk: Report - NDTV Profit", "description": "Gautam Adani, India's and Asia's second-richest person, added $49 billion to his wealth last year - more than the net addition of wealth by the top three global billionaires Elon Musk, Jeff Bezos and Bernard Arnault, the 2022 M3M Hurun Global Rich List said o…", "url": "https://www.ndtv.com/business/adani-adds-49-bn-wealth-in-2021-higher-than-jeff-bezos-elon-musk-2826551", "urlToImage": "https://c.ndtvimg.com/2022-02/eu77sfso_gautam-adani_625x300_08_February_22.jpg", "publishedAt": "2022-03-17T02:52:00Z", "content": "Gautam Adani adds $49 bn wealth in 2021, higher than Jeff Bezos, Elon Musk\r\nNew Delhi: Gautam Adani, India's and Asia's second-richest person, added $49 billion to his wealth last year - more than th… [+2747 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Harshita Singh", "title": "Stocks to Watch: SAIL, Adani Power, Tata Steel, Voltas, Oil India, BEML - Business Standard", "description": "Shares of Oil India will be in focus as the company has approved investment of Rs 6,555 crore in its subsidiary Numaligarh Refinery.", "url": "https://www.business-standard.com/article/markets/stocks-to-watch-sail-adani-power-tata-steel-voltas-oil-india-beml-122031700175_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-01/21/full/1642704764-2511.jpg", "publishedAt": "2022-03-17T02:52:00Z", "content": "The key benchmark indices are likely to see a gap-up open as global markets rally after US Fed's first interest rate hike in three years was announced late night on Wednesday.\r\nAt 8 am, the SGX Nifty… [+5684 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in the news: Paytm, SBI, M&M, IOC, Adani Power and JSW Energy - Economic Times", "description": "Indian Oil Corporation (IOC) has bought as much as 3 million barrels of crude oil that Russia had offered at a steep discount to prevailing international rates, sources said.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-paytm-sbi-mm-ioc-adani-power-and-jsw-energy/articleshow/90280858.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90280885,width-1070,height-580,imgsize-209286,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T02:07:00Z", "content": "Nifty futures on the Singapore Exchange traded 287 points, or 1.69 per cent, higher at 17,294, signaling that Dalal Street was headed for a gap-up start on Thursday. Here are a few stocks which may b… [+2134 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Buzzing Stocks | BEML, Gufic Biosciences, Satin Creditcare Network, others in news today - Moneycontrol", "description": "Stocks In the News: Check out the companies making headlines before the opening bell.", "url": "https://www.moneycontrol.com/news/photos/business/stocks/buzzing-stocks-beml-gufic-biosciences-satin-creditcare-network-others-in-news-today-8240881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/BUZZING-STOCKS-770x433.jpg", "publishedAt": "2022-03-17T01:23:51Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Digbijay Mishra, Sneha Shah", "title": "Trell’s cofounder Pulkit Agarwal sends a fiery note to investors - Economic Times", "description": "ET has reviewed Agarwal’s critical note sent to all investors following the paper’s queries last week to the Bengaluru company on the scope and direction of the EY audit into the firm's financials.", "url": "https://economictimes.indiatimes.com/tech/startups/trells-cofounder-pulkit-agarwal-sends-a-fiery-note-to-investors/articleshow/90276630.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276745,width-1070,height-580/photo.jpg", "publishedAt": "2022-03-17T00:30:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ratna Bhushan", "title": "Boat sets up M&A arm for acquisitions; to build a house of brands - Economic Times", "description": "Imagine Marketing, Boat’s parent company, which filed its draft red herring prospectus with market regulator Securities and Exchange Board of India in January this year to raise Rs 2,000 crore from the public markets, is awaiting approval from the regulator.", "url": "https://economictimes.indiatimes.com/tech/technology/boat-sets-up-ma-arm-for-acquisitions-to-build-a-house-of-brands/articleshow/90276354.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276362,width-1070,height-580/photo.jpg", "publishedAt": "2022-03-17T00:30:00Z", "content": "SynopsisImagine Marketing, Boat’s parent company, which filed its draft red herring prospectus with market regulator Securities and Exchange Board of India in January this year to raise Rs 2,000 cror… [+66 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Rahul Srinivas", "title": "The newest iPhone factory will not be in China - Digital Trends", "description": "Yet another iPhone factory is expected to churn out millions of iPhones. Except, this time around, it's not in China.", "url": "https://www.digitaltrends.com/mobile/iphone-factory-india-pegatron/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/iphone-12-4.jpg", "publishedAt": "2022-03-16T23:19:45Z", "content": "Thanks to the ever-increasing demand for its smartphones, Apple seems to be constantly on the lookout for new facilities to manufacture the iPhone. So far, most of this demand has been met by massive… [+2788 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ketan Thakkar", "title": "Compact SUVs overtake small cars as largest segment in FY22 - Economic Times", "description": "Compact SUVs are set to overtake premium small cars to become the top-selling segment in the Indian passenger car market this fiscal year ending March 31. More than one in every two passenger vehicles sold in the country now is a utility vehicle, driven by th…", "url": "https://economictimes.indiatimes.com/industry/auto/auto-news/compact-suvs-overtake-small-cars-as-largest-segment-in-fy22/articleshow/90276877.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276876,width-1070,height-580,imgsize-597539,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-16T17:19:00Z", "content": "Sport utility vehicles have become the core of the Indian passenger vehicle market, dethroning hatchbacks, the long-standing leaders.\r\nCompact SUVs are set to overtake premium small cars to become th… [+3368 chars]"}]}