{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "G7 Finance Chiefs to Publish Common Rules for State-Issued Digital Currencies This Year – Regulation Bitcoin News - Bitcoin News", "description": "The G7 finance ministers and central bank governors have met and agreed to work towards common principles for state-backed digital currencies and publish their conclusions this year. They said these digital currencies \"could act as both a liquid, safe settlem…", "url": "https://news.bitcoin.com/g7-finance-chiefs-common-rules-state-issued-digital-currencies/", "urlToImage": "https://news.bitcoin.com/wp-content/uploads/2019/09/g7.jpg", "publishedAt": "2021-06-06T16:02:37Z", "content": "The G7 finance ministers and central bank governors have met and agreed to work towards common principles for state-backed digital currencies and publish their conclusions this year. They said these … [+2815 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "1 in 5 electric car owners switching back to petrol cars: Here’s why - CarToq.com", "description": "Electric cars are the future of transportation. Yes, there are few hindrances in terms of charging infrastructure, especially in our country but still, some people are stepping up and buying electric vehicles. However, in the international markets, people are…", "url": "https://www.cartoq.com/1-in-5-electric-car-owners-switching-back-to-petrol-cars-heres-why/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/1-out-of-5-ev-owners-switch-to-ice-featured-1019x530.jpg", "publishedAt": "2021-06-06T15:57:41Z", "content": "Electric cars are the future of transportation. Yes, there are few hindrances in terms of charging infrastructure, especially in our country but still, some people are stepping up and buying electric… [+3376 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dettol to replace logo from handwash packs with Covid protectors image, their stories - Moneycontrol.com", "description": "Under its #DettolSalutes campaign, Reckitt has curated 100 such stories from across India and carried them on its liquid handwash packs in honour of the protectors who have helped numerous people during the pandemic.", "url": "https://www.moneycontrol.com/news/coronavirus/dettol-to-replace-logo-from-handwash-packs-with-covid-protectors-image-their-stories-6994761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/06/Reckitt-Benckiser-1-770x433.jpg", "publishedAt": "2021-06-06T15:31:32Z", "content": "FMCG major Reckitt, which owns popular hygiene brand Dettol, on Sunday said it is replacing its logo on its handwash with the image of Covid protectors along with their inspiring story. Under its #De… [+2943 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Royal Enfield Interceptor beautifully modified into a bobber - CarToq.com", "description": "Royal Enfield motorcycles are some of the most modification friendly motorcycles in the country. Royal Enfield motorcycles are quite popular among motorcyclists around the world for their retro looks. They have a variety of motorcycles in their line up. RE Cl…", "url": "https://www.cartoq.com/royal-enfield-interceptor-modified-bobber/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/RE-bobber-featured-1019x530.jpg", "publishedAt": "2021-06-06T14:33:05Z", "content": "Royal Enfield motorcycles are some of the most modification friendly motorcycles in the country. Royal Enfield motorcycles are quite popular among motorcyclists around the world for their retro looks… [+3045 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Reliance Infra board approves plan to raise Rs 550 crore through preferential issue - Moneycontrol.com", "description": "At the meeting of Board of Directors held on June 6, the proposal of preferential allotment of equity shares to promoters and Värde Investment Partners, LP was approved.", "url": "https://www.moneycontrol.com/news/business/companies/reliance-infra-board-approves-plan-to-raise-rs-550-crore-through-preferential-issue-6994651.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/RELIANCE-INFRASTRUCTURE-770x433.jpg", "publishedAt": "2021-06-06T14:05:44Z", "content": "Reliance Infrastructure Limited (RInfra) would be raising Rs 550 crore through preferential issue, the Anil Ambani-backed company announced on June 6.\r\nAt the meeting of Board of Directors held earli… [+1134 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Maruti Suzuki hints at new SUV to rival Hyundai Creta, Kia Seltos: Details here - Mint", "description": "MSI Executive Director (Marketing and Sales) Shashank Srivastava, during an analyst call, dropped some strong hints towards a possible launch in the mid-size SUV segment", "url": "https://www.livemint.com/auto-news/maruti-suzuki-hints-at-new-suv-to-rival-hyundai-creta-kia-seltos-details-here-11622968013584.html", "urlToImage": "https://images.livemint.com/img/2021/06/06/600x338/brezza1-kCG--621x414@LiveMint_1622987765175.jpg", "publishedAt": "2021-06-06T14:01:29Z", "content": "New Delhi: Maruti Suzuki India has had a successful run with its entry-level SUV, Vitara Brezza. The company has, however, failed to make a mark in the mid-size SUV segment. The current product in th… [+3030 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Average 13 Lakh New Demat Accounts Added Every Month Since April 2020: BSE Data - News18", "description": "Amid near-record rally in the equity markets during the pandemic-ravaged FY21, brokerages have added on an average 13 lakh new demat accounts every month since April last year, taking the overall retail investor headcount to record 6.", "url": "https://www.news18.com/news/business/average-13-lakh-new-demat-accounts-added-every-month-since-april-2020-bse-data-3816584.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/08/1596688466_sensex.jpg", "publishedAt": "2021-06-06T13:20:59Z", "content": "Amid near-record rally in the equity markets during the pandemic-ravaged FY21, brokerages have added on an average 13 lakh new demat accounts every month since April last year, taking the overall ret… [+3849 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Sales Of Recently Launched Cars In May 2021- Safari, Kiger, i20, C5 - GaadiWaadi.com", "description": "Hyundai Creta had its second-generation launched last year and it was the highest sold passenger car in the country in May 2021", "url": "https://gaadiwaadi.com/sales-of-recently-launched-cars-in-may-2021-safari-kiger-i20-c5/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/06/renault-kiger-1-3.jpg", "publishedAt": "2021-06-06T11:30:07Z", "content": "Here we have a whole list of recently launched cars and their sales performance in the month of May 2021. The second-generation Hyundai Creta, launched in early 2020, was the most sold passenger vehi… [+2855 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "DHFL Q4 results: Firm back in black, posts ₹96.75 cr profit - Mint", "description": "Total revenue from operations for the March quarter last fiscal slipped down to  ₹2,034.53 crore.For the full fiscal ended March 31, 2021, DHFL reported a consolidated net loss of  ₹15,051.17 crore", "url": "https://www.livemint.com/companies/company-results/dhfl-q4-results-firm-back-in-black-posts-rs-96-75-cr-profit-11622975609945.html", "urlToImage": "https://images.livemint.com/img/2021/06/06/600x338/3ba95860-5b38-11eb-a466-8e86b70109f9_1613634831580_1622975827820.jpg", "publishedAt": "2021-06-06T11:27:56Z", "content": "Dewan Housing Finance Corporation Limited (DHFL) has reported a consolidated net profit of 96.75 crore for the quarter ended March 31, 2021. The housing finance company had posted a consolidated loss… [+2178 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Skilled driver + 4X4 Mahindra Thar is a potent combination: Proof - CarToq.com", "description": "Mahindra Thar is one of the most popular 4×4 SUV in the market currently. It was launched in the market last year and it quickly became popular for its looks, features and off-road capabilities. Demand for Thar is rising and currently there is a waiting perio…", "url": "https://www.cartoq.com/skilled-driver-4x4-mahindra-thar/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/mahindra-thar-off-road-featured.jpg", "publishedAt": "2021-06-06T10:05:40Z", "content": "Mahindra Thar is one of the most popular 4×4 SUV in the market currently. It was launched in the market last year and it quickly became popular for its looks, features and off-road capabilities. Dema… [+2876 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Milan Vaishnav CMT MSTA", "title": "Trade setup: Stiff resistance to Nifty at 15,700-15,800 levels - Economic Times", "description": "From now on, while chasing the momentum, trailing stop losses and protection of profits at current and higher levels will be a must, says Milan Vaishnav.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/trade-set-up-stiff-resistance-to-nifty-at-15700-15800-levels/articleshow/83280470.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83280461,width-1070,height-580,imgsize-132855,overlay-etmarkets/photo.jpg", "publishedAt": "2021-06-06T10:04:00Z", "content": "It was yet another day of a range-bound move by the Indian markets on Friday as the Nifty oscillated in a tight range before ending with minor losses. The markets saw a quiet start to trade on the ex… [+1325 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "HDFC commits Rs 40 crore for COVID-19 relief during second wave - Moneycontrol", "description": "The COVID-19 initiatives are being undertaken through its philanthropic arm the HT Parekh Foundation, HDFC Ltd said in a statement.", "url": "https://www.moneycontrol.com/news/business/hdfc-commits-rs-40-crore-for-covid-19-relief-during-second-wave-6994341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/HDFC-770x433.jpg", "publishedAt": "2021-06-06T09:22:08Z", "content": "As part of its corporate social responsibility (CSR) initiative, HDFC Ltd has committed an initial amount of Rs 40 crore this year for COVID-19 support and pledged to increase this commitment over th… [+1174 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Elon Musk threatened by hacker group Anonymous in a new video - India Today", "description": "The renowned hacker group has claimed that the Tesla CEO's quest to save the world is more rooted in a superiority and saviour complex than actual concern for humanity.", "url": "https://www.indiatoday.in/technology/news/story/elon-musk-threatened-by-hacker-group-anonymous-in-a-new-video-1811526-2021-06-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202106/Anonymous_vs_Musk-647x363.png?knt8J02GIVoTLKOnCXiNdqroJdMX_Evg", "publishedAt": "2021-06-06T09:15:16Z", "content": "Elon Musk has become the latest target for the renowned hacker group Anonymous. In a new video elaborating on his wrongdoings, Anonymous has sent warning shots to the Tesla CEO, blaming him for destr… [+3353 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Petrol crosses Rs 95 a litre in Delhi, above Rs 100 mark in six states - Times of India", "description": "India Business News: Petrol price on Sunday crossed Rs 95 a litre in Delhi and diesel breached Rs 86 per litre mark for the first time ever as fuel prices were hiked again", "url": "https://timesofindia.indiatimes.com/business/india-business/petrol-crosses-rs-95-a-litre-in-delhi-above-rs-100-mark-in-six-states/articleshow/83279935.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83279952,width-1070,height-580,imgsize-31492,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-06-06T09:10:00Z", "content": "Petrol crosses Rs 95 a litre in Delhi, above Rs 100 mark in six states"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "The editorial board", "title": "The obstacles in the way of Big Four globalisation - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/32c9277c-0bed-4d0e-aca1-0ef417a2bb15", "urlToImage": null, "publishedAt": "2021-06-06T09:00:19Z", "content": "Let our global subject matter experts broaden your perspective with timely insights and opinions you\r\ncant find anywhere else."}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Shyam Metalics' Rs 1,107 crore IPO to open on June 14 - Moneycontrol.com", "description": "The IPO comprises fresh issuance of equity shares worth up to Rs 657 crore and an offer-for-sale (OFS) to the tune of Rs 450 crore by existing shareholders, according to the draft red herring prospectus.", "url": "https://www.moneycontrol.com/news/business/ipo/shyam-metalics-rs-1107-crore-ipo-to-open-on-june-14-6994251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/IPO-770x433.png", "publishedAt": "2021-06-06T08:41:56Z", "content": "The Rs 1,107-crore initial share-sale of Shyam Metalics and Energy will open on June 14, merchant banking sources said on Saturday.\r\nThe three-day initial public offer (IPO) will close on June 16 and… [+1623 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Swaraj Singh Dhanjal", "title": "Kedaara Capital-backed Vijaya Diagnostic files IPO papers - Mint", "description": "The IPO will see the investor and the promoters collectively dilute 35% stake in Vijaya Diagnostic Centre, with Kedaara alone diluting 30% stake", "url": "https://www.livemint.com/companies/news/kedaara-capital-backed-vijaya-diagnostic-files-ipo-papers-11622965932047.html", "urlToImage": "https://images.livemint.com/img/2021/06/06/600x338/bond-kX6G--621x414@LiveMint_1622966641434.jpg", "publishedAt": "2021-06-06T08:06:58Z", "content": "MUMBAI :\r\nHomegrown private equity firm Kedaara Capital-backed diagnostic chain Vijaya Diagnostic Centre Ltd has filed the draft red herring prospectus for its initial public offering (IPO), in a mov… [+1497 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "‘TecHalli’ a good alternative to 'Silicon Valley' Bengaluru? Anand Mahindra thinks so - The News Minute", "description": "Mahindra group chairman Anand Mahindra and Infosys co-founder Nandan Nilekani have zeroed in on 'TecHalli' as the new title for Bengaluru, a day after Mahindra asked Twitterati to suggest a new title for the tech city, instead of calling it the ‘Silicon Valle…", "url": "https://www.thenewsminute.com/article/techalli-good-alternative-silicon-valley-bengaluru-anand-mahindra-thinks-so-150190", "urlToImage": "https://www.thenewsminute.com/sites/default/files/nandannilekan_AnandMahendra_Facebook_6062021_1200-1.jpg", "publishedAt": "2021-06-06T07:37:40Z", "content": "Mahindra group chairman Anand Mahindra had done a Twitter crowdsourcing for a new title for Bengaluru, instead of calling it the Silicon Valley of India'.Mahindra group chairman Anand Mahindra and In… [+3599 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Ford Endeavour SUV with numerous modifications looks menacing - CarToq.com", "description": "Ford Endeavour is one of the most popular full size SUV on sale in India. It is currently the flagship SUV from Ford in India and it has been in the market for quite some time. The SUV competes with cars like Toyota Fortuner, MG Gloster and Isuzu MU-X in the …", "url": "https://www.cartoq.com/ford-endeavour-suv-numerous-modifications/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/ford-endeavour-butch.jpg", "publishedAt": "2021-06-06T07:16:16Z", "content": "Ford Endeavour is one of the most popular full size SUV on sale in India. It is currently the flagship SUV from Ford in India and it has been in the market for quite some time. The SUV competes with … [+3032 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "FPIs invest Rs 80 billion in Indian markets in just four trading sessions - Business Standard", "description": "The inflow comes following a net withdrawal of Rs 2,954 crore in May and Rs 9,659 crore in April, data with depositories showed", "url": "https://www.business-standard.com/article/economy-policy/fpis-invest-rs-80-billion-in-indian-markets-in-just-four-trading-sessions-121060600222_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/21/full/1618951751-4832.jpg", "publishedAt": "2021-06-06T06:24:00Z", "content": "Foreign investors have infused close to Rs 8,000 crore into Indian equities in the first four trading sessions of June as risk-on sentiment improved amid rapidly falling new Covid cases and robust co… [+3484 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Seven of top-10 most valued firms add over Rs 1.15 lakh crore to m-cap; RIL lead gainer - Moneycontrol", "description": "Reliance Industries, HDFC Bank, Hindustan Unilever, HDFC, State Bank of India, Bajaj Finance and Kotak Mahindra Bank witnessed rise in their valuation.", "url": "https://www.moneycontrol.com/news/business/seven-of-top-10-most-valued-firms-add-over-rs-1-15-lakh-crore-to-m-cap-ril-lead-gainer-6993961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/BSE_Sensex_Stocks_market-630x420.png", "publishedAt": "2021-06-06T06:15:45Z", "content": "Seven of the top-10 most valued companies together added Rs 1,15,898.82 crore in market valuation last week, with Reliance Industries grabbing the top spot.\r\nLast week, the 30-share BSE Sensex jumped… [+1399 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "Manipal Hospitals to offer Sputnik V in Bengaluru towards end of June - The News Minute", "description": "Bengaluru-headquartered hospital chain Manipal Hospitals, on June 6, announced that it has extended its COVID-19 vaccine portfolio with the addition of Sputnik V. With this, Manipal said the Russian-made vaccine will be available in the city towards the secon…", "url": "https://www.thenewsminute.com/article/manipal-hospitals-offer-sputnik-v-bengaluru-towards-end-june-150184", "urlToImage": "https://www.thenewsminute.com/sites/default/files/SputnikV_SecondBatch_Twitter_16052021_1200.jpg", "publishedAt": "2021-06-06T06:03:17Z", "content": "The rollout of the Sputnik V vaccine by Manipal Hospitals in Bengaluru is part of the limited pilot launch initiated by Dr Reddys in Hyderabad last month.Bengaluru-headquartered hospital chain Manipa… [+2038 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Volkswagen Polo Comfortline TSI AT – 5 Things You Should Know - GaadiWaadi.com", "description": "Volkswagen Polo recently got a new variant, and here, we have discussed everything you should know about it", "url": "https://gaadiwaadi.com/volkswagen-polo-comfortline-tsi-at-5-things-you-should-know/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/04/Volkswagen-Polo.jpg", "publishedAt": "2021-06-06T05:30:26Z", "content": "Volkswagen recently added a new variant to the Polo hatchback range Comfortline TSI AT. This new model is now the most affordable automatic variant in the Polo range, which is great news for buyers o… [+2028 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "Hold crypto assets? Here's how you are going to pay income-tax on it - Economic Times", "description": "Indias tax authorities have not yet categorized returns from cryptocurrencies under any specific bracket and there have been no judicial precedents in this regard.", "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/hold-crypto-assets-heres-how-you-are-going-to-pay-income-tax-on-it/articleshow/83277122.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83277325,width-1070,height-580,imgsize-160474,overlay-etmarkets/photo.jpg", "publishedAt": "2021-06-06T05:30:00Z", "content": "A cryptocurrency is a decentralised digital asset and a medium of exchange. Bitcoin was the worlds first crypto currency launched in 2009. It was created by a software developer under the pseudonym S… [+6228 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Kylie Quinn", "title": "This is how long it takes for Covid vaccines to start working - ThePrint", "description": "The first dose of a Covid vaccine gets your immune response going, but the second dose is essential to ensure immunity is strong, and long-lasting.", "url": "https://theprint.in/health/this-is-how-long-it-takes-for-covid-vaccines-to-start-working/671659/", "urlToImage": "https://theprint.in/wp-content/uploads/2021/06/372145901-scaled-e1622791516404.jpg", "publishedAt": "2021-06-06T05:15:00Z", "content": "Amid Victorias worrying COVID outbreak, perhaps the point of greatest concern is the fact the virus has again found its way into aged care.\r\nOn Sunday, the state government announced an aged-care wor… [+7058 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Labour codes on the cards: Companies' PF liability to go up, workers to see reduction in take-home pay - Moneycontrol", "description": "The ministry had even finalised the rules under the four codes. But these could not be implemented because many states were not in a position to notify rules under these codes in their jurisdiction.", "url": "https://www.moneycontrol.com/news/business/labour-codes-on-the-cards-companies-pf-liability-to-go-up-workers-to-see-reduction-in-take-home-pay-6993831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/CHILD-LABOUR-770x433.jpg", "publishedAt": "2021-06-06T05:11:15Z", "content": "The four labour codes are likely to see the light of day in a couple of months as the Centre is now keen to go ahead with the implementation of these laws, which among others will result in reduction… [+2622 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Franklin Templeton unitholders to get Rs 3,205 crore in fourth tranche - Moneycontrol", "description": "With this, the total disbursement will reach Rs 17,778 crore, amounting to 71 per cent of assets under management (AUM) as on April 23, 2020, a Franklin Templeton MF spokesperson said on Saturday.", "url": "https://www.moneycontrol.com/news/business/franklin-templeton-unitholders-to-get-rs-3205-crore-in-fourth-tranche-6993721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Franklin-Templeton-Investments-580x435.jpg", "publishedAt": "2021-06-06T04:41:04Z", "content": "SBI Funds Management (SBI MF) will distribute the fourth tranche of Rs 3,205 crore to unitholders of Franklin Templeton Mutual Fund's six shuttered schemes during the week beginning Monday.\r\nWith thi… [+1907 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus live updates | Phase II clinical trial of Niclosamide drug begins - The Hindu", "description": "India continues to record the highest number of new cases in the world with 1,37,947 average daily infections on June 4.", "url": "https://www.thehindu.com/news/national/coronavirus-live-june-6-2021-updates/article34743111.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/oge1vb/article34743126.ece/ALTERNATES/LANDSCAPE_615/6751562021162237420VACCINATIONDRIVEFARMERSSGR05062021JPG", "publishedAt": "2021-06-06T04:30:00Z", "content": "The seven-day rolling average of daily vaccinations in India stood at 25.98 lakh on June 4, which is more than the 18.1 lakh recorded a month ago.\r\nAbout 19.5% of adults in India, 40.1% of those aged… [+8919 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "This state in north India aims to be a hub for manufacturing electric vehicles - HT Auto", "description": "To ensure that the adoption of electric vehicles is smoother, the state will also focus on building charging infrastructure.", "url": "https://auto.hindustantimes.com/auto/news/haryana-to-devise-policy-to-manufacture-electric-vehicles-minister-41622951781934.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/06/06/600x338/2021-05-05T164743Z_974700623_RC2S9N9ZBJ8F_RTRMADP_3_ITALY-CLIMATE-MINISTER_1621329101701_1622953622515.JPG", "publishedAt": "2021-06-06T04:28:27Z", "content": "The government of Haryana will formulate a policy to manufacture electric vehicles in the state and convert vehicles running on internal combustion engines into battery-powered ones, the state deputy… [+1532 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Goa and Kerala to deploy a fleet of more than 30,000 electric vehicles - HT Auto", "description": "Besides deploying fleet of electric two and three-wheelers, the EV charging infrastructure too will be developed under these agreements.", "url": "https://auto.hindustantimes.com/auto/news/goa-and-kerala-to-deploy-a-fleet-of-more-than-30-000-electric-vehicles-41622952273398.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/06/06/600x338/TVS_iQube_Electric_Scooter_launched_in_New_Delhi_1612432816791_1612432826535_1622953314468.jpg", "publishedAt": "2021-06-06T04:22:42Z", "content": "Goa and Kerala governments have entered into agreements with Convergence Energy Services Limited (CESL), a wholly-owned subsidiary of Energy Efficiency Services Limited (EESL), to procure more than 3… [+1929 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Thousands descend on Miami to glorify Bitcoin - Moneycontrol.com", "description": "At least 12,000 people descended on Miami to make up for the lost time, flocking to the largest Bitcoin conference in the world and the first major in-person business conference since the pandemic began.", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/thousands-descend-on-miami-to-glorify-bitcoin-6993261.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/RTXCV3BM-770x433.jpg", "publishedAt": "2021-06-06T02:31:44Z", "content": "There was money in the air. Buzzwords floated around, like NFT, BTD, blockchain, token. There was a frenzied energy.\r\nAnd there was heat a humid, sticky South Florida heat; the kind all the Californi… [+8589 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Passenger Tries To Break Into Cockpit On US Flight - NDTV", "description": "A passenger on a US airplane tried to smash his way into the cockpit until another traveler and members of the air crew tackled him and pinned him down, witnesses said.", "url": "https://www.ndtv.com/world-news/delta-air-flight-diverted-to-new-mexico-after-passenger-tries-to-break-into-cockpit-2457370", "urlToImage": "https://c.ndtvimg.com/2020-12/vl82rg2g_delta-air-lines_625x300_22_December_20.jpg", "publishedAt": "2021-06-06T02:10:35Z", "content": "Delta expressed \"thanks to the crew and passengers of Delta Flight 386. (Representational)\r\nLos Angeles, United States: A passenger on a US airplane tried to smash his way into the cockpit until anot… [+1244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "8th month in row GST mop-up tops Rs 1 lakh cr; lockdown impact muted - The Indian Express", "description": "At Rs 1.02 lakh crore, GST collection is lower than April’s record collections of Rs 1,41,314 crore, but still high despite most states imposing strict restrictions to break the chain of transmission of the infection.", "url": "https://indianexpress.com/article/business/gst-collection-covid-lockdown-indian-economy-7345932/", "urlToImage": "https://images.indianexpress.com/2021/06/Kochi.jpg", "publishedAt": "2021-06-06T01:16:45Z", "content": "Indicating a lower-than-expected impact of localised lockdowns in the second wave of the Covid-19pandemic, gross GST (Goods and Services Tax) collections in May (for sales in April) topped Rs 1 lakh … [+2682 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "Mandy Williams", "title": "Revolutionary: El Salvador On Its Way To Adopt Bitcoin As a Legal Tender - CryptoPotato", "description": "El Salvador is on its way to becoming the first country in the world to adopt bitcoin as both a reserve asset and a legal tender.", "url": "https://cryptopotato.com/revolutionary-el-salvador-on-its-way-to-adopt-bitcoin-as-a-legal-tender/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2021/06/el-salvador-btc.jpg", "publishedAt": "2021-06-05T22:55:05Z", "content": "Mandy Williams is a freelance writer and a crypto fanatic. Mandy believes in the disrupting power of cryptocurrencies and blockchain technology; hence she's on a mission to help spread the good news … [+113 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "The Hindu BusinessLine", "title": "Movers & Shakers: Stocks that will see action this week - BusinessLine", "description": "ONGC (₹125.4)Hits fresh 52-week highThe stock of Oil &amp;amp; Natural Gas Corporation (ONGC) established an uptrend in November last year from about ₹65 and rallied to mark a high of ₹122.3 in early", "url": "https://www.thehindubusinessline.com/portfolio/technical-analysis/movers-shakers-stocks-that-will-see-action-this-week/article34741584.ece", "urlToImage": "https://www.thehindubusinessline.com/static/theme/default/base/img/og-image.jpg", "publishedAt": "2021-06-05T18:45:08Z", "content": "ONGC (125.4)\r\nHits fresh 52-week high\r\nThe stock of Oil &amp; Natural Gas Corporation (ONGC) established an uptrend in November last year from about 65 and rallied to mark a high of 122.3 in early Ma… [+3928 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Jack Dorsey's Square to Construct Solar-Powered Bitcoin Mining Facility in Partnership with - U.Today", "description": "Square and Blockstream are building a solar-powered Bitcoin mining facility in the U.S.", "url": "https://u.today/jack-dorseys-square-to-construct-solar-powered-bitcoin-mining-facility-in-partnership-with", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2021-06/AdobeStock_141930763.jpeg", "publishedAt": "2021-06-05T17:21:14Z", "content": "Bitcoin technology company Blockstream has partnered with Jack Dorsey's payments company Square to construct a solar-powered Bitcoin mining facility, according to June 5 press release.\r\nThe aim of th… [+984 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Isuzu released new TVC for V-Cross & Hi-Lander pick-up trucks - CarToq.com", "description": "Isuzu launched the 2021 Bs6 version of their popular pick-up truck V-Cross in the market recently. Isuzu is the only brand in Indian market that has successfully sold pick-up trucks in our market. Several Indian manufacturers did try the same in the past but …", "url": "https://www.cartoq.com/isuzu-new-tvc-v-cross-hi-lander-pick-up-trucks/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Isuzu-V-Cross-launched-featured-1019x530.jpg", "publishedAt": "2021-06-05T15:52:18Z", "content": "Isuzu launched the 2021 Bs6 version of their popular pick-up truck V-Cross in the market recently. Isuzu is the only brand in Indian market that has successfully sold pick-up trucks in our market. Se… [+2995 chars]"}, {"source": {"id": null, "name": "Ambcrypto.com"}, "author": "Lavina Daryanani", "title": "Dogecoin v. Bitcoin: One of these will literally go to the moon - AMBCrypto News", "description": "It takes years of planning and training to send an astronaut to the moon, but these days, moon-talks have become quite routine on Twitter. In fact, the same has become a race of sorts of late. It has been a while since the DOGE community was hyped that they’r…", "url": "https://ambcrypto.com/dogecoin-v-bitcoin-one-of-these-will-literally-go-to-the-moon/", "urlToImage": "https://ambcrypto.s3.amazonaws.com/wp-content/uploads/2021/06/05174354/Webp.net-resizeimage-1-14-1000x600.jpg", "publishedAt": "2021-06-05T15:31:11Z", "content": "It takes years of planning and training to send an astronaut to the moon, but these days, moon-talks have become quite routine on Twitter. In fact, the same has become a race of sorts of late.\r\nIt ha… [+3232 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "BS Web Team", "title": "IndiGo Q4: Loss widens to Rs 1,147 cr as higher fuel costs, virus hit biz - Business Standard", "description": "The country's largest airline's revenue from operations fell 25 per cent to Rs 6,223 crore as compared to Rs 8,299 crore in the corresponding quarter of the last year", "url": "https://www.business-standard.com/article/companies/indigo-q4-results-loss-widens-to-rs-1-147-cr-as-fuel-costs-virus-hit-biz-121060500967_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-06/05/full/1622905228-5238.jpg", "publishedAt": "2021-06-05T15:00:00Z", "content": "Budget carrier IndiGo on Saturday reported consolidated net loss of Rs 1,147 crore for the March quarter (Q4FY21) as higher fuel costs and coronavirus-related disruptions weighed on the earnings. It … [+4170 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Home delivery of food important model for future, says ITC Hotels - Moneycontrol", "description": "Various restrictions to combat the Covid-19 has encouraged luxury hotels to introduce home delivery in tie-upwith food delivery platforms.", "url": "https://www.moneycontrol.com/news/business/home-delivery-of-food-important-model-for-future-says-itc-hotels-6992761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/ITC-Hotels-544x435.jpg", "publishedAt": "2021-06-05T14:54:26Z", "content": "ITC Hotels on Saturday launched a curated \"Feel-Good\" menu of food items on the World Environment Day aiming at sustainability of local producers,and asserted that home delivery will continue to be a… [+784 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Our Bureau", "title": "Va Tech Wabag posts strong profit both in Q4 and full year of FY21 - BusinessLine", "description": "Va Tech Wabag, a leading player in water technology space, has reported a 57 per cent increase in its consolidated Profit After Tax (PAT) at ₹47 crore for the quarter ended March 31, 2021 compared wit", "url": "https://www.thehindubusinessline.com/companies/va-tech-wabag-posts-strong-profit-both-in-q4-and-full-year-of-fy21/article34739805.ece", "urlToImage": "https://www.thehindubusinessline.com/companies/d6myer/article34739804.ece/ALTERNATES/LANDSCAPE_615/PAT5", "publishedAt": "2021-06-05T14:48:55Z", "content": "Va Tech Wabag, a leading player in water technology space, has reported a 57 per cent increase in its consolidated Profit After Tax (PAT) at 47 crore for the quarter ended March 31, 2021 compared wit… [+771 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Ashwin Ramarathinam", "title": "Crisil says two-third of its rated mid-sized companies eligible for restructuring 2.0 - Mint", "description": "The apex bank on Friday announced a slew of measures aimed at mitigating the pandemic’s impact, raising the aggregate debt threshold for struggling businesses", "url": "https://www.livemint.com/companies/news/crisil-says-two-third-of-its-rated-mid-sized-companies-eligible-for-restructuring-20-11622903380905.html", "urlToImage": "https://images.livemint.com/img/2021/06/05/600x338/crisil-krAG--621x414@LiveMint_1622903719043.jpg", "publishedAt": "2021-06-05T14:36:48Z", "content": "Mumbai: Almost two-third of Crisil-rated mid-sized companies will be eligible for the restructuring window offered under the resolution framework 2.0 announced by the Reserve Bank of India (RBI) for … [+2625 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Tesla Model 3 To Launch In India By 2021-End, Testing To Begin Soon - GaadiWaadi.com", "description": "Tesla is planning to import a few units of the Model 3 for testing in India soon, and launch is expected to happen before the end of this year", "url": "https://gaadiwaadi.com/tesla-model-3-to-launch-in-india-by-2021-end-testing-to-begin-soon/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/10/2021-Tesla-Model-3-feature.jpg", "publishedAt": "2021-06-05T14:00:47Z", "content": "American EV manufacturer Tesla is taking some concrete steps for its entry into the Indian market. According to a recent report by CNBC TV18, the manufacturer is planning to import a few units of the… [+1902 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Charanpreet Singh (With Inputs From PTI)", "title": "Madras High Court Allows Production At Renault-Nissan’s Chennai Plant - carandbike", "description": "The Madras High Court has directed the automakers to address the issues flagged by the state government regarding the safety of workmen with respect to the COVID-19.", "url": "https://www.carandbike.com/news/madras-high-court-allows-production-at-renault-nissan-s-chennai-plant-2457160", "urlToImage": "https://c.ndtvimg.com/2021-05/pios1s3_renaultnissan_650x400_31_May_21.png", "publishedAt": "2021-06-05T13:34:40Z", "content": "The Madras High Court has allowed Renault-Nissan to continue production at its manufacturing plant near Oragadam in Tamil Nadu. As reported by PTI, the court's nod came after a week-long tussle betwe… [+3082 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Bank of India posts Rs 250 crore profit in Q4 - Moneycontrol.com", "description": "The Capital Adequacy Ratio improved to 14.93 percent in March 2021 from 13.10 percent in March 2020. The common equity tier (CET-1) ratio stood at 11.51 per cent.", "url": "https://www.moneycontrol.com/news/business/earnings/bank-of-india-posts-rs-250-crore-profit-in-q4-6992431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/12/BOI-770x433.jpg", "publishedAt": "2021-06-05T13:31:58Z", "content": "State-owned Bank of India reported a standalone profit after tax of Rs 250 crore for March quarter 2020-21 as bad loans shrunk. The lender had incurred a standalone loss of Rs 3,571 crore in the year… [+1814 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Highest discount in gold prices in India in 9 months. Know why - Hindustan Times", "description": "Dealers however complained that jewellers were not placing orders despite the discounts and were just inquiring as states gear up to ease lockdown restrictions.", "url": "https://www.hindustantimes.com/business/highest-discount-in-gold-prices-in-india-in-9-months-know-why-101622898956153.html", "urlToImage": "https://images.hindustantimes.com/img/2021/06/05/1600x900/367984202_0-10_1618317696077_1622899150423.jpg", "publishedAt": "2021-06-05T13:21:07Z", "content": "Gold dealers in India offered the biggest discount this week as Covid-19 restrictions continue to hamper consumption across the country. Low demand in local markets and a price correction overseas ha… [+1496 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Trisha Sengupta", "title": "World Environment Day 2021: Ratan Tata's post on creating a better 'Indian environment’ goes viral - Hindustan Times", "description": "Ratan Tata's post on World Environment Day 2021 has won people over. | Trending", "url": "https://www.hindustantimes.com/trending/world-environment-day-2021-ratan-tata-s-post-on-creating-a-better-indian-environment-goes-viral-101622896667285.html", "urlToImage": "https://images.hindustantimes.com/img/2021/06/05/1600x900/ratan-tata-addresses-at-an-event_312105e0-21a6-11ea-b71b-55a416c89533_1622897595970.jpg", "publishedAt": "2021-06-05T12:56:29Z", "content": "Tata Group's Chairman emeritus Ratan Tata on the occasion of the World Environment Day took to Instagram to share a post expressing how everyone should pledge to create a better Indian environment. H… [+861 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Bank of Baroda board gives nod to setting off Rs 11,048 cr loss against share premium account - Economic Times", "description": "The Board of Directors of the bank has approved the proposal on June 5, 2021, Bank of Baroda said in a regulatory filing.", "url": "https://economictimes.indiatimes.com/markets/companies/bob-board-approves-setting-off-rs-11048cr-losses-against-share-premium-account/articleshow/83261400.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83261382,width-1070,height-580,imgsize-172806,overlay-etmarkets/photo.jpg", "publishedAt": "2021-06-05T12:42:00Z", "content": "NEW DELHI: State-run has received board approval to set off accumulated loss of over Rs 11,048 crore against the share premium account of the bank.\r\nThe Board of Directors of the bank has approved th… [+819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "IndusInd Bank to raise climate financing to 3.5% in 2 years - Economic Times", "description": "The bank has committed to reducing its specific carbon emission by 50 per cent over the next four years.", "url": "https://economictimes.indiatimes.com/markets/companies/indusind-bank-to-raise-climate-financing-to-3-5-in-2-years/articleshow/83255999.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83261024,width-1070,height-580,imgsize-165036,overlay-etmarkets/photo.jpg", "publishedAt": "2021-06-05T12:15:00Z", "content": "NEW DELHI: Private sector on Saturday said it will reduce carbon emissions to 50 per cent in next four years and raise climate financing to 3.5 per cent in two years.\r\nThe bank will be increasing the… [+1639 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Vishwanath Nair", "title": "Paytm Reports Rs 1,701-Crore Loss For FY21 - BloombergQuint", "description": "Paytm reports another loss in FY21, albeit a smaller one compared to a year ago.", "url": "https://www.bloombergquint.com/business/paytm-reports-rs-1701-crore-loss-for-fy21", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-02%2F702f216d-8244-44eb-8e9b-6aafe348a9fc%2F1.jpg?rect=0%2C0%2C3999%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-06-05T11:50:30Z", "content": "One97 Communications Ltd., the parent company of Paytm, reported another loss for FY21 even though the quantum was lower than in the previous year. Revenue and expenses fell during the year.\r\nOne97 r… [+1754 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Anuj Mishra", "title": "Benelli Leoncino 500 Sport café racer revealed - BikeWale", "description": "Benelli already retails the standard Leoncino 500 in India at Rs 4.59 lakh. The Sport version is unlikely to arrive here anytime.", "url": "https://www.bikewale.com/news/benelli-leoncino-500-sport-caf-racer-revealed/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/95251/right-front-three-quarter0.jpeg?q=85&art=2", "publishedAt": "2021-06-05T11:04:05Z", "content": "- Benelli Leoncino 500Sport launched in China\r\n- Its a café racer version of Leoncino\r\n- Unlikely to be launched in India anytime soon\r\nBenelli has launched the new Sport version of its middle-weight… [+1404 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Allows Banks To Sell Vijay Mallya's Properties To Recover Debts - NDTV", "description": "A Prevention of Money Laundering Act (PMLA) court has allowed banks to sell certain real estate assets and securities and of fugitive business tycoon Vijay Mallya to recover their debts.", "url": "https://www.ndtv.com/india-news/court-allows-banks-to-sell-vijay-mallyas-properties-to-recover-debts-2457074", "urlToImage": "https://c.ndtvimg.com/2018-09/2u8jmm2o_vijay-mallya_625x300_13_September_18.jpg", "publishedAt": "2021-06-05T10:54:46Z", "content": "Vijay Mallya was declared as a fugitive economic offender in January 2019 by a special court in Mumbai.\r\nNew Delhi: A Prevention of Money Laundering Act (PMLA) court has allowed banks to sell certain… [+1146 chars]"}, {"source": {"id": null, "name": "Zigwheels.com"}, "author": null, "title": "World Environment Day Special: Five E-Scooters You Should Check Out! - ZigWheels.com", "description": "These e-scooters bring with them a promise of a better environment-friendly future", "url": "https://www.zigwheels.com/news-features/news/world-environment-day-upcoming-electric-scooter-launches-in-india/42288/", "urlToImage": "https://media.zigcdn.com/media/content/2021/Jun/e-scooters_1.jpg", "publishedAt": "2021-06-05T10:30:59Z", "content": "Electric vehicles have existed in India for quite a while, especially scooters. Barring a few brands, most of them have been sketchy, at best. Many mainstream two-wheeler brands have entered the e-sc… [+3210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka: Bengaluru airport achieves energy neutral status, saves 22 lakh units of energy - The Indian Express", "description": "Bangalore News: Kempegowda International Airport began the fiscal on a good note, meeting 98% of its energy requirement through renewable sources", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-airport-achieves-energy-neutral-status-saves-22-lakh-units-of-energy-7345430/", "urlToImage": "https://images.indianexpress.com/2021/06/BLR-Airport-Solar-Panels.jpg", "publishedAt": "2021-06-05T10:28:14Z", "content": "The Kempegowda International Airport (KIA) achieved net energy neutral status during the 2020-21 financial year, the airport operator Bangalore International Airport Limited (BIAL) announced on Frida… [+1890 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "IPO-bound Zomato commits to 100% adoption of Electric Vehicles by 2030 - Moneycontrol", "description": "Zomato said it is already actively working with a few EV players to design pilots and create business models that could facilitate a faster transition towards a viable mobility solution for deliveries. ​", "url": "https://www.moneycontrol.com/news/business/zomato-plans-to-shift-entire-delivery-fleet-to-electric-by-2030-6991971.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/zomato-770x433.jpg", "publishedAt": "2021-06-05T09:48:39Z", "content": "Food delivery platform Zomato, which plans to list in the public markets in India this year, has said it will adopt electric vehicles for 100% of its fleet by 2030, in a bid to build a more sustainab… [+2602 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Peerzada Abrar & Raghavendra Kamath", "title": "Flipkart in talks to raise $3 bn from marquee investors at $35-bn valuation - Business Standard", "description": "The funding -- from SoftBank, Abu Dhabi's ADQ, CPPIB -- is expected to set the stage for Flipkart's IPO in the US by next year and increase its valuation to about $50 bn, say sources", "url": "https://www.business-standard.com/article/companies/flipkart-in-talks-to-raise-3-bn-from-marquee-investors-at-35-bn-valuation-121060500526_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-06/05/full/1622886244-8055.jpg", "publishedAt": "2021-06-05T08:53:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Motoroctane.com"}, "author": "Akshat Mehrotra", "title": "Rs 10 Lakh SUV to be cheaper than Hyundai Creta - MotorOctane - MotorOctane", "description": "Rs 10 Lakh SUV to be cheaper than Hyundai Creta » What product is it? » What will it be like?» Features? » Specifications? » Pricing?", "url": "https://motoroctane.com/news/219436-rs-10-lakh-suv-to-be-cheaper-than-hyundai-creta", "urlToImage": "https://motoroctane.com/wp-content/uploads/2021/06/Rs-10-Lakh-SUV-to-be-cheaper-than-this.jpg", "publishedAt": "2021-06-05T08:42:30Z", "content": "SUVs like Hyundai Creta, Kia Seltos, Nissan Kicks and Renault Duster have already been competing in the C-SUV segment. Out of these, the Hyundai Creta is the segment king. The car rules in sales char… [+2740 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "ZeeBiz WebDesk", "title": "Cryptocurrency latest news today: Trading in virtual currencies? RBI has this important update for you | Ch... - Zee Business", "description": "Cryptocurrency latest news today: Cryptocurrency craze have grown by leaps and bounds in the recent years. It all has to do with exceptional returns that these coins have generated for its investors in the quickest times possible and success stories attached …", "url": "https://www.zeebiz.com/markets/currency/news-cryptocurrency-latest-news-today-trading-in-virtual-currencies-rbi-has-this-important-update-for-you-check-most-recent-prices-of-bitcoin-ethereum-and-other-top-coins-158041", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2021/06/05/151121-shaktikanta-reuter-pti.JPG", "publishedAt": "2021-06-05T07:43:23Z", "content": "Cryptocurrency craze have grown by leaps and bounds in the recent years. It all has to do with exceptional returns that these coins have generated for its investors in the quickest times possible and… [+2336 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Bird Group executive director Ankur Bhatia passes away at 48 - Business Standard", "description": "Bird Group executive director Ankur Bhatia died on Friday at the age of 48 due to a massive cardiac arrest", "url": "https://www.business-standard.com/article/pti-stories/bird-group-executive-director-ankur-bhatia-passes-away-121060401327_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-06/05/full/1622873456-6769.jpg", "publishedAt": "2021-06-05T06:11:00Z", "content": "Bird Group executive director Ankur Bhatia died on Friday at the age of 48 due to a massive cardiac arrest.\r\n\"It is with profound grief that we inform you about the sudden demise of our beloved Dr. A… [+1792 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Neil Borate", "title": "SBI MF eases tactical investment into its cyclical funds, cuts exit load - Mint", "description": "SBI Mutual Fund has reduced the exit load period from 1 years to 30 days for them and the exit load percentage from 1% to 0.5%. The fund house also cut the exit load on SBI Nifty Next 50 Index Fund from 1% to 0.25% and reduced the exit load period from 1 year…", "url": "https://www.livemint.com/mutual-fund/mf-news/sbi-mf-eases-tactical-investment-into-its-cyclical-funds-cuts-exit-load-11622871774747.html", "urlToImage": "https://images.livemint.com/img/2021/06/05/600x338/SBIMF15_1619081356584_1622872042385.PNG", "publishedAt": "2021-06-05T05:54:07Z", "content": "MUMBAI: In a notice issued today, SBI Mutual Fund announced that it is reducing the exit load period and exit load percentage on several thematic funds investing in cyclical sectors from 7 June 2021.… [+345 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Drive Desk", "title": "Tata Tiago, Renault Triber, and more: Top 10 safest cars as per Global NCAP | Part 1 - Times Now", "description": "If you are on the lookout for a new budget-friendly car but safety is of paramount importance to you, then you can consider these cars that have received four-star or higher safety rating by Global NCAP.", "url": "https://www.timesnownews.com/auto/features/article/tata-tiago-renault-triber-and-more-top-10-safest-cars-as-per-global-ncap-part/765037", "urlToImage": "https://imgk.timesnownews.com/story/Safest_cars_P1.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-06-05T04:17:31Z", "content": "Indian carmakers, for the longest time, had put passenger safety on the back burner to cut corners and price their cars aggressively. However, increasing awareness towards passenger safety and an ala… [+6053 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "ZeeBiz WebDesk", "title": "GOOD NEWS for salaried class from RBI: Your SALARY will be credited on Sundays and Bank Holidays too from T... - Zee Business", "description": "The Reserve Bank of India (RBI) on Friday, June 4, said the National Automated Clearing House (NACH) will be operational on all days, including weekends.", "url": "https://www.zeebiz.com/personal-finance/news-good-news-for-salaried-class-from-rbi-your-salary-will-be-credited-on-sundays-and-bank-holidays-too-from-this-day-158033", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2021/06/05/151111-rbi.JPG", "publishedAt": "2021-06-05T04:10:13Z", "content": "The Reserve Bank of India (RBI) on Friday, June 4, said the National Automated Clearing House (NACH) will be operational on all days, including weekends. This will be effective from August 1, 2021.  … [+1492 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Suchitra Karthikeyan", "title": "Chidambaram asks who gradually built Forex kitty? as Indias reserves cross $600 bn mark - Republic World", "description": "With India's forex crossing $600 billion, ex-Finance Minister P Chidambaram on Saturday reminisced the time when India's reserves were down to $0.5 billion.", "url": "https://www.republicworld.com/india-news/politics/chidambaram-asks-who-gradually-built-forex-kitty-as-indias-reserves-cross-600-dollars-bn-mark.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/s7aexdwqihc7bgxd_1622864328.jpeg", "publishedAt": "2021-06-05T03:39:00Z", "content": "With RBI estimating India's forex reserves crossing $600 billion, ex-Finance Minister P Chidambaram on Saturday reminisced the time when India's forex reserves were down to $0.5 billion. Reminding th… [+2419 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "Safeguard your online accounts better with these services - Mint", "description": "Keep the master passwords you use for the password manager secure and keep a lookout for data breaches or vulnerability reports on the service you use", "url": "https://www.livemint.com/technology/tech-news/safeguard-your-online-accounts-better-with-these-services-11622727701230.html", "urlToImage": "https://images.livemint.com/img/2021/06/03/600x338/hacking-kWaG--621x414@LiveMint_1622728018518.jpg", "publishedAt": "2021-06-05T03:22:28Z", "content": "It is not good enough to just create a good password anymore; keeping these online credentials secure, recalling them when required, generating secure passwords when needed, and knowing when your cre… [+2134 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "TE RAJA SIMHAN/ VINAY KAMATH", "title": "Iconic luggage retail chain Witco shuts down after 70 years - BusinessLine", "description": "Restrictions on international travel had impacted the business, it added.", "url": "https://www.thehindubusinessline.com/news/iconic-luggage-retail-chain-witco-shuts-down-after-70-years/article34725213.ece", "urlToImage": "https://www.thehindubusinessline.com/news/sfil2n/article34725212.ece/ALTERNATES/LANDSCAPE_615/Witco", "publishedAt": "2021-06-05T03:08:50Z", "content": "When Sharmila Rao was leaving home in Chennai for the first time in the early 1980s to study at the University of Trivandrum, her father took her to buy luggage at Witco on Mount Road (now Anna Salai… [+3121 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "Home Loan Interest Rates to Remain at All-Time Low. Is Now a Good Time To Buy Ho - News18", "description": "The low-interest regime of home loans will continue as Reserve Bank of India (RBI) Monetary Policy Committee (MPC) has kept the key benchmark rates unchanged on June 4.", "url": "https://www.news18.com/news/business/home-loan-interest-rates-to-remain-at-all-time-low-is-now-a-good-time-to-buy-house-3811925.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/06/1622823978_home.jpg", "publishedAt": "2021-06-05T02:30:04Z", "content": "The low-interest regime of home loans will continue as Reserve Bank of India (RBI) Monetary Policy Committee (MPC) has kept the key benchmark rates unchanged on June 4. “The low home loan interest ra… [+3393 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "RBI Loan Restructuring of up to Rs 50 Cr for MSMEs: Eligibility, Other Criteria - News18", "description": "In a bid to provide relief amid the second wave of COVID-19 pandemic, Reserve Bank of India (RBI) announced doubling of loan restructuring limits for micro, small and medium enterprises (MSMEs) and small borrowers to Rs 50 crore.", "url": "https://www.news18.com/news/business/loan-restructuring-of-up-to-rs-50-cr-allowed-for-msmes-eligibility-other-criteria-3811793.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/09/1600067382_2020-09-14t070046z_2_lynxmpeg8d0hy_rtroptp_4_business-currency-1.jpg", "publishedAt": "2021-06-05T02:00:17Z", "content": "In a bid to provide relief amid the second wave of COVID-19 pandemic, Reserve Bank of India (RBI) announced doubling of loan restructuring limits for micro, small and medium enterprises (MSMEs) and s… [+2943 chars]"}]}