{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cipla Close To Commit Over $1 Billion For Moderna Booster Vaccine In India: Report - NDTV", "description": "Seeking fast-track approvals to bring Moderna's single-dose COVID-19 booster vaccine in India expeditiously, Cipla has requested the government for indemnification and exemptions from price capping, bridging trials and basic customs duty.", "url": "https://www.ndtv.com/india-news/cipla-close-to-commit-1-billion-to-moderna-for-booster-vaccine-in-india-report-2453334", "urlToImage": "https://c.ndtvimg.com/2021-04/r9rjee5g_moderna-covid19-vaccine_625x300_06_April_21.jpg", "publishedAt": "2021-05-31T17:52:37Z", "content": "Cipla has evinced interest to procure 50 million doses from Moderna for 2022. (Representational)\r\nNew Delhi: Seeking fast-track approvals to bring Moderna's single-dose COVID-19 booster vaccine in In… [+5146 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Siddhant Pandey", "title": "EPFO members allowed second advance withdrawal citing COVID-19 | NewsBytes - NewsBytes", "description": "The Employee Provident Fund Organization (EPFO) has allowed its subscribers to avail a second advance withdrawal in the wake of COVID-19", "url": "https://www.newsbytesapp.com/news/india/epfo-members-allowed-second-advance-withdrawal-citing-covid-19/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l177_35081622481438.jpg", "publishedAt": "2021-05-31T17:49:57Z", "content": "The Employee Provident Fund Organization (EPFO) has allowed its five crore subscribers to avail a second advance withdrawal in the wake of the COVID-19 pandemic.\r\n Last March, the Centre had allowed … [+1761 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Close to commit over $1-bn to Moderna for Covid-19 booster vaccine; Provide price capping waiver, indemnity: Cipla to Govt - The Indian Express", "description": "Cipla's latest communication to the govt, dated May 29, follows a high-level meeting held recently during which it was discussed that Moderna has proposed to launch a single-dose vaccine for the Indian market, for which, they were in discussion with Cipla and…", "url": "https://indianexpress.com/article/india/moderna-covid-19-vaccine-india-cipla-7338567/", "urlToImage": "https://images.indianexpress.com/2021/05/Moderna22.jpg", "publishedAt": "2021-05-31T17:10:49Z", "content": "Seeking fast-track approvals to bring Moderna’s single-dose COVID-19 booster vaccine in India expeditiously, Cipla has requested the government for indemnification and exemptions from price capping, … [+4928 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "India GDP data | A look at the sectors that aided growth and those that dented it - Moneycontrol.com", "description": "India's economy recorded a growth of 1.6 percent in the fourth quarter indicating that the economy was in a revival mode before the second wave of the COVID struck the country.", "url": "https://www.moneycontrol.com/news/trends/india-gdp-data-a-look-at-the-sectors-that-aided-growth-and-those-that-dented-it-6966241.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/GDP_down.jpg", "publishedAt": "2021-05-31T16:44:29Z", "content": "The devastation that the COVID-19 pandemic inflicted upon India's economy was reflected in the GDP data released by the National Statistical Office on May 31. For the first time since 1980-81, India'… [+3691 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "RBI announces FPI investment limits in G-secs, SDLs - Moneycontrol.com", "description": "In a circular, the RBI said the allocation of incremental changes in the G-sec limit (in absolute terms) over the two sub-categories 'General' and 'Long-term' will be retained at 50:50 for FY 2021-22.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-announces-fpi-investment-limits-in-g-secs-sdls-6967281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/RBI_shutterstock_1686527644-770x433.jpg", "publishedAt": "2021-05-31T16:39:46Z", "content": "The Reserve Bank of India on Monday said the limits for foreign portfolio investors (FPI) investment during the current fiscal in government securities (G-secs) and State Development Loans (SDLs) wil… [+1066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Quote Old Circular To Warn Customers On Crypto: RBI To Banks - NDTV", "description": "The Reserve Bank of India (RBI) has asked banks, NBFCs and payment system providers not to refer to its earlier virtual currencies-related circular, that was issued in April 2018 and later aside by the Supreme Court, in their communications to custom", "url": "https://www.ndtv.com/india-news/dont-quote-old-our-circular-on-crypto-currency-to-customers-reserve-bank-of-india-to-banks-2453277", "urlToImage": "https://c.ndtvimg.com/2021-02/kq34jumk_cryptocurrency-bitcoin-reuters_625x300_11_February_21.jpg", "publishedAt": "2021-05-31T15:56:02Z", "content": "The government is in the process of bringing a bill on crypto currencies. (Representational)\r\nMumbai: The Reserve Bank of India (RBI) has asked banks, NBFCs and payment system providers not to refer … [+2907 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "New Mahindra Thar receives 55,000 bookings in 8 months: 1 in 2 bookings for Automatic variants - CarToq.com", "description": "Mahindra launched the all-new Thar in the market last year and it has received an overwhelming response from the customers. The all-new Mahindra Thar became so popular that now, there is a long waiting period on the SUV. The waiting period on the SUV is as lo…", "url": "https://www.cartoq.com/mahindra-thar-receives-55000-bookings-8-months/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Thar-featured-1-1019x530.jpg", "publishedAt": "2021-05-31T15:53:06Z", "content": "Mahindra launched the all-new Thar in the market last year and it has received an overwhelming response from the customers. The all-new Mahindra Thar became so popular that now, there is a long waiti… [+3054 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Centre gives approval to 4 firms under PLI scheme for bulk drugs - Moneycontrol.com", "description": "The Department of Pharmaceuticals had launched the PLI scheme for promotion of domestic manufacturing of critical bulk drugs — Key Starting Materials (KSMs)/ Drug Intermediates and Active Pharmaceutical Ingredients (APIs).", "url": "https://www.moneycontrol.com/news/business/economy/centre-gives-approval-to-4-firms-under-pli-scheme-for-bulk-drugs-6967021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/pharma1-770x433.jpg", "publishedAt": "2021-05-31T15:41:31Z", "content": "The government has given approval to four waitlisted firms under the Production Linked Incentive (PLI) scheme for domestic manufacturing of bulk drugs, an official statement said on Monday. The Depar… [+1496 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Madras High Court Orders Covid-Linked Audit Of Renault-Nissan Plant - NDTV", "description": "Auto major Renault-Nissan will be inspected on its compliance to Covid safety precautions, the Madras High Court ordered today after the workers went on strike, alleging that authorities were not maintaining the Covid-safety protocols", "url": "https://www.ndtv.com/india-news/madras-high-court-orders-covid-linked-audit-of-renault-nissan-plant-2453269", "urlToImage": "https://c.ndtvimg.com/2021-05/qnm3dkfk_renaultnissan_625x300_31_May_21.jpg", "publishedAt": "2021-05-31T15:41:26Z", "content": "At Renault-Nissan, workers refused to resume work on Monday.\r\nChennai: Auto major Renault-Nissan will be inspected on its compliance to Covid safety precautions, the Madras High Court ordered today a… [+2455 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Market shifting from China to India to boost domestic chemical firms, says Deepak Fertilisers CMD - Moneycontrol", "description": "Despite the COVID-19 pandemic raging across the country, Sailesh C. Mehta is confident that the company’s robust growth numbers are sustainable.", "url": "https://www.moneycontrol.com/news/business/market-shifting-from-china-to-india-to-boost-domestic-chemical-firms-says-deepak-fertilisers-cmd-6967001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/11/fertiliser-770x433.jpg", "publishedAt": "2021-05-31T15:37:28Z", "content": "A shift in supply chain and manufacturing from China to India would benefit Indian companies substantially, and a normal monsoon expected this year could be a fresh fillip for the domestic fertiliser… [+4055 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "RBI cancels the licence of Maharashtra's Shivajirao Bhosale Sahakari Bank - Moneycontrol", "description": "As per the data submitted by the bank, more than 98 percent of the depositors will receive full amounts of their deposits from Deposit Insurance and Credit Guarantee Corporation (DICGC), the RBI said.", "url": "https://www.moneycontrol.com/news/business/rbi-cancels-the-licence-of-maharashtras-shivajirao-bhosale-sahakari-bank-6966921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/RBI-770x433.jpg", "publishedAt": "2021-05-31T15:21:09Z", "content": "The Reserve Bank of India (RBI) on May 31 cancelled the licence of Shivajirao Bhosale Sahakari Bank in Maharashtra citing poor finances of the co-operative bank. Consequently, the bank ceases to carr… [+1469 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Thimmaya Poojary", "title": "[Funding alert] Accio Robotics raises fresh capital from angel investors - YourStory", "description": "The robotics startup Accio Robotics will use the fresh round of funding for product development and increase its market reach.", "url": "https://yourstory.com/2021/05/funding-alert-accio-robotics-startup-100x-vc/amp", "urlToImage": "https://images.yourstory.com/cs/2/a09f22505c6411ea9c48a10bad99c62f/Imageo8q1-1622484899673.jpg", "publishedAt": "2021-05-31T14:54:05Z", "content": "Accio Robotics, a robotics automation startup focused on designing and manufacturing autonomous mobile robots, has raised a fresh undisclosed round of funding from a group of angel investors.\r\nThe fu… [+1987 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Govt banks offering loans for covid-19 treatment. Should you opt for them? - Mint", "description": "While the personal loan for treatment of the covid-19 is available at cheaper rates, opt for them only if you are facing a temporary cash-flow problem", "url": "https://www.livemint.com/money/personal-finance/govt-banks-offering-loans-for-covid-19-treatment-should-you-opt-for-them-11622471838450.html", "urlToImage": "https://images.livemint.com/img/2021/05/31/600x338/ubi2-kyVC--621x414@LiveMint-33ea_1622472105859.jpg", "publishedAt": "2021-05-31T14:47:18Z", "content": "Public sector banks are offering personal loans of up to 5 lakh for the covid-19 treatment. Individuals can use the loan for the treatment of self or family members.According to Dinesh Khara, chairma… [+1800 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Toyota Mirai FCEV Sets New Range Record; Beats Hyundai Nexo - GaadiWaadi.com", "description": "Toyota Mirai covered just over 1,000 km in its record run and had 9 km range leftover as per the onboard indication", "url": "https://gaadiwaadi.com/toyota-mirai-fcev-sets-new-range-record-beats-hyundai-nexo/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/2021-Toyota-Mirai.jpg", "publishedAt": "2021-05-31T14:29:04Z", "content": "Toyota’s Mirai FCEV (Fuel Cell Electric Vehicle) has broken a new record as the war to become the leader in the alternative mobility solutions rages on. While most of the mainstream global automakers… [+1802 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Hyundai AX1 Micro SUV spied again ahead of launch: Maruti S-Presso challenger - CarToq.com", "description": "Hyundai is working on a new micro SUV which is currently being tested on the international roads. The new micro-SUV will be going against the likes of the Maruti Suzuki Ignis, Mahindra KUV100 and the upcoming Tata HBX. The AX1 looks like a hatchback that has …", "url": "https://www.cartoq.com/hyundai-ax1-micro-suv-spied-again/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Hyundai-AX1-new-spy-shots-feattured-1019x530.jpg", "publishedAt": "2021-05-31T14:01:42Z", "content": "Hyundai is working on a new micro SUV which is currently being tested on the international roads. The new micro-SUV will be going against the likes of the Maruti Suzuki Ignis, Mahindra KUV100 and the… [+2959 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Gopika Gopakumar", "title": "Adar Poonawalla appointed as chairman of Magma Fincorp - Mint", "description": "The announcement is part of a series of leadership changes following the Poonawala-controlled Rising Sun Holdings acquiring controlling stake through an equity infusion of Rs3,456 crore earlier this month", "url": "https://www.livemint.com/companies/news/adar-poonawalla-appointed-as-chairman-of-magma-fincorp-11622467050826.html", "urlToImage": "https://images.livemint.com/img/2021/05/31/600x338/PWSF663_1594199444122_1594199470665_1622467114601.jpg", "publishedAt": "2021-05-31T13:21:45Z", "content": "Mumbai-based non-banking finance company Magma Fincorp Limited on Monday announced the appointment of Adar Poonawalla as the chairman of the company. Poonawalla is also the chief executive officer of… [+2274 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Indian Institute of Technology Madras to collaborate with IBM on courses related to Quantum Computing and... - Moneycontrol", "description": "As a result of this collaboration, faculty, researchers, and students will now have access to all of the firm's quantum systems and tools over IBM Cloud.", "url": "https://www.moneycontrol.com/news/business/indian-institute-of-technology-madras-to-collaborate-with-ibm-on-courses-related-to-quantum-computing-and-research-6966021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/cloud-computing-770x433.jpg", "publishedAt": "2021-05-31T13:08:24Z", "content": "Indian Insitute of Technology (IIT) Madras has said it will collaborate with software firm IBM on developing quantum computing research.\r\nAs a result of this collaboration, faculty, researchers, and … [+1538 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Sujata Sangwan", "title": "[Funding alert] Ahmedabad-based startup consultancy platform Disruptium raises $200K in pre-seed round - YourStory", "description": "The funds raised by startup consultancy Disruptium would be deployed towards tech development, hiring key resources, and building alliances and partnerships", "url": "https://yourstory.com/2021/05/funding-ahmedabad-disruptium-consultancy-platform-for-startups/amp", "urlToImage": "https://images.yourstory.com/cs/2/b87effd06a6611e9ad333f8a4777438f/Imagegpmj-1622460852289.jpg", "publishedAt": "2021-05-31T11:59:37Z", "content": "Ahmedabad-based Disruptium, a consultancy platform for startups, has raised pre-seed funding of $200,000 from Pravesh Mehta (MD, Energysys and Lemonade Ventures) and Chokhani Ventures.\r\nOwned and ope… [+2510 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Nestle, under fire over unhealthy products, working on new strategy - Moneycontrol", "description": "The Financial Times reported it had seen an internal presentation circulated among top executives early this year stating that more than 60% of Nestle's mainstream food and drinks portfolio could not be considered healthy under a \"recognised definition of hea…", "url": "https://www.moneycontrol.com/news/business/nestle-under-fire-over-unhealthy-products-working-on-new-strategy-6965641.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Nestle_shutterstock_1339616471-770x433.jpg", "publishedAt": "2021-05-31T11:55:59Z", "content": "Nestle said on Monday it was working on updating its nutrition and health strategy after the Financial Times reported an internal document at the food giant described a large portion of its food and … [+1466 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Bank of Baroda Reports Huge Loss but CLSA Says it Can Gain 60% - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/bank-of-baroda-reports-huge-loss-but-clsa-says-it-can-gain-60-2745206", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/91d857f8bfcaee41b90d4c1d0259c39d_w_800_h_450.jpg", "publishedAt": "2021-05-31T11:08:06Z", "content": "By Aditya Raghunath\r\nInvesting.com -- Bank of Baroda Ltd (NS:\r\nBOB\r\n) reported a loss of Rs 1,046.5 crore for the quarter ended March 2021 compared to a profit of Rs 506.59 crore in the corresponding… [+1031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Business sentiment at a new low: What FICCI survey shows - The Indian Express", "description": "The overall business confidence index as measured by FICCI nosedived to 51.5 in May from a decadal high of 74.2 measured in February.", "url": "https://indianexpress.com/article/explained/explained-business-sentiment-at-a-new-low-in-may-7338016/", "urlToImage": "https://images.indianexpress.com/2021/05/business-explained22.jpg", "publishedAt": "2021-05-31T10:28:49Z", "content": "Business sentiment in India has taken a beating in May, with 70 per cent of businesses citing a weak demand situation as a key containing factor for business, according to a survey by industry body F… [+2231 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "CPAI asks Sebi to continue with current 50% peak margin requirement; defers next stage - Economic Times", "description": "CPAI said that a situation may arise whereby an intraday margin call will be resolved by liquidating the position still a client could be penalised.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/cpai-asks-sebi-to-continue-with-current-50-peak-margin-requirement-defers-next-stage/articleshow/83112175.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83112251,width-1070,height-580,imgsize-58187,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-31T10:26:00Z", "content": "NEW DELHI: Commodity Participants Association of India (CPAI) has asked markets regulator Sebi to continue with the current level of 50 per cent peak margins and defer the proposed higher limit of 75… [+3476 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Sensex surges 515 points ahead of GDP data; Nifty hits fresh closing high of 15,583 - Times of India", "description": "India Business News: Equity indices jumped on Monday with benchmark BSE sensex rising over 500 points led by gains in metal and banking stocks, ahead of the gross domestic", "url": "https://timesofindia.indiatimes.com/business/india-business/sensex-surges-515-points-ahead-of-gdp-data-nifty-hits-fresh-closing-high-of-15583/articleshow/83111882.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83111980,width-1070,height-580,imgsize-225595,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-31T10:18:00Z", "content": "Sensex surges 515 points ahead of GDP data; Nifty hits fresh closing high of 15,583"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "German inflation starts to pick up | Kitco News - Kitco NEWS", "description": "(Kitco News) - German CPI has come in higher than expectations on the year-on-year readings across the board today as inflation starts to hit Europe. In previous readings, the EUR/USD strength could have meant that some of the inflationary shocks had been wat…", "url": "https://www.kitco.com/news/2021-05-31/German-inflation-starts-to-pick-up.html", "urlToImage": "https://www.kitco.com/news/images/Kitco_News_Default_V1.jpg", "publishedAt": "2021-05-31T10:08:00Z", "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+1552 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Capgemini picks Ericsson to support client innovation at its 5G Lab for Industries in India - ETTelecom.com", "description": "The Lab will support Capgemini’s global client base in 5G end-to-end transformation through three offerings--5G and Edge ideation catalyst program; 5G and Edge use case acceleration platform; and 5G and Edge Fab Lab.", "url": "https://telecom.economictimes.indiatimes.com/news/capgemini-picks-ericsson-to-support-client-innovation-at-its-5g-lab-for-industries-in-india/83111682", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-83111682,imgsize-22108,width-800,height-434,overlay-ettelecom/capgemini-picks-ericsson-to-support-client-innovation-at-its-5g-lab-for-industries-in-india.jpg", "publishedAt": "2021-05-31T10:03:22Z", "content": "NEW DELHI: Information technology services company Capgemini Monday deployed 5G (standalone) Industry Connect solution from Swedish telecoms gear maker Ericsson at its 5G Lab in Mumbai, as part of an… [+2456 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "SsangYong looks for a new investor, plans to complete sale process by October: Report - Moneycontrol", "description": "SsangYong Motor had filed for bankruptcy, or court receivership, in December 2020 after defaulting on loan repayments.", "url": "https://www.moneycontrol.com/news/business/ssangyong-looks-for-a-new-investor-plans-to-complete-sale-process-by-october-report-6964951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/09/Ssangyong-Rexton-1-770x433.jpg", "publishedAt": "2021-05-31T10:02:16Z", "content": "South Korea's SsangYong Motor, owned by Mahindra &amp; Mahindra (M&amp;M), is looking for a new investor and is targeting completing the sale process by October later this year.\r\nThe troubled automak… [+1476 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "This Royal Enfield 650 Bobber Is A Vintage-Inspired Marvel - GaadiWaadi.com", "description": "Check out this custom Royal Enfield 650 Bobber concept bike, named ‘Old Lady’, built by Renovatio Motorworks", "url": "https://gaadiwaadi.com/this-royal-enfield-650-bobber-is-a-vintage-inspired-marvel/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/modified-Royal-Enfield-old-lady-1.jpg", "publishedAt": "2021-05-31T10:00:04Z", "content": "Royal Enfield Continental GT650 and Interceptor 650 were launched in India back in 2018. Like other Royal Enfield motorcycles, these two are great platforms for custom builds, and weve seen some love… [+1898 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "UIDAI issues draft for new Aadhaar norms to supersede 2016 framework - The Siasat Daily", "description": "New Delhi: The draft Aadhaar (Authentication and Offline Verification) Regulations, 2021 stipulate that the Authority may enable an Aadhaar number holder to permanently lock his biometrics and temporarily unlock it when needed for biometric authentication. Th…", "url": "https://www.siasat.com/uidai-issues-draft-for-new-aadhaar-norms-to-supersede-2016-framework-2144254/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/05/Aadhaar.jpg", "publishedAt": "2021-05-31T09:48:00Z", "content": "New Delhi: The draft Aadhaar (Authentication and Offline Verification) Regulations, 2021 stipulate that the Authority may enable an Aadhaar number holder to permanently lock his biometrics and tempor… [+4301 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "CII elects T V Narendran as new president - Moneycontrol", "description": "T V Narendran takes over from Uday Kotak, Managing Director, and Chief Executive Officer, Kotak Mahindra Bank Ltd.", "url": "https://www.moneycontrol.com/news/business/cii-elects-t-v-narendran-as-new-president-6965221.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/07/tv_narendran_tata_steel-770x433.png", "publishedAt": "2021-05-31T09:44:50Z", "content": "Industry chamber CII on Monday said it has elected T V Narendran, CEO and Managing Director, Tata Steel Ltd,  as its new president for 2021-22.\r\nHe takes over from Uday Kotak, Managing Director, and … [+699 chars]"}, {"source": {"id": null, "name": "Equity Bulls"}, "author": null, "title": "Prakash Industries Ltd Q4FY21 PAT up at Rs. 51.66 crores - Equity Bulls", "description": "PRAKASH INDUSTRIES LTD. has reported financial results for the period ended March 31, 2021.<BR><BR><B>Financial Results (Q4 FY20-21) - QoQ Comparison</B><BR><BR>The company has reported total income of Rs.1035.16 crores during the period en", "url": "https://www.equitybulls.com/admin/news2006/news_det.asp?id=290047", "urlToImage": "https://equitybulls.com/images/News-By-EquityBulls.jpg", "publishedAt": "2021-05-31T09:42:04Z", "content": "PRAKASH INDUSTRIES LTD. has reported financial results for the period ended March 31, 2021.\r\nFinancial Results (Q4 FY20-21) - QoQ Comparison\r\nThe company has reported total income of Rs.1035.16 crore… [+1910 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Aurobindo Pharma Q4 results: Co reports net profit at Rs 801 crore - Economic Times", "description": "For the fiscal ended March this year, the company posted a net profit of Rs 5,333.83 crore. It was Rs 2,843.67 crore in the preceding fiscal year, the filing said.", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/aurobindo-pharma-q4-results-co-reports-net-profit-at-rs-801-crore/articleshow/83110730.cms", "urlToImage": "https://img.etimg.com/thumb/msid-83110785,width-1070,height-580,imgsize-824833,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-31T09:12:00Z", "content": "NEW DELHI: Drug firm on Monday reported a consolidated net profit of Rs 801.18 crore for the fourth quarter ended March 2021. The company had posted a net profit of Rs 863.16 crore for the correspond… [+1620 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Trisha Medhi", "title": "[Funding alert] Ex-Myntra CEO Ananth Narayanan's new venture Mensa Brands raises $50M in Series A round - YourStory", "description": "According to ecommerce startup Mensa Brands, the funds will be used to nurture, accelerate and scale digital-first brands.", "url": "https://yourstory.com/2021/05/ananth-narayanan-mensa-brands-raises-series-a-round/amp", "urlToImage": "https://images.yourstory.com/cs/2/e641e900925711e9926177f451727da9/Imagerom0-1622450105286.jpg", "publishedAt": "2021-05-31T09:10:17Z", "content": "Mensa Brands on Monday announced the closure of its Series A funding round, raising approximately $50 million. The round was led by Accel Partners, Falcon Edge Capital, Norwest Venture Partners as we… [+2548 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "SBI lists out 6 golden reasons to subscribe Sovereign Gold Bond series III - Mint", "description": "The State Bank of India (SBI) has strongly recommended gold investors to subscribe the third tranche of Sovereign Gold Bond Scheme 2021-22", "url": "https://www.livemint.com/money/personal-finance/sbi-lists-out-6-golden-reasons-to-subscribe-sovereign-gold-bond-series-iii-11622449752669.html", "urlToImage": "https://images.livemint.com/img/2021/05/31/600x338/2021-02-01T112953Z_1611064046_RC2NJL96MDKD_RTRMADP_3_INDIA-GOLD-DUTY_1613883950532_1613883964571_1622450382327.JPG", "publishedAt": "2021-05-31T08:43:34Z", "content": "Sovereign Gold Bond Scheme 2021-22:The third tranche of Sovereign Gold Bond Scheme 2021-22 has opened for subscription today. The issue is priced slightly higher from the previous one but the State B… [+1394 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Glenmark expects 10-12% sales growth in FY22, anticipates value unlock of its R&D business - Moneycontrol", "description": "Sale of anti-COVID drug Fabiflu and other products fire Q1 revenues; the company spends little over $100 million annually on innovation R&D business, bigger than most of its peers, developing a potential pipeline of drug assets", "url": "https://www.moneycontrol.com/news/business/companies/glenmark-expects-10-12-sales-growth-in-fy22-anticipates-value-unlock-of-its-rd-business-6963251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Pharma.shutterstock-1-770x433.jpg", "publishedAt": "2021-05-31T08:28:26Z", "content": "Glenmark Pharmaceuticals on May 31 said it expects overall sales to grow more than 10-12 percent in FY22.\r\nThe company has guided to maintain Earnings Before Interest Taxes Depreciation and Amortizat… [+4237 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "BMW X7 Dark Shadow Edition Launched In India At Rs. 2.02 Crore - GaadiWaadi.com", "description": "BMW X7 Dark Shadow Edition is powered by a 3.0-litre six-cylinder diesel engine producing 400 hp and 760 Nm; 0-100 kmph in just 5.4 seconds", "url": "https://gaadiwaadi.com/bmw-x7-dark-shadow-edition-launched-in-india-at-rs-2-02-crore/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/02-The-BMW-X7-Dark-Shadow-Edition.jpg", "publishedAt": "2021-05-31T07:48:39Z", "content": "BMW Group India has today announced the launch of the new X7 M50d Dark Shadow Edition in the domestic market and to maintain exclusivity, its production has been limited to just 500 units globally. I… [+2956 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Capital Market", "title": "ITC Ltd soars 2.16%, Gains for third straight session - Business Standard", "description": "ITC Ltd is quoting at Rs 217.5, up 2.16% on the day as on 12:49 IST on the NSE. The stock is up 8.45% in last one year as compared to a 58.44% gain in NIFTY and a 19.16% gain in the Nifty FMCG index.", "url": "https://www.business-standard.com/article/news-cm/itc-ltd-soars-2-16-gains-for-third-straight-session-121053100507_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1210531/full-121053100507.jpg", "publishedAt": "2021-05-31T07:35:00Z", "content": "ITC Ltd is quoting at Rs 217.5, up 2.16% on the day as on 12:49 IST on the NSE. The stock is up 8.45% in last one year as compared to a 58.44% gain in NIFTY and a 19.16% gain in the Nifty FMCG index.… [+2251 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Airtel extends free vaccination programme for nearly 80,000 staff of partner, distributor network - ETTelecom.com", "description": "Telecom firm Airtel is extending the free vaccination programme to nearly 80,000 employees of over 15,000 partners and distributors to prioritise inoculation of frontline staff such as store and field service executives amid the severe second wave of the pand…", "url": "https://telecom.economictimes.indiatimes.com/news/airtel-extends-free-vaccination-programme-for-nearly-80000-staff-of-partner-distributor-network/83108897", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-83108897,imgsize-310411,width-800,height-434,overlay-ettelecom/airtel-extends-free-vaccination-programme-for-nearly-80-000-staff-of-partner-distributor-network.jpg", "publishedAt": "2021-05-31T07:27:21Z", "content": "New Delhi: Telecom firmAirtel is extending the free vaccination programme to nearly 80,000 employees of over 15,000 partners and distributors to prioritise inoculation of frontline staff such as stor… [+2511 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sumant Sen", "title": "Data | Petrol price peaks in India owing to high taxes and crude oil prices - The Hindu", "description": "It breached the ₹100/litre mark in Mumbai on May 29", "url": "https://www.thehindu.com/data/data-petrol-price-peaks-in-india-owing-to-owing-to-high-taxes-and-crude-oil-prices/article34687020.ece", "urlToImage": "https://www.thehindu.com/data/iz4jye/article34686884.ece/ALTERNATES/LANDSCAPE_615/PetrolBunk-for-DP", "publishedAt": "2021-05-31T07:09:39Z", "content": "After staying steady in March and April, petrol prices in Delhi, Mumbai, Chennai and Kolkata increased consistently in May. The price of petrol breached the Rs. 100/litre mark in Mumbai while prices … [+1383 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "Here's How Bad May Is Estimated To Be For Auto Firms - BloombergQuint", "description": "May is estimated to be bad for auto sales but brokerages keep up hopes.", "url": "https://www.bloombergquint.com/business/heres-how-bad-may-is-estimated-to-be-for-auto-firms", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-05%2F4f04844f-d8f1-49f3-9bc9-fc48fe44501c%2F229037888.jpg?rect=0%2C49%2C3000%2C1575&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-31T07:02:30Z", "content": "Indias automakers saw sales slump in May as several states imposed local lockdowns and companies suspended manufacturing amid a severe second wave of Covid-19 infections.\r\nFactory-gate shipments of p… [+2716 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Avdhut Bagkar", "title": "HDFC & HDFC Bank, PNB & PNB Housing Fin: Strategies for twin stocks - Business Standard", "description": "A Price-volume breakout above Rs 475 level, logged on May 31, may result in a rally towards Rs 550 and Rs 580-mark in PNB Housing Finance", "url": "https://www.business-standard.com/article/markets/hdfc-hdfc-bank-pnb-pnb-housing-fin-strategies-for-twin-stocks-121053100361_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/misc/2021-05/20/full/markets-bulls-bears-stocks-trading-technicals-market-technical-technical-analysis-1621493728-14172620.jpg", "publishedAt": "2021-05-31T07:00:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Famous BTC Investments - Analytics Insight", "description": "Over the past few years, bitcoin has evolved to be a major cryptocurrency in the digital currency market. It’s secure blockchain network has attracted more BTC investments.", "url": "https://www.analyticsinsight.net/famous-btc-investments/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2021/05/BTC-1.jpg", "publishedAt": "2021-05-31T06:56:04Z", "content": "Bitcoin offers various benefits as a payment method and alternative currency. Even though in the beginning, a lot of people thought it is another scam, and could not fully comprehend the advantages o… [+3596 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Upcoming Hyundai Alcazar SUV: New details & teaser out - CarToq.com", "description": "Hyundai is working on a new 7-seater SUV that will be going against the MG Hector and the Tata Safari. The new SUV has already been showcased with camouflage. The SUVs launch was postponed to June because of the second wave of COVID-19 cases that our country …", "url": "https://www.cartoq.com/upcoming-hyundai-alcazar-suv-new-details/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/New-Alcazar-details-featured-1019x530.jpg", "publishedAt": "2021-05-31T06:49:08Z", "content": "Hyundai is working on a new 7-seater SUV that will be going against the MG Hector and the Tata Safari. The new SUV has already been showcased with camouflage. The SUVs launch was postponed to June be… [+3492 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Drive Desk", "title": "New generation Kia Sportage SUV teased; global debut in July - Times Now", "description": "Kia will reveal the new Sportage in July and has teased the fifth-generation SUV. In its new avatar, the Sportage will use Kia's 'Opposites United' design language and will look sportier than the current model.", "url": "https://www.timesnownews.com/auto/car-news/article/new-generation-kia-sportage-suv-teased-global-debut-in-july/764040", "urlToImage": "https://imgk.timesnownews.com/story/Sportage_teaser_lead.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-31T06:45:09Z", "content": "Kia Motors has been working on a raft of new products for its global lineup. The South Korean carmaker has already revealed the new-generation Carnival MPV, new K8 sedan, and EV6 all-electric crossov… [+2051 chars]"}, {"source": {"id": null, "name": "VCCircle"}, "author": null, "title": "KKR acquires Wipro stake in IT services co Ensono - VCCircle", "description": "Bengaluru-headquartered IT (information technology) services major Wipro has sold its stake in hybrid IT services provider Ensono", "url": "https://www.vccircle.com/kkr-acquires-wipro-stake-in-it-services-co-ensono/", "urlToImage": "https://assets.vccircle.com/uploads/2021/05/Wiprorfxl.jpg", "publishedAt": "2021-05-31T06:40:43Z", "content": "Bengaluru-headquartered IT (information technology) services major Wipro has sold its stake in hybrid IT services provider Ensono Holdings for $76.24 million (about Rs 51.7 crore) to global investmen… [+1393 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Paytm's share price jumps by 70 percent in grey market after IPO announcement - Moneycontrol.com", "description": "", "url": "https://www.moneycontrol.com/news/business/companies/paytms-share-price-jumps-by-70-percent-in-grey-market-after-ipo-announcement-6962861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/03/Paytm-770x433.jpg", "publishedAt": "2021-05-31T06:37:24Z", "content": "After reports of Paytm planning to launch an initial public offering (IPO) emerged in the media, the unlisted shares of One97 Communications, the parent company of Paytm has jumped 70 percent, a repo… [+2108 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Amazon Prime Subscription Available at 50 Percent Off for Those Aged Between 18 and 24: All Details - Gadgets 360", "description": "This Youth Offer can only be availed by youngsters aged between 18-24 years. Further, this offer can only be redeemed through the Android app and mobile browser version for any other OS. This means that while the offer is not applicable via the iOS app, it ca…", "url": "https://gadgets.ndtv.com/apps/news/amazon-india-prime-membership-youth-offer-50-percent-off-annual-three-month-subscription-all-details-2452820", "urlToImage": "https://i.gadgets360cdn.com/large/amazon_prime_membership_1622441755889.jpg", "publishedAt": "2021-05-31T06:19:31Z", "content": "Amazon India has announced a Youth offer for new Prime members. This offer makes subscribers aged 18-24 years eligible to get up to Rs. 500 cashback. This offer is applicable for subscribers buying t… [+1932 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Sujata Sangwan", "title": "[Funding alert] Employee health insurance startup Plum raises $15.6M led by Tiger Global - YourStory", "description": "The Bengaluru-based employee health insurance startup will use the funds to scale its engineering, business development, and operations teams.", "url": "https://yourstory.com/2021/05/funding-employee-health-insurance-startup-plum-seriesa-tiger-global/amp", "urlToImage": "https://images.yourstory.com/cs/2/b87effd06a6611e9ad333f8a4777438f/Imageqtnb-1622438742855.jpg", "publishedAt": "2021-05-31T05:58:47Z", "content": "Plum the Bengaluru-based employee health insurance startup that provides health benefits to SMEs, corporates, and startups recently raised $15.6 million in Series A funding led by Tiger Global, with … [+2677 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "TVS Motor Company expands in Iraq, launches two new products - Moneycontrol.com", "description": "The company, which opened a new showroom with sales, service and spares support in Baghdad, said it will launch its commuter motorcycle TVS StaR HLX 150 5 Gear and three-wheeler TVS King Deluxe Plus in that market.", "url": "https://www.moneycontrol.com/news/technology/auto/tvs-motor-company-expands-in-iraq-launches-two-new-products-6963491.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/TVS-NTORQ_-770x433.jpg", "publishedAt": "2021-05-31T05:47:10Z", "content": "TVS Motor Company on Monday said it will launch two new products in Iraq as part of its expansion plan in that country.\r\nThe company, which opened a new showroom with sales, service and spares suppor… [+1617 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Drive Desk", "title": "2021 KTM RC 390, Ducati Panigale V4, and more: Upcoming bikes in June 2021 - Times Now", "description": "2021 KTM RC 390, new KTM RC 200, updated Ducati Panigale V4, and BS6-compliant Ducati Diavel 1260 are some of the motorcycles that are expected to be launched in India next month.", "url": "https://www.timesnownews.com/auto/bike-news/article/2021-ktm-rc-390-ducati-panigale-v4-and-more-upcoming-bikes-in-june/763992", "urlToImage": "https://imgk.timesnownews.com/story/Upcoming_bikes_JUne_21.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-31T05:32:38Z", "content": "The second wave of COVID-19 in the country has taken a toll on the medical infrastructure. With an alarming surge in the number of new cases, several state governments decided to implements restricti… [+2991 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "Gold Price Today: Yellow Metal, Silver Rise; Experts Advise Investors to Go Long - News18", "description": "Gold edged higher on Monday after a muted trend last week.", "url": "https://www.news18.com/news/business/gold-price-today-yellow-metal-silver-rise-experts-advise-investors-to-go-long-3793904.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1621226296_goldbond.jpg", "publishedAt": "2021-05-31T05:01:00Z", "content": "Gold edged higher on Monday after a muted trend last week. On the Multi-Commodity Exchange (MCX), gold futures were up by 0.31% to Rs 49,301 for 10 grams at 10 am on May 31. July silver futures were … [+3782 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "SpiceJet to pay employees based on work hours, defers up to 35% of May salary for some - Moneycontrol", "description": "During the second COVID-19 wave, passenger traffic has fallen to less than 10 percent as compared to the pre-COVID levels, SpiceJet told employees.", "url": "https://www.moneycontrol.com/news/business/spicejet-to-pay-employees-based-on-work-hours-defers-up-to-35-of-may-salary-for-some-6962431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/03/SpiceJet-770x433.jpg", "publishedAt": "2021-05-31T04:54:34Z", "content": "In view of recent developments in the aviation sector and falling air traffic, SpiceJet has decided to revert to the structure where employees will be paid as per the work hours. The airline will, ho… [+1897 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "What should investors do with Divis Laboratories post Q4 results: buy, sell or hold? - Moneycontrol.com", "description": "The company's consolidated profit increased to Rs 502.02 crore in Q4FY21 from Rs 388.23 crore in the corresponding quarter of the last fiscal.", "url": "https://www.moneycontrol.com/news/business/stocks/what-should-investors-do-with-divis-laboratories-post-q4-results-buy-sell-or-hold-6962681.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/AP21045589371918-1-770x433.jpg", "publishedAt": "2021-05-31T04:46:29Z", "content": "Divis Laboratories touched a 52-week high of Rs 4,284.05, rising 4 percent intraday on May 31 after the company reported a healthy double-digit growth in earnings as its consolidated profit increased… [+2406 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "CRED's Kunal Shah takes potshot at Zerodha's 100 crore salary decision, Nithin Kamath defends - Moneycontrol.com", "description": "Nithin clarified this is an enabling resolution that allows them as working promoters to draw salaries up to 100 crores in case of liquidity requirements.", "url": "https://www.moneycontrol.com/news/business/startup/creds-kunal-shah-takes-potshot-at-zerodhas-100-crore-salary-decision-nithin-kamath-defends-6962321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/01/Nithin-Kamath-I-770x433.jpg", "publishedAt": "2021-05-31T04:29:16Z", "content": "After Zerodha's decision to compensate its promotors with Rs 100 crores drew criticism on social media, founder Nithin Kamath took to Twitter to justify the company's decision. One such jibe came fro… [+3212 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "M&M share price falls 6% despite profitable quarter, global brokerages retain 'buy' - Moneycontrol.com", "description": "The auto-maker says it will take at least another two years for car sales to return to their pre-pandemic peak, but a slow pace of vaccinations could hurt recovery.", "url": "https://www.moneycontrol.com/news/business/stocks/mm-share-price-falls-6-despite-profitable-quarter-global-brokerages-retain-buy-6962701.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/thar-mumbai-2-770x433.jpg", "publishedAt": "2021-05-31T04:21:49Z", "content": "Mahindra and Mahindra (M&amp;M) share price was trading lower by more than 6 percent in the morning session on May 31.\r\nThe company on May 28 reported profit before exceptional item at Rs 1,002 crore… [+2943 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sangeeta Ojha", "title": "HDFC Bank revises fixed deposit rates. Check latest FD rates here - Mint", "description": "HDFC Bank revises FD rates: Senior citizens continue to get 50 basis points higher interest rates than the general public", "url": "https://www.livemint.com/money/personal-finance/hdfc-bank-revises-fixed-deposit-rates-check-latest-fd-rates-here-11622432717438.html", "urlToImage": "https://images.livemint.com/img/2021/05/31/600x338/48bcafec-bfcf-11eb-8083-8f092783bf58_1622434563319_1622434612851.jpg", "publishedAt": "2021-05-31T04:18:01Z", "content": "HDFC Bank has revised interest rates on fixed deposits (FDs). After the latest revision, HDFC Bank is offering a 2.50% interest rate on deposits between 7 days and 29 days, and 3 % on deposits maturi… [+1909 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Sindhu Kashyaap", "title": "[Funding alert] Jai Kisan raises $30M in Series A round led by Mirae Asset - YourStory", "description": "The startup said the funding will be used to hire talent and enhance engineering and data science capabilities, expand into new geographies, and start building an on-book portfolio.", "url": "https://yourstory.com/2021/05/funding-jai-kisan-mirae-asset-agritech-fintech-startups/amp", "urlToImage": "https://images.yourstory.com/cs/2/a9efa9c02dd911e9adc52d913c55075e/Imageb728-1622430597422.jpg", "publishedAt": "2021-05-31T03:57:52Z", "content": "Rural fintech startup Jai Kisan has raised $30 million Series A funding led by Mirae Assets. Existing investors Blume Ventures, Arkam Ventures, NABVENTURES (NABARD), Prophetic Ventures, Better, other… [+3345 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Rising stocks, deadly second wave: What’s happening? - Moneycontrol.com", "description": "For Indian equities, the long-term structural liquidity support is hard to ignore and any correction will therefore be short-lived", "url": "https://www.moneycontrol.com/news/companies-2/rising-stocks-deadly-second-wave-whats-happening-6962471.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/rupeegain_dollar-1-770x433.jpg", "publishedAt": "2021-05-31T03:48:53Z", "content": "Highlights- Indian markets outperformance part of the global liquidity tsunami - Markets were resilient during the Spanish Flu a hundred years ago - The second wave of the pandemic risks demand disru… [+8801 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Experts recommend 'buy' on this Rakesh Jhunjhunwala, Radhakishan Damani stock - Mint", "description": "This Rakesh Jhunjhunwala portfolio stock has soared around 39% in the last three trade sessions and the management consulting services company stock is still looking positive on the chart, say experts", "url": "https://www.livemint.com/market/stock-market-news/experts-recommend-buy-on-this-rakesh-jhunjhunwala-radhakishan-damani-stock-11622430955419.html", "urlToImage": "https://images.livemint.com/img/2021/05/31/600x338/Rakesh_Jhunjhunwala_Reuters_1622431252074_1622431274560.jpg", "publishedAt": "2021-05-31T03:25:12Z", "content": "Rakesh Jhunjhunwala, Radhakishan Damai portfolio stocks are closely followed these days by the retail investors and market experts. As per the experts, following Rakesh Jhunjhunwala holdings or any o… [+2115 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "10 things you need to know before the opening bell on May 31 - CNBCTV18", "description": "The Indian market may open lower on Monday amid mixed global cues as the trend on SGX Nifty indicates a negative start for the broader index in India. The Nifty futures were trading 56.00 points or 0.36 percent lower at the 15,436.50 level on the Singaporean …", "url": "https://www.cnbctv18.com/photos/market/stocks/10-things-you-need-to-know-before-the-opening-bell-on-may-31-2-9486711.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/06/2018-06-14T062356Z_1_LYNXMPEE5D0DX_RTROPTP_3_MARKETS-INDIA-SHARES-768x496.jpg", "publishedAt": "2021-05-31T02:37:29Z", "content": "The Indian market may open lower on Monday amid mixed global cues as the trend on SGX Nifty indicates a negative start for the broader index in India. The Nifty futures were trading 56.00 points or 0… [+5034 chars]"}, {"source": {"id": null, "name": "Indiainfoline"}, "author": "India Infoline News Service", "title": "Top stocks in focus: Divis Lab, Affle, Fortis Healthcare, Bank of Baroda, Auro Pharma - Indiainfoline", "description": "Check out the stocks that will be in focus during trade today based on recent and latest news developments.", "url": "https://www.indiainfoline.com/article/news-top-story/top-stocks-in-focus-divis-lab-affle-fortis-healthcare-bank-of-baroda-auro-pharma-121053100005_1.html", "urlToImage": "https://content.indiainfoline.com/_media/iifl/img/misc/2019-08/22/full/stocks-in-focus-1566451994-79251350.jpg", "publishedAt": "2021-05-31T01:35:00Z", "content": "Divis Laboratories: Consolidated profit increased to Rs502.02cr in Q4FY21, from Rs388.23cr in Q4FY20. Consolidated revenue jumped to Rs1,788.19cr, from Rs1,389.71cr yoy.Affle reported strong performa… [+2759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Govt credit scheme for oxygen plants, banks to give Covid loans - The Indian Express", "description": "The overall size of ECLGS, however, has been kept at Rs 3 lakh crore, out of which about Rs 45,000 crore is left to be sanctioned. Those who have already availed loans under the scheme can get additional assistance of up to 10 per cent of outstanding dues as …", "url": "https://indianexpress.com/article/india/govt-credit-scheme-for-oxygen-plants-banks-to-give-covid-loans-7337311/", "urlToImage": "https://images.indianexpress.com/2021/05/credit-line.jpg", "publishedAt": "2021-05-31T01:04:39Z", "content": "As a part of its push to bolster the economy amid the second Covid wave, the Government Sunday expanded the scope of the Emergency Credit Line Guarantee Scheme (ECLGS) to provide more relief to small… [+5334 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Ratan Tata Car Collection – Tata Nexon To Ferrari California - GaadiWaadi.com", "description": "Ratan Tata’s car collection is quite unique, as it consists of a few of your average, everyday cars, as well as sportscars and supercars", "url": "https://gaadiwaadi.com/ratan-tata-car-collection-tata-nexon-to-ferrari-california/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/Ratan-Tata-Land-Rover-Freelander.jpg", "publishedAt": "2021-05-31T01:00:47Z", "content": "Ratan Naval Tata is one of the biggest industrialists in India, with a lot of achievements under his belt. He is the former chairman of Tata Group, a multinational conglomerate that has operations in… [+3776 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Dev Chatterjee & Raghu Mohan", "title": "Lenders terminate bankruptcy proceedings against Lavasa Corporation - Business Standard", "description": "Lenders who have run up Rs 7,700 cr bad loans will call for fresh bids", "url": "https://www.business-standard.com/article/companies/lenders-terminate-bankruptcy-proceedings-against-lavasa-corporation-121053100035_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/31/full/1622404011-0888.jpg", "publishedAt": "2021-05-31T00:40:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Indian logistics giant Delhivery raises $277 million ahead of IPO - TechCrunch", "description": "Delhivery, India’s largest independent e-commerce logistics startup, has raised $277 million in what is expected to be the final funding round before the firm files for an IPO later this year. In a regulatory filing, the Gurgaon-headquartered startup disclose…", "url": "http://techcrunch.com/2021/05/30/indian-logistics-giant-delhivery-raises-277-million-ahead-of-ipo/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-1217989160.jpg?w=591", "publishedAt": "2021-05-30T18:35:52Z", "content": "Delhivery, Indias largest independent e-commerce logistics startup, has raised $277 million in what is expected to be the final funding round before the firm files for an IPO later this year.\r\nIn a r… [+2516 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "SBI raises cash withdrawal limits at non-home branches - The Siasat Daily", "description": "Mumbai: The State Bank of India (SBI) has increased the cash withdrawal limits through cheques and withdrawal forms for its customers at non-home branches. \"To support our customers in this pandemic, SBI has increased the non-home cash withdrawal limits throu…", "url": "https://www.siasat.com/sbi-raises-cash-withdrawal-limits-at-non-home-branches-2144024/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/08/SBI-recruitment.jpg", "publishedAt": "2021-05-30T17:50:00Z", "content": "Mumbai: The State Bank of India (SBI) has increased the cash withdrawal limits through cheques and withdrawal forms for its customers at non-home branches.\r\n“To support our customers in this pandemic… [+986 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Can antibody cocktail used in Trump's treatment be 'game changer' in India's Covid fight? - Times of India", "description": "India News: NEW DELHI: Last week, an 84-year-old man from Haryana was administered the \"famous\" anti-Covid cocktail that was also given to former US President Don.", "url": "https://timesofindia.indiatimes.com/india/how-low-cost-antibody-cocktail-can-be-game-changer-in-indias-covid-fight/articleshow/83089132.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83089294,width-1070,height-580,imgsize-315900,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-30T14:59:00Z", "content": "Haryana man, 84, first Indian to get Trump cocktailNEW DELHI: Mohabbat Singh, 84, from Haryana has become the first person in India to be administered the famous Covid drug cocktail given to former U… [+148 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "Muzaffar Rizvi", "title": "Oil to ‘overshoot’ in Q2 - Khaleej Times", "description": "Oil prices would likely further pick up ahead of an Opec+ meeting this week despite a delayed resumption in passenger aviation and worsening coronavi...", "url": "https://www.khaleejtimes.com/business/energy/oil-to-overshoot-in-q2", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20210530/ARTICLE/210539908/AR/0/AR-210539908.jpg&NCS_modified=20210530154437&exif=.jpg", "publishedAt": "2021-05-30T13:49:08Z", "content": "Oil prices would likely further pick up ahead of an Opec+ meeting this week despite a delayed resumption in passenger aviation and worsening coronavirus infections in India, experts say.\r\nAnalysts an… [+4462 chars]"}]}