{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Trade setup for Monday: Top 15 things to know before Opening Bell - Moneycontrol.com", "description": "Trade Setup | Nagaraj Shetti of HDFC Securities feels the short term trend of Nifty continues to be weak with high volatility. \"Placement of support around 17,600-17,500 levels and a formation of Doji at the swing lows on Friday pointing towards a possibility…", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-168-7969591.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/nifty_sensex_stocks-770x433.jpg", "publishedAt": "2022-01-23T13:35:03Z", "content": "It was another weak session for the market as benchmark indices corrected seven-tenth of a percent on January 21, as selling was seen across sectors barring FMCG, while the volatility increased signi… [+9102 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "2022 BMW X3 Launched In India At Rs 50 Lakhs - CarToq.com", "description": "The Munich based luxury automaker BMW recently launched the third generation of its highly successful SUV X3 in India at the ex-showroom price of Rs 59.9 lakh. The Premium mid-size Sports Activity Vehicle’s (SAV) newest iteration has made its India debut with…", "url": "https://www.cartoq.com/2022-bmw-x3-launched-in-india-at-rs-50-lakhs/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/01/2022-bmw-x3-india-fb.jpg", "publishedAt": "2022-01-23T13:05:44Z", "content": "The Munich based luxury automaker BMW recently launched the third generation of its highly successful SUV X3 in India at the ex-showroom price of Rs 59.9 lakh. The Premium mid-size Sports Activity Ve… [+4196 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Electric vehicles: IIT researchers develop new tech; to cut down charging cost by half - Mint", "description": "The technology has been developed at IIT (BHU), Varanasi, in collaboration with experts from IIT Guwahati and IIT Bhubaneshwar", "url": "https://www.livemint.com/auto-news/electric-vehicle-charging-new-iit-research-may-help-in-slashing-prices-by-half-11642939361463.html", "urlToImage": "https://images.livemint.com/img/2022/01/23/600x338/electric_vehicle_charging_1642940303966_1642940304127.jpg", "publishedAt": "2022-01-23T12:32:21Z", "content": "With the aim to reduce the cost of electric vehicles, researchers from IIT have developed a new technology for an on-board charger for EVs that can cut one additional power electronics interface requ… [+2464 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Quick Commerce : Delivery race among grocery startups heats up road safety issues - Moneycontrol", "description": "Their mission: pack groceries within a few minutes at so-called dark stores, or small warehouses in densely populated neighbourhood buildings, and send bike riders to nearby locations with about seven minutes to spare.", "url": "https://www.moneycontrol.com/news/business/quick-commerce-delivery-race-among-grocery-startups-heats-up-road-safety-issues-7972591.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Express-delivery-770x433.jpg", "publishedAt": "2022-01-23T12:13:45Z", "content": "Indian grocery startups are luring tech-savvy customers with the promise of deliveries within 10 minutes, sparking a boom in \"quick commerce\", but heating up concerns about road safety as bike riders… [+5088 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Sandeep Singh", "title": "D-Street week ahead: Fed rate decision, Q3 earnings, F&O expiry likely to influence market - CNBCTV18", "description": "Key factors to watch on Dalal Street: India Inc Q3 earnings, a key rate decision by the Fed and the expiry of monthyl F&O contracts will be on investors' radar in the holiday-truncated week starting January 24. Expectations from the upcoming Budget and update…", "url": "https://www.cnbctv18.com/market/stocks/d-street-week-ahead-india-inc-q3-earnings-fed-rate-decision-omicron-covid-19-fo-expiry-budget-2022-key-factors-to-watch-12219882.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/07/BSE-Sensex-1019x573.jpg", "publishedAt": "2022-01-23T10:18:00Z", "content": "MiniKey factors to watch on Dalal Street: India Inc Q3 earnings, a key rate decision by the Fed and the expiry of monthyl F&amp;O contracts will be on investors' radar in the holiday-truncated week s… [+118 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Amazon writes to Future; confirms Samara Capital ready to invest ₹7,000 cr - Mint", "description": "On January 19, Amazon had approached the independent directors of FRL reiterating its willingness to assist the Mumbai-based company in addressing its financial concerns.", "url": "https://www.livemint.com/companies/amazon-writes-to-future-retail-confirms-samara-capital-is-ready-to-invest-11642931480424.html", "urlToImage": "https://images.livemint.com/img/2022/01/23/600x338/JeffBezos_1642696388993_1642931705815.jpg", "publishedAt": "2022-01-23T09:55:52Z", "content": "Amazon has written to independent directors of Future Retail Ltd (FRL), confirming that Samara Capital \"remains interested and committed\" to invest 7,000 crore for buying all retail assets of the deb… [+3337 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India Inc staring at 'integrity crisis', top management ought to act: Survey - Economic Times", "description": "The global survey conducted by the consultancy firm EY, which saw executives from 100 companies, including chief executives, board members and also mid-management personnel participate, has found concerning details like 59 per cent of the respondents feeling …", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/india-inc-staring-at-integrity-crisis-top-management-ought-to-act-survey/articleshow/89073895.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89073930,width-1070,height-580,imgsize-1083231,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-23T09:50:00Z", "content": "India Inc is staring at an \"integrity crisis\" in the second year of the pandemic, a survey done by a consultancy firm has revealed.\r\nThe global survey conducted by the consultancy firm EY, which saw … [+1984 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Cars launching in India by March 2022 - HT Auto", "description": "Two of the most exciting cars launching in India by March 2022 will be Kia Carens and Toyota Hilux.", "url": "https://auto.hindustantimes.com/auto/cars/cars-launching-in-india-by-march-2022-41642925749626.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/01/23/600x338/Upcoming_cars_1642927939412_1642927947489.jpg", "publishedAt": "2022-01-23T09:00:47Z", "content": "The Indian auto market is witnessing a revival of demand as consumers are showing more interest in buying new passenger vehicles boosted by the preference for personal mobility. Several automakers ar… [+4098 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Anil Agarwal to set up $10 billion fund to hunt for govt assets - Economic Times", "description": "Metals and mining magnate Anil Agarwal's group has expressed interest to acquire government stake in Bharat Petroleum Corporation Ltd (BPCL) and SCI, worth over USD 12 billion.  We are creating a USD 10 billion fund,  Agarwal said in an interview.", "url": "https://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/anil-agarwal-to-set-up-10-billion-fund-to-hunt-for-govt-assets/articleshow/89073132.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89073139,width-1070,height-580,imgsize-51126,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-23T08:48:00Z", "content": "Vedanta Resources Ltd's plan to set up a USD 10 billion fund to acquire state-owned firms has attracted interest from sovereign wealth funds and the corpus will be floated once the government invites… [+2536 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Mobikwik expects to double revenue this fiscal, stays cautious on IPO launch - Moneycontrol", "description": "The company, which posted a narrowing of loss to Rs 111.3 crore and revenue of Rs 302.25 crore in the financial year 2021, expects to double the revenue by the end of current financial year.", "url": "https://www.moneycontrol.com/news/business/mobikwik-expects-to-double-revenue-this-fiscal-stays-cautious-on-ipo-launch-7972231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Mobikwik-Shutterstock-2-770x433.jpg", "publishedAt": "2022-01-23T08:30:45Z", "content": "IPO-bound fintech firm Mobikwik is expecting to close the current financial year with 100 per cent revenue growth, a top company official said.\r\nMobikwik chairperson and chief operating officer Upasa… [+3073 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Ahead of Budget 2022, global trends, quarterly earnings, FIIs to guide equity market this week - Mint", "description": "The domestic market is expected to remain highly volatile with investors awaiting the outcome of the upcoming Budget announcement.Equity markets will look for directions from global trends, ongoing quarterly earnings and investment patterns of FIIs, analysts …", "url": "https://www.livemint.com/market/stock-market-news/ahead-of-budget-2022-global-trends-quarterly-earnings-fiis-to-guide-equity-market-this-week-11642923472973.html", "urlToImage": "https://images.livemint.com/img/2022/01/23/600x338/shares-kEhG--621x414@LiveMint_1642923581790.jpg", "publishedAt": "2022-01-23T08:23:22Z", "content": "Ahead of holiday-shortened week on account of Republic Day as well as highly volatile domestic market amid investors awaiting the outcome of the upcoming Budget announcement, equity markets will look… [+3501 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Lamborghini bullish on India ranking higher in its top 10 markets in APAC region - Moneycontrol", "description": "China was also the second ranked market globally for the company in 2021 with 935 units sold. The third ranked market in Asia Pacific (APAC), South Korea, clocked 354 units last year. Thailand with 75 units was also ahead of India.", "url": "https://www.moneycontrol.com/news/business/lamborghini-bullish-on-india-ranking-higher-in-its-top-10-markets-in-apac-region-7972201.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/LamborghiniHuracanSTO2-1-770x433.jpeg", "publishedAt": "2022-01-23T08:13:59Z", "content": "Italian super luxury carmaker Automobili Lamborghini is bullish on India to rank higher in its top 10 markets in the Asia Pacific region going forward, buoyed by strong consistent performance over th… [+2685 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shubham Raj", "title": "The week that was: Likes of Paytm, Zomato in spotlight as tech stocks fall out of favour - Economic Times", "description": "The sell-off was more profound among the technology stocks, which took a lead from selling in Nasdaq-listed tech names. Rising inflation, geopolitical tensions in Europe and surging crude oil prices also dampened the mood on Dalal Street.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/the-week-that-was-likes-of-paytm-zomato-in-spotlight-as-tech-stocks-fall-out-of-favour/articleshow/89071947.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89071924,width-1070,height-580,imgsize-65768,overlay-etmarkets/photo.jpg", "publishedAt": "2022-01-23T07:24:00Z", "content": "NEW DELHI: There were more losers than gainers on Dalal Street in the week gone by. In the BSE 500 index, there were just 86 gainers, meaning every 4 out of 5 stocks closed with cuts.\r\nThe sell-off w… [+2726 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Lamborghini to bid farewell to pure combustion cars this year - Mint", "description": "The manufacturer is still working on a final design for its first electric car and is leaning toward a four-door model.It will unveil its first production car with a plug next year", "url": "https://www.livemint.com/auto-news/lamborghini-to-bid-farewell-to-pure-combustion-cars-this-year-11642918511356.html", "urlToImage": "https://images.livemint.com/img/2022/01/23/600x338/Lamborghini_Urus_SUV_1642916935585_1642918707811.png", "publishedAt": "2022-01-23T06:22:05Z", "content": "Lamborghini is gearing up for the final lap of combustion engines powering coveted models like the Aventador as the sports-car maker switches its lineup to plug-in hybrids. \r\nThe Volkswagen AG brand … [+1667 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sohini Sengupta", "title": "Anand Mahindra says much to learn from video of Chennai auto driver, tags Mahindra Electric CEO Suman Mishra - Hindustan Times", "description": "The Twitter video originally shared by The Better India, was retweeted by Anand Mahindra where he complimented this Chennai auto driver's managerial skills. | Trending", "url": "https://www.hindustantimes.com/trending/anand-mahindra-says-much-to-learn-from-video-of-chennai-auto-driver-tags-mahindra-electric-ceo-suman-mishra-101642915011776.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/23/1600x900/Anand_Mahindra_retweets_video_of_talented_Chennai_auto_driver_tags_Mahindra_CEO_1642916861891_1642916880353.png", "publishedAt": "2022-01-23T05:50:07Z", "content": "Anand Mahindra, the Chairperson of Mahindra and Mahindra, often takes to Twitter to share motivational videos. This time, he has retweeted a video posted by the Twitter handle of The Better India. He… [+1583 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "LIC Policy: Get Rs 20 lakh on maturity by investing Rs 252 per day, here`s how - Zee News", "description": "Life Insurance Corporation of India (LIC) offers a slew of policies providing impressive returns with safety on investments, offering investors a chance to secure their retirement.", "url": "https://zeenews.india.com/personal-finance/lic-policy-get-rs-20-lakh-on-maturity-by-investing-rs-252-per-day-here-s-how-2430066.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/01/23/1007936-untitled-design-45.jpg", "publishedAt": "2022-01-23T05:26:21Z", "content": "New Delhi: Life Insurance Corporation of India (LIC) offers a slew of policies providing impressive returns with safety on investments, offering investors a chance to secure their retirement. Individ… [+2165 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Toddler accidentally orders furniture worth Rs 1.4 lakh online on his mother's phone - Times Now", "description": "The father said he will use facial recognition and passcodes on mobile devices from here on.", "url": "https://www.timesnownews.com/the-buzz/article/toddler-accidentally-orders-furniture-worth-rs-1-4-lakh-online-on-his-mothers-phone/852125", "urlToImage": "https://imgk.timesnownews.com/story/FRY.png?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-23T05:03:06Z", "content": "<ul><li>The child ordered furniture worth $2,000 from his mother's phone</li></ul>\r\n<ul><li>The accidental purchase happened after Ayaansh's mother left some items in her shopping cart after having b… [+2138 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Movers & Shakers | Top 10 stocks that moved the most last week - Moneycontrol.com", "description": "On the sectoral front, BSE Information Technology index lost 6.5 percent, BSE Telecom index fell 5.8 percent and Nifty Pharma index shed 5.2 percent. However, the BSE Power index added 2.6 percent.", "url": "https://www.moneycontrol.com/news/photos/business/stocks/movers-shakers-top-10-stocks-that-moved-the-most-last-week-36-7971511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/01/sensex_nifty_sensex_market-3-770x430.jpg", "publishedAt": "2022-01-23T04:59:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "What Budget 2022 can do to power up EV charging scene - Economic Times", "description": "The need for EV charging investment and deployment is irrefutable. But the demand and other uncertainties combine to make public charging infrastructure risky and an unattractive investment. To achieve scale, debt financing is critical, and the industry must …", "url": "https://economictimes.indiatimes.com/industry/renewables/what-budget-2022-can-do-to-power-up-ev-charging-scene/articleshow/89069935.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89069922,width-1070,height-580,imgsize-59188,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-23T04:43:00Z", "content": "The government of India through Ministry of Power recently promulgated the Revised Consolidated Guidelines &amp; Standards for Charging Infrastructure for Electric Vehicles (EV) on 15 January 2022. A… [+8197 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Ether, Solana, memecoins prove to be more vulnerable than Bitcoin - Economic Times", "description": "Over the past seven trading days, Bitcoin has shed around 20% of its value compared with nearly 30% for Ether. Solanas SOL and DeFi-play Avalanches AVAX token have fallen nearly 38% each. And the wipeout in memecoins has been profound: Dogecoin is down 30% on…", "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/ether-solana-memecoins-prove-to-be-more-vulnerable-than-bitcoin/articleshow/89069528.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89069542,width-1070,height-580,imgsize-62907,overlay-etmarkets/photo.jpg", "publishedAt": "2022-01-23T04:26:00Z", "content": "The risk-off attitude and selling pressure across the global crypto market showed no sign of abating on Saturday, with Bitcoin sliding 4% and Ether down some 7% in late-afternoon US trading after an … [+2242 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "After HDFC and Axis, ICICI Bank hikes fixed deposit interest rates: Check latest FD rates - Zee News", "description": "ICICI Bank has increased the interest rates on fixed deposits, following in the footsteps of peer private lenders such as HDFC Bank and Axis Bank. The latest FD rates are applicable on both new and old FD accounts.", "url": "https://zeenews.india.com/personal-finance/after-hdfc-and-axis-icici-bank-hikes-fixed-deposit-interest-rates-check-latest-fd-rates-2430052.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/01/23/1007920-untitled-design-43.jpg", "publishedAt": "2022-01-23T04:16:50Z", "content": "New Delhi: ICICI Bank has increased the interest rates on fixed deposits, following in the footsteps of peer private lenders such as HDFC Bank and Axis Bank. The latest FD rates are applicable on bot… [+1813 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Old Mahindra Thar Modified Into New-Gen Model By Azad 4×4 – Video - GaadiWaadi.com", "description": "Here, we have an old-generation Mahindra Thar, which has been masterfully customised to look like the new-generation version", "url": "https://gaadiwaadi.com/old-mahindra-thar-modified-into-new-gen-model-by-azad-4x4-video/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/01/Old-Mahindra-Thar-modified-into-new-model-img1.jpg", "publishedAt": "2022-01-23T04:00:45Z", "content": "Mahindra Thar is currently one of the most sought-after cars in the Indian market, with a waiting period of up to a year! Due to its long waiting period, a lot of Thar fans get discouraged from buyin… [+1955 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Petrol, Diesel Prices Today on January 23: Check rates in Delhi, Mumbai and other cities - Moneycontrol", "description": "Petrol and diesel prices remained unchanged for the 79th day, in the second-longest pause in rates since the introduction of daily price revision in June 2017", "url": "https://www.moneycontrol.com/news/india/petrol-diesel-prices-today-on-january-23-check-rates-in-delhi-mumbai-and-other-cities-7971731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/petroldieselpetrol-pumpfuel-station-770x433.jpg", "publishedAt": "2022-01-23T02:39:29Z", "content": "Petrol and diesel prices remained unchanged for the 79th day in a row on January 23, according to a price notification by state-owned fuel retailers.\r\nThis is the second-longest pause in fuel prices … [+2499 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Elon Musk Criticizes Twitter — Gets Blasted for Using Tesla to Promote Crypto, Dogecoin – Featured Bitcoin News - Bitcoin News", "description": "Tesla and Spacex CEO Elon Musk has criticized Twitter for using its engineering resources on providing an NFT profile picture service.", "url": "https://news.bitcoin.com/elon-musk-criticizes-twitter-gets-blasted-using-tesla-promote-crypto-dogecoin/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/01/musk.jpg", "publishedAt": "2022-01-23T02:36:50Z", "content": "Tesla and Spacex CEO Elon Musk has criticized Twitter for using its engineering resources to provide a non-fungible token (NFT) profile picture service. “Twitter is spending engineering resources on … [+2868 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Mahindra XUV700 MX & Hyundai Creta in a space & comfort comparison test [Video] - CarToq.com", "description": "Mahindra XUV700 is currently the most technologically advanced and feature loaded SUV from Mahindra. It became popular among buyers due to its looks, features and attractive price tag. Demand for this SUV is so high that it currently has a waiting period of o…", "url": "https://www.cartoq.com/mahindra-xuv700-mx-hyundai-creta-space-comfort-comparison-test/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/01/XUV700-vs-creta-featured.jpg", "publishedAt": "2022-01-23T02:15:30Z", "content": "Mahindra XUV700 is currently the most technologically advanced and feature loaded SUV from Mahindra. It became popular among buyers due to its looks, features and attractive price tag. Demand for thi… [+2957 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Shahid Iqbal", "title": "Current account deficit swells to $9.09bn in July-December - DAWN.com", "description": "Represents 5.7 per cent of GDP, far above govt’s 4pc target.", "url": "https://www.dawn.com", "urlToImage": "http://www.dawn.com/_img/social-default.jpg", "publishedAt": "2022-01-23T02:05:34Z", "content": "KARACHI: The countrys current account deficit surpassed $9 billion in the first half of the ongoing fiscal year, accounting for 5.7 per cent of the gross domestic product, the State Bank of Pakistan … [+2448 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "HFCL terms Sterlite's patent infringement claims baseless - Economic Times", "description": "The Delhi High Court had on January 12 restrained HFCL and its subsidiaries from manufacturing and selling optic fibre cables, which Sterlite Technologies claimed were based on its multi-tube technology.", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/hfcl-terms-sterlites-patent-infringement-claims-baseless/articleshow/89067750.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89067810,width-1070,height-580,imgsize-98186,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-23T00:52:00Z", "content": "Home-grown telecom equipment maker (HFCL) on Saturday termed as \"baseless\" broadband technology firm ' claim that it was making and selling a type of optical fibre cable on which Sterlite has a paten… [+1643 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "El Salvador Buys 410 Bitcoins as BTC Plunges to Lowest Level in Months – Featured Bitcoin News - Bitcoin News", "description": "El Salvador bought the dip as President Nayib Bukele said Friday that his country has purchased 410 more bitcoins.", "url": "https://news.bitcoin.com/el-salvador-buys-410-bitcoins-btc-plunges-lowest-level/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/01/el-salvador.jpg", "publishedAt": "2022-01-23T00:32:11Z", "content": "El Salvador bought the dip as the price of bitcoin plunged to a record low. President Nayib Bukele said Friday that his country has purchased 410 more bitcoins. The Salvadoran government has bought a… [+2950 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rasul Bailay", "title": "FabIndia files DRHP with Sebi for IPO - Economic Times", "description": "“The offer comprises a fresh issue of up to Rs 500 crore and an offer for sale of 25,050,543 equity shares by existing investors/ shareholders,” according to the draft red herring prospectus filed with the market regulators on Saturday.", "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/fabindia-files-drhp-with-sebi-for-ipo/articleshow/89063820.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89063814,width-1070,height-580,imgsize-48042,overlay-etmarkets/photo.jpg", "publishedAt": "2022-01-22T16:17:00Z", "content": "Ethnic-wear brand Fabindia on Saturday has filed prospectus with the market regulators for an initial public offering (IPO). \r\nThe offer comprises a fresh issue of up to Rs 500 crore and an offer for… [+2121 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Auto folding mirrors deleted from Skoda Kushaq & Volkswagen Taigun due to chip shortage - CarToq.com", "description": "Skoda and Volkswagen have removed auto-folding outside rearview mirrors from Kushaq and Taigun. This has been done for all the variants. So, even if you opt for the top-spec variant, you will have to manually fold the outside rearview mirrors. The reason behi…", "url": "https://www.cartoq.com/auto-folding-mirrors-deleted-from-skoda-kushaq-volkswagen-taigun-due-to-chip-shortage/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/01/ORVM-removed-from-Kushaq-featured.jpg", "publishedAt": "2022-01-22T16:01:56Z", "content": "Skoda and Volkswagen have removed auto-folding outside rearview mirrors from Kushaq and Taigun. This has been done for all the variants. So, even if you opt for the top-spec variant, you will have to… [+2858 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Exclusive: SEBI pulls up PTC India Financial, says no board meeting till corporate governance issue... - Moneycontrol.com", "description": "The company received an email on Saturday from the regulator, ahead of its board meeting which was scheduled for later in the day", "url": "https://www.moneycontrol.com/news/business/economy/exclusive-sebi-pulls-up-ptc-india-financial-says-no-board-meeting-till-corporate-governance-issue-addressed-7971451.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/Deal-business-770x433.jpg", "publishedAt": "2022-01-22T15:24:41Z", "content": "Securities and Exchange Board of India has pulled up PTC India Financial Services (PFS), asking the company not to hold a board meeting until the corporate governance issues are addressed and the com… [+4951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "Explained: The concern over 5G and flight safety - The Indian Express", "description": "🔴 Flights to the United States from India were briefly suspended after the Federal Aviation Administration warned that the rollout of new 5G technology could potentially lead to interference with onboard instruments.", "url": "https://indianexpress.com/article/explained/explained-the-concern-over-5g-and-flight-safety-7734049/", "urlToImage": "https://images.indianexpress.com/2022/01/plane.jpg", "publishedAt": "2022-01-22T14:19:57Z", "content": "Flights to the United States from India resumed on Thursday as the Federal Aviation Administration (FAA) cleared the landing of more aircraft even in low-visibility conditions, despite the rollout of… [+3544 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "In Pics: Reliance Industries' recent acquisitions and investments - Moneycontrol.com", "description": "From Dunzo to Addverb Technologies, here's a look at all the recent investments and acquisitions Reliance Industries has had in the past few months.", "url": "https://www.moneycontrol.com/news/photos/business/in-pics-reliance-industries-recent-acquisitions-and-investments-7970991.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Deal-770x433.jpg", "publishedAt": "2022-01-22T13:06:14Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": "David Delima", "title": "Instagram Subscriptions Feature Spotted in India, Allows Users to Pay for Exclusive Content - Gadgets 360", "description": "Instagram recently announced paid subscriptions for a small group of creators in the US, allowing influencers and content creators to share exclusive content with paying subscribers. Instagram users in India are now able to subscribe to some of these creators…", "url": "https://gadgets.ndtv.com/social-networking/news/instagram-subscriptions-india-price-exclusive-content-lives-stories-purple-badge-2723782", "urlToImage": "https://i.gadgets360cdn.com/large/instagram_brett_jordan_unsplash_1642856059420.jpg", "publishedAt": "2022-01-22T13:00:11Z", "content": "Instagram recently began testing paid subscriptions with a few content creators and influencers in the US, allowing them to charge their followers a monthly fee in exchange for exclusive content, liv… [+2020 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Subrata Panda", "title": "ICICI Bank Q3 net profit jumps 25% to Rs 6,194 cr; NII rises 23% - Business Standard", "description": "Asset quality of the bank improved and its provisions fell 27% to Rs 2,007 in Q3FY22 from Rs 2,742 crore in Q3FY21", "url": "https://www.business-standard.com/article/companies/icici-bank-q3-net-profit-jumps-25-to-rs-6-194-cr-nii-rises-23-122012200863_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/hp/home-page/2021-07/24/full/1627129943-7426.jpg", "publishedAt": "2022-01-22T12:39:00Z", "content": "Private sector lender ICICI Bank on Saturday reported a 25 per cent jump in net profit in the October–December quarter (Q3FY22), aided by lower provisions and a robust increase in net interest income… [+3926 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Public wifi hotspots have potential to generate 2-3 cr jobs this year : Telecom Secretary - Economic Times", "description": "Telecom Secretary K Rajaraman while speaking at Broadband India Forum (BIF) event called upon wifi equipment makers to lower the cost of their products for the expansion of Prime Minister's Wi-Fi Access Network Interface (PM-WANI) scheme which aims to set up …", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/public-wifi-hotspots-have-potential-to-generate-2-3-cr-jobs-this-year-telecom-secretary/articleshow/89060136.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89060136,width-1070,height-580,imgsize-41796,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-22T11:55:00Z", "content": "Setting up of 1 crore public wifi hotspots across the country by this year as envisaged under the present telecom policy has the potential to create 2-3 crore job opportunities, a senior government o… [+2216 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Top 10 Scooters In Dec 2021 - Activa, Access, Ntorq, Dio, Fascino, Jupiter - GaadiWaadi.com", "description": "Honda Activa was the most sold scooter in India in December 2021 as 1,04,417 units were sold against 1,34,977 units with a YoY sales de-growth of 22.6 per cent", "url": "https://gaadiwaadi.com/top-10-scooters-in-dec-2021-activa-access-ntorq-dio-fascino-jupiter/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/10/tvs-ntorq-race-xp.jpg", "publishedAt": "2022-01-22T11:52:00Z", "content": "In the final month of the calendar year 2021, Honda had the Activa finish on top of the sales standings as it dominated with 1,04,417 unit sales as against 1,34,977 units during the same period in 20… [+2533 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Auto Desk", "title": "Hero Xpulse 200 4V Bookings Reopen at Rs 10,000 in India - Details Here - News18", "description": "Hero MotoCorp announced that it has started accepting bookings for the second batch of the Xpule 200 4V after the first lot was fully sold out.", "url": "https://www.news18.com/news/auto/hero-xpulse-200-4v-bookings-reopen-at-rs-10000-in-india-details-here-4683644.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/10/2021-hero-xpulse-200-4v-164285034316x9.jpg", "publishedAt": "2022-01-22T11:20:00Z", "content": "In a move to further strengthen its digital initiatives and contactless customer experience, Hero MotoCorp announced the bookings for the second lot of its popular XPluse 200 4V on Thursday. The home… [+1859 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Anna Andrianova", "title": "Russian Crypto Ban Would Drive Out IT Professionals, Durov Warns - Bloomberg", "description": "Russia’s proposed ban on cryptocurrencies could destroy several technology industries and drive IT professionals abroad, said Pavel Durov, CEO and co-founder of the Telegram messaging app.", "url": "https://www.bloomberg.com/news/articles/2022-01-22/russian-crypto-ban-would-drive-out-it-professionals-durov-warns", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iP2Hu6SC_fJk/v1/1200x800.jpg", "publishedAt": "2022-01-22T11:13:16Z", "content": "Russia’s proposed ban on cryptocurrencies could destroy several technology industries and drive IT professionals abroad, said Pavel Durov, CEO and co-founder of the Telegram messaging app. \r\n“The \r\nB… [+226 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anuj Tiwari", "title": "15 Instances When Ratan Tata Proved That He Is A True Gem Of The Country - India Times", "description": "A Padma Bhushan and Padma Vibhushan awardee, philanthropist and one of the most successful businessmen the country has ever produced, Ratan Tata’s legacy speaks for itself. Apart from possessing remarkable business foresight, he is also known for his utmost s…", "url": "https://www.indiatimes.com/trending/human-interest/ratan-tata-man-with-golden-heart-560055.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jan/ratan-tata-india_61ebdf24c3f53.jpg", "publishedAt": "2022-01-22T10:35:47Z", "content": "A Padma Bhushan and Padma Vibhushan awardee, philanthropist and one of the most successful businessmen the country has ever produced, Ratan Tatas legacy speaks for itself. Apart from possessing remar… [+10996 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "ASG Transact Tech IPO: What GMP signals as all eyes set on allotment date - Mint", "description": "ASG Transact Technologies GMP today is  ₹15, which is  ₹5 higher from its yesterday's grey market premium of  ₹10", "url": "https://www.livemint.com/market/ipo/asg-transact-tech-ipo-what-gmp-signals-as-all-eyes-set-on-allotment-date-11642842822126.html", "urlToImage": "https://images.livemint.com/img/2022/01/22/600x338/ASG_Transact_Technologies_IPO_GMP_today_1642842879801_1642842899949.PNG", "publishedAt": "2022-01-22T09:27:55Z", "content": "ASG Transact Tech IPO: Bidding for the public issue worth 680 closed yesterday and now all eyes are set on ASG Transact Technologies IPO, which is likely on 27th January 2022. As per ASG Transact Tec… [+2954 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "This Toyota SUV has a four-year long waiting period - HT Auto", "description": "Toyota Land Cruiser LC300 comes loaded to the teeth with latest features and advanced tech and the company is dependent on the semiconductor chips to successfully manufacture the car.\nToyota has rolled out a statement accepting that the waiting period for its…", "url": "https://auto.hindustantimes.com/auto/cars/this-toyota-suv-has-a-four-year-long-waiting-period-41642839302866.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/01/22/600x338/2022-toyota-land-cruiser_1642842618173_1642842621331.jpg", "publishedAt": "2022-01-22T09:12:51Z", "content": "Toyota introduced the new and improved Land Cruiser LC300 last year. The new-gen model comes out as a big step up over its predecessor. While there were early rumours that chip shortage is taking a t… [+1773 chars]"}, {"source": {"id": null, "name": "91mobiles"}, "author": null, "title": "Cheapest 84 days recharge plan: Rs 395 Jio vs Rs 455 Airtel vs Rs 459 Vi vs Rs 429 BSNL - 91mobiles", "description": "Are you looking for an affordable 84 days recharge plan? Here is a list of the cheapest 84 days plans across Jio, Airtel, vi, and BSNL.", "url": "https://www.91mobiles.com/hub/cheapest-84-days-recharge-plan/", "urlToImage": "https://www.91-cdn.com/hub/wp-content/uploads/2022/01/84-days-validity-recharge-plans.jpg", "publishedAt": "2022-01-22T09:08:17Z", "content": "These are the most affordable 84-days plans across Jio, Airtel, and Vi.\r\n84 days recharge plans are probably the most balanced recharge packs, in terms of benefits and price, out there. They don’t hi… [+2814 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Jio completes 5G coverage plans for top 1,000 cities in country - Economic Times", "description": "5G coverage planning has been completed for 1,000 top cities across the country. Jio has been doing trials on advanced use cases across healthcare and industrial automation on its 5G network,  Jio said in a statement.", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/jio-completes-5g-coverage-plans-for-top-1000-cities-in-country/articleshow/89057266.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89057273,width-1070,height-580,imgsize-27586,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-22T09:07:00Z", "content": "Jio has completed 5G network coverage planning for top 1,000 cities in the country and is augmenting its fibre capacity as well as running pilot across sites, a senior company official said during a … [+2709 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Current economic landscape may not allow government to go for fiscal consolidation immediately: YES Bank... - Moneycontrol.com", "description": "\"Expenditure needs are clearly cut-out and the government should not shy away from them to attain its objective of fiscal consolidation. The good thing is that resource generation might not be the biggest problem in FY23 as, with sticky inflation, nominal gro…", "url": "https://www.moneycontrol.com/news/business/markets/current-economic-landscape-may-not-allow-government-to-go-for-fiscal-consolidation-immediately-yes-bank-chief-economist-7970211.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/budget-2022-770x433.jpg", "publishedAt": "2022-01-22T08:13:11Z", "content": "Indranil Pan, chief economist at YES Bank\r\nIt is that time of the year when markets await the Union Budget. From the time COVID-19 hit, the government has agreed to take a large GFD/GDP ratio (gross … [+4726 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "India likely to go back to real GDP growth trend of 6.5% with these three drivers of economy firing:... - Moneycontrol.com", "description": "\"Given the rally in 2021, easy money has already been made and 2022 can be looked at as a year of transition as excess liquidity gets withdrawn and interest rates inch up.\"", "url": "https://www.moneycontrol.com/news/business/economy/india-likely-to-go-back-to-real-gdp-growth-trend-of-6-5-with-these-three-drivers-of-economy-firing-aditya-birla-sun-life-amcs-cio-7970391.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Economy-770x435.jpg", "publishedAt": "2022-01-22T07:54:03Z", "content": "Mahesh Patil, CIO, Aditya Birla Sun Life AMC\r\nIn 2021, global equity markets attained new all-time highs driven by strong corporate earnings growth even in the face of COVID restrictions, supply chai… [+4916 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Payments Council urges rollback of Zero-MDR policy for UPI and Rupay debit cards - Moneycontrol.com", "description": "The policy which came into effect in January 2020 mandates that merchants should not be levied any charges on accepting payments", "url": "https://www.moneycontrol.com/news/business/budget/payments-council-urges-rollback-of-zero-mdr-policy-for-upi-and-rupay-debit-cards-7970561.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/UPI-1-770x433.jpg", "publishedAt": "2022-01-22T06:46:44Z", "content": "The Payments Council of India (PCI), the industry body for digital payments, yesterday said it has requested the finance ministry to roll back the Zero-Merchant Discount Rate (MDR) policy for Unified… [+2366 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Elon Musk`s startup Neuralink nears human trials for chip implant in brain - Zee News", "description": "Elon Musk-run brain-machine interface company Neuralink is preparing to launch clinical trials that will implant brain chips in humans.", "url": "https://zeenews.india.com/companies/elon-musks-startup-neuralink-nears-human-trials-for-chip-implant-in-brain-2429840.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/01/22/1007658-untitled-design-33.jpg", "publishedAt": "2022-01-22T05:56:49Z", "content": "New Delhi: Elon Musk-run brain-machine interface company Neuralink is preparing to launch clinical trials that will implant brain chips in humans. According to dailymail.co.uk, the firm is hiring a c… [+1864 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Drive Desk", "title": "Toyota Hilux vs Isuzu D-Max V-Cross: Specs, features, dimensions, etc. compared - Times Now", "description": "Toyota yesterday unveiled the Hilux pickup truck in India and will announce its price in March 2022. However, the Japanese brand has revealed almost every detail about this lifestyle vehicle, including the performance specs and feature list. So, let's quickly…", "url": "https://www.timesnownews.com/auto/compare-cars/article/toyota-hilux-vs-isuzu-d-max-v-cross-specs-features-dimensions-etc-compared/851591", "urlToImage": "https://imgk.timesnownews.com/story/Hilux_vs_Vcross.png?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-22T05:01:02Z", "content": "For long, the Isuzu D-Max V-Cross was the only lifestyle pickup truck in India. But that is soon set to change as Toyota is jumping on this burgeoning segment with the Hilux. The Japanese carmaker sh… [+4088 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Adani Wilmar IPO to open on Jan 27 at Rs 218-230 per share - Economic Times", "description": "In the issue, 50% will be reserved for qualified institutional buyers (QIBs). Non-institutional buyers will have 15% of the share issue. The retail portion will get up to 35% of the offer.", "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/adani-wilmar-ipo-to-open-on-jan-27-at-rs-218-230-per-share/articleshow/89053041.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89053054,width-1070,height-580,imgsize-232096,overlay-etmarkets/photo.jpg", "publishedAt": "2022-01-22T04:40:00Z", "content": "Mumbai: The 3,600-crore initial public offering of Adani Wilmar will open for subscription on January 27. The company, which owns the edible oil brand Fortune, has set the price band of its public is… [+1320 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Botswana Cryptocurrency Regulation: Government Set to Present Virtual Asset Bill to Parliament – Regulation Bitcoin News - Bitcoin News", "description": "The Botswana government is set to present the Virtual Asset Bill to the country's parliament, a government gazette has shown.", "url": "https://news.bitcoin.com/botswana-cryptocurrency-regulation-government-set-to-present-virtual-asset-bill-to-parliament/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/01/shutterstock_2107968260.jpg", "publishedAt": "2022-01-22T04:30:09Z", "content": "The Botswana government is set to present a “Virtual Asset Bill” to the country’s parliament, a move that could see it become one of the first countries in Africa to have laws regulating cryptocurren… [+3771 chars]"}, {"source": {"id": null, "name": "Autocarindia.com"}, "author": "Saptarshi  Mondal", "title": "Tata Nexon prices increased by up to Rs 15,000 - Autocar India", "description": "Second price hike for Nexon in two months; but it continues to be Tata&amp;#8217;s bestseller.", "url": "https://www.autocarindia.com/car-news/tata-nexon-prices-increased-by-up-to-rs-15000-423321", "urlToImage": "https://cdni.autocarindia.com/ExtraImages/20220121060733_tata nexon.jpg", "publishedAt": "2022-01-22T04:30:00Z", "content": "Second price hike for Nexon in two months; but it continues to be Tatas bestseller.Tata Motors has upped the prices for the Nexon compact SUV, with both petrol and diesel models getting costlier by a… [+5584 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Jio Says 5G Coverage Planning Completed for 1,000 Cities as Q3 Profit Grows 8.8 Percent to Rs. 3,795 Cror... - Gadgets 360", "description": "Jio posted an 8.8 percent increase in net profit at Rs 3,795 crore for the third quarter ended December 2021.", "url": "https://gadgets.ndtv.com/telecom/news/jio-reliance-rjil-earnings-q3-2021-quarterly-net-profit-5g-services-whatsapp-payment-partner-recharge-2723046", "urlToImage": "https://i.gadgets360cdn.com/large/reliance_jio_full_1555659717841.jpg", "publishedAt": "2022-01-22T04:29:11Z", "content": "Jio Platforms on Friday posted an 8.8 per cent increase in net profit at Rs. 3,795 crore for the third quarter ended December 2021. The company had posted a net profit of Rs. 3,486 crore in the same … [+1520 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Kawasaki Z650RS 50th Anniversary Edition India launch soon - HT Auto", "description": "Expect the Kawasaki 50th Anniversary Edition motorcycle to be made available in limited numbers in India.\nKawasaki already sells the base Z650RS in the Indian market.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/kawasaki-z650rs-50th-anniversary-edition-india-launch-soon-41642822238175.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/01/22/600x338/kawasaki_1642824566275_1642824570886.png", "publishedAt": "2022-01-22T04:13:55Z", "content": "Kawasaki will soon launch the new Z650RS 50th Anniversary Edition motorcycle in India very soon. The company took to its social media platforms to make the latest announcement.\r\nThe Japanese motorcyc… [+1566 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Gold price gives breakout in spot market. Good opportunity to buy, say experts - Mint", "description": "Gold price today: Yellow metal has given breakout at $1835 per ounce levels in the spot market on closing basis, say commodity market experts", "url": "https://www.livemint.com/money/personal-finance/gold-price-gives-breakout-in-spot-market-good-opportunity-to-buy-say-experts-11642819046530.html", "urlToImage": "https://images.livemint.com/img/2022/01/22/600x338/ANI-20211102144-0_1641211226529_1642819296730.jpg", "publishedAt": "2022-01-22T02:49:19Z", "content": "Gold price today: The yellow metal price in the spot market has given fresh breakout at $1835 per ounce levels on closing basis as spot gold price on Friday closed at $1839 levels. Following the spot… [+3873 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Niti Aayog moots priority sector lending for EVs - Economic Times", "description": "It suggested that the central bank may consider various EV segments and use cases based on five parameters: socio-economic potential, livelihood generation potential, scalability, techno-economic viability, and stakeholder acceptability.", "url": "https://economictimes.indiatimes.com/news/economy/finance/niti-aayog-moots-priority-sector-lending-for-evs/articleshow/89051541.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89051724,width-1070,height-580,imgsize-34774,overlay-economictimes/photo.jpg", "publishedAt": "2022-01-22T02:41:00Z", "content": "Niti Aayog has proposed inclusion of electric vehicles in the Reserve Bank of India's priority-sector lending guidelines, saying the move will help give a significant push to retail lending for EVs.\r… [+1193 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "ICICI Bank independent director quitting to avoid potential conflict of interest - Moneycontrol.com", "description": "Rama Bijapurkar disclosed she is engaged with an educational institution where she teaches market and business strategy and is associated with a not-for-profit organisation where she researches India's consumer economy", "url": "https://www.moneycontrol.com/news/trends/current-affairs-trends/icici-bank-independent-director-quitting-to-avoid-potential-conflict-of-interest-7969741.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/ICICI-Bank-for-insurance-story-770x433.jpg", "publishedAt": "2022-01-22T02:24:26Z", "content": "ICICI Bank yesterday informed stock exchanges that Rama Bijapurkar will be stepping down as independent director from tomorrow over a potential conflict of interest.\r\nBijapurkar in her resignation le… [+1351 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Onmanorama Staff", "title": "E-mobility startup VAAN launches e-bikes, to hit Kochi market first | Fast Track | Automobiles | Onmanorama - Onmanorama", "description": "The Urbansport and Urbansport Pro are priced at Rs 59,999 and Rs 69,999 respectively.", "url": "https://www.onmanorama.com/news/business/2022/01/22/e-mobility-startup-vaan-launches-e-bikes--to-hit-kochi-market-fi.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/news/business/images/2022/1/22/vaan-electric1.jpg", "publishedAt": "2022-01-22T02:15:57Z", "content": "Kochi: Lifestyle e-mobility startup VAAN Electric Moto Pvt Ltd has launched its all-new electric bicycle in the country. The company, headed by a Keralite youth, announced the product launch at a gra… [+4085 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Tata To Launch 3 Affordable EVs In India - Punch EV, Altroz EV, Tiago EV - GaadiWaadi.com", "description": "Tata is developing three affordable EVs in the sub Rs. 10 lakh price range for launch within the next twelve to eighteen months in India", "url": "https://gaadiwaadi.com/tata-to-launch-3-affordable-evs-in-india-punch-ev-altroz-ev-tiago-ev/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/01/Tata-Punch-EV-rendered-1.jpg", "publishedAt": "2022-01-22T02:00:58Z", "content": "Following the launch of the Safari Dark Edition and CNG versions of the Tiago and Tigor, Tata Motors is banking big on its EVs as it plans to manufacture 50,000 zero-emission vehicles by the next fin… [+2052 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Michail", "title": "Intel announces plans for new chipset mega-site in Ohio - GSMArena.com news - GSMArena.com", "description": "The facility will span over 400 hectares and will initially house two chip factories.", "url": "https://www.gsmarena.com/intel_announces_plans_for_new_chipset_megasite_in_ohio-news-52801.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/22/01/intel-ohio-chip-site/-952x498w6/gsmarena_000.jpg", "publishedAt": "2022-01-21T16:25:01Z", "content": "Intel will build a large-scale chipset production plant in New Albany, Ohio which upon completion will be the largest semiconductor project in the world. The initial investment is valued at over $20 … [+904 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Abhijit Lele", "title": "L&T Finance Holdings Q3 net rises 12% to Rs 326 cr on spike in NIM, fees - Business Standard", "description": "The company has already raised long-term funds, protecting the balance sheet from rising finance costs", "url": "https://www.business-standard.com/article/companies/lt-finance-holding-q3-net-up-12-to-rs-326-cr-on-spike-in-nim-fees-122012101471_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/23/full/1640272755-2996.jpg", "publishedAt": "2022-01-21T15:06:00Z", "content": "LT Finance Holdings Ltd (LTFH) posted a 12 per cent rise in net profit at Rs 326 crore in third quarter ended December 2021 (Q3FY22) on improvement in net interest margin and fees.\r\nIt had posted a n… [+3163 chars]"}, {"source": {"id": null, "name": "ScoopWhoop"}, "author": "Prakriti Srivastava", "title": "From Peyush Bansal To Ashneer Grover, Here's How Rich Shark Tank India Judges Are - ScoopWhoop", "description": "Shark Tank India judges and their net worth", "url": "https://www.scoopwhoop.com/career/from-peyush-bansal-to-ashneer-grover-shark-tank-india-judges-net-worth/", "urlToImage": "https://s4.scoopwhoop.com/anj2/61ea9d7f440a4100017ff9ec/ceadd06c-1b97-406d-9bd8-4f8981910a85.jpg", "publishedAt": "2022-01-21T14:17:29Z", "content": "Shark Tank India is promoting and rewarding entrepreneurship in the country. Not only that, it is finally starting the much-needed entrepreneurship conversation in Indian households. With this the Sh… [+3414 chars]"}]}