{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Cointelegraph"}, "author": "Valerio Puggioni", "title": "Crypto rug pulls: What is a rug pull in crypto and 6 ways to spot it - Cointelegraph", "description": "Rug pulls are crypto scams that occur when developers of a new cryptocurrency pump a token's value and vanish with the funds as the coin’s value collapses.", "url": "https://cointelegraph.com/explained/crypto-rug-pulls-what-is-a-rug-pull-in-crypto-and-6-ways-to-spot-it", "urlToImage": "https://images.cointelegraph.com/images/1024_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy83YzdkZGE0YTZjMTgwY2EyYTNlNWU2ODkwMTYyYzJhYy5qcGc=.jpg", "publishedAt": "2022-02-06T16:51:04Z", "content": "There are several clear signs that investors can watch out for to protect themselves from rug pulls such as the liquidity not being locked and no external audit having been conducted.&amp;nbsp;\r\nThe … [+4471 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Trade setup for Monday: Top 15 things to know before Opening Bell - Moneycontrol.com", "description": "Trade Setup | According to pivot charts, the key support levels for the Nifty are placed at 17,446.66, followed by 17,377.03. If the index moves up, the key resistance levels to watch out for are 17,601.87 and 17,687.43.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-170-8042701.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/stocks_sensex_nifty_stockmarket1-1-770x433.jpg", "publishedAt": "2022-02-06T16:13:47Z", "content": "The market extended losses, amid volatility, for second consecutive session and closed with moderate losses on February 4 as elevated oil prices and rising US bond yields after hawkish stance by Bank… [+8939 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Olivia Brooke", "title": "Bloomberg Predicts $100,000 As Bitcoin’s Next Stop ; But When? - Coingape", "description": "Despite the current volatility of the crypto market, strong bullish sentiments still exist, especially for Bitcoin. A recent analysis by Bloomberg, which also gives insight to Ethereum’s near term performance, is calling $100,000 as the next key threshold for…", "url": "https://coingape.com", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/17171504/Bitcoin-price.jpg", "publishedAt": "2022-02-06T15:36:03Z", "content": "Despite the current volatility of the crypto market, strong bullish sentiments still exist, especially for Bitcoin. A recent analysis by Bloomberg, which also gives insight to Ethereum’s near term pe… [+2690 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Shiba Inu Whales Control 26% of Total Supply of Token: Here's How It Might Be Bullish - U.Today", "description": "Whales take control of the token as it recovers", "url": "https://u.today/shiba-inu-whales-control-26-of-total-supply-of-token-heres-how-it-might-be-bullish", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12503.jpg", "publishedAt": "2022-02-06T14:54:45Z", "content": "Disclaimer: The opinion expressed here is not investment advice it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all tradin… [+1733 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "LIC 3rd largest globally, but offers highest RoE of 82%, says Crisil report - Moneycontrol.com", "description": "While for LIC the market share has been steadily declining–down from 100 per cent in the pre-2000 era to 71.8 percent in 2016 and further down to 64.1 percent in 2020, for SBI Life, which is the second largest in the country, the same was only 5 percent in 20…", "url": "https://www.moneycontrol.com/news/business/ipo/lic-3rd-largest-globally-but-offers-highest-roe-of-82-says-crisil-report-8046911.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/LIC_churchgate-770x433.jpg", "publishedAt": "2022-02-06T13:47:55Z", "content": "The IPO-bound national insurer Life Insurance Corporation (LIC) is not only the world's largest when it comes to home-market share with over 64.1 per cent of the total gross written premium as of 202… [+4550 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Cryptocurrency Updates: Bitcoin, Ethereum Jumps 10% While Shiba Inu, Dogecoin, BNB coin Become Bullish - Analytics Insight", "description": "Bitcoin have recorded an impressive jump of over 10% during the bull market condition. Other high-performing cryptocurrencies like Bitgert, Centcex, Dogecoin, and others have been bullish, with some posting skyrocketing prices.", "url": "https://www.analyticsinsight.net/cryptocurrency-updates-bitcoin-ethereum-jumps-10-while-shiba-inu-dogecoin-bnb-coin-become-bullish/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2022/02/Bitcoin_Investment-780x438-1.jpg", "publishedAt": "2022-02-06T13:14:02Z", "content": "This article features the latest updates on cryptocurrencies like Bitcoin, Ethereum, and more.\r\nThe ending first week of February has been fantastic for the crypto community. The week produced some o… [+4244 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Milan Vaishnav CMT MSTA", "title": "Trade Setup: Nifty may trade in a defined range; avoid shorts - Economic Times", "description": "Monday's session is likely to have a quiet start to the day. The levels of 17,580 and 17,630 will act as potential resistance points, while support will come in at 17,410 and 17,350.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/trade-setup-nifty-may-trade-in-a-defined-range-avoid-shorts/articleshow/89385313.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89385297,width-1070,height-580,imgsize-605584,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-06T11:44:00Z", "content": "While continuing to trade on the expected lines, the Indian equity market continued to correct modestly and end the day on a negative note. Headline index Nifty opened on a positive note, and after t… [+2395 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Russians Mining Crypto to Pay at Least 15% Tax, Companies – No Less Than 6%, Lawmaker Says – Mining Bitcoin News - Bitcoin News", "description": "Private individuals mining cryptocurrency may expect a higher tax burden than businesses involved in the industry, a lawmaker has indicated.", "url": "https://news.bitcoin.com/russians-mining-crypto-to-pay-at-least-15-tax-companies-no-less-than-6-lawmaker-says/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/shutterstock_756585199.jpg", "publishedAt": "2022-02-06T11:41:27Z", "content": "Private individuals mining cryptocurrency may expect a higher tax burden than businesses involved in the industry, a high-ranking member of the Russian parliament has indicated. While the extraction … [+3593 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Hyundai Model Wise Jan 2022 Sales - Creta, Venue, i20, Alcazar, Verna - GaadiWaadi.com", "description": "Hyundai posted a total of 44,022 units in the month of January 2022 as against 52,005 units with a YoY decline of 15.4 per cent", "url": "https://gaadiwaadi.com/hyundai-model-wise-jan-2022-sales-creta-venue-i20-alcazar-verna/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/07/2020-hyundai-creta-turbo-1.4-1-5-e1595184811998.jpg", "publishedAt": "2022-02-06T11:30:08Z", "content": "Hyundai Motor India Limited (HMIL) garnered a cumulative domestic tally of 44,022 units in the month of January 2022 as against 52,005 units during the same period in 2021 with a YoY volume decline o… [+2733 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "RBI likely to maintain status quo in policy rate next week, say experts - Moneycontrol", "description": "Experts, however, are of the opinion that RBI's monetary policy committee (MPC) may change the policy stance from 'accommodative' to 'neutral' and tinker with the reverse-repo rate as part of the liquidity normalisation process.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-likely-to-maintain-status-quo-in-policy-rate-next-week-say-experts-8046511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/RBI-770x433.jpg", "publishedAt": "2022-02-06T11:22:27Z", "content": "In view of inflationary concerns, the Reserve Bank is likely to maintain the status quo on key policy rates in its next bi-monthly economic policy, which will be the first after the presentation of t… [+4132 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "MG unveils the ZS EV facelift for India - Team-BHP", "description": "MG has revealed the ZS EV facelift for the Indian market. The electric SUV will be launched later this month. Bookings for the updated MG ZS EV are now open. Depending on the availability, customers who have booked the older car will also get a facelift versi…", "url": "https://www.team-bhp.com/news/mg-unveils-zs-ev-facelift-india", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20220205124012_new_zs_ev.jpg", "publishedAt": "2022-02-06T10:00:18Z", "content": "MG has revealed the ZS EV facelift for the Indian market. The electric SUV will be launched later this month.\r\nBookings for the updated MG ZS EV are now open. Depending on the availability, customers… [+762 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "January Was Terrible Month for Crypto Investment Products - U.Today", "description": "Institutional crypto products are off to a rough start in 2022", "url": "https://u.today/january-was-terrible-month-for-crypto-investment-products", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12500.jpg", "publishedAt": "2022-02-06T09:55:15Z", "content": "Institutional investors pulled a record amount of money from cryptocurrency investment products last month, according to a report published by the Financial Times that cites data from crypto analytic… [+1649 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Sonal Sachdev", "title": "BOTTOMLINE: There’s more to DB Realty than meets the eye - CNBCTV18", "description": "The flip-flop over the Godrej Properties-DB Realty deal conceals more than it reveals. What is the bigger plot?", "url": "https://www.cnbctv18.com/real-estate/bottomline-theres-more-to-db-realty-than-meets-the-eye-12384062.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/01/Real-estate-reu-1.png", "publishedAt": "2022-02-06T09:21:00Z", "content": "MiniThe flip-flop over the Godrej Properties-DB Realty deal conceals more than it reveals. What is the bigger plot?"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Who named Air India? Tata group answers by sharing a 1946 monthly letter. READ - Mint", "description": "In 1946, Tatas were faced with the problem of finding a name for the new Air Line Company, which they were forming to take over and extend the activities of the Tata Air Lines which had hitherto functioned as a department of Tata Sons Ltd", "url": "https://www.livemint.com/companies/news/who-named-air-india-tata-group-answers-by-sharing-a-1946-monthly-letter-read-11644137044601.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/ANI-20220203011-0_1644138567678_1644138580532.jpg", "publishedAt": "2022-02-06T09:11:08Z", "content": "How was India's first airline 'Air India' named? If you ever wondered about this, here's the answer -- Air India was named via an opinion poll among Tata Sons employees over 75 years ago back in 1946… [+2405 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Adani Group forms unit to set up data centre in Mumbai - Economic Times", "description": "The new unit will  undertake business to develop, operate, maintain, deal with data centres, information technology (IT)/ information technology-enabled services (ITES)/ cloud, providing services related thereto and to undertake activities associated with its…", "url": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/adani-forms-unit-to-set-up-data-centre-in-mumbai/articleshow/89383008.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89383035,width-1070,height-580,imgsize-52102,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T09:08:00Z", "content": "Ports-to-energy conglomerate Adani Group has incorporated a new subsidiary to set up a data centre in Mumbai, one of the half a dozen cities that the billionaire Gautam Adani's group has identified t… [+3251 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "carandbike Team", "title": "Hyderabad-Based Cellestial E-Mobility Inks Deal With Mexican Firm; To Export India's First Electric Tractor - CarandBike", "description": "Cellestial E-Mobility will target to sell 4,000 e-tractors in the Mexican market over the next 3 years.", "url": "https://www.carandbike.com/news/hyderabad-based-cellestial-e-mobility-inks-deal-with-mexican-firm-to-export-indias-first-electric-tractor-2752187", "urlToImage": "https://c.ndtvimg.com/2022-02/kdcp6vog_cellestial-emobility-_625x300_06_February_22.jpg", "publishedAt": "2022-02-06T08:41:25Z", "content": "Cellestial E-Mobility, makers of India's first e-tractor for the Agri, Airport GSE, and goods carrier sector announced it has inked a marketing, sales distribution partnership with Mexican company Gr… [+1915 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "SBI Alert! Your banking services will soon stop if you fail to do THIS, bank cautions 40 crore users - Zee News", "description": "State Bank of India (SBI) has sent an alert to its millions across the country, urging them to link their PAN with their Aadhaar card before March 31, 2022.", "url": "https://zeenews.india.com/personal-finance/sbi-alert-your-banking-services-will-soon-stop-if-you-fail-to-do-this-bank-cautions-40-crore-users-2434008.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/02/06/1012178-untitled-design-26.jpg", "publishedAt": "2022-02-06T08:25:30Z", "content": "New Delhi: State Bank of India (SBI) has sent an alert to its millions across the country, urging them to link their PAN with their Aadhaar card before March 31, 2022. The bank has cautioned its user… [+1491 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "The week that was: Smallcap soars 37% after Vijay Kedia buys stake - Economic Times", "description": "A doubling of Q3 profit sent Deepak Fertilisers shares up by 20 per cent in the December quarter.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/the-week-that-was-smallcap-soar-37-after-vijay-kedia-buys-stake/articleshow/89381688.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89381789,width-1070,height-580,imgsize-292136,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-06T07:52:00Z", "content": "NEW DELHI: Domestic stocks were in for a roller-coaster ride last week, thanks to Budget-induced volatility. While the largecap benchmark indices gained 2.4-2.5 per cent each for the week, a host of … [+3144 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Ahead of IPO, LIC ropes in 6 independent directors on its board - Mint", "description": "IPO-bound LIC ropes in 6 independent directors: With the appointment, the total number of independent directors goes up to 9 and all vacancies are filled", "url": "https://www.livemint.com/companies/news/ahead-of-ipo-lic-ropes-in-6-independent-directors-on-its-board-11644132155251.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/LIC_independent_directors_1644132326845_1644132327100.jpg", "publishedAt": "2022-02-06T07:28:27Z", "content": "New Delhi: Ahead of initial public offering (IPO), Life Insurance Corporation (LIC) has last month appointed six independent directors on its board to meet regulatory norms of corporate governance.\r\n… [+2030 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Rekha chauhan", "title": "SOL Price Prediction: Will Solana (SOL) Price Break $120 Next? - Coingape", "description": "Solana's (SOL) price looks exhausted near the higher levels on Saturday. Buyers remained invested in the coin near $88.0 as accumulation builds up near the demand zone. The undeterred bullish sentiment pushed the price near $115.0. Solana (SOL) price stalled …", "url": "https://coingape.com/markets/sol-price-prediction-120-next/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/28010158/solana.jpg", "publishedAt": "2022-02-06T07:19:40Z", "content": "Solana’s (SOL) price looks exhausted near the higher levels on Saturday. Buyers remained invested in the coin near $88.0 as accumulation builds up near the demand zone. The undeterred bullish sentime… [+1920 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "Covid tests make Indians poorer by Rs 74K cr in 2 years, says NGO - Deccan Herald", "description": "In the past two years of the Coronavirus pandemic, Indians have coughed out a stupendous Rs 74,000 crore for 74 crore Covid-19 tests from dubious private pathological labs. Finally, around 4.20 crore positive cases were detected with more than 500,000 deaths,…", "url": "https://www.deccanherald.com/national/covid-tests-make-indians-poorer-by-rs-74k-cr-in-2-years-says-ngo-1078567.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/02/06/download-8-1078567-1644134636.png", "publishedAt": "2022-02-06T06:31:17Z", "content": "In the past two years of the Coronavirus pandemic, Indians have coughed out a stupendous Rs 74,000 crore for 74 crore Covid-19 tests from dubious private pathological labs. Finally, around 4.20 crore… [+4523 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "SBI lines up 6 NPA accounts for sale to ARCs to recover dues of ₹406 crore - Mint", "description": "The six NPA accounts put up for sale to the ARCs are - Patna Bakthiyarpur Tollway, Steelco Gujarat Ltd, GOL Offshore Ltd, Andhra Ferro Alloys Ltd, Guru Ashish Taxfab and Genix Automations Pvt Ltd", "url": "https://www.livemint.com/industry/banking/sbi-lines-up-6-npa-accounts-for-sale-to-arcs-to-recover-dues-of-rs-406-crore-11644128720492.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/SBI_1644128872801_1644128873006.JPG", "publishedAt": "2022-02-06T06:30:07Z", "content": "New Delhi: Country's largest lender SBI has lined up six non-performing assets (NPAs) for sale to asset reconstruction companies (ARCs) to recover dues of nearly 406 crore.\r\nThe six NPA accounts put … [+1912 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Airtel to spend Rs 1.17 lakh crore on various businesses with subsidiaries over next 5 years - Economic Times", "description": "According to the EGM notice, Bharti Airtel will spend Rs 88,000 crore in business with mobile tower company Indus Towers, Rs 15,000 crore for availing services of datacentre firm Nxtra and transaction of up to Rs 14,000 crore with Bharti Hexacom.", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/airtel-to-spend-rs-1-17-lakh-cr-on-various-businesses-with-subsidiaries-over-a-period-of-5-years/articleshow/89380197.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89380204,width-1070,height-580,imgsize-46662,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T06:10:00Z", "content": "Telecom operator Bharti Airtel has plans to spend about Rs 1.17 lakh crore through business transactions with its subsidiaries like Indus Towers, Nxtra and Bharti Hexacom, according to a regulatory f… [+1143 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Importance of WhatsApp, Telegram in the Open Post Jio’s Network Went Down Again - TelecomTalk", "description": "If a user is connected to the internet, WhatsApp and Telegram is one of the best ways to interact with other people.", "url": "https://telecomtalk.info/importance-of-whatsapp-telegram-in-the-open/496968/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2022/02/importance-of-whatsapp-telegram-in-the-open.jpeg", "publishedAt": "2022-02-06T06:08:37Z", "content": "WhatsApp and Telegram are two of the most used social media texting applications in India. Over 400 million Indians use WhatsApp, which is almost the same number of people as Jio has in its 4G networ… [+1657 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol.com", "description": "Ajit Mishra of Religare Broking recommended focusing on sector-specific opportunities while keeping a check on leveraged positions.", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-25-8045031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/shutterstock_1151323274-1-770x433.jpg", "publishedAt": "2022-02-06T06:00:49Z", "content": "The market snapped two-week sharp losing streak and clocked nearly 2.5 percent gains in the week ended February 4, thanks to the growth-oriented budget presented by Finance Minister by increasing cap… [+11008 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India's digital currency to debut by early 2023 - Economic Times", "description": "A top government source said the digital currency issued by the RBI would be numbered in units, just like every fiat currency has an unique number.", "url": "https://economictimes.indiatimes.com/news/economy/policy/indias-digital-currency-to-debut-by-early-2023/articleshow/89379626.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89379653,width-1070,height-580,imgsize-81336,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T05:33:00Z", "content": "India's very own official digital currency is likely to debut by early 2023, which will mirror any of the currently available private company-operated electronic wallets, but with a change that it wi… [+2763 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "SBI shares at 52-week high. Experts predict more rise after strong Q3 results - Mint", "description": "SBI share price may continue to surge as Stata Bank of India has reported strong Q3 earnings as its year-on-year (YoY) net profit has shot up around 62 per cent, believe stock market experts", "url": "https://www.livemint.com/market/stock-market-news/sbi-shares-at-52-week-high-experts-predict-more-rise-after-strong-q3-results-11644052724387.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/SBIFD_1579255374805_1644053508620.jpg", "publishedAt": "2022-02-06T04:47:01Z", "content": "State Bank of India or SBI share price on Friday made new 52-week high of 546.40 per shares. SBI shares opened with an upside gap of around 2 per shares and went on to scale new 52-week high in early… [+2832 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Movers & Shakers | Top 10 stocks that moved the most last week - Moneycontrol.com", "description": "\"Going ahead, 17400 is a key support to watch out for below which the index can test 17200 in the short term. On the other hand, 17800 will act as the upper end of the short term consolidation range,\" said Gaurav Ratnaparkhi, Head of Technical Research, Share…", "url": "https://www.moneycontrol.com/news/photos/business/stocks/movers-shakers-top-10-stocks-that-moved-the-most-last-week-37-8044841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/stocks_sensex_nifty_stockmarket1-1-770x433.jpg", "publishedAt": "2022-02-06T04:06:36Z", "content": null}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mukesh Ambani buys India’s most EXPENSIVE Rolls Royce Cullinan with a VIP numberplate - CarToq.com", "description": "India’s second richest man – Mukesh Ambani has an exquisite garage with numerous imported cars. Most of the cars in the Ambani garage are CBU units including several Rolls Royce. According to new reports, Ambani has added one more Rolls Royce Cullinan to his …", "url": "https://www.cartoq.com/mukesh-ambani-buys-indias-most-expensive-rolls-royce-cullinan-with-a-vip-numberplate/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/Cullinan_1.jpg", "publishedAt": "2022-02-06T03:19:12Z", "content": "India’s second richest man – Mukesh Ambani has an exquisite garage with numerous imported cars. Most of the cars in the Ambani garage are CBU units including several Rolls Royce. According to new rep… [+2828 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Billionaire Ray Dalio Discusses Future of Money, Insists Some Governments Will Ban Crypto – Featured Bitcoin News - Bitcoin News", "description": "Billionaire Ray Dalio, the founder of the world's largest hedge fund, Bridgewater Associates, has shared his view on cryptocurrency investing and the future of money. He believes that crypto will be banned by different governments.", "url": "https://news.bitcoin.com/billionaire-ray-dalio-future-of-money-insists-some-governments-will-ban-crypto/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/ray-dalio.jpg", "publishedAt": "2022-02-06T03:01:44Z", "content": "Billionaire Ray Dalio, the founder of the world’s largest hedge fund, Bridgewater Associates, has shared his view on cryptocurrency investing and the future of money. He believes that crypto will be … [+2662 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Daily Voice | Excellent time to add these 6 sectors to diversified portfolio with 10-20% allocation for... - Moneycontrol", "description": "Budget 2022 | The big themes for the next 1-2 years are infrastructure growth and cyclical recovery, as the budget has clarified. Also, FM has focused on Fintech instead of Banking, Electric Vehicles, and Edtech instead of Education which has brought back foc…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-excellent-time-to-add-these-6-sectors-to-diversified-portfolio-with-10-20-allocation-for-long-term-sonam-srivastava-of-wright-research-8044031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Sonam_Srivastava1280-770x433.jpg", "publishedAt": "2022-02-06T02:46:12Z", "content": "With Budget 2022, the government has shifted focus to infrastructure growth. The Finance Minister has increased the Capex investment target by 35 percent to Rs 7.5 lakh crore and announced critical i… [+6390 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Petrol, Diesel Prices Today on February 6: Check rates in Delhi, Mumbai, other cities - Moneycontrol", "description": "Petrol and diesel prices have been frozen in the past but the current 93-day pause is the longest since daily fuel price revision was adopted in June 2017.", "url": "https://www.moneycontrol.com/news/india/petrol-diesel-prices-today-on-february-6-check-rates-in-delhi-mumbai-other-cities-8044741.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/09/RTS1SHSW-1-770x433.jpg", "publishedAt": "2022-02-06T02:04:47Z", "content": "Petrol and diesel prices remained unchanged for the 93rd day on February 6, the longest ever period, according to a price notification by state-owned fuel retailers.\r\nThis comes as the central govern… [+1895 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Rich Dad Poor Dad's Robert Kiyosaki Says the Fed and Treasury Are Destroying the Dollar, Advises Saving Bitcoin – Featured Bitcoin News - Bitcoin News", "description": "The famous author of the best-selling book Rich Dad Poor Dad, Robert Kiyosaki, has warned that the Federal Reserve and the Treasury are destroying the U.S. dollar. Noting that they are sending billions of dollar savers and uninformed investors to \"financial h…", "url": "https://news.bitcoin.com/rich-dad-poor-dads-robert-kiyosaki-fed-treasury-destroying-dollar-advises-saving-bitcoin/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/kiyosaki.jpg", "publishedAt": "2022-02-06T01:06:31Z", "content": "The famous author of the best-selling book Rich Dad Poor Dad, Robert Kiyosaki, has warned that the Federal Reserve and the Treasury are destroying the U.S. dollar. Noting that they are sending billio… [+3004 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Simon Kennedy | Bloomberg", "title": "Goodbye easy money as hawkish central banks speed up rate hikes - Business Standard", "description": "Rates are rising because policy makers judge that the global inflation shock now poses a bigger threat than further damage to growth from Covid-19", "url": "https://www.business-standard.com/article/international/goodbye-easy-money-as-hawkish-central-banks-speed-up-rate-hikes-122020600085_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/11/full/1639166170-0072.jpg", "publishedAt": "2022-02-06T00:49:00Z", "content": "The end of easy money is upon us.\r\nTwo years after the pandemic sent the global economy into a deep but short recession, central bankers are withdrawing their emergency support -- and they’re moving … [+5609 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vinod Mahanta", "title": "Crypto exchanges to brief policymakers on TDS tangles - Economic Times", "description": "According to the provisions of this years finance bill, the buyer of a cryptocurrency has to deduct 1% of the sale consideration and pay the amount as an advance tax to the government on behalf of the seller on every trade.", "url": "https://economictimes.indiatimes.com/tech/technology/crypto-exchanges-to-brief-policymakers-on-tds-tangles/articleshow/89372406.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89372407,width-1070,height-580,imgsize-489916,overlay-ettech/photo.jpg", "publishedAt": "2022-02-06T00:30:00Z", "content": "Mumbai: The industry body representing cryptocurrency exchanges has decided to reach out to relevant policymakers to brief them about complications arising out of the governments move to levy a 1% TD… [+4132 chars]"}, {"source": {"id": null, "name": "The Daily Hodl"}, "author": "Daily Hodl Staff", "title": "Top Analyst Updates Outlook on Bitcoin and Ethereum, Says BTC Needs To Break Above This Price To Surge Higher - The Daily Hodl", "description": "Popular crypto analyst Justin Bennett is updating his outlook on the two largest crypto assets by market cap.", "url": "https://dailyhodl.com/2022/02/05/top-analyst-updates-outlook-on-bitcoin-and-ethereum-says-btc-needs-to-break-above-this-price-to-surge-higher/", "urlToImage": "https://i0.wp.com/dailyhodl.com/wp-content/uploads/2022/02/btc-needs-to-break.jpg?fit=1365%2C800&ssl=1", "publishedAt": "2022-02-05T23:05:19Z", "content": "Popular crypto analyst Justin Bennett is updating his outlook on the two largest crypto assets by market cap.\r\nStarting with Bitcoin (BTC), Bennett says that the flagship cryptocurrency could surge b… [+1440 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "US Lawmakers Introduce 'Virtual Currency Tax Fairness Act' to Boost Cryptocurrency Use for Payments – Regulation Bitcoin News - Bitcoin News", "description": "Several U.S. lawmakers have introduced the Virtual Currency Tax Fairness Act to strengthen \"the legitimacy of cryptocurrency in our digital economy.\" The bill also aims to expand the use of cryptocurrencies for payments.", "url": "https://news.bitcoin.com/us-lawmakers-virtual-currency-tax-fairness-act-boost-cryptocurrency-use-for-payments/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/fairness-act.jpg", "publishedAt": "2022-02-05T23:02:36Z", "content": "Several U.S. lawmakers have introduced the Virtual Currency Tax Fairness Act to strengthen “the legitimacy of cryptocurrency in our digital economy.” The bill also aims to expand the use of cryptocur… [+2866 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Venezuelan Government Approves New Tax for Cryptocurrency and Foreign Currency Transactions – Bitcoin News - Bitcoin News", "description": "The Venezuelan Government has approved a new tax that would affect transactions made in foreign currency and cryptocurrency transactions.", "url": "https://news.bitcoin.com/venezuelan-government-approves-new-tax-for-cryptocurrency-and-foreign-currency-transactions/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/shutterstock_776493799.jpg", "publishedAt": "2022-02-05T21:08:01Z", "content": "The Venezuelan Government has approved a new tax that would affect transactions made in foreign currency and cryptocurrency transactions. Approved by the National Assembly of the country, the tax, ca… [+3814 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Brian Bollinger", "title": "Why Are Metaverse Coins Skyrocketing Today? MANA, GALA, AXS Price Analysis - Coingape", "description": "Even though the technical chart indicated heavy bear attacks on Metacoins during the recent correction phase. The fundamental development of the Metaverse ecosystem has significantly upscaled as more renowned companies and industry giants like Meta(previously…", "url": "https://coingape.com/markets/why-are-metaverse-coins-skyrocketing-today-price-analysis-for-top-coins/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/19003033/crypto-Metaverse.png", "publishedAt": "2022-02-05T16:54:22Z", "content": "Even though the technical chart indicated heavy bear attacks on Metacoins during the recent correction phase. The fundamental development of the Metaverse ecosystem has significantly upscaled as more… [+3448 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Kunal Talgeri", "title": "Ashneer Grover vs BharatPe: Why CEO Suhail Sameer's board seat matters - YourStory", "description": "Since Managing Director Ashneer Grover's challenge to the BharatPe board, Co-founder Shashvat Nakrani has backed CEO Suhail Sameer.", "url": "https://yourstory.com/2022/02/ashneer-grover-bharatpe-ceo-suhail-sameers-board-seat/amp", "urlToImage": "https://images.yourstory.com/cs/2/f86c090087cc11eba777b34f5b721f5e/Photo-SuhailSameerBharatPe-1644072433760.png", "publishedAt": "2022-02-05T16:42:59Z", "content": "Corporate lawyers in India's startup ecosystem see innumerable kinds of \"founder-issues\" before the Series C stage of a venture's fund-raising. Discord among founders, a founder's inability to lead a… [+6794 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Fully modified old-generation Mahindra Thar 4×4 SUV for sale at Rs 8.25 lakh - CarToq.com", "description": "Mahindra Thar is currently one of the most popular SUV in the Indian market. It has been a popular SUV among off-road enthusiasts and there are several videos available online that show the off-road capabilities of the same. The popularity of Mahindra Thar to…", "url": "https://www.cartoq.com/fully-modified-old-generation-mahindra-thar-4x4/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/Thar-used-featured.jpg", "publishedAt": "2022-02-05T15:57:41Z", "content": "Mahindra Thar is currently one of the most popular SUV in the Indian market. It has been a popular SUV among off-road enthusiasts and there are several videos available online that show the off-road … [+3108 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "George Georgiev", "title": "4 Possible Reasons for Bitcoin’s $5K Surge Above $41,000 - CryptoPotato", "description": "Following what seems to be the largest green daily candle in months, we take a look at four possible reasons for Bitcoin's $5K rally above $41,000.", "url": "https://cryptopotato.com/4-possible-reasons-for-bitcoins-5k-surge-above-41000/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2021/10/bitcoinchartgreen.jpg", "publishedAt": "2022-02-05T14:52:33Z", "content": "The past 24 hours have been particularly turbulent throughout the cryptocurrency market, but this time it seems it’s all in favor of the bulls.\r\nBitcoin’s price surged above $41K for the first time s… [+3865 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Kia Carens official fuel efficiency figures leaked before official launch - CarToq.com", "description": "The official launch of Kia Carens is just around the corner. While there is still some time for the prices to get unveiled, we have come to know about the official fuel efficiency figures of all the possible powertrain combinations of the new MPV from Kia Ind…", "url": "https://www.cartoq.com/kia-carens-official-fuel-efficiency-figures-leaked/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/kia-carens-2022.jpg", "publishedAt": "2022-02-05T14:03:45Z", "content": "The official launch of Kia Carens is just around the corner. While there is still some time for the prices to get unveiled, we have come to know about the official fuel efficiency figures of all the … [+2594 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Anand Mahindra has added this Amritsar restaurant to his ‘binge’ list. See why - Mint", "description": "Mahindra shared a video by a YouTube channel called Amritsar Walking Tours, where the vlogger was talking about how two little boys are running a small restaurant in the city after their father's death", "url": "https://www.livemint.com/news/india/anand-mahindra-has-added-this-amritsar-restaurant-to-his-binge-list-see-why-11644066862094.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/anand_mahindra_1644068296882_1644068297025.jpg", "publishedAt": "2022-02-05T13:39:06Z", "content": "Industrialist Anand Mahindra, who is known for sharing interesting and witty posts on social media, took to Twitter on Saturday to tell his followers the story of the owners of an Amritsar restaurant… [+2013 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "2022 Yamaha Nmax 155 (R15-Based Scooter) Unveiled With Updates - GaadiWaadi.com", "description": "For 2022, Yamaha has rolled out new colour schemes for the Nmax 155, but the rest of the scooter remains completely unchanged", "url": "https://gaadiwaadi.com/2022-yamaha-nmax-155-r15-based-scooter-unveiled-with-updates/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/05/2021-Yamaha-NMax-125-1.jpg", "publishedAt": "2022-02-05T13:00:44Z", "content": "Yamaha has launched the 2022 Nmax 155 in the Indonesian market, and the updated scooter will soon make its way to other international markets as well. With the latest update, the Japanese manufacture… [+1927 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Man builds Bugatti Chiron at home [Video] - CarToq.com", "description": "In the past, we have covered several homemade cars. Well, here is a special one. This one is a Bugatti Chiron and it is homemade. The video is uploaded on YouTube by NHET TV. They are the ones who built the Chiron at home. Car manufacturers craft clay models …", "url": "https://www.cartoq.com/man-builds-bugatti-chiron-home/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/homemade-bugatti-chiron-featured.jpg", "publishedAt": "2022-02-05T12:02:57Z", "content": "In the past, we have covered several homemade cars. Well, here is a special one. This one is a Bugatti Chiron and it is homemade. The video is uploaded on YouTube by NHET TV. They are the ones who bu… [+2729 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Tata Jan 2022 Model Wise Sales - Nexon, Tiago, Altroz, Safari, Punch - GaadiWaadi.com", "description": "Tata posted a total of 40,780 units in January 2022 as against 26,980 units with a YoY sales growth of 51.1 per cent", "url": "https://gaadiwaadi.com/tata-jan-2022-model-wise-sales-nexon-tiago-altroz-safari-punch/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/08/tata-nexon-dark-1-1.jpg", "publishedAt": "2022-02-05T11:27:47Z", "content": "Tata Motors finished in the third position in the overall manufacturers’ sales table for the month of January 2022 as 40,780 units were sold against 26,980 units during the same period last year with… [+2421 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Rekha chauhan", "title": "SHIBA Inu (SHIB) Price Climbs Towards 200 DMA AT $0.000025 - Coingape", "description": "SHIBA Inu (SHIB) price is enjoying attraction from investors on Saturday. SHIB is capitalizing on the fundamental support from the announcement from the world’s first crypto record label, Bigger Entertainment that organized a valentine’s day event to burn Shi…", "url": "https://coingape.com/markets/shiba-inu-shib-price-climbs-towards-200-dma-at-0-000025/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/01/15151110/Shiba-Inu.jpg", "publishedAt": "2022-02-05T11:16:57Z", "content": "SHIBA Inu (SHIB) price is enjoying attraction from investors on Saturday. SHIB is capitalizing on the fundamental support from the announcement from the worlds first crypto record label, Bigger Enter… [+1593 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "DOGE Flirts with $0.15, Dogecoin Creator Says He’s Ready for Trend Reversal - U.Today", "description": "Dogecoin founder comments on DOGE struggling to surpass the $0.15 level after the coin’s recent rise", "url": "https://u.today/doge-flirts-with-015-dogecoin-creator-says-hes-ready-for-trend-reversal", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12497.jpg", "publishedAt": "2022-02-05T09:49:46Z", "content": "Disclaimer: The opinion expressed here is not investment advice it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all tradin… [+1979 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Aneesh Phadnis", "title": "Vodafone Idea remains sole telco to offer equity stake to govt - Business Standard", "description": "Tata group-owned telecom companies withdraw their offers over differences in calculations", "url": "https://www.business-standard.com/article/companies/vodafone-idea-remains-sole-telco-to-offer-equity-stake-to-govt-122020500730_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-07/23/full/1626979069-468.jpg", "publishedAt": "2022-02-05T09:24:00Z", "content": "Tata Teleservices (TTSL) has withdrawn its proposal to offer equity in lieu of interest on deferred liabilities to the government leaving Vodafone Idea (Vi) as the only telco with an active offer.\r\nT… [+3025 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "CMS Info Systems Q3 Results: Firm logs 48% growth in profit at Rs 60 crore - Economic Times", "description": "CMS Info is the country's largest cash management company based on number of ATM points and the number of retail pick-up points as well as one of the largest ATM cash management companies worldwide.", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/cms-info-systems-q3-results-firm-logs-48-growth-in-profit-at-rs-60-crore/articleshow/89365173.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89365204,width-1070,height-580,imgsize-703960,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-05T09:14:00Z", "content": "Mumbai: Cash management firm CMS Info Systems, which closed the last IPO of 2021 with a Rs 1,100-crore share sale in the third week of December, has reported a net income of Rs 60.2 crore for the qua… [+2357 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Ahead of IPO, LIC allows customers to revive lapsed policies; concession in late fee. Details - Mint", "description": "Concessions are being offered in late fee for other than term assurance and high risk plans, depending on the total premiums paid", "url": "https://www.livemint.com/companies/ahead-of-ipo-lic-allows-customers-to-revive-lapsed-policies-concession-in-late-fee-details-11644051236900.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/LIC_1642617491883_1644052186470.jpg", "publishedAt": "2022-02-05T09:13:13Z", "content": "LIC IPO launch: Ahead of its mega IPO, Life Insurance Corporation of India (LIC) has launched a campaign for revival of lapsed policies.\r\nIn a statement, the state-run insurer said policies which are… [+1352 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Hamdard to launch beauty products based on medicinal oils - Moneycontrol", "description": "Hamdard, which also manufactures 'Chyawanprash' among other health supplements, is evolving into a company which provides holistic healthcare solutions to consumers.", "url": "https://www.moneycontrol.com/news/business/hamdard-to-launch-beauty-products-based-on-medicinal-oils-8043691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/Hamdard-770x433.jpg", "publishedAt": "2022-02-05T08:37:16Z", "content": "Hamdard, India's leading unani medicine brand and maker of popular Rooh Afza sharbat is looking to further diversify its product offerings by entering into new consumer segments, according to a IANS … [+1684 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "ICICI Bank Increases Credit Card Charges with Effect from February 10; Know Details - News18", "description": "ICICI Bank credit card customers will have to pay increased charges of various services related to credit cards, this includes late payment fees. Know details", "url": "https://www.news18.com/news/business/icici-bank-hikes-credit-card-charges-with-effect-from-february-10-know-details-4737821.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/credit-cards-164231918516x9.png", "publishedAt": "2022-02-05T08:05:00Z", "content": "ICICI Bank credit card customers will have to pay increased charges of various services related to credit cards, this includes late payment fees. These changes will come in effect from February 10, 2… [+2923 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Honda Vario 160 vs Yamaha Aerox 155: Spec comparison - HT Auto", "description": "Honda Vario 160 is a rival to the Yamaha Aerox 155 scooter, but sadly it is not available in India currently.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/honda-vario-160-vs-yamaha-aerox-155-spec-comparison-41644041905265.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/02/05/600x338/Honda-Vario-160-1200x675_1643959035225_1644045101300.jpg", "publishedAt": "2022-02-05T07:13:47Z", "content": "Only recently Honda revealed its new 2022 Vario scooter for the market of Indonesia. Needless to say, it comes out as a direct rival to the popular Yamaha Aerox 155 moto scooter that is also on sale … [+2037 chars]"}, {"source": {"id": null, "name": "CryptoGlobe"}, "author": "Michael Lavere", "title": "$ADA: ‘Cardano Uses the Least Amount of Electricity per Node’, Says CCRI Research - CryptoGlobe", "description": "The Crypto Carbon Ratings Institute (CCRI) has released a new research report showing that Cardano ($ADA) consumes the least amount of electricity per node, despite using the most electricity per transaction.  According to the a report by CCRI released on Wed…", "url": "https://www.cryptoglobe.com/latest/2022/02/ada-cardano-uses-the-least-amount-of-electricity-per-node-says-ccri-research/", "urlToImage": "https://cryptoglobe.s3.eu-west-2.amazonaws.com/2022/02/gold-Cardano-coin-on-red-background-768x544.jpg", "publishedAt": "2022-02-05T07:13:15Z", "content": "The Crypto Carbon Ratings Institute (CCRI) has released a new research report showing that Cardano ($ADA) consumes the least amount of electricity per node, despite using the most electricity per tra… [+2002 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Adani Wilmar IPO: What GMP signals after finalisation of share allotment - Mint", "description": "Adani Wilmar IPO GMP today is  ₹30, which is  ₹5 higher from is yesterday's grey market premium of  ₹25, say market observers", "url": "https://www.livemint.com/market/ipo/adani-wilmar-ipo-what-gmp-signals-after-finalisation-of-share-allotment-11644044612836.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/Adani_Wilmar_IPO_1643501473787_1644044676615.PNG", "publishedAt": "2022-02-05T07:08:37Z", "content": "Adani Wilmar IPO: After the finalisation of share allocation, bidders of Adani Wilmar IPO (Initial Public Offering) are eagerly waiting for the share listing of Adani Wilmar, which is most likely on … [+2924 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Stocks vs Mutual Funds: What should you choose? - Moneycontrol.com", "description": "To simply put, if you are investing in stocks, you are responsible for your picks. On the other hand, if you invest in mutual funds, the fund manager takes this call on your behalf. You need to be mindful of certain crucial factors before choosing either asse…", "url": "https://www.moneycontrol.com/news/business/markets/stocks-vs-mutual-funds-what-should-you-choose-8043461.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/sensex_stocks-2-770x433.jpg", "publishedAt": "2022-02-05T06:47:58Z", "content": "Most investors face the dilemma of whether to go for stocks or mutual funds. Let's be quite clear that there's no wrong or right answer to this. The matter is entirely subjective, and pitching one ag… [+3251 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rakesh Jhunjhunwala portfolio: Multibagger stock hits upper circuit in 5 straight sessions. Experts see more gain - Mint", "description": "Rakesh Jhunjhunwala portfolio: Multibagger stock has given fresh breakout at  ₹80 per share levels and after that it became highly bullish, which is getting reflected in its last week's rally", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-portfolio-multibagger-stock-hits-upper-circuit-in-5-straight-sessions-experts-see-more-gain-11644040155211.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/Rakesh_Jhunjhunwala_Reuters_1622431252074_1644040295288.jpg", "publishedAt": "2022-02-05T05:54:42Z", "content": "Rakesh Jhunjhunwala portfolio: While stock market investors are busy finding out possible multibagger stocks for 2022 in Indian secondary market, a good number of small-cap stocks have already entere… [+2033 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Anand Mahindra and Uday Kotak discuss 'phygital', 'fickleness of current times' after Meta loses $200 bill - Economic Times", "description": "The two businessman joined the hot discussion on Meta's historic stock plunge.", "url": "https://economictimes.indiatimes.com/magazines/panache/anand-mahindra-and-uday-kotak-discuss-phygital-fickleness-of-current-times-after-meta-loses-200-billion-in-stock-value/articleshow/89360739.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89361071,width-1070,height-580,imgsize-62132,overlay-etpanache/photo.jpg", "publishedAt": "2022-02-05T05:16:00Z", "content": "On Friday, two top Indian businessmen, Uday Kotak, the CEO of Kotak Mahindra Bank, and Anand Mahindra, the chairman of Mahindra Group, discussed Meta's historic fall in stock market, just like the wh… [+2551 chars]"}, {"source": {"id": null, "name": "Carblogindia.com"}, "author": "Harsh", "title": "Royal Enfield Hunter 350 and Super Meteor 650 Spotted Testing Again - Car Blog India", "description": "Here is a video of Royal Enfield Hunter 350 and Super Meteor 650 spotted in near-production versions. Check out the details here.", "url": "https://www.carblogindia.com/royal-enfield-hunter-350-super-meteor-650-spotted-testing-again/", "urlToImage": "https://www.carblogindia.com/wp-content/uploads/2022/02/Hunter-350-Meteor-650.jpeg", "publishedAt": "2022-02-05T05:03:14Z", "content": "The Royal Enfield Hunter 350 and the Super Meteor 650 are two of the most anticipated products from the legendary bike maker in India for 2022. While these bikes have been spotted multiple times, the… [+2036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Why is Dr Reddy’s acquiring a German medical cannabis firm? - The Indian Express", "description": "Globally, the legal cannabis market is expected to reach an estimated valuation of $146.4 billion by 2025-end.", "url": "https://indianexpress.com/article/explained/explained-dr-reddys-german-medical-cannabis-firm-7757907/", "urlToImage": "https://images.indianexpress.com/2022/02/Medicinal-Cannabis.jpg", "publishedAt": "2022-02-05T03:56:15Z", "content": "In a bid to strengthen its position in the global medical cannabis industry, Indian pharmaceutical major Dr Reddys Laboratories has said that it will acquire German firm Nimbus Health. Nimbus has bee… [+2947 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mahindra XUV700 royally stuck: Rescued by Thar [Video] - CarToq.com", "description": "The Mahindra XUV700 is one of those SUVs which has charmed buyers from all kinds of segments. Some people are buying the XUV700 for their daily urban grinds with space and features on offer. At the same time, some wish to explore unexplored terrains by relyin…", "url": "https://www.cartoq.com/mahindra-xuv700-royally-stuck/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/mahindra-xuv700-stuck-featured.jpg", "publishedAt": "2022-02-05T03:37:43Z", "content": "The Mahindra XUV700 is one of those SUVs which has charmed buyers from all kinds of segments. Some people are buying the XUV700 for their daily urban grinds with space and features on offer. At the s… [+2383 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "Meet Param Pravega: One of the most powerful supercomputers in India - Gadgets Now", "description": "Under the National Supercomputing Mission (NSM), the Indian Institute of Science (IISc) Bengaluru has installed and commissioned Param Pravega, one of the most powerful supercomputers in the country. The NSM was launched to enhance the research capacities and…", "url": "https://www.gadgetsnow.com/slideshows/meet-param-pravega-one-of-the-most-powerful-supercomputers-in-india/photolist/89354690.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-89354828,width-800,resizemode-4,imgsize-92274/share.jpg", "publishedAt": "2022-02-05T03:32:00Z", "content": "NSM has supported the deployment of 10 supercomputing systems so far in the country. These include several IITs; Indian Institutes of Science Education and Research (IISER), Pune; Jawaharlal Nehru Ce… [+495 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Punjab National Bank (PNB) cuts interest rates on savings accounts. Detail here - Mint", "description": "PNB had earlier lowered the interest rates on saving accounts in December last year and was offering 2.80% on accounts having less than  ₹10 lakh and 2.85% on savings accounts having more than RS 10 lakh to and below  ₹500 crore", "url": "https://www.livemint.com/industry/banking/punjab-national-bank-pnb-cuts-interest-rates-on-savings-accounts-detail-here-11644029779151.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/PNB_1644031345976_1644031346211.jpg", "publishedAt": "2022-02-05T03:25:25Z", "content": "The Punjab National Bank (PNB) has reduced the interest rate on its savings account for balances below  10 lakh to 2.75% per annum. The bank has also reduced the interest rates on savings account for… [+1687 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "LIC IPO: Here's How LIC Policyholders can Participate in the Upcoming IPO - News18", "description": "LIC IPO: The government’s decision to create a 10 per cent policyholders’ quota in the LIC IPO – a first-of-its-kind. Know how policyholders can invest", "url": "https://www.news18.com/news/business/markets/lic-ipo-heres-how-lic-policyholders-can-participate-in-the-upcoming-ipo-4730309.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/life-insurance-corporation-164371308316x9.png", "publishedAt": "2022-02-05T02:20:37Z", "content": "LIC IPO: Indias largest insurer Life Insurance Corporation of India (LIC) is expected to file its IPO (initial public offering) prospectus soon. While LIC is ironing out the finer points before launc… [+3060 chars]"}]}