{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Maruti Alto transformed into a beast [Video] - CarToq.com", "description": "One of the humblest cars in India, the Maruti Suzuki Alto has always remained one of the top picks of budget-oriented car buyers. It is the simplicity of the mechanicals of the Alto which has attracted many car modification houses to customize it as per their…", "url": "https://www.cartoq.com/maruti-alto-transformed-into-a-beast-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/maruti-alto-monster-edition-featured.jpg", "publishedAt": "2022-04-03T10:05:29Z", "content": "One of the humblest cars in India, the Maruti Suzuki Alto has always remained one of the top picks of budget-oriented car buyers. It is the simplicity of the mechanicals of the Alto which has attract… [+2396 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Automakers warn of supply chain disruptions despite surging car sales - HT Auto", "description": "Indian auto industry's worry about the disruptions in the supply chain is in line with the global auto industry.", "url": "https://auto.hindustantimes.com/auto/cars/automakers-warn-of-supply-chain-disruptions-despite-surging-car-sales-41648975504746.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/04/03/600x338/35d32f68-a6a3-11eb-82a2-22fa8e424cbb_1626844554648_1648979462039.jpg", "publishedAt": "2022-04-03T09:53:24Z", "content": "Several carmakers in India reported a sharp increase in annual vehicle sales in the FY2022, which ended on Thursday. But, despite the improving sales scenario, automakers have warned of future risks … [+2461 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "India-bound all-new Renault Duster: What it’ll look like - CarToq.com", "description": "Renault Duster was one of the most successful models or SUV sold by the French car manufacturer in India. It was in production for almost a decade and recently Renault announced that they are stopping the production of Duster in India. According to several on…", "url": "https://www.cartoq.com/india-bound-all-new-renault-duster-what-itll-look-like/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/new-gen-duster-featured.jpg", "publishedAt": "2022-04-03T08:10:29Z", "content": "Renault Duster was one of the most successful models or SUV sold by the French car manufacturer in India. It was in production for almost a decade and recently Renault announced that they are stoppin… [+2850 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "India on cusp of major economic recovery; talks of stagflation 'overhyped': Niti Aayog VC Rajiv Kumar - Mint", "description": "Retail inflation hit an eight-month high of 6.07 per cent in February, remaining above the RBI's comfort level for the second month in a row while wholesale price-based inflation soared to 13.11 per cent on account of hardening of crude oil and non-food item …", "url": "https://www.livemint.com/economy/india-on-cusp-of-major-economic-recovery-talks-of-stagflation-overhyped-niti-aayog-vc-rajiv-kumar-11648969257458.html", "urlToImage": "https://images.livemint.com/img/2022/04/03/600x338/Rajiv_Kumar_1648969613374_1648969614011.jpg", "publishedAt": "2022-04-03T07:08:29Z", "content": "NEW DELHI :\r\n India is on the cusp of a major economic recovery and talks of possible stagflation are \"overhyped\" as a strong economic foundation is being laid with the reforms carried out by the gov… [+4228 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Delhi-NCR builders need 73 months to sell unsold housing stock, Bengaluru only 31 months: Report - Moneycontrol", "description": "According to the PropTiger’s latest data, builders across eight major cities in India are sitting on an unsold stock of 7,35,852 units as of March 31, 2022", "url": "https://www.moneycontrol.com/news/business/real-estate/delhi-ncr-builders-need-73-months-to-sell-unsold-housing-stock-bengaluru-only-31-months-report-8310831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Mumbai-Real-Estate-Building-770x433.jpg", "publishedAt": "2022-04-03T06:48:12Z", "content": "It will take over six years for Delhi-NCRs builders to sell their 1.01 lakh unsold housing stocks while real estate developers in Bengaluru and Kolkata need only 31 months, according to property cons… [+2411 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Hyundai Creta To Get 3 Rivals Soon – From Maruti, Toyota & Honda - GaadiWaadi.com", "description": "The midsize SUV segment will see plenty of action this year and beyond as the Hyundai Creta & Kia Seltos will get new rivals from Maruti Suzuki, Toyota and Honda", "url": "https://gaadiwaadi.com/hyundai-creta-to-get-3-rivals-soon-from-maruti-toyota-honda/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/11/2022-toyota-veloz.jpg", "publishedAt": "2022-04-03T06:03:04Z", "content": "In the Indian car market, the midsize SUV segment is currently ruled by South Korean carmakers Hyundai and Kia, with the Creta and Seltos, respectively. These two SUVs are considerably more popular t… [+1752 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol", "description": "The volatility cooled down significantly below 20 levels, providing healthy push to the market. India VIX, the fear index fell by 21.3 percent on a week-on-week basis to 18.44, the lowest level since February 10.", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-31-8310681.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/12/Sensex_BSE_Market_Nifty1-770x433.jpg", "publishedAt": "2022-04-03T05:49:10Z", "content": "The market had a fantastic week ended on April 1, registering more than 3 percent gains with easing volatility, falling oil prices, buying by FIIs, pick up in industrial activities and a bit of posit… [+9516 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Mihir R. Barve", "title": "Tata Motors Releases A Teaser Video For Its Upcoming EV Concept - carandbike", "description": "The teaser video hints at a coupe like roof line, suggesting that this could be the Nexon Coupe EV.", "url": "https://www.carandbike.com/news/tata-motors-releases-a-teaser-video-for-its-upcoming-ev-concept-2859654", "urlToImage": "https://c.ndtvimg.com/2022-04/bn5b8ku4_tata-nexon-coupe-ev_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T05:38:04Z", "content": "Tata Motors has released a brand new teaser video of its upcoming EV concept. The EV had been teased earlier, but not much was clear in the teaser. The automaker later confirmed that this concept was… [+2687 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "FPI sell-off on D-Street: Rs 41,000 crore gone in March - Economic Times", "description": "According to data available with the depositories, FPIs were net sellers to the tune of Rs 41,123 crore in the equity market last month.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/fpi-sell-off-on-d-street-rs-41000-crore-gone-in-march/articleshow/90619911.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90620055,width-1070,height-580,imgsize-17581,overlay-etmarkets/photo.jpg", "publishedAt": "2022-04-03T05:10:00Z", "content": "New Delhi: Continuing their selling spree for the sixth consecutive month, foreign investors pulled out a massive Rs 41,000 crore from the Indian equity market in March on anticipation of rate hikes … [+2888 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "5 Most Affordable Sedans In India – Tata Tigor To Maruti Ciaz - GaadiWaadi.com", "description": "In the Indian car market, there still are a few sedans that can be bought on a relatively small budget, and we’ve mentioned them here", "url": "https://gaadiwaadi.com/5-most-affordable-sedans-in-india-tata-tigor-to-maruti-ciaz/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/03/2020-Maruti-Suzuki-Dzire-Facelift-2.jpg", "publishedAt": "2022-04-03T04:00:42Z", "content": "In the Indian car market, sedans have been steadily losing popularity. However, many people still think sedans have an aspirational value to them, but thanks to steadily rising car prices, many sedan… [+2629 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Daily Voice | India to be one of brighter pockets with likely growth of around 8.5%: Asheesh Chanda of... - Moneycontrol", "description": "Given the uncertainty at a global level, the FII desks are resorting to safer options. Hence they are reducing exposure to global markets and consolidating holdings in dependable currency like USD. The sentiment will continue till we see a change in the headl…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-india-to-be-one-of-brighter-pockets-with-likely-growth-of-around-8-5-asheesh-chanda-of-kristal-ai-8310131.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/AsheeshChanda-770x433.jpg", "publishedAt": "2022-04-03T02:49:37Z", "content": "\"In Asia, I am cautious on countries with large current account deficits, where the future increase in imports will exaggerate the already strained government finances,\" says Asheesh Chanda, Founder … [+7089 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Mutual fund calculator: How to save ₹50 lakh in 10 years from monthly SIP - Mint", "description": "Mutual funds SIP calculator: Ideally annual step-up of 10 per cent is advised for long-term investment but for meeting an ambitious target with least possible monthly SIP, one can maintain 15 per cent annual step-up, say experts", "url": "https://www.livemint.com/money/personal-finance/mutual-fund-calculator-how-to-save-rs-50-lakh-in-10-years-from-monthly-sip-11648952648438.html", "urlToImage": "https://images.livemint.com/img/2022/04/03/600x338/MF-keuF--621x414@LiveMint_1648952775992.jpg", "publishedAt": "2022-04-03T02:35:54Z", "content": "Mutual fund calculator: SIP or Systematic Investment Plan is an investment instrument that enables an investor to invest a fixed amount at regular intervals in mutual funds scheme. The intervals can … [+2829 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANS", "title": "Amazon gets its first union, Jeff Bezos miffed - Onmanorama", "description": "The union is the personal project of one Christian Smalls, fired from the Staten Island site for organising a walkout. For two years, work has been afoot on unionising one of the citadels of modern capitalism.", "url": "https://www.onmanorama.com/news/business/2022/04/03/amazon-gets-first-union-jeff-bezos-reaction.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/news/world/images/2022/2/7/jeff-bezos.jpg", "publishedAt": "2022-04-03T02:34:37Z", "content": "New York: In a deeply troubling move to Amazon's Jeff Bezos, workers at his warehouse in New York City have voted to unionise. It is a historic first.\r\nThe US National Labor Relations Board (NLRB) de… [+2752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: What is Tata Neu, the ‘super app’ set to launch on April 7 - The Indian Express", "description": "Tata Neu is the conglomerate’s super app that brings together all of its digital services and apps on a single platform.", "url": "https://indianexpress.com/article/explained/explained-what-tata-neu-super-app-set-launch-april-7-7849419/", "urlToImage": "https://images.indianexpress.com/2022/04/FotoJet-2022-04-02T143555.482-logo-1.jpg", "publishedAt": "2022-04-03T02:19:47Z", "content": "Tata Groups super app Tata Neu is set for launch on April 7. The company made the announcement through a teaser image on the apps Google Play Store page. It had started publicly advertising the super… [+2093 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "2022 Maruti Baleno hatchback reimagined as a crossover [Video] - CarToq.com", "description": "Maruti Suzuki recently launched the all-new Baleno hatchback in the market. In comparison to the previous model, the 2022 version is a lot more updated in terms on features and gets a matured and premium looking exterior. Maruti Baleno is a premium hatchback …", "url": "https://www.cartoq.com/2022-maruti-baleno-hatchback-reimagined-crossover/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/baleno-cross-featured.jpg", "publishedAt": "2022-04-03T02:19:10Z", "content": "Maruti Suzuki recently launched the all-new Baleno hatchback in the market. In comparison to the previous model, the 2022 version is a lot more updated in terms on features and gets a matured and pre… [+2904 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Defiance CEO 'Completely Bullish on Bitcoin' — Says It's 'a Good Time to Get in' – Bitcoin News - Bitcoin News", "description": "The head of Defiance ETFs says she is \"completely bullish on bitcoin.\" Noting that it is a \"good time\" to get into the cryptocurrency, she explained why she believes the price of bitcoin will reach $100K.", "url": "https://news.bitcoin.com/defiance-etfs-ceo-completely-bullish-on-bitcoin-a-good-time-to-get-in/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/04/defiance-etf.jpg", "publishedAt": "2022-04-03T02:02:38Z", "content": "The head of Defiance ETFs says she is “completely bullish on bitcoin.” Noting that it is a “good time” to get into the cryptocurrency, she explained why she believes the price of bitcoin will reach $… [+4038 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Netherlands offers to be India’s ‘gateway’ to fuel EU’s green shift - The Indian Express", "description": "The war in Ukraine has put dialogue around energy dependence in a faster transition mode, said the Netherlands’ Climate Envoy Prince Jaime de Bourbon de Parme, adding there’s potential for the Netherlands and India to explore trade in green hydrogen.", "url": "https://indianexpress.com/article/business/netherlands-offers-to-be-indias-gateway-to-fuel-eus-green-shift-7850058/", "urlToImage": "https://images.indianexpress.com/2022/04/putin-ukrain-AP-1.jpg", "publishedAt": "2022-04-03T01:52:18Z", "content": "With the Russia-Ukraine crisis leading to rise in oil and gas prices, there is a rethink of energy dependency on Russia among the European nations. The Netherlands is looking at reducing its energy d… [+4368 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Hiked Again, Delhi Rates Up By Rs 8 In 13 days - NDTV", "description": "Petrol and diesel prices were on Sunday again hiked by 80 paise a litre each, taking the total increase in rates in less then two weeks to Rs 8 per litre.", "url": "https://www.ndtv.com/india-news/petrol-and-diesel-prices-hiked-again-delhi-rates-up-by-rs-8-in-13-days-2859480", "urlToImage": "https://c.ndtvimg.com/2021-09/ojarjui8_petrol-pump_650x400_28_September_21.jpg", "publishedAt": "2022-04-03T01:44:00Z", "content": "Rates have been increased across the country and vary from state to state depending on local taxation.\r\nNew Delhi: Petrol and diesel prices were on Sunday again hiked by 80 paise a litre each, taking… [+580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Lijee Philip", "title": "EV growth may slow down as safety norms are tightened - Economic Times", "description": "India has the world's stringent testing standard, AIS 156, which includes the fire resistance test where the battery is subject to a direct and indirect flame for over two minutes,  said Niti Aayog CEO Amitabh Kant.  Manufacturers voluntarily ensure that all …", "url": "https://economictimes.indiatimes.com/industry/renewables/ev-growth-may-slow-down-as-safety-norms-are-tightened/articleshow/90617891.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90617897,width-1070,height-580,imgsize-70294,overlay-economictimes/photo.jpg", "publishedAt": "2022-04-03T01:06:00Z", "content": "The surging sales growth of electric vehicles (EVs), especially in the two- and three-wheeler categories that have seen several launches lately, may slow as safety norms are tightened following four … [+1299 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "Anand Mahindra shares video to highlight importance of determination, simplicity and patience to achieve succe - Times Now", "description": "Anand Mahindra shared a video of a little boy trying to catch some fish. Through this video, Mahindra highlighted the significance of determination, simplicity, and patience to achieve success in life.", "url": "https://www.timesnownews.com/viral/anand-mahindra-shares-video-to-highlight-importance-of-determination-simplicity-and-patience-to-achieve-success-watch-article-90616424", "urlToImage": "https://static.tnn.in/thumb/msid-90616424,imgsize-100,width-1280,height-720,resizemode-75/90616424.jpg", "publishedAt": "2022-04-02T21:35:00Z", "content": "Bharti Singh, Haarsh Limbachiyaa welcome baby boy, Neha Kakkar, Arjun Bijlani and more shower congratulatory wishes"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Hero Destini 125 XTEC scooter launched - CarToq.com", "description": "The largest two-wheeler manufacturer in the world Hero MotoCorp recently launched the XTEC variant of its best selling scooter, the Destini 125. The new Destini 125 XTEC has been launched at a price of Rs 79,990 (ex-showroom, Delhi) and will come equipped wit…", "url": "https://www.cartoq.com/hero-destini-125-xtec-scooter-launched/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/destini-fb.jpg", "publishedAt": "2022-04-02T19:04:33Z", "content": "The largest two-wheeler manufacturer in the world Hero MotoCorp recently launched the XTEC variant of its best selling scooter, the Destini 125.\r\nThe new Destini 125 XTEC has been launched at a price… [+1867 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "With Over 90% of BTC's Supply Issued, Bitcoin's Mining Difficulty Reaches a Lifetime High – Mining Bitcoin News - Bitcoin News", "description": "Bitcoin has hit yet another milestone this week, as the network’s mining difficulty is the highest it has ever been.", "url": "https://news.bitcoin.com/with-over-90-of-btcs-supply-issued-bitcoins-mining-difficulty-reaches-a-lifetime-high/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/04/with-over-90-of-btcs-supply-issued-bitcoins-mining-difficulty-reaches-a-lifetime-high.jpg", "publishedAt": "2022-04-02T18:06:24Z", "content": "Bitcoin’s mining difficulty increased this week on March 31, 2022, at block height 729,792 for the first time since February 17. The network’s difficulty jumped 4.31% higher bringing the metric to a … [+4158 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Honda Scoopy patented in India; launch likely - CarToq.com", "description": "The Japanese two-wheeler manufacturer Honda has recently indulged in a patenting spree in India and it seems like the automaker is about to launch a host of new vehicles in the country. Last month we brought to you the news that Honda has patented its entry-l…", "url": "https://www.cartoq.com/honda-scoopy-patented-in-india-launch-likely/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/honda-scoopy-fb.jpg", "publishedAt": "2022-04-02T17:43:12Z", "content": "The Japanese two-wheeler manufacturer Honda has recently indulged in a patenting spree in India and it seems like the automaker is about to launch a host of new vehicles in the country.\r\nLast month w… [+2441 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Brian Bollinger", "title": "SHIB Price Prediction: Technical Indicators Signal SHIB Price To Break $0.000028 Next - CoinGape", "description": "A minor pullback from the $0.000028 resistance tumbled the Shiba Inu(SHIB) price by 10%, hitting the $0.000025 mark. However, the buyers defended this flipped support and rebounded the price with a morning star candle. The SHIB price approaching the overhead …", "url": "https://coingape.com/markets/shib-price-analysis-technical-indicators-hints-the-shib-price-could-overcome-0-000028/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/14160007/photo1638969950-1.jpeg", "publishedAt": "2022-04-02T17:31:43Z", "content": "A minor pullback from the $0.000028 resistance tumbled the Shiba Inu(SHIB) price by 10%, hitting the $0.000025 mark. However, the buyers defended this flipped support and rebounded the price with a m… [+2159 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Gautam Adani joins the elite $100 billion club, surpasses Ambani - Hindustan Times", "description": "Adani has joined the likes of Jeff Bezos and Elon Musk in the exclusive $100 billion club after his net worth jumped nearly $24 billion this year.", "url": "https://www.hindustantimes.com/business/gautam-adani-joins-the-elite-100-billion-club-surpasses-ambani-101648913366906.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/02/1600x900/2021-03-31T094204Z_1_LYNXMPEH2U0LV_RTROPTP_3_ADANI-ENT-AUSTRALIA-COAL_1621561893853_1648915512933.JPG", "publishedAt": "2022-04-02T16:07:38Z", "content": "Gautam Adani, the chairman of Adani Group, is the latest to join the elite $100 billion club as he surpassed Reliance Industries chairman Mukesh Ambani to become India's richest man, according to Blo… [+1863 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Toyota Innova modified with DC Lounge for sale at Rs 6.95 lakh - CarToq.com", "description": "Toyota Innova is one of the most popular MPVs in Indian market. It has created an identity for itself over the years and has been ruling the segment. It is popular among buyers for its comfortable ride, low cost of maintenance and reliable engine. Innova was …", "url": "https://www.cartoq.com/toyota-innova-modified-with-dc-lounge-for-sale/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/dc-innova-featured.jpg", "publishedAt": "2022-04-02T15:53:10Z", "content": "Toyota Innova is one of the most popular MPVs in Indian market. It has created an identity for itself over the years and has been ruling the segment. It is popular among buyers for its comfortable ri… [+2855 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Ambar Warrick", "title": "Bitcoin (BTC) Dominance Retreats As Altcoins Rally, Another Dip? - CoinGape", "description": "Bitcoin market dominance fell sharply over the past two days, as the latest crypto rally became more skewed towards altcoins.", "url": "https://coingape.com/bitcoin-btc-dominance-retreats-as-altcoins-rally-another-dip/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/03/26214906/crypto-bitcoin.jpg", "publishedAt": "2022-04-02T15:42:24Z", "content": "Bitcoin (BTC) saw its market dominance fall sharply over the past two days, as the latest crypto rally became more skewed towards altcoins. A mix of institutional buying and interest in staking appea… [+2264 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Guest Author", "title": "Indonesia’s cryptocurrency community in 2022: An overview - Cointelegraph", "description": "With Indonesia’s burgeoning crypto community and already vibrant artistic scene, NFTs might be the latest chapter in Indonesia’s crypto journey.", "url": "https://cointelegraph.com/news/indonesia-s-cryptocurrency-community-in-2022-an-overview", "urlToImage": "https://images.cointelegraph.com/images/1200_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDQvNzdmYTY4NTctYTgxNy00OWJlLWJhMTYtNmI3YmU4YmQ0MzgwLmpwZw==.jpg", "publishedAt": "2022-04-02T14:03:00Z", "content": "Crypto is the next big thing in Indonesia. According to the Ministry of Trade, transactions for currencies like Bitcoin (BTC)grew over 14 times from a total of 60 trillion rupiahs ($4.1 billion) in 2… [+7065 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "India's Crypto Trading Volume Plummets as New Tax Rules Enter Into Force – Regulation Bitcoin News - Bitcoin News", "description": "The new rules impose a 30% flat tax on cryptocurrency income and do not allow losses to be offset against gains.", "url": "https://news.bitcoin.com/indias-crypto-trading-volume-plummets-as-new-tax-rules-enter-into-force/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/04/india-trading-volume.jpg", "publishedAt": "2022-04-02T13:09:03Z", "content": "Crypto trading volumes in India have plummeted following the new tax law entering into force. The new rules impose a 30% flat tax on crypto income and do not allow losses to be offset against gains.\r… [+2783 chars]"}, {"source": {"id": null, "name": "Beebom"}, "author": null, "title": "OnePlus Nord 2 Allegedly Explodes During Call: Report - Beebom", "description": "Of what seems like a never-ending saga, yet another user has taken to Twitter to report that their OnePlus Nord 2 has allegedly exploded.", "url": "https://beebom.com/oneplus-nord-2-allegedly-explodes-during-call-report/", "urlToImage": "https://beebom.com/wp-content/uploads/2022/04/OnePlus-Nord-2-Allegedly-Explodes-During-Call.jpg", "publishedAt": "2022-04-02T13:04:10Z", "content": "Of what seems like a never-ending saga, yet another user has taken to Twitter to report that their OnePlus Nord 2 has allegedly exploded. According to Twitter user @lakshayvrm, the device seems to ha… [+1590 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Jio, Airtel and Vi 5G Tariffs Will be Low like 4G? Let’s Talk - TelecomTalk", "description": "Before we talk about 5G tariffs, it is important to remember that another round of 4G prepaid tariff hikes is not far. Both Bharti Airtel and Vodafone Idea (Vi) have already said that they will not shy away from hiking tariffs again in 2022.", "url": "https://telecomtalk.info/jio-airtel-and-vi-5g-tariffs-will/508480/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2022/04/jio-airtel-and-vi-5g-tariffs-will.jpeg", "publishedAt": "2022-04-02T12:12:54Z", "content": "Reliance Jio, Bharti Airtel, and Vodafone Idea (Vi) are all expected to launch 5G network services commercially later in 2022. There are a lot of people who doubt that they will go for 5G as they can… [+1865 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Vodafone Idea introduces two new prepaid plans with 30 days and 31 days validity - India Today", "description": "After Reliance Jio and Airtel, telecom operator Vodafone Idea has now introduced prepaid plans with a validity of 30 and 31 days.", "url": "https://www.indiatoday.in/technology/news/story/vodafone-introduces-two-new-prepaid-plans-with-30-days-and-31-days-validity-1932751-2022-04-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202204/Screenshot_2022-04-02_at_5.20.-647x363.png?X4iJe1IcY0byr7XxEBub3peI5AyI5uIH", "publishedAt": "2022-04-02T11:52:02Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Tata Motors delivers 712 Nexon, Tigor EVs in Maharashtra, Goa on one day - HT Auto", "description": "Tata Motors delivered the Nexon EV and the electric sedan Tigor EV to customers, in the biggest EV delivery event held by a four-wheeler OEM in India.", "url": "https://auto.hindustantimes.com/auto/electric-vehicles/tata-motors-delivers-712-nexon-tigor-evs-in-maharashtra-goa-on-one-day-41648899204359.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/04/02/600x338/Car_Lineup_1648899272829_1648899282023.jpg", "publishedAt": "2022-04-02T11:43:35Z", "content": "Tata Motors announced on Saturday that it has delivered 712 electric vehicles to customers today in the biggest EV delivery event held by a four-wheeler OEM in India. Out of the 712 vehicles delivere… [+1627 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Next-Generation Maruti Suzuki Brezza – What We Know Yet - GaadiWaadi.com", "description": "The next-generation Maruti Suzuki Brezza is slated to launch in the coming months, and it will be a lot more premium than the current version", "url": "https://gaadiwaadi.com/next-generation-maruti-suzuki-brezza-what-we-know-yet/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/12/2022-maruti-suzuki-brezza-rendered.jpg", "publishedAt": "2022-04-02T11:30:47Z", "content": "Maruti Suzuki Vitara Brezza is one of the most popular SUVs in India, and it is scheduled to undergo a generation change this year. The new model has already been spied undisguised, and it is expecte… [+1959 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Suzuki Avenis Standard Edition launched at Rs. 86,500 - Team-BHP", "description": "Suzuki has launched a new base variant of the Avenis 125cc scooter. The Avenis Standard Edition is priced at Rs. 86,500 (ex-showroom, Delhi). The Avenis Standard Edition comes with a digital instrument cluster but misses out on connectivity features. The scoo…", "url": "https://www.team-bhp.com/news/suzuki-avenis-standard-edition-launched-rs-86500", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20220401030145_Ave.jpg", "publishedAt": "2022-04-02T11:16:58Z", "content": "Suzuki has launched a new base variant of the Avenis 125cc scooter. The Avenis Standard Edition is priced at Rs. 86,500 (ex-showroom, Delhi).\r\nThe Avenis Standard Edition comes with a digital instrum… [+416 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Haider Ali Khan", "title": "Amazon Pay is working with NPCI to further simplify the UPI experience - Mint", "description": "Customers in India can pay their utility bills with Amazon Pay just by speaking to Alexa.Amazon Pay is expanding its talent pool to solve some of the most critical problems in the payments sphere", "url": "https://www.livemint.com/technology/amazon-pay-is-working-with-npci-to-further-simplify-the-upi-experience-11648894503226.html", "urlToImage": "https://images.livemint.com/img/2022/04/02/600x338/Vikas_Bansal_Amazon_Pay_1648895468166_1648895468387.jpeg", "publishedAt": "2022-04-02T10:31:46Z", "content": "Amazon Pay is among the top digital payments mode preferred by Indians with a large service area including recharges, money transfers, digital payments, ticket bookings acceptable across cities, town… [+7926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shiba Inu Announces Plan To Enter Metaverse, Likely To Compete With Decentraland - NDTV Profit", "description": "The plots have been divided into four categories for the first phase and priced accordingly.", "url": "https://www.ndtv.com/business/shiba-inu-says-launching-virtual-plots-for-up-to-1-eth-in-move-to-challenge-decentraland-2858515", "urlToImage": "https://c.ndtvimg.com/2021-10/fcrrog4o_shiba-token-shiba-inu-cryptocurrency_625x300_27_October_21.jpg", "publishedAt": "2022-04-02T10:29:28Z", "content": "Shiba Inu has announced plans to enter the so-called Metaverse\r\nAfter gaining prominence as the Dogecoin Killer, Shiba Inu has now detailed its vision to enter the so-called Metaverse. The creators o… [+1957 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "EXCLUSIVE: Hyundai To Launch ‘Creta Knight Edition’ Very Soon - GaadiWaadi.com", "description": "Hyundai Creta ‘Knight Edition’ is expected to launch later this month, and it will sport some aesthetic changes over the regular version", "url": "https://gaadiwaadi.com/exclusive-hyundai-to-launch-creta-knight-edition-very-soon/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/04/hyundai-creta-knight-edition-1.jpg", "publishedAt": "2022-04-02T09:50:32Z", "content": "Hyundai Creta is one of the most popular SUVs in the Indian market, although lately, it has been overtaken in terms of sales by a few other SUVs. To up the excitement factor and boost consumer intere… [+1881 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Apoorva Bellapu", "title": "Does Bitcoin Price Hitting US$100k Make any Sense? - Analytics Insight", "description": "Bitcoin is one of the most sought-after cryptocurrency investments. Despite the volatility of the cryptocurrency market, Bitcoin’s price has risen. In this article, we will throw light on bitcoin adoption.", "url": "https://www.analyticsinsight.net/does-bitcoin-price-hitting-us100k-make-any-sense/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/04/Does-Bitcoin-Price-Hitting-US100k-Make-any-Sense.jpg", "publishedAt": "2022-04-02T09:33:58Z", "content": "Bitcoin is undoubtedly the favourite cryptocurrency investment. From corporate investors to retail ones, all have a soft corner for it. With the highest market capitalization, Bitcoin holds importanc… [+2542 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Want to Get Rich this April 2022? Invest in Ethereum (ETH), Solana (SOL) and Mithril Finance (BARS) - Analytics Insight", "description": "Ethereum is one of the leading crypto market coins. Ethereum is a network that revolutionised the financial industry through the popularisation of Decentralised Finance (DeFi). Read more about cryptocurrencies like Ethereum, Solana, and Mithril Finance.", "url": "https://www.analyticsinsight.net/want-to-get-rich-this-april-2022-invest-in-ethereum-eth-solana-sol-and-mithril-finance-bars/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/04/3JVJEMDW55B43NKNYP4NAXXUCU.jpg", "publishedAt": "2022-04-02T08:55:38Z", "content": "Why you should invest in cryptocurrencies like Ethereum, Solana, and Mithril Finance to get rich?\r\nHow much money can you make with crypto? That depends on you, not on the Crypto Market. One of the k… [+4336 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Tata Motors Records Highest-Ever EV Sales In FY2021-22 - GaadiWaadi.com", "description": "In FY2021-22, Tata Motors achieved an annual EV sales figure of 19,106 units, with a 352.86 per cent YoY sales growth", "url": "https://gaadiwaadi.com/tata-motors-records-highest-ever-ev-sales-in-fy2021-22/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/02/Tata-Nexon-EV-dynamic-wallpaper-1.jpg", "publishedAt": "2022-04-02T08:30:55Z", "content": "Tata Motors has announced that it recorded its highest-ever annual EV sales figure – 19,106 units – in FY2021-22. This is a Year-on-Year (YoY) increase of 352.86 per cent, with 4,219 EVs sold by the … [+1961 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Yamaha MT15 V2.0 bookings now open, launch soon - HT Auto", "description": "Yamaha MT15 V2 bookings now open. Yamaha MT15 V2.0 India launch is just around the corner. MT15 V2 price, bookings, launch, specifications.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/yamaha-mt15-v2-0-bookings-now-open-launch-soon-41648882778368.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/04/02/600x338/yamaha-mt-15-review-01-1561703352_1648884725872_1648884732756.jpg", "publishedAt": "2022-04-02T08:25:22Z", "content": "Yamaha MT15 V2.0 India launch is just around the corner as select dealerships have started accepting bookings for the new bike at a token amount ranging from 5,000 to 10,000. The previously sold MT15… [+1568 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Nearly 100 smallcaps gain 10-25% as market rallies in volatile week - Moneycontrol", "description": "For the coming week, expect the market to continue its upward bias, says independent technical analyst Manish Shah.", "url": "https://www.moneycontrol.com/news/business/stocks/nearly-100-smallcap-stocks-gain-10-25-as-market-rallies-in-volatile-week-8308491.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/sensex_nifty_stocknew-2-770x433.jpg", "publishedAt": "2022-04-02T07:19:08Z", "content": "Indian benchmark indices rallied three percent in the volatile week ended April 1 with foreign institutional investors (FIIs) turning net buyers after Russia-Ukraine peace talks and declining crude o… [+7222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mehab Qureshi", "title": "Proof-of-stake: How Ethereum’s next big switch could change the crypto mining industry forever - The Indian Express", "description": "In today's column, we take a look at how Ethereum’s new upgrade could change the crypto mining industry forever.", "url": "https://indianexpress.com/article/technology/crypto/proof-of-stake-how-ethereums-next-big-switch-could-change-the-crypto-mining-industry-forever-7849223/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-93.jpg", "publishedAt": "2022-04-02T06:56:40Z", "content": "Ethereum plans to do this by shifting from a Proof-of-work model to Proof-of-stake. In today’s column, we take a look at how Ethereums new upgrade could change the crypto mining industry forever.\r\nVe… [+6294 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Honda CBR1000RR-R Fireblade Price Reduced By Around Rs. 10 Lakh - GaadiWaadi.com", "description": "Honda 2Wheelers India has slashed the prices of its litre-class superbike - CBR1000RR-R Fireblade - with no other reported changes", "url": "https://gaadiwaadi.com/honda-cbr1000rr-r-fireblade-price-reduced-by-around-rs-10-lakh/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/04/CBR1000RR-front.jpg", "publishedAt": "2022-04-02T05:30:51Z", "content": "Honda Motorcycle and Scooter India has silently reduced the prices of CBR1000RR-R. The Fireblade is now priced at Rs. 23.11 lakh, which is massively lower than the previous price tag of Rs. 32.68 lak… [+1918 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "BQ Research", "title": "The Mutual Fund Show: Why Asset Allocation Funds Are A Good Bet For FY23 - BloombergQuint", "description": "The next 12-18 months will be extremely volatile for Indian markets, says Nimesh Shah of ICICI Prudential AMC", "url": "https://www.bloombergquint.com/business/the-mutual-fund-show-why-asset-allocation-funds-are-a-good-bet-for-fy23", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-03%2Fcbbfb744-32d9-454c-9683-13e53f892bba%2F367429074.jpg?rect=0%2C362%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-04-02T05:29:18Z", "content": "You have consistently come up with thematic funds a couple of years before they caught everyones fancy and they've given good returns in the past. As a fund house, what are the themes or sectoral fun… [+3243 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Despite sanctions, Putin may collect $321 billion windfall if oil and gas keep flowing - Economic Times", "description": "Bloomberg Economics expects Russia will earn nearly $321 billion from energy exports this year, an increase of more than a third from 2021. Its also on track for a record current-account surplus that the Institute of International Finance says may reach as hi…", "url": "https://economictimes.indiatimes.com/news/international/world-news/despite-sanctions-putin-may-collect-321-billion-windfall-if-oil-and-gas-keep-flowing/articleshow/90604724.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90604726,width-1070,height-580,imgsize-29906,overlay-economictimes/photo.jpg", "publishedAt": "2022-04-02T05:16:00Z", "content": "Russias economy has staggered through the first full month of the war with Ukraine but it may yet emerge with a sparkling balance sheet if some of its biggest trade partners dont turn off the tap on … [+3988 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Somit Sen", "title": "Petrol price in Parbhani breaches Rs 120-mark, highest in Maharashtra - Times of India", "description": "Petrol price in Parbhani breached the Rs 120-mark, an all-time high. This is the highest petrol rate ever in Maharashtra as the fuel was being sold fo", "url": "https://timesofindia.indiatimes.com/city/mumbai/petrol-price-in-parbhani-breaches-rs-120-mark-highest-in-maharashtra/articleshow/90604281.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-90604291,width-1070,height-580,imgsize-10462,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-04-02T04:44:00Z", "content": null}, {"source": {"id": null, "name": "The-ken.com"}, "author": null, "title": "How Reliance beat Amazon to take over Future Group - The Nutgraf by The Ken - The Ken", "description": "It’s a story of legal smarts combined with some old-fashioned ruthlessness.", "url": "https://the-ken.com/the-nutgraf/how-reliance-beat-amazon-to-take-over-future-group/", "urlToImage": "https://the-ken.com/wp-content/uploads/2022/04/Nutgraf_Lede.png", "publishedAt": "2022-04-02T04:32:08Z", "content": "There are usually two answers to the question of who controls a company. \r\nOne answer is whoever controls the stock of the company. Maybe it’s the shareholders or the board of directors or a trust. O… [+1933 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Mahindra Sales Up By 66% In March 2022 - Bolero, Scorpio, XUV700 - GaadiWaadi.com", "description": "Mahindra posted 27,603 units in the month of March 2022 as against 16,643 units with a YoY volume increase of 66 per cent", "url": "https://gaadiwaadi.com/mahindra-sales-up-by-66-in-march-2022-bolero-scorpio-xuv700/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/01/XUV700-Deepak-Kasabi-.jpg", "publishedAt": "2022-04-02T04:09:23Z", "content": "Mahindra &amp; Mahindra recorded a cumulative domestic tally of 27,603 units in the month of March 2022 as against 16,643 units during the same period last year with a massive YoY sales increase of 6… [+1948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Explained: What is the Current Account Deficit, which widened in Q3 of the last FY? - The Indian Express", "description": "The widening of CAD in Q3 of 2021-22 was mainly on account of higher trade deficit, according to the Reserve Bank of India.", "url": "https://indianexpress.com/article/explained/everyday-explainers/explained-what-current-account-deficit-widened-q3-last-fy-7848400/", "urlToImage": "https://images.indianexpress.com/2022/04/eco.jpg", "publishedAt": "2022-04-02T03:26:49Z", "content": "Indias Current Account Deficit (CAD) increased to $23 billion (2.7 per cent of GDP) in the third quarter (Q3) of 2021-22 from $9.9 billion (1.3 per cent of GDP) in Q2 of 2021-22 and $2.2 billion (0.3… [+3470 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Driving in CNG cars in Delhi NCR becomes more expensive: Check new rates - HT Auto", "description": "CNG price in Delhi NCR has been hiked for the sixth time in last four weeks. With the latest increase, CNG price has gone up by around ₹4 per kg.", "url": "https://auto.hindustantimes.com/auto/news/cng-price-hiked-again-in-delhi-check-new-rates-41648865658837.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/04/02/600x338/CNG_Boot_Space_1579603511215_1648865762379.jpg", "publishedAt": "2022-04-02T02:30:34Z", "content": "Driving around in CNG cars in Delhi NCR just got more expensive. CNG rates have been hiked once again on Friday by 80 paise per kg. According to information posted on the website of Indraprastha Gas … [+1677 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Viswanath Pilla", "title": "Dr Reddy's buys Novartis cardiovascular brand Cidmus in India for Rs 456 crore - Economic Times", "description": "Dr. Reddys will look to leverage its wide base to engage with healthcare professionals, and to significantly enhance the reach of the product in and beyond metros into tier-I and tier-II markets in India through its strong marketing and distribution network t…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/dr-reddys-buys-novartis-cardiovascular-brand-cidmus-in-india-for-rs-456-crore/articleshow/90602679.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90602690,width-1070,height-580,imgsize-921756,overlay-economictimes/photo.jpg", "publishedAt": "2022-04-02T02:23:00Z", "content": "Dr. Reddy's on Friday said it has entered into an agreement with Novartis to acquire the cardiovascular brand Cidmus in India for Rs 456 crore ($61 million).\r\nUnder the agreement, Dr. Reddys will be … [+1587 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Volkswagen Taigun SUV: New TVC released [Video] - CarToq.com", "description": "Volkswagen India launched their compact SUV Taigun in the market last year. It is the first product to be launched under Volkswagen’s India 2.0 Strategy. Deliveries for the Volkswagen Taigun has already started and the car has been spotted on road several tim…", "url": "https://www.cartoq.com/volkswagen-taigun-suv-tvc/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/taigun-featured.jpg", "publishedAt": "2022-04-02T02:15:00Z", "content": "Volkswagen India launched their compact SUV Taigun in the market last year. It is the first product to be launched under Volkswagen’s India 2.0 Strategy. Deliveries for the Volkswagen Taigun has alre… [+3057 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Multibagger penny stock: Tata group share gives 8650% return in 2 years - Mint", "description": "Multibagger stock: If an investor had invested  ₹1 lakh in this multibagger penny stock 6 months ago, its  ₹1 lakh would have turned to  ₹4.50 lakh today", "url": "https://www.livemint.com/market/stock-market-news/multibagger-penny-stock-tata-group-share-gives-8650-return-in-2-years-11648863492628.html", "urlToImage": "https://images.livemint.com/img/2022/04/02/600x338/20210121057L_1612784555095_1612784568783_1648863647928.jpg", "publishedAt": "2022-04-02T01:46:01Z", "content": "Multibagger penny stock: In first quarter of 2022, Indian secondary market has delivered 90 multibagger stocks. However, there are good number of stock in Indian stock market that have been giving st… [+1913 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "A Perfect Inflationary Storm is Brewing at the Intersection of India’s Coal and Power Sectors - The Wire", "description": "The inflationary overhang of Russia's invasion of Ukraine, increasing domestic power consumption as summer approaches and a sky-high Indonesian coal price index are all working in tandem to make this summer one of the worst the Indian power consumer has had t…", "url": "https://thewire.in/energy/a-perfect-inflationary-storm-is-brewing-at-the-intersection-of-indias-coal-and-power-sectors", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/06/02180606/2ce4aa21-e64f-4205-9bac-72dbb1391f35-2060x1236-1-800x400.jpeg", "publishedAt": "2022-04-02T01:45:37Z", "content": "Mumbai: The age of inflation is upon us. Fast-moving consumer goods (FMCG), consumer durables, cars, two-wheelers, fuel, fertilisers, steel, nickel, semi-conductors and many other finished products a… [+6699 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Gold price today: Yellow metal dips ₹4000 from recent high. Should you buy? - Mint", "description": "MCX gold price today is standing at support zone of  ₹50,500 to  ₹50,800 per 10 gm levels, believe experts", "url": "https://www.livemint.com/market/commodities/gold-price-today-yellow-metal-dips-rs-4000-from-recent-high-should-you-buy-11648860634304.html", "urlToImage": "https://images.livemint.com/img/2022/04/02/600x338/2021-02-01T112953Z_1611064046_RC2NJL96MDKD_RTRMADP_3_INDIA-GOLD-DUTY_1613883950532_1613883964571_1648860858996.JPG", "publishedAt": "2022-04-02T01:02:29Z", "content": "Gold price this week erased last weeks gains as the metals safe-haven demand dimmed amid progress in Russia-Ukraine peace talks. Multi Commodity Exchange or MCX gold rate on Friday ended 310 per 10 g… [+3986 chars]"}, {"source": {"id": null, "name": "WWD"}, "author": "Evan Clark", "title": "CEO Pay Comparisons: Amazon's Easily Outstrips Macy's, Urban - WWD", "description": "The web giant’s chief Andy Jassy is in a league by himself.", "url": "https://wwd.com/fashion-news/fashion-scoops/amazon-andy-jassy-macys-jeff-gennette-ceo-pay-urban-1235148656/", "urlToImage": "https://wwd.com/wp-content/uploads/2021/07/Andy-Jassy.jpeg?w=1024", "publishedAt": "2022-04-01T22:47:54Z", "content": "If CEO pay is a rough measure of a company’s absolute power, it’s another sign that Amazon is still winning. \r\nRegulatory filings on Friday from Amazon, Macy’s Inc. and Urban Outfitters Inc. detailed… [+1649 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Ashley Coutinho", "title": "Whistleblower files complaint against Invesco mutual fund - Business Standard", "description": "The complaint has been filed with the Securities and Exchange Board of India (Sebi) as well as with the US Securities and Exchange Commission (US SEC)", "url": "https://www.business-standard.com/article/companies/whistleblower-files-complaint-against-invesco-mutual-fund-122040200029_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-10/12/full/1633986387-3877.jpg", "publishedAt": "2022-04-01T19:07:00Z", "content": "A whistleblower has filed a complaint against Invesco Asset Management (India), alleging irregularities in the management of its fixed income schemes.\r\nThe complaint has been filed with the Securitie… [+3981 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gravitas: Apple and Meta gave user data to hackers - WION", "description": "Were Apple and Meta compromised? A report has claimed that the tech giants gave user data to hackers who forged legal requests. Palki Sharma tells you more.#...", "url": "https://www.youtube.com/watch?v=cSeTfuuN_Cs", "urlToImage": "https://i.ytimg.com/vi/cSeTfuuN_Cs/maxresdefault.jpg", "publishedAt": "2022-04-01T18:45:01Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gravitas: How does the Rupee-Rouble system work? - WION", "description": "Amid western sanctions, Russia is pushing for bilateral trade in roubles and rupees. How does the rupee-rouble deal work? Why is India wary despite Russia of...", "url": "https://www.youtube.com/watch?v=gx9-dMH86_4", "urlToImage": "https://i.ytimg.com/vi/gx9-dMH86_4/maxresdefault.jpg", "publishedAt": "2022-04-01T18:30:24Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Ideas For Profit | Hero MotoCorp: Why the stock looks attractive despite reports of IT raids - Moneycontrol", "description": "There have been media reports wherein Hero MotoCorp has been accused of raising Rs 1,000 crore bogus expenses, which the company in its clarification has denied. Hero’s corporate governance has always been top notch and it is unlikely that these accusations a…", "url": "https://www.moneycontrol.com/news/business/earnings/ideas-for-profit-hero-motocorp-why-the-stock-looks-attractive-despite-reports-of-it-raids-8307731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/ideas-hero-770x433.jpg", "publishedAt": "2022-04-01T17:17:00Z", "content": null}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Well-maintained Audi, Mercedes-Benz & BMW luxury cars for sale [Video] - CarToq.com", "description": "Cars from luxury car brands like Mercedes-Benz, Audi & BMW are a common sight on Indian roads. Over the year, these brands have established themselves in India. Market for such luxury cars have also gone up in the market, in the last couple of years. The main…", "url": "https://www.cartoq.com/used-cars/well-maintained-audi-mercedes-benz-bmw-luxury-cars-for-sale/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/luxury-used-featured.jpg", "publishedAt": "2022-04-01T15:58:45Z", "content": "Cars from luxury car brands like Mercedes-Benz, Audi &amp; BMW are a common sight on Indian roads. Over the year, these brands have established themselves in India. Market for such luxury cars have a… [+3311 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "2022 MG ZS EV bookings cross the 1,500 mark - Team-BHP", "description": "MG Motor India has announced that it has received over 1,500 bookings for the 2022 ZS EV. The updated ZS EV was launched on March 7, 2022. The electric SUV is available in two variants: Excite and Exclusive, with prices starting at Rs.", "url": "https://www.team-bhp.com/news/2022-mg-zs-ev-bookings-cross-1500-mark", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/mg-zs-ev-2022-electric-car_1646642201.jpeg", "publishedAt": "2022-04-01T15:22:06Z", "content": "MG Motor India has announced that it has received over 1,500 bookings for the 2022 ZS EV.\r\nThe updated ZS EV was launched on March 7, 2022. The electric SUV is available in two variants: Excite and E… [+755 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "ED issues Rs 7,272-cr FEMA notice to BSE-listed company - Economic Times", "description": "The Enforcement Directorate (ED) said the company is listed on the Bombay Stock Exchange (BSE) and has an authorised dealer category-II licence issued by the Reserve Bank of India (RBI).", "url": "https://economictimes.indiatimes.com/markets/stocks/news/ed-issues-rs-7272-cr-fema-notice-to-bse-listed-company/articleshow/90596473.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90596528,width-1070,height-580,imgsize-33556,overlay-etmarkets/photo.jpg", "publishedAt": "2022-04-01T14:35:00Z", "content": "New Delhi: A show-cause notice of Rs 7,272 crore for an alleged contravention of the provisions of the FEMA has been issued against a BSE-listed company, Transcorp International Limited, and its prom… [+1397 chars]"}]}