{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "Vivek Phadnis", "title": "End of the road: Why auto giants quit India - Deccan Herald", "description": "When someone bought a Chevrolet Cruze or a Ford Fiesta, it was based on trust in a solid American car with proven credentials. There was also a bit of a cult and fan following with models such as these.    But the mighty have now fallen. Four years after Gene…", "url": "https://www.deccanherald.com/specials/sunday-spotlight/end-of-the-road-why-auto-giants-quit-india-1031913.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/09/19/clipboard-2021-09-19t033514267-1031913-1632009258.jpg", "publishedAt": "2021-09-18T22:09:48Z", "content": "When someone bought a Chevrolet Cruze or a Ford Fiesta, it was based on trust in a solid American car with proven credentials. There was also a bit of a cult and fan following with models such as the… [+6454 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "5 used Electric SUVs for sale: Tata Nexon EV to MG eZS - Cartoq", "description": "Electric vehicles are going to be the future of mobility. In the last couple of years, we have seen the launch of new electric cars an two wheelers in the Indian market. Several car makers have already started working on electric vehicles while many have alre…", "url": "https://www.cartoq.com/5-used-electric-suvs-for-sale/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/09/Used-EV-featured-1.jpg", "publishedAt": "2021-09-18T16:15:37Z", "content": "Electric vehicles are going to be the future of mobility. In the last couple of years, we have seen the launch of new electric cars an two wheelers in the Indian market. Several car makers have alrea… [+3746 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Limits on airfares to remain for 15 days at any given time: Aviation Ministry - Moneycontrol", "description": "The lower and upper limits on airfares will remain for 15 days at any given time and the airlines will be free to charge without any limits from the 16th day onwards, the Civil Aviation Ministry has said.", "url": "https://www.moneycontrol.com/news/india/limits-on-airfares-to-remain-for-15-days-at-any-given-time-aviation-ministry-7481451.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/airlinedeltaflightairport-770x433.jpeg", "publishedAt": "2021-09-18T16:06:10Z", "content": "The lower and upper limits on airfares will remain for 15 days at any given time and the airlines will be free to charge without any limits from the 16th day onwards, the Civil Aviation Ministry said… [+2036 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Domestic flight fare band applicable for 15 days a month: Here is what it means - Hindustan Times", "description": "Domestic flight capacity has been increased to 85 per cent, the civil aviation ministry said.  | Latest News India", "url": "https://www.hindustantimes.com/india-news/domestic-flight-fare-band-applicable-for-15-days-a-month-here-is-what-it-means-101631977988074.html", "urlToImage": "https://images.hindustantimes.com/img/2021/09/18/1600x900/b9763b08-0bfc-11ec-bef6-cf3476bb3c4f_1631978085881_1631978098127.jpg", "publishedAt": "2021-09-18T15:16:23Z", "content": "The ministry of civil aviation has increased the passenger capacity from 72.5 per cent to 85 per cent in a breather to the airlines as the Covid situation in the country is improving. At the same tim… [+2038 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "KEC International to acquire EPC firm Spur Infra for enterprise value of Rs 62 crore - Moneycontrol", "description": "Spur Infra is an Indian EPC company that sets up cross-country oil and gas pipelines and city gas distribution networks. The acquisition, KEC International said, is expected to be completed within 60 days from the date of the agreement.", "url": "https://www.moneycontrol.com/news/business/kec-international-acquires-epc-firm-spur-infra-for-enterprise-value-of-rs-62-crore-7481221.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/09/gas-pipeline-1-770x433.jpg", "publishedAt": "2021-09-18T15:10:52Z", "content": "KEC International an RPG Group company that is a global infrastructure Engineering, Procurement, and Construction major -- has acquired an EPC company in the oil and gas pipelines sector, the company… [+1163 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "TCS, Infosys, Wipro, Other IT Giants Hiring Aggressively; Offering 120% Salary Hike, Bonus to Joinees. Here's - India.com", "description": "IT services major Tata Consultancy Services (TCS) recently announced that it has started its biggest recruitment drive for women professionals who are looking for job opportunities after a career gap.", "url": "https://www.india.com/business/tcs-infosys-wipro-other-it-giants-hiring-aggressively-offering-120-salary-hike-bonus-to-joinees-heres-why-4965641/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/08/TCS-HCL-Infosys-Wipro-Jobs.jpg", "publishedAt": "2021-09-18T12:56:34Z", "content": "Home &gt; Business\r\nIT services major Tata Consultancy Services (TCS) recently announced that it has started its biggest recruitment drive for women professionals who are looking for job opportunitie… [+3671 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "Chakri K", "title": "Telecom Operators Might See ARPU Rise Without Tariff Hikes - TelecomTalk", "description": "It has been reported that telecom operators in India can increase their ARPU without hiking the tariff as there is an increase in the usage of data right now.", "url": "https://telecomtalk.info/telecom-operators-arpu-rise-without-tariff-hikes/467271/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2021/09/Telecom-Operators-Might-See-ARPU-Rise-Without-Tariff-Hikes.jpeg", "publishedAt": "2021-09-18T12:46:50Z", "content": "The telecom operators in India started witnessing a drop in the ARPU (average revenue per user) in recent years due to the low-cost plans. Eventually, the telcos claim to have made losses and the gov… [+1869 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Want to check the number of mobile numbers linked to Aadhaar? Here`s how to do it on govt`s TAFCOP portal - Zee News", "description": "The portal helps users in knowing how many SIM cards have been issued on the same number. For that, users will have to visit the portal and report the numbers that are no longer used by them or are required. The telecom service providers will block or deactiv…", "url": "https://zeenews.india.com/technology/want-to-check-the-number-of-mobile-numbers-linked-to-aadhaar-here-s-how-to-do-it-on-govts-tafcop-portal-2395076.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/09/18/971768-aadhaar-card-2.jpg", "publishedAt": "2021-09-18T11:44:57Z", "content": "Recently fraudsters have been able to secure a lot of SIM cards by pretending to be someone else, as eKYC with fingerprint verification is quite easy to crack.\r\nIn order to avoid misuse of SIM cards … [+1480 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Milan Vaishnav CMT MSTA", "title": "Dalal Street Week Ahead: Which sectors may lead market action, and which ones may lag - Economic Times", "description": "The coming week may see the 17,680 and 17,790 levels put up strong resistance, while support may come in at 17,480 and 17,355 levels. The trading range is likely to stay wider than usual in the coming days.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-which-sectors-may-lead-market-action-and-which-ones-may-lag/articleshow/86318547.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86318524,width-1070,height-580,imgsize-655876,overlay-etmarkets/photo.jpg", "publishedAt": "2021-09-18T11:32:00Z", "content": "As discussed in our earlier technical note, the Indian equity market has become grossly overbought, which is why it is largely expected to consolidate. However, in the first four days of the week gon… [+4275 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Natural gas prices up over 4% this week - Moneycontrol.com", "description": "The gas price has been trading higher than the 20, 50, 100, and 200-day simple and exponential moving averages but lower than the 5-day simple and exponential moving average (EMA) on a daily chart.", "url": "https://www.moneycontrol.com/news/business/commodities/natural-gas-prices-up-over-4-this-week-7480661.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/Natural-gas-770x433.png", "publishedAt": "2021-09-18T11:06:55Z", "content": "Natural gas prices climbed 4.05 percent this week to settle at Rs 379.90 per mmBtu on the MCX after scaling a new 52-week high to touch the highest level since October 2008 during the week. The energ… [+2630 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Paras Defence IPO: What GMP signals before subscription opening date - Mint", "description": "Paras Defence IPO GMP today is  ₹210 —  ₹10 higher from its yesterday's grey market premium of  ₹200", "url": "https://www.livemint.com/market/ipo/paras-defence-ipo-what-gmp-signals-before-subscription-opening-date-11631962761908.html", "urlToImage": "https://images.livemint.com/img/2021/09/18/600x338/Paras_Defence_IPO_GMP_1_web_1631962843917_1631962852729.PNG", "publishedAt": "2021-09-18T11:05:08Z", "content": "Paras Defence IPO (initial public offering) is opening on 21st September 2021 and it will remain open for bidding till 23rd September 2021. Promoters of the company have fixed Paras Defence IPO price… [+2503 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Mumbai seems to have lost the aviation game completely - Moneycontrol", "description": "With Jet Airways shifting its headquarters to Gurugram, Go First is the only airline to be headquartered in Mumbai. The expansion of Delhi to Gurugram and NOIDA, cheaper rents, better infrastructure and connectivity and improved housing are the winning factor…", "url": "https://www.moneycontrol.com/news/business/mumbai-seems-to-have-lost-the-aviation-game-completely-7477731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/05/jet_airways-770x433.jpg", "publishedAt": "2021-09-18T10:48:47Z", "content": "The last few days have been fast-moving in Indian aviation, with the 100-day plan by the civil aviation ministry, followed by SpiceJet doing a second commercial settlement with a lessor, and the mid-… [+4899 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "FD calculator: These 3 private banks revised fixed deposit rates. Details here - Mint", "description": "FD calculator: Fixed deposit accounts are available in all PSU, private sector and small finance banks or SFBs but their FD interest rates varies", "url": "https://www.livemint.com/money/personal-finance/fd-calculator-these-3-private-banks-revised-fixed-deposit-rates-details-here-11631960760683.html", "urlToImage": "https://images.livemint.com/img/2021/09/18/600x338/FD-kqDG--621x414@LiveMint_1631960870107.jpg", "publishedAt": "2021-09-18T10:37:11Z", "content": "FD calculator: Opening a fixed deposit (FD) account is one of the various investment options to set aside finances for a rainy day or for achieving financial goals for short-term. In September 2021, … [+4924 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Zydus Cadila Gets USFDA Nod to Market Depression Treatment Drug - News18", "description": "Drug firm Zydus Cadila on Saturday said it has received approval from the US health regulator to market Vortioxetine Tablets, used to treat depression, in the American market.", "url": "https://www.news18.com/news/business/zydus-cadila-gets-usfda-nod-to-market-depression-treatment-drug-4217618.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/08/zydus-cadila-162947239016x9.jpg", "publishedAt": "2021-09-18T10:34:18Z", "content": "Drug firm Zydus Cadila on Saturday said it has received approval from the US health regulator to market Vortioxetine Tablets, used to treat depression, in the American market. The company has receive… [+669 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Profit booking, Fed meet outcome to impact Indian equities moves next week - Business Standard", "description": "\"With weak US job data and inflation increasing at a slower pace, Fed is not expected to hint on taper plans in the upcoming meeting, says an analyst", "url": "https://www.business-standard.com/article/markets/greed-fear-profit-booking-global-volatility-to-impact-stock-moves-ians-market-forecast-121091800385_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/28/full/1622174860-3625.jpg", "publishedAt": "2021-09-18T09:55:00Z", "content": "Sky-high valuations along with global tapering fears will impact stock market movements during the upcoming week.\r\nAccordingly, market observers, pointed out high possibility of profit booking led sl… [+3328 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Arun Prakash", "title": "Tata Punch Spied While Getting Transported - New Colour Option - RushLane", "description": "Tata Motors is expected to officially launch the Punch micro UV next month and would rival Mahindra KUV100 and Maruti Ignis.", "url": "https://www.rushlane.com/tata-punch-spied-while-getting-transported-new-colour-option-12412583.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/09/tata-punch-new-colour-spied-1.jpg", "publishedAt": "2021-09-18T09:10:23Z", "content": "Tata Punch New Colour\r\nTata Motors is gearing up to launch its upcoming micro UV called Punch. Ahead of launch, images of the Punch in Red / Orange colour were leaked earlier this week. Now, Team-BHP… [+2942 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Meet Diya, a 19 year old girl from Kerala who repairs Royal Enfield motorcycles - CarToq.com", "description": "Royal Enfield is one of the most popular brand among motorists in India and around the world. This Chennai based two wheeler manufacturer is known for manufacturing retro looking motorcycles. There Bullet and Classic series motorcycles have a huge fan followi…", "url": "https://www.cartoq.com/diya-19-year-old-girl-from-kerala-repairs-royal-enfield/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/09/RE-girl-mechanic-featured.jpg", "publishedAt": "2021-09-18T08:57:25Z", "content": "Royal Enfield is one of the most popular brand among motorists in India and around the world. This Chennai based two wheeler manufacturer is known for manufacturing retro looking motorcycles. There B… [+3148 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Tata Safari Gold Edition Launched In India – 5 Things To Know - GaadiWaadi.com", "description": "Here, we have listed the top five things that you should know about the newly-launched Tata Safari Gold Edition", "url": "https://gaadiwaadi.com/tata-safari-gold-edition-launched-in-india-5-things-to-know/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/Tata-Safari-Gold-Edition-Interior.jpg", "publishedAt": "2021-09-18T08:44:06Z", "content": "Tata Motors has added a new special edition version to the Safari range, named Gold Edition. This new version will be showcased to the public for the first time at the VIVO IPL 2021, which will be he… [+2136 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anupam Nagar", "title": "Irving Kahn's tips on how to avoid downside risk and preserve capital - Economic Times", "description": "Kahn said an investor should initially focus on preserving capital, instead of targeting huge returns on investment from the outset.  If you achieve only reasonable returns and suffer minimal losses, will you become a wealthy man and surpass any gambler frien…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/irving-kahns-tips-on-how-to-avoid-downside-risk-and-preserve-capital/articleshow/86315927.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86315959,width-1070,height-580,imgsize-55744,overlay-etmarkets/photo.jpg", "publishedAt": "2021-09-18T08:39:00Z", "content": "Investing legend Irving Kahn said the key to building great wealth is to achieve reasonable returns and suffer minimal losses. He said in order to succeed in the investing world, one has to consider … [+12539 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mansi Taneja, ET Telecom", "title": "Telecom Diary: Resurrection of Vodafone Idea, tariff hikes to be a game changer post relief package - ETTelecom.com", "description": "Vi, though, may have received the first survival dose by way of a relief package but its woes are far from over. The fate is still hanging by a thread. Unless, there is a tariff revision upwards, it will always be a difficult road to tread especially for Vi. …", "url": "https://telecom.economictimes.indiatimes.com/news/telecom-diary-resurrection-of-vodafone-idea-tariff-hikes-to-be-a-game-changer-post-relief-package/86315693", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-86315693,imgsize-69457,width-800,height-434,overlay-ettelecom/telecom-diary-resurrection-of-vodafone-idea-tariff-hikes-to-be-a-game-changer-post-relief-package.jpg", "publishedAt": "2021-09-18T08:30:00Z", "content": "The struggling telecom player Vodafone Idea (Vi) got a breather this week as the government announced a relief package for the telecom sector which includes a moratorium on adjusted gross revenues (A… [+4746 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Google Abused Android Dominance In India, Finds Antitrust Probe: Report - NDTV", "description": "Google abused the dominant position of its Android operating system in India, using its \"huge financial muscle\" to illegally hurt competitors, antitrust authority Competition Commission of India (CCI) found in a report on its two-year probe.", "url": "https://www.ndtv.com/india-news/google-abused-android-dominance-in-india-finds-antitrust-probe-report-2545203", "urlToImage": "https://c.ndtvimg.com/2021-09/fcm7l9vg_google-android-generic-reuters-650_625x300_18_September_21.jpg", "publishedAt": "2021-09-18T08:23:08Z", "content": "Google told Reuters in a statement it looks forward to working with the CCI. (File)\r\nNew Delhi: Google abused the dominant position of its Android operating system in India, using its \"huge financial… [+2856 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Ford Indias Chennai workers restart EcoSport production for exports - Business Standard", "description": "Even as their morale is down with job loss staring at their faces, workers at the Chennai plant of Ford India Private Ltd have restarted production of EcoSport for exports, said an official.", "url": "https://www.business-standard.com/article/automobile/ford-india-s-chennai-workers-restart-ecosport-production-for-exports-121091800417_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/10/full/1631277596-3077.jpg", "publishedAt": "2021-09-18T08:05:00Z", "content": "Even as their morale is down with job loss staring at their faces, workers at the Chennai plant of Ford India Private Ltd have restarted production of EcoSport for exports, said an official.\r\nThe com… [+3843 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Non-filers of monthly GST return to be barred from filing GSTR-1 from next year - Mint", "description": "The GST Council in its Lucknow meeting on September 17 has decided to take a host of measures to streamline compliance, including mandatory Aadhaar authentication for businesses", "url": "https://www.livemint.com/politics/policy/nonfilers-of-1-monthly-gst-return-to-be-barred-from-filing-gstr-1-from-next-year-11631950661299.html", "urlToImage": "https://images.livemint.com/img/2021/09/18/600x338/ANI-20210917066-0_1631950817723_1631950832720.jpg", "publishedAt": "2021-09-18T07:42:25Z", "content": "NEW DELHI :\r\nBusinesses that default on filing summary return and paying monthly GST will not be able to file GSTR-1 sales return of the succeeding month from January 1 next year.\r\nThe GST Council in… [+1966 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "This multibagger pharma stock triples shareholders' money in six months - Mint", "description": "Multibagger stock: If an investor had invested  ₹1 lakh in this small-cap pharma counter one month ago and had remained invested till date, its  ₹1 lakh would have become  ₹1.30 lakh today", "url": "https://www.livemint.com/market/stock-market-news/this-multibagger-pharma-stock-triples-shareholders-money-in-six-months-11631950372561.html", "urlToImage": "https://images.livemint.com/img/2021/09/18/600x338/20201013050L_1607687134862_1607687165137_1631950462980.jpg", "publishedAt": "2021-09-18T07:37:02Z", "content": "Multibagger stock: In the wake of NSE Nifty, BSE Sensex, BSE Small-cap and BSE Mid-cap indices trading near to its lifetime high, a good number of stocks have entered list of multibagger stocks in 20… [+1754 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Muntazir Abbas, ET Telecom", "title": "Airtel chief's comments on floor price validate Trai stance: Official - ETTelecom.com", "description": "\"The Cabinet-approved relief package is more important than seeking a floor price that may only be done in a scenario when the financial health of all telcos remain in bad shape,\" the official said. The telecom tariffs are currently under forbearance.", "url": "https://telecom.economictimes.indiatimes.com/news/floor-for-tariff-a-complex-issue-enough-sectoral-competition-necessary-trai-official/86286454", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-86286454,imgsize-93711,width-800,height-434,overlay-ettelecom/airtel-chief-s-comments-on-floor-price-validate-trai-stance-official.jpg", "publishedAt": "2021-09-18T07:30:00Z", "content": "NEW DELHI: Bharti Airtel chairman Sunil Bharti Mittals comments that the industry does not need regulatory intervention for pricing has validated the telecom regulators stance that setting up floor t… [+2720 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "Desktops, laptops and tablet market in India: What “worked and didn't” for top 5 companies in Q2-2021 - Gadgets Now", "description": "The shipments in the PC market in India -- comprising tablets, laptops and desktop PCs -- touched 4.1 million units during the second quarter of 2021 (April-May-June), translating into a growth of 43%, according to a report by Canalys. The market crossed 4 mi…", "url": "https://www.gadgetsnow.com/slideshows/desktops-laptops-and-tablet-market-in-india-what-worked-and-didnt-for-top-5-companies-in-q2-2021/photolist/86314675.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86314711,width-800,resizemode-4,imgsize-10782/share.jpg", "publishedAt": "2021-09-18T07:14:00Z", "content": "Lenovo witnessed the weakest year-on-year growth as per the report. Part of the reason for this slower-than-average growth was its strong performance in Q2 2020, when it managed its supply chain bett… [+219 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "GST: Your carbonated fruit juice-based drink is all set to get costlier - Economic Times", "description": "The GST Council in its 45th meeting held in Lucknow has given a new dimension to the entire debate on what should be the tax rate for fruit-based or fruit juice-based drinks.", "url": "https://economictimes.indiatimes.com/small-biz/gst/gst-your-carbonated-fruit-juice-based-drink-is-all-set-to-get-costlier/articleshow/86313956.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86314066,width-1070,height-580,imgsize-467350,overlay-etrise/photo.jpg", "publishedAt": "2021-09-18T06:33:00Z", "content": "The classification of fruit-based or fruit juice-based drinks have always been the issue of investigation by the tax authorities. The classification of such beverages under GST tariff is primarily de… [+5608 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Prashant Jha", "title": "Breaking: Binance Reportedly Under CFTC Investigation For Insider Trading - Coingape", "description": "Binance's regulatory woes have now expanded to the US, in what could be its worst regulatory showdown until now. A recent report from Bloomberg highlighted that the US Commodity Futures Trading Commission (CFTC) is now looking into the crypto exchange on alle…", "url": "https://coingape.com", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/08/11005716/CZ.jpg", "publishedAt": "2021-09-18T06:31:00Z", "content": "Binance’s regulatory woes have now expanded to the US, in what could be its worst regulatory showdown until now. A recent report from Bloomberg highlighted that the US Commodity Futures Trading Commi… [+2126 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "India-bound Tesla Model Y nails the moose test - CarToq.com", "description": "Earlier this year, Tesla announced their official entry into the Indian market. As of now, there is no details available regarding when the cars will be launched but, some information regarding the models that will be offered are available. Tesla will be offe…", "url": "https://www.cartoq.com/tesla-model-y-nails-the-moose-test/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/09/Tesla-Model-Y-moose-test-featured.jpg", "publishedAt": "2021-09-18T06:20:41Z", "content": "Earlier this year, Tesla announced their official entry into the Indian market. As of now, there is no details available regarding when the cars will be launched but, some information regarding the m… [+2822 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Time to turn bullish on PSU banks after Cabinet clears Rs 30,600 crore-guarantee for bad bank? - Moneycontrol.com", "description": "The country's largest lender State Bank of India is one of the top picks in the PSU banking space, which experts say can beat private banks", "url": "https://www.moneycontrol.com/news/business/markets/time-to-turn-bullish-on-psu-banks-after-cabinet-clears-rs-30600-crore-guarantee-for-bad-bank-7478571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/bank-NPA_shutterstock_1552813277-770x433.jpg", "publishedAt": "2021-09-18T05:30:14Z", "content": "With the Cabinet giving the go-ahead to government guarantees for security receipts of Rs 30,600 crore, the non-performing asset (NPA) burden of state-run banks is expected to ease, making PSU bank s… [+4718 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Kia Sonet Rival Citroen C3 Officially Revealed – 5 Things To Know - GaadiWaadi.com", "description": "Check out our list of the top five things you should know about the recently-revealed 2022 Citroen C3 compact crossover", "url": "https://gaadiwaadi.com/kia-sonet-rival-citroen-c3-officially-revealed-5-things-to-know/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/Citroen-C3-7.jpg", "publishedAt": "2021-09-18T05:28:09Z", "content": "French carmaker Citroen entered the Indian car market last year with the C5 Aircross SUV. Now, the company has unveiled its second offering for our country C3. Although Citroen isnt officially callin… [+2270 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Moneycontrol Pro Weekender | Perfect storm over China - Moneycontrol.com", "description": "From the Evergrande debt crisis to a slowing growth rate to the crackdown on technology companies to the growing confrontation with the West, the cup of woes is spilling over for China", "url": "https://www.moneycontrol.com/news/business/earnings/moneycontrol-pro-weekender-perfect-storm-over-china-7479051.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/China_aug3-770x433.jpg", "publishedAt": "2021-09-18T05:04:19Z", "content": "Dear Reader,\r\nTwenty years ago, US columnist and author Gordon Chang wrote a book titled, The Coming Collapse of China. Books about the imminent demise of the Chinese economy have been a flourishing … [+5407 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Sahil Kukreja", "title": "7 Unique Things To Know About The New TVS Raider 125 - GaadiWaadi.com", "description": "The TVS Raider 125 will directly put up against the likes of Hero Glamour, Honda Shine as well as the Bajaj Pulsar 125 TVS Motor Company has launched a brand new 125 cc motorcycle in the Indian market known as the Raider 125, which marks the manufacturer's en…", "url": "https://gaadiwaadi.com/7-unique-things-to-know-about-the-new-tvs-raider-125/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/TVS-Raider-125-320-2.jpg", "publishedAt": "2021-09-18T04:39:31Z", "content": "TVS Motor Company has launched a brand new 125 cc motorcycle in the Indian market known as the Raider 125, which marks the manufacturer’s entry into the ever-growing 125 cc commuter segment. TVS aims… [+2025 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "COVID-19 vaccine exports may resume by year-end: Adar Poonawalla - Moneycontrol", "description": "India is nearing a level where there is sufficient stock to sustain the vaccination drive, according to Poonawalla.", "url": "https://www.moneycontrol.com/news/india/covid-19-vaccine-exports-may-resume-by-year-end-adar-poonawalla-7479681.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/SII-CEO-Adar-Poonawalla-770x433.jpg", "publishedAt": "2021-09-18T04:24:23Z", "content": "Serum Institute of India (SII) CEO Adar Poonawalla said India may resume export of COVID-19 vaccines by the end of the year.\r\nPoonawalla told Mint he expects export restrictions on COVID-19 vaccines … [+1763 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Narendra Nathan", "title": "Sensex at all-time high: Is it time to rebalance your investment portfolio? - Economic Times", "description": "Apart from massive outperformance by equity markets, prevailing high valuation is another reason why equity investors should be cautious now. Should investors exit the market now?", "url": "https://economictimes.indiatimes.com/wealth/invest/sensex-at-all-time-high-is-it-time-to-rebalance-your-investment-portfolio/articleshow/86113391.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86158648,width-1070,height-580/photo.jpg", "publishedAt": "2021-09-18T04:05:00Z", "content": "SynopsisApart from massive outperformance by equity markets, prevailing high valuation is another reason why equity investors should be cautious now. Should investors exit the market now?"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "The future is here? India may soon get its first 'electric highway'; what it means - Hindustan Times", "description": "In its latest outlook, the International Energy Agency (IAE) said that world governments ought to do more to meet climate goals with policies that favour electric vehicles, and India's proposed electric highway project is expected to be a substantial step in …", "url": "https://www.hindustantimes.com/india-news/the-future-is-here-india-may-soon-get-its-first-electric-highway-what-it-means-101631931795297.html", "urlToImage": "https://images.hindustantimes.com/img/2021/09/18/1600x900/eHighway_3_1631934056116_1631934092454.jpg", "publishedAt": "2021-09-18T03:05:46Z", "content": "The central government is mulling over the concept of an electric highway, to be built between the national capital of Delhi and Jaipur in Rajasthan. Union minister of road transport and highways Nit… [+2863 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Gold Price Today: Gold Rates Down Nearly ₹4,000 | Know The Revised Rates in Your City - India.com", "description": "Gold Price Today: In the previous trade, the precious metal had settled at ₹4, 57, 800 per 100 grams.", "url": "https://www.india.com/business/gold-price-today-18-september-2021-gold-rate-down-by-rs-4000-check-revised-rates-in-noida-delhi-bangalore-karnataka-mumbai-4964511/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/09/gold-price-gold-rates-2.jpg", "publishedAt": "2021-09-18T02:47:51Z", "content": "Home &gt; Business\r\nUpdated: September 18, 2021 8:18 AM IST \r\nBy India.com News DeskEmail\r\nEdited by Surabhi ShauryaEmailFollow\r\nNew Delhi: Gold prices in India continued to witness a downward trend … [+1662 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "4-year moratorium on AGR dues will give relief for now to telcos, but may not stop balance sheet bleed - The Indian Express", "description": "Wednesday’s relief package for the telecom sector has come close on the heels of bankers getting involved in seeking some respite for the industry, particularly Vodafone Idea.", "url": "https://indianexpress.com/article/explained/relief-package-telecom-sector-agr-dues-7511445/", "urlToImage": "https://images.indianexpress.com/2021/09/telco.jpg", "publishedAt": "2021-09-18T02:38:48Z", "content": "The relief package for the telecom sector, while offering the prospect of an annual cash flow breather of an estimated Rs 45,000 crore to the fund-starved industry, falls short of addressing the sign… [+6662 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Force Gurkha 2021: New TVC shows the SUV inside out [Video] - CarToq.com", "description": "When we think about affordable 4×4 SUVs, Mahindra Thar is the first SUV that would come to the mind of the most. The reason behind that was because, There are currently no other SUVs available in this particular segment. Well, things are about to change as Fo…", "url": "https://www.cartoq.com/force-gurkha-2021-new-tvc/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/09/Gurkha-featured.jpg", "publishedAt": "2021-09-18T02:18:11Z", "content": "When we think about affordable 4×4 SUVs, Mahindra Thar is the first SUV that would come to the mind of the most. The reason behind that was because, There are currently no other SUVs available in thi… [+2835 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Expect RBI to approach monetary policy normalisation process gradually - Moneycontrol.com", "description": "The decline in inflation data for August could reduce the pressure on the RBI to normalise policy. Though retail inflation is at a comfortable range, there are certain risk factors.", "url": "https://www.moneycontrol.com/news/business/economy/expect-rbi-to-approach-monetary-policy-normalisation-process-gradually-7477961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/12/shutterstock_4578198551-1-770x433.jpg", "publishedAt": "2021-09-18T01:54:45Z", "content": "Inflation data for August was released this week. Inflation, as measured by the Consumer Price Index (CPI), came as a relief, registering a growth rate of 5.3 percent.\r\nFor the second consecutive mon… [+2775 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "US FDA panel backs Pfizer's Covid-19 booster for 65 and up, rejects broad use - Mint", "description": "Pfizer had originally proposed approving a booster shot for everyone 16 and older", "url": "https://www.livemint.com/science/health/us-fda-panel-backs-pfizer-s-covid-19-booster-for-65-and-up-rejects-broad-use-11631923035626.html", "urlToImage": "https://images.livemint.com/img/2021/09/18/600x338/Virus-Outbreak-Booster-1_1631923280971_1631923331758.jpg", "publishedAt": "2021-09-18T00:06:13Z", "content": "The Covid-19 vaccine booster shot proposed by Pfizer Inc. and BioNTech SE should be given to older Americans and those at high risk, a panel of expert advisers to the U.S. Food and Drug Administratio… [+3626 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Tarush Bhalla & Prasid Banerjee", "title": "Ola Electric sells ₹1,100 cr e-scooters in two-day sale - Mint", "description": "The company offered its first electric scooter range comprising the S1 and S1 Pro models to customers. On Wednesday, the first day of the sale, Ola Electric clocked  ₹600 crore in sales and claimed it sold four scooters every second in the first 24 hours.", "url": "https://www.livemint.com/auto-news/ola-electric-sells-1-100-cr-e-scooters-in-two-day-sale-11631903169517.html", "urlToImage": "https://images.livemint.com/img/2021/09/17/600x338/1da45f74-17b5-11ec-a597-e468bf93ac55_1631903168220_1631903224713.jpg", "publishedAt": "2021-09-17T18:27:32Z", "content": "Ola Electric has sold more than 1,100 crore worth of electric scooters during a two-day sale, the electric vehicle company controlled by Ola Cabs co-founder Bhavish Aggarwal said.\r\nThe company offere… [+3264 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Punjab National Bank reduces home loan interest rate to 6.60% - Moneycontrol", "description": "The interest rate is also applicable to balance transfer cases and is lowest among public sector banks. PNB also decreased interest rate on home loans above Rs 50 lakh by 50 basis points.", "url": "https://www.moneycontrol.com/news/business/punjab-national-bank-reduces-home-loan-interest-rate-to-6-60-7478831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/PNB-Housing-Finance-770x433.jpg", "publishedAt": "2021-09-17T15:41:53Z", "content": "Public sector lender, Punjab National Bank, on September 17, announced festive offers for home loans at 6.60 percent irrespective of any upper ceiling limit and said it will be linked with the applic… [+1146 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV Trending Desk", "title": "Cadbury's modern twist to their 90s iconic ad wins hearts, netizens say 'this is how it should be done' - India TV News", "description": "28 years later, Cadbury changed the gender roles and won the hearts of the netizens by giving a contemporary twist to one of their iconic 90s ads and celebrating womanhood. The ad also shows that one can enjoy a sport, irrespective of the gender of the sports…", "url": "https://www.indiatvnews.com/trending/news-cadbury-modern-twist-celebrate-womanhood-90s-iconic-ad-wins-hearts-kya-swaad-hai-734634", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/09/cadbury-1631891109.jpg", "publishedAt": "2021-09-17T15:38:02Z", "content": "Cadbury Dairy Milk has grabbed eyeballs with its advertisements since the beginning of time. Their ads have been sung alone and have gone viral on social media many times. Now, the chocolate brand ha… [+2110 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Royal Enfield lays off close to 100 employees - CNBCTV18", "description": "As part of its annual performance review, Royal Enfield has laid off close to 100 employees.", "url": "https://www.cnbctv18.com/auto/royal-enfield-lays-off-close-to-100-employees-10781511.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/05/royalenfield2-1019x573.jpg", "publishedAt": "2021-09-17T14:54:53Z", "content": "MiniAs part of its annual performance review, Royal Enfield has laid off close to 100 employees."}, {"source": {"id": null, "name": "Dsij.in"}, "author": "Yogesh Supekar", "title": "Shares below Rs 100: Only buyers in these stocks on Friday - Dalal Street Investment Journal", "description": "Several stocks below Rs 100 per share saw jumped higher, outperforming markets. Few shares were locked in the upper circuit on Friday.", "url": "https://www.dsij.in/DSIJArticleDetail/ArtMID/10163/ArticleID/20603/Shares-below-Rs-100-Only-buyers-in-these-stocks-on-Friday", "urlToImage": "https://www.dsij.in/Portals/0/EasyDNNnews/20603/b-1.jpg", "publishedAt": "2021-09-17T14:27:00Z", "content": "The volatile Friday trading session saw India VIX jump higher by ~7 per cent. Nifty after opening with 80 points gap up witnessed profit booking. Metal stocks saw profit booking while auto and banks … [+1238 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Arun Prakash", "title": "Ola Electric Scooter Delivery Starts From Oct 2021 - 1st Batch Sold Out - RushLane", "description": "Ola Electric has sold e-scooters worth Rs 1,100 crores on the first two days of its sale, more than 1 lakh units expected to be sold.", "url": "https://www.rushlane.com/ola-electric-scooter-delivery-starts-from-oct-2021-1st-batch-sold-out-12412707.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/09/ola-electric-scooter-delivery-dates.jpg", "publishedAt": "2021-09-17T14:03:59Z", "content": "Ola Electric Scooter Delivery Dates Will Be From October 2021\r\nOla Electric, the EV manufacturing arm of the riding hailing major, has claimed that it has been able to sell its electric scooters wort… [+2821 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Prasid Banerjee", "title": "Nodwin Gaming buys NH7 Weekender from OML Entertainment - Mint", "description": "Nodwin Gaming recently raised Rs164 crore in equity investment from South Korean gaming firm Krafton, which is the company behind games like PUBG Mobile and Battleground Mobile India", "url": "https://www.livemint.com/companies/news/nodwin-gaming-buys-nh7-weekender-from-oml-entertainment-11631881737340.html", "urlToImage": "https://images.livemint.com/img/2021/09/17/600x338/Bollead_1601224073107_1601224081280_1631882067243.jpg", "publishedAt": "2021-09-17T12:36:36Z", "content": "NEW DELHI: Nodwin Gaming has acquired the gaming and adjacent intellectual property business of media and entertainment company OML Entertainment for 73 crore, the homegrown e-sports firm said on Fri… [+1589 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Tech", "title": "Sachin Bansal's Navi Mutual Fund plans to launch electric vehicles fund - Economic Times", "description": "The fund of funds will be benchmarked against the STOXX Global Electric Vehicles & Driving Technology NET Index. Apart from this, the fund house has filed documents for Navi Nifty India Manufacturing Index Fund and two international funds", "url": "https://economictimes.indiatimes.com/tech/startups/sachin-bansals-navi-mutual-fund-plans-to-launch-electric-vehicles-fund/articleshow/86292590.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86293413,width-1070,height-580,imgsize-12550,overlay-ettech/photo.jpg", "publishedAt": "2021-09-17T12:21:00Z", "content": "New Delhi: After filing papers for over 10 new schemes with the Securities and Exchange Board of India (Sebi) last month, Sachin Bansal-backed Navi Mutual Fund has filed draft documents for four more… [+1736 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "IRCTC cruise liner set to sail from Sept 18: Check prices, package options and more: In Pics - Zee News", "description": "With the cruise packages, IRCTC is aiming to cater to domestic and international tourists to boost the tourism industry.", "url": "https://zeenews.india.com/photos/business/irctc-cruise-liner-set-to-sail-from-sept-18-check-prices-package-options-and-more-in-pics-2394805", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/09/17/971504-untitled-design-22.jpg", "publishedAt": "2021-09-17T11:39:44Z", "content": "New Delhi: The Indian Railway Catering and Tourism Corporation Limited (IRCTC) is all set to sail its first cruise near the serene waters of South and Western India on Saturday (September 18). IRCTC … [+668 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Aditya Nadkarni", "title": "2021 MG Astor likely to be launched in the first week of October, 2021 - CarWale", "description": "The new MG Astor will be showcased at showrooms from 19 September, 2021. Bookings for the model are slated to commence soon.", "url": "https://www.carwale.com/news/2021-mg-astor-likely-to-be-launched-in-the-first-week-of-october-2021/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/103487/left-front-three-quarter0.jpeg?isig=0&art=1&q=85", "publishedAt": "2021-09-17T11:37:30Z", "content": "- New MG Astor to be showcased at showrooms from 19 September, 2021\r\n- Bookings for the model are slated to commence soon\r\nMG Motor India pulled the covers off the Astor mid-size SUV in the country e… [+1589 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Rupee settles 4 paise higher at 73.48 against US dollar - Moneycontrol.com", "description": "At the interbank forex market, the local unit opened flat at 73.49 against the greenback. During the session, the domestic unit witnessed an intra-day high of 73.42 and a low of 73.55.", "url": "https://www.moneycontrol.com/news/business/markets/rupee-settles-4-paise-higher-at-73-48-against-us-dollar-7478191.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/rupee_dollar-770x433.jpg", "publishedAt": "2021-09-17T11:23:01Z", "content": "The rupee closed 4 paise higher at 73.48 (provisional) against the US dollar on Friday, tracking the broad weakness of the American currency in the overseas market. At the interbank forex market, the… [+1337 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Tata Motors drives in Safari Gold Edition at Rs 21.89 lakh - Moneycontrol.com", "description": "The Safari Gold Edition, which comes in two carefully crafted special colour schemes — The White Gold and The Black Gold — is set to be showcased at the upcoming second leg of the VIVO IPL 2021.", "url": "https://www.moneycontrol.com/news/automobile/tata-motors-drives-in-safari-gold-edition-at-rs-21-89-lakh-7478231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Tata-Safari-4-770x433.jpg", "publishedAt": "2021-09-17T11:14:34Z", "content": "Tata Motors on Friday said it has launched a special edition of its flagship model Safari priced at Rs 21.89 lakh (ex-showroom) to further spruce up the range ahead of the festive season.\r\nThe Safari… [+2328 chars]"}, {"source": {"id": null, "name": "Dsij.in"}, "author": "Shreya Chaware", "title": "Overnight Digest: Stocks to watch out on September 20 - Dalal Street Investment Journal", "description": "The market benchmark indices have erased the previous trading session's gains and Sensex has settled at 59,015.89 level, 0.21 per cent lower and Nifty ended at 17,585.15 level, 0.25 per cent...", "url": "https://www.dsij.in/DSIJArticleDetail/ArtMID/10163/ArticleID/20599/Overnight-Digest-Stocks-to-watch-out-on-September-20", "urlToImage": "https://www.dsij.in/Portals/0/EasyDNNnews/20599/SPDR-SP-500-ETF-5-things-to-know-before-investing-1.jpg", "publishedAt": "2021-09-17T11:04:00Z", "content": "The market benchmark indices have erased the previous trading session's gains and Sensex has settled at 59,015.89 level, 0.21 per cent lower and Nifty ended at 17,585.15 level, 0.25 per cent down. Th… [+2224 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "ZeeBiz WebTeam", "title": "Whose Yes man and whose Proxy? Proxy advisory firm IiAS, Yes Bank fall into their own trap in Dish TV matt... - Zee Business", "description": "Now, both Yes Bank and proxy advisory firm Institutional Investor Advisory Services India Limited (IiAS) are badly entangled in the questions raised by them.", "url": "https://www.zeebiz.com/companies/news-whose-yes-man-and-whose-proxy-proxy-advisory-firm-iias-yes-bank-fall-into-their-own-trap-in-dish-tv-matter-their-actions-under-question-165474", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2021/09/17/159580-dishtv.jpg", "publishedAt": "2021-09-17T09:51:49Z", "content": "For the past few days, Yes Bank and Dish TV news stories are in focus in the markets, in wake of some recent moves by Yes Bank against Dish TV. Yes Bank has proposed to appoint new directors in Dish … [+1839 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Nikhil Puthran", "title": "Citroën C3 unveiled – Now in pictures - CarWale", "description": "Here are the top highlights of the C3 compact SUV in the pictures.", "url": "https://www.carwale.com/news/citron-c3-unveiled-now-in-pictures/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/103637/citroen-left-front-three-quarter2.jpeg?isig=0&art=1&q=85", "publishedAt": "2021-09-17T09:11:15Z", "content": "French automaker, Citroën has unveiled its second product for the Indian market, the C3 sub-four metre SUV. The Citroën C3 will be introduced in the country in the first half of 2022. The upcoming co… [+1718 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Auto incentive scheme: Is it too little, too late for Ford India? - Moneycontrol.com", "description": "Barely a week after Ford said it would stop making cars in India, the government introduced incentives for manufacture of electric and hydrogen-fuel cars. Some experts believe Ford should reconsider its decision", "url": "https://www.moneycontrol.com/news/technology/auto/auto-incentive-scheme-is-it-too-little-too-late-for-ford-india-7477211.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/10/Ford-Ecosport-770x433.jpg", "publishedAt": "2021-09-17T08:29:44Z", "content": "Action in Indias automobile sector seems to be picking up. Days after Ford Motor Company said it would shut both its manufacturing plants in India, the Union government unveiled a production-linked i… [+5256 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Sansera Engineering IPO: Check share allotment online, grey market premium, listing date - Moneycontrol.com", "description": "The company’s shares are set to be listed on the BSE and NSE on September 24. Their premium in the grey market has declined to about 6.7 percent.", "url": "https://www.moneycontrol.com/news/business/ipo/sansera-engineering-ipo-check-share-allotment-online-grey-market-premium-listing-date-7476961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/auto-manufacturing-770x433.jpg", "publishedAt": "2021-09-17T08:00:57Z", "content": "Auto ancillary company Sansera Engineering is expected to finalise the allotment of shares next week after its initial public offering attracted strong subscription. The shares are scheduled to be li… [+3939 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Grocery delivery lessons that Swiggy learnt, and why Zomato failed - CNBCTV18", "description": "Two months after announcing that it was launching grocery delivery for the second time, Zomato will stop its service from Friday.", "url": "https://www.cnbctv18.com/retail/grocery-delivery-lessons-that-swiggy-learnt-and-why-zomato-failed-10774721.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/07/Swiggy-Zomato-1019x573.jpg", "publishedAt": "2021-09-17T06:44:41Z", "content": "MiniTwo months after announcing that it was launching grocery delivery for the second time, Zomato will stop its service from Friday."}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "https://www.facebook.com/amitsharma294", "title": "5-door LWB Versions Of Thar, Gurkha & Jimny To Launch In India - India Car News", "description": "Mahindra had launched the second generation Thar lifestyle SUV in the end of 2020. This model received unprecedented response from buyers. The Mahindra Thar currently commands a waiting period of over 1 year. Force Motors has also revealed the new Gurkha off-…", "url": "https://www.indiacarnews.com/news/5-door-lwb-versions-of-thar-gurkha-jimny-to-launch-in-india-48946/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2020/10/Mahindra-Thar-Dark-Hero-1000x600.jpg", "publishedAt": "2021-09-17T05:38:15Z", "content": "Mahindra had launched the second generation Thar lifestyle SUV in the end of 2020. This model received unprecedented response from buyers. The Mahindra Thar currently commands a waiting period of ove… [+3094 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Sneha Kulkarni", "title": "2 Stocks To Buy With Upside Up To 22%, Says HDFC Securities - Goodreturns", "description": "On Friday, the domestic equity market indexes BSE Sensex and Nifty 50 were trading at new all-time highs. Asian stock markets are trading flat today as traders evaluate the threats China poses to the global recovery and the possibility of less Fed support. He…", "url": "https://www.goodreturns.in/personal-finance/investment/2-stocks-to-buy-with-upside-up-to-22-says-hdfc-securities-1223771.html", "urlToImage": "https://www.goodreturns.in/img/2021/08/stock3-1627802134.jpeg", "publishedAt": "2021-09-17T05:34:44Z", "content": "Solar Industries (SIL) is a dominant participant in the Indian industrial explosives market, with a global manufacturing base in six nations.\r\nThe brokerage expects a gain of up to 16.64 percent in t… [+3589 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shilpa Phadnis", "title": "Byju's acquires US kids coding platform for $200 million - Times of India", "description": "India Business News: BENGALURU: Bengaluru: Byju’s has acquired US-based K-12 creative coding platform Tynker for $200 million (Rs 1,500 crore), part of an effort to consol.", "url": "https://timesofindia.indiatimes.com/business/india-business/byjus-acquires-us-kids-coding-platform-for-200-million/articleshow/86281012.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86282224,width-1070,height-580,imgsize-781617,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-09-17T05:10:00Z", "content": "Byju's acquires US kids coding platform for $200 million"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "TVS Raider 125 launched at Rs 77,500, to rival Honda SP 125 - Times of India", "description": "Bikes News: TVS Raider comes with first-in-class features such as a reverse LCD digital speedometer, optional 5-inch TFT cluster with Voice Assist, multiple ride", "url": "https://timesofindia.indiatimes.com/auto/bikes/tvs-raider-125-launched-at-rs-77500/articleshow/86255087.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86255068,width-1070,height-580,imgsize-1014724,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-09-17T05:03:00Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Equitymaster", "title": "Paras Defence's public issue opens on 21 September. Key details to know - Mint", "description": "In the primary market, Paras Defence and Space Technologies is quoting at a premium of  ₹105 over the IPO issue price. Should you bid?", "url": "https://www.livemint.com/market/ipo/paras-defence-s-public-issue-opens-on-21-september-key-details-to-know-11631852878805.html", "urlToImage": "https://images.livemint.com/img/2021/09/17/600x338/IPO_Reuters_1628584540315_1631853601720.PNG", "publishedAt": "2021-09-17T04:41:43Z", "content": "Paras Defence and Space Technologies, a defence engineering company, has decided to open its initial public offering (IPO) for subscription on 21 September 2021.\r\nThe company hopes to capitalise on i… [+7149 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "SBI cuts home loan interest rate to 6.7%, waives processing fees, gives incentive for non-salaried borrowe - Economic Times", "description": "The rate of interest applicable for a non-salaried borrower was 15 bps higher than the interest rate applicable to a salaried borrower. SBI has said that it has removed this distinction between a salaried and a non-salaried borrower.", "url": "https://economictimes.indiatimes.com/wealth/borrow/sbi-cuts-home-loan-interest-rate-to-6-7-waives-processing-fees-gives-incentive-for-non-salaried-borrowers/articleshow/86256704.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86256680,width-1070,height-580,imgsize-789134,overlay-etwealth/photo.jpg", "publishedAt": "2021-09-17T04:08:00Z", "content": "The (SBI) has announced that as part of its festive season offering it will be offering credit score linked home loans at 6.7%, irrespective of the loan amount. According to a press release issued by… [+2711 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Gold prices today drop to lowest in 5 months after big fall - Mint", "description": "Gold rates today on MCX were down for third day in a row", "url": "https://www.livemint.com/market/commodities/gold-prices-see-big-fall-silver-rates-slump-11631849351915.html", "urlToImage": "https://images.livemint.com/img/2021/09/17/600x338/2019-05-02T104618Z_1_LYNXNPEF410FF_RTROPTP_3_GLOBAL-METALS_1556878671931_1631849448010.JPG", "publishedAt": "2021-09-17T04:05:19Z", "content": "Gold and silver rates struggled in Indian markets today after a sharp fall in the previous session. On MCX, gold futures were down slightly to 46,050 per 10 gram while silver edged up 0.26% to 61,233… [+2185 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Explained: In equity wave, don’t forget the basics - The Indian Express", "description": "While investors have been benefiting, the high levels of the market and the expensive valuations definitely call for a cautious approach.", "url": "https://indianexpress.com/article/explained/in-equity-wave-dont-forget-the-basics-7513936/", "urlToImage": "https://images.indianexpress.com/2021/09/economy-2-1-1.jpg", "publishedAt": "2021-09-17T01:54:03Z", "content": "On a day when the benchmark Sensex and Nifty closed at fresh highs (above 59,000 and above 17,600 respectively), Ajay Tyagi, chairman, Securities and Exchange Board of India (SEBI) cautioned investor… [+4008 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Darshan A Nakhwa", "title": "Stocks To Watch: Biocon, Hero MotoCorp, JSW Steel, TVS Motor, Kotak Mahindra Bank, Poonawalla Fincorp - BloombergQuint", "description": "Here are the stocks to watch in trade today...", "url": "https://www.bloombergquint.com/markets/stocks-to-watch-biocon-hero-motocorp-jsw-steel-tvs-motor-kotak-mahindra-bank-poonawalla-fincorp", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2019-05%2Ff7b7ddf8-bb73-4f6d-ab06-2c98834b69ac%2F301719105_1_6__1_.jpg?rect=0%2C567%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-09-17T01:46:42Z", "content": "<li>Biocon: The Board of Directors of Biocon Biologics Ltd, a material subsidiary of the company, has approved the merger of Covidshield Technologies Pvt Ltd, a wholly owned subsidiary of Serum Insti… [+5333 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Surajeet Das Gupta", "title": "Govt likely to hold 30-70% equity in Vodafone Idea after four years - Business Standard", "description": "The move has been questioned by many analysts who say that if both options are taken, it will turn VIL into a government company", "url": "https://www.business-standard.com/article/companies/govt-likely-to-hold-30-70-equity-in-vodafone-idea-after-four-years-121091700005_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/12/full/1620843841-3687.jpg", "publishedAt": "2021-09-17T00:35:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}]}