{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Visa To Allow Payments Using Cryptocurrency, Says \"Seeing Demand\" - NDTV", "description": "Visa Inc said on Monday it will allow the use of the cryptocurrency USD Coin to settle transactions on its payment network, the latest sign of growing acceptance of digital currencies by the mainstream financial industry.", "url": "https://www.ndtv.com/world-news/visa-to-allow-payments-using-cryptocurrency-says-seeing-demand-2401564", "urlToImage": "https://c.ndtvimg.com/2018-11/66dp44sg_visa-inc--reuters_625x300_16_November_18.jpg", "publishedAt": "2021-03-29T09:06:44Z", "content": "Visa's move comes as major finance firms including BNY Mellon, BlackRock Inc have embraced digital coins.\r\nVisa Inc said on Monday it will allow the use of the cryptocurrency USD Coin to settle trans… [+1910 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Validity of vehicle documents extended to June 30th, 2021 - CarToq.com", "description": "The union transport ministry announced to extend the validity of motor vehicle documents to a new date in the future. Documents like driving license (DL), registration certificate and all types of permits will get an extension and will now be valid till June …", "url": "https://www.cartoq.com/document-validity-increased-india/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2020/12/vehicle-document-check-india-1019x530.jpg", "publishedAt": "2021-03-29T09:03:40Z", "content": "The union transport ministry announced to extend the validity of motor vehicle documents to a new date in the future. Documents like driving license (DL), registration certificate and all types of pe… [+2674 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "European Stocks Largely Higher; Credit Suisse Slumps on Hedge Fund Blow-Up By Investing.com - Investing.com", "description": "European Stocks Largely Higher; Credit Suisse Slumps on Hedge Fund Blow-Up", "url": "https://www.investing.com/news/stock-market-news/european-stocks-largely-higher-credit-suisse-slumps-on-hedge-fund-blowup-2459687", "urlToImage": "https://i-invdn-com.akamaized.net/news/LYNXNPEBAI0L4_L.jpg", "publishedAt": "2021-03-29T07:55:00Z", "content": "By Peter Nurse \r\nInvesting.com - European stock markets pushed to all-time highs on Monday, helped by optimism of a global economic recovery, although Credit Suisse (SIX:CSGN) slumped after warning o… [+3264 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Third Covid vaccine in India likely to be approved soon: Dr Reddy's official - Mint", "description": "Pharma major Dr Reddy's has partnered with the Russia Direct Investment Fund to bring the Sputnik V vaccine to India and other nations.The Russian-made vaccine has reportedly proven to be equally effective for all age groups", "url": "https://www.livemint.com/news/world/third-covid-vaccine-in-india-likely-to-be-approved-soon-dr-reddy-s-official-11617002344144.html", "urlToImage": "https://images.livemint.com/img/2021/03/29/600x338/2021-03-28T170539Z_835601945_RC2HKM9EUCD7_RTRMADP_3_HEALTH-CORONAVIRUS-BRAZIL-VACCINE_1617003652125_1617003674603.JPG", "publishedAt": "2021-03-29T07:43:09Z", "content": "Pharmaceutical firm Dr Reddy's Laboratories expects the Russian-made Covid-19 vaccine, Sputnik V, to get approval from the Indian regulator in the next few weeks.\"We expect to get the approval in the… [+2380 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Venu Srinivasan: The man who took TVS from mopeds to BMW - Moneycontrol.com", "description": "We profile the TVS Motor Chairman, who announced last week that he would step down in 2023 and hand the reins over to former Jaguar Land Rover CEO Ralf Speth. Accolades have poured in for Srinivasan, who transformed the company that was once known only for ma…", "url": "https://www.moneycontrol.com/news/technology/auto/venu-srinivasan-the-man-who-took-tvs-from-mopeds-to-bmw-6704811.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Chairman-Photograph-2-770x433.jpg", "publishedAt": "2021-03-29T07:41:33Z", "content": "After 21 years at the helm, Venu Srinivasan, Chairman of TVS Motor Company, will step down to let former Jaguar Land Rover CEO Ralf Speth become the new chairman of the two-wheeler company in 2023. T… [+5164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Today, A Move To Revolutionise How Middle East Oil Is Sold - NDTV", "description": "Tucked between the Gulf of Oman and a craggy mountain range, the dusty port Fujairah isn't an obvious base from which to try and revolutionize the Middle East's oil markets.", "url": "https://www.ndtv.com/world-news/from-today-a-move-to-revolutionize-how-middle-east-oil-is-sold-2401493", "urlToImage": "https://c.ndtvimg.com/2021-03/c00851fo_abu-dhabi-650_625x300_29_March_21.jpeg", "publishedAt": "2021-03-29T07:06:17Z", "content": "Abu Dhabi's removing curbs with aim of opening up its oil to financial as well as physical traders.\r\nTucked between the Gulf of Oman and a craggy mountain range, the dusty port Fujairah isn't an obvi… [+5107 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Audi stops working on new petrol-diesel engines - CarToq.com", "description": "Audi, one of the largest luxury automobile manufacturer around the world has announced it has stopped the development of any new internal combustion engines. Audi CEO Markus Duesmann cited the upcoming Euro7 emission norms for the decision. Audi, which is par…", "url": "https://www.cartoq.com/audi-petrol-diesel-engines/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/Audi-electric-future-featured-1018x530.jpg", "publishedAt": "2021-03-29T06:29:26Z", "content": "Audi, one of the largest luxury automobile manufacturer around the world has announced it has stopped the development of any new internal combustion engines. Audi CEO Markus Duesmann cited the upcomi… [+2815 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Neil Borate, Abhinav Kaul", "title": "Investor wealth rises 9 times over past 10 years in Motilal Oswal Nasdaq ETF - Mint", "description": "Motilal Oswal has announced plans of launching an Emerging Markets ETF next month. The fund house launched a Fund of Funds tracking the Nasdaq 100 ETF in November 2018 in order to make it possible for investors without demat and trading accounts to invest in …", "url": "https://www.livemint.com/market/stock-market-news/investor-wealth-rises-9-times-over-past-10-years-in-motilal-oswal-nasdaq-etf-11616996645443.html", "urlToImage": "https://images.livemint.com/img/2021/03/29/600x338/iStock-1032599674-kKEH--621x414@LiveMint_1616998340820.jpg", "publishedAt": "2021-03-29T06:14:02Z", "content": "MUMBAI: An Exchange Traded Fund (ETF), by Motilal Oswal Mutual Fund and tracking the Nasdaq 100 index, has grown about nine times since its launch on 29 March 2011, delivering a return of 24.17% (CAG… [+1642 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook, Google's New Plan To Connect Southeast Asia And America - NDTV", "description": "Facebook said on Monday it planned two new undersea cables to connect Singapore, Indonesia and North America in a project with Google and regional telecommunication companies to boost internet connection capacity between the regions.", "url": "https://www.ndtv.com/world-news/facebook-googles-plan-new-undersea-cables-to-connect-southeast-asia-and-america-2401439", "urlToImage": "https://c.ndtvimg.com/2020-08/0psfrbvg_facebook-generic-reuters_625x300_21_August_20.jpg", "publishedAt": "2021-03-29T05:23:18Z", "content": "Facebook said on Monday it planned two new undersea cables to connect Singapore, Indonesia and North America in a project with Google and regional telecommunication companies to boost internet connec… [+2529 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Markets may witness volatile trend in holiday-shortened week ahead, say analysts - Moneycontrol.com", "description": "\"Investors would keep a close eye on coronavirus situation and movement of the US bond yield,\" said Satish Kumar, Research Analyst, Choice Broking.", "url": "https://www.moneycontrol.com/news/business/markets/markets-may-witness-volatile-trend-in-holiday-shortened-week-ahead-say-analysts-6705171.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/BSE_Sensex_Stocks_market-770x433.png", "publishedAt": "2021-03-29T05:08:32Z", "content": "Equity markets may witness a volatile trend in the holiday-shortened week ahead and would be majorly driven by the COVID-19 situation in the country and global cues, analysts said.\r\nMarkets would rem… [+1262 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Ford, Mahindra end ties, will not share engine and platforms for future cars - HT Auto", "description": "In October 2019, Ford and Mahindra had said they would form a joint venture in India in a move to cut costs for developing and producing vehicles for emerging markets.", "url": "https://auto.hindustantimes.com/auto/news/ford-mahindra-end-ties-will-not-share-engine-and-platforms-for-future-cars-41616993300530.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/03/29/600x338/for_mahindra_1616994232245_1616994241920.jpg", "publishedAt": "2021-03-29T05:05:17Z", "content": "US carmaker Ford Motor and Indian car manufacturer Mahindra and Mahindra had announced a joint venture last year that Mahindra was to acquire Ford's operations in India while the American brand had t… [+2032 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "AFP", "title": "Oil prices drop, stocks rise as ship blocking Suez Canal refloated - Mint", "description": "Oil prices dropped on news that a cargo ship blocking the Suez Canal had been refloated", "url": "https://www.livemint.com/market/stock-market-news/oil-prices-drop-stocks-rise-as-ship-blocking-suez-canal-refloated-11616993233959.html", "urlToImage": "https://images.livemint.com/img/2021/03/29/600x338/2021-03-29T044525Z_1_LYNXMPEH2S07L_RTROPTP_3_EGYPT-SUEZCANAL-SHIP_1616993432145_1616993440638.JPG", "publishedAt": "2021-03-29T04:51:41Z", "content": "Asian markets mostly rose Monday, extending last week's positive finish and tracking a record-breaking lead from Wall Street as investors focus on the economic recovery, while oil prices dropped on n… [+3453 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "HDFC Bank special fixed deposit scheme for senior citizens extended till June 30 - Moneycontrol.com", "description": "HDFC Bank offers 75 basis points (bps) higher interest rate on these deposits to senior citizens.", "url": "https://www.moneycontrol.com/news/business/personal-finance/hdfc-bank-special-fixed-deposit-scheme-for-senior-citizens-extended-till-june-30-6704941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/06/HDFCBank1-770x433.jpg", "publishedAt": "2021-03-29T04:47:47Z", "content": "HDFC Bank extended special fixed deposit scheme for senior citizens till June 30, this is the third time the bank has extended this scheme.\r\nThe 'Senior Citizen Care FD scheme' was launched in May 20… [+1419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chinese Video Streamer Bilibili Sinks Day After $2.6 Billion IPO - NDTV", "description": "Video streaming site Bilibili sank on its first day trading on Hong Kong's stock exchange on Monday as investors fret over a global sell-off in Chinese tech shares.", "url": "https://www.ndtv.com/world-news/chinese-video-streamer-bilibili-sinks-day-after-2-6-billion-ipo-2401419", "urlToImage": "https://c.ndtvimg.com/2021-03/21eo4qpo_bilibili-650_625x300_29_March_21.jpeg", "publishedAt": "2021-03-29T04:44:05Z", "content": "Bilibili is already listed in New York.(Representational)\r\nHong Kong, China: Video streaming site Bilibili sank on its first day trading on Hong Kong's stock exchange on Monday as investors fret over… [+2619 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Toyota to increase its car prices from April 1, 2021 - Team-BHP", "description": "Toyota has announced that it will hike the prices of its models from April 1, 2021. Toyota has stated that the prices are being increased as a result of rising input costs. While the company hasn't revealed the quantum of the price hike, it will try to absorb…", "url": "https://www.team-bhp.com/news/toyota-increase-its-car-prices-april-1-2021", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/unrivaled-performance-banner1600x1000.jpg", "publishedAt": "2021-03-29T04:35:24Z", "content": "Toyota has announced that it will hike the prices of its models from April 1, 2021.\r\nToyota has stated that the prices are being increased as a result of rising input costs. While the company hasn't … [+361 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "China's coal generation rises, India sees a decline: Study - Economic Times", "description": "Globally there was a record fall in coal generation in 2020, which was mirrored in India and other top coal power countries. China is now responsible for more than half (53 per cent) of the world's coal-fired electricity.", "url": "https://economictimes.indiatimes.com/news/international/world-news/chinas-coal-generation-rises-india-sees-a-decline-study/articleshow/81742341.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81742341,width-1070,height-580,imgsize-150826,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-29T03:49:00Z", "content": "China was the only G20 country that saw a large increase in coal generation in the pandemic year, said a research published on Monday by energy think tank Ember. India, on the other hand, saw a decli… [+3769 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Indian Government Now Requires Companies to Disclose Cryptocurrency Holdings – Regulation Bitcoin News - Bitcoin News", "description": "The Indian government has introduced new cryptocurrency disclosure rules. Companies dealing in cryptocurrencies will have to disclose their crypto holdings, among other disclosures, as part of their financial statements beginning April 1.", "url": "https://news.bitcoin.com/indian-government-requires-companies-disclose-cryptocurrency-holdings/", "urlToImage": "https://news.bitcoin.com/wp-content/uploads/2019/09/india-disclosure.jpg", "publishedAt": "2021-03-29T03:40:37Z", "content": "The Indian government has introduced new cryptocurrency disclosure rules. Companies dealing in cryptocurrencies will have to disclose their crypto holdings, among other disclosures, as part of their … [+2822 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "What the Cullinan Black Badge – Rolls Royce’s most expensive SUV – feels like [Video] - CarToq.com", "description": "Rolls Royce Cullinan is one of the most expensive SUVs that you can currently buy in the world. The luxury manufacturer also launched a Black Bade edition of the SUV, which is a more expensive and performance-oriented version of the Cullinan. Here is a video …", "url": "https://www.cartoq.com/what-the-cullinan-black-badge-rolls-royces-most-expensive-suv-feels-like-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/rolls-royce-cullinan-featured-1-1018x530.jpg", "publishedAt": "2021-03-29T03:16:54Z", "content": "Rolls Royce Cullinan is one of the most expensive SUVs that you can currently buy in the world. The luxury manufacturer also launched a Black Bade edition of the SUV, which is a more expensive and pe… [+2853 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Red lights and bathroom posters: Amazon's all-out fight to block a union - Economic Times", "description": "Amazon, while not officially declaring opposition to unions, has waged a determined campaign, holding weekly  informational  meetings, sending text messages and putting up posters in restrooms in an all-out effort to defeat the union initiative.", "url": "https://economictimes.indiatimes.com/news/international/business/red-lights-and-bathroom-posters-amazons-all-out-fight-to-block-a-union/articleshow/81741672.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81741719,width-1070,height-580,imgsize-178311,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-29T02:24:00Z", "content": "\"Make sure you take care of us!\" a worker shouts to two union organizers in orange vests standing at the entrance of Amazon's warehouse in Bessemer, Alabama -- ground zero of a battle over unionizing… [+4638 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Rise, fall, repeat — market trend perplexing, top 6 analysts tell us what lies ahead - Moneycontrol.com", "description": "This week is a truncated one as the market will be shut on March 29 for Holi and April 2 for Good Friday.", "url": "https://www.moneycontrol.com/news/business/markets/rise-fall-repeat-market-trend-perplexing-top-6-analysts-tell-us-what-lies-ahead-6703041.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/04/stocks-to-watch-title-770x433.jpg", "publishedAt": "2021-03-29T02:05:48Z", "content": "Rising COVID-19 cases and weak global cues kept stocks under pressure in the week gone by, dragging the Sensex and the Nifty lower by almost 2 percent as the market extended its losing run into the t… [+5737 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Sahil Kukreja", "title": "Skoda, VW To Launch 8 New Cars In India In Next 12-18 Months - GaadiWaadi.com", "description": "The Volkswagen Group is planning to launch at least 8 new cars in the country in the next 12 - 18 months, across different segments", "url": "https://gaadiwaadi.com/skoda-vw-to-launch-8-new-cars-in-india-in-next-12-18-months/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2019/12/2020-Skoda-Rapid-Teased-2.jpg", "publishedAt": "2021-03-29T02:00:34Z", "content": "Back in 2018, Volkswagen Group revealed that it plans on investing 1 billion in the Indian market as a part of its ‘India 2.0’ strategy, which will be used to develop India-specific Skoda and Volkswa… [+4327 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "BSE, NSE shut today on account of Holi - Moneycontrol.com", "description": "On March 26, the BSE Sensex gained 568.38 points, or 1.17 percent, to close at 49,008.50 and the Nifty ending 182.40 points, or 1.27 percent, higher at 14,507.30.", "url": "https://www.moneycontrol.com/news/business/markets/bse-nse-shut-today-on-account-of-holi-2-6702011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/BSE_Sensex-e1542611342127-770x433.jpg", "publishedAt": "2021-03-29T01:44:17Z", "content": "The National Stock Exchange of India (NSE) and the BSE will remain closed on March 29 on account of Holi.\r\nWholesale commodity markets, including metal and bullion, will also remain shut. And there w… [+2376 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Catherine Shu", "title": "Ajaib raises $65M Series A extension led by Ribbit Capital, increasing the round’s total to $90M - TechCrunch", "description": "Ajaib, the Indonesian investment app, has added $65 million to its Series A, bringing the round’s new total to $90 million. The extension was led by Ribbit Capital, the fintech investor that also led Robinhood’s $3.4 billion funding last month. Ajaib is Ribbi…", "url": "http://techcrunch.com/2021/03/28/ajaib-raises-65m-series-a-extension-led-by-ribbit-capital-increasing-the-rounds-total-to-90m/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/Ajaib_PR_1.jpeg?w=600", "publishedAt": "2021-03-29T01:01:47Z", "content": "Ajaib, the Indonesian investment app, has added $65 million to its Series A, bringing the rounds new total to $90 million. The extension was led by Ribbit Capital, the fintech investor that also led … [+1714 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Apoorva Mittal", "title": "Cryptocurrency collective to reach out to FM, RBI to address concerns - Economic Times", "description": "A collective of Indian cryptocurrency exchanges to offer a comprehensive set of solutions to address concerns of govt and officials about the crypto industry", "url": "https://economictimes.indiatimes.com/tech/technology/latest-outreach-by-crypto-exchanges-addresses-governments-concerns/articleshow/81739103.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81739116,width-1070,height-580,imgsize-128244,overlay-ettech/photo.jpg", "publishedAt": "2021-03-29T00:30:00Z", "content": "MUMBAI: Several cryptocurrency exchanges operating in India plan to jointly reach out this week to the country's top financial decision makers, including Finance Minister Nirmala Sitharaman and the c… [+3792 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Alex Kimani", "title": "Can Silicon Valley Beat China In Clean Energy Tech - OilPrice.com", "description": "China is the world's largest manufacturer of clean energy equipment, but Silicon Valley is looking to grab its own piece of the pie", "url": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Can-Silicon-Valley-Beat-China-In-Clean-Energy-Tech.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-03-26_mb4tjfnrbl.jpg", "publishedAt": "2021-03-28T23:00:00Z", "content": "Sign Up To Our Free Newsletter\r\nThanks for subscribing to our free newsletter!\r\nERROR\r\nDespite the absolute explosion in…\r\nAs the world races towards…\r\nAs the Middle East grapples…\r\nBy Alex Kimani - … [+7433 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Madhurima Nandy", "title": "Amazon taps grocery biz to expand in towns - Mint", "description": "Amazon India is doubling down on the fast-growing grocery business to attract more first-time buyers who are mostly from the non-metro cities and towns, a top company executive said.", "url": "https://www.livemint.com/companies/news/amazon-taps-grocery-biz-to-expand-in-towns-11616958610727.html", "urlToImage": "https://images.livemint.com/img/2021/03/28/600x338/Amazon1_1616958689131_1616958694753.jpg", "publishedAt": "2021-03-28T19:15:14Z", "content": "Amazon India is doubling down on the fast-growing grocery business to attract more first-time buyers who are mostly from the non-metro cities and towns, a top company executive said.In the past year,… [+3436 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Tsvetana Paraskova", "title": "Why Natural Gas Prices Are Unlikely To Break Out In The Short Term - OilPrice.com", "description": "Analysts and EIA forecasters think that natural gas prices are unlikely to rise much this summer as production remains relatively steady and demand for power generation may not be as spectacular as anticipated", "url": "https://oilprice.com/Energy/Natural-Gas/Why-Natural-Gas-Prices-Are-Unlikely-To-Break-Out-In-The-Short-Term.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-03-26_ad8nymp4vz.jpg", "publishedAt": "2021-03-28T19:00:00Z", "content": "Sign Up To Our Free Newsletter\r\nThanks for subscribing to our free newsletter!\r\nERROR\r\n2020 saw wild swings in…\r\nNatural gas imports to China…\r\nA section of a natural…\r\nBy Tsvetana Paraskova - Mar 28… [+4471 chars]"}, {"source": {"id": null, "name": "FX Empire"}, "author": null, "title": "Price of Gold Fundamental Daily Forecast - Gold Finishes Lower for First Week in Three - FX Empire", "description": "Helping to provide some support for gold, was a dip in the U.S. 10-year Treasury yield from its intraday high.", "url": "https://www.fxempire.com/forecasts/article/price-of-gold-fundamental-daily-forecast-gold-finishes-lower-for-first-week-in-three-714089", "urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2021/03/Gold-Bars.jpg", "publishedAt": "2021-03-28T17:32:56Z", "content": "Dollar Edges Lower but Remains Close to 4-Month High on Economic Optimism\r\nThe U.S. Dollar finished down against a basket of major currencies on Friday, but held near its four-month peak, on continue… [+1783 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "WSJ", "title": "Elon Musk likes this EV battery and it costs less—but the US isn’t sold on it - Livemint", "description": "Iron-powered electric vehicles are surging in China, but concerns remain about their range and cold-weather performance", "url": "https://www.livemint.com/news/world/elon-musk-likes-this-ev-battery-and-it-costs-less-but-the-us-isn-t-sold-on-it-11616947432658.html", "urlToImage": "https://images.livemint.com/img/2021/03/28/600x338/df8285b61c294011bbdee67658d44a22-df8285b61c294011bbdee67658d44a22-1_1616947502612_1616947515596.jpg", "publishedAt": "2021-03-28T16:09:08Z", "content": "A low-cost battery touted by Elon Musk is disrupting the electric-vehicle business in China, grabbing nearly half of the market and spurring the rise of more affordable EVs.The battery, known as lith… [+5975 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "IPO gold rush: Global liquidity, bull run in domestic market help firms raise Rs 31,000 crore in FY21 - Moneycontrol.com", "description": "Thirty firms raised Rs 31,277 crore through initial public offerings in 2020-21, significantly higher than Rs 20,352 crore mopped up through 13 initial share-sales in the preceding fiscal year, according to data.", "url": "https://www.moneycontrol.com/news/business/ipo/ipo-gold-rush-global-liquidity-in-domestic-market-help-firms-raise-over-rs-31000-crore-in-fy21-6704151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/SS-IPO-770x433.jpg", "publishedAt": "2021-03-28T15:24:13Z", "content": "Global liquidity and bull run in domestic equity market helped Indian companies raise over Rs 31,000 crore through initial share-sale in the ongoing fiscal year and the IPO pipeline remains strong fo… [+5157 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "Issac John", "title": "UAE: RAK Government denies Air India bid reports - Khaleej Times", "description": "The Ras Al Khaimah Government has clarified that it is not connected to any potential transaction relating to Air India.\r\nIn a statement issu...", "url": "https://www.khaleejtimes.com/business/aviation/uae-rak-government-denies-air-india-bid-reports", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20210327/ARTICLE/210329168/AR/0/AR-210329168.jpg&NCS_modified=20210328164536&exif=.jpg", "publishedAt": "2021-03-28T14:48:45Z", "content": "The Ras Al Khaimah Government has clarified that it is not connected to any \"potential transaction relating to Air India\".\r\nIn a statement issued on Sunday, a government spokesperson said it was \"awa… [+2893 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Sahil Kukreja", "title": "Husqvarna’s First Electric Scooter Expected To Be Launched In 2022 - GaadiWaadi.com", "description": "Bajaj Auto & Pierer Mobility AG's are working on a range of fully-electric two-wheelers, and the first EV could be a Husqvarna electric scooter", "url": "https://gaadiwaadi.com/husqvarnas-first-electric-scooter-expected-to-be-launched-in-2022/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/09/husqvarna-electric-scooter-bajaj-chetak-based-4.jpg", "publishedAt": "2021-03-28T14:00:47Z", "content": "A few weeks prior to the Bajaj Chetak’s launch in India, Rajiv Bajaj, Managing Director, Bajaj Auto also confirmed that the Chetaks platform will be used by KTM and Husqvarna to develop their own res… [+1857 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Seshan Vijayraghvan", "title": "MG Cyberster Electric Supercar Teased; Gets 800 Km Range And A Gaming Cockpit - carandbike", "description": "The new MG Cyberster has been designed by SAIC Design, and will be making its global debut on March 31, 2021. It is also expected to come with a electric range of 800 km.", "url": "https://www.carandbike.com/news/mg-cyberster-electric-supercar-teased-gets-800-km-range-and-a-gaming-cockpit-2400678", "urlToImage": "https://c.ndtvimg.com/2021-03/il1ii87s_mg-cyberster-electric-supercar-teased-gets-800-km-range-and-a-gaming-cockpit_625x300_28_March_21.jpg", "publishedAt": "2021-03-28T13:06:16Z", "content": "Morris Garages (MG) has released a set of new teaser images for its upcoming electric supercar - the MG Cyberster. Interestingly, the two-door electric supercar will also come with a gaming cockpit, … [+2054 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "British ministers reject Sanjeev Gupta's bailout plea, media reports say - Economic Times", "description": "GFG, a holding company for Gupta's assets, was the biggest recipient of financing from Greensill, a British financing company, which filed for insolvency earlier in March.", "url": "https://economictimes.indiatimes.com/news/international/business/british-ministers-reject-sanjeev-guptas-bailout-plea-media-reports-say/articleshow/81736823.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81736838,width-1070,height-580,imgsize-987754,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-28T13:04:00Z", "content": "British ministers have rejected a request from mining magnate Sanjeev Gupta for a 170 million pound ($234.36 million) emergency loan to prevent his group, GFG Alliance, from collapsing, the Financial… [+792 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "PTI", "title": "Cairn Energy to file lawsuits to seize Indian PSU assets to enforce $1.2 bn arbitration award - Times Now", "description": "Cairn is pulling out all stops to recover the damages award, including hiring a team of asset recovery experts", "url": "https://www.timesnownews.com/business-economy/companies/article/cairn-energy-to-file-lawsuits-in-us-other-nations-to-seize-indian-psu-assets-to-enforce-1-2-bn-arbitration-award/738328", "urlToImage": "https://imgk.timesnownews.com/story/cairn.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-28T12:36:50Z", "content": "UK's Cairn Energy Plc plans to bring lawsuits in the US and other countries to pierce the corporate veil between the Indian government and its owned companies such as in oil and gas, shipping, airlin… [+4259 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Goldman Sachs bankers' revolt as pandemic blurs work-life line - India Today", "description": "The erosion between office and home boundaries during the pandemic means many white-collar workers can relate on some level to the complaints, even if the plight of elite young bankers seeking riches does not inspire sympathy.", "url": "https://www.indiatoday.in/business/story/goldman-sachs-dustup-hits-nerve-as-pandemic-blurs-work-life-line-1784597-2021-03-28", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202103/goldman_sachs-647x363.jpeg?kpFVKJV2UMdduGCrpFHwRy32r0hQtkdl", "publishedAt": "2021-03-28T12:24:49Z", "content": "A revolt by junior Goldman Sachs' bankers over work weeks that can stretch to as long as 105 hours has inspired both schadenfreude over discontent at the storied investment bank and wider debate abou… [+5175 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "SEC Claims XRP Holders Want to Cash Out Their Tokens at Profit - U.Today", "description": "The SEC says XRP holders want to intervene in the Ripple lawsuit to \"reinstate speculative trading\"", "url": "https://u.today/sec-claims-xrp-holders-want-to-cash-out-their-tokens-at-profit", "urlToImage": "https://u.today/sites/default/files/styles/1200x/public/2021-03/6971.jpg", "publishedAt": "2021-03-28T11:15:09Z", "content": "In his March 26 letter to Federal Judge Analisa Torres, Jorge Tenreiro, a senior trial attorney at the U.S. Securities and Exchange Commission, urges the court to prevent XRP holders from intervening… [+2176 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Explained: How new wage code will impact take-home salary, retirement benefits - Hindustan Times", "description": "According to the new wage code, employers will have to pay at least 50 per cent of an employee’s CTC as basic pay because of which, contribution towards other components like provident fund and gratuity will increase.", "url": "https://www.hindustantimes.com/business/explained-how-new-wage-code-will-impact-take-home-salary-retirement-benefits-101616926951000.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/28/1600x900/2020-12-30T174220Z_1_LYNXMPEGBT15Q_RTROPTP_3_INDIA-MARKETS-RUPEE_1611491434482_1611491467565_1616928047320.JPG", "publishedAt": "2021-03-28T10:44:14Z", "content": "The Centre is likely to notify the new wage code rules in tandem with the Code on Wages 2019 from April 1, which is the start of the financial year 2021-22. The government passed the Wage Code Bill i… [+2319 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Shobita Parthasarathy", "title": "The AstraZeneca Vaccine Crisis in Europe Wasn't About Science at All - The Wire Science", "description": "Scared citizens cannot be easily convinced by expertise that feels remote.", "url": "https://science.thewire.in/health/the-astrazeneca-vaccine-crisis-in-europe-wasnt-about-science-at-all/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/03/27092647/MOSHED-2021-3-27-9-26-30.jpg", "publishedAt": "2021-03-28T10:29:34Z", "content": "Vials of AstraZeneca vaccine pictured in Huelva, Spain, March 24, 2021. Photo: Reuters/Marcelo del Pozo.\r\nThere was a crisis brewing in Europe, about the safety of the Oxford-AstraZeneca vaccine agai… [+6538 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Amid surge in COVID-19 cases, RBI likely to maintain status quo: Experts - Economic Times", "description": "Amid uncertainty created by surge in coronavirus cases, the Reserve Bank of India (RBI) is likely to maintain status quo at its next monetary policy review and wait for some more time before taking any action to spur growth.", "url": "https://economictimes.indiatimes.com/news/economy/policy/amid-surge-in-covid-19-cases-rbi-likely-to-maintain-status-quo-experts/articleshow/81734664.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81734674,width-1070,height-580,imgsize-262042,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-28T09:20:00Z", "content": "Amid uncertainty created by surge in coronavirus cases, the Reserve Bank of India (RBI) is likely to maintain status quo at its next monetary policy review and wait for some more time before taking a… [+3749 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Kirloskar Brothers to be debt-free company, to focus on profitable growth - Economic Times", "description": "Leading pump makers Kirloskar Brothers Ltd (KBL) is close to being a debt-free company and will continue its growth journey into domestic and international markets, said a top company official.", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/kirloskar-brothers-to-be-debt-free-company-to-focus-on-profitable-growth/articleshow/81734478.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81734489,width-1070,height-580,imgsize-241742,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-28T08:57:00Z", "content": "Leading pump makers (KBL) is close to being a debt-free company and will continue its growth journey into domestic and international markets, said a top company official. After being debt-free, the c… [+3669 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Sameer Contractor", "title": "Toyota Announces Price Hike Across Range From April 2021 - carandbike", "description": "The price increase will be applicable across all models in Toyota's line-up as a result of the rising input costs.", "url": "https://www.carandbike.com/news/toyota-kirloskar-motor-announces-price-hike-across-range-from-april-2021-2400416", "urlToImage": "https://c.ndtvimg.com/2021-02/8vfp6mno_toyota-fortuner_650x400_27_February_21.jpg", "publishedAt": "2021-03-28T07:28:53Z", "content": "Toyota Kirloskar Motor (TKM) has announced that it plans to increase prices across its model range with effect from April 1, 2021. The automaker said that the increase in input costs for raw material… [+1660 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Arpan Chaturvedi", "title": "Tata Vs Mistry: Why Mistry’s Oppression Case Failed In The Supreme Court - BloombergQuint", "description": "The Supreme Court has gone so far as to suggest there never was a case to begin with.", "url": "https://www.bloombergquint.com/law-and-policy/tata-vs-mistry-why-mistrys-oppression-case-failed-in-the-supreme-court", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2019-01%2F333ed3ed-3322-4711-a7ab-55215e0e5bb9%2FPTI_A_view_of_Supreme_Court_of_India_in_New_Delhi_011118.jpg?rect=0%2C1%2C4800%2C2520&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-03-28T07:14:41Z", "content": "The Supreme Court has comprehensively dismissed every charge of oppression and mismanagement made by entities owned by Cyrus Mistry against Tata Sons Pvt.\r\nNot just that, the court has gone so far as… [+744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "Domestic Manufacturing: Why are cellphone makers seeking lockdown-hit FY21 as zero year for PLI - The Indian Express", "description": "Unlike other incentives for establishing manufacturing units in India, PLI schemes for all sectors that have been announced since April last year envisage incentives on achievement of a minimum threshold of cumulative incremental investment and incremental sa…", "url": "https://indianexpress.com/article/explained/domestic-manufacturing-why-are-cellphone-makers-seeking-lockdown-hit-fy21-as-zero-year-for-pli-7248689/", "urlToImage": "https://images.indianexpress.com/2021/03/cell-phone-explained.jpg", "publishedAt": "2021-03-28T07:00:49Z", "content": "The Indian Cellular and Electronics Association (ICEA) has written letters to the NITI Aayog, the Secretary of the Ministry of Electronics and Information Technology, as well as officials from other … [+2775 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Bank Of Baroda Offers Car Loans With 0% Processing & Part Payment Charges* - GaadiWaadi.com", "description": "Bank Of Baroda Car Loans focus on offering a hassle-free car buying experience to the customers with a number of initiatives", "url": "https://gaadiwaadi.com/bank-of-baroda-offers-car-loans-with-0-processing-part-payment-charges/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/bank-of-baroda-1.jpg", "publishedAt": "2021-03-28T06:19:16Z", "content": "Bank of Baroda has embarked on a mission to make car buying choices easy for discerning customers through a number of initiatives. As the requirements to own a personal car for daily transportation i… [+2409 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Barbeque Nation IPO share allotment expected next week; here is how to check - Moneycontrol.com", "description": "Barbeque Nation raised Rs 453 crore through the IPO, which comprised a fresh issue of Rs 180 crore and an offer for sale of Rs 273 crore.", "url": "https://www.moneycontrol.com/news/business/ipo/barbeque-nation-ipo-share-allotment-expected-next-week-here-is-how-to-check-6703231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/SS-IPO-770x433.jpg", "publishedAt": "2021-03-28T06:13:58Z", "content": "Barbeque Nation Hospitality, the casual-dining restaurant chain, is expected to finalise the IPO share allocation in the coming week.\r\nThe last of the initial public offering among the main board IPO… [+2516 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Seven of top 10 companies lose over Rs1 lakh cr in m-cap - Mint", "description": "Only Tata Consultancy Services (TCS), Hindustan Unilever Limited and HDFC from the top-10 list saw a rise in their market capitalisation", "url": "https://www.livemint.com/market/stock-market-news/seven-of-top-10-companies-lose-over-rs1-lakh-cr-in-mcap-11616906247370.html", "urlToImage": "https://images.livemint.com/img/2021/03/28/600x338/367428889_0-15_1616906465652_1616906488146.jpg", "publishedAt": "2021-03-28T04:45:51Z", "content": "NEW DELHI :\r\nSeven of the 10 most valued domestic companies witnessed a combined erosion of 1,07,566.64 crore from their market valuation last week, with Reliance Industries accounting for around hal… [+1412 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Sameer Contractor", "title": "Demand For Sedans Here To Stay: Martin Schwenk, MD & CEO, Mercedes-Benz India - carandbike", "description": "Mercedes-Benz India says that it enjoys a 50:50 share of sales with SUVs and sedans, despite the global popularity of SUVs, and it expects demand for sedans to stay with several new launches planned.", "url": "https://www.carandbike.com/news/demand-for-sedans-here-to-stay-martin-schwenk-md-ceo-mercedes-benz-india-2400212", "urlToImage": "https://c.ndtvimg.com/2020-04/tnaem4h_mercedesbenz-cclass-gets-a-new-20-petrol-engine-prices-start-at-rs-4090-lakh_625x300_21_April_20.jpg", "publishedAt": "2021-03-28T04:20:13Z", "content": "The SUV rage has been constant across the globe as more and more carmakers have gone off script to make SUV/crossovers that meet customer demand. Even marquee brands like Lamborghini and Aston Martin… [+3488 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Nifty likely to bounce back from support to 14,800-15,000 in April series: Sumeet Bagadia of Choice... - Moneycontrol.com", "description": "COVID-19 infections, macro-economic data like PMI manufacturing & services, IIP and auto sales will influence the market movement in the April series, says Bagadia.", "url": "https://www.moneycontrol.com/news/business/markets/nifty-likely-to-bounce-back-from-support-to-14800-15000-in-april-series-sumeet-bagadia-of-choice-broking-6702171.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/Sumeet-Bagadia-770x433.jpg", "publishedAt": "2021-03-28T03:56:42Z", "content": "Spiralling coronavirus cases, weak global sentiment and higher treasury yields remain a concern and will influence the market in the April series as well, Sumeet Bagadia, Executive Director, Choice B… [+7695 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Gold Price Today, March 28, 2021: Gold Rates Drop by Rs 7,600. Check Revised Prices Here - India.com", "description": "Notably, gold failed to glitter this week as the precious metal continued its downward trend with prices hitting a nearly 11-month low.", "url": "https://www.india.com/business/gold-price-today-march-28-2021-gold-rates-drop-by-rs-7600-check-revised-gold-price-today-in-noida-bangalore-ahmedabad-delhi-and-mumbai-4541294/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/03/gold1.jpg", "publishedAt": "2021-03-28T03:23:22Z", "content": "Home &gt; Business\r\nNotably, gold failed to glitter this week as the precious metal continued its downward trend with prices hitting a nearly 11-month low. \r\nUpdated: March 28, 2021 9:31 AM IST \r\nBy … [+2122 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "10 affordable cars that offer panoramic sunroofs: Hyundai Creta to Tata Safari - CarToq.com", "description": "Sunroof has become a premium feature in India. However, now even compact-SUVs and even a premium hatchback like the Hyundai i20 is now offering an electric sunroof. So, manufacturers have now started offering panoramic sunroofs on their vehicles. Today we lis…", "url": "https://www.cartoq.com/affordable-cars-panoramic-sunroof/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/panoramic-sunroof-cars-featured-1019x530.jpg", "publishedAt": "2021-03-28T03:14:20Z", "content": "Sunroof has become a premium feature in India. However, now even compact-SUVs and even a premium hatchback like the Hyundai i20 is now offering an electric sunroof. So, manufacturers have now started… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Biggest crude importer via Suez Canal, India may face larger trade hit from logjam - The Indian Express", "description": "India is the top importer of crude and products via the Suez Canal, higher than China, South Korea or Singapore, according to data from Vortexa.", "url": "https://indianexpress.com/article/business/economy/biggest-crude-importer-via-suez-canal-india-may-face-larger-trade-hit-from-logjam-7248668/", "urlToImage": "https://images.indianexpress.com/2021/03/suez-canal-ship.jpg", "publishedAt": "2021-03-28T03:00:37Z", "content": "As the prospect of the Suez Canal blockage turning into the longest-ever accidental closure of this vital trade passage looms large, the resultant impact on crude and tanker rates could progressively… [+1813 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "How to keep your Android device secure with PureVPN - 9to5Google", "description": "A VPN is one of the best ways to keep an Android smartphone or tablet secure, and PureVPN makes it easy and affordable to do so. Here's how.", "url": "https://9to5google.com/2021/03/27/how-to-keep-your-android-device-secure-with-purevpn/", "urlToImage": "https://i2.wp.com/9to5google.com/wp-content/uploads/sites/4/2021/03/purevpn_android_1.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2021-03-27T23:27:00Z", "content": "Android as an operating system is fairly secure, but like any device, it’s easy to fall victim to tricks online. Virtual Private Networks, VPNs, are an easy solution to many threats you can face onli… [+2520 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Large Block Trades Involved More Than $10 Billion Of Stocks Sold By Goldman: Media - News18", "description": "Large block trades on Friday causing a wave of selling in a clutch of companies were driven by sales of more than $10 billion executed by Goldman Sachs Group Inc, media reported on Saturday.", "url": "https://www.news18.com/news/business/large-block-trades-involved-more-than-10-billion-of-stocks-sold-by-goldman-media-3582245.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/07/1595612658_news18_business_default_image.jpg", "publishedAt": "2021-03-27T22:48:24Z", "content": "Large block trades on Friday causing a wave of selling in a clutch of companies were driven by sales of more than $10 billion executed by Goldman Sachs Group Inc, media reported on Saturday.\r\nShares … [+1898 chars]"}, {"source": {"id": null, "name": "PhoneArena"}, "author": "Martin Filipov", "title": "Surprise: Xiaomi set to announce an electric vehicle on March 29 event - PhoneArena", "description": "Xiaomi appears to be the next tech giant willing to take on electric vehicles. The news comes as a surprise, since all the rumors around electric cars lately have been coming from Cupertino (for ...", "url": "https://www.phonearena.com/news/xiaomi-car-electric-great-wall-motors-rumor_id131045", "urlToImage": "https://m-cdn.phonearena.com/images/article/131045-wide-two_1200/Surprise-Xiaomi-set-to-announce-an-electric-vehicle-on-March-29-event.jpg", "publishedAt": "2021-03-27T15:35:48Z", "content": "The Great Wall Motors Company has denied any discussions about an electric car project with Xiaomi, while the smartphone-maker is yet to make a statement.However, insiders claim that such partnership… [+1481 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Aditya Nadkarni", "title": "Scoop! More details on the BS6 Isuzu D-Max V-Cross - Team-BHP", "description": "Earlier today, we had reported that the BS6 version of the Isuzu D-Max V-Cross was spotted at a dealership. It turns out that a second car was spotted at the dealership as well.", "url": "https://www.team-bhp.com/news/scoop-more-details-bs6-isuzu-d-max-v-cross", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/IMG_20210327_125745.jpg", "publishedAt": "2021-03-27T14:02:31Z", "content": "Earlier today, we had reported that the BS6 version of the Isuzu D-Max V-Cross was spotted at a dealership. It turns out that a second car was spotted at the dealership as well. It is the same genera… [+633 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Ford India Announces Price Hike Of Up To 3% – Ecosport To Endeavour - GaadiWaadi.com", "description": "The prices of the Ford Figo, Aspire, Freestyle, EcoSport, and Endeavour are set to increase in the Indian market next month", "url": "https://gaadiwaadi.com/ford-india-announces-price-hike-of-up-to-3-ecosport-to-endeavour/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/12/Ford-Endeavour-modified-24-inch-wheels-3.jpg", "publishedAt": "2021-03-27T14:00:39Z", "content": "With the new financial year approaching, automobile manufacturers in India are busy announcing price hikes for their vehicles. Ford India has also climbed on that bandwagon now. The manufacturer has … [+1871 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Sahil Kukreja", "title": "2021 Bajaj Pulsar RS200 Launched In Malaysia With New Colours - GaadiWaadi.com", "description": "The Pulsar RS200 has been launched under the Modenas Pulsar RS200 moniker in Malaysia, priced from RM 9,990 (INR 1.75 lakh) onwards", "url": "https://gaadiwaadi.com/2021-bajaj-pulsar-rs200-launched-in-malaysia-with-new-colours/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/2021-Bajaj-Pulsar-RS200.jpg", "publishedAt": "2021-03-27T13:00:30Z", "content": "Bajaj Pulsar RS200 is one of the most value for money offerings in the 200 cc fully-faired sports bike segment in the Indian market, however, India certainly isn’t the only country where the motorcyc… [+1741 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "My unlisted portfolio has delivered higher returns than listed company investments: Rakesh Jhunjhunwala - Moneycontrol.com", "description": "Jhunjhunwala also said with the economic growth gaining momentum, there is a reason for the RBI not to raise rates because of worries over inflation.", "url": "https://www.moneycontrol.com/news/business/markets/my-unlisted-portfolio-has-delivered-higher-returns-than-listed-company-investments-jhunjhunwala-6702331.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/06/rakesh_jhunjhunwala-770x433.jpg", "publishedAt": "2021-03-27T12:02:50Z", "content": "Big Bull Rakesh Jhunjhunwala on Saturday said he has investments in private companies stretching to over a decade, and the returns he has made on his unlisted portfolio are higher than the one on lis… [+3099 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Vipul Das", "title": "Compare Your 3-5 Year Fixed Deposits Interest Rates - Goodreturns", "description": "As it is widely known that on term deposits are reasonably risk-free and have a guaranteed return. The accumulated interest is added with the principal amount at maturity, and the net amount is returned to the account holder.", "url": "https://www.goodreturns.in/personal-finance/investment/compare-your-3-5-year-fixed-deposits-interest-rates-1208511.html", "urlToImage": "https://www.goodreturns.in/img/2019/10/investments12-1572499268.jpg", "publishedAt": "2021-03-27T11:39:00Z", "content": "Below are the top small finance banks that are currently providing higher interest rates on 3-5 year FDs.\r\n<table><tr><th>Banks</th><th>3-year rates for non-senior citizens</th><th>3-year rates for s… [+2681 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "Serum Institute delays expected launch of Novavax vaccine in India - Reuters", "description": "The launch in India of a new COVID-19 vaccine developed jointly by the Serum Institute of India and U.S.-based biotech firm Novavax is likely to be delayed to September, the Indian company's boss said on Saturday.", "url": "https://www.reuters.com/article/us-india-vaccine-idUKKBN2BJ0BI", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210327&t=2&i=1556429976&r=LYNXMPEH2Q066&w=800", "publishedAt": "2021-03-27T11:16:00Z", "content": "By Reuters Staff\r\nNEW DELHI (Reuters) - The launch in India of a new COVID-19 vaccine developed jointly by the Serum Institute of India and U.S.-based biotech firm Novavax is likely to be delayed to … [+1630 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "Chhavi Kaushik", "title": "2 New Maruti Suzuki Cars Launching Soon – Confirmed - India Car News", "description": "Recently, the Indo-Japanese carmaker introduced the updated Swift hatchback with a new, more powerful engine, improved styling and a bunch of features. In coming months, the company will roll out the new-generation models of the Celerio hatchback and Vitara B…", "url": "https://www.indiacarnews.com/news/2-new-maruti-suzuki-cars-launching-soon-confirmed-45494/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2020/01/2020-Maruti-Vitara-Brezza-Petrol-1000x600.jpg", "publishedAt": "2021-03-27T11:09:05Z", "content": "Recently, the Indo-Japanese carmaker introduced the updated Swift hatchback with a new, more powerful engine, improved styling and a bunch of features. In coming months, the company will roll out the… [+1763 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Akanksha Saxena", "title": "'Jumbo Momo' in Delhi equivalent to 10 pieces of momos, netizens say, 'ohh bete' - Times Now", "description": "This momo is sold at an eatery called Indie Momo in Delhi's West Patel Nagar.", "url": "https://www.timesnownews.com/the-buzz/article/jumbo-momo-in-delhi-equivalent-to-10-pieces-of-momos-netizens-say-ohh-bete/738030", "urlToImage": "https://imgk.timesnownews.com/story/Add_a_heading_-_2021-03-27T152112.549.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-27T10:31:56Z", "content": "New Delhi: For any foodie in the country, Delhi is the perfect place to satisfy their cravings. Not only do they have great joints around the city specializing in Mughlai and North Indian food, they … [+1233 chars]"}]}