{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Piramal Enterprises Q4 net loss narrows to Rs 510 cr - Moneycontrol.com", "description": "Revenue from operations stood at Rs 3,401.56 crore in the quarter under review. It was Rs 3,341 crore in the year-ago period, it added.", "url": "https://www.moneycontrol.com/news/business/earnings/piramal-enterprises-q4-net-loss-narrows-to-rs-510-cr-6890421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/06/piramal-765x435.jpg", "publishedAt": "2021-05-13T15:28:17Z", "content": "Piramal Enterprises on Thursday reported narrowing of its consolidated net loss to Rs 510.39 crore for the quarter ended March 31, 2021.The company had posted a net loss of Rs 1,702.59 crore for the … [+2528 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Bank alert! RBI cancels license of THIS bank, here`s what will happen to depositors - Zee News", "description": "The Reserve Bank of India has cancelled the license of Bagnan, United Co-operative Bank Ltd, West Bengal.", "url": "https://zeenews.india.com/economy/bank-alert-rbi-cancels-license-of-this-bank-here-s-what-will-happen-to-depositors-2361760.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/05/13/936190-untitled-design-28.png", "publishedAt": "2021-05-13T15:10:56Z", "content": "The Reserve Bank of India has cancelled the license of Bagnan, United Co-operative Bank Ltd, West Bengal. The Central bank has taken the decision after it found that the bank doesnt have adequate cap… [+1072 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Akshaya Tritiya 2021: Check City-Wise Auspicious Timings to Buy Gold - News18", "description": "Akshaya Tritiya, which is also known as Akha Teej, will fall on Friday, May 14 this year.", "url": "https://www.news18.com/news/business/akshaya-tritiya-2021-date-akha-teej-check-auspicious-timings-to-buy-gold-3735266.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1619586290_gold-and-silver.jpg", "publishedAt": "2021-05-13T14:04:00Z", "content": "Akshaya Tritiya, which is also known as Akha Teej, will fall on Friday, May 14 this year. The day is considered highly auspicious and holy by Hindus. The Shukla Paksha Tritiya Tithi of Vaishakha mont… [+1954 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Aditi Divekar", "title": "Vedanta swings into the black; posts Rs 6,531 cr profit in March quarter - Business Standard", "description": "Net sales of the company stood at Rs 27,874 crore in the period under review, up 42% from same period last year", "url": "https://www.business-standard.com/article/companies/vedanta-q4-profit-at-rs-6-432-cr-on-better-volumes-lower-production-cost-121051300985_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-12/29/full/1609235533-0889.jpg", "publishedAt": "2021-05-13T13:24:00Z", "content": "Anil Agarwal-led Vedanta Limited reported a consolidated net profit of Rs 6,531 crore in the March quarter as against a loss of Rs 12,521 crore in the corresponding period last year on the back of in… [+2985 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Hyundai Verna gets segment-first wireless Android Auto and Apple CarPlay - CarToq.com", "description": "Hyundai has updated its Verna sedan with new features. The facelifted Hyundai Verna, which was launched in the Indian market last year has now become the first car in the segment to get wireless Android Auto and Apple CarPlay. While this is not the industry-f…", "url": "https://www.cartoq.com/hyundai-verna-android-auto-apple-carplay/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Hyundai-Verna_featured-1018x530.jpg", "publishedAt": "2021-05-13T12:05:21Z", "content": "Hyundai has updated its Verna sedan with new features. The facelifted Hyundai Verna, which was launched in the Indian market last year has now become the first car in the segment to get wireless Andr… [+2779 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Explainer | What does the delay in H-1B wage hikes till Nov 2022 mean for Indian techies? - Moneycontrol", "description": "This is indeed a huge relief. Indians are the largest beneficiaries of the visa. In FY19, of the 1.8 lakh H-1B visa issues, Indians accounted for about 1.3 lakh.", "url": "https://www.moneycontrol.com/news/business/explainer-what-does-the-delay-in-h-1b-wage-hikes-till-nov-2022-mean-for-indian-techies-6889381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/Visa-Passport-770x433.jpg", "publishedAt": "2021-05-13T12:02:39Z", "content": "The Biden administration has deferred once again the H-1B wage hike rule that would increase the salaries of highly skilled workforce. A huge relief indeed to Indian techies and IT firms, one of the … [+4386 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Monomita Chakraborty", "title": "How Did Dogecoin Buzz Treat the Indian Crypto Exchanges? - Analytics Insight", "description": "The recent surge in Dogecoin prices made many cryptocurrency exchanges in India face system crashes. The largest Indian crypto exchange, WazirX slowed down due to high user traffic and an unexpected surge in cryptocurrency trading.", "url": "https://www.analyticsinsight.net/how-did-dogecoin-buzz-treat-the-indian-crypto-exchanges/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2021/05/Dogecoin-1.jpg", "publishedAt": "2021-05-13T11:00:46Z", "content": "After Ethereum and Bitcoin, it is now Dogecoin that has taken the internet by storm. The global trading volume of Dogecoin tripled last week and it hit more than a whopping USD80 million market cap r… [+3821 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vaccine Effectiveness On India-Dominant Variants \"Remains Uncertain\": WHO - NDTV", "description": "New strains of the Covid variant found in India are deadlier and more infectious, the World Health Organisation has said on the country's coronavirus situation in a weekly update.", "url": "https://www.ndtv.com/india-news/coronavirus-vaccine-effectiveness-on-india-dominant-variants-remain-uncertain-who-2441004", "urlToImage": "https://c.ndtvimg.com/2021-05/06tp9ka8_covid-test_625x300_11_May_21.jpg", "publishedAt": "2021-05-13T10:55:32Z", "content": "New strains of the Covid variant found in India are deadlier and more infectious, WHO has said.\r\nNew Delhi: New strains of the Covid variant found in India are deadlier and more infectious, the World… [+2308 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "Petrol, Diesel Prices Hiked 7 times this Month: Know How Much Tax You Pay on Fuel - News18", "description": "Domestic fuel prices have hiked seven time this month.", "url": "https://www.news18.com/news/business/petrol-diesel-price-hiked-7-times-this-month-know-how-much-tax-you-currently-pay-on-fuel-3735017.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/07/1595572123_petrol-pump.jpg", "publishedAt": "2021-05-13T10:54:04Z", "content": "Domestic fuel prices have hiked seven time this month. Currently, petrol and diesel prices are at all-time high in Delhi and Mumbai. In Delhi, petrol costs Rs 92.05 a litre while diesel is being sold… [+2034 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "ITC extends employee assistance, to bear medical expenses of COVID-hit staff and their family members - Moneycontrol.com", "description": "The company has also extended a loan facility to its employees, which will support medical treatment of certain family members suffering from COVID-19.", "url": "https://www.moneycontrol.com/news/business/companies/itc-extends-employee-assistance-to-bear-medical-expenses-of-covid-hit-staffs-and-their-family-members-6888951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/labour-unionlaboremployee-770x433.jpg", "publishedAt": "2021-05-13T10:31:56Z", "content": "FMCG major ITC has rolled out several employee benefits programmes to lend a helping hand to its employees and their families, who have turned COVID-positive.\r\nThe company on Thursday announced that … [+2179 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "COVID-19 | Medical facility, app for 24X7 helpline, vaccination drive: IndiGo lists measures to support... - Moneycontrol", "description": "A vaccination drive for IndiGo employees has already been initiated, the airline said, adding that the inoculation programme is underway across 40 stations in its network and at its support centre at Gurugram.", "url": "https://www.moneycontrol.com/news/business/companies/covid-19-medical-facility-app-for-24x7-helpline-vaccination-drive-indigo-lists-measures-to-support-employees-6888871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/08/Indigo-770x433.jpg", "publishedAt": "2021-05-13T10:31:04Z", "content": "IndiGo, one of India's leading airline, has listed a spree of measures which it has enacted to support employees and their immediate family members amid the COVID-19 pandemic.\r\nIn partnership with th… [+2265 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "PTI", "title": "Flipkart users, cyber expert wants you to change your password; but why you should not be too worried - Gadgets Now", "description": "An alleged leaked database can potentially lead to unauthorised transactions from accounts of Flipkart customers who also used grocery platform BigBasket with common user ID and passwords, an independent cyber security expert said on Wednesday. According to t…", "url": "https://www.gadgetsnow.com/tech-news/cyber-expert-asks-flipkart-users-to-reset-passwords-but-why-all-users-need-not-worry/articleshow/82602794.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-82602794,imgsize-47592,width-800/82602794.jpg", "publishedAt": "2021-05-13T10:19:00Z", "content": "An alleged leaked database can potentially lead to unauthorised transactions from accounts of Flipkart customers who also used grocery platform BigBasket with common user ID and passwords, an indepen… [+1505 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "COVID Vaccine shortage | NASSCOM urges government to provide emergency use authorisation for all... - Moneycontrol", "description": "The agency has also recommended temporary relaxation of Foreign Contribution Regulation Act (FCRA) regulations and setting up a committee for optimising the use of data in India.", "url": "https://www.moneycontrol.com/news/business/covid-vaccine-shortage-provide-emergency-use-authorisation-for-all-who-approved-vaccines-nasscom-to-government-6888851.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/000_99M42T-770x433.jpg", "publishedAt": "2021-05-13T09:49:47Z", "content": "As the second wave of COVID-19 pandemic ravages the country leading to acute shortage of vaccines, the IT industry body NASSCOM has urged the government to provide emergency use authorization for all… [+2220 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Lupin aims to bring COVID-19 drugs, jabs; approaches Gilead for Remdesivir - Moneycontrol", "description": "Lupin aims to be actively involved in prevention and treatment of COVID-19, changing its strategy of being relatively less active during the first wave of the pandemic last year.", "url": "https://www.moneycontrol.com/news/business/companies/lupin-aims-to-bring-covid-19-drugs-jabs-approaches-gilead-for-remdesivir-6888001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/02/RTX3AOKR-770x433.jpg", "publishedAt": "2021-05-13T09:17:45Z", "content": "Lupin has approached Gilead Sciences Inc for a voluntary license, or an authorisation given by a patent holder to a generics producer, to manufacture and distribute antiviral drug Remdesivir in India… [+1804 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vivek Kaul", "title": "How to correctly read the IIP numbers and the scary truth it reveals about Indian economy - Mint", "description": "The base effect is at work here. The index contracted by 18.67% in March 2020 from a year earlier because of a nationwide lockdown, which brought industrial production to a standstill in many parts of the country last year", "url": "https://www.livemint.com/economy/how-to-correctly-read-the-iip-numbers-and-the-scary-truth-it-reveals-about-indian-economy-11620896619668.html", "urlToImage": "https://images.livemint.com/img/2021/05/13/600x338/2021-05-11T155822Z_1593589923_RC2RDN93D334_RTRMADP_3_FRANCE-ECONOMY_1620897262121_1620897299258.JPG", "publishedAt": "2021-05-13T09:16:59Z", "content": "The Index of Industrial Production (IIP) for March was released on Tuesday. As can be seen from the chart that follows, the IIP grew by 22.35% from a year earlier. This is the fastest the countrys in… [+3444 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "New Maruti Suzuki Celerio launch delayed: New timeline revealed - CarToq.com", "description": "Maruti Suzuki is working on a new generation of Celerio. The hatchback has not been updated since it was launched back in 2014. It was the first hatchback to offer an AMT gearbox which made it the most affordable automatic vehicle that you can buy in the Indi…", "url": "https://www.cartoq.com/new-maruti-suzuki-celerio-launch-delayed-new-timeline-revealed/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/05/Maruti-Suzuki-2021-Celerio-launch-postponed-featured-1019x530.jpg", "publishedAt": "2021-05-13T09:03:55Z", "content": "Maruti Suzuki is working on a new generation of Celerio. The hatchback has not been updated since it was launched back in 2014. It was the first hatchback to offer an AMT gearbox which made it the mo… [+2954 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "2021 Ducati Streetfighter V4 launched in India - HT Auto", "description": "The key highlight of the Ducati Streetfighter V4 motorcycle is its Stradale V4 engine which has been sourced from the Panigale V4.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/2021-ducati-streetfighter-v4-launched-in-india-41620896238205.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/13/600x338/Streetfighter-V4-Red-MY20-Model-Preview-1050x650_1588248440986_1620896511532.png", "publishedAt": "2021-05-13T09:03:51Z", "content": "After a rather long wait, Ducati has finally introduced the much-awaited 2021 Streetfighter V4 hyper-naked motorcycle in the Indian market. It has been priced at 19.99 lakh for the base model and the… [+1596 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Fat and the Furious: Royal Enfield fitted with tractor tyres - HT Auto", "description": "From swingarm, suspension, handlebar to frame, nothing reminds of the stock bike this modified Royal Enfield is based on.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/fat-and-the-furious-royal-enfield-fitted-with-tractor-tyres-41620891309889.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/13/600x338/Untitled_1620895186302_1620895202539.jpg", "publishedAt": "2021-05-13T08:53:17Z", "content": "Royal Enfield bikes have a huge demand in the two-wheeler modification market. Many custom bike garages around the country specialize in working on Royal Enfield bikes simply because of the fact that… [+1672 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Bloomberg", "title": "Thinking of mixing Covid-19 vaccines? Read this - Deccan Herald", "description": "Mixing doses of two leading Covid-19 vaccines increased patients’ side effects such as fatigue and headaches in early findings from a study that has yet to show how well such a cocktail defends against the virus.", "url": "https://www.deccanherald.com/science-and-environment/thinking-of-mixing-covid-19-vaccines-read-this-985401.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/05/13/990928-01-02-985401-1620896004.jpg", "publishedAt": "2021-05-13T08:47:48Z", "content": "By Marthe Fourcade and Suzi Ring\r\nMixing doses of two leading Covid-19 vaccines increased patients side effects such as fatigue and headaches in early findings from a study that has yet to show how w… [+2637 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "TVS Motor to offer extra salary, extended medical cover to families of employees succumbing to COVID-19 - Moneycontrol.com", "description": "The ex-gratia is in addition to the standard TVS Motor Company Family Welfare Fund and other statuary benefits applicable to deceased employees and their families", "url": "https://www.moneycontrol.com/news/technology/auto/extra-salary-childrens-school-fees-added-medical-cover-benefits-tvs-motor-will-offer-to-families-of-employees-succumbing-to-covid-19-6888021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/TVS-ARIVE-770x433.jpg", "publishedAt": "2021-05-13T08:44:15Z", "content": "TVS Motor Company will pay up to three times the gross annual salary to the family of any employee who dies due COVID-19. The company will also fund the education of the employee's children up to und… [+1495 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "When A Frustrated Jeff Bezos Told Alexa To \"Shoot Yourself\" - NDTV", "description": "Amazon CEO Jeff Bezos once told an early prototype of his company's virtual assistant Alexa to \"shoot yourself in the head\" in frustration.", "url": "https://www.ndtv.com/offbeat/jeff-bezos-once-told-amazon-alexa-to-shoot-yourself-2440888", "urlToImage": "https://c.ndtvimg.com/2020-01/8qprdf7_jeff-bezos-reuters_625x300_22_January_20.jpg", "publishedAt": "2021-05-13T08:38:41Z", "content": "Jeff Bezos once got fed-up with an early prototype of Alexa.\r\nAmazon CEO Jeff Bezos once told an early prototype of his company's virtual assistant Alexa to \"shoot yourself in the head\" in frustratio… [+1211 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Prasid Banerjee", "title": "India’s PC market records the highest ever first quarter shipments in March qtr - Mint", "description": "The traditional PC market, which includes desktops, notebooks and workstations, grew by 73.1% year-on-year, according to the International Data Corporation", "url": "https://www.livemint.com/companies/news/india-s-pc-market-records-the-highest-ever-first-quarter-shipments-in-q1-2021-11620893474323.html", "urlToImage": "https://images.livemint.com/img/2021/05/13/600x338/000_Was7005572--621x414_1620896543989.jpg", "publishedAt": "2021-05-13T08:25:34Z", "content": "BENGALURU :\r\nIndias traditional PC market, which includes desktops, notebooks and workstations, grew by a massive 73.1% year-on-year (y-o-y) in the first quarter of 2021, according to the Internation… [+1746 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Ameya Naik", "title": "Mohan Kumar, Head Of Michelin India Passes Away - carandbike", "description": "Since Dec 2017, Mohan has been Head of Business of Michelin for India and the SAARC countries. He has pioneered the company's growth in the country and was instrumental in the company's expansion in the country.", "url": "https://www.carandbike.com/news/mohan-kumar-head-of-michelin-india-passes-away-2440870", "urlToImage": "https://c.ndtvimg.com/2021-05/ibbc8q9_mohan-kumar-head-of-michelin-india-passes-away_625x300_13_May_21.png", "publishedAt": "2021-05-13T08:17:46Z", "content": "Mohan Kumar, Head of Michelin India, passed away after battling with Covid-19. He was 53. He joined the company in 2005 as head of the passenger car tyre sales and since then held leadership roles bo… [+1279 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Bajaj Auto announces relief measures for employees, including two years' salary - HT Auto", "description": "Bajaj Auto will provide monitory assistance for two years to family of any employee who dies due to Covid-19..The company states it will also provide five years' five years' hospitalisation insurance for his or her family.", "url": "https://auto.hindustantimes.com/auto/news/bajaj-auto-announces-relief-measures-for-employees-including-two-years-salary-41620893168944.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/13/600x338/1087914_Wallpaper2_1620893633080.jpg", "publishedAt": "2021-05-13T08:15:27Z", "content": "Bajaj Auto on Thursday underlined its commitment towards helping its employees and communities across the country in current times of Covid-19 pandemic and stated that it has set up over 250 beds acr… [+1186 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Matrimony.com Consolidated March 2021 Net Sales at Rs 101.12 crore, up 7.46% Y-o-Y - Moneycontrol.com", "description": "", "url": "https://www.moneycontrol.com/news/business/earnings/matrimony-com-consolidated-march-2021-net-sales-at-rs-101-12-crore-up-7-46-y-o-y-6888271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/04/shutterstock_310523045-462x435.jpg", "publishedAt": "2021-05-13T07:03:36Z", "content": "Reported Consolidated quarterly numbers for Matrimony.com are:Net Sales at Rs 101.12 crore in March 2021 up 7.46% from Rs. 94.10 crore in March 2020.\r\nQuarterly Net Profit at Rs. 10.13 crore in March… [+381 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Seshan Vijayraghvan", "title": "Jeep Takes Mahindra To Court In Australia Over The New Thar - carandbike", "description": "Following a teaser ad posted by Mahindra for the Thar in Australia, Fiat Chrysler-owned Jeep brand has appealed to the court to prevent the launch of the vehicle. It says Mahindra has to give Jeep a 90-day notice if it intends to sell the Thar in Australia.", "url": "https://www.carandbike.com/news/jeep-take-mahindra-to-court-in-australia-over-the-new-thar-2440800", "urlToImage": "https://c.ndtvimg.com/2021-02/m5d08gp8_mahindra-thar-diesel-suv_650x400_04_February_21.jpg", "publishedAt": "2021-05-13T07:00:33Z", "content": "Fiat Chrysler Automobiles (FCA), the owner of the Jeep brand, which now comes under the newly formed company Stellantis, has moved the Federal Court of Australia against India's Mahindra &amp; Mahind… [+2048 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Infosys Co-Founder S D Shibulal Hikes His Stake, Buys Shares Worth Rs 100 Crore - NDTV Profit", "description": "S D Shibulal bought 7,58,755 shares of the company amounting to Rs 100 crore in a block deal transaction from Kumari Shibulal.", "url": "https://www.ndtv.com/business/infosys-founder-s-d-shibulal-hikes-stake-news-infosys-co-founder-s-d-shibulal-hikes-his-stake-buys-shares-worth-rs-100-crore-2440801", "urlToImage": "https://c.ndtvimg.com/2021-05/12nrnemg_shibulal-infosys_625x300_13_May_21.jpg", "publishedAt": "2021-05-13T06:58:21Z", "content": "S D Shibulal's shareholding in the company increased to 0.07 per cent after the transaction.\r\nS D Shibulal, co-founder of the country's second largest information technology company, Infosys hiked hi… [+1470 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Mixing Covid-19 vaccines not a good idea: New study hints at more side effects but no safety concerns - India Today", "description": "As countries face a shortage of coronavirus vaccine due to sudden pressure on companies to ramp up production, people are mixing vaccines based on their availability-getting a different vaccine as a second dose than the first one.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/coronavirus-vaccine-immunisation-astrazeneca-pfizer-cowin-1802077-2021-05-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/Coronavirus_vaccine_1200_0-647x363.jpeg?BX7nXKqk3EqpA9YvGWuKmSOO1hmewPyu", "publishedAt": "2021-05-13T06:54:00Z", "content": "As the coronavirus cases surge and people rush to vaccination centres to get their dosage, a new report has called for ensuring caution stating that people who got mixed doses of the Covid-19 vaccine… [+3149 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sunil Sanghai", "title": "One step closer, one step away: Sebi moves to bury two licence raj legacies - Economic Times", "description": "The consultation paper covered two very significant issues – first, the proposed reduction in lock-in periods for minimum promoters contribution and that of other shareholders in public issue; second, shifting from the concept of ‘promoter to the concept of ‘…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/one-step-closer-one-step-away-sebi-moves-to-bury-two-licence-raj-legacies/articleshow/82598036.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82598120,width-1070,height-580,imgsize-86528,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-13T06:20:00Z", "content": "Sebi has just issued a consultation paper to review the regulatory framework of promoter and promoter group. It is indeed remarkable that the regulator in these tough times is not just focused on bus… [+4475 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Business Desk", "title": "PF Alert: Family Members To Get Up To Rs 7 Lakh If Employee Dies Of Covid-19; Here's How - India.com", "description": "PF Alert: The nominees can avail the death insurance benefits under EDLI scheme. However, the official nominee needs to make a claim in order to get the benefits.", "url": "https://www.india.com/business/pf-alert-family-members-to-get-up-to-rs-7-lakh-if-employee-dies-of-covid-19-heres-how-4660711/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/05/PF-BENEFITS.jpg", "publishedAt": "2021-05-13T05:46:20Z", "content": "Home &gt; Business\r\nPF Alert: The nominees can avail the death insurance benefits under EDLI scheme. However, the official nominee needs to make a claim in order to get the benefits.\r\nPublished: May … [+2073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ethereum founder Vitalik Buterin donates over $1 billion worth of meme coins to India Covid relief - The Indian Express", "description": "A large portion of Buterin’s donation was made using massive amounts of dog-themed ‘meme coins’, which had been gifted to him for free by the creators of the Shiba Inu coin (SHIB), Dgelon (ELON) and Akita Inu (AKITA).", "url": "https://indianexpress.com/article/technology/tech-news-technology/ethereum-founder-vitalik-buterin-donates-1-billion-meme-coins-to-india-covid-relief-7313176/", "urlToImage": "https://images.indianexpress.com/2021/05/Ethereum_Reuters_1.jpg", "publishedAt": "2021-05-13T05:33:51Z", "content": "Vitalik Buterin, co-founder of the Ethereum crypto network and the worlds youngest known crypto billionaire, has donated over $1 billion worth of meme coins to Indias Covid-19 relief fund as well as … [+2808 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Airtel says to migrate fixed-line, enterprise subscribers to Amdocs’ system - ETTelecom.com", "description": "The Sunil Mittal-led telco in November last year had extended its partnership with Amdocs to enable service experience for its postpaid mobile and broadband customers.", "url": "https://telecom.economictimes.indiatimes.com/news/airtel-says-to-migrate-fixed-line-enterprise-subscribers-to-amdocs-system/82597275", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-82597275,imgsize-310411,width-800,height-434,overlay-ettelecom/airtel-says-to-migrate-fixed-line-enterprise-subscribers-to-amdocs-system.jpg", "publishedAt": "2021-05-13T05:32:56Z", "content": "NEW DELHI: As part of a multi-year strategic partnership, telecom major Bharti Airtel Thursday said its fixed-line and enterprise subscribers will be migrated to Amdocs system for delivering new digi… [+1668 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Arun Prakash", "title": "Hero MotoCorp To Launch Their First Electric Scooter In Q1 2022 - Chetak Rival - RushLane", "description": "Hero MotoCorp will launch its first electric two-wheeler by the end of the fourth quarter of FY2021-22 in partnership with Gogoro.", "url": "https://www.rushlane.com/hero-motocorp-to-launch-their-first-electric-scooter-in-q1-2022-12402171.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/05/hero-electric-scooter-launch-2022.jpg", "publishedAt": "2021-05-13T05:26:59Z", "content": "Hero Maestro Electric Scooter. Credit – 91 Wheels\r\nWhile Hero MotoCorp is undoubtedly the largest two-wheeler manufacturer in the world, it is yet to actively venture into electric mobility like its … [+2768 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "China, Hong Kong stocks fall on soft bank lending, Sino-US tensions - Economic Times", "description": "The Chinese government has turned its western Xinjiang province into essentially an  open-air prison , a U.S. State Department official said on Wednesday as the department published a report that criticized China's treatment of religious minorities.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/china-hong-kong-stocks-fall-on-soft-bank-lending-sino-us-tensions/articleshow/82597220.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82597233,width-1070,height-580,imgsize-396352,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-13T05:26:00Z", "content": "SHANGHAI: China and Hong Kong stocks fell on Thursday, after the former's latest bank lending data missed forecasts, and as Sino-U.S. tensions weighed.\r\n** The CSI300 index fell 0.8% to 5,003.72 poin… [+1492 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "India's prized investment grade status hanging by a thread - Economic Times", "description": "A spate of downgrades last year had already left India's investment grade credit ratings hanging by a thread and the severity of the current virus wave is making the main agencies, S&P, Moody's and Fitch agitated again.", "url": "https://economictimes.indiatimes.com/news/economy/indicators/indias-prized-investment-grade-status-hanging-by-a-thread/articleshow/82596986.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82597055,width-1070,height-580,imgsize-42816,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-13T05:13:00Z", "content": "India's devastating COVID-19 crisis is making investors question more than ever whether after years of debt accumulation and patchy progress on reforms, a country touted as a future economic superpow… [+4501 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "SoftBank transfers 40% of its holding in InMobi to SVF 2 - Moneycontrol", "description": "SVF 2, which has a capital of $30 billion, has invested in 20 companies since April 1.", "url": "https://www.moneycontrol.com/news/business/softbank-transfers-40-of-its-holding-in-inmobi-to-svf-2-6886531.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/06/2017-05-19T104450Z_1_LYNXNPED4I0O5_RTROPTP_3_SOFTBANK-ARM-770x433.jpg", "publishedAt": "2021-05-13T05:00:03Z", "content": "Masayoshi Son-led SoftBank Group has reportedly transferred 40 percent of its holding in mobile ad services platform InMobi to Softbank Vision Fund (SVF) 2 ahead of the former's billion-dollar listin… [+813 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "2022 Volkswagen Tiguan unveiled, hints at interior changes in India-spec model - HT Auto", "description": "The Tiguan facelift will come with several updated technology inside the cabin.", "url": "https://auto.hindustantimes.com/auto/cars/2022-volkswagen-tiguan-unveiled-hints-at-interior-changes-in-india-spec-model-41620879263494.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/13/600x338/Large-13384-2022TiguanSELR-Line-OryxWhite_1620879298853_1620879311515.jpg", "publishedAt": "2021-05-13T04:35:31Z", "content": "2022 Volkswagen Tiguan facelift SUV broke cover in United States on Wednesday. The SUV, which is the German carmakers best-seller both in US and global markets, will soon be launched in India too.\r\nT… [+2184 chars]"}, {"source": {"id": null, "name": "Motoroids.com"}, "author": null, "title": "Yamaha XSR 125 Breaks Cover In Style! - Motoroids", "description": "The XSR 125 runs a liquid cooled, four-valve 124cc single cylinder engine that is pretty much identical to the one in the Yamaha R125. It produces 15hp at 10,000rpm and 11.5Nm of torque at 8,000rpm.", "url": "https://www.motoroids.com/news/yamaha-xsr-125-breaks-cover-in-style/", "urlToImage": "https://www.motoroids.com/wp-content/uploads/2021/05/Yamaha-XSR-125-3-700x380.jpg", "publishedAt": "2021-05-13T04:27:02Z", "content": "Yamahas XSR family fuses retro elements with some modern flair and this formula has proven to be quite successful for the bikemaker so far. The XSR family currently includes the big bad XSR 900, XSR … [+2227 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Bank Holiday today, tomorrow: List of cities in which banks will remain shut - Mint", "description": "Bank holidays are not observed in all the states and they vary as per the specific state", "url": "https://www.livemint.com/money/personal-finance/bank-holiday-today-tomorrow-list-of-cities-in-which-banks-will-remain-shut-11620877847213.html", "urlToImage": "https://images.livemint.com/img/2021/05/13/600x338/bank-kiVG--621x414@LiveMint-a3ad_1620878496800.JPG", "publishedAt": "2021-05-13T04:03:10Z", "content": "On account of Id-Ul-Fitr, banks will remain closed in most parts of the country today (13 May) and 14 May as per the Reserve Bank of India (RBI( holiday calendar. Bank holidays are declared under Neg… [+1224 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Eli Lilly gives out licences for COVID-19 drug Baricitinib to Dr Reddy's, Torrent Pharma and MSN Labs - Moneycontrol", "description": "Lilly has so far given six licenses for Baricitinib in India. On May 10, the American pharma company signed agreements with Cipla, Lupin and Sun Pharmaceutical Industries.", "url": "https://www.moneycontrol.com/news/business/companies/eli-lilly-gives-out-licences-for-covid-19-drug-baricitinib-to-dr-reddys-torrent-pharma-and-msn-labs-6886411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/03/Eli-Lilly-770x433.jpg", "publishedAt": "2021-05-13T03:55:21Z", "content": "American pharma company Eli Lilly on May 13 issued additional royalty-free, non-exclusive voluntary licences to three more Indian drug-makers Dr. Reddys, MSN Laboratories and Torrent Pharmaceuticalst… [+1883 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Ricky", "title": "GasBuddy sees surge in downloads after Colonial Pipeline shutdown, #1 on App Store - GSMArena.com news - GSMArena.com", "description": "A cyber-attack prompted the Colonial Pipeline to shut down, leaving some areas of the South Eastern United States without fuel.", "url": "https://www.gsmarena.com/gasbuddy_sees_surge_in_downloads_after_colonial_pipeline_shutdown_1_on_app_store-news-49080.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/05/gas-buddy-surge-downloads-in-us/-476x249w4/gsmarena_000.jpg", "publishedAt": "2021-05-13T03:55:01Z", "content": "On Tuesday, several States along the south eastern corner of the US felt the effects of the a fuel shortage that followed after a cyber-attack prompted the Colonial Pipeline to shut down. The fuel sh… [+1576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Oxygen Shortage In India's Covid Crisis Sparks Hunt for $1,000 Machines - NDTV", "description": "Raphael Koch, a retailer of medical devices in the small Swiss town of Wil, has been busy for the past two weeks fielding a flurry of phone calls.", "url": "https://www.ndtv.com/india-news/oxygen-shortage-in-indias-covid-crisis-sparks-hunt-for-1-000-machines-2440658", "urlToImage": "https://c.ndtvimg.com/2021-05/1mv9u9uo_oxygen-india-bloomberg_625x300_13_May_21.jpg", "publishedAt": "2021-05-13T03:35:31Z", "content": "India has reported more than 300,000 daily infections for 21 consecutive days.\r\nRaphael Koch, a retailer of medical devices in the small Swiss town of Wil, has been busy for the past two weeks fieldi… [+6679 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Aashish Chandorkar", "title": "Modi govt doesn’t have much time. It should start work on economic recovery now - ThePrint", "description": "Studies have shown that over 200 million Indians are expected to fall into poverty as a result of shutdowns & healthcare costs. The S&P has now downgraded the GDP growth to 9.8%.", "url": "https://theprint.in/economy/modi-govt-doesnt-have-much-time-it-should-start-work-on-economic-recovery-now/657475/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/06/362462683-scaled-e1591257718257.jpg", "publishedAt": "2021-05-13T03:33:48Z", "content": "At the beginning of 2021, when S&amp;P Global Ratings forecast Indian gross domestic product growth at 11% for the coming financial year, the number looked eminently achievable. Last month, the Goods… [+5481 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "PNB revises fixed deposit (FD) rates. Check out the latest rates here - Mint", "description": "Senior citizens will continue to get an additional rate of interest of 0.5 per cent on their deposits", "url": "https://www.livemint.com/money/personal-finance/pnb-revises-fixed-deposit-fd-rates-check-out-the-latest-rates-here-11620875306680.html", "urlToImage": "https://images.livemint.com/img/2021/05/13/600x338/pnb4-kjbC--621x414@LiveMint_1620876379019.jpg", "publishedAt": "2021-05-13T03:27:50Z", "content": "Punjab National Bank (PNB) has revised interest rates on fixed deposits. PNB is offering an interest rate ranging between 3% and 5.25% on fixed deposits maturing in the range of 7 days to 10 years. P… [+1257 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "BSE, NSE to Remain Closed Today on Account of Eid-ul-Fitr - News18", "description": "Indian stock markets — both BSE and NSE — will remain closed on Thursday on account of Eid-ul-Fitr (Ramzan Eid).", "url": "https://www.news18.com/news/business/bse-nse-to-remain-closed-today-on-account-of-eid-ul-fitr-3733346.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610081526_sensex-1.jpg", "publishedAt": "2021-05-13T03:07:00Z", "content": "Indian stock markets both BSE and NSE will remain closed on Thursday on account of Eid-ul-Fitr (Ramzan Eid). The equity segment, equity derivative segment and Securities Lending and Borrowing (SLB) s… [+1389 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "COVID-19: Tata Motors Extends Warranty and Free service period on its cars - CarToq.com", "description": "India is currently facing the second wave of Corona virus and several states have already gone under complete lockdown. Looking at the seriousness of the situation Tata Motors has announced that they will be extending the warranty and free service period on i…", "url": "https://www.cartoq.com/covid-19-tata-motors-extends-warranty-and-free-service-period-on-its-cars/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/02/2021-tata-safari-1-1018x530.jpg", "publishedAt": "2021-05-13T02:15:12Z", "content": "India is currently facing the second wave of Corona virus and several states have already gone under complete lockdown. Looking at the seriousness of the situation Tata Motors has announced that they… [+3175 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Oil drops as India coronavirus crisis tempers rally - Moneycontrol.com", "description": "Brent crude was down 32 cents, or 0.5%, at $69.00 a barrel by 0145 GMT, after gaining more than 1% on Wednesday. West Texas Intermediate (WTI) was down 31 cents, or 0.5%, to $65.77 a barrel, havingrisen 1.2% in the previous session.", "url": "https://www.moneycontrol.com/news/business/markets/oil-drops-as-india-coronavirus-crisis-tempers-rally-6886241.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/crude-oil-770x433.jpg", "publishedAt": "2021-05-13T02:12:01Z", "content": "Oil prices fell on Thursday, pulling back from an eight-week high as concerns about the coronavirus crisis in India, the world's third-biggest importer of crude, tempered a rally driven by IEA and OP… [+1723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Azim Premji at RSS lecture: Truth and good science key to confront crisis - The Indian Express", "description": "Arguing that the country needs to create a more equal society, he stated that as the nation comes out of this crisis, “we need to restructure our society and economy such that our country does not have this kind of inequity and injustice”.", "url": "https://indianexpress.com/article/india/azim-premji-at-rss-lecture-truth-and-good-science-key-to-confront-crisis/", "urlToImage": "https://images.indianexpress.com/2021/05/Azim-Premji.jpg", "publishedAt": "2021-05-13T02:05:10Z", "content": "Industrialist and philanthropist Azim Premji said science and truth have to be the foundations to tackle the Covid-19 crisis, and the scale and spread of the pandemic need to be accepted truthfully.\r… [+2386 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shilpa Phadnis", "title": "JP Morgan to hire 4k techies in Indian units - Times of India", "description": "India Business News: BENGALURU: Morgan said it is looking to add around 4,000 experienced technologists in India this year.", "url": "https://timesofindia.indiatimes.com/business/india-business/jp-morgan-to-hire-4k-techies-in-indian-units/articleshow/82594252.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82594250,width-1070,height-580,imgsize-101727,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-13T01:57:00Z", "content": "JP Morgan to hire 4k techies in Indian units"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "Sovereign Gold Bond Scheme 2021-22 Series I-VI key dates released. Check complete details - Times Now", "description": "The Finance Ministry released the calendar for six trances of the government’s Sovereign Gold Bond Scheme 2021-22 Series I-VI for the entire year.", "url": "https://www.timesnownews.com/business-economy/personal-finance/article/sovereign-gold-bond-scheme-2021-22-series-i-vi-key-dates-released-check-complete-details/756363", "urlToImage": "https://imgk.timesnownews.com/story/gold_iStock-915722602_5.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-13T00:49:00Z", "content": "The first tranche of Sovereign Gold Bond Scheme 2021-22 will open for subscription on May 17, the Finance Ministry said in a statement on Wednesday. The SGBs for the financial year 2021-22 (FY22) wil… [+3761 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "GLOBAL MARKETS-Asian shares spooked by U.S. inflation alarm, yield jump - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/global-marketsasian-shares-spooked-by-us-inflation-alarm-yield-jump-2724575", "urlToImage": "https://i-invdn-com.akamaized.net/news/https://i-invdn-com.akamaized.net/akapi-images/800x450/4c2e3fd500dbb36bf0340ee000839154_w_800_h_450.jpg", "publishedAt": "2021-05-13T00:44:34Z", "content": "* Asian stock markets : https://tmsnrt.rs/2zpUAr4\r\n* Shock rise in U.S. CPI stirs fear of Fed tapering\r\n* Nikkei hits lowest since early Jan\r\n* Treasury yields jump, lifting dollar\r\n* \r\nBitcoin\r\n slu… [+3449 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Pinkvilla Desk", "title": "Bill Gates is reportedly hiding out at a luxurious golf club; Source says ‘He’s been there for around 3 months - PINKVILLA", "description": "According to a report by Page Six, Bill Gates has been hiding out at a luxurious golf club for the last three months. Check out the details.", "url": "https://www.pinkvilla.com/entertainment/hollywood/bill-gates-reportedly-hiding-out-luxurious-golf-club-source-says-he-s-been-there-around-3-months-735022", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/bill_gates_is_reportedly_hiding_out_at_a_luxurious_golf_club_source_says_hes_been_there_for_around_3_months_social.jpg?itok=gQSVGukF", "publishedAt": "2021-05-12T22:59:52Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Swaraj Singh Dhanjal", "title": "Multiples-led group to buy Cadila’s animal health unit - Mint", "description": "Zydus Animal Health and Investments Ltd (ZAHL), a wholly owned subsidiary of Cadila Healthcare Ltd, has entered into an agreement to sell its Animal Healthcare Established Markets Undertaking (Zydus AH) to a consortium led by private equity firm Multiples Alt…", "url": "https://www.livemint.com/companies/news/cadila-to-sell-india-focused-animal-health-business-for-rs2-921-crore-11620800873506.html", "urlToImage": "https://images.livemint.com/img/2021/05/12/600x338/Zydus_AHL_1620801141857_1620801152152.jpg", "publishedAt": "2021-05-12T18:56:38Z", "content": "MUMBAI :\r\nZydus Animal Health and Investments Ltd (ZAHL), a wholly owned subsidiary of Cadila Healthcare Ltd, has entered into an agreement to sell its Animal Healthcare Established Markets Undertaki… [+2807 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "FMCG industry record 9.4% growth in Q4, rural continue to perform and metro cities recover - Moneycontrol.com", "description": "The rural market continued to perform with strong growth of 14.6 per cent during the period and the metro markets have registered a positive growth after two quarters.", "url": "https://www.moneycontrol.com/news/business/earnings/fmcg-industry-record-9-4-growth-in-q4-rural-continue-to-perform-and-metro-cities-recover-6886111.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Spices-FMCG-770x433.jpg", "publishedAt": "2021-05-12T17:22:20Z", "content": "The Indian FMCG industry has recorded a 9.4 per cent growth in the January-March quarter of 2021, helped by a consumption-led growth and value growth by increased prices of products, especially of st… [+2935 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "India offers $2.46B incentive to boost domestic production of batteries - TechCrunch", "description": "India’s cabinet on Wednesday approved Department of Heavy Industry’s proposal to provide incentives to boost domestic production of batteries with advanced energy storage, the latest in a series of efforts by New Delhi to make the world’s second-largest inter…", "url": "http://techcrunch.com/2021/05/12/india-approves-incentive-to-boost-domestic-production-of-batteries-advanced-energy-storage/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/12/GettyImages-1096026706.jpg?w=570", "publishedAt": "2021-05-12T16:47:46Z", "content": "India’s cabinet on Wednesday approved Department of Heavy Industry’s proposal to provide incentives to boost domestic production of batteries with advanced energy storage, the latest in a series of e… [+2624 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Neha Alawadhi", "title": "Firms help employees in Covid with 4-day workweek, infinite leave - Business Standard", "description": "Many have shortened work weeks to four days, others are offering more time off to help staff rejuvenate or care for loved ones", "url": "https://www.business-standard.com/article/current-affairs/companies-walk-the-extra-mile-to-help-employees-as-pandemic-rages-on-121051201177_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/29/full/1619705990-8341.jpg", "publishedAt": "2021-05-12T13:46:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Ericsson report: 40 million Indians could adopt 5G in first year - The Indian Express", "description": "Jasmeet Singh Sethi, who heads the Ericsson ConsumerLab and is based in Stockholm, says 22 per cent of smartphone users in urban India already own a 5G-ready smartphone.", "url": "https://indianexpress.com/article/technology/tech-news-technology/ericsson-report-40-million-indians-could-adopt-5g-in-first-year-7312501/", "urlToImage": "https://images.indianexpress.com/2021/05/Ericcson-Story-1.jpg", "publishedAt": "2021-05-12T13:28:13Z", "content": "At least 40 million smartphone users in India could jump on the 5G bandwagon in the first year, according to a new report from Ericsson ConsumerLab. The report also states that Indian users could be … [+3103 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "UPL Q4 results: Net profit up 74% to Rs 1,361 crore - Economic Times", "description": "Revenue from operations was 15 per cent higher in the quarter at Rs 12,796 crore compared to Rs 11,141 crore in the same period of 2019-20.", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/upl-q4-results-net-profit-up-74-to-rs-1361-crore/articleshow/82575624.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82575637,width-1070,height-580,imgsize-134988,overlay-etmarkets/photo.jpg", "publishedAt": "2021-05-12T13:22:00Z", "content": "MUMBAI: Agro-chemical firm on Wednesday reported 73.59 per cent growth in consolidated net profit at Rs 1,361 crore for March quarter 2020-21. The company's net profit stood at Rs 784 crore in the ye… [+1214 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Vodafone Idea sees subscriber additions in February, Jio adds maximum wireless users, as per TRAI data - India Today", "description": "The TRAI has released the subscriber addition data for February 2021. Airtel, Jio and Vi have added subscribers in February 2021.", "url": "https://www.indiatoday.in/technology/news/story/vodafone-idea-sees-subscriber-additions-in-february-jio-adds-maximum-wireless-users-as-per-trai-data-1801790-2021-05-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/Screenshot_2021-05-03_at_6.12._1-647x363.png?M5BoN8DVygSdP.C4CDgE_stoFN8Rk23G", "publishedAt": "2021-05-12T11:54:08Z", "content": "Vodafone Idea or Vi, for the first time, has seen subscriber additions since October 2019. The telco has recorded over 6 lakh subscriber additions in February 2021. Vodafone had mistakenly registered… [+2137 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Sharleen Dsouza", "title": "Asian Paints Q4 Results: Profit Falls Sequentially But Beats Estimates, Margin Contracts - BloombergQuint", "description": "Net profit fell 31% sequentially to Rs 869.89 crore in the quarter ended March.", "url": "https://www.bloombergquint.com/business/asian-paints-q4-results-profit-falls-sequentially-but-beats-estimates-margin-contracts", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-03%2F5cac2954-f9c5-467d-bc8e-c95925a53045%2FBuckets_of_Asian_Paints_Ltd__paint_at_a_store_in_Mumbai__India__Photographer_Dhiraj_SinghBloomberg.jpg?rect=0%2C337%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-12T10:43:38Z", "content": "The company didn't disclose sequential volume growth. Domestic decorative business volumes jumped 48% over a year earlier, led by a robust growth in the premium and luxury product range, the company … [+1061 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Stock Market Highlights: Sensex drops 471 points, Nifty ends below 14,700; metals drag; PSU Banks outperform - CNBCTV18", "description": "Stock Market Highlights: Indian equity indices, Sensex and Nifty ended lower on Wednesday dragged by heavy selling in metals, IT, private banks and financial services stocks. Midcap and smallcap indices also declined. Gains were seen in PSU Banks, auto and me…", "url": "https://www.cnbctv18.com/market/stocks/stock-market-live-updates-indian-indices-likley-to-open-on-a-tepid-note-on-cautious-global-cues-teelcom-stocks-mm-in-focus-9271691.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/12/2018-12-10T151707Z_1_LYNXMPEEB915J_RTROPTP_3_MARKETS-INDIA-STOCKS-768x552.jpg", "publishedAt": "2021-05-12T10:43:22Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Oxygen Concentrators Can Be Home Delivered To Covid Patients In Bengaluru - NDTV", "description": "Oxygen concentrators can now be home delivered to Bengaluru Covid patients under a new initiative launched today in the city by Karnataka Deputy Chief Minister and Covid Task Force Head Dr Ashwathnarayan CN.", "url": "https://www.ndtv.com/karnataka-news/oxygen-concentrators-being-home-delivered-to-covid-patients-in-bengaluru-2440230", "urlToImage": "https://c.ndtvimg.com/2021-05/vitrnbs8_oxygen-concentrator-apollo-twitter-650_650x400_04_May_21.jpg", "publishedAt": "2021-05-12T10:20:17Z", "content": "The concentrators will only be given to those whose oxygen saturation is below 94 (File)\r\nOxygen concentrators can now be home delivered to Bengaluru Covid patients under a new initiative launched to… [+2267 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Maruti Suzuki extends free service and warranty period amid Covid 2nd wave - HT Auto", "description": "Maruti Suzuki has extended free service, warranty and extended warranty scheduled to expire between March 15 and May 31, till June 30.", "url": "https://auto.hindustantimes.com/auto/news/maruti-suzuki-extends-free-service-and-warranty-period-amid-covid-2nd-wave-41620810579993.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/05/12/600x338/Maruti_Suzuki_1620811003699_1620811026760.jpg", "publishedAt": "2021-05-12T09:19:03Z", "content": "Maruti Suzuki on Wednesday announced the company is extending free service and warranty period for and on its vehicles as a special gesture for customers amid the second wave of Covid-19 pandemic and… [+1182 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Ram Prasad Sahu", "title": "New CEO at Godrej Consumer Products drives a sharp rerating for the stock - Business Standard", "description": "The stock gains 21 per cent; improvement in financial metrics key to sustain show", "url": "https://www.business-standard.com/article/companies/new-ceo-at-godrej-consumer-products-drives-a-sharp-rerating-for-the-stock-121051200617_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/10/full/1620667420-5072.jpg", "publishedAt": "2021-05-12T09:04:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "Auto Sales Fall 30% In April On Fresh Covid-19 Curbs Amid Second Wave: SIAM - BloombergQuint", "description": "Domestic wholesales of passenger vehicles fell 10% month-on-month to 2.61 lakh units in April.", "url": "https://www.bloombergquint.com/business/auto-sales-fall-30-in-april-on-fresh-covid-19-curbs-amid-second-wave-siam", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2019-01%2F1c0f1178-d278-4892-a273-6bea2f7fa8ca%2F328017384_1_10.jpg?rect=0%2C0%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-12T06:47:25Z", "content": "Volumes are not comparable with a year earlier as the nation was under a complete lockdown that shut dealerships and stalled production, causing a sales washout.\r\nSince then up until March, sales gra… [+1048 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reuters", "title": "Elon Musk Asks Twitter Users if They Want Tesla to Accept Dogecoin - Gadgets 360", "description": "Elon Musk asked his 54 million followers on Twitter, \"Do you want Tesla to accept Doge?\" — referring to a digital currency worth roughly Rs. 35 with no real-world use.", "url": "https://gadgets.ndtv.com/transportation/news/elon-musk-dogecoin-tesla-twitter-poll-payment-price-cryptocurrency-rally-2439880", "urlToImage": "https://i.gadgets360cdn.com/large/Dogecoin_Elon_tweet_1618652979675.jpg", "publishedAt": "2021-05-12T04:21:28Z", "content": "Billionaire Elon Musk and cryptocurrency aficionado on Tuesday asked his 54 million followers on Twitter \"Do you want Tesla to accept Doge?,\" referring to a digital currency worth roughly 48 cents (r… [+2383 chars]"}]}