{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Exclusive: Heavy-Lift Made-In-India Drone To Redefine E-Commerce Delivery - NDTV", "description": "In two years from now, the first made-in-India 'heavy lift' drones could begin redefining e-commerce operations in the country. These will be able to transport 150 kilograms of cargo to a distance of 150 km.", "url": "https://www.ndtv.com/india-news/exclusive-heavy-lift-made-in-india-drone-hl-150-to-redefine-e-commerce-delivery-2647493", "urlToImage": "https://c.ndtvimg.com/2021-12/e2odh4pg_madein-india-drone_625x300_12_December_21.jpg", "publishedAt": "2021-12-12T08:01:00Z", "content": "The drone is being designed by NewSpace Research &amp; Technologies in partnership with SpiceXpress.\r\nNew Delhi: In two years from now, the first made-in-India 'heavy lift' drones could begin redefin… [+3704 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Mukesh Ambani's RIL, partner looking to buy bankrupt textile company Sintex - Mint", "description": "Reliance is partnering with Assets Care & Reconstruction Enterprise Ltd. to bid for the company under a court-appointed bankruptcy resolution process, Sintex", "url": "https://www.livemint.com/companies/news/asias-richest-man-looking-to-buy-bankrupt-textile-firm-in-india-11639292046044.html", "urlToImage": "https://images.livemint.com/img/2021/12/12/600x338/9e188fc0-543e-11ec-93a1-2e784d59340f_1639292837792_1639292947258.jpg", "publishedAt": "2021-12-12T07:09:38Z", "content": "Mukesh Ambanis Reliance Industries Ltd., along with a partner, are among those bidding to take over bankrupt Indian textile firm Sintex Industries Ltd., according to a stock-exchange filing, as the b… [+1336 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Editor", "title": "Hyundai Venue EV in the works? - CarToq.com", "description": "After witnessing the success of Tata Motor’s EV offerings, Hyundai India is also eyeing to grab a slice of the EV success cake. The South Korean automaker recently made a huge announcement regarding their electrification plans for India. Hyundai is planning t…", "url": "https://www.cartoq.com/hyundai-venue-ev-in-the-works/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/12/hyundai-venue-ev-fb.jpg", "publishedAt": "2021-12-12T06:05:31Z", "content": "After witnessing the success of Tata Motors EV offerings, Hyundai India is also eyeing to grab a slice of the EV success cake. The South Korean automaker recently made a huge announcement regarding t… [+3057 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Govt unlikely to announce capital infusion for PSU banks in Budget 2022-23 - Mint", "description": "Finance Minister Nirmala Sitharaman is expected to present the fourth budget of the Modi 2.0 government on February 1", "url": "https://www.livemint.com/budget/expectations/govt-unlikely-to-announce-capital-infusion-for-psu-banks-in-budget-202223-11639288238499.html", "urlToImage": "https://images.livemint.com/img/2021/12/12/600x338/banks3-k80D--621x414@LiveMint_1639288521418.jpg", "publishedAt": "2021-12-12T05:57:10Z", "content": "NEW DELHI :\r\nThe government is unlikely to announce capital infusion for public sector banks (PSBs) in the upcoming Budget, as their financial health has improved on the back of reduction in bad loan… [+2541 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Sonal Sachdev", "title": "BOTTOMLINE: IPO wealth effect and why real estate may be a good bet - CNBCTV18", "description": "Now is a good time to diversify your portfolio. One large asset class that hasn’t seen any significant value change for many years, and one with significant absorption capacity is real estate", "url": "https://www.cnbctv18.com/market/the-ipo-wealth-effect-11790572.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/03/IPO1-1019x573.jpg", "publishedAt": "2021-12-12T05:41:00Z", "content": "Mini Now is a good time to diversify your portfolio. One large asset class that hasnt seen any significant value change for many years, and one with significant absorption capacity is real estate"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "2021 Recap: 8 fake cryptocurrency Android apps that scammed users - Gadgets Now", "description": "Cryptocurrency is among the biggest stories of 2021. The rise in value of cryptocurrencies raised people's interest in crypto around the world. It has become a hot topic not only among investors but also among common people. While countries are still to legal…", "url": "https://www.gadgetsnow.com/slideshows/2021-recap-8-fake-cryptocurrency-android-apps-that-scammed-users/photolist/88230658.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88230860,width-800,resizemode-4,imgsize-21296/share.jpg", "publishedAt": "2021-12-12T04:08:00Z", "content": "The app prompted users to click on ads during fraudulent cryptomining activities to prove that users are not robots."}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Waiting Period For 5 Recently-Launched Cars – Tata Punch To MG Astor - GaadiWaadi.com", "description": "Some newly-launched cars in India are enjoying strong demand, but due to production limitations, the waiting period for them has escalated", "url": "https://gaadiwaadi.com/waiting-period-for-5-recently-launched-cars-tata-punch-to-mg-astor/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/MG-Astor-pics-8.jpg", "publishedAt": "2021-12-12T04:00:38Z", "content": "To beat the current market slowdown and attract new buyers, many carmakers introduced new cars in India recently. Some of these new vehicles have managed to garner a lot of attention from buyers, som… [+1966 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Ratan Tata-backed startup to now offer doorstep delivery of fuel - CNBCTV18", "description": "Repos Energy plans to manufacture and sell 3,200 units of its mobile petrol pump Beta, each of which has a capacity of 3,000 litres of fuel, to ensure doorstep delivery across several cities.", "url": "https://www.cnbctv18.com/business/companies/ratan-tata-backed-startup-to-now-offer-doorstep-delivery-of-fuel-11784922.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/03/petrol_diesel3-1019x573.jpg", "publishedAt": "2021-12-12T03:34:00Z", "content": "MiniRepos Energy plans to manufacture and sell 3,200 units of its mobile petrol pump Beta, each of which has a capacity of 3,000 litres of fuel, to ensure doorstep delivery across several cities."}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "All-new 2022 Maruti Suzuki Brezza: What the production version will look like - CarToq.com", "description": "Come mid-2022, and Maruti Suzuki will finally break the silence on its new SUV launch spree with the first of the projected launches for the near future, the all-new Brezza. Some spy shots of the all-new second-generation model have already appeared in the we…", "url": "https://www.cartoq.com/all-new-2022-maruti-suzuki-brezza-what-the-production-version-will-look-like/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/12/2022-maruti-brezza-render-fb.jpg", "publishedAt": "2021-12-12T03:33:36Z", "content": "Come mid-2022, and Maruti Suzuki will finally break the silence on its new SUV launch spree with the first of the projected launches for the near future, the all-new Brezza. Some spy shots of the all… [+2965 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Astha Jain of Hem assigned subscribe rating to Metro Brands, MapmyIndia, Medplus, Data Patterns IPOs -... - Moneycontrol.com", "description": "If anyone has limited funds to deploy in, then pecking order according to us will be CE Info Systems on top followed by Data Patterns. However, on third position we will be placing Medplus while on fourth position we will be placing Metro Brands.", "url": "https://www.moneycontrol.com/news/business/ipo/astha-jain-of-hem-assigned-subscribe-rating-to-metro-brands-mapmyindia-medplus-data-patterns-ipos-here-is-why-7815351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Astha_Jain-770x433.jpg", "publishedAt": "2021-12-12T03:23:16Z", "content": "Astha Jain, Senior Research Analyst at Hem Securities, told Moneycontrol that she had assigned 'subscribe' rating to all four IPOs - Metro Brands, MapmyIndia, Medplus Health Services, and Data Patter… [+5879 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Top cryptocurrency news of the day: Major stories on Bitcoin, NFTs and more - Moneycontrol.com", "description": "A daily round-up of the most interesting articles on cryptocurrencies like Bitcoin, Ethereum, and Tether to help you jump-start the day.", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/top-cryptocurrency-news-of-the-day-major-stories-on-bitcoin-nfts-and-more-7815921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/11/RTX3IEV5-770x433.jpg", "publishedAt": "2021-12-12T03:12:26Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Daughter Of 1st US Astronaut Alan Shepard Soars To Space In Blue Origin - NDTV", "description": "The eldest daughter of pioneering US astronaut Alan Shepard took a joyride to the edge of space aboard Jeff Bezos' Blue Origin rocketship on Saturday, 60 years after her late father's famed suborbital NASA flight at the dawn of the Space Age.", "url": "https://www.ndtv.com/world-news/blue-origin-laura-shepard-churchley-daughter-of-1st-us-astronaut-alan-shepard-soars-to-space-in-blue-origin-2647177", "urlToImage": "https://c.ndtvimg.com/2021-12/ibr3m3ro_laura-shepard-churchley-blue-origin_625x300_12_December_21.jpg", "publishedAt": "2021-12-12T02:18:00Z", "content": "Laura Shepard Churchley (left) is the daughter of pioneering US astronaut Alan Shepard.\r\nThe eldest daughter of pioneering US astronaut Alan Shepard took a joyride to the edge of space aboard Jeff Be… [+4415 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Mahindra XUV700 vs Citroen C5 Aircross SUV in a drag race - CarToq.com", "description": "Mahindra XUV700 is currently one of the most popular SUV in the market. Just like Thar, Mahindra XUV700 also took market by storm. Mahindra surprised everyone with the pricing and list of features. It is currently the most advanced and feature loaded SUV from…", "url": "https://www.cartoq.com/mahindra-xuv700-vs-citroen-c5-aircross-suv-in-a-drag-race/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/12/Citroen-C5-vs-XUV700.jpg", "publishedAt": "2021-12-12T01:17:50Z", "content": "Mahindra XUV700 is currently one of the most popular SUV in the market. Just like Thar, Mahindra XUV700 also took market by storm. Mahindra surprised everyone with the pricing and list of features. I… [+2787 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vivek Punj", "title": "Fixed deposit interest rates remain unchanged. Do this to get most out of your investment - Mint", "description": "Some would be disappointed as the central bank maintained the status quo regarding interest rates, holding them at 4 per cent for over a year now", "url": "https://www.livemint.com/money/personal-finance/fixed-deposit-interest-rates-remain-unchanged-do-this-to-get-most-out-of-your-investment-11639234617996.html", "urlToImage": "https://images.livemint.com/img/2021/12/11/600x338/fixed_deposit_1639234639108_1639234639205.jpg", "publishedAt": "2021-12-11T16:17:56Z", "content": "Fixed Deposit interest rates: The Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) has decided to keep the key policy rates unchanged in the face of the Covid-19 pandemic and the co… [+2680 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Instagram to bring back chronological feed by early 2022 but with new features - CNBCTV18", "description": "Instagram is all set to bring back the chronological feed for users on its app. However, the new version would be slightly different from what it used to be before 2016.", "url": "https://www.cnbctv18.com/technology/instagram-to-bring-back-chronological-feed-by-early-2022-but-with-new-features-11785552.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/07/instagram-1019x573.jpg", "publishedAt": "2021-12-11T13:58:00Z", "content": "MiniInstagram is all set to bring back the chronological feed for users on its app. However, the new version would be slightly different from what it used to be before 2016."}, {"source": {"id": null, "name": "Business Standard"}, "author": "Bloomberg", "title": "Vedanta to pay Rs 5,019 crore in dividends after solid earnings - Business Standard", "description": "Vedanta approved an interim dividend of Rs 13.50 a share", "url": "https://www.business-standard.com/article/companies/vedanta-to-pay-rs-5-019-crore-in-dividends-after-solid-earnings-121121100792_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-06/27/full/1561650188-0344.jpg", "publishedAt": "2021-12-11T13:38:00Z", "content": "Billionaire Anil Agarwal’s Vedanta Ltd. will reward shareholders with a dividend payout for the second time this year after reporting back-to-back bumper profits in the past year.\r\nVedanta approved a… [+1944 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Editor", "title": "Royal Enfield 650 Anniversary Edition: 120 sold in 120 seconds - CarToq.com", "description": "The oldest motorcycle brand in the world Royal Enfield sold 120 units of their limited production Anniversary Edition 650 twins in a record time of under 120 seconds. On the occasion of the brand’s 120th anniversary, 60 units of each, the Anniversary Edition …", "url": "https://www.cartoq.com/royal-enfield-650-anniversary-edition-120-sold-in-120-seconds/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/12/royal-enfield-650-anniversary-edition-fb.jpg", "publishedAt": "2021-12-11T13:20:28Z", "content": "The oldest motorcycle brand in the world Royal Enfield sold 120 units of their limited production Anniversary Edition 650 twins in a record time of under 120 seconds. On the occasion of the brands 12… [+3013 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "PTI", "title": "Prices of edible oil prices fall nearly Rs10/kg in last 30 days; may fall further: Industry - CNBCTV18", "description": "A combination of retailers reducing prices before Diwali and the Centre reducing import duties has resulted in a Rs8-10 per kg reduction in oil prices. Industry insiders said they expect the prices to fall by a further Rs3-4 per kg in the coming days.", "url": "https://www.cnbctv18.com/business/edible-oil-prices-down-rs-8-10kg-in-last-30-days-may-fall-further-industry-11785492.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/06/edibleoil2-1019x573.jpg", "publishedAt": "2021-12-11T13:12:00Z", "content": "MiniA combination of retailers reducing prices before Diwali and the Centre reducing import duties has resulted in a Rs8-10 per kg reduction in oil prices. Industry insiders said they expect the pric… [+55 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Growth-inflation balance, Shaktikanta Das has his task cut in 2nd term as RBI Governor - Economic Times", "description": "Shaktikanta Das would be required to adopt a calibrated liquidity management approach and boost credit growth.", "url": "https://economictimes.indiatimes.com/news/economy/policy/growth-inflation-balance-shaktikanta-das-has-his-task-cut-in-2nd-term-as-rbi-gov/articleshow/88226632.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88226577,width-1070,height-580,imgsize-64334,overlay-economictimes/photo.jpg", "publishedAt": "2021-12-11T12:49:00Z", "content": "Shaktikanta Das has become the first Reserve Bank of India (RBI) Governor to get a second term since Narendra Modi-led government came into power in 2014.\r\nThe former bureaucrat, who took charge of t… [+4902 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "2021 Maruti Celerio bookings cross the 15,000 mark - Team-BHP", "description": "Maruti Suzuki has received over 15,000 bookings for the new-gen Celerio in just over a month since its launch. The", "url": "https://www.team-bhp.com/news/2021-maruti-celerio-bookings-cross-15000-mark", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2021-maruti-celerio-10_0.jpg", "publishedAt": "2021-12-11T11:58:24Z", "content": "Maruti Suzuki has received over 15,000 bookings for the new-gen Celerio in just over a month since its launch.\r\nThe second-generation Celerio was launched on November 10 at a price of Rs. 4.99 lakh (… [+503 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "High Prices of Automobiles in India Likely to Persist During 2022: Report - News18", "description": "Lately, increasing cost of commodities in India has resulted in record-high prices for new and used vehicles in the country.", "url": "https://www.news18.com/news/auto/high-prices-of-automobiles-in-india-likely-to-persist-during-2022-report-4544234.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/scrap-cars-163828003616x9.png", "publishedAt": "2021-12-11T11:30:56Z", "content": "High prices of automobiles are likely to persist at elevated levels even during 2022, said Grant Thornton Bharat in a report. Lately, increasing cost of commodities in India has resulted in record-hi… [+1481 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "PTI", "title": "Indian origin CEO of Better.com, who fired 900 on Zoom call, takes 'time off' - Onmanorama", "description": "On December 1 over a Zoom call that lasted less than three minutes, Garg abruptly fired more than 900 employees, about 9 per cent of the company's workforce.", "url": "https://www.onmanorama.com/news/business/2021/12/11/better-ceo-vishal-garg-to-take-time-off-after-controversial-zoom-call-lay-off.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/news/business/images/2021/12/11/vishal-garg.jpg", "publishedAt": "2021-12-11T11:29:22Z", "content": "New York: Vishal Garg, the Indian-origin CEO of US-based homeownership firm Better.com, who recently laid off 900 employees over a Zoom call and triggered widespread outrage, is taking time off from … [+2117 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "SBI Launches Pre-Approved Personal Loan: Step-By-Step Guide to Avail Instant Loan - News18", "description": "Customers will get instant processing of loans and disbursement in just four clicks through the SBI's pre-approved personal loan feature", "url": "https://www.news18.com/news/business/sbi-launches-pre-approved-personal-loan-step-by-step-guide-to-avail-instant-loan-4544435.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/sbi-163922002516x9.jpg", "publishedAt": "2021-12-11T10:55:55Z", "content": "SBI Pre-Approved Personal Loan: The State Bank of India has launched a new service for its customers yet again, which is likely to benefit them greatly. Customers of the country’s largest lender will… [+2832 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Sterlite Technologies unveils its 5G-from-India offering at IMC 2021 - Moneycontrol", "description": "One of the first indigenous companies with 100% homegrown 5G-ready solutions, the company combines the power of optical, wireless, virtualisation, and deployment methodology to build robust 5G infrastructure for India and the world.", "url": "https://www.moneycontrol.com/news/business/sterlite-technologies-unveils-its-5g-from-india-offering-at-imc-2021-7815191.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/5G_sep21-770x433.jpg", "publishedAt": "2021-12-11T10:52:49Z", "content": "Sterlite Technologies Limited, an industry-leading integrator of digital networks, today unveiled its 5G portfolio at the IMC 2021. With its purpose of transforming billions of lives through digital … [+2455 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Inflation Plagues American Economy: US Consumer Prices See Fastest Rise in Close to 40 Years – Economics Bitcoin News - Bitcoin News", "description": "CPI data released Friday shows consumer prices in the United States climbed 6.8% in November compared to 12 months ago.", "url": "https://news.bitcoin.com/inflation-plagues-american-economy-us-consumer-prices-see-fastest-rise-in-close-to-40-years/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2021/12/inflation-plagues-american-economy-us-consumer-prices-see-fastest-rise-in-close-to-forty-years.jpg", "publishedAt": "2021-12-11T10:37:27Z", "content": "The consumer price index (CPI) data released Friday by the U.S. Bureau of Labor Statistics show prices in the United States climbed 6.8% in November compared to 12 months ago. It’s the largest rise i… [+4556 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "Jordan Lyanchev", "title": "Market Watch: BTC Dipped Below $47K on Another Volatile Friday - CryptoPotato", "description": "After getting rejected at $50,000 again, BTC dumped by $3,000 before bouncing off. Polkadot is up by 5% in a day.", "url": "https://cryptopotato.com/market-watch-btc-dipped-below-47k-on-another-volatile-friday/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2021/05/bearbitcoin_cover.jpg", "publishedAt": "2021-12-11T09:37:49Z", "content": "Yesterday’s inflation news from the US pushed bitcoin to $50,000 once more, but the asset failed and dropped by several thousand dollars. Most altcoins are also in the red on a daily scale, as ETH sl… [+2325 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Haider Ali Khan", "title": "Ola S1 and S1 Pro production in full swing as delivery date nears. Inside details - Mint", "description": "These electric scooters have been manufactured locally at its Future factory in Tamil Nadu", "url": "https://www.livemint.com/auto-news/ola-s1-and-s1-pro-production-in-full-swing-as-delivery-date-nears-inside-details-11639212496356.html", "urlToImage": "https://images.livemint.com/img/2021/12/11/600x338/FGTxMitVkAQZ1I__1639212558343_1639212565796.jpg", "publishedAt": "2021-12-11T08:54:40Z", "content": "As the delivery date for the Ola electric scooters nears the production lines have been running at full speed. Ola is about the start delivering its electric scooters S1 and S1 Pro from December 15. … [+1390 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "India-made TVS Apache RR 310 launched in the Philippines - HT Auto", "description": "TVS Apache RR310 is the flagship sports bike from the Hosur-based two-wheeler making brand.\nApache RR310 will be sold alongside the TVS NTorq in the market of Philippines.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/indiamade-tvs-apache-rr-310-launched-in-the-philippines-41639209303142.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/12/11/600x338/WhatsApp_Image_2021-08-30_at_19.25.32_(1)_1630332291988_1639211039915.jpeg", "publishedAt": "2021-12-11T08:29:12Z", "content": "Apart from the new NTorq 125 scooter, TVS Motor Company has also announced the launch of its Apache RR310 in the market of the Philippines. The company will sell both the new products alongside the a… [+1681 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Auto Desk", "title": "Honda Activa 125 Premium Edition Launched, Priced From Rs 78,725 - News18", "description": "The Honda Activa 125 Premium Edition comes with dual-tone body colour, blacked-out forks & engine casing along with a body-coloured grab handle at the rear.", "url": "https://www.news18.com/news/auto/honda-activa-125-premium-edition-launched-priced-from-rs-78725-4543955.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/honda-activa-125-premium-edition-163921121116x9.jpg", "publishedAt": "2021-12-11T08:28:00Z", "content": "Honda Motorcycle &amp; Scooter India has launched a special edition of the Activa 125, simply called the ‘Premium Edition’. It costs Rs 78,725 for the drum brake version and Rs 82,280 for the disc br… [+1557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Explained: Why October IIP came in at a 8-month low despite festive demand, strong GST numbers - The Indian Express", "description": "Industrial output grew 3.2 per cent, the lowest in eight months, in October. What does the data show, and what are concerns? What could be the trend going forward?", "url": "https://indianexpress.com/article/explained/october-index-of-industrial-production-data-explained-7667463/", "urlToImage": "https://images.indianexpress.com/2021/12/India-economy-1.jpg", "publishedAt": "2021-12-11T08:20:21Z", "content": "Industrial output grew 3.2 per cent, the lowest in eight months, in October, with an uptick in mining and electricity output. Supply-side bottlenecks, especially related to coal and chips in the auto… [+4242 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "What you can expect from ITC's first-ever investor meet next week - Times Now", "description": "The shares of the FMCG giant climbed 6.5% higher in the last week at Rs 236.10 as investors hoped for some big-ticket announcement during the upcoming meet.", "url": "https://www.timesnownews.com/business-economy/companies/article/what-you-can-expect-from-itcs-first-ever-investor-meet-slated-for-next-week/839625", "urlToImage": "https://imgk.timesnownews.com/story/ITC_2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-12-11T07:52:00Z", "content": "ITC will hold its first-ever investor analyst and institutional investor meet on Tuesday, December 14. The company informed the exchanges about its decision to hold the meeting on December 9. The sha… [+2412 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "News Desk", "title": "Electric vehicle charging in Hyderabad will cost Rs 12 per kWh - The Siasat Daily", "description": "Owners of electric vehicles in Telangana will soon be able to charge their vehicles for Rs 12.06 kilowatt per hour (kWh) as service costs.", "url": "https://www.siasat.com/electric-vehicle-charging-in-hyderabad-will-cost-rs-12-per-kwh-2239647/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/02/electric-vehicle-charging-station-point-489JA84-min-scaled.jpg", "publishedAt": "2021-12-11T07:10:00Z", "content": "Hyderabad: As the Telangana state government expedites the process of setting up public charging stations, those who own electric vehicles (EVs) will soon be able to charge their vehicles for Rs 12.0… [+2888 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "RateGain IPO: What GMP signals as all eyes set on share allotment date - Mint", "description": "RateGain IPO GMP today is  ₹45, which is  ₹5 lower from its Friday grey market premium of  ₹50, say market observers", "url": "https://www.livemint.com/market/stock-market-news/rategain-ipo-what-gmp-signals-as-all-eyes-set-on-share-allotment-date-11639205293479.html", "urlToImage": "https://images.livemint.com/img/2021/12/11/600x338/RateGain_IPO_GMP_Web_1639205345654_1639205373966.PNG", "publishedAt": "2021-12-11T06:52:52Z", "content": "RateGain IPO: Subscription for public issue worth 1,335.74 crore is closed and bidders are anxiously waiting for announcement of share allocation, which is expected on 14th December 2021. In 3-day bi… [+331 chars]"}, {"source": {"id": null, "name": "Seeking Alpha"}, "author": null, "title": "Nu Holdings: A Chance To Invest In A Generational Disruptor - Seeking Alpha", "description": "Nubank operates in one of the most concentrated banking sectors in the world, with the top 5 banks controlling 70 to 85% of the loan market. Read on to know why it has runway for growth.", "url": "https://seekingalpha.com/article/4474689-nu-holdings-a-chance-to-invest-in-a-generational-disruptor", "urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1347527072/medium_image_1347527072.jpg", "publishedAt": "2021-12-11T06:52:00Z", "content": null}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Google wont raise every employees salary to keep up with inflation - Business Standard", "description": "A top Google executive has said that the tech giant would not automatically adjust all employees' salaries to account for inflation.", "url": "https://www.business-standard.com/article/companies/google-won-t-raise-every-employee-s-salary-to-keep-up-with-inflation-121121100232_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-06/23/full/1624391319-4869.jpg", "publishedAt": "2021-12-11T05:49:00Z", "content": "A top Google executive has said that the tech giant would not automatically adjust all employees' salaries to account for inflation.\r\nAccording to a CNBC report, Google's Vice President of compensati… [+2706 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Maruti Vitara Brezza Reaches 7 Lakh Sales Mark In Less Than 6 Years - GaadiWaadi.com", "description": "Maruti Suzuki Vitara Brezza compact SUV got past the 7 lakh sales milestone in just 69 months in India; quickest to do so in the segment", "url": "https://gaadiwaadi.com/maruti-vitara-brezza-reaches-7-lakh-sales-mark-in-less-than-6-years/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/02/2020-Maruti-Suzuki-Vitara-Brezza-11.jpg", "publishedAt": "2021-12-11T05:32:22Z", "content": "Maruti Suzuki has the Vitara Brezza as one of its high volume bearing cars in the domestic market and it has been consistent all along. The compact SUV made its local debut back in early 2016 at the … [+1891 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "3 listings, 5 IPOs: Busy week for primary market, check out all the details - Moneycontrol.com", "description": "While Tega Industries, Anand Rathi Wealth and RateGain Travel Technologies will debut on the stock exchanges next week, CE Info Systems and Metro Brands will close their IPO subscription and three new IPOs will launch during December 13-17", "url": "https://www.moneycontrol.com/news/business/ipo/3-listings-5-ipos-busy-week-for-primary-market-check-out-all-the-details-7813751.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/IPO-general_shutterstock_220316887-1-770x433.jpg", "publishedAt": "2021-12-11T05:03:48Z", "content": "It is going to be another busy week for the primary market as companies will cumulatively raise over Rs 4,500 crore through their initial public offerings.\r\nThis includes IPOs that are currently ongo… [+3178 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Mini Cooper SE electric India launch timeline revealed - HT Auto", "description": "The new Mini Cooper SE looks almost identical to its ICE-powered sibling.\nThe first lot of the Mini Cooper SE has been fully booked in India.", "url": "https://auto.hindustantimes.com/auto/cars/mini-cooper-se-electric-indian-launch-timeline-revealed-41639195631253.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/12/11/600x338/mini-cooper-se-2020-im-test_1634988970538_1639198258547.jpg", "publishedAt": "2021-12-11T04:56:46Z", "content": "The new Cooper Electric SE was teased by Mini India earlier this year in October. The company also started accepting pre-bookings for the car towards the end of October 2021 at a token amount of 1 la… [+1537 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Ashwin Ram N P", "title": "Mahindra XUV700 Dec 2021 Buyers Get May 2023 Delivery Date - RushLane", "description": "Mahindra XUV700 buyers in the month of Dec 2021, are getting a delivery date that is in May 2023 - making it longest waiting period.", "url": "https://www.rushlane.com/mahindra-xuv700-dec-2021-buyers-get-march-2023-delivery-date-12420079.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/12/mahindra-xuv700-waiting-2023-delivery-1.jpg", "publishedAt": "2021-12-11T04:29:34Z", "content": "Image – The Rajat Vlogs\r\nMahindra XUV700 was launched earlier this year on 14th Aug, when prices of select variants were revealed. Bookings opened on 7th Oct. Within 3 hours of bookings window being … [+3036 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Tega Industries IPO GMP Today: What High GMP Indicates About Listing Gains - News18", "description": "Tega Industries IPO: Tega Industries stock listing will be done on December 13, Monday. The Tega Industries IPO GNP was trading at Rs 350 on Saturday", "url": "https://www.news18.com/news/business/markets/tega-industries-ipo-gmp-today-what-high-gmp-indicates-about-listing-gains-4542947.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/ipo-jpg-163919641516x9.jpg", "publishedAt": "2021-12-11T04:21:17Z", "content": "Tega Industries IPO: The shares of Tega Industries Limited are likely to list at the stock markets on Monday, December 13, days after the company floated its maiden initial public offering or IPO. Th… [+3440 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Market gains nearly 2% on supportive RBI policy; ignores new virus concern - Moneycontrol.com", "description": "The BSE Small-cap index rose 3 percent with over 100 stocks gave double digit return.", "url": "https://www.moneycontrol.com/news/photos/business/markets/market-gains-nearly-2-on-supportive-rbi-policy-ignores-new-virus-concern-7813921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/09/bse_nse_stockmarket_nifty_sensex1-770x433.jpg", "publishedAt": "2021-12-11T04:13:23Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "MG Motor India to Commence Exports From Halol Plant to South Asian Countries - News18", "description": "MG Motor India will begin with exporting MG Hector to Nepal as the first step towards its expansion plan for other South Asian countries.", "url": "https://www.news18.com/news/auto/mg-motor-india-to-begin-exports-to-south-asian-countries-4542914.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/07/1627390263_mg-astor-163168588716x9.png", "publishedAt": "2021-12-11T04:00:00Z", "content": "Automaker MG Motor India said that it will commence exports from its manufacturing facility in Gujarat’s Halol. The company will begin with exporting MG Hector to Nepal as the first step towards its … [+1106 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "SBI internet banking services will remain down for 5 hrs today. Details here - Mint", "description": "SBI bank customers won't be able to use YONO, YONO Lite, UPI, internet banking today", "url": "https://www.livemint.com/industry/banking/sbi-state-bank-of-india-internet-banking-services-yono-yono-lite-upi-yono-business-inb-will-remain-down-for-5-hrs-today-details-here-11639192360632.html", "urlToImage": "https://images.livemint.com/img/2021/12/11/600x338/INDIA-SBI-HOME-LOAN-1_1639193283348_1639193311087.JPG", "publishedAt": "2021-12-11T03:32:13Z", "content": "The State Bank of India (SBI) has said that its internet banking services will remain down on Saturday and Sunday (December 11 and December 12). The online banking services will remain unavailable fo… [+212 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "8 Upcoming compact SUVs of 2022: Creta Facelift to All-new Brezza - CarToq.com", "description": "The sales of SUVs are increasing consistently. Every manufacturer now has a SUV of some kind in their line-up. If they do not have one then they are working rigorously to develop one. Today, we list down 8 upcoming SUVs that will launch in 2022. Hyundai Creta…", "url": "https://www.cartoq.com/8-upcoming-compact-suvs-of-2022-creta-facelift-to-all-new-brezza/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/12/upcoming-compact-suvs-2022.jpg", "publishedAt": "2021-12-11T03:29:19Z", "content": "The sales of SUVs are increasing consistently. Every manufacturer now has a SUV of some kind in their line-up. If they do not have one then they are working rigorously to develop one. Today, we list … [+3600 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "Amazon Prime membership is set to cost more after December 13: New prices and all that users need to know - Gadgets Now", "description": "Amazon Prime membership is set to cost more starting December 14. Prime membership in India will cost 50% more after December 13. Amazon announced increase in Prime membership fees in October this year during the company's annual Diwali sale -- Amazon Great I…", "url": "https://www.gadgetsnow.com/slideshows/amazon-prime-membership-is-set-to-cost-more-after-december-13-new-prices-and-all-that-users-need-to-know/photolist/88218063.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88218076,width-800,resizemode-4,imgsize-19188/share.jpg", "publishedAt": "2021-12-11T03:20:00Z", "content": "Yes, Amazon is running an offer that allows users to join/renew Prime membership at Rs 999. They can lock in the old price (Rs 999) as part of a this offer. \"We recommend that you renew or buy Prime … [+183 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Nexon, Punch to cost more from January as Tata Motors announces price hike - HT Auto", "description": "Tata Motors said that the price hike has become inevitable due to rise in commodities, raw material, and other input costs.\nEarlier, Tata Motors had announced price hike for its commercial vehicles as well.", "url": "https://auto.hindustantimes.com/auto/cars/nexon-punch-to-cost-more-from-january-as-tata-motors-announces-price-hike-41639191843624.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/12/11/600x338/1_1620465949774_1639191989374.jpg", "publishedAt": "2021-12-11T03:19:27Z", "content": "Tata Motors has announced that prices of all its passenger vehicles available in the market will see a hike from next month. Though the carmaker has not specified the range of the price hike, it said… [+1726 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Jio Makes a Big Statement Related to 5G - TelecomTalk", "description": "For the first time, with 5G, even before the networks are launched, India will be ready with an ecosystem of devices and multiple use-cases.", "url": "https://telecomtalk.info/jio-makes-a-big-statement-related-5g/484765/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2021/12/jio-makes-a-big-statement-related-5g.jpeg", "publishedAt": "2021-12-11T03:17:11Z", "content": "Reliance Jio, Indias number of telecom operators in terms of subscriber market share, has made a big statement related to 5G. The telco has said that before the 5G networks are even rolled out in the… [+1594 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Medplus Health IPO opens on December 13: 10 key things to know before subscribing to the public issue - Moneycontrol.com", "description": "Medplus IPO | The public issue consists of fresh issuance of shares worth Rs 600 crore and an offer for sale of shares worth Rs 798.29 crore by selling shareholders to mop up a total of Rs 1,398.29 crore", "url": "https://www.moneycontrol.com/news/business/ipo/medplus-health-ipo-opens-on-december-13-10-key-things-to-know-before-subscribing-to-the-public-issue-7812631.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/IPO_shutterstock_590961668-770x433.jpg", "publishedAt": "2021-12-11T03:10:14Z", "content": "Incorporated on November 30, 2006, Medplus Health Services Ltd is the second-largest pharmacy retailer in India, in terms of revenue from operations for the financial year 2021 and the number of stor… [+6047 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Petrol, Diesel Price Today: Petrol Price Below Rs 100 in Many Cities; See Fuel Rates - News18", "description": "Petrol, diesel price today, December 11, 2021: Petrol price unchanged across the country for over a month, while diesel price also remains the same.", "url": "https://www.news18.com/news/business/petrol-diesel-price-today-petrol-price-below-rs-100-in-many-cities-see-fuel-rates-4542845.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/petrol-1-163599848716x9.jpg", "publishedAt": "2021-12-11T03:10:00Z", "content": "Petrol, Diesel Price Today: Petrol price on Saturday, December 11, remained static across the country while diesel price today also remained unchanged in India. The fuel rates have been constant for … [+3232 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Pearl Daniels", "title": "Tata Sales Breakup Nov 2021 - Nexon, Punch, Tiago, Altroz, Harrier, Safari - RushLane", "description": "Nexon maintained its lead as the best selling car from Tata Motors. In Nov 2021, Altroz registered a huge decline. Here are details.", "url": "https://www.rushlane.com/tata-sales-breakup-nov-2021-nexon-punch-tiago-12420042.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/12/tata-car-sales-breakup-nov-2021-harrier.jpeg", "publishedAt": "2021-12-11T02:15:15Z", "content": "Image – Vishnu\r\nIn November 2021, Tata Motors received outstanding response to its two electric vehicles Nexon EV and Tigor EV indicating increased preference to a shift to greener and cleaner altern… [+2691 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shilpa Phadnis", "title": "Zomato's funding of Shiprocket generates controversy - Times of India", "description": "India Business News: BENGALURU: E-commerce logistics company Shiprocket on Friday announced a $185 million funding round co-led by Zomato, Temasek and Lightrock India.", "url": "https://timesofindia.indiatimes.com/business/india-business/zomatos-funding-of-logistics-co-shiprocket-sparks-row/articleshow/88216849.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88220279,width-1070,height-580,imgsize-150478,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-12-11T01:09:00Z", "content": "Zomato's funding of Shiprocket generates controversy"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "Mutual fund calculator: How much do you need to invest every month to accumulate Rs 5 crore by 45 - Times Now", "description": "As expenses do not increase in-line with the rise in income, one can invest an incremental amount every year to achieve his future financial goals.", "url": "https://www.timesnownews.com/business-economy/personal-finance/mutual-funds/article/mutual-fund-calculator-how-much-do-you-need-to-invest-every-month-to-accumulate-rs-5-crore-by/839531", "urlToImage": "https://imgk.timesnownews.com/story/investment_071220_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-12-11T00:41:58Z", "content": "New Delhi: Ajay Kumar Srivastav, 25, is a young IT professional from Bengaluru. Ajay is planning to quit his job and start his own venture at 45 for which he wants to accumulate Rs 5 crore. Ajay is c… [+1927 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "S&P 500 Hits Record, Shrugs Off Hottest Pace of Inflation Since 1982 - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/sp-500-hits-record-shrugs-off-hottest-pace-of-inflation-since-1982-2997957", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/1a1c6cfd370b69857e45d7bec7389f83_w_800_h_450.jpg", "publishedAt": "2021-12-10T21:34:57Z", "content": "By Yasin Ebrahim\r\nInvesting.com The S&amp;P 500 closed at a record Friday, shrugging off the the fastest pace of inflation in 39 years as investors continued to pile into tech stocks as U.S. Treasury… [+2540 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Tom Kool", "title": "Oil Prices Rise As Omicron Fears Fade - OilPrice.com", "description": "Oil markets are beginning to show signs of recovery following news that the demand impact of Omicron may not be as significant as originally thought.", "url": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Rise-As-Omicron-Fears-Fade.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-12-10_giylfvkywb.jpg", "publishedAt": "2021-12-10T20:00:00Z", "content": "OPEC+ succeeded this week in…\r\nThe benchmark natural gas prices…\r\nSaudi Aramco is selling 49…\r\nBy Tom Kool - Dec 10, 2021, 2:00 PM CSTOil markets are beginning to show signs of recovery following new… [+5740 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Peerzada Abrar", "title": "Byjus ropes in ex-Bain executive Rachna Bahadur to lead global expansion - Business Standard", "description": "Bahadur has over 15 years of experience; she led consumer product practice at Bain and co-led the 'Women @ Bain' India chapter which aims to create an inclusive, gender non-conforming environment", "url": "https://www.business-standard.com/article/companies/byju-s-ropes-in-ex-bain-executive-rachna-bahadur-to-lead-global-expansion-121121000756_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/10/full/1639131316-1753.jpg", "publishedAt": "2021-12-10T18:45:00Z", "content": "Byju’s has appointed Rachna Bahadur as the senior vice president to lead the global expansion plans of the world’s most valuable edtech firm. In her new role, Bahadur will lead the overall planning, … [+4617 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chiranjivi Chakraborty", "title": "D-Street may turn indecisive next week as Fed takes center stage - Economic Times", "description": "The US central bank is widely expected to announce that it will accelerate the timing of its tapering of the bond-buying program launched last year after data showed that consumer price inflation in the US was at 6.8 per cent in November.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-may-be-indecisive-next-week-as-fed-takes-center-stage/articleshow/88212755.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88212745,width-1070,height-580,imgsize-612232,overlay-etmarkets/photo.jpg", "publishedAt": "2021-12-10T16:12:00Z", "content": "MUMBAI: Equity investors are likely to remain indecisive over the direction of the stock market next week as they will await the outcome of the US Federal Reserves monetary policy meeting on Wednesda… [+2555 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Covid-19: World rushes to boost against Omicron, but questions remain - Times of India", "description": "Rest of World News: The arrival of the Omicron variant has triggered a global rush for booster shots, as scientists and governments see a third dose as the most expedient.", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/covid-19-world-rushes-to-boost-against-omicron-but-questions-remain/articleshow/88212255.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88212295,width-1070,height-580,imgsize-22216,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-12-10T15:31:00Z", "content": "Covid-19: World rushes to boost against Omicron, but questions remain"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "Rakesh Jhunjhunwala's Rs 1,287 crore investment in Star Health grows to Rs 7,516 crore - Times Now", "description": "Shares of Star Health ended in the positive territory on Friday after listing at nearly 6% discount to its issue price of Rs 900 per share.", "url": "https://www.timesnownews.com/business-economy/companies/article/rakesh-jhunjhunwalas-rs-1287-crore-investment-in-star-health-grows-to-rs-7516-crore/839495", "urlToImage": "https://imgk.timesnownews.com/story/1566804113-Rakesh_Jhunjhunwala.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-12-10T13:56:12Z", "content": "<ul><li>Rakesh Jhunjhunwala held 14.98% stake or 82,882,958 shares in the company according to the RHP filed by the country's largest health insurer. </li></ul>\r\n<ul><li>Rakesh Jhunjhunwala's wife Re… [+2184 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Timsy Jaipuria", "title": "Traders' body approaches SEBI against PharmEasy IPO plans - CNBCTV18", "description": "In a written representation, the traders' body has urged the market regulator to not allow the e-pharmacy company to go public. CAIT cited a 2018 Delhi High Court order prohibiting the sale of medicines online, and also pointed out alleged irregularities in t…", "url": "https://www.cnbctv18.com/market/traders-body-approaches-sebi-against-pharmeasy-ipo-plans-11776232.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/04/PharmEasy-1019x573.jpg", "publishedAt": "2021-12-10T13:10:00Z", "content": "MiniIn a written representation, the traders' body has urged the market regulator to not allow the e-pharmacy company to go public. CAIT cited a 2018 Delhi High Court order prohibiting the sale of me… [+166 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Viswanath Pilla", "title": "Lupin forays into diagnostics, to open 100 labs pan India in next 3 years - Economic Times", "description": "The company launched operations with 11 labs including a 45,000 square feet national reference lab in Navi Mumbai and 200 collection centres in West and East India. The drug maker said it plans to open over 100 labs across and 1000 collection centres across I…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/lupin-forays-into-diagnostics-to-open-100-labs-pan-india-in-next-3-years/articleshow/88207424.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88209869,width-1070,height-580,imgsize-72706,overlay-economictimes/photo.jpg", "publishedAt": "2021-12-10T12:58:00Z", "content": "Drug maker on Friday announced the launch of its diagnostics business in India as part of diversification.\r\nThe company launched operations with 11 labs including a 45,000 square feet national refere… [+2482 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "National Semiconductor Policy: Govt plans Rs 76k crore sops for semiconductor design, components manufacturing - Times Now", "description": "The government is reportedly planning to provide incentives worth Rs 76,000 crore towards setting up over 20 semiconductor design, components manufacturing and display fabrication (fab) units over the next six years.", "url": "https://www.timesnownews.com/business-economy/industry/article/national-semiconductor-policy-govt-plans-rs-76k-crore-sops-for-semiconductor-design-components-manufacturing/839484", "urlToImage": "https://imgk.timesnownews.com/story/Semiconductor_car_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-12-10T12:39:42Z", "content": "New Delhi: In a bid to make India an electronics hub, the government is reportedly planning to provide incentives worth Rs 76,000 crore towards setting up over 20 semiconductor design, components man… [+2613 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Growth cycle not durable, will peak in first-half of 2022: Nomura - Economic Times", "description": "Higher inflation and wider current account deficit, which are the side effects of the loose policies adopted to push growth during the pandemic, will come into play, forcing the RBI to act even as the  scarring effects cast doubt on growth's durability , Nomu…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/growth-cycle-not-durable-will-peak-in-first-half-of-2022-nomura/articleshow/88208810.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88208805,width-1070,height-580,imgsize-153496,overlay-economictimes/photo.jpg", "publishedAt": "2021-12-10T12:07:00Z", "content": "The current growth cycle being witnessed in the country is not durable and will peak by the first half of 2022, a Japanese brokerage said on Friday.\r\nHigher inflation and wider current account defici… [+1735 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Elon Musk, boss of Tesla, SpaceX (and king of Twitter on some days!), wants to quit his job and become an - Economic Times", "description": "Musk's fans on Twitter asked him if they can switch places with him, the world's richest man.", "url": "https://economictimes.indiatimes.com/magazines/panache/elon-musk-boss-of-tesla-spacex-wants-to-quit-his-job-and-become-an-influencer/articleshow/88206583.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88206928,width-1070,height-580,imgsize-10016,overlay-etpanache/photo.jpg", "publishedAt": "2021-12-10T10:46:00Z", "content": "Tesla Inc Chief Executive Officer Elon Musk's new announcement might not go down with social media influencers as the billionaire wants to join the game of \"influencing\".\r\nOn Thursday, one of the wor… [+2675 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Stock of this construction company has zoomed 88% in 14 trading sessions - Business Standard", "description": "On November 15, 2021, HCC had announced that the company in consortium with KEC International Limited (KEC), has been awarded Rs 1,309 crore contract by Chennai Metro Rail Limited", "url": "https://www.business-standard.com/article/markets/stock-of-this-construction-company-has-zoomed-88-in-14-trading-sessions-121121000653_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2015-04/08/full/1428479674-1896.jpg", "publishedAt": "2021-12-10T09:19:00Z", "content": "Shares of Hindustan Construction Company (HCC) hit an over three-year high of Rs 17.82, up 14 per cent on the BSE in Friday’s intra-day trade. The stock of construction &amp; engineering company was … [+2939 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Buy Zee Entertainment; target of Rs 428: Edelweiss Securities - Moneycontrol.com", "description": "Edelweiss Securities is bullish on Zee Entertainment has recommended buy rating on the stock with a target price of Rs 428 in its research report dated December 09, 2021.", "url": "https://www.moneycontrol.com/news/business/stocks/buy-zee-entertainment-target-of-rs-428-edelweiss-securities-7811861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_1-770x433.jpg", "publishedAt": "2021-12-10T09:03:13Z", "content": "Edelweiss Securities' report on Zee Entertainment\r\nWe attended LTI's Analyst Day in which management presentations and commentary reconfirmed the confidence in revenue growth sustainability, led by c… [+1183 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "MapmyIndia IPO: Latest GMP, subscription status on second day of issue - Mint", "description": "MapmyIndia IPO: The issue with a price band of  ₹1,000-1,033 a share, opened for public subscription today", "url": "https://www.livemint.com/market/ipo/mapmyindia-ipo-gmp-subscription-status-should-you-subscribe-11639011466602.html", "urlToImage": "https://images.livemint.com/img/2021/12/09/600x338/mapmyindia_ipo_gmp_1639011656186_1639011656378.jpg", "publishedAt": "2021-12-10T08:00:00Z", "content": "MapmyIndia's initial public offering (IPO) with a price band of 1,000-1,033 a share, has opened for public subscription today and the three-day issue will close on December 13. The digital mapping co… [+2303 chars]"}]}