{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Danny Cyril D Cruze", "title": "Tata Punch micro SUV launch: With just one day to go, Tata Motors reveals new feature. Watch video - Mint", "description": "One day ahead of the launch, the company revealed a new teaser for the vehicle which hints at yet another feature that might be a segment-first", "url": "https://www.livemint.com/auto-news/tata-punch-launch-micro-suv-with-just-one-day-to-go-tata-motors-reveals-new-feature-watch-video-11633238168040.html", "urlToImage": "https://images.livemint.com/img/2021/10/03/600x338/tata-punch_1632291984728_1633240157729.jpg", "publishedAt": "2021-10-03T06:05:13Z", "content": "Tata Motors will be launching its new offering Punch in the micro SUV segment. The new SUV will be launched at an event scheduled for 11 am. Interested viewers can view the event via the company the … [+1473 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "What is the hype of Solana, one of Ethereum's major rivals, all about? - Analytics Insight", "description": "One cryptocurrency that is doing rounds these days is Solana. It is one of those cryptocurrencies that performed well despite the market crash. This article will throw light on Solana, one of the Ethereum's major rivals", "url": "https://www.analyticsinsight.net/what-is-the-hype-of-solana-one-of-the-ethereums-major-rivals-all-about/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2021/10/Salona.png", "publishedAt": "2021-10-03T04:35:35Z", "content": "No wonder the cryptocurrency market has managed to seek attention from every corner of the world. Not just Bitcoin and Ethereum, but a list of cryptocurrencies have grabbed eyeballs from everywhere a… [+2790 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mahindra Thar Hulk custom-built by DC2 is an eye-popper - CarToq.com", "description": "DC Design, which is now called DC2 is a well-known brand when it comes to the modification world. DC2 has released a modification project based on the all-new Mahindra Thar. It is called the Thar Hulk and looks very different and unique. DC2 has released a vi…", "url": "https://www.cartoq.com/mahindra-thar-hulk-by-dc2/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/10/mahindra-thar-hulk-dc2-design-featured-1.jpg", "publishedAt": "2021-10-03T03:26:46Z", "content": "DC Design, which is now called DC2 is a well-known brand when it comes to the modification world. DC2 has released a modification project based on the all-new Mahindra Thar. It is called the Thar Hul… [+2296 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Petrol, diesel prices today hiked for fourth consecutive day. Check latest rates - Mint", "description": "The fourth consecutive daily increase in its rates has sent petrol prices above  ₹100 in most major cities of the country", "url": "https://www.livemint.com/industry/energy/petrol-diesel-prices-today-hiked-for-fourth-consecutive-day-check-latest-rates-11633225417649.html", "urlToImage": "https://images.livemint.com/img/2021/10/03/600x338/1ca465ea-0736-11ec-89fd-c0c117172485_1633225731319_1633225755481.jpg", "publishedAt": "2021-10-03T02:05:10Z", "content": "Petrol and diesel prices soared to new record highs across the country on Sunday after rates were hiked again by 25 paise and 30 paise a litre, respectively.\r\nThe price of petrol in Delhi rose to its… [+1989 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sreeradha Basu, Rica Bhattacharyya", "title": "With everyone working from home, companies struggle to curb employees' moonlighting - Economic Times", "description": "The ongoing pandemic and resultant WFH being implemented as a long-term plan by organisations have led to several instances of employees breaching exclusivity and indulging in activities deemed as dual employment. These issues are more prominently observed in…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/with-everyone-working-from-home-companies-struggle-to-curb-employees-moonlighting/articleshow/86720645.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86720738,width-1070,height-580/photo.jpg", "publishedAt": "2021-10-03T01:36:00Z", "content": "SynopsisThe ongoing pandemic and resultant WFH being implemented as a long-term plan by organisations have led to several instances of employees breaching exclusivity and indulging in activities deem… [+98 chars]"}, {"source": {"id": null, "name": "Gulte"}, "author": "Nirupama", "title": "Back To Normalcy: Wipro, TCS, And Other IT Firms To End WFH Soon - Gulte", "description": "As the coronavirus cases are declining and vaccination pace is picking up, it is to be understood that pandemic is now transiting to endemic. Also, the economy, corporations are jumping back to normalcy and are getting back on track. It is time for many compa…", "url": "https://www.gulte.com/trends/123639/back-to-normalcy-wipro-tcs-and-other-it-firms-to-end-wfh-soon", "urlToImage": "https://cdn.gulte.com/wp-content/uploads/2021/10/Work-from-home-660x330.jpg", "publishedAt": "2021-10-03T01:33:07Z", "content": "As the coronavirus cases are declining and vaccination pace is picking up, it is to be understood that pandemic is now transiting to endemic. Also, the economy, corporations are jumping back to norma… [+1561 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Abhishek Vishnoi, Bre Bradham and Thyagaraju Adinarayan | Bloomberg", "title": "Taking stock: As global energy intensifies, some companies are winning - Business Standard", "description": "While rising power prices hurt all users, it is particularly acute for energy-intensive materials and metal companies.", "url": "https://www.business-standard.com/article/international/a-stock-trader-s-guide-to-navigating-the-global-energy-crisis-121100300063_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/31/full/1622404268-5219.jpg", "publishedAt": "2021-10-03T01:17:00Z", "content": "The global energy crisis is intensifying, hammering the shares of companies that consume a lot of power and sending the stocks of those that produce it soaring.\r\nEconomic recovery from the pandemic h… [+6134 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Julia Fields", "title": "Cryptocurrency price news – Vietnam sees rapid growth in crypto usage sparking surge as Shiba Inu price j... - The Sun", "description": "- Why is the cryptocurrency market down today?- Shiba Inu price prediction 2021: Can the cryptocurrency hit $1?- Ethereum price prediction 2021: Can the cr", "url": "https://www.the-sun.com/money/3750645/cryptocurrency-new-shiba-inu-coin-invest-2021/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2021/09/lv-comp-crypto-blog-sept-28-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-10-03T01:06:30Z", "content": "VIETNAM is experiencing a growth in cryptocurrency use despite the International Monetary Fund warning its adoption in emerging markets could threaten stability. \r\nIt comes as Shiba Inu experienced a… [+11218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Australia red-flags draft e-commerce rules: will raise trade barriers - The Indian Express", "description": "The draft rules published on June 28 seek to tighten the regulation on online marketplaces. The Consumer Affairs Department had given time till July 21 for various stakeholders to submit their comments.", "url": "https://indianexpress.com/article/india/australia-e-commerce-rules-trade-barriers-tax-exports-7548602/", "urlToImage": "https://images.indianexpress.com/2021/09/Modi-Morrison.jpg", "publishedAt": "2021-10-02T22:41:47Z", "content": "BESIDES triggering a strong pushback internally, the draft e-commerce rules of the governments Department of Consumer Affairs have drawn flak from at least one sovereign government Australia and mult… [+5575 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "SEC Wants Ripple to Provide Recordings of Discussions Related to Current Legal Disputes - U.Today", "description": "Prominent corporate lawyer has shared more news on the current legal war between the US SEC and Ripple Labs", "url": "https://u.today/sec-wants-ripple-to-provide-recordings-of-discussions-related-to-current-legal-disputes", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2021-10/9890.jpg", "publishedAt": "2021-10-02T16:03:04Z", "content": "Attorney James Filan, founder of Filan LLC based in Connecticut, has taken to Twitter to announce that the US Security and Exchange Commission has requested a conference and an order to make Ripple s… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Experts laud Merck's Covid-19 drug molnupiravir. All you need to know - Hindustan Times", "description": "Molnupiravir is designed to introduce errors into the genetic code of the virus and would be the first oral antiviral medication for Covid-19 | World News", "url": "https://www.hindustantimes.com/world-news/experts-laud-merck-s-covid-19-drug-molnupiravir-all-you-need-to-know-101633185913633.html", "urlToImage": "https://images.hindustantimes.com/img/2021/10/02/1600x900/MODERNA-STOCKS--0_1633185969856_1633185987064.JPG", "publishedAt": "2021-10-02T14:47:44Z", "content": "Merck &amp; Cos molnupiravir, the Covid-19 pill, claims to help nations which are struggling to vaccinate their citizens. According to an analysis based on a late-stage trial conducted by Merck and p… [+1840 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Adam Conway", "title": "Google shuts down its Plex banking service before it even launches - XDA Developers", "description": "Google has scrapped Plex before it even reached consumers, blindsiding some banks in the process. Read more about it here!", "url": "https://www.xda-developers.com/google-scraps-plex/", "urlToImage": "https://www.xda-developers.com/files/2021/06/Google-Pay-XDA-Feature-Image.jpg", "publishedAt": "2021-10-02T13:42:00Z", "content": "Google has walked away from Plex, its program that aimed to pitch bank accounts to users of Google Pay. Announced two years ago, the idea of the service was that users of Google Pay could sign up for… [+2189 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "India hikes domestic natural gas prices, here's why - CNBCTV18", "description": "Gas prices have risen globally to multi-year highs as the market first reeled from the impact of the pandemic and now can't keep up with the rising global demand. While this is a normal trend for commodities, natural gas supplies are the worst hit. In India, …", "url": "https://www.cnbctv18.com/energy/india-hikes-domestic-natural-gas-prices-heres-why-10961982.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/07/methanegas-1019x573.jpg", "publishedAt": "2021-10-02T12:58:33Z", "content": "MiniGas prices have risen globally to multi-year highs as the market first reeled from the impact of the pandemic and now can't keep up with the rising global demand. While this is a normal trend for… [+200 chars]"}, {"source": {"id": null, "name": "BeInCrypto"}, "author": null, "title": "FTX marketplace to support famous Solana NFT projects - BeInCrypto", "description": "Leading crypto derivatives exchange FTX tweets about plans to support famous Solana NFT projects, such as Degen Ape Academy, Aurory, Thugbirdz, and Solana Monkey Business.", "url": "https://beincrypto.com/ftx-marketplace-to-support-famous-solana-nft-projects/", "urlToImage": "https://s32659.pcdn.co/wp-content/uploads/2021/08/BIC_FTX_crypto.jpg", "publishedAt": "2021-10-02T11:26:00Z", "content": "Leading crypto derivatives exchange FTX tweets about plans to support famous Solana NFT projects, such as Degen Ape Academy, Aurory, Thugbirdz, and Solana Monkey Business.\r\nFTX recently announced via… [+2505 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Evergrande may survive, but for its executives, expect a fate worse than debt - CNBCTV18", "description": "China may or may not bail Evergrande. But it has a third option: bail out the company but punish its top brass with serious personal sanctions.", "url": "https://www.cnbctv18.com/world/evergrande-may-survive-but-for-its-executives-expect-a-fate-worse-than-debt-10971672.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/09/Evergrande-China-1019x573.jpg", "publishedAt": "2021-10-02T11:21:18Z", "content": "MiniChina may or may not bail Evergrande. But it has a third option: bail out the company but punish its top brass with serious personal sanctions."}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Zee moves Bombay High Court against Invesco, wants EGM demand declared illegal - Moneycontrol.com", "description": "The move comes a day after the company's board rejected Invesco and OFI Global China Fund LLC 's demand for EGM, saying it 'suffered from multiple legal infirmities'", "url": "https://www.moneycontrol.com/news/business/companies/zee-moves-bombay-high-court-against-invesco-wants-egm-demand-declared-illegal-7535121.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/09/Zee-Entertainment-770x433.jpg", "publishedAt": "2021-10-02T10:50:15Z", "content": "Zee Entertainment Enterprise Limited on October 2 moved the Bombay High Court against its biggest shareholders Invesco and OFI Global China Fund, saying their demand to call an extraordinary general … [+3171 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Srei Group Crisis | Banks favour RBI-led DHFL-like resolution - Moneycontrol", "description": "Some banks also favour SREI board dissolution and appointment of RBI administrator. However, RBI's decision on the Srei Group resolution matter is awaited. In FY 2020, RBI audit flagged Rs 8,576 crore of probable related -party lending by Srei group.", "url": "https://www.moneycontrol.com/news/business/srei-group-crisis-banks-favour-rbi-led-dhfl-like-resolution-7535331.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/shutterstock_517844728-1-770x433.jpg", "publishedAt": "2021-10-02T10:44:35Z", "content": "Days after banks adjusted Rs 3,000 crore from the the trust and retention account (TRA) against dues in the last 10 months, reports arrived that the banks have favoured Reserve Bank of India-led DHFL… [+2886 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "IMF cautions against cryptocurrencies, here's why - CNBCTV18", "description": "Cryptocurrencies and related assets offer a new world of opportunities: Quick and easy payments, innovative financial services, inclusive access to previously unbanked parts of the world. But along with the opportunities come challenges and risks, IMF said.", "url": "https://www.cnbctv18.com/cryptocurrency/imf-cautions-against-cryptocurrencies-heres-why-10973002.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/09/Bitcoin-1019x573.jpg", "publishedAt": "2021-10-02T10:44:25Z", "content": "MiniCryptocurrencies and related assets offer a new world of opportunities: Quick and easy payments, innovative financial services, inclusive access to previously unbanked parts of the world. But alo… [+61 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Prashant Jha", "title": "Huobi China Exit Plan: Here’s When the Crypto Exchange Would Shut its Door - Coingape", "description": "Huobi, one of the largest crypto exchanges serving Chinese customers has decided to shut its door on mainland China customers after the recent crackdown guidelines from the People's Bank of China. The latest crypto ban guidelines prohibit foreign crypto excha…", "url": "https://coingape.com", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2020/12/22200828/HUOBI-APP.jpg", "publishedAt": "2021-10-02T10:24:28Z", "content": "Huobi, one of the largest crypto exchanges serving Chinese customers has decided to shut its door on mainland China customers after the recent crackdown guidelines from the People’s Bank of China. Th… [+2017 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "11 year-old Maruti WagonR beautifully restored - CarToq.com", "description": "Maruti Suzuki is India’s largest car manufacturer in the country and is a household name. They have several models in their line up. One of the model that has been present in the market for over two decades and is still going strong is WagonR. It is considere…", "url": "https://www.cartoq.com/11-year-old-maruti-wagonr-beautifully-restored/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/10/WagonR-restored-featured.jpg", "publishedAt": "2021-10-02T09:03:33Z", "content": "Maruti Suzuki is India’s largest car manufacturer in the country and is a household name. They have several models in their line up. One of the model that has been present in the market for over two … [+3013 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Aditya Birla AMC IPO: What GMP signals after closure of subscription - Mint", "description": "Aditya Birla AMC IPO GMP today is  ₹20 — which is  ₹4 higher from its yesterday's GMP of  ₹16, say market observers", "url": "https://www.livemint.com/market/ipo/aditya-birla-amc-ipo-what-gmp-signals-after-closure-of-subscription-11633164993483.html", "urlToImage": "https://images.livemint.com/img/2021/10/02/600x338/IPO_Reuters_1628584540315_1633165059299.PNG", "publishedAt": "2021-10-02T09:01:51Z", "content": "Aditya Birla AMC IPO: Bidding for Aditya Birla Sun Life AMC IPO (initial public offering) closed yesterday and 2,768.26 crore worth public issue got subscribed 5.25 times of its offer. The public off… [+2522 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": null, "title": "Rivian, electric vehicle startup, unveils large losses in IPO filing - Moneycontrol", "description": "Rivian is considered to be better run and have better prospects than some of the electric vehicle companies that have already started trading on the public market.", "url": "https://www.nytimes.com/2021/10/01/business/rivian-ipo.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Rivian-770x433.jpg", "publishedAt": "2021-10-02T08:21:55Z", "content": "Rivian, an electric truck maker backed by Amazon and Ford Motor, pulled back the curtain on its operations Friday as it headed into one of the most anticipated initial public offerings of the year.\r\n… [+4673 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Indian firms buy 2 million tons of Australian coal sitting in Chinese warehouses - Moneycontrol", "description": "The buyers include cement-makers and sponge iron plants that are using the fuel to compensate for the domestic shortages", "url": "https://www.moneycontrol.com/news/india/indian-firms-buy-2-million-tons-of-australian-coal-sitting-in-chinese-warehouses-7534291.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/09/captive-coal-770x433.jpg", "publishedAt": "2021-10-02T08:04:13Z", "content": "Faced with an acute shortage, Indian companies have reportedly purchased nearly 2 million tons of Australian thermal coal and continue to buy more fuel that is lying in Chinese warehouses for months … [+1750 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Nabanita Singha Roy", "title": "Honda Scooter, Motorcycle Sales Sep 2021 - Activa, CB Shine, Dio, Grazia - RushLane", "description": "Honda 2Wheelers ends Q3 2021 with September sales improved from the month prior. Total Sep '21 sales are reported at just below 5L units.", "url": "https://www.rushlane.com/honda-scooter-motorcycle-sales-sep-2021-activa-cb-shine-12413997.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/10/honda-activa-sales-sep-2021.jpeg", "publishedAt": "2021-10-02T07:53:15Z", "content": "Honda Activa\r\nWith Hero MotoCorp and Honda 2Wheelers competing at the top league in the domestic two wheeler market, September 2021 would have brought cheer to the latter. Sales look up. In a MoM com… [+2654 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Oyo Rooms IPO: Key risks to watch out for - CNBCTV18", "description": "Oyo Rooms IPO: From COVID-19, competitive environment, losses each year to the legal battle with Zostel, here's a look at key risks listed by hospitality firm OYO in its DRHP filed with SEBI to float an IPO.", "url": "https://www.cnbctv18.com/market/oyo-rooms-ipo-key-risks-to-watch-out-for-10971262.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/02/OYO1.jpeg", "publishedAt": "2021-10-02T07:39:38Z", "content": "MiniOyo Rooms IPO: From COVID-19, competitive environment, losses each year to the legal battle with Zostel, here's a look at key risks listed by hospitality firm OYO in its DRHP filed with SEBI to f… [+11 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Mahindra XUV700, MG Astor and more: Upcoming car launches in the Indian market - Moneycontrol.com", "description": "A list of the most prominent car launches and their details, including price.", "url": "https://www.moneycontrol.com/news/technology/auto/mahindra-xuv700-mg-astor-and-more-upcoming-car-launches-in-the-indian-market-7534761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/mahindra_xuv700-770x433.jpg", "publishedAt": "2021-10-02T07:34:11Z", "content": "In case you havent noticed, the Indian automotive industry is on the up and up. It managed to pull through the worst of the COVID-induced mayhem, adapted to the new normal and is now going full tilt.… [+5398 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Jikku Varghese Jacob", "title": "Air India back to founders, the Tatas - the pioneers of Indian civil aviation | Business News | Onmanorama - Onmanorama", "description": "The first aviator from India, JRD Tata, gave shape to Indian aviation, and now after 68 years, the Tata Group can't be more proud when the national carrier, Air India, is likely to return to its hangar.", "url": "https://www.onmanorama.com/news/business/2021/10/02/air-india-tatas-pioneers-civil-aviation.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/news/business/images/2021/10/2/jrd-tata.jpg", "publishedAt": "2021-10-02T07:12:20Z", "content": "New Delhi: An air trip a 15-year-old undertook in France led to the birth of Indian aviation.\r\nOverwhelmed by the flying experience, the boy, Jehangir Ratanji Dadabhoy Tata, popular later as JRD Tata… [+2245 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Coffee bean prices have doubled in the past year and may double again – what's going on? - CNBCTV18", "description": "The history of coffee has been characterised by extreme price volatility. Periods of excessive supplies have progressively driven down prices until a catastrophic event – either environmental or political – results in a correction.", "url": "https://www.cnbctv18.com/market/commodities/coffee-bean-prices-have-doubled-in-the-past-year-and-may-double-again-whats-going-on-10971682.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/12/coffee-1019x573.jpg", "publishedAt": "2021-10-02T07:02:23Z", "content": "MiniThe history of coffee has been characterised by extreme price volatility. Periods of excessive supplies have progressively driven down prices until a catastrophic event either environmental or po… [+31 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Market Share September 2021 – Maruti, Tata, Hyundai, Kia, Mahindra, MG - GaadiWaadi.com", "description": "Maruti Suzuki recorded a massive drop in its market share in September 2021, while Tata Motors registered a major gain", "url": "https://gaadiwaadi.com/market-share-september-2021-maruti-tata-hyundai-kia-mahindra-mg/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/03/Maruti-Suzuki-Vitara-Brezza-Vs-Tata-Nexon-e1584039240748.jpg", "publishedAt": "2021-10-02T07:00:50Z", "content": "The Indian auto industry had shown a strong sales recovery post lockdown, but ahead of the festive season, things seem to have gone slow. The Indian car market saw a major drop in sales overall, with… [+2776 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Gold price dips in September. Should you buy ahead of the festive season? - Mint", "description": "Gold price may continue to remain under pressure on strong US Dollar for few weeks, say commodity experts", "url": "https://www.livemint.com/money/personal-finance/gold-price-dips-in-september-should-you-buy-ahead-of-the-festive-season-11633157085960.html", "urlToImage": "https://images.livemint.com/img/2021/10/02/600x338/AFP_8ZC3N6_1616382936949_1633157201591.jpg", "publishedAt": "2021-10-02T06:51:10Z", "content": "Gold price on yesterday dipped 0.05 per cent on Multi Commodity Exchange (MCX). The December 2021 gold future contract on MCX closed at 46,500 per 10 gm, 21 below its Thursday close price. Yellow met… [+3743 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "El Salvador is mining bitcoin using energy from volcanos - Moneycontrol.com", "description": "Bitcoin mining has come under fire for the massive carbon footprint as most of this electricity used is derived from fossil fuels", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/el-salvador-is-mining-bitcoin-using-energy-from-volcanos-7534131.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/05/Bitcoin-770x433.jpg", "publishedAt": "2021-10-02T06:30:16Z", "content": "El Salvador President Nayib Bukele has announced that the central American country has achieved volcano-powered bitcoin mining.\r\nWere still testing and installing, but this is officially the first Bi… [+1741 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "This company has allowed 40,000 employees to work virtually for life - Mint", "description": "The policy is a departure from the accounting industry's rigid attitudes, known for encouraging people to put in late nights at the office", "url": "https://www.livemint.com/news/world/pwc-company-has-allowed-40-000-employees-to-work-virtually-for-life-11633154934182.html", "urlToImage": "https://images.livemint.com/img/2021/10/02/600x338/pwc-k5IC--621x414@LiveMint_1633155567187.jpg", "publishedAt": "2021-10-02T06:24:09Z", "content": "Accounting and consulting firm PwC told Reuters on Thursday it will allow all its 40,000 U.S. client services employees to work virtually and live anywhere they want in perpetuity, making it one of t… [+3585 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Saudis triumph in oil market with comeback from the coronavirus crisis - Economic Times", "description": "Eighteen months after slashing crude production during the pandemic, Riyadh is set to pump at almost pre-Covid levels of 9.8 million barrels a day this month as a recovering global economy clamours for energy supplies.", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/saudis-triumph-in-oil-market-with-comeback-from-the-coronavirus-crisis/articleshow/86701046.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86701030,width-1070,height-580,imgsize-36416,overlay-economictimes/photo.jpg", "publishedAt": "2021-10-02T05:42:00Z", "content": "When the OPEC+ alliance of oil producers gathers next week, group leader Saudi Arabia can savor a moment of triumph. \r\nEighteen months after slashing crude production during the pandemic, Riyadh is s… [+4105 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Rakesh Jhunjhunwala Portfolio: Ace Investor Earns Rs 145 Cr in a Month from this Stock - News18", "description": "Big Bull Rakesh Jhunjhunwala this month gained over 40 per cent from Hospitality stock Delta Corp which surged from Rs 181 per share levels to Rs 253.", "url": "https://www.news18.com/news/business/rakesh-jhunjhunwala-makes-a-killing-on-this-hospitality-stock-earns-rs-145-cr-in-a-month-4274177.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/07/1627464119_rakesh-jhunjhunwala-1-1600x900.jpg", "publishedAt": "2021-10-02T05:20:00Z", "content": "Big Bull Rakesh Jhunjhunwala this month gained over 40 per cent from Hospitality stock Delta Corp which surged from Rs 181 per share levels to Rs 253.60 apiece in September 2021 logging Rs 72.35 rise… [+3093 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Sensex tumbles 2% in worst week for IT gauge in 8 months; PSU banks jump - CNBCTV18", "description": "As Sensex and Nifty50 log weekly losses of two percent each, all eyes are now on the upcoming RBI policy review and the onset of the earnings season.", "url": "https://www.cnbctv18.com/market/stocks/sensex-tumbles-2-in-worst-week-for-it-gauge-in-8-months-psu-banks-jump-10969992.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/03/shutterstock_615088787-1019x573.jpg", "publishedAt": "2021-10-02T05:18:14Z", "content": "MiniAs Sensex and Nifty50 log weekly losses of two percent each, all eyes are now on the upcoming RBI policy review and the onset of the earnings season."}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "Ajay Relan, doyen of Indian private equity, no more - Mint", "description": "An alumni of IIM-Ahmedabad, 67-year-old Relan was serving as partner at homegrown private equity fund Xponentia Capital, which he co-founded in 2018.", "url": "https://www.livemint.com/news/india/ajay-relan-doyen-of-indian-private-equity-no-more-11633150573765.html", "urlToImage": "https://images.livemint.com/img/2021/10/02/600x338/ajay-relan-k0aH--621x414@LiveMint_1633151187315.jpg", "publishedAt": "2021-10-02T05:17:12Z", "content": "Ajay Relan, one of the pioneers of private equity investing in India, passed away late Friday. He was 67.\r\nAn alumni of IIM-Ahmedabad, Relan was serving as partner at homegrown private equity fund Xp… [+2881 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Elon Musk's Tesla enters African market with its first Superchargers - Economic Times", "description": "Over the years, CEO Elon Musk has often talked about Tesla launching in his native Africa, especially his home country of South Africa, but it has yet to happen. It doesn't mean that there are no Tesla vehicles in Africa.", "url": "https://economictimes.indiatimes.com/industry/renewables/elon-musks-tesla-enters-african-market-with-its-first-superchargers/articleshow/86700450.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86700502,width-1070,height-580,imgsize-65236,overlay-economictimes/photo.jpg", "publishedAt": "2021-10-02T05:04:00Z", "content": "Electric vehicle company Tesla has deployed its first two Supercharger stations in Morocco, marking its first entry in the African market.\r\nSupercharger stations are generally the first step toward T… [+1290 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Samie Modak", "title": "Sebi warns Baba Ramdev for making dubious claims ahead of Ruchi Soya FPO - Business Standard", "description": "In a viral video, Ramdev is seen asking his followers to buy shares of Ruchi Soya Industries if they want to become crorepatis", "url": "https://www.business-standard.com/article/markets/sebi-warns-baba-ramdev-for-making-dubious-claims-ahead-of-ruchi-soya-fpo-121100200208_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-08/17/full/1597633249-5479.jpg", "publishedAt": "2021-10-02T05:02:00Z", "content": "Yoga guru Baba Ramdev has got away with a mere rap from market regulator Securities and Exchange Board of India (Sebi) for making dubious investment promises.\r\nIn a viral video, Ramdev is seen asking… [+4709 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Zerodha Co-Founder Nitin Kamath's Net Worth Jumps to Rs 25,600 Crore in Last One Year - News18", "description": "Zerodha co-founder Nithin Kamath saw a massive jump in his net worth in last one year.", "url": "https://www.news18.com/news/business/zerodha-co-founder-nitin-kamaths-net-worth-jumps-to-rs-26000-crore-in-last-one-year-4269866.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/08/nithin-kamath-163032529116x9.jpg", "publishedAt": "2021-10-02T04:46:07Z", "content": "Zerodha co-founder Nithin Kamath saw a massive jump in his net worth in last one year. Kamath his family’s net worth rose a whopping 51 per cent to Rs 25,600 crore during last year, according to the … [+3818 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Himani Chandna", "title": "Merck’s Molnupiravir, Glenmark’s Nasal Spray, Zydus' Antibody Cocktail: 20+ Drugs in Pipeline for Covid - News18", "description": "Merck’s Molnupiravir, Zydus’ antibody cocktail and Glenmark’s nasal spray are among more than 20 new drugs in different stages of drug trials or approvals in India to treat Covid-19.", "url": "https://www.news18.com/news/india/mercks-molnupiravir-zydus-antibody-cocktail-glenmarks-nasal-spray-over-20-drugs-set-for-testing-against-covid-4273913.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/10/covid-drug-2-1-163314518716x9.jpg", "publishedAt": "2021-10-02T03:22:00Z", "content": "Mercks Molnupiravir, Zydus antibody cocktail and Glenmarks nasal spray are among more than 20 new drugs in different stages of drug trials or approvals in India to treat Covid-19. \r\nWhile the market … [+6999 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Ashwin Ram N P", "title": "Hero MotoCorp Sales Sep 2021 - Splendor, Passion, HF Deluxe, Destini, Pleasure - RushLane", "description": "Hero MotoCorp sales for Sep 2021 declined by 26% when compared with Sep 2020. But MoM, sales have grown by 17%.", "url": "https://www.rushlane.com/hero-motocorp-sales-sep-2021-splendor-passion-12413975.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/10/hero-splendor-sales-sep-2021.jpeg", "publishedAt": "2021-10-02T03:14:38Z", "content": "Image – Patna Bikes\r\nHero MotoCorp has registered a sales decline in Sep 2021 when compared YoY – But MoM, the company has posted an increase in sales\r\nWorld’s largest two wheeler manufacturer, Hero … [+2472 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Factory activity expands at faster pace in Sept - Times of India", "description": "India Business News: Stronger demand conditions and easing of Covid-19 curbs helped activity in the country’s factory sector to maintain its growth momentum and added to t", "url": "https://timesofindia.indiatimes.com/business/india-business/factory-activity-expands-at-faster-pace-in-sept/articleshow/86696693.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86696883,width-1070,height-580,imgsize-38600,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-10-01T22:25:00Z", "content": "Factory activity expands at faster pace in Sept"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Reliance Industries extends deadline to complete Future group deal - Business Standard", "description": "The deal has been contested by Amazon, an investor in Future Coupons, which in turn is a shareholder in Future Retail", "url": "https://www.business-standard.com/article/companies/reliance-industries-extends-deadline-to-complete-future-group-deal-121100200063_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-10/18/full/1571399124-2947.JPG", "publishedAt": "2021-10-01T20:36:00Z", "content": "Reliance Retail Ventures (RRVL), the retail arm of Reliance Industries, has for the second time extended the timeline for completing its Rs 24,713-crore deal with the Future group, to March 31, 2022,… [+2901 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Dev Chatterjee", "title": "Grasim Industries slapped with Rs 8,334-crore income tax demand - Business Standard", "description": "The Aditya Birla Group company said it would take \"appropriate action\" against the order", "url": "https://www.business-standard.com/article/companies/grasim-industries-slapped-with-rs-8-334-crore-income-tax-demand-121100200061_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-03/24/full/1616569960-3988.jpeg", "publishedAt": "2021-10-01T20:33:00Z", "content": "The Income-Tax (I-T) department has raised a demand of Rs 8,334 crore against Grasim Industries as capital gains tax in a transaction related to the demerger of its financial services business. The A… [+2577 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Subrata Panda", "title": "UPI records 3.65 bn transactions worth Rs 6.54 trillion in September - Business Standard", "description": "On a month-on-month (MoM) basis, UPI's volume of transactions was up 3 per cent, and the value of transactions was up 2.35 per cent", "url": "https://www.business-standard.com/article/finance/upi-records-3-65-bn-transactions-worth-rs-6-54-trillion-in-september-121100100590_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-02/26/full/1582656971-3606.png", "publishedAt": "2021-10-01T19:26:00Z", "content": "The National Payments Corporation of India’s (NPCI) flagship payment platform, Unified Payments Interface (UPI), logged 3.65 billion transactions worth Rs 6.5 trillion in September, an all-time high,… [+3761 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ketan Thakkar, Ashutosh R Shyam, ET Auto", "title": "Nitin Seth, former COO at Ashok Leyland to join Reliance Industries New Energy Biz - ETAuto.com", "description": "Seth was amongst the key architects in forming the EV arm at the country’s second-largest truck maker - Ashok Leyland’s Switch Mobility. He also comes with over three decades of experience in the automotive space to execute projects ground up.", "url": "https://auto.economictimes.indiatimes.com/news/commercial-vehicle/mhcv/nitin-seth-former-coo-at-ashok-leyland-to-join-reliance-industries-new-energy-biz/86687065", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-86687065,imgsize-118004,width-800,height-434,overlay-etauto/nitin-seth-former-coo-at-ashok-leyland-to-join-reliance-industries-new-energy-biz.jpg", "publishedAt": "2021-10-01T16:32:00Z", "content": "Nitin Seth, former COO at Ashok Leyland joins Reliance Industries\r\nNitin Seth, the former COO at Ashok Leyland, has been drafted by Reliance Industries to be part of a pilot team, to drive its new en… [+2781 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Tata Group firms make open offer to acquire 26% stake in Tejas Networks - Economic Times", "description": "Under the open offer, Tata Sons and its subsidiaries Panatone Finvest, Akashastha Technologies have made a cash offer to acquire around crore fully paid-up equity shares of Tejas Networks at a price of Rs 258 apiece.", "url": "https://economictimes.indiatimes.com/markets/companies/tata-group-firms-make-open-offer-to-acquire-26-stake-in-tejas-networks/articleshow/86687220.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86687272,width-1070,height-580,imgsize-83810,overlay-etmarkets/photo.jpg", "publishedAt": "2021-10-01T16:32:00Z", "content": "New Delhi: Tata Group firms on Friday made open offer to acquire upto 26 per cent stake in domestic telecom gear firm Tejas Networks for around Rs 1,038 crore. The offer is part of Tata Group's bid t… [+855 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Tech Mahindra to acquire Beris Consulting for around Rs 60 crore - Moneycontrol", "description": "Beris has over 125 employees and the company had revenues of 10.1 million euros for the financial year ended December 31, 2020.", "url": "https://www.moneycontrol.com/news/business/tech-mahindra-to-acquire-beris-consulting-for-around-rs-60-crore-7533361.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/tech-mahindra-770x433.png", "publishedAt": "2021-10-01T16:03:51Z", "content": "IT company Tech Mahindra will acquire IT consultancy service provider Beris Consulting Gmbh for 7 million euros or about Rs 60 crore through its German subsidiary, the company said in a regulatory fi… [+688 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mukesh Ambani to Gautam Adani: Top 10 richest Indians in 2021 - The Indian Express", "description": "Hurun India Rich List 2021: Mukesh Ambani continues to be the richest man in India for the 10th consecutive year with a wealth of Rs 7,18,000 crore.", "url": "https://indianexpress.com/article/business/india-top-10-richest-people-ambani-adani-hurun-india-list-7546790/", "urlToImage": "https://images.indianexpress.com/2021/04/richest-indian-billionaires-forbes-list-2021-1200.jpg", "publishedAt": "2021-10-01T15:26:46Z", "content": "With a net worth of Rs 7,18,000 crore, Reliance chairman Mukesh Ambani has retained the title of being the richest Indian for the 10th consecutive year, a report released by IIFL Wealth and Hurun Ind… [+4675 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Air India bidding: Life comes full circle for Tatas - India Today", "description": "A homecoming of sorts, the airline founded by JRD Tata, India’s first licensed pilot who piloted Air India’s (then Tata Airlines) first flight in 1932, will now be operated by the Tatas once again, according to sources.", "url": "https://www.indiatoday.in/india/story/air-india-bidding-life-comes-full-circle-for-tatas-1859753-2021-10-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202110/air_india-647x363.jpeg?OMHBwR..6uArElGLjRNH2_ulLWmJ0zId", "publishedAt": "2021-10-01T14:59:47Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "YES Bank lowers home loan rates. Check how it compares with other banks - Mint", "description": "YES Bank has unveiled a festival offer, under which customers can get loans at 6.7% per annum", "url": "https://www.livemint.com/money/personal-finance/yes-bank-lowers-home-loan-rates-check-how-it-compares-with-other-banks-11633099561894.html", "urlToImage": "https://images.livemint.com/img/2021/10/01/600x338/45842918-1bcd-11ec-ba83-70a33182afba_1632338992158_1633100018616.jpg", "publishedAt": "2021-10-01T14:59:33Z", "content": "Following suit after State Bank of India (SBI), ICICI Bank, Punjab National Bank (PNB) and several other financial institutions, private lender YES bank has announced that it is lowering home loan ra… [+2464 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Builder gets Rs 249 cr from Centre's stress fund to complete housing project in Greater Noida - Times of India", "description": "Real estate developer Panchsheel Group has received Rs 249 crore from the Centre's stress fund to complete a group housing project in Greater Noida, w", "url": "https://timesofindia.indiatimes.com/city/noida/builder-gets-rs-249-cr-from-centres-stress-fund-to-complete-housing-project-in-greater-noida/articleshow/86683628.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86683653,width-1070,height-580,imgsize-39820,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-10-01T14:31:00Z", "content": "Builder gets Rs 249 cr from Centre's stress fund to complete housing project in Greater Noida\r\n<ul><li>News</li>\r\n<li>City News</li>\r\n<li>noida News</li>\r\n<li>Builder gets Rs 249 cr from Centre's str… [+62 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "60% Indians likely to spend during festive season; budget, safety key concerns: Survey - Times of India", "description": "India Business News: NEW DELHI: There has been a significant improvement in consumer sentiment and a majority of Indians are likely to spend this festive season, a survey .", "url": "https://timesofindia.indiatimes.com/business/india-business/60-indians-likely-to-spend-during-festive-season-budget-and-safety-key-concerns-survey/articleshow/86682339.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86682446,width-1070,height-580,imgsize-1317072,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-10-01T13:31:00Z", "content": "60% Indians likely to spend during festive season; budget, safety key concerns: Survey"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Nabanita Singha Roy", "title": "Tata Motors Sales Sep 2021 - Tiago, Altroz, Tigor, Nexon Electric - RushLane", "description": "Tata Motors end Q2 FY22 on a positive note. October sales cross the 25k mark. Tata Punch launch date nears.", "url": "https://www.rushlane.com/tata-motors-sales-sep-2021-tiago-altroz-tigor-nexon-electric-12413927.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/10/tata-nexon-sales-sep-2021.jpeg", "publishedAt": "2021-10-01T13:21:55Z", "content": "Image – Yash Cars\r\nProduction of automobiles, an industry that is a large consumer of the semi-conductor components, has been dealing with constraints in recent months. Across the spectrum, data poin… [+2488 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Equitymaster", "title": "Sensex ends 361 pts lower; Bajaj Finserv & Maruti Suzuki among top Nifty losers - Mint", "description": "Indian share markets ended on a negative note with the Sensex down by 361 points and the Nifty ending down by 86 points.", "url": "https://www.livemint.com/market/stock-market-news/sensex-ends-361-pts-lower-bajaj-finserv-maruti-suzuki-among-top-nifty-losers-11633088092737.html", "urlToImage": "https://images.livemint.com/img/2021/10/01/600x338/2020-05-13T040617Z_1_LYNXMPEG4C0AC_RTROPTP_3_MARKETS-INDIA-STOCKS_1592449659141_1633088425619.JPG", "publishedAt": "2021-10-01T11:41:27Z", "content": "Indian share markets witnessed negative trading activity throughout the day today and ended lower.\r\nTracking a rout in the global markets, benchmark indices tumbled for the fourth straight day, dragg… [+5186 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Adar Poonawalla-backed Wellness Forever files for IPO to raise up to Rs 1,600 crore - Moneycontrol.com", "description": "The IPO of this omnichannel retail pharmacy chain, which is second only to that of Hyderabad-based MedPlus, who filed its DRHP in August, will consist of fresh equity share issues, which are worth Rs 400 crore, along with an offer for sale to the tune of Rs 1…", "url": "https://www.moneycontrol.com/news/business/ipo/adar-poonawalla-backed-wellness-forever-files-for-ipo-to-raise-up-to-rs-1600-crore-7531881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Adar-Poonawalla-770x433.jpg", "publishedAt": "2021-10-01T11:21:05Z", "content": "Wellness Forever Medicare, backed by Serum Institute of India (SII) CEO Adar Poonawalla, expects to raise between Rs 1,500-Rs 1,600 crore through its initial public offering (IPO), per their Draft Re… [+1984 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Coal ministry sets up committee for review of CIL, other PSUs - Mint", "description": "The committee has been set up under the chairmanship of joint secretary & financial advisor comprising representatives from NTPC, Indian Oil", "url": "https://www.livemint.com/news/india/coal-ministry-sets-up-committee-for-review-of-cil-other-psus-11633085969232.html", "urlToImage": "https://images.livemint.com/img/2021/10/01/600x338/2021-03-02T155526Z_1368011162_RC233M9ZHISY_RTRMADP_3_USA-INVESTMENT-COAL_1614927079403_1633086582012.JPG", "publishedAt": "2021-10-01T11:11:35Z", "content": "NEW DELHI :\r\nThe union coal ministry has set up a committee for reviewing and benchmarking the timelines in project execution including tendering process of state-run Coal India Ltd (CIL), its subsid… [+2479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Impressed by ‘Iron Man’ suit made out of scrap, Anand Mahindra pledges support to Manipur boy - The Indian Express", "description": "Prem, a boy from Imphal, had caught the attention of Anand Mahindra after a functional 'Iron Man suit designed by him created a buzz online.", "url": "https://indianexpress.com/article/trending/trending-in-india/anand-mahindra-pledges-support-to-manipur-boy-ironman-suit-scrap-metals-7546120/", "urlToImage": "https://images.indianexpress.com/2021/10/manipur-boy-ironman-suit-mahindra-support.jpg", "publishedAt": "2021-10-01T11:08:05Z", "content": "When it comes to ingenuity, there’s no dearth of talent in India. Now, Mahindra Group’s chairman Anand Mahindra has supported a talented youngster from Manipur who went viral for making an ‘Iron Man’… [+5249 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Mercedes-Benz S-Class CKD launch on October 7 - Team-BHP", "description": "As expected, Mercedes-Benz is gearing up to launch the made-in-India S-Class this month. The CKD version of the luxury sedan will go on sale on October 7, 2021. The W223 S-Class was launched in India in June this year. Until now, the car was imported as a com…", "url": "https://www.team-bhp.com/news/mercedes-benz-s-class-ckd-launch-october-7", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/S-Class.jpg", "publishedAt": "2021-10-01T10:41:04Z", "content": "As expected, Mercedes-Benz is gearing up to launch the made-in-India S-Class this month. The CKD version of the luxury sedan will go on sale on October 7, 2021.\r\nThe W223 S-Class was launched in Indi… [+858 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "PTI", "title": "Elon Musk's Starlink plans to start broadband service in India: Timeline, booking price and more - Gadgets Now", "description": "Elon Musk-led SpaceX's satellite broadband arm Starlink aims to start broadband service in India from December 2022, with 2 lakh active terminals subject to permission from the government, a top company official said on Friday. Starlink Country Director for I…", "url": "https://www.gadgetsnow.com/tech-news/elon-musks-starlink-plans-to-start-broadband-service-in-india-timeline-booking-price-and-more/articleshow/86678977.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-86678977,imgsize-85640,width-800/86678977.jpg", "publishedAt": "2021-10-01T10:40:00Z", "content": "Elon Musk-led SpaceX's satellite broadband arm Starlink aims to start broadband service in India from December 2022, with 2 lakh active terminals subject to permission from the government, a top comp… [+2317 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Tata Power market-cap crosses Rs 50,000cr mark; stock up 4% at new high - Business Standard", "description": "The company aims to scale up its renewable energy portfolio from current 4GW to 15GW by 2025 and 25GW by 2030 thereby achieving 80 per cent clean generation capacity, up from the current 31 per cent", "url": "https://www.business-standard.com/article/markets/tata-power-market-cap-crosses-rs-50-000cr-mark-stock-up-8-at-a-13-yr-high-121100100686_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/07/full/1630954302-0838.jpg", "publishedAt": "2021-10-01T09:13:00Z", "content": "Shares of Tata Power Company continued to climb higher, hitting a new high at Rs 165 after 13 years, up 4 per cent on the BSE in Friday’s intra-day trade, on improved outlook. The stock of Tata Group… [+4137 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Advertorial", "title": "Redeem your CRED Coins to avail thrilling offers on exclusive brands available on CRED store - Times Now", "description": "On October 1st and 2nd, CRED is offering a vast range of F&B, electronics and beauty brands at member exclusive prices on its in-app store", "url": "https://www.timesnownews.com/business-economy/article/redeem-your-cred-coins-to-avail-thrilling-offers-on-exclusive-brands-available-on-cred-store/819023", "urlToImage": "https://imgk.timesnownews.com/story/EDIT_DP_STORE.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-10-01T08:01:00Z", "content": "Unless you have been living under a rock, you would know that credit card payments have not just become simplified but also highly rewarding, thanks to CRED! \r\nThe member-only community has not just … [+3756 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": null, "title": "Major changes from October 1: From pension rule, cheque books to MF investments, these 5 notable changes taking place from today - Zee Business", "description": "", "url": "https://www.zeebiz.com/personal-finance/photo-gallery-major-changes-from-october-1-from-pension-rule-cheque-books-to-mf-investments-these-5-notable-changes-taking-place-from-today-166611", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2021/10/01/161017-mainnnnn.jpg", "publishedAt": "2021-10-01T07:49:49Z", "content": "The additional factor authentication (AFA) rules of the Reserve Bank of India (RBI) will be now implemented from October 1. After the implementation, utility bills, OTT subscriptions and other servic… [+963 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Aditya Birla AMC IPO: GMP, subscription status, other details. Should you subscribe? - Mint", "description": "Aditya Birla IPO comprises an offer for sale of up to 28.51 lakh equity shares by Aditya Birla Capital and up to 3.6 crore equity shares by Sun Life AMC", "url": "https://www.livemint.com/market/ipo/aditya-birla-amc-ipo-gmp-subscription-status-other-details-should-you-subscribe-11632820099387.html", "urlToImage": "https://images.livemint.com/img/2021/09/28/600x338/stock-kItE--621x414@LiveMint_1632820483883.jpg", "publishedAt": "2021-10-01T07:00:00Z", "content": "Fund house Aditya Birla Sun Life AMC has come up with its public issue to raise around 2,770 crore, which opened on Wednesday and will close today. The three-day initial share sale's price band has b… [+2685 chars]"}]}