{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Thewire.in"}, "author": "The Wire Staff", "title": "Brazil's Health Regulator Anvisa Says Covaxin Doesn't Meet Manufacturing Standards - The Wire Science", "description": "The Brazil government had signed a contract with Precis Medicamentos, Bharat Biotech's representative in Brazil, to buy 20 million doses of the vaccine.", "url": "https://science.thewire.in/health/brazil-bharat-biotech-covaxin-anvisa-manufacturing-standards-certificate/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/01/21111142/2021-01-21T042647Z_1_LYNXMPEH0K082_RTROPTP_4_HEALTH-CORONAVIRUS-INDIA-VACCINE-scaled.jpg", "publishedAt": "2021-03-30T16:59:21Z", "content": "India’s health minister holds up a vial of Covaxin. Photo: Reuters/File.\r\nNew Delhi: The Brazilian health regulator Anvisa (short for the Portuguese Agência Nacional de Vigilância Sanitári), has deni… [+3607 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Coinbase Opens Office in India Despite Crypto Ban Reports – Bitcoin News - Bitcoin News", "description": "Cryptocurrency exchange operator Coinbase has announced that it is establishing a business presence in India. The company has also posted several job openings for its Indian operations despite reports that the government may ban cryptocurrencies.", "url": "https://news.bitcoin.com/coinbase-office-india-crypto-ban-reports/", "urlToImage": "https://news.bitcoin.com/wp-content/uploads/2019/09/coinbase.jpg", "publishedAt": "2021-03-30T16:46:46Z", "content": "Cryptocurrency exchange operator Coinbase has announced that it is establishing a business presence in India. The company has also posted several job openings for its Indian operations despite report… [+3303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Explained: Why auto-payment for OTT platforms may not go through from April 1 - The Indian Express", "description": "Banks and service providers need to adhere to RBI guideline before e-mandates can be given by card users for recurring payments for services consumed.", "url": "https://indianexpress.com/article/explained/explained-why-auto-payment-for-ott-platforms-may-not-go-through-from-april-1-7251728/", "urlToImage": "https://images.indianexpress.com/2021/03/ott-platforms-2.jpg", "publishedAt": "2021-03-30T16:17:21Z", "content": "Even though credit card customers may have given standing instruction for recurring payments to various service providers such as Airtel, Netflix, Hotstar, Amazon Prime among others, beginning April … [+4276 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "How India can become a major tech hub amid US-China tensions - Times of India", "description": "India Business News: India faces a historic opportunity to transform into one of the world's major technology hubs, a report by Asia-based Hinrich Foundation said on Tuesd", "url": "https://timesofindia.indiatimes.com/business/india-business/how-india-can-become-a-major-tech-hub/articleshow/81764046.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81765156,width-1070,height-580,imgsize-98379,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-30T16:07:00Z", "content": "How India can become a major tech hub amid US-China tensions"}, {"source": {"id": null, "name": "Livemint"}, "author": "Tarush Bhalla", "title": "Amazon acquires Perpule to bolster kirana-tech play - Mint", "description": "With this, Amazon plans to up its ante in the kirana-tech space as it would now leverage Perpule’s cloud-based point-of-sale (PoS) offering ‘UltraPoS’ and offer new suite of technology products", "url": "https://www.livemint.com/companies/news/amazon-acquires-perpule-to-bolster-kirana-tech-play-11617116966624.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/b84bbb8c-7132-11eb-848d-61a48f38aea5_1617117031545_1617117074549.jpg", "publishedAt": "2021-03-30T15:12:55Z", "content": "Bengaluru: Amazon Technologies Inc., part of Amazon.com Inc., has acquired retail tech startup Perpule in an all cash-deal of 107.6 crore to bolster its play in the kirana-tech space in India, accord… [+4061 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Shubashree Desikan", "title": "Coronavirus | After blood clots, Canada limits AstraZeneca vaccine to those over 55 - The Hindu", "description": "Federal body asks manufacturers asked to assess risk of drug by age", "url": "https://www.thehindu.com/sci-tech/health/after-blood-clots-canada-limits-az-vaccine-to-those-over-55/article34199922.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/69sev8/article34199921.ece/ALTERNATES/LANDSCAPE_615/CanadaVaccine", "publishedAt": "2021-03-30T14:52:45Z", "content": "Following reports of an extremely rare adverse reaction to the AstraZeneca vaccine which causes blood clots, several countries have set age limits for the use of the vaccine and Canada is the latest … [+3273 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "HDFC Bank says technical glitch resolved but why is the problem recurring? - Moneycontrol", "description": "Over the last few years, many banks have reported recurring technical glitches in their digital channels.", "url": "https://www.moneycontrol.com/news/business/hdfc-bank-says-technical-glitch-resolved-but-why-the-problem-is-recurring-6710621.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/shutterstock_1466521847-1-580x435.jpg", "publishedAt": "2021-03-30T14:42:51Z", "content": "HDFC Banks digital woes somehow seem to continue, even after the Reserve Bank of India (RBI) gave a hard rap on the knuckles last December following a series of digital outages, barring it from new d… [+5218 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Reuters", "title": "Microsoft looking to hire 50,000 people via LinkedIn - Gadgets Now", "description": "Microsoft Corp said on Tuesday that it aims to place 50,000 people in jobs that require technology skills as part of a broader push being undertaken with its professional networking website LinkedIn to help workers affected by the coronavirus pandemic move in…", "url": "https://www.gadgetsnow.com/tech-news/microsoft-looking-to-hire-50000-people-via-linkedin/articleshow/81763674.cms", "urlToImage": "https://static.toiimg.com/photo/81763742.cms", "publishedAt": "2021-03-30T14:31:00Z", "content": "Microsoft Corp said on Tuesday that it aims to place 50,000 people in jobs that require technology skills as part of a broader push being undertaken with its professional networking website LinkedIn … [+1510 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Volkswagen Taigun Compact SUV’s production version leaked ahead of official reveal - CarToq.com", "description": "Volkswagen is working on entering the mid-size SUV segment with a new SUV. Yes, they currently have the T-Roc but that is available in limited numbers only and is priced much higher when compared to other mid-size SUVs in the competition. The new SUV will be …", "url": "https://www.cartoq.com/volkswagen-taigun-production-leaked/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/volkswagen-taigun-production-version-1019x530.jpg", "publishedAt": "2021-03-30T14:29:59Z", "content": "Volkswagen is working on entering the mid-size SUV segment with a new SUV. Yes, they currently have the T-Roc but that is available in limited numbers only and is priced much higher when compared to … [+3511 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Anulekha Ray", "title": "Debit card, credit card auto-payment: RBI new rule on recurring payment from April. Know details - Mint", "description": "For auto-payments from debit and credit cards or via wallets, an additional authentication will be required by the customer from April.The new rule will be applicable for transactions performed using all types of cards – debit, credit, UPI and PPIs, including…", "url": "https://www.livemint.com/industry/banking/debit-card-credit-card-auto-payment-rules-change-from-april-know-details-11617108811026.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/UPI-kaGC--621x414@LiveMint_1617111505860.jpg", "publishedAt": "2021-03-30T13:40:41Z", "content": "Starting from next month, the auto-payment rules for mobile, utility and other bills are likely to be changed. The Reserve Bank of India (RBI) earlier stated that recurring transactions using debit c… [+2866 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Huge auction in WABCO post OFS as bears trapped in Wendt-style ambush - CNBCTV18", "description": "Huge auction in WABCO post OFS as bears trapped in Wendt-style ambush  . Get latest Business online at cnbctv18.com", "url": "https://www.cnbctv18.com/market/stocks/huge-auction-in-wabco-post-ofs-as-bears-trapped-in-wendt-style-ambush-8766801.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/02/bond-market-768x512.jpg", "publishedAt": "2021-03-30T13:23:29Z", "content": "Around 4.62 lakh shares of auto ancillary firm WABCO India were auctioned on the NSE for around Rs 7500 a share, brokers tracking the stock told CNBCTV18.com. This is a 33 percent premium to WABCO’s … [+2691 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "RBI’s upcoming digital currency to be like cash: Report - India Today", "description": "RBI's upcoming digital currency is likely to be like cash and will use private blockchain technology. Here is all you need to know:", "url": "https://www.indiatoday.in/business/story/rbi-s-upcoming-digital-currency-to-be-like-cash-report-1785192-2021-03-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202103/Screenshot_2021-03-30_at_6.19.-647x363.png?B270xiPNBvb7C_Uf2VJ15oeU.rafGclY", "publishedAt": "2021-03-30T12:52:50Z", "content": "The Reserve Bank of Indias (RBI) upcoming digital currency is likely to use a private blockchain platform, which will reduce the transaction settlement processes, reported livemint.com. The report al… [+1842 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Mettis News", "title": "Rupee gains 95 paisa to reach 22-month high against dollar in interbank - DAWN.com", "description": "The Pakistani currency closed the day's trade at Rs153.09 per dollar.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2021/03/6062c39f0ca2c.jpg", "publishedAt": "2021-03-30T12:40:48Z", "content": "The rupee continued its upward trajectory on Tuesday, appreciating by 95 paisa against the US dollar in the interbank session.\r\nThe local currency closed the day's trade at Rs153.09 per dollar, again… [+2447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Concern Over 'Opaque' Empire Of Billionaire Sanjeev Gupta - NDTV", "description": "Britain's business minister on Tuesday confirmed that Boris Johnson's government had refused a 170 million pound rescue package for billionaire Sanjeev Gupta's steel group due to his business empire's \"very opaque\" structure.", "url": "https://www.ndtv.com/india-news/uk-concern-over-opaque-empire-of-billionaire-sanjeev-gupta-2402353", "urlToImage": "https://c.ndtvimg.com/8j6q9o1_indian-origin-billionaire-sanjeev-gupta-twitter_625x300_16_August_18.jpg", "publishedAt": "2021-03-30T12:22:41Z", "content": "Kwasi Kwarteng called the Gupta Family Group- \"very opaque\" and \"not helpful\".\r\nLondon: Britain's business minister on Tuesday confirmed that Boris Johnson's government had refused a £170 million res… [+1883 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Sebi comes out with additional guidelines for surrender of FPI registration - Economic Times", "description": "The regulator said while making an application to Sebi for seeking no objection certificate(NOC) for surrender, custodians must confirm that the accounts held by the FPI have zero balance. Besides, the CP(custodial participant) code of the FPI is also blocked.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-comes-out-with-additional-guidelines-for-surrender-of-fpi-registration/articleshow/81761658.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81761853,width-1070,height-580,imgsize-86528,overlay-etmarkets/photo.jpg", "publishedAt": "2021-03-30T12:18:00Z", "content": "Mumbai: The Securities and Exchange Board of India(Sebi) on Tuesday came out with revised rules for surrendering FPI (foreign portfolio investor) license, in an attempt to have uniform market rules.\r… [+641 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "2021 Mahindra XUV500 launch postponed: New timeline revealed - CarToq.com", "description": "Mahindra is working on launching two new SUVs. There will be the new generation of the XUV500 and the Scorpio. Both the SUVs were expected to launch this year. The XUV500 was supposed to be launched in mid of 2021 whereas the Scorpio was expected to launch by…", "url": "https://www.cartoq.com/2021-mahindra-xuv500-postponed/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2020/12/mahindra-xuv500-render-front-1019x530.jpg", "publishedAt": "2021-03-30T12:04:51Z", "content": "Mahindra is working on launching two new SUVs. There will be the new generation of the XUV500 and the Scorpio. Both the SUVs were expected to launch this year. The XUV500 was supposed to be launched … [+2912 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "India says Covishield can be used for up to 9 months against prescribed 6 months: Report - Mint", "description": "The approval could help health authorities minimise vaccine wastage and better plan their inoculation programmes.You are permitted to apply the shelf-life of 9 month to unlabelled vials available on hand, India's drugs controller-general, V.G. Somani said", "url": "https://www.livemint.com/news/india/india-says-covishield-can-be-used-for-up-to-9-months-against-prescribed-6-months-11617104844769.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/AFP_96C9XM_1617105633630_1617105650774.jpg", "publishedAt": "2021-03-30T12:04:27Z", "content": "India's drug regulator has allowed the AstraZeneca COVID-19 vaccine to be used for up to nine months from its manufacture date, as opposed to the prescribed six months, according to a document review… [+1966 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "India's Inflation at 'Uncomfortably High' Level, Says Moody's Analytics - News18", "description": "India&#39;s inflation is at &quot;uncomfortably high&quot; level, which is an exception among Asian economies, Moody&#39;s Analytics said on Tuesday.", "url": "https://www.news18.com/news/business/indias-inflation-at-uncomfortably-high-level-says-moodys-analytics-3589265.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/12/1607410362_inflation.jpg", "publishedAt": "2021-03-30T11:48:32Z", "content": "India's inflation is at \"uncomfortably high\" level, which is an exception among Asian economies, Moody's Analytics said on Tuesday. Higher fuel prices will keep upward pressure on retail inflation an… [+1541 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "India extends shelf life of AstraZeneca vaccine: Report - Times of India", "description": "India News: India's drug regulator has allowed the AstraZeneca Covid-19 vaccine to be used for up to nine months from its manufacture date, as opposed to the pres", "url": "https://timesofindia.indiatimes.com/india/india-extends-shelf-life-of-astrazeneca-vaccine-report/articleshow/81760610.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81760574,width-1070,height-580,imgsize-31616,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-30T11:22:00Z", "content": "India extends shelf life of AstraZeneca vaccine: Report"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Peter", "title": "Xiaomi will set up an electric car subsidiary with a $10 billion investment over the next 10 years - GSMArena.com news - GSMArena.com", "description": "Lei Jun will serve as CEO of this subsidiary, which will be set up with an initial investment of $1.5 billion.", "url": "https://www.gsmarena.com/xiaomi_will_set_up_an_electric_car_subsidiary_with_a_10_billion_investment_over_the_next_10_years-news-48434.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/03/xiaomi-electric-car/-476x249w4/gsmarena_000.jpg", "publishedAt": "2021-03-30T11:15:01Z", "content": "Xiaomis Mega Launch proved so long that it had to be split into two Part 1 yesterday brought several Mi 11 and we expected that Part 2 today will bring the companys first foldable. It could be much m… [+1569 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Clear Conscience: Cyrus Mistry On Supreme Court's Verdict - NDTV", "description": "Cyrus Mistry, breaking his silence on the Supreme Court backing the Tata Group's decision to sack him as chairman of the over $100 billion salt-to-software group in 2016, said today \"life is not always fair\" but \"I sleep with a clear conscience\".", "url": "https://www.ndtv.com/india-news/cyrus-mistry-says-disappointed-with-supreme-court-verdict-on-fight-with-tata-sons-i-sleep-with-a-clear-conscience-2402267", "urlToImage": "https://i.ndtvimg.com/i/2016-11/cyrus-mistry-ratan-tata_650x400_41478169084.jpg", "publishedAt": "2021-03-30T10:39:08Z", "content": "The Cyrus Mistry statement was titled \"Grateful for the opportunity - My conscience is clear.\"\r\nNew Delhi: Cyrus Mistry, breaking his silence on the Supreme Court backing the Tata Group's decision to… [+3522 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Anulekha Ray", "title": "How many salaried people in India make it to ultra-rich club - Mint", "description": "Knight Frank, an international property consultant, has recently published a survey named 'Attitudes Survey 2021'.Around 56% of ultra-high net worth individuals derive their wealth through their own businesses, according to the survey", "url": "https://www.livemint.com/news/india/how-many-salaried-people-in-india-make-it-to-ultra-rich-club-11617099728859.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/rupeenew1-kPaC--621x414@LiveMint_1617100553174.JPG", "publishedAt": "2021-03-30T10:38:08Z", "content": "At least 14% of Indias ultra-high net worth individuals (UHNWIs) are from salaried employee segment, revealed a survey by Knight Frank. With this, India has become fourth highest contributor in the A… [+1780 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Auto companies set to hike prices of cars, bikes, for second time in four months - Moneycontrol.com", "description": "Spiraling domestic steel and aluminum prices force manufacturers’ hands; the latest increase might not deflate the demand surge, say market watchers", "url": "https://www.moneycontrol.com/news/technology/auto/auto-companies-set-to-hike-prices-of-cars-bikes-for-second-time-in-four-months-6708641.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Car-price-rising-770x433.jpg", "publishedAt": "2021-03-30T10:03:00Z", "content": "Raw material cost increases are forcing automakers to go for yet another price hike in an effort to avoid a further squeeze on profit margins.\r\nThe hikes, which would be effective from April 1, would… [+3494 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Ashwin Ram N P", "title": "2021 Honda CB650R And CBR650R Launch Price Rs 8.67 L Onwards - RushLane", "description": "Honda India today announced the launch of two new motorcycles - CB650R and CBR650R. Both are powered by same engine.", "url": "https://www.rushlane.com/2021-honda-cb650r-and-cbr650r-launch-price-12397841.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/03/2021-honda-cb650r-cbr650r-india-launch-price-specs-2.jpg", "publishedAt": "2021-03-30T09:51:14Z", "content": "2021 Honda CB650R\r\nHonda, off late, has been busy expanding its range of premium motorcycles which are retailed exclusively through the companys premium chain of dealerships- BigWing. In recent month… [+3449 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "2021 Skoda Kodiaq Facelift Sketches Out, Debut On April 13 - GaadiWaadi.com", "description": "Skoda has teased the upcoming Kodiaq facelift via official design sketches, and it will be unveiled on April 13, 2021", "url": "https://gaadiwaadi.com/2021-skoda-kodiaq-facelift-sketches-out-debut-on-april-13/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/2021-Skoda-Kodiaq.jpg", "publishedAt": "2021-03-30T09:50:25Z", "content": "Skoda is all set to unveil the Kodiaq facelift on 13th April, and before its global debut, the Czech manufacturer has released the official design sketches of the upcoming SUV. The design sketches gi… [+1860 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Sahil Kukreja", "title": "Kia EV6 GT Revealed With 577 HP; 0-100 In 3.5 Seconds - GaadiWaadi.com", "description": "The EV6 crossover is Kia's first dedicated electric vehicle, and is based on the new Electric-Global Modular Platform (E-GMP)", "url": "https://gaadiwaadi.com/kia-ev6-gt-revealed-with-577-hp-0-100-in-3-5-seconds/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/Kia-EV6-GT.jpg", "publishedAt": "2021-03-30T09:47:48Z", "content": "A few weeks ago, Kia had revealed the EV6 – its first dedicated battery-powered vehicle, however, the Korean carmaker refrained from unveiling its technical specifications at the time. Now, Kia has f… [+1843 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "BHEL secures Rs 400 crore order for sulphur recovery unit from IOCL - Moneycontrol", "description": "Under this package, valued at over Rs 400 Crore, BHEL envisages setting up a 525 TPD Sulphur Recovery Unit at IOCL’s Paradip Refinery in Odisha. The project is scheduled for completion in 25 months.", "url": "https://www.moneycontrol.com/news/business/bhel-secures-rs-400-crore-order-for-sulphur-recovery-unit-from-iocl-6709291.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/05/BHEL_BHEL-770x433.jpg", "publishedAt": "2021-03-30T09:46:58Z", "content": "Bharat Heavy Electricals Limited (BHEL) has bagged a Rs 400 crore order for a sulphur recovery unit from Indian Oil Corporation Limited (IOCL), the PSU said in a regulatory filing on March 30.\r\nUnder… [+1871 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Leroy Leo", "title": "Non-covid tests remain robust for Metropolis despite second wave: Ameera Shah - Mint", "description": "It has been seeing a gradual recovery in non-covid testing revenue, which had shrunk during the lockdown in April-June. With recovery continuing to improve, the company has been focussing on expansion plans, primarily of collection centres and less so of labo…", "url": "https://www.livemint.com/companies/news/noncovid-tests-remain-robust-for-metropolis-despite-second-wave-ameera-shah-11617095015048.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/MINT02_1614945162925_1617095710664.jpg", "publishedAt": "2021-03-30T09:17:14Z", "content": "NEW DELHI: Despite a fresh surge of covid infections in India, especially Maharashtra, diagnostics firm Metropolis Healthcare does not see an impact on its business like it witnessed during the first… [+2546 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Volkswagen Taigo Crossover SUV Design Sketches Revealed - GaadiWaadi.com", "description": "Volkswagen Taigo will be launched in Europe by the end of this year and it will be offered with a host of assistive technologies", "url": "https://gaadiwaadi.com/volkswagen-taigo-crossover-suv-design-sketches-revealed/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/Volkswagen-Taigo.jpg", "publishedAt": "2021-03-30T09:16:00Z", "content": "Volkswagen has today announced the official name of its upcoming crossover for the European markets ahead of its world debut. Dubbed the ‘Taigo’, it will help in expanding the brand’s SUV portfolio m… [+1844 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Richa Mukherjee", "title": "Nazara Technologies Debuts on Share Market; Lists at 79% Premium on BSE - News18", "description": "Shares of Nazara Technologies got listed on the stock exchanges on Tuesday, March 30.", "url": "https://www.news18.com/news/business/nazara-technologies-debuts-on-share-market-lists-at-79-premium-on-bse-3588458.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/02/1612320180_untitled-design-25.png", "publishedAt": "2021-03-30T09:12:03Z", "content": "Shares of Nazara Technologies got listed on the stock exchanges on Tuesday, March 30. On the BSE, the shares of the company opened at Rs 1,971, a premium of 79.02 percent compared to the issue price … [+1781 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha LM Tripathi", "title": "Starting April, Vistara to roll back pay cuts for non-management staff - Hindustan Times", "description": "An internal email by the airline’s CEO Leslie Thng to employees said that pay cuts will continue for management-level executives (level 4 and level 5 employees), including himself, but will be rolled back for level 1 to level 3 staff", "url": "https://www.hindustantimes.com/india-news/starting-april-vistara-to-roll-back-pay-cuts-for-non-management-staff-101617094428819.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/30/1600x900/f823359c-9134-11eb-9899-db3d5d6a7e7e_1617094427829.jpg", "publishedAt": "2021-03-30T08:53:48Z", "content": "Vistara will be rolling back pay cuts for a few categories of employees, starting April. These pay cuts were implemented last year due to the Covid-19 pandemic leading to severe financial issues for … [+1403 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Tarun", "title": "You Can Now Renew Your Car Documents By June 30 - CarDekho", "description": "The previous cut-off was March 31, but that is now extended due to the increasing COVID cases in the country     Motor vehicle documents that are past their expiry date can now be renewed until June 30, 2021.     The list of documents includes vehicle registr…", "url": "https://www.cardekho.com/india-car-news/you-can-now-renew-your-car-documents-by-june-30-26947.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/26946/1617095428953/GeneralNews.jpg", "publishedAt": "2021-03-30T08:40:00Z", "content": "<ul><li>Motor vehicle documents that are past their expiry date can now be renewed until June 30, 2021. \r\n</li><li>The list of documents includes vehicle registration, fitness certificate, permits, a… [+1148 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "India Inc raises all-time high of Rs 1.89 lakh crore from equity market in FY21 - Moneycontrol.com", "description": "Of the total amount of Rs 1,88,900 crore, the fresh capital amount was Rs 1,36,992 crore (73 percent), the remaining Rs 51,908 crore was through offers for sale, data from PRIME Database shows.", "url": "https://www.moneycontrol.com/news/business/markets/india-inc-raises-all-time-high-of-rs-1-89-lakh-crore-from-equity-market-in-fy21-6708831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Investment-770x433.jpg", "publishedAt": "2021-03-30T08:22:41Z", "content": "Amid the outbreak of COVID-19 and deterioration of the macroeconomic environment across the world, India Inc's fundraising from the equity market hit an all-time high in FY21, PRIME Database has said… [+5150 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Prabhjote Gill", "title": "India’s biggest software exporter just got itself a millennial makeover after 15 years - Business Insider India", "description": "Tata Consultancy Services (TCS) has rebranded itself after 15 years to speak to millennials. The company’s new tagline is ‘Building on Belief’, from ‘Experience", "url": "https://www.businessinsider.in/business/corporates/news/tcs-just-rebranded-itself-to-speak-to-millennials-while-still-betting-on-certainty/articleshow/81757143.cms", "urlToImage": "https://www.businessinsider.in/photo/81757143/tcs-just-rebranded-itself-to-speak-to-millennials-while-still-betting-on-certainty.jpg?imgsize=315209", "publishedAt": "2021-03-30T08:22:00Z", "content": "India’s biggest information technology (IT) services company, Tata Consultancy Services (TCS), announced its rebranding after 15 years. The tagline for TCS is no longer ‘Experience Certainty’ but ‘Bu… [+2055 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "IRCON International zooms 8% as firm to consider bonus issue - Business Standard", "description": "Choice Broking has 'BUY' rating on the stock with a target price of Rs 174.5", "url": "https://www.business-standard.com/article/markets/ircon-international-zooms-8-as-firm-to-consider-bonus-issue-121033000493_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-07/08/full/1594227675-0332.jpg", "publishedAt": "2021-03-30T08:05:00Z", "content": "Shares of IRCON International, on Tuesday, rose as much as 8 per cent to Rs 87.30 on the BSE after the company said its board of directors are scheduled to to consider issue of bonus shares on April … [+3255 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "Data of 10 crore Mobikwik users for sale on dark web, say cybersecurity experts - Economic Times", "description": "The Gurugram-based fintech company continued to deny its role in the leak, calling the researchers that made the breach public “media-crazed” alleging them of presenting “concocted files” as evidence.", "url": "https://economictimes.indiatimes.com/tech/startups/mobikwik-data-breach-personal-data-of-over-10-crore-users-allegedly-available-on-sale/articleshow/81756544.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81756619,width-1070,height-580,imgsize-891561,overlay-ettech/photo.jpg", "publishedAt": "2021-03-30T07:45:00Z", "content": "In what is being called the biggest data leak in Indian history, several independent cybersecurity researchers have found that the personal data of over 10 crore customers of startup Mobikwik, is now… [+2772 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Wipro hires former PayPal, Walmart executive Subha Tatavarti as chief technology officer - Moneycontrol", "description": "US-based Subha Tatavarti worked at PayPal for nearly a decade before moving on to Walmart in 2020", "url": "https://www.moneycontrol.com/news/business/wipro-hires-former-paypal-walmart-executive-subha-tatavarti-as-chief-technology-officer-6708301.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Subha-Tatavarti-770x433.jpg", "publishedAt": "2021-03-30T06:50:19Z", "content": "Bengaluru-based IT major Wipro has appointed former PayPal executive Subha Tatavarti as its Chief Technology Officer.\r\nUS-based Tatavarti worked in PayPal for 10 years between 2010 and 2020 in variou… [+1789 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Volkswagen accidentally leaks plans to officially change name to ‘Voltswagen’ - Moneycontrol.com", "description": "Currently, the only electric model on sale in the United States is the ID.4 electric SUV. There are plans for the company to bring back the iconic microbus in an EV form, but that still a while away.", "url": "https://www.moneycontrol.com/news/technology/auto/volkswagen-accidentally-leaks-plans-to-officially-change-name-to-voltswagen-6708391.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Volkswagen-ID.4-770x433.jpg", "publishedAt": "2021-03-30T06:49:27Z", "content": "Early Monday morning, a German carmaker accidentally posted its plans to officially change its name from Volkswagen to Voltswagen.\r\nAn unreleased press release was uploaded and then immediately taken… [+1008 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Anuj Mishra", "title": "Yamaha XSR 250 spotted testing in India - BikeWale", "description": "Although it is claimed to be the XSR 250, it could also be the smaller 155cc version of the bike.", "url": "https://www.bikewale.com/news/yamaha-xsr-250-spotted-testing-in-india/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/55931/right-front-three-quarter1.jpeg?q=85&art=2", "publishedAt": "2021-03-30T06:30:00Z", "content": "Get notifications on latest updates\r\nGet notifications on latest updates\r\n- Yamaha XSR 250 spotted testing\r\n- Gets a few components identical to the FZ S FI\r\n- India launch details not known yet\r\nYam… [+1386 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "WhiteHat Jr partners EnduroSat to offer students learning opportunities related to space - Economic Times", "description": "The collaboration between WhiteHat Jr and EnduroSat will facilitate applied science opportunities for students who will be able to send commands to, and access data from a satellite operating in space.", "url": "https://economictimes.indiatimes.com/tech/startups/whitehat-jr-partners-endurosat-to-offer-students-learning-opportunities-related-to-space/articleshow/81754841.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81754880,width-1070,height-580,imgsize-45066,overlay-ettech/photo.jpg", "publishedAt": "2021-03-30T06:06:00Z", "content": "Ed-tech firm WhiteHat Jr on Tuesday announced a collaborative partnership with satellite company EnduroSat, a move that will facilitate applied science opportunities for students. The collaboration b… [+1803 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Who Will Bear the Cost of Rs 7.5K Interest Reversal Payments for Banks? - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/who-will-bear-the-cost-of-rs-75k-interest-reversal-payments-for-banks-2665915", "urlToImage": "https://i-invdn-com.akamaized.net/news/https://i-invdn-com.akamaized.net/akapi-images/800x450/7f6f787f3c30623b016a12780ca0c666_w_800_h_450.jpg", "publishedAt": "2021-03-30T05:46:03Z", "content": "By Aditya Raghunath\r\nInvesting.com -- The IBA (Indian Banks Association) has asked its member banks to not include the moratorium period while calculating the number of days for non-payment of a loan… [+1104 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Saudi Arabia ready to extend oil cuts by OPEC+: Report - Al Jazeera English", "description": "A fresh wave of COVID lockdowns may cause OPEC+ to extend cuts into May when it meets Thursday, Reuters reports.", "url": "https://www.aljazeera.com/economy/2021/3/30/saudi-arabia-ready-to-extend-oil-cuts-by-opec-report", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/366182426.jpg?resize=1200%2C630", "publishedAt": "2021-03-30T05:33:22Z", "content": "Saudi Arabia is prepared to support extending oil cuts by OPEC and allies into May and June and is also ready to extend its own voluntary cuts to boost oil prices amid a new wave of coronavirus lockd… [+3397 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Gold prices fall further today. Check rates in your city here - Hindustan Times", "description": "Gold prices vary according to the tax structure across states and cities. The prices mentioned below are exclusive of the Goods and Services Tax (GST), TCS, and other taxes and may vary in showrooms. Check rates in your city here", "url": "https://www.hindustantimes.com/business/gold-prices-fall-further-today-check-rates-in-your-city-here-101617080803636.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/30/1600x900/britain-dealers-precious-bullion-hatton-displayed-garden_b2876608-50bf-11eb-8a3c-8a727805186f_1617081790367.jpg", "publishedAt": "2021-03-30T05:26:55Z", "content": "Gold prices continued to fall on Tuesday - a day after the country celebrated Holi - with the rate of yellow metal plunging to 42,970 per 10 gram, according to good returns. On Multi Commodity Exchan… [+1975 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Ayushman Baruah", "title": "Cognizant launches programme to help tech professionals restart career - Mint", "description": "Professionals will work with cutting-edge technology through the programme and will subsequently be considered for full-time positions at Cognizant", "url": "https://www.livemint.com/companies/news/cognizant-launches-programme-to-help-tech-professionals-restart-career-11617081076903.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/cognizant-k6y--621x414@LiveMint_1617081582920.jpg", "publishedAt": "2021-03-30T05:20:19Z", "content": "Bengaluru: Cognizant Technology Solutions Corp has launched a 12-week paid 'Returnship Programme for technology professionals looking to restart their careers after a break.A break in a professionals… [+1723 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu Net Desk", "title": "Coronavirus updates | Trends show virus is still very active, says V.K. Paul - The Hindu", "description": "World leaders call for international pandemic treaty; impose fines on those flouting COVID-19 protocols: DGCA to airports", "url": "https://www.thehindu.com/news/national/coronavirus-live-march-30-2021-updates/article34195131.ece", "urlToImage": "https://www.thehindu.com/news/national/other-states/ciu0v3/article34195516.ece/ALTERNATES/LANDSCAPE_615/holi-guwahati", "publishedAt": "2021-03-30T04:55:00Z", "content": "The surge in the number of COVID-19 cases has gone from bad to worse, said member (health) of the NITI Aayog V.K. Paul on Tuesday as India registered 56,211 new cases in the last 24 hours.\r\nDr Paul s… [+12476 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Aparna Iyer", "title": "Why ICICI Bank is narrowing the valuation gap with HDFC Bank - Mint", "description": "ICICI Bank’s operating profit growth has been volatile since FY17 after a sharp rise in bad loans resulted in loss of interest income and necessitated an increase in provisioning. The lender’s corporate loan book has since then shown a decrease in slippages, …", "url": "https://www.livemint.com/market/mark-to-market/why-icici-bank-is-narrowing-the-valuation-gap-with-hdfc-bank-11617078930747.html", "urlToImage": "https://images.livemint.com/img/2021/03/30/600x338/icicibank_fd_interest_rate-kzrF--621x414@LiveMint_1617079303963.jpg", "publishedAt": "2021-03-30T04:47:23Z", "content": "MUMBAI: Shares of ICICI Bank Ltd have outperformed those of its peers and the sector index since January with good reason. A fast healing corporate loan book and early provisioning against risks from… [+2298 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Adani Transmission share price hits 52-week high on acquisition of Warora-Kurnool Transmission - Moneycontrol.com", "description": "Warora-Kurnool Transmission will develop, operate, and maintain transmission lines aggregating to around 1,750 ckt km.", "url": "https://www.moneycontrol.com/news/business/stocks/adani-transmission-share-price-hits-52-week-high-on-acquisition-of-warora-kurnool-transmission-6707691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/adani-transmission-717x435.jpg", "publishedAt": "2021-03-30T04:17:47Z", "content": "Adani Transmission share price touched a 52-week high of Rs 924.40, rising 6 percent in the early trade on March 30 after the company signed definitive agreements with Essel Infraprojects for the acq… [+759 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Hyundai Alcazar To Use A 150 BHP 2.0L Petrol Engine - Report - GaadiWaadi.com", "description": "Hyundai Alcazar will be unveiled in April and it will go on sale around June this year in India targeting a host of seven-seater SUVs", "url": "https://gaadiwaadi.com/hyundai-alcazar-to-use-a-150-bhp-2-0l-petrol-engine-report/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/2021-hyundai-alcazar-7-seater-3-2-e1616741772879.jpg", "publishedAt": "2021-03-30T04:05:29Z", "content": "Hyundai Motor India Limited (HMIL) has the Alcazar as its next big launch in the domestic market and it follows the introduction of the third generation i20 premium hatchback last year. The Alcazar w… [+1934 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Liau Y-Sing and Lilian Karunungan | Bloomberg", "title": "FTSE puts Indian govt bonds on watch for possible index inclusion - Business Standard", "description": "The FTSE announcement is an acknowledgment of India's efforts to liberalize its sovereign bond market", "url": "https://www.business-standard.com/article/markets/ftse-puts-indian-govt-bonds-on-watch-for-possible-index-inclusion-121033000128_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-07/15/full/1563213134-5699.jpg", "publishedAt": "2021-03-30T03:35:00Z", "content": "FTSE Russell has placed Indian government bonds on the watchlist for possible inclusion in one of its major global debt indexes, a move that may usher billions of dollars of inflows into the securiti… [+3583 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Petrol, diesel prices slashed: Check new rates here - Moneycontrol.com", "description": "Fuel prices today: While the price of petrol in Mumbai was Rs 96.98 per litre, the price of diesel in the financial hub dropped to Rs 87.96 per litre.", "url": "https://www.moneycontrol.com/news/business/economy/petrol-diesel-fuel-prices-mumbai-delhi-slashed-check-new-rates-here-6707401.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/fuelpetroldiesel-770x433.jpg", "publishedAt": "2021-03-30T03:13:39Z", "content": "Retail fuel prices were slashed on March 30 for the first time in five days following a decline in international fuel prices. The price of petrol was cut by 22 paise and that of diesel by 22 paise in… [+866 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Pfizer, Moderna COVID-19 vaccines highly effective after first shot: Study - The Indian Express", "description": "The risk of infection fell 90% by two weeks after the second shot, the study of nearly 4,000 U.S. healthcare personnel and first responders found.", "url": "https://indianexpress.com/article/world/pfizer-moderna-covid-19-vaccines-highly-effective-after-first-shot-study-7250882/", "urlToImage": "https://images.indianexpress.com/2021/03/AP21076586526806.jpg", "publishedAt": "2021-03-30T02:38:27Z", "content": "COVID-19 vaccines developed by Pfizer Inc with BioNTech SE and Moderna Inc reduced risk of infection by 80% two weeks or more after the first of two shots, according to data from a real-world U.S. st… [+2888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "Explained: What lies ahead for Tata and Mistry group after Supreme Court verdict? - The Indian Express", "description": "The petition was filed by Cyrus Pallonji Mistry against Tata Sons and Ratan Tata, alleging that his sacking as the Chairman of Tata Group was \"illegal\". The judgment brings the curtains down on one of the ugliest public spat in the history of boardroom wars i…", "url": "https://indianexpress.com/article/explained/tata-cyrus-pallonji-mistry-dispute-supreme-court-verdict-7246071/", "urlToImage": "https://images.indianexpress.com/2021/03/tata-1200.jpg", "publishedAt": "2021-03-30T02:26:54Z", "content": "The Supreme Court Friday allowed all appeals by the Tata Groupand upheld its decision to sack Cyrus Pallonji Mistry as the chairman and executive director of the group. The judgment brings down curta… [+3427 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Top 10 things to know before the market opens - Moneycontrol.com", "description": "Trends on SGX Nifty indicate a flat start for the broader index in India.", "url": "https://www.moneycontrol.com/news/business/markets/top-10-things-to-know-before-the-market-opens-10-6706711.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/12/SENSEX_NSE_nifty_BSE_Stock-market-770x433.jpg", "publishedAt": "2021-03-30T02:24:08Z", "content": "The BSE Sensex climbed 568.38 points, or 1.17 percent, to close at 49,008.50 on March 26 while the Nifty50 rose 182.40 points, or 1.27 percent, to 14,507.30. According to pivot charts, the key suppor… [+5340 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Dollar Down but Reaches One-Year High Against Yen as Inflation Fears Rise By Investing.com - Investing.com", "description": "Dollar Down but Reaches One-Year High Against Yen as Inflation Fears Rise", "url": "https://www.investing.com/news/forex-news/dollar-down-but-reaches-oneyear-high-against-yen-as-inflation-fears-rise-2460696", "urlToImage": "https://i-invdn-com.akamaized.net/news/LYNXMPED560CA-ORUBS_L.jpg", "publishedAt": "2021-03-30T02:22:00Z", "content": "By Gina Lee\r\nInvesting.com The dollar was down on Tuesday morning in Asia but reached a one-year high against the yen on Tuesday with climbing Treasury yields, the quickening U.S. COVID-19 vaccinatio… [+2544 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Surabhi Agarwal", "title": "Govt augments CoWin platform to deal with next phase of vaccination - Economic Times", "description": "User interface on the platform has been spruced up while existing features have been further simplified to cater to a larger proportion of the population expected to pre-register in the next phase drive.", "url": "https://economictimes.indiatimes.com/tech/technology/govt-augmenting-cowin-platform-to-deal-with-next-phase-of-vaccination/articleshow/81749532.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81749528,width-1070,height-580,imgsize-212435,overlay-ettech/photo.jpg", "publishedAt": "2021-03-29T23:30:00Z", "content": "The centre is augmenting the Covid-19 vaccine registration portal (CoWin) to process as many as 10 to 20 million registrations a day as it prepares for a sharp increase in usage with an aggressive ex… [+3927 chars]"}, {"source": {"id": null, "name": "FX Empire"}, "author": null, "title": "Dollar, Rising Yields, and Cryptocurrency Utilization Pressure Gold Lower - FX Empire", "description": "Gold, both spot and futures, traded significantly lower today in active trading.", "url": "https://www.fxempire.com/forecasts/article/dollar-rising-yields-and-cryptocurrency-utilization-pressure-gold-lower-714475", "urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2021/03/Depositphotos_136583180_s-2019-1.jpg", "publishedAt": "2021-03-29T22:45:40Z", "content": "According to businessinsider.com, U.S. payments firm Visa announced Monday that it would enable the use of USD Coin to settle payment transactions on its platform.\r\nVisa piloted the payment option vi… [+2080 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Govt gets multiple EoIs for privatisation of Neelachal Ispat Nigam - Business Standard", "description": "NINL is a joint venture of MMTC, NMDC, BHEL, MECON, and two Odisha government-owned undertakings - OMC and IPICOL", "url": "https://www.business-standard.com/article/economy-policy/govt-gets-multiple-eois-for-privatisation-of-neelachal-ispat-nigam-121033000012_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-08/01/full/1596223902-2487.jpg", "publishedAt": "2021-03-29T18:51:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "The Hindu BusinessLine", "title": "Data of 3.5 m MobiKwik users allegedly hacked - BusinessLine", "description": "Fintech platform denies claim, says user data safe", "url": "https://www.thehindubusinessline.com/info-tech/data-of-35-m-mobikwik-users-allegedly-hacked/article34192591.ece", "urlToImage": "https://www.thehindubusinessline.com/info-tech/z2b8ur/article34192590.ece/ALTERNATES/LANDSCAPE_615/bl30mobikwik", "publishedAt": "2021-03-29T16:48:16Z", "content": "Personal details of 3.5 million MobiKwik users seem to have been leaked, according to independent cybersecurity researchers. The Gurugram-based fintech platform, however, denied any breach, saying it… [+2316 chars]"}, {"source": {"id": null, "name": "KRGV"}, "author": "", "title": "Elon Musk: SpaceX SN-11 launch postponed after FAA inspector unable to reach Boca Chica facility - KRGV", "description": "The much-anticipated launch of SpaceX’s Starship prototype SN-11 on Monday has been postponed not because of the weather— but because of a problem with the Federal Aviation Administration.", "url": "http://www.krgv.com/news/elon-musk-spacex-sn-11-launch-postponed-after-faa-inspector-unable-to-reach-boca-chica-facility/", "urlToImage": "http://dcer237tfveol.cloudfront.net/v2/xVMjc0ZedKLzxLIzw9Y0gghxSpIDDE_upZRH1Fe0rXnqI5kEmqL70zzcmCwqhDhpXjCWhr6Ld7n8GeT0w-IVk0Hr8iYzLHw8qySLnz5O9-A0VqIUK9dQscEF1F-7YgVrg", "publishedAt": "2021-03-29T15:23:41Z", "content": "The much-anticipated launch of SpaceX’s Starship prototype SN-11 on Monday has been postponed not because of the weather— but because of a problem with the Federal Aviation Administration.\r\nSpaceX CE… [+744 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "S&P 500 ends a hair lower; hedge fund default concerns hit banks - Economic Times", "description": "Indexes ended off their lowest levels of the day. Optimism about speedy vaccinations and record stimulus, which drove the Dow and the S&P 500 to record closing highs last week, helped keep a floor in the market along with upbeat estimates for upcoming earning…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-open-lower-on-hedge-fund-default-concerns/articleshow/81747055.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81747063,width-1070,height-580,imgsize-59926,overlay-etmarkets/photo.jpg", "publishedAt": "2021-03-29T13:41:00Z", "content": "NEW YORK: The S&amp;P 500 ended just slightly in the red on Monday, with bank shares falling amid warnings of potential losses from a hedge fund's default on margin calls, while optimism over the eco… [+2056 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Ameya Naik", "title": "Mercedes-Benz EQS Cabin Revealed - carandbike", "description": "Mercedes-Benz has now revealed what the cabin of the EQS looks like and we have to say it looks something from outer space and the reason we say this is because of the MBUX Hyperscreen that is showcased in the car.", "url": "https://www.carandbike.com/news/mercedes-benz-eqs-cabin-revealed-2401511", "urlToImage": "https://c.ndtvimg.com/2021-03/s81n0qa8_mercedesbenz-eqs_625x300_29_March_21.jpg", "publishedAt": "2021-03-29T07:38:15Z", "content": "The EQS is the luxurious and avant-garde top-of-the-range model from Mercedes-EQ and while we've seen teasers from the company, we are looking forward to see what the car is actually like and come Ap… [+5537 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook, Google's New Plan To Connect Southeast Asia And America - NDTV", "description": "Facebook said on Monday it planned two new undersea cables to connect Singapore, Indonesia and North America in a project with Google and regional telecommunication companies to boost internet connection capacity between the regions.", "url": "https://www.ndtv.com/world-news/facebook-googles-plan-new-undersea-cables-to-connect-southeast-asia-and-america-2401439", "urlToImage": "https://c.ndtvimg.com/2020-08/0psfrbvg_facebook-generic-reuters_625x300_21_August_20.jpg", "publishedAt": "2021-03-29T05:23:18Z", "content": "Facebook said on Monday it planned two new undersea cables to connect Singapore, Indonesia and North America in a project with Google and regional telecommunication companies to boost internet connec… [+2529 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Andy Mukherjee | Bloomberg", "title": "Tata empire in stronger position against Mistry after Supreme Court verdict - Business Standard", "description": "There's room in India for a Tata super-app to compete with Mukesh Ambani's Reliance Industries Ltd", "url": "https://www.business-standard.com/article/companies/tata-empire-in-stronger-position-against-mistry-after-supreme-court-verdict-121032900187_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/misc/2018-07/25/full/ratan-tata-1532506573-75722410.jpg", "publishedAt": "2021-03-29T04:46:00Z", "content": "After several years of legal wrangling, India’s Tata Group has won a decisive victory over its disgruntled minority shareholder. But the boardroom coup that turned into a courtroom drama will only be… [+5700 chars]"}]}