{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol.com", "description": "Given the ongoing assembly polls, political uncertainty will reign and hence, investors are recommended to remain on the sidelines until some level of stability is restored, says Yesha Shah of Samco Securities.", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-27-8138271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Markets-1-770x433.jpg", "publishedAt": "2022-02-20T06:51:02Z", "content": "Consistent selling by FIIs and elevated oil prices fuelled worries in investors amid an escalating tension between Russia and Ukraine and a soaring inflation in the US. The benchmark indices, as a re… [+9294 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "2023 Toyota Innova spied ahead of launch - Team-BHP", "description": "Spy images of the next-generation Toyota Innova have surfaced online. The test mule is said to have been spotted in Thailand. On the outside, we can expect to see a number of visual changes, including a bold new front fascia with LED headlights, while the rea…", "url": "https://www.team-bhp.com/news/2023-toyota-innova-spied-ahead-launch", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2023-toyota-innova-new-gen-spied-launch-price-1-600x338.jpg", "publishedAt": "2022-02-20T06:44:47Z", "content": "Spy images of the next-generation Toyota Innova have surfaced online. The test mule is said to have been spotted in Thailand.\r\nOn the outside, we can expect to see a number of visual changes, includi… [+721 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "FPIs pull out ₹18,856 crore from Indian markets in February so far - Mint", "description": "As per depositories data, overseas investors took out  ₹15,342 crore from equities and  ₹3,629 crore from the bonds market between February 1-18", "url": "https://www.livemint.com/market/stock-market-news/fpis-pull-out-rs-18-856-crore-from-indian-markets-in-february-so-far-11645337122356.html", "urlToImage": "https://images.livemint.com/img/2022/02/20/600x338/FPIs_1645337323151_1645337323363.jpg", "publishedAt": "2022-02-20T06:10:58Z", "content": "New Delhi: Foreign portfolio investors (FPIs) have withdrawn a net 18,856 crore from the Indian markets in February so far amid geopolitical tensions and chances of a rate hike by the US Federal Rese… [+2022 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Daily Voice | LIC's market-cap on listing could be around Rs 15-17 lakh crore: Hemang Kapasi of Sanctum... - Moneycontrol.com", "description": "Insurance companies are usually valued on Embedded Value (EV). EV is nothing but the sum of the adjusted net worth and the discounted value of profits from in-force policies.", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-lics-market-cap-on-listing-could-be-around-rs-15-17-lakh-crore-hemang-kapasi-of-sanctum-wealth-8137471.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/03/Hemang-Kapasi-Sanctum-770x433.jpg", "publishedAt": "2022-02-20T05:32:45Z", "content": "Hemang Kapasi, Head of Equities at Sanctum Wealth said the market is seeing heavy volatility with the risk that the US Fed may raise interest rates by 0.25-0.5 percent in March meet itself.\r\nKapasi, … [+6013 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Movers & Shakers: 10 stocks that moved the most last week - Moneycontrol.com", "description": "Equity markets have seen a rise in volatility in the last couple of days due to varying news flows coming in from the Ukraine border. The Nifty has been trading in a broader range of 16,800-17,400 and needs a decisive breakout on either side for clear directi…", "url": "https://www.moneycontrol.com/news/photos/business/stocks/movers-shakers-10-stocks-that-moved-the-most-last-week-26-8136041.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/sensex_nifty_stocknew-1-770x433.jpg", "publishedAt": "2022-02-20T04:34:17Z", "content": null}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Veteran Trader Peter Brandt Warns Bitcoin's Price Corrections Can Be Lengthy – Markets and Prices Bitcoin News - Bitcoin News", "description": "Veteran trader Peter Brandt has warned that bitcoin's price corrections have taken many months in the past and it may take some time for the price of the cryptocurrency to hit another all-time high. He criticized bitcoin's proponents for constantly hyping the…", "url": "https://news.bitcoin.com/veteran-trader-peter-brandt-warns-bitcoins-price-corrections-lengthy/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/correction.jpg", "publishedAt": "2022-02-20T04:31:31Z", "content": "Veteran trader Peter Brandt has warned that bitcoin’s price corrections have taken many months in the past and it may take some time for the price of the cryptocurrency to hit another all-time high. … [+3073 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Auto Desk", "title": "Upcoming Maruti Suzuki Baleno Facelift Leaked Images Reveal More About the Car - News18", "description": "Ahead of its scheduled launch in India, a few leaked images of the upcoming Maruti Suzuki Baleno have made it to the internet. Here's what they suggest.", "url": "https://www.news18.com/news/auto/upcoming-maruti-suzuki-baleno-facelift-leaked-images-reveal-more-about-the-car-4782392.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/2022-maruti-suzuki-baleno-164533135716x9.jpg", "publishedAt": "2022-02-20T04:29:56Z", "content": "The Maruti Suzuki Baleno 2022 facelift version has been fully unveiled ahead of its launch which is expected by next week. The bookings were already open for the car and some spy photos had also made… [+1991 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Soaring fuel is bad timing for governments facing voters - Economic Times", "description": "Oils relentless march toward triple figures has already prompted political action from incumbents. India cut retail taxes on gasoline and diesel in November and theres been an unofficial freeze on prices since.", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/soaring-fuel-is-bad-timing-or-governments-facing-voters/articleshow/89697933.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89697913,width-1070,height-580,imgsize-50650,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-20T04:28:00Z", "content": "Soaring gasoline prices are fanning inflation and causing a headache for governments and central banks worldwide. In countries with elections coming up, theyre an extra headwind for the incumbents.\r\n… [+3903 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Top Cryptocurrency News Today: The biggest moves in NFTs, Bitcoin, crypto rules and more - Moneycontrol.com", "description": "A daily round-up of the most interesting articles on cryptocurrencies like Bitcoin, Ethereum, and Tether to help you jump-start the day", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/top-cryptocurrency-news-today-the-biggest-moves-in-nfts-bitcoin-crypto-rules-and-more-24-2-8138101.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Bitcoin_Jun8_21_Reuters-770x433.jpg", "publishedAt": "2022-02-20T03:55:15Z", "content": null}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Tarun", "title": "Car News That Mattered This Week: 2022 Maruti Baleno Updates, Four New Cars Crash Tested, Kia Carens Launched - CarDekho", "description": "This week we got all the dope on the 2022 Maruti Baleno, including its fuel economy, variant-wise features and images, and connected car features  These past seven days were quite busy with all the information about the 2022 Maruti Baleno, new global NCAP cra…", "url": "https://www.cardekho.com/india-car-news/car-news-that-mattered-this-week-2022-maruti-baleno-updates-four-new-cars-crash-tested-kia-carens-launched-28646.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/28645/1645328009509/GeneralNews.jpg", "publishedAt": "2022-02-20T03:04:00Z", "content": "This week we got all the dope on the 2022 Maruti Baleno, including its fuel economy, variant-wise features and images, and connected car features\r\nThese past seven days were quite busy with all the i… [+1302 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sangeeta Ojha", "title": "How digital rupee will be different from Wallet and UPI payment systems - Mint", "description": "Experts say that the digital rupee will increase the success rates of transactions.", "url": "https://www.livemint.com/market/commodities/how-digital-rupee-will-be-different-from-wallet-and-upi-payment-systems-11645319647971.html", "urlToImage": "https://images.livemint.com/img/2022/02/20/600x338/digital_rupee_digital_payments_1645321372877_1645321373093.jpg", "publishedAt": "2022-02-20T02:31:46Z", "content": "The proposed digital rupee to be issued by the Reserve Bank of India (RBI) starting from the next financial year will give a boost to the digital economy. Announcing the introduction of the digital r… [+2331 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Shark Tank's Kevin O'Leary Expects Bitcoin to 'Appreciate Dramatically' in 2-3 Years – Markets and Prices Bitcoin News - Bitcoin News", "description": "Kevin O'Leary, aka Mr. Wonderful, has shared what he thinks the price of bitcoin will be in the coming years. He said when institutions get the go-ahead from their compliance departments to invest in bitcoin, the price of the cryptocurrency \"is going to appre…", "url": "https://news.bitcoin.com/shark-tanks-kevin-oleary-bitcoin-appreciate-dramatically-2-3-years/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/kevin-oleary.jpg", "publishedAt": "2022-02-20T02:31:12Z", "content": "Kevin O’Leary, aka Mr. Wonderful, has shared what he thinks the price of bitcoin will be in the coming years. He said when institutions get the go-ahead from their compliance departments to invest in… [+2795 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Pavel Matveev", "title": "Web3 might be crypto’s key to the mainstream market - Cointelegraph", "description": "It’s time to explore the impact Web3 could have, as mass crypto adoption may be on the horizon, but how is it going to happen?", "url": "https://cointelegraph.com/news/web3-might-be-crypto-s-key-to-the-mainstream-market", "urlToImage": "https://images.cointelegraph.com/images/1200_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDIvYjNiZTBjOGItMjljZi00ZjJkLWE3N2EtYTUxMDUzNDljMjQ5LmpwZw==.jpg", "publishedAt": "2022-02-20T02:13:43Z", "content": "2021 has been a significant year for crypto with no fungible token (NFT) being awarded word of the year, decentralized finance (DeFi) trending in the mainstream media and crypto companies making head… [+6939 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Five companies submit proposals to set up semiconductor and display facilities - Economic Times", "description": "The first round of applications was invited till February 15, for establishment of semiconductor and display fabs,  the release read.  Despite aggressive timelines for submission of applications in this greenfield segment of semiconductor and display manufact…", "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/five-companies-submit-proposals-to-set-up-semiconductor-and-display-facilities/articleshow/89696083.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89696113,width-1070,height-580,imgsize-102506,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-20T01:43:00Z", "content": "The government said on Saturday that it received proposals from five companies to set up electronic chip and display manufacturing plants with investment of $20.5 billion (1.53 lakh crore).\r\nA Vedant… [+3031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Board knew of NSE chief’s misconduct but let her resign with glowing praise - The Indian Express", "description": "Board did not inform market regulator SEBI of the ‘grave irregularities’", "url": "https://indianexpress.com/article/india/board-knew-of-nse-chiefs-misconduct-let-her-resign-praise-7781803/", "urlToImage": "https://images.indianexpress.com/2022/02/chitra-ramkrishna-nse-reuters-1200.jpeg", "publishedAt": "2022-02-20T01:38:11Z", "content": "THE BOARD OF the National Stock Exchange (NSE) failed to inform the market regulator Securities and Exchange Board of India (SEBI) despite having knowledge of grave irregularities and misconduct on t… [+5989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Khushboo Narayan", "title": "ABG Group firm value Rs 450 crore, up over six times in one month - The Indian Express", "description": "Both ABG Shipyard and ABG Cement, part of the Rishi Agarwal-led ABG Group, are facing liquidation after defaulting on loan repayment to lenders.", "url": "https://indianexpress.com/article/business/companies/abg-group-firm-value-rs-450-crore-7781797/", "urlToImage": "https://images.indianexpress.com/2022/02/bombay-high-court-1200-1.jpg", "publishedAt": "2022-02-20T01:03:17Z", "content": "An increase in valuation from Rs 450 crore to Rs 3,000 crore in less than a month this is not a startup, but a property of ABG Cement Ltd, a sister concern of the scam-ridden ABG Shipyard Ltd, that t… [+3376 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Elon Musk Reveals Dogecoin Will Be Accepted at Tesla's New Futuristic Diner, Drive-in Theater – Bitcoin News - Bitcoin News", "description": "Elon Musk has revealed that Tesla's upcoming futuristic diner and drive-in theater, planned for the Hollywood area, will accept the meme cryptocurrency dogecoin. The electric car company currently accepts DOGE for some merchandise on its website.", "url": "https://news.bitcoin.com/elon-musk-dogecoin-accepted-teslas-new-futuristic-diner-drive-in-theater/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/tesla-1.jpg", "publishedAt": "2022-02-20T00:41:45Z", "content": "Elon Musk has revealed that Tesla’s upcoming futuristic diner and drive-in theater, planned for the Hollywood area, will accept the meme cryptocurrency dogecoin. The electric car company currently ac… [+2962 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Fed Bans Senior Officials From Cryptocurrency Investing – Regulation Bitcoin News - Bitcoin News", "description": "The Federal Reserve has banned its senior officials from investing in cryptocurrency. “Officials covered by the new rules will have 12 months from the effective date of the rules to dispose of all impermissible holdings,” said the Federal Open Market Committe…", "url": "https://news.bitcoin.com/fed-bans-senior-officials-from-cryptocurrency-investing/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/fed-prohibits.jpg", "publishedAt": "2022-02-19T22:35:58Z", "content": "The Federal Reserve has banned its senior officials from investing in cryptocurrency. “Officials covered by the new rules will have 12 months from the effective date of the rules to dispose of all im… [+3189 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Rekha chauhan", "title": "Bitcoin (BTC) Price Prediction: BTC Stays Quite Near $40k, Waiting For Next Catalyst - Coingape", "description": "Bitcoin (BTC) price paused the previous three days of losses on Saturday. The price trades in a tight range with no meaningful price action. Bitcoin price rallied 25% since February 3 testing a critical resistance barrier. However, this uptrend failed to sust…", "url": "https://coingape.com/markets/bitcoin-btc-price-prediction-btc-stays-quite-near-40k-waiting-for-next-catalyst/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/02/19175019/Bitcoin-whales.jpeg", "publishedAt": "2022-02-19T21:15:40Z", "content": "Bitcoin (BTC) price paused the previous three days of losses on Saturday. The price trades in a tight range with no meaningful price action. Bitcoin price rallied 25% since February 3 testing a criti… [+1905 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Federal Bank arm FedFina files draft papers with SEBI to raise funds through IPO - Moneycontrol.com", "description": "The IPO consists of a fresh issue of Rs 900 crore and an offer for sale (OFS) of up to 45.71 million shares by its existing shareholders and promoters.", "url": "https://www.moneycontrol.com/news/business/ipo/fedfina-files-draft-papers-with-sebi-to-raise-funds-via-ipo-8137881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Federal-Bank-770x433.jpg", "publishedAt": "2022-02-19T16:36:53Z", "content": "Federal Bank Ltd arm Fedbank Financial Services Ltd (FedFina) has filed draft papers with the Securities Exchange Board of India to raise funds via an initial public offering.\r\nThe IPO consists of a … [+2375 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Kalpataru Power Transmission to merge arm JMC Projects with self, swap ratio fixed at 1:4 - Moneycontrol.com", "description": "The board of the two companies approved the merger plan and according to swap ratio, JMC’s shareholders, other than KPTL, will be allotted one share of KPTL against every four shares held by them in JMC.", "url": "https://www.moneycontrol.com/news/business/economy/kalpataru-power-transmission-to-merge-arm-jmc-with-self-swap-ratio-fixed-at-14-8137551.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Discoms-564x435.jpg", "publishedAt": "2022-02-19T14:25:24Z", "content": "Kalpataru Power Transmission Ltd (KPTL) will merge its subsidiary JMC Projects (India) Ltd (JMC) with self, the two companies said on February 19.\r\nThe merger is aimed at leveraging on operational sy… [+3588 chars]"}, {"source": {"id": null, "name": "BeInCrypto"}, "author": null, "title": "European Union Open to Crypto, Says Home Affairs Commissioner - BeInCrypto", "description": "Regulation and cybercriminal activity in the crypto industry formed the dialogue around crypto at the Munich Security Conference 2022.", "url": "https://beincrypto.com/european-union-open-to-crypto-says-home-affairs-commissioner/", "urlToImage": "https://s32659.pcdn.co/wp-content/uploads/2021/09/BIC_europe_crypto_regulations_EU.jpg.webp", "publishedAt": "2022-02-19T13:10:00Z", "content": "Regulation and cybercriminal activity in the crypto industry formed the dialogue around crypto at the Munich Security Conference2022.\r\nEuropean Union Commissioner for Home Affairs said that the Europ… [+3007 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "How a Russia-Ukraine conflict might hit global markets - Times of India", "description": "International Business News:  LONDON: A potential invasion of Ukraine by neighbouring Russia would be felt across a number of markets, from wheat and energy prices and the region'.", "url": "https://timesofindia.indiatimes.com/business/international-business/how-a-russia-ukraine-conflict-might-hit-global-markets/articleshow/89688186.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-89688458,width-1070,height-580,imgsize-124112,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-02-19T12:57:00Z", "content": "How a Russia-Ukraine conflict might hit global markets"}, {"source": {"id": null, "name": "The Daily Hodl"}, "author": "Daily Hodl Staff", "title": "Crypto Whales Gobble Up Over $708,000,000 in XRP Amid Massive Accumulation Spree: Analytics Firm Santiment - The Daily Hodl", "description": "Crypto analytics firm Santiment says big players in the world of cryptocurrency are buying XRP at a frantic pace.", "url": "https://dailyhodl.com/2022/02/19/crypto-whales-gobble-up-over-708000000-in-xrp-amid-massive-accumulation-spree-analytics-firm-santiment/", "urlToImage": "https://i0.wp.com/dailyhodl.com/wp-content/uploads/2022/02/crypto-whales-gobble-xrp.jpg?fit=1365%2C800&ssl=1", "publishedAt": "2022-02-19T12:46:35Z", "content": "Crypto analytics firm Santiment says big players in the world of cryptocurrency are buying XRP at a frantic pace.\r\nThe market insights agency says that the current rate of XRP’s whale accumulation ha… [+1253 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "BigBasket acquires Kerala-based startup Agrima Infotech - Economic Times", "description": "BigBasket will be implementing Kochi-based startup Agrima Infotechs unique customer vision technology platform, Psyight, at the self-checkout counters of the formers retail stores.", "url": "https://economictimes.indiatimes.com/tech/startups/bigbasket-acquires-kerala-based-startup-agrima-infotech/articleshow/89688169.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89688170,width-1070,height-580,imgsize-100282,overlay-ettech/photo.jpg", "publishedAt": "2022-02-19T12:41:00Z", "content": "New Delhi: Tata Group-owned etailer BigBasket on Saturday announced that it has acquired the enterprise business unit of a deep-tech company Agrima Infotech in a bid to revolutionise offline retail.\r… [+1153 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Full-Size SUV Sales In Jan 2022 - Fortuner, Gloster, Kodiaq, Alturas, C5 - GaadiWaadi.com", "description": "Toyota Fortuner recorded a total of 811 units in the month of January 2022 as against 1,169 units with a YoY sales decline of 30.6 per cent", "url": "https://gaadiwaadi.com/full-size-suv-sales-in-jan-2022-fortuner-gloster-kodiaq-alturas-c5/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/12/Toyota-Fortuner-modified-bronza-gold-img1.jpg", "publishedAt": "2022-02-19T11:30:51Z", "content": "In the month of January 2022, Toyota Kirloskar Motor (TKM) had the Fortuner finish on top of the full-size SUV sales charts as 811 units were sold against 1,169 units during the same period in 2021 w… [+2249 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Trisha Sengupta", "title": "Man claims he became richer than Elon Musk for seven minutes - Hindustan Times", "description": "YouTuber Max Fosh shared a video and claimed that he became world’s richest person for seven minutes leaving behind Elon Musk. | Trending", "url": "https://www.hindustantimes.com/trending/man-claims-he-became-richer-than-elon-musk-for-seven-minutes-101645263069619.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/19/1600x900/UK_Elon_Musk_worlds_richest_man_video_YouTube_1645263570457_1645263582441.PNG", "publishedAt": "2022-02-19T09:48:17Z", "content": "A video of a UK man claiming that he became worlds richest person for seven minutes leaving behind Tesla founder Elon Musk has created a chatter online. The video shows YouTuber Max Fosh who explaine… [+1803 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Better.com set for another mass layoff after CEO Vishal Gargs return - Business Standard", "description": "The return of Vishal Garg, the controversial Indian-American CEO of digital mortgage company better.com, is set for another round of mass layoffs next month, the media reported.", "url": "https://www.business-standard.com/article/international/better-com-set-for-another-mass-layoff-after-ceo-vishal-garg-s-return-122021900515_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/06/full/1638801469-9468.png", "publishedAt": "2022-02-19T09:45:00Z", "content": "The return of Vishal Garg, the controversial Indian-American CEO of digital mortgage company better.com, is set for another round of mass layoffs next month, the media reported.\r\nSeveral senior execu… [+3339 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Future Retail pays nearly ₹104.55 cr interest on dollar bond in grace period - Mint", "description": "Future Retail had stated on 24 January that it had a payment of interest due on the USD Notes as its liquidity position had remained affected due to the continued impact of the Covid-19 on its business operations", "url": "https://www.livemint.com/companies/news/future-retail-pays-nearly-rs-104-55-cr-interest-on-dollar-bond-in-grace-period-11645260834106.html", "urlToImage": "https://images.livemint.com/img/2022/02/19/600x338/future_retail_1645261889342_1645261889572.jpg", "publishedAt": "2022-02-19T09:13:32Z", "content": "Future Retail Ltd (FRL) has made a payment of USD 14 million (around 104.55 crore) as interest due on the dollar-denominated notes (USD Notes) listed on the Singapore Stock Exchange, the debt-ridden … [+2083 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Bloomberg", "title": "Nasdaq sinks into Death Cross for first time since April 2020 - Business Standard", "description": "The formation occurred in June 2000 when the dot-com bubble burst and again in January 2008 ahead of the global financial crisis", "url": "https://www.business-standard.com/article/international/nasdaq-sinks-into-death-cross-for-first-time-since-april-2020-122021900484_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/12/full/1631469945-5733.jpg", "publishedAt": "2022-02-19T08:28:00Z", "content": "The Nasdaq Composite Index tumbled into an ominous “death cross” technical formation Friday for the first time since April 2020, when the pandemic battered the global economy and U.S. equity markets … [+3370 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Renault Arkana (Tata Harrier Rival) Spied in India For The First Time - GaadiWaadi.com", "description": "Renault Arkana has been spied testing in India, giving rise to speculations about its imminent launch in our market", "url": "https://gaadiwaadi.com/renault-arkana-tata-harrier-rival-spied-in-india-for-the-first-time/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/02/renault-akrana-1.jpg", "publishedAt": "2022-02-19T07:48:13Z", "content": "In November last year, Renault India had teased Arkana on its social media handles. There had been no development on the matter since, until recently, when a test model of it was spotted during a roa… [+1945 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Losing Tech War To China? After Hypersonic Missiles, Ex-Google CEO Says US Far Behind In Another Critical Technology - EurAsian Times", "description": "The United States is lagging behind China in the research and development of hypersonic weapons technology. Top American military officers and defense industry leaders have already raised the alarm about China’s rapid progress in the hypersonic domain. In Jul…", "url": "https://eurasiantimes.com/google-ceo-says-us-far-behind-in-another-critical-technology/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2021/09/Hypersonic-HAWC-e1632844734760.jpg", "publishedAt": "2022-02-19T07:47:41Z", "content": "The United States is lagging behind China in the research and development of hypersonic weapons technology. Top American military officers and defense industry leaders have already raised the alarm a… [+3997 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Roshni Agarwal", "title": "Multibagger Speciality Chemicals Penny Stock To Buy: More Upside Seen From Current Levels - Goodreturns", "description": "Value buying is seen to take over amid the highly volatility as well as various factors that currently influence the markets. Amid it if you get a recommendation on a penny stock that is priced below Rs. 5, what can be a better deal than it.", "url": "https://www.goodreturns.in/personal-finance/investment/multibagger-speciality-chemicals-penny-stock-to-buy-more-upside-seen-from-current-levels-1240550.html", "urlToImage": "https://www.goodreturns.in/img/2022/02/goodreturns45-1645256664.jpg", "publishedAt": "2022-02-19T07:46:32Z", "content": "This stock we are going to disclose soon below has had a superb run in the last 1-year and on a YTD basis has rallied again 69%. Experts now suggest that this scrip is close to its breakout levels an… [+1401 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "India’s CRED eyes investment in Amazon-backed Smallcase - TechCrunch", "description": "Indian fintech CRED is in talks to back the Bengaluru-headquartered startup Smallcase, three sources familiar with the matter said, as the Tiger Global and Alpha Wave Global-backed firm looks to expand its wealth offerings to customers. CRED’s proposed invest…", "url": "http://techcrunch.com/2022/02/18/cred-smallcase/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/10/india-cred-techcrunch.jpg?w=664", "publishedAt": "2022-02-19T07:27:26Z", "content": "Indian fintech CRED is in talks to back the Bengaluru-headquartered startup Smallcase, three sources familiar with the matter said, as the Tiger Global and Alpha Wave Global-backed firm looks to expa… [+1795 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "Want a multibagger like Bajaj Finance? Hunt in the world of 280 pages and not 280 characters - Economic Times", "description": "Sometimes the insights from this document can be more rewarding than those from the so-called sectoral research reports.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/a-boring-exercise-can-help-you-spot-multibaggers-like-bajaj-finance-early/articleshow/89659738.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89681530,width-1070,height-580/photo.jpg", "publishedAt": "2022-02-19T07:08:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "Swarajya Staff", "title": "Big Boost For EV Charging Infra In India: Indian Oil, BPCL And HPCL To Set Up 22,000 EV Charging Stations Across The Country - Swarajya", "description": null, "url": "https://swarajyamag.com/infrastructure/big-boost-for-ev-charging-infra-in-india-indian-oil-bpcl-and-hpcl-to-set-up-22000-ev-charging-stations-across-the-country", "urlToImage": "https://gumlet.assettype.com/swarajya%2F2021-08%2F57019d3f-1e20-46bb-85b7-7bb9c47adbf6%2Fev_charging_station_at_karnal.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-02-19T07:07:43Z", "content": "The government on Saturday (19 February) said that India has a total of 1640 operational public electric vehicle chargers at present and it plans to expand the EV infra coverage to various cities in … [+3395 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Wall St Week Ahead: Surging oil prices add another worry for frazzled investors - Economic Times", "description": "Rapidly rising oil prices can be a troubling development for markets, as they cloud the economic outlook by increasing costs for businesses and consumers. Higher crude also threatens to accelerate already-surging inflation, compounding worries that the Fed wi…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-surging-oil-prices-add-another-worry-for-frazzled-investors/articleshow/89681191.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89681235,width-1070,height-580,imgsize-53532,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-19T06:51:00Z", "content": "NEW YORK: A U.S. stock market, already on edge from a hawkish Federal Reserve and a conflict between Russia and Ukraine, now has another worry: higher oil prices.\r\nU.S. crude prices stand at around $… [+4359 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Ambar Warrick", "title": "Russia-Ukraine Tensions Wipe $160 Billion Off Crypto Markets; Stablecoin Demand Rises - Coingape", "description": "According to data from coinmarketcap.com, crypto's market capital slumped to $1.82 trillion from $1.98 trillion through the week to Feb. 19, losing about 8.1%.  In comparison, the S&P 500 stock index lost about 1.4% this week. Crypto market cap sinks 8.1% thi…", "url": "https://coingape.com/russia-ukraine-tensions-wipe-160-billion-crypto-market/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/02/14200235/ATII-HT-crypto-traditonal-bank-Nov.-2020.jpg", "publishedAt": "2022-02-19T06:49:25Z", "content": "According to data from coinmarketcap.com, crypto’s market capital slumped to $1.82 trillion from $1.98 trillion through the week to Feb. 19, losing about 8.1%.  In comparison, the S&amp;P 500 stock i… [+2244 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "The only sure thing in stock market these days: Volatility - Mint", "description": "If Nifty manages to take out the 17400-17600 supply zone, then we can expect a rally towards 18000/18300 levels: Analyst", "url": "https://www.livemint.com/market/stock-market-news/the-only-sure-thing-in-stock-market-these-days-volatility-11645249223735.html", "urlToImage": "https://images.livemint.com/img/2022/02/19/600x338/Bombay_Stock_exchange_1645250251912_1645250252060.JPG", "publishedAt": "2022-02-19T06:03:40Z", "content": "Market ends with a minor cut after a highly volatile week amid geopolitical uncertainties and volatility may continue this week as well because there is no clear picture about the Russia-Ukraine stan… [+1885 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Apoorva Bellapu", "title": "Top 10 Bitcoin Stocks to Stake Up for Good Returns in 2022 - Analytics Insight", "description": "Bitcoin is one of the favorite investments in the crypto market. This is why the investors are keen to know what are the top bitcoin stocks to earn high returns. Have a look at the top 10 Bitcoin stocks to stake up for good returns in 2022.", "url": "https://www.analyticsinsight.net/top-10-bitcoin-stocks-to-stake-up-for-good-returns-in-2022/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/02/Top-10-Bitcoin-Stocks-to-Stake-Up-for-Good-Returns-in-2022.jpg", "publishedAt": "2022-02-19T05:39:14Z", "content": "Bitcoin has taken multiple turns ever since its launch. What keeps the investors inclined towards Bitcoin is the very fact that it promises the investors of high returns. The trend that is seen over … [+3405 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Market fall continues in second week; 63 small-cap stocks slip 10-22% - Moneycontrol.com", "description": "Broader indices underperformed main indices with BSE Midcap index falling 2 percent and Smallcap indices plunging 3.2 percent. The Assembly polls, political uncertainty are expected to keep the market volatile and investors should wait until stability is rest…", "url": "https://www.moneycontrol.com/news/business/markets/market-fall-continues-in-second-week-63-small-cap-stocks-slip-10-22-8135671.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/fandosensexniftyderivative-770x433.jpg", "publishedAt": "2022-02-19T05:38:12Z", "content": "Market witnessed selling in the second straight week ended February 18 amid volatility on the back of Russia-Ukraine crisis led to rising crude oil prices and US Fed minutes indicating possibility of… [+6658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Man Finds Chicken Foot In Takeaway, Says It Made Him 'Physically Sick' - NDTV Food", "description": "A UK man was disgusted to find a chicken foot in his meal. He said the observation made him feel \"physically sick\".", "url": "https://food.ndtv.com/news/uk-man-finds-chicken-foot-in-takeaway-meal-says-unlikely-to-eat-chicken-again-2777028", "urlToImage": "https://c.ndtvimg.com/2018-11/o1ddk2l8_chicken-wings_625x300_16_November_18.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-19T05:34:24Z", "content": "Many people prefer to buy food from outside and relish it in a relaxed environment at home. Takeaway services are also useful for those with family members who could not visit an eatery. But a man in… [+1800 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Tata Punch, Safari Kaziranga Editions spotted at dealership - Team-BHP", "description": "It seems Tata Motors is gearing up to launch Kaziranga Editions of its SUVs soon as the cars have started reaching dealerships. Last week, Tata Motors unveiled the Punch Kaziranga Edition that is being auctioned at the IPL 2022. The proceeds from the sale wil…", "url": "https://www.team-bhp.com/news/tata-punch-safari-kaziranga-editions-spotted-dealership", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20220219_093111.jpg", "publishedAt": "2022-02-19T05:12:02Z", "content": "It seems Tata Motors is gearing up to launch Kaziranga Editions of its SUVs soon as the cars have started reaching dealerships.\r\nLast week, Tata Motors unveiled the Punch Kaziranga Edition that is be… [+640 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Moneycontrol Pro Weekender: Investors have no choice but to embrace volatility - Moneycontrol.com", "description": "The windshield for investors is turning hazier as geopolitics, oil and an imminent rate hike by the Fed make the journey challenging", "url": "https://www.moneycontrol.com/news/business/markets/moneycontrol-pro-weekender-in-a-tighter-spot-8134571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Stocks-up-770x433.jpg", "publishedAt": "2022-02-19T04:48:08Z", "content": "Dear Reader,\r\nAt the end of a volatile week, the benchmark Indian indices are little changed. But as an equity markets investor, you would have heard the cannons to the right and the cannons to the l… [+7921 chars]"}, {"source": {"id": null, "name": "The-ken.com"}, "author": null, "title": "The CEO, the Yogi, and the stock exchange - The Nutgraf by The Ken - The Ken", "description": "What an investigation into the going-ons at the NSE by SEBI reveals about everyone", "url": "https://the-ken.com/the-nutgraf/the-ceo-the-yogi-and-the-stock-exchange/", "urlToImage": "https://the-ken.com/wp-content/uploads/2022/02/Nutgraf_Lede.png", "publishedAt": "2022-02-19T04:37:54Z", "content": "And as the story goes, the day she assumed office, she walked in with a gentleman named Anand Subramanian. Pay attention to that name. He’s an important part of the story. When Subramanian joined the… [+3307 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "FBI Launches 'Virtual Asset Exploitation Unit' With Specialized Team of Crypto Experts – Regulation Bitcoin News - Bitcoin News", "description": "The FBI has launched a new cryptocurrency unit to tackle crypto exploitation, and that will work with the Department of Justice.", "url": "https://news.bitcoin.com/fbi-launches-virtual-asset-exploitation-unit-specialized-team-of-crypto-experts/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/fbi-new-unit-1.jpg", "publishedAt": "2022-02-19T04:34:28Z", "content": "The Federal Bureau of Investigation (FBI) has launched a new unit to tackle crypto exploitation. The new team will work with the National Cryptocurrency Enforcement Team of the Department of Justice … [+2654 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "In pics: Cities with most millionaire households, brands high-net-worth persons prefer - Moneycontrol.com", "description": "The second edition of the Hurun India Wealth Report 2021 and Hurun Indian Luxury Consumer Survey 2021 were released on February 18.", "url": "https://www.moneycontrol.com/news/photos/trends/in-pics-cities-with-most-millionaire-households-brands-high-net-worth-persons-prefer-8135921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/rupeegain_dollar-770x433.jpg", "publishedAt": "2022-02-19T04:17:41Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Sebi plans tougher disclosure norms for new-age companies' IPOs - Economic Times", "description": "In the discussion paper, Sebi observed that the current IPO rules only require companies to disclose 'traditional parameters' such as key accounting ratios. However, since the new-age companies are usually loss-making, the regulator felt there was need for ad…", "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/sebi-plans-tougher-disclosure-norms-for-new-age-companies-ipos/articleshow/89677977.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89678038,width-1070,height-580,imgsize-1245147,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-19T03:48:00Z", "content": "Mumbai: Market regulator Securities and Exchange Board of India (Sebi) has proposed to tighten disclosure standards for new-age companies that plan to float initial public offerings (IPOs).\r\nAccordin… [+2631 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Top 10 Bikes In Jan 2022 - Splendor, Shine, Pulsar, Platina, Apache, FZ - GaadiWaadi.com", "description": "Hero Splendor posted a total of 2,08,263 units in the month of January 2022 as against 2,25,382 units with a YoY sales drop of 7.6 per cent", "url": "https://gaadiwaadi.com/top-10-bikes-in-jan-2022-splendor-shine-pulsar-platina-apache-fz/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/2021-Royal-enfield-classic-350-4421.jpg", "publishedAt": "2022-02-19T03:00:54Z", "content": "In the first month of the new calendar year, Hero MotoCorp had the Splendor finish at the top of the motorcycle sales charts as 2,08,263 units were recorded against 2,25,382 units during the same per… [+2515 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Sunil Fernandes", "title": "3 Bluechip Stocks To Buy Next Week At Near 52-Week Lows - Goodreturns", "description": "Stocks have fallen a tad bit this week following simmering tensions around the Russia-Ukraine border. Here are a few stocks that you could buy next week, which are trading near 52-week lows.", "url": "https://www.goodreturns.in/personal-finance/investment/3-bluechip-stocks-to-buy-next-week-at-near-52-week-lows-1240531.html", "urlToImage": "https://www.goodreturns.in/img/2022/02/istockphoto-1161683825-612x6121-1613128950-1645237219.jpg", "publishedAt": "2022-02-19T02:25:45Z", "content": "The stock is trading at Rs 293, as against the 52-week price of Rs 280. The shares of Kalyani Steels is fundamentally also sound, having a long standing track record of producing alloy steel, with a … [+2441 chars]"}, {"source": {"id": null, "name": "CryptoGlobe"}, "author": "Francisco Memoria", "title": "Ethereum ($ETH) May Lose Dominance to Competitors Like Cardano ($ADA) or Solana ($SOL): Morgan Stanley - CryptoGlobe", "description": "Morgan Stanley’s wealth management global investment office has published a new report on the second-largest cryptocurrency by market capitalization, Ethereum (ETH), noting it could lose market dominance to competitors like Cardano ($ADA), Tezos ($XTZ), and S…", "url": "https://www.cryptoglobe.com/latest/2022/02/ethereum-eth-may-lose-dominance-to-competitors-like-cardano-ada-or-solana-sol-morgan-stanley/", "urlToImage": "https://cryptoglobe.s3.eu-west-2.amazonaws.com/2022/02/tezos-Dd9Wkk5vj80-unsplash-768x512.jpg", "publishedAt": "2022-02-18T22:53:46Z", "content": "Morgan Stanleys wealth management global investment office has published a new report on the second-largest cryptocurrency by market capitalization, Ethereum (ETH), noting it could lose market domina… [+3139 chars]"}, {"source": {"id": null, "name": "DailyFX"}, "author": "James Stanley", "title": "Gold Price Technical Forecast: The War Bid Takes Over XAU/USD - DailyFX", "description": "Gold has jumped up to a fresh eight-month-high this week and it may not be done yet, as an end to the Russia-Ukraine threat doesn't yet appear near.", "url": "https://www.dailyfx.com/forex/technical/article/fx_technical_weekly/2022/02/18/Gold-Price-Technical-Forecast-The-War-Bid-Takes-Over-XAU-USD-XAUUSD-Price-Action.html", "urlToImage": "https://a.c-dn.net/b/3AjwRi/headline_GOLD_07.JPG", "publishedAt": "2022-02-18T20:00:00Z", "content": "Gold Technical Forecast: Bullish\r\n<ul><li>Gold prices hit a fresh eight-month-high this week, driven by the prospect of further tension between Russia and Ukraine. </li><li>Gold has started to move i… [+3072 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Josh Owens", "title": "Iran Rises Above Russia On The Oil Market Radar | OilPrice.com - OilPrice.com", "description": "Oil prices are set to record their first weekly decrease in nine weeks as a potential Iran nuclear deal grabs the attention of traders and analysts", "url": "https://oilprice.com/Energy/Energy-General/Iran-Rises-Above-Russia-On-The-Oil-Market-Radar.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-02-18_t1kdwmorea.jpg", "publishedAt": "2022-02-18T20:00:00Z", "content": "ESG funds have taken over…\r\nAs tensions between Russia and…\r\nA major activist investment fund…\r\nBy Josh Owens - Feb 18, 2022, 2:00 PM CSTIran has risen above Russia on the oil market radar due to rep… [+5242 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Patti Domm", "title": "Russia's Ukraine threat and worries on Fed rate hikes could make for a turbulent week in markets - CNBC", "description": "Russia and Ukraine will likely be top of mind going into the week, and analysts are watching key technical levels for stocks.", "url": "https://www.cnbc.com/2022/02/18/russias-ukraine-threat-worries-on-fed-rate-hikes-could-make-for-a-turbulent-week-in-markets.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107016318-1645032055468Trading-Floor-OB-Photo-220216-CC-PRESS-13.jpg?v=1645032945", "publishedAt": "2022-02-18T19:36:58Z", "content": "The stock market faces another turbulent week, as investors watch the situation in Ukraine and continue to adjust portfolios ahead of the Federal Reserve's interest rate hikes.\r\nStocks were rocked in… [+9421 chars]"}, {"source": {"id": null, "name": "Visual Capitalist"}, "author": "Niccolo Conte", "title": "The Future of Global Coal Production (2021-2024F) - Visual Capitalist", "description": "Coal came under scrutiny for its high carbon emissions at COP26, but many countries are forecasted to increase coal production until 2024.", "url": "https://www.visualcapitalist.com/future-of-global-coal-production-2021-2024f/", "urlToImage": "https://www.visualcapitalist.com/wp-content/uploads/2022/02/Coal-Production-2024-SHARE.jpg", "publishedAt": "2022-02-18T19:31:21Z", "content": "The Future of Global Coal Production Visualized\r\nThis was originally posted on Elements. Sign up to the free mailing list to get beautiful visualizations on natural resource megatrends in your email … [+3989 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bhavya Dilipkumar and Dia Rekhi", "title": "Vedanta charts $8 billion chip manufacturing plan via Foxconn JV - Economic Times", "description": "The company will target smartphones and electronics with the 28-nanometre (nm) fab and look at 70-80% domestic market, while the rest will be exported.", "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/vedanta-charts-8-billion-chip-manufacturing-plan-via-foxconn-jv/articleshow/89672585.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89672619,width-1070,height-580,imgsize-47226,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-18T18:32:00Z", "content": "Anil Agarwal's Vedanta group plans to invest $8.4 billion in a chip manufacturing unit in partnership with Hon Hai Technology Group (Foxconn), a top executive told ET. The company has already applied… [+2063 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Shiba Inu Devs Announce \"Doggy DAO\" Launch - U.Today", "description": "DAO 1, the first iteration of Shiba Inu’s decentralized autonomous organization, has gone live on the ShibaSwap decentralized exchange", "url": "https://u.today/shiba-inu-devs-announce-doggy-dao-launch", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/AdobeStock_483363141.jpeg", "publishedAt": "2022-02-18T18:26:56Z", "content": "The first version of DoggyDAO, a decentralized autonomous organization for members of the Shiba Inu community, has launched on decentralized cryptocurrency exchange ShibaSwap this Friday, according t… [+1844 chars]"}, {"source": {"id": null, "name": "Finbold.com"}, "author": null, "title": "Dogecoin price prediction – Can DOGE reach $0.50 in 2022? - Finbold - Finance in Bold", "description": "Dogecoin’s (DOGE) price exploded in 2021, setting a new all-time high as well as bringing in retail investors into the cryptocurrency space.", "url": "https://finbold.com/dogecoin-price-prediction-can-doge-reach-0-50-in-2022/", "urlToImage": "https://finbold.com/wp-content/uploads/2022/02/Dogecoin-price-prediction-–-Can-DOGE-reach-0.50-in-2022.jpg", "publishedAt": "2022-02-18T16:03:04Z", "content": "Dogecoin’s (DOGE) price exploded in 2021, setting a new all-time high as well as bringing in retail investors into the cryptocurrency space.\r\nThe rising interest in DOGE, which was launched in 2013, … [+4841 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Brinda Sarkar and Sreeradha D Basu", "title": "Paternity leave gaining ground among Indian companies - Economic Times", "description": "In India, central government employees get 15 days of paternity leave, but there is no formal policy in place for employees in the private sector. However, companies have set out progressive policies of their own. While new-age companies including Meesho, Twi…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/paternity-leave-gaining-ground-among-indian-companies/articleshow/89669213.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89669242,width-1070,height-580,imgsize-46828,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-18T14:30:00Z", "content": "Twitter CEO Parag Agrawals announcement that he would take time off for the birth of his second child has once again put the spotlight on leave policies for new fathers.\r\nIn India, central government… [+3751 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Sayantani Sanyal", "title": "10 Reasons Why Python is One of the Best Programming Languages - Analytics Insight", "description": "Python is among the best programming languages. There are several reasons why Python is the best programming language. Read this article to know more.", "url": "https://www.analyticsinsight.net/10-reasons-why-python-is-one-of-the-best-programming-languages/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/02/10-Reasons-Why-Python-is-One-of-the-Best-Programming-Languages.jpg", "publishedAt": "2022-02-18T13:34:27Z", "content": "Python is among the fastest-growing programming languages in the tech industry\r\nAs a programmer in the modern-day tech industry, you have to learn programming languages that have excellent in-built f… [+4941 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saurabh Sinha", "title": "Rahul Bhatia in command: Rakesh Gangwal resigns as IndiGo director, to reduce stake over next 5 years - Times of India", "description": "India Business News: IndiGo co-founder and promoter, Rahul Bhatia, will now have complete control over India's largest domestic airline. Rakesh Gangwal, who along with Bha", "url": "https://timesofindia.indiatimes.com/business/india-business/rahul-bhatia-in-command-rakesh-gangwal-resigns-as-indigo-director-to-reduce-stake-over-next-5-years/articleshow/89667116.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-89667151,width-1070,height-580,imgsize-923005,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-02-18T12:46:00Z", "content": "Rahul Bhatia in command: Rakesh Gangwal resigns as IndiGo director, to reduce stake over next 5 years"}, {"source": {"id": null, "name": "Internet"}, "author": "https://www.facebook.com/thehackernews", "title": "Microsoft Warns of 'Ice Phishing' Threat on Web3 and Decentralized Networks - The Hacker News", "description": "Microsoft warns of emerging 'Ice Phishing' threats targeting Web3, blockchain, DeFi, smart contracts and other decentralized technologies.", "url": "https://thehackernews.com/2022/02/microsoft-warns-of-ice-phishing-threat.html", "urlToImage": "https://thehackernews.com/new-images/img/a/AVvXsEgseMugOlMQlJWC-iCctJFsgrsLvn4-y1JQ70Kx7gtzVJxz2BPkR4vU3p-4TpYpp0JVxflNFwYRgM_avpDWlop5fQ27z4CR1P-tAMZwl4qLC-aXqHSoq7ddBtDEswWfvM04WdMHUIZB0UibwGuXMPcuTpTAnP3fBtI3bX-oCm_E-UXAlJ41bMRpzzFM=s728-e1000", "publishedAt": "2022-02-18T12:32:00Z", "content": "Microsoft has warned of emerging threats in the Web3 landscape, including \"ice phishing\" campaigns, as a surge in adoption of blockchain and DeFi technologies emphasizes the need to build security in… [+2469 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Stagger your investments; 3 pockets may give good returns: Nitin Raheja - Economic Times", "description": "“There is derating as far as equity as an asset class is concerned. We are expecting that over the next three-six months, this trend will probably continue and the market will remain range-bound and choppiness is going to be there. There is a risk off trade a…", "url": "https://economictimes.indiatimes.com/markets/expert-view/stagger-your-investments-3-pockets-may-give-good-returns-nitin-raheja/articleshow/89666716.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89666672,width-1070,height-580,imgsize-22680,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-18T12:27:00Z", "content": "We will have to play this more as a bottom up stock picking market, where you feel the valuations have corrected and where it is becoming reasonably attractive to start making your entry in the marke… [+4713 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shubham Raj", "title": "Beware! Chris Wood says market fall may have just begun - Economic Times", "description": "He likened the current situation, especially selling in tech stocks, to the bursting of the dotcom bubble at the start of the millennium.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/beware-chris-wood-warns-market-fall-may-have-just-begun/articleshow/89664441.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89664448,width-1070,height-580,imgsize-55488,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-18T10:53:00Z", "content": "NEW DELHI: In his latest weekly newsletter, Christopher Wood, Global Head of Equities at Jefferies suggested that the recent fall in the market could just be a start and more drawdowns may be possibl… [+2391 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Weekly funding wrap: Jio invests in Glance, Elastic Run turns unicorn and more - Moneycontrol", "description": "The two biggest deals of this week were Glance, which raised $200 million from Reliance Jio and Elastic Run joined the unicorn club with a $330 million fundraise.", "url": "https://www.moneycontrol.com/news/business/weekly-funding-wrap-jio-invests-in-glance-elastic-run-turns-unicorn-and-more-8133191.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Startup-funding-770x433.jpg", "publishedAt": "2022-02-18T10:48:19Z", "content": "The funding boom in Indian startups continue as this week some major deals were announced and a new unicorn. So far, there are already eight unicorns in 2022. \r\nThe two biggest deals of this week wer… [+3680 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": null, "title": "Cointelegraph Top 100 - Cointelegraph", "description": "Cointelegraph brings you our hand-picked list of the Top 100 influencers in Crypto and Blockchain", "url": "https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022", "urlToImage": "https://s3.cointelegraph.com/storage/uploads/view/892d11055656d0690cf187769e57e33a.jpg", "publishedAt": "2022-02-17T19:44:48Z", "content": null}]}