{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "High court stays Delhi Govt that delisted the Tata Nexon EV from subsidy - Cartoq", "description": "After Tata Motors approached Delhi High Court against the decision of the Delhi Government to delist the Nexon EV from the subsidy, the high court has granted interim relief. The court has issued a notice and has directed the Delhi government to stay the orde…", "url": "https://www.cartoq.com/high-court-delhi-govt-tata-nexon/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/tata-nexon-ev-delhi-govt-order-stayed-1019x530.jpg", "publishedAt": "2021-03-11T07:21:04Z", "content": "After Tata Motors approached Delhi High Court against the decision of the Delhi Government to delist the Nexon EV from the subsidy, the high court has granted interim relief. The court has issued a n… [+2803 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Anupam Rasayan IPO: Grey market premium, subscription, other details in 10 points - Mint", "description": "The IPO opens on Friday.Many brokerages have recommended subscribe to Anupam Rasayan IPO despite the issue being aggressively priced.", "url": "https://www.livemint.com/market/ipo/anupam-rasayan-ipo-grey-market-premium-subscription-allocation-listing-dates-details-11615438817290.html", "urlToImage": "https://images.livemint.com/img/2021/03/11/600x338/anupam_1615438937791_1615438946697.jpg", "publishedAt": "2021-03-11T06:50:25Z", "content": "The IPO of speciality chemicals company Anupam Rasayan opens tomorrow and the issue closes on 16th March. Ahead of the IPO, the company had raised 225 crore from anchor investors, including foreign p… [+3833 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Renault dealer delivers 100 Kiger compact SUVs in a single day [Video] - CarToq.com", "description": "Renault’s most recent launch was the Kiger compact-SUV. The booking amount for the Kiger was set at Rs. 11,000. Now, the deliveries of the SUV have started as we have covered in a previous story. You can click here to read that one. Here is a video uploaded o…", "url": "https://www.cartoq.com/renault-dealer-delivers-100-kiger-compact-suvs/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/renault-kiger-100-car-delivery-1020x530.jpg", "publishedAt": "2021-03-11T06:33:45Z", "content": "Renault’s most recent launch was the Kiger compact-SUV. The booking amount for the Kiger was set at Rs. 11,000. Now, the deliveries of the SUV have started as we have covered in a previous story. You… [+2975 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Covaxin Or Covishield? Take A Look At Our Guide To Help You Choose A COVID-19 Vaccine - Moneycontrol", "description": "Granted people in India cannot choose between Serum Institute of India’s (SII) Covishield and Bharat Biotech's Covaxin. But here is a guide to help you understand some of the important facts about each vaccine.", "url": "https://www.moneycontrol.com/news/business/companies/covaxin-or-covishield-take-a-look-at-our-guide-to-help-you-choose-a-covid-19-vaccine-6631251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/15-covid-vaccine-in-village-770x433.jpg", "publishedAt": "2021-03-11T06:32:00Z", "content": "With 24.3 million Indians inoculated once, the important factors to determine the efficacy of a jab is to see how widely it is used in developed economies and the endorsement it receives from the WHO… [+9567 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Aparna Iyer", "title": "IDBI Bank is free of RBI’s intensive care, but will it fly? - Mint", "description": "IDBI Bank's provision coverage ratio is now 97% and its net non-performing assets are below 2% from the peak of 18.76%.The bank has also improved its leverage ratio and jacked up its provision coverage ratio to cover for risky assets", "url": "https://www.livemint.com/market/mark-to-market/idbi-bank-is-free-of-rbi-s-intensive-care-but-will-it-fly-11615441377310.html", "urlToImage": "https://images.livemint.com/img/2021/03/11/600x338/idbi-bank-kC0F--621x414@LiveMint_1615441443173.jpg", "publishedAt": "2021-03-11T05:54:19Z", "content": "Four years ago, IDBI Bank had the most toxic loan book in the banking sector when it found itself put in intensive care by the Reserve Bank of India (RBI). Under prompt corrective action (PCA), the b… [+2890 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Jio Has Fastest Broadband in India, Vi Fastest in Mobile Data Speeds: Ookla Q4 2020 Report - Gadgets 360", "description": "Ookla’s latest report for Q4 2020 highlights broadband and mobile network performance by varied operators in the region. The report says that Jio had the fastest mean download speed over fixed broadband with 3.7 stars and the only positive NPS (Net Promoter S…", "url": "https://gadgets.ndtv.com/internet/news/reliance-jio-fastest-fixed-broadband-speed-vodafone-idea-mobile-data-speed-q4-2020-ookla-report-2388333", "urlToImage": "https://i.gadgets360cdn.com/large/mobile_phone_in_hand_image_pexels_1611147212386.jpg", "publishedAt": "2021-03-11T05:29:17Z", "content": "Jio is the fastest broadband network provider in India with highest ratings in Q4 2020, according to network speed tracker Ookla's latest findings. Vi (Vodafone India) had the fastest mean mobile dow… [+2296 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "All-new Tata Safari takes on the Toyota Fortuner in a classic drag race - CarToq.com", "description": "Tata recently launched its only seven-seater vehicle in the Indian market – the Safari. Soon after its launch in the Indian market, the waiting period on the Safari has increased to about 2.5 months in a few cities, which tells us about the demand for the all…", "url": "https://www.cartoq.com/tata-safari-vs-toyota-fortuner-drag-race/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/tata-safari-vs-toyota-fortuner-drag-race-1-1018x530.jpg", "publishedAt": "2021-03-11T05:10:32Z", "content": "Tata recently launched its only seven-seater vehicle in the Indian market – the Safari. Soon after its launch in the Indian market, the waiting period on the Safari has increased to about 2.5 months … [+2629 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Navdeep Yadav", "title": "If you are a YouTube creator, you may have to pay $24 as tax for every $100 you make - Business Insider India", "description": "YouTube will begin deducting US taxes from payments to creators as early as June 2021 from creators outside of the US. The move will impact the earnings of", "url": "https://www.businessinsider.in/tech/news/youtube-will-begin-deducting-us-taxes-from-payments-to-creators-as-early-as-june-2021-for-creators-outside-of-the-us/articleshow/81443725.cms", "urlToImage": "https://www.businessinsider.in/photo/81443725/youtube-will-begin-deducting-us-taxes-from-payments-to-creators-as-early-as-june-2021-for-creators-outside-of-the-us.jpg?imgsize=2011292", "publishedAt": "2021-03-11T05:08:00Z", "content": "In a daunting news for the Youtube creators in India and outside US, the search engine giant Google said that it would begin deducting US taxes from payments to creators as early as June 2021 from cr… [+2614 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Mahindra clarifies on layoffs reports, says no salary cuts at any levels - Mint", "description": "Refuting reports that the company has fired 300 executives in its automotive and farm equipment sectors, M&M in a regulatory filing said", "url": "https://www.livemint.com/companies/news/mahindra-clarifies-on-layoffs-reports-says-no-salary-cuts-at-any-levels-11615437759532.html", "urlToImage": "https://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2013/03/20/Photos/Mahindra Plant1_4C--621x414.jpg", "publishedAt": "2021-03-11T04:50:16Z", "content": "Mahindra &amp; Mahindra on Wednesday said it has let go 48 employees in the last one year due to redundancies while another 98 have been given six months to find a role.Refuting reports that the comp… [+1643 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Citroen is testing entry-level SUV for India, may rival Brezza, Venue and Sonet - HT Auto", "description": "The upcoming entry-level Citroen sub-compact SUV has been spied testing on snow in Sweden..According to reports, the launch of the SUV is likely to happen sometime later this year.", "url": "https://auto.hindustantimes.com/auto/cars/citroen-is-testing-entry-level-suv-for-india-may-rival-brezza-venue-and-sonet-41615434592841.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/03/11/600x338/EXKie_fUcAIOYdC_1615436320696_1615436325835.png", "publishedAt": "2021-03-11T04:20:55Z", "content": "French auto major Citroen has entered the Indian market with its flagship C5 Aircross SUV. While the official launch of the SUV is still a few days away, the carmaker is reportedly working on a new a… [+1950 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Cognizant to cover vaccination cost of over 6 lakh people in India - Moneycontrol", "description": "The company will also vaccinate 50,000 people, comprising contingent staff such as contract, support, and security personnel, and their families, Rajesh Nambiar, Chairman, and Managing Director, Cognizant India, said in a statement.", "url": "https://www.moneycontrol.com/news/business/cognizant-to-cover-vaccination-cost-of-over-6-lakh-people-in-india-6632341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/05/Cognizant-Chennai-e1522163397345-770x433.jpg", "publishedAt": "2021-03-11T04:10:00Z", "content": "US-based IT major Cognizant will vaccinate 6 lakh people in India including over 2 lakh employees and their dependents in the country.\r\nThe company will also vaccinate 50,000 people, comprising conti… [+1622 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Warren Buffett's 6th member of $100 billion club. Here are the other five - Mint", "description": "Surpassing $100 billion is all the more notable considering how much the Omaha billionaire has given away", "url": "https://www.livemint.com/companies/people/warren-buffett-s-6th-member-of-100-billion-club-here-are-the-other-five-11615434233861.html", "urlToImage": "https://images.livemint.com/img/2021/03/11/600x338/61e5a68a-79b2-11eb-9a7d-79a141e30062_1615435465023_1615435483454.jpg", "publishedAt": "2021-03-11T04:09:31Z", "content": "Legendry investor Warren Buffett has been a fixture at the top of the worlds wealth rankings for decades, but in recent years hes slipped down the list as tech fortunes soared and his hot hand cooled… [+1831 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The Winners and Losers From Surging Oil Prices - NDTV Profit", "description": "Oil has climbed 75 per cent since the start of November as major economies vaccinate their populations and reopen after the pandemic shut down factories and grounded planes", "url": "https://www.ndtv.com/business/the-winners-and-losers-from-surging-oil-prices-as-world-is-tiptoeing-its-way-out-of-coronavirus-pandemic-2388279", "urlToImage": "https://c.ndtvimg.com/2021-03/dbek4u1g_oil-bloomberg_625x300_11_March_21.jpg", "publishedAt": "2021-03-11T04:05:10Z", "content": "Copper, used in everything from cars to wind turbines, is trading at levels last seen a decade ago\r\nYou'd think a world tiptoeing its way out of the coronavirus pandemic might only be good news for g… [+8260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Scania luxury bus row: Nitin Gadkari’s office says media report baseless - The Indian Express", "description": "“The media allegations that in November 2016, Scania delivered a luxury bus to a company that had close ties with Gadkari's sons are malicious, fabricated and baseless,” said a statement issued by Nitin Gadkari’s office on Wednesday.", "url": "https://indianexpress.com/article/india/luxury-bus-row-gadkaris-office-says-media-report-baseless-7223115/", "urlToImage": "https://images.indianexpress.com/2021/03/Nitin-Gadkari.jpg", "publishedAt": "2021-03-11T04:02:27Z", "content": "Union Minister Nitin Gadkaris office has termed as malicious, fabricated, and baseless the findings of international media reports that alleged that Swedish truck and bus manufacturer Scania delivere… [+3180 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Arun Prakash", "title": "Hyundai Staria MPV First Official Teasers Released - Launch Soon - RushLane", "description": "Hyundai has officially revealed the first teasers of their upcoming premium MPV called Staria. Interiors as well as exteriors detailed.", "url": "https://www.rushlane.com/hyundai-staria-mpv-first-official-teasers-12386375.html/", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2020/12/hyundai-staria-mpv-teaser-launch-8.jpg", "publishedAt": "2021-03-11T03:57:20Z", "content": "Hyundai Staria MPV Teaser\r\nIt is very well-known by now that Hyundai is developing a seven-seater compact MPV, especially for its South Asian markets. While its global portfolio is full of hatchbacks… [+2807 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Vehicle scrappage policy: Leasing is a cheaper option than buying a car on loan now - Moneycontrol.com", "description": "Cars that are over eight years old would have to go for a fitness test. A green tax of 10-25 percent would be charged every time you renew the fitness certificate. Maintaining a car would more expensive now", "url": "https://www.moneycontrol.com/news/business/personal-finance/vehicle-scrappage-policy-leasing-is-a-cheaper-option-than-buying-a-car-on-loan-now-6632351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Car_driver-770x433.jpg", "publishedAt": "2021-03-11T03:55:00Z", "content": "In a bid to keep polluting and old cards off the road, finance minister Nirmala Sitharaman announced the arrival of a vehicle scrappage policy, in her Budget 2021 speech. Cars that are over 15 years … [+5027 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Kalyan Jewellers India IPO to open for bidding on March 16, price band fixed at Rs 86-87 - Moneycontrol.com", "description": "As of March 9 this year, promoter and promoter group held approximately 67.99 percent equity of the pre-offer issued paid-up capital.", "url": "https://www.moneycontrol.com/news/business/ipo/kalyan-jewellers-india-ipo-to-open-for-bidding-on-march-16-price-band-fixed-at-rs-86-87-6632011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/Kalyan-Jewellers-770x433.jpg", "publishedAt": "2021-03-11T03:46:00Z", "content": "Indian jewellery major Kalyan Jewellers India on March 11 fixed the price band at Rs 86-87 per share for its initial public offering (IPO).\r\nThe public issue will open for bidding from March 16-18. T… [+2074 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Michail", "title": "Apple announces investment for chip design plant in Germany - GSMArena.com news - GSMArena.com", "description": "The new facility will be located in Munich and will be Europe's largest development site for mobile wireless semiconductors.", "url": "https://www.gsmarena.com/apple_announces_investment_for_chip_design_plant_in_germany-news-48148.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/03/apple-germany-chip-design-plant-investment/-476x249w4/gsmarena_002.jpg", "publishedAt": "2021-03-11T03:18:01Z", "content": "Apples commitment to expanding its chipset designs and producing in-house 5G modems just received a significant boost. In an official press release, Cupertino announced it's funding a new R&amp;D fac… [+1236 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "NSE, BSE shut today on account of Mahashivratri - Moneycontrol.com", "description": "On March 10, the Sensex rose 254.03 points or 0.50% to close at 51,279.51, while Nifty added 76.40 points or 0.51% to end at 15,174.80", "url": "https://www.moneycontrol.com/news/business/markets/nse-bse-shut-today-on-account-of-mahashivratri-6630551.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/12/Sensex-770x433.jpg", "publishedAt": "2021-03-11T02:51:00Z", "content": "The National Stock Exchange of India (NSE) and the BSE will remain closed on March 11 on account of Mahashivratri.\r\nWholesale commodity markets, including metal and bullion, are also shut. And there … [+2338 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "MTAR Technologies IPO share allotment finalised: Here's how to check - Moneycontrol.com", "description": "You can check the allotment status on either the registrar's website or on the BSE website", "url": "https://www.moneycontrol.com/news/business/ipo/mtar-technologies-ipo-share-allotment-finalised-heres-how-to-check-6629171.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/09/India-Missile-770x433.jpg", "publishedAt": "2021-03-11T02:43:00Z", "content": "MTAR Technologies has finalised the IPO share allotment on March 10. The public issue opened for subscription last week during March 3-5.\r\nInvestors can check the allotment status on the BSE Website.… [+1483 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Asian stocks set to firm after Dow hits record - Moneycontrol.com", "description": "Japan’s Nikkei 225 futures added 0.02%. Hong Kong’s Hang Seng index futures rose 0.03%. Australia’s S&P/ASX 200 index gained 0.12% in early trading. E-mini futures for the S&P 500 rose 0.24%.", "url": "https://www.moneycontrol.com/news/business/markets/asian-stocks-set-to-firm-after-dow-hits-record-6632131.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/asian-markets-new-770x433.jpg", "publishedAt": "2021-03-11T02:16:00Z", "content": "Asian stocks were set to open slightly higher, following Wall Streets momentum, after a report on U.S. consumer prices calmed concerns about inflation, helping steer the Dow Jones Industrial Average … [+2778 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "https://www.facebook.com/kshitij.rawat1/", "title": "Hyundai Nexo Gets Type Approval In India, Launch Expected Soon - GaadiWaadi.com", "description": "Hyundai Nexo is expected to launch in India this year, which would make it the first fuel-cell-powered vehicle in our market", "url": "https://gaadiwaadi.com/hyundai-nexo-gets-type-approval-in-india-launch-expected-soon/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/02/hyundai-nexo-fcv.jpg", "publishedAt": "2021-03-11T02:00:27Z", "content": "The global automobile industry is busy developing cleaner, greener technology, in order to curb the harmful emissions released from the tailpipes of vehicles. While battery-powered EVs are the most c… [+2094 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "2021 SsangYong Rexton Facelift Gets New Face And More Power - GaadiWaadi.com", "description": "2021 SsangYong Rexton gets a redesigned exterior and mechanical improvements meant it now develops 199 bhp and 440 Nm", "url": "https://gaadiwaadi.com/2021-ssangyong-rexton-facelift-gets-new-face-and-more-power/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/2021-SsangYong-Rexton.jpg", "publishedAt": "2021-03-11T01:00:03Z", "content": "SsangYong Motor Company, the fourth-largest carmaker from South Korea, has announced the introduction of the facelifted Rexton with a host of exterior changes while mechanical revisions have also bee… [+1960 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sangeeta Ojha", "title": "2-day bank strike: SBI branches, ATM services may be hit - Mint", "description": "The working of the State Bank of India (SBI) is likely to be affected on 15 and 16 March due to a 2-day nationwide bank strike", "url": "https://www.livemint.com/industry/banking/2day-bank-strike-sbi-branches-atm-services-may-be-hit-11615422609402.html", "urlToImage": "https://images.livemint.com/img/2021/03/11/600x338/SBI_1614582061661_1614582070988_1615424131420.jpg", "publishedAt": "2021-03-11T00:58:28Z", "content": "The working of the State Bank of India (SBI) is likely to be affected on 15 and 16 March due to a 2-day nationwide bank strike. The bank employees' unions have called a strike to protest against the … [+2225 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sidhartha", "title": "Executives get longer stint at top deck of PSU banks - Times of India", "description": "India Business News: For a long time, the government has been criticised for giving short tenures to the top management of public sector companies as well as in ministries", "url": "https://timesofindia.indiatimes.com/business/india-business/execs-get-longer-stint-at-top-deck-of-psu-banks/articleshow/81441336.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81442014,width-1070,height-580,imgsize-63378,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-11T00:33:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Need compensation for content, NBA writes to Google - Times of India", "description": "India News: News Broadcasters Association, apex body of private television channels, has written to the country head of Google India asking the tech giant to crea", "url": "https://timesofindia.indiatimes.com/india/need-compensation-for-content-nba-writes-to-google/articleshow/81441167.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81441166,width-1070,height-580,imgsize-152815,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-10T23:25:00Z", "content": null}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Simon Watkins", "title": "Iran Pushes Development Of Major Oil Region Under 25-Year China Deal - OilPrice.com", "description": "Tehran is pushing to increase oil output from all available fields in the coming 12 months, focusing mainly on the very prolific West Karound area", "url": "https://oilprice.com/Energy/Crude-Oil/Iran-Pushes-Development-Of-Major-Oil-Region-Under-25-Year-China-Deal.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-03-10_vtaj5fovdp.jpg", "publishedAt": "2021-03-10T23:00:00Z", "content": "Sign Up To Our Free Newsletter\r\nThanks for subscribing to our free newsletter!\r\nERROR\r\nOil prices have rallied past…\r\nOil prices rose on Wednesday…\r\nOil prices fell on Wednesday…\r\nBy Simon Watkins - … [+7336 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pankaj Doval", "title": "Govt seeks to firewall telecom infra from Chinese threat - Times of India", "description": "India Business News: In a move that will restrict the business of top Chinese vendors such as Huawei and ZTE in India’s 4G telecom expansion and the upcoming 5G, the gover", "url": "https://timesofindia.indiatimes.com/business/india-business/govt-seeks-to-firewall-telecom-infra-from-chinese-threat/articleshow/81439866.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81439919,width-1070,height-580,imgsize-669309,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-10T20:30:00Z", "content": null}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Oil Rebounds as Market Looks Beyond US Production Mark-Up By Investing.com - Investing.com", "description": "Oil Rebounds as Market Looks Beyond U.S. Production Mark-Up", "url": "https://www.investing.com/news/commodities-news/oil-stockpiles-surged-138-million-barrels-last-week-eia-2442689", "urlToImage": "https://i-invdn-com.akamaized.net/news/LYNXMPEAA50PT_L.jpg", "publishedAt": "2021-03-10T20:19:00Z", "content": "By Liz Moyer and Barani Krishnan  \r\nInvesting.com -- Oil prices rebounded on Wednesday, snapping a two-day slide, as the market looked beyond government data indicating that output was recovering fas… [+3491 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Gireesh Chandra Prasad, Utpal Bhaskar", "title": "Steep import duty on solar cells, modules from Apr ’22 - Mint", "description": "The customs duty will replace a 15% safeguard duty currently imposed on imports from China and Malaysia", "url": "https://www.livemint.com/news/india/india-to-impose-steep-customs-duty-on-solar-cells-modules-from-april-2022-11615387885538.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/27d49422-2dab-11eb-a8f0-5f006243e72b_1606184465101_1606184530734_1615388060709.jpg", "publishedAt": "2021-03-10T19:08:28Z", "content": "NEW DELHI :\r\nThe government has decided to impose 40% basic customs duty (BCD) on solar modules and 25% on solar cells from 1 April 2022, in a move that would make imports costlier and encourage loca… [+4451 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Nasrin Sultana", "title": "Commodities spike set to test market bull run - Mint", "description": "Surging raw material costs may severely dent corporate earnings.Some companies have raised prices to offset rising costs, risking a slump in demand, while others have decided to absorb them", "url": "https://www.livemint.com/market/stock-market-news/commodities-spike-set-to-test-market-bull-run-11615402113303.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/a2c104ae-6938-11eb-ae88-510c890b1f8a_1613142271010_1613142307864_1615402192052.jpg", "publishedAt": "2021-03-10T18:54:41Z", "content": "The highest oil and commodity prices in a year are pressuring margins of companies that had grown used to low input costs and are threatening to upend the strongest bull run in 11 financial years as … [+4119 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Shayan Ghosh, Kalpana Pathak", "title": "PSBs eye lateral hires to fill e-banking roles - Mint", "description": "They are roping in specialists even for junior roles from IT cos, pvt lenders", "url": "https://www.livemint.com/industry/banking/psbs-eye-lateral-hires-to-fill-e-banking-roles-11615401504965.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/SBI_1614582061661_1614582070988_1615401651444.jpg", "publishedAt": "2021-03-10T18:47:37Z", "content": "Mumbai: Public sector lenders are increasingly relying on lateral recruitment for specialized roles, such as digital banking and wealth management, with State Bank of India (SBI) and Bank of Baroda (… [+2814 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sunita Abraham", "title": "5 plug and play funds for the DIY investor - Mint", "description": "Investors who don’t have a financial advisor can opt for these funds.Adopting an asset allocation method tailored to an investor’s risk levels will be a more efficient method to getting to goals", "url": "https://www.livemint.com/mutual-fund/mf-news/5-plug-and-play-funds-for-the-diy-investor-11615393262328.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/rupee-new-kZlF--621x414@LiveMint_1615393370368.jpg", "publishedAt": "2021-03-10T18:25:50Z", "content": "With 37 mutual fund categories and counting, investors have multiple layers of decisions to make in building an investment portfolio. There are asset classes to choose, market segments to select and … [+7823 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Credit Suisse scrambles to contain $10 billion Greensill aftershocks - Moneycontrol", "description": "Greensill began to unravel last week after losing insurance coverage for its debt repackaging business, prompting Credit Suisse to freeze its Greensill-linked funds.", "url": "https://www.moneycontrol.com/news/business/credit-suisse-scrambles-to-contain-10-billion-greensill-aftershocks-6631791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Greensill-Bank-770x433.jpg", "publishedAt": "2021-03-10T15:56:00Z", "content": "Credit Suisse grappled with the fall-out of Greensill Capital's insolvency on Wednesday, as the head of its European asset management division temporarily stepped aside and it appointed receivers to … [+3998 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "M&M Plans Electric Variants Of All Its SUVs - Exclusive - BloombergQuint", "description": "The automaker has a two-pronged strategy to strengthen its position in the EV market.", "url": "https://www.bloombergquint.com/business/mm-realigns-ev-strategy-eyes-battery-powered-variant-for-all-its-suvs", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-08%2F9648faca-7628-45cb-985b-0180fed1631c%2FMahindra.jpg?rect=0%2C152%2C3999%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-03-10T14:26:15Z", "content": "Mahindra and Mahindra Ltd. looks to introduce battery-powered variants of its sports utility vehicle line-up as the company prepares for a future with electric mobility.\r\nThe group is readying itself… [+1156 chars]"}, {"source": {"id": null, "name": "Ethereum World News"}, "author": null, "title": "Jack Dorsey To End Ethereum NFT Auction of His 1st Tweet on March 21st - Ethereum World News", "description": "The CEO of Twitter, Jack Dorsey, has announced that he will be ending the Ethereum NFT auction of his first Tweet on the 21st of this month. Mr. Dorsey made", "url": "https://en.ethereumworldnews.com/jack-dorsey-to-end-ethereum-nft-auction-of-his-1st-tweet-on-march-21st/", "urlToImage": "https://en.ethereumworldnews.com/wp-content/uploads/2021/03/NFT-Auction.jpg", "publishedAt": "2021-03-10T13:51:36Z", "content": "In brief:\r\n<ul><li>Twitter CEO, Jack Dorsey will end the NFT auction of his first tweet on the 21st of March</li><li>He will immediately convert all proceeds to Bitcoin and Donate to GiveDirectly.org… [+2004 chars]"}, {"source": {"id": null, "name": "reNEWS"}, "author": "Renews Ltd", "title": "GE claims top spot in 2020 wind rankings - reNEWS", "description": "Vestas dropped to third place after Goldwind in a record year for new capacity additions, says BNEF", "url": "https://renews.biz/67004/ge-claims-top-spot-in-2020-wind-rankings/", "urlToImage": "https://renews.biz/media/21513/ge-renewable-energy-cypress-sweden1.jpg?width=640", "publishedAt": "2021-03-10T13:01:43Z", "content": "GE carved out the largest market share in 2020 in a record-breaking year for global wind capacity additions, according to Bloomberg New Energy Finance (BNEF).\r\nDevelopers commissioned 96.3GW of wind … [+3219 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Pfizer wants to make vaccine in India if faster clearance, export freedom assured: Report - Times of India", "description": "India News: Pfizer Inc has told the government it wants to produce its coronavirus vaccine locally if assured of faster regulatory clearance and freedom on pricin.", "url": "https://timesofindia.indiatimes.com/india/pfizer-wants-to-make-vaccine-in-india-if-faster-clearance-export-freedom-assured-report/articleshow/81431693.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81431833,width-1070,height-580,imgsize-115809,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-10T12:22:00Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Explained: Why gold is losing its shine after almost a year - India Today", "description": "To understand why gold prices are declining now, it is necessary to identify what boosted the yellow metal’s value to record levels in 2020. Read on to find out why gold prices have been falling sharply over the past few weeks:", "url": "https://www.indiatoday.in/business/story/explained-why-gold-is-losing-its-shine-after-almost-a-year-1777795-2021-03-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202103/Screenshot_2021-03-10_at_4.42._0-647x363.png?KrecjXcobLFlQ_S770bBp_gDUcPHn_e2", "publishedAt": "2021-03-10T11:20:22Z", "content": "After rising for almost a year, domestic gold prices have been falling for the last three weeks. Gold futures are down to nearly Rs 44,000 per 10 gram from a record high of over Rs 56,000 in August l… [+2650 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Swiggy beefs up subscription plan ‘SUPER’ - Mint", "description": "Swiggy SUPER will offer three different plans called -- Binge, Bite and Bit.SUPER was launched in 2018 and has already benefited close to 4 million users since inception", "url": "https://www.livemint.com/companies/news/swiggy-beefs-up-subscription-plan-super-11615372738227.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/swiggy-k8WH--621x414@LiveMint_1615373517257.jpg", "publishedAt": "2021-03-10T10:52:39Z", "content": "Bengaluru: Food delivery platform, Swiggy, on Wednesday said that it has revamped its Swiggy SUPER subscription service, as it looks to add more value to this paid offering.With the revamp, Swiggy SU… [+2207 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Rajesh Kumar Singh", "title": "India to Tax Solar Equipment Imports to Help Local Companies - BloombergQuint", "description": "India will levy a 40% customs tax on imports of solar modules from April next year to cut dependence on foreign supplies.", "url": "https://www.bloombergquint.com/business/india-to-tax-solar-equipment-imports-to-boost-domestic-industry", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-03%2F136faa7b-c2ed-430b-94c0-68d2f43e9954%2F300527910.jpg?rect=0%2C165%2C3998%2C2099&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-03-10T10:30:11Z", "content": "(Bloomberg) -- India will levy a 40% customs tax on imports of solar modules from April next year to cut dependence on foreign supplies and boost domestic manufacturing of the equipment, the renewabl… [+1567 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "2021 Renault Triber compact MPV launched at Rs. 5.30 lakh - CarToq.com", "description": "Earlier, some pictures of the upcoming 2021 Renault Triber were leaked online. Now, Renault has officially launched the 2021 Triber in the Indian market. The manufacturer has not made any cosmetic or mechanical changes, but they have added some features that …", "url": "https://www.cartoq.com/2021-renault-triber-launched/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/03/2021-renault-triber-featured-1-1019x530.jpg", "publishedAt": "2021-03-10T09:47:08Z", "content": "Earlier, some pictures of the upcoming 2021 Renault Triber were leaked online. Now, Renault has officially launched the 2021 Triber in the Indian market. The manufacturer has not made any cosmetic or… [+3075 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Easy Trip Planners IPO: Grey market premium, other details in 10 points - Mint", "description": "Easy Trip Planners IPO: The share allotment in Easy Trip Planners is likely to be finalised on March 16 and shares may list on March 19", "url": "https://www.livemint.com/market/ipo/easy-trip-planners-ipo-grey-market-premium-listing-gains-allocation-dates-in-10-points-11615094894205.html", "urlToImage": "https://images.livemint.com/img/2021/03/07/600x338/11896461_H424177-kXqF--621x414@LiveMint_1615096190891.JPG", "publishedAt": "2021-03-10T09:34:46Z", "content": "The IPO of online travel company Easy Trip Planners, which operates EaseMyTrip.com, opened on Monday to strong demand from the retail segment in particular. The company has fixed a price band of 186-… [+3653 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "BPCL Trust sells shares worth Rs 5,525 crore - Moneycontrol", "description": "ICICI Prudential MF acquired shares worth Rs 608 crore in block deal.", "url": "https://www.moneycontrol.com/news/business/bpcl-trust-sells-shares-worth-rs-5525-crore-6629431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/12/BPCL-770x433.jpg", "publishedAt": "2021-03-10T08:58:00Z", "content": "The Bharat Petroleum Corporation (BPCL) Trust has informed the exchanges that it sold 126,033,090 equity shares at Rs 438.41 per share - making the total sell-off worth Rs 5,525.42 crore.\r\nMeanwhile,… [+964 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Buy GAIL (India): target of Rs 175: Sharekhan - Moneycontrol.com", "description": "Sharekhan is bullish on GAIL (India) has recommended buy rating on the stock with a target price of Rs 175 in its research report dated March 09, 2021.", "url": "https://www.moneycontrol.com/news/business/stocks/buy-gail-india-target-of-rs-175-sharekhan-6628441.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_1-770x433.jpg", "publishedAt": "2021-03-10T07:21:00Z", "content": "Sharekhan's research report on GAIL (India)\r\nRecent sharp rally in oil price has improved the earnings outlook for GAILs downstream segments petchem and LPG-LHC. Higher oil/stable spot LNG price of $… [+1098 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": null, "title": "2021 Mercedes-Benz E-Class Facelift Teased; India Launch On March 16 - GaadiWaadi.com", "description": "2021 Mercedes-Benz E-Class facelift gets a host of exterior and interior changes along with new equipment onboard", "url": "https://gaadiwaadi.com/2021-mercedes-benz-e-class-facelift-teased-india-launch-on-march-16/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/03/2021-Mercedes-Benz-E-Class-Facelift-India-1.jpg", "publishedAt": "2021-03-10T05:58:18Z", "content": "Mercedes-Benz has today released the official teaser image of the facelifted E-Class for the domestic market and it will go on sale on March 16. The long wheelbase version of the updated E-Class debu… [+1877 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sangeeta Ojha", "title": "ICICI Bank to pay for Covid shots for employees and their family members - Mint", "description": "ICICI Bank will bear the cost of Covid-19 vaccination for employees and their immediate family members", "url": "https://www.livemint.com/industry/banking/icici-bank-to-pay-for-covid-shots-for-employees-and-their-family-members-11615354681138.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/6baeaab2-7daa-11eb-ac73-a65418c40367_1615355273498_1615355328137.jpg", "publishedAt": "2021-03-10T05:50:23Z", "content": "Mumbai: ICICI Bank today announced that it will provide Covid-19 vaccination for its employees and their immediate family members free of cost. The initiative is aimed at safeguarding the lives of it… [+1931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Budget Day, Investors Withdrew Rs 17,220 Crore From Stocks, Bond Markets - NDTV Profit", "description": "Corporate bonds saw the biggest outflows in about two years after the government last month announced a bigger-than-expected borrowing plan in its budget, triggering a spike in yields", "url": "https://www.ndtv.com/business/after-budget-day-investors-withdrew-rs-17-200-crore-from-stocks-bond-markets-2387479", "urlToImage": "https://c.ndtvimg.com/2021-03/g1l3h03_investors_625x300_10_March_21.jpg", "publishedAt": "2021-03-10T04:54:59Z", "content": "Yields on top-rated rupee corporate notes maturing in three years jumped by 74 basis points\r\nInvestors withdrew Rs 17,220 crore ($2.5 billion) from the Indian stock market and company debt mutual fun… [+1333 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Auto stocks edge higher after February PV retail sales grow 11%; Jefferies picks Eicher Motors, TVS Motor - Moneycontrol.com", "description": "\"Premium motorcycles have performed better than entry-level bikes in recent months. We maintain our preference for urban exposure in 2-wheelers and prefer TVS Motor and Eicher Motors,\" Jefferies said.", "url": "https://www.moneycontrol.com/news/business/stocks/auto-stocks-edge-higher-after-february-pv-retail-sales-grow-11-jefferies-picks-eicher-motors-tvs-motor-6628031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/04/car_salesnew-770x433.jpg", "publishedAt": "2021-03-10T04:29:00Z", "content": "The Indian stock market continues trading on a positive note led by gains in auto stocks. Sensex is up 287.46 points or 0.56 percent at 51312.94, and the Nifty added 83.30 points or 0.55 percent at 1… [+3157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Operation Panopticon: Hackers Breach Cameras at Tesla, Banks, Jails, and More - Gadgets 360", "description": "A US hacker collective claimed to have tapped into footage from 150,000 security cameras at banks, jails, schools, carmaker Tesla, and other sites to expose \"the surveillance state.\"", "url": "https://gadgets.ndtv.com/internet/news/tesla-hack-operation-panopticon-operationpanopticon-cameras-security-surveillance-cctv-hackers-2387452", "urlToImage": "https://i.gadgets360cdn.com/large/tesla_warehouse_bloomberg_1615349887969.jpg", "publishedAt": "2021-03-10T04:24:31Z", "content": "A US hacker collective on Tuesday claimed to have tapped into footage from 150,000 security cameras at banks, jails, schools, carmaker Tesla, and other sites to expose \"the surveillance state.\"\r\nImag… [+1800 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Elon Musk sets a new record. His wealth jumps $25 billion in just one day - Mint", "description": "Tesla Inc.’s 20% jump on Tuesday, its biggest in more than a year.The rally pushed Elon Musk's fortune to $174 billion", "url": "https://www.livemint.com/companies/people/tesla-boss-elon-musk-hits-a-new-milestone-adds-a-record-25-billion-in-one-day-11615349365006.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/2021-03-09T192444Z_1102940664_RC2V7M98B1M3_RTRMADP_3_TESLA-LG-EVS_1615349621173_1615349637191.JPG", "publishedAt": "2021-03-10T04:16:39Z", "content": "Elon Musk just hit a new milestone: He made a record $25 billion in one day. Tesla Inc.s 20% jump on Tuesday -- its biggest in more than a year -- pushed the billionaire founders fortune to $174 bill… [+2057 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Five things you need to know about Ola factory, world's largest for e-scooters - Hindustan Times Auto News", "description": "Ola factory for e-scooters is expected to roll out 10 million units each year once at full potential.", "url": "https://auto.hindustantimes.com/auto/news/five-things-you-need-to-know-about-ola-factory-world-s-largest-for-escooters-41615347561683.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/03/10/600x338/Ola_FutureFactory_-_megablock_Facade_1615194536235_1615347611826.jpg", "publishedAt": "2021-03-10T03:57:01Z", "content": "How Many\r\nOla claims that the factory, once operational, will be able to roll out 20 lakh electric scooters by employing 10,000 persons and making use of anywhere between 3,000 and 5,000 robots. By s… [+106 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zia Haq", "title": "The ‘missing middle’ in India’s economic recovery - Hindustan Times", "description": "Limping small businesses, which make up more than a quarter of India’s GDP and over 40% of manufacturing output, are key to a broad-based recovery. The pandemic caused revenues of smaller firms to plunge sharper than larger firms, the main reason for job loss…", "url": "https://www.hindustantimes.com/business/missing-middle-in-india-s-economic-recovery-101615347987440.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/10/1600x900/a0023abc-8152-11eb-8f1f-1d9be8c36a96_1615349486610.jpg", "publishedAt": "2021-03-10T03:46:27Z", "content": "The Indian economy has beaten two straight quarters of recession, expanding 0.4% in the three months to December 2020, a promising turnaround, but theres a twist: the V-shaped recovery could be optic… [+6012 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Shoaib Daniyal", "title": "Indian economy to be hardest hit by Covid-19 despite recovery, predicts new OECD report - Scroll.in", "description": "The high growth in 2021 cannot undo the damage caused by the country’s harsh lockdown.", "url": "https://scroll.in/article/989096/indian-economy-to-be-hardest-hit-due-to-covid-19-despite-recovery-predicts-new-oecd-report", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/155979-pqdqurcvnx-1615310815.jpeg", "publishedAt": "2021-03-10T03:30:00Z", "content": "India will be among the large economies most severely hit by the Covid-19 pandemic and the lockdown restrictions to combat it, a new report by the Organisation for Economic Co-operation and Developme… [+2074 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Stocks to watch: Voda Idea, Godrej Properties, PFC, AU Small Fin Bank, BPCL - Business Standard", "description": "AU Small Fin Bank launched its QIP on March 9 and fixed the floor price at Rs 1,181.06 per share", "url": "https://www.business-standard.com/article/markets/stocks-to-watch-voda-idea-godrej-properties-pfc-au-small-fin-bank-bpcl-121031000169_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-01/26/full/1611682280-8326.jpg", "publishedAt": "2021-03-10T02:58:00Z", "content": "The SGX Nifty was trading 65 points higher at 15,225 on Wednesday, indicating a firm start for the benchmark indices.\r\nHere are the top stocks that are likely to be in focus today:\r\nGodrej Properties… [+3998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "TRAI suspends new SMS scrubbing norms for 7 days - The Indian Express", "description": "The action by Trai comes after the functioning of several SMS-based services of banks and e-commerce platforms was hit on Monday as TSPs implemented the second phase of SMS regulation.", "url": "https://indianexpress.com/article/business/trai-suspends-new-sms-scrubbing-norms-for-7-days-7221552/", "urlToImage": "https://images.indianexpress.com/2021/03/sms.jpg", "publishedAt": "2021-03-10T02:42:47Z", "content": "The Telecom Regulatory Authority of India (Trai) on Tuesday temporarily suspended the scrubbing of short message service or SMS by telecom service providers (TSP) for seven days to allow principal en… [+2243 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Read India’s story of discontent in bonds, not stocks - Mint", "description": "Gas prices and the higher yield curve are better indicators of rising discontent than shares floating on government-injected liquidity.", "url": "https://www.livemint.com/market/stock-market-news/read-india-s-story-of-discontent-in-bonds-not-stocks-11615338762704.html", "urlToImage": "https://images.livemint.com/img/2021/03/10/600x338/66d4d9fa-6fa7-11eb-848d-61a48f38aea5_1615339781530_1615339818990.jpg", "publishedAt": "2021-03-10T01:35:23Z", "content": "Consumers are feeling cheated at the gas station. Investors are returning empty-handed from government bond auctions. The Indian state is struggling to make its fiscal math work without shortchanging… [+5609 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shouvik Das", "title": "Microsoft Exchange Mass Cyber Attack Causing Rampant Damage to Millions Worldwide - News18", "description": "Even though the Microsoft Exchange mass cyber attack is a developing story right now, it has caused enough damage to companies (and in turn users) globally to catch headlines around the world.", "url": "https://www.news18.com/news/tech/microsoft-exchange-mass-cyber-attack-impact-3516770.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1615328211_microsoft-exchange-mass-cyber-attack.jpg", "publishedAt": "2021-03-10T01:35:00Z", "content": "Even though the Microsoft Exchange mass cyber attack is a developing story right now, it has caused enough damage to companies (and in turn users) globally to catch headlines around the world. In wha… [+5429 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "NPCI on its toes as RBI hunts for new umbrella entity for retail payments - Moneycontrol", "description": "With this whole NUE conversation, there is a lot of pressure on the NPCI to kind of continue the innovation journey, says Managing Director and Chief Executive Officer of NPCI Dilip Asbe.", "url": "https://www.moneycontrol.com/news/business/npci-on-its-toes-as-rbi-hunts-for-new-umbrella-entity-for-retail-payments-6626181.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/08/Dilip-Asbe_NPCI_COO-653x435.jpg", "publishedAt": "2021-03-09T13:38:00Z", "content": "The Reserve Bank of India's (RBI's) latest move to set up pan-India new umbrella entity (NUE) for retail payments is putting a lot of pressure on the National Payments Corporation of India (NPCI), Di… [+2478 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Peerzada Abrar", "title": "Olas founding partner Pranay Jivrajka quits, may launch his own startup - Business Standard", "description": "Pranay Jivrajka was CEO of Ola Foods and an early employee of the ride-hailing firm", "url": "https://www.business-standard.com/article/companies/ola-s-founding-partner-pranay-jivrajka-quits-may-start-his-own-startup-121030901258_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-03/09/full/1615296624-9674.jpg", "publishedAt": "2021-03-09T13:24:00Z", "content": "Pranay Jivrajka, a founding partner of Ola, has quit the ride-hailing company and may launch his own startup, multiple sources told Business Standard on Tuesday.\r\nJivrajka, who is in his early thirti… [+3470 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Reliance Jio introduces new fiber broadband plans for small, medium businesses - Mint", "description": "The company aims to provide enterprise-grade Fiber connectivity that offers voice and data services at comparatively lower prices", "url": "https://www.livemint.com/technology/tech-news/reliance-jio-introduces-new-fiber-broadband-plans-for-small-medium-businesses-11615290053979.html", "urlToImage": "https://images.livemint.com/img/2021/03/09/600x338/DXGIWK29_1609344693375_1609344699112_1615291138900.jpg", "publishedAt": "2021-03-09T12:02:19Z", "content": "JioBusiness has introduced an integrated offering for micro, small and medium businesses. The company claims it will provide 1. Enterprise-Grade Fiber Connectivity that offers voice and data services… [+1882 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "New vehicle registrations down by 13.43% in February 2021 - Team-BHP", "description": "According to the data released by the Federation of Automobile Dealers Associations (FADA), vehicle registrations fell by 13.43% in February 2021. Overall sales stood at 14,99,036 units, compared to 17,31,628 units in February 2020. The passenger vehicle segm…", "url": "https://www.team-bhp.com/news/new-vehicle-registrations-down-1343-february-2021", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/1-1_0.JPG", "publishedAt": "2021-03-09T11:53:30Z", "content": "According to the data released by the Federation of Automobile Dealers Associations (FADA), vehicle registrations fell by 13.43% in February 2021. Overall sales stood at 14,99,036 units, compared to … [+1236 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Paras Defence and Space Technologies files IPO papers - Economic Times", "description": "The offering comprises fresh issuance of shares worth Rs 120 crore and an offer of sale of up to 17,24,490 equity stocks by promoters and existing shareholders, the draft red herring prospectus (DRHP) filed with Sebi showed.", "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/paras-defence-and-space-technologies-files-ipo-papers/articleshow/81410973.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81411019,width-1070,height-580,imgsize-318068,overlay-etmarkets/photo.jpg", "publishedAt": "2021-03-09T10:41:00Z", "content": "NEW DELHI: Paras Defence and Space Technologies has filed preliminary papers with market regulator Securities and Exchange Board of India (Sebi) to float an initial public offer (IPO). The offering c… [+1385 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "Cryptocurrency in India: The past, present and uncertain future - Economic Times", "description": "To understand the ongoing controversy over cryptocurrency in India, we need to examine how we got here.", "url": "https://economictimes.indiatimes.com/tech/trendspotting/cryptocurrency-in-india-the-past-present-and-uncertain-future/articleshow/81410792.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81410873,width-1070,height-580,imgsize-2297149,overlay-ettech/photo.jpg", "publishedAt": "2021-03-09T10:38:00Z", "content": "No one knows exactly when, but the govenrment is expected to ban all private cryptocurrency in India and simultaneously announce a sovereign digital currency sometime soon. This despite numerous appe… [+4847 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "What is NFT, and why it matters in the crypto world - Economic Times", "description": "Non-fungible tokens (NFTs) are a class of cryptocurrency assets in which each item, or token, is entirely unique. This makes them useless as a currency, but quite useful for other things—such as crypto art.", "url": "https://economictimes.indiatimes.com/tech/trendspotting/what-is-nft-and-why-it-matters-in-the-crypto-world/articleshow/81410583.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81410624,width-1070,height-580,imgsize-322181,overlay-ettech/photo.jpg", "publishedAt": "2021-03-09T10:24:00Z", "content": "Mumbai: Non-fungible tokens, or NFTs, are hotter than a barbeque in May right now. Here's what they are, and why the world has gone NFT-crazy in the past month.\r\n<ul><li>Fungible (adjective): Replace… [+3625 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Business Desk", "title": "MTAR IPO: Don't Miss! Check Allotment Date, Subscription Status Here - India.com", "description": "MTAR IPO Allotment Date, Subscription Status Check: You can check the MTAR IPO allotment status on the BSE website. According to the latest data, the IPO of Rs 596 crore MTAR Technologies was subscribed more than 201 times.", "url": "https://www.india.com/business/mtar-ipo-dont-miss-check-allotment-date-subscription-status-here-4478939/", "urlToImage": "https://static.india.com/wp-content/uploads/2020/12/ipo_pic.jpg", "publishedAt": "2021-03-09T09:52:22Z", "content": "MTAR IPO Allotment Date, Subscription Status Check: MTAR IPO listing is likely to happen on March 16, 2021, as the MTAR IPO allotment is likely to take place tomorrow i.e March 10. The initial public… [+2714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Burger King deletes sexist tweet on International Women’s Day, but netizens are not convinced - The Indian Express", "description": "\"Women belong in the kitchen,\" a tweet and ad by the popular fast food brand said. Although it was intended to highlight lack of female representation in restaurant industry, their campaign backfired.", "url": "https://indianexpress.com/article/trending/trending-globally/burger-king-sexist-womens-day-tweet-row-7220793/", "urlToImage": "https://images.indianexpress.com/2021/03/burger-king-womens-day-ad.jpg", "publishedAt": "2021-03-09T09:36:08Z", "content": "To celebrate International Womens Day, Burger King in the UK wanted to draw attention to lack of female representations in the food industry. Their approach, however, got them grilled instead. Althou… [+5251 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rounak Bagchi", "title": "Explained: What does the new rule on airbags mean for passengers, carmakers? - The Indian Express", "description": "The Central government's decision of making passenger airbags mandatory for all vehicles is part of its plan to improve safety norms in the country.", "url": "https://indianexpress.com/article/explained/explained-what-the-new-rule-on-airbags-means-for-passengers-and-car-manufacturers-7218232/", "urlToImage": "https://images.indianexpress.com/2021/03/Airbags-Explained.jpeg", "publishedAt": "2021-03-09T08:32:02Z", "content": "The central government has made front passenger airbags mandatory for all vehicles.\r\nIssuing the order on Friday (March 5), the Union Ministry of Road Transport and Highways said, The Ministry has is… [+5122 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Volvo XC40 Recharge unveiled in India, booking starts in June - Times of India", "description": "Cars News: Bookings will commence in June and deliveries will start in October this year. XC40 Recharge is the second premium electric SUV in the market and will", "url": "https://timesofindia.indiatimes.com/auto/cars/volvo-xc40-recharge-unveiled-in-india-booking-starts-in-june/articleshow/81408675.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81408649,width-1070,height-580,imgsize-1073547,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-09T08:19:00Z", "content": null}]}