{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Getindianews.com"}, "author": null, "title": "Is Pfizer CEO Albert Bourla Arrested In Fraud Case Explained - Get India News", "description": "Is Pfizer CEO Albert Bourla Arrested In Fraud Case Explained: It seems like the CEO of Pfizer naming Albert Bourla, has been arrested for fraud in the month of November", "url": "https://getindianews.com/is-pfizer-ceo-albert-bourla-arrested-in-fraud-case-explained/", "urlToImage": "https://getindianews.com/wp-content/uploads/2021/11/Albert-Bourla-Arrested.jpg", "publishedAt": "2021-11-06T13:41:03Z", "content": "Is Pfizer CEO Albert Bourla Arrested In Fraud Case Explained: It seems like the CEO of Pfizer naming Albert Bourla, has been arrested for fraud in the month of November in the year 2021, on 5th Novem… [+6389 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Uday Kotak on the problem with central bank money-printing - Mint", "description": "'It distorts value and values. Like climate change it is the future generation’s problem. We need to solve it not kick the can. Future is here. Future is now,' Uday Kotak said in a tweet", "url": "https://www.livemint.com/economy/central-banks-and-sovereigns-resort-to-printing-money-for-all-problems-says-uday-kotak-11636203033966.html", "urlToImage": "https://images.livemint.com/img/2021/11/06/600x338/UdayKotak-ka9H--621x414@LiveMint_1636203066898.jpg", "publishedAt": "2021-11-06T13:37:17Z", "content": "Veteran banker Uday Kotak raised concerns over Central Banks across the world resorting to money printing for all the problems.\r\nCentral banks and sovereigns globally have only one medicine for all p… [+2684 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "India ready to move into next orbit of growth: SBI Chief Dinesh Kumar Khara - Moneycontrol.com", "description": "The kind of vaccine drive the country has seen makes all the Indians proud, especially because the domestically produced vaccine is being used in a big way, Dinesh Kumar Khara said at the India Pavilion at EXPO2020 Dubai.", "url": "https://www.moneycontrol.com/news/business/economy/india-ready-to-move-into-next-orbit-of-growth-sbi-chief-dinesh-kumar-khara-7685611.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Dinesh-Kumar-Khara-770x433.jpg", "publishedAt": "2021-11-06T12:57:13Z", "content": "India is ready to move into the next orbit of growth with the hugely successful implementation of the COVID-19 vaccination program, State Bank of India (SBI) Chairman Dinesh Kumar Khara said on Satur… [+1524 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Warren Buffett's Berkshire Hathaway boosts operating profit, cash hoard sets record - Mint", "description": "That surpasses the previous record of $146.6 billion in cash that Berkshire held at the end of the second quarter of 2020.Berkshire has continued throwing off cash faster than Buffett can put it back to work through deals or buybacks", "url": "https://www.livemint.com/companies/people/warren-buffett-s-cash-pile-tops-record-with-149-2-billion-on-hand-11636201826307.html", "urlToImage": "https://images.livemint.com/img/2021/11/06/600x338/4a0c002b64834006af369a582adae381-4a0c002b64834006af369a582adae381-0_1629159731348_1636201991007.jpg", "publishedAt": "2021-11-06T12:34:20Z", "content": "Warren Buffett's Berkshire Hathaway Inc on Saturday reported improved operating results as it extended its rebound from the early stages of the pandemic, even as it cut back some stock holdings and b… [+1719 chars]"}, {"source": {"id": null, "name": "The Block Crypto"}, "author": "Wolfie Zhao", "title": "Chinese police seize $62 million in alleged Filecoin miner Ponzi scheme - The Block Crypto", "description": "Chinese police have confiscated crypto assets worth $62.5 million in a crackdown on an alleged Filecoin miner Ponzi scheme.", "url": "https://www.theblockcrypto.com/post/123489/china-seize-62-million-crypto-filecoin-ponzi-ipfsunion", "urlToImage": "https://www.tbstat.com/wp/uploads/2020/04/20200420_Filecoin-Daily.jpg", "publishedAt": "2021-11-06T12:27:25Z", "content": "Chinese law enforcement have confiscated crypto assets worth 400 million yuan, or $62.5 million, in a crackdown on an alleged Filecoin miner Ponzi scheme.\r\nThe Chinese police in the city of Xuzhou ha… [+2560 chars]"}, {"source": {"id": null, "name": "ZyCrypto"}, "author": null, "title": "“The Metaverse Promises To Be Much More Interoperable” – Mark Zuckerberg On NFTs, DeFi, And Crypto - ZyCrypto", "description": "Meta’s Mark Zuckerberg has his eyes fixed on the big picture; a more decentralized and interoperable metaverse that will allow users in the", "url": "https://zycrypto.com/the-metaverse-promises-to-be-much-more-interoperable-mark-zuckerberg-on-nfts-defi-and-crypto/", "urlToImage": "https://zycrypto.com/wp-content/uploads/2021/11/The-Metaverse-Promises-To-Be-Much-More-Interoperable-Mark-Zuckerberg-On-NFTs-DeFi-And-Crypto.jpg", "publishedAt": "2021-11-06T12:16:04Z", "content": "Metas Mark Zuckerberg has his eyes fixed on the big picture; a more decentralized and interoperable metaverse that will allow users in the virtual world to create, monetize and share their ideas with… [+2392 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "2021 Bajaj Pulsar 250: Five pros and cons explained - HT Auto", "description": "Bajaj Pulsar 250 comes based on a new engine and platform but still manages to carry over the typical Pulsar DNA.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/2021-bajaj-pulsar-250-five-pros-and-cons-explained-41636198695071.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/11/06/600x338/Bajaj_Pulsar_250_naked_6_1636175809977_1636200534657.jpeg", "publishedAt": "2021-11-06T12:10:29Z", "content": "The 2021 Bajaj Pulsar 250 comes out as a whole new product as revealed through our latest first ride report. It is based on a new engine and platform but still manages to carry over typical Pulsar DN… [+1583 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Edtech sector to consolidate in hiring, investments as schools, colleges open: Experts - Moneycontrol", "description": "The pandemic has drastically changed the way of teaching and learning, and the funding for ed-tech has remained bullish leading to the adoption of advanced technology, growth in both revenue as well as hiring, CIEL HR Services Director and CEO Aditya Mishra t…", "url": "https://www.moneycontrol.com/news/business/edtech-sector-to-consolidate-in-hiring-investments-as-schools-colleges-open-experts-7685341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/shutterstock_1552023089-770x433.jpg", "publishedAt": "2021-11-06T10:40:17Z", "content": "The COVID-19 pandemic aided in the exponential growth of the edtech sector that resulted in huge numbers of recruitment in the sector but experts believe that with the opening of schools, this upward… [+4413 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "MG Astor vs Kia Seltos in a classic drag race: Who will win? - CarToq.com", "description": "The mid-size compact SUV segment is quite popular in India market. In the last couple of years several new models have entered in this segment increasing the competition. In 2019 Kia launched Seltos and since then it is having a successful run in the segment.…", "url": "https://www.cartoq.com/mg-astor-vs-kia-seltos-in-a-classic-drag-race-who-will-win/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/11/Astor-vs-Seltos-featured.jpg", "publishedAt": "2021-11-06T10:06:03Z", "content": "The mid-size compact SUV segment is quite popular in India market. In the last couple of years several new models have entered in this segment increasing the competition. In 2019 Kia launched Seltos … [+2795 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Check Out This Lovely Royal Enfield Classic 350-Based Cafe Racer - GaadiWaadi.com", "description": "This beautiful cafe racer, built by Delhi-based Neev Motorcycles, is actually a heavily customised Royal Enfield Classic 350", "url": "https://gaadiwaadi.com/check-out-this-lovely-royal-enfield-classic-350-based-cafe-racer/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/11/Royal-Enfield-Classic-350-cafe-racer-Neev-Motorcycles-img1.jpg", "publishedAt": "2021-11-06T10:00:42Z", "content": "Royal Enfield Classic 350 is the brands most popular model in the Indian market. Thanks to its retro-inspired design and thumpy engine, it is loved by motorcycle enthusiasts across the country. Most … [+2035 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Satya Singh", "title": "New Honda Compact SUV Teased Officially - Debut On 11th Nov - RushLane", "description": "All new Honda Compact SUV is set to make its global debut on 11th Nov. It is expected to be a rival to Nexon, Venue, Sonet.", "url": "https://www.rushlane.com/new-honda-compact-suv-teased-officially-12416405.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/11/new-honda-compact-suv-teased-launch-2021.jpg", "publishedAt": "2021-11-06T09:59:46Z", "content": "New Honda Compact SUV\r\nIn Indonesia, Honda recently launched two of its new-gen products, 11th generation Honda Civic RS and all-new Honda City. At the launch event, the company also released a tease… [+2772 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Divi’s Laboratories Q2 net profit rises 17% to Rs 606 crore - Moneycontrol.com", "description": "The company had posted a net profit of Rs 519.59 crore for the corresponding period of the previous fiscal, Divi’s Laboratories said in a filing to the BSE.", "url": "https://www.moneycontrol.com/news/business/earnings/divis-laboratories-q2-net-profit-rises-17-to-rs-606-crore-7685271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/shutterstock_1308720301-3-770x433.jpg", "publishedAt": "2021-11-06T09:47:28Z", "content": "Drug firm Divis Laboratories on Saturday reported a 16.71 per cent jump in its consolidated net profit to Rs 606.46 crore for the quarter ended September 30, mainly on account of robust sales.\r\nThe c… [+505 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Primary market update: Three IPOs to hit the Street, two stocks to make a debut next week - Moneycontrol.com", "description": "Initial public offerings of three companies - Paytm, Sapphire Foods and Latent View Analytics - will hit the Street raising nearly Rs 21,000 crore in the coming week. Read on to know what experts have to say about these IPOs", "url": "https://www.moneycontrol.com/news/business/ipo/primary-market-update-3-ipos-to-hit-the-street-2-stocks-make-a-debut-next-week-7685181.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/IPO2_-770x433.png", "publishedAt": "2021-11-06T09:43:56Z", "content": "In the coming week, initial public offerings of three companies - Paytm, Sapphire Foods and Latent View Analytics - will hit the Street raising nearly Rs 21,000 crore, and two new stocks will make a … [+3377 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Jefferies Group’s Christopher Wood bullish on Indian equities, Bitcoin: Report - Moneycontrol", "description": "Christopher Wood also reduced exposure to gold by 5% in his Japanese portfolio in favour of Bitcoin, a move that is being viewed as the cryptocurrency being the better option in hedging against inflation", "url": "https://www.moneycontrol.com/news/business/jefferies-groups-christopher-wood-bullish-on-indian-equities-bitcoin-report-7684991.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Bitcoin_Reuters_Feb17-770x433.jpg", "publishedAt": "2021-11-06T08:52:43Z", "content": "Christopher Wood, the global head of equity strategy at Jefferies Group, has reiterated his bullish view on Indian equities even as other global research and brokerage houses downgraded them citing r… [+2527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's How To Determine Whether Crypto Investment Is Useful - NDTV Profit", "description": "Despite the risks, cryptocurrency can help you earn much more quickly than most other such tools.", "url": "https://www.ndtv.com/business/research-market-hours-patience-how-to-determine-whether-crypto-investment-is-useful-2600274", "urlToImage": "https://c.ndtvimg.com/2021-08/ogfsfjs8_bitcoin_625x300_04_August_21.jpg", "publishedAt": "2021-11-06T07:26:02Z", "content": "Even the smartest investor cannot wish away the risks associated with this new-age industry.\r\nThe cryptocurrency market has come a long way since the first coin, Bitcoin, was released in 2009. Over t… [+2250 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "5 new cars launching early next year: Maruti Suzuki Baleno Facelift to 2022 Mahindra Scorpio - CarToq.com", "description": "2021 is almost over and we saw many new car launches this year. Automobile manufacturers have already started working on new launches for the next year. Today we list down 5 such cars that we will be launching early next year. There will be a sedan, a SUV, a …", "url": "https://www.cartoq.com/5-new-cars-launching-early-next-year-maruti-suzuki-baleno-facelift-to-2022-mahindra-scorpio/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/11/upcoming-cars-2022-featured.jpg", "publishedAt": "2021-11-06T07:15:54Z", "content": "2021 is almost over and we saw many new car launches this year. Automobile manufacturers have already started working on new launches for the next year. Today we list down 5 such cars that we will be… [+3284 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Citibank services to be down for 45 minutes on November 8. Here's what you need to know - Moneycontrol", "description": "Some banks have shown “preliminary interest” in acquiring Citi’s retail operations as it plans to exit the business in 13 countries.", "url": "https://www.moneycontrol.com/news/business/citibank-services-to-be-down-for-45-minutes-on-november-8-heres-what-you-need-to-know-7684691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Citibank-770x433.jpg", "publishedAt": "2021-11-06T07:02:10Z", "content": "Citibank has informed customers about a scheduled 45 minute long downtime on November 8 (Monday) through email, Hindustan Times reported.\r\nAccording to the email, operations will be affected as Citib… [+1943 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Market gains after 2 weeks of losses. 82 smallcaps gain 10-30% in truncated week - Moneycontrol.com", "description": "The broader indices outperformed the main indices with BSE Midcap and Smallcap indices rose 3 percent each in the last week.", "url": "https://www.moneycontrol.com/news/business/markets/market-gains-after-2-weeks-of-losses-82-smallcaps-gain-10-30-in-truncated-week-7684821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/fandosensexniftyderivative-770x433.jpg", "publishedAt": "2021-11-06T07:00:14Z", "content": "Market snapped two-week losing streak and ended higher in the truncated Diwali week ended November 4 amid mixed global cues.\r\nIn the week gone by, BSE Sensex added 760.69 points (1.28 percent) to clo… [+3709 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Nasrin Sultana", "title": "Three of 10 top Nifty performers in Samvat 2077 from Tata Group - Mint", "description": "Indian equity markets had a historical journey in Samvat 2077 touching new lifetime highs, with the Nifty surpassing the 18000-mark while the Sensex crossing 60,000 for the first time", "url": "https://www.livemint.com/market/stock-market-news/three-of-10-top-nifty-performers-in-samvat-2077-from-tata-group-11636180793638.html", "urlToImage": "https://images.livemint.com/img/2021/11/06/600x338/bsestocks-kUtF--621x414@LiveMint_1636181536589.jpg", "publishedAt": "2021-11-06T06:54:22Z", "content": "MUMBAI: Tata group stocks performed exceedingly well in the Hindu calendar year Samvat 2077 that ended on Wednesday. Of the 10 best performing Nifty stocks, during the year, three of them were part o… [+3333 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Charanpreet Singh", "title": "New Generation Maruti Suzuki Celerio Launch Date Announced - carandbike", "description": "Maruti Suzuki India will announce prices for the new-generation Celerio hatchback on November 10, 2021. The all-new Celerio will be underpinned by the Heartect platform.", "url": "https://www.carandbike.com/news/new-generation-maruti-suzuki-celerio-launch-date-announced-2600945", "urlToImage": "https://c.ndtvimg.com/2021-11/20j0tic4_newgen-maruti-celerio-teaser-out-booking-open-today_625x300_02_November_21.jpg", "publishedAt": "2021-11-06T06:54:08Z", "content": "Maruti Suzuki India is all set to launch the new-generation Celerio hatchback in the country on November 10, 2021. The Indo-Japanese carmaker is already accepting pre-bookings for the compact hatchba… [+2371 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Pearl Daniels", "title": "Maruti Car Discounts Nov 2021 - Alto, SPresso, Swift, WagonR, Brezza, Dzire - RushLane", "description": "Maruti Suzuki India has announced attractive car discounts for Nov 2021. Offers on Alto, WagonR, Swift, Dzire, Brezza, etc.", "url": "https://www.rushlane.com/maruti-car-discounts-nov-2021-alto-spresso-swift-12416894.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/11/maruti-alto-discounts-nov-2021.jpeg", "publishedAt": "2021-11-06T06:35:31Z", "content": "Image – Dev Mtr\r\nIt’s once again that time of the year when automakers offer hefty discounts and exchange schemes on their range of vehicles. The festive season is considered an auspicious buying per… [+3112 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Alert! HDFC Bank warns customers of cyber fraud; Here`s how to avoid loss of money - Zee News", "description": "To escape the Covid-19 pandemic, most individuals are shifting away from cash and toward digital payment - online banking. As a result of this, the majority of money transactions have moved to net banking, which has attracted cybercriminals and resulted in a …", "url": "https://zeenews.india.com/personal-finance/alert-hdfc-bank-warns-customers-of-cyber-fraud-here-s-how-to-avoid-loss-of-money-2408319.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/11/06/985375-download-7-1.jpg", "publishedAt": "2021-11-06T06:30:44Z", "content": "New Delhi: To escape the Covid-19 pandemic, most individuals are shifting away from cash and toward digital payment - online banking. As a result of this, the majority of money transactions have move… [+2999 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "India’s First Tata Punch with aftermarket modifications - CarToq.com", "description": "Tata launched Punch micro SUV in the market recently and delivery for the same has also started. Punch is currently the safest car one can buy in India as it scored highest in occupants and child safety safety ratings in Global NCAP crash tests. Just like any…", "url": "https://www.cartoq.com/indias-first-tata-punch-aftermarket-modifications/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/11/Tata-Punch-modified-featured.jpg", "publishedAt": "2021-11-06T06:23:49Z", "content": "Tata launched Punch micro SUV in the market recently and delivery for the same has also started. Punch is currently the safest car one can buy in India as it scored highest in occupants and child saf… [+2871 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "After Evergrande, another Chinese real estate developer Kaisa at risk of default - Economic Times", "description": "While Kaisa did not disclose more details for the reason behind the suspension, it had said the previous day that it was facing  unprecedented pressure  on its finances.", "url": "https://economictimes.indiatimes.com/news/international/business/after-evergrande-another-chinese-real-estate-developer-kaisa-at-risk-of-default/articleshow/87550224.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87550247,width-1070,height-580,imgsize-34710,overlay-economictimes/photo.jpg", "publishedAt": "2021-11-06T06:15:00Z", "content": "After China's property giant Evergrande Group faced a debt repayment deadline, another real estate developer Kaisa Group is at risk of default, escalating fears of further problems in the country's e… [+1520 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Bankers of McLeod Russel sign ICA for resolution on debt recast - Moneycontrol", "description": "After the promoters of McLeod reach a settlement with a financial creditor, Techno Electric & Engineering, the company could be out of National Company Law Tribunal’s insolvency process.", "url": "https://www.moneycontrol.com/news/business/bankers-of-mcleod-russel-sign-ica-for-resolution-on-debt-recast-7684881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/shutterstock_1428847331-770x433.jpg", "publishedAt": "2021-11-06T06:10:24Z", "content": "Bulk tea major McLeod Russel India on Friday said its bankers have signed an Inter Creditors Agreement (ICA), a precursor to a resolution plan for debt restructuring, that rekindled hope of revival o… [+1480 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Moneycontrol Pro Weekender | The key to avoiding tantrums is growth - Moneycontrol.com", "description": "For the equity market, the end of quantitative easing will signal the end of the era of multiple expansion and stock prices will perhaps move more in line with earnings growth", "url": "https://www.moneycontrol.com/news/business/companies/moneycontrol-pro-weekender-the-key-to-avoiding-tantrums-is-growth-7684831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/07/US-Federal-Reserve_July-29-770x433.jpg", "publishedAt": "2021-11-06T05:42:08Z", "content": "Dear Reader,\r\nThis was the week when the US Federal Reserve announced the long-anticipated tapering of asset purchases. Market commentary focused on the lack of a taper tantrum in the markets this ti… [+6088 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Paytm to offer Bitcoin trading? Everything you need to know - DNA India", "description": "Paytm to offer Bitcoin trading? Everything you need to know - Trading in cryptocurrencies will be a huge shift for Paytm but it will only happen if the regulating body of India legalises it", "url": "https://www.dnaindia.com/business/report-paytm-to-offer-bitcoin-trading-everything-you-need-to-know-cryptocurrency-bitcoin-dogecoin-alerts-news-updates-2918575", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2021/11/06/1004118-pay.jpeg", "publishedAt": "2021-11-06T04:41:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Nov 06, 2021, 10:31 AM ISTPaytm, a tech company that specializes in digital payment systems, e-commerce and finance is looking int… [+1344 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Pearl Daniels", "title": "Tata Car Sales Breakup Oct 2021 - Nexon, Punch, Altroz, Tiago, Harrier, Safari - RushLane", "description": "In its first month of launch, Punch has become the 2nd best selling Tata car, after the Nexon. It has beaten Altroz, Tiago and others.", "url": "https://www.rushlane.com/tata-car-sales-breakup-oct-2021-nexon-punch-12416768.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/11/tata-punch-sales-oct-2021.jpg", "publishedAt": "2021-11-06T03:58:26Z", "content": "Image – Life Cruiser 007\r\nTata Motors sales increased 82.56 percent YoY in October 2021 to a total of 33,926 units. This was against 18,583 units sold in October 2020. MoM sales of the company also i… [+2647 chars]"}, {"source": {"id": null, "name": "Rushlane.com"}, "author": "Arun Prakash", "title": "Kia Seltos Diesel IMT Launch Planned For 2022 - Scoop - RushLane", "description": "Kia will introducing an iMT gearbox in the 1.5-litre diesel engine option of Seltos next year, third transmission options for the engine.", "url": "https://www.rushlane.com/kia-seltos-diesel-imt-launch-planned-for-2022-scoop-12416833.html", "urlToImage": "https://www.rushlane.com/wp-content/uploads/2021/11/kia-seltos-diesel-imt-launch-2022-2.jpg", "publishedAt": "2021-11-06T03:03:59Z", "content": "Image – Auto Prime\r\nKia Seltos has been posting consistent monthly sales volumes ever since it was launched back in August 2019. In October this year, it was the highest-selling SUV in the Indian mar… [+2615 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "The Newspaper's Staff Reporter", "title": "Weekly inflation up 0.67pc due to rise in food prices - DAWN.com", "description": "This is the fifth consecutive week that has witnessed an increase.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2021/11/618603319a658.jpg", "publishedAt": "2021-11-06T01:14:23Z", "content": "ISLAMABAD: Inflation measured through Sensitive Price Index (SPI) posted an increase of 0.67 per cent for the week ending on Nov 4, driven by a sharp rise in prices of essential food items, data rele… [+2656 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Ruchika Chitravanshi", "title": "Book-keeping to actuarial: Govt may ban non-audit services to audit clients - Business Standard", "description": "Move will improve corporate governance, address conflict of interest concerns", "url": "https://www.business-standard.com/article/economy-policy/book-keeping-to-actuarial-govt-may-ban-non-audit-services-to-audit-clients-121110600007_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-03/12/full/1583957403-1822.jpg", "publishedAt": "2021-11-06T00:32:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Cara Lombardo, Miriam Gottfried, Dana Cimilluca", "title": "Advent, Permira Near Deal to Buy McAfee for More Than $10 Billion - The Wall Street Journal", "description": "A deal for the security-software company could be announced by Monday; talks are ongoing", "url": "https://www.wsj.com/articles/advent-nears-deal-to-buy-mcafee-for-more-than-10-billion-11636140926", "urlToImage": "https://images.wsj.net/im-430327/social", "publishedAt": "2021-11-05T23:23:00Z", "content": "Security-software company McAfee Corp. is nearing a deal to sell itself to a group including private-equity firms Advent International Corp. and Permira for more than $10 billion, according to people… [+218 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Editorial Dept", "title": "Bearish News Piles Up For Crude Oil - OilPrice.com", "description": "Although prices are moving higher on Friday, traders are taking a cautious approach while pricing in rising Saudi oil production and a potential release from the U.S. Strategic Petroleum Reserve", "url": "https://oilprice.com/Energy/Energy-General/Bearish-News-Piles-Up-For-Crude-Oil.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2021-11-05_3yfef6ui2o.jpg", "publishedAt": "2021-11-05T23:00:00Z", "content": "Carbon capture is about to…\r\nAs the world grapples with…\r\nWhile there have been some…\r\nBy Editorial Dept - Nov 05, 2021, 6:00 PM CDTU.S. West Texas Intermediate are edging higher on Friday after OPEC… [+7224 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Enrico Frahn", "title": "Shiba Inu Coin inches back up after whale moves 40 trillion tokens, Ethereum remains stable as Bitcoin weakens - Notebookcheck.net", "description": "Three cryptocurrencies, three different market trends. Just in time for the weekend, we summarize what has happened on the crypto market over the last five days, with a particular focus on Bitcoin, Ethereum and the Shiba Inu Coin.", "url": "https://www.notebookcheck.net/Shiba-Inu-Coin-inches-back-up-after-whale-moves-40-trillion-tokens-Ethereum-remains-stable-as-Bitcoin-weakens.577570.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/Crypto_News_Bitcoin_Ethereum_Shiba_Inu_Coin.jpg", "publishedAt": "2021-11-05T22:04:11Z", "content": "Another turbulent week on the crypto market is slowly coming to an end. On Monday, crypto enthusiasts woke up to the unfortunate news that the sketchy Squid Game cryptocurrency lost practically all o… [+1597 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Taylor Hatmaker", "title": "New antitrust suit from Phhhoto alleges Facebook copied and killed the competition - TechCrunch", "description": "A former upstart Instagram rival is suing Meta, formerly known as Facebook, over allegations that the company violated antitrust laws by cloning a competing product and ultimately killing its business. The app, Phhhoto, launched in 2014, inviting users to cre…", "url": "http://techcrunch.com/2021/11/05/phhhoto-sues-meta-facebook-antitrust/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2017/06/phhhoto-instagram.jpg?w=711", "publishedAt": "2021-11-05T21:47:48Z", "content": "A former upstart Instagram rival is suing Meta, formerly known as Facebook, over allegations that the company violated antitrust laws by cloning a competing product and ultimately killing its busines… [+4363 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold price jumps nearly $25, is this the start of a breakout? - Kitco NEWS", "description": "", "url": "https://www.kitco.com/news/2021-11-05/Gold-price-jumps-nearly-25-is-this-the-start-of-a-breakout.html", "urlToImage": "https://www.kitco.com/news/2021-11-05/images/shutterstock_50195599-min.jpg", "publishedAt": "2021-11-05T20:13:00Z", "content": "(Kitco News) With the Federal Reserve's tapering and new employment data out of the way, the gold market is finally moving.\r\nGold jumped $25 on Friday as markets started to anticipate a more patient … [+3892 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Mayowa Adebajo", "title": "Tampa Mayor To Start Receiving Paychecks In Bitcoin - Coingape", "description": "According to an eyewitness report, Tampa Mayor, Jane Castor has announced that she is ready to start accepting her paycheck in Bitcoin (BTC). The sources reveal that she made the announcement at the ongoing Florida’s Bitcoin & Blockchain Summit which is holdi…", "url": "https://coingape.com", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/11/05235743/fa9b6509d0fa556956af32bf04738182.jpeg", "publishedAt": "2021-11-05T18:45:59Z", "content": "Eyewitness reports by an attendee at the summit confirms that crypto lending platform Celsius Network will be in charge of facilitating the mayors BTC payments, as she challenges her Miami counterpar… [+1381 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Sun TV Networks reports Q2 PAT at Rs 395.55 crore - Moneycontrol", "description": "The company had reported a PAT of Rs 335.02 crore in the July-September period a year ago, Sun TV Network said in a BSE filing.", "url": "https://www.moneycontrol.com/news/business/sun-tv-networks-reports-q2-pat-at-rs-395-55-cr-7683881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/SUN-TV-NETWORK-770x433.jpg", "publishedAt": "2021-11-05T15:36:16Z", "content": "Sun TV Networks Ltd on November 5 reported a consolidated profit after tax (PAT) of Rs 395.55 crore for the second quarter ended September 30. The company had reported a PAT of Rs 335.02 crore in the… [+1297 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "This Surat-Based Company Gifted E-Scooters To Its Employees On Diwali - CNBCTV18", "description": "Alliance Group, which runs a business of embroidery machines, gave Okinawa PraisePro electric scooters to its 35 employees, setting in motion its own climate action.", "url": "https://www.cnbctv18.com/business/thissurat-basedcompany-gifted-e-scooters-to-its-employees-on-diwali-11358442.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/01/2019-01-14T062626Z_2_LYNXNPEF0D0A1_RTROPTP_4_INDIA-ELECTRIC-SCOOTERS-1019x573.jpg", "publishedAt": "2021-11-05T14:42:00Z", "content": "MiniAlliance Group, which runs a business of embroidery machines, gave Okinawa PraisePro electric scooters to its 35 employees, setting in motion its own climate action."}, {"source": {"id": null, "name": "NDTV News"}, "author": "Radhika Parashar", "title": "Amitabh Bachchan’s NFT Series Records India’s Highest-Ever NFT Bids at Nearly $1 Million - Gadgets 360", "description": "Amitabh Bachchan’s NFT collection saw bids totalling nearly $1 million. The highest-auctioned item from the series was the “Madhushala” poem recital, recorded in the superstar’s own voice, which crossed a total of $756,000 (roughly Rs. 5.5 crore) by the time …", "url": "https://gadgets.ndtv.com/cryptocurrency/news/amitabh-bachchan-nft-collection-auction-usd-966000-beyondlife-club-india-2600417", "urlToImage": "https://i.gadgets360cdn.com/large/amitabh_bachchan_nft_twitter_bigpic_1636119637431.jpg", "publishedAt": "2021-11-05T13:59:20Z", "content": "Amitabh Bachchan emerged as one of the first major Indian celebrities to announce his series of non-fungible token (NFT) earlier this year. Excited fans of the Bollywood actor purchased digital colle… [+3913 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Elon Musk's Starlink to explore collaboration with Indian telcos for broadband - Times of India", "description": "India Business News: Elon Musk-led SpaceX's satellite broadband arm Starlink is planning to explore collaboration with telecom companies in India to expand broadband servi", "url": "https://timesofindia.indiatimes.com/business/india-business/elon-musks-starlink-to-explore-collaboration-with-indian-telcos-for-broadband/articleshow/87541476.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-87541535,width-1070,height-580,imgsize-23422,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-11-05T13:43:00Z", "content": "Elon Musk's Starlink to explore collaboration with Indian telcos for broadband"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Cryptocurrency Update: 6 Coins Rise Up To 3,016.20% In a Day; Bitcoin, Ether Fall - News18", "description": "Cryptocurrency Update: Bitcoin fell below the $62,000 mark on Friday, while Ether prices also fell. Paytm announced it might consider Bitcoin offerings", "url": "https://www.news18.com/news/business/cryptocurrency-update-6-coins-rise-up-to-3016-20-in-a-day-bitcoin-ether-fall-4407614.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/08/cryptocurrency-pexels-162978212516x9.jpg", "publishedAt": "2021-11-05T12:39:53Z", "content": "The world’s largest cryptocurrency Bitcoin fell below the $62,000 mark on Friday, October 5, after touching an all-time high of $66,000 last month. The market capitalisation of the altcoin declined b… [+3758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Jagmeet Singh", "title": "WhatsApp, Instagram, Messenger, Facebook Apps Start Showing ‘Meta’ Branding - Gadgets 360", "description": "WhatsApp, Instagram, Messenger, and Facebook apps have started showing the ‘Meta’ branding in India. It’s live on both Android and iOS devices through the latest Facebook apps.", "url": "https://gadgets.ndtv.com/apps/news/whatsapp-instagram-messenger-facebook-meta-rebranding-update-android-ios-2600296", "urlToImage": "https://i.gadgets360cdn.com/large/whatsapp_instagram_messenger_facebook_meta_image_1636114922687.jpg", "publishedAt": "2021-11-05T12:25:39Z", "content": "WhatsApp, Instagram, Messenger, and other Facebook apps have started showing the company's new Meta' branding on both Android and iOS devices. The update comes a week after Facebook announced that it… [+1957 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Elon Musk Trolled Jeff Bezos, After US Judge Cleared NASA's SpaceX Moon Lander - India Times", "description": "The US Court of Federal Claims on Thursday ruled in favour of Elon Musk's SpaceX while sidelining Jeff Bezos' Blue Origin after the latter filed a lawsuit against NASA for giving SpaceX an expensive lunar lander contract.Also Read: Elon Musk Will End World Hu…", "url": "https://www.indiatimes.com/technology/news/nasa-spacex-moon-lander-elon-musk-jeff-bezos-553442.html", "urlToImage": "https://im.indiatimes.in/content/2021/Oct/Facebook-Image---2021-10-11T190559578_61643e4941346.jpg", "publishedAt": "2021-11-05T12:22:02Z", "content": "The US Court of Federal Claims on Thursday ruled in favour of Elon Musk's SpaceX while sidelining Jeff Bezos' Blue Origin after the latter filed a lawsuit against NASA for giving SpaceX an expensive … [+2266 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Kroger Denies Accepting Bitcoin Cash - U.Today", "description": "No, America's leading grocery retailer will not accept Bitcoin Cash", "url": "https://u.today/kroger-denies-accepting-bitcoin-cash", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2021-11/10619.jpg", "publishedAt": "2021-11-05T12:14:36Z", "content": "U.S. supermarket chain giant Kroger has confirmed that the press release about its decision to add the Bitcoin Cash cryptocurrency as a form of payment is fraudulent.\r\nThe fake news appeared on PRNew… [+1303 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "IANS", "title": "Google's parent Alphabet launches company to discover drugs using AI - Gadgets Now", "description": "Google's parent company Alphabet has launched a new company that aims to use artificial intelligence for drug discovery.The new company, called Isomorphic Laboratories, will leverage the success of DeepMind, another Alphabet subsidiary that used AI to predict…", "url": "https://www.gadgetsnow.com/tech-news/googles-parent-alphabet-launches-startup-to-discover-new-drugs-using-ai/articleshow/87539410.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-87539410,imgsize-8722,width-800/87539410.jpg", "publishedAt": "2021-11-05T11:26:00Z", "content": "Google's parent company Alphabet has launched a new company that aims to use artificial intelligence for drug discovery.The new company, called Isomorphic Laboratories, will leverage the success of D… [+1756 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "NCLT approves GAIL buying IL&FS's 26% stake in OTPC - Economic Times", "description": "OTPC is a special purpose vehicle between Oil and Natural Gas Corporation (ONGC), IL&FS Group and Government of Tripura (GoT) for setting up of a 726.6 MW combined cycle gas turbine (CCGT) thermal power plant at Palatana, Tripura.", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/nclt-approves-gail-buying-ilfss-26-stake-in-otpc/articleshow/87538923.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87538905,width-1070,height-580,imgsize-35836,overlay-economictimes/photo.jpg", "publishedAt": "2021-11-05T10:52:00Z", "content": "The National Company Law Tribunal has approved state-owned gas utility (India) Ltd's acquisition of bankrupt Infrastructure Leasing and Financial Services' 26 per cent stake in ONGC Tripura Power Com… [+1545 chars]"}, {"source": {"id": null, "name": "Internet"}, "author": "https://www.facebook.com/thehackernews", "title": "U.S. Federal Agencies Ordered to Patch Hundreds of Actively Exploited Flaws - The Hacker News", "description": "CISA has ordered U.S. federal agencies to patch hundreds of actively exploited vulnerabilities.", "url": "https://thehackernews.com/2021/11/us-federal-agencies-ordered-to-patch.html", "urlToImage": "https://thehackernews.com/new-images/img/a/AVvXsEjs3iic0gSgNvbkbv8L6HCr0s9LBX44Jsxoj6-297KoFb5qHypTG1rug1T_PfcO97RD92hiCdLR1C67j8Riev3zslg6vBsIHO62NwdmkzizcIFp7j2i7w1i0wRensY0-AR1iNfMRmCPqcPa8OyexUTLlpORPm-e33QJHu4J6KZ0OZdfwgLTWj4JsJ-D=s728-e1000", "publishedAt": "2021-11-05T10:10:00Z", "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has published a catalog of vulnerabilities, including from Apple, Cisco, Microsoft, and Google, that have known exploits and are being… [+2268 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "Prashant Singh", "title": "Nykaa IPO: Allotment Date, Status Check Online on BSE, Listing Date - All you need to know - Zee Business", "description": "Nykaa IPO Allotment Date: Allotment finalisation may take place on 8th November.", "url": "https://www.zeebiz.com/market-news/news-nykaa-ipo-allotment-date-status-check-online-on-bse-listing-date-all-you-need-to-know-169971", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2021/11/05/165064-nykaa.jpg", "publishedAt": "2021-11-05T10:04:51Z", "content": "Nykaa IPO: The initial share-sale of FSN E-Commerce Ventures Ltd, which runs an online marketplace for beauty and wellness products Nykaa, was subscribed 81.78 times on the last day of subscription, … [+2680 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vivek Punj", "title": "New Toyota crossover that can rival Tata Punch. See engine, specifications - Mint", "description": "Toyota Aygo x is powered by an in-line 1-litre, 3-cylinder 1KR-FE engine, which the carmaker says has been improved to meet European regulations", "url": "https://www.livemint.com/auto-news/new-toyota-crossover-that-can-rival-tata-punch-see-engine-specifications-11636102976298.html", "urlToImage": "https://images.livemint.com/img/2021/11/05/600x338/aygo_x_1636103160270_1636103305570.jpg", "publishedAt": "2021-11-05T09:55:00Z", "content": "Toyota has unveiled its new A-segment crossover, Aygo X, with urban and suburban needs of European markets. The Toyota Aygo X is built on the GA-B platform of the Toyota Global New Architecture (TNGA… [+2674 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Novavax completes process for WHO emergency use approval of COVID-19 vaccine - Moneycontrol", "description": "The company submitted to the health agency all modules required for the evaluation of NVX-CoV2373, its protein-based COVID-19 vaccine, days after receiving its first emergency use authorization from Indonesia.", "url": "https://www.moneycontrol.com/news/trends/health-trends/novavax-completes-process-for-who-emergency-use-approval-of-covid-19-vaccine-7682941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/NOVAVAX-UK-770x433.png", "publishedAt": "2021-11-05T09:53:07Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Top Performing smallcases of Samvat 2077 - Moneycontrol", "description": "smallcases are model portfolios of stocks/ETFs based on a theme, idea or strategy.", "url": "https://www.moneycontrol.com/news/business/top-performing-smallcases-of-samvat-2077-2-7682141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/samvat-2077-770x433.jpg", "publishedAt": "2021-11-05T08:46:03Z", "content": "Samvat 2077 has been a historical year for the Indian equity markets. We saw benchmark equity indices like Sensex and Nifty surpass the 60,000 and 18,000 mark respectively for the first time. The jum… [+6579 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Twesh Mishra", "title": "Vedanta now holds exclusive rights to Cairn brand, renaming on Dec 13 - Business Standard", "description": "Cairn Energy will become Capricorn Energy from that date, but will retain CNE sticker on London Stock Exchange", "url": "https://www.business-standard.com/article/companies/vedanta-now-holds-exclusive-rights-to-cairn-brand-renaming-on-dec-13-121110500546_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/12/full/1618168593-3103.jpg", "publishedAt": "2021-11-05T08:16:00Z", "content": "Vedanta now holds exclusive rights to the Cairn brand. Cairn Energy, the Scottish oil and gas exploration company, will change its company name to Capricorn Energy on December 13. The LSE stock ticke… [+3020 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "ISRO can suggest ideal locations to set up solar power projects - Economic Times", "description": "We have demonstrated the technology in identifying the best locations for putting up the solar power plants. With Prime Minister Narendra Modi announcing that India can offer the technology to other countries, we may get enquiries,  said K.Sivan, Chairman, In…", "url": "https://economictimes.indiatimes.com/industry/renewables/isro-can-suggest-ideal-locations-to-set-up-solar-power-projects/articleshow/87536221.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87536328,width-1070,height-580,imgsize-99796,overlay-economictimes/photo.jpg", "publishedAt": "2021-11-05T08:08:00Z", "content": "Indian space agency can suggest the ideal location to put up a solar power farm with the data gathered from its geostationary earth observation satellites within and outside India, said a top officia… [+2600 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Happiest Minds aims to lower revenue dependency on US to below 65% in few years - Moneycontrol", "description": "The US is the single largest revenue head for all domestic software companies primarily because the country is the most tech-savvy market with the highest adoption levels and also the largest investor in technology and automation.", "url": "https://www.moneycontrol.com/news/business/happiest-minds-aims-to-lower-revenue-dependency-on-us-to-below-65-in-few-years-7682411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/HAPPIEST-MINDS-TECHNOLOGIES-1-770x433.jpg", "publishedAt": "2021-11-05T08:06:16Z", "content": "Happiest Minds Technologies, which last week reported a 30 per cent jump in net income at over Rs 44 crore for the September quarter, wants to bring down its dependency on the worlds largest software… [+3477 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "These midcap stocks are Motilal Oswal's top picks - Mint", "description": "In the last twelve months, midcaps have outperformed by rising around 79% as compared to around 50% rise for Nifty", "url": "https://www.livemint.com/market/stock-market-news/midcap-stocks-to-buy-motilal-oswal-s-top-recommendations-11636096257019.html", "urlToImage": "https://images.livemint.com/img/2021/11/05/600x338/stockpic-kU4G--621x414@LiveMint_1636096688673.jpg", "publishedAt": "2021-11-05T07:53:05Z", "content": "Nifty continued to reach new highs in October with the index up 26% this year so far. Midcaps too outperformed and contributed to the gains significantly in the recent bull market rally. The increase… [+1980 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "PPF accounts merger: Govt issues guidelines for dealing with such cases - Mint", "description": "It is to be noted that if there is any PPF loan account, it should be closed before the merger of accounts is done.", "url": "https://www.livemint.com/money/personal-finance/ppf-accounts-merger-govt-issues-guidelines-for-dealing-with-such-cases-11636096796088.html", "urlToImage": "https://images.livemint.com/img/2021/11/05/600x338/INDIA-DEPOSITS-0_1636098387472_1636098404341.JPG", "publishedAt": "2021-11-05T07:52:30Z", "content": "Under the PPF or public provident fund scheme, an individual can open only one single account. Whenever any depositor has opened more than one PPF accounts, the second and subsequent accounts opened … [+3169 chars]"}, {"source": {"id": null, "name": "Taxscan.in"}, "author": "Taxscan Team", "title": "CBIC issues Guidelines for disallowing Debit of Electronic Credit Ledger under GST - taxscan.in", "description": "CBIC has issued the  Guidelines for disallowing debit of Electronic Credit Ledger under Rule 86A of the CGST Rules, 2017.", "url": "https://www.taxscan.in/cbic-issues-guidelines-for-disallowing-debit-of-electronic-credit-ledger-under-gst/138998/", "urlToImage": "https://www.taxscan.in/wp-content/uploads/2021/11/Electronic-Credit-Ledger-CBIC-GST-Taxscan.jpeg", "publishedAt": "2021-11-05T06:16:56Z", "content": "The Central Board of Indirect Taxes and Customs (CBIC) has issued the  Guidelines for disallowing debit of Electronic Credit Ledger under Rule 86A of the CGST Rules, 2017.\r\nRule 86A of the Central Go… [+3044 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Mahindra Sales Analysis In Oct 2021 - Bolero, Scorpio, Thar, XUV700 - GaadiWaadi.com", "description": "Mahindra posted 20,034 unit sales in the month of October 2021 as against 18,317 units during the same period in 2020", "url": "https://gaadiwaadi.com/mahindra-sales-analysis-in-oct-2021-bolero-scorpio-thar-xuv700/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/11/xuv700-700.jpg", "publishedAt": "2021-11-05T04:06:12Z", "content": "Mahindra &amp; Mahindra recorded 20,034 unit sales in the month of October 2021 as against 18,317 units during the corresponding period twelve months ago with a YoY volume increase of 10 per cent. Th… [+2519 chars]"}, {"source": {"id": null, "name": "The Driven"}, "author": null, "title": "Hyundai teases new all-electric SUV concept “Seven” - The Driven", "description": "Hyundai teases \"Seven\" concept electric vehicle, with more hyperbole than details so far.", "url": "https://thedriven.io/2021/11/05/hyundai-teases-new-all-electric-suv-concept-seven/", "urlToImage": "https://thedriven.io/wp-content/uploads/2021/11/hyundai-copy.jpg", "publishedAt": "2021-11-05T03:10:57Z", "content": "South Korean auto manufacturer Hyundai has provided teaser images of its new electric SUV concept, Seven, which it plans to fully unveil at the AutoMobility LA car show later this month.\r\nAs with all… [+2307 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Ila Patnaik", "title": "How India’s informal economy is shrinking, and why that’s good news in the long term - ThePrint", "description": "Greater formalisation will see a shift from low-paying, labour-intensive jobs in informal sector to more productive, formal-sector jobs. This could lead to disruption in short term.", "url": "https://theprint.in/ilanomics/how-indias-informal-economy-is-shrinking-and-why-thats-good-news-in-the-long-term/761659/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/11/illanomics.jpg", "publishedAt": "2021-11-05T03:05:38Z", "content": "Areport issued by the State Bank of India (SBI) last month estimated that Indias informal economy has shrunk to 15-20 per cent of the GDP in 2020-21 from 52 per cent in 2017-18. The report uses emplo… [+8364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "Reliance JioPhone Next hands-on: For first-time smartphone users - The Indian Express", "description": "The JioPhone Next is certainly a big deal for millions of Indian users who still use basic feature phones, and it’s clear that this budget smartphone is designed to become a sort of pocket internet device.", "url": "https://indianexpress.com/article/technology/mobile-tabs/reliance-jiophone-next-first-impressions-7603562/", "urlToImage": "https://images.indianexpress.com/2021/11/JioPhone-Next-FB.jpg", "publishedAt": "2021-11-04T02:15:09Z", "content": "Recently, I got a call from Jio (Reliance) to experience a phone which it claimed has been designed for first-time smartphone users. For those who already own a smartphone, a JioPhone Next may not ma… [+6949 chars]"}]}