{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Tesla robot will be business than electric car business: Elon Musk - CarToq.com", "description": "Will Solve US Labour Shortage: Elon Musk A world filled with human-like robots is what every kid envisioned the future to have and recently Tesla CEO Elon Musk has placed his bet on the same thought as he revealed that his company is currently working on the …", "url": "https://www.cartoq.com/tesla-robot-will-be-business-than-electric-car-business-elon-musk/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/tesla-bot-fb.jpg", "publishedAt": "2022-02-06T16:56:38Z", "content": "A world filled with human-like robots is what every kid envisioned the future to have and recently Tesla CEO Elon Musk has placed his bet on the same thought as he revealed that his company is curren… [+2900 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Trade setup for Monday: Top 15 things to know before Opening Bell - Moneycontrol.com", "description": "Trade Setup | According to pivot charts, the key support levels for the Nifty are placed at 17,446.66, followed by 17,377.03. If the index moves up, the key resistance levels to watch out for are 17,601.87 and 17,687.43.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-170-8042701.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/stocks_sensex_nifty_stockmarket1-1-770x433.jpg", "publishedAt": "2022-02-06T16:13:47Z", "content": "The market extended losses, amid volatility, for second consecutive session and closed with moderate losses on February 4 as elevated oil prices and rising US bond yields after hawkish stance by Bank… [+8939 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Ethereum Co-Founder Vitalik Buterin Discusses Proposal to Alleviate Network's Congestion, High Fees – Technology Bitcoin News - Bitcoin News", "description": "Ethereum’s co-founder Vitalik Buterin discussed a proposed solution to the data transfer gas problem and current scaling issues.", "url": "https://news.bitcoin.com/ethereum-co-founder-vitalik-buterin-discusses-proposal-to-alleviate-networks-congestion-high-fees/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/jjdjjdjdjjdf.jpg", "publishedAt": "2022-02-06T16:05:05Z", "content": "Ethereum’s co-founder, Vitalik Buterin, and developer Tim Beiko have been discussing a proposed solution to the data transfer gas problem and current scaling issues. Buterin talked about adding a fea… [+4530 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Olivia Brooke", "title": "Bloomberg Predicts $100,000 As Bitcoin’s Next Stop ; But When? - Coingape", "description": "Despite the current volatility of the crypto market, strong bullish sentiments still exist, especially for Bitcoin. A recent analysis by Bloomberg, which also gives insight to Ethereum’s near term performance, is calling $100,000 as the next key threshold for…", "url": "https://coingape.com", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/17171504/Bitcoin-price.jpg", "publishedAt": "2022-02-06T15:36:03Z", "content": "Despite the current volatility of the crypto market, strong bullish sentiments still exist, especially for Bitcoin. A recent analysis by Bloomberg, which also gives insight to Ethereum’s near term pe… [+2690 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Shiba Inu Whales Control 26% of Total Supply of Token: Here's How It Might Be Bullish - U.Today", "description": "Whales take control of the token as it recovers", "url": "https://u.today/shiba-inu-whales-control-26-of-total-supply-of-token-heres-how-it-might-be-bullish", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12503.jpg", "publishedAt": "2022-02-06T14:54:45Z", "content": "Disclaimer: The opinion expressed here is not investment advice it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all tradin… [+1733 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "IPO-bound LIC 3rd largest globally, but offers highest RoE of 82%: CRISIL - Mint", "description": "While for LIC the market share has been steadily declining--down from 100% in the pre-2000 era to 64.1% in 2020, for SBI Life, which is the second-largest insurer, the same was only 5% in 2016 and 8% in 2020, a Crisil report said", "url": "https://www.livemint.com/market/ipo/lic-ipo-bound-3rd-largest-globally-but-offers-highest-roe-of-82-crisil-11644154689131.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/LIC_1582216887160_1644155079898.jpg", "publishedAt": "2022-02-06T13:46:57Z", "content": "The IPO-bound national insurer Life Insurance Corporation (LIC) is not only the world's largest when it comes to home-market share with over 64.1 per cent of the total gross written premium as of 202… [+4748 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Cryptocurrency Updates: Bitcoin, Ethereum Jumps 10% While Shiba Inu, Dogecoin, BNB coin Become Bullish - Analytics Insight", "description": "Bitcoin have recorded an impressive jump of over 10% during the bull market condition. Other high-performing cryptocurrencies like Bitgert, Centcex, Dogecoin, and others have been bullish, with some posting skyrocketing prices.", "url": "https://www.analyticsinsight.net/cryptocurrency-updates-bitcoin-ethereum-jumps-10-while-shiba-inu-dogecoin-bnb-coin-become-bullish/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2022/02/Bitcoin_Investment-780x438-1.jpg", "publishedAt": "2022-02-06T13:14:02Z", "content": "This article features the latest updates on cryptocurrencies like Bitcoin, Ethereum, and more.\r\nThe ending first week of February has been fantastic for the crypto community. The week produced some o… [+4244 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "Duo Nine", "title": "Shiba Inu Price Analysis: SHIB is Facing Huge Resistance that Can End the Bearish Trend - CryptoPotato", "description": "SHIB has reached a critical resistance level. A break above would mean that SHIB could likely go for a short-term price rally following a series of", "url": "https://cryptopotato.com/shiba-inu-price-analysis-shib-is-facing-huge-resistance-that-can-end-the-bearish-trend/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2022/02/SHIBUSDT_2022-02-06_13-41-00.png", "publishedAt": "2022-02-06T12:34:40Z", "content": "SHIB has reached a critical resistance level. A break above would mean that SHIB could likely go for a short-term price rally following a series of bearish weeks.\r\nKey Support level: $0.000018\r\nKey R… [+2079 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Energy & Precious Metals - Weekly Review and Outlook By Investing.com - Investing.com", "description": "Energy & Precious Metals - Weekly Review and Outlook", "url": "https://www.investing.com/news/commodities-news/energy--precious-metals--weekly-review-and-outlook-2757798", "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEC0K0JU_L.jpg", "publishedAt": "2022-02-06T11:52:00Z", "content": "By Barani Krishnan\r\nInvesting.com -- The Fear and Greed Index measures investor sentiment in stocks, bonds and cryptocurrencies with a 0-100 reading, where 0 is the state of extreme fear causing extr… [+13007 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Milan Vaishnav CMT MSTA", "title": "Trade Setup: Nifty may trade in a defined range; avoid shorts - Economic Times", "description": "Monday's session is likely to have a quiet start to the day. The levels of 17,580 and 17,630 will act as potential resistance points, while support will come in at 17,410 and 17,350.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/trade-setup-nifty-may-trade-in-a-defined-range-avoid-shorts/articleshow/89385313.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89385297,width-1070,height-580,imgsize-605584,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-06T11:44:00Z", "content": "While continuing to trade on the expected lines, the Indian equity market continued to correct modestly and end the day on a negative note. Headline index Nifty opened on a positive note, and after t… [+2395 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Hyundai Model Wise Jan 2022 Sales - Creta, Venue, i20, Alcazar, Verna - GaadiWaadi.com", "description": "Hyundai posted a total of 44,022 units in the month of January 2022 as against 52,005 units with a YoY decline of 15.4 per cent", "url": "https://gaadiwaadi.com/hyundai-model-wise-jan-2022-sales-creta-venue-i20-alcazar-verna/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/07/2020-hyundai-creta-turbo-1.4-1-5-e1595184811998.jpg", "publishedAt": "2022-02-06T11:30:08Z", "content": "Hyundai Motor India Limited (HMIL) garnered a cumulative domestic tally of 44,022 units in the month of January 2022 as against 52,005 units during the same period in 2021 with a YoY volume decline o… [+2733 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "RBI likely to maintain status quo in policy rate next week, say experts - Moneycontrol", "description": "Experts, however, are of the opinion that RBI's monetary policy committee (MPC) may change the policy stance from 'accommodative' to 'neutral' and tinker with the reverse-repo rate as part of the liquidity normalisation process.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-likely-to-maintain-status-quo-in-policy-rate-next-week-say-experts-8046511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/RBI-770x433.jpg", "publishedAt": "2022-02-06T11:22:27Z", "content": "In view of inflationary concerns, the Reserve Bank is likely to maintain the status quo on key policy rates in its next bi-monthly economic policy, which will be the first after the presentation of t… [+4132 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Sintex Industries insolvency in final stages, company receives revised bids - Economic Times", "description": "The resolution professional of Sintex Industries has also received bids from Welspun Group firm Easygo Textiles, GHCL and Himatsingka Ventures along with Shrikant Himatsingka and Dinesh Kumar Himatsingka.", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/sintex-industries-insolvency-in-final-stages-company-receives-revised-bids/articleshow/89384914.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89384965,width-1070,height-580,imgsize-115544,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T11:12:00Z", "content": "Four companies, including Reliance Industries, competing for Sintex Industries have revised their bids that will now be placed before the Committee of Creditors (CoC) of the debt-ridden textiles make… [+2277 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "MG unveils the ZS EV facelift for India - Team-BHP", "description": "MG has revealed the ZS EV facelift for the Indian market. The electric SUV will be launched later this month. Bookings for the updated MG ZS EV are now open. Depending on the availability, customers who have booked the older car will also get a facelift versi…", "url": "https://www.team-bhp.com/news/mg-unveils-zs-ev-facelift-india", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20220205124012_new_zs_ev.jpg", "publishedAt": "2022-02-06T10:00:18Z", "content": "MG has revealed the ZS EV facelift for the Indian market. The electric SUV will be launched later this month.\r\nBookings for the updated MG ZS EV are now open. Depending on the availability, customers… [+762 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "January Was Terrible Month for Crypto Investment Products - U.Today", "description": "Institutional crypto products are off to a rough start in 2022", "url": "https://u.today/january-was-terrible-month-for-crypto-investment-products", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12500.jpg", "publishedAt": "2022-02-06T09:55:15Z", "content": "Institutional investors pulled a record amount of money from cryptocurrency investment products last month, according to a report published by the Financial Times that cites data from crypto analytic… [+1649 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Adani group incorporates new subsidiary to set up data centre unit in Mumbai - Mint", "description": "The subsidiary, Mumbai Data Center Ltd, will develop, operate, maintain, and deal with data centres, information technology, cloud providing services, the ports-to-energy conglomerate said", "url": "https://www.livemint.com/companies/adani-group-incorporates-new-subsidiary-to-set-up-data-centre-unit-in-mumbai-11644139942088.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/c2078012-1eb6-11eb-bba9-b793ed5b76e5_1604746886618_1604746923600_1644140681248.jpg", "publishedAt": "2022-02-06T09:45:35Z", "content": "AdaniConnex Private Ltd, a joint venture of Adani Enterprises with EdgeConnex Europe BV, has incorporated a new subsidiary to set to data centres in Mumbai. \r\nThe subsidiary, Mumbai Data Center Limit… [+2430 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "ETMarkets Investors' Guide: Is underperformer ITC the most resilient Nifty stock? - Economic Times", "description": "Although range-bound in the last few months, ITC is one of the few stocks that proves to be resilient enough in a falling market. Brokerages think that the stock can now soar up to 28% on strong Q3 numbers. In today's special podcast with independent market e…", "url": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/etmarkets-investors-guide-is-underperformer-itc-the-most-resilient-nifty-stock/podcast/89383467.cms", "urlToImage": "https://img.etimg.com/photo/89383467.cms", "publishedAt": "2022-02-06T09:39:00Z", "content": "Hello, you have tuned into ETMarkets Investors' Guide, a show about asset classes, investment ideas and market trends. I am Nikhil Agarwal.Although range-bound in the last few months, ITC is one of t… [+1141 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Reliance Jio Is Compensating Users With Two Days of Free Service - TelecomTalk", "description": "Reliance Jio had offered users two extra days of services the last time the telco’s networks were down in 2021.", "url": "https://telecomtalk.info/reliance-jio-is-compensating-users-with-two/496986/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2022/02/reliance-jio-is-compensating-users-with-two.jpeg", "publishedAt": "2022-02-06T09:37:49Z", "content": "Reliance Jio users in Mumbai had to face a network down scenario on Saturday. According to some users, the network was down for them for almost eight hours. To compensate for the same, Jio is giving … [+1500 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Sonal Sachdev", "title": "BOTTOMLINE: There’s more to DB Realty than meets the eye - CNBCTV18", "description": "The flip-flop over the Godrej Properties-DB Realty deal conceals more than it reveals. What is the bigger plot?", "url": "https://www.cnbctv18.com/real-estate/bottomline-theres-more-to-db-realty-than-meets-the-eye-12384062.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/01/Real-estate-reu-1.png", "publishedAt": "2022-02-06T09:21:00Z", "content": "MiniThe flip-flop over the Godrej Properties-DB Realty deal conceals more than it reveals. What is the bigger plot?"}, {"source": {"id": null, "name": "Ambcrypto.com"}, "author": "Yash Majithia", "title": "Solana, VeChain, Ethereum Classic Price Analysis: 06 February - AMBCrypto News", "description": "While the overall market sentiment seemingly improved, Solana, VeChain, and Ethereum Classic continued their up-channel oscillation. Their near-term technicals flashed a bullish preference, but the same seemed to slow down in the near term after testing the o…", "url": "https://ambcrypto.com/solana-vechain-ethereum-classic-price-analysis-06-february/", "urlToImage": "https://files.ambcrypto.com/wp-content/uploads/2022/02/06122611/investing-g3c088bc0f_1280-1000x600.jpg", "publishedAt": "2022-02-06T09:01:09Z", "content": "While the overall market sentiment seemingly improved, Solana, VeChain, and Ethereum Classic continued their up-channel oscillation. Their near-term technicals flashed a bullish preference, but the s… [+2550 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "carandbike Team", "title": "Hyderabad-Based Cellestial E-Mobility Inks Deal With Mexican Firm; To Export India's First Electric Tractor - CarandBike", "description": "Cellestial E-Mobility will target to sell 4,000 e-tractors in the Mexican market over the next 3 years.", "url": "https://www.carandbike.com/news/hyderabad-based-cellestial-e-mobility-inks-deal-with-mexican-firm-to-export-indias-first-electric-tractor-2752187", "urlToImage": "https://c.ndtvimg.com/2022-02/kdcp6vog_cellestial-emobility-_625x300_06_February_22.jpg", "publishedAt": "2022-02-06T08:41:25Z", "content": "Cellestial E-Mobility, makers of India's first e-tractor for the Agri, Airport GSE, and goods carrier sector announced it has inked a marketing, sales distribution partnership with Mexican company Gr… [+1915 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "SBI Alert! Your banking services will soon stop if you fail to do THIS, bank cautions 40 crore users - Zee News", "description": "State Bank of India (SBI) has sent an alert to its millions across the country, urging them to link their PAN with their Aadhaar card before March 31, 2022.", "url": "https://zeenews.india.com/personal-finance/sbi-alert-your-banking-services-will-soon-stop-if-you-fail-to-do-this-bank-cautions-40-crore-users-2434008.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/02/06/1012178-untitled-design-26.jpg", "publishedAt": "2022-02-06T08:25:30Z", "content": "New Delhi: State Bank of India (SBI) has sent an alert to its millions across the country, urging them to link their PAN with their Aadhaar card before March 31, 2022. The bank has cautioned its user… [+1491 chars]"}, {"source": {"id": null, "name": "Usethebitcoin.com"}, "author": "Jonathan Gibson", "title": "Litecoin Integrates Mimblewimble (MWEB) Extension Blocks - UseTheBitcoin", "description": "Litecoin (LTC), one of the oldest cryptocurrencies in the market, has already released its long-awaited network update called Mimblewimble", "url": "https://usethebitcoin.com/litecoin-integrates-mimblewimble-mweb/", "urlToImage": "https://usethebitcoin.com/wp-content/uploads/2018/09/Litecoin-numbers-bg.jpg", "publishedAt": "2022-02-06T08:17:36Z", "content": "Litecoin (LTC), one of the oldest cryptocurrencies in the market, has already released its long-awaited network update called Mimblewimble through extension blocks – also known as MWEB. This is the m… [+2633 chars]"}, {"source": {"id": null, "name": "U.Today"}, "author": null, "title": "Dogecoin Community Reaches Major Milestone - U.Today", "description": "The follower count of the official Dogecoin Twitter account has surpassed three million users", "url": "https://u.today/dogecoin-community-reaches-major-milestone", "urlToImage": "https://u.today/sites/default/files/styles/1200x900/public/2022-02/12501.jpg", "publishedAt": "2022-02-06T08:16:43Z", "content": "The official Twitter account of meme cryptocurrency Dogecoin has surpassed three million followers.\r\nCongrats to the @Dogecoin account for reaching 3 million followers!\r\nThe #Dogecoin family is growi… [+1799 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Air India: A name chosen through opinion poll more than 75 years ago - Deccan Herald", "description": "More than 75 years ago, an opinion poll among Tata employees to choose from four names resulted in the country's first airline company being named as 'Air India'. Little over 10 days after formally taking control of Air India, Tata Group on Sunday shared nugg…", "url": "https://www.deccanherald.com/business/air-india-a-name-chosen-through-opinion-poll-more-than-75-years-ago-1078585.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/02/06/air-india-reuters-1040281-1634120552-1078585-1644142014.jpg", "publishedAt": "2022-02-06T08:12:37Z", "content": "More than 75 years ago, an opinion poll among Tata employees to choose from four names resulted in the country's first airline company being named as 'Air India'.\r\nLittle over 10 days after formally … [+3093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "The week that was: Smallcap soars 37% after Vijay Kedia buys stake - Economic Times", "description": "A doubling of Q3 profit sent Deepak Fertilisers shares up by 20 per cent in the December quarter.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/the-week-that-was-smallcap-soar-37-after-vijay-kedia-buys-stake/articleshow/89381688.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89381789,width-1070,height-580,imgsize-292136,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-06T07:52:00Z", "content": "NEW DELHI: Domestic stocks were in for a roller-coaster ride last week, thanks to Budget-induced volatility. While the largecap benchmark indices gained 2.4-2.5 per cent each for the week, a host of … [+3144 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Ahead of IPO, LIC ropes in 6 independent directors on its board - Mint", "description": "IPO-bound LIC ropes in 6 independent directors: With the appointment, the total number of independent directors goes up to 9 and all vacancies are filled", "url": "https://www.livemint.com/companies/news/ahead-of-ipo-lic-ropes-in-6-independent-directors-on-its-board-11644132155251.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/LIC_independent_directors_1644132326845_1644132327100.jpg", "publishedAt": "2022-02-06T07:28:27Z", "content": "New Delhi: Ahead of initial public offering (IPO), Life Insurance Corporation (LIC) has last month appointed six independent directors on its board to meet regulatory norms of corporate governance.\r\n… [+2030 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "Covid tests make Indians poorer by Rs 74K cr in 2 years, says NGO - Deccan Herald", "description": "In the past two years of the Coronavirus pandemic, Indians have coughed out a stupendous Rs 74,000 crore for 74 crore Covid-19 tests from dubious private pathological labs. Finally, around 4.20 crore positive cases were detected with more than 500,000 deaths,…", "url": "https://www.deccanherald.com/national/covid-tests-make-indians-poorer-by-rs-74k-cr-in-2-years-says-ngo-1078567.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/02/06/download-8-1078567-1644134636.png", "publishedAt": "2022-02-06T06:31:17Z", "content": "In the past two years of the Coronavirus pandemic, Indians have coughed out a stupendous Rs 74,000 crore for 74 crore Covid-19 tests from dubious private pathological labs. Finally, around 4.20 crore… [+4523 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "SBI lines up 6 NPA accounts for sale to ARCs to recover dues of ₹406 crore - Mint", "description": "The six NPA accounts put up for sale to the ARCs are - Patna Bakthiyarpur Tollway, Steelco Gujarat Ltd, GOL Offshore Ltd, Andhra Ferro Alloys Ltd, Guru Ashish Taxfab and Genix Automations Pvt Ltd", "url": "https://www.livemint.com/industry/banking/sbi-lines-up-6-npa-accounts-for-sale-to-arcs-to-recover-dues-of-rs-406-crore-11644128720492.html", "urlToImage": "https://images.livemint.com/img/2022/02/06/600x338/SBI_1644128872801_1644128873006.JPG", "publishedAt": "2022-02-06T06:30:07Z", "content": "New Delhi: Country's largest lender SBI has lined up six non-performing assets (NPAs) for sale to asset reconstruction companies (ARCs) to recover dues of nearly 406 crore.\r\nThe six NPA accounts put … [+1912 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Airtel to spend Rs 1.17 lakh crore on various businesses with subsidiaries over next 5 years - Economic Times", "description": "According to the EGM notice, Bharti Airtel will spend Rs 88,000 crore in business with mobile tower company Indus Towers, Rs 15,000 crore for availing services of datacentre firm Nxtra and transaction of up to Rs 14,000 crore with Bharti Hexacom.", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/airtel-to-spend-rs-1-17-lakh-cr-on-various-businesses-with-subsidiaries-over-a-period-of-5-years/articleshow/89380197.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89380204,width-1070,height-580,imgsize-46662,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T06:10:00Z", "content": "Telecom operator Bharti Airtel has plans to spend about Rs 1.17 lakh crore through business transactions with its subsidiaries like Indus Towers, Nxtra and Bharti Hexacom, according to a regulatory f… [+1143 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol.com", "description": "Ajit Mishra of Religare Broking recommended focusing on sector-specific opportunities while keeping a check on leveraged positions.", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-25-8045031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/shutterstock_1151323274-1-770x433.jpg", "publishedAt": "2022-02-06T06:00:49Z", "content": "The market snapped two-week sharp losing streak and clocked nearly 2.5 percent gains in the week ended February 4, thanks to the growth-oriented budget presented by Finance Minister by increasing cap… [+11008 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India's digital currency to debut by early 2023 - Economic Times", "description": "A top government source said the digital currency issued by the RBI would be numbered in units, just like every fiat currency has an unique number.", "url": "https://economictimes.indiatimes.com/news/economy/policy/indias-digital-currency-to-debut-by-early-2023/articleshow/89379626.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89379653,width-1070,height-580,imgsize-81336,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T05:33:00Z", "content": "India's very own official digital currency is likely to debut by early 2023, which will mirror any of the currently available private company-operated electronic wallets, but with a change that it wi… [+2763 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Report: Andreessen Horowitz Seeks an Investment in Bored Ape Yacht Club – Bitcoin News - Bitcoin News", "description": "Two reports claim that the creators of the popular NFT project Bored Ape Yacht Club (BAYC) are in talks of raising funds from investors.", "url": "https://news.bitcoin.com/report-andreessen-horowitz-seeks-an-investment-in-bored-ape-yacht-club/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/gdggdggfgff.jpg", "publishedAt": "2022-02-06T05:15:31Z", "content": "Two reports claim that the creators of the popular non-fungible token (NFT) project Bored Ape Yacht Club (BAYC) are in talks of raising funds from investors such as the venture capital firm Andreesse… [+3909 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Goodbye easy money as hawkish Central Banks speed up rate hikes - Economic Times", "description": "Two years after the pandemic sent the global economy into a deep but short recession, central bankers are withdrawing their emergency support -- and theyre moving faster than they or most investors had foreseen.", "url": "https://economictimes.indiatimes.com/news/economy/indicators/goodbye-easy-money-as-hawkish-central-banks-speed-up-rate-hikes/articleshow/89379056.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89379053,width-1070,height-580,imgsize-114812,overlay-economictimes/photo.jpg", "publishedAt": "2022-02-06T05:03:00Z", "content": "The end of easy money is upon us.\r\nTwo years after the pandemic sent the global economy into a deep but short recession, central bankers are withdrawing their emergency support -- and theyre moving f… [+5593 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "SBI shares at 52-week high. Experts predict more rise after strong Q3 results - Mint", "description": "SBI share price may continue to surge as Stata Bank of India has reported strong Q3 earnings as its year-on-year (YoY) net profit has shot up around 62 per cent, believe stock market experts", "url": "https://www.livemint.com/market/stock-market-news/sbi-shares-at-52-week-high-experts-predict-more-rise-after-strong-q3-results-11644052724387.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/SBIFD_1579255374805_1644053508620.jpg", "publishedAt": "2022-02-06T04:47:01Z", "content": "State Bank of India or SBI share price on Friday made new 52-week high of 546.40 per shares. SBI shares opened with an upside gap of around 2 per shares and went on to scale new 52-week high in early… [+2832 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Movers & Shakers | Top 10 stocks that moved the most last week - Moneycontrol.com", "description": "\"Going ahead, 17400 is a key support to watch out for below which the index can test 17200 in the short term. On the other hand, 17800 will act as the upper end of the short term consolidation range,\" said Gaurav Ratnaparkhi, Head of Technical Research, Share…", "url": "https://www.moneycontrol.com/news/photos/business/stocks/movers-shakers-top-10-stocks-that-moved-the-most-last-week-37-8044841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/stocks_sensex_nifty_stockmarket1-1-770x433.jpg", "publishedAt": "2022-02-06T04:06:36Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Anand Mahindra plans to visit Amritsar eatery run by 11 and 17-year-old brothers - Moneycontrol.com", "description": "Anand Mahindra shared a story of two brothers -- a 17-year-old and an 11-year-old -- who were running a pizza restaurant all by themselves after their father died in December 2021.", "url": "https://www.moneycontrol.com/news/trends/anand-mahindra-plans-to-visit-amritsar-eatery-run-by-11-and-17-year-old-brothers-8044861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/pjimage-45-770x433.jpg", "publishedAt": "2022-02-06T03:43:58Z", "content": "By Anand Mahindra's admission, Amritsar may have the best jalebis in the world, but now, there's another reason why the industrialist may head to the city for a food binge.\r\nThe industrialist took to… [+1990 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mukesh Ambani buys India’s most EXPENSIVE Rolls Royce Cullinan with a VIP numberplate - CarToq.com", "description": "India’s second richest man – Mukesh Ambani has an exquisite garage with numerous imported cars. Most of the cars in the Ambani garage are CBU units including several Rolls Royce. According to new reports, Ambani has added one more Rolls Royce Cullinan to his …", "url": "https://www.cartoq.com/mukesh-ambani-buys-indias-most-expensive-rolls-royce-cullinan-with-a-vip-numberplate/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/Cullinan_1.jpg", "publishedAt": "2022-02-06T03:19:12Z", "content": "India’s second richest man – Mukesh Ambani has an exquisite garage with numerous imported cars. Most of the cars in the Ambani garage are CBU units including several Rolls Royce. According to new rep… [+2828 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Billionaire Ray Dalio Discusses Future of Money, Insists Some Governments Will Ban Crypto – Featured Bitcoin News - Bitcoin News", "description": "Billionaire Ray Dalio, the founder of the world's largest hedge fund, Bridgewater Associates, has shared his view on cryptocurrency investing and the future of money. He believes that crypto will be banned by different governments.", "url": "https://news.bitcoin.com/billionaire-ray-dalio-future-of-money-insists-some-governments-will-ban-crypto/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/ray-dalio.jpg", "publishedAt": "2022-02-06T03:01:44Z", "content": "Billionaire Ray Dalio, the founder of the world’s largest hedge fund, Bridgewater Associates, has shared his view on cryptocurrency investing and the future of money. He believes that crypto will be … [+2662 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Daily Voice | Excellent time to add these 6 sectors to diversified portfolio with 10-20% allocation for... - Moneycontrol", "description": "Budget 2022 | The big themes for the next 1-2 years are infrastructure growth and cyclical recovery, as the budget has clarified. Also, FM has focused on Fintech instead of Banking, Electric Vehicles, and Edtech instead of Education which has brought back foc…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-excellent-time-to-add-these-6-sectors-to-diversified-portfolio-with-10-20-allocation-for-long-term-sonam-srivastava-of-wright-research-8044031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Sonam_Srivastava1280-770x433.jpg", "publishedAt": "2022-02-06T02:46:12Z", "content": "With Budget 2022, the government has shifted focus to infrastructure growth. The Finance Minister has increased the Capex investment target by 35 percent to Rs 7.5 lakh crore and announced critical i… [+6390 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Petrol, Diesel Prices Today on February 6: Check rates in Delhi, Mumbai, other cities - Moneycontrol", "description": "Petrol and diesel prices have been frozen in the past but the current 93-day pause is the longest since daily fuel price revision was adopted in June 2017.", "url": "https://www.moneycontrol.com/news/india/petrol-diesel-prices-today-on-february-6-check-rates-in-delhi-mumbai-other-cities-8044741.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/09/RTS1SHSW-1-770x433.jpg", "publishedAt": "2022-02-06T02:04:47Z", "content": "Petrol and diesel prices remained unchanged for the 93rd day on February 6, the longest ever period, according to a price notification by state-owned fuel retailers.\r\nThis comes as the central govern… [+1895 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Rich Dad Poor Dad's Robert Kiyosaki Says the Fed and Treasury Are Destroying the Dollar, Advises Saving Bitcoin – Featured Bitcoin News - Bitcoin News", "description": "The famous author of the best-selling book Rich Dad Poor Dad, Robert Kiyosaki, has warned that the Federal Reserve and the Treasury are destroying the U.S. dollar. Noting that they are sending billions of dollar savers and uninformed investors to \"financial h…", "url": "https://news.bitcoin.com/rich-dad-poor-dads-robert-kiyosaki-fed-treasury-destroying-dollar-advises-saving-bitcoin/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/kiyosaki.jpg", "publishedAt": "2022-02-06T01:06:31Z", "content": "The famous author of the best-selling book Rich Dad Poor Dad, Robert Kiyosaki, has warned that the Federal Reserve and the Treasury are destroying the U.S. dollar. Noting that they are sending billio… [+3004 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vinod Mahanta", "title": "Crypto exchanges to brief policymakers on TDS tangles - Economic Times", "description": "According to the provisions of this years finance bill, the buyer of a cryptocurrency has to deduct 1% of the sale consideration and pay the amount as an advance tax to the government on behalf of the seller on every trade.", "url": "https://economictimes.indiatimes.com/tech/technology/crypto-exchanges-to-brief-policymakers-on-tds-tangles/articleshow/89372406.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89372407,width-1070,height-580,imgsize-489916,overlay-ettech/photo.jpg", "publishedAt": "2022-02-06T00:30:00Z", "content": "Mumbai: The industry body representing cryptocurrency exchanges has decided to reach out to relevant policymakers to brief them about complications arising out of the governments move to levy a 1% TD… [+4132 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "US Lawmakers Introduce 'Virtual Currency Tax Fairness Act' to Boost Cryptocurrency Use for Payments – Regulation Bitcoin News - Bitcoin News", "description": "Several U.S. lawmakers have introduced the Virtual Currency Tax Fairness Act to strengthen \"the legitimacy of cryptocurrency in our digital economy.\" The bill also aims to expand the use of cryptocurrencies for payments.", "url": "https://news.bitcoin.com/us-lawmakers-virtual-currency-tax-fairness-act-boost-cryptocurrency-use-for-payments/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/fairness-act.jpg", "publishedAt": "2022-02-05T23:02:36Z", "content": "Several U.S. lawmakers have introduced the Virtual Currency Tax Fairness Act to strengthen “the legitimacy of cryptocurrency in our digital economy.” The bill also aims to expand the use of cryptocur… [+2866 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Venezuelan Government Approves New Tax for Cryptocurrency and Foreign Currency Transactions – Bitcoin News - Bitcoin News", "description": "The Venezuelan Government has approved a new tax that would affect transactions made in foreign currency and cryptocurrency transactions.", "url": "https://news.bitcoin.com/venezuelan-government-approves-new-tax-for-cryptocurrency-and-foreign-currency-transactions/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/shutterstock_776493799.jpg", "publishedAt": "2022-02-05T21:08:01Z", "content": "The Venezuelan Government has approved a new tax that would affect transactions made in foreign currency and cryptocurrency transactions. Approved by the National Assembly of the country, the tax, ca… [+3412 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Ford F150 Lightning with Sunrun charger can power your home for 3 days - CarToq.com", "description": "Imagine if you are at your home and there’s a power outage what do you do? Well, if you have the Ford F-150 Lightning; the upcoming all-electric pickup truck from the American automaker, you just plug in your vehicle and it then powers your house. The Ford Mo…", "url": "https://www.cartoq.com/ford-f150-lightning-with-sunrun-charger-can-power-your-home-for-3-days/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/ford-f150-lightning-fb.jpg", "publishedAt": "2022-02-05T17:27:32Z", "content": "Imagine if you are at your home and theres a power outage what do you do? Well, if you have the Ford F-150 Lightning; the upcoming all-electric pickup truck from the American automaker, you just plug… [+3110 chars]"}, {"source": {"id": null, "name": "CryptoGlobe"}, "author": "Siamak Masnavi", "title": "MicroStrategy CEO: New Ways of Acquiring More Bitcoin, Investing in MSTR vs Bitcoin ETFs - CryptoGlobe", "description": "Michael J. Saylor, Co-Founder, Chairman, and CEO of Nasdaq-listed business intelligence companyMicroStrategy Inc. (NASDAQ: MSTR), recently talked about how they might want to generate yield from their Bitcoin holdings, as well as how his firm’s stock compares…", "url": "https://www.cryptoglobe.com/latest/2022/02/microstrategy-ceo-new-way-of-acquiring-more-bitcoin-investing-in-mstr-vs-bitcoin-etfs/", "urlToImage": "https://cryptoglobe.s3.eu-west-2.amazonaws.com/2020/12/Michael-Saylor-in-Feb-2019-768x396.png", "publishedAt": "2022-02-05T17:15:24Z", "content": "Michael J. Saylor, Co-Founder, Chairman, and CEO of Nasdaq-listed business intelligence companyMicroStrategy Inc. (NASDAQ: MSTR), recently talked about how they might want to generate yield from thei… [+8934 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Brian Bollinger", "title": "Why Are Metaverse Coins Skyrocketing Today? MANA, GALA, AXS Price Analysis - Coingape", "description": "Even though the technical chart indicated heavy bear attacks on Metacoins during the recent correction phase. The fundamental development of the Metaverse ecosystem has significantly upscaled as more renowned companies and industry giants like Meta(previously…", "url": "https://coingape.com/markets/why-are-metaverse-coins-skyrocketing-today-price-analysis-for-top-coins/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2021/12/19003033/crypto-Metaverse.png", "publishedAt": "2022-02-05T16:54:22Z", "content": "Even though the technical chart indicated heavy bear attacks on Metacoins during the recent correction phase. The fundamental development of the Metaverse ecosystem has significantly upscaled as more… [+3448 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Kunal Talgeri", "title": "Ashneer Grover vs BharatPe: Why CEO Suhail Sameer's board seat matters - YourStory", "description": "Since Managing Director Ashneer Grover's challenge to the BharatPe board, Co-founder Shashvat Nakrani has backed CEO Suhail Sameer.", "url": "https://yourstory.com/2022/02/ashneer-grover-bharatpe-ceo-suhail-sameers-board-seat/amp", "urlToImage": "https://images.yourstory.com/cs/2/f86c090087cc11eba777b34f5b721f5e/Photo-SuhailSameerBharatPe-1644072433760.png", "publishedAt": "2022-02-05T16:42:59Z", "content": "Corporate lawyers in India's startup ecosystem see innumerable kinds of \"founder-issues\" before the Series C stage of a venture's fund-raising. Discord among founders, a founder's inability to lead a… [+6794 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Fully modified old-generation Mahindra Thar 4×4 SUV for sale at Rs 8.25 lakh - CarToq.com", "description": "Mahindra Thar is currently one of the most popular SUV in the Indian market. It has been a popular SUV among off-road enthusiasts and there are several videos available online that show the off-road capabilities of the same. The popularity of Mahindra Thar to…", "url": "https://www.cartoq.com/fully-modified-old-generation-mahindra-thar-4x4/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/Thar-used-featured.jpg", "publishedAt": "2022-02-05T15:57:41Z", "content": "Mahindra Thar is currently one of the most popular SUV in the Indian market. It has been a popular SUV among off-road enthusiasts and there are several videos available online that show the off-road … [+3108 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Rekha chauhan", "title": "Bitcoin (BTC) Price Touches Three-Weeks High near $40K, Will It Maintain the Momentum! - Coingape", "description": "Bitcoin (BTC) price surprised the market on Friday with more than 11% gains, the biggest single-day gain since mid-June. The upside momentum is recorded after a rally in U.S. stocks, which ended the week with gains despite the heavy volatility from Amazon's r…", "url": "https://coingape.com/markets/bitcoin-btc-price-touches-three-weeks-high-near-40k-will-it-maintain-the-momentum/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/02/05131713/Bitcoin-Taps-40K-Surging-6-in-Less-Than-Two-Hours1.jpg", "publishedAt": "2022-02-05T15:30:48Z", "content": "Bitcoin (BTC) price surprised the market on Friday with more than 11% gains, the biggest single-day gain since mid-June. The upside momentum is recorded after a rally in U.S. stocks, which ended the … [+1705 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Tata Jan 2022 Model Wise Sales - Nexon, Tiago, Altroz, Safari, Punch - GaadiWaadi.com", "description": "Tata posted a total of 40,780 units in January 2022 as against 26,980 units with a YoY sales growth of 51.1 per cent", "url": "https://gaadiwaadi.com/tata-jan-2022-model-wise-sales-nexon-tiago-altroz-safari-punch/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/08/tata-nexon-dark-1-1.jpg", "publishedAt": "2022-02-05T11:27:47Z", "content": "Tata Motors finished in the third position in the overall manufacturers’ sales table for the month of January 2022 as 40,780 units were sold against 26,980 units during the same period last year with… [+2421 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Aneesh Phadnis", "title": "Vodafone Idea remains sole telco to offer equity stake to govt - Business Standard", "description": "Tata group-owned telecom companies withdraw their offers over differences in calculations", "url": "https://www.business-standard.com/article/companies/vodafone-idea-remains-sole-telco-to-offer-equity-stake-to-govt-122020500730_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-07/23/full/1626979069-468.jpg", "publishedAt": "2022-02-05T09:24:00Z", "content": "Tata Teleservices (TTSL) has withdrawn its proposal to offer equity in lieu of interest on deferred liabilities to the government leaving Vodafone Idea (Vi) as the only telco with an active offer.\r\nT… [+3025 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Ahead of IPO, LIC allows customers to revive lapsed policies; concession in late fee. Details - Mint", "description": "Concessions are being offered in late fee for other than term assurance and high risk plans, depending on the total premiums paid", "url": "https://www.livemint.com/companies/ahead-of-ipo-lic-allows-customers-to-revive-lapsed-policies-concession-in-late-fee-details-11644051236900.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/LIC_1642617491883_1644052186470.jpg", "publishedAt": "2022-02-05T09:13:13Z", "content": "LIC IPO launch: Ahead of its mega IPO, Life Insurance Corporation of India (LIC) has launched a campaign for revival of lapsed policies.\r\nIn a statement, the state-run insurer said policies which are… [+1352 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Seshan Vijayraghvan", "title": "Kia Carens MPV India Launch Date Announced - carandbike", "description": "The new Kia Carens three-row vehicle will be launched in India on February 15, 2022. The MPV is based on the same platform as the Kia Seltos, and employs the company's 'Opposites United' design language.", "url": "https://www.carandbike.com/news/kia-carens-mpv-india-launch-date-announced-2750674", "urlToImage": "https://c.ndtvimg.com/2022-01/2ugmu70c_kia-carens-review_625x300_29_January_22.jpg", "publishedAt": "2022-02-05T08:54:58Z", "content": "Kia Carens, the new three-row vehicle from the Korean carmaker will be launched in India on February 15, 2022. The Carens, which is being positioned as a recreational vehicle, or MPV, is based on the… [+2509 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "ICICI Bank Increases Credit Card Charges with Effect from February 10; Know Details - News18", "description": "ICICI Bank credit card customers will have to pay increased charges of various services related to credit cards, this includes late payment fees. Know details", "url": "https://www.news18.com/news/business/icici-bank-hikes-credit-card-charges-with-effect-from-february-10-know-details-4737821.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/credit-cards-164231918516x9.png", "publishedAt": "2022-02-05T08:05:00Z", "content": "ICICI Bank credit card customers will have to pay increased charges of various services related to credit cards, this includes late payment fees. These changes will come in effect from February 10, 2… [+2923 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Honda Vario 160 vs Yamaha Aerox 155: Spec comparison - HT Auto", "description": "Honda Vario 160 is a rival to the Yamaha Aerox 155 scooter, but sadly it is not available in India currently.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/honda-vario-160-vs-yamaha-aerox-155-spec-comparison-41644041905265.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/02/05/600x338/Honda-Vario-160-1200x675_1643959035225_1644045101300.jpg", "publishedAt": "2022-02-05T07:13:47Z", "content": "Only recently Honda revealed its new 2022 Vario scooter for the market of Indonesia. Needless to say, it comes out as a direct rival to the popular Yamaha Aerox 155 moto scooter that is also on sale … [+2037 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Adani Wilmar IPO: What GMP signals after finalisation of share allotment - Mint", "description": "Adani Wilmar IPO GMP today is  ₹30, which is  ₹5 higher from is yesterday's grey market premium of  ₹25, say market observers", "url": "https://www.livemint.com/market/ipo/adani-wilmar-ipo-what-gmp-signals-after-finalisation-of-share-allotment-11644044612836.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/Adani_Wilmar_IPO_1643501473787_1644044676615.PNG", "publishedAt": "2022-02-05T07:08:37Z", "content": "Adani Wilmar IPO: After the finalisation of share allocation, bidders of Adani Wilmar IPO (Initial Public Offering) are eagerly waiting for the share listing of Adani Wilmar, which is most likely on … [+2924 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Stocks vs Mutual Funds: What should you choose? - Moneycontrol.com", "description": "To simply put, if you are investing in stocks, you are responsible for your picks. On the other hand, if you invest in mutual funds, the fund manager takes this call on your behalf. You need to be mindful of certain crucial factors before choosing either asse…", "url": "https://www.moneycontrol.com/news/business/markets/stocks-vs-mutual-funds-what-should-you-choose-8043461.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/sensex_stocks-2-770x433.jpg", "publishedAt": "2022-02-05T06:47:58Z", "content": "Most investors face the dilemma of whether to go for stocks or mutual funds. Let's be quite clear that there's no wrong or right answer to this. The matter is entirely subjective, and pitching one ag… [+3251 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rakesh Jhunjhunwala portfolio: Multibagger stock hits upper circuit in 5 straight sessions. Experts see more gain - Mint", "description": "Rakesh Jhunjhunwala portfolio: Multibagger stock has given fresh breakout at  ₹80 per share levels and after that it became highly bullish, which is getting reflected in its last week's rally", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-portfolio-multibagger-stock-hits-upper-circuit-in-5-straight-sessions-experts-see-more-gain-11644040155211.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/Rakesh_Jhunjhunwala_Reuters_1622431252074_1644040295288.jpg", "publishedAt": "2022-02-05T05:54:42Z", "content": "Rakesh Jhunjhunwala portfolio: While stock market investors are busy finding out possible multibagger stocks for 2022 in Indian secondary market, a good number of small-cap stocks have already entere… [+2033 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Yamaha R15-based Nmax 155 scooter updated with new colours for 2022 - HT Auto", "description": "The Yamaha Nmax 155 comes based on the much popular YZF-R15 motorcycle which also sells in the Indian market.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/yamaha-r15-based-nmax-155-scooter-updated-for-2022-41644036145304.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/02/05/600x338/z1-1_1644040273023_1644040284184.png", "publishedAt": "2022-02-05T05:53:47Z", "content": "2022 Yamaha Nmax 155 has been revealed for the market of Indonesia. Following its introduction in the Southeast Asian country, the scooter will also hit the international showrooms very soon. The Nma… [+1653 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Anand Mahindra and Uday Kotak discuss 'phygital', 'fickleness of current times' after Meta loses $200 bill - Economic Times", "description": "The two businessman joined the hot discussion on Meta's historic stock plunge.", "url": "https://economictimes.indiatimes.com/magazines/panache/anand-mahindra-and-uday-kotak-discuss-phygital-fickleness-of-current-times-after-meta-loses-200-billion-in-stock-value/articleshow/89360739.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89361071,width-1070,height-580,imgsize-62132,overlay-etpanache/photo.jpg", "publishedAt": "2022-02-05T05:16:00Z", "content": "On Friday, two top Indian businessmen, Uday Kotak, the CEO of Kotak Mahindra Bank, and Anand Mahindra, the chairman of Mahindra Group, discussed Meta's historic fall in stock market, just like the wh… [+2551 chars]"}, {"source": {"id": null, "name": "Carblogindia.com"}, "author": "Harsh", "title": "Royal Enfield Hunter 350 and Super Meteor 650 Spotted Testing Again - Car Blog India", "description": "Here is a video of Royal Enfield Hunter 350 and Super Meteor 650 spotted in near-production versions. Check out the details here.", "url": "https://www.carblogindia.com/royal-enfield-hunter-350-super-meteor-650-spotted-testing-again/", "urlToImage": "https://www.carblogindia.com/wp-content/uploads/2022/02/Hunter-350-Meteor-650.jpeg", "publishedAt": "2022-02-05T05:03:14Z", "content": "The Royal Enfield Hunter 350 and the Super Meteor 650 are two of the most anticipated products from the legendary bike maker in India for 2022. While these bikes have been spotted multiple times, the… [+2036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Why is Dr Reddy’s acquiring a German medical cannabis firm? - The Indian Express", "description": "Globally, the legal cannabis market is expected to reach an estimated valuation of $146.4 billion by 2025-end.", "url": "https://indianexpress.com/article/explained/explained-dr-reddys-german-medical-cannabis-firm-7757907/", "urlToImage": "https://images.indianexpress.com/2022/02/Medicinal-Cannabis.jpg", "publishedAt": "2022-02-05T03:56:15Z", "content": "In a bid to strengthen its position in the global medical cannabis industry, Indian pharmaceutical major Dr Reddys Laboratories has said that it will acquire German firm Nimbus Health. Nimbus has bee… [+2947 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "Meet Param Pravega: One of the most powerful supercomputers in India - Gadgets Now", "description": "Under the National Supercomputing Mission (NSM), the Indian Institute of Science (IISc) Bengaluru has installed and commissioned Param Pravega, one of the most powerful supercomputers in the country. The NSM was launched to enhance the research capacities and…", "url": "https://www.gadgetsnow.com/slideshows/meet-param-pravega-one-of-the-most-powerful-supercomputers-in-india/photolist/89354690.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-89354828,width-800,resizemode-4,imgsize-92274/share.jpg", "publishedAt": "2022-02-05T03:32:00Z", "content": "NSM has supported the deployment of 10 supercomputing systems so far in the country. These include several IITs; Indian Institutes of Science Education and Research (IISER), Pune; Jawaharlal Nehru Ce… [+495 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Punjab National Bank (PNB) cuts interest rates on savings accounts. Detail here - Mint", "description": "PNB had earlier lowered the interest rates on saving accounts in December last year and was offering 2.80% on accounts having less than  ₹10 lakh and 2.85% on savings accounts having more than RS 10 lakh to and below  ₹500 crore", "url": "https://www.livemint.com/industry/banking/punjab-national-bank-pnb-cuts-interest-rates-on-savings-accounts-detail-here-11644029779151.html", "urlToImage": "https://images.livemint.com/img/2022/02/05/600x338/PNB_1644031345976_1644031346211.jpg", "publishedAt": "2022-02-05T03:25:25Z", "content": "The Punjab National Bank (PNB) has reduced the interest rate on its savings account for balances below  10 lakh to 2.75% per annum. The bank has also reduced the interest rates on savings account for… [+1687 chars]"}]}