{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Urges Americans To Be \"United\" But Doesn't Mention Impeachment - NDTV", "description": "US President Donald Trump urged Americans to be \"united\" and avoid violence in his first comments after being impeached Wednesday -- while avoiding any mention of impeachment at all.", "url": "https://www.ndtv.com/world-news/donald-trump-urges-americans-to-be-united-but-doesnt-mention-impeachment-2352183", "urlToImage": "https://c.ndtvimg.com/2020-10/j0bhfdbg_donald-trump-afp_625x300_13_October_20.jpg", "publishedAt": "2021-01-13T23:40:44Z", "content": "Trump Urges Americans To Be \"United\" But Doesn't Mention Impeachment. (FILE)\r\nWashington: US President Donald Trump urged Americans to be \"united\" and avoid violence in his first comments after being… [+713 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study identifies features of potent SARS-CoV-2 neutralizing antibodies - News-Medical.Net", "description": "Researchers at Columbia University have provided important insights into features of viral binding and recognition within a class of potent neutralizing antibodies against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) – the agent that causes co…", "url": "https://www.news-medical.net/news/20210113/Study-identifies-features-of-potent-SARS-CoV-2-neutralizing-antibodies.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/1/50072481937_3a812d2f0d_k.jpg", "publishedAt": "2021-01-13T22:50:00Z", "content": "Researchers at Columbia University have provided important insights into features of viral binding and recognition within a class of potent neutralizing antibodies against severe acute respiratory sy… [+4974 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Peerzada Abrar", "title": "Amazon takes on edtech cos Byjus, Unacademy with launch of Amazon Academy - Business Standard", "description": "Live lessons help students strengthen their JEE preparation. They can also track their progress over time, identify strong and weak areas, get insights on overall test-taking strategy", "url": "https://www.business-standard.com/article/companies/amazon-takes-on-edtech-cos-byju-s-unacademy-with-launch-of-amazon-academy-121011300889_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-06/12/full/1497207439-2646.jpg", "publishedAt": "2021-01-13T19:47:00Z", "content": "Amazon is launching Amazon Academy to cater to students preparing for the JEE (Joint Entrance Examination) for entrance to engineering colleges. The move would enable it to take on top edtech compani… [+5017 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss story: \"Running and homemade food helped me lose weight\" - Times of India", "description": "A doctor by profession, 44-year-old Dushyant Singh was worried about the risk of COVID-19 because of being overweight. The pandemic made him realize the true value of good health and so, by cutting out sugar and junk food, he was able to shed almost 25 kilos.…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-story-running-and-homemade-food-helped-me-lose-weight/photostory/80253162.cms", "urlToImage": "https://static.toiimg.com/photo/80253435.cms", "publishedAt": "2021-01-13T18:30:00Z", "content": "My breakfast: Mostly fruits or a light chickpea salad with cucumber and radish.\r\nMy lunch: I like to have homemade food- whatever's being made at home for lunch. If I do not feel that hungry, I just … [+484 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rhythma Kaul", "title": "Stage set for vaccine roll-out as Covaxin adds to supplies - Hindustan Times", "description": "Bharat Biotech announced in a statement on Wednesday that the company had shipped Covaxin to 11 cities: Ganavaram, Guwahati, Patna, Delhi, Kurukshetra, Bengaluru, Pune, Bhubaneswar, Jaipur, Chennai and Lucknow.", "url": "https://www.hindustantimes.com/india-news/stage-set-for-vaccine-roll-out-as-covaxin-adds-to-supplies-101610561243255.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/20210113202L_1610552256622_1610552275314_1610563505951.jpg", "publishedAt": "2021-01-13T18:07:22Z", "content": "As the first supplies of Bharat Biotech Internationals coronavirus disease (Covid-19) vaccine, Covaxin, were dispatched from its Hyderabad base on Wednesday, the Centre intends to instruct state admi… [+3917 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Asus blows us away with latest dual-display ZenBook Duo laptops - CNET", "description": "We went hands-on with the new ZenBook Duo, a standout laptop at CES 2021, for its design and features.Subscribe to CNET: https://www.youtube.com/user/CNETTVC...", "url": "https://www.youtube.com/watch?v=ns82oTnhFY0", "urlToImage": "https://i.ytimg.com/vi/ns82oTnhFY0/maxresdefault.jpg", "publishedAt": "2021-01-13T18:00:29Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "J. Jagannath", "title": "How Zerodha founders welcomed entry of Tesla, a stock market darling, into India - Mint", "description": "CEO Nithin Kamath said while a Tesla car can be afforded only by a few in India its stock can be bought by a lot more people on NSE and BSE.Tesla shares rose a staggering 700% in 2020", "url": "https://www.livemint.com/market/stock-market-news/how-zerodha-founders-welcomed-entry-of-tesla-a-stock-market-darling-into-india-11610553320714.html", "urlToImage": "https://images.livemint.com/img/2021/01/13/600x338/367138773_0-4_1610554942858_1610554969444.jpg", "publishedAt": "2021-01-13T16:42:27Z", "content": "New Delhi: American electric car maker Tesla has registered its Indian arm amid indications that the company is set to enter the country's automobile market and among many who welcomed the EV maker t… [+3753 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Pro-Farm Laws Event\": Amit Shah To Haryana After Karnal Violence - NDTV", "description": "Home Minister Amit Shah has advised the Haryana government to refrain from holding pro-farm law events, or hold outreach programmes, in the state until further notice, the state's Education Minister, Kanwar Pal Gujjar, told reporters Wednesday", "url": "https://www.ndtv.com/india-news/farmers-protest-karnal-violence-no-pro-farm-laws-event-amit-shah-to-haryana-after-karnal-violence-2352109", "urlToImage": "https://c.ndtvimg.com/2020-11/v7bmpmp_amit-shah-hyderabad_625x300_29_November_20.jpg", "publishedAt": "2021-01-13T16:36:38Z", "content": "Amit Shah appreciated Manohar Lal Khattar's decision to cancel the farm laws event (File)\r\nChandigarh: Home Minister Amit Shah has advised the Haryana government to refrain from holding pro-farm law … [+3204 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Signal to ramp up hiring after WhatsApp controversy drives download surge - Moneycontrol", "description": "Along with another encrypted app, Telegram, Signal has been the main beneficiary of online outrage around the changes announced last week, which require WhatsApp users to share their data with both Facebook and Instagram.", "url": "https://www.moneycontrol.com/news/business/signal-to-ramp-up-hiring-after-whatsapp-controversy-drives-download-surge-6343381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Signal--770x433.jpg", "publishedAt": "2021-01-13T16:17:00Z", "content": "Messaging app Signal has seen \"unprecedented\" growth following a controversial change in rival WhatsApp's privacy terms and is looking to hire more staff as it seeks to bolster the service and suppor… [+2146 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Nancy Tartaglione", "title": "‘Master’ Poised To Jumpstart India’s 2021 Box Office As Vijay-Starrer Looks To Command Local Holiday Session - Deadline", "description": "The Pongal holiday is kicking off in southern India with the release of Lokesh Kanagaraj’s Master, the first major local picture to hit cinemas since the Covid crisis began. The Tamil action thriller stars Vijay (who’s also referred to at home as “Thalapathy”…", "url": "https://deadline.com/2021/01/master-vijay-india-box-office-thalapathy-trailer-1234672656/", "urlToImage": "https://deadline.com/wp-content/uploads/2021/01/master-poster.jpg?w=1024", "publishedAt": "2021-01-13T15:40:00Z", "content": "The Pongal holiday is kicking off in southern India with the release of Lokesh Kanagaraj’s Master, the first major local picture to hit cinemas since the Covid crisis began. The Tamil action thriller… [+3488 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Take a peek inside Anushka Sharma and Virat Kohli's luxury gift hamper, sent to paparazzi requesting privacy for baby - Hindustan Times", "description": "Anushka Sharma and Virat Kohli sent a special gift hamper to the paparazzi, requesting privacy for their newborn daughter. Here's an unboxing video.", "url": "https://www.hindustantimes.com/entertainment/bollywood/take-a-peek-inside-anushka-sharma-and-virat-kohli-s-luxury-gift-hamper-sent-to-paparazzi-requesting-privacy-for-their-daughter-101610550262914.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/fywqR7hN_1610550995849_1610551003376.jpg", "publishedAt": "2021-01-13T15:17:17Z", "content": "Celebrity couple Virat Kohli and Anushka Sharma sent out personalised letters to the paparazzi, requesting them to not photograph their newborn daughter. The couple promised to be as accommodating as… [+1941 chars]"}, {"source": {"id": null, "name": "Windows Central"}, "author": "Zac Bowden", "title": "Windows 10 Sun Valley: Everything we know so far - Windows Central", "description": "Microsoft is currently working on a major update for Windows 10 that is expected to debut later this year that will bring with it a refreshed design and new features that are supposed to enhance the users' workflow in 2021 and beyond. This will be the biggest…", "url": "https://www.windowscentral.com/windows-10-sun-valley-features-everything-we-know", "urlToImage": "https://www.windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2021/01/sunvalley_roundedstart_mock.jpg", "publishedAt": "2021-01-13T14:49:12Z", "content": "Source: Microsoft\r\nMicrosoft is currently working on a major update for Windows 10 that is expected to debut later this year that will bring with it a refreshed design and new features that are suppo… [+7906 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "M Ratnakar", "title": "Saina Nehwal eases into pre-quarters of Thailand Open - Times of India", "description": "Badminton News: Unruffled by the series of controversies that marked the first day, Saina Nehwal, Kidambi Srikanth and men's doubles pair of Satwiksairaj Rankireddy a", "url": "https://timesofindia.indiatimes.com/sports/badminton/saina-nehwal-eases-into-pre-quarters-of-thailand-open/articleshow/80253414.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80253439,width-1070,height-580,imgsize-980944,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-13T13:46:00Z", "content": "Good first round win today at Thailand open 2021 .. against kisona selvaduray from Malaysia .. 21-15 21-15 .. Wa https://t.co/Bs6uLz44bT\r\n— Saina Nehwal (@NSaina) 1610548846000"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Cabinet approves procurement deal of 83 Tejas aircrafts worth Rs 48000 crore to strengthen IAF: Rajnath Singh - Zee News", "description": "The Cabinet Committee on Security (CCS) on Wednesday (January 13) procurement of 83 Tejas aircraft at a cost of about Rs 48,000 crore from the Hindustan Aeronautics Limited (HAL). The deal is considered to be the biggest ever in the indigenous military aviati…", "url": "https://zeenews.india.com/india/cabinet-approves-procurement-deal-of-83-tejas-aircrafts-worth-rs-48000-crore-to-strengthen-iaf-rajnath-singh-2335629.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/01/13/910318-rajnathsinghani.png", "publishedAt": "2021-01-13T12:41:29Z", "content": "New Delhi: The Cabinet Committee on Security (CCS) on Wednesday (January 13) procurement of 83 Tejas aircraft at a cost of about Rs 48,000 crore from the Hindustan Aeronautics Limited (HAL). The deal… [+2799 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Scientists determined the atomic structure of a coronavirus protein - Tech Explorist", "description": "Using X-ray crystallography, scientists built an atomic model of ORF8, and it highlighted two unique regions: one that is only present in SARS-CoV-2 and its immediate bat ancestor, and one that is absent from any other coronavirus.", "url": "https://www.techexplorist.com/scientists-determined-atomic-structure-coronavirus-protein/37266/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/Cosmo-Buffalo.jpg", "publishedAt": "2021-01-13T12:39:00Z", "content": "The molecular basis for the severity and rapid spread of the COVID-19 disease caused by SARS-CoV-2 is mostly unknown.\r\nTo do so, a team of HIV researchers, cellular biologists, and biophysicists coll… [+4573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Australia vs India: Jasprit Bumrah Playing At Brisbane Will Benefit India, Says Madan Lal - NDTV Sports", "description": "India vs Australia: Madan Lal feels there will be new challenges for India in Brisbane but the availability of Jasprit Bumrah will boost the confidence of the visitors.", "url": "https://sports.ndtv.com/australia-vs-india-2020-21/aus-vs-ind-jasprit-bumrah-playing-at-brisbane-will-benefit-india-says-madan-lal-2351987", "urlToImage": "https://c.ndtvimg.com/2020-12/fi5tcgb_jasprit-bumrah-celebration-1st-test-afp_625x300_18_December_20.jpg", "publishedAt": "2021-01-13T12:32:00Z", "content": "Former India pacer and chief of the Cricket Advisory Committee Madan Lal feels the presence of pace spearhead Jasprit Bumrah in the playing XI, will give the visitors an edge going into the series-de… [+2523 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can COVID-19 increase risk of Alzheimers? Here's what research has to say - Times of India", "description": "The novel coronavirus has been associated with many long term health issues, ranging from organ damage to prolonged and chronic diseases. While medical professionals and scientists are investigating every aspect of the deadly virus, a team of researchers has …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-covid-19-increase-risk-of-alzheimers-heres-what-research-has-to-say/photostory/80247588.cms", "urlToImage": "https://static.toiimg.com/photo/80247597.cms", "publishedAt": "2021-01-13T12:30:00Z", "content": "The novel coronavirus has been associated with many long term health issues, ranging from organ damage to prolonged and chronic diseases. While medical professionals and scientists are investigating … [+563 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Revathi Krishnan", "title": "‘Legend, tweet of the year’ — cricketer Hanuma Vihari’s jibe at Babul Supriyo wins internet - ThePrint", "description": "BJP minister Babul Supriyo accused Hanuma Vihari of 'murdering cricket' before the latter's match-saving knock against Australia Monday.", "url": "https://theprint.in/sport/legend-tweet-of-the-year-cricketer-hanuma-viharis-jibe-at-babul-supriyo-wins-internet/584838/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/01/babul-vihari.jpg", "publishedAt": "2021-01-13T11:48:00Z", "content": "New Delhi: Cricketer Hanuma Vihari, whose match-saving knock in Sydney enabled India to draw the Test match against Australia Monday, has won the internet with his clap back at BJP leader Babul Supri… [+3191 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Promising new antibodies against novel coronavirus found - The Tribune India", "description": "They can penetrate the tissue better and can be produced in larger quantities", "url": "https://www.tribuneindia.com/news/health/promising-new-antibodies-against-novel-coronavirus-found-197905", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2021/1/2021_1$largeimg_724798388.JPG", "publishedAt": "2021-01-13T11:27:00Z", "content": "New Delhi, January 13\r\nScientists have identified and further developed novel antibody fragments from llamas and alpacas that can be used against the SARS CoV-2 virus which causes COVID-19.\r\nThese \"n… [+2230 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Infosys Q3 Results: Net profit rises 16.8% YoY to Rs 5,215 cr, beats Street estimates - Economic Times", "description": "Infosys on Wednesday reported a 16.8 per cent YoY rise in consolidated net profit for December quarter at Rs 5,215 crore. In the same quarter last year, it reported a profit of Rs 4,466 crore. Gross revenue for the quarter rose 12.3 per cent YoY to Rs 25,927 …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-q3-results-net-profit-rises-16-8-yoy-to-rs-5215-cr-beats-street-estimates/videoshow/80250866.cms", "urlToImage": "https://img.etimg.com/thumb/msid-80250866,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2021-01-13T11:19:00Z", "content": "Infosys on Wednesday reported a 16.8 per cent YoY rise in consolidated net profit for December quarter at Rs 5,215 crore. In the same quarter last year, it reported a profit of Rs 4,466 crore. Gross … [+170 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable News Staff", "title": "Astronomers Just Captured A Distant Galaxy Dying For The First Time - Mashable India", "description": "It has recently come to light that astronomers have observed a rare phenomenon in space - the death of a distant galaxy.", "url": "https://in.mashable.com/science/19539/astronomers-just-captured-a-distant-galaxy-dying-for-the-first-time", "urlToImage": "https://sm.mashable.com/mashable_in/seo/2/23963/23963_bjqc.jpg", "publishedAt": "2021-01-13T10:57:00Z", "content": "It has recently come to light that astronomers have observed a rare phenomenon in space - the death of a distant galaxy. The study around this phenomenon is published in Nature Astronomy where the re… [+1919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Keep adultery a crime in the armed forces’: SC agrees to examine Centre’s plea - The Indian Express", "description": "In September 2018, the Supreme Court unanimously struck down Section 497 of the Indian Penal Code that makes adultery a punishable offence for men.", "url": "https://indianexpress.com/article/india/supreme-court-issues-notice-on-centres-request-to-keep-adultery-a-crime-in-armed-forces-7144618/", "urlToImage": "https://images.indianexpress.com/2020/12/SC-3.jpg", "publishedAt": "2021-01-13T10:48:52Z", "content": "The Supreme Court on Wednesday agreed to examine the Central government’s request to keep adultery a crime in the armed forces, news agency ANI reported. The Centre, in its plea, said the 2018 verdic… [+1895 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "US House passes resolution asking Pence to invoke 25th Amendment to remove Trump from office - Times of India", "description": "US News: WASHINGTON: The Democratic-controlled US House of Representatives, which is rushing ahead towards impeaching Donald Trump over the unprecedented Capit.", "url": "https://timesofindia.indiatimes.com/world/us/us-house-passes-resolution-asking-pence-to-invoke-25th-amendment-to-remove-trump-from-office/articleshow/80248308.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80248289,width-1070,height-580,imgsize-88074,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-13T08:42:00Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Sruthisagar Yamunan", "title": "With its farm laws order, India’s Supreme Court dangerously undermines parliamentary democracy - Scroll.in", "description": "To stay the implementation of a law without even a single hearing on its merits and demerits sets a dangerous precedent.", "url": "https://scroll.in/article/983890/with-its-farm-laws-order-indias-supreme-court-dangerously-undermines-parliamentary-democracy", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/153289-xnlygfmkdi-1610523696.jpg", "publishedAt": "2021-01-13T08:30:00Z", "content": "The Supreme Court on Tuesday stayed the implementation of three agricultural laws against which farmers have been protesting on the Delhi border for weeks. The farmers believe that the new laws under… [+5227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US executes first woman on federal death row in nearly seven decades - The Indian Express", "description": "Montgomery was convicted in 2007 in Missouri for kidnapping and strangling Bobbie Jo Stinnett, then eight months pregnant. Montgomery cut Stinnett's fetus from the womb. The child survived.", "url": "https://indianexpress.com/article/world/us-executes-first-woman-on-federal-death-row-in-nearly-seven-decades-7144568/", "urlToImage": "https://images.indianexpress.com/2020/10/lisa.jpg", "publishedAt": "2021-01-13T06:59:49Z", "content": "The U.S. government executed convicted murderer Lisa Montgomery, the only woman on federal death row, early on Wednesday, after the Supreme Court cleared the last hurdle for her execution by overturn… [+1965 chars]"}, {"source": {"id": null, "name": "Bollywood Life"}, "author": "BollywoodLife", "title": "Bigg Boss 14: 'JasLy forever' Jasmin Bhasin's response when asked about Tamboli's feelings for Aly Goni is ev - Bollywood Life", "description": "Jasmin Bhasin was evicted from the house of Bigg Boss 14 on Sunday's episode of Weekend Ka Vaar. It was an emotional moment for everyone, especially Aly Goni who was shattered upon hearing the eviction.", "url": "https://www.bollywoodlife.com/bigg-boss/bigg-boss-14-jasly-forever-jasmin-bhasins-response-when-asked-about-tambolis-feelings-for-aly-goni-is-every-girlfriend-ever-1760062/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/2021/01/Jasmin-Bhasin-Aly-Goni-Nikki-Tamboli-Bigg-Boss-BiggBoss-14-600x315.jpg", "publishedAt": "2021-01-13T06:49:14Z", "content": "On Sunday, one of the most emotional evictions in the history of Bigg Boss took place. Popular actress and now-ex-contestant Jasmin Bhasin was eliminated. Aly Goni who is best friends with Jasmin and… [+2659 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sriram Lakshman", "title": "A strong India would act as ‘counterbalance’ to China, says declassified U.S. document - The Hindu", "description": "The 10-page document outlines objectives and strategies with regard to China, North Korea, India and other countries in the Indo-Pacific region", "url": "https://www.thehindu.com/news/international/a-strong-india-would-act-as-counterbalance-to-china-says-declassified-white-house-document/article33565659.ece", "urlToImage": "https://www.thehindu.com/news/international/xvqe9d/article33565658.ece/ALTERNATES/LANDSCAPE_615/FILE-PHOTO-US-National-Security-Advisor-Robert-OBrien-in-the-Philippines", "publishedAt": "2021-01-13T06:37:17Z", "content": "With days to go before its end, the Trump administration has declassified a sensitive document on the U.S. strategic framework for the Indo-Pacific from 2018. The 10-page document which does not come… [+5425 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "Singhu, Tikri, other key Delhi borders remain closed as farmers’ protest continues - Hindustan Times", "description": "Traffic has been diverted from Mukarba and GTK road. Motorists are also advised to avoid Outer Ring Road, GTK Road and NH-44, traffic police officials said", "url": "https://www.hindustantimes.com/india-news/singhu-tikri-other-key-delhi-borders-remain-closed-as-farmers-protest-continues-101610507902212.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/7ade1ed0-554d-11eb-b18d-19494570fc18_1610507901175.jpg", "publishedAt": "2021-01-13T03:18:21Z", "content": "Vehicular movement between Delhi and its two neighbouring states Haryana and Uttar Pradesh (UP) remains disrupted as six borders connecting Haryana with Delhi are still completely closed while two ke… [+1560 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "CNBC-TV18's top stocks to watch out for on January 13 - CNBCTV18", "description": "The Indian market is likely to open on a strong note as SGX Nifty, an early indicator of the opening for Nifty50, was trading 47 points higher at 14,636.20, at 7:41 am, hinting at a positive start for the domestic market. Get latest Market online at cnbctv18.…", "url": "https://www.cnbctv18.com/photos/market/cnbc-tv18s-top-stocks-to-watch-out-for-on-january-13-7983461.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/11/BSE-market-stocks-768x496.jpg", "publishedAt": "2021-01-13T02:12:22Z", "content": "The Indian market is likely to open on a strong note as SGX Nifty, an early indicator of the opening for Nifty50, was trading 47 points higher at 14,636.20, at 7:41 am, hinting at a positive start fo… [+1758 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Hemanth CS", "title": "Journey of the big V - Bangalore Mirror", "description": "The aircraft carrying 54 boxes of the vaccine, consisting of approximately 6.48 lakh doses arrived at Kempegowda International Airport (KIA) at 11.45 am.", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/journey-of-the-big-v/articleshow/80241209.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-1619070,msid-80241223/80241223.jpg", "publishedAt": "2021-01-13T00:30:00Z", "content": "First consignment with 50 boxes with around 6.48 lakh doses\r\n of Covishield taken to storage facility\r\nThe wait is finally over as the first consignment of the covid-19 vaccine\r\n arrived in the city … [+3371 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Stage set for mega inoculation drive, vaccines reach 14 cities - Hindustan Times", "description": "About 540,800 vials were flown to the 13 cities on Tuesday which would be administered to about 6 million health care and frontline workers -- the police, municipal workers and so on -- at the vanguard of the fight against the viral disease.", "url": "https://www.hindustantimes.com/india-news/stage-set-for-mega-inoculation-drive-vaccines-reach-14-cities-101610495773505.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/12/550x309/99624c6c-54eb-11eb-b18d-19494570fc18_1610477597681_1610495851495.jpg", "publishedAt": "2021-01-12T23:58:51Z", "content": "The first vials of the Covid-19 vaccine made by Pune-based Serum Institute of India (SII) reached 14 cities in the country on Tuesday to the relief of local administrations, setting the stage for the… [+3927 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ahmed Ali", "title": "Mumbai: Muchhad paan shop owner held for ‘possessing’ 500gm cannabis - Times of India", "description": "The Narcotics Control Bureau (NCB) arrested Ramkumar Tiwari, owner of the famous Muchhad Paanwala shop, late on Monday, saying it had recovered 500 gr", "url": "https://timesofindia.indiatimes.com/city/mumbai/muchhad-paan-shop-owner-held-for-possessing-500gm-cannabis/articleshow/80239359.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80242291,width-1070,height-580,imgsize-252246,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-12T22:51:00Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "As India Prepares for Inoculations, Know About Covid-19 Vaccines, Registration Process and Prices - News18", "description": "India has approved two Covid-19 vaccines -- Covishield and Covaxin -- for restricted emergency use in the country against the virus.", "url": "https://www.news18.com/news/india/as-india-readies-for-covid-19-vaccination-drive-know-about-the-vaccines-registration-process-and-price-3280997.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610466467_vaccine.jpg", "publishedAt": "2021-01-12T15:53:00Z", "content": "India has approved two Covid-19 vaccines -- Covishield and Covaxin -- for restricted emergency use in the country against the virus. Oxford-AstraZeneca's vaccine Covishield has been manufactured by t… [+3859 chars]"}, {"source": {"id": null, "name": "Bay News 9"}, "author": "Associated Press", "title": "Cheers! French wine, vines headed home after year in space - Spectrum News", "description": "French wine and grapevines are headed back to Earth after a year aboard the International Space Station", "url": "https://www.baynews9.com/fl/tampa/ap-online/2021/01/12/cheers-french-wine-vines-headed-home-after-year-in-space", "urlToImage": "https://s7d2.scene7.com/is/image/TWCNews/Space_Wine_44584", "publishedAt": "2021-01-12T15:39:00Z", "content": "CAPE CANAVERAL, Fla. (AP) The International Space Station bid adieu Tuesday to 12 bottles of French Bordeaux wine and hundreds of snippets of grapevines that spent a year orbiting the world in the na… [+2787 chars]"}, {"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "Netflix unveils star-studded line-up of films in 2021 featuring Leonardo DiCaprio, Dwayne Johnson, Ryan Reynolds, Gal Gadot among others - Bollywood Hungama", "description": "Netflix unveils star-studded line-up of films in 2021 featuring Leonardo DiCaprio, Dwayne Johnson, Ryan Reynolds, Gal Gadot among others. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebri…", "url": "https://www.bollywoodhungama.com/news/bollywood/netflix-unveils-star-studded-line-up-of-films-in-2021-featuring-leonardo-dicaprio-dwayne-johnson-ryan-reynolds-gal-gadot-among-others/", "urlToImage": "https://stat2.bollywoodhungama.in/wp-content/uploads/2021/01/Netflix-unveils-star-studded-line-up-of-films-in-2021-featuring-Leonardo-DiCaprio-Dwayne-Johnson-Ryan-Reynolds-Gal-Gadot-among-others.png", "publishedAt": "2021-01-12T15:20:36Z", "content": "Netflix is ensuring that during this pandemic, you won't have to step out since they are bringing high-level content on the streaming platform. On January 12, 2021, Netflix dropped the announcement t… [+1492 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "IIT Guwahati researchers find new clues to how and why stars die - Northeast Now", "description": "Researchers from the Indian Institute of Technology (IIT) - Guwahati, have found new and important clues to understand the death of massive stars. The IIT-Guwahati researchers have also revealed the problems with the existing models. The IIT-Guwahati research…", "url": "https://nenow.in/top-news/iit-guwahati-researchers-find-new-clues-to-how-and-why-stars-die.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2021/01/IMG-20210112-WA0007.jpg", "publishedAt": "2021-01-12T14:39:43Z", "content": "Researchers from the Indian Institute of Technology (IIT) – Guwahati, have found new and important clues to understand the death of massive stars.\r\nThe IIT-Guwahati researchers have also revealed the… [+3332 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "CES 2021: TCL Google TVs with Mini LED, 8K and QLED technology unveiled at the event - Firstpost", "description": "The TCL Google TVs will reportedly consolidate films, shows and live TV from across apps and subscription for every user.", "url": "https://www.firstpost.com/tech/news-analysis/ces-2021-tcl-google-tvs-with-mini-led-8k-and-qled-technology-unveiled-at-the-event-9194911.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/01/TCL-Google-TV-and-Chromecast_Googe2.jpg", "publishedAt": "2021-01-12T13:41:32Z", "content": "FP TrendingJan 12, 2021 19:11:32 IST\r\nTelevision brand TCL has announced the rollout of a series of TCL Google TVs this year in CES 2021. The company said it will roll out the televisions first in th… [+1372 chars]"}, {"source": {"id": null, "name": "Cricbuzz"}, "author": null, "title": "Chris Wokaes: England's underrated perfectionist | Cricbuzz.com - Cricbuzz - Cricbuzz", "description": "Not the one to crave limelight, the English allrounder feels he still has a lot to achieve", "url": "https://www.cricbuzz.com/cricket-news/115683/chris-wokaes-englands-underrated-perfectionist-cricbuzzcom", "urlToImage": "//m.cricbuzz.com/a/img/v1/600x400/i1/c200562/not-the-one-to-crave-limelight-woakes-feels-he-still-has-a-lot-to-achieve.jpg", "publishedAt": "2021-01-12T12:36:39Z", "content": "It is little more than a five-minute walk to the local Conservative club near the Woakes family home in Birmingham. Roger Woakes used to be a regular, catching up with mates over a pint or two while … [+13863 chars]"}]}