{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "BetaNews"}, "author": null, "title": "Microsoft releases Windows 10 Build 21292 with improvements to news and interests on the taskbar - BetaNews", "description": "Last week, Microsoft rolled out Windows 10 Insider Preview Build 21276 to testers on the Dev Channel. The new flight introduced several new features, but the highlight was unquestionably a new 'news and interests' feed on the taskbar.", "url": "https://betanews.com/2021/01/13/windows-10-build-21292/", "urlToImage": "https://betanews.com/wp-content/uploads/2017/07/Windows-10-key-red-50x50.jpg", "publishedAt": "2021-01-13T18:49:36Z", "content": "Last week, Microsoft rolled out Windows 10 Insider Preview Build 21276 to testers on the Dev Channel. The new flight introduced several new features, but the highlight was unquestionably a new 'news … [+6656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Happens Next If Donald Trump Is Impeached - NDTV", "description": "With the US House of Representatives poised to impeach President Donald Trump for a second time -- just days before he is to leave office -- questions are being raised about what happens next.", "url": "https://www.ndtv.com/world-news/what-happens-next-if-donald-trump-is-impeached-2352151", "urlToImage": "https://c.ndtvimg.com/2021-01/tf4pe3so_donald-trump-reuters_625x300_08_January_21.jpg", "publishedAt": "2021-01-13T18:33:06Z", "content": "Trump has expressed interest in potentially running for president again in 2024 (File)\r\nWashington: With the US House of Representatives poised to impeach President Donald Trump for a second time -- … [+4091 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss story: \"Running and homemade food helped me lose weight\" - Times of India", "description": "A doctor by profession, 44-year-old Dushyant Singh was worried about the risk of COVID-19 because of being overweight. The pandemic made him realize the true value of good health and so, by cutting out sugar and junk food, he was able to shed almost 25 kilos.…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-story-running-and-homemade-food-helped-me-lose-weight/photostory/80253162.cms", "urlToImage": "https://static.toiimg.com/photo/80253435.cms", "publishedAt": "2021-01-13T18:30:00Z", "content": "My breakfast: Mostly fruits or a light chickpea salad with cucumber and radish.\r\nMy lunch: I like to have homemade food- whatever's being made at home for lunch. If I do not feel that hungry, I just … [+484 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Brandon Russell", "title": "The latest Samsung Galaxy S21 leak leaves nothing to the imagination - XDA Developers", "description": "Just hours before Samsung is set to unveil its Galaxy S21 series, and seemingly every last detail has been leaked by Evan Blass.", "url": "https://www.xda-developers.com/samsung-galaxy-s21-series-leak-leaves-nothing-to-the-imagination/", "urlToImage": "https://www.xda-developers.com/files/2020/12/Samsung-Galaxy-S21-Galaxy-S21-Plus-Galaxy-S21-Ultra-Feature-Image.jpg", "publishedAt": "2021-01-13T18:22:00Z", "content": "Just hours before Samsung is set to unveil its Galaxy S21 series, seemingly every last detail has been revealed. The leaks over the past few weeks have been absolutely relentless, and now Evan Blass … [+2508 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rhythma Kaul", "title": "Stage set for vaccine roll-out as Covaxin adds to supplies - Hindustan Times", "description": "Bharat Biotech announced in a statement on Wednesday that the company had shipped Covaxin to 11 cities: Ganavaram, Guwahati, Patna, Delhi, Kurukshetra, Bengaluru, Pune, Bhubaneswar, Jaipur, Chennai and Lucknow.", "url": "https://www.hindustantimes.com/india-news/stage-set-for-vaccine-roll-out-as-covaxin-adds-to-supplies-101610561243255.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/20210113202L_1610552256622_1610552275314_1610563505951.jpg", "publishedAt": "2021-01-13T18:07:22Z", "content": "As the first supplies of Bharat Biotech Internationals coronavirus disease (Covid-19) vaccine, Covaxin, were dispatched from its Hyderabad base on Wednesday, the Centre intends to instruct state admi… [+3917 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Asus ZenBook Duo 14 (2021) Preview - PCMag", "description": "Read more about it right here!https://www.pcmag.com/reviews/asus-zenbook-duo-14-2021PCMag.com is your ultimate destination for tech reviews and news.Like us ...", "url": "https://www.youtube.com/watch?v=dY97sDw9EOw", "urlToImage": "https://i.ytimg.com/vi/dY97sDw9EOw/maxresdefault.jpg", "publishedAt": "2021-01-13T18:00:09Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "As cold wave wreaks havoc, here are 10 coldest places in India - Hindustan Times", "description": "Meanwhile, the Indian Meteorological Department (IMD) warned that minimum temperature is very likely to remain below normal over most parts of Northwest India during next 3-4 days due to the prevalence of dry north/northwesterly winds.", "url": "https://www.hindustantimes.com/india-news/as-cold-wave-wreaks-havoc-here-are-10-coldest-places-in-india-101610558698683.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/035117aca2284e0a8245f62f6125d04f-035117aca2284e0a8245f62f6125d04f-0_1610559459618_1610559515602.jpg", "publishedAt": "2021-01-13T17:39:27Z", "content": "The cold conditions continued to prevail in India as the mercury hit below normal tempreture is many partys of the country. In Jammu and Kashmir, Srinagar recorded its lowest temperature in eight yea… [+2166 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Pro-Farm Laws Event\": Amit Shah To Haryana After Karnal Violence - NDTV", "description": "Home Minister Amit Shah has advised the Haryana government to refrain from holding pro-farm law events, or hold outreach programmes, in the state until further notice, the state's Education Minister, Kanwar Pal Gujjar, told reporters Wednesday", "url": "https://www.ndtv.com/india-news/farmers-protest-karnal-violence-no-pro-farm-laws-event-amit-shah-to-haryana-after-karnal-violence-2352109", "urlToImage": "https://c.ndtvimg.com/2020-11/v7bmpmp_amit-shah-hyderabad_625x300_29_November_20.jpg", "publishedAt": "2021-01-13T16:36:38Z", "content": "Amit Shah appreciated Manohar Lal Khattar's decision to cancel the farm laws event (File)\r\nChandigarh: Home Minister Amit Shah has advised the Haryana government to refrain from holding pro-farm law … [+3204 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Signal to ramp up hiring after WhatsApp controversy drives download surge - Moneycontrol", "description": "Along with another encrypted app, Telegram, Signal has been the main beneficiary of online outrage around the changes announced last week, which require WhatsApp users to share their data with both Facebook and Instagram.", "url": "https://www.moneycontrol.com/news/business/signal-to-ramp-up-hiring-after-whatsapp-controversy-drives-download-surge-6343381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Signal--770x433.jpg", "publishedAt": "2021-01-13T16:17:00Z", "content": "Messaging app Signal has seen \"unprecedented\" growth following a controversial change in rival WhatsApp's privacy terms and is looking to hire more staff as it seeks to bolster the service and suppor… [+2146 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Infosys looks at double digit growth in FY22, to hire 24,000 freshers from campuses - Moneycontrol", "description": "Infosys in Q2FY21 said it would hire 15,000 freshers. However at the back of large deal wins and the growth momentum, it has ramped up its fresher hiring.", "url": "https://www.moneycontrol.com/news/business/infosys-looks-at-double-digit-growth-in-fy22-to-hire-24000-freshers-from-campuses-6343281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/10/Infosys-CEO-MD-Salil-Parekh-speaks-during-a-press-conference-in-Bengaluru-October-16-2018-770x433.jpg", "publishedAt": "2021-01-13T16:02:00Z", "content": "Indias second largest IT service provider Infosys is looking at double digit growth at the back of large deal wins and demand for digital in FY22. The company has ramped up fresher hiring to 24,000 n… [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Covid-19: Stage set for mega inoculation drive as vaccine consignments reach several cities - The Indian Express", "description": "Pune's Serum Institute of India and Hyderabad-based Bharat Biotech received the Drug Controller General of India’s approval on January 3 for “restricted” use of their Covid-19 vaccines in an “emergency” situation.", "url": "https://indianexpress.com/article/india/coronavirus-vaccine-roll-out-serum-institute-bharat-biotech-latest-news-7144670/", "urlToImage": "https://images.indianexpress.com/2021/01/covid-vaccine-gujarat-1.jpg", "publishedAt": "2021-01-13T15:55:41Z", "content": "With less than a week left before India starts its nationwide inoculation drive,batches of coronavirus vaccine were shipped to multiple parts across the country on Wednesday. From Assam to Goa and fr… [+7250 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Nancy Tartaglione", "title": "‘Master’ Poised To Jumpstart India’s 2021 Box Office As Vijay-Starrer Looks To Command Local Holiday Session - Deadline", "description": "The Pongal holiday is kicking off in southern India with the release of Lokesh Kanagaraj’s Master, the first major local picture to hit cinemas since the Covid crisis began. The Tamil action thriller stars Vijay (who’s also referred to at home as “Thalapathy”…", "url": "https://deadline.com/2021/01/master-vijay-india-box-office-thalapathy-trailer-1234672656/", "urlToImage": "https://deadline.com/wp-content/uploads/2021/01/master-poster.jpg?w=1024", "publishedAt": "2021-01-13T15:40:00Z", "content": "The Pongal holiday is kicking off in southern India with the release of Lokesh Kanagaraj’s Master, the first major local picture to hit cinemas since the Covid crisis began. The Tamil action thriller… [+3488 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Take a peek inside Anushka Sharma and Virat Kohli's luxury gift hamper, sent to paparazzi requesting privacy for baby - Hindustan Times", "description": "Anushka Sharma and Virat Kohli sent a special gift hamper to the paparazzi, requesting privacy for their newborn daughter. Here's an unboxing video.", "url": "https://www.hindustantimes.com/entertainment/bollywood/take-a-peek-inside-anushka-sharma-and-virat-kohli-s-luxury-gift-hamper-sent-to-paparazzi-requesting-privacy-for-their-daughter-101610550262914.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/fywqR7hN_1610550995849_1610551003376.jpg", "publishedAt": "2021-01-13T15:17:17Z", "content": "Celebrity couple Virat Kohli and Anushka Sharma sent out personalised letters to the paparazzi, requesting them to not photograph their newborn daughter. The couple promised to be as accommodating as… [+1941 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Wipro hired 14,000 people in Q3, robust hiring plan in place for coming months - Moneycontrol", "description": "Wipro's Chief Human Resources Officer Saurabh Govil said the company is making big investments in Europe, US and Asia Pacific and on new technology areas, adding that supply-side constraints would not hold back the growth momentum.", "url": "https://www.moneycontrol.com/news/business/wipro-hired-14000-people-in-q3-robust-hiring-plan-in-place-for-coming-months-6343021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/WIPRO-770x433.jpg", "publishedAt": "2021-01-13T15:00:00Z", "content": "Bengaluru-based IT major Wipro hired 14,000 people, including 2,900 freshers, for the quarter ended December 2020. The company has a robust hiring plan in place as it expects the growth momentum to c… [+1969 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "This is how Ashwin and Vihari troll union minister Babul Supriyo - Times of India", "description": "Hanuma Vihari, who helped India in saving the SCG test against Australia with 23 runs(161-ball), corrected union minister Babul Supriyo on Twitter. The union minister criticised Hanuma Vihari and tweeted, \"Playing 109 balls to score 7 !That is atrocious to sa…", "url": "https://timesofindia.indiatimes.com/videos/sports/cricket/this-is-how-ashwin-and-vihari-troll-union-minister-babul-supriyo/videoshow/80254092.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-80254092,imgsize-66196.cms", "publishedAt": "2021-01-13T14:32:38Z", "content": "Jan 13, 2021, 09:48PM ISTSource: Times NowHanuma Vihari, who helped India in saving the SCG test against Australia with 23 runs(161-ball), corrected union minister Babul Supriyo on Twitter. The union… [+410 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "New quantum technology projects to solve mysteries of the universe - Open Access Government", "description": "UK Research and Innovation (UKRI) will fund quantum technology projects to build on our understanding of the universe", "url": "https://www.openaccessgovernment.org/quantum-technology-projects-mysteries-universe/101437/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2021/01/dreamstime_l_77313737.jpg", "publishedAt": "2021-01-13T14:10:00Z", "content": "UK Research and Innovation (UKRI) is investing £31 million into seven projects to show how quantum technologies could solve some of the greatest mysteries of the universe such as dark matter and blac… [+3305 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Coronavirus in North Texas: Latest information on vaccine registration - WFAA", "description": "Dallas, Collin, Denton, and Tarrant counties all have online sign-ups for COVID-19 vaccines, and so do hospitals and pharmacies.", "url": "https://www.youtube.com/watch?v=XquXodi0H7Q", "urlToImage": "https://i.ytimg.com/vi/XquXodi0H7Q/hqdefault.jpg", "publishedAt": "2021-01-13T13:58:03Z", "content": null}, {"source": {"id": null, "name": "New York Times"}, "author": "Apoorva Mandavilli", "title": "The future of the coronavirus? An annoying childhood infection - WION", "description": "Once immunity is widespread in adults, the virus rampaging across the world will come to resemble the common cold, scientists predict.", "url": "https://www.nytimes.com/2021/01/12/health/coronavirus-immunity-future.html", "urlToImage": "https://static01.nyt.com/images/2021/01/12/science/12VIRUS-ENDEMIC1/12VIRUS-ENDEMIC1-facebookJumbo.jpg", "publishedAt": "2021-01-13T13:55:35Z", "content": "Other experts said this scenario was not just plausible but likely.\r\nThe overall intellectual construct of the paper I fully agree with, said Shane Crotty, a virologist at the La Jolla Institute for … [+1506 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Scientists determined the atomic structure of a coronavirus protein - Tech Explorist", "description": "Using X-ray crystallography, scientists built an atomic model of ORF8, and it highlighted two unique regions: one that is only present in SARS-CoV-2 and its immediate bat ancestor, and one that is absent from any other coronavirus.", "url": "https://www.techexplorist.com/scientists-determined-atomic-structure-coronavirus-protein/37266/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/01/Cosmo-Buffalo.jpg", "publishedAt": "2021-01-13T12:39:00Z", "content": "The molecular basis for the severity and rapid spread of the COVID-19 disease caused by SARS-CoV-2 is mostly unknown.\r\nTo do so, a team of HIV researchers, cellular biologists, and biophysicists coll… [+4573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Australia vs India: Jasprit Bumrah Playing At Brisbane Will Benefit India, Says Madan Lal - NDTV Sports", "description": "India vs Australia: Madan Lal feels there will be new challenges for India in Brisbane but the availability of Jasprit Bumrah will boost the confidence of the visitors.", "url": "https://sports.ndtv.com/australia-vs-india-2020-21/aus-vs-ind-jasprit-bumrah-playing-at-brisbane-will-benefit-india-says-madan-lal-2351987", "urlToImage": "https://c.ndtvimg.com/2020-12/fi5tcgb_jasprit-bumrah-celebration-1st-test-afp_625x300_18_December_20.jpg", "publishedAt": "2021-01-13T12:32:00Z", "content": "Former India pacer and chief of the Cricket Advisory Committee Madan Lal feels the presence of pace spearhead Jasprit Bumrah in the playing XI, will give the visitors an edge going into the series-de… [+2523 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can COVID-19 increase risk of Alzheimers? Here's what research has to say - Times of India", "description": "The novel coronavirus has been associated with many long term health issues, ranging from organ damage to prolonged and chronic diseases. While medical professionals and scientists are investigating every aspect of the deadly virus, a team of researchers has …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-covid-19-increase-risk-of-alzheimers-heres-what-research-has-to-say/photostory/80247588.cms", "urlToImage": "https://static.toiimg.com/photo/80247597.cms", "publishedAt": "2021-01-13T12:30:00Z", "content": "The novel coronavirus has been associated with many long term health issues, ranging from organ damage to prolonged and chronic diseases. While medical professionals and scientists are investigating … [+563 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "'Let's see if he does it in Brisbane Test': Vaughan, Waugh engage in Twitter banter over Smith controversy - Hindustan Times", "description": "India vs Australia: As the debate over Smith's actions continue, former England cricketer Michael Vaughan and former Australia cricketer Mark Waugh engaged in a Twitter banter.", "url": "https://www.hindustantimes.com/cricket/india-vs-australia-steve-smith-michael-vaughan-mark-waugh-twitter-banter-101610536456175.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/Vaughan_Waugh_1610537081619_1610537091689.jpg", "publishedAt": "2021-01-13T11:51:15Z", "content": "Australia batsman Steve Smith has come under major scrutiny after a video of him allegedly scuffing Rishabh Pant's guard marks on Day 5 of the third Test against India at Sydney Cricket Ground went v… [+1660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Keep adultery a crime in the armed forces’: SC agrees to examine Centre’s plea - The Indian Express", "description": "In September 2018, the Supreme Court unanimously struck down Section 497 of the Indian Penal Code that makes adultery a punishable offence for men.", "url": "https://indianexpress.com/article/india/supreme-court-issues-notice-on-centres-request-to-keep-adultery-a-crime-in-armed-forces-7144618/", "urlToImage": "https://images.indianexpress.com/2020/12/SC-3.jpg", "publishedAt": "2021-01-13T10:48:52Z", "content": "The Supreme Court on Wednesday agreed to examine the Central government’s request to keep adultery a crime in the armed forces, news agency ANI reported. The Centre, in its plea, said the 2018 verdic… [+1895 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neha Chaudhary", "title": "Jasmin Bhasin: 'Loved gorging on Punjabi snacks, besan ki ladoo and rewari on Makar Sankranti' - Times of India", "description": "Jasmin Bhasin, who recently got evicted from Bigg Boss 14 house spoke to us about her Makar Sankranti memories.", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/jasmin-bhasin-loved-gorging-on-punjabi-snacks-besan-ki-ladoo-and-rewari-on-makar-sankranti/articleshow/80248685.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80248957,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-180116/80248957.jpg", "publishedAt": "2021-01-13T09:30:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "US House passes resolution asking Pence to invoke 25th Amendment to remove Trump from office - Times of India", "description": "US News: WASHINGTON: The Democratic-controlled US House of Representatives, which is rushing ahead towards impeaching Donald Trump over the unprecedented Capit.", "url": "https://timesofindia.indiatimes.com/world/us/us-house-passes-resolution-asking-pence-to-invoke-25th-amendment-to-remove-trump-from-office/articleshow/80248308.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80248289,width-1070,height-580,imgsize-88074,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-13T08:42:00Z", "content": null}, {"source": {"id": null, "name": "ThePrint"}, "author": "Rohini Swamy", "title": "Yediyurappa welcomes Elon Musk’s Tesla to India, then deletes tweet a few hours later - ThePrint", "description": "Tesla has registered as a subsidiary company in Bengaluru and is expected to set up a research and development as well as a manufacturing unit.", "url": "https://theprint.in/india/yediyurappa-welcomes-elon-musks-tesla-to-india-then-deletes-tweet-a-few-hours-later/584608/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/11/Yediyurappa.jpg", "publishedAt": "2021-01-13T08:04:00Z", "content": "Bengaluru: Karnataka Chief Minister B.S. Yediyurappa welcomed US-based carmaker Tesla in a tweet late Tuesday, before deleting the post a few hours later.\r\n“Karnataka will lead India’s journey toward… [+3421 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sushmi Dey", "title": "Covid vaccine recipients may not be able to pick & choose - Times of India", "description": "India News: Even as the government plans to roll out the Covid vaccination drive with Oxford-AstraZeneca’s Covishield and Bharat Biotech’s Covaxin, recipients may", "url": "https://timesofindia.indiatimes.com/india/covid-vaccine-recipients-may-not-be-able-to-pick-choose/articleshow/80241918.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80241908,width-1070,height-580,imgsize-1997555,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-13T07:07:00Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Future-Reliance deal: Delhi HC seeks Biyanis' and RIL's stand on Amazon plea - Mint", "description": "A bench of Chief Justice D N Patel and Justice Jyoti Singh issued notice to FRL, Reliance Retail and the Biyanis.Amazon in January wrote to Sebi yet again, apprising the market regulator of the formation of the arbitration tribunal at SIAC while urging it to …", "url": "https://www.livemint.com/companies/news/futurereliance-deal-hc-seeks-future-ril-s-stand-on-amazon-plea-11610517794013.html", "urlToImage": "https://images.livemint.com/img/2021/01/13/600x338/7bf54d16-54f8-11eb-8a1c-979c5208cefc_1610522615398_1610522641872.jpg", "publishedAt": "2021-01-13T07:05:54Z", "content": "The Delhi High Court Wednesday sought response of Future Retail Ltd (FRL) on Amazon's plea challenging the prima facie observations by a single judge that the e-commerce giant's attempt to control th… [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US executes first woman on federal death row in nearly seven decades - The Indian Express", "description": "Montgomery was convicted in 2007 in Missouri for kidnapping and strangling Bobbie Jo Stinnett, then eight months pregnant. Montgomery cut Stinnett's fetus from the womb. The child survived.", "url": "https://indianexpress.com/article/world/us-executes-first-woman-on-federal-death-row-in-nearly-seven-decades-7144568/", "urlToImage": "https://images.indianexpress.com/2020/10/lisa.jpg", "publishedAt": "2021-01-13T06:59:49Z", "content": "The U.S. government executed convicted murderer Lisa Montgomery, the only woman on federal death row, early on Wednesday, after the Supreme Court cleared the last hurdle for her execution by overturn… [+1965 chars]"}, {"source": {"id": null, "name": "Bollywood Life"}, "author": "BollywoodLife", "title": "Bigg Boss 14: 'JasLy forever' Jasmin Bhasin's response when asked about Tamboli's feelings for Aly Goni is ev - Bollywood Life", "description": "Jasmin Bhasin was evicted from the house of Bigg Boss 14 on Sunday's episode of Weekend Ka Vaar. It was an emotional moment for everyone, especially Aly Goni who was shattered upon hearing the eviction.", "url": "https://www.bollywoodlife.com/bigg-boss/bigg-boss-14-jasly-forever-jasmin-bhasins-response-when-asked-about-tambolis-feelings-for-aly-goni-is-every-girlfriend-ever-1760062/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/2021/01/Jasmin-Bhasin-Aly-Goni-Nikki-Tamboli-Bigg-Boss-BiggBoss-14-600x315.jpg", "publishedAt": "2021-01-13T06:49:14Z", "content": "On Sunday, one of the most emotional evictions in the history of Bigg Boss took place. Popular actress and now-ex-contestant Jasmin Bhasin was eliminated. Aly Goni who is best friends with Jasmin and… [+2659 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sriram Lakshman", "title": "A strong India would act as ‘counterbalance’ to China, says declassified U.S. document - The Hindu", "description": "The 10-page document outlines objectives and strategies with regard to China, North Korea, India and other countries in the Indo-Pacific region", "url": "https://www.thehindu.com/news/international/a-strong-india-would-act-as-counterbalance-to-china-says-declassified-white-house-document/article33565659.ece", "urlToImage": "https://www.thehindu.com/news/international/xvqe9d/article33565658.ece/ALTERNATES/LANDSCAPE_615/FILE-PHOTO-US-National-Security-Advisor-Robert-OBrien-in-the-Philippines", "publishedAt": "2021-01-13T06:37:17Z", "content": "With days to go before its end, the Trump administration has declassified a sensitive document on the U.S. strategic framework for the Indo-Pacific from 2018. The 10-page document which does not come… [+5425 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained Ideas: Why Supreme Court’s ruling on farm laws sets a terrible constitutional precedent - The Indian Express", "description": "Pratap Bhanu Mehta writes: The Supreme Court is, perhaps unintentionally but damagingly, seeking to break the momentum of a social movement.", "url": "https://indianexpress.com/article/explained/supreme-court-ruling-farm-laws-pratap-bhanu-mehta-7144464/", "urlToImage": "https://images.indianexpress.com/2021/01/farmers-protest-9.jpg", "publishedAt": "2021-01-13T06:34:27Z", "content": "The issues in the farm bills are complex. But no matter which side you are on, you should now worry about how the Supreme Court is interpreting its function, states Pratap Bhanu Mehta, contributing e… [+2188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Chaos as Indian shuttlers in Bangkok go through Covid scare, later cleared to play - The Indian Express", "description": "According to the BWF, the Thailand Public Health Ministry’s six-member “working group” of doctors initially determined that Nehwal and Prannoy, and a German player, had “tested positive on the PCR test”. But they also said that the players’ “antibody IgG was …", "url": "https://indianexpress.com/article/sports/badminton/chaos-as-indian-shuttlers-in-bangkok-go-through-covid-scare-later-cleared-to-play-7143995/", "urlToImage": "https://images.indianexpress.com/2021/01/saina-1.jpg", "publishedAt": "2021-01-13T06:06:48Z", "content": "IT WAS a harrowing day for Indian shuttlers at the Super 1000 in Bangkok badminton’s first major unlockdown tournament inside a bio-bubble with the Badminton World Federation saying that Saina Nehwal… [+3709 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anonymous", "title": "Singhu, Tikri, other key Delhi borders remain closed as farmers’ protest continues - Hindustan Times", "description": "Traffic has been diverted from Mukarba and GTK road. Motorists are also advised to avoid Outer Ring Road, GTK Road and NH-44, traffic police officials said", "url": "https://www.hindustantimes.com/india-news/singhu-tikri-other-key-delhi-borders-remain-closed-as-farmers-protest-continues-101610507902212.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/13/550x309/7ade1ed0-554d-11eb-b18d-19494570fc18_1610507901175.jpg", "publishedAt": "2021-01-13T03:18:21Z", "content": "Vehicular movement between Delhi and its two neighbouring states Haryana and Uttar Pradesh (UP) remains disrupted as six borders connecting Haryana with Delhi are still completely closed while two ke… [+1560 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ahmed Ali", "title": "Mumbai: Muchhad paan shop owner held for ‘possessing’ 500gm cannabis - Times of India", "description": "The Narcotics Control Bureau (NCB) arrested Ramkumar Tiwari, owner of the famous Muchhad Paanwala shop, late on Monday, saying it had recovered 500 gr", "url": "https://timesofindia.indiatimes.com/city/mumbai/muchhad-paan-shop-owner-held-for-possessing-500gm-cannabis/articleshow/80239359.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80242291,width-1070,height-580,imgsize-252246,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-01-12T22:51:00Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "As India Prepares for Inoculations, Know About Covid-19 Vaccines, Registration Process and Prices - News18", "description": "India has approved two Covid-19 vaccines -- Covishield and Covaxin -- for restricted emergency use in the country against the virus.", "url": "https://www.news18.com/news/india/as-india-readies-for-covid-19-vaccination-drive-know-about-the-vaccines-registration-process-and-price-3280997.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610466467_vaccine.jpg", "publishedAt": "2021-01-12T15:53:00Z", "content": "India has approved two Covid-19 vaccines -- Covishield and Covaxin -- for restricted emergency use in the country against the virus. Oxford-AstraZeneca's vaccine Covishield has been manufactured by t… [+3859 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "IIT Guwahati researchers find new clues to how and why stars die - Northeast Now", "description": "Researchers from the Indian Institute of Technology (IIT) - Guwahati, have found new and important clues to understand the death of massive stars. The IIT-Guwahati researchers have also revealed the problems with the existing models. The IIT-Guwahati research…", "url": "https://nenow.in/top-news/iit-guwahati-researchers-find-new-clues-to-how-and-why-stars-die.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2021/01/IMG-20210112-WA0007.jpg", "publishedAt": "2021-01-12T14:39:43Z", "content": "Researchers from the Indian Institute of Technology (IIT) – Guwahati, have found new and important clues to understand the death of massive stars.\r\nThe IIT-Guwahati researchers have also revealed the… [+3332 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "SpaceX simplified: Everything you need to know about Elon Musk's rocket empire - CNET", "description": "If you've heard something about a Starship bound for Mars, NASA astronauts riding a Dragon and Starlink broadband, here are the key details.", "url": "https://www.cnet.com/news/spacex-simplified-everything-you-need-to-know-about-elon-musks-rocket-empire/", "urlToImage": "https://cnet4.cbsistatic.com/img/DH2jEYpbeXVKBuy-WotU4o3SIHY=/1200x630/2018/02/11/6b3e2655-714c-4c2e-8896-bf6aa6c80d44/elonmusknatgeo.jpg", "publishedAt": "2021-01-12T02:08:00Z", "content": "SpaceX, the rocket company founded by tech billionaire Elon Musk, was created with the mission of taking humans to Mars. Nearly two decades on, it's already taken NASA astronauts to orbit and accompl… [+9617 chars]"}]}