{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "No threat to Earth as huge asteroid zooms past - The Jakarta Post - Jakarta Post", "description": "The asteroid was two million kilometres (1.25 million miles) away at its nearest, according to NASA -- more than five times the distance between the Earth and the Moon but still close enough to be classified as a \"potentially hazardous asteroid\".", "url": "http://www.thejakartapost.com/life/2021/03/22/no-threat-to-earth-as-huge-asteroid-zooms-past-.html", "urlToImage": "https://img.jakpost.net/c/2021/03/22/2021_03_22_111551_1616400460._large.jpg", "publishedAt": "2021-03-22T08:16:00Z", "content": "The largest asteroid to pass by Earth this year has made its closest approach, posing no threat of a cataclysmic collision but giving astronomers a rare chance to study a rock formed during the begin… [+3072 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Marsquakes Help NASA's InSight Lander Calculate the Magnitude of Red Planet's Molten Core - News18", "description": "Due to the turbulent atmosphere and frequent dust storms on Mars, NASA's Insight lander is more sensitive at tracing these quakes at night when there is a less atmospheric disturbance.", "url": "https://www.news18.com/news/buzz/marsquakes-help-nasas-insight-lander-calculate-the-magnitude-of-red-planets-molten-core-3554888.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1616400882_untitled-design-2021-03-22t134118.621.png", "publishedAt": "2021-03-22T08:15:09Z", "content": "Mars has always been a subject of fascination for space scientists and Astro-enthusiasts. After analysing what lies on the surface of the planet with various rovers from different countries, it’s tim… [+1644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Amazon Fab Phone Fest Begins: Price Cuts on OnePlus 8T, OnePlus 8 Pro, More Phones - Gadgets 360", "description": "OnePlus 8 Pro is listed with Rs. 3,500 coupons effectively making it available for Rs. 51,499 for the 8GB RAM + 128GB storage option and Rs. 56,499 for the 12GB RAM + 256GB storage model. Both the phones are listed with exchange offers for further discounts.", "url": "https://gadgets.ndtv.com/mobiles/news/amazon-fab-phone-fest-begins-price-cut-oneplus-8t-8-pro-redmi-note-9-pro-max-prime-oppo-a31-2020-samsung-galaxy-m51-more-deals-2396234", "urlToImage": "https://i.gadgets360cdn.com/large/amazon_fab_phone_fest_1616399630579.jpg", "publishedAt": "2021-03-22T08:02:15Z", "content": "Amazon Fab Fest has begun on the online marketplace and it has brought along a bunch of offers and discounts. The sale will go on till March 25 and Amazon has partnered with ICICI Bank to offer 10 pe… [+2388 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google launches a new app that connects nearby devices without Bluetooth, Internet connection - HT Tech", "description": "In case you don’t know, WiFi Aware is Neighbor Awareness Networking (NAN) that lets smartphones running Android 8 and later versions to “discover and connect directly to each other without any other type of connectivity between them.”", "url": "https://tech.hindustantimes.com/tech/news/google-launches-a-new-app-that-connects-nearby-devices-without-bluetooth-internet-connection-71616399596480.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/03/22/600x338/7a44aeabfbf04f1097cd757cbcbd0f2f-7a44aeabfbf04f1097cd757cbcbd0f2f-0_1614792804796_1614792835600_1616399646836.jpg", "publishedAt": "2021-03-22T07:53:16Z", "content": "Google has found a new way to keep nearby smartphones and users connected as it has launched its WifiNanScan App. This is not for end users but it will eventually affect their day to day usage, as re… [+1884 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Staff Writer", "title": "Oxford-AstraZeneca Covid vaccine 79% effective in US trial - Mint", "description": "The vaccine was also shown to be 100% effective at preventing severe disease, death and hospitalization.The fresh data comes after many countries resuming use of the vaccine after the European Medicines Agency and the WHO said the benefits outweighed the risk…", "url": "https://www.livemint.com/news/world/oxfordastrazeneca-covid-vaccine-79-effective-in-us-trial-11616397304609.html", "urlToImage": "https://images.livemint.com/img/2021/03/22/600x338/2021-03-19T084026Z_1_LYNXMPEH2I0EQ_RTROPTP_3_HEALTH-CORONAVIRUS-EU-ASTRAZENECA_1616397508629_1616397524719.JPG", "publishedAt": "2021-03-22T07:19:41Z", "content": "The coronavirus vaccine developed by Oxford University and AstraZeneca was 79% effective in a large US trial at preventing symptomatic illness, and was 100% effective against severe or critical disea… [+2933 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shanaya Kapoor To Make Her Bollywood Debut With Karan Johar's Dharma Productions - NDTV", "description": "Shanaya will start shooting for her first film in July this year", "url": "https://www.ndtv.com/entertainment/shanaya-kapoor-to-make-her-bollywood-debut-with-karan-johars-dharma-productions-2396199", "urlToImage": "https://c.ndtvimg.com/2021-03/mo4bhadg_shayana-kapoor-bollywood-debut-_625x300_22_March_21.jpg", "publishedAt": "2021-03-22T07:13:22Z", "content": "Karan Johar shared this photo of Shanaya Kapoor. (Image courtesy: Instagram)\r\nHighlights\r\n<ul><li>\"Woke up today with the most grateful heart!\" wrote Shanaya Kapoor \r\n</li><li>\"Here's to a great jour… [+1963 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amazon Gets Court Notice On Its Challenge To Future Group-Reliance Deal - NDTV", "description": "The Delhi High Court on Monday stayed a single judge's order restraining Future Retail Ltd from going ahead with its Rs 24,713 crore deal with Reliance Retail to sell its business, which was objected to by US-based e-commerce giant Amazon.", "url": "https://www.ndtv.com/india-news/amazon-gets-delhi-high-court-notice-on-its-challenge-to-future-group-reliance-deal-news-agency-pti-2396189", "urlToImage": "https://c.ndtvimg.com/2020-10/aqh50tho_amazon-_625x300_21_October_20.jpg", "publishedAt": "2021-03-22T06:58:48Z", "content": "The bench listed the matter for further hearing on April 30.\r\nNew Delhi: The Delhi High Court on Monday stayed a single judge's order restraining Future Retail Ltd from going ahead with its Rs 24,713… [+789 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Next Billion Users head Caesar Sengupta is leaving Google - TechCrunch", "description": "Caesar Sengupta, the long-time head of Google’s Next Billion Users initiative, is leaving the company next month, he said Monday. Sengupta, who additionally also led the company’s payments business in the past three years, is leaving the firm after nearly 15 …", "url": "http://techcrunch.com/2021/03/21/next-billion-users-head-caesar-sengupta-is-leaving-google/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-848816032.jpg?w=601", "publishedAt": "2021-03-22T06:33:45Z", "content": "Caesar Sengupta, the long-time head of Googles Next Billion Users initiative, is leaving the company next month, he said Monday. Sengupta, who additionally also led the company’s payments business in… [+2550 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Param Bir Singh’s letter dented Maharashtra Home Ministry’s image: Sena - The Indian Express", "description": "In the editorial in the Sena mouthpiece 'Saamana', the party said a fire will erupt if the BJP tries to undermine the majority enjoyed by the MVA government.", "url": "https://indianexpress.com/article/india/param-bir-singhs-letter-dented-maharashtra-home-ministrys-image-sena-7239407/", "urlToImage": "https://images.indianexpress.com/2021/03/pic-4-6.jpg", "publishedAt": "2021-03-22T06:20:27Z", "content": "The Shiv Sena on Monday said the Maha Vikas Aghadi government enjoys “good majority” and it will not fall because of “one official” even as it admitted that ex-Mumbai police chief Param Bir Singh’s a… [+4047 chars]"}, {"source": {"id": null, "name": "91mobiles"}, "author": "https://www.facebook.com/abid.iqbal.shaik", "title": "OnePlus 9, OnePlus 9 Pro complete specifications leaked ahead of March 23rd launch - 91mobiles", "description": "OnePlus 9 and OnePlus 9 Pro specifications have been leaked ahead of the March 23rd launch event. The only thing remaining is the OnePlus 9 series price reveal.", "url": "https://www.91mobiles.com/hub/oneplus-9-pro-specifications-leak-t-mobile-page/", "urlToImage": "https://static.hub.91mobiles.com/wp-content/uploads/2021/03/OnePlus-9.jpeg", "publishedAt": "2021-03-22T06:15:44Z", "content": "OnePlus 9 and OnePlus 9 Pro prices in India will be revealed on March 23rd.\r\nOnePlus 9 and OnePlus 9 Pro specifications have been leaked in full ahead of the launch event on March 23rd. The phones wi… [+2292 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Saradha Ponzi scam: CBI raids Mumbai office and residence of three SEBI officials - Zee News", "description": "The Central Bureau of Investigation (CBI) is conducting raids at multiple locations in connection with its ongoing probe into the Saradha Ponzi scam or Saradha chit fund scam on Monday.", "url": "https://zeenews.india.com/india/saradha-ponzi-scam-cbi-raids-mumbai-office-and-residence-of-three-sebi-officials-2349514.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/03/22/924449-cbi-1.gif", "publishedAt": "2021-03-22T06:09:04Z", "content": "NEW DELHI: The Central Bureau of Investigation (CBI) is conducting raids at multiple locations in connection with its ongoing probe into the Saradha Ponzi scam or Saradha chit fund scam on Monday.\r\nA… [+1576 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Why didn't you gave birth to 20 children for extra ration? Uttarakhand CM - Times of India", "description": "Uttarakhand chief minister Tirath Singh Rawat once again stoked a controversy by saying poor families should have more kids to get extra ration from govt schemes. CM Rawat was referring to the central govt scheme that distributed food grains, pulses during Co…", "url": "https://timesofindia.indiatimes.com/videos/news/why-didnt-you-gave-birth-to-20-children-for-extra-ration-uttarakhand-cm/videoshow/81626817.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-81626817,imgsize-50708.cms", "publishedAt": "2021-03-22T05:35:25Z", "content": "Mar 22, 2021, 11:05AM ISTSource: TOI.inUttarakhand chief minister Tirath Singh Rawat once again stoked a controversy by saying poor families should have more kids to get extra ration from govt scheme… [+199 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Women suffering from this health condition are 50 per cent more likely to catch COVID-19 - Times of India", "description": "By far we know that older adults, people who are obese, those with compromised immunity, and chronic heart or kidney disease are more likely to get infected after coming in contact with the virus.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-women-suffering-from-this-health-condition-are-50-per-cent-more-likely-to-catch-covid-19/photostory/81625905.cms", "urlToImage": "https://static.toiimg.com/photo/81625928.cms", "publishedAt": "2021-03-22T05:34:00Z", "content": "Polycystic Ovary Syndrome or PCOS is a common hormonal disorder among women of reproductive age. In this health condition, women develop cysts in their ovaries, which may even lead to infertility iss… [+309 chars]"}, {"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "Harman Baweja and Sasha Ramchandani get married in gurudwara; Shilpa Shetty, Raj Kundra share Anand Karaj videos - Bollywood Hungama", "description": "Harman Baweja and Sasha Ramchandani get married in gurudwara; Shilpa Shetty, Raj Kundra share Anand Karaj videos Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News…", "url": "https://www.bollywoodhungama.com/news/features/harman-baweja-sasha-ramchandani-get-married-gurudwara-shilpa-shetty-raj-kundra-share-anand-karaj-videos/", "urlToImage": "https://stat2.bollywoodhungama.in/wp-content/uploads/2021/03/WhatsApp-Image-2021-03-22-at-9.04.13-AM-1.jpeg", "publishedAt": "2021-03-22T04:46:43Z", "content": "Actor Harman Baweja and Sasha Ramchandani have tied the knot in an intimate ceremony in Kolkata on Sunday. The couple had organised lavish pre-wedding festivities which were attended by their close f… [+924 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "'They reminded me of Virender Sehwag and Sachin Tendulkar': Michael Vaughan impressed with Team India openers - Hindustan Times", "description": "\"I’m sure that was not their intention at the start of the series. But today they reminded me of Virender Sehwag and Sachin Tendulkar,\" Vaughan said.", "url": "https://www.hindustantimes.com/cricket/ind-vs-eng-they-reminded-me-of-virender-sehwag-and-sachin-tendulkar-michael-vaughan-impressed-with-team-india-openers-101616386609771.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/22/1600x900/australia-v-england-first-test-day-1_74ae81a8-2352-11eb-9c71-c26c1d2bb974_1616386907648.jpg", "publishedAt": "2021-03-22T04:22:56Z", "content": "Virat Kohli surprised everyone when he decided to open the innings with Rohit Sharma in the fifth T20I against England. The series was tied 2-2 and with regular opener KL Rahul struggling for form, V… [+1715 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent | Edited by Zara Khan", "title": "PM Modi to launch Jal Shakti Abhiyan today: All you need to know - Hindustan Times", "description": "The next leg of the programme, dubbed “catch the rain where it falls, when it falls”, will be rolled out across the country’s 734 districts covering over 600,000 villages", "url": "https://www.hindustantimes.com/india-news/pm-modi-to-launch-jal-shakti-abhiyan-today-all-you-need-to-know-101616386849149.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/22/1600x900/a1bdeb0e-8ac5-11eb-af96-ff2673230aac_1616386848233.jpg", "publishedAt": "2021-03-22T04:20:48Z", "content": "Prime Minister Narendra Modi will launch the Jal Shakti Abhiyan: Catch the Rain campaign on World Water Day, celebrated on Monday, at 12.30pm through video conferencing. According to a statement issu… [+2335 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anushka Sharma-Virat Kohli With Daughter Vamika And Hardik Pandya-Natasa Stankovic With Son Agastya Fly To Pune - NDTV", "description": "In a viral video, Anushka can be seen holding baby Vamika in her arms and walking side-by-side with Virat Kohli, who can be seen holding their luggage", "url": "https://www.ndtv.com/entertainment/anushka-sharma-virat-kohli-with-daughter-vamika-and-hardik-pandya-natasa-stankovic-with-son-agastya-fly-to-pune-2396053", "urlToImage": "https://c.ndtvimg.com/2021-03/kk4516p8_anushka-sharma-virat-kohli-vamika_625x300_22_March_21.jpg", "publishedAt": "2021-03-22T04:02:57Z", "content": "Anusha-Virat with Vamika in a still from a fan page. (Image courtesy: Instagram)\r\nHighlights\r\n<ul><li>Virat and Hardik flew to Pune for three ODI matches \r\n</li><li>Pictures and videos of them from t… [+1794 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Former senator Bill Nelson who flew in space shuttle nominated by Biden to lead NASA - Firstpost", "description": "If confirmed by the Senate, Nelson – who currently serves as an advisor to NASA – will become the agency's 14th administrator.", "url": "https://www.firstpost.com/tech/science/former-senator-bill-nelson-who-flew-in-space-shuttle-nominated-by-biden-to-lead-nasa-9446421.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/03/Bill-Nelson_NASA.jpg", "publishedAt": "2021-03-22T04:01:15Z", "content": "The Associated PressMar 22, 2021 09:31:15 IST\r\nPresident Joe Biden has chosen a former senator from Florida who flew on the space shuttle right before the Challenger accident to lead NASA. Biden on F… [+3713 chars]"}, {"source": {"id": null, "name": "OpIndia"}, "author": "https://www.facebook.com/opindiacom/", "title": "Priyanka Chopra reveals her how a filmmaker wanted her to ‘strip to underwear’ and how she was racially bullied as a teenager - OpIndia", "description": "Priyanka Chopra in her interview with Oprah Winfrey also said that she has had Christianity, Islam and Hinduism influence her upbringing. | OpIndia News", "url": "https://www.opindia.com/2021/03/priyanka-chopra-oprah-winfrey-nick-jonas-bullied/", "urlToImage": "https://i0.wp.com/www.opindia.com/wp-content/uploads/2021/03/priyanka-chopra-oprah.jpeg?fit=1200%2C667&ssl=1", "publishedAt": "2021-03-22T03:18:53Z", "content": "Actress Priyanka Chopra in a shocking revelation on Oprah Winfrey Show said that a filmmaker had once asked her to ‘strip to underwear’ for a ‘sultry’ dance sequence. She, however, did not name the f… [+2857 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Nikhil Narain", "title": "India vs England - An ODI Debut To Suryakumar & Krishna In India's Likely XI For The Series Opene - News18", "description": "India should open with the formidable pairing of Rohit Sharma-Shikhar Dhawan and bat KL Rahul at number 5 in the ODI series opener against England in Pune on Tuesday. An ODI debut to Suryakumar Yadav and fast bowler Prasidh Krishna should also spice up the co…", "url": "https://www.news18.com/cricketnext/news/india-vs-england-an-odi-debut-to-suryakumar-krishna-in-indias-likely-xi-for-the-series-opener-3559229.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/03/1616076084_suryakumar-yadav.jpg", "publishedAt": "2021-03-22T03:11:51Z", "content": "India will clash with World Cup winners England in the three-match ODI series starting in Pune from the 23rd of March, Tuesday. With victories in the Test and T20I series, the confidence of the home … [+4856 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Watch: Anushka Sharma and Virat Kohli make their first appearance with daughter Vamika at the airport; co - Times of India", "description": "The new parents, Anushka Sharma and Virat Kohli were clicked at the Ahmedabad airport on Sunday with their little a", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/watch-anushka-sharma-and-virat-kohli-makes-their-first-appearance-with-daughter-vamika-at-the-airport-covers-her-face-with-a-blanket/articleshow/81624691.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81624687,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-362449/81624687.jpg", "publishedAt": "2021-03-22T03:04:00Z", "content": "Janhvi Kapoor has a weekend treat for her fans as she took to her Instagram handle and held an impromptu Ask Me Anything session. Being a rare Instagrammer, the actress grabbed everyones attention as… [+136 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "Second wave of COVID-19 has begun: Karnataka Health Minister K Sudhakar - The News Minute", "description": "Karnataka Health Minister Dr K Sudhakar on Sunday said that the second wave of the coronavirus had begun and sought people's cooperation to contain the disease. \"We are at the beginning of the second wave of coronavirus. Let us all join hands to control it be…", "url": "https://www.thenewsminute.com/article/second-wave-covid-19-has-begun-karnataka-health-minister-k-sudhakar-145679", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Dr-Sudhakar-1200x-bookshelf_0_0.jpg", "publishedAt": "2021-03-22T02:58:40Z", "content": "The Minister said that the next three months were crucial, and urged people to follow all safety protocols.Karnataka Health Minister Dr K Sudhakar on Sunday said that the second wave of the coronavir… [+1894 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Hormaz Fatakia", "title": "Markets Live: Sensex, Nifty Decline; Nifty Bank Down 250 Points - BloombergQuint", "description": "Catch all live updates on share prices, index moves, corporate announcements and more from Indian stock markets today.", "url": "https://www.bloombergquint.com/markets/markets-live-sgx-nifty-indicates-flat-start-tata-motors-nmdc-majesco-in-focus", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2017-11%2F7bf6c2ed-79b7-433a-b2ef-6e58b45ba893%2F251937970_1-3%20(2).jpg?rect=0%2C118%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-03-22T02:42:55Z", "content": "Good Morning!\r\nIndian equities snapped a five-day losing streak on Friday, but the gains were not enough to prevent a weekly loss for the benchmark indices.\r\nBoth S&amp;P BSE Sensex and the NSE Nifty… [+920 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Sees Biggest Single-Day Jump With 30,535 Fresh Covid Cases - NDTV", "description": "Maharashtra on Sunday reported 30,535 fresh COVID-19 cases, the highest rise in a single day, the state health department said.", "url": "https://www.ndtv.com/india-news/maharashtra-coronavirus-cases-maharashtra-sees-biggest-single-day-jump-with-30-535-fresh-covid-19-cases-2396004", "urlToImage": "https://c.ndtvimg.com/2020-10/16haqpf8_mumbai-generic650_625x300_12_October_20.jpg", "publishedAt": "2021-03-22T02:03:52Z", "content": "Maharashtra on Sunday reported 30,535 fresh COVID-19 cases.\r\nMumbai: Maharashtra on Sunday reported 30,535 fresh COVID-19 cases, the highest rise in a single day, the state health department said.\r\nW… [+1775 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Syed Khalid Hussain Hussain", "title": "Two Lashkar-e-Toiba terrorists among three killed in J&K`s Shopian, search operation underway - Zee News", "description": "At least three terrorists, two of them linked to Pakistan-backed terror outfit Lashkar-e-Toiba (LeT), were killed in an encounter with the security forces in Jammu and Kashmir’s Shopian in the wee hours of Monday.", "url": "https://zeenews.india.com/jammu-and-kashmir/two-terrorists-killed-in-jk-s-shopian-encounter-underway-2349448.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/03/22/924383-encounter-2.gif", "publishedAt": "2021-03-22T01:22:58Z", "content": "SRINAGAR: At least three terrorists, two of them linked to Pakistan-backed terror outfit Lashkar-e-Toiba (LeT), were killed in an encounter with the security forces in Jammu and Kashmirs Shopian in t… [+1762 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fresh Deluge Worsens \"One In 100 Year\" Australia Floods - NDTV", "description": "Australia's south east was lashed by another round of intense rainfall Monday, worsening \"one in 100 year\" flooding north of Sydney, as thousands of people were ordered to evacuate and more than 200 schools closed.", "url": "https://www.ndtv.com/world-news/fresh-deluge-worsens-one-in-100-year-australia-floods-2395994", "urlToImage": "https://c.ndtvimg.com/2021-03/5ltm6434_sydney-flood-afp_625x300_21_March_21.jpeg", "publishedAt": "2021-03-22T00:53:30Z", "content": "Emergency service officials said 18,000 had so far been subject to evacuation orders across state (File)\r\nSydney: Australia's south east was lashed by another round of intense rainfall Monday, worsen… [+2319 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 simple home remedies to whiten your teeth naturally - Times of India", "description": "There are plenty of products one can choose from to whiten their teeth.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/home-remedies/5-simple-home-remedies-to-whiten-your-teeth-naturally/articleshow/81591125.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81591125,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-736492/81591125.jpg", "publishedAt": "2021-03-21T18:30:00Z", "content": "There are plenty of products one can choose from to whiten their teeth. But most of these products contain bleach that is used as a whitening agent, which is not good. If you are looking for ways to … [+4516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Imran Khan, Pakistan's First Lady Also Tests Positive For COVID-19 - NDTV", "description": "Pakistan Prime Minister Imran Khan' wife Bushra Bibi also tested positive for COVID-19 a few hours after the PM himself got infected with the virus on Saturday.", "url": "https://www.ndtv.com/world-news/after-pakistan-prime-minister-imran-khan-his-wife-also-tests-positive-for-covid-19-2395882", "urlToImage": "https://c.ndtvimg.com/2021-03/6g03h2l8_bushra-bibi-pakistan_625x300_21_March_21.jpg", "publishedAt": "2021-03-21T16:02:08Z", "content": "The Pakistan PM and First Lady Bushra Bibi are feeling \"comfortable with mild symptoms,\" officials said.\r\nPakistan Prime Minister Imran Khan' wife Bushra Bibi also tested positive for COVID-19 a few … [+2393 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "COVID-19 Update | South Africa sells AstraZeneca vaccines to other African countries - Moneycontrol.com", "description": "The country had paused AstraZeneca vaccinations last month because of a small trial showing the shot offered minimal protection against mild to moderate illness caused by the dominant local coronavirus variant.", "url": "https://www.moneycontrol.com/news/coronavirus/covid-19-update-south-africa-sells-astrazeneca-covid-19-vaccines-to-other-african-countries-6674031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/Astrazeneca-770x433.jpg", "publishedAt": "2021-03-21T15:40:00Z", "content": "South Africa has concluded the sale of AstraZeneca COVID-19 vaccines it had acquired but did not use to other African Union (AU) member states, the health ministry said on Sunday.\r\nThe country had pa… [+1427 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "England need to get to the bottom of Archer's problem: Silverwood - Times of India", "description": "Cricket News: England coach Chris Silverwood on Sunday said that his side needs to get to the bottom of the problem which has been hampering pacer Jofra Archer. Sil", "url": "https://timesofindia.indiatimes.com/sports/cricket/england-in-india/england-need-to-get-to-the-bottom-of-archers-problem-silverwood/articleshow/81618634.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81618647,width-1070,height-580,imgsize-139023,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-21T14:53:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Saudi Aramco to prioritise energy supply to China for 50 years, says CEO - Economic Times", "description": "Saudi Arabia, the world's biggest oil exporter, retained its position as China's top supplier in the first two months this year, with volumes up 2.1% to 1.86 million barrels per day (bpd), China customs data showed on Saturday.", "url": "https://economictimes.indiatimes.com/news/international/business/saudi-aramco-to-prioritise-energy-supply-to-china-for-50-years-says-ceo/articleshow/81618391.cms", "urlToImage": "https://img.etimg.com/thumb/msid-81618388,width-1070,height-580,imgsize-613157,overlay-economictimes/photo.jpg", "publishedAt": "2021-03-21T14:16:00Z", "content": "Saudi Aramco will ensure China's energy security remains its highest priority for the next 50 years and beyond as new and existing energy sources run in parallel for some time, CEO Amin Nasser told t… [+2412 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "PM sad for tweet by 22-year-old woman, but not for flood-hit people in Assam: Priyanka Gandhi Vadra - Times of India", "description": "Assembly Elections News: Last year's flooding of the Brahmaputra and its tributaries during the pandemic affected some 2.8 million people in Assam. \"I was listening to the Pri", "url": "https://timesofindia.indiatimes.com/elections/assembly-elections/assam/pm-sad-for-tweet-by-22-year-old-woman-but-not-for-flood-hit-people-in-assam-priyanka-gandhi-vadra/articleshow/81617687.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81617949,width-1070,height-580,imgsize-102742,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-03-21T13:00:00Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Uddhav has lost moral authority to govern, says RS Prasad; asks why Param Bir Singh was briefing Sharad Pawar - Times Now", "description": "Sharad Pawar is not a part of the government. Why was Param Bir Singh briefing him: Ravi Shankar Prasad", "url": "https://www.timesnownews.com/india/article/uddhav-has-lost-moral-authority-to-govern-says-rs-prasad-asks-why-param-bir-singh-was-briefing-sharad-pawar/735269", "urlToImage": "https://imgk.timesnownews.com/story/RS_Prasad-Pawar.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-03-21T09:13:00Z", "content": "<ul><li>'If Rs 100 cr was the target by Home Minister of Maharashtra then what was the target by other ministers'</li></ul>\r\n<ul><li>'Uddhav Thackeray's govt has lost the moral authority to govern Ma… [+2093 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Connor Perrett", "title": "More than 43 million Americans - 1 in 6 adults - have been fully vaccinated against COVID-19, according to the - Business Insider India", "description": "One in six adults in the US has been fully vaccinated for COVID-19, according to the CDC. Approximately 40% of Americans over the age of 65 have been vaccinated", "url": "https://www.businessinsider.in/science/health/news/more-than-43-million-americans-1-in-6-adults-have-been-fully-vaccinated-against-covid-19-according-to-the-cdc/articleshow/81609787.cms", "urlToImage": "https://www.businessinsider.in/photo/81609787/more-than-43-million-americans-1-in-6-adults-have-been-fully-vaccinated-against-covid-19-according-to-the-cdc.jpg?imgsize=819237", "publishedAt": "2021-03-20T19:46:00Z", "content": "One in six adults in the US - about 17% of the population- have been fully vaccinated against COVID-19 as of Saturday, according to data published Saturday by the Centers for Disease Control and Prev… [+1521 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Smoke & Fire! NASA Tests the World's Most Powerful Rocket [Video] - SciTechDaily", "description": "NASA's Space Launch System (SLS) rocket's core stage fired all four of its RS-25 engines on March 18th at Stennis Space Center near Bay St. Louis, Mississippi. The core stage includes the liquid hydrogen tank and liquid oxygen tank, four RS-25 engines, and th…", "url": "https://scitechdaily.com/smoke-fire-nasa-tests-the-worlds-most-powerful-rocket-video/", "urlToImage": "https://scitechdaily.com/images/NASA-SLS-Rocket-RS-25-Engine-Test.gif", "publishedAt": "2021-03-20T13:33:58Z", "content": "NASA’s Space Launch System (SLS) rocket’s core stage fired all four of its RS-25 engines on March 18th at Stennis Space Center near Bay St. Louis, Mississippi.\r\nThe core stage includes the liquid hyd… [+1765 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Africa confronts significant challenges in guaranteeing access to coronavirus vaccines - MENAFN.COM", "description": "On Friday, Mar. 19 the Africa Centers for Disease Control and Prevention (Africa CDC) stated that Africa is confronting major challenges in guaranteeing access to coronavirus vaccines.<br />\n<br />\nThe public health agency stated in a report that bad access t…", "url": "https://menafn.com/1101783013/Africa-confronts-significant-challenges-in-guaranteeing-access-to-coronavirus-vaccines&source=22", "urlToImage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_PharmaHealth_40_menafn.jpg", "publishedAt": "2021-03-20T12:45:23Z", "content": "Africa confronts significant challenges in guaranteeing access to coronavirus vaccines\r\n(MENAFN) On Friday, Mar. 19 the Africa Centers for Disease Control and Prevention (Africa CDC) stated that Afri… [+981 chars]"}]}