{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Geoff Lemon", "title": "India's bloody-mindedness fired them to historic win in Australia - The Guardian", "description": "From one-down, without their captain and a host of first-choice players, India completed one of the great comebacks in one of the great Test series", "url": "https://amp.theguardian.com/sport/2021/jan/19/india-bloody-mindedness-historic-cricket-win-in-australia", "urlToImage": null, "publishedAt": "2021-01-19T16:45:00Z", "content": "'Unreal': India's record-breaking victory over Australia seals series video report\r\nIndia cricket teamFrom one-down, without their captain and a host of first-choice players, India completed one of t… [+7226 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Oath Ceremony: India Timing, How To Watch And All Other Details - NDTV", "description": "US President-elect Joe Biden and his deputy Kamala Harris will be sworn in as the 46th President and 49th Vice-President of the United States tomorrow, January 20. Ms Harris will make history as America's first woman, first Black and first person with south A…", "url": "https://www.ndtv.com/india-news/joe-biden-oath-ceremony-india-timing-how-to-watch-and-all-other-details-2354967", "urlToImage": "https://c.ndtvimg.com/2020-12/dpta6or_joe-bidenkamala-harris-afp-_625x300_11_December_20.jpg", "publishedAt": "2021-01-19T16:42:16Z", "content": "Joe Biden and Kamala Harris will be sworn in on the West front of US Capitol building\r\nUS President-elect Joe Biden and his deputy Kamala Harris will be sworn in as the 46th President and 49th Vice-P… [+4781 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Obesity may impact Covid vaccines' efficacy: Experts - The Tribune India", "description": "Say obese people may have higher levels of a variety of immune-regulating proteins, including cytokines", "url": "https://www.tribuneindia.com/news/health/obesity-may-impact-covid-vaccines-efficacy-experts-200739", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/1/2021_1$largeimg_1539391817.jpg", "publishedAt": "2021-01-19T16:34:00Z", "content": "New Delhi, January 19\r\nCovid-19 vaccines may not be fully effective in people who are suffering from obesity, as experts on Tuesday suggested that the process of healing may be slower in obese people… [+2793 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Coronavirus News LIVE Updates: India's Daily Covid-19 Cases Fall to 10,064, Lowest Deaths in 8 Months - News18", "description": "Coronavirus News LIVE Updates: With 10,064 fresh coronavirus cases reported in the last 24 hours, India saw the lowest rise in daily cases in nearly seven months as well as the lowest death rate in nearly 8 months.", "url": "https://www.news18.com/news/india/coronavirus-live-updates-south-africa-stain-of-covid-19-50-more-contagious-say-experts-first-case-reported-in-lakshadweep-islands-3309506.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610246268_untitled-design-49.jpg", "publishedAt": "2021-01-19T16:27:18Z", "content": "A new variant of the coronavirus first identified in South Africa is more contagious than earlier versions, experts said on Monday, but there is no evidence that it is more deadly. The new variant is… [+1793 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Pardons, Travel Ban, Award Ceremony: Donald Trump Spends His Last Day at White House - News18", "description": "The last day of Donald Trump as President of the United States had one tangible issue he has been focused on and that is how to apply his power to pardon before his term ends before snubbing his successor Joe Biden's inauguration and leaving for Florida.", "url": "https://www.news18.com/news/world/pardons-travel-ban-bahrain-king-donald-trump-last-day-us-president-3313328.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610417178_untitled-design-71.jpg", "publishedAt": "2021-01-19T16:01:00Z", "content": "The last day of Donald Trump as President of the United States had one tangible issue he has been focused on and that is how to apply his power to pardon before his term ends before snubbing his succ… [+3004 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Bharat Biotech not allowed to conduct simultaneous Phase I, II trials for its intranasal COVID-19 vaccine - Moneycontrol", "description": "The SEC has reportedly refused to consider Bharat Biotech’s request and said it wants the Indian vaccine maker to first conduct the phase I trials and submit the immunogenicity data before moving on to the next stage.", "url": "https://www.moneycontrol.com/news/coronavirus/bharat-biotech-not-allowed-to-conduct-simultaneous-phase-i-ii-trials-for-its-intranasal-covid-19-vaccine-6367661.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/10/AP20281283792723-770x433.jpg", "publishedAt": "2021-01-19T15:53:00Z", "content": "Bharat Biotech has not been allowed to conduct simultaneous phase I and phase II trials for its nasal COVID-19 vaccine candidate, reported CNBC-TV18 on January 19.Sources say SEC did not consider the… [+1960 chars]"}, {"source": {"id": null, "name": "Android Authority"}, "author": null, "title": "See the secondary display on the next ROG Phone in action - Android Authority", "description": "It looks like the phone will borrow from Asus's Zephyrus G14 laptop.", "url": "https://www.androidauthority.com/asus-rog-phone-5-secondary-display-1194176/", "urlToImage": "https://cdn57.androidauthority.net/wp-content/uploads/2020/07/Asus-ROG-Phone-3-back-up-on-table-920x470.jpg", "publishedAt": "2021-01-19T15:39:20Z", "content": "<ul><li>A new video suggests the back of the next ROG Phone will sport a secondary display.</li><li>Like the AniMe Matrix screen on the Zephyrus G14, it looks like youll be able to customize it to di… [+1600 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Missing: One black hole with 10 billion solar masses - The Indian Express", "description": "In the past few decades, it has become part of astronomical lore that at the center of every galaxy lurks a giant black hole into which the equivalent of millions or even billions of suns have disappeared. The bigger the galaxy, the more massive the black hol…", "url": "https://indianexpress.com/article/technology/science/black-hole-galaxy-astronomy-7153203/", "urlToImage": "https://images.indianexpress.com/2021/01/NASA-Black-hole.jpg", "publishedAt": "2021-01-19T15:28:03Z", "content": "Written by Dennis Overbye\r\nAstronomers are searching the cosmic lost-and-found for one of the biggest, baddest black holes thought to exist. So far they havent found it.\r\nIn the past few decades, it … [+9648 chars]"}, {"source": {"id": null, "name": "ITV News"}, "author": "ITV News", "title": "One in eight people in England has had Covid-19, according to ONS survey | ITV News - ITV News", "description": "The survey showed one in eight would have tested positive for Covid antibodies on a blood test in December, suggesting they had the infection in the past.", "url": "https://www.itv.com/news/2021-01-19/covid-one-in-eight-people-in-england-had-virus-by-december-last-year-according-to-ons-survey", "urlToImage": "https://images.ctfassets.net/pjshm78m9jt4/headerImage-f3e97ddf-efb8-43a0-8cf3-08c8a6101585/3a98eeb3c5d126e269a8a4daa5c84fc6/headerImage-f3e97ddf-efb8-43a0-8cf3-08c8a6101585", "publishedAt": "2021-01-19T15:10:00Z", "content": "An estimated one in eight people in England had had Covid-19 by December last year, according to a survey by the Office for National Statistics (ONS).\r\nThis is up from an estimated one in 11 people i… [+4577 chars]"}, {"source": {"id": null, "name": "Lokmat.com"}, "author": "ANI", "title": "Acer incorporate new durable designs and Arm-based processors for education Chromebooks - Lokmat", "description": "The Taiwanese multinational hardware and electronics company, Acer is introducing five new workstations focused on schools today, comprising of four Chromebooks and one Windows convertible. Two of the Chromebooks are Intel-based convertibles, with screens tha…", "url": "https://english.lokmat.com/technology/acer-incorporate-new-durable-designs-and-arm-based-processors-for-education-chromebooks/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/gdhasdhuashdasduaisdaisd_202101.jpg", "publishedAt": "2021-01-19T15:00:16Z", "content": "Acer incorporate new durable designs and Arm-based processors for education Chromebooks\r\nThe Taiwanese multinational hardware and electronics company, Acer is introducing five new workstations focuse… [+2431 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Minimum 100 homebuyers must to file insolvency application against defaulting real estate developer: SC - Moneycontrol.com", "description": "The Supreme Court upheld the validity of IBC Act 2020, saying sections 3 and 10 of the Act do not violate the right to equality under Article 14 of the Constitution. However, homebuyers say decision is a big blow as it will now be difficult to initiate IBC pr…", "url": "https://www.moneycontrol.com/news/business/real-estate/minimum-100-homebuyers-must-to-file-insolvency-application-against-defaulting-real-estate-developer-sc-6367471.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/11/Supreme-Court-2-770x433.jpg", "publishedAt": "2021-01-19T14:45:00Z", "content": "Upholding the constitutional validity of the amendments made to the Insolvency and Bankruptcy Code (IBC) 2020, the Supreme Court on January 19 made it clear that no less than 10 percent of total allo… [+6145 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "India`s squad for England: Ishant Sharma, Virat Kohli, Hardik Pandya return to action - Zee News", "description": "India skipper Virat Kohli will be joining the team for the upcoming four-match Test series against England, as per the squad announced by the Board of Control for Cricket in India (BCCI) on Tuesday (January 19, 2021).", "url": "https://zeenews.india.com/cricket/indias-squad-for-england-ishant-sharma-virat-kohli-hardik-pandya-return-to-action-2336678.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/01/19/911482-ishant-sharma-970.jpg", "publishedAt": "2021-01-19T14:26:00Z", "content": "Mumbai: India skipper Virat Kohli will be joining the team for the upcoming four-match Test series against England, as per the squad announced by the Board of Control for Cricket in India (BCCI) on T… [+2518 chars]"}, {"source": {"id": null, "name": "Newsd.in"}, "author": "IANS", "title": "Obesity may impact Covid vaccines’ efficacy: Experts - Newsd.in", "description": "New Delhi, Jan 19 (IANS) Covid-19 vaccines may not be fully effective in people who are suffering from obesity, as experts on Tuesday suggested that the process of healing may be slower in obese people as compared to the healthy ones. According to a report on…", "url": "https://newsd.in/obesity-may-impact-covid-vaccines-efficacy-experts/", "urlToImage": "https://newsd.in/wp-content/uploads/2016/05/newsd-story-banner-1.jpg", "publishedAt": "2021-01-19T14:15:03Z", "content": "New Delhi, Jan 19 (IANS) Covid-19 vaccines may not be fully effective in people who are suffering from obesity, as experts on Tuesday suggested that the process of healing may be slower in obese peop… [+2804 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "Maldives, Bangladesh to be among first to get Covid-19 vaccines from India - Hindustan Times", "description": "People familiar with developments said on condition of anonymity that 100,000 doses of the Covishield vaccine would be provided to the Maldives on Wednesday.", "url": "https://www.hindustantimes.com/india-news/maldives-bangladesh-to-be-among-first-to-get-covid-19-vaccines-from-india-101611065327104.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/19/550x309/AFP_8YV6YR_1610798676758_1610798768026_1611065473361.jpg", "publishedAt": "2021-01-19T14:14:32Z", "content": "Bhutan, the Maldives and Bangladesh will be among the first countries in the neighbourhood to receive Covid-19 vaccines from India as grant assistance, with supplies of millions of doses to six natio… [+5041 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Rajdeep Sardesai", "title": "Rajdeep Sardesai: Thank you Rahane and Co, in gloomy times we needed a blissful moment like this - Scroll.in", "description": "Brisbane 2021, and indeed this series, must be seen as arguably India’s finest ever overseas cricket performance. It couldn’t have come at a better time too.", "url": "https://scroll.in/field/984506/rajdeep-sardesai-thank-you-rahane-and-co-in-gloomy-times-we-needed-a-blissful-moment-like-this", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/153583-jgnbycwyso-1611062476.jpg", "publishedAt": "2021-01-19T13:41:00Z", "content": "Its pitch dark. Its cold. Bloody cold. 5.30 am in January in the national capital can be cruel on the body. Wrapped up in a warm blanket, bleary-eyed, you tip-toe out of the room so that the wife is … [+11931 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "India asks WhatsApp to withdraw new privacy policy over ‘grave concerns’ - TechCrunch", "description": "India has asked WhatsApp to withdraw the planned change to its privacy policy, posing a new headache to Facebook-owned service that identifies the South Asian nation as its biggest market by users. In an email to WhatsApp head Will Cathcart, the nation’s IT m…", "url": "http://techcrunch.com/2021/01/19/india-asks-whatsapp-to-withdraw-new-privacy-policy-expresses-grave-concerns/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/01/GettyImages-1230551664.jpg?w=600", "publishedAt": "2021-01-19T12:29:53Z", "content": "India has asked WhatsApp to withdraw the planned change to its privacy policy, posing a new headache to Facebook-owned service that identifies the South Asian nation as its biggest market by users.\r\n… [+3893 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rhythma Kaul", "title": "Adverse events post Covid-19 immunisation: Here’s all you need to know - Hindustan Times", "description": "Close to 250,000 healthcare workers were immunised on day one of India’s vaccination drive, of which 447 suffered adverse event following immunisation", "url": "https://www.hindustantimes.com/india-news/adverse-events-post-covid-19-immunisation-here-s-all-you-need-to-know-101610941930391.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/18/550x309/c8403b0e-593f-11eb-84ad-608d3d7896d3_1610941929299.jpg", "publishedAt": "2021-01-19T12:27:00Z", "content": "India on Saturday launched worlds largest Covid-19 vaccination drive. Close to 250,000 healthcare workers were immunised on day one, of which 447 suffered adverse event following immunisation (AEFI).… [+4561 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Aparna Banerjea", "title": "Hospitalisation cost to be borne by authorities: Govt on adverse events post Covid-19 vaccination - Mint", "description": "Health ministry informed that 0.18% adverse events following immunization (AEFI) were reported so far, out of which 0.002% needed hospitalisation", "url": "https://www.livemint.com/news/india/018-adverse-events-0-002-hospitalisations-govt-on-covid-vaccination-so-far-11611054938703.html", "urlToImage": "https://images.livemint.com/img/2021/01/19/600x338/da5ee67a387f4964b90cbfa5709d4f38-da5ee67a387f4964b90cbfa5709d4f38-1_1610193646343_1611056270320.jpg", "publishedAt": "2021-01-19T11:41:30Z", "content": "The Union Health Ministry on Tuesday said 6,31,417 people through 11,660 sessions have received COVID-19 vaccination shot so far since the vaccination drive in the country began on 16 January.In a sp… [+2871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka Bengaluru Coronavirus Live Updates: Less than 500 new Covid-19 cases in state after seven months - The Indian Express", "description": "Karnataka Bangalore Coronavirus (Covid-19) Latest News Live Updates Today, Lockdown 6.0 Guidelines, Corona Virus Cases News Updates: As on Monday, Karnataka state has 8,033 active patients and Bengaluru urban city alone has 5,273 active Covid-19 patients.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-coronavirus-covid-19-lockdown-6-0-covishield-covaxin-yediyurappa-police-airport-bbmp-live-7152095/", "urlToImage": "https://images.indianexpress.com/2020/10/Bengaluru-Ambulances.jpg", "publishedAt": "2021-01-19T11:39:17Z", "content": "Nagarathna, a ward attendant, becomes the first person to receive Covid-19 vaccine jab at Bangalore medical college, Bengaluru in presence of Karnataka Chief Minister BS Yediyurappa. (Express photo)\r… [+1735 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "India’s homegrown COVID vaccine company warns some to avoid shot - Al Jazeera English", "description": "Vaccine developed by Bharat Biotech ran into controversy after Indian government allowed its use without concrete data.", "url": "https://www.aljazeera.com/news/2021/1/19/indias-homegrown-covid-vaccine-company-warns-some-to-avoid-shot", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/01/2021-01-16T063321Z_76756380_RC2U8L99ZYQX_RTRMADP_3_HEALTH-CORONAVIRUS-INDIA-VACCINE.jpg?resize=1200%2C630", "publishedAt": "2021-01-19T11:12:05Z", "content": "Indias homegrown coronavirus vaccine developer Bharat Biotech has warned people with weak immunity and other medical conditions including allergies, fever or a bleeding disorder to consult a doctor b… [+3129 chars]"}, {"source": {"id": null, "name": "91mobiles"}, "author": null, "title": "Samsung Galaxy S20 series reportedly discontinued in India ahead of Galaxy S21 release - 91mobiles", "description": "The Samsung Galaxy S20 FE, Galaxy S20, Galaxy S20+ and Galaxy S20 Ultra have been discounted on Samsung's website and Amazon, likely as a stock clearing measure", "url": "https://www.91mobiles.com/hub/samsung-galaxy-s20-series-discontinued-in-india/", "urlToImage": "https://static.hub.91mobiles.com/wp-content/uploads/2021/01/Galaxy-S20-Ulltra.jpg", "publishedAt": "2021-01-19T10:12:33Z", "content": "Samsung Galaxy S20, Galaxy S20+, and Galaxy S20 Ultra have are listed as out of stock on the official Samsung India website.\r\nSamsung Galaxy S20, Galaxy S20+, and Galaxy S20 Ultra have seemingly been… [+1481 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Sagar", "title": "Motorola Moto G30 bags NBTC certification - GSMArena.com news - GSMArena.com", "description": "It's rumored to sport a 90Hz HD+ screen and a 64MP camera.", "url": "https://www.gsmarena.com/motorola_moto_g30_nbtc_certified-news-47276.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/20/12/motorola-capri-plus-nio-geekbench/-476x249w4/gsmarena_001.jpg", "publishedAt": "2021-01-19T08:49:01Z", "content": "The Motorola Capri Plus spotted on Geekbench last month with model designation XT2129 has been certified by Thailand's NBTC, which revealed the smartphone will be launched as the Moto G30.\r\nThe listi… [+464 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Petrol price breaches ₹85 mark for first time in Delhi, nears ₹92 in Mumbai - HT Auto", "description": "Petrol and diesel prices were hiked by 25 paise per litre each on Monday as well.", "url": "https://auto.hindustantimes.com/auto/news/petrol-price-breaches-rs-85-mark-for-first-time-in-delhi-nears-rs-92-in-mumbai-41611045400869.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2021/01/19/600x338/PTI23-06-2020_000121A_1592967187496_1611045460382.jpg", "publishedAt": "2021-01-19T08:39:07Z", "content": "Petrol price on Tuesday breached the 85 a litre mark in the national capital and diesel neared record high after rates were raised for the second consecutive day.\r\nPetrol and diesel prices were hiked… [+1809 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "30% hospitalized in England with virus were readmitted within five months: Study - WION", "description": "According to a study, around 30 per cent of those hospitalized with coronavirus in England were readmitted for treatment within five months of their first release.", "url": "https://www.wionews.com/world/30-hospitalized-in-england-with-virus-were-readmitted-within-five-months-study-357680", "urlToImage": "https://www.wionews.com/sites/default/files/styles/story_page/public/2020/04/24/137890-coronavirushospitalindexafp.jpg, UK\" typeof=\"foaf:Image\" />", "publishedAt": "2021-01-19T08:19:15Z", "content": "According to a study, around 30 per cent of those hospitalized with coronavirus in England were readmitted for treatment within five months of their first release.\r\nThe study found  \"COVID-19 hospita… [+1451 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Yash Tripathi", "title": "SpaceXs 1st 2021 launch scheduled for Jan 20: Heres all you need to know about it - Republic World", "description": "SpaceX is going to launch its first mission of 2021 on January 20, 2021. Here is all you need to know about all SpaceX Cape Canaveral Launches in Jan 2021. Read", "url": "https://www.republicworld.com/technology-news/science/spacexs-1st-2021-launch-scheduled-for-jan-20-heres-all-you-need-to-know-about-it.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/o1wu4jnjado1ngck_1611039161.jpeg?tr=f-jpeg", "publishedAt": "2021-01-19T08:08:00Z", "content": "SpaceX is undoubtedly amongst the most popular private space agencies in the world. Last time, the Elon Musk organisation launched 60 Starlink satellites into space making it more than a 1000 satelli… [+2678 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Nasa shares Chandra X-ray image of dazzling supernova - India Today", "description": "Nasa shared an image of a supernova captured by the Chandra X-ray Observatory and said the telescope captured a bright source of light at the center of the supernova.", "url": "https://www.indiatoday.in/science/story/nasa-shares-chandra-x-ray-image-of-dazzling-supernova-1760535-2021-01-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/1_770_0-647x363.jpeg?0sBXROQCwCkkSQlG.vQoep2XiC_w4vxZ", "publishedAt": "2021-01-19T08:03:53Z", "content": "The National Aeronautics and Space Administration (Nasa) has shared a dazzling image of a supernova captured by the Chandra X-ray Observatory telescope. Nasa shared the image of the supernova on its … [+1032 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covishield not to be taken by people severely allergic to any of its ingredients: Serum Institute - ETHealthworld.com", "description": "According to the fact sheet for the vaccine recipient by the Serum Institute of India, one should not get the Covishield vaccine if the person had a severe allergic reaction after a previous dose of this vaccine.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covishield-not-to-be-taken-by-people-severely-allergic-to-any-of-its-ingredients-serum-institute/80343206", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-80343206,imgsize-797955,width-800,height-434,overlay-ethealthworld/covishield-not-to-be-taken-by-people-severely-allergic-to-any-of-its-ingredients-serum-institute.jpg", "publishedAt": "2021-01-19T07:30:04Z", "content": "NEW DELHI: People who are severely allergic to any ingredient of the Covid-19 vaccine 'Covishield' are advised not to take it, Serum Institute of India said.According to the fact sheet for the vaccin… [+1665 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "Dunzo lands $40 million in funding from new and existing investors - Economic Times", "description": "Dunzo said it plans to focus on sustainable growth across its fastest-growing cities such as Mumbai, Chennai, and Pune in the coming year.", "url": "https://economictimes.indiatimes.com/tech/funding/dunzo-lands-40-million-in-funding-from-new-and-existing-investors/articleshow/80343050.cms", "urlToImage": "https://img.etimg.com/thumb/msid-80343049,width-1070,height-580,imgsize-74409,overlay-ettech/photo.jpg", "publishedAt": "2021-01-19T07:16:00Z", "content": "Hyperlocal delivery startup Dunzo has raised $40 million in Series E funding from new and existing investors including Google, Lightbox, Evolvence, Hana Financial Investment, LGT Lightstone Aspada, a… [+1413 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Rashmika Mandanna Cheers for Vijay Deverakonda's Liger First Look: All the Bestest My Sweet Beasts - News18", "description": "The first look of Vijay Deverakonda's pan-India film Liger released on Monday, creating waves on the internet.", "url": "https://www.news18.com/news/movies/rashmika-mandanna-cheers-for-vijay-deverakondas-liger-first-look-all-the-bestest-my-sweet-beasts-3310244.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611029429_vijay-deverakonda-rashmika-mandanna.jpg", "publishedAt": "2021-01-19T04:12:03Z", "content": "The first look of Vijay Deverakonda's pan-India film Liger released on Monday, creating waves on the internet. The Telugu star is seen in fierce look on the poster. Besides his fans, his Dear Comrade… [+1607 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "Explained: How China is using COVID-19 vaccine as a political tool - Zee News", "description": "The world kept battling with a new SARS-like virus throughout the 2020, that began in Wuhan, China. The virus that was named COVID-19 by the World Health Organisation has since disrupted the normal every day, claimed 1.9 million lives and devastated trade.", "url": "https://zeenews.india.com/world/covid-19-vaccine-a-political-tool-for-china-2336604.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/01/19/911394-covid-vaccine-1.jpg", "publishedAt": "2021-01-19T04:00:21Z", "content": "The world kept battling with a new SARS-like virus throughout the 2020, that began in Wuhan, China. The virus that was named COVID-19 by the World Health Organisation has since disrupted the normal e… [+9149 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Wuhan Scientists Say They Were Bitten By Coronavirus Infected Bats While Collecting Samples - News18", "description": "Scientists of a laboratory in Wuhan in China, where the cases were first Covid-19 cases and the Covid-19 pandemic has been theorized to have originated, in a new video, revealed that they had been bitten by bats who may have been infected.", "url": "https://www.news18.com/news/buzz/wuhan-scientists-say-they-were-bitten-by-coronavirus-infected-bats-while-collecting-samples-3309533.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1611026304_untitled-design.png", "publishedAt": "2021-01-19T03:15:00Z", "content": "Scientists of a laboratory in Wuhan in China, where the cases were first Covid-19 cases and the Covid-19 pandemic has been theorized to have originated, in a new video, revealed that they had been bi… [+2363 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "The Quint", "title": "Centre Postpones 10th Round of Talks with Farmer Leaders to 20 Jan - The Quint", "description": "The tenth round of talks will be held at 2pm on Wednesday, 20 January at Vigyan Bhavan.", "url": "https://www.thequint.com/news/india/centre-postpones-10th-round-of-talks-with-farmer-leaders-to-20-jan", "urlToImage": "https://images.thequint.com/thequint%2F2021-01%2Fdb69936b-32d1-48c6-913d-a7d565a94405%2F13011_pti01_13_2021_000274b.jpg?rect=0%2C0%2C3535%2C1856&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-01-19T03:10:09Z", "content": "So far, the previous talks have not reached any conclusion since the protesting farmers have continued to call for a complete repeal of the new agriculture laws and the government has not yet agreed … [+921 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Boney Kapoor confirms Khushi Kapoor to make acting debut soon: ‘She will be launched by someone I respect’ - Hindustan Times", "description": "Boney Kapoor has confirmed there will soon be an announcement about his younger daughter Khushi's acting debut. He, however, made it clear that he would not launch her himself.", "url": "https://www.hindustantimes.com/entertainment/bollywood/boney-kapoor-confirms-khushi-kapoor-to-make-acting-debut-soon-101611020676064.html", "urlToImage": "https://images.hindustantimes.com/img/2021/01/19/550x309/khushi_kapoor_1611022294559_1611022305526.jpg", "publishedAt": "2021-01-19T02:27:17Z", "content": "Khushi Kapoor, daughter of producer Boney Kapoor and late actor Sridevi, is all set to follow in the footsteps of her mother and elder sister Janhvi Kapoor. Boney has confirmed that Khushi is interes… [+1719 chars]"}, {"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "Motion capture of Prabhas and Saif Ali Khan starrer Adipurush starts today - Bollywood Hungama", "description": "Motion capture of Prabhas and Saif Ali Khan starrer Adipurush starts today. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at Bolly…", "url": "https://www.bollywoodhungama.com/news/bollywood/motion-capture-of-prabhas-and-saif-ali-khan-starrer-adipurush-starts-today/", "urlToImage": "https://stat2.bollywoodhungama.in/wp-content/uploads/2021/01/Motion-capture-of-Prabhas-and-Saif-Ali-Khan-starrer-Adipurush-starts-today.jpg", "publishedAt": "2021-01-19T01:45:42Z", "content": "Adipurush has been making the right noise ever since it was announced last year. Directed by Om Raut, the film is based on the Hindu epic of Ramayan. The film stars Prabhas as Lord Ram and Saif Ali K… [+2716 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 14: Devoleena Bhattacharjee enters the house; tells Rahul Vaidya 'if you are the king of BB, Ru - Times of India", "description": "Bigg Boss 14 contestant Eijaz Khan had to leave the house owing to his prior commitments. TV actress and BB 13 cont", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-14-devoleena-bhattacharjee-enters-the-house-tells-rahul-vaidya-if-you-are-the-king-of-bb-rubina-is-the-queen-and-i-cant-see-the-king-anymore/articleshow/80337912.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-80337949,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-191150/80337949.jpg", "publishedAt": "2021-01-19T01:30:00Z", "content": "The upcoming episode of Bigg Boss 14 will see Rahul Vaidya and Rubina Dilaik get into a heated argument. The series of their fights continue, and amid this, Rahul verbally attacks her husband Abhinav… [+147 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "'How to make COVID vaccine at home': That's what Indians Googled after vaccination drive started - Times Now", "description": "While the vaccination drive was welcomed by Indians on social media, searches revealed a lot of people browsed the internet in hopes of making their own DIY vaccine.", "url": "https://www.timesnownews.com/the-buzz/article/how-to-make-covid-vaccine-at-home-thats-what-indians-googled-after-vaccination-drive-started/708829", "urlToImage": "https://imgk.timesnownews.com/story/SEARCH.png?tr=w-560,h-292,fo-top", "publishedAt": "2021-01-18T15:05:00Z", "content": "For the better part of 2020, the most searched query on Google was 'How to make COVID vaccine at home'.\r\nConsidering the surge in cases every day in 2020, it was natural that millions around the worl… [+2123 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Sharmishte Datti", "title": "NASA Ignites Moon Rocket For Crucial Tests; Lookout For Heavy-Lift Rockets Alternatives - Gizbot", "description": "NASA has been working on sending humans to the Moon once again, in an ambitious mission that further extends to launch astronauts to Mars. The NASA deep space exploration rocket, constructed by Boeing, began its first test.", "url": "https://www.gizbot.com/news/nasa-ignites-moon-rocket-for-crucial-tests-lookout-for-heavy-lift-rockets-alternatives-072148.html", "urlToImage": "https://www.gizbot.com/img/2021/01/nasa-ignites-moon-rocket-for-crucial-tests-lookout-for-heavy-lift-rockets-alternatives-1610953635.jpg", "publishedAt": "2021-01-18T07:10:42Z", "content": "NASA has been working on sending humans to the Moon once again, in an ambitious mission that further extends to launch astronauts to Mars. The NASA deep space exploration rocket, constructed by Boein… [+2430 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "'Lunch, Really?': Tennis Stars in Quarantine in Australia Slam Hotel Food, Order Meals from Outside - News18", "description": "Australian Open tournament is set to be begin from February 8 even though the players forced into hard quarantine in Melbourne are angry.", "url": "https://www.news18.com/news/buzz/lunch-really-tennis-stars-in-quarantine-in-australia-slam-hotel-food-order-meals-from-outside-3306629.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/01/1610952382_untitled-design-49.png", "publishedAt": "2021-01-18T07:00:00Z", "content": "Australian Open tournament is set to be begin from February 8 even though the players forced into hard quarantine in Melbourne are angry. At least four participants of the tournament have tested posi… [+2397 chars]"}]}