{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Gary Neville and Jamie Carragher will agree with this brilliant Aston Villa claim - Birmingham Live", "description": "The Sky Sports legend was asked about Villa's famous old stadium and agreed with his co-commentator's thoughts", "url": "https://www.birminghammail.co.uk/sport/football/football-news/gary-neville-jamie-carragher-agree-18121682", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article15490816.ece/ALTERNATES/s1200/0_JS169829495.jpg", "publishedAt": "2020-04-21T04:40:22Z", "content": "Martin Tyler has become the latest member of Sky Sports' commentating team to heap praise on Villa Park.\r\nWith Premier League football returning to B6 this season, Tyler &amp; Co. have enjoyed watching Aston Villa.\r\nThe Sky cameras were at Villa's famous old … [+1974 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Gary Neville \"overwhelms\" non-league club Brighouse Town with generous donation - Mirror Online", "description": "The former Manchester United defender formed an emotional bond with the club after they faced his Salford City in the last match he watched with his late father", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-overwhelms-non-league-21898385", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21391669.ece/ALTERNATES/s1200/1_Manchester-City-v-Liverpool-FC-Premier-League.jpg", "publishedAt": "2020-04-21T03:47:05Z", "content": "Gary Neville has left non-league club Brighouse Town \"overwhelmed\" after pledging a significant donation to the non-league side amid the coronavirus chaos. \r\nThe BetVictor Northern Premier League side have seen their season cancelled after the pandemic ended … [+1826 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "John Cross", "title": "Premier League club calculates number of people needed to stage behind-closed-doors game - Mirror Online", "description": "Premier League sides are preparing for matches to return behind closed doors - and one club has calculated the number of people it would require to stage a match without fans", "url": "https://www.mirror.co.uk/sport/football/news/premier-league-club-calculates-number-21896804", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21754555.ece/ALTERNATES/s1200/0_Europa-League-Round-of-32-Second-Leg-Manchester-United-v-Club-Brugge.jpg", "publishedAt": "2020-04-21T03:46:53Z", "content": "How many people does it take to stage a football match?\r\nOr more to the point, exactly how many people would actually be in the stadium for a behind-closed-doors game?\r\nThe answer, as far as one club is concerned, is 256 as the Premier League has begun very p… [+3960 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Newcastle United fans are 'gutted' after West Brom transfer revelation - Birmingham Live", "description": "The West Brom striker admitted he was 'close' to completing a deal that would have seen him join the Magpies in 2015", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/newcastle-united-fans-gutted-after-18120500", "urlToImage": "https://i2-prod.birminghammail.co.uk/sport/football/football-news/article17514964.ece/ALTERNATES/s1200/0_GettyImages-1190727058.jpg", "publishedAt": "2020-04-21T03:04:38Z", "content": "Newcastle United fans are days away from the future of their club changing forever.\r\n Mike Ashley's £300m sale to a consortium led by Amanda Staveley's PCP Capital Partners, backed by Saudi Arabia's Public Investment Fund and the Reuben Brothers, is edging cl… [+1508 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Matt Maltby", "title": "Cesc Fabregas names best teammates at Arsenal, Barcelona, Chelsea and Monaco - Mirror Online", "description": "The Spanish star first broke onto the scene as a fresh-faced midfielder at Arsenal in 2003, and has also represented Barcelona, Chelsea and Monaco during a fine career", "url": "https://www.mirror.co.uk/sport/football/news/cesc-fabregas-names-best-teammates-21896335", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21896323.ece/ALTERNATES/s1200/1_Imago-20190113.jpg", "publishedAt": "2020-04-21T02:33:35Z", "content": "It's fair to say Cesc Fabregas has shared a dressing room with the world's best players during his glittering career - and he has lifted the lid on his favourites.\r\n The Spaniard first broke onto the scene as a fresh-faced midfielder at Arsenal 17 years ago, … [+1871 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Three free agents Carlo Ancelotti could sign at Everton as transfer window looms - Liverpool Echo", "description": "There are 57 Premier League players set to be free agents this summer, could these three interest the Toffees?", "url": "https://www.liverpoolecho.co.uk/sport/football/transfer-news/three-free-agents-carlo-ancelotti-18117297", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17643737.ece/ALTERNATES/s1200/0_GettyImages-1201010415.jpg", "publishedAt": "2020-04-21T02:11:22Z", "content": "The summer transfer window is approaching, and Everton could look to free agent market to strengthen their squad.\r\nThe Toffees currently have four players of their own whose deals are due to expire on June 30, although there is doubt over that particular date… [+3095 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Ian Doyle", "title": "Liverpool starting XI that would be recruitment team dream - Liverpool Echo", "description": "Liverpool have shown they don't always have to spend big in the transfer window to succeed", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-starting-xi-would-recruitment-18120887", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18121346.ece/ALTERNATES/s1200/0_GettyImages-1170963318.jpg", "publishedAt": "2020-04-21T00:10:50Z", "content": "For any recruitment team, there's nothing quite as satisfying as a successful free transfer.\r\nSure, there's usual a significant signing on fee. And don't forget about those wages.\r\nBut snapping up a player for no transfer outlay is a fillip for any club, with… [+3093 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Spencer Morgan For Mailonline", "title": "Ole Gunnar Solskjaer 'happy for Manchester United not to spend £200m on Harry Kane' - Daily Mail", "description": "It was revealed on Monday that United are unwilling to spend in the region of Tottenham's valuation of the England striker due to concerns over the financial impact of the coronavirus crisis.", "url": "https://www.dailymail.co.uk/sport/football/article-8238733/Ole-Gunnar-Solskjaer-happy-Manchester-United-not-spend-200m-Harry-Kane.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/23/27420838-0-image-a-26_1587421606630.jpg", "publishedAt": "2020-04-20T22:46:55Z", "content": "Ole Gunnar Solksjaer is reportedly happy with Manchester United not making an effort to compete for the signing of £200m Harry Kane.\r\nIt was revealed on Monday that United are unwilling to spend in the region of Tottenham's valuation of the England striker du… [+1930 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Robin van Persie reflects on \"ruthless\" Louis van Gaal chat that led to Man Utd exit - Mirror Online", "description": "The Manchester United forward didn't see eye-to-eye with his fellow Dutchman towards the end of his time at Old Trafford, and eventually left the club in the summer of 2015", "url": "https://www.mirror.co.uk/sport/football/news/robin-van-persie-reflects-ruthless-21898707", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21898700.ece/ALTERNATES/s1200/0_Cambridge-United-v-Manchester-United-FA-Cup-Fourth-Round.jpg", "publishedAt": "2020-04-20T22:41:33Z", "content": "Robin van Persie says he was forced out of Manchester United by Louis van Gaal, and admits that he was affected by the manner of his abrupt departure.\r\n The Dutchman picked up the Premier League title in his first season at Old Trafford after joining from Ars… [+2594 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Matt Gault", "title": "Arsenal's forgotten £11m signing ready to shake up Mikel Arteta's plans and prove his worth - Football.London", "description": "The Egyptian spent a year on the fringes at Arsenal before being sent on loan to Besiktas, but the midfielder will return in the summer with his future uncertain", "url": "https://www.football.london/arsenal-fc/news/mohamed-elneny-arsenal-mikel-arteta-18118646", "urlToImage": "https://i2-prod.football.london/incoming/article18122274.ece/ALTERNATES/s1200/0_GettyImages-1196737909.jpg", "publishedAt": "2020-04-20T22:40:27Z", "content": "While he arrived in the middle of the season at a modest £11m, Arsenal quietly had high hopes for Mohamed Elneny. \r\nBrought to the club by Arsene Wenger in January 2016, the Egyptian was seen as something the Gunners needed: a tactically astute, technically s… [+3940 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Craig Swan", "title": "Leeann Dempster urges patience over Celtic title call as Hibs chief insists season can be finished - Daily Record", "description": "The Hibs chief executive insists the possiblity of games being played later in the season must be explored before calling it.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/leeann-dempster-urges-patience-over-21898235", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article20716569.ece/ALTERNATES/s1200/0_11533835.jpg", "publishedAt": "2020-04-20T22:04:43Z", "content": "Leeeann Dempster is adamant there is no need to rush a decision on calling the Premiership.\r\nThe Hibs chief executive believes every option must be explored while the opportunity remains to play the games later in the year.\r\nUEFA meet on Thursday and, having … [+2807 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Joseph Chapman", "title": "Slaven Bilic makes reluctant admission as West Brom and Leeds United await key call - Birmingham Live", "description": "Albion boss Slaven Bilic warns it'd be a disaster if the Baggies weren't permitted to complete their campaign", "url": "https://www.birminghammail.co.uk/sport/football/football-news/brom-bilic-leeds-coronavirus-promotion-18119931", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article17883284.ece/ALTERNATES/s1200/0_Slaven-Bilic.jpg", "publishedAt": "2020-04-20T21:35:55Z", "content": "Slaven Bilic admits that the atmosphere of behind closed doors football magnifies the significance of having supporters packing out stadiums - but he accepts that it is footballs only chance of completing the campaign.\r\n The West Brom boss has experienced foo… [+2389 chars]"}, {"source": {"id": null, "name": "Thecelticstar.com"}, "author": "Lubo98", "title": "More away games for Celtic as Livi announce support for Premiership reconstruction plan - The Celtic Star", "description": "Livingston have backed proposals to create 14-team top flight next season, which would increase Celtic's potential away venues with two new teams being included in the league next season. The Wes", "url": "https://thecelticstar.com/more-away-games-for-celtic-as-livi-announce-support-for-premiership-reconstruction-plan/", "urlToImage": "https://icdn.thecelticstar.com/wp-content/uploads/2020/03/SPFL_LIVINGSTON_CELTIC_1034.jpeg", "publishedAt": "2020-04-20T21:31:32Z", "content": "Livingston have backed proposals to create 14-team top flight next season, which would increase Celtics potential away venues with two new teams being included in the league next season.\r\nThe West Lothian club have moved to support calls by Hearts to increase… [+3202 chars]"}, {"source": {"id": null, "name": "Justarsenal.com"}, "author": "Admin Martin", "title": "Jose Mourinho makes two Arsenal targets his transfer priority - Just Arsenal News", "description": "Two Arsenal summer targets, Issa Diop and Raul Jimenez have become priority signings for Tottenham manager Jose Mourinho claims FootMercato. The Portuguese manager has seen his team struggle in defence and their attack this season, and he is determined to cha…", "url": "https://www.justarsenal.com/jose-mourinho-makes-two-arsenal-targets-his-transfer-priority/242371", "urlToImage": "https://icdn.justarsenal.com/wp-content/uploads/2020/03/diop.jpg", "publishedAt": "2020-04-20T21:30:24Z", "content": "Two Arsenal summer targets, Issa Diop and Raul Jimenez have become priority signings for Tottenham manager Jose Mourinho, claims FootMercato.\r\nThe Portuguese manager has seen his team struggle in defence and their attack this season, and he is determined to c… [+1234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Are we getting too carried away with Manchester United's Bruno Fernandes? | Premier League - ESPN UK", "description": "ESPN FC’s Stewart Robson and Julien Laurens join Dan Thomas to examine the impact Portuguese midfielder Bruno Fernandes has had at Manchester United since hi...", "url": "https://www.youtube.com/watch?v=CzDXTlEUfpc", "urlToImage": "https://i.ytimg.com/vi/CzDXTlEUfpc/maxresdefault.jpg", "publishedAt": "2020-04-20T21:08:20Z", "content": "ESPN FCs Stewart Robson and Julien Laurens join Dan Thomas to examine the impact Portuguese midfielder Bruno Fernandes has had at Manchester United since his arrival in January. Robson is more cautious about his impressive start to his Man United career, and … [+272 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Milne", "title": "Zlatan Ibrahimovic's ex-teammate lifts lid on star's turbulent spell at LA Galaxy - Mirror Online", "description": "The Swedish legend spent a year-and-a-half playing for the MLS team and enjoyed a prolific spell after netting 53 goals in 58 games in all competitions", "url": "https://www.mirror.co.uk/sport/football/news/zlatan-ibrahimovics-ex-teammate-lifts-21894612", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21119106.ece/ALTERNATES/s1200/0_MLS-Los-Angeles-FC-at-LA-Galaxy.jpg", "publishedAt": "2020-04-20T21:03:44Z", "content": "Zlatan Ibrahimovic's former LA Galaxy teammate Joao Pedro has revealed some colourful tales about the larger-than-life character during his spell at the American club.\r\n Ibrahimovic joined Galaxy from Manchester United in 2018 and enjoyed a generally successf… [+1772 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "John Crace", "title": "How things change – Piers Morgan now the voice of the nation - The Guardian", "description": "Good Morning Britain host providing public service by gunning for perplexed minister", "url": "https://www.theguardian.com/politics/2020/apr/20/how-things-change-piers-morgan-now-the-voice-of-the-nation", "urlToImage": "https://i.guim.co.uk/img/media/e2be36a91da99ae25df302f0829bf9c88dc13409/346_135_3216_1931/master/3216.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=7d164ca5cdc4449f2083c20cc40c22d5", "publishedAt": "2020-04-20T20:53:41Z", "content": "How things change, part one. Not so long ago, Radio 4s Today programme was the governments Public Enemy No 1. A media centre of disinformation that needed to be boycotted preferably shut down completely because it couldnt be trusted to allow ministers to tell… [+5253 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Ben Husband", "title": "Leeds United dealt major blow as club make decision on Wolves transfer target - Birmingham Live", "description": "A number of teams have been linked with the central defender, with Wolves, Liverpool and Man United all credited with an interest", "url": "https://www.birminghammail.co.uk/sport/football/transfer-news/leeds-transfer-news-white-wolves-18121545", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article17013956.ece/ALTERNATES/s1200/0_JS134752697.jpg", "publishedAt": "2020-04-20T20:31:31Z", "content": "Brighton are believed to be determined to hold onto Ben White next summer, despite interest from a number of their Premier League rivals.\r\nThe central defender has shone during a season long loan deal with Leeds United, becoming a central part of Marcelo Biel… [+1451 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Shergold for MailOnline", "title": "Arsenal have slipped further away from England's elite two years on from Arsene Wenger's departure - Daily Mail", "description": "ADAM SHERGOLD: After years of drift and decline on his watch, Arsenal needed Arsene Wenger's departure two years ago today. Yet there's little evidence they're in a better position now.", "url": "https://www.dailymail.co.uk/sport/football/article-8237363/Arsenal-slipped-away-Englands-elite-two-years-Arsene-Wengers-departure.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/15/27421514-0-image-a-84_1587394429488.jpg", "publishedAt": "2020-04-20T20:23:34Z", "content": "The announcement itself could scarcely have been more understated. At 10am on this day precisely two years ago, Arsenal's official Twitter feed posted a link and the two simple words: 'Merci Arsène'.\r\nBeneath what could be described as a stock photograph of t… [+9415 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Alex Milne", "title": "Barcelona accidentally 'leak' Man Utd's new 2020/21 home kit - Mirror Online", "description": "The La Liga giants appeared to make an error by uploading an image of the strip while posting a YouTube video of a game between the two sides on Pro Evolution Soccer", "url": "https://www.mirror.co.uk/sport/football/news/barcelona-accidentally-leak-man-utds-21894046", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21894587.ece/ALTERNATES/s1200/0_GettyImages-1202791567.jpg", "publishedAt": "2020-04-20T20:16:25Z", "content": "Barcelona appear to have inadvertently revealed Manchester United's home kit for next season through a YouTube video.\r\nUnited signed their current kit deal with Adidas back in 2015 for an eye-watering £750m over 10 years, and the strips have generally been a … [+1777 chars]"}, {"source": {"id": null, "name": "Thecelticbhoys.com"}, "author": "Sourav Mahanty", "title": "Chris Sutton makes huge claim about Celtic nine-in-a-row - The Celtic Bhoys", "description": "With it looking likely that Celtic will be coronated as Champions of Scotland once again, Chris Sutton has made a huge claim about what will go down as nin...", "url": "https://thecelticbhoys.com/2020/04/20/chris-sutton-huge-claim-celtic-nine-row/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fthecelticbhoys.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F10%2F474766106-celtic-v-inverness-caledonian-thistle-scottish-premiership.jpg.jpg", "publishedAt": "2020-04-20T20:14:25Z", "content": "After the season was forced into suspension due to the global outbreak of the coronavirus. And it looks like it will have to be concluded as things stand right now as it is unlikely that things will return to normal anytime soon. Thus, it might be the only wa… [+2296 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alex Harris", "title": "Timo Werner Liverpool transfer meetings scheduled with Jurgen Klopp - Express", "description": "Timo Werner is high on Liverpool's transfer wish list ahead of the next window.", "url": "https://www.express.co.uk/sport/football/1271548/Timo-Werner-Liverpool-Transfer-Meetings-Scheduled-Jurgen-Klopp-News-Rumours-Gossip", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1271548.jpg", "publishedAt": "2020-04-20T20:13:35Z", "content": "Werner has a release clause in his contract worth around £50million which is due to expire on June 15.\r\nIn the past, Klopp has spoken to a number of major transfer targets before they make a final decision on their future.\r\nIt was previously reported that the… [+504 chars]"}, {"source": {"id": null, "name": "Atptour.com"}, "author": null, "title": "After Slow Start, Rafael Nadal Grills Roger Federer, Andy Murray on Instagram Live - ATP Tour", "description": "Rafael Nadal's Instagram Live on Monday featured conversations with Roger Federer and Andy Murray.", "url": "https://www.atptour.com/en/news/nadal-federer-murray-instagram-live-april-2020", "urlToImage": "https://www.atptour.com/-/media/images/news/2020/04/20/19/59/nadal-murray-federer-instagram-live-april-2020.jpg", "publishedAt": "2020-04-20T20:05:46Z", "content": "Rafael Nadal has overcome plenty of opponents in his legendary ATP Tour career, but he faced perhaps his toughest one on Monday: technology.\r\nThe Spaniard held a star-filled Instagram Live that included Roger Federer, Andy Murray and Marc Lopez. Nadal laughed… [+5387 chars]"}, {"source": {"id": null, "name": "Football.london"}, "author": "Frederick Clayton", "title": "Tottenham evening headlines as Alan Shearer gives transfer advice to Harry Kane, Son latest - Football.London", "description": "Keep up with all the latest Tottenham Hotspur news with our round-up of all the very latest big stories", "url": "https://www.football.london/tottenham-hotspur-fc/news/tottenham-evening-headlines-kane-son-18121493", "urlToImage": "https://i2-prod.football.london/incoming/article17303647.ece/ALTERNATES/s1200/0_SHEARERJPG.jpg", "publishedAt": "2020-04-20T19:58:38Z", "content": "Here are your Tottenham evening headlines for Monday, April 20.\r\nThe strange thing about Son Heung-Min\r\nStars across the Premier League name Son Heung-min as one of the most dangerous players they've faced, yet for some reason the Tottenham Hotspur attacker i… [+3520 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Daniel Murphy", "title": "Manchester United striker Marcus Rashford provides injury update - Manchester Evening News", "description": "Man Utd star Marcus Rashford has explained how his injury recovery is going during the coronavirus outbreak.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-marcus-rashford-injury-18121715", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18121672.ece/ALTERNATES/s1200/0_GettyImages-1199751790.jpg", "publishedAt": "2020-04-20T19:43:21Z", "content": "Manchester United forward Marcus Rashford has revealed that he is stepping up his recovery from injury, although it's challenging to do so while away from the training ground.\r\nRashford was enjoying his most prolific season for United yet with a return of 19 … [+2194 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Mark Wakefield", "title": "Trent Alexander-Arnold's 'weird' shirt number at Liverpool explained - Liverpool Echo", "description": "The Liverpool full-back has become a fan favourite at Anfield, and supporters will love the story behind his shirt number", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/fascinating-reason-trent-alexander-arnold-18116589", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17486615.ece/ALTERNATES/s1200/0_GettyImages-1190726447.jpg", "publishedAt": "2020-04-20T19:09:25Z", "content": "Trent Alexander-Arnold has many attributes that endear him to the Liverpool faithful, including wearing the number 66 on the back of his shirt. \r\nThe Reds full-back has developed into one of the best in his position in world football, and has already competed… [+3288 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Canada's Alphonso Davies signs new Bayern Munich contract until 2025 - The Guardian", "description": "Bayern Munich defender Alphonso Davies has signed a two-year contract extension, keeping him at the Bundesliga club until June 2025", "url": "https://www.theguardian.com/football/2020/apr/20/canadas-alphonso-davies-signs-new-bayern-munich-contract-until-2025", "urlToImage": "https://i.guim.co.uk/img/media/1bd1b5e23bdb00f73c6bc332ab46e773f6bb2d4e/0_213_6391_3835/master/6391.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=df26c372d5d1159fdbf642823ece4134", "publishedAt": "2020-04-20T18:45:02Z", "content": "Bayern Munich defender Alphonso Davies has signed a two-year contract extension, keeping him at the Bundesliga club until June 2025.\r\nThe Canada international, whose original deal was set to expire in 2023, has established himself as first-choice left-back th… [+1224 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro Sport Reporter", "title": "Arsenal transfer news: Atletico Madrid respond to Gunners' £43.5m Thomas Partey move - Metro.co.uk", "description": "Will it work?", "url": "https://metro.co.uk/2020/04/20/atletico-madrid-offer-double-thomas-parteys-wages-fend-off-arsenal-interest-12584744/", "urlToImage": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2020/03/GettyImages-1207146892_1587405407.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "publishedAt": "2020-04-20T18:30:12Z", "content": "Thomas Partey is a target for Arsenal (Picture: Getty)\r\nAtletico Madrid have offered midfielder Thomas Partey a double-your-money salary offer in a bid to convince the Ghanaian to reject Arsenal.\r\nMikel Arteta is keen on signing the midfielder and the Gunners… [+1512 chars]"}, {"source": {"id": null, "name": "Thecelticbhoys.com"}, "author": "Kade Kistner", "title": "Celtic set to be handed Champions League boost by UEFA - The Celtic Bhoys", "description": "UEFA is expected to back-peddle on their position of leagues declaring champions and making end of season payouts to clubs, giving Celtic a UCL boost. It w...", "url": "https://thecelticbhoys.com/2020/04/20/celtic-handed-champions-league-uefa/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fthecelticbhoys.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1192704389.jpeg", "publishedAt": "2020-04-20T18:19:38Z", "content": "It was not long ago when UEFA declared that leagues who were to prematurely declare their seasons would face stiff consequences. These consequences included not allowing clubs of those league to participate in European competition next year. This would have b… [+2372 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Stan Collymore", "title": "No relegation from Premier League is a nice idea - but it's simply impractical - Mirror Online", "description": "STAN COLLYMORE: If the season is to end incomplete - then Brighton owner Tony Bloom's suggestion not to relegate teams simply will not work", "url": "https://www.mirror.co.uk/sport/football/news/no-relegation-premier-league-nice-21897663", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21880200.ece/ALTERNATES/s1200/0_Wolverhampton-Wanderers-v-Brighton-Hove-Albion-Premier-League-Molineux.jpg", "publishedAt": "2020-04-20T17:59:24Z", "content": "Brighton owner Tony Blooms suggestion that no clubs should be relegated from the Premier League this season is noble.\r\nAnd regular readers will know that when Covid-19 first arrived on these shores I was thinking along the same lines.\r\nThat we could promote L… [+2841 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Premier League football stars face off in a weeklong virtual tournament - Engadget", "description": "With both traditional and esports adjusting their schedules due to COVID-19, England’s Premier League announced a new, hybrid tournament, the ePremiere League Invitational, in which football stars and celebrity fans will test their esports abilities in a five…", "url": "https://www.engadget.com/epremiere-leauge-invitational-esports-tournament-163016038.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-04%2F64b89800-8321-11ea-aff4-dfdbf3ed810f&client=amp-blogside-v2&signature=50afca21b35099e1f61165d03367a969c4b48eb8", "publishedAt": "2020-04-20T17:08:09Z", "content": "With both traditional and esports adjusting their schedules due to COVID-19, England’s Premier League announced a new, hybrid tournament, the ePremiere League Invitational, in which football stars and celebrity fans will test their esports abilities in a five… [+588 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "REPLAYED: Liverpool 2-0 Sheffield United | Salah & Mane start 2020 with a win - Liverpool FC", "description": "Relive the Reds' first game of the new year as a controlling performance ensured they continued where they left off in 2019, thanks to a goal in either half ...", "url": "https://www.youtube.com/watch?v=Py1lGbTaOXw", "urlToImage": "https://i.ytimg.com/vi/Py1lGbTaOXw/maxresdefault.jpg", "publishedAt": "2020-04-20T17:00:10Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Man City star David Silva 'in transfer talks' with former club Valencia - Manchester Evening News", "description": "Reports suggest that David Silva is in talks with La Liga giants Valencia over a return to Spain following his departure from Manchester City.", "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/david-silva-man-city-valencia-18121230", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18121235.ece/ALTERNATES/s1200/0_Silva-1202901378.jpg", "publishedAt": "2020-04-20T16:51:41Z", "content": "Manchester City legend David Silva is in talks with Valencia over a return to the club but the deal has been complicated by the coronavirus pandemic - according to reports.\r\nSilva will bring his trophy-laden spell with the Blues to an close at the end of the … [+1047 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daniel Davis For Mailonline", "title": "Manchester United accept defeat in £200m chase for Harry Kane with club unwilling to splash the cash - Daily Mail", "description": "The Old Trafford outfit have been forced to rethink their transfer plans because of the uncertainty provided by the pandemic, with clubs believing that sky-high transfer fees will be off the table for a while.", "url": "https://www.dailymail.co.uk/sport/football/article-8237339/Manchester-United-accept-defeat-200m-chase-Harry-Kane-club-unwilling-splash-cash.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/16/27422094-0-image-a-3_1587395263028.jpg", "publishedAt": "2020-04-20T16:26:09Z", "content": "Manchester United are unwilling to spend £200million to sign Tottenham striker Harry Kane due to concerns over the financial impact of the coronavirus crisis.\r\nThe Old Trafford outfit have been forced to rethink their transfer plans for this summer because of… [+2686 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Kinnersley For Mailonline", "title": "Gareth Bale tops list of SEVEN players to be axed by Real Madrid this summer - Daily Mail", "description": "James Rodriguez, Lucas Vazquez, Mariano Diaz, Alvaro Odriozola, Alphone Areola and Nacho Fernandez will also be shipped out. Zinedine Zidane is hoping to raise £105million.", "url": "https://www.dailymail.co.uk/sport/football/article-8237403/Gareth-Bale-tops-list-SEVEN-players-axed-Real-Madrid-summer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/16/27423692-0-image-a-15_1587397312637.jpg", "publishedAt": "2020-04-20T15:55:28Z", "content": "Gareth Bale will headline a list of seven players to be axed by Real Madrid this summer according to AS. \r\nJames Rodriguez, Lucas Vazquez, Mariano Diaz, Alvaro Odriozola, Alphonse Areola and Nacho Fernandez will also be shipped out.\r\nZinedine Zidane is hoping… [+1670 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nDanielle Demetriou", "title": "Japan virus cases surge despite nationwide state of emergency as doctors warn of hospital crisis - Telegraph.co.uk", "description": "Japanese medics say the healthcare system will soon be overwhelmed unless there is a change in government strategy", "url": "https://www.telegraph.co.uk/news/2020/04/20/japan-virus-cases-surge-despite-nationwide-state-emergency-doctors/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2020/04/20/TELEMMGLPICT000229832113-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfy2dmClwgbjjulYfPTELibA.jpeg?imwidth=1200", "publishedAt": "2020-04-20T15:55:00Z", "content": "Speaking earlier at a press briefing, he said: \"We needed to prepare for once the situation changes, once the cluster-chasing became not effective and we needed to change strategy immediately.\r\n\"But traditionally speaking, and historically speaking, Japan is … [+2174 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Serena Williams' coach Patrick Mouratoglou planning 'risk-free' tennis tournament in May - Sky Sports", "description": "Serena Williams' coach Patrick Mouratoglou wants to host a new tournament that will get tennis back on live TV and help support the sport's lower-ranked players.", "url": "https://www.skysports.com/tennis/news/12110/11976027/serena-williams-coach-patrick-mouratoglou-planning-risk-free-tennis-tournament-in-may", "urlToImage": "https://e2.365dm.com/20/04/1600x900/skysports-patrick-mouratoglou_4972914.jpg", "publishedAt": "2020-04-20T15:54:24Z", "content": "Getting live tennis back on TV and fighting for a more equal distribution of wealth in the sport are two subjects that Serena Williams' coach Patrick Mouratoglou has been thinking a lot about during lockdown.  \r\nProfessional tennis has been on hold since Marc… [+4459 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "'Coronavirus crisis will accelerate the notion of a global golf tour' - BBC Sport", "description": "A significantly changed world with potentially a men's global tour awaits professional golf when it fully returns, according to a leading sports lawyer.", "url": "https://www.bbc.co.uk/sport/golf/52359327", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/1F31/production/_111858970_golfclosed.jpg", "publishedAt": "2020-04-20T15:50:01Z", "content": "Lee Westwood is set to host the British Masters for a second time at Close House in Northumberland in the last week of July - it is the European Tour's next scheduled event\r\nA significantly changed world with potentially a men's global tour awaits professiona… [+5674 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Matt Davies", "title": "PDC Darts Home Tour 2020 results LIVE: Stream, latest scores on Day 4, watch free online and TV channel - Evening Standard", "description": "", "url": "https://www.standard.co.uk/sport/darts-pdc-home-tour-2020-live-stream-results-schedule-latest-score-watch-free-tv-a4419146.html", "urlToImage": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2020/04/19/19/dartsathome1904a.jpg", "publishedAt": "2020-04-20T15:34:10Z", "content": "Welcome to Day 4 of our PDCdarts Home Tour LIVE coverage.\r\nOn Sunday night, Dave Chisnall progressed to the next round after winning group three.\r\nThe 2019 World Championship quarter-finalist sealed his place after a final game 5-1 win over Jonathan Worsley, … [+10424 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Will Griffee For Mailonline", "title": "Oleg Taktarov hits out at 'fools' saying Khabib Nurmagomedov is first Russian UFC champion - Daily Mail", "description": "Oleg Taktarov hit out at 'fools' claiming Khabib Nurmagomedov to be the UFC's first Russian champion and reignited a feud with the MMA superstar's father.", "url": "https://www.dailymail.co.uk/sport/mma/article-8236283/Oleg-Taktarov-hits-fools-saying-Khabib-Nurmagomedov-Russian-UFC-champion.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/10/27410626-0-image-a-33_1587374988980.jpg", "publishedAt": "2020-04-20T15:11:52Z", "content": "Oleg Taktarov hit out at 'fools' claiming Khabib Nurmagomedov to be the UFC's first Russian champion and reignited a feud with the MMA superstar's father. \r\nThe 'Eagle' is reigning lightweight king and remains unbeaten in the octagon but Taktarov believes som… [+2293 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Peter Campbell", "title": "Aston Martin chairman seeks to restart operations - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/232f675c-faf5-49cc-8b02-a375f7deefaa", "urlToImage": null, "publishedAt": "2020-04-20T15:10:19Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncommentary and analysis you can trust."}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "Lionel Messi's ultimate XI named as Luis Suarez and Pedro included in attack - Mirror Online", "description": "We've taken a look at the players Messi has shared a pitch with most often to create the Barcelona and Argentina icon's perfect team - and the most familiar", "url": "https://www.mirror.co.uk/sport/football/news/lionel-messis-ultimate-teammates-xi-21893502", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21893565.ece/ALTERNATES/s1200/0_Spain-Barcelona-Levante-LaLiga-date-22.jpg", "publishedAt": "2020-04-20T14:55:51Z", "content": "For a footballer, it is always important to have confidence in the players that you're entering battle with.\r\nWhile familiarly can sometimes breed contempt, a team's chemistry is often one of the most crucial and unheralded factors that can make it shine. You… [+3972 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Isabelle Barker", "title": "Maguire reveals crucial change behind Man Utd turnaround this season and insists they’ll be challenging for t - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11436878/maguire-man-utd-turnaround-titles/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/MAG.jpg?strip=all&quality=100&w=960&h=639&crop=1", "publishedAt": "2020-04-20T14:29:57Z", "content": "HARRY MAGUIRE has revealed the crucial change behind Manchester United's turnaround this season and insists they will be challenging for titles soon.\r\nBefore the coronavirus crisis KOd this season indefinitely, the Red Devils were on an 11-match unbeaten run … [+4199 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Dan Kay, Chris Beesley, Ian Doyle, Caoimhe O'Neill", "title": "Adam Lallana offers Liverpool on and off field problem but can hold head high - Liverpool Echo", "description": "Liverpool ECHO writers Ian Doyle, Caoimhe O'Neill, Dan Kay and Chris Beesley rate the season of Adam Lallana at Liverpool", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-adam-lallana-problem-head-18114798", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article17518398.ece/ALTERNATES/s1200/0_GettyImages-1197716581-1.jpg", "publishedAt": "2020-04-20T14:22:04Z", "content": "Ian Doyle - 7\r\nIt might come as a surprise to some Liverpool supporters to discover Adam Lallana has made 22 appearances this season.\r\nBut this was always likely to be a campaign where the midfielder confounded expectations.\r\nNot least given, before a competi… [+5213 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Lewis Hamilton 'not trying to move' away from Mercedes - BBC Sport", "description": "Lewis Hamilton says he is \"not trying to move\" away from his Mercedes team in this year's driver market.", "url": "https://www.bbc.co.uk/sport/formula1/52349053", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/3080/production/_111861421_lewishamilton.jpg", "publishedAt": "2020-04-20T14:14:31Z", "content": "Vettel and Hamilton have won 10 F1 world titles between them\r\nLewis Hamilton says he is \"not trying to move\" away from his Mercedes team in this year's driver market.\r\nThe world champion is one of a number of top drivers whose contracts expire at the end of a… [+1834 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "Newcastle takeover: Steve Bruce to be given time to prove himself as manager - Sky Sports", "description": "Newcastle boss Steve Bruce is set to be given until the end of the season at least to prove he is the right manager to guide the club to European football.", "url": "https://www.skysports.com/football/news/11678/11975964/newcastle-takeover-steve-bruce-to-be-given-time-to-prove-himself-as-manager", "urlToImage": "https://e1.365dm.com/20/03/1600x900/skysports-steve-bruce-newcastle_4936422.jpg", "publishedAt": "2020-04-20T13:09:18Z", "content": "Newcastle boss Steve Bruce is set to be given until the end of the season at least to prove he is the right manager to guide the club to European football.\r\nThe Premier League is in the process of ratifying a proposed £300m takeover of the club by Amanda Stav… [+4889 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Charlie Malam", "title": "How Arsenal could line up next season if they sell Aubameyang AND Lacazette this summer - Express", "description": "Express Sport understands Arsenal duo Pierre-Emerick Aubameyang and Alexandre Lacazette are both set to leave the club this coming summer - so how could the Gunners line up next season without them?", "url": "https://www.express.co.uk/sport/football/1271360/How-Arsenal-could-line-up-next-season-if-they-sell-Aubameyang-AND-Lacazette-this-summer", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1271360.jpg", "publishedAt": "2020-04-20T12:31:00Z", "content": null}, {"source": {"id": null, "name": "Manutd.com"}, "author": "Adam Marshall", "title": "Harry Maguire says Manchester United is more than a football club - Manchester United", "description": "Harry Maguire says his decision to join the Reds has been vindicated as he's proud to skipper Ole's side.", "url": "https://www.manutd.com/en/news/detail/harry-maguire-says-manchester-united-is-more-than-a-football-club", "urlToImage": "https://assets.manutd.com/AssetPicker/images/0/0/13/197/902636/IMG_1853_2020031253513624_202003120535471585575658776_large.jpg", "publishedAt": "2020-04-20T12:29:32Z", "content": "In an interview with ex-Red Gary Neville on Sky Sports's The Football Show, the imposing defender was asked if he was happy with the choice he made to switch to Old Trafford during the 2019 close season.\r\nYeah, definitely, Maguire replied. It's such a big clu… [+488 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Neil Reynolds", "title": "Neil Reynolds: Six teams who need a good Draft - Sky Sports", "description": "Sky Sports NFL expert Neil Reynolds picks out six teams in need of success at the 2020 NFL Draft.", "url": "https://www.skysports.com/nfl/news/22876/11975939/neil-reynolds-six-teams-who-need-a-good-draft", "urlToImage": "https://e2.365dm.com/19/12/1600x900/skysports-baker-mayfield-cleveland-browns_4855537.jpg", "publishedAt": "2020-04-20T12:25:10Z", "content": "Sky Sports NFL expert Neil Reynolds picks out six teams in need of success at the 2020 NFL Draft...\r\nThis is the biggest week of the NFL offseason as the annual NFL Draft takes place in Las… erm, across the internet!\r\nThe first virtual draft in NFL history is… [+4783 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nick Ames", "title": "Number of footballers with depression symptoms doubles during shutdown - The Guardian", "description": "The number of footballers reporting symptoms of depression has doubled since the sport shut down due because of Covid-19, a survey by Fifpro has found", "url": "https://www.theguardian.com/football/2020/apr/20/number-of-footballers-with-depression-symptoms-doubles-during-shutdown-survey-fifpro-coronavirus", "urlToImage": "https://i.guim.co.uk/img/media/83570047a0fd31125f9f467aa3f138e6fd69fcd1/0_196_5122_3072/master/5122.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=77dfb14cf051f9120c80d7d2e29e6da4", "publishedAt": "2020-04-20T12:14:48Z", "content": "The number of footballers reporting symptoms of depression has doubled since the sport shut down because of Covid-19, a survey by the global players union, Fifpro, has found. Anxiety symptoms have also risen amid significant concerns about the long-term impac… [+3825 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Marcus Banks", "title": "Raheem Sterling praises Man City teammate Aymeric Laporte after classy gesture - Manchester Evening News", "description": "Manchester City defender Aymeric Laporte has earned praise for an incredible gesture to the father of a late Olympic boxer.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/aymeric-laporte-man-city-news-18117608", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18117726.ece/ALTERNATES/s1200/0_Aymeric-Laporte-gesture.jpg", "publishedAt": "2020-04-20T12:04:30Z", "content": "Manchester City star Aymeric Laporte has been praised for his heartwarming gesture to the father of late Olympic boxer Alexis Vastine.\r\nVastine won a bronze medal during the 2008 Beijing Olympics in the light-welterweight division but sadly died in a helicopt… [+1002 chars]"}, {"source": {"id": null, "name": "Racefans.net"}, "author": "https://www.facebook.com/racefansdotnet/", "title": "The most-needed F1 2019 changes to improve Virtual GPs - RaceFans", "description": "How should F1 2019 change to improve the Virtual GPs? Spectator Mode refinements need to take priority over handling or circuit changes, says Will Wood.", "url": "https://www.racefans.net/2020/04/20/the-most-needed-f1-2019-changes-to-improve-the-virtual-grands-prix/", "urlToImage": "https://www.racefans.net/wp-content/uploads/2020/04/Screenshot-2020-04-20-10.41.08.jpg", "publishedAt": "2020-04-20T11:30:00Z", "content": "Formula 1s power units have fallen silent and their virtual equivalent has taken over. The 2020 season will be remembered as a year of unprecedented disruption when motorsports biggest names turned to their sim rigs to keep fans – and themselves – entertained… [+8461 chars]"}, {"source": {"id": null, "name": "Vitalfootball.co.uk"}, "author": "Gavin Kelly", "title": "Report – Celtic fans forced into a corner by board as “critical situation” revealed by Hampden source - Vitalfootball", "description": "An article in The Daily Record claims to have inside information on the financial crisis facing Scottish football should the coronavirus pandemic continue to have a devastating effect on the national", "url": "https://celtic.vitalfootball.co.uk/report-celtic-fans-forced-into-a-corner-by-board-as-critical-situation-revealed-by-hampden-source/", "urlToImage": "https://cdn.vitalfootball.co.uk/wp-content/uploads/sites/265/2018/08/General-view-of-Celtic-fans-1024x648.jpg", "publishedAt": "2020-04-20T11:15:00Z", "content": "An article in The Daily Record claims to have inside information on the financial crisis facing Scottish football should the coronavirus pandemic continue to have a devastating effect on the national game.\r\nA source within the SFA told the paper that there is… [+2191 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Premier League relegation: Who's been best worst team? - BBC Sport", "description": "Chris Sutton has billed Norwich City as the best team to be bottom of the Premier League - who else can compete for the title?", "url": "https://www.bbc.co.uk/sport/football/52328974", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/166E3/production/_111857819_bottom.jpg", "publishedAt": "2020-04-20T11:02:05Z", "content": "The Premier League is on hold, indefinitely, along with most of the rest of the world.\r\nWhen - if - it does resume, Norwich City will be the side propping up the rest of the Premier League.\r\nThe Canaries' haul of 21 points from their 29 games so far may not t… [+8189 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Inside Mohammed Bin Salman’s stunning £230m chateau – ‘world’s most expensive house’ – complete with Bond-styl - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11403376/mohammed-bin-salman-house-newcastle/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/SPORT-PREVIEW-Chateau-Louis-XIV.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-20T10:45:39Z", "content": "THE Crown Prince of Saudi Arabia Mohammed Bin Salman is on the verge of buying Newcastle United after having a £300million bid accepted by owner Mike Ashley.\r\nIncredibly though, that's only £70m more than he paid for the world's most expensive house.\r\n The Cr… [+4566 chars]"}, {"source": {"id": null, "name": "Sunderlandecho.com"}, "author": "Mark Donnelly", "title": "Government secretary has a stern message for Mike Ashley and Newcastle United - Sunderland Echo", "description": "Culture secretary Oliver Dowden has warned football clubs utilising the government’s job retention scheme that the public will take a ‘dim view’ of their actions.", "url": "https://www.sunderlandecho.com/sport/football/sunderland-afc/government-secretary-has-stern-message-mike-ashley-and-newcastle-united-2543509", "urlToImage": "https://www.sunderlandecho.com/webimg/b25lY21zOmI4NjE1YTExLTZhNWYtNDE0ZC05YTFlLTUyYzllNjBjMmY3NjoxNGUzZjM1Ni1kYWI1LTRlZjktOTNhOC01NTQwYjg3YjAyZGY=.jpg", "publishedAt": "2020-04-20T10:30:00Z", "content": "Newcastle United have been warned about using the government's job retention scheme Copyright: Getty Images\r\nNewcastle United placed a number of staff on furlough leave last month, with Tottenham and Liverpool having done similar before retracing their decisi… [+1741 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "World Rugby to investigate Fiji chairman over homophobia allegations - BBC Sport", "description": "World Rugby begins an investigation into the chairman of the Fiji Rugby Union, which has backed Sir Bill Beaumont's bid for re-election as boss of the world game.", "url": "https://www.bbc.co.uk/sport/rugby-union/52346900", "urlToImage": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/13B87/production/_111857708_world_rugby1_getty.jpg", "publishedAt": "2020-04-20T10:17:32Z", "content": "The Fiji Rugby Union has backed Sir Bill Beaumont's bid for re-election as boss of the world game.\r\nWorld Rugby has begun an investigation into the chairman of the Fiji Rugby Union (FRU), which has backed Sir Bill Beaumont's bid for re-election as boss of the… [+1817 chars]"}, {"source": {"id": null, "name": "Walesonline.co.uk"}, "author": "Anthony Woolford", "title": "Morning rugby headlines as Six Nations criticised apart from Wales - Wales Online", "description": "The latest rugby stories from Wales and around the world on Monday, April 20", "url": "https://www.walesonline.co.uk/sport/rugby/rugby-news/morning-rugby-headlines-agustin-pichot-18116134", "urlToImage": "https://i2-prod.walesonline.co.uk/incoming/article15443423.ece/ALTERNATES/s1200/1_JS96071200-2.jpg", "publishedAt": "2020-04-20T08:30:25Z", "content": "Here's the morning rugby headlines for Monday, April 20.\r\nWelsh Rugby Union only country among Six Nations to reply to Agustin Pichot email\r\nAgustin Pichot has revealed the Welsh Rugby Union is the only organisation from the Six Nations countries to reply to … [+5122 chars]"}, {"source": {"id": null, "name": "Boxingscene.com"}, "author": null, "title": "Haye: Joshua is Only One Who Has The Tools To Beat Fury - BoxingScene.com", "description": "Former two division world champion David Haye views Anthony Joshua as the only boxer in the heavyweight division, at least at the moment, who is capable of unseating Tyson Fury. Back in February, Fury elevated himself to the number spot in the weight class, w…", "url": "https://www.boxingscene.com/haye-joshua-only-one-who-tools-beat-fury--148393", "urlToImage": "https://photo.boxingscene.com/uploads/anthony-joshua%20(23)_6.jpg", "publishedAt": "2020-04-20T08:06:54Z", "content": "Former two division world champion David Haye views Anthony Joshua as the only boxer in the heavyweight division, at least at the moment, who is capable of unseating Tyson Fury.\r\nBack in February, Fury elevated himself to the number spot in the weight class, … [+2059 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Oliver Connolly", "title": "Is the positionless Isaiah Simmons a glimpse of the NFL's future? - The Guardian", "description": "The Clemson star can play almost anywhere on defense. He’s a perfect fit as teams adapt to offenses built on speed and versatility", "url": "https://www.theguardian.com/sport/2020/apr/20/isaiah-simmons-nfl-draft-football-clemson", "urlToImage": "https://i.guim.co.uk/img/media/3287822adbc6697bfd698ecee5da4f2a93e21f8e/0_213_4311_2587/master/4311.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ee31a8c29b2a6681d5c4da2a5dc869bf", "publishedAt": "2020-04-20T08:00:00Z", "content": "If you listen hard enough, you can hear 32 NFL defensive coordinators cajoling their respective teams to grab Isaiah Simmons in this weeks draft.\r\nSimmons is not merely among the best defensive player in the class, hes an embodiment of the evolution of the sp… [+5644 chars]"}, {"source": {"id": null, "name": "Skysports.com"}, "author": "Sky Sports", "title": "British GP: Silverstone open to hosting two F1 races without fans - Sky Sports", "description": "Silverstone would be willing to host an unprecedented two successive grands prix without spectators.", "url": "https://www.skysports.com/f1/news/12433/11975749/british-gp-silverstone-open-to-hosting-two-f1-races-without-fans", "urlToImage": "https://e0.365dm.com/20/01/1600x900/skysports-f1-silverstone-start_4888080.jpg", "publishedAt": "2020-04-20T07:50:56Z", "content": "Silverstone would be willing to host an unprecedented two successive grands prix without spectators to help Formula 1 fight back from the coronavirus crisis, according to circuit boss Stuart Pringle.\r\nPringle told Sky Sports earlier this month that Silverston… [+2100 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Keith Jackson", "title": "The real storm facing Scottish football as clubs squabble - Jackson - Daily Record", "description": "The coronavirus shutdown could kill Scottish football.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/spfl-restructure-squabbling-insignificant-compared-21892492", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article21686888.ece/ALTERNATES/s1200/1_19820613.jpg", "publishedAt": "2020-04-20T06:13:15Z", "content": "Scottish football continues to gorge on itself while the real world is hooked up to a ventilator, fighting for its life.\r\nHearts chief Ann Budge may just have become the first owner in history to re-relegate her own her club. Rangers are throwing mud and aspe… [+4997 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Chris Beesley", "title": "Liverpool news and transfers LIVE - Jadon Sancho latest - Liverpool Echo", "description": "Latest Liverpool news and transfer rumours", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-live-transfer-news-david-18115937", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18118464.ece/ALTERNATES/s1200/0_GettyImages-1204103209.jpg", "publishedAt": "2020-04-20T06:01:48Z", "content": "Many Liverpool stars choose to wear shirts associated with Kop Idols of the past but Trent Alexander-Arnold is proving to be a one off by still sporting the number 66 jersey.Speaking on the club's website, Lee Radcliffe, Liverpool's kit management co-ordinato… [+955 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Chris Beesley", "title": "Liverpool news and transfers LIVE - Jadon Sancho latest, Timo Werner update, Alisson injury latest - Liverpool Echo", "description": "Latest Liverpool news and transfer rumours", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-live-transfer-news-david-18115937", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18118464.ece/ALTERNATES/s1200/0_GettyImages-1204103209.jpg", "publishedAt": "2020-04-20T06:01:48Z", "content": "Many Liverpool stars choose to wear shirts associated with Kop Idols of the past but Trent Alexander-Arnold is proving to be a one off by still sporting the number 66 jersey.Speaking on the club's website, Lee Radcliffe, Liverpool's kit management co-ordinato… [+955 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Pattle", "title": "Michael Jordan documentary The Last Dance comes up clutch - The Independent", "description": "Jason Hehir’s new series on ESPN and Netflix is an enthralling exposé of the Chicago Bulls’ dramatic 1997-98 NBA season", "url": "https://www.independent.co.uk/arts-entertainment/tv/reviews/michael-jordan-documentary-the-last-dance-netflix-espn-series-release-date-a9470626.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2011/11/01/14/21jordan.jpg", "publishedAt": "2020-04-20T05:43:18Z", "content": "In the 1990s, Michael Jordan was arguably the most famous human being on the planet. At the height of his powers and that was quite some height and those were quite some powers he was the face of not only the Chicago Bulls, but basketball as a whole. The icon… [+2906 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jack Otway", "title": "Man Utd boss Ole Gunnar Solskjaer could sell three Sir Alex Ferguson favourites in summer - Express.co.uk", "description": "Manchester United boss Ole Gunnar Solskjaer could offload the final servants of Sir Alex Ferguson's reign.", "url": "https://www.express.co.uk/sport/football/1271085/Manchester-United-transfer-news-Ole-Gunnar-Solskjaer-Sir-Alex-Ferguson-Jones-Smalling", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/67/750x445/1271085.jpg", "publishedAt": "2020-04-20T05:15:00Z", "content": "This summer is sure to be an important phase in Ole Gunnar Solskjaer’s Manchester United rebuild. The Red Devils are keen to make a splash when the transfer window reopens, with the likes of Jadon Sancho, Jack Grealish and Jude Bellingham all on their radar. … [+1649 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Tyrone Marshall", "title": "Two Manchester United players can respond to Wayne Rooney challenge - Manchester Evening News", "description": "Wayne Rooney holds a record at Man Utd that he doesn't expect to be beaten for a long time, which could serve as a challenge to the current squad.", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-news-rooney-goals-18114835", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article18024945.ece/ALTERNATES/s1200/0_JS99571833.jpg", "publishedAt": "2020-04-20T05:04:16Z", "content": "It took 44 years for a Manchester United player to break the goalscoring record Sir Bobby Charlton had set, his 249 goals for the club setting a benchmark that proved impossible for every brilliant forward that had graced Old Trafford until Wayne Rooney's com… [+3630 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mark Jones", "title": "James Rodriguez told to make Man Utd transfer this summer - Mirror Online", "description": "The Colombian is again being linked with a switch to the Premier League and seems certain to leave Real Madrid on a permanent deal this summer", "url": "https://www.mirror.co.uk/sport/football/transfer-news/james-rodriguez-told-make-man-21893456", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21794981.ece/ALTERNATES/s1200/0_Real-Madrid-v-Real-Valladolid-La-Liga.jpg", "publishedAt": "2020-04-20T01:39:53Z", "content": "James Rodriguez should hold out for a move to Manchester United this summer, according to his fellow Colombian Faustino Asprilla.\r\n The attacking midfielder returned to Real Madrid from a two-year loan at Bayern Munich at the beginning of this season, althoug… [+1629 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Jacob Murtagh", "title": "Wayne Rooney weighs in on Lionel Messi vs Cristiano Ronaldo debate - Mirror Online", "description": "Manchester United legend Wayne Rooney has had his say on the long-running Lionel Messi vs Cristiano Ronaldo debate", "url": "https://www.mirror.co.uk/sport/football/news/wayne-rooney-weighs-lionel-messi-21890769", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21554091.ece/ALTERNATES/s1200/0_UEFA-European-Club-Football-Season-Kick-Off-20192020-UCL-Draw.jpg", "publishedAt": "2020-04-19T19:29:49Z", "content": "Wayne Rooney has picked Lionel Messi above 'killer' Cristiano Ronaldo because the Barcelona star will 'torture' you first. \r\n Rooney played alongside Ronaldo at Manchester United, helping the Red Devils to a hat-trick of Premier League titles before the Portu… [+1801 chars]"}, {"source": {"id": null, "name": "Grimsbytelegraph.co.uk"}, "author": "Sam Atkin, Paige Freshwater", "title": "The full list of key workers who will now get coronavirus tests - Grimsby Live", "description": "The Department of Health and Social Care has elaborated on the list of key workers who will be offered a test", "url": "https://www.grimsbytelegraph.co.uk/news/grimsby-news/full-list-key-workers-who-4059410", "urlToImage": "https://i2-prod.grimsbytelegraph.co.uk/incoming/article4019733.ece/ALTERNATES/s1200/5_Anesthetist-in-operating-theatre.jpg", "publishedAt": "2020-04-19T12:48:00Z", "content": "The full list of key workers who are eligible to be tested for Covid-19 has been revealed.\r\nIt is part of the Governments commitment to test 100,000 people per day by the end of the month.\r\nCurrently, testing can be done at specialist facilities, drive-throug… [+2338 chars]"}]}