{"status": "ok", "totalResults": 53, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Emergence of novel SARS-CoV-2 variants and co-mutations in India - News-Medical.net", "description": "The study \"Genomic surveillance and phylodynamic analyses reveal the emergence of a novel mutation and co-mutation patterns within SARS-CoV2 variants prevalent in India\" is available as a preprint on the bioRxiv* server, while the article undergoes peer revie…", "url": "https://www.news-medical.net/news/20210329/Emergence-of-novel-SARS-CoV2-variants-and-co-mutations-in-India.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/2021.03.25.436930v1.jpg", "publishedAt": "2021-03-30T02:31:00Z", "content": "A new study has uncovered genetic changes in a group of similar severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) variants in India.\r\nThe researchers write:\r\n\"We believe that our report is… [+4592 chars]"}, {"source": {"id": null, "name": "Girlfriend"}, "author": "Faye Couros", "title": "Why you need to take STIs seriously - Girlfriend", "description": "For sex to stay a safe place to experiment and explore your sexuality, it is important to take responsibility for your sexual health.", "url": "https://www.girlfriend.com.au/sexually-transmitted-infection-test", "urlToImage": "http://www.girlfriend.com.au/media/36363/holding.jpg", "publishedAt": "2021-03-30T02:07:22Z", "content": "Taking responsibility for your sexual health will free up brain space.\r\nThe statistics and why STIs are on the rise\r\nIn 2018 the Australian Institute of Health and Welfare reported an increase in rat… [+5586 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Digital Staff", "title": "Enter to win Cadbury’s Dairy Milk ‘Design Your Own Easter Egg’ kits - 7NEWS.com.au", "description": "The kits come with all the essentials required to create an edible masterpiece to help you get into the Easter spirit before the bunny arrives.", "url": "https://7news.com.au/sunrise/win/enter-to-win-cadburys-dairy-milk-design-your-own-easter-egg-kits-c-2472391", "urlToImage": "https://images.s.7news.com.au/publication/C-2472391/3eaf3b3cf5767fe9c4174374030134c8b52accea-16x9-x1y0w1259h708.png?imwidth=1024", "publishedAt": "2021-03-30T01:42:00Z", "content": "Were giving away four Cadbury Design Your Own Easter Egg kits to 10 lucky Sunrise Family members in this weeks newsletter.\r\nThe kits come with all the essentials required to create an edible masterpi… [+451 chars]"}, {"source": {"id": null, "name": "Worldhealth.net"}, "author": null, "title": "Differences in herpes virus symptoms may relate to variations in strain gene expression - Anti Aging News", "description": "Why do some people with cold sores around their lips experience painful lesions, while others have no symptoms at all, yet still spread the virus? A new study conducted at Penn State finds that these differences could be due to variations in the way certain s…", "url": "https://www.worldhealth.net/news/differences-herpes-virus-symptoms-may-relate-variations-strain-gene-expression", "urlToImage": "https://www.worldhealth.net/media/original_images/AdobeStock_22369160.jpeg", "publishedAt": "2021-03-30T01:29:51Z", "content": "Why do some people with cold sores around their lips experience painful lesions, while others have no symptoms at all, yet still spread the virus? A new study conducted at Penn State finds that these… [+4814 chars]"}, {"source": {"id": null, "name": "Womenshealth.com.au"}, "author": "Nikolina Ilic", "title": "17 Australian Women Share Their Endometriosis Stories - Women's Health", "description": "Approximately one in nine Australian women have clinically confirmed endometriosis, with most diagnosed during their early thirties. But this doesn't include the thousands of women battling with the symptoms but riding them off, or unaware of the help availab…", "url": "https://www.womenshealth.com.au/17-australian-women-share-their-endometriosis-stories", "urlToImage": "http://www.womenshealth.com.au/media/21335/emilia-victoria.jpeg", "publishedAt": "2021-03-30T01:02:19Z", "content": "J - 24, South Australia\r\nI feel lucky with my endometriosis story, as I know so many others have it much worse than I do but it is still a large part of my daily life. I had never heard about endomet… [+35845 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "GlyNAC could improve many age-associated defects in older humans - News-Medical.Net", "description": "A pilot human clinical trial conducted by researchers at Baylor College of Medicine reveals that supplementation with GlyNAC - a combination of glycine and N-acetylcysteine as precursors of the natural antioxidant glutathione - could improve many age-associat…", "url": "https://www.news-medical.net/news/20210329/GlyNAC-could-improve-many-age-associated-defects-in-older-humans.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/shutterstock_1028141632_649cad8889c647fc8d0bd83bf7503e08-620x480.jpg", "publishedAt": "2021-03-30T00:57:00Z", "content": "A pilot human clinical trial conducted by researchers at Baylor College of Medicine reveals that supplementation with GlyNAC - a combination of glycine and N-acetylcysteine as precursors of the natur… [+6430 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Apes mount a much stronger early immune response compared to African and Asian monkeys - News-Medical.Net", "description": "A new study out of the University of Chicago and the University of Illinois Urbana-Champaign in humans, chimpanzees, rhesus macaques and baboons has found key differences in early gene expression in response to pathogen exposure, highlighting the importance o…", "url": "https://www.news-medical.net/news/20210329/Apes-mount-a-much-stronger-early-immune-response-compared-to-African-and-Asian-monkeys.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2021-03-30T00:15:00Z", "content": "A new study out of the University of Chicago and the University of Illinois Urbana-Champaign in humans, chimpanzees, rhesus macaques and baboons has found key differences in early gene expression in … [+4521 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Restricting excessive consumption of added sugars may reduce NAFLD risk in children - News-Medical.Net", "description": "A review of more than 20 studies by researchers at Arizona State University and the Translational Genomics Research Institute, an affiliate of City of Hope, suggests that nonalcoholic fatty-liver disease (NAFLD) is a growing dietary problem for children acros…", "url": "https://www.news-medical.net/news/20210329/Restricting-excessive-consumption-of-added-sugars-may-reduce-NAFLD-risk-in-children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2021-03-29T23:52:00Z", "content": "A review of more than 20 studies by researchers at Arizona State University and the Translational Genomics Research Institute (TGen), an affiliate of City of Hope, suggests that nonalcoholic fatty-li… [+3800 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows safety, efficacy of percutaneous thermal ablation for treating metastatic gynecologic cancers - News-Medical.Net", "description": "A new study by researchers at the UCLA Jonsson Comprehensive Cancer Center found using percutaneous image guided needle based thermal ablation -- the precise application of extreme heat or cold to a tumor using sophisticated ultrasound, CT or MRI in a single …", "url": "https://www.news-medical.net/news/20210329/Study-shows-safety-efficacy-of-percutaneous-thermal-ablation-for-treating-metastatic-gynecologic-cancers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Ultrasound-620x480.jpg", "publishedAt": "2021-03-29T23:41:00Z", "content": "Findings\r\nA new study by researchers at the UCLA Jonsson Comprehensive Cancer Center found using percutaneous image guided needle based thermal ablation -- the precise application of extreme heat or … [+3053 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Long-term, regular use of baby aspirin may reduce risk of colorectal cancer death - News-Medical.Net", "description": "Long-term, regular use of baby aspirin-;at least 15 times per month-;prior to a diagnosis of colorectal cancer (CRC) may reduce the risk of death from the disease by limiting the spread of cancerous tumors pre-diagnosis, according to a study led by Cedars-Sin…", "url": "https://www.news-medical.net/news/20210329/Long-term-regular-use-of-baby-aspirin-may-reduce-risk-of-colorectal-cancer-death.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Aspirin-620x480.jpg", "publishedAt": "2021-03-29T22:57:00Z", "content": "Long-term, regular use of baby aspirin-;at least 15 times per month-;prior to a diagnosis of colorectal cancer (CRC) may reduce the risk of death from the disease by limiting the spread of cancerous … [+4316 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers make a breakthrough in the quest for an AMD cure - News-Medical.net", "description": "Age-related macular degeneration (AMD), which leads to a loss of central vision, is the most frequent cause of blindness in adults 50 years of age or older, affecting an estimated 196 million people worldwide. There is no cure, though treatment can slow the o…", "url": "https://www.news-medical.net/news/20210329/Researchers-make-a-breakthrough-in-the-quest-for-an-AMD-cure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Iris-620x480.jpg", "publishedAt": "2021-03-29T22:48:00Z", "content": "Age-related macular degeneration (AMD), which leads to a loss of central vision, is the most frequent cause of blindness in adults 50 years of age or older, affecting an estimated 196 million people … [+6892 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Type of glaucoma linked to increased risk of cognitive impairment - Medical Xpress", "description": "A type of glaucoma called normal-tension glaucoma is associated with an increased risk of cognitive impairment and possibly dementia, finds research published online in the British Journal of Ophthalmology.", "url": "https://medicalxpress.com/news/2021-03-glaucoma-linked-cognitive-impairment.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2014/glaucoma.jpg", "publishedAt": "2021-03-29T22:30:01Z", "content": "A type of glaucoma called normal-tension glaucoma is associated with an increased risk of cognitive impairment and possibly dementia, finds research published online in the British Journal of Ophthal… [+3328 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Julia Ries", "title": "Eating Your Greens May Help You Build Muscle Strength - Healthline", "description": "New research has found that eating nitrate-rich leafy greens, like spinach and kale, can boost muscle function and ultimately help prevent falls and fractures. The body converts nitrates into nitric oxide, which improves blood flow and enhances exercise perfo…", "url": "https://www.healthline.com/health-news/eating-your-greens-may-help-you-build-muscle-strength", "urlToImage": "https://post.healthline.com/wp-content/uploads/2021/03/Watering_Lettuce_1200x628-facebook.jpg", "publishedAt": "2021-03-29T22:09:19Z", "content": "<ul><li>A new study has found that regularly eating leafy greens can boost muscle function, which in turn could help prevent falls and fractures. </li><li>The body converts nitrates into nitric oxide… [+4271 chars]"}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Lydia Lynch", "title": "More local cases confirmed and new sites added to contact tracing list - Brisbane Times", "description": "The COVID-19 cluster that triggered Brisbane’s shutdown has grown overnight as millions of people in south-east Queensland spent their first night locked down.", "url": "https://www.brisbanetimes.com.au/national/queensland/more-local-cases-confirmed-and-new-sites-added-to-contact-tracing-list-20210330-p57f42.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3199%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_1/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/11af7f9aab139e6b0f685f48cea19f281e2830a3", "publishedAt": "2021-03-29T21:02:41Z", "content": "I mean, it would be highly unlikely not to see more cases.\r\nThe nurse and her sister spent a bachelorette weekend away at Byron Bay while unknowingly infectious.\r\nThey visited the Byron Beach Hotel a… [+1020 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/james-griffiths\">James Griffiths</a>, <a href=\"/profiles/joshua-berlinger\">Joshua Berlinger</a>, <a href=\"/profiles/lauren-moorhouse\">Lauren Said-Moorhouse</a> and Christopher Johnson, CNN", "title": "The latest on the coronavirus pandemic and vaccines: Live updates - CNN International", "description": "The coronavirus pandemic has brought countries to a standstill. Meanwhile, vaccinations have already started in some countries as cases continue to rise. Follow here for the latest.", "url": "https://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-03-29-21/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175736-02-coronavirus-0213-super-tease.jpg", "publishedAt": "2021-03-29T20:49:00Z", "content": "Arkansas is the only state left in the US to announce when it plans to open up coronavirus vaccinations to everyone eligible under US Food and Drug Administration emergency use authorization.\r\nIn Ark… [+2142 chars]"}, {"source": {"id": null, "name": "Sydney.edu.au"}, "author": null, "title": "An improved safety standard for pacemakers and cochlear implants - News - The University of Sydney", "description": "In very rare situations bionic devices can fail due to moisture leaks. While the devices are very safe there are still no standard tests for moisture leaks into pacemakers and cochlear implants. University of Sydney scientists have changed that, developing th…", "url": "https://www.sydney.edu.au/news-opinion/news/2021/03/30/improved-safety-standard-bionic-devices-pacemakers-cochlear-implants.html", "urlToImage": "https://www.sydney.edu.au/content/dam/corporate/images/news-and-opinion/news/2021/march/generic-mother-with-son-cochlear-implant-shutterstockjpg.jpg", "publishedAt": "2021-03-29T20:19:45Z", "content": "Professor David McKenzie.\r\n\"In practice and in most cases, helium testing of bionic devices is a good standard, but by improving the compliance by a factor of 10, we think the industry can further gu… [+2387 chars]"}, {"source": {"id": null, "name": "SBS News"}, "author": null, "title": "Real-world study shows Pfizer and Moderna COVID-19 vaccines give 'substantial' protection after first shot - SBS News", "description": "Data from a large, real-world study, shows Pfizer and Moderna COVID-19 vaccines reduced the risk of infection significantly after the first of two jabs.", "url": "https://www.sbs.com.au/news/real-world-study-shows-pfizer-and-moderna-covid-19-vaccines-give-substantial-protection-after-first-shot", "urlToImage": "https://sl.sbs.com.au/public/image/file/91b0af45-d083-4207-b0c1-72b622580005/crop/16x9", "publishedAt": "2021-03-29T20:07:20Z", "content": "COVID-19 vaccines developed by Pfizer Inc with BioNTech SE and Moderna Inc reduced the risk of infection by 80 per cent two weeks or more after the first of two shots, according to data from a real-w… [+2723 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Alex Chapman", "title": "QLD Health updates list of COVID exposure sites as contact tracing expands amid Greater Brisbane lockdown - 7NEWS.com.au", "description": "A gym is the latest in a growing list of venues where visitors must immediately place themselves into isolation for 14 days.", "url": "https://7news.com.au/lifestyle/health-wellbeing/brisbane-gym-added-to-high-risk-venues-potentially-exposed-to-coronavirus-c-2470035", "urlToImage": "https://images.s.7news.com.au/publication/C-2470035/877496cb1cd02426f93375a8bc0cffbf30ce27e1-16x9-x0y75w2121h1193.jpg?imwidth=1024", "publishedAt": "2021-03-29T19:14:00Z", "content": "A Brisbane gym has been added to the list of venues visited by someone who has since tested positive for coronavirus.\r\nSeven locally acquired cases have been reported across Queensland since Friday, … [+2130 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Common medications contain animal byproducts, study finds - Medical Xpress", "description": "More physicians and pharmacists are advocating for patients to be made aware of animal byproducts contained in common medications, according to new research in the Journal of Osteopathic Medicine. Common medications, including widely used blood thinners and h…", "url": "https://medicalxpress.com/news/2021-03-common-medications-animal-byproducts.html", "urlToImage": "https://medx.b-cdn.net/tmpl/v6/img/medx308px.png", "publishedAt": "2021-03-29T18:44:53Z", "content": "More physicians and pharmacists are advocating for patients to be made aware of animal byproducts contained in common medications, according to new research in the Journal of Osteopathic Medicine. Co… [+3932 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "A Mystery Brain Condition Is Making Bears Friendly, Then Killing Them - Gizmodo Australia", "description": "An unknown neurological condition is sickening and often killing young black bears in California and Nevada. The illness also seems to make the bears unafraid of people. Though the condition doesn’t appear to be severely harming the bear population at large, …", "url": "https://www.gizmodo.com.au/2021/03/a-mystery-brain-condition-is-making-bears-friendly-then-killing-them/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/03/30/fl7beboaf0z78hamoxb3-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-03-29T18:42:00Z", "content": "An unknown neurological condition is sickening and often killing young black bears in California and Nevada. The illness also seems to make the bears unafraid of people. Though the condition doesnt a… [+2318 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "GlyNAC improves multiple defects in aging to boost strength and cognition in older humans - Science Daily", "description": "GlyNAC - a combination precursors of the natural antioxidant glutathione - improved many age-associated defects in older humans boosting muscle strength and cognition.", "url": "https://www.sciencedaily.com/releases/2021/03/210329122746.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-29T18:02:16Z", "content": "A pilot human clinical trial conducted by researchers at Baylor College of Medicine reveals that supplementation with GlyNAC -- a combination of glycine and N-acetylcysteine as precursors of the natu… [+6036 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study investigates the effects of depression on visual perception - News-Medical.Net", "description": "Researchers specialized in psychiatry and psychology at the University of Helsinki investigated the effects of depression on visual perception.", "url": "https://www.news-medical.net/news/20210329/Study-investigates-the-effects-of-depression-on-visual-perception.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/depression-620x480.jpg", "publishedAt": "2021-03-29T17:23:00Z", "content": "Researchers specialized in psychiatry and psychology at the University of Helsinki investigated the effects of depression on visual perception. The study confirmed that the processing of visual infor… [+2119 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Is Australia botching the vaccine rollout? - The Signal - ABC News", "description": "Six million Australians are eligible for the COVID-19 vaccine, but as of Monday, fewer than 600,000 have had it. For many countries, the hold up has been the international supply chain, but that's not the case here. Today on The Signal, we investigate the slo…", "url": "https://www.abc.net.au/radio/programs/the-signal/slow-vaccine-rollout/13280522", "urlToImage": "https://www.abc.net.au/cm/rimage/13260352-16x9-large.jpg?v=2", "publishedAt": "2021-03-29T17:00:00Z", "content": "Six million Australians are eligible for the COVID-19 vaccine, but as of Monday, fewer than 600,000 have had it.\r\nFor many countries, the hold up has been the international supply chain, but that's n… [+969 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Diabetes drug may be a new weapon against HIV - EurekAlert", "description": "A team led by scientists at the UNC School of Medicine discovered an important vulnerability of the AIDS-causing retrovirus HIV, and has shown in preclinical experiments that a widely used diabetes drug, metformin, seems able to exploit this vulnerability.", "url": "https://www.eurekalert.org/pub_releases/2021-03/uonc-ddm032921.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-29T16:57:41Z", "content": "CHAPEL HILL, NC - A team led by scientists at the UNC School of Medicine discovered an important vulnerability of the AIDS-causing retrovirus HIV, and has shown in preclinical experiments that a wide… [+5590 chars]"}, {"source": {"id": null, "name": "India New England"}, "author": null, "title": "Preservative used in popular foods may harm immune system - India New England", "description": "New York– A food preservative used to prolong the shelf life of Pop-Tarts, Rice Krispies Treats, Cheez-Its and almost 1,250 other popular processed foods may harm the immune system, a new study suggests. The findings showed that the preservative tert-butylhyd…", "url": "https://indianewengland.com/2021/03/preservative-used-in-popular-foods-may-harm-immune-system/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2021/03/chips2.jpg", "publishedAt": "2021-03-29T16:07:25Z", "content": "New York– A food preservative used to prolong the shelf life of Pop-Tarts, Rice Krispies Treats, Cheez-Its and almost 1,250 other popular processed foods may harm the immune system, a new study sugge… [+1608 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Scientists urge swift action to prepare for next pandemic - Medical Xpress", "description": "An international team of researchers led by a University of Virginia School of Medicine professor is warning that scientists must better prepare for the next pandemic—and has developed a plan to do just that.", "url": "https://medicalxpress.com/news/2021-03-scientists-urge-swift-action-pandemic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/scientistsur.jpg", "publishedAt": "2021-03-29T16:06:55Z", "content": "An international team of researchers led by a University of Virginia School of Medicine professor is warning that scientists must better prepare for the next pandemicand has developed a plan to do ju… [+5894 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler", "title": "Googling Your Symptoms Might Not Be a Horrible Idea After All - ScienceAlert", "description": "We've all done it. Maybe you have a weird rash, or a cough that just won't go away, so you turn to Google to look up your symptoms.", "url": "https://www.sciencealert.com/googling-your-symptoms-might-actually-be-a-little-helpful-suggests-new-study", "urlToImage": "https://www.sciencealert.com/images/2021-03/processed/GettyImages-1139003653_1024.jpg", "publishedAt": "2021-03-29T15:02:14Z", "content": "We've all done it. Maybe you have a weird rash, or a cough that just won't go away, so you turn to Google to look up your symptoms.\r\nDespite the cliche that search results will just tell you you've g… [+4169 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists review current knowledge of the role of calcium-sensing receptor in immune cells - News-Medical.Net", "description": "In a new publication from Cardiovascular Innovations and Applications, Wenxiu Liu, Yutong Guo, Yue Liu, Jiaxing Sun and Xinhua Yin from The First Affiliated Hospital of Harbin Medical University, Heilongjiang, China consider calcium-sensing receptors of immun…", "url": "https://www.news-medical.net/news/20210329/Scientists-review-current-knowledge-of-the-role-of-calcium-sensing-receptor-in-immune-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Calcium-620x480.jpg", "publishedAt": "2021-03-29T14:14:00Z", "content": "In a new publication from Cardiovascular Innovations and Applications, Wenxiu Liu, Yutong Guo, Yue Liu, Jiaxing Sun and Xinhua Yin from The First Affiliated Hospital of Harbin Medical University, Hei… [+1068 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers explore a case of diabetic ketoacidosis in patient with atezolizumab-induced autoimmune diabetes - News-Medical.Net", "description": "In a new publication from Cardiovascular Innovations and Applications, Sharen Lee and Gary Tse from Laboratory of Cardiovascular Physiology, Hong Kong, HKG, China, Second Hospital of Tianjin Medical University, Tianjin, China and Xiamen Cardiovascular Hospita…", "url": "https://www.news-medical.net/news/20210329/Researchers-explore-a-case-of-diabetic-ketoacidosis-in-patient-with-atezolizumab-induced-autoimmune-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2015/3/Diabetes_Mellitus1_4a874c8237104d59ac7810769f8e78a2-620x480.jpg", "publishedAt": "2021-03-29T14:06:00Z", "content": "In a new publication from Cardiovascular Innovations and Applications, Sharen Lee and Gary Tse from Laboratory of Cardiovascular Physiology, Hong Kong, HKG, China, Second Hospital of Tianjin Medical … [+1965 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers assess the use of nomograms to predict obstructive coronary artery disease - News-Medical.Net", "description": "In a new publication from Cardiovascular Innovations and Applications, Zesen Han, Lihong Lai, Zhaokun Pu and Lan Yang from The People's Hospital of Hua County, Henan, China and Henan University of Science and Technology, Henan, China consider the use of nomog…", "url": "https://www.news-medical.net/news/20210329/Researchers-assess-the-use-of-nomograms-to-predict-obstructive-coronary-artery-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Coronary_Artery_Disease-620x480.jpg", "publishedAt": "2021-03-29T13:54:00Z", "content": "In a new publication from Cardiovascular Innovations and Applications, Zesen Han, Lihong Lai, Zhaokun Pu and Lan Yang from The People's Hospital of Hua County, Henan, China and Henan University of Sc… [+1001 chars]"}, {"source": {"id": null, "name": "Medical Device Network"}, "author": "Admin", "title": "Future bright for innovative contact lenses, says new report - Medical Device Network", "description": "<p>A newly-published paper in Contact Lens and Anterior Eye has reviewed innovative uses for contact lenses in disease detection and therapy, drug delivery, vision enhancement and more.</p>", "url": "https://www.medicaldevice-network.com/news/contact-lenses-future/", "urlToImage": "https://www.medicaldevice-network.com/wp-content/uploads/sites/11/2021/03/shutterstock_626461688.jpg", "publishedAt": "2021-03-29T13:15:17Z", "content": "A newly-published paper in Contact Lens and Anterior Eye has reviewed innovative uses for contact lenses in disease detection and therapy, drug delivery, vision enhancement and more.\r\nThe paper repre… [+2860 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Procedures identify Barrett's esophagus patients at risk for cancer progression - EurekAlert", "description": "A combination of esophageal brushing and extensive genetic sequencing of the sample collected can detect chromosome alterations in people with Barrett's Esophagus, identifying patients at risk for progressing to esophageal cancer, according to a new study by …", "url": "https://www.eurekalert.org/pub_releases/2021-03/jhm-pib032621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/260425_web.jpg", "publishedAt": "2021-03-29T13:02:54Z", "content": "IMAGE: A combination of esophageal brushing and extensive genetic sequencing of the sample collected can detect chromosomal alterations in people with Barrett's esophagus, identifying patients at ris… [+7110 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Inflammation-fighting protein could improve treatment of rheumatoid arthritis - EurekAlert", "description": "New research led by scientists at Washington State University has found that a protein known as GBP5 appears to play a key role in suppressing inflammation in rheumatoid arthritis, a potentially debilitating disease in which the immune system attacks the body…", "url": "https://www.eurekalert.org/pub_releases/2021-03/wsu-ipc032621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/260419_web.jpg", "publishedAt": "2021-03-29T13:01:42Z", "content": "IMAGE: Study authors Mahamudul Haque, Salah-Uddin Ahmed, and Anil K. Singh look at a protein array in their lab at the WSU Health Sciences Spokane campus.\r\n view more \r\nCredit: Photo by Cori Kogan, W… [+5206 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Australian Associated Press", "title": "India's COVID infections surging - Yahoo News Australia", "description": "India has reported its highest daily increase in coronavirus cases in five months, with a second wave of the disease driven by surging infections in the...", "url": "https://au.news.yahoo.com/indias-covid-infections-surging-120449543.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-03-29T12:04:49Z", "content": "India has reported its highest daily increase in coronavirus cases in five months, with a second wave of the disease driven by surging infections in the country's richest state, Maharashtra.\r\nA total… [+1760 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Animal-stress' signal improves plant drought resilience - Phys.org", "description": "A team of Australian and German researchers has discovered a novel pathway that plants can use to save water and improve their drought tolerance.", "url": "https://phys.org/news/2021-03-animal-stress-drought-resilience.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/drought.jpg", "publishedAt": "2021-03-29T09:00:03Z", "content": "A team of Australian and German researchers has discovered a novel pathway that plants can use to save water and improve their drought tolerance.\r\nThe research published today in Nature Communication… [+2792 chars]"}, {"source": {"id": null, "name": "Australiantimes.co.uk"}, "author": "https://www.facebook.com/ConversationEDU", "title": "We don’t yet know how effective COVID vaccines are for people with immune deficiencies. But we know they’re safe — and worthwhile - Australian Times", "description": "So far, we have two vaccines available in Australia: the Pfizer/BioNTech vaccine, approved for people aged 16 and older, and the Oxford/AstraZeneca vaccine, approved for those over 18. Evidence has shown both vaccines are safe and offer near-complete protecti…", "url": "https://www.australiantimes.co.uk/news/we-dont-yet-know-how-effective-covid-vaccines-are-for-people-with-immune-deficiencies-but-we-know-theyre-safe-and-worthwhile/", "urlToImage": "https://storage.googleapis.com/cdn.australiantimes.co.uk/wp-content/uploads/2021/03/750a8236-effective-vaccines.jpg", "publishedAt": "2021-03-29T08:17:00Z", "content": "Vanessa Bryant, Walter and Eliza Hall Institute and Charlotte Slade, Walter and Eliza Hall Institute\r\nThe COVID vaccine rollout is underway in Australia, with people in phase 1b now eligible to be va… [+6211 chars]"}, {"source": {"id": null, "name": "Queenslandcountrylife.com.au"}, "author": "James McManagan", "title": "Queenslanders to carry a mask when leaving home as contact tracers scramble to contain COVID cluster - Queensland Country Life", "description": "The infected man is believed to be from Gladstone and returned home to visit family over the weekend.", "url": "https://www.queenslandcountrylife.com.au/story/7188339/gladstone-avoids-lockdown-tracing-underway/", "urlToImage": "https://www.queenslandcountrylife.com.au/images/transform/v1/crop/frm/PsCkjPDeD7c2QaiASceJuy/b93b6c3f-12e3-4ca7-9046-8bc16ee9d833.jpeg/r5_0_1915_1079_w1200_h678_fmax.jpg", "publishedAt": "2021-03-29T06:19:00Z", "content": "Gladstone has not joined Brisbane's three-day lockdown as contact tracers work to identify key locations in the regional centre.\r\nAnyone who has visited the following sites has been ordered to get te… [+4259 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Machine learning can monitor and predict the progression of multiple sclerosis - News-Medical.Net", "description": "Monitoring the progression of multiple sclerosis-related gait issues can be challenging in adults over 50 years old, requiring a clinician to differentiate between problems related to MS and other age-related issues.", "url": "https://www.news-medical.net/news/20210329/Machine-learning-can-monitor-and-predict-the-progression-of-multiple-sclerosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2021-03-29T05:34:00Z", "content": "Monitoring the progression of multiple sclerosis-related gait issues can be challenging in adults over 50 years old, requiring a clinician to differentiate between problems related to MS and other ag… [+3547 chars]"}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Tony Moore", "title": "Gladstone not joining three-day lockdown but testing under way - Brisbane Times", "description": "COVID testing for key Gladstone locations under way, but regional city will not join the three-day lockdown.", "url": "https://www.brisbanetimes.com.au/national/queensland/gladstone-not-joining-three-day-lockdown-but-testing-under-way-20210329-p57f03.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/e48e2b89c292b44100783bedd86016f52749ff35", "publishedAt": "2021-03-29T04:56:32Z", "content": "Gladstone is not joining Greater Brisbanes three-day lockdown starting at 5pm on Monday, but residents who visited some key locations will still need to get tested immediately.\r\nThe health advice fol… [+1683 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "AAP", "title": "NSW aiming for HIV elimination in 5 years - The West Australian", "description": "A new plan has been launched by NSW Health that seeks to virtually eliminate the transmission of HIV in the state within five years.", "url": "https://thewest.com.au/news/health/nsw-aiming-for-hiv-elimination-in-5-years-c-2464442", "urlToImage": "https://images.s.thewest.com.au/publication/C-2464442/2d7cbd0a59cfb8484461799f9db23668474da431-16x9-x0y75w800h450.jpg?imwidth=1024", "publishedAt": "2021-03-29T03:28:00Z", "content": "HIV transmission in NSW will be virtually eliminated in five years if a new government strategy is effective.\r\nThe plan, announced by NSW Health on Monday, will target priority populations, with addi… [+2061 chars]"}, {"source": {"id": null, "name": "Narooma News"}, "author": null, "title": "Easter chocolates and your dog could be lethal - Narooma News", "description": "Narooma Dog Training Club warns of the perils of feeding your dog chocolate.", "url": "https://www.naroomanewsonline.com.au/story/7187319/dogs-and-chocolate-a-no-no/", "urlToImage": "https://www.naroomanewsonline.com.au/images/transform/v1/crop/frm/aTJEDiJUPWhEafKMkrrWW6/77c56e6a-f12d-4a97-b74a-eb96f7454d92.jpg/r0_137_600_476_w1200_h678_fmax.jpg", "publishedAt": "2021-03-29T01:21:00Z", "content": "Easter... it's a lot about chocolate, right? Narooma Dog Training Club is warning dog owners not to feed their pets chocolate.\r\n Keep chocolates away from your dogs and cats this Easter, it could be … [+1883 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Alice Clarke", "title": "Don’t consume the guilt: You don’t need to ‘earn’ your food - WAtoday", "description": "I’ve seen so many people on social media talk about how they’re running a few extra kilometres or doing extra workouts at the gym to “earn” their afternoon snack, and it’s concerning.", "url": "https://www.smh.com.au/national/don-t-consume-the-guilt-you-don-t-need-to-earn-your-food-20210125-p56wqq.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2149%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_339/t_crop_custom/q_86%2Cf_auto/t_watoday_opinion_no_age_social_wm/299f559d29a42856317dedb6ff4afae278c3af52", "publishedAt": "2021-03-29T00:25:44Z", "content": "Were all now a few months into our new years health resolutions and theres a good chance things havent gone as smoothly as you originally hoped, or maybe Im just projecting. Its easy to make radical … [+1964 chars]"}, {"source": {"id": null, "name": "Bitemagazine.com.au"}, "author": null, "title": "Study ascertains how teeth sense the cold - Bite magazine", "description": "For people with tooth decay, drinking a cold beverage can be agony. Now an international team of scientists have figured out how teeth sense the cold and pinpointed the molecular […]", "url": "https://bitemagazine.com.au/study-ascertains-how-teeth-sense-the-cold/", "urlToImage": "https://bitemagazine.com.au/wp-content/uploads/2021/03/cold_teeth.jpg", "publishedAt": "2021-03-28T23:55:16Z", "content": "Photo: Jan Mika 123RF\r\nFor people with tooth decay, drinking a cold beverage can be agony. Now an international team of scientists have figured out how teeth sense the cold and pinpointed the molecul… [+2965 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Sarah Swain", "title": "Queensland Premier refuses to apologise for party blunder - 9News", "description": "<p>As long as Brisbane&#x27;s new virus cases continue to be linked, the city is not heading for lockdown, Queensland Premier Annastacia Palaszczuk says.</p>", "url": "https://www.9news.com.au/national/queensland-update-brisbane-cases-queensland-health-premier-party/08a9e2e0-a255-42c2-8053-b530919b0c93", "urlToImage": "https://imageresizer.static9.net.au/0U1tB3UJ6FUVpYY1QfXlpTSVYCA=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F49e3c767-a797-4820-b716-c0a44c9ffca7", "publishedAt": "2021-03-28T21:52:39Z", "content": "Auto news: Toyota is funding an electric aircraft company - caradvice.com.au"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "[Full text] Cycle Threshold Values in the Context of Multiple RT-PCR Testing for S | RMHP - Dove Medical Press", "description": "Cycle Threshold Values in the Context of Multiple RT-PCR Testing for SARS-CoV-2", "url": "https://www.dovepress.com/cycle-threshold-values-in-the-context-of-multiple-rt-pcr-testing-for-s-peer-reviewed-fulltext-article-RMHP", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2021-03-28T21:51:28Z", "content": "Introduction\r\nSince the first cases of coronavirus disease-2019 (COVID-19) were detected in Latin America in late February 2020, the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has s… [+19488 chars]"}, {"source": {"id": null, "name": "Bay939.com.au"}, "author": "Rebecca McDonald", "title": "Work to start on Geelong's acute mental health facility - Bay 93.9", "description": "A new acute mental health facility in Geelong should be opened by 2023.   It is one of four centres announced by the state government for Victoria,...", "url": "https://www.bay939.com.au/news/local-news/125551-work-to-start-on-geelong-s-acute-mental-health-facility", "urlToImage": "https://www.bay939.com.au/images/2021_Newsroom/March_2021/hospital_bed.jpg", "publishedAt": "2021-03-28T20:02:35Z", "content": "A new acute mental health facility in Geelong should be opened by 2023.\r\nIt is one of four centres announced by the state government for Victoria, with the other four being based at Epping, Parkville… [+588 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Mattha Busby", "title": "Parents of boy with severe epilepsy drop cannabis challenge - The Guardian", "description": "NHS ‘clarified’ that doctors should consider unlicensed cannabis-based products on case-by-case basis", "url": "https://amp.theguardian.com/society/2021/mar/28/parents-of-boy-with-severe-epilepsy-drop-cannabis-challenge", "urlToImage": null, "publishedAt": "2021-03-28T14:16:55Z", "content": "HealthNHS clarified that doctors should consider unlicensed cannabis-based products on case-by-case basis\r\nSun 28 Mar 2021 10.16 EDT\r\nThe parents of a three-year-old with severe epilepsy have dropped… [+3009 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Michael Martin", "title": "Signs Your Illness is Actually Coronavirus in Disguise | Eat This Not That - Eat This, Not That", "description": "Here are signs your illness could be coronavirus (PASC) in disguise : fatigue, headaches, shortness of breath, and muscle aches.", "url": "http://www.eatthis.com/news-signs-illness-coronavirus-disguise/", "urlToImage": "https://i1.wp.com/www.eatthis.com/wp-content/uploads/2020/12/coronavirus-fatigue.jpg?fit=1200%2C801&ssl=1", "publishedAt": "2021-03-28T12:49:30Z", "content": "This spring, a ticklish throat will likely cause you to ask the question, \"Is this an allergic cough or coronavirus?\" There's another option: You may have PASCPost-Acute Sequelae of SARS-CoV-2 Infect… [+2565 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "AI might prove helpful against asbestos-linked cancer - Malaysia Sun", "description": "A new international genomics research led by the University of Leicester used artificial intelligence (AI) to study an aggressive form of cancer, which could be", "url": "https://www.bignewsnetwork.com/news/268257780/ai-might-prove-helpful-against-asbestos-linked-cancer", "urlToImage": "https://cdn.bignewsnetwork.com/ani1616932784.jpg", "publishedAt": "2021-03-28T11:55:00Z", "content": "Leicester [UK], March 28 (ANI): A new international genomics research led by the University of Leicester used artificial intelligence (AI) to study an aggressive form of cancer, which could be helpfu… [+2075 chars]"}, {"source": {"id": null, "name": "Sify News"}, "author": "ANI", "title": "Social distancing in airplane seat assignments can reduce COVID-19 spread - Sify News", "description": "Maryland [US], March 28 (ANI): A new research conducted to minimise the risk of secondary infections aboard has used two models to help solve the airplane seating assignment problem because COVID-19 has been shown to spread on airplanes by infected passengers.", "url": "https://www.sify.com/news/social-distancing-in-airplane-seat-assignments-can-reduce-covid-19-spread-news-health-vd2lOhjbiafha.html", "urlToImage": "https://www.sify.com/images/news-183x123.jpg", "publishedAt": "2021-03-28T11:50:07Z", "content": "Maryland [US], March 28 (ANI): A new research conducted to minimise the risk of secondary infections aboard has used two models to help solve the airplane seating assignment problem because COVID-19 … [+60 chars]"}, {"source": {"id": null, "name": "Prothomalo.com"}, "author": "Ashish Basu", "title": "Eating processed meat can increase risk of dementia: Study - Prothom Alo English", "description": "A new study suggests that the intake of processed meat, such as bacon may dramatically increase the risk of getting dementia", "url": "https://en.prothomalo.com/lifestyle/eating-processed-meat-can-increase-risk-of-dementia-study", "urlToImage": "https://images.prothomalo.com/prothomalo-english%2Fimport%2Fmedia%2F2018%2F05%2F14%2F8e7dc272a585a4589ee939e14e45ea71-meayt.jpg?overlay=&overlay_position=bottom&overlay_opacity=1&w=1200&h=627&auto=format%2Ccompress&ogImage=true&overlay_width_pct=1", "publishedAt": "2021-03-28T11:14:12Z", "content": "The data included how often participants consumed different kinds of meat, with six options from never to once or more daily, collected in 2006-2010 by the UK Biobank. The study did not specifically … [+2127 chars]"}, {"source": {"id": null, "name": "Courier Mail"}, "author": "Sophie Chirgwin", "title": "Mum's 'pure horror' as newborn almost dies from deadly virus - Whitsunday Times", "description": "A Queensland mother has revealed her harrowing ordeal when she nearly lost her newborn daughter, who was diagnosed with a highly-contagious virus twice.", "url": "https://www.couriermail.com.au/news/queensland/queensland-mothers-harrowing-ordeal-of-nearly-losing-her-newborn-to-a-serious-respiratory-illness/news-story/7e1c6b5179efa860a7053007c81dfefd", "urlToImage": "https://media.apnarm.net.au/media/images/2021/03/28/v3imagesbinc69880982e1c8c00b63d56013fe1fac1-wdd6hi0o0ji19guo3w2_ct1880x930.jpg", "publishedAt": "2021-03-28T06:46:00Z", "content": "A mother has revealed her harrowing ordeal when she nearly lost her newborn daughter, who was diagnosed with a highly contagious virus twice.\r\nHollie Ryan, only 10-weeks old, was brought into the wor… [+3247 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Silent pandemic the world is ignoring - Daily Mercury", "description": "A Perth woman went through 18 months of hell with a forgotten disease that up to one million Aussies unknowingly have ‘latent’ in their bodies.", "url": "https://www.news.com.au/lifestyle/health/health-problems/tuberculosis-australia-silent-pandemic-the-world-is-ignoring/news-story/c1a474fcd186879e8ace457b628865d8", "urlToImage": "https://media.apnarm.net.au/media/images/2021/03/28/v3imagesbinfe34d806037e4420cca819cc11290b52-d8s169v4zw7gflum3w2_ct1880x930.jpg", "publishedAt": "2021-03-28T02:46:00Z", "content": "While the world has been fixated by the COVID-19 crisis for the past year, a forgotten pandemic is raging around the world - and right here in Australia - with barely anybody noticing.\r\nTuberculosis … [+5673 chars]"}]}