{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": null, "title": "Research Tools for Anti-Cancer Drug Targets | Whitepaper - Technology Networks", "description": "Currently, various treatments are available to cancer patients, such as chemotherapy, targeted therapy and immunotherapy. Targeted therapy is a type of precision medicine that targets the proteins that control the growth, division and spread of cancer cells.", "url": "https://www.technologynetworks.com/cancer-research/white-papers/research-tools-for-anti-cancer-drug-targets-358378", "urlToImage": null, "publishedAt": "2022-02-09T10:34:52Z", "content": "Currently, various treatments are available to cancer patients, such as chemotherapy, targeted therapy and immunotherapy. Targeted therapy is a type of precision medicine that targets the proteins th… [+395 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "5 elements to optimize treatment of in-hospital stroke - Medical Xpress", "description": "Although hospitalized patients are in a monitored environment, stroke evaluation and treatment are often delayed compared to patients arriving with a stroke at the emergency department, contributing to higher rates of morbidity and mortality for in-hospital s…", "url": "https://medicalxpress.com/news/2022-02-elements-optimize-treatment-in-hospital.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-stroke.jpg", "publishedAt": "2022-02-09T10:00:02Z", "content": "Although hospitalized patients are in a monitored environment, stroke evaluation and treatment are often delayed compared to patients arriving with a stroke at the emergency department, contributing … [+3801 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Colorectal Cancers Oversecrete Proteins To Produce Defensive Barrier Against Chemo - Technology Networks", "description": "Drugs that are commonly used as the first line of treatment for colorectal cancer can cause cancer cells to oversecrete proteins known as mucins. The proteins form a physical barrier that prevents drugs from reaching their target.", "url": "https://www.technologynetworks.com/cancer-research/news/colorectal-cancers-oversecrete-proteins-to-produce-defensive-barrier-against-chemo-358350", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358350/colorectal-cancers-oversecrete-proteins-to-produce-defensive-barrier-against-chemo-358350-640x360.jpg?cb=20220209", "publishedAt": "2022-02-09T09:20:19Z", "content": "Drugs which are commonly-used as the first line of treatment for colorectal cancer cause the tumour cells to oversecrete proteins known as mucins, according to a new study published today in the jour… [+6393 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "30-year-old cancer drug could get another shot, study says - News-Medical.Net", "description": "A study by Virginia Commonwealth University Massey Cancer Center researchers published in today's print edition of Molecular Cancer Therapeutics shows that triplatin is effective against triple negative breast cancer, which is the most aggressive form of brea…", "url": "https://www.news-medical.net/news/20220209/30-year-old-cancer-drug-could-get-another-shot-study-says.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-02-09T05:59:00Z", "content": "A study by Virginia Commonwealth University Massey Cancer Center researchers published in today's print edition of Molecular Cancer Therapeutics shows that triplatin is effective against triple negat… [+3805 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study highlights benefit of mRNA boosters for SARS-CoV-2 following different initial vaccine types - News-Medical.Net", "description": "A study by researchers from the United Kingdom finds no difference in the protection offered by mRNA vaccine boosters against the severe acute respiratory syndrome coronavirus 2 (SARS‑CoV‑2) when comparing those that have received BioNTech/Pfizer vaccine as a…", "url": "https://www.news-medical.net/news/20220208/Study-highlight-benefit-of-mRNA-boosters-for-SARS-CoV-2-following-different-initial-vaccine-types.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703952_16443804717259827.jpg", "publishedAt": "2022-02-09T04:22:00Z", "content": "A study by researchers from the United Kingdom finds no difference in the protection offered by mRNA vaccine boosters against the severe acute respiratory syndrome coronavirus 2 (SARS‑CoV‑2) when com… [+4989 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Carol A Adams, Tamara May", "title": "Autism is still underdiagnosed in girls and women. That can compound the challenges they face - The Conversation Australia & New Zealand", "description": "Without a diagnosis, girls might experience social difficulties and traumatic situations – and grow into women who blame themselves.", "url": "https://theconversation.com/autism-is-still-underdiagnosed-in-girls-and-women-that-can-compound-the-challenges-they-face-176036", "urlToImage": "https://images.theconversation.com/files/444982/original/file-20220208-19-nflynh.jpg?ixlib=rb-1.1.0&rect=66%2C892%2C7282%2C3635&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-09T04:14:00Z", "content": "Being autistic, but not diagnosed, can lead to a lifetime of struggles and being misunderstood for women. \r\nThis issue has been highlighted in the last few years by celebrity women including Hannah G… [+5494 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "FDA-approved drug prevents the immune system from producing neutrophil extracellular traps - News-Medical.Net", "description": "A team of scientists led by Cold Spring Harbor Laboratory (CSHL) have discovered that disulfiram, an FDA-approved drug, prevents the immune system from producing toxic webs known as neutrophil extracellular traps (NETs).", "url": "https://www.news-medical.net/news/20220208/FDA-approved-drug-prevents-the-immune-system-from-producing-neutrophil-extracellular-traps.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Human_lungs_and_trachea._3d_render-Liya_Graphics_21865b46467d4541b59bb44c4e43c499-620x480.jpg", "publishedAt": "2022-02-09T03:06:00Z", "content": "A team of scientists led by Cold Spring Harbor Laboratory (CSHL) have discovered that disulfiram, an FDA-approved drug, prevents the immune system from producing toxic webs known as neutrophil extrac… [+2711 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows how gut bacteria could undermine immunity in pancreatic cancer - News-Medical.Net", "description": "Researchers at the University of Toronto and University Health Network have shown how probiotic bacteria in the gut could undermine immunity in pancreatic cancer, pointing toward more personalized cancer treatments.", "url": "https://www.news-medical.net/news/20220208/Study-shows-how-gut-bacteria-could-undermine-immunity-in-pancreatic-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2015/3/Pancreatic_Cancer_89a89cdc7f804d5b8329b646f86bbec6-620x480.jpg", "publishedAt": "2022-02-09T02:27:00Z", "content": "Researchers at the University of Toronto and University Health Network have shown how probiotic bacteria in the gut could undermine immunity in pancreatic cancer, pointing toward more personalized ca… [+4589 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP/7NEWS", "title": "Australian scientists investigate nasal spray vaccine set to be COVID-19 'game changer' - 7NEWS", "description": "The technology could ease pressure on health workers, cut medical waste and provide better vaccine access to developing countries.", "url": "https://7news.com.au/news/coronavirus/australian-scientists-investigate-nasal-spray-vaccine-set-to-be-covid-19-game-changer-c-5626513", "urlToImage": "https://images.7news.com.au/publication/C-5626513/adefe08f09548ae6761aa9bba7c740d17ec7565b-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-02-09T01:19:36Z", "content": "Australian scientists are conducting research to determine if COVID-19 vaccines could be given with a nasal spray - an innovation they say could have huge implications around the world.\r\nThe technolo… [+1683 chars]"}, {"source": {"id": null, "name": "The Singleton Argus"}, "author": null, "title": "Three Singleton lives lost to COVID-19 in past week - The Singleton Argus", "description": "It has been a tragic week for the Hunter Region which recorded 13 COVID-19 deaths, three of which were from Singleton.", "url": "https://www.singletonargus.com.au/story/7612943/three-singleton-lives-lost-to-covid-19/", "urlToImage": "https://www.singletonargus.com.au/images/transform/v1/crop/frm/69fUThMh3V6mENHE7Nwkb5/9c8d6d1a-7fec-4bb7-9ee1-cdfd61ff7d8c.JPG/r3_613_5998_4000_w1200_h678_fmax.jpg", "publishedAt": "2022-02-09T00:54:33Z", "content": "It has been a tragic week for the Hunter Region which recorded 13 COVID-19 deaths, three of which were from Singleton.\r\nBetween February 2 and 9 Hunter New England Health reported that three people f… [+596 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Christopher Mayes, Deana Leahy, Kristen Lyons", "title": "A gutful of lunchbox hype – has selling 'good bugs not drugs' for kids' health gone too far? - The Conversation AU", "description": "Many school lunchbox products are now heavily marketed as promoting gut health. The limited regulation of such claims leaves it to parents and carers to assess whether they really stack up.", "url": "https://theconversation.com/a-gutful-of-lunchbox-hype-has-selling-good-bugs-not-drugs-for-kids-health-gone-too-far-176251", "urlToImage": "https://images.theconversation.com/files/444977/original/file-20220208-19-1hp3d6q.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C5176%2C2584&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-09T00:36:00Z", "content": "Does your child have a gut-friendly lunchbox? Its Healthy Lunchbox Week, a back-to-school initiative of Nutrition Australia. School lunches are essential for long-term child health and well-being, ac… [+5762 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Maternity health care workers show deeper levels of anguish, fear about work during the pandemic - News-Medical.Net", "description": "In general, the challenges of being a health care provider and the risks for potential COVID-19 infection are acknowledged, but it's less clear how COVID risk mitigation strategies in hospitals impact maternity health care workers.", "url": "https://www.news-medical.net/news/20220208/Maternity-health-care-workers-show-deeper-levels-of-anguish-fear-about-work-during-the-pandemic.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-02-09T00:36:00Z", "content": "In general, the challenges of being a health care provider and the risks for potential COVID-19 infection are acknowledged, but it's less clear how COVID risk mitigation strategies in hospitals impac… [+4063 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Fecal Implants Drive Behavioral and Cognitive Changes in Alzheimer’s Model - Neuroscience News", "description": "Modulating the gut's microbiome by fecal implants induced behavioral and cognitive changes in mouse models of Alzheimer's disease. Researchers say the findings could help develop therapies to stall dementia via probiotic use and fecal transplantation.", "url": "https://neurosciencenews.com/fecal-implants-alzheimers-20047/", "urlToImage": "https://neurosciencenews.com/files/2022/02/fecal-transplant-alzheimers-neurosicnes-public.jpg", "publishedAt": "2022-02-09T00:32:36Z", "content": "Summary: Modulating the gut’s microbiome by fecal implants induced behavioral and cognitive changes in mouse models of Alzheimer’s disease. Researchers say the findings could help develop therapies t… [+5865 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Andrew Prentice", "title": "Covid deaths will be the SAME as Australia's worst flu season - Daily Mail", "description": "A leading health expert believes Australia will win the war against the pandemic and flu season this winter due to high vaccination levels and the continual use of face masks in public.", "url": "https://www.dailymail.co.uk/news/article-10490969/Covid-deaths-Australias-worst-flu-season.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/08/21/53940835-0-image-a-2_1644356593990.jpg", "publishedAt": "2022-02-09T00:25:00Z", "content": "Australia is primed to win the war against the pandemic and upcoming winter flu season due to high vaccination levels and continual use of face masks in public.\r\nThat is the opinion of leading health… [+3545 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Protracted inflammation linked to post-COVID lung problems: New findings suggest monitoring COVID-19 patients for signs of inflammation could help identify those at risk of long-term lung problems - Science Daily", "description": "Scientists have revealed that protracted inflammation following COVID-19 is strongly linked to long-term changes in lung structure and function.", "url": "https://www.sciencedaily.com/releases/2022/02/220208104942.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-09T00:17:14Z", "content": "Scientists have revealed that protracted inflammation following COVID-19 is strongly linked to long-term changes in lung structure and function, according to a report published today in eLife.The res… [+4366 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds rising racial disparities in opioid and stimulant deaths - News-Medical.Net", "description": "Between 2009 and 2019, overdose deaths in the United States involving opioids and stimulant drugs, such as cocaine and methamphetamine, surged compared to deaths from stimulants alone.", "url": "https://www.news-medical.net/news/20220208/Study-finds-rising-racial-disparities-in-opioid-and-stimulant-deaths.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Opioids-620x480.jpg", "publishedAt": "2022-02-08T22:55:00Z", "content": "Between 2009 and 2019, overdose deaths in the United States involving opioids and stimulant drugs, such as cocaine and methamphetamine, surged compared to deaths from stimulants alone. Fatalities lin… [+5688 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Huntsman Mental Health Institute joins a national collaborative effort to tackle mood disorders - News-Medical.Net", "description": "Huntsman Mental Health Institute at the University of Utah was designated a Center of Excellence and member of the National Network of Depression Centers (NNDC), a consortium of leading academic medical centers working to accelerate research, education, and i…", "url": "https://www.news-medical.net/news/20220208/Huntsman-Mental-Health-Institute-joins-a-national-collaborative-effort-to-tackle-mood-disorders.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Abstract_medicine_background-Hilch-1000_f0a8c263e6e04ed18dfcc5ef27c17907-620x480.jpg", "publishedAt": "2022-02-08T22:45:00Z", "content": "Huntsman Mental Health Institute (HMHI) at the University of Utah was designated a Center of Excellence and member of the National Network of Depression Centers (NNDC), a consortium of leading academ… [+3890 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Antihistamines Could Help Some Long Covid Patients, New Research Suggests - Gizmodo Australia", "description": "In a new case report this week, medical professionals in California say that at least two of their patients have...", "url": "https://www.gizmodo.com.au/2022/02/antihistamines-could-help-some-long-covid-patients-new-research-suggests/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/09/eea3264946eafb3f3420907e19ed2717-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-08T22:39:00Z", "content": "In a new case report this week, medical professionals in California say that at least two of their patients have experienced substantial and rapid relief from their long covid symptoms with the help … [+4769 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Spinal cord implant helps paralyzed patients walk again - Japan Today", "description": "In 2017, Michel Roccati was in a motorbike accident that left his lower body completely paralyzed. In 2020, he walked again, thanks to a breakthrough new spinal cord implant. The implant sends electrical pulses to his muscles, mimicking the action of the brai…", "url": "https://japantoday.com/category/features/health/spinal-cord-implant-helps-paralysed-patients-walk-again", "urlToImage": null, "publishedAt": "2022-02-08T22:10:43Z", "content": "In 2017, Michel Roccati was in a motorbike accident that left his lower body completely paralyzed. In 2020, he walked again, thanks to a breakthrough new spinal cord implant.\r\nThe implant sends elect… [+3921 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "SCAI Refines Cardiogenic Shock Classification System - Medscape", "description": "The second iteration of the SCAI cardiogenic shock classification system is based on valuable information gleaned from validation studies and real-world clinical use.", "url": "https://www.medscape.com/viewarticle/968122", "urlToImage": "https://img.medscape.com/thumbnail_library/is_201002_cardiac_arrest_heart_failure_800x450.jpg", "publishedAt": "2022-02-08T21:51:52Z", "content": "The Society for Cardiovascular Angiography and Interventions (SCAI) has refined its cardiogenic shock (CS) classification system based on the literature and clinician feedback from real-world experie… [+4287 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Clare Collins", "title": "Don't drink milk? Here's how to get enough calcium and other nutrients - The Conversation AU", "description": "People who don’t drink milk can choose other foods to get the calcium, protein, vitamins and minerals their bodies need.", "url": "https://theconversation.com/dont-drink-milk-heres-how-to-get-enough-calcium-and-other-nutrients-165466", "urlToImage": "https://images.theconversation.com/files/444932/original/file-20220208-26-4g1zsj.jpg?ixlib=rb-1.1.0&rect=81%2C0%2C4424%2C2208&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-08T19:08:13Z", "content": "Cows milk is an excellent source of calcium which, along with vitamin D, is needed to build strong, dense bones. \r\nMilk also contains protein, the minerals phosphorus, potassium, zinc and iodine, and… [+7059 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Rachel Fairbank", "title": "The Quickest, Easiest Foods to Eat for Long-Lasting Energy - Lifehacker", "description": "When you're tired or busy, you need healthy food that doesn't take long to make.", "url": "https://lifehacker.com/the-quickest-easiest-foods-to-eat-for-long-lasting-ene-1848499597", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/2700f39b18a71587683bc86f954ed57f.jpg", "publishedAt": "2022-02-08T18:30:00Z", "content": "When youre exhausted, it can feel almost impossible to pay attention to nutrition. As hard as it can be, though, the foods we eat play an important role in helping maintain our energy levels. \r\nWhen … [+4845 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Dr Sheena Meredith", "title": "More Cases of Antibiotic-Resistant Gonorrhoea Confirmed in England - Medscape", "description": "Three more cases of ceftriaxone-resistant gonorrhoea in England have been confirmed by the UK Health Security Agency.", "url": "https://www.medscape.com/viewarticle/968101", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_170601_neisseria_gonorrhea_800x600.jpg", "publishedAt": "2022-02-08T18:02:11Z", "content": "Three more cases of ceftriaxone-resistant gonorrhoea in England have been confirmed by the UK Health Security Agency (UKHSA). This follows a single case in a heterosexual man in his 20s reported in L… [+2187 chars]"}, {"source": {"id": null, "name": "FoodNavigator.com"}, "author": "foodnavigator.com", "title": "Ultra-processing foods for health and sustainability: 'Whether you like it or not, processed food is here to stay' - FoodNavigator.com", "description": "Processed and ultra-processed foods get a bad rap. But done the right way, food processing can offer sustainable nutrition to the masses, according to Wageningen University’s Ciarán Forde.", "url": "https://www.foodnavigator.com/Article/2022/02/08/ultra-processing-foods-for-health-and-sustainability-whether-you-like-it-or-not-processed-food-is-here-to-stay", "urlToImage": "https://www.foodnavigator.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/market-trends/ultra-processing-foods-for-health-and-sustainability-whether-you-like-it-or-not-processed-food-is-here-to-stay/13222691-1-eng-GB/Ultra-processing-foods-for-health-and-sustainability-Whether-you-like-it-or-not-processed-food-is-here-to-stay.jpg", "publishedAt": "2022-02-08T16:16:24Z", "content": "More than two-thirds of energy consumed around the globe comes from processed or ultra-processed foods, according to current classification standards.\r\nBut over the last decade, the perception of foo… [+6137 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring the high incidence of croup in children during the SARS-CoV-2 Omicron wave - News-Medical.Net", "description": "In a new study, researchers observed that the incidence of pediatric croup was higher during the latest surge of COVID-19 infections driven by the SARS-CoV-2 Omicron variant.", "url": "https://www.news-medical.net/news/20220208/Exploring-the-high-incidence-of-croup-in-children-during-the-SARS-CoV-2-Omicron-wave.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703869_16443320602487761.jpg", "publishedAt": "2022-02-08T15:08:00Z", "content": "A research work recently posted to the medRxiv* preprint server observed that the incidence of pediatric croup was higher during the latest surge of coronavirus disease 2019 (COVID-19) infections, dr… [+3686 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Comparison of school protocols under the high incidence conditions due to the Omicron variant - News-Medical.Net", "description": "The current study discusses the proactive vs. reactive school protocols relative to the peak demands for resources, break in infection, and the number of days of school lost.", "url": "https://www.news-medical.net/news/20220208/Comparison-of-school-protocols-under-the-high-incidence-conditions-due-to-the-Omicron-variant.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703868_16443316724957322.jpg", "publishedAt": "2022-02-08T14:52:00Z", "content": "Now that the Omicron variant of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has spread rapidly and extensively, along with the relaxation of restrictions and protective measures,… [+5538 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "PCR data sheds light on the dynamics of interspecies pathogen-pathogen interactions - News-Medical.Net", "description": "The new study uses PCR data on 17 different pathogens, collected from clinical samples as part of the Seattle Flu Study, a community-based surveillance study of respiratory viral infections.", "url": "https://www.news-medical.net/news/20220208/PCR-data-sheds-light-on-the-dynamics-of-interspecies-pathogen-pathogen-interactions.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703859_16443275521415505.jpg", "publishedAt": "2022-02-08T13:49:00Z", "content": "An interesting new study shows that several viruses, including influenza and severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), significantly affect secondary infection or coinfection with… [+6970 chars]"}, {"source": {"id": null, "name": "Hospitalhealth.com.au"}, "author": null, "title": "SA Health, Flinders Uni test new dietary tool for cancer patients - Australian Hospital + Healthcare Bulletin", "description": "A new dietary tool to quickly and accurately assess micronutrient levels aims to help cancer patients fight disease, according to Flinders University researchers.", "url": "https://www.hospitalhealth.com.au/content/aged-allied-health/news/sa-health-flinders-uni-test-new-dietary-tool-for-cancer-patients-804454068", "urlToImage": "https://d1v1e13ebw3o15.cloudfront.net/data/65316/pool_and_spa_master/..jpg", "publishedAt": "2022-02-08T13:01:08Z", "content": "A new dietary tool to quickly and accurately assess micronutrient levels aims to help cancer patients fight disease, according to Flinders University researchers.\r\nDietary intake, specifically consum… [+2361 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | 'Revolutionary' Pacemaker Reverses Heart Failure: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A pacemaker is a small device that's placed (implanted) in the chest to help control the heartbeat. It's used to prevent the heart from beating too slowly. A recent study has elaborated on a revolutionar…", "url": "https://www.latestly.com/agency-news/science-news-revolutionary-pacemaker-reverses-heart-failure-study-3340935.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/hearrrtfailtueee20220208124034-588x441.jpg", "publishedAt": "2022-02-08T12:58:24Z", "content": "Auckland [New Zealand], February 8 (ANI): A pacemaker is a small device that's placed (implanted) in the chest to help control the heartbeat. It's used to prevent the heart from beating too slowly. A… [+4361 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Therese Raphael, Sam Fazeli", "title": "Omicron Poses a Puzzle for Vaccine Makers - BloombergQuint", "description": "Omicron Poses a Puzzle for Vaccine Makers", "url": "https://www.bloombergquint.com/gadfly/covid-omicron-variant-poses-a-puzzle-for-booster-and-vaccine-makers", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-02-08T11:22:27Z", "content": "(Bloomberg Opinion) -- As Covid restrictions come down throughout most of the advanced world even Australia is preparing to welcome international visitors again public health authorities will need to… [+5517 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Brain Stimulation Could Help Cognitive Deficits in Long-COVID - Technology Networks", "description": "Scientists have demonstrated that cognitive impairment in patients with long-COVID can be significantly improved in three to four days using alternating non-invasive brain stimulation using microcurrents.", "url": "https://www.technologynetworks.com/neuroscience/news/brain-stimulation-could-help-cognitive-deficits-in-long-covid-358332", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358332/brain-stimulation-could-help-cognitive-deficits-in-long-covid-358332-640x360.jpg?cb=20220208", "publishedAt": "2022-02-08T10:21:44Z", "content": "Many recovered COVID-19 patients continue to exhibit significant and long-lasting cognitive deficits in memory, attention, language comprehension and multitasking, as well as fatigue. These symptoms … [+4938 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Natural Compounds That Inhibit SARS-CoV-2 Discovered Using Virtual Screening - Technology Networks", "description": "A study has identified a series of natural products able to inhibit Mpro, the main protease of SARS-CoV-2.", "url": "https://www.technologynetworks.com/drug-discovery/news/natural-compounds-that-inhibit-sars-cov-2-discovered-using-virtual-screening-358302", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358302/natural-compounds-that-inhibit-sars-cov-2-discovered-using-virtual-screening-358302-640x360.jpg?cb=20220208", "publishedAt": "2022-02-08T08:58:06Z", "content": "The fight against the COVID-19 pandemic is an international scientific challenge regarding the search for strategies to fight the viral infection and prevent its damaging consequences. Besides the va… [+3507 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Prostate Cancer Parallels in Man and Dog Help Identify Druggable Pathway - Genetic Engineering & Biotechnology News", "description": "In a first-of-a-kind study of advanced prostate cancer on canine models that resemble the human disease phenotype to a much greater extent that mice that are conventionally used in laboratory studies, scientists at the University of Tokyo have discovered that…", "url": "https://www.genengnews.com/topics/translational-medicine/prostate-cancer-parallels-in-man-and-dog-help-identify-druggable-pathway/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/02/Dog-1.jpg", "publishedAt": "2022-02-08T08:00:06Z", "content": "Over 350,000 men die of prostate cancer every year. Although treatment options such as androgen deprivation therapy and chemotherapy are effective in early stages of the disease, once the disease pro… [+5016 chars]"}, {"source": {"id": null, "name": "aidsmap"}, "author": null, "title": "The social and economic benefits of universal HIV testing and treatment in rural Kenya and Uganda - aidsmap", "description": "People living with HIV in communities with universal access to HIV testing and treatment were 10% more likely to be employed than those receiving care according to national guidelines, a randomised study has shown. They were also 10% less likely to seek healt…", "url": "https://www.aidsmap.com/news/feb-2022/social-and-economic-benefits-universal-hiv-testing-and-treatment-rural-kenya-and", "urlToImage": "https://www.aidsmap.com/sites/default/files/styles/aidsmap_social_default/public/2022-02/2000x1300%20images%20aidsmap-sub-saharan-testing.png?itok=yXDlewmZ", "publishedAt": "2022-02-08T07:00:00Z", "content": "People living with HIV in communities with universal access to HIV testing and treatment were 10% more likely to be employed than those receiving care according to national guidelines, a randomised s… [+8335 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Persistent, new-onset symptoms and mental health complaints in Long COVID in a Brazilian cohort of non-hospitalized patients - BMC Infectious Diseases - BMC Infectious Diseases", "description": "Background Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infections lead to acute- and chronic Long COVID (LC) symptoms. However, few studies have addressed LC sequelae on brain functions. This study was aimed to examine if acute symptoms of co…", "url": "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-022-07065-3", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12879.jpg", "publishedAt": "2022-02-08T06:46:49Z", "content": null}, {"source": {"id": null, "name": "Racgp.org.au"}, "author": null, "title": "newsGP - Fit-tested PPE and HEPA filtration 'best protection' for health workers, study finds - RACGP", "description": "New Australian research adds further evidence that more needs to be done to protect healthcare workers from aerosol spread.", "url": "https://www1.racgp.org.au/newsgp/professional/fit-tested-ppe-and-hepa-filtration-best-protection", "urlToImage": "https://www1.racgp.org.au/getattachment/aa8d8f43-8631-453e-b2b5-bb49ba0214d9/Fit-tested-PPE-and-HEPA-filtration-best-protection.aspx", "publishedAt": "2022-02-08T06:07:51Z", "content": "News\r\nNew Australian research adds further evidence that more needs to be done to protect healthcare workers from aerosol spread.\r\nHEPA filtration combined with a fit-tested N95 mask and full PPE was… [+7207 chars]"}, {"source": {"id": null, "name": "Instylemag.com.au"}, "author": null, "title": "5 Totally Commons Causes of Hair Loss - InStyle", "description": "Hair loss can be a scary subject. On average, you lose between 100-150 strands per day, but sometimes it seems like there’s a whole lot more tangled in your hairbrush, and you’re convinced that your shedding has reached another level. Not to freak you out or …", "url": "https://www.instylemag.com.au/causes-of-hair-loss/", "urlToImage": "https://www.instylemag.com.au/wp-content/uploads/2022/02/man-pulling-hair-off-of-a-hairbrush-with-telogen-effluvium.jpg", "publishedAt": "2022-02-08T05:58:46Z", "content": "Hair loss can be a scary subject. On average, you lose between 100-150 strands per day, but sometimes it seems like theres a whole lot more tangled in your hairbrush, and youre convinced that your sh… [+4116 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Post-transplantation lung microbiome profiles can provide prognostic information - News-Medical.Net", "description": "Lung transplantation is a life-saving intervention in cases of severe respiratory failure. A feared and common complication following a lung transplant is chronic deterioration in lung function (CLAD/Chronic Lung Allograft Dysfunction).", "url": "https://www.news-medical.net/news/20220207/Post-transplantation-lung-microbiome-profiles-can-provide-prognostic-information.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Respiratory-620x480.jpg", "publishedAt": "2022-02-08T02:50:00Z", "content": "Lung transplantation is a life-saving intervention in cases of severe respiratory failure. A feared and common complication following a lung transplant is chronic deterioration in lung function (CLAD… [+2490 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "AAP", "title": "Researchers find 'acne genes', cancer link - PerthNow", "description": "Researchers have discovered genes that appear to increase a person's risk of developing acne and confirmed a link between the skin disorder and hormonal cancer.", "url": "https://www.perthnow.com.au/lifestyle/health-wellbeing/researchers-find-acne-genes-cancer-link-c-5611539", "urlToImage": "https://images.perthnow.com.au/publication/C-5611539/915ade7391aec935c4c769f6689169b8bea89a92-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-02-08T01:55:00Z", "content": "Better acne treatments may be on the horizon after researchers discovered genes that appear to increase the risk of the skin disorder.\r\nThe study from Brisbane's QIMR Berghofer Medical Research Insti… [+1611 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Amanda Vincent, Rhonda Garad", "title": "'It changed who I felt I was.' Women tell of devastation at early menopause diagnosis - The Conversation AU", "description": "Around 10% of women stop having periods and see the end of their fertile years much earlier than expected.", "url": "https://theconversation.com/it-changed-who-i-felt-i-was-women-tell-of-devastation-at-early-menopause-diagnosis-176015", "urlToImage": "https://images.theconversation.com/files/444714/original/file-20220207-999-577ipn.jpg?ixlib=rb-1.1.0&rect=0%2C352%2C5455%2C2727&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-08T00:51:00Z", "content": "For Mary*, being told shed entered menopause much earlier than expected was a shock \r\nIt was sort of like Id gone from 39 [] instead of turning 40, Id almost turned 80. So Id sort of skipped 40 years… [+5250 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Suicidal thoughts in teens linked to a variety of psychosocial problems - News-Medical.Net", "description": "Teens who have frequent suicidal thoughts are at risk for a variety of psychological and social problems, according to a new study by researchers at Massachusetts General Hospital.", "url": "https://www.news-medical.net/news/20220207/Suicidal-thoughts-in-teens-linked-to-a-variety-of-psychosocial-problems.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Abstract_medicine_background-Hilch-1000_f0a8c263e6e04ed18dfcc5ef27c17907-620x480.jpg", "publishedAt": "2022-02-08T00:26:00Z", "content": "Teens who have frequent suicidal thoughts are at risk for a variety of psychological and social problems, according to a new study by researchers at Massachusetts General Hospital (MGH). These findin… [+5610 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Testosterone could be beneficial for women - 7NEWS", "description": "Older women could be protected from developing cardiovascular disease if they have higher testosterone levels, Australian researchers have found.", "url": "https://7news.com.au/news/testosterone-could-be-beneficial-for-women-c-5610355", "urlToImage": "https://images.7news.com.au/publication/C-5610355/67eaa771c45b1a19e545176099064ff711bd0a73-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-02-08T00:17:58Z", "content": "Australian researchers are challenging the notion testosterone is a male hormone that is bad for women.\r\nHigher testosterone may actually protect older women from cardiovascular disease, a Monash Uni… [+1325 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Selenium could boost learning and memory in aging brains - News-Medical.Net", "description": "Selenium – a mineral found in many foods – could reverse the cognitive impact of stroke and boost learning and memory in aging brains, according to University of Queensland research.", "url": "https://www.news-medical.net/news/20220207/Selenium-could-boost-learning-and-memory-in-aging-brains.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Physical_Activity-620x480.jpg", "publishedAt": "2022-02-08T00:17:00Z", "content": "Selenium – a mineral found in many foods – could reverse the cognitive impact of stroke and boost learning and memory in aging brains, according to University of Queensland research.\r\nQueensland Brai… [+2256 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Cassandra Green", "title": "Trapping sperm in semen's natural gel could lead to a new contraceptive - Body and Soul", "description": "Trapping sperm in semen's natural gel could lead to a new contraceptive", "url": "https://www.bodyandsoul.com.au/health/trapping-sperm-in-semens-natural-gel-could-lead-to-new-contraceptive/news-story/97ca2ed68f871971c027ee46d11b6ae2", "urlToImage": "https://cdn.newsapi.com.au/image/v1/1e42bc51f5253841305285a7d81951a8", "publishedAt": "2022-02-07T23:01:34Z", "content": "The idea is to prevent the little swimmers being able to swim up to the egg. As researchers continue to look into new methods for effective contraception, a new non-hormonal option has arisen.\r\nThis … [+2011 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Chemists develop radical way to make it easier, more profitable to recycle plastic - Phys.org", "description": "The United States generates more plastic trash than any other country—about 46.3 million tons of it—or 287 pounds per person a year, according to a 2020 study.", "url": "https://phys.org/news/2022-02-chemists-radical-easier-profitable-recycle.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/carolina-chemists-deve.jpg", "publishedAt": "2022-02-07T20:20:21Z", "content": "The United States generates more plastic trash than any other countryabout 46.3 million tons of itor 287 pounds per person a year, according to a 2020 study.\r\nThe country's 9% rate of recycling will … [+4041 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Glaucoma: Seeing the light at the end of the (nano)tunnel - EurekAlert", "description": "A CRCHUM team reveals the fine mechanisms behind the major vascular defects observed in glaucoma patients and identifies new therapeutic targets.", "url": "https://www.eurekalert.org/news-releases/942621", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/1ab91afc-9802-4fa5-a2fc-59f90e7c972c/Rendition/thumbnail/Content/Public", "publishedAt": "2022-02-07T20:17:19Z", "content": "image: Adriana Di Polo (center), a CRCHUM researcher, professor at Universite de Montreal and holder of a Canada Research Chair in glaucoma and age-related neurodegeneration, with Luis Alarcon-Martin… [+4309 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Why Ross River virus records could tumble again - Geelong Advertiser", "description": "Subscribe to the Geelong Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://dsf.newscorpaustralia.com/geelongadvertiser/subscription/", "urlToImage": null, "publishedAt": "2022-02-07T19:03:56Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Two peanut allergy treatments for children found to be highly effective at inducing remission - News-Medical.Net", "description": "Researchers have discovered two peanut allergy treatments for children that are both highly effective at inducing remission.", "url": "https://www.news-medical.net/news/20220207/Researchers-Discover-Two-Treatments-That-Induce-Peanut-Allergy-Remission-In-Children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Peanut_Allergy-620x480.jpg", "publishedAt": "2022-02-07T16:40:00Z", "content": "Researchers have discovered two peanut allergy treatments for children that are both highly effective at inducing remission.\r\nThe research, led by the Murdoch Children's Research Institute (MCRI), fo… [+6330 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is Premenstrual Dysphoric Disorder? - News-Medical.net", "description": "PMDD is similar to PMS in that it occurs before the menstrual period, however, PMDD is more extreme.", "url": "https://www.news-medical.net/health/What-is-Premenstrual-Dysphoric-Disorder.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/Article_Images/ImageForArticle_22090_16442522647336752.jpg", "publishedAt": "2022-02-07T16:40:00Z", "content": "Introduction to PMDD\r\nPremenstrual dysphoric disorder (PMDD) sounds like a frightening thing, and it is for millions of women who suffer from this condition. PMDD is similar to premenstrual syndrome … [+5258 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "NBC", "title": "How stress harms your heart and how to avoid it - 7NEWS", "description": "Doctors worry about what all the extra long-term anxiety during the pandemic is doing to our hearts.", "url": "https://7news.com.au/lifestyle/health-wellbeing/how-stress-harms-your-heart-and-how-to-avoid-it-c-5568031", "urlToImage": "https://images.7news.com.au/publication/C-5568031/3031b3743104f180f20021c3ff1d726112babfe2-16x9-x0y110w2121h1193.jpg?imwidth=1200", "publishedAt": "2022-02-07T16:00:00Z", "content": "Whats on your mind can take a heavy toll on your heart.\r\nMental stress can increase the risk of heart disease, yet we often dont think about the brain-heart connection when it comes to preventing a h… [+6285 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Novel study aims to help kids with severe epilepsy - Medical Xpress", "description": "New research from the University of South Australia could deliver a breakthrough for children suffering one of the most severe forms of genetic epilepsy, reducing the frequency of their seizures and improving their quality of life.", "url": "https://medicalxpress.com/news/2022-02-aims-kids-severe-epilepsy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/epileptic-seizure.jpg", "publishedAt": "2022-02-07T15:19:59Z", "content": "New research from the University of South Australia could deliver a breakthrough for children suffering one of the most severe forms of genetic epilepsy, reducing the frequency of their seizures and … [+2552 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Anna Mason", "title": "Best hair loss treatment: Onion juice can help - The News Motion", "description": "Hair loss can be stressful but attempts to find solutions often add to the stress. That's because procedures can be costly and invasive, leading many people to accept their lot. However, there are natural solutions to hair loss. One that has shown pa", "url": "https://thenewsmotion.com/best-hair-loss-treatment-onion-juice-can-help/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1562174.jpg", "publishedAt": "2022-02-07T14:14:07Z", "content": "Hair loss can be stressful but attempts to find solutions often add to the stress. That’s because procedures can be costly and invasive, leading many people to accept their lot. However, there are na… [+1379 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Cyproterone acetate drug may increase benign brain tumour risk - Health Europa", "description": "A UK study has signified that high doses of cyproterone acetate may elevate the risk of benign brain tumours.", "url": "https://www.healtheuropa.eu/cyproterone-acetate-drug-may-increase-benign-brain-tumour-risk/113332/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/02/iStockundefined-undefined-1005849866.jpg", "publishedAt": "2022-02-07T13:05:41Z", "content": "Led by a team at the University of Bristol, the novel findings suggest that the drug cyproterone acetate (CPA) a hormonal treatment employed widely to combat conditions such as excessive hair growth,… [+3426 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Call for gestational diabetes testing to be reviewed - Medical Xpress", "description": "Ongoing concerns expressed by many doctors about the introduction of a one-step approach to the diagnosis of gestational diabetes mellitus (GDM) has led to a call for a review of the Australian diagnostic criteria from the authors of a Perspective published i…", "url": "https://medicalxpress.com/news/2022-02-gestational-diabetes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/2-pregnancy.jpg", "publishedAt": "2022-02-07T12:35:51Z", "content": "Ongoing concerns expressed by many doctors about the introduction of a one-step approach to the diagnosis of gestational diabetes mellitus (GDM) has led to a call for a review of the Australian diagn… [+3503 chars]"}]}