{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Bellingen Courier Sun"}, "author": null, "title": "Heart drug could boost breast cancer fight - Bellingen Courier Sun", "description": "A beta-blocker used to manage heart disorders could greatly reduce the progression of breast cancer. Researchers at Melbourne's Monash University have discove...", "url": "https://www.bellingencourier.com.au/story/7143847/heart-drug-could-boost-breast-cancer-fight/", "urlToImage": "https://www.bellingencourier.com.au/images/transform/v1/crop/frm/silverstone-feed-data/e3c0796e-15b1-43c9-8854-c41685509a60.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-25T21:58:16Z", "content": "A beta-blocker used to manage heart disorders could greatly reduce the progression of breast cancer.\r\nResearchers at Melbourne's Monash University have discovered that carvedilol could decisively inc… [+1736 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Abnormal sodium levels in hospitalized patients with COVID-19 predict death or respiratory failure: Study findings can directly affect patient care, researchers say - Science Daily", "description": "Hospitalized patients with COVID-19 and abnormal sodium levels in the blood have an increased risk of experiencing respiratory failure or dying, according to a new study.", "url": "https://www.sciencedaily.com/releases/2021/02/210225143719.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-25T21:33:30Z", "content": "Hospitalized patients with COVID-19 and abnormal sodium levels in the blood have an increased risk of experiencing respiratory failure or dying, according to a study published in the Endocrine Societ… [+3439 chars]"}, {"source": {"id": null, "name": "3AW"}, "author": null, "title": "Why the rising rate of peanut allergies in Victorian kids has slowed - 3AW", "description": "The rise of peanut allergies in Victorian kids appears to be slowing. Traditionally, parents were told to delay food that could cause allergies, such as egg and nuts, until after their first birthd…", "url": "https://www.3aw.com.au/why-the-rising-rate-of-peanut-allergies-in-victorian-kids-has-slowed/", "urlToImage": "https://www.3aw.com.au/wp-content/uploads/sites/12/2021/02/iStock-child-eating-peanuts.jpg?fit=600%2C400", "publishedAt": "2021-02-25T21:10:10Z", "content": "The rise of peanut allergies in Victorian kids appears to be slowing.\r\nTraditionally, parents were told to delay food that could cause allergies, such as egg and nuts, until after their first birthda… [+683 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Drive-thru type test to detect viral infections in bacteria - Science Daily", "description": "The pandemic has made clear the threat that some viruses pose to people. But viruses can also infect life-sustaining bacteria. A research team has developed a test to determine if bacteria are sick, similar to the one used to test humans for COVID-19.", "url": "https://www.sciencedaily.com/releases/2021/02/210225143731.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-25T20:43:33Z", "content": "The pandemic has made clear the threat that some viruses pose to people. But viruses can also infect life-sustaining bacteria and a Johns Hopkins University-led team has developed a test to determine… [+3111 chars]"}, {"source": {"id": null, "name": "Courier Mail"}, "author": "Maria Bervanakis", "title": "Queensland girl allergic to most foods - Queensland Times", "description": "At four months, Bella Gray stopped growing. Nobody knew why. This is her story and that of other brave young Aussies with rare disease.", "url": "https://www.couriermail.com.au/news/queensland/rare-disease-day-2021-sunshine-coast-teenager-bella-gray-is-allergic-to-most-foods/news-story/d6b626b726e0c1f35e2f6d5f4746cf7f", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/26/v3imagesbinbae8a6793cda5a7ec119853ddc54cda4-kobmeojiqf4dejylxv2_ct1880x930.jpg", "publishedAt": "2021-02-25T20:08:00Z", "content": "An aspiring Sunshine Coast photographer with a deadly allergy to almost all foods. A Sydney girl missing the middle area of her brain. A Melbourne teenager that's defied the odds to become one of the… [+15737 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "New Model Predicts Cancer Drug Efficacy Across and Within Cancer Types - Newswise", "description": "As large multi-cancer datasets become more important for predicting who may benefit from cancer drugs, a new model better accounts for potentially overlooked va", "url": "https://www.newswise.com/articles/new-model-predicts-cancer-drug-efficacy-across-and-within-cancer-types", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/02/25/predicted_drug_response_chart.jpg&width=100&height=100", "publishedAt": "2021-02-25T19:50:00Z", "content": "Newswise — The goal of “precision oncology” is to be able to tailor treatments to each individual patient based on their cancer’s unique molecular fingerprints.\r\nNew technologies and large, “-omics” … [+4353 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Plant-based diet can slow down heart failure, lower risk of cognitive decline and dementia - News-Medical.Net", "description": "What if you could improve your heart health and brain function by changing your diet? Boston University School of Medicine researchers have found that by eating more plant-based food such as berries and green leafy vegetables while limiting consumption of foo…", "url": "https://www.news-medical.net/news/20210225/Plant-based-diet-can-slow-down-heart-failure-lower-risk-of-cognitive-decline-and-dementia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/Assortment_of_fresh_fruits_and_vegetables_-_Image_-_Alexander_Raths_A1_3c4a26f865c44eea80b0017c2dc1c858-620x480.jpg", "publishedAt": "2021-02-25T19:35:00Z", "content": "What if you could improve your heart health and brain function by changing your diet? Boston University School of Medicine researchers have found that by eating more plant-based food such as berries … [+2767 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "El Salvador certified as malaria-free by WHO - El Salvador - ReliefWeb", "description": "English News and Press Release on El Salvador about Health; published on 25 Feb 2021 by WHO", "url": "https://reliefweb.int/report/el-salvador/el-salvador-certified-malaria-free-who", "urlToImage": "https://reliefweb.int/profiles/reliefweb/themes/kobe/images/rw-logo-social-media.png", "publishedAt": "2021-02-25T17:53:31Z", "content": "El Salvador is first Central American country to achieve this status, third in all of the Americas in recent years\r\nEl Salvador today became the first country in Central America to be awarded a certi… [+7363 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Vaccine passports: a threat to liberty or necessary safeguard? - The Guardian", "description": "<strong>Letters: </strong>Such a measure would be a backdoor attempt to bring in a form of identity cards, writes <strong>David Winnick, </strong>but<strong> </strong><strong>Mike Jones </strong>says that individual freedoms have to be tempered by social resp…", "url": "https://amp.theguardian.com/world/2021/feb/25/vaccine-passports-a-threat-to-liberty-or-necessary-safeguard", "urlToImage": null, "publishedAt": "2021-02-25T17:41:00Z", "content": "Such a measure would be a backdoor attempt to bring in a form of identity cards, writes David Winnick, butMike Jones says that individual freedoms have to be tempered by social responsibilities. Plus… [+3570 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "SARS-CoV-2 ORF7a mutation limits host immune suppression, finds study - News-Medical.Net", "description": "Researchers have identified a high variability in the C-terminal end of ORF7a in SARS-CoV-2 sequences collected from around the globe. They noted that mutations result in a defective suppression of interferon and lowered replication rate.", "url": "https://www.news-medical.net/news/20210225/SARS-CoV-2-ORF7a-mutation-limits-host-immune-suppression-finds-study.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1672274626_(2).jpg", "publishedAt": "2021-02-25T17:30:00Z", "content": "Besides the highly publicized spike protein of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), a number of other accessory proteins belonging to the virus are involved in pathogenesis b… [+4475 chars]"}, {"source": {"id": null, "name": "Insurance Business UK"}, "author": "Mark Rosanes", "title": "NTI unveils newest vehicle restoration | Insurance Business - Insurance Business AU", "description": "The truck will be raffled off to a new owner", "url": "https://www.insurancebusinessmag.com/au/news/breaking-news/nti-unveils-newest-vehicle-restoration-247635.aspx", "urlToImage": "https://cdn-res.keymedia.com/cms/images/us/026/0292_637498705957014178.jpg", "publishedAt": "2021-02-25T17:23:21Z", "content": "Don Geer, restoration and special projects lead at NTI, said the truck’s restoration took 1,500 hours and was more difficult than their previous projects because of the COVID-19 restrictions.\r\n“But I… [+1098 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Chinese nationals in Cambodia encounter occasional discrimination since latest COVID-19 cluster outbreak - Global Times", "description": "The latest COVID-19 cluster outbreak in Cambodia, which involves several confirmed Chinese patients in Phnom Penh, has led to increased prejudices and castigation against the Chinese community there. Although the exact origins linked to the virus’ resurgence …", "url": "https://www.globaltimes.cn/page/202102/1216633.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-02-05/0b85dcd5-f9df-4bda-9192-417764ce28cf.jpeg", "publishedAt": "2021-02-25T17:03:00Z", "content": "Cambodian medical staff stand near refrigeration vehicles at the Preah Ket Mealea Hospital in Phnom Penh, Cambodia, Feb. 3, 2021. A team of Chinese vaccine specialists have provided training to Cambo… [+10876 chars]"}, {"source": {"id": null, "name": "Araratadvertiser.com.au"}, "author": "Matt Coughlan", "title": "Vaccine rollout to get back on track: Hunt - Ararat Advertiser", "description": "Australians have been urged to remain calm about the coronavirus vaccine rollout despite two elderly nursing home residents being given an overdose. Healthcar...", "url": "https://www.araratadvertiser.com.au/story/7143720/calls-for-calm-after-virus-vaccine-bungle/", "urlToImage": "https://www.araratadvertiser.com.au/images/transform/v1/crop/frm/silverstone-feed-data/59d7704f-04be-4a84-86e6-8b3c3ed47d19.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-25T16:30:52Z", "content": ""}, {"source": {"id": null, "name": "Macarthuradvertiser.com.au"}, "author": "Tim Dornin", "title": "South Aust drops last COVID-19 border ban - Campbelltown Macarthur Advertiser", "description": "South Australia has lifted the last of its national COVID-19 travel restrictions, clearing the way for people from Greater Melbourne to enter the state. From...", "url": "https://www.macarthuradvertiser.com.au/story/7143717/south-aust-drops-last-covid-19-border-ban/", "urlToImage": "https://www.macarthuradvertiser.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c2d7e771-478e-442c-8002-174c686bc7c9.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-25T16:30:21Z", "content": "South Australia has lifted the last of its national COVID-19 travel restrictions, clearing the way for people from Greater Melbourne to enter the state.\r\nFrom Friday those arrivals won't need to quar… [+1040 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Connor Parker", "title": "What are the underlying health conditions for getting a COVID vaccine sooner? - Yahoo New Zealand News", "description": "Over seven million people are in vaccine priority group six, which includes people who are aged 16 to 65 years old in an at-risk group.", "url": "https://nz.news.yahoo.com/what-are-the-underlying-health-conditions-for-getting-a-covid-vaccine-sooner-161803182.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/oK08m1NyctFeTA_lKU7I4A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-uploaded-images/2021-02/efe5ad80-7783-11eb-93dd-f4e813ac3072", "publishedAt": "2021-02-25T16:18:03Z", "content": "The top four priority groups have already been offered a vaccine. (PA)\r\nAll people with underlying health conditions are currently being offered COVID vaccines but as a key indicator of being at risk… [+4962 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Human rights law can provide a transparent and fair framework for vaccine allocations - EurekAlert", "description": "As Governments around the world wrestle with the question of designing a fair system to allocate their COVID-19 vaccine supplies for maximum protection against the pandemic, a team of researchers led by Dr Sharifah Sekalala of Warwick Law School propose that …", "url": "https://www.eurekalert.org/pub_releases/2021-02/uow-hrl022521.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-02-25T16:05:12Z", "content": "Human rights law can provide a transparent and fair framework for vaccine allocations, researchers suggest. \r\n<ul>-All countries face the ethical challenge of how to allocate limited supplies of safe… [+5065 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study addresses COVID-19 pandemic concerns and guidelines for increasing food safety - News-Medical.Net", "description": "A team of researchers from the United States Department of Agriculture examined how the COVID-19 pandemic has changed food practices and safety protocols for workers in food-processing plants.", "url": "https://www.news-medical.net/news/20210225/Study-addresses-COVID-19-pandemic-concerns-and-guidelines-for-increasing-food-safety.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1911675043.jpg", "publishedAt": "2021-02-25T15:34:00Z", "content": "A team of researchers from the United States Department of Agriculture examined how the coronavirus disease 2019 (COVID-19) pandemic has changed food practices and safety protocols for workers in foo… [+4849 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Czech Republic confirms first case of COVID-19 South African... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/CZECH-VARIANTS:Czech Republic confirms first case of COVID-19 South African variant", "url": "https://news.trust.org/item/20210225133818-xxafw/", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/e6617cbe-8749-46ab-a554-133223f7c9c9/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-02-25T14:40:00Z", "content": "PRAGUE, Feb 25 (Reuters) - The Czech Republic has confirmed its first case of the COVID-19 variant first detected in South Africa, the Health Ministry said on Thursday.\r\nThe ministry had reported som… [+556 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Two-Thirds of COVID-19 Hospitalizations Are Due to These Four Conditions - SciTechDaily", "description": "Model suggests higher risk based on race and age, offers insights to reduce disease impact. A modeling study suggests a majority of adult COVID-19 hospitalizations nationwide are attributable to at least one of four pre-existing conditions: obesity, hypertens…", "url": "https://scitechdaily.com/two-thirds-of-covid-19-hospitalizations-are-due-to-these-four-conditions/", "urlToImage": "https://scitechdaily.com/images/Four-Pre-existing-Conditions-COVID-19-Hospitalizations.jpg", "publishedAt": "2021-02-25T14:00:15Z", "content": "Study suggests COVID-19 hospitalizations could have been prevented without four common pre-existing conditions. Credit: Gerald J. and Dorothy R. Friedman School of Nutrition Science and Policy at Tuf… [+7924 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Anti-phospholipid antibodies in severely ill patients not distinctive to COVID-19, says study - News-Medical.Net", "description": "A new study by researchers at the University of Toronto and the University of Calgary in Canada indicates that the presence of these antibodies correlates with more severe COVID-19 symptoms and signs.", "url": "https://www.news-medical.net/news/20210225/Anti-phospholipid-antibodies-in-severely-ill-patients-not-distinctive-to-COVID-19-says-study.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1643947495_(4).jpg", "publishedAt": "2021-02-25T13:51:00Z", "content": "Recent research indicates the occurrence of thromboembolic complications involving anti-phospholipid antibodies (APLA) and the anti-phospholipid syndrome (APS) in severe coronavirus disease 2019 (COV… [+4986 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Flu gets the cold shoulder: Influenza now virtually non-existent in US as Covid-19 spread continues - RT", "description": "The coronavirus-battered US has enjoyed an unusually calm flu season, showing the lowest figures in decades. The lack of influenza likely stems from enduring restrictions – or Covid-19 wrestling out weaker germs, experts believe.", "url": "https://www.rt.com/usa/516540-coronavirus-no-flu-season/", "urlToImage": "https://cdni.rt.com/files/2021.02/article/603796a720302705c90abfa5.jpg", "publishedAt": "2021-02-25T12:39:00Z", "content": "The ongoing pandemic has had an unexpected effect on the US healthscape, with the conventional flu being almost completely wiped out. Figures from the US Centers for Disease Control and Prevention (C… [+2271 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "EU leaders seek to inject energy into slow vaccine rollout - Republic World", "description": "European Union leaders are gathering Thursday to try to inject new energy into the bloc’s lagging coronavirus vaccination efforts as concern mounts that new variants might spread faster than authorities can adapt.", "url": "https://www.republicworld.com/world-news/europe/eu-leaders-seek-to-inject-energy-into-slow-vaccine-rollout.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/gcwrxbwj7rxvfch8_1614254594.jpeg?tr=f-jpeg", "publishedAt": "2021-02-25T12:03:00Z", "content": "BRUSSELS (AP) — European Union leaders are gathering Thursday to try to inject new energy into the bloc’s lagging coronavirus vaccination efforts as concern mounts that new variants might spread fast… [+3463 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sugar-Coated Shield Helps the COVID-19 Virus Become Activated and Infectious - SciTechDaily", "description": "SARS-CoV-2, the virus that causes COVID-19, is coated with sugars called glycans, which help it evade the immune system. New research shows precisely how those sugars help the virus become activated and infectious and could help with vaccine and drug discover…", "url": "https://scitechdaily.com/sugar-coated-shield-helps-the-covid-19-virus-become-activated-and-infectious/", "urlToImage": "https://scitechdaily.com/images/SARS-CoV2-Sugar-Coated-Shield.jpg", "publishedAt": "2021-02-25T12:00:58Z", "content": "Image of the SARS-CoV-2 spike in the active position. Dark blue glycans shield the spike from the immune system, participate in activation, and stabilize the active form. The receptor binding domain … [+2898 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Fraudsters offer 400 million 'ghost' COVID vaccines in EU - ... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/EU-VACCINES (PIX):Fraudsters offer 400 million 'ghost' COVID vaccines in EU - officials", "url": "https://news.trust.org/item/20210225105135-xfjfk/", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/2540bb1c-cdc6-4c07-afc6-13f9c0e3ed7e/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-02-25T11:53:00Z", "content": "BERLIN/BRUSSELS, Feb 25 (Reuters) - Fraudsters have offered 400 million doses of COVID-19 vaccines worth some 3 billion euros to European Union countries, two officials, showing how criminals seek to… [+1605 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Australia undergoes COVID-19 vaccine supply problems - MENAFN.COM", "description": "Australian top scientists have cautioned that the state is endangered of COVID-19 vaccine scarcities.<br />\n<br />\nAustralia and the nearby region would stay exposed to supply issues provided that onshore vaccine producing abilities were enhanced, cautioned t…", "url": "https://menafn.com/1101659946/Australia-undergoes-COVID-19-vaccine-supply-problems&source=30", "urlToImage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_PharmaHealth_39_menafn.jpg", "publishedAt": "2021-02-25T09:46:17Z", "content": "Australia undergoes COVID-19 vaccine supply problems\r\n(MENAFN) Australian top scientists have cautioned that the state is endangered of COVID-19 vaccine scarcities.\r\nAustralia and the nearby region w… [+787 chars]"}, {"source": {"id": null, "name": "Themercury.com.au"}, "author": null, "title": "Coronavirus Qld: COVID-19 fragments found in Brisbane sewage - The Mercury", "description": "Subscribe to The Mercury to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.themercury.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-25T09:13:00Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New vaccine, enhanced surveillance needed to combat childhood pneumonia - News-Medical.net", "description": "A rise in vaccine-resistant bacteria shows the need for a new vaccine to fight childhood empyema after a spike in hospitalisations, a new UNSW study reveals.", "url": "https://www.news-medical.net/news/20210225/New-vaccine-enhanced-surveillance-needed-to-combat-childhood-pneumonia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/pr-4.jpg", "publishedAt": "2021-02-25T07:21:00Z", "content": "A rise in vaccine-resistant bacteria shows the need for a new vaccine to fight childhood empyema after a spike in hospitalizations, a new UNSW study reveals.\r\nA UNSW Sydney-led medical research team … [+4836 chars]"}, {"source": {"id": null, "name": "Moreechampion.com.au"}, "author": null, "title": "Latest snapshot of the coronavirus impact - Moree Champion", "description": "LATEST COVID-19 DEVELOPMENTS: * One of the companies responsible for Australia's coronavirus vaccine rollout could have its contract torn up, after two elderl...", "url": "https://www.moreechampion.com.au/story/7143578/latest-snapshot-of-the-coronavirus-impact/", "urlToImage": "https://www.moreechampion.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c4f68d82-ed9e-4c58-a702-da16a3bcbf20.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-25T06:39:53Z", "content": "LATEST COVID-19 DEVELOPMENTS:\r\n* One of the companies responsible for Australia's coronavirus vaccine rollout could have its contract torn up, after two elderly people in a Queensland aged care home … [+1726 chars]"}, {"source": {"id": null, "name": "Racgp.org.au"}, "author": null, "title": "newsGP - Melbourne GPs told to consider Buruli ulcers when assessing skin lesions - RACGP", "description": "The flesh-eating infections are the result of bacteria that is thought to be transmitted by mosquitoes.", "url": "https://www1.racgp.org.au/newsgp/clinical/buruli-ulcers-discovered-in-non-coastal-areas-in-v", "urlToImage": "https://www1.racgp.org.au/getattachment/a553b949-2d89-499d-82db-3f3b2421badf/Buruli-ulcers-discovered-in-non-coastal-areas-in-V.aspx", "publishedAt": "2021-02-25T05:02:49Z", "content": "News\r\nThe flesh-eating infections are the result of bacteria that is thought to be transmitted by mosquitoes.\r\nMosquitoes are thought to be the key vectors of Mycobacterium ulcerans.\r\nBuruli ulcers h… [+4812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Mass 'real world' study confirms Pfizer Covid vaccine 94% effective - Times of India", "description": "Rest of World News: The Pfizer Covid-19 vaccine proved 94 per cent effective in a huge real world study published Wednesday that involved 1.2 million people in Israel, co", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/mass-real-world-study-confirms-pfizer-covid-vaccine-94-effective/articleshow/81202783.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81202794,width-1070,height-580,imgsize-140180,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-25T04:20:00Z", "content": null}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "Suggestions on cleavage embryo and blastocyst vitrification/transfer based on expression profile of ACE2 and TMPRSS2 in current COVID‐19 pandemic - Wiley", "description": "An outbreak of severe acute respiratory syndrome coronavirus 2 (SARS‐CoV‐2) is leading to an unprecedented worldwide health crisis. SARS‐CoV‐2 cell entry depends on ACE2 and TMPRSS2. Our objectives a...", "url": "https://onlinelibrary.wiley.com/doi/10.1002/mrd.23456", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/9f236b45-3799-4259-9bee-3c10dc6bb605/mrd.v88.1.cover.jpg", "publishedAt": "2021-02-25T03:19:48Z", "content": "Abbreviations\r\n<li>ART</li>\r\n<li>assisted reproductive technology</li>\r\n<li>COVID19</li>\r\n<li>coronavirus disease2019</li>\r\n<li>SARSCoV2</li>\r\n<li>severe acute respiratory syndrome coronavirus 2</li>… [+21570 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "AFP", "title": "Large real world study confirms Pfizer Covid vaccine could 'end pandemic' - Khaleej Times", "description": "The Pfizer Covid-19 vaccine has proven 94 per cent effective in a study involving 1.2 million people in Israel, the first peer-reviewed real world re...", "url": "https://www.khaleejtimes.com/coronavirus-pandemic/in-boost-for-covid-19-battle-pfizer-vaccine-found-94-effective-in-real-world", "urlToImage": "https://images.khaleejtimes.com/storyimage/KT/20210225/ARTICLE/210229412/AR/0/AR-210229412.jpg&NCS_modified=20210225065836&exif=.jpg", "publishedAt": "2021-02-25T03:01:38Z", "content": "The Pfizer Covid-19 vaccine has proven 94 per cent effective in a study involving 1.2 million people in Israel, the first peer-reviewed real world research confirming the power of mass immunization c… [+2793 chars]"}, {"source": {"id": null, "name": "1News"}, "author": null, "title": "Residence of latest family to test positive for Covid-19 was open for viewing last weekend - 1News", "description": "The property was toured by four people last Saturday, according to the Ministry of Health.", "url": "https://www.tvnz.co.nz/one-news/new-zealand/residence-latest-family-test-positive-covid-19-open-viewing-last-weekend", "urlToImage": "https://news-image-prod-imgix.tech.tvnz.co.nz/content/dam/images/news/2021/02/25/latest-family-diagnosed-with-covid-19-held-home-viewing-at-the-w.hashed.e50d2f7d.desktop.story.share.jpg", "publishedAt": "2021-02-25T02:26:03Z", "content": "The Ministry of Health has revealed today that there was a private home viewing at the residence of the latest family to have tested positive for Covid-19.\r\nYour playlist will load after this ad\r\nBut… [+1998 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "AAP", "title": "New coronavirus variant found in New York - PerthNow", "description": "A new coronavirus variant that's spreading in New York City shares some worrying characteristics with the South African mutation, according to scientists.", "url": "https://www.perthnow.com.au/news/health/new-coronavirus-variant-found-in-new-york-ng-s-2051011", "urlToImage": "https://images.perthnow.com.au/publication/S-2051011/1614216939795_Virus_US_Variant_16-9_20461563_2051011_2021022512023251197e7e-3ce9-47f8-a194-e48eed437312.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2021-02-25T01:34:00Z", "content": "A new coronavirus variant that shares some similarities with a more transmissible and intractable variant discovered in South Africa is on the rise in New York City, researchers say.\r\nThe new variant… [+1695 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Could the COVID-19 vaccine become a pill? - The World Today - ABC News", "description": "If you're scared of needles - perhaps the idea of taking a pill to protect yourself against COVID-19 is more appealing. Or how about a nasal spray? The developers of the Oxford University/Astrazeneca vaccine have revealed they're considering making the drug i…", "url": "https://www.abc.net.au/radio/programs/worldtoday/covid-pill/13191816", "urlToImage": "https://www.abc.net.au/cm/rimage/9711384-1x1-large.jpg?v=3", "publishedAt": "2021-02-25T01:00:00Z", "content": "Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume."}, {"source": {"id": null, "name": "The Age"}, "author": "Melissa Cunningham", "title": "Surge in serious respiratory illness among children puts doctors on high alert - The Age", "description": "Doctors are observing an alarming rise in the number of Victorian children presenting to emergency departments with a respiratory illness that can cause pneumonia.", "url": "https://www.theage.com.au/national/victoria/doctors-on-high-alert-after-surge-in-serious-respiratory-illness-among-children-20210224-p575cu.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/57e843b108e8f31faa1c9e41d379ccd9b8f9f013", "publishedAt": "2021-02-25T00:37:36Z", "content": "There is definitely a surge in children presenting with RSV across the entire healthcare system, Dr Cubbit said.\r\nIn other words, there are clearly a large number of sick kids needing acute care at t… [+4539 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Natalie Wolfe", "title": "Coronavirus vaccine pill: Johnson & Johnson, Oxford AstraZeneca developing new product - NEWS.com.au", "description": "Coronavirus vaccine pill: Johnson &amp; Johnson, Oxford AstraZeneca developing new product", "url": "https://www.news.com.au/lifestyle/health/coronavirus-vaccines-major-breakthroughs-in-johnson-johnson-oxford-astrazeneca/news-story/672c07a614c19eb020f54d6809aec422", "urlToImage": "https://cdn.newsapi.com.au/image/v1/8100b409f747ef9d88e4014c36f4dea3?width=1280", "publishedAt": "2021-02-25T00:14:17Z", "content": "Medical professionals continue to find new and easier ways to get the coronavirus vaccine to the worlds population with one company looking at whether the lifesaving substance can be taken in pill fo… [+3304 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "English survey finds high antibody levels from Pfizer ... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/BRITAIN-VACCINE-ANTIBODIES (PIX):English survey finds high antibody levels from Pfizer vaccine roll-out", "url": "https://news.trust.org/item/20210224225858-0goe1/", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/bc7a8cfb-73dc-4e95-9500-fb32c02463d2/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-02-25T00:01:00Z", "content": "LONDON, Feb 25 (Reuters) - People in England who have received two doses of Pfizer COVID-19 vaccine are generating strong antibody responses as the shot is rolled out, researchers said on Thursday, a… [+1739 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": null, "title": "Covid updates: Vaccine scientists could make pills or nasal sprays after PM reveals lockdown roadmap - MSN UK", "description": "We could one day be vaccinated against coronavirus by taking a tablet or using a nasal spray – with the scientists behind the Oxford vaccine currently exploring the possibility of these “second generation formulations”. Following comments from the UK’s former…", "url": "https://www.indy100.com/news/covid-news-live-coronavirus-vaccine-update-b1806796", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1dYOVJ.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2021-02-24T22:50:11Z", "content": "We could one day be vaccinated against coronavirus by taking a tablet or using a nasal spray with the scientists behind the Oxford vaccine currently exploring the possibility of these second generati… [+715 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Scientists discover 'devil' COVID strain - Daily Mercury", "description": "A new coronavirus variant called the “devil” by a scientist appears to be deadlier, spreads more easily, and could weaken vaccine efficacy.", "url": "https://www.news.com.au/world/coronavirus/health/californian-covid-variant-is-the-devil-its-deadlier-and-more-transmissible-scientists-warn/news-story/842481d47ae26ca6d3aefe06d795bc81", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/25/v3imagesbin5a644a90b4c8823cf72dc766312b2859-3sws2moxpg0l33afxv2_ct1880x930.jpg", "publishedAt": "2021-02-24T22:50:00Z", "content": "The new coronavirus variant from California appears to be deadlier, spreads more easily, and could weaken vaccine efficacy.\r\nScientists labelled the strain as \"the devil\" after their alarming discove… [+3552 chars]"}, {"source": {"id": null, "name": "Gold Coast Bulletin"}, "author": null, "title": "COVID-19 Gold Coast: When mass vaccination centres will open, GPs to administer AstraZeneca - Gold Coast Bulletin", "description": "Subscribe to the Gold Coast Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.goldcoastbulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-24T22:18:42Z", "content": null}, {"source": {"id": null, "name": "KMJ Now"}, "author": null, "title": "Oxford Researchers Eye COVID-19 Nasal Sprays and Pills - KMJ Now", "description": "Oxford Researchers Eye COVID-19 Nasal Sprays and Pills", "url": "https://www.kmjnow.com/news/oxford-researchers-eye-covid-19-nasal-sprays-and-pills/", "urlToImage": null, "publishedAt": "2021-02-24T16:59:54Z", "content": "The research team from Oxford University that helped develop the COVID-19 vaccine with AstraZeneca is now looking at the possibility of creating nasal sprays or tablets to fight the virus.\r\nGiving a … [+1497 chars]"}, {"source": {"id": null, "name": "The Advertiser"}, "author": null, "title": "Warning as mystery flesh-eater spreads - The Advertiser", "description": "Subscribe to The Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.adelaidenow.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-24T08:15:19Z", "content": null}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Stuart Layt", "title": "Side-effects unlikely from vaccine mistake in Brisbane aged-care home, expert says - Brisbane Times", "description": "A vaccine expert says two aged care residents are unlikely to experience any adverse effects from being administered a too much of the coronavirus vaccine.", "url": "https://www.brisbanetimes.com.au/national/queensland/side-effects-unlikely-from-vaccine-mistake-in-brisbane-aged-care-home-20210224-p575jx.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.8306%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/70c4a87d1b3e26b5f1ca2c628f797a822cc69352", "publishedAt": "2021-02-24T07:39:15Z", "content": "The adverse effects dont track linearly with a higher doses, but we may expect those effects to perhaps be exacerbated in a higher dose, things like swelling and tenderness at the injection site, he … [+2749 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "NCA NewsWire", "title": "Queensland vaccine overdosing incident, doctor stood down - PerthNow", "description": "There has been a shocking new revelation in the case of the doctor stood down for giving two Queensland people an overdose of the COVID-19 vaccine.", "url": "https://www.perthnow.com.au/lifestyle/fitness/queensland-vaccine-overdosing-incident-doctor-stood-down-ng-2e92702c455826c39268e266173b773c", "urlToImage": "https://images.perthnow.com.au/publication/2E92702C455826C39268E266173B773C/1614195388226_fd62f8a1d3c557fac09678ecd3ea7499.jpeg?imwidth=1024", "publishedAt": "2021-02-24T06:25:00Z", "content": "There has been a shocking new revelation in the case of the doctor stood down for giving two Queensland people an overdose of the COVID-19 vaccine.\r\nSpeaking to parliament on Wednesday, Health Minist… [+4558 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "‘Never a priority’: Filipinos in low spirits after Mon Tulfo admits receiving COVID-19 jab last year - Interaksyon", "description": "Filipinos lamented another disregard to the COVID-19 vaccination priority list after Ramon \"Mon\" Tulfo, the government's special envoy for public", "url": "https://interaksyon.philstar.com/politics-issues/2021/02/24/186205/never-a-priority-filipinos-in-low-spirits-after-mon-tulfo-admits-receiving-covid-19-jab-last-year/", "urlToImage": "https://media.interaksyon.com/wp-content/uploads/2021/02/Mon-Tulfo.jpg", "publishedAt": "2021-02-24T06:20:23Z", "content": "Filipinos lamented another disregard to the COVID-19 vaccination priority list after Ramon “Mon” Tulfo, the government’s special envoy for public diplomacy to China, admitted that he was inoculated w… [+4897 chars]"}, {"source": {"id": null, "name": "Theislanderonline.com.au"}, "author": "Tracey Ferrier", "title": "Viral infection hits 15 childcare centres - The Islander", "description": "Urgent testing is under way to find out what's behind a spike in hand, foot and mouth disease in far north Queensland, where 15 childcare centres have been af...", "url": "https://www.theislanderonline.com.au/story/7140715/viral-infection-hits-15-childcare-centres/", "urlToImage": "https://www.theislanderonline.com.au/images/transform/v1/crop/frm/silverstone-feed-data/e75c1588-b008-4d4f-ae15-2335e56fd463.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-24T04:50:36Z", "content": "Urgent testing is under way to find out what's behind a spike in hand, foot and mouth disease in far north Queensland, where 15 childcare centres have been affected.\r\nCairns and the nearby Tablelands… [+1463 chars]"}, {"source": {"id": null, "name": "Bega District News"}, "author": "Rebecca Gredley", "title": "Qld doc did not do COVID-19 jab training - Bega District News", "description": "The Queensland doctor who gave two aged care residents excessive doses of the coronavirus vaccine had not completed the mandatory training, the federal health...", "url": "https://www.begadistrictnews.com.au/story/7140208/qld-doc-did-not-do-covid-19-jab-training/", "urlToImage": "https://www.begadistrictnews.com.au/images/transform/v1/crop/frm/silverstone-feed-data/757ac449-18ca-4bde-8a32-15b7439f2a1c.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-24T04:49:26Z", "content": ""}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Marissa Calligeros, Kate Rose", "title": "Coronavirus updates LIVE: Queensland nursing home patients receive accidental overdoses of Pfizer vaccine; restrictions to ease in NSW from Friday - The Age", "description": "Two elderly people in a Queensland nursing home have accidentally received overdoses of the Pfizer coronavirus vaccine. An 88-year-old man and a 94-year-old woman were given more than the recommended dose, but both are ‘doing well’, Australia’s Chief Medical …", "url": "https://www.smh.com.au/national/coronavirus-updates-live-new-covid-cases-in-auckland-morrison-government-won-t-budge-on-jobseeker-s-25-a-week-rise-tga-bans-brand-name-vaccine-advertising-20210224-p5759t.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3027%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_16/t_crop_custom/q_86%2Cf_auto/t_theage_live_no_age_social_wm/6a6cfac21400a1920f09e16a08cbfd7496c05f41", "publishedAt": "2021-02-24T01:53:38Z", "content": "Opposition Health spokesman Mark Butler has questioned the standards of private health contractors tasked with administering the Pfizer vaccine roll-out to aged care residents, after todays revelatio… [+1060 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research predicts which mammal species can spread SARS-CoV-2 - News-Medical.Net", "description": "Scientists worldwide are fighting to contain the ongoing COVID-19 pandemic, which has already claimed more than 2.48 million lives. Preventing spillback infections is essential to containing the pandemic. To do so, it is vital to understand the nature of the …", "url": "https://www.news-medical.net/news/20210223/Research-predicts-which-mammal-species-can-spread-SARS-CoV-2.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2020/7/shutterstock_380448283.jpg", "publishedAt": "2021-02-24T01:49:00Z", "content": "Scientists worldwide are fighting to contain the ongoing COVID-19 pandemic, which has already claimed more than 2.48 million lives. Preventing spillback infections is essential to containing the pand… [+4989 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Sally Whyte", "title": "Coronavirus vaccine administered incorrectly, doctor stood down - Western Advocate", "description": "Two elderly aged care residents were given overdoses of the coronavirus vaccine.", "url": "https://www.canberratimes.com.au/story/7140486/stood-down-doctor-didnt-do-vaccine-training-before-giving-incorrect-doses/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/3BUUzmFAhrhLyX9rFCubPq5/13d7c54a-fc23-45ba-a017-fe60b821ae15.jpg/r3_307_5998_3694_w1200_h678_fmax.jpg", "publishedAt": "2021-02-23T23:00:00Z", "content": "Two aged care residents in Queensland were mistakenly given too much of the Pfizer COVID-19 vaccine. Picture: Shutterstock"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Olivia Lambert", "title": "'Extremely concerning': Two patients given Covid vaccine overdoses - Yahoo News Australia", "description": "Two elderly aged care residents have been given what was believed to be four times the required dose of the Covid-19 vaccine.", "url": "https://au.news.yahoo.com/shocking-cases-of-covid-vaccine-overdose-revealed-225746089.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/50a6a730-7637-11eb-bffc-4503864f23a6", "publishedAt": "2021-02-23T22:57:46Z", "content": "Two elderly aged care residents have been given an excessive amount of the Covid-19 vaccine, believed to be four times the required amount, after a bungle in Queensland.\r\nHealth Minister Greg Hunt co… [+3509 chars]"}, {"source": {"id": null, "name": "Courier Mail"}, "author": null, "title": "Elderly given COVID vaccine overdoses at Qld nursing home - Morning Bulletin", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-23T22:43:00Z", "content": null}]}