{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Anna Mason", "title": "Vitamin B12: Symptoms may include a ‘chronic’ and ‘dry’ cough - The News Motion", "description": "B12 is naturally found in food from animal origins, but fortified cereals also have an active effect. In the initial stages, someone with a deficiency may experience constant mood changes that may affect their quality of life. Further down the line,", "url": "https://thenewsmotion.com/vitamin-b12-symptoms-may-include-a-chronic-and-dry-cough/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1561908.jpg", "publishedAt": "2022-02-07T00:00:08Z", "content": "B12 is naturally found in food from animal origins, but fortified cereals also have an active effect. In the initial stages, someone with a deficiency may experience constant mood changes that may af… [+2998 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Venomous Australian sea anemone may lead to life-saving drugs: 84 potential toxins located in tentacles, gut and body of Australian reef-based sea anemone. - Science Daily", "description": "An entirely new toxic compound found in an Australian tropical sea anemone is being analysed as a potential new drug therapy, after it was discovered by biomolecular scientists during investigation of the species' multiple venoms.", "url": "https://www.sciencedaily.com/releases/2022/02/220206154434.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-06T23:50:30Z", "content": "An entirely new toxic compound found in an Australian tropical sea anemone is being analysed as a potential new drug therapy, after it was discovered by biomolecular scientists during investigation o… [+3400 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "One in four Australian workers suffer 'ringing ears', survey shows - Science Daily", "description": "As many as half a million Australians are suffering from constant tinnitus, with farmers, automotive workers, transport drivers, construction workers and other trades people at the greatest risk, a national survey has found.", "url": "https://www.sciencedaily.com/releases/2022/02/220206154429.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-06T23:46:40Z", "content": "As many as half a million Australians are suffering from constant tinnitus, with farmers, automotive workers, transport drivers, construction workers and other trades people at the greatest risk, a n… [+2553 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Cassandra Green", "title": "Urologist on why COVID can shrink your penis - Body and Soul", "description": "Urologist on why COVID can shrink your penis", "url": "https://www.bodyandsoul.com.au/health/urologist-on-why-covid-can-shrink-your-penis/news-story/38f9933dac6ef13e9c7a9222075d4ed3", "urlToImage": "https://cdn.newsapi.com.au/image/v1/62331ff363288910d1f3cf5a2c656ec8", "publishedAt": "2022-02-06T22:42:50Z", "content": "We investigate rumours that ED post-Covid could impact length long-term.We’ve heard of Covid toe, Covid hair loss, Covid periods and the dreaded long Covid, but this new side effect reported from doc… [+2324 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "AFP", "title": "‘Highly virulent’ new HIV strain circulating - NEWS.com.au", "description": "<p>Oxford researchers have announced the discovery of a highly virulent strain of HIV that has been lurking in the Netherlands for decades, but because of the effectiveness of modern treatments, they say there is &ldquo;no cause for alarm&rdquo;.</p>", "url": "https://www.news.com.au/technology/science/human-body/highly-virulent-new-hiv-strain-discovered-in-the-netherlands/news-story/601b94fcb088bf78eef874a886e3258e", "urlToImage": "https://content.api.news/v3/images/bin/141e01fc9581985521d925d8d6563c95", "publishedAt": "2022-02-06T22:04:24Z", "content": "A new, exceptionally virulent strain of HIV has been discovered but scientists stress there is no cause for alarm.Oxford researchers have announced the discovery of a highly virulent strain of HIV th… [+5173 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Vitamin D: How many times do you pee? Sign you may have had too many supplements - Daily Express", "description": "FROM the months of September to April vitamin D supplements are recommended to boost the immune system. However, too much of a good thing can be an unhealthy thing. Vitamin D is no different.", "url": "https://www.express.co.uk/life-style/health/1561864/vitamin-d-toxicity-symptoms-frequent-urination", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1561864.jpg", "publishedAt": "2022-02-06T21:10:46Z", "content": "The NHS recommends that the maximum amount of vitamin D a person should consume in the winter is 4,000IU/100 micrograms.\r\nSide effects that can occur as a result of overdosing on vitamin D can includ… [+1110 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Alzheimer's-like changes found in COVID patients' brains; flu shot, mRNA booster safe together - Devdiscourse", "description": "Following is a summary of current science news briefs.  Alzheimer's-like changes found in COVID patients' brains; flu shot, mRNA booster safe together  The following is a summary of some recent studies on COVID-19.\r\nThey include research that warrants further…", "url": "https://www.devdiscourse.com/article/science-environment/1912594-science-news-roundup-alzheimers-like-changes-found-in-covid-patients-brains-flu-shot-mrna-booster-safe-together", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_02_2022_18_17_06_230866.jpg?width=920&format=jpeg", "publishedAt": "2022-02-06T21:00:37Z", "content": "Following is a summary of current science news briefs.\r\nAlzheimer's-like changes found in COVID patients' brains; flu shot, mRNA booster safe together\r\nThe following is a summary of some recent studi… [+302 chars]"}, {"source": {"id": null, "name": "WBBJ-TV"}, "author": null, "title": "Health officials say omicron cases peaking, stay cautious - WBBJ TV - WBBJ-TV", "description": "JACKSON, Tenn. -- Health officials with Johns Hopkins Bloomberg School of Public Health have an update on the recent COVID-19 variants.", "url": "https://www.wbbjtv.com/2022/02/06/health-officials-say-omicron-cases-peaking-stay-cautious/", "urlToImage": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.wbbjtv.com/content/uploads/2022/02/i/t/screen-shot-2022-02-03-at-51814-pm.png", "publishedAt": "2022-02-06T20:30:55Z", "content": "JACKSON, Tenn. — Health officials with Johns Hopkins Bloomberg School of Public Health have an update on the recent COVID-19 variants.\r\nAs the omicron variant continues to spread rapidly, health offi… [+2224 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Madhukar Pai", "title": "Double Agents In Global Health - Forbes", "description": "'Double agents' in global health straddle two worlds, and try to bridge them. While they enjoy some privileges, they also deal with conflicts and challenges", "url": "https://www.forbes.com/sites/madhukarpai/2022/02/06/double-agents-in-global-health/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/61ff0c8fb28b1ea512b672f0/0x0.jpg?format=jpg&width=1200&fit=bounds", "publishedAt": "2022-02-06T19:26:35Z", "content": "A dancer performs next to a globe during an UN Climate Change Conference 2007 in Nusa Dua, on Bali ... [+] island, 05 December 2007. T AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP … [+18190 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Simon Leo Brown, Annabelle Quince", "title": "The history of dieting by calorie counting shows why it should stay in the past, experts say - ABC News", "description": "Experts say the diet industry's obsessive focus on counting calories may have actually made us fatter. Understanding how it came to be offers an explanation", "url": "https://www.abc.net.au/news/2022-02-07/calorie-counting-weight-loss-history/100800850", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/6ad112970d7706fbf6cfac28bb5669c4?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=5&width=862&height=485", "publishedAt": "2022-02-06T18:00:00Z", "content": "Calorie counting has been the basis of weight-loss programs for more than a century.\r\nIt's still a popular way to approach losing weight, whether it be keeping below a certain calorie limit on fastin… [+8212 chars]"}, {"source": {"id": null, "name": "BizNews"}, "author": "Alec Hogg", "title": "The GP’s perspective – Dr Sheri Fanaroff on living with Omicron, SA’s new regulations - BizNews", "description": "Nearly two years into Covid-19, what's become clear is constant need to change and adapt responses as the virus continually modifies itself.", "url": "https://www.biznews.com/thought-leaders/2022/02/06/living-covid-19-sheri-fanaroff", "urlToImage": "https://www.biznews.com/wp-content/uploads/2021/11/SA-covid-WP-image-.jpg", "publishedAt": "2022-02-06T17:44:33Z", "content": "I’m a huge fan of experiential writing – pieces from those who share real life engagement through the stories they share with the rest of us. Dr Sheri Fanaroff is a self-employed Wits educated GP wit… [+10758 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Duncan Campbell", "title": "More than half of NHS paramedics suffering from burnout, study finds - The Guardian", "description": "Heavy workload, record 999 calls and inadequate breaks are storing up mental health problems for ambulance crews", "url": "https://amp.theguardian.com/society/2022/feb/06/more-than-half-of-nhs-paramedics-suffering-from-burnout-study-finds", "urlToImage": null, "publishedAt": "2022-02-06T17:11:00Z", "content": "NHSHeavy workload, record 999 calls and inadequate breaks are storing up mental health problems for ambulance crews\r\nOver half of paramedics are suffering from burnout caused by overwhelming workload… [+4251 chars]"}, {"source": {"id": null, "name": "Press and Journal"}, "author": null, "title": "Health: Why do some parents catch Covid from their children but others don't? - Press and Journal", "description": "It’s easy to think that if your child catches Covid, surely the whole household is likely to come down with it too. So, why is it that some parents catch", "url": "https://www.pressandjournal.co.uk/pressandjournal/fp/lifestyle/health-and-wellbeing/3903606/health-why-do-some-parents-catch-covid-from-their-children-but-others-dont/", "urlToImage": "http://wpcluster.dctdigital.com/wp-content/uploads/sites/2/2022/01/2.65028234-2esmr0kgf-e1643650956295.jpg", "publishedAt": "2022-02-06T17:00:00Z", "content": "Its easy to think that if your child catches Covid, surely the whole household is likely to come down with it too. So, why is it that some parents catch Covid from their kids, while others somehow ma… [+3431 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Matthew Young", "title": "Simple NHS blood test could cut cancer in 500,000 with results in just two days - The Mirror", "description": "Dr Richard Savage, a data analysis specialist in Leeds, has developed the system will pin point those at risk of developing cancer", "url": "https://www.mirror.co.uk/news/uk-news/simple-nhs-blood-test-could-26153974", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26153969.ece/ALTERNATES/s1200/0_JS242584438.jpg", "publishedAt": "2022-02-06T16:08:37Z", "content": "A blood test due to be introduced by the NHS could rule out cancer for 500,000 people a year, with results in two or three days. \r\n The system was developed by Dr Richard Savage, a data analysis spec… [+2139 chars]"}, {"source": {"id": null, "name": "MyLondon"}, "author": "Tara Cobham", "title": "Expert's urgent warning to all those infected with Omicron Covid variant over Christmas - My London", "description": "More than four million people in England tested positive for the virus in December", "url": "https://www.mylondon.news/news/uk-world-news/urgent-experts-warning-those-infected-23003457", "urlToImage": "https://i2-prod.mylondon.news/incoming/article22769280.ece/ALTERNATES/s1200/2_WB16012022OMICRON2.jpg", "publishedAt": "2022-02-06T15:23:40Z", "content": "Millions of people across the UK caught Coronavirus over the festive period, largely due to the rapid spread of its latest strain, Omicron. In fact, more than four million people in England tested po… [+4293 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Karen Mossman, Matthew S Miller", "title": "A better post-pandemic future means not giving in to COVID-19 now - The Conversation CA", "description": "After two years of COVID-19, it’s understandable that many people are weary of infection prevention measures. But simply being tired of the pandemic is no reason to let our guard down.", "url": "https://theconversation.com/a-better-post-pandemic-future-means-not-giving-in-to-covid-19-now-176094", "urlToImage": "https://images.theconversation.com/files/444498/original/file-20220204-19-1pps5k9.JPG?ixlib=rb-1.1.0&rect=29%2C914%2C6461%2C3230&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-06T14:51:45Z", "content": "This is no time to give in to COVID-19.\r\nIts understandable that after two years, everyone is tired of being afraid, staying home, wearing masks and queueing up for rounds of vaccines and tests. \r\nWi… [+5047 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Vitamin D Deficiency Linked With Increased COVID-19 Severity and Mortality - SciTechDaily", "description": "Joint Bar-Ilan University, Galilee Medical Center study affirms that sufficient vitamin D levels may positively influence the outcome of infection. Vitamin D is most often recognized for its role in bone health, but low levels of the supplement have been asso…", "url": "https://scitechdaily.com/vitamin-d-deficiency-linked-with-increased-covid-19-severity-and-mortality/", "urlToImage": "https://scitechdaily.com/images/Vitamin-D-Sources.jpg", "publishedAt": "2022-02-06T14:36:42Z", "content": "Joint Bar-Ilan University, Galilee Medical Center study affirms that sufficient vitamin D levels may positively influence the outcome of infection.\r\nVitamin D is most often recognized for its role in… [+3228 chars]"}, {"source": {"id": null, "name": "WFUV News"}, "author": null, "title": "Drug-resistant malaria is emerging in Africa. Doctors are worried — yet hopeful - WFUV News", "description": "In June 2017, Betty Balikagala traveled to a hospital in Gulu District in northern Uganda. It was the rainy season: a peak time for malaria transmission. Balikagala, a researcher at Juntendo University in Japan, was back in her home country to hunt for", "url": "https://wfuv.org/content/drug-resistant-malaria-emerging-africa-doctors-are-worried-—-yet-hopeful", "urlToImage": null, "publishedAt": "2022-02-06T14:33:50Z", "content": "In June 2017, Betty Balikagala traveled to a hospital in Gulu District in northern Uganda. It was the rainy season: a peak time for malaria transmission. Balikagala, a researcher at Juntendo Universi… [+14601 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Afghanistan: Measles outbreak in Badakhshan claims more than 70 lives - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 Officials in the northern Afghanistan province of Badakhshan say at least 74 children have died in a measles outbreak in Kuf Ab and Kohistan districts, according to a Afghan Islamic Press report. Many of the children who died were living …", "url": "http://outbreaknewstoday.com/afghanistan-measles-outbreak-in-badakhshan-claims-more-than-70-lives-79825/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2015/04/measles1.jpg", "publishedAt": "2022-02-06T13:59:35Z", "content": "NewsDesk @bactiman63\r\nOfficials in the northern Afghanistan province of Badakhshan say at least 74 children have died in a measles outbreak in Kuf Ab and Kohistan districts, according to a Afghan Isl… [+1089 chars]"}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "A large trial of screening for gestational diabetes mellitus in the United States highlights the need to revisit the Australian diagnostic criteria - The Medical Journal of Australia", "description": "A new trial validates the ongoing concerns regarding the introduction of the one-step approach to the diagnosis of gestational diabetes mellitus", "url": "https://onlinelibrary.wiley.com/doi/full/10.5694/mja2.51388", "urlToImage": "https://www.mja.com.au/sites/default/files/issues/216_03/mja2.51388.jpg", "publishedAt": "2022-02-06T13:03:01Z", "content": "Recent trial results validate previous concerns about the IADPSG criteria for gestational diabetes\r\nThe definition of gestational diabetes mellitus (GDM) varies considerably depending on the region w… [+10626 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Do these maps hold the secret to curing cancer? - The Telegraph", "description": "Scientists have made the first steps to develop an atlas of world cancer, hoping it will bring us closer to a cure. Here's what they found", "url": "https://www.telegraph.co.uk/health-fitness/body/do-maps-hold-secret-curing-cancer/", "urlToImage": "https://www.telegraph.co.uk/content/dam/health-fitness/2022/02/05/Cancer-summary_1_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpg?impolicy=logo-overlay", "publishedAt": "2022-02-06T12:00:00Z", "content": "The lung cancer and smoking connection is very clear, so why in other cancers that have a strong link with tobacco are we seeing such surprising differences? asks Pablo Fernández-Navarro, the lead co… [+3307 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Weight loss cuts risk of precancerous growths by almost half - The New Daily", "description": "If you were obese as a young adult, but have gradually lost weight over time, then you've cut your risk of developing precancerous polyps by almost half.", "url": "https://thenewdaily.com.au/life/wellbeing/2022/02/06/weight-loss-cuts-risk-of-polyps/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2022/02/1644112380-weight-loss-scale-960x600.jpg", "publishedAt": "2022-02-06T11:06:50Z", "content": "If you were overweight or obese as a young adult, but have managed to gradually lose some weight as you’ve progressed to late adulthood, then you’ve reduced your risk of developing precancerous polyp… [+1925 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Alex Chapman", "title": "Omicron subvariant BA.2 'more infectious', Danish study concludes, as Australia reports 'handful' of cases - 7NEWS", "description": "A study in the country where the subvariant of Omicron is surging has unveiled crucial new information - including how transmissible it is compared to the original variant.", "url": "https://7news.com.au/lifestyle/health-wellbeing/omicron-subvariant-ba2-more-infectious-danish-study-concludes-as-australia-reports-handful-of-cases-c-5517440", "urlToImage": "https://images.7news.com.au/publication/C-5517440/385c3100326c75912bc00d197403b53d70234a0e-16x9-x0y0w4694h2640.jpg?imwidth=1200", "publishedAt": "2022-02-06T10:32:44Z", "content": "The BA.2 subvariant of the Omicron coronavirus variant, which has quickly taken over in Denmark, is more transmissible than the more common BA.1 and more able to infect vaccinated people, a Danish st… [+3490 chars]"}, {"source": {"id": null, "name": "Northernbeachesreview.com.au"}, "author": null, "title": "COVID-19 death in remote NT community - Northern Beaches Review", "description": "A man in his 60s has died with COVID-19 in a remote community in central Australia, Northern Territory health officials say. The man died on Friday in Kintore...", "url": "https://www.northernbeachesreview.com.au/story/7609283/covid-19-death-in-remote-nt-community/", "urlToImage": "https://www.northernbeachesreview.com.au/images/transform/v1/crop/frm/silverstone-feed-data/16e3d949-9c2d-4a47-a22c-2433f83dab77.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2022-02-06T09:31:57Z", "content": "A man in his 60s has died with COVID-19 in a remote community in central Australia, Northern Territory health officials say.\r\nThe man died on Friday in Kintore, more than 500km west of Alice Springs,… [+568 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Carine Smith", "title": "Zebrafish research reveals green rooibos tea's anxiety-busting properties - The Conversation Africa", "description": "Zebrafish are ideal for drug discovery especially in the context of neurological and inflammatory conditions.", "url": "https://theconversation.com/zebrafish-research-reveals-green-rooibos-teas-anxiety-busting-properties-176165", "urlToImage": "https://images.theconversation.com/files/443686/original/file-20220201-25-7le1xb.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-06T08:34:19Z", "content": "Rooibos tea is a uniquely South African product. The plant, Aspalathus linearis, grows mainly in the Cederberg area of the countrys Western Cape province. And its not just a tasty beverage. It is caf… [+5947 chars]"}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "Eli Pacheco", "title": "Woman, 74, warns of ‘horrible’ chronic shingles symptoms – post-herpetic neuralgia - Toys Matrix", "description": "She added: “It’s mind over matter really. I’m just so used to the times when it gets so bad and the rash comes back on the head. It is just like a kind of tingling feeling the whole time but more intense.“Every so often you are sitting there and it’s", "url": "https://toysmatrix.com/woman-74-warns-of-horrible-chronic-shingles-symptoms-post-herpetic-neuralgia/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1561441.jpg", "publishedAt": "2022-02-06T07:58:16Z", "content": "She added: Its mind over matter really. Im just so used to the times when it gets so bad and the rash comes back on the head. It is just like a kind of tingling feeling the whole time but more intens… [+1679 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Tracy Gayton, The Sun", "title": "Mum’s lump dismissed as blocked milk duct - NEWS.com.au", "description": "<p>A mum was told she just had a blocked milk duct, before doctors found terminal breast cancer, her grieving brother has revealed.</p>", "url": "https://www.news.com.au/lifestyle/health/health-problems/doctors-dismissed-mum-when-she-was-suffering-with-terminal-cancer/news-story/1caf820ad46d262b7a7c11ac14fdee4e", "urlToImage": "https://content.api.news/v3/images/bin/e5287193c354d6e8c25e2f156d078486", "publishedAt": "2022-02-06T07:50:38Z", "content": "A mum who died after giving birth to her second child was told she just had a blocked milk duct until a lump she discovered kept growing.A mum was told she just had a blocked milk duct, before doctor… [+5903 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Anthony", "title": "Guy Leschziner: ‘Reality is entirely a construct of our nervous system’ - The Guardian", "description": "The consultant neurologist and BBC radio presenter has a new book exploring the relationship between sensory perception and the reality it creates", "url": "https://amp.theguardian.com/science/2022/feb/06/guy-leschziner-reality-is-entirely-a-construct-of-our-nervous-system", "urlToImage": null, "publishedAt": "2022-02-06T07:00:00Z", "content": "Observer New Review Q&amp;AThe consultant neurologist and BBC radio presenter has a new book exploring the relationship between sensory perception and the reality it creates\r\nGuy Leschziner is a cons… [+7288 chars]"}, {"source": {"id": null, "name": "Pedestrian TV"}, "author": null, "title": "How To Know If You Got Ms Rona Since Experts Reckon COVID Cases Were 10x Higher Than Reported - Pedestrian TV", "description": "Shoutout to all my asymptomatic hotties.", "url": "https://www.pedestrian.tv/news/covid-cases-undetected-antibody-test/", "urlToImage": "https://imgix.pedestrian.tv/content/uploads/2022/02/06/Untitled-design-39.png?ar=16%3A9&auto=format&crop=focal&fit=crop&q=65&w=1200", "publishedAt": "2022-02-06T05:28:37Z", "content": "Unless you were a complete hermit over the Christmas period and didn’t see another living soul for those chaotic weeks, chances are you’ve come into contact with the spicy cough. So how the bloody he… [+3304 chars]"}, {"source": {"id": null, "name": "KSBY San Luis Obispo News"}, "author": "Kimberly Cruz", "title": "New research shows benefits of COVID-19 and flu combination vaccine - KSBY San Luis Obispo News", "description": "A study published in the Lancet journal, followed 300 people that were split into three groups: one group was given just the flu vaccine, the second group just mRNA COVID-19 booster, and the third group was given a mixture of the two.", "url": "https://www.ksby.com/news/coronavirus/new-research-shows-benefits-of-covid-19-and-flu-combination-vaccine", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/6a36883/2147483647/strip/true/crop/1000x525+0+19/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F75%2F37%2F676c91254149af4893659953929a%2Fap20350733209549.jpg", "publishedAt": "2022-02-06T02:29:39Z", "content": "With a third COVID-19 shot, also known as a booster shot, being recommended against the battle of COVID-19, the possibility of people needing yearly booster shots is on the horizon. New research show… [+2205 chars]"}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "Eli Pacheco", "title": "Cancer symptoms: Bowel changes and blood in poo seen in 90% of cases - Toys Matrix", "description": "Cancer can take many forms, all of which result from a rapid proliferation of harmed cells. There are a host of symptoms associated with the disease, but not all the warning signs are clear-cut. Generally, symptoms will be concentrated in the organs", "url": "https://toysmatrix.com/cancer-symptoms-bowel-changes-and-blood-in-poo-seen-in-90-of-cases/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1561599.jpg", "publishedAt": "2022-02-05T23:51:14Z", "content": "Cancer can take many forms, all of which result from a rapid proliferation of harmed cells. There are a host of symptoms associated with the disease, but not all the warning signs are clear-cut. Gene… [+2733 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Solen Le Net", "title": "Diabetes: The ‘most effective’ food to lower blood sugar levels within 30 'minutes’ - Express", "description": "THE GROWING burden of obesity is set to fuel diabetes rates in coming years. Fortunately, type 2 diabetes can be avoided and even reversed by adhering to a healthy diet. One plant has been shown to reduce blood sugar levels in the space of 30 minutes.", "url": "https://www.express.co.uk/life-style/health/1561598/diabetes-treatment-lower-blood-sugar-levels-cucumber", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1561598.jpg", "publishedAt": "2022-02-05T23:19:00Z", "content": null}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Katherine Davison", "title": "Symptoms of ovarian cancer by Melbourne woman whose menstrual changes were brushed off as 'stress' - 7NEWS", "description": "‘I left the appointment feeling like I was thought of as a waste of time.’", "url": "https://7news.com.au/lifestyle/health-wellbeing/symptoms-of-ovarian-cancer-by-melbourne-woman-whose-menstrual-changes-were-brushed-off-as-stress--c-5549011", "urlToImage": "https://images.7news.com.au/publication/C-5549011/8dbbce323973760c2a735f6f984d698ed1b34c13-16x9-x0y0w843h474.jpg?imwidth=1200", "publishedAt": "2022-02-05T23:02:08Z", "content": "It was a niggling problem Hannah Catton experienced for years.\r\nThe 24-year-old Melbourne woman would suffer from recurrent urinary tract infections, belly bloating and her extremely painful periods … [+5891 chars]"}, {"source": {"id": null, "name": "LIVESTRONG.COM"}, "author": "Kelsey Casselbury", "title": "Is Mixing Alcohol Bad? RDs Explain the Wine Before Liquor Myth and More - Livestrong", "description": "Dietitians explain if drinking wine before liquor really prevents hangovers and if the mixing alcohol myth (i.e. drinking cocktails with beer) is actually true.", "url": "https://www.livestrong.com/article/13769662-is-mixing-alcohol-bad/", "urlToImage": "https://img.livestrong.com/640/media-storage/contentlab-data/2/3/95e97b0e4c5e4f5484905f7e6209a7e5.jpg", "publishedAt": "2022-02-05T21:49:59Z", "content": "There are a couple of old adages that many drinkers know: \"Beer before liquor, never been sicker. Liquor before beer, you're in the clear,\" is one of them; \"Beer before wine and you'll feel fine\" is … [+5040 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "7NEWS", "title": "How to tell if your child's cough is croup or COVID - 7NEWS", "description": "Doctors are finding presentations of croup in children seeking hospital care for COVID. So, how do you know the difference?", "url": "https://7news.com.au/lifestyle/health-wellbeing/how-to-tell-if-your-childs-cough-is-croup-or-covid-c-5542753", "urlToImage": "https://images.7news.com.au/publication/C-5542753/4637d2d68b22b8b5c0f99ef7549b838618255dea-16x9-x0y209w4000h2250.jpg?imwidth=1200", "publishedAt": "2022-02-05T21:03:07Z", "content": "This story first appeared on The Conversation.\r\nWith the surge in Omicron cases, doctors are finding presentations of croup in children seeking hospital care for COVID in Australia and internationall… [+4154 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "How to prevent cancer: Critical changes you can make - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://dsf.newscorpaustralia.com/dailytelegraph/subscription/", "urlToImage": null, "publishedAt": "2022-02-05T18:03:24Z", "content": null}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Dengue in Timor-Leste: WHO DON published - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The dengue fever epidemic in Timor-Leste recently caught our eye at Outbreak News Today (HERE and HERE) as the number of cases reported early in 2022 have already beat annual totals for 2020 and 2021. On Friday, the World Health Organizat…", "url": "http://outbreaknewstoday.com/dengue-in-timor-leste-who-don-published-25744/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2022/02/Capture-1.png", "publishedAt": "2022-02-05T17:45:16Z", "content": "NewsDesk @bactiman63\r\nThe dengue fever epidemic in Timor-Leste recently caught our eye at Outbreak News Today (HERE and HERE) as the number of cases reported early in 2022 have already beat annual to… [+1963 chars]"}, {"source": {"id": null, "name": "AZ Big Media"}, "author": "Blufish", "title": "7 tips to help women lower chances of developing heart disease - AZ Big Media", "description": "Here are seven tips to help women lower their chances of developing heart disease.", "url": "https://azbigmedia.com/lifestyle/7-tips-to-help-women-lower-chances-of-developing-heart-disease/", "urlToImage": "https://azbigmedia.com/wp-content/uploads/2020/08/yoga-exercise.jpg", "publishedAt": "2022-02-05T17:01:53Z", "content": "February is American Heart Month, which is a good time to focus on your heart health, including learning common symptoms of a heart attack, what to do if one strikes, and how to reduce your risk of h… [+3735 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "NBC", "title": "How stress harms your heart and how to avoid it - 7NEWS", "description": "Doctors worry about what all the extra long-term anxiety during the pandemic is doing to our hearts.", "url": "https://7news.com.au/lifestyle/health-wellbeing/how-stress-harms-your-heart-and-how-to-avoid-it-c-5568031", "urlToImage": "https://images.7news.com.au/publication/C-5568031/3031b3743104f180f20021c3ff1d726112babfe2-16x9-x0y110w2121h1193.jpg?imwidth=1200", "publishedAt": "2022-02-05T16:00:00Z", "content": "Whats on your mind can take a heavy toll on your heart.\r\nMental stress can increase the risk of heart disease, yet we often dont think about the brain-heart connection when it comes to preventing a h… [+6285 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Julia Kollewe", "title": "Deborah Waterhouse: ‘The HIV stigma remains, and this is a battle we’ve got to fight’ - The Guardian", "description": "The GSK executive has found her niche at ViiV Healthcare developing HIV drugs, and is optimistic a cure will be found", "url": "https://amp.theguardian.com/business/2022/feb/05/deborah-waterhouse-the-hiv-stigma-remains-and-this-is-a-battle-weve-got-to-fight", "urlToImage": null, "publishedAt": "2022-02-05T16:00:00Z", "content": "Observer business profileThe GSK executive has found her niche at ViiV Healthcare developing HIV drugs, and is optimistic a cure will be found\r\nA lot has changed since the devastating 1980s Aids cris… [+7678 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Harry Jones", "title": "San Antonio researchers identify a new target for drug development — ScienceDaily - The News Motion", "description": "Scientists at The University of Texas Health Science Center at San Antonio (UT Health San Antonio) believe it may be possible to prevent DNA changes driven by two proteins highly active in leukemia and other cancers. They reported a new mechanistic t", "url": "https://thenewsmotion.com/san-antonio-researchers-identify-a-new-target-for-drug-development-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-05T15:43:47Z", "content": "Scientists at The University of Texas Health Science Center at San Antonio (UT Health San Antonio) believe it may be possible to prevent DNA changes driven by two proteins highly active in leukemia a… [+1817 chars]"}, {"source": {"id": null, "name": "The-review"}, "author": ", The Review", "title": "Letter to the Editor: Learn about deadly bile duct cancer - Yahoo News", "description": "Patient says signs often are missed, so education is key to survival.", "url": "https://www.the-review.com/story/opinion/2022/02/05/letter-editor-learn-deadly-bile-duct-cancer/6661763001/", "urlToImage": "https://www.gannett-cdn.com/media/OhioGroup/GenericImages/2014/06/27/1403890611005-LetterToTheEditor.png?auto=webp&crop=3333,1883,x0,y725&format=pjpg&width=1200", "publishedAt": "2022-02-05T14:02:07Z", "content": "February is Cholangiocarcinoma Awareness Month. Never heard of CCA? You’re not alone. Also known as bile duct cancer, this devastating disease occurs in the body’s bile duct system which carries bile… [+1117 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "COVID Symptoms That Require Immediate Attention, Say Experts — Eat This Not That - Eat This, Not That", "description": "Trouble breathing, persistent pain or pressure in the chest and confusion are among COVID symptoms that require immediate attention.", "url": "http://www.eatthis.com/news-dangerous-covid-symptoms-experts/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/09/woman-chest-pain-heart-attack-problem.jpg?quality=82&strip=all", "publishedAt": "2022-02-05T12:15:28Z", "content": "While Omicron may be milder than COVID for some, it's still sending a record number of people to the hospital. A sore throat or cough that won't quit, chills and a fever are typical symptoms of the v… [+5318 chars]"}, {"source": {"id": null, "name": "Medicine Hat News"}, "author": null, "title": "Experts share knowledge for Eating Disorders Awareness Week - Medicine Hat News", "description": "kking@medicinehatnews.com The first week of February marks Eating Disorders Awareness Week in Canada. “Over the course of the week, organizations across the country will come together to create some kind of cohesive language to talk about eating disorders and…", "url": "https://medicinehatnews.com/news/local-news/2022/02/05/experts-share-knowledge-for-eating-disorders-awareness-week/", "urlToImage": null, "publishedAt": "2022-02-05T11:11:31Z", "content": "By KENDALL KING, Local Journalism Initiative Reporter on February 5, 2022.\r\nkking@medicinehatnews.com\r\nThe first week of February marks Eating Disorders Awareness Week in Canada.\r\n“Over the course of… [+3374 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Best time to exercise? Morning and evening have different benefits - The New Daily", "description": "Is it better to exercise in the morning or evening? Morning workouts have long been favoured, but the evening workout has its own benefits.", "url": "https://thenewdaily.com.au/life/wellbeing/2022/02/05/best-time-to-exercise/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2022/02/1643972188-exercise-time-960x600.jpg", "publishedAt": "2022-02-05T11:02:48Z", "content": "Sometimes scientists go to a lot of trouble, deliver something interesting, complex and promising, even beautiful in a way.\r\nAnd yet they seem to fall short in answering the basic question the rest o… [+6417 chars]"}, {"source": {"id": null, "name": "Columbus Telegram"}, "author": "", "title": "Could you have an underactive or overactive thyroid? - Columbus Telegram", "description": "Are you gaining or losing weight without explanation? Do you seem to be more sensitive to cold or hot weather? Is your heart beating too slowly, too fast or irregularly?", "url": "https://columbustelegram.com/news/local/could-you-have-an-underactive-or-overactive-thyroid/article_83645033-db71-5c0f-887d-67279cc6ed70.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/columbustelegram.com/content/tncms/assets/v3/editorial/4/04/4049ad89-cae7-5210-a22d-c54fe05516b8/5ee7bba6715fb.image.jpg?crop=1054%2C554%2C120%2C0&resize=1054%2C554&order=crop%2Cresize", "publishedAt": "2022-02-05T10:15:00Z", "content": "Are you gaining or losing weight without explanation? Do you seem to be more sensitive to cold or hot weather? Is your heart beating too slowly, too fast or irregularly? These and other symptoms may … [+3275 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Widely-Used Hormone Drug Linked to Increased Risk of Benign Brain Tumour at High Doses, Says Study - LatestLY", "description": "A recent study has found that high doses of a widely-used drug used in the hormonal treatment of conditions like excessive hair growth, early puberty, prostate cancer, are linked to an increased risk of meningioma -- the most common type of benign brain tumou…", "url": "https://www.latestly.com/agency-news/health-news-widely-used-hormone-drug-linked-to-increased-risk-of-benign-brain-tumour-at-high-doses-study-3330190.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/brain-g88dcd965f_1920202112190828362021121909282220220205083944-588x441.jpg", "publishedAt": "2022-02-05T10:08:23Z", "content": "Bristol, February 5: A recent study has found that high doses of a widely-used drug used in the hormonal treatment of conditions like excessive hair growth, early puberty, prostate cancer, are linked… [+3619 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Sharon Otterman, Joseph Goldstein", "title": "How New York City’s Hospitals Withstood the Omicron Surge - The New York Times", "description": "The highly contagious coronavirus variant stretched the city’s health care system to the breaking point, but not past it.", "url": "https://www.nytimes.com/2022/02/05/nyregion/omicron-nyc-hospitals.html", "urlToImage": "https://static01.nyt.com/images/2022/02/06/nyregion/06nyvirus-omicron-print1/00nyvirus-omicron1-facebookJumbo.jpg", "publishedAt": "2022-02-05T10:00:16Z", "content": "The test kits alone, the city estimated, caught 25,000 cases. School attendance hovered around 70 percent in early January, as children were out sick or kept home by their parents to try to avoid inf… [+2031 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Apoorva Kaul", "title": "UK: After COVID recovery, woman develops ability to smell for 1st time since childhood - Republic World", "description": "A COVID-19 patient after recovering from the virus has been able to smell for the first time since childhood. She is now able to smell perfumes, candles, herbs.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/uk-after-covid-recovery-woman-develops-ability-to-smell-for-1st-time-since-childhood-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/qclzigbjngkxmnow_1644053497.jpeg", "publishedAt": "2022-02-05T09:50:00Z", "content": "A COVID-19 patient after recovering from the virus has been able to smell for the first time since childhood. Nancy Simpson from London, who is 25 years old, grew up without a sense of smell, The Sun… [+2109 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Jason Junior", "title": "WHO calls for global inequality in cancer treatment to be addressed - News Azi", "description": "Geneva, February 5On World Cancer Day, the World Health Organization (WHO) called for the gap in the availability of cancer care in high and low-income countries to be addressed.Globally, cancer is one of the l", "url": "https://newsazi.com/who-calls-for-global-inequality-in-cancer-treatment-to-be-addressed/", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_688725360.jpeg", "publishedAt": "2022-02-05T09:11:08Z", "content": "Geneva, February 5\r\nOn World Cancer Day, the World Health Organization (WHO) called for the gap in the availability of cancer care in high and low-income countries to be addressed.\r\nGlobally, cancer … [+1393 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Lifestyle News | Add These Superfoods to Your Diet for a Long and Healthy Life - LatestLY", "description": "Get latest articles and stories on Lifestyle at LatestLY. Eating a well-balanced diet along with regular exercise and avoiding alcohol and smoking are some ways to lead a healthy life.", "url": "https://www.latestly.com/agency-news/lifestyle-news-add-these-superfoods-to-your-diet-for-a-long-and-healthy-life-3329954.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/vegetables-g767b35221_19202022020507230220220205082758-588x441.jpg", "publishedAt": "2022-02-05T08:38:24Z", "content": "Washington [US], February 5 (ANI): Eating a well-balanced diet along with regular exercise and avoiding alcohol and smoking are some ways to lead a healthy life.\r\nAs per Fox News, there are a few sup… [+5147 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Baz Ruddick", "title": "Death toll from COVID-19 outbreak at Jeta Gardens aged care facility rises to 15, but centre will not be evacuated - msnNOW", "description": "The federal Health Department confirms 15 residents at the Jeta Gardens aged care facility south of Brisbane have now died of COVID-19, but the centre will not be evacuated and defence personnel are not being called in to work at the facility.", "url": "https://www.abc.net.au/news/2022-02-05/qld-covid-outbreak-jeta-gardens-aged-care-more-deaths/100807052", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2c01669349e2cefdfc7f5d6e1a96b9a9?impolicy=wcms_crop_resize&cropH=720&cropW=1280&xPos=0&yPos=67&width=862&height=485", "publishedAt": "2022-02-05T08:26:54Z", "content": "COVID-19 has now claimed the lives of 15 residents of the Jeta Gardens aged care facility south of Brisbane and 100 residents and 82 staff have tested positive for the virus, the federal Health Depar… [+7032 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Sonia Lal", "title": "Researchers develop new treatment that could help kids with peanut allergies - 9News", "description": "<p>The Murdoch Children&#x27;s Research Institute has developed a combination treatment that appears to send the peanut allergy into remission in around half of the children that have the condition.</p>", "url": "https://www.9news.com.au/national/medical-news-australia-researchers-develop-new-treatment-that-could-help-kids-with-peanut-allergies/6d05c530-dc79-4c28-aae9-d3df5ef372c5", "urlToImage": "https://imageresizer.static9.net.au/x2CYXswEyamnvGcJQ4Gh6hR7bi4=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F99947a5e-c4a0-421f-8e66-69318d73a305", "publishedAt": "2022-02-05T08:05:59Z", "content": "Property News: Music promoter Michael Coppel sells Toorak home for more than $30 million - domain.com.au"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers find new rotavirus vaccine to prevent a deadly diarrheal disease from birth | Science-Environment - Devdiscourse", "description": "A team of researchers have found that an Australian developed neonatal rotavirus vaccine RV3-BB was safe and produced a robust immune response in African babies.", "url": "https://www.devdiscourse.com/article/science-environment/1911161-researchers-find-new-rotavirus-vaccine-to-prevent-a-deadly-diarrheal-disease-from-birth", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_02_2022_08_04_28_5828538.jpg?width=920&format=jpeg", "publishedAt": "2022-02-05T08:04:30Z", "content": "A team of researchers have found that an Australian developed neonatal rotavirus vaccine RV3-BB was safe and produced a robust immune response in African babies. The study has been published in the '… [+5001 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "103-year-old nursing home resident mistakenly given 4th dose of vaccine, later dies; Ministry of Health investigation case – TBEN Singapore News - The bharat express news", "description": "Singapore – The Ministry of Health (MOH) is investigating the case of a 103-year-old nursing home resident who was mistakenly given the fourth dose of the", "url": "https://www.thebharatexpressnews.com/103-year-old-nursing-home-resident-mistakenly-given-4th-dose-of-vaccine-later-dies-ministry-of-health-investigation-case-tben-singapore-news/", "urlToImage": "https://media.theindependent.sg/wp-content/uploads/2021/12/12142545/doctor-with-gloves-administering-little-child-vaccine.jpg", "publishedAt": "2022-02-05T08:00:23Z", "content": "Singapore The Ministry of Health (MOH) is investigating the case of a 103-year-old nursing home resident who was mistakenly given the fourth dose of the Covid-19 vaccine and died less than a month la… [+2921 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Understanding the danger of silent heart attack: Causes, symptoms, solutions - Hindustan Times", "description": "Did you know you can have a heart attack and not even get to know? Yes, that’s right! It can be a silent heart attack. Read on to know know more about its causes, symptoms, treatment and prevention tips from a doctor and do not take your health lightly. | Hea…", "url": "https://www.hindustantimes.com/lifestyle/health/understanding-the-danger-of-silent-heart-attack-causes-symptoms-solutions-101644046858451.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/05/1600x900/pain-g048088c11_1920_1644047226538_1644047241509.jpg", "publishedAt": "2022-02-05T07:59:02Z", "content": "Few know that heart attacks are silent too but we often picture a heart attack as grimacing from the extreme chest pain and clutching our chest whereas men and women may experience a cardiac arrest i… [+3409 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "COVID-19: Symptoms are Visible After Two Days of Contracting the Infection, Says Study - msnNOW", "description": "A group of researchers conducted the study on healthy volunteers and infected them with the virus", "url": "https://www.news18.com/news/lifestyle/covid-19-symptoms-are-visible-after-two-days-of-contracting-the-infection-says-study-4734734.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/2021-12-02t111510z_1_lynxmpehb10h5_rtroptp_4_health-coronavirus-variant-cryptocurrency-163868522216x9.jpg", "publishedAt": "2022-02-05T07:38:35Z", "content": "The first ever Human Infection study, also known as human challenge study, found that people who get infected with COVID-19 start to experience symptoms of the disease two days after contracting the … [+2565 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Severe Covid patients had less access to monoclonal antibody therapy - Daijiworld.com", "description": "New York, Feb 5 (IANS): Due to unequal distribution, people over the age 65 at the highest risk for severe Covid-19 have often been the least likely to receive monoclonal antibodies (mAbs), according to new research.\r\nMonoclonal antibodies are very effective …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=923176", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-02-05T06:41:02Z", "content": "New York, Feb 5 (IANS): Due to unequal distribution, people over the age 65 at the highest risk for severe Covid-19 have often been the least likely to receive monoclonal antibodies (mAbs), according… [+1753 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Anna Mason", "title": "Cancer: Reducing your alcohol can help to lower your risk by 31 percent says study - The News Motion", "description": "Because these alleles are allocated at birth and are independent of other lifestyle factors (such as smoking), they can be used as a proxy for alcohol intake, to assess how alcohol consumption affects disease risks.The study team used the data and co", "url": "https://thenewsmotion.com/cancer-reducing-your-alcohol-can-help-to-lower-your-risk-by-31-percent-says-study/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1559440.jpg", "publishedAt": "2022-02-05T04:07:59Z", "content": "Because these alleles are allocated at birth and are independent of other lifestyle factors (such as smoking), they can be used as a proxy for alcohol intake, to assess how alcohol consumption affect… [+938 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "SCAI releases expert consensus on sex-specific considerations in myocardial revascularization - EurekAlert", "description": "A newly released expert consensus statement on sex-specific considerations in myocardial revascularization aims to summarize available literature on myocardial revascularization in women and identify important gaps in evidence. The document was published toda…", "url": "https://www.eurekalert.org/news-releases/942016", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-05T02:03:57Z", "content": "WASHINGTON – A newly released expert consensus statement on sex-specific considerations in myocardial revascularization aims to summarize available literature on myocardial revascularization in women… [+3256 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": null, "title": "In the US recognized 'natural immunity' from COVID-19: it can be equated with vaccination - The Saxon", "description": "Currently, more than 65 million people have recovered from COVID-19 in the United States. And while COVID-19 vaccination is critical to protecting against severe illness, hospitalizations, and death, the Centers for Disease Control and Prevention (CDC) has re…", "url": "https://thesaxon.org/in-the-us-recognized-natural-immunity-from-covid-19-it-can-be-equated-with-vaccination/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2022/02/72bd875c9a3127957dcca45ee56e7020.jpg", "publishedAt": "2022-02-04T18:23:52Z", "content": "Currently, more than 65 million people have recovered from COVID-19 in the United States. And while COVID-19 vaccination is critical to protecting against severe illness, hospitalizations, and death,… [+3678 chars]"}, {"source": {"id": null, "name": "Triple M"}, "author": "The Triple M Team", "title": "ATAGI Approves Booster Dose For Older Teenagers - Triple M", "description": "Final green light", "url": "https://www.triplem.com.au/story/atagi-approves-booster-dose-for-older-teenagers-193830", "urlToImage": "https://cdn-img.scalabs.com.au/PMJ_TtKWuusN_d8n83-rehRZZqH7quSNo361nIsPE50/aHR0cHM6Ly9zdy10/cmlwbGVtLXByZC5z/Y2FkaWdpdGFsLmlv/L21lZGlhLzk1MDc1/L3RlZW4tdmFjY2lu/ZS5qcGc_cHJlc2V0/PW1ycHJldmFydGlj/bGU", "publishedAt": "2022-02-02T22:27:29Z", "content": "The ATAGI has given the final green light for 16 and 17-year-olds to receive their COVID booster shot, after it was provisionally approved.\r\nOlder Australian teens may opt for their third jab just th… [+1608 chars]"}]}