{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists develop platform to track SARS-CoV-2 lineages - News-Medical.Net", "description": "A team of researchers led by Laura D. Hughes from The Scripps Research Institute in California created an online platform called Outbreak.info to track over 40 million lineages and SARS-CoV-2 mutation across 7,000 locations.", "url": "https://www.news-medical.net/news/20220201/Scientists-develop-platform-to-track-SARS-CoV-2-lineages.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703267_16437748986453136.jpg", "publishedAt": "2022-02-02T04:09:00Z", "content": "As the severe acute respiratory syndrome coronavirus 2 (SARS‑CoV‑2) Omicron variant makes its way across the world, it is one of five variants of concern that has made it challenging to end the pande… [+6320 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Experimental immunotherapy could help treat some people with metastatic breast cancer - News-Medical.Net", "description": "An experimental form of immunotherapy that uses an individual's own tumor-fighting immune cells could potentially be used to treat people with metastatic breast cancer, according to results from an ongoing clinical trial led by researchers at the National Can…", "url": "https://www.news-medical.net/news/20220201/Experimental-immunotherapy-could-help-treat-some-people-with-metastatic-breast-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2022-02-02T03:38:00Z", "content": "An experimental form of immunotherapy that uses an individual's own tumor-fighting immune cells could potentially be used to treat people with metastatic breast cancer, according to results from an o… [+5282 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New lab can reveal how ventilation can reduce indoor transmission of airborne infections - News-Medical.Net", "description": "Today's buildings and ventilation systems are not built to protect us against the spread of airborne pathogens, and experiences of the current pandemic show that many people are infected indoors in their homes or at workplaces, according to Alan Kabanshi.", "url": "https://www.news-medical.net/news/20220201/New-lab-can-reveal-how-ventilation-can-reduce-indoor-transmission-of-airborne-infections.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-02-02T03:15:00Z", "content": "\"Together with Japanese researchers, we have developed a completely new theory on the transmission of airborne diseases within and between rooms and on how pathogens can be removed by ventilation,\" s… [+1909 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Emily McPherson", "title": "Tanya's 'routine' procedure was put off for more than two years. Then, doctors found a tumour - 9News", "description": "<p>Tanya&#x27;s &#x27;routine&#x27; procedure was put off for more than two years during COVID. Then, doctors found a tumour.</p>", "url": "https://www.9news.com.au/national/tanyas-routine-procedure-was-put-off-for-more-than-two-years-during-covid-then-doctors-found-a-tumour/23ac8c38-e315-49c4-8073-aed2e4d2301a", "urlToImage": "https://imageresizer.static9.net.au/6YYqtFy8pXe70_15fqBTj3CMaqU=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F301e8e1c-2685-4cd7-811d-ec4bc20362df", "publishedAt": "2022-02-02T02:41:25Z", "content": "Property News: Music promoter Michael Coppel sells Toorak home for more than $30 million - domain.com.au"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Greater body fat found to be a risk factor for reduced cognitive function - News-Medical.Net", "description": "A new study has found that greater body fat is a risk factor for reduced cognitive function, such as processing speed, in adults.", "url": "https://www.news-medical.net/news/20220201/Greater-body-fat-found-to-be-a-risk-factor-for-reduced-cognitive-function.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/High_Blood_Pressure-620x480.jpg", "publishedAt": "2022-02-02T02:06:00Z", "content": "A new study has found that greater body fat is a risk factor for reduced cognitive function, such as processing speed, in adults.\r\nEven when the researchers took cardiovascular risk factors (such as … [+2530 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How Omicron escapes from antibodies: A computational study shows that dozens of mutations help the virus' spike protein evade antibodies that target SARS-CoV-2 - Science Daily", "description": "Dozens of mutations in the spike protein of the Omicron variant help it to evade all four of the classes of antibodies that can target SARS-CoV-2, according to a new study. This includes antibodies generated by the immune systems of vaccinated or previously i…", "url": "https://www.sciencedaily.com/releases/2022/02/220201143956.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-02T01:00:32Z", "content": "A new study from MIT suggests that the dozens of mutations in the spike protein of the Omicron variant help it to evade all four of the classes of antibodies that can target the SARS-CoV-2 virus that… [+7539 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Childhood obesity more likely to influenced by lifestyle factors than mother's BMI - News-Medical.Net", "description": "Researchers from the University of Bristol and Imperial College London have found that a high Body Mass Index (BMI) of a mother before and during pregnancy is not a major cause of high BMI in their offspring – indicating that childhood and teen obesity is mor…", "url": "https://www.news-medical.net/news/20220201/Childhood-obesity-more-likely-to-influenced-by-lifestyle-factors-than-mothers-BMI.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Body_Mass_Index-620x480.jpg", "publishedAt": "2022-02-02T00:30:00Z", "content": "Researchers from the University of Bristol and Imperial College London have found that a high Body Mass Index (BMI) of a mother before and during pregnancy is not a major cause of high BMI in their o… [+2459 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover why patients suffering with hypertension also have diabetes - News-Medical.Net", "description": "The long-standing enigma of why so many patients suffering with high blood pressure (known as hypertension) also have diabetes (high blood sugar) has finally been cracked by an international team led by the universities of Bristol, UK, and Auckland, New Zeala…", "url": "https://www.news-medical.net/news/20220201/Researchers-discover-why-patients-suffering-with-hypertension-also-have-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/High_Blood_Pressure-620x480.jpg", "publishedAt": "2022-02-02T00:15:00Z", "content": "The long-standing enigma of why so many patients suffering with high blood pressure (known as hypertension) also have diabetes (high blood sugar) has finally been cracked by an international team led… [+3888 chars]"}, {"source": {"id": null, "name": "Mamamia"}, "author": "Erin Docherty", "title": "Long COVID: There are 4 factors, according to an expert. - Mamamia", "description": "Wondering if you're at risk of developing long COVID? A doctor breaks down everything we need to know - including the 4 factors to look for.", "url": "https://www.mamamia.com.au/long-covid-factors/", "urlToImage": "https://new-cdn.mamamia.com.au/mamamia-pwa.appspot.com/cms_images/variations/7201.752931307794x4801.168620871862-250276033888.jpg?bypass=1", "publishedAt": "2022-02-02T00:00:00Z", "content": "According to Dr Joshi, \"The study also suggested that being female, having pre-existing respiratory illness, and a higher red blood cell count at the time of COVID diagnosis correlated with long COVI… [+2871 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Exercise Harder if You Want to Ward off Pain Due to Aging - Neuroscience News", "description": "Participating in high levels of physical activities, such as swimming or a game of tennis, once a week helps stave off chronic musculoskeletal pain.", "url": "https://neurosciencenews.com/pain-aging-exercise-19998/", "urlToImage": "https://neurosciencenews.com/files/2022/02/exercise-aging-pain-neurosinces-public.jpg", "publishedAt": "2022-02-01T23:39:55Z", "content": "Summary: Participating in high levels of physical activities, such as swimming or a game of tennis, once a week helps stave off chronic musculoskeletal pain.\r\nSource: University of Portsmouth\r\nThose … [+5163 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Celebrating American Heart month - WATE 6 On Your Side", "description": "Heart disease is the leading cause of death for women in the United States. Friday, Feb. 4 is National Wear Red Day, an effort started by the American Heart ...", "url": "https://www.youtube.com/watch?v=5JAM4mdGLyQ", "urlToImage": "https://i.ytimg.com/vi/5JAM4mdGLyQ/hqdefault.jpg", "publishedAt": "2022-02-01T23:34:16Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single-use sensor strips detect cerebrospinal fluid leaks: Sensor strips, hand-held circuit boards find fluid leaks from brain, spinal cord - Science Daily", "description": "Researchers developed a single-use sensor strip that can be used with a circuit board to detect cerebrospinal fluid leaks. They collected nine clinical samples and introduced the test fluid into a small liquid channel on the tip of the sensor strips. The liqu…", "url": "https://www.sciencedaily.com/releases/2022/02/220201115301.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T23:33:03Z", "content": "Developing rapid clinical testing for cerebrospinal fluid (CSF) leaks after trauma, surgery, tumors, and other defects are vital, because such leaks can cause life-threatening conditions, such as men… [+2365 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Prevalence and subtyping of biofilms present in bronchoalveolar lavage from children with protracted bacterial bronchitis or non-cystic fibrosis bronchiectasis: a cross-sectional study - The Lancet", "description": "Lower airway biofilms are prevalent, but not ubiquitous, in bronchoalveolar lavage\nfrom children with PBB or bronchiectasis, suggesting anti-biofilm therapies might\nbe beneficial for some children. Detection of upper airway biofilms in bronchoalveolar\nlavage …", "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00300-1/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a3e01c2c-abf3-4b51-af9e-97e4f8142e34/gr1.jpg", "publishedAt": "2022-02-01T23:30:19Z", "content": null}, {"source": {"id": null, "name": "FOX 31 Denver"}, "author": "DJ Summers", "title": "Omicron caused more Colorado COVID cases than all of 2020 - FOX31 Denver", "description": "Colorado recorded just over 350,000 cases throughout the first year of the pandemic. Between Dec. 1 and the present, it has seen almost 415,000.", "url": "https://kdvr.com/news/coronavirus/omicron-caused-more-colorado-covid-cases-than-all-of-2020/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2022/01/GettyImages-1299349889-1.jpg?w=1280", "publishedAt": "2022-02-01T23:23:45Z", "content": "DENVER (KDVR) — The omicron variant spread faster and farther than any coronavirus strain to date. \r\nThe World Health Organization tallied 90 million COVID cases in the last 10 weeks since the omicro… [+464 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Iron Accumulation Linked With Age-Related Cognitive Decline - Neuroscience News", "description": "A breakdown in regulatory mechanisms causes iron to build up in the brain during aging, increasing oxidative stress and increasing the risk of age-related cognitive decline, a new study reports.", "url": "https://neurosciencenews.com/iron-accumulation-cognition-aging-19997/", "urlToImage": "https://neurosciencenews.com/files/2022/02/iron-accumulation-cognition-neurosicences.jpg", "publishedAt": "2022-02-01T22:58:51Z", "content": "Summary: A breakdown in regulatory mechanisms causes iron to build up in the brain during aging, increasing oxidative stress and increasing the risk of age-related cognitive decline, a new study repo… [+5646 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jessica Knibbs", "title": "Cancer: Smear tests could help to determine a women's risk of ovarian cancer says research - Express", "description": "OVARIAN cancer is one of the most common types of cancer in women. A woman's risk of getting ovarian cancer during her lifetime is about one in 78.", "url": "https://www.express.co.uk/life-style/health/1559470/Cancer-smear-tests-ovarian-symptoms-risk", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1559470.jpg", "publishedAt": "2022-02-01T22:38:11Z", "content": "In the study, published in Nature Communications, the use of smear tests in detecting ovarian cancer was analysed.\r\nCervical cell samples were collected from 242 women with ovarian cancer and 869 wit… [+507 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New machine-learning model could speed up the process of developing new medicines - News-Medical.net", "description": "Antibodies, small proteins produced by the immune system, can attach to specific parts of a virus to neutralize it.", "url": "https://www.news-medical.net/news/20220201/New-machine-learning-model-could-speed-up-the-process-of-developing-new-medicines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2022-02-01T22:30:00Z", "content": "Antibodies, small proteins produced by the immune system, can attach to specific parts of a virus to neutralize it. As scientists continue to battle SARS-CoV-2, the virus that causes Covid-19, one po… [+5451 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Hormone replacement therapy to be sold over the counter for first time - The Telegraph", "description": "Exclusive: Rule change proposed so women can take HRT menopause drugs without a prescription", "url": "https://www.telegraph.co.uk/news/2022/02/01/hormone-replacement-therapy-sold-counter-first-time/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/02/01/TELEMMGLPICT000284440199_trans_NvBQzQNjv4BqS8u5Eplmrar4rPkapdr9QpF6tpult2aKpZyDLHPQ5Do.jpeg?impolicy=logo-overlay", "publishedAt": "2022-02-01T21:55:00Z", "content": "Some pharmacists already employ trained prescribers who are able to issue medicines on prescription. The latest changes may still require a consultation with a pharmacist, as is the case when the con… [+2455 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "A Man Chopped Off His Penis With Scissors in a Fit of Cannabis-Induced Psychosis, Doctors Say - Gizmodo", "description": "The man's detached member was considered \"too dirty and fragile\" to reattach, though his injuries and delusional symptoms were treated successfully.", "url": "https://gizmodo.com/man-chopped-off-penis-cannabis-induced-psychosis-1848462592", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e8e058dc3dc340da0126e2d42a3d347b.jpg", "publishedAt": "2022-02-01T21:54:00Z", "content": "A man in Thailands bong session went disastrously wrong, according to his doctors. In a new case report, they describe how he completely amputated his penis using scissors, apparently due to a rare e… [+3717 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Omicron amps up concerns about long COVID and its causes - Japan Today", "description": "More than a year after a bout with COVID-19, Rebekah Hogan still suffers from severe brain fog, pain and fatigue that leave her unable to do her nursing job or handle household activities. Long COVID has her questioning her worth as a wife and mother. “Is thi…", "url": "https://japantoday.com/category/features/health/omicron-amps-up-concerns-about-long-covid-and-its-causes", "urlToImage": null, "publishedAt": "2022-02-01T20:05:00Z", "content": "More than a year after a bout with COVID-19, Rebekah Hogan still suffers from severe brain fog, pain and fatigue that leave her unable to do her nursing job or handle household activities.\r\nLong COVI… [+8991 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Felicity Warner, USA TODAY", "title": "How to get smell taste back after COVID-19: Essential oils may help - USA TODAY", "description": "COVID-19 causes loss of taste and smell in a large majority of cases. Smell training with essential oils may help retrain your senses—buy now from retailers like Amazon, Public Goods, CVS and more.", "url": "https://www.usatoday.com/story/money/reviewed/2022/02/01/how-to-get-smell-taste-back-after-covid-19-essential-oils-smell-training-may-help/9283695002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/02/01/USAT/7e99326d-463c-4d39-830d-30d7c871fedd-3.png?auto=webp&crop=1911,1075,x8,y0&format=pjpg&width=1200", "publishedAt": "2022-02-01T19:55:19Z", "content": "— Recommendations are independently chosen by Reviewed’s editors. Purchases you make through our links may earn us a commission.\r\nWith millions of people across the world contracting and recovering f… [+5557 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "NIH trial will test reducing medication to boost vaccine response in transplant recipients - Healio", "description": "A phase 2 trial will evaluate if temporarily reducing the immunosuppressive medication of transplant recipients in the days before and after they receive an additional dose of COVID-19 vaccine increases their immune response to the vaccine.\nThe trial, which i…", "url": "https://www.healio.com/news/infectious-disease/20220201/nih-trial-will-test-reducing-medication-to-boost-vaccine-response-in-transplant-recipients", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/other/covidvaccine3_-330634250.jpeg", "publishedAt": "2022-02-01T19:47:18Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nA phase 2 trial will evaluate if tempora… [+2635 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Kelly Burch, Kailey Proctor", "title": "High blood pressure diet: Foods to eat and avoid - Insider", "description": "If you have high blood pressure, you can help control it with a healthy diet that includes whole fruits, vegetables, whole grains.", "url": "https://www.insider.com/high-blood-pressure-diet", "urlToImage": "https://i.insider.com/61f98b99ef63e10018100e21?width=1200&format=jpeg", "publishedAt": "2022-02-01T19:42:18Z", "content": "High blood pressure, or \r\nhypertension, is extremely common, affecting 47% of American adults. That's a problem since people with high blood pressure are at increased risk for heart attack, stroke, k… [+5064 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Pictorial warnings could reduce purchases of sugary drinks - Medical Xpress", "description": "Purchases of sugary drinks could be reduced by pictorial health warnings, reports research publishing February 1st in the open access journal PLOS Medicine. A trial in a naturalistic store setting found parents bought fewer sugary drinks when products display…", "url": "https://medicalxpress.com/news/2022-02-pictorial-sugary.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/pictorial-warnings-cou.jpg", "publishedAt": "2022-02-01T19:00:04Z", "content": "Purchases of sugary drinks could be reduced by pictorial health warnings, reports research publishing February 1st in the open access journal PLOS Medicine. A trial in a naturalistic store setting fo… [+2904 chars]"}, {"source": {"id": null, "name": "Becker's Hospital Review"}, "author": "Cailey Gleeson", "title": "'Smart stethoscope' can spot heart failure, study finds - Becker's Hospital Review", "description": "The Imperial College of London and the UK National Health Service found an AI-powered device can screen for heart failure during physical exams, according to a study published Feb. 1 in The Lancet.", "url": "https://www.beckershospitalreview.com/cardiology/smart-stethoscope-can-spot-heart-failure-study-finds.html", "urlToImage": "https://www.beckershospitalreview.com/images/channels/cardiology/3.jpg", "publishedAt": "2022-02-01T17:39:25Z", "content": "The Imperial College of London and the UK National Health Service found an AI-powered device can screen for heart failure during physical exams, according to a study published Feb. 1 in The Lancet.\r\n… [+1033 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Treatment keeps alcoholic monkeys from drinking as much - Science Daily", "description": "A hormone produced by the liver called fibroblast growth factor 21 (FGF21) suppresses alcohol consumption in primates, finds a new study. Vervet monkeys with a strong preference for ethanol that were given an FGF21 analogue consumed 50% less alcohol. The stud…", "url": "https://www.sciencedaily.com/releases/2022/02/220201110624.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T17:32:17Z", "content": "A hormone produced by the liver called fibroblast growth factor 21 (FGF21) suppresses alcohol consumption in primates, finds a study published February 1 in the journal Cell Metabolism. Vervet monkey… [+3271 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Timothy Huzar", "title": "Does SARS-CoV-2 in white-tailed deer raise the risk of a new variant? - Medical News Today", "description": "New research documents SARS-CoV-2 being transmitted between white-tailed deer in the United States. MNT reached out for expert opinions on the study's findings.", "url": "https://www.medicalnewstoday.com/articles/silent-epidemic-of-sars-cov-2-in-white-tailed-deer-raises-concerns", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/01/deer_SARS-CoV-2_GettyImages1288715544_Thumb.jpg", "publishedAt": "2022-02-01T17:29:52Z", "content": "<ul><li>SARS-CoV-2 originated in animals before being transmitted to humans.</li><li>Animals are also able to acquire SARS-CoV-2 infections from humans.</li><li>The present research documents that SA… [+6146 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Daily physical activity boosts cognitive performance in middle-aged and older adults - News-Medical.Net", "description": "A new study by researchers at University of California San Diego School of Medicine adds to the canon of research associating physical activity with cognitive performance, this time using 90 middle-aged and older subjects who wore accelerometers while physica…", "url": "https://www.news-medical.net/news/20220201/Daily-physical-activity-boosts-cognitive-performance-in-middle-aged-and-older-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Physical_Activity-620x480.jpg", "publishedAt": "2022-02-01T17:15:00Z", "content": "A new study by researchers at University of California San Diego School of Medicine adds to the canon of research associating physical activity with cognitive performance, this time using 90 middle-a… [+2614 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Study finds pancreatic cancer cells feed off hyaluronic acid - The Statesman", "description": "\"Hyaluronic acid doesn't only affect tumours by creating this density, which does make it difficult to treat,\" Lyssiotis said.", "url": "https://www.thestatesman.com/lifestyle/health/study-finds-pancreatic-cancer-cells-feed-off-hyaluronic-acid-1503043114.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/01/QT-DNA.jpg", "publishedAt": "2022-02-01T16:54:20Z", "content": "A new study has found that hyaluronic acid which is present in pancreatic tumours also acts as food to the cancer cells.\r\nThe study has been published in the ‘eLife Journal’. “A central driving theme… [+3933 chars]"}, {"source": {"id": null, "name": "BioSpace"}, "author": "Vanessa Doctor, RN", "title": "ImmunityBio's Kick-and-Kill Therapy Shows Promise For HIV Patients - BioSpace", "description": "ImmunityBio shared positive results from its clinical trial on its IL-15 superagonist Anktiva (N-803) to treat people living with human immunodeficiency virus (HIV).", "url": "https://www.biospace.com/article/immunitybio-s-new-kick-and-kill-therapy-shows-promise-for-hiv-patients/", "urlToImage": "https://www.biospace.com/getasset/c09c6230-83c1-4a0e-b727-95615ddd331d/;w=625;h=350", "publishedAt": "2022-02-01T14:40:21Z", "content": "ImmunityBio shared positive results from the clinical trial of its IL-15 superagonist Anktiva (N-803) to treat people living with human immunodeficiency virus (HIV). \r\nThe Phase I HIV Cure Study is e… [+2425 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Atrial shunt device for heart failure with preserved and mildly reduced ejection fraction (REDUCE LAP-HF II): a randomised, multicentre, blinded, sham-controlled trial - The Lancet", "description": "Placement of an atrial shunt device did not reduce the total rate of heart failure\nevents or improve health status in the overall population of patients with heart failure\nand ejection fraction of greater than or equal to 40%.", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00016-2/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/f7b01451-91dd-4b75-ac1e-e024bb2af029/gr2.jpg", "publishedAt": "2022-02-01T14:28:59Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Illustrating the structural diversity of SARS-CoV-2 Omicron spike - News-Medical.Net", "description": "In a new study, a team of researchers used cryo-electron microscopy to determine the spike (S) structures of the SARS-CoV-2 Omicron variant to understand how the mutations that alter its primary sequence impact S conformation.", "url": "https://www.news-medical.net/news/20220201/Illustrating-the-structural-diversity-of-SARS-CoV-2-Omicron-spike.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703172_16437223728221742.jpg", "publishedAt": "2022-02-01T13:44:00Z", "content": "In a recent study posted to the bioRxiv* pre-print server, a team of researchers used cryo-electron microscopy (cryo-EM) to determine the spike (S) structures of the severe acute respiratory syndrome… [+5100 chars]"}, {"source": {"id": null, "name": "Rheumatology Advisor"}, "author": null, "title": "COVID-19 Vaccine Response Assessed in Patients With RA Receiving Rituximab - Rheumatology Advisor", "description": "Researchers studied the humoral and cellular immune responses after 2 or 3 doses of SARS-CoV-2 vaccines in patients with rheumatoid arthritis receiving treatment with rituximab.", "url": "https://www.rheumatologyadvisor.com/?p=88088", "urlToImage": "https://www.rheumatologyadvisor.com/wp-content/uploads/sites/18/2021/06/COVID19.Vaccine.Doctor_G_1289184541-1.jpg", "publishedAt": "2022-02-01T13:20:00Z", "content": "The humoral and cellular immune responses to SARS-CoV-2 vaccines were assessed among patients with rheumatoid arthritis (RA) receiving treatment with rituximab, in a study published in Lancet Rheumat… [+4586 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Ellie Cambridge", "title": "My four-year-old son went to sleep and woke up paralysed... - The Sun", "description": "", "url": "https://www.the-sun.com/health/4586783/little-boy-woke-up-paralysed/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/02/NINTCHDBPICT000708721085.jpg?crop=1px%2C239px%2C827px%2C551px&resize=1200%2C800", "publishedAt": "2022-02-01T13:04:00Z", "content": "A MUM has relived the horror morning her little boy woke up paralysed.\r\nOliver Davis had gone to bed the night before a healthy four-year-old - but when he woke up he couldn't feel his legs.\r\nOliver … [+2946 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Frank Chung", "title": "Twenty Covid mutations in single patient - NEWS.com.au", "description": "<p class=\"story-block__standfirst\">A young South African woman with untreated HIV was infected with SARS-CoV-2 for nine months, during which the respiratory virus accumulated more than 20 additional mutations, a new study claims.</p>", "url": "https://www.news.com.au/technology/science/human-body/covid19-developed-mutations-in-hivpositive-patient-south-african-study-suggests/news-story/6faacd10345d845357ee0f66d064b05a", "urlToImage": "https://content.api.news/v3/images/bin/12219805020da4275b04de1c571b3827", "publishedAt": "2022-02-01T12:35:27Z", "content": "The SARS-CoV-2 virus developed more than 20 mutations while infecting a young woman with uncontrolled HIV for nine months, a new study says.A young South African woman with untreated HIV was infected… [+3227 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Brian Oliver", "title": "Australia: It's summer, so bushfires and COVID collide: Three ways one affects the other - Medical Xpress", "description": "It's summer in a pandemic. So as Australia opens its borders and COVID case numbers rise, we'll likely see the interplay of COVID and bushfires.", "url": "https://medicalxpress.com/news/2022-02-summer-bushfires-covid-collide-ways.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/bush-fire.jpg", "publishedAt": "2022-02-01T12:30:01Z", "content": "It's summer in a pandemic. So as Australia opens its borders and COVID case numbers rise, we'll likely see the interplay of COVID and bushfires.\r\nOur bodies react to SARS-CoV-2, the virus that causes… [+5501 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring beta-coronavirus neutralization by vaccine-induced murine antibody WS6 - News-Medical.Net", "description": "In a new study, researchers evaluated the neutralizing antibody titers in mice vaccinated with messenger ribonucleic acid (mRNA) encoding SARS-CoV-2 spike (S) protein.", "url": "https://www.news-medical.net/news/20220201/Exploring-beta-coronavirus-neutralization-by-vaccine-induced-murine-antibody-WS6.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703166_16437178719945419.jpg", "publishedAt": "2022-02-01T12:23:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers evaluated the neutralizing antibody titers in mice vaccinated with messenger ribonucleic acid (mRNA) encoding severe acute respir… [+6809 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Researchers identify enzyme that prevents autoimmune disorders - Health Europa", "description": "Researchers have identified an enzyme to correctly identify threats, reducing the risk of autoimmune disorders.", "url": "https://www.healtheuropa.eu/researchers-identify-enzyme-that-prevents-autoimmune-disorders/113208/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/02/iStockenot-poloskun-951668074.jpg", "publishedAt": "2022-02-01T10:50:53Z", "content": "The enzyme was discovered in the thymus, an important organ where immune T cells learn to fight infection. The new findings revealed that the enzyme KAT7 is necessary to activate thousands of genes r… [+3656 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "谭欣雨", "title": "Aussie researchers develop software to detect potential health problems of newborns - Chinadaily USA", "description": null, "url": "http://global.chinadaily.com.cn/a/202202/01/WS61f8ff54a310cdd39bc846f6.html", "urlToImage": "//img2.chinadaily.com.cn/images/202202/01/61f909e8a310cdd3d82a63c4.jpeg", "publishedAt": "2022-02-01T10:00:09Z", "content": "SYDNEY -- Australian researchers have developed a new software to check for potentially serious health problems of vulnerable babies and infants.\r\nDetails of the medical breakthrough, published in th… [+2049 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Gut Protected Against Inflammatory Bowel Disease by Protein From Rare Immune Cell - Technology Networks", "description": "A growth factor protein produced by rare immune cells in the intestine can protect against the effects of inflammatory bowel disease, according to a new discovery.", "url": "https://www.technologynetworks.com/immunology/news/gut-protected-against-inflammatory-bowel-disease-by-protein-from-rare-immune-cell-358070", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358070/gut-protected-against-inflammatory-bowel-disease-by-protein-from-rare-immune-cell-358070-640x360.jpg?cb=20220201", "publishedAt": "2022-02-01T09:25:08Z", "content": "A growth factor protein produced by rare immune cells in the intestine can protect against the effects of inflammatory bowel disease (IBD), according to a new discovery from Weill Cornell Medicine re… [+5025 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Queen's University Belfast", "title": "New research will focus on repurposing existing drugs to treat patients with COVID-19 - Newswise", "description": "Queen’s University Belfast will lead a new £1.6m collaborative project to rapidly identify new treatments for COVID-19.", "url": "https://www.newswise.com/coronavirus/new-research-will-focus-on-repurposing-existing-drugs-to-treat-patients-with-covid-19", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-02-01T09:05:00Z", "content": "Newswise — The project, funded by the Medical Research Council, will bring together experts from Queen’s, University of Liverpool and University of Oxford . The team will use a data-driven approach t… [+4062 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Capsule Delivery Brings RNA Vaccine Pill One Step Closer - Genetic Engineering & Biotechnology News", "description": "Nucleic acids therapeutics including vaccines are limited to parenteral dosing when patients and clinicians prefer pills that can be orally administered dosage. MIT scientists have synthesized and screened a library of branched hybrid poly (β amino ester) mRN…", "url": "https://www.genengnews.com/topics/drug-discovery/drug-delivery/capsule-delivery-brings-rna-vaccine-pill-one-step-closer/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/01/diana-polekhina-UGWA843r62Y-unsplash-scaled-e1643659787381.jpg", "publishedAt": "2022-02-01T08:00:55Z", "content": "Diseases ranging from cancer to COVID can be effectively treated with RNA and DNA- based drugs. Until now, these large and labile life-saving drugs needed to be injected, posing an obstacle to treatm… [+4841 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "COVID will soon be endemic. This doesn't mean it's harmless or we give up, just that it's part of life - ABC News", "description": "Endemic doesn't mean we drop our guard, surrender to the virus or downgrade the threat it poses to individuals and the community, write Hassan Vally and Catherine Bennett.", "url": "https://www.abc.net.au/news/2022-02-01/covid-will-be-endemic-but-that-doesnt-mean-its-harmless/100795810", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4e17de37144d5f66e96f0ba2fba7cee8?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=182&width=862&height=485", "publishedAt": "2022-02-01T04:39:41Z", "content": "We have experienced many bumps in the road since 2020 and one would have to be extremely brave to predict what the pandemic may throw at us next.\r\nBut in terms of the endgame, many experts believe CO… [+5555 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Burst of radiation and vesicles-based immunotherapy suppress brain cancer growth — ScienceDaily - Verve Times", "description": "Short bursts of radiation therapy dramatically enhanced the efficiency of targeting glioblastomas with natural nanoparticle-based immunotherapy, thus suppressing growth of the deadly tumor, inducing anti-tumor immunity and prolonging survival in anim", "url": "https://vervetimes.com/burst-of-radiation-and-vesicles-based-immunotherapy-suppress-brain-cancer-growth-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T04:02:39Z", "content": "Short bursts of radiation therapy dramatically enhanced the efficiency of targeting glioblastomas with natural nanoparticle-based immunotherapy, thus suppressing growth of the deadly tumor, inducing … [+4049 chars]"}, {"source": {"id": null, "name": "Hepburnadvocate.com.au"}, "author": null, "title": "What you need to know about getting your child's hearing tested - Hepburn Advocate", "description": "Parents should be aware of the warning signals of poor hearing in newborns, toddlers, and school-aged children", "url": "https://www.hepburnadvocate.com.au/story/7602971/what-you-need-to-know-about-getting-your-childs-hearing-tested/", "urlToImage": "https://www.hepburnadvocate.com.au/images/transform/v1/crop/frm/cpAaGjgJrzMeprrmmenK9y/15206a80-5814-4f83-b9c8-d72cfb5da317.jpg/r0_305_6000_3695_w1200_h678_fmax.jpg", "publishedAt": "2022-02-01T03:39:00Z", "content": "This article is in partnership with Hear and Say.\r\nWhile hearing loss in children is uncommon, parents should be aware of the warning signals in newborns, toddlers, and school-aged children.\r\nAudiolo… [+5090 chars]"}, {"source": {"id": null, "name": "PharmaLive"}, "author": "Andrew Humphreys", "title": "Genetically Engineered Dual Receptor T-cells: Double Trouble for Cancer Cells - PharmaLive", "description": "A multinational team of researchers genetically engineered T-lymphocytes to produce dual receptor rejuvenated T-cells, which exhibit antitumor properties with persistent, unlimited availability in vivo.", "url": "https://www.pharmalive.com/genetically-engineered-dual-receptor-t-cells-double-trouble-for-cancer-cells/", "urlToImage": "https://www.pharmalive.com/wp-content/uploads/2022/02/Juntendo-Cancer-Therapeutics-INFOGRAPHIC_.jpeg", "publishedAt": "2022-02-01T03:32:00Z", "content": "­­­RESEARCH NEWS STORY\r\nTokyo, 31st January, 2021\r\nGenetically Engineered Dual Receptor T-cells: Double Trouble for Cancer Cells\r\nScientists have genetically engineered a new type of cell that could … [+5892 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Food-tracking AI system developed to reduce malnutrition in LTC homes - EurekAlert", "description": "New technology could help reduce malnutrition and improve overall health in long-term care homes by automatically recording and tracking how much food residents consume.", "url": "https://www.eurekalert.org/news-releases/941666", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-01T02:03:26Z", "content": "New technology could help reduce malnutrition and improve overall health in long-term care homes by automatically recording and tracking how much food residents consume.\r\nThe smart system, developed … [+2646 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Open-label placebo shows promise as therapy for disorders of gut-brain interaction in children - News-Medical.Net", "description": "Pain-predominant disorders of gut-brain interaction (DGBIs) in children -; such as functional abdominal pain (FAP) and irritable bowel syndrome (IBS)-; can lead to disabling symptoms, poor quality of life and high use of health care resources.", "url": "https://www.news-medical.net/news/20220131/Open-label-placebo-shows-promise-as-therapy-for-disorders-of-gut-brain-interaction-in-children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2022-02-01T01:14:00Z", "content": "Pain-predominant disorders of gut-brain interaction (DGBIs) in children -; such as functional abdominal pain (FAP) and irritable bowel syndrome (IBS)-; can lead to disabling symptoms, poor quality of… [+2353 chars]"}, {"source": {"id": null, "name": "Womensagenda.com.au"}, "author": null, "title": "Depression and anxiety spiked among pregnant women during pandemic: UK research - Women's Agenda", "description": "Rates of depression and anxiety spiked during the COVID-19 pandemic among expectant mothers, a new report has found.", "url": "https://womensagenda.com.au/latest/depression-and-anxiety-spiked-among-pregnant-women-during-pandemic-uk-research/", "urlToImage": "https://womensagenda.com.au/wp-content/uploads/2022/02/Untitled-design-13.png", "publishedAt": "2022-01-31T23:23:42Z", "content": "Rates of depression and anxiety spiked during the COVID-19 pandemic among expectant mothers, a new report from the University of Essex has found.\r\nThe study revealed an increase in reported rates of … [+2758 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers identify genetic cause of rare interstitial lung disease in a young child - News-Medical.Net", "description": "New research from Washington University School of Medicine in St. Louis has solved the medical mystery of why a 2-year-old child — seemingly healthy at birth — succumbed to an undiagnosed, rare illness.", "url": "https://www.news-medical.net/news/20220131/Researchers-identify-genetic-cause-of-rare-interstitial-lung-disease-in-a-young-child.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-01-31T23:15:00Z", "content": "New research from Washington University School of Medicine in St. Louis has solved the medical mystery of why a 2-year-old child — seemingly healthy at birth — succumbed to an undiagnosed, rare illne… [+6460 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 By The Numbers: Coronavirus data in Hampton Roads, 1/31/22 - 13News Now", "description": "13News Now Dan Kennedy breaks down the latest metrics and coronavirus health trends in Hampton Roads and Virginia as of Jan. 31, 2022.Subscribe: https://www....", "url": "https://www.youtube.com/watch?v=wRRI5mYOx28", "urlToImage": "https://i.ytimg.com/vi/wRRI5mYOx28/hqdefault.jpg", "publishedAt": "2022-01-31T22:16:48Z", "content": null}, {"source": {"id": null, "name": "TCTMD"}, "author": "Caitlin E. Cox", "title": "SCAI SHOCK: Update Refines Cardiogenic Shock Classification - TCTMD", "description": "The newly tweaked expert consensus is meant to be concise and to provide even more consistency across the diverse field.", "url": "https://www.tctmd.com/news/scai-shock-update-refines-cardiogenic-shock-classification", "urlToImage": "https://s3.amazonaws.com/prod.tctmd.com/public/2022-01/SCAI%20SHOCK%20Update%20Refines%20Cardiogenic%20Shock%20Classification.jpg", "publishedAt": "2022-01-31T21:45:00Z", "content": "First released in 2019, the Society for Cardiovascular Angiography and Interventions (SCAI) cardiogenic shock categories have gotten a rethink, one that adds nuance to aid decision-making and incorpo… [+8580 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Molly Chiu", "title": "Novel neurodevelopmental disorder associated with mutations or deletions of PAX5 gene - Medical Xpress", "description": "Researchers led by a team at Baylor College of Medicine have identified a novel neurodevelopmental disorder associated with mutations or deletions affecting a gene called PAX5. Their findings are published in the journal Human Mutation.", "url": "https://medicalxpress.com/news/2022-01-neurodevelopmental-disorder-mutations-deletions-pax5.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/15-brain.jpg", "publishedAt": "2022-01-31T21:05:58Z", "content": "Researchers led by a team at Baylor College of Medicine have identified a novel neurodevelopmental disorder associated with mutations or deletions affecting a gene called PAX5. Their findings are pub… [+3062 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "The West Australian", "title": "COVID-19: Rich countries should donate half their vaccine stock, new research claims - The West Australian", "description": "Rich countries should donate half of their COVID vaccine supply to poorer nations, new research has found— or face devastating new virus strains.", "url": "https://thewest.com.au/news/coronavirus/covid-19-rich-countries-should-donate-half-their-vaccine-stock-new-research-claims-c-5511900", "urlToImage": "https://images.thewest.com.au/publication/C-5511900/64560c2bf4e91cac4f4e9b1a12b2abfc5d853626-16x9-x0y0w798h449.jpg?imwidth=1200", "publishedAt": "2022-01-31T18:00:00Z", "content": "Rich countries should donate half of their COVID vaccine supply to poorer nations, new research has found or face devastating new virus strains.\r\nAccording to a new University of Hong Kong study, hig… [+1813 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Nina Cosdon", "title": "Genome Mapping Reveals Key Structural Variants Impacting COVID-19 Disease Severity - Contagionlive.com", "description": "The first study to use optical genome mapping to assess severely ill COVID-19 patients identified 7 key structural variants.", "url": "https://www.contagionlive.com/view/genome-mapping-reveals-key-structural-variants-impacting-covid-19-disease-severity", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/ce45b7cab60b48e692ee4bd2b66c20845fb7182e-3600x2400.jpg?fit=crop&auto=format", "publishedAt": "2022-01-31T17:03:58Z", "content": "One of the greatest mysteries of COVID-19 infection is the varying nature of disease severity; COVID-19 causes mortality in some yet no symptoms in others.\r\nOne study, published in iScience, found ra… [+2083 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Terri-Ann Williams", "title": "I live in constant fear that just turning my head could kill me at any moment... - The Sun", "description": "", "url": "https://www.the-sun.com/health/4580300/constant-fear-turning-head-kill-me-any-moment/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/01/crop-17499979.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-01-31T16:42:00Z", "content": "MUM Rachel Pighills had been moving into a new house when she struck her head on a ceiling fan.\r\nThe 35-year-old had been standing on a bed when the accident occurred and is now living in constant fe… [+5656 chars]"}, {"source": {"id": null, "name": "Boston News, Weather, Sports | WHDH 7News"}, "author": "", "title": "What’s known about ‘stealth’ version of omicron? - Boston News, Weather, Sports | WHDH 7News", "description": "Scientists and health officials around the world are keeping their eyes on a descendant of the omicron variant that has been found in more than...", "url": "https://whdh.com/news/whats-known-about-stealth-version-of-omicron/", "urlToImage": "https://whdh.com/wp-content/uploads/sites/3/2022/01/Untitled-2022-01-19T123348.545.jpg?quality=60&strip=color&w=1024", "publishedAt": "2022-01-31T16:26:50Z", "content": "Scientists and health officials around the world are keeping their eyes on a descendant of the omicron variant that has been found in more than 50 countries, including the United States.\r\nThis versio… [+5047 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Lower socioeconomic status causes more post-heart surgery health risks - Open Access Government", "description": "Patients with heart disease who come from disadvantaged communities experience more complications after their surgery", "url": "https://www.openaccessgovernment.org/socioeconomic-heart-surgery/128593/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2022/01/dreamstime_m_178507180.jpg", "publishedAt": "2022-01-31T15:05:52Z", "content": "Research finds that patients with mitral valve disease who live in disadvantaged communities are more likely to experience complications and are at higher risk for death  after surgery than those wit… [+4271 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "NHS cancer patients to get pioneering genetic test to find best treatments - The Guardian", "description": "Exclusive: Liquid biopsy blood tests being offered to patients who have exhausted other options", "url": "https://amp.theguardian.com/society/2022/jan/31/nhs-cancer-patients-to-get-pioneering-genetic-test-to-find-best-treatments", "urlToImage": "https://i.guim.co.uk/img/media/a341cddfc6c0b0a4c588ff29e4f8c6d4e7cf0f39/0_47_4928_2958/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=68ccfc8abbb8b4994f5321bf695b4690", "publishedAt": "2022-01-31T13:33:00Z", "content": "Thousands of NHS cancer patients who have exhausted all other options are being offered liquid biopsy blood tests to match them to personalised medicines.\r\nThe groundbreaking genetic analysis gives p… [+4111 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Emily Head", "title": "First global analysis of rare high cholesterol disorder shows vast disparities - Medical Xpress", "description": "Homozygous familial hypercholesterolaemia is often diagnosed late and is under-treated, causing hotspots of cardiovascular disease risk worldwide.", "url": "https://medicalxpress.com/news/2022-01-global-analysis-rare-high-cholesterol.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/first-global-analysis.jpg", "publishedAt": "2022-01-31T13:30:01Z", "content": "Homozygous familial hypercholesterolaemia is often diagnosed late and is under-treated, causing hotspots of cardiovascular disease risk worldwide.\r\nAccording to a new study in The Lancet, carried out… [+4080 chars]"}, {"source": {"id": null, "name": "MyNorthwest.com"}, "author": "", "title": "Virologist explains the science of immune protection against ‘stealth omicron’ - MyNorthwest.com", "description": "A virologist explains why vaccines will continue to be important for COVID management as cases level off and the pandemic reaches an endemic state.", "url": "https://mynorthwest.com/3329703/virologist-explains-the-science-of-immune-protection-against-stealth-omicron/", "urlToImage": "https://mynorthwest.com/wp-content/uploads/2022/01/harborview_4_900.png", "publishedAt": "2022-01-31T13:13:27Z", "content": "Cases of COVID-19 are steadily trending down in King County (the public health department reports 3,574 daily average cases as of Jan. 24, down from a peak of 6,442 on Jan. 10). And last week, Gov. J… [+4090 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds how a change in cell environment triggers autism with genetic vulnerability - News-Medical.Net", "description": "People with autism spectrum disorders all have characteristic behavioral difficulties. Nevertheless, the important heterogeneity of their symptoms remains one of the major questions for scientists and physicians.", "url": "https://www.news-medical.net/news/20220131/Study-finds-how-a-change-in-cell-environment-triggers-autism-with-genetic-vulnerability.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Autism-620x480.jpg", "publishedAt": "2022-01-31T12:45:00Z", "content": "People with autism spectrum disorders all have characteristic behavioral difficulties. Nevertheless, the important heterogeneity of their symptoms remains one of the major questions for scientists an… [+4935 chars]"}, {"source": {"id": null, "name": "Manningrivertimes.com.au"}, "author": null, "title": "Hunter New England Health District says Kunjin virus has been detected in horses - Manning River Times", "description": "Kunjin virus has been detected in NSW, along with Murray Valley encephalitis, both caused by mosquito bites", "url": "https://www.manningrivertimes.com.au/story/7600889/health-warnings-to-avoid-serious-mozzie-borne-virus/", "urlToImage": "https://www.manningrivertimes.com.au/images/transform/v1/crop/frm/shR26sqTFdeGBmx6G4p3AA/5f8bf06b-d9ec-40de-a985-d45451c4cf7d.jpg/r3_0_1198_675_w1200_h678_fmax.jpg", "publishedAt": "2022-01-31T07:00:00Z", "content": ""}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Cameron Webb", "title": "Insect repellents work – but there are other ways to beat mosquitoes without getting sticky - The Conversation AU", "description": "Summer is no fun when mosquitoes are biting. Insect repellent creams, sprays, and lotions are safe and effective but there are alternatives. Here’s what works and what doesn’t!", "url": "https://theconversation.com/insect-repellents-work-but-there-are-other-ways-to-beat-mosquitoes-without-getting-sticky-171805", "urlToImage": "https://images.theconversation.com/files/443310/original/file-20220131-15248-1b08evd.jpg?ixlib=rb-1.1.0&rect=17%2C287%2C5964%2C2982&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-31T05:39:31Z", "content": "Summer can be hot and sticky. And insect repellent creams, lotions, and sprays can make it stickier. \r\nStopping mosquito bites is key to avoiding itchy bumps and mosquito-borne disease. Thankfully, t… [+5210 chars]"}]}