{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Elizabeth Daoud", "title": "COVID fragments detected in sewage in Rockhampton North and Maryborough catchments - 7NEWS.com.au", "description": "‘It is critical we detect any cases that we may not be aware of as quickly as possible through our testing system, to contain any potential spread.’", "url": "https://7news.com.au/news/qld/covid-detected-in-queensland-sewage-despite-state-being-virus-free-for-months-c-2191062", "urlToImage": "https://images.7news.com.au/publication/C-2191062/dc5970a1c17366821f6fee8a656fd278d70d2534-16x9-x0y2w2000h1125.png?imwidth=1024", "publishedAt": "2021-02-18T07:47:00Z", "content": "Fragments of COVID have been detected in wastewater in two locations in Queensland, prompting a warning from authorities.\r\nThe virus was detected in Rockhampton North and Maryborough sewage catchment… [+1339 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Joanna Groom", "title": "Why do kids tend to have milder COVID? This new study gives us a clue - The Conversation AU", "description": "Children in the study seemed to display a very strong \"innate\" immune response.", "url": "https://theconversation.com/why-do-kids-tend-to-have-milder-covid-this-new-study-gives-us-a-clue-155555", "urlToImage": "https://images.theconversation.com/files/384941/original/file-20210218-22-jyn87n.jpg?ixlib=rb-1.1.0&rect=0%2C65%2C1000%2C499&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-18T07:30:00Z", "content": "A new Australian study, published overnight in Nature Communications, gives an insight into how kids immune systems respond to infection with SARS-CoV-2, the virus that causes COVID-19.\r\nIts the firs… [+4716 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Morexette Marie B. Erram", "title": "2 unknown mutations of SARS-CoV-2 found in Cebu - INQUIRER.net", "description": "CEBU CITY, Philippines - Scientists in the country have discovered the presence of at least two mutations of SARS-CoV-2, which could explain the continued increase of the coronavirus disease 2019", "url": "https://www.inquirer.net", "urlToImage": "https://cebudailynews.inquirer.net/files/2021/02/152394864_251222846378646_7830075178582759163_n.jpg", "publishedAt": "2021-02-18T05:56:00Z", "content": "CEBU CITY, Philippines – Scientists in the country have discovered the presence of at least two mutations of SARS-CoV-2, which could explain the continued increase of the coronavirus disease 2019 (CO… [+3069 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New automated system may reduce opioid misuse - News-Medical.Net", "description": "After more than 1,000 orthopedic procedures at a city health system, roughly 61 percent of the opioids prescribed to patients went unused, according to new research.", "url": "https://www.news-medical.net/news/20210218/New-automated-system-may-reduce-opioid-misuse.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/AMBULANCE_shutterstock_459995515_3e68759a2ae241e59a5798e360dfed56-620x480.jpg", "publishedAt": "2021-02-18T05:24:00Z", "content": "After more than 1,000 orthopedic procedures at a city health system, roughly 61 percent of the opioids prescribed to patients went unused, according to new research.\r\nThis was discovered within a stu… [+5435 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "SARS-CoV-2 variants of concern drive up infections by 15-40 percent in Germany - News-Medical.Net", "description": "As the coronavirus disease 2019 (COVID-19) pandemic, caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), continues to distress worldwide, new variants are emerging that threaten the possibility of containment by current vaccines or the…", "url": "https://www.news-medical.net/news/20210218/SARS-CoV-2-variants-of-concern-drive-up-infections-by-15-40-percent-in-Germany.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/50953231798_30e4eff0b7_k.jpg", "publishedAt": "2021-02-18T05:21:00Z", "content": "As the coronavirus disease 2019 (COVID-19) pandemic, caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), continues to distress worldwide, new variants are emerging that threat… [+6160 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Déjà brew? Another shot for lovers of coffee - EurekAlert", "description": "In a world first genetic study, researchers from the Australian Centre for Precision Health at the University of South Australia found that that long-term, heavy coffee consumption - six or more cups a day - can increase the amount of lipids (fats) in your bl…", "url": "https://www.eurekalert.org/pub_releases/2021-02/uosa-dba021621.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/256569_web.jpg", "publishedAt": "2021-02-18T05:01:25Z", "content": "Long black, espresso, or latte, whatever your coffee preference, drink too much and you could be in hot water, especially when it comes to heart health.\r\nIn a world first genetic study, researchers f… [+3561 chars]"}, {"source": {"id": null, "name": "Marie Claire"}, "author": "Chloe Spitlanic as told to Monisha Rudhran", "title": "Ovarian Cancer Experience: Chloe Spitlanic's Account Of The Diagnosis And Treatment In Her Twenties - Marie Claire", "description": "Chloe Spitlanic is 22-year-old who was diagnosed with stage three ovarian cancer just after commencing her masters degree. Here, she shares her experience.", "url": "https://www.marieclaire.com.au/ovarian-cancer-experience", "urlToImage": "http://www.marieclaire.com.au/media/84915/chloe-spitlanic-ovarian-cancer-australia-awareness-month-fb.jpg", "publishedAt": "2021-02-18T04:56:00Z", "content": "Unfortunately, ovarian cancer symptoms are so vague that it is hard to discernespecially as there are currently no early detection tests.\r\nMy whole situation? Just luck. My normal GP was actually on … [+9094 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study: Cognitive SuperAgers resist protein tangles that lead to Alzheimer’s disease - News-Medical.Net", "description": "A new Northwestern Medicine study showed cognitive SuperAgers have resistance to the development of fibrous tangles in a brain region related to memory and which are known to be markers of Alzheimer's disease.", "url": "https://www.news-medical.net/news/20210217/Study-Cognitive-SuperAgers-resist-protein-tangles-that-lead-to-Alzheimere28099s-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2021-02-18T04:40:00Z", "content": "A new Northwestern Medicine study showed cognitive SuperAgers have resistance to the development of fibrous tangles in a brain region related to memory and which are known to be markers of Alzheimer'… [+4012 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Australian Associated Press", "title": "WA to roll out COVID vaccines from Monday - Yahoo News Australia", "description": "At least 5000 West Australians should be fully vaccinated against COVID-19 by mid-March with hotel quarantine workers to be among the first recipients.The...", "url": "https://au.news.yahoo.com/wa-roll-covid-vaccines-monday-041529525.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2021-02-18T04:28:37Z", "content": "At least 5000 West Australians should be fully vaccinated against COVID-19 by mid-March with hotel quarantine workers to be among the first recipients.\r\nThe first doses of the Pfizer vaccine are due … [+2668 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New study sheds light on potential pathophysiological mechanism underlying delirium - News-Medical.Net", "description": "Delirium, a common syndrome among older adults, particularly in those who have recently undergone surgery, critically ill patients in the ICU, and in older patients with multiple health issues, is a form of acute confusion that is characterized by poor attent…", "url": "https://www.news-medical.net/news/20210217/New-study-sheds-light-on-potential-pathophysiological-mechanism-underlying-delirium.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2021-02-18T04:28:00Z", "content": "Delirium, a common syndrome among older adults, particularly in those who have recently undergone surgery, critically ill patients in the ICU, and in older patients with multiple health issues, is a … [+4527 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Sensor-based asthma inhalers can benefit pediatric asthma patients - News-Medical.Net", "description": "Sensor-based inhalers integrated into health care providers' clinical workflows may help improve medication adherence and support children with asthma - and their families - to more effectively manage this condition, according to a new Northwestern and Lurie …", "url": "https://www.news-medical.net/news/20210217/Sensor-based-asthma-inhalers-can-benefit-pediatric-asthma-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Asthma-620x480.jpg", "publishedAt": "2021-02-18T03:48:00Z", "content": "Sensor-based inhalers integrated into health care providers' clinical workflows may help improve medication adherence and support children with asthma - and their families - to more effectively manag… [+3945 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New possibilities to prevent sudden cardiac death - Science Daily", "description": "An assistant professor of biomedical sciences has developed a better understanding of the pathological characteristics behind arrhythmogenic cardiomyopathy, as well as promising avenues for prevention.", "url": "https://www.sciencedaily.com/releases/2021/02/210217175153.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-18T03:32:17Z", "content": "Nearly a half-million people a year die from sudden cardiac death (SCD) in the U.S. -- the result of malfunctions in the heart's electrical system.A leading cause of SCD in young athletes is arrhythm… [+2842 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Never-before-seen antibody binding, informing liver cancer, antibody design: X-ray crystallography and recombinant antibodies uncover workings of an elusive molecule central to human health - Science Daily", "description": "In structural biology, some molecules are so unusual they can only be captured with a unique set of tools. That's precisely how a team defined how antibodies can recognize a compound called phosphohistidine -- a highly unstable molecule that has been found to…", "url": "https://www.sciencedaily.com/releases/2021/02/210217204019.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-18T03:28:26Z", "content": "In structural biology, some molecules are so unusual they can only be captured with a unique set of tools. That's precisely how a multi-institutional research team led by Salk scientists defined how … [+3895 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New link between personality and risk of early death - Science Daily", "description": "Ground-breaking research has revealed for the first time that the immune system directly links personality to long-term risk of early death.", "url": "https://www.sciencedaily.com/releases/2021/02/210217151051.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-18T03:02:16Z", "content": "Ground-breaking research led by University of Limerick has revealed for the first time that the immune system directly links personality to long-term risk of death.The study sheds new light on why pe… [+3167 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Proton therapy induces biologic response to attack treatment-resistant cancers - Science Daily", "description": "Researchers have developed a novel proton therapy technique to more specifically target cancer cells that resist other forms of treatment. The technique is called LEAP, an acronym for 'biologically enhanced particle therapy.'", "url": "https://www.sciencedaily.com/releases/2021/02/210217151034.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-18T02:50:18Z", "content": "Mayo Clinic researchers have developed a novel proton therapy technique to more specifically target cancer cells that resist other forms of treatment. The technique is called LEAP, an acronym for \"bi… [+2663 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study: Gynecologists have a negative attitude towards clitoral reconstruction after female genital cutting - News-Medical.net", "description": "\"Gynecologists in Sweden are a very polarized group regarding clitoral reconstruction, and our study is one of very few on the subject,\" says Malin Jordal, researcher and senior lecturer in caring sciences at University of Gävle.", "url": "https://www.news-medical.net/news/20210217/Study-Gynecologists-have-a-negative-attitude-towards-clitoral-reconstruction-after-female-genital-cutting.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2021-02-18T02:34:00Z", "content": "\"Gynecologists in Sweden are a very polarized group regarding clitoral reconstruction, and our study is one of very few on the subject,\" says Malin Jordal, researcher and senior lecturer in caring sc… [+2933 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Georgia Hitch", "title": "Details of Australian coronavirus vaccine rollout announced, including locations for first jabs - ABC News", "description": "Around 240 aged care facilities across the country will be some of the first places to have the Pfizer coronavirus vaccine rolled out, Federal Health Minister Greg Hunt says.", "url": "https://www.abc.net.au/news/2021-02-18/coronavirus-vaccine-rollout-first-jab-details-revealed-greg-hunt/13167598", "urlToImage": "https://www.abc.net.au/cm/rimage/13074922-16x9-large.jpg?v=2", "publishedAt": "2021-02-18T02:26:00Z", "content": "Around 240 aged care facilities in nearly 200 towns across the country will be some of the first places to have the Pfizer coronavirus vaccine rolled out, Federal Health Minister Greg Hunt says.\r\nKey… [+4201 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Physical therapy improves patient outcomes post-cesarean section - News-Medical.Net", "description": "Women who received physical therapy after undergoing a cesarean section had significantly improved outcomes compared to those who did not according to a new study from University of Missouri Health Care.", "url": "https://www.news-medical.net/news/20210217/Physical-therapy-improves-patient-outcomes-post-cesarean-section.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/87802400-620x480.jpg", "publishedAt": "2021-02-18T02:01:00Z", "content": "Women who received physical therapy after undergoing a cesarean section had significantly improved outcomes compared to those who did not according to a new study from University of Missouri Health C… [+2223 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New method uses DNA biomarkers to flag prenatal environmental exposures in children - News-Medical.Net", "description": "Scientists at Columbia University Mailman School of Public Health developed a method using a DNA biomarker to easily screen pregnant women for harmful prenatal environmental contaminants like air pollution linked to childhood illness and developmental disorde…", "url": "https://www.news-medical.net/news/20210217/New-method-uses-DNA-biomarkers-to-flag-prenatal-environmental-exposures-in-children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2021-02-18T01:55:00Z", "content": "Scientists at Columbia University Mailman School of Public Health developed a method using a DNA biomarker to easily screen pregnant women for harmful prenatal environmental contaminants like air pol… [+3912 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Machine learning model may guide treatment decisions for lung cancer patients - News-Medical.Net", "description": "Doctors and healthcare workers may one day use a machine learning model, called deep learning, to guide their treatment decisions for lung cancer patients, according to a team of Penn State Great Valley researchers.", "url": "https://www.news-medical.net/news/20210217/Machine-learning-model-may-guide-treatment-decisions-for-lung-cancer-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2021-02-18T01:41:00Z", "content": "Doctors and healthcare workers may one day use a machine learning model, called deep learning, to guide their treatment decisions for lung cancer patients, according to a team of Penn State Great Val… [+6019 chars]"}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Felicity Caldwell", "title": "COVID virus fragments found more than 100 times in Qld wastewater - Brisbane Times", "description": "Queensland Health has released its full data from last year’s wastewater surveillance program.", "url": "https://www.brisbanetimes.com.au/national/queensland/covid-virus-fragments-found-more-than-100-times-in-qld-wastewater-20210217-p573b1.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.7671%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/c04e478bab2fcc4047b64f852fee1ef4d8e46709", "publishedAt": "2021-02-18T01:39:00Z", "content": "On Monday, 35 Logan suburbs were put on alert after fragments of SARS-CoV-2 were detected in the Loganholme sewage catchment, prompting Chief Health Officer Jeannette Young to urge anyone in the area… [+1837 chars]"}, {"source": {"id": null, "name": "SBS News"}, "author": "SBS News", "title": "How do scientists track new COVID variants? - SBS", "description": "Resources once used to further research on other diseases are now being used to identify new variants of the COVID-19 virus.", "url": "https://www.sbs.com.au/news/audiotrack/how-do-scientists-track-new-covid-variants", "urlToImage": "https://www.sbs.com.au/news/sites/sbs.com.au.news/files/podcast_images/inside_the_wellcome_sanger_lab_in_cambridge_looking_for_covid_variant_genomes_ap.jpg", "publishedAt": "2021-02-18T00:41:45Z", "content": "For health and support measures currently in place in response to the COVID-19 pandemic in your language, visit sbs.com.au/coronavirus"}, {"source": {"id": null, "name": "Salon"}, "author": null, "title": "Two mutated coronaviruses have merged into one hybrid virus. Here's how that happened - Salon", "description": "Scientist say that the emergent hybrid virus underscores the need to keep tabs on mutant strains", "url": "https://www.salon.com/2021/02/17/two-mutated-coronaviruses-have-merged-into-one-hybrid-heres-how-that-happened/", "urlToImage": "https://media.salon.com/2021/02/coronavirus-covid-19-0217211.jpg", "publishedAt": "2021-02-18T00:36:00Z", "content": "Two mutant strains of the novel coronavirus may have combined their genomes to create a new and heavily mutated variant of the deadly SARS-CoV-2 virus, which is responsible for causing COVID-19.\r\nAs … [+3394 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Alistair Smout", "title": "England lockdown reducing COVID infections - Ballarat Courier", "description": "England's third national COVID-19 lockdown is helping to reduce infections, a study has found, but the prevalence of cases remains high as Prime Minister Bori...", "url": "https://www.thecourier.com.au/story/7132289/england-lockdown-reducing-covid-infections/", "urlToImage": "https://www.thecourier.com.au/images/transform/v1/crop/frm/silverstone-feed-data/2b542789-fd11-4d7b-b285-3d98cb12cf66.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-18T00:16:43Z", "content": ""}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "English lockdown reducing COVID-19 infections but prevalence... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/BRITAIN-PREVALENCE:English lockdown reducing COVID-19 infections but prevalence still high, study finds", "url": "https://news.trust.org/item/20210217225923-lbiir", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/3f4d1e4d-71b8-46c0-a6fe-43eda68caf2a/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-02-18T00:01:00Z", "content": "LONDON, Feb 18 (Reuters) - England's third national COVID-19 lockdown is helping to reduce infections, a study found on Thursday, but the prevalence of cases remains high as Prime Minister Boris John… [+1677 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Accumulation of fatty tissue in the neck predicts adiposity, heart problems - News-Medical.Net", "description": "Researchers from the University of Granada warn that an accumulation of fatty tissue in the neck (both the double chin and the deeper deposits, located between muscles and around the cervical vertebrae) is a predictor of central and overall adiposity, cardiom…", "url": "https://www.news-medical.net/news/20210217/Accumulation-of-fatty-tissue-in-the-neck-predicts-adiposity-heart-problems.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2021-02-17T23:59:00Z", "content": "Researchers from the University of Granada warn that an accumulation of fatty tissue in the neck (both the double chin and the deeper deposits, located between muscles and around the cervical vertebr… [+4358 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Blood-clotting protein linked with tumor pathogenesis of CNS B-cell lymphoma - News-Medical.Net", "description": "In people with central nervous system (CNS) lymphoma, cancerous B cells--a type of white blood cell--accumulate to form tumors in the brain or spinal cord, often in close proximity to blood vessels.", "url": "https://www.news-medical.net/news/20210217/Blood-clotting-protein-linked-with-tumor-pathogenesis-of-CNS-B-cell-lymphoma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/92036744-620x480.jpg", "publishedAt": "2021-02-17T23:42:00Z", "content": "In people with central nervous system (CNS) lymphoma, cancerous B cells--a type of white blood cell--accumulate to form tumors in the brain or spinal cord, often in close proximity to blood vessels. … [+5331 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Clarifying the evidence on SARS-CoV-2 antigen rapid tests in public health responses to COVID-19 - The Lancet", "description": "The use of rapid lateral flow antigen testing (LFT) for SARS-CoV-2 has been questioned1–3\nwith uncorroborated4 reports of poor LFT sensitivity. The debate surrounding the use\nof the Innova Lateral Flow SARS-CoV-2 Antigen Test in the UK risks confusing policy\n…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00425-6/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/0333d383-f493-4632-bd0f-304de37c1c1f/fx1.jpg", "publishedAt": "2021-02-17T23:32:19Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2021 Elsevier Inc. except certain content provided by th… [+50 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "BioNTech/Pfizer vaccine is less potent against South African variant - Financial Times", "description": "Covid-19 jab still works but produces only a third of the antibodies it did for original virus, study finds", "url": "https://www.ft.com/content/2eb05859-54c1-45b5-9058-fa50fa6ca7da", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe763877c-f64e-41d2-823e-3147eb6fff9b.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2021-02-17T23:01:00Z", "content": "The BioNTech/Pfizer Covid-19 vaccine appears to be significantly less effective against the virus variant that emerged in South Africa, according to a study published on Wednesday. \r\nThe vaccine stil… [+2399 chars]"}, {"source": {"id": null, "name": "Sydney.edu.au"}, "author": null, "title": "White matter changes in brain found in frontotemporal dementia - News - The University of Sydney", "description": null, "url": "https://www.sydney.edu.au/news-opinion/news/2021/02/18/white-matter-changes-in-brain-found-in-frontotemporal-dementia.html", "urlToImage": "https://www.sydney.edu.au/content/dam/corporate/images/news-and-opinion/news/2020/neuroscience.jpg", "publishedAt": "2021-02-17T21:08:50Z", "content": "Areas of brain damage called white matter hyperintensities are commonly linked to vascular/blood vessel-related health problems and have also been linked to Alzheimers disease. Now a study has shown … [+1235 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New research finds drive-through mass-vaccination clinics could alter COVID-19 trajectory - Medical Xpress", "description": "Policymakers at all levels of government are racing to vaccinate hundreds of millions of people to save lives and blunt the deadly COVID-19 pandemic. New research published in the INFORMS Journal on Applied Analytics provides a simulated model for drive-throu…", "url": "https://medicalxpress.com/news/2021-02-drive-through-mass-vaccination-clinics-covid-trajectory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/clinic.jpg", "publishedAt": "2021-02-17T20:14:50Z", "content": "Policymakers at all levels of government are racing to vaccinate hundreds of millions of people to save lives and blunt the deadly COVID-19 pandemic. New research published in the INFORMS Journal on … [+2016 chars]"}, {"source": {"id": null, "name": "Herald Sun"}, "author": "Nathan Vass, Shoba Rao, Katy Hall, Tiffany Bakker, AFP", "title": "Scientists fear new pandemic as UK, California variants merge - Northern Star", "description": "A new COVID mutation has emerged that could be more infectious and more resistant to vaccines.", "url": "https://www.heraldsun.com.au/coronavirus/coronavirus-may-be-here-to-stay-despite-increased-vaccinations-and-global-drop-in-cases/news-story/1c39897b5be107d6b8d8f877ed4a75de", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/18/v3imagesbin5dd823076221401c0bdc4eaa687d8a7b-6keqx624jdipeivzvv2_ct1880x930.jpg", "publishedAt": "2021-02-17T20:06:00Z", "content": "Scientists fear the UK and California COVID variants have merged into a new mutated virus that has sparked concerns the pandemic could enter a new phase.\r\nDiscovered in a Californian laboratory, it i… [+13075 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Robotic dogs & laughter therapy: combating loneliness & isolation while social distancing - EurekAlert", "description": "Robotic dogs, laughter therapy and mindfulness are some of the ways that might help people - particularly the elderly - cope with loneliness and social isolation while social distancing, say researchers at the University of Cambridge.", "url": "https://www.eurekalert.org/pub_releases/2021-02/uoc-rd021621.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-02-17T19:17:35Z", "content": "Robotic dogs, laughter therapy and mindfulness are some of the ways that might help people - particularly the elderly - cope with loneliness and social isolation while social distancing, say research… [+7725 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jimmy Nsubuga", "title": "New COVID cases drop by half in 24 areas - map shows case rate in your area - Yahoo News Australia", "description": "The seven-day rolling rate of new COVID cases has dropped by more than 50% in 24 areas.", "url": "https://au.news.yahoo.com/new-covid-cases-coronavirus-lockdown-update-infection-rate-182116461.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-02/2ccdf380-714c-11eb-bbdf-0c5c3c71c68d", "publishedAt": "2021-02-17T18:24:29Z", "content": "Rutland had a 73.9% drop in new cases.\r\nThe seven-day rolling rate of new COVID cases has dropped by more than 50% in 24 areas.\r\nDowning Streets latest figures, for the seven days up to 12 February t… [+2202 chars]"}, {"source": {"id": null, "name": "Taiwan News"}, "author": "LOLITA C. BALDOR , Associated Press", "title": "Thousands of service members saying no to COVID-19 vaccine - Taiwan News", "description": "", "url": "https://www.taiwannews.com.tw/en/news/4129826", "urlToImage": "https://tnimage.s3.hicloud.net.tw/photos/2021/AP/20210218/9598283591834cf2a3540aea9d514c19.jpg", "publishedAt": "2021-02-17T18:19:00Z", "content": "WASHINGTON (AP) By the thousands, U.S. service members are refusing or putting off the COVID-19 vaccine as frustrated commanders scramble to knock down internet rumors and find the right pitch that w… [+6790 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "AAP", "title": "UK approves exposing volunteers to virus - PerthNow", "description": "UK researchers say 90 healthy volunteers between the ages of 18 and 30 will be infected with coronavirus in a controlled environment as part of a trial.", "url": "https://www.perthnow.com.au/news/health/uk-approves-exposing-volunteers-to-virus-ng-s-2049969", "urlToImage": "https://images.perthnow.com.au/publication/S-2049969/1613585861981_Virus_UK_Challenge_16-9_20417092_2049969_202102180502121326f6e3-2c08-485a-921d-050d8d1a1fb3.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2021-02-17T18:16:00Z", "content": "The UK has became the first country in the world to give the go-ahead for human challenge trials in which volunteers will deliberately be exposed to COVID-19 to advance research into the disease caus… [+1960 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Johnston", "title": "Why Leicester, Blackburn and Bradford have been hit hard by Covid - The Guardian", "description": "Leaders blame social inequalities, mistrust, and failures of test-and-trace system", "url": "https://www.theguardian.com/society/2021/feb/17/why-leicester-blackburn-and-bradford-have-been-hit-hard-by-covid", "urlToImage": "https://i.guim.co.uk/img/media/fea58ad33df158ec7b78aa768f5a11f8e466fff4/205_0_3295_1978/master/3295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35c642e56f9d9cf49c9321127b619320", "publishedAt": "2021-02-17T18:00:00Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New N501Y SARS-CoV-2 mutations increase binding to host cell receptor - News-Medical.Net", "description": "A team of researchers used several assays, atomic force microscopy, and simulations to determine that the N501Y mutation in the virus’s receptor-binding domain (RBD) increased the interaction of the virus with the angiotensin-converting enzyme 2 (ACE2) recept…", "url": "https://www.news-medical.net/news/20210217/New-N501Y-SARS-CoV-2-mutations-increase-binding-to-host-cell-receptor.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1848323542_(3).jpg", "publishedAt": "2021-02-17T17:17:00Z", "content": "A team of researchers at Nanjing University in China used several assays, atomic force microscopy, and simulations to determine that the N501Y mutation in the virus’s receptor-binding domain (RBD) in… [+4643 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "China's SARS and SARS-CoV-2 outbreak management in comparative perspective - News-Medical.Net", "description": "A new study compares the current SARS-CoV-2 outbreak with the earlier SARS-CoV epidemic to understand the best way to respond to it sensitively and flexibly. This involves early detection, using multiple screening tests, followed by management of the clinical…", "url": "https://www.news-medical.net/news/20210217/Chinas-SARS-and-SARS-CoV-2-outbreak-management-in-comparative-perspective.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/49557550706_221b77c479_k_(2).jpg", "publishedAt": "2021-02-17T13:17:00Z", "content": "Since the onset of the coronavirus disease 2019 (COVID-19) pandemic – caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) – the world has been plunged into economic and social … [+9657 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "James Morris", "title": "COVID vaccine data 'so good' that it points to lockdown ending earlier, Sage adviser says - Yahoo New Zealand News", "description": "'Right now you should be looking at earlier unlocking because the data is so good,' Prof Mark Woolhouse said.", "url": "https://nz.news.yahoo.com/covid-vaccine-data-lockdown-ending-113022599.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2D7QHsPuPoJPWDwSP7ZAmA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-uploaded-images/2021-02/583d9e90-7114-11eb-beeb-1950350cef9f", "publishedAt": "2021-02-17T11:35:13Z", "content": "Watch: Vaccine data 'so good' it points to lockdown ending earlier\r\n<ul><li>COVID vaccine data 'so good' that it points to 'earlier unlocking', Sage adviser tells MPs\r\n</li><li>UK is third in the wor… [+4436 chars]"}, {"source": {"id": null, "name": "Hull Daily Mail"}, "author": "Neil Shaw", "title": "People will never go into work with a cough or cold again, says expert - Hull Live", "description": "Even after Covid it will become 'socially unacceptable' to go to work with an illness", "url": "https://www.hulldailymail.co.uk/news/uk-world-news/people-never-go-work-cough-5012609", "urlToImage": "https://i2-prod.hulldailymail.co.uk/incoming/article5012602.ece/ALTERNATES/s1200/0_disease-4392162_1920.jpg", "publishedAt": "2021-02-17T11:02:00Z", "content": "People will never go to work with a cough again - even after Covid restrictions end, according to an expert.\r\nThe chief scientific adviser says it could become 'socially unacceptable' for anyone to g… [+1590 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Martin Bagot", "title": "SAGE experts say trips to the beach could be allowed soon but not foreign holidays - Mirror Online", "description": "Epidemiologists have told Parliament opening beaches could be one of the safest activities to green light as lockdown restrictions begin to be lifted", "url": "https://www.mirror.co.uk/news/uk-news/breaking-sage-experts-say-trips-23515497", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23513965.ece/ALTERNATES/s1200/0_Coronavirus-in-Britain-Bournemouth-United-Kingdom-10-Aug-2020.jpg", "publishedAt": "2021-02-17T10:56:00Z", "content": "Trips to the beach are one of the safest things to quickly restart as lockdown measures are lifted, MPs have been told.\r\nExperts whose research feeds in to SAGE have laid out how restrictions could b… [+2738 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Joe Middleton", "title": "Coronavirus: Every UK adult could have both jabs by August, head of vaccine taskforce says - The Independent", "description": "Clive Dix said new Covid vaccines will be approved ‘in the very near future’", "url": "https://www.independent.co.uk/news/uk/home-news/corona-virus-both-vaccines-by-september-uk-b1803143.html", "urlToImage": "https://static.independent.co.uk/2021/02/16/19/HEALTH%20Coronavirus%20Bus%2015161292.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-02-17T09:58:00Z", "content": "Every adult in the United Kingdom could receive both doses of a Covid-19 jab as early as August, the head of the UKs vaccine taskforce has said.\r\nClive Dix, who runs the unit tasked with developing a… [+1685 chars]"}, {"source": {"id": null, "name": "Daily Telegraph"}, "author": "James O’Doherty and Mitchell Van Homrigh", "title": "Warning for anti-vaxxers ahead of vaccine rollout - Byron Shire News", "description": "Gladys Berejiklian and Brad Hazzard have issued a strong warning to anti-vaxxers after announcing NSW’s vaccine rollout will begin on Monday.", "url": "https://www.dailytelegraph.com.au/coronavirus/covid-nsw-premier-reveals-vaccine-rollout-plan/news-story/cb61713788b4ad9d25682fcb6be43e94", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/17/v3imagesbinb45b463b1a25c3e55784e9970770f5ce-f1y9uyoxdwpu31tuvv2_ct1880x930.jpg", "publishedAt": "2021-02-17T04:43:00Z", "content": "Anti-vaxxers who don't want to get a COVID jab \"must be completely crackers,\" Health Minister Brad Hazzard says.\r\nMore than 35,000 critical hotel quarantine and healthcare workers will get their firs… [+2431 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Royce Kurmelovs", "title": "Queensland says new Covid variant was detected in Brisbane quarantine - The Guardian", "description": "Queensland health department says variant B1525 was identified in returned travellers in January", "url": "https://amp.theguardian.com/australia-news/2021/feb/17/authorities-fail-to-explain-worrying-new-covid-variant-detected-in-australia", "urlToImage": "https://i.guim.co.uk/img/media/bf8e3883ad38d2af79541ca6423172c13ed80ca1/0_0_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=39e24c043e02ba30a72d1b8dc33bd486", "publishedAt": "2021-02-17T04:37:00Z", "content": "The Queensland government has revealed that a new coronavirus strain with a worrying set of mutations was detected among two returned travellers who were staying in hotel quarantine in Brisbane in Ja… [+3824 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jackson Ryan", "title": "New coronavirus variants are emerging across the globe: Everything we know - CNET", "description": "Scientists are just beginning to understand how mutations to the coronavirus may affect spread, immunity and vaccines.", "url": "https://www.cnet.com/how-to/new-coronavirus-variants-are-emerging-across-the-globe-everything-we-know/", "urlToImage": "https://cnet4.cbsistatic.com/img/We2ChPrFQuc_N6aJ5YnsgMQe4WE=/1200x630/2021/01/29/397ed6ab-d19a-4723-ad2c-8bcdbfd389fa/ronav1.jpg", "publishedAt": "2021-02-17T03:00:00Z", "content": "The coronavirus SARS-CoV-2 has constantly evolved since it was first detected in humans over a year ago. Viruses replicate exceedingly fast, and each time they do, there's a small chance they mutate.… [+16028 chars]"}, {"source": {"id": null, "name": "Cessnock Advertiser"}, "author": "Angelo Risso", "title": "NSW COVID vaccinations to begin on Monday | The Advertiser - Cessnock Advertiser", "description": "COVID-19 frontline workers in NSW will start being vaccinated against the virus on Monday. Premier Gladys Berejiklian says the Pfizer vaccine will be administ...", "url": "https://www.cessnockadvertiser.com.au/story/7130668/nsw-covid-vaccinations-to-begin-on-monday/", "urlToImage": "https://www.cessnockadvertiser.com.au/images/transform/v1/crop/frm/silverstone-feed-data/aad159a9-1351-48c6-9f81-e2d6b97633e4.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-17T01:14:00Z", "content": "COVID-19 frontline workers in NSW will start being vaccinated against the virus on Monday.\r\nPremier Gladys Berejiklian says the Pfizer vaccine will be administered to frontline workers from Monday, w… [+1575 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "Richard Baker, Paul Sakkal", "title": "WorkSafe faulted Victorian government departments over airport quarantine before outbreak - Sydney Morning Herald", "description": "About a week before the Holiday Inn cluster emerged, WorkSafe Victoria issued improvement notices to the Health Department and COVID-19 Quarantine Victoria in relation to their virus protocols at Melbourne Airport.", "url": "https://www.theage.com.au/national/victoria/worksafe-faulted-victorian-government-departments-over-airport-quarantine-20210217-p57377.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.246%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_25/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/69097ef7247068856f799fc0608308d57893ba63", "publishedAt": "2021-02-17T00:55:00Z", "content": "Mr Andrews announced on Wednesday morning that the lockdown would end at 11.59pm on Wednesday, after Victoria had recorded no new coronavirus cases overnight.\r\nThe improvement notices were issued to … [+3782 chars]"}, {"source": {"id": null, "name": "Riverineherald.com.au"}, "author": null, "title": "COVID 'success' definition must shift: NSW - Riverine Herald", "description": "", "url": "https://www.riverineherald.com.au/national/2021/02/17/3160987/nsw-virus-vaccinations-to-begin-on-monday", "urlToImage": "https://res.cloudinary.com/cognitives/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_675,q_auto,w_1200/bcn9gyitimprvfcpbxrw", "publishedAt": "2021-02-17T00:41:12Z", "content": "COVID-19 frontline workers in NSW will start being vaccinated from Monday, with Premier Gladys Berejiklian arguing the definition of \"success\" in tackling the virus must change as the rollout progres… [+2818 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jessica Rendall", "title": "Coronavirus vaccine rollout from Monday in Queensland, Premier Palaszczuk reveals - ABC News", "description": "Queensland Premier Annastacia Palaszczuk says 100 people on the Gold Coast will get the state's first coronavirus jabs on Monday, asking people not to panic amid what is being described as a \"very slow\" rollout.", "url": "https://www.abc.net.au/news/2021-02-17/coronavirus-queensland-pfizer-vaccine-rollout-gold-coast-monday/13100234", "urlToImage": "https://www.abc.net.au/cm/rimage/12870288-16x9-large.jpg?v=2", "publishedAt": "2021-02-17T00:39:00Z", "content": "Queenslanders are on track to get the coronavirus vaccine for the first time from Monday, however Premier Annastacia Palaszczuk says the rollout will be \"very slow\".\r\nMs Palaszczuk said the Pfizer va… [+3797 chars]"}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": "Marty Silk and Nick Gibbs", "title": "Qld's first 100 virus jabs set for Monday | Guardian News | Nambucca Heads, NSW - Nambucca Guardian News", "description": "Queensland plans to start vaccinating 100 frontline healthcare workers on the Gold Coast against coronavirus on Monday as it takes delivery of the jabs. The s...", "url": "https://www.nambuccaguardian.com.au/story/7130710/qlds-first-100-virus-jabs-set-for-monday/", "urlToImage": "https://www.nambuccaguardian.com.au/images/transform/v1/crop/frm/silverstone-feed-data/aa1ab734-7865-4a27-903d-4130b45ec29d.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-17T00:34:15Z", "content": "Queensland plans to start vaccinating 100 frontline healthcare workers on the Gold Coast against coronavirus on Monday as it takes delivery of the jabs.\r\nThe state government says workers at the Gold… [+3017 chars]"}, {"source": {"id": null, "name": "Lakesmail.com.au"}, "author": "Angelo Risso", "title": "NSW virus vaccinations to begin on Monday - Lakes Mail", "description": "COVID-19 frontline workers in NSW will start being vaccinated against the virus on Monday. Premier Gladys Berejiklian says the Pfizer vaccine will be administ...", "url": "https://www.lakesmail.com.au/story/7130668/nsw-covid-vaccinations-to-begin-on-monday/", "urlToImage": "https://www.lakesmail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/aad159a9-1351-48c6-9f81-e2d6b97633e4.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-17T00:24:44Z", "content": "COVID-19 frontline workers in NSW will start being vaccinated against the virus on Monday.\r\nPremier Gladys Berejiklian says the Pfizer vaccine will be administered to frontline workers from Monday, w… [+1575 chars]"}]}