{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Alarmingly high' vitamin D deficiency in the United Kingdom - Science Daily", "description": "Over 50 per cent of Asians living in the UK are severely deficient in vitamin D, leaving them more vulnerable to respiratory infections such as COVID-19 and musculoskeletal disorders, according to a large-scale population study published this week.", "url": "https://www.sciencedaily.com/releases/2020/12/201215091635.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2020-12-15T21:49:26Z", "content": "Over 50 per cent of Asians living in the UK are severely deficient in vitamin D, leaving them more vulnerable to respiratory infections such as COVID-19 and musculoskeletal disorders, according to a … [+4407 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists show what loneliness looks like in the brain: Neural 'signature' may reflect how we respond to feelings of social isolation - Science Daily", "description": "A new study shows a sort of signature in the brains of lonely people that make them distinct in fundamental ways, based on variations in the volume of different brain regions as well as based on how those regions communicate with one another across brain netw…", "url": "https://www.sciencedaily.com/releases/2020/12/201215082059.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2020-12-15T21:49:26Z", "content": "This holiday season will be a lonely one for many people as social distancing due to COVID-19 continues, and it is important to understand how isolation affects our health. A new study shows a sort o… [+3093 chars]"}, {"source": {"id": null, "name": "3AW"}, "author": null, "title": "How a COVID-19 vaccine is expected to be rolled out in Australia - 3AW", "description": "Australians aged over 70, along with health workers, look set to be the first people in Australia to get a COVID-19 jab. The Herald Sun reports the population will be divided into 12 age brackets, …", "url": "https://www.3aw.com.au/how-a-covid-19-vaccine-is-expected-to-be-rolled-out-in-australia/", "urlToImage": "https://www.3aw.com.au/wp-content/uploads/sites/12/2020/09/CoronaVaccineISTOCK.jpg?fit=600%2C400", "publishedAt": "2020-12-15T21:40:49Z", "content": "Australians aged over 70, along with health workers, look set to be the first people in Australia to get a COVID-19 jab.\r\nThe Herald Sun reports the population will be divided into 12 age brackets, w… [+886 chars]"}, {"source": {"id": null, "name": "3AW"}, "author": null, "title": "How what you eat affects your sleep - 3AW", "description": "Reducing screen time before bed and getting regular exercise are touted as strategies for getting a better sleep, but there’s another important factor that many overlook — diet. Associate pro…", "url": "https://www.3aw.com.au/how-what-you-eat-affects-your-sleep/", "urlToImage": "https://www.3aw.com.au/wp-content/uploads/sites/12/2020/04/iStock-970067208.jpg?fit=3864%2C2576", "publishedAt": "2020-12-15T20:05:25Z", "content": "Reducing screen time before bed and getting regular exercise are touted as strategies for getting a better sleep, but there’s another important factor that many overlook diet.\r\nAssociate professor of… [+1011 chars]"}, {"source": {"id": null, "name": "Daily Telegraph"}, "author": null, "title": "Workplaces where COVID-19 vaccine could be mandatory - Gatton Star", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-12-15T19:20:00Z", "content": null}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Alex Chapman", "title": "COVID vaccine rollout plan in Australia revealed as new details on priority of inoculation emerge - 7NEWS.com.au", "description": "Australians will be divided by age brackets - with one group not expected to receive the jab until 2022.", "url": "https://7news.com.au/lifestyle/health-wellbeing/australias-covid-vaccine-rollout-blueprint-revealed-includes-separation-of-age-brackets-c-1777747", "urlToImage": "https://images.7news.com.au/publication/C-1777747/06fd4bf487e547dee9fc6b3eeb84decce55c3374-16x9-x0y0w2000h1125.png?imwidth=1024", "publishedAt": "2020-12-15T19:09:06Z", "content": "Australians will be divided by health risks and age brackets in a first look at the coronavirus vaccine rollout plan.\r\nThe blueprint places top priority in those most at risk of developing complicati… [+988 chars]"}, {"source": {"id": null, "name": "Kcchronicle.com"}, "author": "Marni Pyke", "title": "First health care workers in Illinois get COVID-19 vaccines - Kane County Chronicle", "description": "Applause erupted as doctors and nurses received COVID-19 shots in Chicago and Peoria Tuesday, a positive step after months of a seemingly uncontainable pandemic that has caused over 14,500 deaths in Illinois alone.", "url": "https://www.kcchronicle.com/2020/12/15/first-health-care-workers-in-illinois-get-covid-19-vaccines/a8txt6n/", "urlToImage": "https://www.kcchronicle.com/_internal/cimg!0/9usglsdzhoogh4txn97ussysayfpakj", "publishedAt": "2020-12-15T18:43:24Z", "content": "As a public service, Shaw Media will provide open access to information related to the COVID-19 (Coronavirus) emergency. Sign up for the newsletter hereApplause erupted as doctors and nurses received… [+2163 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Houston ICU Nurse Receives Covid-19 Shot as Vaccines Arrive in Texas - Bloomberg Quicktake: Now", "description": "An ICU nurse received the first shot administered in the Houston area at Memorial Hermann in Tuesday. The first doses of Pfizer's COVID-19 vaccine have arriv...", "url": "https://www.youtube.com/watch?v=GKO7ldjhsac", "urlToImage": "https://i.ytimg.com/vi/GKO7ldjhsac/maxresdefault.jpg", "publishedAt": "2020-12-15T18:21:18Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "MercyOne receives first batch of COVID-19 vaccine - KCCI", "description": "MercyOne receives first batch of COVID-19 vaccineSubscribe to KCCI on YouTube now for more: http://bit.ly/QY3wuMGet more Des Moines news: http://www.kcci.com...", "url": "https://www.youtube.com/watch?v=7Ram1gVg7k0", "urlToImage": "https://i.ytimg.com/vi/7Ram1gVg7k0/maxresdefault.jpg", "publishedAt": "2020-12-15T18:20:40Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Phoebe Weston", "title": "Scientists find two new species of fungi that turn flies into 'zombies' - The Guardian", "description": "Insect-destroying fungi ‘may represent the next frontier for drug discovery’", "url": "https://amp.theguardian.com/environment/2020/dec/15/scientists-find-two-new-species-of-fungi-that-turn-flies-into-zombies", "urlToImage": null, "publishedAt": "2020-12-15T18:20:00Z", "content": "The age of extinctionInsect-destroying fungi may represent the next frontier for drug discovery\r\nTwo new fungi species that infect flies and eject spores out of a large hole in the insects abdomen li… [+3989 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Minimally-Invasive Imaging and Laser Surgery Solve Elusive Epilepsy - Newswise", "description": "When doctors couldn't pinpoint the location of Giorgia's seizures, they doubled down, using innovative tools to target and treat her epilepsy.", "url": "https://www.newswise.com/articles/minimally-invasive-imaging-and-laser-surgery-solve-elusive-epilepsy", "urlToImage": "https://www.newswise.com/legacy/image.php?image=&width=100&height=100", "publishedAt": "2020-12-15T17:55:00Z", "content": "Newswise — When 11-year-old, Giorgia Graham, told her parents her cheek was going sporadically numb, they thought it was because she banged her face playing tag.\r\nBut when the numbness kept coming ba… [+10036 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Chemicals in Plastics Are a Global Health Threat, Says New Report - Gizmodo Australia", "description": "A new scientific report out Tuesday concludes that plastics and the chemicals they leave behind in the environment are a major threat to human health. It identifies over 140 chemicals readily found in plastic products that can harm our bodies, particularly th…", "url": "https://www.gizmodo.com.au/2020/12/chemicals-in-plastics-are-a-global-health-threat-says-new-report/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2020/12/16/idktf8oyuxbbqkcwkmn8-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2020-12-15T17:50:00Z", "content": "A new scientific report out Tuesday concludes that plastics and the chemicals they leave behind in the environment are a major threat to human health. It identifies over 140 chemicals readily found i… [+5669 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New tool aids in the discovery of RNA medicines for undruggable diseases - News-Medical.Net", "description": "Imagine trying to throw a bullseye when the dartboard lies buried within a crumpled box. That's the challenge faced by scientists working to make new medicines for some \"undruggable\" diseases, including a type of metastatic breast cancer.", "url": "https://www.news-medical.net/news/20201215/New-tool-aids-in-the-discovery-of-RNA-medicines-for-undruggable-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2020-12-15T17:44:00Z", "content": "Imagine trying to throw a bullseye when the dartboard lies buried within a crumpled box. That's the challenge faced by scientists working to make new medicines for some \"undruggable\" diseases, includ… [+4928 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "RNA basic building block produced biocatalytically for the first time - Science Daily", "description": "Researchers succeed in the first enzyme-driven biocatalytic synthesis of nucleic acid building blocks. This facilitates the development of antiviral agents and RNA-based therapeutics.", "url": "https://www.sciencedaily.com/releases/2020/12/201215121157.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2020-12-15T17:31:53Z", "content": "Due to the COVID 19 pandemic and the associated intensive search for therapeutics and vaccines, the chemical substance class of nucleosides is experiencing an enormous increase in interest. Natural a… [+3644 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Lia Tabackman, Jason McKnight", "title": "Yes, marijuana can be addictive — how to recognize the signs of cannabis use disorder - Insider - INSIDER", "description": "Researchers estimate that 30% of marijuana users will develop an addiction called cannabis use disorder. Here's how to recognize the signs.", "url": "https://www.insider.com/is-marijuana-addictive", "urlToImage": "https://i.insider.com/5fd8df6fdc030c001aab6af0?width=1200&format=jpeg", "publishedAt": "2020-12-15T17:24:23Z", "content": "Of the millions of Americans who consume marijuana for recreational or therapeutic use, most will not develop a dependence or addiction. \r\nHowever, research suggests that up to 30% of those who use m… [+6673 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 vaccines arrive at Thomas Hospital - WKRG", "description": "COVID-19 vaccines arrive at Thomas Hospital", "url": "https://www.youtube.com/watch?v=HDfNd0EA1cI", "urlToImage": "https://i.ytimg.com/vi/HDfNd0EA1cI/maxresdefault.jpg", "publishedAt": "2020-12-15T17:08:53Z", "content": null}, {"source": {"id": null, "name": "Theislanderonline.com.au"}, "author": null, "title": "'Normal' Christmas for COVID-free Aussies - The Islander", "description": "A report on Victoria's hotel quarantine failings is set to provide valuable lessons as Australia heads into Christmas with few COVID-19 concerns. The inquiry...", "url": "https://www.theislanderonline.com.au/story/7057309/normal-christmas-for-covid-free-aussies/?cs=9676", "urlToImage": "https://www.theislanderonline.com.au/images/transform/v1/crop/frm/silverstone-feed-data/dbe96e51-1b05-4156-8ef1-d4c4c9dc9841.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-12-15T16:30:36Z", "content": "A report on Victoria's hotel quarantine failings is set to provide valuable lessons as Australia heads into Christmas with few COVID-19 concerns.\r\nThe inquiry chaired by Jennifer Coate will deliver i… [+2007 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "VIDEO NOW: Care New England receives first shipment of Pfizer's COVID-19 vaccine - WPRI", "description": "Care New England received its first shipment of Pfizer’s COVID-19 vaccine on Tuesday, December 15.", "url": "https://www.youtube.com/watch?v=TUNG7cc7D28", "urlToImage": "https://i.ytimg.com/vi/TUNG7cc7D28/maxresdefault.jpg", "publishedAt": "2020-12-15T16:19:28Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Gabrielle Stewart", "title": "Researchers engineer cells to better target cancer - Medical Xpress", "description": "In cell-based immunotherapy, a treatment being explored for cancer, the body's immune cells are modified to eliminate cancer cells more effectively. Immune cells can kill cancer cells on their own but have some difficulty recognizing the substance produced by…", "url": "https://medicalxpress.com/news/2020-12-cells-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/20-researcherse.jpg", "publishedAt": "2020-12-15T15:25:07Z", "content": "In cell-based immunotherapy, a treatment being explored for cancer, the body's immune cells are modified to eliminate cancer cells more effectively. Immune cells can kill cancer cells on their own bu… [+2674 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New York nurse describes receiving COVID-19 vaccine l GMA - Good Morning America", "description": "Sandra Lindsay tells \"GMA\" how she feels the day after receiving the vaccine and why she volunteered to be among the first people in the U.S. to receive a do...", "url": "https://www.youtube.com/watch?v=hqHst_f4lm4", "urlToImage": "https://i.ytimg.com/vi/hqHst_f4lm4/maxresdefault.jpg", "publishedAt": "2020-12-15T14:39:48Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Winter storm threatens vaccine and holiday shipping l GMA - ABC News", "description": "The major storm is expected to hit the Northeast as carriers try to move those first doses of the COVID-19 vaccine while keeping up with higher-than-usual ho...", "url": "https://www.youtube.com/watch?v=bmHb6jcBktw", "urlToImage": "https://i.ytimg.com/vi/bmHb6jcBktw/maxresdefault.jpg", "publishedAt": "2020-12-15T14:39:36Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ad campaign to convince Americans to take COVID vaccine - KTNV Channel 13 Las Vegas", "description": "As some groups use social media to sway people to get a vaccine, others are working on a more detailed campaign to convince all Americans. A campaign ad agen...", "url": "https://www.youtube.com/watch?v=U0bJnW_ZdPo", "urlToImage": "https://i.ytimg.com/vi/U0bJnW_ZdPo/hqdefault.jpg", "publishedAt": "2020-12-15T14:39:29Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "A New Strain Of Covid 19, Should We Be Scared? | This Morning - This Morning", "description": "Yesterday, the Health Secretary announced that a \"new variant\" of coronavirus had been identified in the UK and is believed to be fuelling the sharp rise in ...", "url": "https://www.youtube.com/watch?v=deZTV5vePAk", "urlToImage": "https://i.ytimg.com/vi/deZTV5vePAk/maxresdefault.jpg", "publishedAt": "2020-12-15T14:21:33Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study offers new clues to the pathogenesis of glaucoma - News-Medical.Net", "description": "In the search for new ways to treat the incurable eye disease glaucoma, researchers at Karolinska Institutet and St. Erik Eye Hospital in Sweden have discovered more clues as to its pathogenesis.", "url": "https://www.news-medical.net/news/20201215/Study-offers-new-clues-to-the-pathogenesis-of-glaucoma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2020-12-15T13:23:00Z", "content": "In the search for new ways to treat the incurable eye disease glaucoma, researchers at Karolinska Institutet and St. Erik Eye Hospital in Sweden have discovered more clues as to its pathogenesis. A n… [+3144 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop new method to predict COVID-19 worldwide - News-Medical.Net", "description": "Methods currently used around the world for predicting the development of COVID-19 and other pandemics fail to report precisely on the best and worst-case scenarios. Newly developed prediction method for epidemics, published in Nature Physics, solve this prob…", "url": "https://www.news-medical.net/news/20201215/Researchers-develop-new-method-to-predict-COVID-19-worldwide.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2020-12-15T12:53:00Z", "content": "Methods currently used around the world for predicting the development of COVID-19 and other pandemics fail to report precisely on the best and worst-case scenarios. Newly developed prediction method… [+4113 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Poverty Linked to Higher Risk of COVID-19 Death, Suggests Study - LatestLY", "description": "Researchers from the Universities of Edinburgh and Glasgow gauged how living in an area of socioeconomic poverty - measured by the Scottish Index of Multiple Deprivation - was linked to severe Covid-19 using anonymous health records.", "url": "https://www.latestly.com/lifestyle/health-wellness/poverty-linked-to-higher-risk-of-covid-19-death-suggests-study-2199819.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2019/04/poverty.jpg", "publishedAt": "2020-12-15T12:04:13Z", "content": "Washington, December 15: People in Scotland's poorest areas are more likely to be affected by severe Covid-19 - and to die from the disease - than those in more affluent districts, according to a stu… [+2768 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "WHO sees \"strong commitment\" from Pfizer on affordable COVID vaccine - Reuters", "description": "A World Health Organization senior official said on Tuesday that the agency was in talks with Pfizer to include its COVID-19 vaccine as part of an early global roll out.", "url": "https://www.reuters.com/article/health-coronavirus-who-pfizer-idUSKBN28P1AT", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201215&t=2&i=1544617194&r=LYNXMPEGBE0QH&w=800", "publishedAt": "2020-12-15T11:21:55Z", "content": "By Reuters Staff\r\nFILE PHOTO: Bruce Aylward, International team lead for the WHO-China joint mission on COVID-19 coronavirus attends a news conference after his trip to China at the World Health Orga… [+570 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Nanoparticles as weapons against cancer - Mirage News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL25hbm9wYXJ0aWNsZXMtYXMtd2VhcG9ucy1hZ2FpbnN0LWNhbmNlci_SAQA?oc=5", "urlToImage": null, "publishedAt": "2020-12-15T11:14:13Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "SIMON – The Machine Learning Platform Paving the Future of Vaccine Development - News-Medical.Net", "description": "A machine learning algorithm developed by the Oxford Vaccine Group promises more effective vaccine development for several diseases, including COVID-19.", "url": "https://www.news-medical.net/news/20201215/SIMON-e28093-The-Machine-Learning-Platform-Paving-the-Future-of-Vaccine-Development.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2020/12/shutterstock_1742514611.jpg", "publishedAt": "2020-12-15T11:07:00Z", "content": "This article was written in correspondence with Adriana Tomic, Ph.D.,  of the Oxford Vaccine Group.\r\nThe Oxford Vaccine Group is in high demand at the moment as they make huge progress in their goal … [+6755 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Mike Butcher", "title": "Iceland's Controlant, with $50M backing, emerges as key player in Cold Chain for COVID-19 vaccine - Yahoo News Australia", "description": "A startup hailing from far-flung Iceland is emerging as one of the key players in the race to distribute one of the key coronavirus vaccines around the world...", "url": "https://au.news.yahoo.com/icelands-controlant-50m-backing-emerges-110007313.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/VtuN8TCkthIEGKFA7wybIg--~B/aD02NTc7dz0xMTA4O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/001cef272273aec7b64f99628c079943", "publishedAt": "2020-12-15T11:00:00Z", "content": "A startup hailing from far-flung Iceland is emerging as one of the key players in the race to distribute one of the key coronavirus vaccines around the world. Controlant which has a unique real-time … [+2399 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "New coronavirus strain spreading in UK has key mutations, scientists say - Yahoo Eurosport UK", "description": null, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_cd5dc775-c0ee-42de-adfa-2f96f9f12d48", "urlToImage": null, "publishedAt": "2020-12-15T10:38:00Z", "content": "Yahoo is part of Verizon Media. We and our partners will store and/or access information on your device through the use of cookies and similar technologies, to display personalised ads and content, f… [+646 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "The great project: how Covid changed science for ever - The Guardian", "description": "The emergence of a novel coronavirus prompted a wave of global collaboration that has led to vaccines, treatments and the promise of new discoveries", "url": "https://www.theguardian.com/world/2020/dec/15/the-great-project-how-covid-changed-science-for-ever", "urlToImage": "https://i.guim.co.uk/img/media/3a10431111f41d59607670d68c1a24f1a658175d/0_156_4737_2842/master/4737.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c5fa38c494d71c1ae4aab49d77c1cec1", "publishedAt": "2020-12-15T10:00:00Z", "content": "For scientists, 5 January was a turning point in the fight against the coronavirus. That day, a team led by Prof Yong-Zhen Zhang at Fudan University in Shanghai sequenced the genetic code of the viru… [+28667 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mologic and the University of Liverpool collaborate to develop a rapid diagnostic test for common agricultural parasite - News-Medical.net", "description": "Mologic today announced it is in the final developmental stages of a pen-diagnostic test with the University of Liverpool.", "url": "https://www.news-medical.net/news/20201215/Mologic-and-the-University-of-Liverpool-collaborate-to-develop-a-rapid-diagnostic-test-for-common-agricultural-parasite.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/6/Chem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2020-12-15T09:45:00Z", "content": "Mologic Ltd, a leading developer of lateral flow and rapid diagnostic technologies, today announced it is in the final developmental stages of a pen-diagnostic test with the University of Liverpool, … [+3887 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Petra Wiesmayer", "title": "Genes are a potential key to new COVID-19 treatments - Innovation Origins", "description": "British researchers have identified in a study five genes associated with the most severe form of COVID-19.", "url": "https://innovationorigins.com/genes-as-a-key-to-new-covid-19-treatments/", "urlToImage": "https://innovationorigins.com/app/uploads/2020/12/laboratory-2815640_1920.jpg", "publishedAt": "2020-12-15T08:00:00Z", "content": "Although older people are more likely to suffer a severe or even fatal case of COVID-19 than younger people, they too can become infected with the SARS CoV-2 coronavirus and end up fighting for their… [+4351 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Steve Scown", "title": "People with learning disabilities should be prioritised for a Covid vaccine - The Guardian", "description": "Figures show that learning disabled people have far higher coronavirus death rates and experience more isolation than the general population", "url": "https://amp.theguardian.com/society/2020/dec/15/people-with-learning-disabilities-should-be-prioritised-for-a-covid-vaccine", "urlToImage": null, "publishedAt": "2020-12-15T07:30:00Z", "content": "As well as far higher coronavirus death rates, learning-disabled people experience more isolation than the general population\r\nTue 15 Dec 2020 02.30 EST\r\nWhen Margaret Keenan became the first person … [+5022 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New COVID-19 variant found in the UK but experts say vaccines should still be effective | ABC News - ABC News (Australia)", "description": "A new variant of coronavirus identified in the UK is being blamed for a sharp rise in cases across London and south-eastern England. Subscribe: http://ab.co/...", "url": "https://www.youtube.com/watch?v=Jc2Gtpyh0S8", "urlToImage": "https://i.ytimg.com/vi/Jc2Gtpyh0S8/maxresdefault.jpg", "publishedAt": "2020-12-15T06:44:44Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study provides valuable interaction about animal host and pathogen during pneumococcal infections - News-Medical.Net", "description": "Researchers at the University of Maryland School of Medicine published one of the most comprehensive analyses of how genes get expressed during infection (known as a transcriptome). The analyses include three different strains of the bacteria Streptococcus pn…", "url": "https://www.news-medical.net/news/20201215/Study-provides-valuable-interaction-about-animal-host-and-pathogen-during-pneumococcal-infections.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gene-620x480.jpg", "publishedAt": "2020-12-15T06:41:00Z", "content": "Researchers at the University of Maryland School of Medicine published one of the most comprehensive analyses of how genes get expressed during infection (known as a transcriptome). The analyses incl… [+3639 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New AI tool may soon offer the right treatment for stroke survivors - News-Medical.Net", "description": "An AI developed by Japanese researchers might soon help stroke survivors get the right treatment by detecting a patient's post-stroke depression (PSD) type, a frequently seen but often overlooked neuropsychiatric manifestation after a stroke that could impair…", "url": "https://www.news-medical.net/news/20201215/New-AI-tool-may-soon-offer-the-right-treatment-for-stroke-survivors.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/depression-620x480.jpg", "publishedAt": "2020-12-15T06:34:00Z", "content": "An AI developed by Japanese researchers might soon help stroke survivors get the right treatment by detecting a patient's post-stroke depression (PSD) type, a frequently seen but often overlooked neu… [+3616 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "No indication new Covid-19 variant in UK interferes with vaccine effectiveness: WHO - WION", "description": "After the reports of a new variant of COVID-19, World Health Organisation has said that there is no evidence to suggest that the mutation will impact the effectiveness of vaccines against the disease.Also read: New variant of coronavirus identified in UK; Lon…", "url": "https://www.wionews.com/world/no-indication-new-covid-19-variant-in-uk-interferes-with-vaccine-effectiveness-who-349870", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/06/10/144113-untitled-design.jpg, as the spread of the coronavirus disease (COVID-19) continues, in London, Britain, April 25, 2020.\" typeof=\"foaf:Image\" />", "publishedAt": "2020-12-15T06:14:06Z", "content": "After the reports of a new variant of COVID-19, World Health Organisation has said that there is no evidence to suggest that the mutation will impact the effectiveness of vaccines against the disease… [+2092 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Emily Olle", "title": "SA COVID outbreak: Hotel quarantine report finds ventilation contributed to security guard infection - 7NEWS.com.au", "description": "Concerns were raised over crowded facilities, which at one stage housed more than a quarter of the nation's active quarantine cases.", "url": "https://7news.com.au/lifestyle/health-wellbeing/sa-covid-outbreak-hotel-quarantine-report-finds-ventilation-contributed-to-security-guard-infection-c-1773830", "urlToImage": "https://images.7news.com.au/publication/C-1773830/2ebfcb8afae6dbf89277002bad7d5cdcd6486013-16x9-x0y0w1024h576.jpg?imwidth=1024", "publishedAt": "2020-12-15T04:59:44Z", "content": "South Australias health chief has revealed that ventilation issues, stagnant security guards and surface contact transmission were the likely source of the COVID-19 cluster which shut down the state.… [+3038 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "World Health Organization issues notice for in vitro diagnostics users - News-Medical.Net", "description": "Nucleic acid testing (NAT) technologies that use real-time polymerase chain reaction (RT-PCR) for detection of SARS-CoV-2.", "url": "https://www.news-medical.net/news/20201214/World-Health-Organization-issues-notice-for-in-vitro-diagnostics-users.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/HEALTHCARE_shutterstock_493063267_99928a5e003043f896998f01b025b9f6-620x480.jpg", "publishedAt": "2020-12-15T04:44:00Z", "content": "Product type: Nucleic acid testing (NAT) technologies that use real-time polymerase chain reaction (RT-PCR) for detection of SARS-CoV-2\r\nDate: 7 December 2020\r\nWHO-identifier: 2020/5, version 1\r\nPurp… [+3301 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 vaccines in Texas: By the numbers | KVUE - KVUE", "description": "KVUE took a closer look at the COVID-19 vaccines by the numbers, including how many are expected to be delivered in Texas this week.STORY: https://www.kvue.c...", "url": "https://www.youtube.com/watch?v=8VrR6zX5YUw", "urlToImage": "https://i.ytimg.com/vi/8VrR6zX5YUw/maxresdefault.jpg", "publishedAt": "2020-12-15T04:17:03Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Indian govt releases detailed guidelines for mass vaccination drive against COVID-19 | Coronavirus - WION", "description": "Indian govt has released detailed guidelines for India's mass vaccination drive against COVID-19 infection. Vaccination is scheduled to begin as soon as the ...", "url": "https://www.youtube.com/watch?v=iOEzyt9WOsc", "urlToImage": "https://i.ytimg.com/vi/iOEzyt9WOsc/maxresdefault.jpg", "publishedAt": "2020-12-15T04:11:19Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Ian Frazer, Ingrid Scheffer, Tania Sorrell", "title": "Vaccines alone won't keep Australia safe in 2021. Here's what else we need to do - The Conversation AU", "description": "A new review from the Australian Academy of Health and Medical Sciences says managing the pandemic into 2021 will mean persisting with the measures that have made Australia's response successful so far.", "url": "https://theconversation.com/vaccines-alone-wont-keep-australia-safe-in-2021-heres-what-else-we-need-to-do-152078", "urlToImage": "https://images.theconversation.com/files/374968/original/file-20201214-20-44w6ci.jpg?ixlib=rb-1.1.0&rect=30%2C15%2C3431%2C1715&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-12-15T03:23:00Z", "content": "By any global measure, Australias response to the COVID pandemic has been a spectacular success. Public health measures introduced by state, territory and federal governments, with the help of the Au… [+4954 chars]"}, {"source": {"id": null, "name": "WAtoday"}, "author": "Daile Cross", "title": "Parents demand urgent action to fix WA's youth mental health system - WAtoday", "description": "WA's Chief Psychiatrist says if early life treatment and support are not provided, a generation will be condemned to worsening mental health throughout their lives.", "url": "https://www.watoday.com.au/national/western-australia/parents-demand-action-urgent-action-required-to-fix-wa-s-youth-mental-health-system-20201215-p56nlc.html", "urlToImage": "https://static.ffx.io/images/$zoom_1.0718518518518518%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_177%2C$y_60/t_crop_custom/q_86%2Cf_auto/t_watoday_no_label_no_age_social_wm/9f246bdc6c1ca8c1a9a9ff8355cf5ba80c21957a", "publishedAt": "2020-12-15T02:10:00Z", "content": "\"Wait times for initial assessment and between initial assessment and commencement oftreatment was of concern to families.\"\r\nChildren were being refused access because their mental health problems we… [+5583 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Upstate professor talks about COVID-19 vaccine clinical trial - WYFF News 4", "description": "An Upstate professor talks to WYFF News 4 about taking part in a COVID-19 vaccine trial.Subscribe to WYFF on YouTube now for more: http://bit.ly/1mUvbJXGet m...", "url": "https://www.youtube.com/watch?v=BOUBAmOToZ8", "urlToImage": "https://i.ytimg.com/vi/BOUBAmOToZ8/maxresdefault.jpg", "publishedAt": "2020-12-15T01:51:26Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Now That The COVID-19 Vaccine Is In California, Who Will Pay To Store And Distribute It? - CBS Los Angeles", "description": "With the covid vaccine now in California, it begs the question, \"Who is footing the bill to store it and distribute it?\"", "url": "https://www.youtube.com/watch?v=OcT1tQheg9s", "urlToImage": "https://i.ytimg.com/vi/OcT1tQheg9s/maxresdefault.jpg", "publishedAt": "2020-12-15T01:00:24Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Higher proportion of male bosses found to have negative attitudes toward depression - News-Medical.Net", "description": "A higher proportion of male than of female managers have negative attitudes toward depression, a University of Gothenburg study shows.", "url": "https://www.news-medical.net/news/20201214/Higher-proportion-of-male-bosses-found-to-have-negative-attitudes-toward-depression.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/depression-620x480.jpg", "publishedAt": "2020-12-15T00:31:00Z", "content": "A higher proportion of male than of female managers have negative attitudes toward depression, a University of Gothenburg study shows. The more senior the managerial positions, the bigger the share o… [+4257 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Singapore's Covid-19 vaccination strategy: Multi-ministry taskforce answers key questions - AsiaOne", "description": "SINGAPORE - Monday's press conference by the multi-ministry taskforce on Covid-19 saw a range of questions asked on Singapore's planned vaccination rollout. Clara Chong reports on some of the highlights. A: Very few vaccinations are made mandatory, because th…", "url": "https://www.asiaone.com/singapore/singapores-covid-19-vaccination-strategy-multi-ministry-taskforce-answers-key-questions", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2020/image_607.jpg?h=199d8c1f&itok=cYCyWrdW", "publishedAt": "2020-12-15T00:23:36Z", "content": "SINGAPORE - Monday's press conference by the multi-ministry taskforce on Covid-19 saw a range of questions asked on Singapore's planned vaccination rollout. Clara Chong reports on some of the highlig… [+6795 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Coronavirus: New virus variant discovered as London re-enters lockdown | 9 News Australia - 9 News Australia", "description": "A new variant of COVID-19 has been identified by UK health authorities, with concerns it could be responsible for London's spike in new coronavirus cases. Su...", "url": "https://www.youtube.com/watch?v=lA71eb4XK-E", "urlToImage": "https://i.ytimg.com/vi/lA71eb4XK-E/maxresdefault.jpg", "publishedAt": "2020-12-14T22:43:42Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Boston Medical Center Becomes First Massachusetts Hospital To Receive COVID Vaccine Shipment - CBS Boston", "description": "WBZ-TV's Christina Hager reports.", "url": "https://www.youtube.com/watch?v=rQD028NuKCw", "urlToImage": "https://i.ytimg.com/vi/rQD028NuKCw/maxresdefault.jpg", "publishedAt": "2020-12-14T22:33:49Z", "content": null}, {"source": {"id": null, "name": "Express"}, "author": "Aliss Higham", "title": "Covid mutation meaning: What is the coronavirus mutation? What does mutation mean? - Express", "description": "EXPERTS have identified a new variant of coronavirus that is currently spreading across London and the southeast of England, and has sparked fear across the UK. What is the coronavirus mutation? What does mutation mean?", "url": "https://www.express.co.uk/life-style/health/1372531/Covid-mutation-meaning-coronavirus-mutation-what-does-mutation-mean-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1372531.jpg", "publishedAt": "2020-12-14T21:31:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "PHE investigating a novel strain of COVID-19 - Mirage News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiSGh0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL3BoZS1pbnZlc3RpZ2F0aW5nLWEtbm92ZWwtc3RyYWluLW9mLWNvdmlkLTE5L9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-12-14T20:58:15Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "RAW: COVID-19 vaccine arrives at UT Austin | KVUE - KVUE", "description": "The University of Texas Dell Medical School received 2,925 Pfizer doses around 9:30 a.m. on Monday.STORY: https://www.kvue.com/article/news/health/coronaviru...", "url": "https://www.youtube.com/watch?v=_6QFxDJnOyQ", "urlToImage": "https://i.ytimg.com/vi/_6QFxDJnOyQ/maxresdefault.jpg", "publishedAt": "2020-12-14T20:20:30Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Connecticut Governor Hails Pfizer's Covid Vaccine as 'Most Effective' Ever - Bloomberg Quicktake: Now", "description": "Connecticut Gov. Ned Lamont said Monday in Hartford that Pfizer's Covid-19 vaccine was \"one of the most effective vaccines in the history of the world,\" as t...", "url": "https://www.youtube.com/watch?v=wGIMTqZQ3Tg", "urlToImage": "https://i.ytimg.com/vi/wGIMTqZQ3Tg/maxresdefault.jpg", "publishedAt": "2020-12-14T19:21:23Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Mary-Louise McLaws", "title": "5 tips for ventilation to reduce COVID risk at home and work - The Conversation AU", "description": "Open windows and doors, use fans, and set your aircon to pull fresh air from outside.", "url": "https://theconversation.com/5-tips-for-ventilation-to-reduce-covid-risk-at-home-and-work-151758", "urlToImage": "https://images.theconversation.com/files/374050/original/file-20201210-14-jr1aa7.jpg?ixlib=rb-1.1.0&rect=0%2C549%2C3594%2C1794&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-12-14T19:06:00Z", "content": "As many of us return to the office, and congregate indoors over dinner and drinks during the summer holidays, we need to think about ventilation to minimise the indoor spread of COVID-19.\r\nSARS-CoV-2… [+5571 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Covid-19 Vaccine Rollout Begins Today - WGRZ-TV", "description": "Trucks leaving  Pfizer Michigan plant  distribution of covid-19 vaccine", "url": "https://www.youtube.com/watch?v=RfAolA_K4mk", "urlToImage": "https://i.ytimg.com/vi/RfAolA_K4mk/maxresdefault.jpg", "publishedAt": "2020-12-14T16:41:17Z", "content": null}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Adam Geller and Heather Hollingsworth", "title": "Coronavirus vaccinations begin in the US as death toll nears 300,000 - Brisbane Times", "description": "The first shot was given to a nurse in New York City in the American mass vaccination campaign, opening a new chapter in the battle against the coronavirus pandemic.", "url": "https://www.smh.com.au/world/north-america/coronavirus-vaccinations-begin-in-the-us-as-death-toll-nears-300-000-20201215-p56ngk.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1961111111111111%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_4/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/9a7963a9597a0e49157125d02bb8734dae5b25b9", "publishedAt": "2020-12-14T16:01:00Z", "content": "Meanwhile, a sea change in Washington is fast approaching after an election that was, in large part, a referendum on the Trump administrations handling of the virus. President-elect Joe Biden has mad… [+6042 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Mexico says Pfizer vaccine doses could arrive in 5-8 days - Thomson Reuters Foundation", "description": "MEXICO-PFIZER/ (URGENT):Mexico says Pfizer vaccine doses could arrive in 5-8 days", "url": "https://news.trust.org/item/20201214134906-lu1sc/", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/099e4398-ed14-4026-9ec7-20529d9b24be/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2020-12-14T14:46:00Z", "content": "MEXICO CITY, Dec 14 (Reuters) - Mexico will this Monday put in an order for COVID-19 vaccine doses from U.S. pharmaceutical firm Pfizer, which could arrive in roughly a week, Deputy Foreign Minister … [+298 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Dr. Oz explains why people who receive COVID-19 vaccine should still wear masks | FOX 5 DC - FOX 5 DC", "description": "Dr. Oz discusses the initial rollout of the COVID-19 vaccine, why vaccinated people should still wear a mask and how many people he expects to get vaccinated...", "url": "https://www.youtube.com/watch?v=PMr3SGpYDZ4", "urlToImage": "https://i.ytimg.com/vi/PMr3SGpYDZ4/maxresdefault.jpg", "publishedAt": "2020-12-14T14:36:07Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "James Oaten", "title": "Doctors warn Delhi's intensive care units are full and COVID-19 symptoms are getting worse - ABC News", "description": "While much of India is on a downward trend with COVID-19 cases, the nation's capital was buckling under a sharp rise. Now doctors are warning this latest wave includes patients experiencing symptoms more severe than they have seen previously.", "url": "https://www.abc.net.au/news/2020-12-15/inside-the-next-wave-of-covid-19-hitting-india/12980332", "urlToImage": "https://www.abc.net.au/cm/rimage/12982468-16x9-large.jpg?v=2", "publishedAt": "2020-12-14T14:15:00Z", "content": "Even as coronavirus infections begin to ease in Delhi, doctors are warning that this latest wave of COVID-19 in the city has been far deadlier than before and young people have been among the worst h… [+4961 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Singapore approves Pfizer-BioNTech virus vaccine - Medical Xpress", "description": "Singapore has approved the Pfizer-BioNTech coronavirus vaccine, and expects to receive the first shipments of the shots by the end of December, the prime minister said Monday.", "url": "https://medicalxpress.com/news/2020-12-singapore-pfizer-biontech-virus-vaccine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/48-covid19.jpg", "publishedAt": "2020-12-14T14:12:09Z", "content": "Singapore has approved the Pfizer-BioNTech coronavirus vaccine, and expects to receive the first shipments of the shots by the end of December, the prime minister said Monday.\r\nThe city-state joins a… [+2292 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "LJ Charleston", "title": "Sisters diagnosed with breast cancer just one hour apart - NEWS.com.au", "description": "Sisters diagnosed with breast cancer just one hour apart", "url": "https://www.news.com.au/lifestyle/health/health-problems/sisters-diagnosed-with-breast-cancer-just-one-hour-apart/news-story/d7150ec5a76d547f277763b45ae4121a", "urlToImage": "https://cdn.newsapi.com.au/image/v1/5290d5f3259feb1b7c7b725c795c7537?width=1280", "publishedAt": "2020-12-14T14:05:35Z", "content": "If ever there was a truth is stranger than fiction tale to tell then Im about to tell you a big one: my sister and I were both diagnosed with breast cancer on the same day.In different states, just o… [+6677 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "AAP", "title": "Singapore approves Pfizer COVID-19 vaccine - PerthNow", "description": "Singapore has approved Pfizer-BioNTech's coronavirus vaccine, Prime Minister Lee Hsien Loong says, with shots expected to arrive by year-end.", "url": "https://www.perthnow.com.au/news/health/singapore-approves-pfizer-covid-19-vaccine-ng-s-2042032", "urlToImage": "https://images.perthnow.com.au/publication/S-2042032/1607941296338_Virus_Singapore_16-9_20052239_2042032_20201214211216d6baadb7-759b-43e7-9520-29e6fa2e6efd.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2020-12-14T10:20:00Z", "content": "Singapore has approved the Pfizer/BioNTech coronavirus vaccine, Prime Minister Lee Hsien Loong says, paving the way for its deployment in the city-state late this year or in early 2021.\r\n\"I am very h… [+1041 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "How Did the University of Queensland/CSL Vaccine Fail Due to ‘False Positive’ HIV Tests? - Gizmodo Australia", "description": "Australia’s hopes of a locally developed COVID-19 vaccine have been dashed with news today the University of Queensland/CSL vaccine would not proceed to further clinical trials. Unlike news about the Pfizer/BioNTech COVID vaccine earlier this week, there were…", "url": "https://www.gizmodo.com.au/2020/12/how-did-the-university-of-queensland-csl-vaccine-fail-due-to-false-positive-hiv-tests/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2020/12/14/covid-vaccine-uq-scott-morrison.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1280&nr=20", "publishedAt": "2020-12-14T06:00:00Z", "content": "Australias hopes of a locally developed COVID-19 vaccine have been dashed with news today the University of Queensland/CSL vaccine would not proceed to further clinical trials.\r\nUnlike news about the… [+4340 chars]"}, {"source": {"id": null, "name": "Westcoastsentinel.com.au"}, "author": "Daniel McCulloch", "title": "All green lights ahead for coronavirus jab - West Coast Sentinel", "description": "There appears to be nothing but green lights ahead for a national coronavirus vaccine rollout early next year. Health Minister Greg Hunt is not expecting any...", "url": "https://www.westcoastsentinel.com.au/story/7053336/all-green-lights-ahead-for-coronavirus-jab/?cs=9676", "urlToImage": "https://www.westcoastsentinel.com.au/images/transform/v1/crop/frm/silverstone-feed-data/f162498d-b23a-431d-8675-31e63b6d6a12.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-12-14T05:29:44Z", "content": "There appears to be nothing but green lights ahead for a national coronavirus vaccine rollout early next year.\r\nHealth Minister Greg Hunt is not expecting any more setbacks after being forced to dump… [+2955 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "First vaccines to arrive in Tampa this week - ABC Action News", "description": "First COVID-19 vaccines to arrive in Tampa as soon as Monday morning.", "url": "https://www.youtube.com/watch?v=J10TxLvPh04", "urlToImage": "https://i.ytimg.com/vi/J10TxLvPh04/maxresdefault.jpg", "publishedAt": "2020-12-14T04:18:25Z", "content": null}, {"source": {"id": null, "name": "코리아타임스"}, "author": null, "title": "Bahrain approves registration for China's Sinopharm COVID-19 vaccine - Korea Times", "description": "Bahrain approves registration for China's Sinopharm COVID-19 vaccine", "url": "https://www.koreatimes.co.kr/www/world/2020/12/683_300842.html", "urlToImage": "https://ston.koreatimes.co.kr/web/IMAGE/upload/newsV2/images/202012/eba4c27963024105a01943185557c81f.jpg", "publishedAt": "2020-12-14T02:07:00Z", "content": null}, {"source": {"id": null, "name": "Cessnock Advertiser"}, "author": "Angelo Risso", "title": "Carols, more visitors in NSW aged care - Cessnock Advertiser", "description": "Aged care residents in NSW will be able to have as many Christmas visitors as they want as regulations imposed to stop the spread of COVID-19 into the facilit...", "url": "https://www.cessnockadvertiser.com.au/story/7053989/carols-more-visitors-in-nsw-aged-care/?cs=9676", "urlToImage": "https://www.cessnockadvertiser.com.au/images/transform/v1/crop/frm/silverstone-feed-data/ebcb8fe6-29f1-4a24-b48d-400ab6276bda.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-12-14T01:40:33Z", "content": "Aged care residents in NSW will be able to have as many Christmas visitors as they want as regulations imposed to stop the spread of COVID-19 into the facilities are eased.\r\nThe two visitor rule will… [+2355 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Covid-19 Vaccine Deliveries Set to Begin in U.S. - Bloomberg Markets and Finance", "description": "Dec.13 -- The first Covid-19 vaccine arrived in record time. Now comes the hard part: producing enough shots to immunize the majority of the U.S. population ...", "url": "https://www.youtube.com/watch?v=BoZMFTIF6Es", "urlToImage": "https://i.ytimg.com/vi/BoZMFTIF6Es/hqdefault.jpg", "publishedAt": "2020-12-14T00:28:48Z", "content": null}]}