{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Pain hides in our data - EurekAlert", "description": "In a new study, researchers developed and applied machine-learning algorithms to physiological data from patients with chronic pain from sickle cell disease. Not only did the researchers' approach outperform baseline models to estimate subjective pain levels,…", "url": "https://www.eurekalert.org/pub_releases/2021-03/nu-phi030821.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-11T19:10:45Z", "content": "A research team led by Northwestern University faculty and alumni has found it's possible to understand a patient's pain level by examining data from vital signs.\r\nIn a new study, the team developed … [+4347 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Connor Parker", "title": "UK coronavirus variant is taking over amid warnings it is 'travelling around the world' - Yahoo News Australia", "description": "The COVID-19 variant that originated in Kent has been detected in over 100 countries.", "url": "https://au.news.yahoo.com/uk-coronavirus-variant-is-taking-over-amid-warnings-it-is-travelling-around-the-world-190220742.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/be0c1750-829a-11eb-8ffd-71df3e55c642", "publishedAt": "2021-03-11T19:07:29Z", "content": "COVID cases per million people across Europe. The darker the red the more cases there are. (Our World in Data)\r\nThe coronavirus variant that originated in Kent is spreading across the world and is at… [+4652 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": null, "title": "HPV vaccines for adults over age 26 may not be cost-effective - HSPH News", "description": "For immediate release: Thursday, March 11, 2021 Boston, MA – Vaccinating adults age 26 and older against the human papillomavirus (HPV)—the virus that causes more than 90% of cervical cancers as we…", "url": "https://www.hsph.harvard.edu/news/press-releases/hpv-vaccines-for-adults-not-cost-effective/", "urlToImage": "https://cdn1.sph.harvard.edu/wp-content/uploads/sites/21/2021/03/iStock-1146832519.jpg", "publishedAt": "2021-03-11T19:06:12Z", "content": "For immediate release: Thursday, March 11, 2021\r\nBoston, MA Vaccinating adults age 26 and older against the human papillomavirus (HPV)the virus that causes more than 90% of cervicalcancers as well as… [+4802 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Fungi prevent intestinal healing - Science Magazine", "description": "Chronic intestinal diseases, such as inflammatory bowel disease (IBD), are associated with continual tissue damage that must be repaired. Mucosal restoration is a coordinated process that can be influenced by extrinsic factors, including the commensal bacteri…", "url": "https://science.sciencemag.org/content/371/6534/1102.full", "urlToImage": "https://science.sciencemag.org/content/371/6534/1102/F1.large.jpg", "publishedAt": "2021-03-11T18:57:00Z", "content": "Thank you for your interest in spreading the word about Science.\r\nNOTE: We only request your email address so that the person you are recommending the page to knows that you wanted them to see it, an… [+63 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "50 new genes for eye color - Science Daily", "description": "The genetics of human eye color is much more complex than previously thought.", "url": "https://www.sciencedaily.com/releases/2021/03/210311123443.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-11T18:32:40Z", "content": "The genetics of human eye colour is much more complex than previously thought, according to a new study published today.An international team of researchers led by King's College London and Erasmus U… [+1578 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel CRISPR-based gene editor developed to correct mutations that cause genetic disorders - News-Medical.net", "description": "A team of researchers from the Agency for Science, Technology and Research's (A*STAR) Genome Institute of Singapore have developed a CRISPR-based gene editor, C-to-G Base Editor (CGBE), to correct mutations that cause genetic disorders.", "url": "https://www.news-medical.net/news/20210311/Novel-CRISPR-based-gene-editor-developed-to-correct-mutations-that-cause-genetic-disorders.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gene-620x480.jpg", "publishedAt": "2021-03-11T18:27:00Z", "content": "A team of researchers from the Agency for Science, Technology and Research's (A*STAR) Genome Institute of Singapore (GIS) have developed a CRISPR-based gene editor, C-to-G Base Editor (CGBE), to corr… [+3502 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Dry eye disease negatively affects patients' health and vision related quality of life - News-Medical.Net", "description": "Patients suffering from dry eye disease symptoms have a lower quality of life compared to those without symptoms, a new study reports.", "url": "https://www.news-medical.net/news/20210311/Dry-eye-disease-negatively-affects-patients-health-and-vision-related-quality-of-life.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/2/Close_up_of_the_beautiful_eye_of_a_young_child_-_Nik_Bruining_f959060df7e6466ba2733a4c18153083-620x480.jpg", "publishedAt": "2021-03-11T18:20:00Z", "content": "Patients suffering from dry eye disease symptoms have a lower quality of life compared to those without symptoms, a new study reports. The findings showed that patients with the condition reported ne… [+3364 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "The dangers of homeworking and isolation - The Guardian", "description": "<strong>Letters: </strong>There is a risk that we are sleepwalking into drastic societal changes without considering the mental health implications, writes <strong>Mark Dawes</strong>, while <strong>Michael Cunningham</strong> is growing sick of the sight of …", "url": "https://amp.theguardian.com/business/2021/mar/11/the-dangers-of-homeworking-and-isolation", "urlToImage": null, "publishedAt": "2021-03-11T18:11:00Z", "content": "There is a risk that we are sleepwalking into drastic societal changes without considering the mental health implications, writes Mark Dawes, while Michael Cunningham is growing sick of the sight of … [+2025 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds limited association between vitamin D and improved COVID-19 outcomes - News-Medical.Net", "description": "New research shows a lack of an association between Vitamin D deficiency and the number of COVID-19 cases, recoveries, or mortality rates in European countries.", "url": "https://www.news-medical.net/news/20210311/Study-finds-no-link-between-vitamin-D-and-COVID-19-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/shutterstock_534827887_(2).jpg", "publishedAt": "2021-03-11T17:33:00Z", "content": "New research shows a lack of an association between Vitamin D deficiency and the number of coronavirus disease 2019 (COVID-19) cases, recoveries, or mortality rates in European countries.\r\nMalnutriti… [+4175 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Health chief on back foot over vaccines - 7NEWS.com.au", "description": "Health Department secretary Brendan Murphy has been forced to clarify \"dangerous\" assertions that one dose of a coronavirus vaccine will offer full protection.", "url": "https://7news.com.au/politics/health-chief-on-back-foot-over-vaccines-c-2335379", "urlToImage": "https://images.s.7news.com.au/publication/C-2335379/9ba1707bf2a913876119829c19e2bc1d256ae2be-16x9-x0y75w800h450.jpg?imwidth=1024", "publishedAt": "2021-03-11T16:34:00Z", "content": "The boss of Australia's health department has come under fire for \"dangerous\" suggestions one coronavirus jab offers full protection against the disease.\r\nBrendan Murphy clarified his evidence after … [+2012 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Combining public health and environmental science to develop pollen forecasting - EurekAlert", "description": "New research, combining healthcare data with ground-breaking ecological techniques, could set a roadmap for refining future pollen forecasts.\r\nCurrent pollen forecasts, crucial for people with allergic asthma or hay fever to manage their symptoms, rely on mea…", "url": "https://www.eurekalert.org/pub_releases/2021-03/bu-cph030921.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/258547_web.jpg", "publishedAt": "2021-03-11T16:04:58Z", "content": "New research, which brings healthcare data together with ground-breaking ecological techniques, could set a roadmap for refining pollen forecasts in the future.\r\nCurrent pollen forecasts, crucial for… [+4421 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Risk of dementia rises significantly with severity and number of strokes - EurekAlert", "description": "Having an ischemic stroke increases the risk of developing dementia, and the risk escalates with the severity and number of strokes.\r\nA new study suggests stroke prevention is important to help prevent dementia.", "url": "https://www.eurekalert.org/pub_releases/2021-03/aha-rod031021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-11T15:37:49Z", "content": "Contains updated information not available in the abstract.\r\nDALLAS, March 11, 2021 -- Having an ischemic stroke increases dementia risk, and that risk escalates with the number and severity of strok… [+6489 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Adding triglyceride-lowering omega-3 based medication to statins may lower stroke risk - Medical Xpress", "description": "Taking the triglyceride-lowering medication icosapent ethyl cut the risk of stroke by an additional 36% in people at increased risk of cardiovascular disease who already have their bad cholesterol levels under control using statin medications, according to pr…", "url": "https://medicalxpress.com/news/2021-03-adding-triglyceride-lowering-omega-based-medication.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/5735b36a59343.jpg", "publishedAt": "2021-03-11T15:29:09Z", "content": "Taking the triglyceride-lowering medication icosapent ethyl cut the risk of stroke by an additional 36% in people at increased risk of cardiovascular disease who already have their bad cholesterol le… [+3773 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Graphene has ability to interact with functions of nervous system - Health Europa", "description": "New research has shown that graphene is able to act on excitatory synapses and interfere with the development of anxiety-related behaviours.", "url": "https://www.healtheuropa.eu/graphene-has-ability-to-interact-with-functions-of-nervous-system/106561/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2021/03/©-iStock-vchal.jpg", "publishedAt": "2021-03-11T14:10:05Z", "content": "Carried out by SISSA – International School for Advanced Studies of Trieste, Catalan Institute of Nanoscience and Nanotechnology (ICN2) of Barcelona, and the National Graphene Institute of the Univer… [+2871 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "Accelerating and expanding HIV services in the Central African Republic - Africanews English", "description": "The Central African Republic has made significant progress in its response to HIV over the past four years. New HIV infections continue to decline and", "url": "http://www.africanews.com/2021/03/11/accelerating-and-expanding-hiv-services-in-the-central-african-republic/", "urlToImage": "https://static.euronews.com/articles/wires/707/09/7070916/1024x538_mm7pjt.jpg?1615468808", "publishedAt": "2021-03-11T13:20:08Z", "content": "The Central African Republic has made significant progress in its response to HIV over the past four years. New HIV infections continue to decline and the number of people on antiretroviral therapy h… [+3827 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Dementia risk escalates with the number and severity of strokes - News-Medical.Net", "description": "Having an ischemic stroke increases dementia risk, and that risk escalates with the number and severity of strokes, according to preliminary research to be presented at the American Stroke Association's International Stroke Conference 2021.", "url": "https://www.news-medical.net/news/20210311/Dementia-risk-escalates-with-the-number-and-severity-of-strokes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Dementia-620x480.jpg", "publishedAt": "2021-03-11T13:01:00Z", "content": "Having an ischemic stroke increases dementia risk, and that risk escalates with the number and severity of strokes, according to preliminary research to be presented at the American Stroke Associatio… [+3672 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Stroke survivors more likely to attempt or die by suicide - News-Medical.Net", "description": "Stroke survivors may be more likely to attempt or die by suicide than people who have not had a stroke, according to preliminary research to be presented at the American Stroke Association's International Stroke Conference 2021.", "url": "https://www.news-medical.net/news/20210311/Stroke-survivors-more-likely-to-attempt-suicide-or-die-by-suicide.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Stroke-620x480.jpg", "publishedAt": "2021-03-11T12:59:00Z", "content": "Stroke survivors may be more likely to attempt or die by suicide than people who have not had a stroke, according to preliminary research to be presented at the American Stroke Association's Internat… [+2626 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A retinal photo may provide early warning signs of stroke and dementia - News-Medical.Net", "description": "Pictures of the retina may someday provide early warning signs that a person is at an increased risk of stroke and dementia, making it possible to take preventive measures, according to preliminary research to be presented at the American Stroke Association's…", "url": "https://www.news-medical.net/news/20210311/A-retinal-photo-may-provide-early-warning-signs-of-stroke-and-dementia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Dementia-620x480.jpg", "publishedAt": "2021-03-11T12:23:00Z", "content": "Pictures of the retina may someday provide early warning signs that a person is at an increased risk of stroke and dementia, making it possible to take preventive measures, according to preliminary r… [+2288 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": "The Conversation", "title": "What are breath-holding spells, the common phenomenon that causes children to faint? - Micky News", "description": "It’s time to leave the playground but your 12-month-old daughter doesn’t want to. She gets angry, cries out loudly, breathing all the way out and then holds", "url": "https://micky.com.au/what-are-breath-holding-spells-the-common-phenomenon-that-causes-children-to-faint/", "urlToImage": "https://micky.com.au/wp-content/uploads/2021/03/pexels-pixabay-256657.jpg", "publishedAt": "2021-03-11T12:05:57Z", "content": "This is understandably very scary for any parent. But the good news is these episodes, called breath-holding spells, are common, not dangerous, resolve as children get older, and dont cause any long-… [+5153 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Pandemic babies: How COVID-19 has affected child development - The New Daily", "description": "Babies born after March 11 2020 will have only known a world in the grip of a pandemic.They may never have met anyone who isn’t their parent.", "url": "https://thenewdaily.com.au/life/relationships/2021/03/11/pandemic-babies-development/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/GettyImages-77744447-960x540-1-960x600.jpg", "publishedAt": "2021-03-11T11:15:00Z", "content": "Babies born after March 11, 2020 will have only known a world in the grip of a pandemic.\r\nThey may never have met anyone who isnt their parent, or they may only ever have seen their grandparents from… [+6466 chars]"}, {"source": {"id": null, "name": "Anadolu Agency"}, "author": null, "title": "'Climate change can impact spread of malaria in Africa' - Anadolu Agency", "description": "Research focused on Ethiopia's Oromia region shows slowdown in global warming led to lower incidence of malaria - Anadolu Agency", "url": "https://www.aa.com.tr/en/africa/climate-change-can-impact-spread-of-malaria-in-africa/2172213", "urlToImage": "https://cdnuploads.aa.com.tr/uploads/Contents/2021/03/11/thumbs_b_c_ceba6107727d4163d0b8ab085664d137.jpg?v=122958", "publishedAt": "2021-03-11T09:30:45Z", "content": "ANKARA\r\nThe slowdown in global warming seen at the end of the last century was reflected by a decline in malaria transmission in the Ethiopian highlands, according to a study published on Wednesday.\r… [+2345 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Pip Christmass", "title": "Almost FIFTY Queensland suburbs on high alert for COVID after wastewater find - 7NEWS.com.au", "description": "Anyone in the catchment area experiencing symptoms is urged to get tested.", "url": "https://7news.com.au/news/qld/almost-fifty-queensland-suburbs-on-high-alert-for-covid-after-wastewater-find-c-2333316", "urlToImage": "https://images.s.7news.com.au/publication/C-2333316/997499281d0dca11d130bd4ea1068f96073a3723-16x9-x0y0w1920h1080.jpg?imwidth=1024", "publishedAt": "2021-03-11T08:59:00Z", "content": "Nearly 50 Queensland suburbs have been placed on high alert for signs of coronavirus after wastewater testing found fragments of the virus.\r\nFragments of the virus have been detected at the Cairns No… [+1160 chars]"}, {"source": {"id": null, "name": "Queenslandcountrylife.com.au"}, "author": "Sally Gall", "title": "CWQ COVID vaccinations expected to start next week, in Aramac - Queensland Country Life", "description": "Almost 12 months to the day since the World Health Organisation declared COVID-19 a pandemic, the residents of the small town of Aramac will become the first in Queensland's central west to be vaccinated against the virus.", "url": "https://www.queenslandcountrylife.com.au/story/7163750/aramac-residents-first-in-line-for-covid-jab/", "urlToImage": "https://www.queenslandcountrylife.com.au/images/transform/v1/crop/frm/88uitQDCBZnXA8enwGJ5Zd/f20e17b6-854f-409a-87ad-46c135b7e1e6.jpg/r11_250_4790_2950_w1200_h678_fmax.jpg", "publishedAt": "2021-03-11T07:26:00Z", "content": "Almost 12 months to the day since the World Health Organisation declared COVID-19 a pandemic, the residents of the small town of Aramac will become the first in Queensland's central west to be vaccin… [+3749 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Vaccine hope, but enduring fear one year after pandemic declared - Malay Mail", "description": "BRASILIA, Mar 11 — The world today marked one year since the coronavirus threat was declared a pandemic, with vaccinations offering hope but much of humanity still enduring highly restricted lives with no clear path back to normality. The enormity of the chal…", "url": "https://www.malaymail.com/news/world/2021/03/11/vaccine-hope-but-enduring-fear-one-year-after-pandemic-declared/1956907", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-02/SputnikV_27022021-seo.JPG", "publishedAt": "2021-03-11T07:00:03Z", "content": "A medical specialist holds a vial of Sputnik V vaccine against the coronavirus in a department store in Moscow, Russia, January 18, 2021. Reuters pic\r\nSubscribe to our Telegram channel for the latest… [+4212 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Warren Barnsley", "title": "ANU researchers’ ‘incredible discovery’ could hold key for asthma, allergy sufferers - 7NEWS.com.au", "description": "The medical breakthrough could lead to a ‘completely new approach’ to treating allergies.", "url": "https://7news.com.au/lifestyle/health-wellbeing/anu-researchers-incredible-discovery-could-hold-key-for-asthma-allergy-sufferers-c-2332043", "urlToImage": "https://images.s.7news.com.au/publication/C-2332043/8c0453ed872543cf7537951c61924b4752d44916-16x9-x0y0w1920h1080.png?imwidth=1024", "publishedAt": "2021-03-11T06:39:00Z", "content": "An incredible discovery by Australian researchers could result in a new medicinal treatment for allergic conditions including asthma, eczema and anaphylaxis.\r\nThe researchers from Australian National… [+1750 chars]"}, {"source": {"id": null, "name": "The Korea Herald"}, "author": "Herald", "title": "SK Bioscience to develop vaccine for COVID-19 variants - The Korea Herald", "description": "SK Bioscience will develop an all-in-one vaccine targeting COVID-19 variants, together with the Coalition for Epidemic Preparedness Innovations, the South Korean firm said Thursday.   SK Bioscience would receive funding from CEPI, worth up to $14.2 million, f…", "url": "http://www.koreaherald.com/view.php?ud=20210311000870", "urlToImage": "http://res.heraldm.com/content/image/2021/03/11/20210311000756_0.jpg", "publishedAt": "2021-03-11T06:27:05Z", "content": null}, {"source": {"id": null, "name": "Kidspot"}, "author": "Pilar Grace", "title": "'You just want to take their pain': Mum documents daughter's cancer journey - Kidspot", "description": "Photographer mum documents her three-year-old daughter's battle with cancer on Instagram.", "url": "https://www.kidspot.com.au/parenting/child/child-development/you-just-want-to-take-their-pain-mum-documents-daughters-cancer-journey/news-story/4e18ea6dae777d3531ec8ea75f371bff", "urlToImage": "https://content.api.news/v3/images/bin/5ae7fa5ebf1d481436aa0017f58acb91", "publishedAt": "2021-03-11T05:43:21Z", "content": "Photographer mum documents her three-year-old daughter's battle with cancer on Instagram.When Lulas eight-year-old brother Kohen saw his little sisters chemotherapy was causing her hair to fall out, … [+3046 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "South African SARS-CoV-2 variant most problematic for BNT-162b2 vaccine - News-Medical.Net", "description": "Researchers from Germany and the US investigated the efficacy of neutralizing antibodies against newer variants using serum and saliva samples obtained from groups of infected, vaccinated (with Pfizer BNT-162b2), and uninfected individuals. The researchers st…", "url": "https://www.news-medical.net/news/20210310/South-African-SARS-CoV-2-variant-most-problematic-for-BNT-162b2-vaccine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/2021.03.08.21252958v1.jpg", "publishedAt": "2021-03-11T03:37:00Z", "content": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) emerged in late December 2019 in Wuhan, China. The virus has since spread across the globe, evolving into the COVID-19 pandemic, crippling… [+5470 chars]"}, {"source": {"id": null, "name": "2gb.com"}, "author": null, "title": "Opioid prescriptions plummet as doctors ditch strong drugs - 2GB", "description": "Doctors are prescribing strong drugs less for common discomforts such after new findings indicate simple remedies could be equally effective.", "url": "https://www.2gb.com/opioid-prescriptions-plummet-as-doctors-ditch-strong-drugs/", "urlToImage": "https://www.2gb.com/wp-content/uploads/sites/2/2021/03/iStock-1248959632.jpg?fit=724%2C483", "publishedAt": "2021-03-11T03:02:24Z", "content": "Doctors are prescribing strong drugs less for common discomforts, such as back pain, in favour of simple remedies that are found to be equally effective. \r\nIbuprofen and a basic heat pack have been f… [+564 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Agnès PEDRERO", "title": "WHO's pandemic response: from criticism to Nobel? - Yahoo News Australia", "description": "In the year since the World Health Organization first described the Covid-19 outbreak as a pandemic, it has faced towering criticism, but has also been...", "url": "https://au.news.yahoo.com/whos-pandemic-response-criticism-nobel-023146926.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rhKhu75mbkBdQ5J2hKdJxw--~B/aD01MTI7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.au/4cb3b192b36616ad3abb56f420d33ff7", "publishedAt": "2021-03-11T02:31:46Z", "content": "In the year since the World Health Organization first described the Covid-19 outbreak as a pandemic, it has faced towering criticism, but has also been showered with praise.\r\nHere is an overview of t… [+5114 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mosquito protein study could lead to therapeutics against deadly viruses - News-Medical.net", "description": "The mosquito protein AEG12 strongly inhibits the family of viruses that cause yellow fever, dengue, West Nile, and Zika and weakly inhibits coronaviruses, according to scientists at the National Institutes of Health (NIH) and their collaborators.", "url": "https://www.news-medical.net/news/20210310/Mosquito-protein-study-could-lead-to-therapeutics-against-deadly-viruses.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/2/Dengue%2c_zica_and_chikungunya_fever_mosquito_(aedes_aegypti)_on_human_skin-Tacio_Philip_23765b00daa34a4196aa9cea976adde8-620x480.jpg", "publishedAt": "2021-03-11T01:31:00Z", "content": "The mosquito protein AEG12 strongly inhibits the family of viruses that cause yellow fever, dengue, West Nile, and Zika and weakly inhibits coronaviruses, according to scientists at the National Inst… [+2981 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Emily Cosenza", "title": "SA Health: Wastewater detection not from medi-hotels - NEWS.com.au", "description": "Positive wastewater detections not believed to be from medi-hotels, ‘likely’ from interstate visitors", "url": "https://www.news.com.au/lifestyle/health/health-problems/positive-wastewater-detections-not-believed-to-be-from-medihotels-likely-from-interstate-visitors/news-story/69b0d04bf872cd2e4d3bea44b55132b8", "urlToImage": "https://cdn.newsapi.com.au/image/v1/b16241c4affd5a4c403c509c20f3353c?width=1280", "publishedAt": "2021-03-11T00:54:52Z", "content": "South Australian health authorities claim the detected COVID-19 traces found in wastewater are not coming from the states medi-hotels but more likely from interstate visitors. Premier Steven Marshall… [+2789 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Elderly patients at greater risk of dying from hip surgery during busy periods - News-Medical.Net", "description": "Hip fractures are serious, especially for the elderly. The operation can be a great strain, and 13 per cent of patients over the age of 70 do not survive 60 days after the fracture.", "url": "https://www.news-medical.net/news/20210310/Elderly-patients-at-greater-risk-of-dying-from-hip-surgery-during-busy-periods.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2021-03-10T23:32:00Z", "content": "Hip fractures are serious, especially for the elderly. The operation can be a great strain, and 13 per cent of patients over the age of 70 do not survive 60 days after the fracture.\r\nTheir chance of … [+2578 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "Tens of thousands of cancer sufferers denied treatment in UK during pandemic - WSWS", "description": "“Under the coronavirus situation there is an enormous crisis in diagnosing cancer and determining their severity. This delays cancer treatment. The outcomes of treatment and prognoses suffer as a result.” — England National Health Service oncologist", "url": "https://www.wsws.org/en/articles/2021/03/11/list-m11.html", "urlToImage": "https://www.wsws.org/asset/9b5213de-0703-4ff7-87f8-a3ac11f2025b?rendition=image1280", "publishedAt": "2021-03-10T23:11:36Z", "content": "The COVID-19 pandemic has exacerbated the dire situation facing tens of thousands of UK cancer patients. At the end of December 2020the worst month for medical backlogs since records began in 2007alm… [+7317 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Physician's Briefing", "title": "Whole-Genome Sequencing Is Accurate for Myeloid Cancers - HealthDay News", "description": "Prospective sequencing of samples provided new genetic information for 24.8 percent of patients, which changed risk category for 16.2 percent", "url": "https://consumer.healthday.com/whole-genome-sequencing-is-accurate-for-myeloid-cancers-2650961210.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzYyNjUwMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2NTc1NzYzM30.dLrzPz0QTlyeNt1cvo0eqRiJa_qxbl_6fspOSj7im8E/image.jpg?width=1200&coordinates=0%2C100%2C0%2C100&height=600", "publishedAt": "2021-03-10T22:12:28Z", "content": "WEDNESDAY, March 10, 2021 (HealthDay News) -- A streamlined whole-genome sequencing approach can provide rapid and accurate genomic profiling for acute myeloid leukemia (AML) or myelodysplastic syndr… [+1640 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Antibody Responses in Seropositive Persons after a Single Dose of SARS-CoV-2 mRNA Vaccine | NEJM - nejm.org", "description": "Correspondence from The New England Journal of Medicine — Antibody Responses in Seropositive Persons after a Single Dose of SARS-CoV-2 mRNA Vaccine", "url": "https://www.nejm.org/doi/10.1056/NEJMc2101667", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmc2101667/20210310/images/img_small/nejmc2101667_f1.jpeg", "publishedAt": "2021-03-10T22:01:15Z", "content": "The efficacy of two injections of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) spike messenger RNA (mRNA) vaccines (BNT162b2 [Pfizer] and mRNA-1273 [Moderna])1 in preventing sympt… [+8285 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Kate Save", "title": "Could intermittent fasting be the key to rapid weightloss? - Body and Soul", "description": "Could intermittent fasting be the key to rapid weightloss?", "url": "https://www.bodyandsoul.com.au/nutrition/could-intermittent-fasting-be-the-key-to-rapid-weightloss/news-story/a749739088ffe2c714ca6299ba877c33", "urlToImage": "https://cdn.newsapi.com.au/image/v1/42ecb678d1c5f501070c7c84b867477b", "publishedAt": "2021-03-10T21:49:54Z", "content": "Accredited dietitian and CEO of Be Fit Food, Kate Save, is an advocate of intermittent fasting diets such as 5:2 for rapid weight loss. She lays out her tips and tricks on how to nail this type of di… [+5994 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nadeem Badshah", "title": "Two teenagers placed in foster care after weight loss plan fails - The Guardian", "description": "Family court judge says parents failed to help severely overweight children and did not understand worry of West Sussex social services", "url": "https://amp.theguardian.com/society/2021/mar/10/two-teenagers-placed-in-foster-care-after-weight-loss-plan-fails", "urlToImage": null, "publishedAt": "2021-03-10T19:48:00Z", "content": "ChildrenFamily court judge says parents failed to help severely overweight children and did not understand worry of West Sussex social services\r\nWed 10 Mar 2021 14.46 EST\r\nTwo teenagers have been rem… [+3148 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Kate Kelland", "title": "COVID vaccine ‘revolution’ must be sped up for next pandemic, says expert group - Sydney Morning Herald", "description": "The Coalition for Epidemic Preparedness Innovations said the next emerging disease could be even worse than COVID-19.", "url": "https://www.smh.com.au/world/europe/covid-vaccine-revolution-must-be-sped-up-for-next-pandemic-says-expert-group-20210311-p579n8.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1957%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_68/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/e117855f1238ab611b4b1d4916db15181101b020", "publishedAt": "2021-03-10T18:51:29Z", "content": "London: A revolution in technology that helped scientists develop COVID-19 vaccines in under a year must be sped up, so that when the next pandemic arrives a shot can be ready in 100 days, an interna… [+1499 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Donate to supply Covid jabs for all - The Guardian", "description": "Letter: Those of us who have received free vaccinations may want to show our appreciation by contributing to a scheme to ensure vaccine rollout in lower income countries, writes Paul Tyler", "url": "https://amp.theguardian.com/society/2021/mar/10/donate-to-supply-covid-jabs-for-all", "urlToImage": "https://i.guim.co.uk/img/media/65aa5eff08f57b39e2312bd8a43673845635ecd8/0_44_5344_3207/master/5344.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=05f2bfaae84424eabe42ce3679e3afac", "publishedAt": "2021-03-10T17:53:00Z", "content": "The timely reminder (A me first approach to vaccination wont defeat Covid, 5 March) from Tedros Adhanom Ghebreyesus, the director general of the World Health Organization, coincides with a growing pu… [+719 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Consumer news", "title": "Is It Safe to Have Surgery Soon After a COVID Diagnosis? - HealthDay News", "description": "WEDNESDAY, March 10, 2021 (HealthDay News) -- If you have surgery scheduled and you just found out you are infected with COVID-19, new research suggests you should push your operation back by at least seven weeks.Why? Because not doing so could raise your ris…", "url": "https://consumer.healthday.com/b-3-10-is-it-safe-to-have-surgery-soon-after-a-covid-diagnosis-2650990014.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzYyNzc0NS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1NzEyNTYxOH0.GY3YtJCaAUp_fkQTD-A6EGTtbJ5yWq-qmq9YmVMNbxM/image.jpg?width=1200&coordinates=0%2C100%2C0%2C100&height=600", "publishedAt": "2021-03-10T13:27:15Z", "content": "WEDNESDAY, March 10, 2021 (HealthDay News) -- If you have surgery scheduled and you just found out you are infected with COVID-19, new research suggests you should push your operation back by at leas… [+2681 chars]"}, {"source": {"id": null, "name": "Science.org.au"}, "author": null, "title": "Australian scientists changing the world recognised with Academy awards - Australian Academy of Science", "description": "Outstanding contributions to science have been recognised by the Australian Academy of Science today with 24 current and future stars of science receiving prestigious 2021 honorific awards.", "url": "https://www.science.org.au/news-and-events/news-and-media-releases/australian-scientists-changing-world-recognised-academy-awards", "urlToImage": "https://www.science.org.au//files/userfiles/about/2021_Honorifics_191x1-1200x628_03(1).jpg", "publishedAt": "2021-03-10T13:18:44Z", "content": "Outstanding contributions to science have been recognised by the Australian Academy of Science today with 24 current and future stars of science receiving prestigious 2021 honorific awards.\r\nThe scie… [+5427 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers confirm new drug development route for treating multiple sclerosis, asthma - News-Medical.Net", "description": "Brazilian researchers who study a native venomous fish have confirmed a route to drug development for the treatment of chronic inflammatory diseases such as multiple sclerosis and asthma.", "url": "https://www.news-medical.net/news/20210310/Researchers-confirm-new-drug-development-route-for-treating-multiple-sclerosis-asthma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2021-03-10T09:54:00Z", "content": "Brazilian researchers who study a native venomous fish have confirmed a route to drug development for the treatment of chronic inflammatory diseases such as multiple sclerosis and asthma.\r\nThe venomo… [+6300 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Immune Cell Implicated in Post-Viral Lung Disease - Technology Networks", "description": "Scientists have implicated a type of immune cell in the development of chronic lung disease that is sometimes triggered following a respiratory viral infection. The evidence suggests that activation of this immune cell serves as an early switch that, when act…", "url": "https://www.technologynetworks.com/immunology/news/immune-cell-implicated-in-post-viral-lung-disease-346496", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/immune-cell-implicated-in-post-viral-lung-disease-346496.jpg?cb=20210310", "publishedAt": "2021-03-10T09:44:35Z", "content": "Scientists at Washington University School of Medicine in St. Louis have implicated a type of immune cell in the development of chronic lung disease that sometimes is triggered following a respirator… [+4058 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "10,000 Trees Planted by Labconco for Protector Echo Filtered Fume Hoods Program - News-Medical.net", "description": "Labconco reached a major milestone with their green initiative to plant a grove of trees for every Protector Echo Filtered Fume Hood that’s ordered.", "url": "https://www.news-medical.net/news/20210310/10000-Trees-Planted-by-Labconco-for-Protector-Echo-Filtered-Fume-Hoods-Program.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/6/Chem_Lab_c618f8c3be2845828afd242b15eaaa94-620x480.jpg", "publishedAt": "2021-03-10T08:18:00Z", "content": "Labconco reached a major milestone with their green initiative to plant a grove of trees for every Protector Echo Filtered Fume Hood that’s ordered. In partnership with the National Arbor Day Foundat… [+1970 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Deforestation may cause initial increase in malaria infections across Southeast Asia - News-Medical.Net", "description": "Deforestation may cause an initial increase in malaria infections across Southeast Asia before leading to later decreases, a study published today in eLife suggests.", "url": "https://www.news-medical.net/news/20210310/Deforestation-may-cause-initial-increase-in-malaria-infections-across-Southeast-Asia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Malaria_3-620x480.jpg", "publishedAt": "2021-03-10T06:42:00Z", "content": "Deforestation may cause an initial increase in malaria infections across Southeast Asia before leading to later decreases, a study published today in eLife suggests.\r\nThe results may help malaria con… [+2808 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 pandemic caused changes in people’s physical activity levels and wellbeing - News-Medical.Net", "description": "According to an international study published in Frontiers in Psychology, people around the world have reported changes in their physical activity levels, wellbeing, and eating habits during the first stages of the COVID-19 pandemic.", "url": "https://www.news-medical.net/news/20210310/COVID-19-pandemic-caused-changes-in-peoplee28099s-physical-activity-levels-and-wellbeing.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2021-03-10T06:40:00Z", "content": "According to an international study published in Frontiers in Psychology, people around the world have reported changes in their physical activity levels, wellbeing, and eating habits during the firs… [+2992 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New compound can reduce overactivation without impairing the body's immunity response - News-Medical.Net", "description": "When the body detects a pathogen, such as bacteria or viruses, it mounts an immune system response to fight this invader. In some people, the immune system overreacts, resulting in an overactive immune response that causes the body to injure itself, which may…", "url": "https://www.news-medical.net/news/20210310/New-compound-can-reduce-overactivation-without-impairing-the-bodys-immunity-response.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_3f4ba59f12944a08a08f3d596bed291c-620x480.jpg", "publishedAt": "2021-03-10T06:31:00Z", "content": "When the body detects a pathogen, such as bacteria or viruses, it mounts an immune system response to fight this invader. In some people, the immune system overreacts, resulting in an overactive immu… [+4048 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Janine Graham", "title": "The Informer: A global COVID passport? Yeah, nah - Camden Haven Courier", "description": "Let The Informer keep you up-to-date with what you need to know today.", "url": "https://www.canberratimes.com.au/story/7160476/a-global-covid-passport-yeah-nah/", "urlToImage": "https://www.camdencourier.com.au/images/transform/v1/crop/frm/GJZ5TVpAk84wrTzsQfLQRB/cb39bddc-f25f-44b9-8919-50225ccb90d8.png/r4_0_1597_900_w1200_h678_fmax.jpg", "publishedAt": "2021-03-10T06:30:00Z", "content": "We know how much Aussies enjoy humbly slapping themselves on the back, but when America's top infectious disease expert joins in, it's really something to behold.\r\nDr Anthony Fauci joined the metapho… [+3047 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "SARS-CoV-2 and pediatric solid organ transplantation: Current knowns and unknowns - DocWire News", "description": "Pediatr Transplant. 2021 Mar 10:e13986. doi: 10.1111/petr.13986. Online ahead of print.ABSTRACTThe COVID-19 pandemic has proven to be a challenge in", "url": "https://www.docwirenews.com/abstracts/sars-cov-2-and-pediatric-solid-organ-transplantation-current-knowns-and-unknowns/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2021-03-10T06:00:00Z", "content": "Pediatr Transplant. 2021 Mar 10:e13986. doi: 10.1111/petr.13986. Online ahead of print.\r\nABSTRACT\r\nThe COVID-19 pandemic has proven to be a challenge in regard to the clinical presentation, preventio… [+850 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Rising cost of antiparasitic drugs in U.S increases patient costs, may reduce quality of care - News-Medical.Net", "description": "New study finds the skyrocketing cost of drugs in U.S. used to treat hookworm and other soil-transmitted parasites increases patient costs, suggests decreased quality of care.", "url": "https://www.news-medical.net/news/20210310/Rising-cost-of-antiparasitic-drugs-in-US-increases-patient-costs-may-reduce-quality-of-care.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/shutterstock_451845385_6205019579c340faaf9d264ea4fd6db6-620x480.jpg", "publishedAt": "2021-03-10T05:51:00Z", "content": "New study finds the skyrocketing cost of drugs in U.S. used to treat hookworm and other soil-transmitted parasites increases patient costs, suggests decreased quality of care\r\nA new study finds that … [+2291 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Home delivery of HIV medicines could increase ART adherence, viral suppression - News-Medical.Net", "description": "Home delivery of HIV medicines in South Africa significantly increased viral suppression compared to those who received clinical care, according to a study by researchers at the University of Washington School of Medicine.", "url": "https://www.news-medical.net/news/20210310/Home-delivery-of-HIV-medicines-could-increase-ART-adherence-viral-suppression.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/HIV-620x480.jpg", "publishedAt": "2021-03-10T05:28:00Z", "content": "Home delivery of HIV medicines in South Africa significantly increased viral suppression compared to those who received clinical care, according to a study by researchers at the University of Washing… [+2062 chars]"}, {"source": {"id": null, "name": "Bay939.com.au"}, "author": "Adam Spencer", "title": "Warning as gastro outbreaks double in Childcare centres - Bay 93.9", "description": "Outbreaks of gastro in Greater Geelong have doubled compared to the same time last year.   21 cases have been reported in local child care faciliti...", "url": "https://www.bay939.com.au/news/local-news/125181-warning-as-gastro-outbreaks-double-in-childcare-centres", "urlToImage": "https://www.bay939.com.au/images/2021_Newsroom/March_2021/Childcare_generic_Pixabay.jpg", "publishedAt": "2021-03-10T05:05:08Z", "content": "Outbreaks of gastro in Greater Geelong have doubled compared to the same time last year.\r\n21 cases have been reported in local child care facilities so far this year, along with 1 in an aged care fac… [+1313 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New strategy may solve challenges associated with \"healthcare big data\" - News-Medical.Net", "description": "The efficient provision of medical care is integral to society. Over time, the healthcare industry has tapped into modern technology in order to keep up its quality of service.", "url": "https://www.news-medical.net/news/20210310/New-strategy-may-solve-challenges-associated-with-healthcare-big-data.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/HEALTHCARE_shutterstock_493063267_99928a5e003043f896998f01b025b9f6-620x480.jpg", "publishedAt": "2021-03-10T05:01:00Z", "content": "The efficient provision of medical care is integral to society. Over time, the healthcare industry has tapped into modern technology in order to keep up its quality of service. This has, unsurprising… [+3242 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New study assesses the effects of one versus two doses of COVID-19 vaccine - News-Medical.Net", "description": "While receiving just one dose of a two-dose SARS-CoV-2 vaccine tends to decrease infections in the short-term if it produces a strong immune response, it may increase the potential for the virus to \"escape\" therapies in the longer-term if one-dose vaccinal im…", "url": "https://www.news-medical.net/news/20210309/New-study-assesses-the-effects-of-one-versus-two-doses-of-COVID-19-vaccine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2021-03-10T04:28:00Z", "content": "While receiving just one dose of a two-dose SARS-CoV-2 vaccine tends to decrease infections in the short-term if it produces a strong immune response, it may increase the potential for the virus to \"… [+2351 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Coalition for Epidemic Preparedness Innovations launches $3.5 billon strategy to develop new vaccines within 100 days - ABC News", "description": "An international coalition sets out what it calls a \"moonshot\" plan to ensure the development of new vaccines against COVID-19 and emerging epidemics within 100 days.", "url": "https://www.abc.net.au/news/2021-03-10/cepi-plan-100-day-target-for-new-coronavius-disease-vaccines/13233836", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e4b26be299c0161796945b26dea2d494?impolicy=wcms_crop_resize&cropH=576&cropW=1023&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2021-03-10T03:57:33Z", "content": "An international coalition has set out what it calls a \"moonshot\" plan to ensure the development of new vaccines against emerging epidemics within 100 days.\r\nKey points:\r\n<ul><li>CEPI says more needs… [+2654 chars]"}, {"source": {"id": null, "name": "The Advertiser"}, "author": null, "title": "‘Very concerning’: COVID wastewater mystery deepens - The Advertiser", "description": "Subscribe to The Advertiser to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.adelaidenow.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-03-10T01:35:02Z", "content": null}, {"source": {"id": null, "name": "Standard.net.au"}, "author": "Tim Dornin", "title": "Five new virus vaccine clinics open in SA - Warrnambool Standard", "description": "Five new clinics to administer COVID-19 vaccines have opened across South Australia in a major escalation of its rollout. Clinics opened on Wednesday at an Ad...", "url": "https://www.standard.net.au/story/7161137/five-new-virus-vaccine-clinics-open-in-sa/", "urlToImage": "https://www.standard.net.au/images/transform/v1/crop/frm/silverstone-feed-data/c6718891-f011-427e-b957-b8db35db17f2.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-03-10T01:31:10Z", "content": ""}]}