{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Alternative anti-HIV strategy generates promising results in a phase I clinical trial - News-Medical.Net", "description": "vaccines against the virus, but unfortunately, HIV has numerous defense mechanisms that prevent a person's immune system from mounting an effective response following HIV vaccination.", "url": "https://www.news-medical.net/news/20220411/Alternative-anti-HIV-strategy-generates-promising-results-in-a-phase-I-clinical-trial.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Antibody-620x480.jpg", "publishedAt": "2022-04-12T02:13:00Z", "content": "Since the first reports of HIV infection in the early 1980s, multiple clinical trials have tested potential vaccines against the virus, but unfortunately, HIV has numerous defense mechanisms that pre… [+3916 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Vaccine safety — from subjective self-reports to physiological data — ScienceDaily - Verve Times", "description": "A new study from Tel Aviv University enables developers, for the first time in the world, to determine vaccine safety via smart sensors that measure objective physiological parameters. According to the researchers, most clinical trials testing the sa", "url": "https://vervetimes.com/vaccine-safety-from-subjective-self-reports-to-physiological-data-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-12T02:09:16Z", "content": "A new study from Tel Aviv University enables developers, for the first time in the world, to determine vaccine safety via smart sensors that measure objective physiological parameters. According to t… [+3166 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "Reuters", "title": "Britain widens access to Pfizer COVID drug - The West Australian", "description": "As the UK continues to develop plans for living with COVID-19, access to an oral antiviral treatment has been made available to thousands more people.", "url": "https://thewest.com.au/news/coronavirus/britain-widens-access-to-pfizer-covid-drug-c-6420354", "urlToImage": "https://images.thewest.com.au/publication/C-6420354/7c56a5f40713610772fda245a8255833219b1216-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-04-12T02:04:00Z", "content": "Britain will expand access to Pfizer's oral antiviral COVID-19 treatment to thousands more people by adding it to a trial to assess how best to use the drug in its highly vaccinated population.\r\nPaxl… [+1548 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Children older than 5 at higher risk of COVID-19-related multisystem inflammatory syndrome - EurekAlert", "description": "A new study found that older children and those with high blood markers for inflammation (ferritin) were at highest risk of severe multisystem inflammatory syndrome in children (MIS-C) and admission to the intensive care unit (ICU). The research is published …", "url": "https://www.eurekalert.org/news-releases/948794", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-12T02:01:54Z", "content": "A new study found that older children and those with high blood markers for inflammation (ferritin) were at highest risk of severe multisystem inflammatory syndrome in children (MIS-C) and admission … [+2200 chars]"}, {"source": {"id": null, "name": "Russh.com"}, "author": null, "title": "What causes itchy skin? Treatment, triggers and what to use - RUSSH", "description": "What causes itchy skin and how can it be rectified? A common concern felt by many of us. Here, we provide simple solutions.", "url": "https://www.russh.com/what-causes-itchy-skin/", "urlToImage": "https://www.russh.com/wp-content/uploads/2022/04/sdfghjk.jpg", "publishedAt": "2022-04-12T01:39:17Z", "content": "Itchy skin is something we have likely all experienced at one time of the year, yet the cause can sometimes be a mystery if you are not accustomed to it occurring. While sometime it is caused from a … [+3886 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Study results identify reason for why older adults are significantly more susceptible to infectious disease... - Verve Times", "description": "A new study, led by researchers from the University of California, Irvine, identifies a reason for why older adults are significantly more susceptible to infectious diseases than younger people, a critical societal issue most recently exemplified by", "url": "https://vervetimes.com/study-results-identify-reason-for-why-older-adults-are-significantly-more-susceptible-to-infectious-diseases-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-12T01:21:47Z", "content": "A new study, led by researchers from the University of California, Irvine, identifies a reason for why older adults are significantly more susceptible to infectious diseases than younger people, a cr… [+3530 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": "Kristine Tarbert", "title": "Should I get the flu shot in 2022, and when is the best time? Your biggest questions, answered - 9Honey | Coach", "description": "", "url": "https://coach.nine.com.au/lifecoach/flu-vaccine-should-i-get-it-best-time-to-get-jab-how-effective-expert-explains/f7a1e1cb-ff7a-4376-a2cc-c53255ff81da", "urlToImage": "https://imageresizer.static9.net.au/-c89XzThg6mklLQOufWhtxWyeqc=/0x37:8256x4681/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fc412a95f-eabf-4cf4-a323-6773b6bcaffa", "publishedAt": "2022-04-12T00:24:19Z", "content": "As the weather gets colder, people are being encouraged to book in for their influenza vaccines, also known as flu jabs or flu shots.\r\nIf you're eligible, you can get the influenza vaccine for free u… [+7349 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Lung cancer drug could improve survival rates for bladder cancer patients undergoing chemotherapy - EurekAlert", "description": "Researchers found that adding nintedanib - a targeted cancer growth inhibitor currently used to treat non-small cell lung cancer - to chemotherapy, could significantly improve overall survival rate for bladder cancer patients at one, two and five years.", "url": "https://www.eurekalert.org/news-releases/949286", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-12T00:18:08Z", "content": "**Strictly under embargo until 23:30 (BST) Monday 11 April 2022**\r\n<ul><li>Phase two randomised placebo controlled trial (NEOBLADE) showed giving patients nintedanib, as well as chemotherapy before s… [+4688 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Headaches: are you one of the one in six people suffering today? - The Guardian", "description": "Study finds 7% of global population experience migraine and 9% a tension-type headache on any given day", "url": "https://amp.theguardian.com/lifeandstyle/2022/apr/12/headaches-are-you-one-of-the-one-in-six-people-suffering-today", "urlToImage": "https://i.guim.co.uk/img/media/77f2bbcad1f26e250066651f4b6ca1a260e71023/0_208_6266_3762/master/6266.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3039ccdb42627cdd02ec735375dd959a", "publishedAt": "2022-04-12T00:00:00Z", "content": "Almost one in six people around the world have a headache on any given day, with about half of those experiencing a migraine, researchers have found.\r\nHeadache disorders can be painful and debilitati… [+3390 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers make progress to develop a drug for treating metabolic syndrome - News-Medical.Net", "description": "Metabolic syndrome increases a person's risk for diabetes, heart disease, and stroke, and includes conditions such as obesity, high blood pressure and high blood sugar.", "url": "https://www.news-medical.net/news/20220411/Researchers-make-progress-to-develop-a-drug-for-treating-metabolic-syndrome.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/High_Blood_Pressure-620x480.jpg", "publishedAt": "2022-04-11T23:59:00Z", "content": "Metabolic syndrome increases a person's risk for diabetes, heart disease, and stroke, and includes conditions such as obesity, high blood pressure and high blood sugar. In a recent mouse-model study,… [+3572 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Magic mushroom compound helps to 'open up' depressed people's brains after use - News-Medical.Net", "description": "Psilocybin, the psychedelic compound found in magic mushrooms, helps to \"open up\" depressed people's brains, even after use, enabling brain regions to talk more freely to one another.", "url": "https://www.news-medical.net/news/20220411/Magic-mushroom-compound-helps-to-open-up-depressed-peoples-brains-after-use.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/depression-620x480.jpg", "publishedAt": "2022-04-11T23:55:00Z", "content": "Psilocybin, the psychedelic compound found in magic mushrooms, helps to \"open up\" depressed people's brains, even after use, enabling brain regions to talk more freely to one another.\r\nThese are the … [+5866 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "What comes next in the COVID-19 pandemic? - The Lancet", "description": "The COVID-19 pandemic is not over, but with collaboration and solidarity, we can transition\nto a manageable endemic disease state sooner and better mitigate the most severe health\nand socioeconomic impacts. In this third year of pandemic response, society nee…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00580-3/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/pb-assets/Lancet/lancet/ogImg-1592317277397.png", "publishedAt": "2022-04-11T22:31:23Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Maeve McGregor", "title": "Looming winter threat: dual COVID-flu infection - The Examiner", "description": "Experts have levelled criticism at the federal government's flagged shift in the way COVID-19 deaths are reported, warning...", "url": "https://www.thecourier.com.au/story/7695938/ballarats-looming-winter-threat-dual-covid-flu-infection/", "urlToImage": "https://www.examiner.com.au/images/transform/v1/crop/frm/154038149/6f337f8e-ccc0-4168-ba85-eb0cfdd2aa25.JPG/r0_311_4344_2592_w1200_h630_fmax.jpg", "publishedAt": "2022-04-11T21:43:06Z", "content": "Experts have levelled criticism at the federal government's flagged shift in the way COVID-19 deaths are reported, warning it would reinforce the common misconception the pandemic is over."}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "HealthWatch: Allergy Sufferers Could Be At Higher Risk For Heart Disease; Caffeine Could Improve Cer - CBS Boston", "description": "Dr. Mallika Marshall is here to explain two new medical studies.", "url": "https://www.youtube.com/watch?v=Ic8--ICEXu4", "urlToImage": "https://i.ytimg.com/vi/Ic8--ICEXu4/hqdefault.jpg", "publishedAt": "2022-04-11T21:40:27Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Eliza Bliss-Moreau, Joey Charbonneau", "title": "Monkeys can sense their own heartbeats, an ability tied to mental health, consciousness and memory in humans - The Conversation", "description": "Researchers used a test designed for babies to show that rhesus monkeys can sense their own heartbeats. The finding opens up important paths of research into consciousness and mental health issues.", "url": "https://theconversation.com/monkeys-can-sense-their-own-heartbeats-an-ability-tied-to-mental-health-consciousness-and-memory-in-humans-181128", "urlToImage": "https://images.theconversation.com/files/457499/original/file-20220411-16-s3gwnp.jpg?ixlib=rb-1.1.0&rect=0%2C345%2C1470%2C734&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-04-11T21:10:11Z", "content": "The Research Brief is a short take about interesting academic work.\r\nThe big idea\r\nRhesus monkeys have a sense of when their own hearts are beating, according to new research we conducted.\r\nSensing o… [+3990 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "A Single HPV Shot Protects Against Cancer-Causing Virus, Major Study Finds - Gizmodo Australia", "description": "A single shot may be enough to provide highly effective protection against the human papillomavirus (HPV) and its long-term cancer...", "url": "https://www.gizmodo.com.au/2022/04/a-single-hpv-shot-protects-against-cancer-causing-virus-major-study-finds/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/04/12/608e522e836874ac7d5ba072f5b45d5e.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-11T21:00:00Z", "content": "A single shot may be enough to provide highly effective protection against the human papillomavirus (HPV) and its long-term cancer risks, new clinical research from Africa has found. The study found … [+5152 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "International study finds heart inflammation rare among people hospitalized with COVID-19 - Medical Xpress", "description": "Acute myocarditis, inflammation of the heart muscle typically triggered by a virus, occurred in about two out of every 1,000 people hospitalized with COVID-19, and was associated with more severe illness and complications in people with COVID-19, especially a…", "url": "https://medicalxpress.com/news/2022-04-international-heart-inflammation-rare-people.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/heart-disease-2.jpg", "publishedAt": "2022-04-11T19:43:25Z", "content": "Acute myocarditis, inflammation of the heart muscle typically triggered by a virus, occurred in about two out of every 1,000 people hospitalized with COVID-19, and was associated with more severe ill… [+5140 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "UMass Amherst ensemble model most accurate for predicting COVID-19 deaths: Forecast Hub is largest-ever infectious disease prediction project - Science Daily", "description": "The U.S. COVID-19 Forecast Hub, a collaborative research consortium, has generated the most consistently accurate predictions of pandemic deaths at the state and national level, according to a new paper. Every week since early April 2020, this international e…", "url": "https://www.sciencedaily.com/releases/2022/04/220411142416.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-11T19:42:18Z", "content": "The University of Massachusetts Amherst-based U.S. COVID-19 Forecast Hub, a collaborative research consortium, has generated the most consistently accurate predictions of pandemic deaths at the state… [+5599 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Smoking increased in those trying to quit during COVID-19, study shows - Science Daily", "description": "A study showed statistically significant and potentially clinically important differences between those who increased and decreased tobacco use during the pandemic. Among current smokers, 28.2 percent reported increased tobacco use, 17.3 percent reported decr…", "url": "https://www.sciencedaily.com/releases/2022/04/220411101404.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-11T19:41:34Z", "content": "While smoking rates have declined dramatically in the United States, there are still 35 million smokers. There are few data about whether, and if so, how current cigarette smoking habits among those … [+5579 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Black older adults with cancer more likely to be frail, have functional impairments - Healio", "description": "Older Black adults with newly diagnosed gastrointestinal malignancies appeared more likely to be frail and report functional impairments than their white counterparts, according to study results published in Cancer. \n      &ldquo;Despite advances in cancer th…", "url": "https://www.healio.com/news/hematology-oncology/20220411/black-older-adults-with-cancer-more-likely-to-be-frail-have-functional-impairments", "urlToImage": "https://www.healio.com/~/media/images/fscss/i3wyanokecdncom/healio_safe_image.png", "publishedAt": "2022-04-11T19:25:58Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nOlder Black adults with newly diagnosed … [+3746 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Eileen Mary Holowka, Maria Kathryn Tomlinson, Mie Kusk Søndergaard, Ulrik Bak Kirk", "title": "Endometriosis: How advocacy, awareness and algorithms could shorten the long wait for diagnosis and treatment - The Conversation Indonesia", "description": "People living with endometriosis wait an average of 7.5 years for a diagnosis. Social science researchers are working to identify ways to help reduce this timeline.", "url": "https://theconversation.com/endometriosis-how-advocacy-awareness-and-algorithms-could-shorten-the-long-wait-for-diagnosis-and-treatment-178591", "urlToImage": "https://images.theconversation.com/files/456541/original/file-20220406-22-icfn7.jpg?ixlib=rb-1.1.0&rect=0%2C59%2C5657%2C2824&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-04-11T19:01:35Z", "content": "Endometriosis affects an estimated 200 million people worldwide. Despite its prevalence, those living with the disease often wait an average of 7.5 years between start of symptoms and diagnosis. This… [+6284 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Igor Bonifacic", "title": "Researchers create bacteria that could protect your gut from antibiotics - Yahoo Finance Australia", "description": "Scientists have developed a “living cellular therapeutic device” that promises to protect humans from the harmful side effects antibiotics can have on our...", "url": "https://au.finance.yahoo.com/news/wyss-institute-living-cellular-therapeutic-device-175604690.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/._DceK4B6v.7l2vqFSCwBg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2022-04/11661e80-b9bf-11ec-bfdd-9a93146c2f4f", "publishedAt": "2022-04-11T17:56:04Z", "content": "In 1928, Scottish microbiologist Alexander Fleming discovered what we know today as penicillin. Flemings work and that of his successors would go on to forever change how we treat bacterial infection… [+2253 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New instrument will help Columbia scientists to study heavy ion radiation therapy - News-Medical.Net", "description": "Heavy ions could radically improve radiation therapy for treatment of pancreatic cancer and other difficult-to-treat tumors if researchers can better understand how the ions work against cancer.", "url": "https://www.news-medical.net/news/20220411/New-instrument-will-help-Columbia-scientists-to-study-heavy-ion-radiation-therapy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2015/3/Pancreatic_Cancer_89a89cdc7f804d5b8329b646f86bbec6-620x480.jpg", "publishedAt": "2022-04-11T17:52:00Z", "content": "Heavy ions could radically improve radiation therapy for treatment of pancreatic cancer and other difficult-to-treat tumors if researchers can better understand how the ions work against cancer.\r\nA n… [+4479 chars]"}, {"source": {"id": null, "name": "Thebeet.com"}, "author": "maxwellrabb", "title": "Plant-Based Eating Can Lower Type 2 Diabetes Risk, Study Shows - The Beet", "description": "A new report revealed that a plant-based diet correlated with lower risk levels for Type 2 diabetes.", "url": "https://thebeet.com/plant-based-diet-diabetes-study/", "urlToImage": "https://townsquare.media/site/959/files/2022/04/attachment-GettyImages-1178925353.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2022-04-11T17:51:58Z", "content": "Type 2 diabetes poses a threat to millions of people worldwide as rates of the debilitating illness grow exponentially. In 2000, over 150 million cases were diagnosed, which has now risen to more tha… [+4205 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Photocatalysts with built-in electric field helps to remove pollutants from water - Verve Times", "description": "The prepared CdTeQDs/2DBWO photocatalyst with different proportions. Credit: Yang Pengqi                        A research team led by Prof. Wu Zhengyan from the Hefei Institutes of Ph", "url": "https://vervetimes.com/photocatalysts-with-built-in-electric-field-helps-to-remove-pollutants-from-water/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/photocatalysts-with-bu.jpg", "publishedAt": "2022-04-11T15:58:04Z", "content": "The prepared CdTeQDs/2DBWO photocatalyst with different proportions. Credit: Yang Pengqi\r\nA research team led by Prof. Wu Zhengyan from the Hefei Institutes of Physical Science of the Chinese Academy… [+2159 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Understanding COVID-19 through genome-wide association studies - Nature.com", "description": "Defining the most appropriate phenotypes in genome-wide association studies of COVID-19 is challenging, and two new publications demonstrate how case-control definitions critically determine outcomes and downstream clinical utility of findings.", "url": "https://www.nature.com/articles/s41588-021-00985-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-021-00985-x/MediaObjects/41588_2021_985_Fig1_HTML.png", "publishedAt": "2022-04-11T15:30:47Z", "content": "Defining the most appropriate phenotypes in genome-wide association studies of COVID-19 is challenging, and two new publications demonstrate how case-control definitions critically determine outcomes… [+9922 chars]"}, {"source": {"id": null, "name": "Cancertherapyadvisor.com"}, "author": null, "title": "AI Model Uses EHR Data to Predict Risk of Pancreatic Cancer - Cancer Therapy Advisor", "description": "AI models could enable earlier detection of pancreatic cancer and improve treatment options for patients, according to researchers.", "url": "https://www.cancertherapyadvisor.com/home/news/conference-coverage/american-association-for-cancer-research-aacr/aacr-2022/pancreatic-cancer-ai-model-uses-ehr-data-predict-risk/", "urlToImage": "https://www.cancertherapyadvisor.com/wp-content/uploads/sites/12/2022/04/artificial_intelligence_G_1084580876.jpg", "publishedAt": "2022-04-11T15:15:00Z", "content": "An artificial intelligence (AI) model can use sequential health information from electronic health records (EHRs) to identify patients with a higher risk of developing pancreatic cancer, according to… [+2676 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "iStock", "title": "Covid-19: If you're immunocompromised, keep this in mind - Variety of effects - Economic Times", "description": "The SARs-CoV-2 virus has a variety of effects on our bodies. Some people have a wide range of symptoms, while others are asymptomatic. Some people heal quickly, while others struggle with lasting symptoms. Variety of effects", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/covid-19-if-youre-immunocompromised-keep-this-in-mind/variety-of-effects/slideshow/90783811.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90783811,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2022-04-11T15:07:00Z", "content": "To see your saved stories, click on link hightlighted in bold"}, {"source": {"id": null, "name": "TRT World"}, "author": "TRTWorld", "title": "Can Alzheimer’s be cured? - TRT World", "description": "An unprecedented study could lead to a more precise diagnosis of Alzheimer's as well as new treatments for the disease.", "url": "https://www.trtworld.com/magazine/can-alzheimer-s-be-cured-56265", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/129693_USAalzheimerdrugAP_1649686679873.jpeg", "publishedAt": "2022-04-11T14:49:19Z", "content": "An unprecedented study could lead to a more precise diagnosis of Alzheimer's as well as new treatments for the disease.\r\nScientists have discovered an additional 42 genes connected to the development… [+5062 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Marie Claire Dorking", "title": "Schoolgirl in coma after 'cold' turned out to be meningitis - Yahoo Lifestyle Australia", "description": "Her mother had no idea that what appeared to be a common cold was the life-threatening condition, meningitis.", "url": "https://au.lifestyle.yahoo.com/girl-cold-symptoms-meningitis-144506113.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-04/dc41fbe0-b98a-11ec-bfed-d24b66b0235e", "publishedAt": "2022-04-11T14:45:06Z", "content": "Harri Tuson, now 13, was left fighting for life after contracting meningitis, first thought to be cold symptoms. (Caters)\r\nA schoolgirl was left fighting for her life after her meningitis symptoms we… [+4870 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Study finds vitamin K has protective effects against Alzheimer’s - Play Crazy Game", "description": "In a new study, researchers at AlMaarefa University in Saudi Arabia found that vitamin K (a nutrient found in foods like broccoli, spinach and arugula) has protective effects against the development of neurodegenerative problems such as Alzheimer's disease. N…", "url": "https://playcrazygame.com/2022/04/11/study-finds-vitamin-k-has-protective-effects-against-alzheimers/", "urlToImage": "https://img.olhardigital.com.br/wp-content/uploads/2021/06/Alzheimer-Shutter-e-Atthapon.jpg", "publishedAt": "2022-04-11T14:35:57Z", "content": "In a new study, researchers at AlMaarefa University in Saudi Arabia found that vitamin K (a nutrient found in foods like broccoli, spinach and arugula) has protective effects against the development … [+1906 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Immune To Covid? It’s Possible — But A Medical Mystery | Mint - Mint", "description": "Even when doctors intentionally infected volunteers with Covid, only half the group got sick.", "url": "https://www.livemint.com/science/news/immune-to-covid-it-s-possible-but-a-medical-mystery-11649686077185.html", "urlToImage": "https://images.livemint.com/img/2022/04/11/600x338/covid_1649686404657_1649686404851.jpg", "publishedAt": "2022-04-11T14:15:51Z", "content": "One of the more astonishing things that scientists learned from deliberately exposing volunteers to Covid-19 was that nearly half of them never got infected even when the virus was introduced directl… [+5484 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring evolutionary trajectories of SARS-CoV-2 interacting proteins in bats and primates - News-Medical.Net", "description": "Researchers performed high-throughput evolutionary analyses of genes encoding 334 SARS-CoV-2 viral-interacting proteins of modern humans, primates, and bats.", "url": "https://www.news-medical.net/news/20220411/Exploring-evolutionary-trajectories-of-SARS-CoV-2-interacting-proteins-in-bats-and-primates.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710395_16496842319474044.jpg", "publishedAt": "2022-04-11T14:04:00Z", "content": "In a recent study posted to the bioRxiv* pre-print server, researchers performed high-throughput evolutionary analyses of genes encoding 334 severe acute respiratory syndrome coronavirus 2 (SARS-CoV-… [+5849 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Jill Rosen-Johns Hopkins", "title": "AI predicts if and when you might have a fatal heart attack - Futurity: Research News", "description": "An algorithm that assesses scar patterns in heart tissue can predict potentially life-threatening arrhythmias more accurately than doctors can.", "url": "https://www.futurity.org/heart-attacks-arrhythmia-artificial-intelligence-2723382-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/04/heart_attack_1600.jpg", "publishedAt": "2022-04-11T13:57:24Z", "content": "A new artificial intelligence-based approach can predict if and when a patient could die of a heart attack.\r\nThe technology, built on raw images of patient’s diseased hearts and patient backgrounds, … [+3364 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Anne Trafton", "title": "New tool reveals how immune cells find their targets - Phys.org", "description": "The human body has millions of unique B and T cells that roam the body, looking for microbial invaders. These immune cells' ability to recognize harmful microbes is critical to successfully fighting off infection.", "url": "https://phys.org/news/2022-04-tool-reveals-immune-cells.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-tool-reveals-how-i.jpg", "publishedAt": "2022-04-11T13:13:32Z", "content": "The human body has millions of unique B and T cells that roam the body, looking for microbial invaders. These immune cells' ability to recognize harmful microbes is critical to successfully fighting … [+5929 chars]"}, {"source": {"id": null, "name": "DairyReporter.com"}, "author": "dairyreporter.com", "title": "New HMO study looks to next-generation infant formula - DairyReporter.com", "description": "Human milk oligosaccharides (HMOs) — important groups of carbohydrates in human breast milk — can, in some cases, be secreted in very high concentrations, and still be safe and well-tolerated by infants.", "url": "https://www.dairyreporter.com/Article/2022/04/11/new-hmo-study-looks-to-next-generation-infant-formula", "urlToImage": "https://www.dairyreporter.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/dairyreporter.com/news/ingredients/new-hmo-study-looks-to-next-generation-infant-formula/15320311-1-eng-GB/New-HMO-study-looks-to-next-generation-infant-formula.jpg", "publishedAt": "2022-04-11T10:55:00Z", "content": "This is the conclusion of a new study by global bioscience company Chr. Hansen, published in Food and Chemical Toxicology.\r\nThe review compiles data from several dozens of observational peer-reviewed… [+1303 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Blood tests may show markers of mental disorders, study says - Play Crazy Game", "description": "A new study points out that routine blood tests may indicate biological markers for mental disorders such as depression, anorexia and schizophrenia. With this, the researchers believe it makes it clear that mental health also influences physical health. The s…", "url": "https://playcrazygame.com/2022/04/11/blood-tests-may-show-markers-of-mental-disorders-study-says/", "urlToImage": "https://img.olhardigital.com.br/wp-content/uploads/2021/07/Homem-triste-no-corredor.jpg", "publishedAt": "2022-04-11T10:12:07Z", "content": "A new study points out that routine blood tests may indicate biological markers for mental disorders such as depression, anorexia and schizophrenia. With this, the researchers believe it makes it cle… [+1591 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Human Lung Chip Helps To Identify Potential Treatments for Respiratory Diseases - Technology Networks", "description": "Research has revealed that the constant pattern of stretching and relaxing caused by breathing generates immune responses against invading viruses.", "url": "https://www.technologynetworks.com/cell-science/news/human-lung-chip-helps-to-identify-potential-treatments-for-respiratory-diseases-360511", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/360511/human-lung-chip-helps-to-identify-potential-treatments-for-respiratory-diseases-360511-640x360.jpg?cb=20220411", "publishedAt": "2022-04-11T09:12:23Z", "content": "The average person will take more than 600 million breaths over the course of their life. Every breath stretches the lungs tissues with each inhale and relaxes them with each exhale. The mere motions… [+11588 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": "Heidi Krause", "title": "'A living hell': The pregnancy condition leaving women bedridden and unable to function - 9Honey", "description": "'I was vomiting 20 times a day'", "url": "https://honey.nine.com.au/parenting/pregnancy-hyperemesis-gravidarum-nausea-vomiting-caitlins-story/ececce89-b989-4776-ae97-6f17794780fc", "urlToImage": "https://imageresizer.static9.net.au/4AbWi4cuBNY0Ad1Uvlcebe9rUO0=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F4d79dad4-8ddc-4d8a-a352-2aa83eb80b48", "publishedAt": "2022-04-11T06:01:07Z", "content": "Imagine that all the things you enjoy doing have been taken away. And in their place all that is left is crippling nausea, constant vomiting, food and smell aversions, anxiety, depression and suicida… [+9065 chars]"}, {"source": {"id": null, "name": "Racgp.org.au"}, "author": null, "title": "newsGP - Preventable risk factors in childhood linked with midlife CVD - RACGP", "description": "Five childhood risk factors, individually or combined, have been identified as predictors of fatal and non-fatal cardiovascular events in adulthood.", "url": "https://www1.racgp.org.au/newsgp/clinical/preventable-risk-factors-in-childhood-linked-with", "urlToImage": "https://www1.racgp.org.au/getattachment/19444beb-9027-4d41-9525-8e87de43a6eb/Preventable-risk-factors-in-childhood-linked-with.aspx", "publishedAt": "2022-04-11T05:07:04Z", "content": "News\r\nFive childhood risk factors, individually or combined, have been identified as predictors of fatal and non-fatal cardiovascular events in adulthood.\r\nHigh body mass index was one of five risk f… [+3222 chars]"}, {"source": {"id": null, "name": "Beef Central"}, "author": null, "title": "Lumpy Skin decision \"sensible and pragmatic\": Cattle Council - Beef Central", "description": "Cattle Council of Australia has commended the Australian Government’s decision to give the CSIRO everything it needs to test and develop effective vaccines to manage Lumpy Skin Disease...Read More", "url": "https://www.beefcentral.com/news/lumpy-skin-decision-sensible-and-pragmatic-cattle-council/", "urlToImage": "https://www.beefcentral.com/wp-content/uploads/2020/11/Markus-Rathsmann-1.jpg", "publishedAt": "2022-04-11T04:31:01Z", "content": "Cattle Council of Australia has commended the Australian Governments decision to give the CSIRO everything it needs to test and develop effective vaccines to manage Lumpy Skin Disease.The Federal Gov… [+1346 chars]"}, {"source": {"id": null, "name": "Perthisok.com"}, "author": null, "title": "Ice Baths, Meditation And Infrared Saunas: This New-Age Coworking Space Is Open Today - Perth Is OK!", "description": "Combining the ultimate in wellness with the convenience of coworking, Vitality House is West Leederville's latest lifestyle destination. The space aims to", "url": "https://perthisok.com/news/vitality-house/", "urlToImage": "https://perthisok.com/wp-content/uploads/2022/04/vitality-house.jpg", "publishedAt": "2022-04-11T03:01:08Z", "content": "Combining the ultimate in wellness with the convenience of coworking, Vitality House is West Leederville’s latest lifestyle destination.\r\nThe space aims to revolutionise coworking, offering a combina… [+959 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Here’s What We Know About Deltacron, the Latest COVID Variant to Reach Australia - Lifehacker Australia", "description": "A new COVID-19 variant that combines both the Delta and Omicron strains has been detected in Australia. Here's what we know about Deltacron.", "url": "https://www.lifehacker.com.au/2022/04/deltacron-covid-19-variant-explainer/", "urlToImage": "https://imgix.lifehacker.com.au/content/uploads/sites/4/2022/04/11/deltacron.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-11T02:04:00Z", "content": "We’re into our third year of the pandemic and it’s far from over. We’re in a much better position than we were two years ago thanks to the rollout of vaccines but new variants of COVID-19 continue to… [+3159 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The effect of unsuppressed HIV on T-cell response to COVID-19 - News-Medical.Net", "description": "A new study evaluates the impact of HIV infection on SARS-CoV-2 T-cell responses during the first and second waves of COVID-19 in South Africa.", "url": "https://www.news-medical.net/news/20220410/The-effect-of-unsuppressed-HIV-on-T-cell-response-to-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710327_16496351772217224.jpg", "publishedAt": "2022-04-11T01:56:00Z", "content": "Scientists have developed several pharmaceutical and non-pharmaceutical interventions to contain the current coronavirus disease 2019 (COVID-19) pandemic, which is caused by the rapid outbreak of the… [+6460 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Brain charts show changing morphology by age - News-Medical.Net", "description": "A new study develops utilizes neuroimages to understand how the brain grows, develops, and matures with age.", "url": "https://www.news-medical.net/news/20220410/Brain-charts-show-changing-morphology-by-age.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710323_16496302675624268.jpg", "publishedAt": "2022-04-11T01:33:00Z", "content": "While growth charts exist for height and weight, no such standards are available to compare neuroimaging results by the individual’s age. Just as growth charts became the cornerstone of assessing gro… [+9821 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Richie Poulton et. al, The Conversation", "title": "A Key Detail in Some People's Childhoods May Lead to Vaccine Resistance, Study Finds - ScienceAlert", "description": "Most people welcomed the opportunity to get vaccinated against COVID-19, yet a non-trivial minority did not. Vaccine-resistant people tend to hold strong views and assertively reject conventional medical or public health recommendations. This is puzz", "url": "https://www.sciencealert.com/a-key-detail-in-some-people-s-childhoods-may-lead-to-vaccine-resistance-study-finds", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/ToddlerSunKissingHisMumAtACafe_1024.jpg", "publishedAt": "2022-04-11T01:29:05Z", "content": "Most people welcomed the opportunity to get vaccinated against COVID-19, yet a non-trivial minority did not. Vaccine-resistant people tend to hold strong views and assertively reject conventional med… [+8586 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Qld researchers launch world-first wireless brain treatment - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://dsf.newscorpaustralia.com/couriermail/subscription/", "urlToImage": null, "publishedAt": "2022-04-10T22:41:13Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson", "title": "The next leap in coronavirus vaccine development could be a nasal spray - The Washington Post", "description": "Sobered by the way the omicron variant tore through the population -- including the vaccinated -- some scientists think the next coronavirus vaccine should be a spray up the nose.", "url": "https://www.washingtonpost.com/health/2022/04/10/nasal-covid-vaccine/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IVNIWTFEOMI6ZBRIHWSPVD4HCQ.jpg&w=1440", "publishedAt": "2022-04-10T22:01:13Z", "content": "As the omicron variant of the coronavirus moved lightning-fast around the world, it revealed an unsettling truth. The virus had gained a stunning ability to infect people, jumping from one persons no… [+11982 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": null, "title": "Post-COVID fatigue: When should you worry and what to do about it – expert reveals - Revyuh", "description": "Fatigue is more than just being tired or drowsy. It's a feeling of tiredness that remains despite rest or adequate sleep. It's most likely due to our", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/post-covid-fatigue-when-should-you-worry-and-what-to-do-about-it-expert-reveals/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/04/Post-COVID-fatigue-When-should-you-worry-and-what-to-do-about-it-expert-reveals.jpg", "publishedAt": "2022-04-10T21:30:10Z", "content": "Fatigue is more than just being tired or drowsy. It’s a feeling of tiredness that remains despite rest or adequate sleep. \r\nIt’s most likely due to our bodies’ powerful immune response to the coronav… [+3872 chars]"}, {"source": {"id": null, "name": "Men's Health"}, "author": null, "title": "Why A Workout Can Subdue Depression For Up To 75 Minutes - Men's Health", "description": "Moving your body to alleviate mental malaise is a well-established treatment in tackling poor mental health. But while numerous studies have found raising a sweat to be broadly effective at helping bust the blues, just how impactful is a single workout in boo…", "url": "https://www.menshealth.com.au/why-a-workout-can-subdue-depression-for-up-to-75-minutes/", "urlToImage": "https://www.menshealth.com.au/wp-content/uploads/2022/04/fitness-and-mental-health.jpg", "publishedAt": "2022-04-10T20:37:47Z", "content": "Moving your body to alleviate mental malaise is a well-established treatment in tackling poor mental health. But while numerous studies have found raising a sweat to be broadly effective at helping b… [+3649 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers provide insight into anatomical position of the sacral mesh during laparoscopic procedure - News-Medical.Net", "description": "A May 2022 study published in the Diseases of the Colon and Rectum zooms in on the importance of anatomy. Dr. Argeny and colleagues of the Medical University of Vienna, Austria, provide insight into the anatomical position of the mesh in relation to the sacru…", "url": "https://www.news-medical.net/news/20220410/Researchers-provide-insight-into-anatomical-position-of-the-sacral-mesh-during-laparoscopic-procedure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2022-04-10T20:36:00Z", "content": "A May 2022 study published in the Diseases of the Colon and Rectum zooms in on the importance of anatomy. Dr. Argeny and colleagues of the Medical University of Vienna, Austria, provide insight into … [+1492 chars]"}, {"source": {"id": null, "name": "Agedcareguide.com.au"}, "author": "DPS Publishing", "title": "Parkinson's awareness front and centre this April - Talking Aged Care", "description": "Thirty-seven Australians receive a Parkinson's diagnosis every day.\nOn World Parkinson's Day, 11 April…", "url": "https://www.agedcareguide.com.au/talking-aged-care/parkinsons-awareness-front-and-centre-this-april", "urlToImage": "https://www.agedcareguide.com.au/assets/news/articles_resized/large_11_4_2022-Parkinsons-Day.jpg", "publishedAt": "2022-04-10T20:26:34Z", "content": "Parkinson's Disease is a progressive nervous system disorder that can impact a person's movement and mood. It is common for people to get a Parkinson's diagnosis around the age of 65 or older.\r\nOver … [+4749 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Insights into the dynamic ultrastructure of the heart — ScienceDaily - Verve Times", "description": "What happens below the cellular level when the heart contracts and relaxes has long been unexplored. Thanks to new ultra-high-resolution electron microscopy techniques, scientists can now watch the heart beating -- almost at a molecular level. Resear", "url": "https://vervetimes.com/insights-into-the-dynamic-ultrastructure-of-the-heart-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-10T18:20:42Z", "content": "What happens below the cellular level when the heart contracts and relaxes has long been unexplored. Thanks to new ultra-high-resolution electron microscopy techniques, scientists can now watch the h… [+2537 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP/7NEWS", "title": "The drug-resistant bacteria turning UTIs into killers - 7NEWS", "description": "‘Without effective antibiotics, many standard medical procedures and life-saving surgeries will become increasingly life-threatening.’", "url": "https://7news.com.au/news/public-health/bacteria-turning-utis-into-killers-c-6396919", "urlToImage": "https://images.7news.com.au/publication/C-6396919/3824d19301b131d98d34b39ed5d82e895e07bb3a-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-04-10T16:00:00Z", "content": "An increase of drug-resistant bacteria in the community is turning simple illnesses like urinary tract infections into killers.\r\nUTIs affect half of all women and one in 20 men over their lifetimes a… [+1897 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Japanese encephalitis hits NT feral pigs - 7NEWS", "description": "A number of feral pigs in the Northern Territory have been infected with Japanese encephalitis, health authorities say.", "url": "https://7news.com.au/news/nt/japanese-encephalitis-hits-nt-feral-pigs-c-6377598", "urlToImage": "https://images.7news.com.au/publication/C-6377598/27a787b7a3fc7c68c2c34db1d98d23fe56ea5b59-16x9-x0y75w800h450.jpg?imwidth=1200", "publishedAt": "2022-04-10T07:00:00Z", "content": "Health authorities have detected mosquito-borne Japanese encephalitis in feral pigs in the Northern Territory, raising fears for residents in nearby areas.\r\nMore than 30 people across Australia have … [+1553 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "CNN", "title": "Heart attack risk can be lowered by eating avocado, long-term study finds. - 7NEWS", "description": "A study of almost 110,000 people over 30 years has given scientists a good handle on the fruit’s benefits.", "url": "https://7news.com.au/lifestyle/health-wellbeing/eating-two-servings-a-week-of-one-fatty-fruit-can-massively-reduce-heart-attack-risk-c-6363209", "urlToImage": "https://images.7news.com.au/publication/C-6363209/5943f14b70a53919a9b68dc02af00b245c6cd77c-16x9-x0y19w1037h583.png?imwidth=1200", "publishedAt": "2022-04-10T07:00:00Z", "content": "Eating avocados massively reduces the risk of heart attacks in men and women - including when eaten in place of butter, cheese or processed meats - a new long-term study has found.\r\nCardiovascular di… [+4765 chars]"}, {"source": {"id": null, "name": "Mamamia"}, "author": "Anonymous", "title": "\"I can drink coffee\": The 5 lies I’ve told myself about having Irritable Bowel Syndrome. - Mamamia", "description": "A Mamamia writer shares the everyday reality of living with irritable bowel syndrome, including how she manages the symptoms.", "url": "https://www.mamamia.com.au/symptoms-of-irritable-bowel-syndrome/", "urlToImage": "https://new-cdn.mamamia.com.au/mamamia-pwa.appspot.com/cms_images/variations/1200x628.2722513089005-406325051470.jpg?bypass=1", "publishedAt": "2022-04-10T04:30:02Z", "content": "3. It’s all in my head.\r\nSometimes it’s just easier to imagine that I am making this condition up. \r\nThere are days where I have no symptoms and I’m free to do what I want. These days of freedom lull… [+2214 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Prostate cancer: ‘Groundbreaking’ radiotherapy can ‘protect healthy tissue’ - Verve Times", "description": "It is estimated that over 14,000 men in the UK are walking around with undiagnosed prostate cancer. Getting tested for the condition might bring with it the concern of cancer treatment and its sometimes dire side-effects. Radiotherapy works by zappin", "url": "https://vervetimes.com/prostate-cancer-groundbreaking-radiotherapy-can-protect-healthy-tissue/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1593840.jpg", "publishedAt": "2022-04-10T03:18:27Z", "content": "It is estimated that over 14,000 men in the UK are walking around with undiagnosed prostate cancer. Getting tested for the condition might bring with it the concern of cancer treatment and its someti… [+4093 chars]"}]}