{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "The ongoing enigma of SARS‐CoV‐2 and platelet interaction - Wiley", "description": "Since the onset of the global pandemic of coronavirus disease 2019 (COVID-19), there is an urgent need to understand the pathogenesis of the common inflammatory and thrombotic complications associate...", "url": "https://onlinelibrary.wiley.com/doi/full/10.1002/rth2.12642", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/ded2b1ae-89c9-431e-b76b-8a7d07257c32/rth2.v6.1.cover.jpg", "publishedAt": "2022-01-26T00:19:55Z", "content": "1 INTRODUCTION\r\nSevere acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a highly transmissible and pathogenic coronavirus that caused an outbreak of uncommon viral pneumonia called coronaviru… [+25325 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Sarah Berry", "title": "Breakthrough infection: How much immunity does it really give you? - Sydney Morning Herald", "description": "The idea that we are immune from COVID-19 once we’ve been infected doesn’t quite hold true. So, what immunity do we have from reinfection and, how long does it last?", "url": "https://www.smh.com.au/lifestyle/health-and-wellness/breakthrough-infection-how-much-immunity-does-it-really-give-you-20220124-p59qsl.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1859%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_98/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/6bcee9908e3b91bb7c6d036d940abc6b647920df", "publishedAt": "2022-01-26T00:00:00Z", "content": "This is because when our body encounters an infection for the first time, it activates our innate immune response - the one that launches the same response regardless of the invader - to hold the inf… [+4686 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Moira McCarthy", "title": "COVID Vaccines Don't Reduce Fertility During IVF - Healthline", "description": "Researchers report they found no significant differences in fertility and outcomes between vaccinated and unvaccinated people undergoing IVF.", "url": "https://www.healthline.com/health-news/covid-19-vaccines-dont-affect-fertility-for-people-undergoing-ivf-researchers-say", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/01/female-covid-vaccine-1200x628-facebook-1-1200x628.jpg", "publishedAt": "2022-01-25T23:44:20Z", "content": "<ul><li>Researchers say they have found no significant difference between unvaccinated and vaccinated people undergoing in vitro fertilization (IVF) in terms of pregnancy and outcomes.</li><li>They s… [+5509 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "Josh Zimmerman", "title": "Albermale Kemerton COVID-19 outbreak: Australian Manufacturing Workers' Union slams 'industry failure to plan' - The West Australian", "description": "AMWU WA state secretary Steve McCartney has lashed the handling of a COVID-19 outbreak at a South West lithium hydroxide plant, saying hundreds of potentially infected workers were ‘completely in the dark’.", "url": "https://thewest.com.au/news/coronavirus/albermale-kemerton-covid-19-outbreak-australian-manufacturing-workers-union-slams-industry-failure-to-plan-c-5448977", "urlToImage": "https://images.thewest.com.au/publication/C-5448977/b18e5f85cda140f018539c9c1f38f2cd658f0240-16x9-x862y1010w3873h2178.jpg?imwidth=1200", "publishedAt": "2022-01-25T23:32:00Z", "content": "Comments\r\nTo comment on this story and join the conversation, subscribe to The West AustraliansEveryday Digital package.\r\nAre you already a subscriber?"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Victoria Allen", "title": "Men with BRCA2 fault are at DOUBLE the risk of developing disease, study suggests - Daily Mail", "description": "Men with a genetic fault called BRCA2 have double the risk of developing prostate cancer, a study found. A third of men who have the mutation will be diagnosed with this cancer by the age of 85.", "url": "https://www.dailymail.co.uk/news/article-10441637/Men-BRCA2-fault-DOUBLE-risk-developing-disease-study-suggests.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/25/23/53372411-0-image-a-49_1643152614907.jpg", "publishedAt": "2022-01-25T23:21:41Z", "content": "Prostate screening should be offered to thousands of men with a harmful gene mutation that has long been linked to breast cancer, research suggests.\r\nMen who carry a genetic fault called BRCA2 have m… [+2369 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marcia Frellick", "title": "Most COVID ICU Survivors Show Adverse Effects 1 Year Later: Study - Medscape", "description": "Nearly 60% of former ICU patients reported continuing sickness-related problems at work. Three-fourths reported physical problems, and 26% reported mental problems.", "url": "https://www.medscape.com/viewarticle/967257", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220125_covid_icu_patient_doctor_800x450.jpg", "publishedAt": "2022-01-25T22:50:14Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nMost patients with COVID-19 who were treated in an intensive care unit (ICU) show physical, menta… [+5777 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Nicole Lou", "title": "New Rules for Pandemic CPR; HF-Cancer Link; Post-TAVR Infective Endocarditis Tx - MedPage Today", "description": "Recent developments of interest in cardiovascular medicine", "url": "https://www.medpagetoday.com/cardiology/prevention/96853", "urlToImage": "https://assets.medpagetoday.net/media/images/96xxx/96853.jpg", "publishedAt": "2022-01-25T21:00:14Z", "content": "In a guidance update, the American Heart Association (AHA) said healthcare providers should quickly don PPE before performing CPR on people with suspected COVID-19. (Circulation: Cardiovascular Quali… [+3100 chars]"}, {"source": {"id": null, "name": "Areanews.com.au"}, "author": "Mae Anderson", "title": "COVID-19 booster drive faltering in the US - Area News", "description": "The COVID-19 booster drive in the US is losing steam, worrying health experts who have pleaded with Americans to get an extra shot to shore up their protectio...", "url": "https://www.areanews.com.au/story/7595120/covid-19-booster-drive-faltering-in-the-us/", "urlToImage": "https://www.areanews.com.au/images/transform/v1/crop/frm/silverstone-feed-data/97733cc9-e2fd-4f73-8c3b-88d87d3468fd.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2022-01-25T20:37:17Z", "content": ""}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Combined 3D modelling technique predicts abnormal heart rhythms in patients with genetic heart disease: A new, personalised heart modelling approach can predict abnormal heart rhythms and risk of sudden death in patients with hypertrophic cardiomyopat - Science Daily", "description": "Modelling the heart in 3D using combined imaging techniques can help predict heart rhythm abnormalities, or arrhythmias, in patients with the genetic heart disease hypertrophic cardiomyopathy.", "url": "https://www.sciencedaily.com/releases/2022/01/220125112604.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T20:20:28Z", "content": "Modelling the heart in 3D using combined imaging techniques can help predict heart rhythm abnormalities, or arrhythmias, in patients with a genetic heart disease, shows a study published today in eLi… [+2498 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "David S. Kong", "title": "Life Sciences Supermind Report outlines proposed solutions to re-imagine the global health ecosystem — MIT Media Lab - MIT Media Lab", "description": "Collective intelligence methodology identifies key findings to accelerate the pace of innovation and build health resilience.", "url": "https://www.media.mit.edu/articles/life-sciences-supermind-report-outlines-proposed-solutions-to-re-imagine-the-global-health-ecosystem/", "urlToImage": "https://dam-prod.media.mit.edu/thumb/2022/01/25/image1-2.jpg.1400x1400.jpg", "publishedAt": "2022-01-25T20:12:49Z", "content": "The Covid-19 pandemic sent shockwaves through the life science ecosystem, uniting the scientific community with a common purpose and re-imagining pathways to address global health challenges.\r\nTo hel… [+5408 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Emily Crane, NY Post", "title": "Un-vaxxed man cut from transplant list - NEWS.com.au", "description": "<p>A 31-year-old father in the USA has been removed from the heart transplant list at a Boston hospital because he is refusing to get the Covid-19 vaccine, his family said.</p>", "url": "https://www.news.com.au/lifestyle/health/man-removed-from-heart-transplant-list-for-being-unvaccinated/news-story/58f5a8b33ab091207987fd33e15d3c22", "urlToImage": "https://content.api.news/v3/images/bin/def7e04dec3912920a19b399de599d60", "publishedAt": "2022-01-25T20:06:47Z", "content": "A 31-year-old father fighting for his life has been removed from the heart transplant list because he is refusing to get the Covid-19 vaccine.A 31-year-old father in the USA has been removed from the… [+5720 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Using the eye as a window into heart disease - Science Daily", "description": "Scientists have developed an artificial intelligence (AI) system that can analyze eye scans taken during a routine visit to an optician or eye clinic and identify patients at a high risk of a heart attack. Doctors have recognized that changes to the tiny bloo…", "url": "https://www.sciencedaily.com/releases/2022/01/220125112548.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T20:00:24Z", "content": "Scientists have developed an artificial intelligence (AI) system that can analyse eye scans taken during a routine visit to an optician or eye clinic and identify patients at a high risk of a heart a… [+4266 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Most 'pathogenic' genetic variants have a low risk of causing disease - Science Daily", "description": "Researchers discovered that the chance a pathogenic genetic variant may actually cause a disease is relatively low - about 7 percent. They also found that some variants, such as those associated with breast cancer, are linked to a wide range of risks for dise…", "url": "https://www.sciencedaily.com/releases/2022/01/220125112551.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T20:00:24Z", "content": "Imagine getting a positive result on a genetic test. The doctor tells you that you have a \"pathogenic genetic variant,\" or a DNA sequence that is known to raise the chances for getting a disease like… [+4953 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "NBC", "title": "Long COVID update: Who gets long COVID cases, how does it work and how do you test for it? - 7NEWS", "description": "Long COVID, where a sufferer endures symptoms of the virus for weeks, months or even years, has perplexed doctors since the pandemic began.", "url": "https://7news.com.au/lifestyle/health-wellbeing/who-will-get-long-covid-this-test-may-be-able-to-determine-a-persons-risk-c-5447827", "urlToImage": "https://images.7news.com.au/publication/C-5447827/ebc25b43d76cbe022e0dd3c4d6a0db22f6a57726-16x9-x0y0w4745h2669.jpg?imwidth=1200", "publishedAt": "2022-01-25T19:43:00Z", "content": "A blood test may someday help determine a persons risk for long COVID, new research suggests.\r\nThe study, published Tuesday in the journal Nature Communications, found that people who go on to develo… [+4543 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Monish Makena, The Science Advisory Board contributing writer", "title": "Pancreatic stellate cells promote cancer cell proliferation, tumor growth - The Science Board", "description": "Using optical imaging to study metabolic processes as they relate to tumor growth, researchers hope to better understand the tumor microenvironment and potential interventions. New research published on January 21 in <em>Science Advances</em> showed that panc…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=3812", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_imm/2021_11_05_15_16_0602_cancer_pancreatic_20211105153619.jpeg", "publishedAt": "2022-01-25T19:37:27Z", "content": "Pancreatic ductal adenocarcinoma (PDAC) is responsible for 7.3% of all cancer deaths. Even though there is a steady increase in patient survival for most cancers over the decades, the patient surviva… [+2279 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Lucy Sweeney", "title": "As Omicron spreads across the world, what does the future of contact tracing look like? - ABC News", "description": "Digital contact tracing seems to have gone the way of the dinosaurs as the coronavirus pandemic has evolved, but overseas, educators are thinking about new ways to share COVID information that could change the way we approach future outbreaks.", "url": "https://www.abc.net.au/news/2022-01-26/omicron-spread-what-is-the-future-of-contact-tracing/100770948", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/d338f31a527572cb8b8b5278cc5176ea?impolicy=wcms_crop_resize&cropH=2807&cropW=4991&xPos=0&yPos=526&width=862&height=485", "publishedAt": "2022-01-25T19:16:12Z", "content": "While the world has been busy ramping up booster shots and procuring enough tests and masks to handle the ongoing threat of Omicron, another tool once touted as crucial in controlling the spread has … [+12845 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Men who paid for sex more likely than other men to live with HIV - Medical Xpress", "description": "Twenty years' worth of surveys suggest that nearly one in ten sexually active men in 35 countries in sub-Saharan Africa have been clients of sex workers, and these men are about 50 percent more likely to be living with human immunodeficiency virus (HIV). Caro…", "url": "https://medicalxpress.com/news/2022-01-men-paid-sex-hiv.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/men-who-paid-for-sex-m.jpg", "publishedAt": "2022-01-25T19:00:01Z", "content": "Twenty years' worth of surveys suggest that nearly one in ten sexually active men in 35 countries in sub-Saharan Africa have been clients of sex workers, and these men are about 50 percent more likel… [+3129 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New practice guideline addresses diagnosis, treatment of type B aortic dissection - Medical Xpress", "description": "The Society of Thoracic Surgeons (STS) and the American Association for Thoracic Surgery (AATS) released a new clinical practice guideline that includes major recommendations for managing patients with type B aortic dissection (TBAD). The guideline was publis…", "url": "https://medicalxpress.com/news/2022-01-guideline-diagnosis-treatment-aortic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/2-heart.jpg", "publishedAt": "2022-01-25T17:48:58Z", "content": "The Society of Thoracic Surgeons (STS) and the American Association for Thoracic Surgery (AATS) released a new clinical practice guideline that includes major recommendations for managing patients wi… [+6363 chars]"}, {"source": {"id": null, "name": "Massgeneral.org"}, "author": null, "title": "Randomized controlled trial offers insights on how the timing of dinner and genetics affect individuals' blood sugar control - Massachusetts General Hospital", "description": "", "url": "https://www.massgeneral.org/news/press-release/Rct-offers-insights-on-how-timing-of-dinner-and-genetics-affect-blood-sugar-control", "urlToImage": "/assets/MGH/images/_global/MassGeneral-Campus-River.jpg", "publishedAt": "2022-01-25T16:57:23Z", "content": "We decided to test if late eating that usually occurs with elevated melatonin levels results in disturbed blood sugar control.\r\nRicha Saxena, PhDCenter for Genomic Medicine, Massachusetts General Hos… [+5554 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Middle-age spread: it might not be as bad as you think - The Guardian", "description": "According to new data, some obese people are healthier than others because they store fat under the skin, not around their vital organs", "url": "https://amp.theguardian.com/society/2022/jan/25/middle-age-spread-it-might-not-be-as-bad-as-you-think", "urlToImage": null, "publishedAt": "2022-01-25T15:52:00Z", "content": "Pass notesAccording to new data, some obese people are healthier than others because they store fat under the skin, not around their vital organs\r\nTue 25 Jan 2022 15.34 GMT\r\nName: Middle-age spread.\r… [+2725 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How to keep Mental Health in check during Covid-19 | Mental Health during Covid-19 |Oneindia News - Oneindia News", "description": "Keeping mental health in check during the uncertain times of the Covid-19 pandemic is very necessary, these are a few tips you can follow.#MentalHealthTips #...", "url": "https://www.youtube.com/watch?v=V6ttAeVxv7c", "urlToImage": "https://i.ytimg.com/vi/V6ttAeVxv7c/hqdefault.jpg", "publishedAt": "2022-01-25T15:45:01Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Maddy Chapman", "title": "Smoking Cigarettes Before Puberty Has Knock-On Effects For Four Generations - IFLScience", "description": "Smoking cigarettes before puberty has a lasting impact three generations later, a first-of-its-kind study of the transgenerational effects of smoking has c", "url": "https://www.iflscience.com/health-and-medicine/smoking-cigarettes-before-puberty-has-knockon-effects-for-four-generations/", "urlToImage": "https://cdn.iflscience.com/images/50933928-efb6-5bc5-9878-4ba9c63ddc65/default-1643114340-smoking.jpg", "publishedAt": "2022-01-25T15:11:00Z", "content": "Smoking cigarettes before puberty has a lasting impact three generations later, a first-of-its-kind study of the transgenerational effects of smoking has concluded. \r\nThe granddaughters and great-gra… [+3623 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New therapeutic approach offers hope to treat obesity and related metabolic disorders - News-Medical.Net", "description": "Scientists at Nanyang Technological University, Singapore (NTU Singapore) have developed a new therapeutic approach to obesity and related metabolic disorders that in laboratory experiments demonstrated a significant reduction in body fat, body weight, and im…", "url": "https://www.news-medical.net/news/20220125/New-therapeutic-approach-offers-hope-to-treat-obesity-and-related-metabolic-disorders.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/3/Obesity-Jakub_Cejpek_ead0fb8492f0437f96e9fd842630990c-620x480.jpg", "publishedAt": "2022-01-25T14:25:00Z", "content": "Scientists at Nanyang Technological University, Singapore (NTU Singapore) have developed a new therapeutic approach to obesity and related metabolic disorders that in laboratory experiments demonstra… [+7159 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Genetic diagnosis in cerebral palsy patients could change the approach to care - News-Medical.Net", "description": "Cerebral palsy, a non-progressing motor impairment that begins in early childhood, has widely been viewed as the result of oxygen deprivation during birth or other birth-related factors such as prematurity.", "url": "https://www.news-medical.net/news/20220125/Genetic-diagnosis-in-cerebral-palsy-patients-could-change-the-approach-to-care.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-01-25T14:04:00Z", "content": "Cerebral palsy, a non-progressing motor impairment that begins in early childhood, has widely been viewed as the result of oxygen deprivation during birth or other birth-related factors such as prema… [+5471 chars]"}, {"source": {"id": null, "name": "Kalkine Media"}, "author": null, "title": "WHO Chief: “Dangerous to assume” COVID-19 is nearing its end - Kalkine Media", "description": "Highlights \r\n\r\nThe conditions remain idle for more coronavirus variants to emerge in the future. Thus, by no means anyone should think that ...", "url": "https://kalkinemedia.com/au/news/covid-19/who-chief-dangerous-to-assume-covid-19-is-nearing-its-end", "urlToImage": "https://cdn.kalkinemedia.com/image/a4ba34e6091b427192417d16c2c228f8/image.jpg", "publishedAt": "2022-01-25T13:27:35Z", "content": "The Omicron variant spread across countries almost at the speed of light and cases skyrocketed worldwide. However, as this variant is not as dangerous as Delta, people are now taking the pandemic lig… [+2429 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": null, "title": "A Harvard- & Yale-Trained Doctor Swears By These Tips To Get Quality Sleep - mindbodygreen.com", "description": "Go-to tips for a successful snooze.", "url": "https://www.mindbodygreen.com/articles/er-doctor-approved-bedtime-routine", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/kl8xtxdy3kfecdskk.jpg", "publishedAt": "2022-01-25T12:17:41Z", "content": "Ask any expert, the key to balancing your circadian rhythm, and they'll likely agree with Long: \"Leverage light.\" See, as natural light starts to dwindle, your body's internal clock kick-starts melat… [+831 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Covid-19 vaccine for kids: Experts bust top myths - Hindustan Times", "description": "As vaccination drive for adolescents picks pace in India, many parents are coming forward to get their kid jabbed, but some are apprehensive due to fear of adverse effects. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/covid19-vaccine-for-kids-experts-bust-top-myths-101643109249208.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/25/1600x900/vaccine_thumb_1643109696427_1643109705380.jpg", "publishedAt": "2022-01-25T11:26:35Z", "content": "Covid-19 vaccination for adolescents in the age group of 15-18 years began from January 3 onwards and as per government, over 3.5 crore children have already received their first dose. Children in th… [+3698 chars]"}, {"source": {"id": null, "name": "Greekherald.com.au"}, "author": null, "title": "New Harvard study finds a daily teaspoon of olive oil can extend your life - Greek Herald", "description": "A new study by a team of Harvard nutritionists shows that olive oil consumption can significantly slash a person's risk of dying prematurely.", "url": "https://greekherald.com.au/news/new-harvard-study-finds-daily-teaspoon-olive-oil-extend-life/", "urlToImage": "https://s3.ap-southeast-2.amazonaws.com/cdn.greekherald.com.au/wp-content/uploads/2022/01/25204450/151-top-stories-of-2021-77.png", "publishedAt": "2022-01-25T09:54:28Z", "content": "A new study by a team of Harvard nutritionists has shown that olive oil consumption can significantly slash a person’s risk of dying prematurely from a much wider range of diseases, The Australian re… [+1332 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Scientists repurpose wearable devices to detect signs of depression - Health Europa", "description": "A Singapore research team has developed an innovative method for identifying signs of depression that uses data from wearable devices.", "url": "https://www.healtheuropa.eu/scientists-repurpose-wearable-devices-to-detect-signs-of-depression/113022/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/01/©-iStock-Prostock-Studio.jpg", "publishedAt": "2022-01-25T09:41:38Z", "content": "Researchers from the Nanyang Technological University, Singapore (NTU Singapore) have designed a predictive computer programme that employs measurements from wearable devices to determine signs of de… [+4821 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Exercise Started Later in Life Helps Keep Muscles Youthful; Holds Back Epigenetic Aging - Genetic Engineering & Biotechnology News", "description": "Researchers aim to pursue future studies to determine if changes in methylation result in altered muscle function.", "url": "https://www.genengnews.com/topics/omics/epigenetics/exercise-started-later-in-life-helps-keep-muscles-youthful-holds-back-epigenetic-aging/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/08/May5_2014_58261043_ElderlyExercise_AntiagingProtein1215050191-2.jpg", "publishedAt": "2022-01-25T08:00:25Z", "content": "Murine studies headed by a team at the University of Arkansas (U of A) have found that exercising, even when started later in life, can help to keep skeletal muscles more youthful, by holding back ep… [+4686 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID vaccine mandate for kids aged as young as 5 at Adelaide performing arts venue | 7NEWS - 7NEWS Australia", "description": "EXCLUSIVE: Unvaccinated children could be prevented from participating in some activities.Adelaide performing arts group Theatre Bugs is among the first to m...", "url": "https://www.youtube.com/watch?v=y-SSbl64tfc", "urlToImage": "https://i.ytimg.com/vi/y-SSbl64tfc/maxresdefault.jpg", "publishedAt": "2022-01-25T07:42:48Z", "content": null}, {"source": {"id": null, "name": "Theislanderonline.com.au"}, "author": null, "title": "Israel mulls 4th COVID jab for all adults - The Islander", "description": "An Israeli government advisory panel has recommended offering a fourth COVID-19 vaccine dose to all adults, on condition that at least five months have passed...", "url": "https://www.theislanderonline.com.au/story/7594909/israel-mulls-4th-covid-jab-for-all-adults/", "urlToImage": "https://www.theislanderonline.com.au/images/transform/v1/crop/frm/silverstone-feed-data/48b130d6-e65b-4d3c-abb8-edd17b9c8ed8.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2022-01-25T07:40:16Z", "content": "An Israeli government advisory panel has recommended offering a fourth COVID-19 vaccine dose to all adults, on condition that at least five months have passed since they received the third or recover… [+584 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "How can body weight affect the mortality risk of excessive drinkers? — ScienceDaily - Verve Times", "description": "While research has long shown a higher risk of death linked to alcoholism for people with overweight, a new study published in the journal Drug and Alcohol Dependence has found that people with underweight who drink excessively may be at an even high", "url": "https://vervetimes.com/how-can-body-weight-affect-the-mortality-risk-of-excessive-drinkers-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T06:42:55Z", "content": "While research has long shown a higher risk of death linked to alcoholism for people with overweight, a new study published in the journal Drug and Alcohol Dependence has found that people with under… [+2334 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Alcohol use decreases steadily among men, but problem drinking increases during the pandemic - News-Medical.Net", "description": "Alcohol consumption during the coronavirus pandemic declined among men, while it remained steady among women, according to a new RAND Corporation study.", "url": "https://www.news-medical.net/news/20220125/Alcohol-use-decreases-steadily-among-men-but-problem-drinking-increases-during-the-pandemic.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-01-25T06:08:00Z", "content": "Alcohol consumption during the coronavirus pandemic declined among men, while it remained steady among women, according to a new RAND Corporation study.\r\nResearchers found that alcohol-related proble… [+3585 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "One in five young adults with substance use disorder may have undiagnosed autistic traits - News-Medical.Net", "description": "One in five teens and young adults who seek treatment for alcohol or drug use may have traits characteristic of a previously unrecognized autism spectrum disorder (ASD), researchers at Massachusetts General Hospital (MGH) report.", "url": "https://www.news-medical.net/news/20220125/One-in-five-young-adults-with-substance-use-disorder-may-have-undiagnosed-autistic-traits.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2022-01-25T05:58:00Z", "content": "One in five teens and young adults who seek treatment for alcohol or drug use may have traits characteristic of a previously unrecognized autism spectrum disorder (ASD), researchers at Massachusetts … [+2985 chars]"}, {"source": {"id": null, "name": "Unsw.edu.au"}, "author": "z3530388", "title": "Will an Omicron-specific vaccine help control COVID? There's one key problem - UNSW Newsroom", "description": "Variant-specific vaccines would undoubtedly increase immunity. But waves of new variants would engulf the population faster than these vaccines could ever be deployed.", "url": "https://newsroom.unsw.edu.au/news/health/will-omicron-specific-vaccine-help-control-covid-there%E2%80%99s-one-key-problem", "urlToImage": "https://newsroom.unsw.edu.au/sites/default/files/thumbnails/image/covid-vaccine_2.jpg", "publishedAt": "2022-01-25T05:45:00Z", "content": "Variant-specific vaccines would undoubtedly increase immunity. But waves of new variants would engulf the population faster than these vaccines could ever be deployed.In November last year, Australia… [+5285 chars]"}, {"source": {"id": null, "name": "Racgp.org.au"}, "author": null, "title": "Australian breakthrough could improve newborn screening - RACGP", "description": "Researchers have developed a new test for three rare genetic disorders that could help improve newborn screening programs.", "url": "https://www1.racgp.org.au/newsgp/clinical/australian-breakthrough-could-improve-newborn-scre", "urlToImage": "https://www1.racgp.org.au/getattachment/a0ea5d1e-957c-4b23-96fc-198227bf2d01/Australian-breakthrough-could-improve-newborn-scre.aspx", "publishedAt": "2022-01-25T05:41:17Z", "content": "News\r\nResearchers have developed a new test for three rare genetic disorders that could help improve newborn screening programs.\r\nEach year in Australia, around 135 babies are born with one of three … [+5199 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Blood proteins could be the key to a long and healthy life, study finds — ScienceDaily - newsconcerns", "description": "Two blood proteins have been shown by scientists to influence how long and healthy a life we live, research suggests.Developing drugs that target these proteins could be one way of slowing the ageing process, according to the largest genetic study of", "url": "https://newsconcerns.com/blood-proteins-could-be-the-key-to-a-long-and-healthy-life-study-finds-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T04:08:32Z", "content": "Two blood proteins have been shown by scientists to influence how long and healthy a life we live, research suggests.Developing drugs that target these proteins could be one way of slowing the ageing… [+3095 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Review spotlights the indirect impacts of COVID-19 pandemic on children’s health and well-being - News-Medical.Net", "description": "Researchers have warned that children and adolescents must not be left behind in Australia's COVID-19 recovery plans given the negative indirect impacts of the pandemic on this age group detailed in a new brief and research review by the Murdoch Children's Re…", "url": "https://www.news-medical.net/news/20220124/Review-spotlights-the-indirect-impacts-of-COVID-19-pandemic-on-childrene28099s-health-and-well-being.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2022-01-25T03:02:00Z", "content": "Researchers have warned that children and adolescents must not be left behind in Australia's COVID-19 recovery plans given the negative indirect impacts of the pandemic on this age group detailed in … [+6773 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Redefining alcohol use disorder — ScienceDaily - newsconcerns", "description": "Researchers at the University of Missouri have developed a new framework that they believe will help identify people previously overlooked for alcohol use disorder (AUD). This framework focuses on 13 risk factors, such as impulsive behavior, reward s", "url": "https://newsconcerns.com/redefining-alcohol-use-disorder-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-25T02:02:34Z", "content": "Researchers at the University of Missouri have developed a new framework that they believe will help identify people previously overlooked for alcohol use disorder (AUD). This framework focuses on 13… [+2533 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Constructing SARS-CoV-2 virus-like particles in tobacco plants for vaccine development - News-Medical.Net", "description": "In a study published in the latest issue of the Scientific Reports, a team of researchers constructed virus-like particles (VLPs) composed of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) membrane (M), envelope (E), and nucleocapsid (N) protein…", "url": "https://www.news-medical.net/news/20220124/Constructing-SARS-CoV-2-virus-like-particles-in-tobacco-plants-for-vaccine-development.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_702468_16430737694616014.jpg", "publishedAt": "2022-01-25T01:27:00Z", "content": "In a study published in the latest issue of the Scientific Reports, a team of researchers constructed virus-like particles (VLPs) composed of severe acute respiratory syndrome coronavirus 2 (SARS-CoV… [+5427 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds a sharp dip in access to care for poorer Americans during the pandemic - News-Medical.Net", "description": "Americans' use of common outpatient health services dipped sharply at the outset of the COVID-19 pandemic, then rebounded to near-normal levels by the end of 2020, only to decline again during the second surge in January–February 2021, according to a new UCLA…", "url": "https://www.news-medical.net/news/20220124/Study-finds-a-sharp-dip-in-access-to-care-for-poorer-Americans-during-the-pandemic.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/10/shutterstock_532679098_573152c4350d4fe79b49ad0eacf10282-620x480.jpg", "publishedAt": "2022-01-25T01:18:00Z", "content": "Americans' use of common outpatient health services dipped sharply at the outset of the COVID-19 pandemic, then rebounded to near-normal levels by the end of 2020, only to decline again during the se… [+5100 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Raffaella Ciccarelli", "title": "More than 600 mosquitoes of same species caught in single backyard trap as population explodes - 9News", "description": "<p>The species &quot;readily attacks humans&quot;. </p>", "url": "https://www.9news.com.au/national/nsw-news-more-than-600-mosquitoes-of-same-species-caught-in-single-backyard-trap-in-sydney/c6a21b3e-de08-44df-9719-2bf3c07a204d", "urlToImage": "https://imageresizer.static9.net.au/WLVR8Cp1IZyIAsu4FRXeTSNo0N4=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F4a1c2ef5-e95d-417c-bd8c-e7486d4affa9", "publishedAt": "2022-01-25T00:21:40Z", "content": "Property News: Music promoter Michael Coppel sells Toorak home for more than $30 million - domain.com.au"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Peptide-enhanced antibody therapy may help treat breast cancer metastasis to bone - News-Medical.Net", "description": "A moderate amount of a peptide-enhanced, biological cancer drug goes a long way in treating breast cancers that metastasize to the bone.", "url": "https://www.news-medical.net/news/20220124/Peptide-enhanced-antibody-therapy-may-help-treat-breast-cancer-metastasis-to-bone.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Metastasis-620x480.jpg", "publishedAt": "2022-01-25T00:21:00Z", "content": "A moderate amount of a peptide-enhanced, biological cancer drug goes a long way in treating breast cancers that metastasize to the bone.\r\nA study by scientists at Rice University and Baylor College o… [+2778 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "UT Southwestern Medical Center", "title": "UTSW researchers take new approach to fight viral infections - Newswise", "description": "A new approach that targets the cellular machinery that viruses need to reproduce – rather than the virus itself – appears to stem replication of a common c", "url": "https://www.newswise.com/coronavirus/utsw-researchers-take-new-approach-to-fight-viral-infections", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/01/24/61ef2b5415f7a_rsv-if.jpg&width=600&height=600", "publishedAt": "2022-01-24T22:55:00Z", "content": "Newswise — A new approach that targets the cellular machinery that viruses need to reproduce – rather than the virus itself – appears to stem replication of a common childhood pathogen known as respi… [+3198 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Health-related quality-of-life differences in men and women with advanced kidney disease - EurekAlert", "description": "•\tAt the start of a study of older adults with advanced kidney disease, women had lower average physical and mental health-related quality-of-life scores compared with men.\n•\tOver time, however, both physical and mental scores declined approximately twice as …", "url": "https://www.eurekalert.org/news-releases/940853", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-01-24T22:37:52Z", "content": "Highlights\r\n<ul><li>At the start of a study of older adults with advanced kidney disease, women had lower average physical and mental health-related quality-of-life scores compared with men.</li><li>… [+5210 chars]"}, {"source": {"id": null, "name": "Uq.edu.au"}, "author": null, "title": "Do you see faces in things? - UQ News - The University of Queensland, Australia - UQ News", "description": "Seeing faces in everyday objects is a common experience, but research from The University of Queensland has found people are more likely to see male faces when they see an image on the trunk of a tree or in burnt toast over breakfast.", "url": "https://www.uq.edu.au/news/article/2021/12/do-you-see-faces-things", "urlToImage": "https://www.uq.edu.au/news/filething/get/261007/HABS%20Faces%20in%20things%20.jpg", "publishedAt": "2022-01-24T22:37:16Z", "content": "Seeing faces in everyday objects is a common experience, but research from The University of Queensland has found people are more likely to see male faces when they seean image on the trunk of a tree… [+2280 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Study finds that software can accurately detect human movements performed during motor function assessments... - Verve Times", "description": "New pose estimation software has the potential to help neurologists and their patients capture important clinical data using simple tools such as smartphones and tablets, according to a study by Johns Hopkins Medicine, the Kennedy Krieger Institute a", "url": "https://vervetimes.com/study-finds-that-software-can-accurately-detect-human-movements-performed-during-motor-function-assessments-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-24T21:50:27Z", "content": "New pose estimation software has the potential to help neurologists and their patients capture important clinical data using simple tools such as smartphones and tablets, according to a study by John… [+3085 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "The astoundingly low COVID-19 infection rate in sub-Saharan Africa may be a mirage - Salon", "description": "Like previous COVID waves, omicron has largely bypassed much of Africa — or has it?", "url": "https://www.salon.com/2022/01/24/the-astoundingly-low-19-infection-rate-in-sub-saharan-africa-could-be-a-mirage/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/01/lagos-covid-lab-0121221.jpg", "publishedAt": "2022-01-24T21:08:00Z", "content": null}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Nicole Lou", "title": "Black Men's Outsized Heart Failure Risk Persists to Old Age - MedPage Today", "description": "ARIC analysis on subclinical disease progression to overt HF", "url": "https://www.medpagetoday.com/cardiology/chf/96830", "urlToImage": "https://assets.medpagetoday.net/media/images/96xxx/96830.jpg", "publishedAt": "2022-01-24T21:00:56Z", "content": "Race and gender differences in cardiac structure and systolic function persisted to late life even after accounting for established cardiovascular risk factors, according to an analysis of the aging … [+4264 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Patient-derived heart cells mimic disease in vitro — ScienceDaily - newsconcerns", "description": "How can you mend a broken heart? According to researchers from Japan, in some cases gene replacement therapy just might do the trick.In a study published in January in Stem Cell Reports, researchers from Osaka University report that heart cells from", "url": "https://newsconcerns.com/patient-derived-heart-cells-mimic-disease-in-vitro-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-24T17:10:31Z", "content": "How can you mend a broken heart? According to researchers from Japan, in some cases gene replacement therapy just might do the trick.In a study published in January in Stem Cell Reports, researchers … [+2595 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Investigating Omicron’s fitness and replicative potential compared with earlier SARS-CoV-2 variants using organoids - News-Medical.Net", "description": "This study examined the shedding, fitness, and pathogenicity of SARS-CoV-2 VOCs using human airway and alveolar organoids.", "url": "https://www.news-medical.net/news/20220124/Investigating-Omicrone28099s-fitness-and-replicative-potential-compared-with-earlier-SARS-CoV-2-variants-using-organoids.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_702422_16430414616885417.jpg", "publishedAt": "2022-01-24T16:28:00Z", "content": "Over 5.59 million people have died due to the devastating coronavirus disease 2019 (COVID-19) pandemic, which is still wreaking havoc on worldwide health systems. Severe acute respiratory syndrome co… [+5076 chars]"}, {"source": {"id": null, "name": "The Spinoff"}, "author": "The Spinoff", "title": "So you've come into contact with omicron - The Spinoff", "description": "We’ve played out a few possible scenarios so you don’t have to.", "url": "https://thespinoff.co.nz/science/25-01-2022/so-youve-come-into-contact-with-omicron", "urlToImage": "https://images.thespinoff.co.nz/1/2022/01/covid-what-to-do.png?w=850", "publishedAt": "2022-01-24T16:27:17Z", "content": "Need a refresher on what happens if omicron comes into your life? Weve played out a few possible scenarios so you dont have to. \r\nOmicron is here and, as Siouxsie Wiles wrote yesterday, its a game ch… [+6032 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New antimicrobial therapeutics to fight superbugs - Phys.org", "description": "Researchers from Monash University have discovered a potential new way to prevent antibiotic resistance and reduce antibiotic intake.", "url": "https://phys.org/news/2022-01-antimicrobial-therapeutics-superbugs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-antimicrobial-ther.jpg", "publishedAt": "2022-01-24T14:26:16Z", "content": "Fig. 1: The interaction of antibiotics and cubosomes with Gram-negative bacteria. a Schematic representation of the OM bilayer exposed to different antibiotics which are commonly used in the treatmen… [+4222 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Terri-Ann Williams", "title": "The 4 Omicron symptoms that you could be missing revealed... - The Sun", "description": "", "url": "https://www.thesun.co.uk/health/17422091/omicron-symptoms-missing-revealed/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/01/NINTCHDBPICT000455618230-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-01-24T13:56:00Z", "content": "OMICRON has been circulating in the UK for close to two months now and most people who have it say it feels like a cold-like illness.\r\nThe NHS states that the main Covid signs are a new persistent co… [+5289 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Incidence of SARS-CoV-2 infections in orchestra and choir musicians - News-Medical.Net", "description": "A new study aimed to study the incidence of SARS-CoV-2 infections in orchestra and choir musicians compared to controls.", "url": "https://www.news-medical.net/news/20220124/Incidence-of-SARS-CoV-2-infections-in-orchestra-and-choir-musicians.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_702386_16430243212058389.jpg", "publishedAt": "2022-01-24T11:46:00Z", "content": "The coronavirus virus 2019 (COVID-19) pandemic has been caused by the rapid outbreak of the severe acute respiratory coronavirus syndrome 2 (SARS-CoV-2) virus. Like others, the cultural sector, inclu… [+4927 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Continuum of care for non-communicable diseases in the EU - Health Europa", "description": "Health Europa speaks to the European Commission about how it plans to safeguard the continuum of care for non-communicable diseases.", "url": "https://www.healtheuropa.eu/continuum-of-care-for-non-communicable-diseases-in-eu/112999/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/01/iStock-beast01-1220562866.jpg", "publishedAt": "2022-01-24T11:42:26Z", "content": "As healthcare systems around the world endeavour to tackle the ongoing COVID-19 crisis, an ever-growing backlog in non-COVID related care is putting greater pressure on already overstretched care ser… [+7153 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Stuart Layt", "title": "Vitamin D supplements have no health benefits for most people: study - Sydney Morning Herald", "description": "Vitamin D supplements do not prolong life expectancy and have no benefit as a general health measure, a major study has found.", "url": "https://www.smh.com.au/national/vitamin-d-supplements-have-no-health-benefits-for-most-people-study-20220124-p59qrt.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1761%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_107/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/3c94ac3fa13d42f8ce0817489f02820080e77f83", "publishedAt": "2022-01-24T10:37:07Z", "content": "Theres been considerable controversy over how much vitamin D we really need, and this study suggests if you are not vitamin D deficient, then you dont need to take a supplement, she said.\r\nIf we were… [+1513 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pressure on nation's hospitals starts to ease as Omicron wave nears peak | ABC News - ABC News (Australia)", "description": "As the Omicron wave begins to peak, the pressure on the nation's hospitals is starting to ease.   Subscribe: http://ab.co/1svxLVE There are welcome signs of ...", "url": "https://www.youtube.com/watch?v=_-9__8Ch2HM", "urlToImage": "https://i.ytimg.com/vi/_-9__8Ch2HM/maxresdefault.jpg", "publishedAt": "2022-01-24T08:00:14Z", "content": null}, {"source": {"id": null, "name": "ExaminerLive"}, "author": "Amber O'Connor", "title": "Yorkshire teenage girl facing internal decapitation has just months to save her life - Yorkshire Live", "description": "Allesha Barnfield has until May to raise money for vital surgery before the quote expires and prices rise once again", "url": "https://www.examinerlive.co.uk/news/local-news/yorkshire-teen-facing-internal-decapitation-22823457", "urlToImage": "https://i2-prod.examinerlive.co.uk/news/local-news/article22825540.ece/ALTERNATES/s1200/1_Screenshot-204.png", "publishedAt": "2022-01-24T05:00:00Z", "content": "A Yorkshire teenager has just months to try and save her life due to a rare brain condition that could internally decapitate her at any moment.\r\n 17-year-old Allesha Barnfield from Highfields in Donc… [+2893 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Researchers find new way to treat listeria - 7NEWS", "description": "Listeria infections could pose less of a health risk to pregnant women and people with immune deficiency after a discovery by researchers in Queensland.", "url": "https://7news.com.au/lifestyle/health-wellbeing/researchers-find-new-way-to-treat-listeria-c-5425067", "urlToImage": "https://images.7news.com.au/publication/C-5425067/2cd19a6f88424c61cb82c560608470fc329249e1-16x9-x0y75w800h450.jpg?imwidth=1200", "publishedAt": "2022-01-24T04:23:00Z", "content": "Researchers have found another way to fight listeria infections that can cause severe illness in pregnant women and people with immune deficiencies.\r\nThe team from the University of Queensland discov… [+1061 chars]"}]}