{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Contact tracing and quarantine in the context of the Omicron SARS-CoV-2 variant Interim guidance (17 February 2022) - World - ReliefWeb", "description": "English Manual and Guideline on World about Health and Epidemic; published on 17 Feb 2022 by WHO", "url": "https://reliefweb.int/report/world/contact-tracing-and-quarantine-context-omicron-sars-cov-2-variant-interim-guidance-17", "urlToImage": "https://reliefweb.int/sites/reliefweb.int/files/styles/attachment-large/public/resources-pdf-previews/1601235-WHO-2019-nCoV-Contact-tracing-and-quarantine-Omicron-variant-2022.1-eng.png?itok=2fVTmJJg", "publishedAt": "2022-02-17T16:20:49Z", "content": "This interim guidance has been developed in the background of the present global surge of cases due to the SARS-CoV-2 Omicron variant and is meant to be read in conjunction with the current WHO guida… [+662 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 vaccine-induced immunity in heart and kidney solid organ transplant recipients - News-Medical.Net", "description": "The present study entailed assessments of both infected and uninfected SOTRs against the D614G-CoV2 baseline virus and eight other variants.", "url": "https://www.news-medical.net/news/20220217/COVID-19-vaccine-induced-immunity-in-heart-and-kidney-solid-organ-transplant-recipients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_704816_16451142214403724.jpg", "publishedAt": "2022-02-17T16:15:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic has infected nearly 400 million people globally and accounts for over five million deaths. Although vaccination has helped control the spread of sever… [+7189 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Julia Jacobo", "title": "Mosquitos are so smart they're learning how to avoid pesticides used to kill them, study says - ABC News", "description": "", "url": "https://abcnews.go.com/Technology/mosquitos-smart-learning-avoid-pesticides-kill-study/story?id=82929670", "urlToImage": "https://s.abcnews.com/images/US/mosquito-01-gty-jt-220216_1645037887399_hpMain_16x9_992.jpg", "publishedAt": "2022-02-17T16:09:51Z", "content": "Mosquitoes may be smarter than we think, and that could make getting rid of them and the diseases they carry even more difficult, according to new research.\r\nScientists who studied two species of mos… [+2602 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Maggie L. Shaw", "title": "Family History of Breast Cancer, Breast Density May Be Linked - AJMC.com Managed Markets Network", "description": "This study investigated the relationships seen among premenopausal women with a family history of breast cancer and their breast tissue density as seen at their annual mammographic screening.", "url": "https://www.ajmc.com/view/family-history-of-breast-cancer-breast-density-may-be-linked", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/4b3c1f4cc8da6b64a8d67d5d12b876f1fc85a400-1280x853.jpg?fit=crop&auto=format", "publishedAt": "2022-02-17T16:02:23Z", "content": "A potential link has been found among premenopausal women between their mammography-determined breast cancer and having a family history of the disease, with the investigators of a new study in JAMA … [+3938 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "ChAdOx1 vaccine found to protect Syrian hamsters against SARS-CoV-2 variants - News-Medical.Net", "description": "Researchers recently evaluated the efficacy of the Oxford ChAdOx1 (AZD 1222/ AZD2816) vaccine against the Omicron, Delta, and Beta variants of SARS-CoV-2 in Syrian hamsters.", "url": "https://www.news-medical.net/news/20220217/ChAdOx1-vaccine-found-to-protect-Syrian-hamsters-against-SARS-CoV-2-variants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_704803_16451119072021494.jpg", "publishedAt": "2022-02-17T15:41:00Z", "content": "In a recent preprint study posted to Research Square* preprint server, researchers evaluated the efficacy of the Oxford-AstraZeneca ChAdOx1 (AZD 1222/ AZD2816) vaccine against the Omicron, Delta, and… [+5405 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New imaging scan reveals a culprit in cognitive decline of Alzheimer's - Science Daily", "description": "Advanced imaging technology has helped scientists confirm that the destruction of brain synapses underlies the cognitive deficits experienced by patients with Alzheimer's disease. For many years, scientists have assumed that the loss of connections between br…", "url": "https://www.sciencedaily.com/releases/2022/02/220217090713.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-17T15:17:57Z", "content": "Advanced imaging technology developed by Yale researchers has helped them confirm that the destruction of brain synapses underlies the cognitive deficits experienced by patients with Alzheimer's dise… [+1937 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study characterizes brain changes in adolescents affected by juvenile fibromyalgia - News-Medical.Net", "description": "Juvenile fibromyalgia is a syndrome characterized by a chronic pain affecting the whole body. It also causes fatigue as well as sleep and mood disorders.", "url": "https://www.news-medical.net/news/20220217/Study-characterizes-brain-changes-in-adolescents-affected-by-juvenile-fibromyalgia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-02-17T14:20:00Z", "content": "Juvenile fibromyalgia is a syndrome characterized by a chronic pain affecting the whole body. It also causes fatigue as well as sleep and mood disorders. It affects children and adolescents —mainly g… [+3014 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "As COVID-19 vaccination exposure increases, fewer dialysis patients have severe infections - Healio", "description": "Although patients on dialysis show a low immunological response to COVID-19 vaccines, they benefit from the general population getting vaccinated, according to data published in the Clinical Journal of the American Society of Nephrology.Further, investigators…", "url": "https://www.healio.com/news/nephrology/20220217/as-covid19-vaccination-exposure-increases-fewer-dialysis-patients-have-severe-infections", "urlToImage": "https://www.healio.com/~/media/images/fscss/i3wyanokecdncom/healio_safe_image.png", "publishedAt": "2022-02-17T13:06:57Z", "content": "Source/Disclosures\r\n Disclosures: \r\n Karoui reports employment with INSERM U955; research funding from Amgen, Otsuka, and Sanofi; and honoraria from Alexion, AstraZeneca and Otsuka. Sood reports spea… [+3424 chars]"}, {"source": {"id": null, "name": "Crosswalk.com"}, "author": "Dr. Terrill Wade", "title": "What Good Is the Current COVID-19 Vaccine? (Part 4 - the Variants) - COVID-19 - Crosswalk.com", "description": "Most of the experts think some combination of the present vaccine and boosters, along with unspecified tweaks, will currently work for us. If you feel a little underwhelmed by their lack of certainty, I’m with you. The problem is that we’ve never...", "url": "https://www.crosswalk.com/special-coverage/coronavirus/what-good-is-the-current-covid-19-vaccine-part-4-the-variants.html", "urlToImage": "https://media.swncdn.com/via/24191-gettyimages-1297565599-andriyonufriyenkojpeg.jpg", "publishedAt": "2022-02-17T13:00:00Z", "content": "We are all tired of hearing about COVID-19 vaccines, COVID-19 variants, and breakthrough infections and we are tired of the worry which comes with hearing the latest news about hospitals being overwh… [+16626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Airborne Coronavirus Particles May Travel Farther Than Thought: Lab Study - NDTV", "description": "Small coronavirus respiratory particles may remain moist and airborne for a longer time and travel to greater distance than previously thought, a study conducted in a laboratory suggests.", "url": "https://www.ndtv.com/world-news/airborne-coronavirus-particles-may-travel-farther-than-thought-lab-study-2773852", "urlToImage": "https://c.ndtvimg.com/2021-12/8qoaoopk_coronavirus-generic-web-_625x300_15_December_21.jpg", "publishedAt": "2022-02-17T12:48:07Z", "content": "The team estimates that droplets encased in mucus could remain moist for up to 30 minutes\r\nWashington: Small coronavirus respiratory particles may remain moist and airborne for a longer time and trav… [+3636 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "How to exercise safely after having Covid - The bharat express news", "description": "I spent the first two weeks of January 2022 in bed, self-isolating in my room because I had tested positive for Covid. On day 11, I put on my sneakers and", "url": "https://www.thebharatexpressnews.com/how-to-exercise-safely-after-having-covid/", "urlToImage": "https://www.telegraph.co.uk/content/dam/health-fitness/2022/02/14/GettyImages-1289189181_trans_NvBQzQNjv4BqgsaO8O78rhmZrDxTlQBjdGLvJF5WfpqnBZShRL_tOZw.jpg", "publishedAt": "2022-02-17T12:45:37Z", "content": "I spent the first two weeks of January 2022 in bed, self-isolating in my room because I had tested positive for Covid. On day 11, I put on my sneakers and decided to celebrate my newfound freedom by … [+2490 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "First woman reported cured of HIV after stem cell transplant | The World - ABC News (Australia)", "description": "A U.S. patient is believed to be the third person in the world, and the first woman, to be cured of HIV. She was being treated for leukaemia when she receive...", "url": "https://www.youtube.com/watch?v=tEsFTOsrXHU", "urlToImage": "https://i.ytimg.com/vi/tEsFTOsrXHU/hqdefault.jpg", "publishedAt": "2022-02-17T12:14:04Z", "content": null}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Protein Group Found To Play Major Role in Nature - Technology Networks", "description": "Researchers recently discovered a completely novel group of proteins that functions as a switch to regulate biological activity. Now they have analyzed all known protein structures and it turns out that this group exists in all domains of life, in viruses and…", "url": "https://www.technologynetworks.com/proteomics/news/protein-group-found-to-play-major-role-in-nature-358656", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358656/protein-group-found-to-play-major-role-in-nature-358656-640x360.jpg?cb=20220217", "publishedAt": "2022-02-17T10:07:55Z", "content": "Proteins are the workhorses in every living cell and constitute the chemical basis of life. These little machines are required to turn food into energy, to manage motion and brain activities and to f… [+3111 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Benefits: Exercise Can Help Older Adults Retain Their Memories - SciTechDaily", "description": "Pooling data from dozens of experiments let researchers show whose brains benefit the most from exercise. We all know exercise is good for us, but that still leaves plenty of questions. How much exercise? Who benefits the most? And when in our lives? New rese…", "url": "https://scitechdaily.com/brain-benefits-exercise-can-help-older-adults-retain-their-memories/", "urlToImage": "https://scitechdaily.com/images/Exercise-Senior-Couple-Jogging.jpg", "publishedAt": "2022-02-17T10:00:19Z", "content": "Pooling data from dozens of experiments let researchers show whose brains benefit the most from exercise.\r\nWe all know exercise is good for us, but that still leaves plenty of questions. How much exe… [+4570 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Stuart Layt", "title": "Researchers sniff out link between bacteria and Alzheimer’s - Sydney Morning Herald", "description": "Researchers have discovered how a bacteria which lives in the nose can travel through nerve pathways into the brain, highlighting a possible cause of Alzheimer’s.", "url": "https://www.smh.com.au/national/researchers-sniff-out-link-between-bacteria-and-alzheimer-s-20220217-p59xdv.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5236166666666666%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_545%2C$y_839/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/11f9bcb1e4191e6d8a1d05402a713e590d068272", "publishedAt": "2022-02-17T10:00:00Z", "content": "Previous studies have indicated a link between bacteria in the gut and the mouth and Alzheimers, but this is the first time this specific bacteria has been found to infiltrate the brain in this way.\r… [+1349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Deltacron Cases Found In UK, Being Monitored, Says Health Agency - NDTV", "description": "The Deltacron variant of coronavirus was first discovered by a researcher in Cyprus, but was dismissed as \"lab error\" by other experts. But now, fresh cases have been reported in the UK, raising fresh health concerns.", "url": "https://www.ndtv.com/world-news/deltacron-cases-found-in-uk-being-monitored-says-health-agency-2773192", "urlToImage": "https://c.ndtvimg.com/2020-07/45id527_coronavirus-test-samples-july-2020-afp_650x400_17_July_20.jpg", "publishedAt": "2022-02-17T06:16:49Z", "content": "The Deltacron variant of coronavirus has characteristics of both Delta and Omicron strains.\r\nA new variant of the coronavirus (Covid-19) has emerged as a cause of concern for global health experts. T… [+2310 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Clare Collins, Erin Clarke, Rebecca Williams", "title": "Do low-carb diets help you lose weight? Here's what the science says - The Conversation AU", "description": "A new review of the evidence found long-term low-carb dieters lost just under a kilo more weight than other dieters. But they could be missing out on some important nutrients.", "url": "https://theconversation.com/do-low-carb-diets-help-you-lose-weight-heres-what-the-science-says-176368", "urlToImage": "https://images.theconversation.com/files/446925/original/file-20220217-17-qolnhs.jpg?ixlib=rb-1.1.0&rect=0%2C670%2C4975%2C2487&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-17T05:37:18Z", "content": "In the 1970s, low-carb diets were all the rage. The Dr Atkins Diet Revolution book claimed carbohydrate restriction was a high calorie way to stay thin forever.\r\nCarbohydrates are found in breads, ce… [+5870 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "The healthy oral microbiome contributes to jaw bone health by influencing immune cell interactions with bon... - Verve Times", "description": "It is becoming increasingly clear that the human microbiome -- the collection of bacteria, viruses and fungi that live on and within us -- significantly contributes to our health. Indeed, several recent studies have demonstrated the contribution of t", "url": "https://vervetimes.com/the-healthy-oral-microbiome-contributes-to-jaw-bone-health-by-influencing-immune-cell-interactions-with-bone-cells-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-17T04:20:07Z", "content": "It is becoming increasingly clear that the human microbiome — the collection of bacteria, viruses and fungi that live on and within us — significantly contributes to our health. Indeed, several recen… [+5454 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Detection of SARS-CoV-2 RNA by plasmonic-magnetic nanorobots - News-Medical.Net", "description": "Researchers present a simple and efficient plasmonic-magnetic nanorobot for the detection of SARS-CoV-2 RNA.", "url": "https://www.news-medical.net/news/20220216/Detection-of-SARS-CoV-2-RNA-by-plasmonic-magnetic-nanorobots.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2022/2/shutterstock_1902568381.jpg", "publishedAt": "2022-02-17T02:43:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic has been caused by the rapid outbreak of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). The COVID-19 pandemic has significantly aff… [+6086 chars]"}, {"source": {"id": null, "name": "10play.com.au"}, "author": "tenplay", "title": "Ugly Truth: Attractive People May Also Have Better Immune Systems - 10 News First", "description": "A U.S based study has found that good-looking people may also be better at fighting infections and have better immune systems, thus making them healthier.", "url": "https://10play.com.au/theproject/articles/ugly-truth-attractive-people-may-also-have-better-immune-systems/tpa220217abclm", "urlToImage": "https://10play.com.au/ip/s3/2022/02/17/5f61d80066c12414cd6d648ab5f47883-1128229.png?image-profile=image_full&io=landscape", "publishedAt": "2022-02-17T02:16:11Z", "content": "According to a study by Texas Christian University, traits linked to attractiveness may indicate a persons body is better at fighting infection.\r\nThe researchers further concluded that we may be draw… [+977 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "A possible cure for sickle cell? - EurekAlert", "description": "Sickle cell anemia is an inherited blood disorder where red blood cells become sickle/crescent shaped. It causes frequent infections, swelling in the hands and legs, pain, severe tiredness and delayed growth or puberty. Treatment typically focuses on controll…", "url": "https://www.eurekalert.org/news-releases/943504", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-17T02:05:36Z", "content": "(Boston)—Sickle cell anemia is an inherited blood disorder where red blood cells become sickle/crescent shaped. It causes frequent infections, swelling in the hands and legs, pain, severe tiredness a… [+2343 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Omicron breakthrough boosts neutralization titers a little more than a 3rd COVID vaccine dose - News-Medical.Net", "description": "Researchers compare the neutralizing antibody titers in individuals who received two or three mRNA vaccine doses and experienced breakthrough infections.", "url": "https://www.news-medical.net/news/20220216/Omicron-breakthrough-boosts-neutralization-titers-a-little-more-than-a-3rd-COVID-vaccine-dose.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_704720_4460887128155094684.jpg", "publishedAt": "2022-02-17T01:53:00Z", "content": "Despite the widespread availability of effective vaccines in many areas of the world, the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) continues to spread around the world. Furthermor… [+5290 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": null, "title": "Coffee removes bad cholesterol from the blood: scientists told how to drink the drink correctly - The Saxon", "description": "According to the study, caffeine can prevent cardiovascular disease in humans. Scientists have already been able to prove that coffee can be beneficial to health. But how exactly this drink improves a person’s condition remained a mystery. Researchers at McMa…", "url": "https://thesaxon.org/coffee-removes-bad-cholesterol-from-the-blood-scientists-told-how-to-drink-the-drink-correctly/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2022/02/kofe-ubiraet-vrednyj-holesterin-iz-krovi-uchenye-rasskazali-kak-pravilno-upotrebljat-napitok-59e1761.%20jpg", "publishedAt": "2022-02-17T01:20:20Z", "content": "According to the study, caffeine can prevent cardiovascular disease in humans.\r\nScientists have already been able to prove that coffee can be beneficial to health. But how exactly this drink improves… [+2689 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Nicoletta Lanese, Live Science", "title": "Mysterious 'Russian Flu' 130 Years Ago May Have Been a Coronavirus, Scientists Say - ScienceAlert", "description": "In 1889, a mysterious respiratory illness emerged in Russia and then spread across the globe, triggering at least three waves of infection over the course of several years.", "url": "https://www.sciencealert.com/scientists-are-wondering-if-the-1889-russian-flu-was-actually-caused-by-coronavirus", "urlToImage": "https://www.sciencealert.com/images/2022-02/processed/H3N2_influenza_particles_EM_1024.jpg", "publishedAt": "2022-02-16T23:42:51Z", "content": "In 1889, a mysterious respiratory illness emerged in Russia and then spread across the globe, triggering at least three waves of infection over the course of several years.\r\nNow, some scientists susp… [+2560 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Intergenerational violence exposure affects the age of menopause - News-Medical.Net", "description": "Research on women's violence exposure is timely as the COVID pandemic has elevated rates of intimate partner violence and child abuse.", "url": "https://www.news-medical.net/news/20220216/Intergenerational-violence-exposure-affects-the-age-of-menopause.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Menopause-620x480.jpg", "publishedAt": "2022-02-16T22:13:00Z", "content": "Too many people will procreate regardless of their questionable ability to raise their children in a psychologically functional/healthy manner. Being free nations, society cannot prevent anyone from … [+1624 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Does 'bridging' therapy improve outcome for people with stroke? Meta-analysis finds clot-busting drug followed by clot removal works best - Science Daily", "description": "There has been debate over the best treatment for a certain type of stroke caused by a blockage of a large artery in the brain. A new meta-analysis finds that people who have this kind of stroke who can be treated within four-and-a-half hours after their symp…", "url": "https://www.sciencedaily.com/releases/2022/02/220216162303.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-16T21:55:23Z", "content": "There has been debate over the best treatment for a certain type of stroke caused by a blockage of a large artery in the brain. A new meta-analysis finds that people who have this kind of stroke who … [+3819 chars]"}, {"source": {"id": null, "name": "Huntervalleynews.net.au"}, "author": "Andrew Brown", "title": "Winter COVID restriction return flagged - Hunter Valley News", "description": "A second COVID-19 vaccine has been given the green light for children, after the medical regulator provisionally approved...", "url": "https://www.huntervalleynews.net.au/story/7623993/moderna-covid-19-vaccine-approved-for-kids/", "urlToImage": "/images/transform/v1/crop/frm/silverstone-feed-data/06f938fa-b2a1-4ef8-9b4c-96e215fb0f5a.jpg/r0_90_800_510_w1200_h630_fmax.jpg", "publishedAt": "2022-02-16T21:44:12Z", "content": "A second COVID-19 vaccine has been given the green light for children, after the medical regulator provisionally approved Moderna for those aged six years and older."}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Low testosterone? You may be at risk of developing this disease - Play Crazy Game", "description": "uA group of Australian researchers has found a link between low testosterone levels and Alzheimer's disease. The finding is part of an observational study led by the University of Western Australia, which analyzed the medical records of 159,411 men, with an a…", "url": "https://playcrazygame.com/2022/02/17/low-testosterone-you-may-be-at-risk-of-developing-this-disease/", "urlToImage": "https://media-manager.noticiasaominuto.com/1280/naom_61078e3782e7f.jpg", "publishedAt": "2022-02-16T20:58:42Z", "content": "uA group of Australian researchers has found a link between low testosterone levels and Alzheimer’s disease. The finding is part of an observational study led by the University of Western Australia, … [+953 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Middle-aged men see weight gain as inevitable - Science Daily", "description": "Weight gain produces feelings of despondency and low self-worth among middle-aged men, but it is also seen as an inevitable consequence of family and career responsibilities, according to a new study.", "url": "https://www.sciencedaily.com/releases/2022/02/220216095841.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-16T19:56:49Z", "content": "Weight gain produces feelings of despondency and low self-worth among middle-aged men, but it is also seen as an inevitable consequence of family and career responsibilities, according to a new peer-… [+3554 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Scientists Say They have Found a Way to Create Universal Donor Lungs - Gizmodo Australia", "description": "Researchers in Canada say they’ve found a way to help people who otherwise would be left languishing on the organ...", "url": "https://www.gizmodo.com.au/2022/02/scientists-say-they-have-found-a-way-to-create-universal-donor-lungs/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/02/17/75ac1882168f7330a63f5f83ba6d7bf7-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-02-16T19:00:00Z", "content": "Researchers in Canada say theyve found a way to help people who otherwise would be left languishing on the organ transplant list. In new research this week, they detail converting lungs from people w… [+3349 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Naomi Cocks", "title": "Drooling is a common symptom of Parkinson's. Could a workout for the swallowing muscles help? - The Conversation AU", "description": "The treatment is called ‘expiratory muscle strength training’; it is an exercise program targeting the muscles used when you swallow or cough.", "url": "https://theconversation.com/drooling-is-a-common-symptom-of-parkinsons-could-a-workout-for-the-swallowing-muscles-help-158954", "urlToImage": "https://images.theconversation.com/files/444450/original/file-20220203-17-taxqxf.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C5984%2C2992&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-16T18:55:54Z", "content": "Imagine not wanting to leave your house because of fear you would drool. Thats the choice many people with Parkinsons disease confront every day.\r\nParkinsons disease is the second most common neurode… [+4206 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "NBC", "title": "Postpartum depression: Why this doctor missed the warning signs after having her baby - 7NEWS", "description": "Jessica Vernon was trained to recognise post-birth complications. But then she became a mother, and her own downward spiral began.", "url": "https://7news.com.au/lifestyle/health-wellbeing/postpartum-depression-why-this-doctor-missed-the-warning-signs-after-having-her-baby-c-5736817", "urlToImage": "https://images.7news.com.au/publication/C-5736817/a5811a906ed9871ee16ce167ae4062f943b5d1d4-16x9-x69y0w1102h620.jpg?imwidth=1200", "publishedAt": "2022-02-16T16:00:00Z", "content": "When Jessica Vernon was studying to become a doctor of obstetrics and gynecology (OB-GYN), she became an expert on post-birth complications.\r\nShe learned about the physical things - the hemorrhaging … [+4545 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Antihistamines to treat long COVID: What you need to know - Livescience.com", "description": "Antihistamines seem to help a subset of long COVID patients.", "url": "https://www.livescience.com/antihistamines-to-treat-long-covid-pasc", "urlToImage": "https://cdn.mos.cms.futurecdn.net/njpHny4kz7bUXmJVcyiVUN-1200-80.jpg", "publishedAt": "2022-02-16T15:13:11Z", "content": "Over-the-counter antihistamines, typically taken for allergies, may help relieve the debilitating symptoms of long COVID in some people, a new case report suggests.\r\nThe report, published Feb. 7 in T… [+11947 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "Secret Eating Habits To Reshape Your Body After 50, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "If you're struggling to lose weight after 50, these simple eating habits are what dietitians believe can help.", "url": "http://www.eatthis.com/eating-habits-reshape-body-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/Untitled-design-50-18.png", "publishedAt": "2022-02-16T15:00:22Z", "content": "You may notice as you enter your 50s that losing weight or meeting your health goals can become a bit more challenging. This can occur for many reasons, one of the main ones being that your metabolis… [+3591 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Research reveals high-risk subtype of relapsed pediatric AML - Newswise", "description": "Scientists at St. Jude Children’s Research Hospital have found a previously overlooked mutation in a subtype of pediatric leukemia that has implications for i", "url": "https://www.newswise.com/articles/research-reveals-high-risk-subtype-of-relapsed-pediatric-aml", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/02/15/620c0e17e7c27_00215657-006.jpg&width=600&height=600", "publishedAt": "2022-02-16T15:00:00Z", "content": "Newswise — When acute myeloid leukemia (AML) relapses, it is more difficult to treat and outcomes are dismal. Scientists at St. Jude Children’s Research Hospital have discovered a mutation in pediatr… [+4947 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The immune system also helps a healthy body - EurekAlert", "description": "Were you also under the impression that the immune system only kicks in when you get sick? In fact, new research shows the immune system is also busy when you’re perfectly healthy. For instance, it helps you convert fat into energy when you’re fasting.", "url": "https://www.eurekalert.org/news-releases/943646", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-16T14:46:31Z", "content": "The immune system has cells stationed all over the body, and they’re actually doing their business even if you’re fit as a fiddle. This is shown in a new study published in the scientific journal Cel… [+2382 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Estonian Microbiome Project demonstrates the impact of long-term antibiotic use on the microbiome - News-Medical.net", "description": "Estonian Microbiome Project, using electronic health data from more than 2500 biobank participants finds long-term antibiotic usage, independent from recent administration, has an impact on the microbiome, partly explaining the common bacterial signatures ove…", "url": "https://www.news-medical.net/news/20220216/Estonian-Microbiome-Project-demonstrates-the-impact-of-long-term-antibiotic-use-on-the-microbiome.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/pill_antibiotics-620x480.jpg", "publishedAt": "2022-02-16T14:38:00Z", "content": "Estonian Microbiome Project, using electronic health data from more than 2500 biobank participants finds long-term antibiotic usage, independent from recent administration, has an impact on the micro… [+2972 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Barbara Jacquelyn Sahakian, Christelle Langley, Henrietta Bowden-Jones, Sam Chamberlain", "title": "Gambling: what happens in the brain when we get hooked – and how to regain control - The Conversation UK", "description": "There is evidence to suggest that dopamine plays a key role in gamling addiction.", "url": "https://theconversation.com/gambling-what-happens-in-the-brain-when-we-get-hooked-and-how-to-regain-control-176901", "urlToImage": "https://images.theconversation.com/files/446743/original/file-20220216-20-9tokyh.jpg?ixlib=rb-1.1.0&rect=0%2C137%2C7680%2C3840&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-16T14:30:37Z", "content": "Many people turned to online gambling during the pandemic. And while a large proportion of us are able to gamble recreationally, without serious negative impact, the pandemic has led to a rise in gam… [+5512 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Unique Nanoparticles Enable Precision Targeting of Drug Directly into the Lungs - AZoNano", "description": "Scientists at the Tufts University School of Engineering are aiming to gain a reputation for precision targeting in the area of drug delivery.", "url": "https://www.azonano.com/news.aspx?newsID=38699", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38699_16450153765518666.png", "publishedAt": "2022-02-16T13:53:00Z", "content": "Scientists at Tufts University School of Engineering are aiming to gain a reputation for precision targeting in the area of drug delivery.\r\nIllustration of lipid nanoparticle packed with mRNA and sur… [+4947 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Dario Ghersi", "title": "Despite its disastrous effects, COVID-19 offers some gifts to medicine – an immunology expert explains what it can teach us about autoimmune disease - The Conversation AU", "description": "COVID-19 has taken away so much. An immunology researcher describes the good it may leave behind.", "url": "https://theconversation.com/despite-its-disastrous-effects-covid-19-offers-some-gifts-to-medicine-an-immunology-expert-explains-what-it-can-teach-us-about-autoimmune-disease-174952", "urlToImage": "https://images.theconversation.com/files/445510/original/file-20220209-13-1osyf8u.jpeg?ixlib=rb-1.1.0&rect=0%2C148%2C5491%2C2741&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-16T13:16:37Z", "content": "For all the misery that the pandemic has wrought, it has also opened up a vast storehouse of knowledge about medical issues beyond COVID-19. While its still too early to draw conclusions, evidence is… [+6018 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Antidepressant Effects of Psilocybin Could Last up to a Year - Technology Networks", "description": "A new study indcates that the substantial antidepressant effects of psilocybin-assisted therapy, given with supportive psychotherapy, may last at least a year for some patients.", "url": "https://www.technologynetworks.com/neuroscience/news/antidepressant-effects-of-psilocybin-could-last-up-to-a-year-358613", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358613/antidepressant-effects-of-psilocybin-could-last-up-to-a-year-358613-640x360.jpg?cb=20220216", "publishedAt": "2022-02-16T10:17:30Z", "content": "Previous studies by Johns Hopkins Medicine researchers showed that psychedelic treatment with psilocybin relieved major depressive disorder symptoms in adults for up to a month. Now, in a follow-up s… [+5068 chars]"}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "Acute odynophagia ‐ a new symptom of COVID‐19 during the SARS‐CoV‐2 Omicron variant wave in Sweden - Wiley", "description": "Objective\nThe objective of this study is to present a novel clinical manifestation of infection with the Omicron variant of the SARS-CoV-2 virus affecting mainly young, vaccinated and healthy adults...", "url": "https://onlinelibrary.wiley.com/doi/10.1111/joim.13470", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/176396a7-cbb4-47c3-94f4-4a984b741acd/joim.v291.2.cover.jpg", "publishedAt": "2022-02-16T05:37:30Z", "content": "Corresponding Author\r\nLars Olaf Cardell\r\nDepartment of ENT Diseases, Karolinska University Hospital, Stockholm, Sweden\r\nDivision of ENT Diseases, Department of Clinical Science, Intervention and Tech… [+239 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Human nose organoids provide better understanding of the first steps toward SARS-CoV-2 infection - News-Medical.net", "description": "Preclinical models that recapitulate aspects of human airway disease are essential for the advancement of novel therapeutics and vaccines.", "url": "https://www.news-medical.net/news/20220216/Human-nose-organoids-provide-better-understanding-of-the-first-steps-toward-SARS-CoV-2-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Microbiology-620x480.jpg", "publishedAt": "2022-02-16T05:28:00Z", "content": "Preclinical models that recapitulate aspects of human airway disease are essential for the advancement of novel therapeutics and vaccines. In the current study published in the journal mBIO, research… [+4636 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New project aims to improve the lives of stroke survivors with aphasia - News-Medical.Net", "description": "A Queensland researcher will lead a new project aimed at improving the lives of people with aphasia, a debilitating condition that impacts one in three survivors of stroke.", "url": "https://www.news-medical.net/news/20220215/New-project-aims-to-improve-the-lives-of-stroke-survivors-with-aphasia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2022/2/RT-2_Jessica.jpg", "publishedAt": "2022-02-16T04:47:00Z", "content": "A Queensland researcher will lead a new project aimed at improving the lives of people with aphasia, a debilitating condition that impacts one in three survivors of stroke.\r\nDr Jessica Campbell has b… [+2946 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Summer Woolley", "title": "Managing COVID at home: RACGP release online guide to isolating and treating virus symptoms - 7NEWS", "description": "A new guide for those with mild symptoms has been released with a warning that a person’s condition can change at any time.", "url": "https://7news.com.au/news/coronavirus/managing-covid-at-home-racgp-release-online-guide-to-isolating-and-treating-virus-symptoms-c-5715320", "urlToImage": "https://images.7news.com.au/publication/C-5715320/a2420a6b8233a1cd40db87b7d045f44303d63ab9-16x9-x0y125w6000h3375.jpg?imwidth=1200", "publishedAt": "2022-02-16T03:39:21Z", "content": "Australian doctors have revealed the best way to manage COVID-19 symptoms while isolating at home.\r\nWhile thousands of people are still being treated in hospitals across the country, and hundreds are… [+6669 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study uncovers most critical genes that cause coronary heart disease - News-Medical.Net", "description": "The most critical genes that cause coronary heart disease and trigger heart attacks have been identified in a major new study.", "url": "https://www.news-medical.net/news/20220215/Study-uncovers-most-critical-genes-that-cause-coronary-heart-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-02-16T02:45:00Z", "content": "The most critical genes that cause coronary heart disease and trigger heart attacks have been identified in a major new study.\r\nThe research, from a team at the Victor Chang Cardiac Research Institut… [+4051 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cardiac MRI shows a similar injury pattern for vaccine-associated myocarditis - News-Medical.Net", "description": "Vaccine-associated myocarditis shows a similar injury pattern on cardiac MRI compared to other causes of myocarditis, but abnormalities are less severe, according to a new study published in the journal Radiology.", "url": "https://www.news-medical.net/news/20220215/Cardiac-MRI-shows-a-similar-injury-pattern-for-vaccine-associated-myocarditis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2022-02-16T00:56:00Z", "content": "Vaccine-associated myocarditis shows a similar injury pattern on cardiac MRI compared to other causes of myocarditis, but abnormalities are less severe, according to a new study published in the jour… [+4492 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers create a comprehensive atlas of cerebrovascular cell types - News-Medical.net", "description": "While neurons and glial cells are by far the most numerous cells in the brain, many other types of cells play important roles. Among those are cerebrovascular cells, which form the blood vessels that deliver oxygen and other nutrients to the brain.", "url": "https://www.news-medical.net/news/20220215/Researchers-create-a-comprehensive-atlas-of-cerebrovascular-cell-types.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-02-16T00:51:00Z", "content": "While neurons and glial cells are by far the most numerous cells in the brain, many other types of cells play important roles. Among those are cerebrovascular cells, which form the blood vessels that… [+7626 chars]"}, {"source": {"id": null, "name": "Muswellbrookchronicle.com.au"}, "author": "Melissa Meehan", "title": "Global burden of depression in spotlight - Muswellbrook Chronicle", "description": "Tackling some of the myths about depression could help combat the illness in the same way as cancer...", "url": "https://www.muswellbrookchronicle.com.au/story/7622750/global-burden-of-depression-in-spotlight/", "urlToImage": "/images/transform/v1/crop/frm/silverstone-feed-data/34da98fa-79e3-4e2b-b13c-5d8cc61dc157.jpg/r0_90_800_510_w1200_h630_fmax.jpg", "publishedAt": "2022-02-15T23:45:15Z", "content": "Tackling some of the myths about depression could help combat the illness in the same way as cancer or heart disease."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Communication and interaction between two key brain regions is important to forming memory - News-Medical.Net", "description": "A research team led by faculty members at Wayne State University has discovered that communication between two key memory regions in the brain determines how what we experience becomes part of what we remember, and as these regions mature, the precise ways by…", "url": "https://www.news-medical.net/news/20220215/Communication-and-interaction-between-two-key-brain-regions-is-important-to-forming-memory.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Neuroscience-620x480.jpg", "publishedAt": "2022-02-15T22:52:00Z", "content": "A research team led by faculty members at Wayne State University has discovered that communication between two key memory regions in the brain determines how what we experience becomes part of what w… [+3644 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Study suggests young women prefer vaginal ring over oral PrEP for HIV prevention - Healio", "description": "Adolescent girls and young women preferred the dapivirine ring over oral PrEP for HIV prevention by a two to one margin in a study conducted in three African countries, researchers reported Tuesday.\n&ldquo;Ensuring that young women and girls can have access t…", "url": "https://www.healio.com/news/infectious-disease/20220215/study-suggests-young-women-prefer-vaginal-ring-over-oral-prep-for-hiv-prevention", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/infographics/2022/02_february/idn0222ngure_graphic_01_web.jpg", "publishedAt": "2022-02-15T22:49:57Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nAdolescent girls and young women preferr… [+3099 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "By Medscape Staff", "title": "Robots Can Sense Touch and Check Blood Pressure - Medscape", "description": "Small robots are now able to take a patient's blood pressure through humanoid-sensing touch, creating an important new healthcare tool by Simon Fraser University researcher Woo Soo Kim.", "url": "https://www.medscape.com/viewarticle/968543", "urlToImage": "https://img.medscape.com/thumbnail_library/quick_take_800x450.png", "publishedAt": "2022-02-15T21:50:48Z", "content": "Small robots are now able to take a patient's blood pressure through humanoid-sensing touch, creating an important new healthcare tool by Simon Fraser University researcher Woo Soo Kim.   \r\nWhat to k… [+1064 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New study finds COVID-19 vaccination boosts mental health along with immunity - Medical Xpress", "description": "Getting vaccinated for COVID-19 measurably improved the psychological well-being of participants in the Understanding Coronavirus in America study, a large longitudinal look at the impact of the pandemic on individuals in the United States. Vaccination was as…", "url": "https://medicalxpress.com/news/2022-02-covid-vaccination-boosts-mental-health.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/vaccine-13.jpg", "publishedAt": "2022-02-15T19:03:25Z", "content": "Getting vaccinated for COVID-19 measurably improved the psychological well-being of participants in the Understanding Coronavirus in America study, a large longitudinal look at the impact of the pand… [+4298 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "COVID-19: New combination of antivirals may be an effective treatment - Medical News Today", "description": "New research finds that combining the experimental drug brequinar with either of the approved drugs remdesivir or molnupiravir may effectively fight COVID-19.", "url": "https://www.medicalnewstoday.com/articles/antiviral-drug-combo-may-be-effective-against-covid-19", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/02/COVID-19_antiviral_GettyImages1232140166_Thumb.jpg", "publishedAt": "2022-02-15T17:48:05Z", "content": "<ul><li>Researchers from the University of Pennsylvania identified a combination of antiviral drugs they believe to be effective against the SARS-CoV-2 virus. </li><li>The combination includes the ex… [+8497 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Mum collapses with back pain over Christmas and wakes up needing 4 limbs amputation - The bharat express news", "description": "A mother-of-two has been fighting for her life after collapsing with a sudden backache on Christmas Day and waking up needing four limbs amputated in the", "url": "https://www.thebharatexpressnews.com/mum-collapses-with-back-pain-over-christmas-and-wakes-up-needing-4-limbs-amputation/", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article26237954.ece/ALTERNATES/s615b/0_Mum-who-collapsed-after-suffering-backache-on-Christmas-Day-woke-up-in-a-new-year-being-told-she-nee.jpg", "publishedAt": "2022-02-15T17:06:45Z", "content": "A mother-of-two has been fighting for her life after collapsing with a sudden backache on Christmas Day and waking up needing four limbs amputated in the New Year. \r\nSadie Kemp, 34, was put on life s… [+3281 chars]"}]}