{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "FRANCE 24 English"}, "author": "NEWS WIRES", "title": "Covid-19: Patient in France critical after reinfection with S.African variant - FRANCE 24 English", "description": "Doctors in France are treating a critically ill patient infected with the South African coronavirus variant, four months after he recovered from Covid-19, in what study authors said was the first case of its kind.", "url": "https://www.france24.com/en/france/20210212-covid-19-patient-in-france-critical-after-reinfection-with-s-african-variant", "urlToImage": "https://s.france24.com/media/display/a7c64516-6d59-11eb-8eca-005056bf87d6/w:1280/p:16x9/000_8ZK64K.jpg", "publishedAt": "2021-02-12T17:50:17Z", "content": "Doctors in France are treating a critically ill patient infected with the South African coronavirus variant, four months after he recovered from Covid-19, in what study authors said was the first cas… [+1565 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel finding could lead to better treatments for Type 1 and Type 2 diabetes - News-Medical.Net", "description": "Monash University researchers have uncovered the barrier to β-cell (beta cell) regeneration that could pave the way for improved treatments for diabetes and diseases that involve organ and tissue damage.", "url": "https://www.news-medical.net/news/20210212/Novel-finding-could-lead-to-better-treatments-for-Type-1-and-Type-2-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Insulin-620x480.jpg", "publishedAt": "2021-02-12T17:22:00Z", "content": "Monash University researchers have uncovered the barrier to β-cell (beta cell) regeneration that could pave the way for improved treatments for diabetes and diseases that involve organ and tissue dam… [+2367 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Instant death from heart attack more common in people who do not exercise - Science Daily", "description": "An active lifestyle is linked with a lower chance of dying immediately from a heart attack, according to a new study. Heart disease is the leading cause of death globally and prevention is a major public health priority.", "url": "https://www.sciencedaily.com/releases/2021/02/210212111910.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-12T17:00:46Z", "content": "An active lifestyle is linked with a lower chance of dying immediately from a heart attack, according to a study published today in the European Journal of Preventive Cardiology, a journal of the Eur… [+3037 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists identify how harmless gut bacteria 'turn bad' - Science Daily", "description": "An international team of scientists has determined how harmless E. coli gut bacteria in chickens can easily pick up the genes required to evolve to cause a life-threatening infection. Their study warns that such infections not only affect the poultry industry…", "url": "https://www.sciencedaily.com/releases/2021/02/210212111914.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-12T16:52:00Z", "content": "An international team of scientists has determined how harmless E. coli gut bacteria in chickens can easily pick up the genes required to evolve to cause a life-threatening infection. Their study, pu… [+3485 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A novel approach to suppress the growth of glioblastoma cells - News-Medical.Net", "description": "Inhibiting a key enzyme that controls a large network of proteins important in cell division and growth paves the way for a new class of drugs that could stop glioblastoma, a deadly brain cancer, from growing.", "url": "https://www.news-medical.net/news/20210212/A-novel-approach-to-suppress-the-growth-of-glioblastoma-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Brain_cancer%2c_3D_illustration_showing_presence_of_tumor_inside_brain_-_Kateryna_Kon_M1_6704c47fefe0477dbe1cd3351402914f-620x480.jpg", "publishedAt": "2021-02-12T16:46:00Z", "content": "Inhibiting a key enzyme that controls a large network of proteins important in cell division and growth paves the way for a new class of drugs that could stop glioblastoma, a deadly brain cancer, fro… [+4787 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Once bitten, twice shy: the neurology of why one bad curry could put us off for life - Newswise", "description": "A negative experience with food usually leaves us unable to stomach the thought of eating that particular dish again. Using sugar-loving snails as models, resea", "url": "https://www.newswise.com/articles/once-bitten-twice-shy-the-neurology-of-why-one-bad-curry-could-put-us-off-for-life", "urlToImage": "https://www.newswise.com/images/new-newswise-logo-square.jpg", "publishedAt": "2021-02-12T16:35:00Z", "content": "Newswise — A negative experience with food usually leaves us unable to stomach the thought of eating that particular dish again. Using sugar-loving snails as models, researchers at the University of … [+3201 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Identifying risk factors for elevated anxiety in young adults during COVID-19 pandemic - EurekAlert", "description": "A new study has identified early risk factors that predicted heightened anxiety in young adults during the coronavirus (COVID-19) pandemic. The findings from the study, supported by the National Institutes of Health and published in the <i>Journal of the Amer…", "url": "https://www.eurekalert.org/pub_releases/2021-02/niom-irf021221.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-02-12T16:27:57Z", "content": "A new study has identified early risk factors that predicted heightened anxiety in young adults during the coronavirus (COVID-19) pandemic. The findings from the study, supported by the National Inst… [+5700 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Kent COVID variant: What you should know, in less than 500 words - Al Jazeera English", "description": "The highly infectious strain, first detected in southeast England last September, has spread to more than 80 countries.", "url": "https://www.aljazeera.com/news/2021/2/12/kent-coronavirus-variant-what-you-need-to-know-in-500-words", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/02/2021-02-02T104357Z_460621770_RC2AKL9PL1F1_RTRMADP_3_HEALTH-CORONAVIRUS-BRITAIN-VARIANT.jpg?resize=1200%2C630", "publishedAt": "2021-02-12T12:40:50Z", "content": "A highly infectious strain of coronavirus first detected in southeast England last September has now spread to more than 80 countries, and there are warnings it will sweep the world.\r\nScientists beli… [+2703 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study offers new protocols for high-quality SARS-CoV-2 genomic sequencing - News-Medical.Net", "description": "Researchers at the Southern Illinois University, U.S.A. have presented a comprehensive and well-validated set of working protocols for sequencing high-quality SARS-CoV-2 genomes in high throughput from patient samples.", "url": "https://www.news-medical.net/news/20210212/Study-offers-new-protocols-for-high-quality-SARS-CoV-2-genomic-sequencing.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/2021.02.09.430478v1.jpg", "publishedAt": "2021-02-12T12:20:00Z", "content": "In late-December 2019, the coronavirus disease 2019 (COVID-19) was first detected in Wuhan City, China, causing an easily transmissible respiratory illness. By March 2020, the World Health Organizati… [+5201 chars]"}, {"source": {"id": null, "name": "aidsmap"}, "author": null, "title": "High rates of starting and staying on PrEP in pregnant South African women, despite barriers - aidsmap", "description": "High initiation and persistence on pre-exposure prophylaxis (PrEP) has been documented in pregnant women in Cape Town, South Africa, with 91% of those offered PrEP starting it and nearly half of those continuing to take PrEP six months later. While women who …", "url": "https://www.aidsmap.com/news/feb-2021/high-rates-starting-and-staying-prep-pregnant-south-african-women-despite-barriers", "urlToImage": "https://www.aidsmap.com/sites/default/files/styles/aidsmap_social_default/public/2021-02/2000x1300%20HIVR4P%202021-dvora-joseph-davey.png?itok=4LhGKaUK", "publishedAt": "2021-02-12T11:00:00Z", "content": "High initiation and persistence on pre-exposure prophylaxis (PrEP) has been documented in pregnant women in Cape Town, South Africa, with 91% of those offered PrEP starting it and nearly half of thos… [+8688 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Researchers identify potential revolutionary new drug treatment for fatal childhood cancer - Medical Xpress", "description": "Every year around 20 Australian children die from the incurable brain tumor, Diffuse Intrinsic Pontine Glioma (DIPG). The average age of diagnosis for DIPG is just seven years. There are no effective treatments, and almost all children die from the disease, u…", "url": "https://medicalxpress.com/news/2021-02-potential-revolutionary-drug-treatment-fatal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2018/5c18fceef3bbb.jpg", "publishedAt": "2021-02-12T10:00:04Z", "content": "Every year around 20 Australian children die from the incurable brain tumor, Diffuse Intrinsic Pontine Glioma (DIPG). The average age of diagnosis for DIPG is just seven years. There are no effective… [+4724 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "Why vaccine equity matters; no one is safe until we are all safe - The Irish Times", "description": "UNICEF's global supply chain network can ensure the equitable distribution of Covid-19 vaccines to the world’s most vulnerable people", "url": "https://www.irishtimes.com/advertising-feature/why-vaccine-equity-matters-no-one-is-safe-until-we-are-all-safe-1.4481212", "urlToImage": "https://www.irishtimes.com/polopoly_fs/1.4255429.1589638038!/image/image.png", "publishedAt": "2021-02-12T09:41:37Z", "content": "Join businesses around the world in supporting the equitable distribution of Covid-19 vaccines."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "AI-assisted video analysis can help doctors to diagnose Parkinson’s disease at an early stage - News-Medical.Net", "description": "Scientists from Skoltech and A.I. Burnazyan Federal Medical and Biophysical Center have designed and developed a second opinion system, based on AI-assisted video analysis, which can help medical professionals to objectively assess patients with Parkinson’s d…", "url": "https://www.news-medical.net/news/20210212/AI-assisted-video-analysis-can-help-doctors-to-diagnose-Parkinsone28099s-disease-at-an-early-stage.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2021-02-12T08:02:00Z", "content": "Scientists from Skoltech and A.I. Burnazyan Federal Medical and Biophysical Center have designed and developed a second opinion system, based on AI-assisted video analysis, which can help medical pro… [+5668 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid-19: UK economy 'to surge back', and helping children through lockdown - BBC News", "description": "Five things you need to know about the coronavirus pandemic this Friday morning.", "url": "https://www.bbc.com/news/uk-56030715", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/CC94/production/_111527325_index_daily_update_version02_cv_976new.png", "publishedAt": "2021-02-12T07:24:00Z", "content": "Here are five things you need to know about the coronavirus pandemic this Friday morning. We'll have another update for you this evening.\r\nThe Bank of England's chief economist has predicted that the… [+3554 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Disrupting cancer cell cycle with two commercially available inhibitors causes tumor cell death - News-Medical.net", "description": "With two commercially available inhibitors, the cell cycle of the cancer cells in the childhood tumor neuroblastoma can be disrupted at a key point causing tumor cell death.", "url": "https://www.news-medical.net/news/20210212/Disrupting-cancer-cell-cycle-with-two-commercially-available-inhibitors-causes-tumor-cell-death.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/92036744-620x480.jpg", "publishedAt": "2021-02-12T07:04:00Z", "content": "With two commercially available inhibitors, the cell cycle of the cancer cells in the childhood tumor neuroblastoma can be disrupted at a key point causing tumor cell death.\r\nNeuroblastomas are malig… [+3223 chars]"}, {"source": {"id": null, "name": "TRT World"}, "author": "TRTWorld", "title": "Brazil’s virus surge in Manaus linked to new variant – latest updates - TRT World", "description": "The coronavirus pandemic has killed over 2.3 million people and infected more than 108 million globally. Here are the developments for February 12:", "url": "https://www.trtworld.com/life/covid-19-cases-in-eastern-europe-top-10-million-latest-updates-44089", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/98757_rus20210127SputnikVvaccinereuters_1613146989046.png", "publishedAt": "2021-02-12T06:46:03Z", "content": "The coronavirus pandemic has killed over 2.3 million people and infected more than 108 million globally. Here are the developments for February 12:\r\nPerson receives injection with Sputnik V vaccine a… [+25175 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Kristine Macartney, Nicholas Wood", "title": "COVID vaccines have been developed in record time. But how will we know they're safe? - The Conversation AU", "description": "We already track potential vaccine side-effects in Australia. So we'll be using, and building on, years of experience in monitoring any long-term effects of COVID-19 vaccines.", "url": "https://theconversation.com/covid-vaccines-have-been-developed-in-record-time-but-how-will-we-know-theyre-safe-153888", "urlToImage": "https://images.theconversation.com/files/383703/original/file-20210211-13-2npu01.jpg?ixlib=rb-1.1.0&rect=1%2C34%2C997%2C498&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-12T06:25:00Z", "content": "With the rollout of COVID-19 vaccines about to begin in Australia, people may be wondering if theyre safe (and effective) in the long term. What might be the health consequences a year after vaccinat… [+6439 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New article reviews how the circadian clock controls various aspects of homeostasis - News-Medical.Net", "description": "Subconsciously, our bodies keep time for us through an ancient means - the circadian clock. A new University of California, Irvine-led article reviews how the clock controls various aspects of homeostasis, and how organs coordinate their function over the cou…", "url": "https://www.news-medical.net/news/20210212/New-article-reviews-how-the-circadian-clock-controls-various-aspects-of-homeostasis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Insulin-620x480.jpg", "publishedAt": "2021-02-12T06:10:00Z", "content": "Subconsciously, our bodies keep time for us through an ancient means - the circadian clock. A new University of California, Irvine-led article reviews how the clock controls various aspects of homeos… [+3012 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Gary Fuller", "title": "Pollutionwatch: campaign calls on doctors to champion clean air - The Guardian", "description": "Cardiac organisations want GPs to advise us about the air we breathe, much as they began to warn against smoking in the 1960s<br>", "url": "https://amp.theguardian.com/environment/2021/feb/12/pollutionwatch-campaign-doctors-champion-clean-air", "urlToImage": null, "publishedAt": "2021-02-12T06:00:00Z", "content": "PollutionwatchCardiac organisations want GPs to advise us about the air we breathe, much as they began to warn against smoking in the 1960s\r\nConversations with our doctors frequently include ways tha… [+1458 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Implant improves quality of life in patients with bilateral vestibular hypofunction - News-Medical.Net", "description": "Getting around without the need to concentrate on every step is something most of us can take for granted because our inner ears drive reflexes that make maintaining balance automatic.", "url": "https://www.news-medical.net/news/20210212/Implant-improves-quality-of-life-in-patients-with-bilateral-vestibular-hypofunction.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hearing_Loss-620x480.jpg", "publishedAt": "2021-02-12T05:40:00Z", "content": "Getting around without the need to concentrate on every step is something most of us can take for granted because our inner ears drive reflexes that make maintaining balance automatic. However, for a… [+4579 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New technology can help develop diagnostic tests for multiple sclerosis - News-Medical.Net", "description": "Multiple sclerosis (MS) is the most common neurological disease in young adults, affecting more than 2 million individuals worldwide, with about 1500 cases in Estonia. About 20% of MS patients experience optic neuritis (ON) as the presenting symptom, but not …", "url": "https://www.news-medical.net/news/20210212/New-technology-can-help-develop-diagnostic-tests-for-multiple-sclerosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2021-02-12T05:09:00Z", "content": "Multiple sclerosis (MS) is the most common neurological disease in young adults, affecting more than 2 million individuals worldwide, with about 1500 cases in Estonia. About 20% of MS patients experi… [+2529 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Gene inflammation risk to Alzheimer patients - Big News Network", "description": "A clinical study by researchers of Duke University School of Medicine asserts that individuals who have a gene variant associated with an increased risk of deve", "url": "https://www.bignewsnetwork.com/news/267809142/gene-inflammation-risk-to-alzheimer-patients", "urlToImage": "https://cdn.bignewsnetwork.com/ani1613105954.jpg", "publishedAt": "2021-02-12T04:55:00Z", "content": "North Carolina [US], February 12 (ANI): A clinical study by researchers of Duke University School of Medicine asserts that individuals who have a gene variant associated with an increased risk of dev… [+3544 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "NCA NewsWire", "title": "Mandatory disease testing bill ‘could put officers at risk’: NSW Health - PerthNow", "description": "A top cop has told of a ‘degrading’ but ‘not unusual’ situation faced by police, as NSW Health warned a proposed new law could have unintended consequences.", "url": "https://www.perthnow.com.au/business/mandatory-disease-testing-bill-could-put-officers-at-risk-nsw-health-ng-fec866c62fbd1757fdec47b829d49999", "urlToImage": "https://images.perthnow.com.au/publication/FEC866C62FBD1757FDEC47B829D49999/1613106517991_b9816d35cd54ca6968e6c4e6e9d7efa9.jpeg?imwidth=1024", "publishedAt": "2021-02-12T04:51:00Z", "content": "A top cop has told of a degrading but not unusual situation faced by police, as NSW Health warned a proposed new law could have unintended consequences.\r\nThe departments evidence to a parliamentary c… [+5707 chars]"}, {"source": {"id": null, "name": "Mygc.com.au"}, "author": "Monique StClair", "title": "Locals warned after infectious bat picked up on the Gold Coast – myGC.com.au - myGC.com.au", "description": "Gold Coasters have been put on alert after a bat was found to be infected with a disease that's potentially fatal to humans. A red flying fox was recovered from Albert Park on Monaco Street in…", "url": "https://www.mygc.com.au/locals-warned-after-infectious-bat-picked-up-on-the-gold-coast/", "urlToImage": "https://www.mygc.com.au/wp-content/uploads/2017/04/Flying-fox.jpg", "publishedAt": "2021-02-12T04:25:32Z", "content": "Gold Coasters have been put on alert after a bat was found to be infected with a disease that’s potentially fatal to humans.\r\nA red flying fox was recovered from Albert Park on Monaco Street in Broad… [+1355 chars]"}, {"source": {"id": null, "name": "Coastcommunitynews.com.au"}, "author": null, "title": "25 years of treating cancer - Central Coast Community News", "description": "It was World Cancer Day on February 4 and to celebrate, Icon Cancer Centre in Gosford recognised its 25 years of treating patients on the Central Coast.", "url": "https://coastcommunitynews.com.au/central-coast/news/2021/02/25-years-of-treating-cancer/", "urlToImage": "https://coastcommunitynews.com.au/wp-content/uploads/2021/02/Icon-CancerP-scaled.jpg", "publishedAt": "2021-02-12T03:21:47Z", "content": "It was World Cancer Day on February 4 and to celebrate, Icon Cancer Centre in Gosford recognised its 25 years of treating patients on the Central Coast.\r\nSince opening in 1995, Icon has treated more … [+2087 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The impact of SARS-CoV-2 on pregnancy in Nordic countries - News-Medical.Net", "description": "Population-based studies are essential to gain knowledge of the spread and management of this disease. However, most studies on pregnancy during COVID-19 have not been broadly applicable to Nordic populations, like most current COVID-19 research in general.", "url": "https://www.news-medical.net/news/20210211/The-impact-of-SARS-CoV-2-on-pregnancy-in-Nordic-countries.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/2021.02.05.21250672v1.jpg", "publishedAt": "2021-02-12T02:32:00Z", "content": "Since the onset of the coronavirus disease 2019 (COVID-19) pandemic, caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), millions of people have died, with well over a hundred… [+6152 chars]"}, {"source": {"id": null, "name": "Wa.gov.au"}, "author": null, "title": "COVID-19 update 12 February 2021 - WA Health", "description": "The Department of Health has reported no new cases of COVID-19 overnight.", "url": "https://ww2.health.wa.gov.au/Media-releases/2021/COVID19-update-12-February-2021", "urlToImage": null, "publishedAt": "2021-02-12T02:06:21Z", "content": "The Department of Health has reported no new cases of COVID-19 overnight. \r\nThe state’s total number of confirmed cases remains at 910.\r\nYesterday 3,194 people were tested for COVID-19 across the Sta… [+1040 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": "Erin Lyons", "title": "Health officials issue warning about legionnaires’ disease outbreak in Sydney - The Australian", "description": "There has been a spike in cases of legionnaires’ disease in Sydney and the Illawarra region, prompting an urgent warning from health authorities.", "url": "https://www.theaustralian.com.au/breaking-news/health-officials-issue-warning-about-legionnaires-disease-outbreak-in-sydney/news-story/b0fa81c3fb108225c73730e05de41128", "urlToImage": "https://cdn.newsapi.com.au/image/v1/322564098af61c721d791160486354bd", "publishedAt": "2021-02-12T01:59:00Z", "content": "<ul><li>By Erin Lyons</li><li>NCA NewsWire</li><li>12:59PM February 12, 2021</li></ul>There has been a spike in cases of legionnaires disease in Sydney and the Illawarra region, prompting an urgent w… [+1959 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scent detection dogs can be used to screen and identify COVID-19-infected individuals - News-Medical.Net", "description": "In a recent article in the Journal of Osteopathic Medicine, authors gathered previously published research to summarize current thinking on the feasibility and efficacy of using scent detection dogs to screen for the COVID-19 virus.", "url": "https://www.news-medical.net/news/20210211/Scent-detection-dogs-can-be-used-to-screen-and-identify-COVID-19-infected-individuals.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Respiratory-620x480.jpg", "publishedAt": "2021-02-12T01:36:00Z", "content": "In a recent article in the Journal of Osteopathic Medicine, authors gathered previously published research to summarize current thinking on the feasibility and efficacy of using scent detection dogs … [+6078 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exercise during pregnancy may help mitigate negative effects of parental obesity in children - News-Medical.Net", "description": "New research in mice suggests that exercising during pregnancy may help prevent children- especially boys- from developing health problems related to their parents' obesity. The study is published ahead of print in the Journal of Applied Physiology.", "url": "https://www.news-medical.net/news/20210211/Exercise-during-pregnancy-may-help-mitigate-negative-effects-of-parental-obesity-in-children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2021-02-12T01:28:00Z", "content": "New research in mice suggests that exercising during pregnancy may help prevent children-;especially boys-;from developing health problems related to their parents' obesity. The study is published ah… [+2929 chars]"}, {"source": {"id": null, "name": "KOKI FOX 23"}, "author": "The Associated Press", "title": "The Latest: Australia on track for vaccine by end of March - KOKI FOX 23", "description": "Australia’s second-largest city will begin its third lockdown due to a rapidly spreading COVID-19 cluster centered on hotel quarantine", "url": "https://www.fox23.com/news/health/latest-australias/H5DUTWBLLYBOHB37QDBCKAJZG4/", "urlToImage": "https://www.fox23.com/resizer/wAbjUk7XOsdrwRGSrQxk_JyK_WY=/1200x628/cloudfront-us-east-1.images.arcpublishing.com/cmg/4WECMPBQR46VWR2SIDFJHR4CKU.jpg", "publishedAt": "2021-02-12T01:18:45Z", "content": "MELBOURNE, Australia Australias second-largest city will begin its third lockdown due to a rapidly spreading COVID-19 cluster centered on hotel quarantine.\r\nThe five-day lockdown will be enforced acr… [+14104 chars]"}, {"source": {"id": null, "name": "Daily Telegraph"}, "author": "Charles Miranda", "title": "Australia lashes China, WHO: 'Our beef didn't cause COVID' - Daily Mercury", "description": "Australia has officially rejected the World Health Organisation’s hypothesis that COVID-19 was caused by exported beef and seafood packaging.", "url": "https://www.dailytelegraph.com.au/coronavirus/australia-rejects-who-and-china-covid19-claim-that-frozen-beef-caused-the-virus-outbreak/news-story/800aaadc522a08bcaf00d1da3a5ff7c2", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/12/v3imagesbinf4c9a9ae07bcc135dc4999c65846530e-5tsf3r3gmakoszsuuv2_ct1880x930.jpg", "publishedAt": "2021-02-12T01:14:00Z", "content": "Exclusive: Official Australian analysis of the World Health Organisation (WHO) report into the origins of COVID-19 has rejected outright one of its central hypotheses that the virus might have been c… [+3803 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": null, "title": "Covid-19 coronavirus: Two new Covid cases in managed isolation - New Zealand Herald", "description": "Yesterday, one historical case of the virus in managed isolation was announced.", "url": "https://www.nzherald.co.nz/nz/covid-19-coronavirus-two-new-covid-cases-in-managed-isolation/OAM2K6FJFHEYMNC4TIR66FQQKU/", "urlToImage": "https://www.nzherald.co.nz/resizer/d1RgfXqw9U_6-py6oLTHJQIpeZQ=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/7LNHR2TUCUN3AGBRYPWWHBZXLM.jpg", "publishedAt": "2021-02-12T00:00:00Z", "content": "There are two new Covid cases today, both travellers from Britain who are in managed isolation.\r\nThere are no new cases in the community, the Ministry of Health said.\r\nOne case arrived on January 26 … [+2031 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Blanchard", "title": "Britain's coronavirus vaccine drive is ALREADY stopping Covid deaths, study claims - Daily Mail", "description": "Research led by the University of Bristol said the first waves of vaccination are probably already leading to a 10% reduction in Covid deaths but lockdown is making data hard to interpret.", "url": "https://www.dailymail.co.uk/news/article-9250615/Britains-coronavirus-vaccine-drive-stopping-Covid-deaths-study-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/11/19/39180880-0-image-a-23_1613070943249.jpg", "publishedAt": "2021-02-11T23:01:00Z", "content": "Covid vaccines are already preventing deaths in the UK and could be stopping nine out of 10 by the middle of March, scientists predict. \r\nModelling by medical experts suggests there will be a signifi… [+8763 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Matthew Wright", "title": "Doctor fired for Covid vaccine theft says doses 'were due to expire' - Daily Mail", "description": "A judge threw out the case against Dr. Hasan Gokal, who prosecutors had alleged stole doses of COVID vaccine and gave a shot to his wife, but prosecutors say they'll press for a grand jury.", "url": "https://www.dailymail.co.uk/news/article-9250793/Doctor-fired-stealing-10-doses-vaccine-says-expire-six-hours.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/02/11/19/39180850-0-image-a-17_1613070954001.jpg", "publishedAt": "2021-02-11T19:23:00Z", "content": "Authorities alleged that Dr. Hasan Gokal, who worked for Harris County Public Health, stole a vial containing 10 doses of the Moderna vaccine\r\nThe doctor from Texas who was fired and charged after he… [+9464 chars]"}, {"source": {"id": null, "name": "Goodfood.com.au"}, "author": "Gemima Cody", "title": "Keep calm and order in this Valentine's Day weekend, Victoria - Good Food", "description": "The state is entering a five-day lockdown which means it's time to get your rescue fork out.", "url": "https://www.goodfood.com.au/eat-out/news/keep-calm-and-order-in-this-valentines-day-weekend-victoria-20210212-h1ty72", "urlToImage": "https://www.goodfood.com.au/content/dam/images/h/1/m/r/r/k/image.related.socialLead.620x349.h1ty72.png/1613111170360.jpg", "publishedAt": "2021-02-11T18:26:00Z", "content": "Victoria will enter a five-day lockdown at 11.59pm on Friday night in response to the COVID-19 cluster from the Holiday Inn. Stage four restrictions will be in place until 11.59pm Wednesday, which me… [+4605 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "At least 50% of COVID-19 infections come from people who aren't showing symptoms - Newswise", "description": "A new study out of the University of Chicago has found that during the initial wave of the COVID-19 outbreak in New York City, only 1 in 5 to 1 in 7 cases of th", "url": "https://www.newswise.com/coronavirus/at-least-50-of-covid-19-infections-come-from-people-who-aren-t-showing-symptoms", "urlToImage": "https://www.newswise.com/images/new-newswise-logo-square.jpg", "publishedAt": "2021-02-11T17:05:00Z", "content": "Newswise — A new study out of the University of Chicago has found that during the initial wave of the COVID-19 outbreak in New York City, only 1 in 5 to 1 in 7 cases of the virus was symptomatic. The… [+4731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna and Christina Maxouris, CNN", "title": "Covid-19 vaccines could be available to the general public in April in the United States, Fauci says - CNN International", "description": "The United States could start letting the general public have access to Covid-19 vaccines in April, and the country may be able to inoculate most Americans by the middle or end of the summer, Dr. Anthony Fauci said Thursday.", "url": "https://www.cnn.com/2021/02/11/health/us-coronavirus-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210210224732-chicago-restaurant-0127-super-tease.jpg", "publishedAt": "2021-02-11T16:07:30Z", "content": "(CNN)The United States could start letting the general public have access to Covid-19 vaccines in April, and the country may be able to inoculate most Americans by the middle or end of the summer, Dr… [+7533 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "Bangkok Post Public Company Limited", "title": "Arthritis drug Tocilizumab reduces severe Covid mortality: study - Bangkok Post", "description": "PARIS - The arthritis drug tocilizumab reduces the risk of critically ill patients dying of Covid-19, according to results of a study on Thursday which experts welcomed as an \"exciting\" development.", "url": "https://www.bangkokpost.com/world/2066659/arthritis-drug-tocilizumab-reduces-severe-covid-mortality-study", "urlToImage": "https://static.bangkokpost.com/media/content/20210211/c1_3891799_700.jpg", "publishedAt": "2021-02-11T15:45:00Z", "content": "PARIS - The arthritis drug tocilizumab reduces the risk of critically ill patients dying of Covid-19, according to results of a study on Thursday which experts welcomed as an \"exciting\" development. … [+3131 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Agence-France Presse", "title": "Weight loss drug a 'game changer' in cutting obesity: study - Yahoo News Australia", "description": "Scientists on Thursday described a drug which hijacks the body's appetite system as a potential \"game changer\" in treating obesity after research showed it...", "url": "https://au.lifestyle.yahoo.com/weight-loss-drug-game-changer-145202002.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DBCnAU0_YWLtJovwnIsbdA--~B/aD01MzI7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.au/a1922851669373e68a45ac86ef23a898", "publishedAt": "2021-02-11T14:52:00Z", "content": "Scientists on Thursday described a drug which hijacks the body's appetite system as a potential \"game changer\" in treating obesity after research showed it could cut body weight by up to 20 percent.\r… [+1870 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Exploring Impact of Surgery Delays for Clinical Renal Cell Carcinoma Patients during the COVID-19 Pandemic - Newswise", "description": "During the peak of the COVID-19 pandemic, several elective surgeries for renal cell carcinoma, the most common type of kidney cancer, were delayed with unknown", "url": "https://www.newswise.com/coronavirus/exploring-impact-of-surgery-delays-for-clinical-renal-cell-carcinoma-patients-during-the-covid-19-pandemic", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2021/02/11/AdobeStock_331032358.jpeg&width=100&height=100", "publishedAt": "2021-02-11T13:50:00Z", "content": "Newswise — New Brunswick, N.J., February 11, 2021 –  During the peak of the COVID-19 pandemic, several elective surgeries for renal cell carcinoma, the most common type of kidney cancer, were delayed… [+4746 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Connor Parker", "title": "New Bristol variant may infect people who have been vaccinated, expert warns - Yahoo News Australia", "description": "There have been 21 cases of the new Bristol variant discovered in the UK.", "url": "https://au.news.yahoo.com/new-bristol-variant-may-infect-people-who-have-been-vaccinated-130712663.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/nbdxZ1s7HriHbqEOjNnO7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-uploaded-images/2021-02/262a3bc0-6c69-11eb-b7ab-8666e0a2adde", "publishedAt": "2021-02-11T13:14:28Z", "content": "Watch: Bristol variant may infect people who have been vaccinated, expert warns\r\nA new COVID variant first detected in Bristol could infect people who have already been vaccinated, an expert has warn… [+4088 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Higher proportion of male children develop COVID-19-related Multisystem Inflammatory Syndrome, finds study - News-Medical.Net", "description": "Previous studies about COVID-19 have shown that the illness is often more severe in men than women. However, there is limited data available for the pediatric population. Though children and adolescents are at a lower risk of developing severe illness, some m…", "url": "https://www.news-medical.net/news/20210211/Higher-proportion-of-male-children-develop-Multisystem-Inflammatory-Syndrome-finds-study.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1674918865.jpg", "publishedAt": "2021-02-11T12:34:00Z", "content": "Previous studies about the coronavirus disease 2019 (COVID-19), caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), have shown that the illness is often more severe in men tha… [+4581 chars]"}, {"source": {"id": null, "name": "Monash.edu"}, "author": "", "title": "Reversing severe muscle wasting in disease, aging and trauma - Monash University", "description": "An exciting discovery by Monash University scientists may lead to faster recovery from muscle injury and wasting diseases.", "url": "https://www.monash.edu/medicine/news/latest/2021-articles/reversing-severe-muscle-wasting-in-disease-aging-and-trauma", "urlToImage": "https://www.monash.edu/__data/assets/image/0011/2484920/prof-peter-currie.jpg", "publishedAt": "2021-02-11T10:43:21Z", "content": "11 February 2021\r\nAn exciting discovery by Monash University scientists may lead to faster recovery from muscle injury and wasting diseases.\r\nWhen we tear a muscle – stem cells within it repair the p… [+4113 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "Melissa Cunningham, Henrietta Cook, James Manning", "title": "Holiday Inn quarantine hotel cluster grows amid N-95 roll out - Sydney Morning Herald", "description": "The COVID-19 cluster linked to the Holiday Inn has swelled to 13 as the state government bows to pressure and rolls out N95 masks to more hotel quarantine workers.", "url": "https://www.theage.com.au/national/victoria/holiday-inn-quarantine-hotel-cluster-grows-amid-n-95-roll-out-20210211-p571r0.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2586%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/9e9d8237c18d275238dbccbdb1bb8c97406ed55f", "publishedAt": "2021-02-11T08:16:00Z", "content": "COVID-19 Quarantine Victoria Commissioner Emma Cassar has met health officials to discuss rolling out N95 masks more broadly across the states hotel quarantine program after it was hit by a spate of … [+6568 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Julianna LeMieux, PhD", "title": "First Bone Marrow Tissue \"Atlas\" Built Using Novel Confocal Imaging Methods - Genetic Engineering & Biotechnology News", "description": "New approaches for imaging myelopoiesis in mice allowed a group to build the first \"atlas\" of bone marrow tissue showing immune cell differentiation.", "url": "https://www.genengnews.com/news/first-bone-marrow-tissue-atlas-built-using-novel-confocal-imaging-methods/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2021/02/255941_web.jpg", "publishedAt": "2021-02-11T08:00:00Z", "content": "For most of the tissues in the human body, the anatomy of cell differentiation is known. This is not true, however, for bone marrow. One of the reasons lies in the complexities that surround the diff… [+4557 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New review summarises effect of aquatic pollution on cancer prevalence in wild animals - News-Medical.net", "description": "The recent review, published in Environment International and led by the University of Tartu, summarises the effect of aquatic pollution on cancer prevalence in wild animals with the help of more than 300 reviewed studies.", "url": "https://www.news-medical.net/news/20210211/New-review-summarises-effect-of-aquatic-pollution-on-cancer-prevalence-in-wild-animals.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pollution-620x480.jpg", "publishedAt": "2021-02-11T06:21:00Z", "content": "The recent review, published in Environment International and led by the University of Tartu, summarises the effect of aquatic pollution on cancer prevalence in wild animals with the help of more tha… [+3757 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Pediatric dietary mobile game improved children’s short-term food choices - News-Medical.Net", "description": "Rates of overweight and obesity in children are rising around the world, with serious long-term consequences for health and health care costs. In prior research, video and mobile games have helped children eat healthier and exercise more.", "url": "https://www.news-medical.net/news/20210211/Pediatric-dietary-mobile-game-improved-childrene28099s-short-term-food-choices.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2021-02-11T06:18:00Z", "content": "Rates of overweight and obesity in children are rising around the world, with serious long-term consequences for health and health care costs. In prior research, video and mobile games have helped ch… [+5833 chars]"}, {"source": {"id": null, "name": "Crikey"}, "author": "Amber Schultz", "title": "What are the long-term effects of COVID-19? What we know so far - Crikey", "description": "What exactly is 'long COVID'?", "url": "https://www.crikey.com.au/2021/02/11/long-term-effects-covid-symptoms/", "urlToImage": "https://www.crikey.com.au/wp-content/uploads/2019/07/GettyImages-172650739.jpg", "publishedAt": "2021-02-11T01:41:41Z", "content": "(Image: Getty)\r\nWith vaccine manufacturing delays, mutant variants and continuous breaches in hotel quarantine the pandemic has dug its claws in and shows no sign of going away.\r\nAnd the long-term sy… [+459 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Matthew killoran, Finn mchugh", "title": "Six-year pandemic: World vaccine rollout delay expected - Warwick Daily News", "description": "A leading infectious diseases expert has warned how long it will take to vaccinate the globe, but more worringly, worse could be yet to come.", "url": "https://www.news.com.au/world/coronavirus/australia/infectious-diseases-expert-sanjaya-senanayake-says-world-wont-be-protected-from-covid19-for-six-years/news-story/cc05f878145574214cdcdcc5ec162dbe", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/11/v3imagesbin3d573ad3f6f210f4246e03b5cb3385e7-h5jl451wanhoxnjmuv2_ct1880x930.jpg", "publishedAt": "2021-02-10T21:39:00Z", "content": "UNRESTRICTED international travel is unlikely to return for several years as experts warn the world will not be fully vaccinated from COVID-19 until 2027.\r\nThe sobering claim that it will take up to … [+2242 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Shireen Khalil", "title": "Eating just three eggs a week increases risk of dying young, study shows - NEWS.com.au", "description": "Eating just three eggs a week increases risk of dying young, study shows", "url": "https://www.news.com.au/lifestyle/health/diet/eating-just-three-eggs-a-week-increases-risk-of-dying-young-study-shows/news-story/558cbfe754f6f29987c000a320fd0ca2", "urlToImage": "https://cdn.newsapi.com.au/image/v1/a178aeb3085a99bff4ad5388e375f749?width=1280", "publishedAt": "2021-02-10T21:32:09Z", "content": "According to a US-based study published on February 9, if you’re eating just three eggs a week it can increase your chances of dying young.\r\nExperts warned that the yolks in eggs are high in choleste… [+5455 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New targets for the development of a drug treatment for obesity and type 2 diabetes - Medical Xpress", "description": "The GIP receptor in the central nervous system plays a crucial role in the regulation of body weight and food intake. This is shown by a recent study by Helmholtz Zentrum München, ETH Zurich and the German Center for Diabetes Research (DZD). The study, which …", "url": "https://medicalxpress.com/news/2021-02-drug-treatment-obesity-diabetes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/60243d5fdd489.jpeg", "publishedAt": "2021-02-10T21:23:24Z", "content": "The GIP receptor in the central nervous system plays a crucial role in the regulation of body weight and food intake. This is shown by a recent study by Helmholtz Zentrum München, ETH Zurich and the … [+4054 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Six previously FDA-approved drugs appear promising against SARS-CoV-2 in laboratory testing - Science Daily", "description": "Researchers havve discovered that six drugs previously approved by the U.S. Food and Drug Administration (FDA) for other indications could be repurposed to treat or prevent COVID-19.", "url": "https://www.sciencedaily.com/releases/2021/02/210210091207.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-02-10T19:04:20Z", "content": "A team of investigators from the Republic of China has discovered that 6 drugs previously approved by the US Food and Drug Administration (FDA) for other indications could be repurposed to treat or p… [+2314 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Sally Whyte", "title": "Why vaccines won't mean the end of coronavirus - The Canberra Times", "description": "Experts suggest what the future could look like when the vaccines are rolled out", "url": "https://www.canberratimes.com.au/story/7121518/why-vaccines-wont-mean-the-end-of-coronavirus/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/rJkJNFPcdBkDQKqtkgHSjA/179838a9-deff-4230-90f2-c434025d88ca.jpg/r0_246_3638_2301_w1200_h678_fmax.jpg", "publishedAt": "2021-02-10T19:00:00Z", "content": "Immunisation Nurse Silja Mai, gives Ron Mees, 69, a dose of the Oxford/Astra Zeneca COVID-19 vaccine, during a mass vaccination in the UK on Tuesday. Picture: Getty Images"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Insufficient sleep can negatively affect teenagers' mental health - News-Medical.Net", "description": "As families settle back into a new school year, sleep experts at the University of South Australia are reminding parents about the importance of teenagers getting enough sleep, cautioning them that insufficient sleep can negatively affect their mental health.", "url": "https://www.news-medical.net/news/20210210/Insufficient-sleep-can-negatively-affect-teenagers-mental-health.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Abstract_medicine_background-Hilch-1000_f0a8c263e6e04ed18dfcc5ef27c17907-620x480.jpg", "publishedAt": "2021-02-10T18:33:00Z", "content": "As families settle back into a new school year, sleep experts at the University of South Australia are reminding parents about the importance of teenagers getting enough sleep, cautioning them that i… [+2773 chars]"}]}