{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Studies find no COVID benefit for preventive hydroxychloroquine or for convalescent plasma - CIDRAP", "description": "\"There are no compelling data to suggest that hydroxychloroquine is effective.\"", "url": "https://www.cidrap.umn.edu/news-perspective/2020/11/studies-find-no-covid-benefit-preventive-hydroxychloroquine-or-convalescent", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/public/styles/thumbnail/public/images/news/hcq_bottle_and_pills.jpg?itok=ttcsUrjU", "publishedAt": "2020-11-25T21:18:22Z", "content": "Two studies published yesterday in the New England Journal of Medicine found that two once-promising but largely discredited COVID-19 treatmentshydroxychloroquine and convalescent plasmadidn't preven… [+4068 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Virus-Killing UV Lamps Are Burning People’s Eyes, Doctors Warn - Gizmodo Australia", "description": "Ultraviolet lamps meant to kill viruses and bacteria seem to be causing unfortunate eye damage in some people. In a new paper this month, doctors report several cases where people developed inflamed corneas due to UV radiation exposure from “germicidal lamps”…", "url": "https://www.gizmodo.com.au/2020/11/virus-killing-uv-lamps-are-burning-peoples-eyes-doctors-warn/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2020/11/26/spwjl2c2vhmoxl24svzr-scaled.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2020-11-25T20:15:00Z", "content": "Ultraviolet lamps meant to kill viruses and bacteria seem to be causing unfortunate eye damage in some people. In a new paper this month, doctors report several cases where people developed inflamed … [+3053 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Tahlia Roy", "title": "Coronavirus lockdowns contributing to faster deterioration in dementia patients, research finds - ABC News", "description": "Forced into lockdowns to prevent the spread of coronavirus, families of people with dementia have been left heartbroken that being isolated appears to have contributed to the deterioration of their loved ones.", "url": "https://www.abc.net.au/news/2020-11-26/dementia-deterioration-faster-coronavirus-lockdowns-aged-care/12920344", "urlToImage": "https://www.abc.net.au/cm/rimage/12920396-16x9-large.jpg?v=2", "publishedAt": "2020-11-25T18:53:00Z", "content": "Forced into lockdowns to prevent the spread of coronavirus, families of people with dementia have been left heartbroken that being isolated appears to have contributed to the deterioration of their l… [+5208 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Carla Delgado, David Seres", "title": "The differences between soluble fibre and insoluble fibre and why both are equally important for your health - Business Insider Australia", "description": "The difference between soluble and insoluble fibre is often confusing. Although both are important for metabolic health, the main distinction boils down to how well they dissolve in water. But that doesn’t mean one is more important than the other.", "url": "https://www.businessinsider.com.au/soluble-vs-insoluble-fiber-2020-11", "urlToImage": "https://i.insider.com/5fbe87d5037cbd00186124bf", "publishedAt": "2020-11-25T18:52:34Z", "content": "<ul><li>\r\nSoluble and insoluble fibre are equally important for your health and one is no better than the other for general well-being.\r\n</li><li>\r\nSoluble fibre dissolves and ferments in your gut wh… [+6264 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Later school start may reduce migraines for high school students, study says - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2020-11-25T18:27:41Z", "content": "Hudson Tabling, 2, of Pickneyville, Ill., touches a reindeer aboard the Polar Express train at Union Station on opening day in St. Louis on November 20. The Polar Express train, in its seventh year, … [+167 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Gabby Landsverk", "title": "How to have an effective workout when you're hungover - Insider - INSIDER", "description": "You can still do lower intensity exercise if you have a hangover, and for some people, a few drinks might not affect your workout performance at all.", "url": "https://www.insider.com/how-to-survive-exercise-with-a-hangover-2020-11", "urlToImage": "https://i.insider.com/5fb6edca50e71a0011556594?width=1200&format=jpeg", "publishedAt": "2020-11-25T17:57:21Z", "content": "Waking up to pounding headache, dizziness, and full-body nausea after a night of drinking is a special kind of torment if you've got a gym session scheduled.\r\nSometimes it's better to just sleep it o… [+5648 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Borders are coming down. Were they based on science or politics? - ABC News", "description": "Australia will soon - mostly - be a country where you can once again travel freely between states and territories. Many borders will finally come down in December 1, after they were put up to stop coronavirus jumping from state to state during Victoria’s seco…", "url": "https://www.abc.net.au/radio/programs/coronacast/borders-are-coming-down-were-they-based-on-science-or-politics/12920804", "urlToImage": "https://www.abc.net.au/cm/rimage/12027716-16x9-large.jpg?v=4", "publishedAt": "2020-11-25T17:01:00Z", "content": "Tegan Taylor: Hello, this is Coronacast, a daily podcast all about the coronavirus. I'm health reporter Tegan Taylor.Norman Swan: And I'm physician and journalist Dr Norman Swan, it's Thursday, 26 No… [+10587 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Erin Heger, Samantha Cassetty", "title": "6 science-backed health benefits of chia seeds and how to incorporate them into your diet - Business Insider Australia", "description": "Chia seeds are small, edible seeds of the Salvia hispanica plant native to central and southern Mexico. They are grey with black and white spots and measure about two millimetres in diameter. However, even though they’re small, chia seeds are packed with nutr…", "url": "https://www.businessinsider.com.au/chia-seed-benefits-2020-11", "urlToImage": "https://i.insider.com/5fbe77b0037cbd001861243e", "publishedAt": "2020-11-25T16:10:45Z", "content": "<ul><li>\r\nChia seeds contain high amounts of fibre and omega-3 fatty acids and are a plant-based source of complete protein.\r\n</li><li>\r\nChia seeds can reduce inflammation, improve heart health, and … [+6161 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Effect of climate change on infectious diseases unknown to half of the population - EurekAlert", "description": "Although it is a widely known scientific fact that infectious diseases emerge and re-emerge due to climate change, a study which included the involvement of the UAB published in PlosOne reveals that 48.9% of the population surveyed are not aware of this relat…", "url": "https://www.eurekalert.org/pub_releases/2020-11/uadb-eoc112520.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2020-11-25T16:10:32Z", "content": "The transmission of specific infectious diseases have been altered by processes linked to climatic and environmental anomalies. An increase in infectious outbreaks is expected to be seen in mild clim… [+3246 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Genetic study shows that the risk of pre-eclampsia is related to blood pressure and BMI - EurekAlert", "description": "An international study, coordinated by experts from the University of Nottingham, has revealed that the genetic risk of pre-eclampsia - a potentially dangerous condition in pregnancy - is related to blood pressure and body mass index.", "url": "https://www.eurekalert.org/pub_releases/2020-11/uon-gss112520.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2020-11-25T15:48:41Z", "content": "Pre-eclampsia, usually diagnosed by increased blood pressure and protein in urine, affects up to 5% of pregnant women. It contributes worldwide to the death of estimated 50 000 women and up to one mi… [+2949 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers explore prevention measures for SARS-CoV-2 transmission during international travel - News-Medical.Net", "description": "Researchers from the Centres for Disease Prevention and Control (CDC) have released findings of their study on the transmission of SARS-CoV-2 via international travel.", "url": "https://www.news-medical.net/news/20201125/Researchers-explore-prevention-measures-for-SARS-CoV-2-transmission-during-international-travel.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f11%2fshutterstock_1640350780-1.jpg", "publishedAt": "2020-11-25T15:40:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic, caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has spread like wildfire all over the world. A major contributing factor to S… [+6475 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jane Wakefield - Technology reporter", "title": "TikTok offers feature to avoid seizure triggers - Yahoo News Australia", "description": "It is designed to protect people with photosensitive epilepsy from potentially harmful content.", "url": "https://news.yahoo.com/tiktok-offers-feature-avoid-seizure-135514064.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/QfhZQbFHK_19nbsWQPLaSA--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-gb/bbc_us_articles_995/d1da5dfefa8439f1e502b1845480851a", "publishedAt": "2020-11-25T14:05:36Z", "content": "tik-tok-logo.\r\nTikTok has announced a new feature that will allow people with photosensitive epilepsy to skip videos that could trigger seizures.\r\nIt comes a few months after it began labelling video… [+1573 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "By Claudia Poposki For Daily Mail Australia", "title": "COVID-19: Mystery as coronavirus is found in sewage in major Queensland city - Daily Mail", "description": "Cairns, Far North Queensland, currently has no cases of COVID-19 but traces of the virus suggests there may be unknown cases.", "url": "https://www.dailymail.co.uk/news/article-8986141/COVID-19-Mystery-coronavirus-sewage-major-Queensland-city.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/11/25/13/36093872-0-image-a-5_1606311566093.jpg", "publishedAt": "2020-11-25T14:02:00Z", "content": "Seventeen suburbs have been put on high alert after traces of COVID-19 was found in a sewage catchment.\r\nCairns, Far North Queensland, currently has no cases of COVID-19 and has only recorded 35 sinc… [+2201 chars]"}, {"source": {"id": null, "name": "HealthITAnalytics.com"}, "author": "Jessica Kent", "title": "Machine Learning Tool Accurately Detects COVID-19 on X-Rays - HealthITAnalytics.com", "description": "A machine learning tool was able to detect COVID-19 in x-ray images about ten times faster and one to six percent more accurately than specialized thoracic radiologists, according to a study published in Radiology.\n\nFor more coronavirus updates, visit our res…", "url": "https://healthitanalytics.com/news/machine-learning-tool-accurately-detects-covid-19-on-x-rays", "urlToImage": "https://healthitanalytics.com/images/site/article_headers/_normal/ThinkstockPhotos-658813850.jpg", "publishedAt": "2020-11-25T13:30:00Z", "content": "By Jessica Kent\r\nNovember 25, 2020 - A machine learning tool was able to detect COVID-19 in x-ray images about ten times faster and one to six percent more accurately than specialized thoracic radiol… [+5629 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Dexamethasone use could reduce immune checkpoint inhibitor efficacy in glioblastoma patients - News-Medical.Net", "description": "Bottom Line: Among patients with glioblastoma receiving an immune checkpoint inhibitor, those who received the corticosteroid dexamethasone at baseline for cerebral edema had significantly worse overall survival.", "url": "https://www.news-medical.net/news/20201125/Dexamethasone-use-could-reduce-immune-checkpoint-inhibitor-efficacy-in-glioblastoma-patients.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fCorticosteroid-620x480.jpg", "publishedAt": "2020-11-25T13:21:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nBottom Line: Among patients with glioblastoma receiving an immune checkpoint inhibitor, those who received the corticosteroid dexamethasone at baseline … [+4796 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Medicaid Expansion May Improve Colon Cancer Diagnosis - Mirage News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUWh0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL21lZGljYWlkLWV4cGFuc2lvbi1tYXktaW1wcm92ZS1jb2xvbi1jYW5jZXItZGlhZ25vc2lzL9IBAA?oc=5", "urlToImage": null, "publishedAt": "2020-11-25T13:02:12Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "UB researchers uncover new functions in ataxin 3 gene that causes Machado-Joseph disease - News-Medical.net", "description": "Ataxia is a minority disease with genetic origins, known for its neuromuscular alterations due to the selective loss of neurons in the cerebellum, the organ of our nervous systems which controls movement and balance.", "url": "https://www.news-medical.net/news/20201125/UB-researchers-uncover-new-functions-in-ataxin-3-gene-that-causes-Machado-Joseph-disease.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fGene-620x480.jpg", "publishedAt": "2020-11-25T12:55:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nAtaxia is a minority disease with genetic origins, known for its neuromuscular alterations due to the selective loss of neurons in the cerebellum, the o… [+4302 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The American Lung Association say to wear masks to stop the spread of COVID-19; Here’s why - News-Medical.Net", "description": "Dr. Albert Rizzo speaks to News-Medical about the importance of wearing masks to help control the spread of COVID-19.", "url": "https://www.news-medical.net/news/20201125/The-American-Lung-Association-say-to-wear-masks-to-stop-the-spread-of-COVID-193b-Heree28099s-why.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f11%2fshutterstock_1678274461.jpg", "publishedAt": "2020-11-25T11:20:00Z", "content": "Dr. Albert Rizzo, Chief Medical Officer at the American Lung Association, speaks to News-Medical about the importance of wearing masks to help control the spread of COVID-19.\r\nWhat provoked your rese… [+9192 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Spinal/epidural anesthesia associated with increased survival in leg artery bypass surgery - Medical Xpress", "description": "A new study published in The BMJ shows that people who had surgery to improve blood flow in their legs under spinal or epidural anesthesia were less likely to die than those who were given general anesthesia.", "url": "https://medicalxpress.com/news/2020-11-spinalepidural-anesthesia-survival-leg-artery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spinalepidur.jpg", "publishedAt": "2020-11-25T10:54:12Z", "content": "A new study published in The BMJ shows that people who had surgery to improve blood flow in their legs under spinal or epidural anesthesia were less likely to die than those who were given general an… [+3533 chars]"}, {"source": {"id": null, "name": "The Advertiser"}, "author": "Kara Jung and Greg Barila", "title": "Wearing a mask: your questions answered - The Advertiser", "description": "Wearing a mask outside home is not mandatory but SA Health authorities have strongly encouraged every South Australian to wear one when out in public to help stop any spread of COVID-19. So how do you wear them effectively? How many times can you use a cloth …", "url": "https://www.adelaidenow.com.au/coronavirus/wearing-a-mask-all-your-questions-answered/news-story/c1823c16fe3fa7c1970562ee77ffbd3e", "urlToImage": "https://content.api.news/v3/images/bin/1342b9d130541a989730c76a3cf39b0f", "publishedAt": "2020-11-25T09:29:01Z", "content": "SA Health authorities strongly recommend wearing a mask when out in public. So how do you put them on? Are they effective if wet? We answer your mask questions.Wearing a mask outside home is not mand… [+5981 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exactech and Bodycad sign exclusive distribution agreement - News-Medical.Net", "description": "Exactech announced today the signing of an exclusive distribution agreement with orthopedic manufacturer Bodycad for its Reflex Uni™ knee in the U.S.", "url": "https://www.news-medical.net/news/20201125/Exactech-and-Bodycad-sign-exclusive-distribution-agreement.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f11%2fcsm_Reflex_Uni_Intro_Pa_En_VF_3b6591996f.jpg", "publishedAt": "2020-11-25T08:10:00Z", "content": "Exactech, a developer and producer of innovative implants, instrumentation, and smart technologies for joint replacement surgery, announced today the signing of an exclusive distribution agreement wi… [+3873 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Danial Martinus", "title": "Malaysian-born doctor in Australia saves state from second COVID-19 wave, hailed a hero - Mashable SE Asia", "description": "“I was honestly just trying to do my job as best as I could.”", "url": "https://sea.mashable.com/social-good/13359/malaysian-born-doctor-in-australia-prevents-second-covid-19-wave-in-adelaide", "urlToImage": "https://sm.mashable.com/t/mashable_sea/photo/default/cover_17xd.1200.png", "publishedAt": "2020-11-25T07:19:00Z", "content": "Malaysian-born doctor Dharminy Thurairatnam is being hailed a hero in Adelaide, Australia after she prevented a second wave of COVID-19 transmissions in the state.\r\nThurairatnam was working a busy Fr… [+3251 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers review key elements of crisis decision making during public health emergencies - News-Medical.Net", "description": "In mid-March, public health officials across the San Francisco area issued the first U.S. regional shelter-in-place order in response to the emerging COVID-19 pandemic.", "url": "https://www.news-medical.net/news/20201125/Researchers-review-key-elements-of-crisis-decision-making-during-public-health-emergencies.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fPandemic-620x480.jpg", "publishedAt": "2020-11-25T06:15:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nIn mid-March, public health officials across the San Francisco area issued the first U.S. regional shelter-in-place order in response to the emerging CO… [+4044 chars]"}, {"source": {"id": null, "name": "BioSpace"}, "author": "BioSpace", "title": "Discovery of a potential treatment against antibiotic-resistant bacteria causing gonorrhea and meningitis - BioSpace", "description": "A team from the Institut national de la recherche scientifique has demonstrated the effectiveness of an inexpensive molecule to fight antibiotic-resistant strains of the bacteria responsible for gonorrhea and meningococcal meningitis.", "url": "https://www.biospace.com/article/releases/discovery-of-a-potential-treatment-against-antibiotic-resistant-bacteria-causing-gonorrhea-and-meningitis/", "urlToImage": null, "publishedAt": "2020-11-25T06:09:33Z", "content": "MONTREAL and LAVAL, Nov. 24, 2020 /CNW Telbec/ - A team from the Institut national de la recherche scientifique (INRS) has demonstrated the effectiveness of an inexpensive molecule to fight antibioti… [+4643 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Germicidal lamps used to sanitize against COVID-19 may damage the cornea - News-Medical.Net", "description": "In a paper published in the journal of Ocular Immunology and Inflammation, physicians from the Bascom Palmer Eye Institute at the University of Miami Miller School of Medicine reported that several patients using germicidal lamps in an attempt to sanitize aga…", "url": "https://www.news-medical.net/news/20201125/Germicidal-lamps-used-to-sanitize-against-COVID-19-may-damage-the-cornea.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fImmunology-620x480.jpg", "publishedAt": "2020-11-25T05:46:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nIn a paper published in the journal of Ocular Immunology and Inflammation, physicians from the Bascom Palmer Eye Institute at the University of Miami Mi… [+2789 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals a gene responsible for anthraquinone synthesis in plants - News-Medical.Net", "description": "Anthraquinones are a class of naturally occurring compounds prized for their medicinal properties, as well as for other applications, including ecologically friendly dyes.", "url": "https://www.news-medical.net/news/20201125/Study-reveals-a-gene-responsible-for-anthraquinone-synthesis-in-plants.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fInsulin-620x480.jpg", "publishedAt": "2020-11-25T05:33:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nAnthraquinones are a class of naturally occurring compounds prized for their medicinal properties, as well as for other applications, including ecologic… [+1873 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "School closures caused by COVID-19 may reduce life expectancy in U.S. children - News-Medical.Net", "description": "A team that includes UCLA Fielding School of Public Health researchers has found American children whose educations have been disrupted by the pandemic, even as little as 2-4 months, may face shortened life spans.", "url": "https://www.news-medical.net/news/20201125/School-closures-caused-by-COVID-19-may-reduce-life-expectancy-in-US-children.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fPandemic-620x480.jpg", "publishedAt": "2020-11-25T05:00:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 25 2020\r\nexpectancyA team that includes UCLA Fielding School of Public Health researchers has found American children whose educations have been disrupted by the… [+4948 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "Chloe Booker, Rachel Eddie", "title": "Why some people still wear masks outside when they're no longer a must - The Age", "description": "Under the new rules, Victorians don't need to wear masks outdoors if they can socially distance. But it's become a force of habit for some.", "url": "https://www.theage.com.au/national/victoria/why-some-people-still-wear-masks-outside-when-they-re-no-longer-a-must-20201124-p56hhu.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.325%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_392/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/70728faae3085e54e580d5c33cd5a7983b1b5054", "publishedAt": "2020-11-25T04:51:00Z", "content": "Heng The, who was wearing a mask on St Georges Road after visiting the North Fitzroy Library, was also keeping hers on because it was easier than taking it off. But she said she would probably stop w… [+3519 chars]"}, {"source": {"id": null, "name": "Ubergizmo"}, "author": "Tyler Lee", "title": "Researchers Develop Drug To Help The Healing Process By Mimicking Inflammation - Ubergizmo", "description": "If you’ve ever wondered why during an injury, certain parts of our bodies become inflamed, it is because this is our body’s natural response. The idea is that the swelling helps increase blood flow to an area to help with the healing process, and this is a co…", "url": "https://www.ubergizmo.com/2020/11/drug-help-healing-mimic-inflammation/", "urlToImage": "https://i0.wp.com/cdnssl.ubergizmo.com/wp-content/uploads/2018/02/doctor-health-science.jpg", "publishedAt": "2020-11-25T02:25:00Z", "content": "If you’ve ever wondered why during an injury, certain parts of our bodies become inflamed, it is because this is our body’s natural response. The idea is that the swelling helps increase blood flow t… [+1362 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ash Cant", "title": "Devastating truth behind photos of what look like white shipping containers - Yahoo News Australia", "description": "A startling truth has emerged about what is being stored in the large white boxes photographed in a Covid epicentre.", "url": "https://au.news.yahoo.com/devastating-truth-behind-photos-what-look-like-white-shipping-containers-013738623.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2020-11/184ceb90-2eb3-11eb-b677-a9f828878d3a", "publishedAt": "2020-11-25T01:37:00Z", "content": "Hundred of corpses of those who died in the first wave of New York Citys Covid peak remain in freezer trucks.\r\nStartling images of the makeshift container morgues were taken in Brooklyn, New York, on… [+3133 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New findings support benefits of bariatric surgery in severely obese adolescents - News-Medical.Net", "description": "Eighty to 90% of adolescents benefit from lasting weight loss following bariatric surgery, and most experience the remission of obesity-related complications such as elevated blood pressure, high cholesterol, type 2 diabetes and musculoskeletal pain, among ot…", "url": "https://www.news-medical.net/news/20201124/Study-Examines-Remission-Of-Obesity-Related-Complications-In-Teens-After-Bariatric-Surgery.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2017%2f3%2fObesity-Jakub_Cejpek_ead0fb8492f0437f96e9fd842630990c-620x480.jpg", "publishedAt": "2020-11-25T01:27:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 24 2020\r\nEighty to 90% of adolescents benefit from lasting weight loss following bariatric surgery, and most experience the remission of obesity-related complica… [+3552 chars]"}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": "Professor Rodney Sinclair", "title": "Your Health | Tackling hair loss head on | Guardian News | Nambucca Heads, NSW - Nambucca Guardian News", "description": "Technology has come a long way in recent years to help treat balding.", "url": "https://www.nambuccaguardian.com.au/story/7022072/tackling-hair-loss-head-on/", "urlToImage": "https://www.nambuccaguardian.com.au/images/transform/v1/crop/frm/jess.wallace/b974c576-9bf2-460b-90d6-ad77318eb821.jpg/r0_208_3977_2455_w1200_h678_fmax.jpg", "publishedAt": "2020-11-25T00:00:00Z", "content": "Q: Why would I consider a hair transplantation procedure?\r\nThese days there are a lot of treatments for those concerned about their hair loss. Hair transplantation is mostly used for male pattern bal… [+2976 chars]"}, {"source": {"id": null, "name": "Sydney.edu.au"}, "author": null, "title": "An exercise approach to managing Type 2 Diabetes - News - The University of Sydney", "description": "This research will examine the effects of an adaptive exercise approach to improving health for individuals with Type 2 Diabetes.", "url": "https://www.sydney.edu.au/research/volunteer-for-research-study/weight-loss/an-exercise-approach-to-managing-type-2-diabetes.html", "urlToImage": "https://www.sydney.edu.au/content/dam/corporate/assets/default-hero.jpg", "publishedAt": "2020-11-24T22:33:09Z", "content": "This study will specifically examine the effect of adapting an exercise program on blood glucose management, abdominal fat and cardiorespiratory health.\r\nFor this trial, you will be randomized into o… [+689 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Three health care organizations call for governmental action during COVID-19 pandemic - Mirage News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMicWh0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL3RocmVlLWhlYWx0aC1jYXJlLW9yZ2FuaXphdGlvbnMtY2FsbC1mb3ItZ292ZXJubWVudGFsLWFjdGlvbi1kdXJpbmctY292aWQtMTktcGFuZGVtaWMv0gEA?oc=5", "urlToImage": null, "publishedAt": "2020-11-24T20:04:15Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Which speaker are you listening to? Hearing aid of the future uses brainwaves to find out - Science Daily", "description": "In a noisy room with many speakers, hearing aids can suppress background noise, but they have difficulties isolating one voice - that of the person you're talking to at a party, for instance. Researchers have now addressed that issue with a technique that use…", "url": "https://www.sciencedaily.com/releases/2020/11/201124092144.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2020-11-24T19:14:08Z", "content": "In a noisy room with many speakers, hearing aids can suppress background noise, but they have difficulties isolating one voice -- that of the person you're talking to at a party, for instance. KU Leu… [+2800 chars]"}, {"source": {"id": null, "name": "Moreechampion.com.au"}, "author": "Gabrielle Tetrault-Farber", "title": "Russia fur company mulls vaccinating minks - Moree Champion", "description": "The acting head of a big Russian state fur company has floated the idea of vaccinating minks to prevent the spread of COVID-19 after millions of infected mink...", "url": "https://www.moreechampion.com.au/story/7027326/russia-fur-company-mulls-vaccinating-minks/?cs=11076", "urlToImage": "https://www.moreechampion.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4bf3aa57-95e6-4faa-ab9e-9137ca1e001a.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-11-24T19:12:00Z", "content": "The acting head of a big Russian state fur company has floated the idea of vaccinating minks to prevent the spread of COVID-19 after millions of infected minks were destroyed in Denmark and cases of … [+969 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Eating dried fruit may be linked with better diet quality and health markers - EurekAlert", "description": "Penn State research found that people who ate dried fruit were generally healthier than those who did not, and on days when people ate dried fruit they consumed greater amounts of some key nutrients than on days when they skipped. However, they also found tha…", "url": "https://www.eurekalert.org/pub_releases/2020-11/ps-edf112420.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2020-11-24T18:59:24Z", "content": "UNIVERSITY PARK, Pa. -- Don't be afraid to toss a handful of raisins or dried apples in your Thanksgiving stuffing this year -- a new Penn State study has found that dried fruit may be connected with… [+4530 chars]"}, {"source": {"id": null, "name": "Cardiovascularbusiness.com"}, "author": null, "title": "Aortic stenosis patients with AFib may experience more complications after valve replacement - Cardiovascular Business", "description": null, "url": "https://www.cardiovascularbusiness.com/topics/electrophysiology-arrhythmia/aortic-stenosis-afib-aortic-vale-replacement-tavr-savr", "urlToImage": "https://www.cardiovascularbusiness.com/sites/default/files/styles/facebook/public/2018-08/istock-doctorpatient.jpg?itok=Cea0euxA", "publishedAt": "2020-11-24T18:24:16Z", "content": "Atrial fibrillation (AFib) increases the likelihood that aortic stenosis (AS) patients will experience in-hospital complications, according to new findings published in the American Journal of Cardio… [+717 chars]"}, {"source": {"id": null, "name": "The Canberra Times"}, "author": "Daniella White", "title": "Australia's coronavirus vaccination program to start from March - The Canberra Times", "description": "The federal government says the vaccine rollout is on track to start from March.", "url": "https://www.canberratimes.com.au/story/7026591/when-will-canberrans-be-able-to-access-a-covid-19-vaccine/", "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/fdcx/doc6vh6dtpg5mu1n8ry12ir.jpg/r9_0_2207_1242_w1200_h678_fmax.jpg", "publishedAt": "2020-11-24T17:30:00Z", "content": ""}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Margie Zable Fisher, Samantha Cassetty", "title": "Kickstart your week with this healthy vegan meal plan recommended by a registered dietician - Business Insider Australia", "description": "According to the American Academy of Nutrition and Dietetics, well-planned vegan diets are healthy for people at all stages of life, including children and pregnant women.", "url": "https://www.businessinsider.com.au/vegan-meal-plan-2020-11", "urlToImage": "https://i.insider.com/5fbc17a732f2170011f70b8e", "publishedAt": "2020-11-24T17:09:41Z", "content": "<ul><li>\r\nA healthy vegan diet should consist of nutrient-dense whole foods, like fresh fruits and vegetables, as well as plant-based proteins from foods like beans, nuts, and legumes.\r\n</li><li>\r\nB1… [+10814 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Technology used for screening liquids can be adapted to provide rapid COVID-19 testing - News-Medical.Net", "description": "Loughborough University researchers are hoping a technology they developed to quickly screen liquids for microorganisms can be adapted to provide rapid testing for Covid-19.", "url": "https://www.news-medical.net/news/20201124/Technology-used-for-screening-liquids-can-be-adapted-to-provide-rapid-COVID-19-testing.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2017%2f2%2fCola_in_glass_with_ice_cubes_on_white_background_-_Domnitsky_c52407fde7b3426fb37d467a46ab9331-620x480.jpg", "publishedAt": "2020-11-24T13:41:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 24 2020\r\nLoughborough University researchers are hoping a technology they developed to quickly screen liquids for microorganisms can be adapted to provide rapid … [+3407 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Antibodies from COVID-19 infection protect patients for six months - Drug Target Review", "description": "A study in healthcare workers has shown that antibodies from COVID-19 infection protect individuals for at least six months.", "url": "https://www.drugtargetreview.com/news/76880/antibodies-from-previous-covid-19-infection-protect-patients-for-six-months/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/COVID-19-antibody.jpg", "publishedAt": "2020-11-24T12:33:25Z", "content": "Posted: 24 November 2020 | Victoria Rees (Drug Target Review) | No comments yet\r\nA study in healthcare workers has shown that antibodies from COVID-19 infection protect individuals from reinfection f… [+2719 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Tarantula Toxin Could Help To Design Drugs for Chronic Pain - Technology Networks", "description": "A new high-resolution cryo-electron microscopy study shows how the  Chinese tarantula stinger quickly locks voltage sensors on sodium channels, the tiny pores on cell membranes that create electrical currents and generate signals to operate nerves and muscles…", "url": "https://www.technologynetworks.com/drug-discovery/news/tarantula-toxin-could-help-to-design-drugs-for-chronic-pain-343152", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/tarantula-toxin-could-help-to-design-drugs-for-chronic-pain-343152.jpg?cb=20201124", "publishedAt": "2020-11-24T09:05:56Z", "content": "Oversized, hairy tarantulas may be unsightly and venomous, but surprisingly their hunter toxin may hold answers to better control of chronic pain.\r\nA bird-catching Chinese tarantula bite contains a s… [+4020 chars]"}, {"source": {"id": null, "name": "Illawarra Mercury"}, "author": "Lisa Wachsmuth", "title": "Gastro warning at childcare centres in Illawarra, and across NSW - Illawarra Mercury", "description": "More than 480 children and 120 staff have been affected by the outbreaks.", "url": "https://www.illawarramercury.com.au/story/7027182/gastro-warning-at-childcare-centres-in-illawarra-and-across-nsw/", "urlToImage": "https://www.illawarramercury.com.au/images/transform/v1/crop/frm/ijdZyfj2fEyefUgYc2ivkc/bac950bb-7c9e-4d8b-988b-2497a8f61fe9.jpg/r1_0_1199_677_w1200_h678_fmax.jpg", "publishedAt": "2020-11-24T09:00:00Z", "content": ""}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Tracing the flow of cerebrospinal fluid - Phys.org", "description": "Swelling is one of the most dangerous and immediate consequences of a brain injury or stroke. Doctors have long known about the dangers of swelling, which has traditionally been blamed on ruptured blood vessels. New research suggests the brain's other plumbin…", "url": "https://phys.org/news/2020-11-cerebrospinal-fluid.html", "urlToImage": "https://phys.b-cdn.net/tmpl/v6/img/medx308px.png", "publishedAt": "2020-11-24T08:51:24Z", "content": "Swelling is one of the most dangerous and immediate consequences of a brain injury or stroke. Doctors have long known about the dangers of swelling, which has traditionally been blamed on ruptured bl… [+3985 chars]"}, {"source": {"id": null, "name": "Innovationorigins.com"}, "author": "Petra Wiesmayer", "title": "Influenza drug prevents SARS-CoV-2 from invading host cells - Innovation Origins", "description": "International scientists have discovered that aprotinin can prevent the SARS-CoV-2 virus from entering host cells.", "url": "https://innovationorigins.com/influenza-drug-prevents-sars-cov-2-from-invading-host-cells/", "urlToImage": "https://innovationorigins.com/app/uploads/2020/11/vaccine-5755081_1920-1.jpg", "publishedAt": "2020-11-24T08:00:00Z", "content": "The corona pandemic is still raging around the globe. And it is still causing record numbers of infections and disease-related deaths on a daily basis. At the same time, there are new glimmers of hop… [+2122 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "Melissa Cunningham, Rachael Dexter", "title": "With no active cases, Victoria is days away from 'eliminating' COVID-19 - The Age", "description": "Victoria has recorded zero active cases for the first time in almost nine months and is just days away from being officially declared virus free.", "url": "https://www.theage.com.au/national/victoria/with-no-active-cases-victoria-is-days-away-from-eliminating-covid-19-20201124-p56hi5.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.19935993975903615%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_54/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/f5b094efdfe5327a0c628646e619ae207c7c8e63", "publishedAt": "2020-11-24T07:18:00Z", "content": "The two milestones are a far cry from the peak of the second wave of the virus in August, when the number of new cases topped 725 in one day. Melbourne was locked down for months and restrictions wer… [+4535 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "FairJourney Biologics and IONTAS sign agreement with Pandion Therapeutics to discover antibodies - News-Medical.net", "description": "FairJourney Biologics S.A (FJB) and IONTAS Limited, leaders in the discovery and optimization of VHH and fully human antibodies, today announced they have signed an agreement to discover antibodies with Pandion Therapeutics.", "url": "https://www.news-medical.net/news/20201124/FairJourney-Biologics-and-IONTAS-sign-agreement-with-Pandion-Therapeutics-to-discover-antibodies.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2020%2f11%2fUntitled-6.jpg", "publishedAt": "2020-11-24T06:23:00Z", "content": "FairJourney Biologics S.A (FJB) and IONTAS Limited (IONTAS), leaders in the discovery and optimization of VHH and fully human antibodies, today announced they have signed an agreement to discover ant… [+2171 chars]"}, {"source": {"id": null, "name": "Illawarra Mercury"}, "author": "Gary Bentley", "title": "Mental Health | Recognising that anxiety is more than just stress or nervousness - Illawarra Mercury", "description": "Research shows 37 per cent of people who seek support for anxiety had already been experiencing symptoms for longer than 12 months.", "url": "https://www.illawarramercury.com.au/story/7021592/finding-the-courage-to-ask-for-help-with-anxiety/?cs=24", "urlToImage": "https://www.illawarramercury.com.au/images/transform/v1/crop/frm/jess.wallace/e72521ab-79fb-463f-9c91-db56ffcb71a3.jpg/r19_290_7660_4607_w1200_h678_fmax.jpg", "publishedAt": "2020-11-24T06:10:16Z", "content": ""}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Development, Performance Evaluation and Clinical Application of A Rapid SARS-CoV-2 IgM and IgG Test Kit Based on Automated Fluorescence Immunoassay - DocWire News", "description": "J Med Virol. 2020 Nov 24. doi: 10.1002/jmv.26696. Online ahead of print.ABSTRACTThe ongoing COVID-19 epidemic has made a huge impact on health, economies,", "url": "https://www.docwirenews.com/abstracts/development-performance-evaluation-and-clinical-application-of-a-rapid-sars-cov-2-igm-and-igg-test-kit-based-on-automated-fluorescence-immunoassay/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2020-11-24T06:00:00Z", "content": "J Med Virol. 2020 Nov 24. doi: 10.1002/jmv.26696. Online ahead of print.\r\nABSTRACT\r\nThe ongoing COVID-19 epidemic has made a huge impact on health, economies, and societies all over the world. Althou… [+1602 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Brain activity detected in newborn baby may lead to rehabilitation for injured brains - News-Medical.Net", "description": "Researchers from King's College London have identified the brain activity for the first time in a newborn baby when they are learning an association between different types of sensory experiences.", "url": "https://www.news-medical.net/news/20201124/Brain-activity-detected-in-newborn-baby-may-lead-to-rehabilitation-for-injured-brains.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fArtificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2020-11-24T05:57:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 24 2020\r\nResearchers from King's College London have identified the brain activity for the first time in a newborn baby when they are learning an association bet… [+3664 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jasmine Hines", "title": "Tuberculosis diagnosis in Rockhampton aged care worker sparks widespread screening of residents, staff - ABC News", "description": "A staff member at a Rockhampton aged care facility has been diagnosed with pulmonary tuberculosis, sending 29 residents and 42 staff of the facility through screening.", "url": "https://www.abc.net.au/news/2020-11-24/aged-care-staffer-diagnosed-with-tuberculosis/12915392", "urlToImage": "https://www.abc.net.au/cm/rimage/12915458-16x9-large.jpg?v=3", "publishedAt": "2020-11-24T05:44:00Z", "content": "A staff member at a Rockhampton aged care facility has been diagnosed with pulmonary tuberculosis, triggering screenings for the infectious disease in residents and staff.\r\nKey points:\r\n<ul><li>29 re… [+3876 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "Choose your poison: What your drink of choice is doing to you - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-11-24T05:32:00Z", "content": null}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Trinity researchers discover how the brain 're-wires' after disease - Science Codex", "description": null, "url": "https://www.sciencecodex.com/trinity-researchers-discover-how-brain-re-wires-after-disease-661888", "urlToImage": null, "publishedAt": "2020-11-24T05:00:00Z", "content": "Trinity College researchers are studying how the brain re-wires itself in neurological disease. The team is building treatments for today's more common global conditions like Motor Neurone Disease (M… [+3808 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Treatment shows reduction in heart failure after myocardial infarction - Science Codex", "description": null, "url": "https://www.sciencecodex.com/treatment-shows-reduction-heart-failure-after-myocardial-infarction-661868", "urlToImage": null, "publishedAt": "2020-11-24T05:00:00Z", "content": "While there are therapies to aid in overall heart health, there are very few preventative therapies for heart failure after a significant heart attack, a serious condition that has a very significant… [+3195 chars]"}, {"source": {"id": null, "name": "Science Codex"}, "author": null, "title": "Hormone found to switch off hunger could help tackle obesity - Science Codex", "description": null, "url": "https://www.sciencecodex.com/hormone-found-switch-hunger-could-help-tackle-obesity-661871", "urlToImage": null, "publishedAt": "2020-11-24T05:00:00Z", "content": "A hormone that can suppress food intake and increase the feeling of fullness in mice has shown similar results in humans and non-human primates, says a new study published today in eLife.\r\nThe hormon… [+3274 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers are working on new project to develop brain implant for blind people - News-Medical.Net", "description": "Implanting a device into the brain to generate a rough perception of sight for people with blindness may sound like the stuff of science fiction, but researchers from The University of Texas at Dallas and partner institutions aim to make that vision a reality.", "url": "https://www.news-medical.net/news/20201123/Researchers-are-working-on-new-project-to-develop-brain-implant-for-blind-people.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fArtificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2020-11-24T04:33:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nImplanting a device into the brain to generate a rough perception of sight for people with blindness may sound like the stuff of science fiction, but re… [+3157 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Special activity trackers could be used to detect the early sign of heart problems - News-Medical.Net", "description": "Special activity trackers can be used to fairly accurately determine the respiratory rate of people while they sleep.", "url": "https://www.news-medical.net/news/20201123/Special-activity-trackers-could-be-used-to-detect-the-early-sign-of-heart-problems.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fRespiratory-620x480.jpg", "publishedAt": "2020-11-24T04:13:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nSpecial activity trackers can be used to fairly accurately determine the respiratory rate of people while they sleep. This is the result of a new study … [+3740 chars]"}, {"source": {"id": null, "name": "Rask Media"}, "author": null, "title": "Why the Imugene (ASX:IMU) share price has soared over 300% this year - Rask Media", "description": "The share price of biotechnology company Imugene Limited (ASX: IMU) has been on a tear this year. Here's why the Imugene share price is flying.", "url": "https://www.raskmedia.com.au/2020/11/24/imugene-asx-imu-share-price-is-up-over-300-this-year/", "urlToImage": "https://www.raskmedia.com.au/wp-content/uploads/2018/01/flyingup-1024x683.jpg", "publishedAt": "2020-11-24T03:53:46Z", "content": null}, {"source": {"id": null, "name": "Popsugar.com.au"}, "author": "Angela Law", "title": "Confused About What Pelvic-Floor Trainers Do? We Asked 4 Experts to Explain Whether You Need One - POPSUGAR Health and Fitness Australia", "description": "We spoke to four experts to explain what devices like the Elvie Pelvic Floor Trainer do and whether you need one to strengthen your pelvic floor.", "url": "https://www.popsugar.com.au/fitness/pelvic-floor-trainer-expert-opinion-and-review-48001311", "urlToImage": "https://media1.popsugar-assets.com/files/thumbor/951dn0HvRIwhqAQqk0Ulen4p0R0/0x162:1093x736/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-:fill-!white!-/2020/07/15/516/n/37141241/b967d0de5f0ee71d3951d1.44690986_.jpg", "publishedAt": "2020-11-24T02:55:05Z", "content": "You may have heard of kegels an exercise where you squeeze your pelvic floor muscles repeatedly to make them stronger. To date, they've been hailed as the cure-all for a weak pelvic floor, promising … [+5935 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop a new sensor to measure weak magnetic signals in the brain - News-Medical.Net", "description": "Scientists at the University of Birmingham have developed a new sensor to measure weak magnetic signals in the brain, which has the potential to increase understanding of connectivity in the brain, and detect signs of traumatic brain injury, dementia and schi…", "url": "https://www.news-medical.net/news/20201123/Researchers-develop-a-new-sensor-to-measure-weak-magnetic-signals-in-the-brain.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2016%2f3%2fArtificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2020-11-24T02:25:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nScientists at the University of Birmingham have developed a new sensor to measure weak magnetic signals in the brain, which has the potential to increas… [+3691 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Marinomed to initiate clinical trial with Carragelose for preventing COVID19 in frontline healthcare staff - News-Medical.Net", "description": "Marinomed Biotech AG, a globally operating biopharmaceutical company, announced today plans to initiate a Phase IV clinical trial with Carragelose (iota-carrageenan).", "url": "https://www.news-medical.net/news/20201123/Marinomed-to-initiate-clinical-trial-with-Carragelose-for-preventing-COVID19-in-frontline-healthcare-staff.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2017%2f1%2fHEALTHCARE_shutterstock_493063267_99928a5e003043f896998f01b025b9f6-620x480.jpg", "publishedAt": "2020-11-24T02:18:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nMarinomed Biotech AG, a globally operating biopharmaceutical company, announced today plans to initiate a Phase IV clinical trial with Carragelose® (iot… [+2242 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Inga Neilsen", "title": "Ultrasound reveals tangle of roundworms in man's stomach - 9News", "description": "<p>The 35 centimetre long creature is predicted to be inside 800 million to 1.2 billion people worldwide.</p>", "url": "https://www.9news.com.au/world/science-discovery-ultrasound-reveals-tangle-of-roundworms-in-mans-stomach/8312a840-1404-4c9e-98ea-16d1e908a10a", "urlToImage": "https://imageresizer.static9.net.au/LAqVNN523VPOnHFZsjLgSdz1JBU=/2x21:467x283/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F2175040a-f00a-4b5a-9c52-c29dc142e48b", "publishedAt": "2020-11-24T02:02:00Z", "content": "Auto News: Beat the price rises: currency pressure poised to push up the cost of cars in 2020 - caradvice.com.au"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cutting edge technology used to bioprint miniature human kidneys in the lab - News-Medical.Net", "description": "Researchers have used cutting edge technology to bioprint miniature human kidneys in the lab, paving the way for new treatments for kidney failure and possibly lab-grown transplants.", "url": "https://www.news-medical.net/news/20201123/Cutting-edge-technology-used-to-bioprint-miniature-human-kidneys-in-the-lab.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2018%2f5%2fshutterstock_By_Kateryna_Kon_20892d9e8c6840cc91adb73384976de7-620x480.jpg", "publishedAt": "2020-11-24T01:11:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nResearchers have used cutting edge technology to bioprint miniature human kidneys in the lab, paving the way for new treatments for kidney failure and p… [+3435 chars]"}, {"source": {"id": null, "name": "BusinessGhana"}, "author": null, "title": "Covid-19: Oxford University vaccine is highly effective - BusinessGhana", "description": "The coronavirus vaccine developed by the University of Oxford is highly effective at stopping people developing Covid-19 symptoms, a large trial...", "url": "https://www.businessghana.com/site/news/general/227376/Covid-19-Oxford-University-vaccine-is-highly-effective", "urlToImage": "https://www.businessghana.com/site/img/../../cms/img/news/2020-11-23-1304291.jpg", "publishedAt": "2020-11-24T00:46:17Z", "content": "The coronavirus vaccine developed by the University of Oxford is highly effective at stopping people developing Covid-19 symptoms, a large trial shows. \r\nInterim data suggests 70% protection, but the… [+5793 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Early, late stages of neurodegeneration are distinct, finds study - News-Medical.Net", "description": "Rice University biochemists Michael Stern and James McNew have studied how neurodegeneration kills cells.", "url": "https://www.news-medical.net/news/20201123/Early-late-stages-of-neurodegeneration-are-distinct-finds-study.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2f163926142-620x480.jpg", "publishedAt": "2020-11-24T00:29:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nRice University biochemists Michael Stern and James McNew have studied how neurodegeneration kills cells. They've conducted countless experiments over m… [+5819 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Chris Smith", "title": "This incredible news makes the coronavirus vaccine updates even more exciting - BGR", "description": "A new coronavirus immunity study offers another promising conclusion for the future of COVID-19 vaccines. COVID-19 survivors mount an immune response that’s detectable in the blood some eight months after infection. Scientists have analyzed B cells in samples…", "url": "https://bgr.com/2020/11/23/coronavirus-immunity-b-cell-study-8-months/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/08/face-mask-public-transportation.jpg?quality=70&strip=all", "publishedAt": "2020-11-23T23:42:00Z", "content": "<ul><li>A new coronavirus immunity study offers another promising conclusion for the future of COVID-19 vaccines.</li><li>COVID-19 survivors mount an immune response that’s detectable in the blood so… [+4476 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Women have better survival rates after lung cancer surgery than men, study shows - News-Medical.Net", "description": "There are known differences in the survival rates of women and men with lung cancer. Researchers at Karolinska Institutet in Sweden set out to investigate potential reasons behind this disparity, such as the presence of other underlying diseases and smoking s…", "url": "https://www.news-medical.net/news/20201123/Women-have-better-survival-rates-after-lung-cancer-surgery-than-men-study-shows.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2f174318220-620x480.jpg", "publishedAt": "2020-11-23T23:12:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 23 2020\r\nThere are known differences in the survival rates of women and men with lung cancer. Researchers at Karolinska Institutet in Sweden set out to investiga… [+3003 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Machine Learning Predicts Onset of Dementia - Mirage News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiR2h0dHBzOi8vd3d3Lm1pcmFnZW5ld3MuY29tL21hY2hpbmUtbGVhcm5pbmctcHJlZGljdHMtb25zZXQtb2YtZGVtZW50aWEv0gEA?oc=5", "urlToImage": null, "publishedAt": "2020-11-23T22:32:14Z", "content": null}, {"source": {"id": null, "name": "Herald Sun"}, "author": "Grant McArthur, Tamsin Rose", "title": "Emotional reunions as Vic-NSW border reopens - Herald Sun", "description": "This coronavirus article is unlocked and free to read in the interest of community health and safety. Save and refresh this article page for updates all day. Get full digital access to trusted news from the Herald Sun and Leader for just $1 a week for the fir…", "url": "https://www.heraldsun.com.au/coronavirus/rolling-coverage-victorians-ready-to-flash-a-smile-as-rules-ease-further/news-story/f1f07803f7e27854c1bd4b1db09428c6", "urlToImage": "https://content.api.news/v3/images/bin/2f848176799d15f30bedabaa71323e48", "publishedAt": "2020-11-23T22:23:00Z", "content": "Lovebirds and families have embraced after four long months apart, with flights resuming as NSW reopened its border to Victorians.This coronavirus article is unlocked and free to read in the interest… [+7267 chars]"}]}