{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A backbone free energy study of SARS-CoV-2 variants of concern - News-Medical.net", "description": "A recent study by scientist Robert Penner at the Institut des Hautes Études Scientifiques in France utilizes free energy calculations to predict effective antiviral targets that are highly conserved, surface-accessible for interaction, and resistant to mutati…", "url": "https://www.news-medical.net/news/20210301/A-backbone-free-energy-study-of-SARS-CoV-2-variants-of-concern.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/2021.02.25.432861v1_-_1200_width.jpg", "publishedAt": "2021-03-01T18:22:00Z", "content": "Each of the three approved vaccines against coronavirus disease 2019 (COVID-19) – Moderna, BioNTech-Pfizer and Oxford-Astrazeneca – generate forms of the spike protein of severe acute respiratory syn… [+4183 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Is transposable element expression affected by SARS-CoV-2 infection? - News-Medical.Net", "description": "A study by researchers in Israel aims to establish whether TE expression is altered in SARS-CoV-2 infected cells, and explores the implications for host immune response.", "url": "https://www.news-medical.net/news/20210301/Is-transposable-element-expression-affected-by-SARS-CoV-2-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/49557550706_221b77c479_k_(2).jpg", "publishedAt": "2021-03-01T18:02:00Z", "content": "A transposable element (TE) is a DNA sequence that is able to change relative position in the genome, and they in fact make up around 50% of the human genome. Most TEs appear to have no effect on the… [+4068 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Protein kinase inhibitors could help treat immunodeficiency in HIV patients - News-Medical.Net", "description": "HIV infections are treated with antiviral drugs which effectively prevent the disease from developing. While pharmacological HIV therapy has advanced considerably, the virus cannot be entirely eliminated from the body with currently available drugs.", "url": "https://www.news-medical.net/news/20210301/Protein-kinase-inhibitors-could-help-treat-immunodeficiency-in-HIV-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2021-03-01T17:46:00Z", "content": "HIV infections are treated with antiviral drugs which effectively prevent the disease from developing. While pharmacological HIV therapy has advanced considerably, the virus cannot be entirely elimin… [+3072 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": null, "title": "Researchers discover balance between two protein counteracting forces in hereditary ataxias - Medical Xpress", "description": "Collaborating with the University of Oxford, Professor Ho Yin Edwin Chan's research team from the School of Life Sciences of The Chinese University of Hong Kong (CUHK) recently unveiled the counteracting relationship between ...", "url": "https://medicalxpress.com/visualstories/2021-03-protein-counteracting-hereditary-ataxias.amp", "urlToImage": null, "publishedAt": "2021-03-01T17:08:28Z", "content": "Prpf19 is capable of degrading toxic expanded SCA3-polyQ proteinProfessor Edwin Chan, Postdoctoral Fellow Dr. Zhefan Stephen Chen, and the team discovered that the nuclear-localized protein Prpf19 is… [+427 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Regular tutorials vital for university students' mental health - The Guardian", "description": "<strong>Letters: </strong>One parent highlights the need for weekly tutorials to pre-empt crises among those studying remotely", "url": "https://amp.theguardian.com/education/2021/mar/01/regular-tutorials-vital-for-university-students-mental-health", "urlToImage": null, "publishedAt": "2021-03-01T16:58:00Z", "content": "One thing that universities could do to stem the downward spiral of student mental health as they continue with remote studies is to ensure regular tutorials are the norm. Three weeks before Christma… [+612 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Paper addresses research needed to understand smoking and COVID-19 - Science Daily", "description": "A new paper discusses how smoking may affect risk for COVID-19 and the types of research that are needed to better understand the link between smoking and COVID-19 risk.", "url": "https://www.sciencedaily.com/releases/2021/03/210301084506.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T16:00:51Z", "content": "A new paper published online in the Annals of the American Thoracic Society discusses how smoking may affect risk for COVID-19 and the types of research that are needed to better understand the link … [+4440 chars]"}, {"source": {"id": null, "name": "Rutherford Daily Voice"}, "author": null, "title": "COVID-19: CT Teachers, Daycare Workers, Those 55-And-Over Start Getting Vaccines - Greenwich Daily Voice", "description": "Access to the coveted COVID-19 vaccine has just expanded in Connecticut, with teachers, daycare workers, and residents over the age of 55 now eligible to make vaccination appointments. As of 12:01 a.m. on Monday, March 1, approximately a h…", "url": "https://dailyvoice.com/connecticut/greenwich/lifestyle/covid-19-ct-teachers-daycare-workers-those-55-and-over-start-getting-vaccines/804120/", "urlToImage": "https://daily-voice-res.cloudinary.com/image/upload/c_limit,e_sharpen,f_auto,q_auto:eco,w_640/Eligibility-Graphic_FINAL_Final005_kbclpx.jpg", "publishedAt": "2021-03-01T15:30:00Z", "content": "Access to the coveted COVID-19 vaccine has just expanded in Connecticut, with teachers, daycare workers, and residents over the age of 55 now eligible to make vaccination appointments. \r\nAs of 12:01 … [+2137 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This is how poor quality carbohydrate diet can lead to heart attack - Times of India", "description": "From a higher risk of heart attacks to strokes, and even death, poor quality of carbohydrate causes a lot of irrecoverable damage.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-is-how-poor-quality-carbohydrate-diet-can-lead-to-heart-attack/photostory/81277250.cms", "urlToImage": "https://static.toiimg.com/photo/81277275.cms", "publishedAt": "2021-03-01T15:02:32Z", "content": "When it comes to a balanced diet plan, an adequate amount of carbohydrates, fats, and sugar is advised to keep diseases at bay. While we all are striving to find a balance, a recent study has pointed… [+270 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Early tracheostomy could reduce recovery time in critical COVID-19, say researchers - News-Medical.Net", "description": "A new study by researchers at the Northwestern University Feinberg School of Medicine, USA, reports the findings of a study on the safety of tracheostomy of critically ill patients and the feasibility of decannulation in most survivors. The researchers view t…", "url": "https://www.news-medical.net/news/20210301/Early-tracheostomy-could-reduce-recovery-time-in-critical-COVID-19-say-researchers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/3/shutterstock_1676283553.jpg", "publishedAt": "2021-03-01T14:29:00Z", "content": "The ongoing coronavirus disease 2019 (COVID-19) pandemic, caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), is primarily a severe pulmonary disease that can be fatal in a si… [+6870 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "Why COVID-19 vaccine distribution methods fall short and 3 ways to improve them - Newswise", "description": "Several proposals have emerged on how to distribute the COVID-19 vaccine, but they fall short in ensuring that the vaccine is distributed fairly. A team includi", "url": "https://www.newswise.com/coronavirus/why-covid-19-vaccine-distribution-methods-fall-short-and-3-ways-to-improve-them", "urlToImage": "https://www.newswise.com/images/new-newswise-logo-square.jpg", "publishedAt": "2021-03-01T14:00:00Z", "content": "Newswise — BINGHAMTON, NY – Several proposals have emerged on how to distribute the COVID-19 vaccine, but they fall short in ensuring that the vaccine is distributed fairly. A team including Binghamt… [+3011 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single cell sequencing opens new avenues for eradicating leukemia at its source: Technology may boost international research efforts to find drugs that eradicate cancer at its source - Science Daily", "description": "Cancer stem cells that elude conventional treatments like chemotherapy drive long-term cancer growth and relapse. These cells are difficult to isolate and study because of their low abundance and similarity to other stem cells. Researchers have created a new …", "url": "https://www.sciencedaily.com/releases/2021/03/210301084512.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-03-01T13:58:35Z", "content": "A new method, described in a study published today in the journal Nature Communications, has the potential to boost international research efforts to find drugs that eradicate cancer at its source.Mo… [+3262 chars]"}, {"source": {"id": null, "name": "Riverineherald.com.au"}, "author": null, "title": "DR Congo confirms three new Ebola cases - Riverine Herald", "description": "", "url": "https://www.riverineherald.com.au/world/2021/03/02/3447992/dr-congo-confirms-three-new-ebola-cases", "urlToImage": "https://res.cloudinary.com/cognitives/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_675,q_auto,w_1200/hxrkspjmdtbrleqtsh22", "publishedAt": "2021-03-01T13:34:00Z", "content": "Three new cases of Ebola have been confirmed in eastern Democratic Republic of Congo, bringing to 11 the number of cases since authorities declared a resurgence of the virus last month.The new cases … [+451 chars]"}, {"source": {"id": null, "name": "Personnel Today"}, "author": "Ashleigh Webber", "title": "NHS to launch mental health hubs for health workers - Personnel Today", "description": "The NHS is set to open 40 dedicated mental health support hubs for healthcare workers across England, which will offer confidential advice for frontline staff who have ‘pushed their minds and bodies to the limit’ over the past year. Staff can access services …", "url": "https://www.personneltoday.com/hr/nhs-mental-health-support-hubs/", "urlToImage": "https://www.personneltoday.com/wp-content/uploads/sites/8/2021/02/shutterstock_1815132977.jpg", "publishedAt": "2021-03-01T12:23:37Z", "content": "The NHS is set to open 40 dedicated mental health support hubs for healthcare workers across England, which will offer confidential advice for frontline staff who have pushed their minds and bodies t… [+3016 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Adam Rogers", "title": "The Raging Evolutionary War Between Humans and Covid-19 - WIRED", "description": "Fighting the pandemic isn’t only about vaccines and drugs. It’s about understanding how viruses mutate and change inside us, and among us.", "url": "https://www.wired.com/story/the-raging-evolutionary-war-between-humans-and-covid-19/", "urlToImage": "https://media.wired.com/photos/60395f5a490220e41e906b90/191:100/w_1280,c_limit/Science_covidevolution_1257547744.jpg", "publishedAt": "2021-03-01T12:00:00Z", "content": "The race is on. Vaccines against the virus that causes Covid-19 are needling into shoulders around the world, the tip-of-the-hypodermic spear of a year-long scientific triumph. But that protean virus… [+4050 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Nanoparticles Help Untangle Alzheimer’s Disease Plaques - Technology Networks", "description": "Brain plaques in Alzheimer's Disease are caused by the amyloid-beta protein. Researchers have provided a new technique for studying amyloid-beta that could have uses in future Alzheimer's treatments.", "url": "https://www.technologynetworks.com/neuroscience/news/nanoparticles-help-untangle-alzheimers-disease-plaques-346101", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/nanoparticles-help-untangle-alzheimers-disease-plaques-346101.jpg?cb=20210301", "publishedAt": "2021-03-01T11:42:47Z", "content": "Scientists are still a long way from being able to treat Alzheimer's Disease, in part because the protein aggregates that can become brain plaques, a hallmark of the disease, are hard to study. The p… [+2646 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "China ‘to provide 400,000 COVID vaccine doses’ to Afghanistan - Al Jazeera English", "description": "Officials say China pledged 400,000 doses of the Sinopharm vaccine, a boost to Afghanistan’s immunisation drive.", "url": "https://www.aljazeera.com/news/2021/3/1/china-to-provide-400000-covid-vaccine-doses-to-afghanistan", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/2021-02-28T104523Z_927217374_RC2M1M9BACKU_RTRMADP_3_HEALTH-CORONAVIRUS-AFGHANISTAN-VACCINE.jpg?resize=1200%2C630", "publishedAt": "2021-03-01T11:35:29Z", "content": "China has pledged to deliver 400,000 doses of Sinopharms COVID-19 vaccine to Afghanistan, Afghan officials said, in a boost for the countrys immunisation campaign, which began last week.\r\nChinas amba… [+1597 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "US$ 64 million to respond to HIV, TB and malaria in Congo - Congo - ReliefWeb", "description": "English News and Press Release on Congo about Contributions, Health, Epidemic and more; published on 01 Mar 2021 by UNAIDS", "url": "https://reliefweb.int/report/congo/us-64-million-respond-hiv-tb-and-malaria-congo", "urlToImage": "https://reliefweb.int/profiles/reliefweb/themes/kobe/images/metatag/disaster-type/epidemic.png", "publishedAt": "2021-03-01T10:56:55Z", "content": "The Global Fund to Fight AIDS, Tuberculosis and Malaria, the Government of Congo and health partners have announced two new grants worth more than US$ 64 million to strengthen prevention and treatmen… [+2177 chars]"}, {"source": {"id": null, "name": "Wales Online"}, "author": "Joe Gammie, PA, Brett Gibbons", "title": "Majority of over-65s in England have now been given first dose of Covid vaccine - Wales Online", "description": "Latest figure comes as nearly two million people aged 60 to 63 in England have been sent letters inviting them to book a jab", "url": "https://www.walesonline.co.uk/news/uk-news/majority-over-65s-england-now-19936658", "urlToImage": "https://i2-prod.walesonline.co.uk/incoming/article19911803.ece/ALTERNATES/s1200/1_Coronavirus-Covid-19-Ysbyty-Enfys-Llandudno-Vaccination-Centre-Feature-Tuesday-9th-February-J.jpg", "publishedAt": "2021-03-01T10:40:40Z", "content": "Nine out of 10 people aged 65 and over in England have received their first Covid jab, it has been confirmed.\r\nNHS England said more than 17 million people had been vaccinated in a matter of weeks, i… [+1795 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Sara Rigby, PA Science", "title": "Pfizer vaccine: Single dose reduces asymptomatic COVID-19 cases four-fold - BBC Focus Magazine", "description": "Researchers says it \"makes hospitals even safer places to be\".", "url": "https://www.sciencefocus.com/news/pfizer-vaccine-single-dose-reduces-asymptomatic-covid-19-cases-four-fold/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2021/03/embedded258173059-crop-d796ade.jpg?quality=90&resize=960,413", "publishedAt": "2021-03-01T10:23:06Z", "content": "A single jab of the Pfizer vaccine gives a four-fold reduction in the number of asymptomatic coronavirus infections, a new study has indicated.\r\nThe new data, from Addenbrookes Hospital in Cambridge,… [+4131 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "The Straits Times/Asia News Network", "title": "Singapore’s COVID-19 vaccination drive boosts hopes for some normalcy - INQUIRER.net", "description": "SINGAPORE — Hopes that life can return to some sort of normalcy is growing stronger by the week, as more Covid-19 vaccination centers spring up across Singapore.\r\n\r\nIt has been about two months", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/03012021-ST_20210301_JTVACCINE01_6364927-ANN-620x413.jpg", "publishedAt": "2021-03-01T09:45:00Z", "content": "By the middle of this month, over 30 vaccination centres will be in operation.ST PHOTO: GAVIN FOO\r\nSINGAPORE Hopes that life can return to some sort of normalcy is growing stronger by the week, as mo… [+9834 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Summer Woolley", "title": "Tarneit, Werribee and Hoppers Crossing issued COVID warning after fragments detected in wastewater - 7NEWS.com.au", "description": "Residents and recent visitors are being urged to remain vigilant and monitor for signs of COVID-19.", "url": "https://7news.com.au/lifestyle/health-wellbeing/tarneit-werribee-and-hoppers-crossing-issued-covid-warning-after-fragments-detected-in-wastewater-c-2264404", "urlToImage": "https://images.7news.com.au/publication/C-2264404/cddd41c198fe773536c7fb8b2e6d66365abcbe01-16x9-x0y283w5464h3074.jpg?imwidth=1024", "publishedAt": "2021-03-01T09:18:00Z", "content": "Residents and recent visitors of three suburbs in Melbournes west are being urged to remain on high alert for signs of COVID-19.\r\nThe Department of Health issued a fresh warning on Monday after viral… [+1177 chars]"}, {"source": {"id": null, "name": "Sheppnews.com.au"}, "author": null, "title": "Ross River virus spike - Shepparton News", "description": "", "url": "https://www.sheppnews.com.au/news/2021/03/01/3432737/ross-river-virus-spike", "urlToImage": "https://res.cloudinary.com/cognitives/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_766,q_auto,w_1200/obxlnrdhfodrtn36ve7o", "publishedAt": "2021-03-01T08:35:48Z", "content": "A spike in cases of Ross River virus has prompted a warning for people to continue to protect themselves from mosquito bites.Victoria’s Department of Health executive director for communicable diseas… [+1876 chars]"}, {"source": {"id": null, "name": "Gold Coast Bulletin"}, "author": null, "title": "COVID-19 Gold Coast: When mass vaccination centres will open, GPs to administer AstraZeneca, after 1500 frontline staff vaccinated - Gold Coast Bulletin", "description": "Subscribe to the Gold Coast Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.goldcoastbulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-03-01T08:26:00Z", "content": null}, {"source": {"id": null, "name": "Herald Sun"}, "author": "Shannon Deery, Mandy Squires and Tamsin Rose", "title": "Rolling COVID coverage: No new cases as Victoria’s vaccine rollout ramps up - The Mercury", "description": "Victoria’s state of emergency looks set to be extended following successful negotiations with the Greens and key cross benchers.", "url": "https://www.heraldsun.com.au/coronavirus/rolling-coverage-victorias-vaccine-rollout-ramps-up-as-astrazeneca-doses-land/news-story/a57160cbc6fb0d9d1754ae47bd939ce2", "urlToImage": "https://cdn.newsapi.com.au/image/v1/b3ef29c7dbc0020dccce705b6afd58e1", "publishedAt": "2021-03-01T08:02:00Z", "content": "Victorias state of emergency looks set to be extended following successful negotiations with the Greens and key cross benchers.\r\nA raft of government amendments will tonight be considered by Cabinet … [+4589 chars]"}, {"source": {"id": null, "name": "Thecourier.com.au"}, "author": "Michelle Smith", "title": "COVID lockdowns saw fewer people screened for cancer and experts warn of a spike in cases in the coming months - Ballarat Courier", "description": "Experts have warned that thousands of cancer diagnoses were delayed or missed during COVID-19 restrictions, putting lives at risk.", "url": "https://www.thecourier.com.au/story/7146659/warning-of-potential-spike-in-cancer-diagnoses/", "urlToImage": "https://www.thecourier.com.au/images/transform/v1/crop/frm/michelle.smith/6b8f4569-a4a6-415a-a528-c77e232d7b12.JPG/r12_252_4916_3023_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T08:00:00Z", "content": ""}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ross McGuinness", "title": "Have your say: How concerned are you about COVID variants in the UK? - Yahoo News Australia", "description": "Six cases involving a Brazilian strain have been identified in the UK.", "url": "https://au.news.yahoo.com/poll-have-your-say-concerned-covid-variants-uk-075251818.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/WUja1Rf3ahKMVXAje2XJoQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xNDEw/https://s.yimg.com/os/creatr-uploaded-images/2021-02/b9a2e5a0-6f66-11eb-9cf7-7192acdf9ec2", "publishedAt": "2021-03-01T07:52:51Z", "content": "Signs directing airline passengers to a COVID-19 testing centre at London Heathrow Airport. (AP)\r\nThe race is on to identify one of the first people in the UK believed to have contracted a Brazilian … [+2083 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Japan receives 3rd batch of Pfizer COVID-19 vaccine - Japan Today", "description": "The third batch of Pfizer Inc's COVID-19 vaccine arrived in Japan on Monday as the country prepares to expand its inoculation program for health care workers. The shipment of up to 526,500 doses of the first vaccine against the novel coronavirus that Japan ha…", "url": "https://japantoday.com/category/national/corrected-japan-receives-3rd-batch-of-pfizer-covid-19-vaccine", "urlToImage": null, "publishedAt": "2021-03-01T07:00:00Z", "content": "The third batch of Pfizer Inc's COVID-19 vaccine arrived in Japan on Monday as the country prepares to expand its inoculation program for health care workers.\r\nThe shipment of up to 526,500 doses of … [+1948 chars]"}, {"source": {"id": null, "name": "Mygc.com.au"}, "author": "AAP", "title": "Experts doubt October vaccination target – myGC.com.au - myGC.com.au", "description": "Medical experts believe the federal government's coronavirus vaccination target will be hard to achieve unless jab rates are dramatically ramped up. The Morrison government has set October as the goal…", "url": "https://www.mygc.com.au/experts-doubt-october-vaccination-target/", "urlToImage": "https://www.mygc.com.au/wp-content/uploads/2021/02/shutterstock_1859217856.jpg", "publishedAt": "2021-03-01T06:45:46Z", "content": "Medical experts believe the federal government’s coronavirus vaccination target will be hard to achieve unless jab rates are dramatically ramped up.\r\nThe Morrison government has set October as the go… [+2518 chars]"}, {"source": {"id": null, "name": "Denipt.com.au"}, "author": null, "title": "March start for local COVID-19 vaccination - Deniliquin Pastoral Times", "description": "", "url": "https://www.denipt.com.au/cobram-news/2021/03/01/3439081/march-start-for-local-covid-19-vaccination", "urlToImage": "https://res.cloudinary.com/cognitives/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_801,q_auto,w_1200/t8xzfdxhtovlpe309umi", "publishedAt": "2021-03-01T06:07:40Z", "content": "NCN Health is working with Goulburn Valley Health to safely deliver the COVID-19 vaccine, first to the priority groups, then to the broader community.GV Health has been nominated as a ‘vaccine hub’ b… [+3682 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Why COVID-19 vaccine distribution methods fall short - Malaysia Sun", "description": "Several proposals have emerged on how to distribute the COVID-19 vaccine but they fall short in ensuring that the vaccine is distributed fairly A team of rese", "url": "https://www.bignewsnetwork.com/news/267971135/why-covid-19-vaccine-distribution-methods-fall-short", "urlToImage": "https://cdn.bignewsnetwork.com/ani1614578420.jpg", "publishedAt": "2021-03-01T05:55:00Z", "content": "New York [US], March 1 (ANI): Several proposals have emerged on how to distribute the COVID-19 vaccine, but they fall short in ensuring that the vaccine is distributed fairly. A team of researchers s… [+3070 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why COVID-19 Vaccine Distribution Methods Fall Short + 3 Ways to Improve Them - SciTechDaily", "description": "Several proposals have emerged on how to distribute the COVID-19 vaccine, but they fall short in ensuring that the vaccine is distributed fairly. A team including Binghamton University professor Nicole Hassoun suggests three ways to more fairly and effectivel…", "url": "https://scitechdaily.com/why-covid-19-vaccine-distribution-methods-fall-short-3-ways-to-improve-them/", "urlToImage": "https://scitechdaily.com/images/Vaccine-Distribution.jpg", "publishedAt": "2021-03-01T05:43:26Z", "content": "Several proposals have emerged on how to distribute the COVID-19 vaccine, but they fall short in ensuring that the vaccine is distributed fairly. A team including Binghamton University professor Nico… [+2973 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Ill traveller from Auckland met by ambulance at Queenstown Airport - Stuff.co.nz", "description": "A person with “mild flu-like symptoms” was met by an ambulance after flying from Auckland to Queenstown on Monday, but has since test negative for Covid-19.", "url": "https://www.stuff.co.nz/national/124398071/ill-traveller-from-auckland-tests-negative-for-covid19-after-flying-to-queenstown", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/o/t/u/v/image.related.StuffLandscapeSixteenByNine.1420x800.222a5z.png/1614583223949.jpg", "publishedAt": "2021-03-01T04:11:00Z", "content": "A person with mild flu-like symptoms was met by an ambulance after flying from Auckland to Queenstown on Monday.\r\n However, the Ministry of Health has since confirmed the person has tested negative f… [+952 chars]"}, {"source": {"id": null, "name": "Liberal.org.au"}, "author": null, "title": "Expanding access to life changing medicines for thousands of Australians - NSW Liberal Party", "description": "Thousands of Australians with multiple sclerosis, asthma and diabetes will benefit from the listing or extension of several medications on the Pharmaceutical Benefits Scheme (PBS),", "url": "https://nsw.liberal.org.au/Shared-Content/News/2021/Expanding-access-to-life-changing-medicines-for-thousands-of-Australians", "urlToImage": "https://nsw.liberal.org.au/LPNSW/media/General/NewsLarge/Arthritis-Medication-1168x656.jpg?ext=.jpg", "publishedAt": "2021-03-01T03:57:54Z", "content": "Thousands of Australians with multiple sclerosis, asthma and diabetes will benefit from the listing or extension of several medications on the Pharmaceutical Benefits Scheme (PBS), bringing further s… [+2215 chars]"}, {"source": {"id": null, "name": "Modern Ghana"}, "author": "Modern Ghana", "title": "Covid vaccine acceptance rises in some countries: study - Modern Ghana", "description": "Willingness to get a Covid-19 vaccine is on the rise compared to last year, a survey of six industrialised countries published on Monday showed.", "url": "https://www.modernghana.com/news/1064740/covid-vaccine-acceptance-rises-in-some-countries.html", "urlToImage": "https://cdn.modernghana.com/images/content/afp_getting_more_popular_or_at_least_less_unpopular.jpg", "publishedAt": "2021-03-01T01:55:00Z", "content": "Willingness to get a Covid-19 vaccine is on the rise compared to last year, a survey of six industrialised countries published on Monday showed.\r\nMore people in the United Kingdom, the United States … [+1528 chars]"}, {"source": {"id": null, "name": "Courier Mail"}, "author": null, "title": "Queensland records two new COVID-19 cases - Courier Mail", "description": "Subscribe to The Courier-Mail to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.couriermail.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-03-01T01:23:29Z", "content": null}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": "Tiffanie Turnbull", "title": "MS treatment drugs Zeprosia listed on PBS | Guardian News | Nambucca Heads, NSW - Nambucca Guardian News", "description": "Thousands of Australians living with multiple sclerosis will have access to another affordable treatment option, with a new drug added to the Pharmaceutical B...", "url": "https://www.nambuccaguardian.com.au/story/7147154/ms-treatment-drugs-zeposia-listed-on-pbs/", "urlToImage": "https://www.nambuccaguardian.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4feb7ec1-c95a-42bc-b094-8f8ba4d7dc2e.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-03-01T01:03:57Z", "content": "Thousands of Australians living with multiple sclerosis will have access to another affordable treatment option, with a new drug added to the Pharmaceutical Benefits Scheme.\r\nZeposia is an oral treat… [+1066 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "'Silent epidemic of grief' leaves bereaved and bereavement care practitioners struggling - EurekAlert", "description": "Major changes in bereavement care have occurred during the COVID-19 pandemic, amid a flood of demand for help from bereaved people, according to new research from the University of Cambridge. The first major study of pandemic-related changes in bereavement ca…", "url": "https://www.eurekalert.org/pub_releases/2021-02/uoc-eo022521.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-03-01T00:02:45Z", "content": "Major changes in bereavement care have occurred during the COVID-19 pandemic, amid a flood of demand for help from bereaved people, according to new research from the University of Cambridge. The fir… [+6293 chars]"}, {"source": {"id": null, "name": "Thesector.com.au"}, "author": null, "title": "Guideline changes which introduce nuts to children early decrease allergies | Sector - The Sector", "description": "Changes to food allergy guidelines have led to a 16 per cent decrease in peanut allergy among infants, new research from the Murdoch Children's Research Institute (MCRI) has found.", "url": "https://thesector.com.au/2021/03/01/guideline-changes-which-introduce-nuts-to-children-early-decrease-allergies/", "urlToImage": "https://thesector.com.au/wp-content/uploads/2021/03/niya-shao-kEauPczRYVc-unsplash-scaled.jpg", "publishedAt": "2021-02-28T23:47:21Z", "content": "Changes to food allergy guidelines have led to a 16 per cent decrease in peanut allergy among infants, new research from the Murdoch Children’s Research Institute (MCRI) has found.\r\nSince the guideli… [+2858 chars]"}, {"source": {"id": null, "name": "SBS News"}, "author": null, "title": "How young women like myself have been rocked by COVID-19 lockdowns - SBS", "description": "OPINION: From insecure work to healthcare barriers, young Australian women have been “rocked” by COVID-19 lockdowns, writes Angelica Ojinnaka.", "url": "https://www.sbs.com.au/news/the-feed/how-young-women-like-myself-have-been-rocked-by-covid-19-lockdowns", "urlToImage": "https://sl.sbs.com.au/public/image/file/be89fafe-962e-4ebe-8f05-a39543b9bec8/crop/16x9", "publishedAt": "2021-02-28T22:31:00Z", "content": "With 2021 well underway, many young women like myself are holding onto a thin thread of faith that this year will exude more positivity in all areas of our lives.\r\nWith the ongoing social and economi… [+5994 chars]"}, {"source": {"id": null, "name": "Geelong Advertiser"}, "author": "Dave Cairns", "title": "COVID killer an office 'game changer' - Whitsunday Times", "description": "A “game-changing” air disinfection unit that would kill COVID-19 and prevent the spread of airborne disease in offices is being developed in Geelong.", "url": "https://www.geelongadvertiser.com.au/news/geelong/geelong-companies-c6-group-and-scientific-investigations-develop-gamechanging-air-disinfection-unit/news-story/ea3e9b203b7e91865764b04c41b05a29", "urlToImage": "https://media.apnarm.net.au/media/images/2021/03/01/v3imagesbin0fa79a2d5ee6eff13d980c321fcfbdc7-f9mbw433cg7rtzk7yv2_ct1880x930.jpg", "publishedAt": "2021-02-28T22:04:00Z", "content": "A \"game-changing\" air disinfection unit that would kill COVID-19 and prevent the spread of airborne disease in offices is being developed in Geelong.\r\nA prototype of the unit which can be bolted into… [+3019 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": "Savanna Young", "title": "R. Kelly reportedly gets COVID-19 vaccine in Chicago prison while awaiting child sex charges - 9TheFIX", "description": "Awaiting child sex charges", "url": "https://celebrity.nine.com.au/latest/r-kelly-coronavirus-vaccine-prison-child-sex-charges/f2113f9b-0db5-4f1f-8376-3b981bce15a9", "urlToImage": "https://imageresizer.static9.net.au/8zbIfTpNdTaRCJdZHt7emR1J6fY=/297x119:1761x942/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F3d4d28d9-e039-47c4-9dca-31bc2e167930", "publishedAt": "2021-02-28T20:01:37Z", "content": "R. Kelly has reportedly received two doses of the coronavirus vaccine while being held in a Chicago prison awaiting child sex charges.\r\nAccording to TMZ, the 'I Believe I Can Fly' singer is among mor… [+1428 chars]"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "MarketScreener", "title": "More than 20 million in Britain get first COVID-19 vaccine dose - Marketscreener.com", "description": "More than 20 million people across the United Kingdom have now received their first COVID-19 vaccine shot, data showed on Sunday as the country made more progress with Europe's fastest vaccination...", "url": "https://www.marketscreener.com/news/latest/More-than-20-million-in-Britain-get-first-COVID-19-vaccine-dose--32565800/", "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png", "publishedAt": "2021-02-28T16:49:36Z", "content": "LONDON, Feb 28 (Reuters) - More than 20 million people\r\nacross the United Kingdom have now received their first COVID-19\r\nvaccine shot, data showed on Sunday as the country made more\r\nprogress with E… [+1638 chars]"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "MarketScreener", "title": "UK says first COVID vaccines given to 20.09 mln people - marketscreener.com", "description": "A total of 20.09 million people in Britain have received their first dose of a COVID-19 vaccine, official data released on Sunday showed.               Britain also reported a further 6,035 cases...", "url": "https://www.marketscreener.com/news/latest/UK-says-first-COVID-vaccines-given-to-20-09-mln-people--32561670/", "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png", "publishedAt": "2021-02-28T16:14:23Z", "content": "LONDON, Feb 28 (Reuters) - A total of 20.09 million people\r\nin Britain have received their first dose of a COVID-19 vaccine,\r\nofficial data released on Sunday showed.\r\nBritain also reported a further… [+304 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Rick Goodman", "title": "More than 20 million in UK vaccinated - Bendigo Advertiser", "description": "More than 20 million people in the UK have now been given their first dose of a coronavirus vaccine. UK Health Secretary Matt Hancock says it's a \"magnificent...", "url": "https://www.bendigoadvertiser.com.au/story/7146417/more-than-20-million-in-uk-vaccinated/", "urlToImage": "https://www.bendigoadvertiser.com.au/images/transform/v1/crop/frm/silverstone-feed-data/c9e7e216-e6f0-44b3-b1ab-a1e98406a42f.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-28T15:46:38Z", "content": ""}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "UK says more than 20 million people have received COVID-19 ... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/BRITAIN-VACCINATIONS (URGENT):UK says more than 20 million people have received COVID-19 shot", "url": "https://news.trust.org/item/20210228132411-cfmxr", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/dde8321d-4c68-41e4-83e9-20596575a869/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2021-02-28T14:26:00Z", "content": "LONDON, Feb 28 (Reuters) - More than 20 million people across the United Kingdom have now received a COVID-19 shot, Britain's health minister, Matt Hancock, said on Sunday.\r\n\"A magnificent achievemen… [+398 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Holly Christodoulou", "title": "TWENTY MILLION Brits have now received their first Covid vaccine dose as Matt Hancock hails ‘magnificent a - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/14188240/britain-covid-vaccines-twenty-million/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/02/COMP-CFP-JAB-O-METERv2.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-02-28T14:12:00Z", "content": "A STAGGERING 20 million Brits have now received a Covid jab as Matt Hancock today hailed the \"magnificent achievement\".\r\nThe epic milestone comes just a fortnight after the UK smashed its target of 1… [+3686 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "World Health Organisation issue update on H5N8 bird flu after human-to-human spread - 7NEWS.com.au", "description": "Russia has registered the first case of a strain of H5N8 bird flu virus being passed to humans from birds, the WHO says.", "url": "https://7news.com.au/news/world/h5n8-bird-flu-human-spread-risk-low-who-c-2250096", "urlToImage": "https://images.7news.com.au/publication/C-2250096/f1fe3f8f8fab4f3bc902f0636e84be361b684212-16x9-x0y75w800h450.jpg?imwidth=1024", "publishedAt": "2021-02-28T12:48:05Z", "content": "The risk of human-to-human spread of the H5N8 strain of bird flu appears low after it was identified for the first time worldwide in farm workers in Russia, the World Health Organisation says.\r\nA sep… [+1640 chars]"}, {"source": {"id": null, "name": "Lasvegassun.com"}, "author": null, "title": "The Latest: All UK children to get free COVID-19 test kits - Las Vegas Sun", "description": "The Latest: All UK children to get free COVID-19 test kits", "url": "https://lasvegassun.com/news/2021/feb/28/the-latest-all-uk-children-to-get-free-covid-19-te/", "urlToImage": "//assets.lasvegassun.com/media/assets/images/icons/favicon-app.png", "publishedAt": "2021-02-28T10:54:00Z", "content": "Published Sunday, Feb. 28, 2021 | 2:54 a.m.\r\nUpdated Sunday, Feb. 28, 2021 | 2:55 a.m.\r\nLONDON Britains government says families with children in school will be provided with free coronavirus home te… [+13528 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Lucy Quaggin", "title": "Endometriosis: Australian sisters’ ‘extreme pain’ dismissed by those who ‘never really got it’ - 7NEWS.com.au", "description": "‘We always thought what we were experiencing was normal because it’s what the other one was going through too.’", "url": "https://7news.com.au/lifestyle/health-wellbeing/riddled-with-endometriosis-australian-sisters-extreme-pain-dismissed-by-those-who-never-really-got-it-c-2238463", "urlToImage": "https://images.7news.com.au/publication/C-2238463/80db56d2d03ffb3c7e72095ba034a61c4fa023ce-16x9-x0y0w1920h1080.png?imwidth=1024", "publishedAt": "2021-02-28T10:18:43Z", "content": "Louise and Michelle Finessi are sisters bound together as a family and also in diagnosis.\r\nThe Perth women, 32 and 28, have endometriosis.\r\nIts a disease that affects female reproductive organs and c… [+8624 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Folusho Balogun", "title": "Why Nigeria must include parents in plans to protect girls from cervical cancer - The Conversation Africa", "description": "The HPV vaccine is an effective prevention for cervical cancer, especially if adolescents get it before sexual debut.", "url": "https://theconversation.com/why-nigeria-must-include-parents-in-plans-to-protect-girls-from-cervical-cancer-155306", "urlToImage": "https://images.theconversation.com/files/386080/original/file-20210224-21-2l74j5.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-02-28T08:21:59Z", "content": "Cervical cancer is the second most common cancer among women in Nigeria. There were 31,955 new cervical cancer cases in West Africa in 2018, and Nigeria accounted for almost half (14,943). There were… [+4551 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Harriet Sherwood", "title": "Covid vaccine does not affect fertility but misinformation persists - The Guardian", "description": "Scientists emphasise safety but younger women still hesitant", "url": "https://amp.theguardian.com/society/2021/feb/28/covid-vaccine-does-not-affect-fertility-but-misinformation-persists", "urlToImage": null, "publishedAt": "2021-02-28T07:15:00Z", "content": "Vaccines and immunisationScientists emphasise safety but younger women still hesitant\r\nAmy Taylor was chatting to friends over a Zoom drink when the conversation took an unexpected turn. One of the g… [+4530 chars]"}, {"source": {"id": null, "name": "Colliemail.com.au"}, "author": null, "title": "Latest snapshot of the coronavirus impact - Collie Mail", "description": "LATEST COVID-19 DEVELOPMENTS * The first shipment of AstraZeneca coronavirus vaccines, the type most Australians will receive, arrived in Sydney on Sunday. *...", "url": "https://www.colliemail.com.au/story/7146305/latest-snapshot-of-the-coronavirus-impact/", "urlToImage": "https://www.colliemail.com.au/images/transform/v1/crop/frm/silverstone-feed-data/80b48e8f-652f-44a9-a59b-54c3dbb7188a.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-28T07:00:47Z", "content": "LATEST COVID-19 DEVELOPMENTS\r\n* The first shipment of AstraZeneca coronavirus vaccines, the type most Australians will receive, arrived in Sydney on Sunday.\r\n* The 300,000 doses are being kept under … [+1318 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Jennifer O'Connell, Simon Carswell", "title": "Covid-19: 10 things we thought about the virus a year ago – that turned out to be wrong - The Irish Times", "description": "Masks don’t work. Travel isn’t a major factor. Vaccines will solve it all. And other myths", "url": "https://www.irishtimes.com/life-and-style/health-family/covid-19-10-things-we-thought-about-the-virus-a-year-ago-that-turned-out-to-be-wrong-1.4494870", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4494868&origw=1440", "publishedAt": "2021-02-28T06:00:00Z", "content": "Covid-19 has been a moving target from the start. Here are some of the early misconceptions that were challenged by emerging new evidence - and sometimes hard experience - along the way.\r\n1. Only the… [+9140 chars]"}, {"source": {"id": null, "name": "Macleayargus.com.au"}, "author": "Tim Dornin", "title": "WA hails early COVID-19 vaccine program - The Macleay Argus", "description": "About 4000 doses of the coronavirus vaccine have been administered in Western Australia with officials hailing the first week of the program a \"great result\".", "url": "https://www.macleayargus.com.au/story/7146226/wa-hails-early-covid-19-vaccine-program/", "urlToImage": "https://www.macleayargus.com.au/images/transform/v1/crop/frm/silverstone-feed-data/6b558682-c3e9-48aa-9255-4e648e0bc845.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-28T05:32:19Z", "content": ""}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Widespread testing in Auckland now key to ruling out possible undetected COVID-19 outbreak - MENAFN.COM", "description": "As expected, genome sequencing has now confirmed the new community COVID-19 case in Auckland is linked to the Papatoetoe cluster, and is the more infectious B.1.1.7 variant. </p>\n<p>When the first cases in this cluster were reported on Feburary 14 Auckland mo…", "url": "https://menafn.com/1101673238/Widespread-testing-in-Auckland-now-key-to-ruling-out-possible-undetected-COVID-19-outbreak", "urlToImage": "https://menafn.com/updates/pr/2021-02/28/TC_0710690c-1image_story.jpg", "publishedAt": "2021-02-28T05:22:58Z", "content": "(MENAFN - The Conversation) As expected, genome sequencing has now confirmed the new community COVID-19 case in Auckland is linked to the Papatoetoe cluster, and is the more infectious B.1.1.7 varian… [+5554 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "‘I’ve had my vaccine - how well will it protect me and for how long?’ - The Guardian", "description": "The latest answers to the important medical questions about the vaccines and the pandemic", "url": "https://amp.theguardian.com/world/2021/feb/27/ive-had-my-vaccine-how-well-will-it-protect-me-and-for-how-long", "urlToImage": null, "publishedAt": "2021-02-28T00:22:00Z", "content": "CoronavirusThe latest answers to the important medical questions about the vaccines and the pandemic\r\nSat 27 Feb 2021 21.06 GMT\r\nWhat are the chances that my vaccine will not work?\r\nThe prospects of … [+2975 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "David Estcourt", "title": "Hunt defends vaccine disposal as Victoria records zero new cases of coronavirus - The Age", "description": "Federal Health Minister defends Victorian health worker who disposed of doses of the Pfizer coronavirus vaccine last week, saying the worker ‘did everything right’.", "url": "https://www.theage.com.au/national/victoria/victoria-records-zero-new-cases-of-coronavirus-as-nz-locked-down-again-20210228-p576gi.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3386%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_39/t_crop_custom/q_86%2Cf_auto/t_theage_no_label_no_age_social_wm/bd81833648b8a4202e20ff27e45b4a56f153d2a4", "publishedAt": "2021-02-27T23:00:29Z", "content": "Mr Hunt said the worker did everything right to act as he did when the integrity of the doses concerned was uncertain.\r\nThe situation here is there was surplus and the worker in question absolutely d… [+3732 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Pip Christmass", "title": "Case 903: Hotel security guard speaks out after COVID infection sparks five-day Perth lockdown - 7NEWS.com.au", "description": "The hotel security guard said he now just wanted to get on with his life after his infection with the UK COVID strain sparked a sudden lockdown.", "url": "https://7news.com.au/lifestyle/health-wellbeing/case-903-hotel-security-guard-speaks-out-after-covid-infection-sparks-five-day-perth-lockdown-c-2247299", "urlToImage": "https://images.7news.com.au/publication/C-2247299/24cff8fe8cda7203b1202b9c170a90d5b23da7ec-16x9-x0y0w1920h1080.png?imwidth=1024", "publishedAt": "2021-02-27T21:26:55Z", "content": "So-called Case 903 - the security guard who tested positive to the mutant UK strain of coronavirus, sending Perth into a five-day lockdown - has spoken out for the first time.\r\nThe man, who has not b… [+3778 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Rapidly-Spreading COVID Strain More Transmissible, Less Susceptible to Vaccines - Futurism", "description": "This new homegrown variant could spell disaster.", "url": "https://futurism.com/neoscope/rapidly-spreading-covid-strain-more-transmissible", "urlToImage": "https://wp-assets.futurism.com/2021/02/rapidly-spreading-covid-strain-more-transmissible-less-susceptible-to-vaccines.jpg", "publishedAt": "2021-02-24T14:39:44Z", "content": "A new variant of the coronavirus is quickly becoming the dominant strain in California, the Los Angeles Times reports, and thats worrying experts.\r\nAccording to new research by scientists at UC San F… [+1635 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": "Reuters", "title": "Malaysia to start COVID-19 vaccination drive early as first doses arrive - Arab News", "description": "KUALA LUMPUR: Malaysia moved up its COVID-19 inoculation drive by two days as the first batch of vaccines arrived in the Southeast Asian nation on Sunday. Malaysia aims to vaccinate at least 80% of its 32 million people within a year as it pushes to revive an…", "url": "https://www.arabnews.com/node/1813011", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/02/21/2484861-358055757.jpg", "publishedAt": "2021-02-21T07:42:59Z", "content": "KABUL: The Taliban on Sunday demanded that the US complete its troop withdrawal process from Afghanistan by May 1, in line with a historic agreement signed between the two sides in Doha last year\r\nTh… [+5256 chars]"}]}