{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "STAT"}, "author": null, "title": "Scientists test tetanus bacteria as a weapon to target pancreatic tumors - STAT", "description": "In new research on mice, scientists report that a treatment harnessing Listeria and tetanus bacteria prolonged survival from pancreatic cancer. The biotech company Loki Therapeutics has licensed the patent for the approach.", "url": "https://www.statnews.com/2022/03/23/pancreatic-cancer-loki-therapeutics-immunotherapy/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/03/RL-meta-C1-72h-1-2-800x576.jpg", "publishedAt": "2022-03-23T18:10:46Z", "content": "Pancreatic cancer has proved one of the most deadly forms of the disease, and the most difficult to crack. It shrugs off immunotherapy drugs and resists chemotherapy, and only about 10% of patients l… [+633 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds lesser number of female principal investigators in cardiovascular clinical trials - News-Medical.Net", "description": "Despite recent efforts to improve women's leadership in cardiovascular clinical trial research over the last decade, the number of female principal investigators (PIs) still falls well below the number of males leading similar heart studies, according to a st…", "url": "https://www.news-medical.net/news/20220323/Study-finds-lesser-number-of-female-principal-investigators-in-cardiovascular-clinical-trials.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/10/By_Kateryna_Kon3_11a911d838084efab022e0487e2b409f-620x480.jpg", "publishedAt": "2022-03-23T18:07:00Z", "content": "Despite recent efforts to improve women's leadership in cardiovascular clinical trial research over the last decade, the number of female principal investigators (PIs) still falls well below the numb… [+4954 chars]"}, {"source": {"id": null, "name": "Stanford.edu"}, "author": null, "title": "Scientists develop compound that could treat asthma, other mucus-induced lung diseases - Stanford Medical Center Report", "description": "Stanford Medicine investigators and their collaborators have designed a compound that’s uniquely capable of blocking excessive mucus secretion — a hallmark of several serious respiratory disorders.", "url": "https://med.stanford.edu/news/all-news/2022/03/excessive-mucus-secretion-blocking-compound.html", "urlToImage": "http://med.stanford.edu/content/dam/sm-news/images/2022/03/COVER-BrungerNature_January_2022_PSD_COVER_02.jpg", "publishedAt": "2022-03-23T17:58:33Z", "content": "Spontaneous merging of these vesicles walls with the neurons outer membrane happens all the time, resulting in a fairly constant, low-level expulsion of the vesicles stored contents from the neuron. … [+4541 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds high rate of cognitive impairment after heart attack - News-Medical.Net", "description": "A heart attack's impact on the brain may be more serious than previously understood. About 1 in 3 heart attack survivors showed significant mental decline in the days and months following their heart attack, according to a study presented at the American Coll…", "url": "https://www.news-medical.net/news/20220323/Study-finds-high-rate-of-cognitive-impairment-after-heart-attack.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Heart_Attack-620x480.jpg", "publishedAt": "2022-03-23T17:25:00Z", "content": "A heart attack's impact on the brain may be more serious than previously understood. About 1 in 3 heart attack survivors showed significant mental decline in the days and months following their heart… [+3929 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "People living in noisy environment more likely to suffer a heart attack - News-Medical.Net", "description": "Living in a noisy environment can be annoying, but it might also harm your health. People experiencing high levels of noise from cars, trains or planes were more likely to suffer a heart attack than people living in quieter areas, according to a study present…", "url": "https://www.news-medical.net/news/20220323/People-living-in-noisy-environment-more-likely-to-suffer-a-heart-attack.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Heart_Attack-620x480.jpg", "publishedAt": "2022-03-23T17:18:00Z", "content": "Living in a noisy environment can be annoying, but it might also harm your health. People experiencing high levels of noise from cars, trains or planes were more likely to suffer a heart attack than … [+4566 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Suggests Pain Signals Are Processed Differently in Men and Women - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. A new study shows for the first time that neurons in the spinal cord process pain signals differently in women compared to men.", "url": "https://www.latestly.com/agency-news/health-news-study-suggests-pain-signals-are-processed-differently-in-men-and-women-3505844.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/03/Carswdegtr4ewgr55r5ture2022032316313220220323164046-588x441.jpg", "publishedAt": "2022-03-23T16:50:20Z", "content": "Washington [US], March 23 (ANI): A new study shows for the first time that neurons in the spinal cord process pain signals differently in women compared to men.\r\nThe finding, published in the journal… [+1586 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Real-world increase in biomarker testing in lung cancer patients, registry study reveals - Medical Xpress", "description": "More than half of patients diagnosed with advanced non-small cell lung cancer (NSCLC) undergo biomarker testing, and this figure has increased over the last five years, reveal real-world data from a Spanish national registry study reported at the European Lun…", "url": "https://medicalxpress.com/news/2022-03-real-world-biomarker-lung-cancer-patients.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/lung.jpg", "publishedAt": "2022-03-23T16:50:20Z", "content": "More than half of patients diagnosed with advanced non-small cell lung cancer (NSCLC) undergo biomarker testing, and this figure has increased over the last five years, reveal real-world data from a … [+4193 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "As tuberculosis resurges in the Asia Pacific, what lessons from Covid can save Australia? - The Guardian", "description": "When the pandemic unfolded, vital resources were diverted away from TB, with infections going undetected, untreated and unmanaged", "url": "https://amp.theguardian.com/society/2022/mar/24/as-tuberculosis-resurges-in-the-asia-pacific-what-lessons-from-covid-can-save-australia", "urlToImage": null, "publishedAt": "2022-03-23T16:30:00Z", "content": "Brendan Crabb and Negaya Chorley\r\nWhen the pandemic unfolded, vital resources were diverted away from TB, with infections going undetected, untreated and unmanaged\r\nWed 23 Mar 2022 12.30 EDT\r\nFew non… [+5824 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Firefighters' risk of irregular heartbeat linked to number of on-the-job fire exposures - Science Daily", "description": "The more fires they respond to, the higher the risk of atrial fibrillation or AFib -- a common irregular heart rhythm -- among firefighters, according to a survey of more than 10,000 active U.S. firefighters. After adjusting for atrial fibrillation risk facto…", "url": "https://www.sciencedaily.com/releases/2022/03/220323101252.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-23T15:02:22Z", "content": "Among firefighters, the risk of having an irregular heart rhythm, known as atrial fibrillation (AFib), increases with the number of fires they respond to, according to new research published today in… [+6564 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Sarah Hellewell", "title": "Post-COVID psychosis occurs in people with no prior history. The risk is low but episodes are frightening - Medical Xpress", "description": "Far from the respiratory disease it seemed at first, COVID can impact almost all parts of the body, including the brain. For a small number of people, COVID infection may be accompanied by an episode of post-COVID psychosis, a break from reality which can be …", "url": "https://medicalxpress.com/news/2022-03-post-covid-psychosis-people-prior-history.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/covid-1.jpg", "publishedAt": "2022-03-23T14:30:05Z", "content": "Far from the respiratory disease it seemed at first, COVID can impact almost all parts of the body, including the brain. For a small number of people, COVID infection may be accompanied by an episode… [+6058 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Scientists can now read whole genome sequencing of IVF embryo - The Tribune India", "description": "&nbsp;In a significant breakthrough, scientists at a US-based gene analytics firm claimed that they can decode almost all the DNA of days-old embryos created via in vitro fertilisation (IVF), the Science reported.", "url": "https://www.tribuneindia.com/news/health/scientists-can-now-read-whole-genome-sequencing-of-ivf-embryo-380085", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_1897789656.jpeg", "publishedAt": "2022-03-23T14:05:00Z", "content": "New York, March 23\r\n In a significant breakthrough, scientists at a US-based gene analytics firm claimed that they can decode almost all the DNA of days-old embryos created via in vitro fertilisation… [+2926 chars]"}, {"source": {"id": null, "name": "Parkinson's News Today"}, "author": "Marisa Wexler", "title": "Genetic Signature in Parkinson's-associated Immune Cells ID'd - Parkinson's News Today", "description": "Some people with Parkinson's disease have a characteristic genetic signature in a type of immune cell called memory T-cells, a new study suggests. \"Parkinson's disease is not usually seen as an autoimmune disease, but all of our work points toward T cells hav…", "url": "https://parkinsonsnewstoday.com/2022/03/23/genetic-signature-parkinsons-associated-immune-cells-identified/", "urlToImage": "https://parkinsonsnewstoday.com/wp-content/uploads/2021/09/Clinicalresearch.png", "publishedAt": "2022-03-23T12:50:20Z", "content": "Some people with Parkinson’s disease have a characteristic genetic signature in a type of immune cell called memory T-cells, a new study suggests.\r\n“Parkinson’s disease is not usually seen as an auto… [+3936 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Robert Preidt", "title": "Heat Waves Tied to Climate Change Are Upping U.S. Heart Deaths - HealthDay News", "description": "WEDNESDAY, March 23, 2022 (HealthDay News) -- An increase in heat waves driven by climate change is causing hundreds more heart disease deaths in the United States each year, with men and Black people at particular risk, researchers say.Each year, the United …", "url": "https://consumer.healthday.com/b-3-23-heat-waves-tied-to-climate-change-are-upping-u-s-heart-deaths-2657014743.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjgzODkxNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwOTIyNzYzNX0.GLvdM3Gtyf1oLItXfofh3JhH4lzfajoRr6Bt5SkwnrU/image.jpg?width=1200&coordinates=0%2C122%2C0%2C123&height=600", "publishedAt": "2022-03-23T12:24:03Z", "content": "WEDNESDAY, March 23, 2022 (HealthDay News) -- An increase in heat waves driven by climate change is causing hundreds more heart disease deaths in the United States each year, with men and Black peopl… [+2637 chars]"}, {"source": {"id": null, "name": "Theiet.org"}, "author": "E&T editorial staff", "title": "Biodegradable implant could help doctors monitor brain chemistry - E&T Magazine", "description": "Researchers at Penn State University in the US developed the wireless sensor.", "url": "https://eandt.theiet.org/content/articles/2022/03/biodegradable-implant-could-help-doctors-monitor-brain-chemistry/", "urlToImage": "https://eandt.theiet.org/media/17938/dreamstime_xxl_217050436.jpg?crop=0,0.18083333333333335,0,0.3269791666666666&cropmode=percentage&width=1200&height=450&rnd=132925055400000000", "publishedAt": "2022-03-23T12:09:55Z", "content": "Engineers have developed a wireless, biodegradable sensor that they say could offer doctors a way to monitor changes in brain chemistry without requiring a second operation to remove the implant.\r\n I… [+3605 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Malawi: Harassment and Societal Discrimination Still Preventing Gays and Other Minority Groups From Accessing HIV and Aids Treatment and Care - AllAfrica - Top Africa News", "description": "National Aids Commission (NAC) has cited police harassment, societal discrimination, and insufficient community-based services as significant barriers preventing key populations from accessing care and services for HIV and Aids-related illnesses.", "url": "https://allafrica.com/stories/202203230567.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-03-23T12:00:29Z", "content": "National Aids Commission (NAC) has cited police harassment, societal discrimination, and insufficient community-based services as significant barriers preventing key populations from accessing care a… [+4593 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "News Study identifies new protection mechanism in breast cancer - SelectScience", "description": "Scientists have identified a protein, GIT1, as a modulator of Notch signaling and a guardian against breast cancer growth", "url": "https://www.selectscience.net/industry-news/study-identifies-new-protection-mechanism-in-breast-cancer/?artID=57052", "urlToImage": "http://www.selectscience.net/images/articles/10217_Karolinska_Institute_Logo.jpg", "publishedAt": "2022-03-23T11:50:24Z", "content": null}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New System Allows Control Over Spread of Parkinson's Protein - Technology Networks", "description": "A novel system to control protein aggregation in a model of Parkinson’s disease may answer longstanding questions about how the disease begins and spreads, according to a new study.", "url": "https://www.technologynetworks.com/neuroscience/news/new-system-allows-control-over-spread-of-parkinsons-protein-359879", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359879/new-system-allows-control-over-spread-of-parkinsons-protein-359879-640x360.jpg?cb=20220323", "publishedAt": "2022-03-23T11:49:42Z", "content": "A novel system to control protein aggregation in a model of Parkinsons disease may answer longstanding questions about how the disease begins and spreads, according to a new study published March 9th… [+3788 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study investigates germinal center of antibody-mediated immunity against SARS-CoV-2 - News-Medical.Net", "description": "In a new study, researchers explored the germinal center of antibody-mediated immunity towards SARS-CoV-2.", "url": "https://www.news-medical.net/news/20220323/Study-investigates-germinal-center-of-antibody-mediated-immunity-against-SARS-CoV-2.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_708204_16480324871043299.jpg", "publishedAt": "2022-03-23T11:06:00Z", "content": "In two recent papers published in the journal Cell, researchers explored the germinal center (GC) of antibody (Ab)-mediated immunity towards severe acute respiratory syndrome coronavirus (SARS-CoV-2)… [+7286 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lipid and Glucose Levels at Age 35 Linked With Alzheimer’s Disease Later in Life - SciTechDaily", "description": "Living your best life at 35, ignoring cholesterol and glucose levels, may impact your chances of getting Alzheimer’s disease (AD) later in life. According to researchers from Boston University School of Medicine (BUSM), lower HDL (high-density cholesterol) an…", "url": "https://scitechdaily.com/lipid-and-glucose-levels-at-age-35-linked-with-alzheimers-disease-later-in-life/", "urlToImage": "https://scitechdaily.com/images/Alzheimers-Disease-Memory-Loss-Concept.jpg", "publishedAt": "2022-03-23T11:00:08Z", "content": "Living your best life at 35, ignoring cholesterol and glucose levels, may impact your chances of getting Alzheimer’s disease (AD) later in life. According to researchers from Boston University School… [+3436 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "New discovery could make cancer vaccines a reality - Health Europa", "description": "Scientists have developed a pipeline and ‘plug-and-play’ technology that has the potential to generate cancer vaccines for clinical use.", "url": "https://www.healtheuropa.eu/new-discovery-could-make-cancer-vaccines-a-reality/114320/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/03/©-iStock-aydinmutlu.jpg", "publishedAt": "2022-03-23T10:46:46Z", "content": "The innovative pipeline development can be used for identifying, prioritising and evaluating potential tumour antigens for the fast generation of cancer vaccines. The research area of cancer vaccines… [+4884 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Signs of a heart attack predicted with AI technology - Health Europa", "description": "A research team has developed an Artificial Intelligence (AI) tool that can predict early signs of a heart attack.", "url": "https://www.healtheuropa.eu/signs-of-a-heart-attack-predicted-with-ai-technology/114305/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/03/©-iStock-Iaremenko.jpg", "publishedAt": "2022-03-23T09:30:58Z", "content": "Developed by a team at Cedars-Sinai, the novel AI technology can accurately forecast early signs of a heart attack, predicting which patients will experience a heart attack in five years based on the… [+2792 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Savannah Meacham", "title": "Long COVID-19 increases risk of type 2 diabetes, study shows - 9News", "description": "<p>US study finds 46 per cent increase among 180,000 people.</p>", "url": "https://www.9news.com.au/national/covid-19-type-2-diabetes-coronavirus-link-study/a3f340b9-6fa1-4c07-9d49-2c19297a9507", "urlToImage": "https://imageresizer.static9.net.au/7mZnFBGLlCtGMcez_ciRxmky6Ik=/0x156:3000x1843/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F0d2212d5-3805-4fe7-99aa-bed78b06691e", "publishedAt": "2022-03-23T09:14:29Z", "content": null}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "A Birth Control Pill for Men Could Start Human Trials This Year - Gizmodo Australia", "description": "Scientists are still racing to create the first male contraceptive that isn’t a condom or surgery. In new preliminary research,...", "url": "https://www.gizmodo.com.au/2022/03/a-birth-control-pill-for-men-could-start-human-trials-this-year/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/03/23/d64c50381af7eb38d6e87387610c3d16.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-03-23T09:00:00Z", "content": "Scientists are still racing to create the first male contraceptive that isnt a condom or surgery. In new preliminary research, a team says theyve developed a non-hormonal form of male birth control, … [+3215 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Study examines the effectiveness of remdesivir in a pill form for COVID-19 - Health Europa", "description": "Scientists at the University of North Carolina are testing remdesivir in a pill form to understand how effective it is for treating COVID-19.", "url": "https://www.healtheuropa.eu/study-examines-the-effectiveness-of-remdesivir-in-a-pill-form-for-covid-19/114301/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/03/iStockAlexSava-1222349380.jpg", "publishedAt": "2022-03-23T08:57:39Z", "content": "Remdesivir is an RNA polymerase inhibitor that disrupts the production of viral RNA, preventing the multiplication of SARS-CoV-2; it has been given to half of all hospitalised patients with the disea… [+2314 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Hong Kong study finds 40 per cent of patients still suffer from long Covid - South China Morning Post", "description": "Fatigue from long Covid more common among females, with 50 per cent of women in study reporting symptoms, compared with 30 per cent among men.", "url": "https://www.scmp.com/news/hong-kong/health-environment/article/3171528/long-covid-more-40-cent-coronavirus-patients", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_coronavirus_generic/public/d8/images/canvas/2022/03/23/35e17347-9882-4f5a-bb1b-053a34bd5831_2931e66e.jpg?itok=BvUC9Itn&v=1648023582", "publishedAt": "2022-03-23T08:19:49Z", "content": "Published: 4:19pm, 23 Mar, 2022\r\nUpdated: 4:23pm, 23 Mar, 2022"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Gene therapy restores dim-light vision in dogs with a congenital form of night blindness - Phys.org", "description": "People with congenital stationary night blindness (CSNB) are unable to distinguish objects in dim-light conditions. This impairment presents challenges, especially where artificial lighting is unavailable or when driving at night.", "url": "https://phys.org/news/2022-03-gene-therapy-dim-light-vision-dogs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/correcting-night-blind.jpg", "publishedAt": "2022-03-23T08:10:19Z", "content": "People with congenital stationary night blindness (CSNB) are unable to distinguish objects in dim-light conditions. This impairment presents challenges, especially where artificial lighting is unavai… [+5771 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "A moment that changed me: dengue fever put me in hospital – and taught me to love my body | Life and style - Verve Times", "description": "I felt quite smug moving from London to Bali, Indonesia, in January 2020. I had left my stressful job as an editor in order to pursue a freelance career from a sunnier climate for a few months. Things took an unexpected turn when the pandemic began a", "url": "https://vervetimes.com/a-moment-that-changed-me-dengue-fever-put-me-in-hospital-and-taught-me-to-love-my-body-life-and-style/", "urlToImage": "https://i.guim.co.uk/img/media/cf1af57ce5f2071a3c8299330fa5011c1265145b/29_115_1281_769/master/1281.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom,left&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=58f25aec1d3af62d280e4b5334d5a7e1", "publishedAt": "2022-03-23T07:21:11Z", "content": "I felt quite smug moving from London to Bali, Indonesia, in January 2020. I had left my stressful job as an editor in order to pursue a freelance career from a sunnier climate for a few months. Thing… [+3733 chars]"}, {"source": {"id": null, "name": "Sheppnews.com.au"}, "author": null, "title": "Vaccine-induced cells boost COVID immunity - Shepparton News", "description": "Australian researchers have found vaccine-induced T cells can provide more than a year's worth of immunity to COVID-19.", "url": "https://www.sheppnews.com.au/national/vaccine-induced-cells-boost-covid-immunity-2/", "urlToImage": "https://imengine.public.prod.mmg.navigacloud.com?uuid=a13f3dd4-5fee-5149-a1b2-771a899d8275&function=original&type=preview", "publishedAt": "2022-03-23T05:04:32Z", "content": "Australian researchers have found vaccine-induced T cells can provide more than a year's worth of immunity to COVID-19.\r\nA Doherty Institute study, published in the Nature Immunology journal on Wedne… [+2798 chars]"}, {"source": {"id": null, "name": "Sky News Australia"}, "author": "Tyrone Clarke", "title": "Moderna launches new vaccine targeting COVID-19, influenza and RSV - Sky News Australia", "description": "American pharmaceutical company Moderna has announced a new vaccination program targeting the three “most significant viruses causing respiratory disease” in the elderly.", "url": "https://www.skynews.com.au/australia-news/coronavirus/moderna-launches-new-vaccine-program-targeting-covid19-influenza-and-rsv/news-story/cea65b3ca53cb38bbf258b7961f9afa1", "urlToImage": "https://content.api.news/v3/images/bin/603a129dfd3e7d65caf296cb5a412151", "publishedAt": "2022-03-23T05:02:05Z", "content": "Moderna has unveiled a new vaccination program targeting COVID-19, the flu and RSV with an aim to soon launch one annual booster shot targeting all respiratory infections.American pharmaceutical comp… [+2837 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Daily consumption of cranberries for one month improves cardiovascular function - News-Medical.Net", "description": "A new clinical trial found daily consumption of cranberries for one month improved cardiovascular function in healthy men.", "url": "https://www.news-medical.net/news/20220322/Daily-consumption-of-cranberries-for-one-month-improves-cardiovascular-function.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Cranberries_wooden_bowl_e7b5ace76644407f90652ecdd53c3e3d-620x480.jpg", "publishedAt": "2022-03-23T02:57:00Z", "content": "A new clinical trial found daily consumption of cranberries for one month improved cardiovascular function in healthy men.\r\nThe new study, published today in Food &amp; Function, included 45 healthy … [+3179 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Self-monitoring blood oxygen at home can help COVID patients spot early warning signs, study finds - EurekAlert", "description": "Measuring blood oxygen levels at home is a safe way for people with COVID-19 to spot signs that their health could be deteriorating, and they may need emergency and hospital care, new research led by Imperial College London has found.", "url": "https://www.eurekalert.org/news-releases/947053", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/795a7df9-08a4-4174-af1c-e316a5e78500/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T02:05:12Z", "content": "image: Credit: Imperial College London / Thomas Angusview more \r\nCredit: Imperial College London / Thomas Angus\r\nMeasuring blood oxygen levels at home is a safe way for people with COVID-19 to spot s… [+4068 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Deltacron: What scientists know so far about this new hybrid coronavirus - ABC News", "description": "As restrictions lift it can feel as if the pandemic is over. Yet there is still significant concern a dangerous new variant could emerge and another has just arrived. Only time will tell how serious it is, writes Luke O'Neill.", "url": "https://www.abc.net.au/news/2022-03-23/hybrid-coronavirus-delta-omicron-deltacron-what-scientists-know/100931924", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4cc27a34adfbe20782a5e310e6bab3f1?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=36&width=862&height=485", "publishedAt": "2022-03-23T01:38:26Z", "content": "In many countries, as restrictions lift and freedoms are restored, there's a general feeling that the pandemic is over. There is, however, still the significant concern that a dangerous new variant c… [+4766 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Survey: UK doctors may overrate the gender equality progress in medical specialties - News-Medical.Net", "description": "Doctors tend to overestimate the progress made towards gender equality in UK medicine, suggest the results of a snapshot survey published in the open access journal BMJ Open.", "url": "https://www.news-medical.net/news/20220322/Survey-UK-doctors-may-overrate-the-gender-equality-progress-in-medical-specialties.aspx", "urlToImage": "https://www.news-medical.net/themes/Standard/images/full_site_logo.png", "publishedAt": "2022-03-22T23:23:00Z", "content": "Doctors tend to overestimate the progress made towards gender equality in UK medicine, suggest the results of a snapshot survey published in the open access journal BMJ Open.\r\nThese misperceptions ar… [+5110 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Mark Saunokonoko", "title": "Fourth jab likely to counter rapidly spreading Omicron sub-variant - 9News", "description": "<p>Some Australians could soon be rolling up their sleeves for a fourth COVID-19 vaccine jab as authorities try to reduce the threat of a rapidly spreading Omicron sub-variant.</p>", "url": "https://www.9news.com.au/national/fourth-covid-19-vaccine-jab-coming-for-australians-as-top-doctors-meet-over-isolation/36848961-b445-4f6b-890b-1379f5a0732a", "urlToImage": "https://imageresizer.static9.net.au/IDYRNAvzPYJ96HvoNCob47vawrU=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fc68a700c-95aa-4a86-b841-eb76ede889bd", "publishedAt": "2022-03-22T22:47:06Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study finds how mosquitoes ignore insect repellents - Devdiscourse", "description": "Johns Hopkins Medicine scientists have uncovered the process that makes mosquitoes able to ignore common insect repellents.", "url": "https://www.devdiscourse.com/article/science-environment/1972865-study-finds-how-mosquitoes-ignore-insect-repellents", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_03_2022_22_07_17_4804325.jpg?width=920&format=jpeg", "publishedAt": "2022-03-22T22:07:18Z", "content": "Johns Hopkins Medicine scientists have uncovered the process that makes mosquitoes able to ignore common insect repellents. The findings of the research were published in the journal 'Cell Reports'.\r… [+3528 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Getting fuel to an invading cell's front line: From a tiny worm, new clues to how metastatic cancer cells power their deadly spread - Science Daily", "description": "Invading armies need a steady supply of fuel and armaments. That's just as true when the invaders are cells, such as when tumor cells break away and spread to other parts of the body in a process called metastasis -- the most deadly part of cancer. Now, a stu…", "url": "https://www.sciencedaily.com/releases/2022/03/220322154222.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T20:44:10Z", "content": "Invading armies need a steady supply of fuel and armaments. That's just as true when the invaders are cells, such as when tumor cells break away from their neighbors and spread to other parts of the … [+4845 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Ryan Merrifield", "title": "UK Covid cases more than double in a month as deaths rise by 22% to 250 - The Mirror", "description": "The UK has recorded another 94,524 Covid cases today, a drop of nearly 14% on this time last week, though virus-related deaths have surged by 25% to 250 - but an increase compared to last month, just two days before Covid measures were scrapped in England", "url": "https://www.mirror.co.uk/news/uk-news/uk-covid-cases-more-double-26531134", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26445437.ece/ALTERNATES/s1200/3_University-Hospital-Monklands-ICU-During-The-Covid-19-Pandemic.jpg", "publishedAt": "2022-03-22T18:27:14Z", "content": "The UK recorded another 94,524 Covid cases today and 250 new deaths.\r\nThat's a drop in infections of nearly 14% compared to last Tuesday when it hit 109,802, but a 25% rise in virus-related fatalitie… [+3923 chars]"}, {"source": {"id": null, "name": "Zenopa.com"}, "author": "Zenopa", "title": "Doctors could track and detect the progression of cancer more accurately - Zenopa", "description": "Doctors could track and detect the progression of cancer more accurately.", "url": "https://www.zenopa.com/news/3777/doctors-could-track-and-detect-the-progression-of-cancer-more-accurately", "urlToImage": "https://www.zenopa.com/uploads/news/3777-600x420.jpg", "publishedAt": "2022-03-22T17:37:46Z", "content": "22 March 2022Service Engineering\r\nDoctors could track and detect the progression of cancer more accurately, thanks to researchers at the University of Waterloo in Canada, who created images in which … [+1661 chars]"}, {"source": {"id": null, "name": "Philippine Canadian Inquirer"}, "author": "Adrienne O'Neil, Deakin University, 'The Conversation", "title": "Stress can cause heart attacks. Could tackling workplace bullying save lives? - Philippine Canadian Inquirer", "description": "The sad passing of Kimberley Kitching and Shane Warne (both 52) from suspected cardiac conditions has put a spotlight on the causes of heart disease. In recent days, attention has turned to the issue of psychological stress in the context of allegations of wo…", "url": "https://canadianinquirer.net/2022/03/22/stress-can-cause-heart-attacks-could-tackling-workplace-bullying-save-lives/", "urlToImage": "https://canadianinquirer.net/wp-content/uploads/2022/03/pexels-pedro-figueras-626165-1000x600.jpg", "publishedAt": "2022-03-22T16:07:30Z", "content": "But given the sources of stress and trauma may be beyond an individuals control, it is important we consider the environment in which we work, age and play when we think about our heart health. (Pexe… [+5884 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Kids with rare autoimmune disease show these symptoms before blood clots: Antiphospholipid syndrome is rare in adults and even less common among children. - Science Daily", "description": "Antiphospholipid syndrome (APS) is rare in children and known to cause inflammation and recurring, potentially fatal, blood clots. Researchers found that two-thirds of children with the autoimmune disease experienced additional symptoms not formally associate…", "url": "https://www.sciencedaily.com/releases/2022/03/220322111239.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T15:44:47Z", "content": "Antiphospholipid syndrome (APS) is rare in children and known to cause inflammation and recurring, potentially fatal, blood clots. Researchers found that two-thirds of children with the autoimmune di… [+3211 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Physician’s Briefing Staff", "title": "Deficits in Cancer Screening at Most Facilities During Pandemic - HealthDay News", "description": "More than 80 percent of facilities reported deficits in monthly screening for CRC; mean relative change of −17.7 percent in monthly screening test volume", "url": "https://consumer.healthday.com/deficits-in-cancer-screening-at-most-facilities-during-pandemic-2656998349.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzQ3MjI5My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5NzMxMTA2OX0.tC3bxc6Hh_1F7s3sOrP4wFMGKw7tiHgcOqYFLI2cCX8/image.jpg?width=1200&coordinates=0%2C122%2C0%2C123&height=600", "publishedAt": "2022-03-22T15:43:54Z", "content": "TUESDAY, March 22, 2022 (HealthDay News) -- Most accredited cancer programs in the United States reported a decline in cancer screening during the pandemic, most notably in colorectal cancer, accordi… [+1530 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How valid are the reported results on health outcomes in children after acute SARS-CoV-2 infection? - News-Medical.Net", "description": "Researchers discussed the validity of reported health outcomes post-acute infection with SARS-CoV-2 in children.", "url": "https://www.news-medical.net/news/20220322/How-valid-are-the-reported-results-on-health-outcomes-in-children-after-acute-SARS-CoV-2-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_708062_16479618554974866.jpg", "publishedAt": "2022-03-22T15:16:00Z", "content": "In a recent systematic review posted to the medRxiv* preprint server, researchers discussed the validity of reported health outcomes post-acute infection with severe acute respiratory syndrome corona… [+5838 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "Culinary therapy: Feeling confident about your cooking actually boosts mental health - Study Finds", "description": "Those who took a 7-week cooking course displayed significant improvements in their mental health, overall health, and perceived vitality.", "url": "https://www.studyfinds.org/kitchen-confidence-mental-health/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2021/02/le-creuset-654RckD-pmA-unsplash.jpg", "publishedAt": "2022-03-22T15:05:05Z", "content": "JOONDALUP, Australia — Perhaps happiness is just a cutting board and stove away. Researchers from Edith Cowan University have found that greater confidence in the kitchen — along with better eating h… [+3552 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "COVID-19 has left GPs struggling around the world, new study shows — ScienceDaily - Verve Times", "description": "The pandemic left many GPs around the world feeling depressed, anxious and in some cases burned out, a review of global studies has revealed.The review, published in the British Journal of General Practice and led by the University of York, also foun", "url": "https://vervetimes.com/covid-19-has-left-gps-struggling-around-the-world-new-study-shows-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T14:48:35Z", "content": "The pandemic left many GPs around the world feeling depressed, anxious and in some cases burned out, a review of global studies has revealed.The review, published in the British Journal of General Pr… [+3061 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Florida", "title": "Arts activities may reduce antisocial behavior among teenagers - Newswise", "description": "Teenagers who take part in arts and cultural activities, such as dance, drama, reading and going to concerts, are less likely to engage in antisocial and crimin", "url": "https://www.newswise.com/articles/arts-activities-may-reduce-antisocial-behavior-among-teenagers", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-03-22T13:45:00Z", "content": "EMBARGOED UNTIL 21:00 (9 P.M.) U.S. EASTERN TIME, TUESDAY, MARCH 22, 2022,  / 01:00 (1 A.M.) UK TIME, WEDNESDAY, MARCH 23, 2022\r\nNewswise — Teenagers who take part in arts and cultural activities, su… [+7731 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Ketogenic diet combined with triple drugs can prevent pancreatic cancer: Study - Hindustan Times", "description": "The new study has suggested that a ketogenic diet, which is low in carbohydrates and protein and high in fat, helps to kill pancreatic cancer cells when combined with a triple-drug therapy. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/ketogenic-diet-combined-with-triple-drugs-can-prevent-pancreatic-cancer-study-101647951627328.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/22/1600x900/Keto_diet_thumb_1647951737084_1647951747950.jpg", "publishedAt": "2022-03-22T12:26:30Z", "content": "The new study has suggested that a ketogenic diet, which is low in carbohydrates and protein and high in fat, helps to kill pancreatic cancer cells when combined with a triple-drug therapy. The findi… [+2353 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "COVID-19 in liver transplant recipients: incidence, hospitalization and outcome in an Italian prospective double-centre study | Scientific Reports - Nature.com", "description": "Scientific Reports - COVID-19 in liver transplant recipients: incidence, hospitalization and outcome in an Italian prospective double-centre study", "url": "https://www.nature.com/articles/s41598-022-08947-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-08947-x/MediaObjects/41598_2022_8947_Fig1_HTML.png", "publishedAt": "2022-03-22T11:12:51Z", "content": "COVID-19 caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection has been associated with high mortality worldwide. Identifying patients at high risk of infection or those li… [+9627 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Chronic obstructive pulmonary disease and influenza vaccination effect in preventing outpatient and inpatient influenza cases | Scientific Reports - Nature.com", "description": "Scientific Reports - Chronic obstructive pulmonary disease and influenza vaccination effect in preventing outpatient and inpatient influenza cases", "url": "https://www.nature.com/articles/s41598-022-08952-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-08952-0/MediaObjects/41598_2022_8952_Fig1_HTML.png", "publishedAt": "2022-03-22T11:12:51Z", "content": "Study population\r\nThis test-negative casecontrol study was performed in the region of Navarre, Spain, where annual IVE studies have been conducted since 200918,19,20,21,22,23,24. The Navarre Health S… [+6110 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Metabolomic Study Links Asthma Treatment to Adrenal Suppression - Technology Networks", "description": "A large-scale metabolomics study has revealed that inhaled cortical steroids used to treat asthma are linked to adrenal suppression, the symptoms of which can include fatigue, headache, vomiting and psychiatric symptoms.", "url": "https://www.technologynetworks.com/proteomics/news/metabolomic-study-links-asthma-treatment-to-adrenal-suppression-359801", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359801/metabolomic-study-links-asthma-treatment-to-adrenal-suppression-359801-640x360.jpg?cb=20220322", "publishedAt": "2022-03-22T10:07:27Z", "content": "Inhaled cortical steroids (ICS) can help patients manage asthma symptoms, and recent updates to asthma treatment guidelines have expanded recommended, low-dose treatment. But concerns persist that IC… [+2248 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Synthesis of Bacterium's Anticancer Warhead Described - Genetic Engineering & Biotechnology News", "description": "Scientists for the first time understand the enzyme-driven process that activates the salinosporamide A warhead.", "url": "https://www.genengnews.com/topics/translational-medicine/synthesis-of-bacteriums-anticancer-warhead-described/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/03/Low-Res_siocomm_A_MC_ErikJepsen_Brad-Moore-Lab_2022_5116-19.jpg.png", "publishedAt": "2022-03-22T08:00:34Z", "content": "Years of laboratory work have revealed how a marine bacterium makes a potent anticancer molecule called salinosporamide. Researchers at UC San Diegos Scripps Institution of Oceanography unravelled th… [+7131 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Eight Japanese encephalitis cases in SA - 7NEWS", "description": "South Australian health authorities say the number of confirmed Japanese encephalitis virus cases has grown to eight.", "url": "https://7news.com.au/news/sa/eight-japanese-encephalitis-cases-in-sa-c-6110190", "urlToImage": "https://images.7news.com.au/publication/C-6110190/a63e653819922eedb152229209705a3136fff5e7-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-03-22T07:40:45Z", "content": "The number of confirmed Japanese encephalitis cases in South Australia has grown to eight.\r\nThe Department of Health and Wellbeing says that includes one person who died earlier this month.\r\nOf the r… [+1113 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "‘Right diets’ can offer protection against acute kidney injury. But, keto is not the answer - Economic Times", "description": "Acute kidney injury is basically a sudden occurrence of kidney damage.", "url": "https://economictimes.indiatimes.com/magazines/panache/right-diets-can-offer-protection-against-acute-kidney-injury-but-keto-is-not-the-answer/articleshow/90369116.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90369371,width-1070,height-580,imgsize-1324237,overlay-etpanache/photo.jpg", "publishedAt": "2022-03-22T06:17:00Z", "content": "'Diets' get a whole new meaning when they are not done for weight loss but to revive your health from a life-threatening disease. They act as safety valves keeping your physical system from falling a… [+3147 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "One-year pulmonary impairment after severe COVID-19: a prospective, multicenter follow-up study - DocWire News", "description": "Respir Res. 2022 Mar 21;23(1):65. doi: 10.1186/s12931-022-01994-y.ABSTRACTBACKGROUND: Long-term pulmonary sequelae following hospitalization for", "url": "https://www.docwirenews.com/abstracts/one-year-pulmonary-impairment-after-severe-covid-19-a-prospective-multicenter-follow-up-study/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-03-22T06:00:00Z", "content": "Respir Res. 2022 Mar 21;23(1):65. doi: 10.1186/s12931-022-01994-y.\r\nABSTRACT\r\nBACKGROUND: Long-term pulmonary sequelae following hospitalization for SARS-CoV-2 pneumonia is largely unclear. The aim o… [+1888 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Could COVID-19 spread through wastewater in the Thames? - News-Medical.Net", "description": "Researchers investigate the presence of SARS-CoV-2 infectious particles and its RNA material in the Thames and other rivers.", "url": "https://www.news-medical.net/news/20220321/Could-COVID-19-spread-through-wastewater-in-the-Thames.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_707946_4464196056629635674.jpg", "publishedAt": "2022-03-22T03:02:00Z", "content": "The severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) spreads primarily through droplet infection. Breathing, coughing, and singing can cause droplets of water vapor with suspended viral p… [+5563 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Could You Have Had COVID-19 but Not Realise It? - Gizmodo Australia", "description": "It seems not a day goes by without learning someone in our inner circle of family, friends and colleagues has...", "url": "https://www.gizmodo.com.au/2022/03/could-you-have-had-covid-19-but-not-realise-it/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/03/22/fight-clubb.png?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-03-22T01:20:00Z", "content": "It seems not a day goes by without learning someone in our inner circle of family, friends and colleagues has COVID. When we ask how unwell our acquaintance is, the responses vary from theyre really … [+5994 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "AAN: Medication, exercise more beneficial than stent in preventing stroke - Healio", "description": "Medication and exercise are more beneficial in preventing a second stroke in those with intracranial atherosclerosis compared with placement of a blood vessel stent, new guidance from the American Academy of Neurology stated. \nAAN&rsquo;s practice advisory re…", "url": "https://www.healio.com/news/neurology/20220321/aan-medication-exercise-more-beneficial-than-stent-in-preventing-stroke", "urlToImage": "https://www.healio.com/~/media/slack-news/psychiatry/misc/other/exercise-rehab-ckd.jpg", "publishedAt": "2022-03-21T20:14:18Z", "content": "Medication and exercise are more beneficial in preventing a second stroke in those with intracranial atherosclerosis compared with placement of a blood vessel stent, new guidance from the American Ac… [+1872 chars]"}]}