{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "Your Eyes Can Reveal Your Biological Age, New Study Says — Eat This Not That - Eat This, Not That", "description": "New data shows that a non-invasive eye exam may provide even more information about a patient's general state of health and biological age.", "url": "http://www.eatthis.com/news-eyes-reveal-biological-age/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/01/My-project-48.jpg?quality=82&strip=all", "publishedAt": "2022-01-20T20:32:21Z", "content": "Batting your baby blues, emerald greens, or big brown eyes can make a welcoming first impression on anyone you meet. But, you'd be surprised to learn that upon taking a deeper look into your eyes, th… [+2914 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The cellular response that protects pigs from COVID-19: Research could lead to new treatments in humans - Science Daily", "description": "Studies since the start of the pandemic have noted that pigs exposed to the coronavirus don't show clinical signs of disease nor do they transmit the virus to other animals. Scientists have uncovered important clues that shed light on why pigs don't get sick,…", "url": "https://www.sciencedaily.com/releases/2022/01/220120125443.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-20T18:19:54Z", "content": "Iowa State University scientists may have uncovered an important clue that sheds light on why pigs don't get sick when exposed to the coronavirus.Studies since the start of the pandemic have noted th… [+3571 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Ian le Guillou, The Science Advisory Board contributing writer", "title": "Targeted nanoparticle delivery provides boost for diabetes transplant - The Science Board", "description": "Delivering immunosuppressant treatment via targeted nanoparticles could open the door to a long-lasting cure for type 1 diabetes. Transplanting insulin-producing cells is a promising approach to treat the disease; however, it is plagued by issues of immune re…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=3786", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_bioimg/2020_01_24_19_55_6821_Diabetes_insulin_glucose_blood_20220120175020.jpeg", "publishedAt": "2022-01-20T18:04:55Z", "content": "For the 1.6 million people in the U.S. living with type 1 diabetes, keeping the body's blood sugar levels within the right window at all times can be an ongoing challenge. Without the pancreas supply… [+4109 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Social isolation among older adults linked to having fewer teeth: Higher levels of social isolation -- but not loneliness -- associated with faster tooth loss in older adults in China - Science Daily", "description": "Older adults who are socially isolated are more likely to have missing teeth--and to lose their teeth more quickly over time--than those with more social interaction, according to a new study of Chinese older adults.", "url": "https://www.sciencedaily.com/releases/2022/01/220120125435.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-20T18:00:13Z", "content": "Older adults who are socially isolated are more likely to have missing teeth -- and to lose their teeth more quickly over time -- than those with more social interaction, according to a new study of … [+4484 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Getting back to sports after recovering from COVID-19 - Medical Xpress", "description": "(HealthDay)—Folks who've had a tough case of COVID-19 shouldn't hit the gym for basketball or an aerobics class without getting checked out by their doctor first, according to the American College for Sports Medicine.", "url": "https://medicalxpress.com/news/2022-01-sports-recovering-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/getting-back-to-sports.jpg", "publishedAt": "2022-01-20T18:00:02Z", "content": "(HealthDay)Folks who've had a tough case of COVID-19 shouldn't hit the gym for basketball or an aerobics class without getting checked out by their doctor first, according to the American College for… [+3025 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pavankumar Kamat", "title": "K-Wires Offer No Advantage Over Plaster Casts in Improving Wrist Fracture Outcomes - Medscape", "description": "Fixation using metal Kirschner wires (K-wires) offers no advantage over traditional moulded plaster casts in improving wrist function and pain in patients with distal radius fractures.", "url": "https://www.medscape.com/viewarticle/966941", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_150306_broken_wrist_800x600.jpg", "publishedAt": "2022-01-20T17:59:06Z", "content": "Fixation using metal Kirschner wires (K-wires) offers no advantage over traditional moulded plaster casts in improving wrist function and pain in patients with distal radius fractures. These findings… [+2711 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Intense, regular walking may help prevent Type 2 diabetes among 70 and 80 year olds - News-Medical.Net", "description": "Walking regularly and at greater intensity may help prevent Type 2 diabetes among 70 and 80 year olds, according to one of the first studies measuring steps and pace among this population.", "url": "https://www.news-medical.net/news/20220120/Intense-regular-walking-may-help-prevent-Type-2-diabetes-among-70-and-80-year-olds.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Insulin-620x480.jpg", "publishedAt": "2022-01-20T17:44:00Z", "content": "Walking regularly and at greater intensity may help prevent Type 2 diabetes among 70 and 80 year olds, according to one of the first studies measuring steps and pace among this population.\r\nThe more … [+4675 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Blood Reveals a Troubling Mystery in This Excerpt From Fantasy Tale The Bruising of Qilwa - Gizmodo Australia", "description": "The debut novel from Persian American author Naseem Jamnia, The Bruising of Qilwa follows a nonbinary refugee who’s just fled...", "url": "https://www.gizmodo.com.au/2022/01/blood-reveals-a-troubling-mystery-in-this-excerpt-from-fantasy-tale-the-bruising-of-qilwa/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/01/21/cf336c464006a867aa7799e8b21bd114.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2022-01-20T17:15:00Z", "content": "The debut novel from Persian American author Naseem Jamnia, The Bruising of Qilwa follows a nonbinary refugee whos just fled a homeland where they faced persecution for being a practitioner of blood … [+7141 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Mapping Dementia-Linked Protein Interactions Yields Potential New Treatment Targets - Weill Cornell Medicine Newsroom", "description": "By mapping all the protein interactions of a dementia-linked protein in the brain called Tau, a team of Weill Cornell Medicine investigators has created a road map for identifying potential new treatment targets for Alzheimer’s disease and related dementia.", "url": "https://news.weill.cornell.edu/news/2022/01/mapping-dementia-linked-protein-interactions-yields-potential-new-treatment-targets", "urlToImage": null, "publishedAt": "2022-01-20T16:12:24Z", "content": "By mapping all the protein interactions of a dementia-linked protein in the brain called Tau, a team of Weill Cornell Medicine investigators has created a road map for identifying potential new treat… [+4549 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study explores furin inhibitors as a potential tool for treating COVID-19 infection - News-Medical.net", "description": "A new study suggests that coronaviruses such as SARS-CoV-2 depend on a furin cleavage site between the S1/S2 subunits to enhance viral infectivity.", "url": "https://www.news-medical.net/news/20220120/Researchers-explore-furin-inhibitors-as-a-potential-tool-for-treating-COVID-19-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_702164_16426931574496845.jpg", "publishedAt": "2022-01-20T15:43:00Z", "content": "Furin is a protease enzyme that helps inactive proteins move to a biologically active state. In viruses, furin can cleave sites that help to make the virus more infectious.\r\nA recent article, publish… [+4541 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Preclinical model may shed light on eye disease | Cornell Chronicle - Cornell Chronicle", "description": "Researchers at Weill Cornell Medicine have developed a pre-clinical model of the leading cause of central vision loss in older individuals, dry age-related macular degeneration, and used it to identify new treatment modalities and drug targets.", "url": "https://news.cornell.edu/stories/2022/01/preclinical-model-may-shed-light-eye-disease", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/0120_amd_tnd_0.jpg?itok=v4Etk_6D", "publishedAt": "2022-01-20T15:16:46Z", "content": "Researchers at Weill Cornell Medicine have developed a preclinical model of the leading cause of central vision loss in older individuals and used it to identify new treatment modalities and drug tar… [+2619 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Arterial stiffness in adolescence may drive insulin resistance in adulthood - Healio", "description": "Arterial stiffness in adolescence may be a causal risk factor for hyperinsulinemia and insulin resistance in young adulthood, driving risk for incident type 2 diabetes, according to research published in Hypertension.Emerging evidence among healthy adults fol…", "url": "https://www.healio.com/news/cardiology/20220120/arterial-stiffness-in-adolescence-may-drive-insulin-resistance-in-adulthood", "urlToImage": "https://www.healio.com/~/media/slack-news/cardiology/misc/infographics/2022/01_january/ct0122agbaje_18_graphic_01_web.jpg", "publishedAt": "2022-01-20T14:57:34Z", "content": "Arterial stiffness in adolescence may be a causal risk factor for hyperinsulinemia and insulin resistance in young adulthood, driving risk for incident type 2 diabetes, according to research publishe… [+4791 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jonathan Cox", "title": "Antimicrobial resistance now causes more deaths than HIV/AIDS and malaria worldwide – new study - The Conversation UK", "description": "Latest numbers show antimicrobial resistant infections contributed to 4.95 millions deaths globally in 2019.", "url": "https://theconversation.com/antimicrobial-resistance-now-causes-more-deaths-than-hiv-aids-and-malaria-worldwide-new-study-175351", "urlToImage": "https://images.theconversation.com/files/441722/original/file-20220120-9679-1jg02yy.jpg?ixlib=rb-1.1.0&rect=0%2C682%2C5991%2C2991&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-20T14:28:48Z", "content": "Antimicrobial resistance is spreading rapidly worldwide, and has even been likened to the next pandemic one that many people may not even be aware is happening. A recent paper, published in Lancet, h… [+5333 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Time in glucose target range may decline after COVID-19 vaccine in type 1 diabetes - Healio", "description": "The first dose of a COVID-19 vaccine can cause a decline in interstitial glucose time in range for adults with type 1 diabetes, according to study findings published in Diabetic Medicine. \n&ldquo;COVID-19 vaccination can cause temporary perturbation of inters…", "url": "https://www.healio.com/news/endocrinology/20220120/time-in-glucose-target-range-may-decline-after-covid19-vaccine-in-type-1-diabetes", "urlToImage": "https://www.healio.com/~/media/slack-news/endocrinology/infographics/et0122heald_mm_graphic_01_web.jpg", "publishedAt": "2022-01-20T14:02:03Z", "content": "The first dose of a COVID-19 vaccine can cause a decline in interstitial glucose time in range for adults with type 1 diabetes, according to study findings published in Diabetic Medicine. \r\n“COVID-19… [+3544 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Prospective of graphene and graphene-based derivatives to combat SARS-CoV-2 infection - News-Medical.Net", "description": "Researchers explored the utilities of graphene and its derivatives in combating SARS-CoV-2, highlighting its applications in the biomedical domain.", "url": "https://www.news-medical.net/news/20220120/Prospective-of-graphene-and-graphene-based-derivatives-to-combat-SARS-CoV-2-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_702146_16426858116659783.jpg", "publishedAt": "2022-01-20T13:41:00Z", "content": "In a study published in the latest issue of the journal Materials Today Advances, a team of researchers explored the utilities of graphene (GO) and its derivatives in combating the severe acute respi… [+5524 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Business News - LatestLY", "description": "Get latest articles and stories on Business at LatestLY. NEURIA, a free mobile application developed by Innoplexus A.G., helping millions of people all over the world with their mental health problems and treatment guidance, has now been launched in India.", "url": "https://www.latestly.com/agency-news/business-news-neuria-an-app-to-improve-quality-of-mental-health-and-treatment-of-neurological-patients-and-their-caregivers-launches-in-india-3274785.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/Final2022012012251120220120123056-588x441.jpg", "publishedAt": "2022-01-20T12:46:24Z", "content": "Pune (Maharashtra) [India], January 20 (ANI/PNN): NEURIA, a free mobile application developed by Innoplexus A.G., helping millions of people all over the world with their mental health problems and t… [+3867 chars]"}, {"source": {"id": null, "name": "Glasgow Live"}, "author": "Neil Shaw, Sophie Buchan", "title": "Car insurance warning issued to anyone getting covid vaccine amid rule confusion - Glasgow Live", "description": "Scots are being urged to get the covid vaccine in a bid to help save their lives and the lives of others - however now in an update, an insurance warning is coming with it and it's all about the 15 minute rule.", "url": "https://www.glasgowlive.co.uk/news/health/insurance-warning-covid-vaccine-observation-22804843", "urlToImage": "https://i2-prod.glasgowlive.co.uk/incoming/article22805625.ece/ALTERNATES/s1200/0_GettyImages-1314690493.jpg", "publishedAt": "2022-01-20T12:38:15Z", "content": "People in Scotland are being urged to book their covid vaccine with Scotland's First Minister, Nicola Sturgeon, asking people to do the right thing.\r\nSpeaking at the Scottish Parliament yesterday (Ja… [+4107 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Vishwam Sankaran", "title": "‘Nocebo effect’ may be behind two-thirds of Covid vaccine symptoms, study suggests - The Independent", "description": "Nocebo effect: Majority of Covid jab symptoms not caused by vaccine", "url": "https://www.independent.co.uk/news/science/nocebo-effect-covid-vaccine-symptoms-b1997084.html", "urlToImage": "https://static.independent.co.uk/2022/01/19/04/GettyImages-1237457898.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2022-01-20T11:55:24Z", "content": "Nearly two-thirds of reported adverse effects to vaccination against Covid-19, such as headaches and fatigue, could be due to the nocebo effect a negative version of the placebo effect a new study ha… [+4311 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study simulates transmission of SARS-CoV-2 in airliner cabins - News-Medical.Net", "description": "A study published in Indoor Air simulated the transmission of SARS-CoV-2, the virus that causes COVID-19, on a flight from London to Hanoi and on another flight from Singapore to Hangzhou.", "url": "https://www.news-medical.net/news/20220120/Study-simulates-transmission-of-SARS-CoV-2-in-airliner-cabins.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/91ddc6498ae046de959ddcfb662105d8-620x480.jpg", "publishedAt": "2022-01-20T11:53:00Z", "content": "A study published in Indoor Air simulated the transmission of SARS-CoV-2, the virus that causes COVID-19, on a flight from London to Hanoi and on another flight from Singapore to Hangzhou.\r\nWhen simu… [+1220 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Potential New Diagnostic and Therapeutic Target for Lung Cancer - SciTechDaily", "description": "Chinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA termed as lysosome cell death regulator (LCDR) in tumor survival, providing a potential diagnostic and therapeutic target for lung cancer. Led by Prof. GAO S…", "url": "https://scitechdaily.com/potential-new-diagnostic-and-therapeutic-target-for-lung-cancer/", "urlToImage": "https://scitechdaily.com/images/Lung-Cancer-Illustration.jpg", "publishedAt": "2022-01-20T11:04:15Z", "content": "ByChinese Academy of SciencesJanuary 20, 2022\r\nChinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA\r\nRibonucleic acid (RNA) is a polymeric molecule si… [+3675 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Lancet study flags breakthrough omicron infections after boosters - Down To Earth Magazine", "description": "Cases of omicron infection noted among 7 Germans who visited South Africa; All had received at least 2 shots of an mRNA vaccine while 5 had received the follow up booster dose", "url": "https://www.downtoearth.org.in/news/health/lancet-study-flags-breakthrough-omicron-infections-after-boosters-81207", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-01-20/0.44324600_1642674980_45.jpg", "publishedAt": "2022-01-20T10:47:55Z", "content": "Cases of omicron infection noted among 7 Germans who visited South Africa; All had received at least 2 shots of an mRNA vaccine while 5 had received the follow up booster doseOmicron’s ability to eva… [+3437 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Not heavy viral load; studies say this is the reason why Omicron spreads so fast - Hindustan Times", "description": "The studies, cited by Nature, found that the viral load of people infected by Omicron was actually similar or less than those who were infected by Delta, the previous dominant strain of SARS-CoV-2.  | World News", "url": "https://www.hindustantimes.com/world-news/not-heavy-viral-load-studies-say-this-is-the-reason-why-omicron-spreads-so-fast-101642674095575.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/20/1600x900/HEALTH-CORONAVIRUS-BRAZIL-3_1642674408627_1642674432895.JPG", "publishedAt": "2022-01-20T10:29:27Z", "content": "The viral load of Omicron and Delta is almost the same and it is not the reason why Omicron rapidly surged across the world and became the dominant SARs-CoV-2 strain replacing Delta. According to Nat… [+1894 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Risk score predicts disease progression in patients with rheumatoid arthritis - Medical Xpress", "description": "Scientists have created a risk score based on thousands of genetic variants to determine the prognosis of individual patients with rheumatoid arthritis.", "url": "https://medicalxpress.com/news/2022-01-score-disease-patients-rheumatoid-arthritis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/9-patient.jpg", "publishedAt": "2022-01-20T08:54:22Z", "content": "Scientists have created a risk score based on thousands of genetic variants to determine the prognosis of individual patients with rheumatoid arthritis.\r\nIn a study published in Arthritis &amp; Rheum… [+886 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dani Blum", "title": "I had breakthrough COVID-19. Can I start living like it's 2019? - The Japan Times", "description": "As Omicron cases skyrocket, more vaccinated people may get “hybrid” immunity after a breakthrough infection. But experts still encourage precautions.", "url": "https://www.nytimes.com/2022/01/19/well/live/breakthrough-covid-immunity.html", "urlToImage": "https://static01.nyt.com/images/2022/01/11/well/00well-covid-super-immunity/00well-covid-super-immunity-facebookJumbo.jpg", "publishedAt": "2022-01-20T08:02:55Z", "content": "Experts also caution against trying to get infected on purpose as a way to gain hybrid immunity. I really worry that people will intentionally get infected so they can get to this new normal, said Dr… [+2641 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Finds Shorter Treatment Better for Young Kids with Outpatient Pneumonia - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. A new study has found that five days of antibiotics is superior to ten days for children with community-acquired pneumonia who are not hospitalised.", "url": "https://www.latestly.com/agency-news/health-news-study-finds-shorter-treatment-better-for-young-kids-with-outpatient-pneumonia-3273416.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/thermometer-1539191_19202022012006302220220120064310-588x441.jpg", "publishedAt": "2022-01-20T06:56:23Z", "content": "Washington [US], January 20 (ANI): A new study has found that five days of antibiotics is superior to ten days for children with community-acquired pneumonia who are not hospitalised.\r\nThe study has … [+3639 chars]"}, {"source": {"id": null, "name": "CHEK"}, "author": "Jeff Lawrence", "title": "Here's what to do if your child has COVID-19 in B.C. - CHEK", "description": "At this point, some parents in British Columbia may be confused at what seems like ever-changing rules surrounding what to do if your child tests positive for COVID-19. When can you send... more", "url": "https://www.cheknews.ca/heres-what-to-do-if-your-child-has-covid-19-in-b-c-940191/", "urlToImage": "https://cdn.cheknews.ca/wp-content/uploads/2021/12/29131739/Person-Child-Mask-COVID-19-Photo-Credit-Kelly-Sikkema-Unsplash.png", "publishedAt": "2022-01-20T06:33:45Z", "content": "At this point, some parents in British Columbia may be confused at what seems like ever-changing rules surrounding what to do if your child tests positive for COVID-19. When can you send them back to… [+4190 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Estrogen-activated neurocircuit in females provide anti-obesity benefits - News-Medical.Net", "description": "Seeking to better understand the key role the female hormone estrogen plays in maintaining energy balance and weight control, a group led by researchers at Baylor College of Medicine looked into estrogen interactions with specific brain regions that provide t…", "url": "https://www.news-medical.net/news/20220120/Estrogen-activated-neurocircuit-in-females-provide-anti-obesity-benefits.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/3/Obesity-Jakub_Cejpek_ead0fb8492f0437f96e9fd842630990c-620x480.jpg", "publishedAt": "2022-01-20T06:15:00Z", "content": "Seeking to better understand the key role the female hormone estrogen plays in maintaining energy balance and weight control, a group led by researchers at Baylor College of Medicine looked into estr… [+3317 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Environmental risk factors driving the nearsightedness 'epidemic' in the UK - News-Medical.Net", "description": "A team of researchers used the UK Biobank Study to investigate whether changing environmental factors are causing an increase in myopia.", "url": "https://www.news-medical.net/news/20220120/Environmental-risk-factors-driving-the-nearsightedness-epidemic-in-the-UK.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_701989_16426031648357404.jpg", "publishedAt": "2022-01-20T05:49:00Z", "content": "Myopia is a refractive error that occurs at the other end of the refractive error spectrum from hypermetropia. More commonly known as nearsightedness, it has long piqued the interest of doctors and s… [+5556 chars]"}, {"source": {"id": null, "name": "Tittlepress.com"}, "author": "newsdesk", "title": "New research fund to focus on inequities in lung cancer treatment and diagnosis - TittlePress", "description": "Gross inequities in treatment and survival rates for Maori and Pacific patients diagnosed with New Zealand's biggest cancer", "url": "https://tittlepress.com/health/1463475/", "urlToImage": "https://www.rnz.co.nz/assets/news/197706/eight_col_hospital.jpg?1559955849", "publishedAt": "2022-01-20T05:16:57Z", "content": "Gross inequities in treatment and survival rates for Maori and Pacific patients diagnosed with New Zealand’s biggest cancer killer are the subject of $6 million in new research funding.\r\nThe Lung Fou… [+6557 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "New AI model identifies genes responsible for motor neurone disease - Tech Explorist", "description": "The model has so far identified 690 risk genes for MND, many of which are discoveries.", "url": "https://www.techexplorist.com/new-ai-model-identifies-genes-responsible-motor-neurone-disease/44209/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/01/neurons.jpg", "publishedAt": "2022-01-20T05:06:11Z", "content": "Motor neurone disease (MND), a rare condition that affects the brain and nerves, is mainly caused by a complex disease called Amyotrophic lateral sclerosis (ALS).\r\nNow scientists at the University of… [+1790 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "People that suffered only mild COVID-19 still had memory and concentration problems, with some experiencing issues 9 months later, a study found - Business Insider Australia", "description": "An Oxford University study found that people who recovered from mild COVID-19 had worse cognitive performance than those who hadn't had the virus.", "url": "https://www.businessinsider.com/covid-symptoms-memory-attention-concentration-mild-disease-study-2022-1", "urlToImage": "https://i.insider.com/61e93d1b7c6a20001842b0b3?format=jpeg", "publishedAt": "2022-01-20T03:10:00Z", "content": "COVID-19 sufferers’ memory and attention problems resolved after 9 months, an Oxford University study found. Getty Images \r\nPeople that fully recovered from mild COVID-19 still suffered from memory a… [+2276 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Imaging collagen – a new technique for therapeutics? - EurekAlert", "description": "A new study from the Medical University of South Carolina, published in the Journal of the American Society for Mass Spectrometry, found that MALDI-IMS can be used to visualize the efficacy and distribution of recombinant human collagen hydrogel injection fol…", "url": "https://www.eurekalert.org/news-releases/940658", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/f72ac17f-b14e-459c-adab-0f0a245bf1e7/Rendition/thumbnail/Content/Public", "publishedAt": "2022-01-20T02:06:18Z", "content": "image: Rat heart N-glycans detected by imaging mass spectrometry. Left) Fixed tissue section from rat heart. Ao- aorta; AV- aortic valve; MV-mitral valve; LV- left ventricle. Right) Three N-glycans w… [+7422 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Battling bone loss for women with breast cancer - WPLG Local 10", "description": "The rate of death from breast cancer has steadily dropped since 1992 but many women live with long term side effects from their treatments, including bone loss.", "url": "https://www.youtube.com/watch?v=Un_NJG6D91U", "urlToImage": "https://i.ytimg.com/vi/Un_NJG6D91U/hqdefault.jpg", "publishedAt": "2022-01-20T01:59:19Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "‘Decoy’ protein mitigates lung damage, death induced by aggressive SARS-CoV-2 variants - News-Medical.net", "description": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease, according to a Nature Chemical Biology study from researchers at the University of Illinoi…", "url": "https://www.news-medical.net/news/20220119/e28098Decoye28099-protein-mitigates-lung-damage-death-induced-by-aggressive-SARS-CoV-2-variants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2022-01-20T01:17:00Z", "content": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease, according to a Nature Chemical… [+4618 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Cassandra Green", "title": "The covid side effect you might not know about - Body and Soul", "description": "The covid side effect you might not know about", "url": "https://www.bodyandsoul.com.au/health/the-covid-side-effect-you-might-not-know-about/news-story/e03d8231be24a4c4202fb29b538428b2", "urlToImage": "https://cdn.newsapi.com.au/image/v1/af61c2751e035c471a6ad99dfaff1db7", "publishedAt": "2022-01-20T01:01:08Z", "content": "We share the new research linking Covid to temporary hair loss.As an Australian you probably knew very few people who had Covid-19 in the first waves of 2020 and 2021 because community transmission r… [+3044 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Tom Knowles", "title": "AI could spot HER2-low breast cancer that doctors can miss - The Times", "description": "Tens of thousands of women in the UK could soon benefit from a new artificial intelligence tool that can detect a type of breast cancer that doctors often find", "url": "https://www.thetimes.co.uk/article/ai-could-spot-her2-low-breast-cancer-that-doctors-can-miss-7dj7cghcp", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fd3b2b71e-7964-11ec-a9ac-7b4ca33c4cb4.jpg?crop=5709%2C3211%2C0%2C297&resize=1200", "publishedAt": "2022-01-20T00:01:00Z", "content": "Tens of thousands of women in the UK could soon benefit from a new artificial intelligence tool that can detect a type of breast cancer that doctors often find hard to identify.\r\nThe creators of the … [+528 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Charis Chang", "title": "Woman who’s had ‘long Covid’ for 12 years - NEWS.com.au", "description": "<p>While long Covid may seem like a recent phenomenon, some Australians have been familiar with some of the symptoms for more than a decade. </p>", "url": "https://www.news.com.au/lifestyle/health/health-problems/adelaide-woman-whos-had-long-covid-for-12-years/news-story/11e248b489a8a5aa7f6a8701447503a9", "urlToImage": "https://content.api.news/v3/images/bin/83647aa3bcd1eeff18475cca56cd8684", "publishedAt": "2022-01-19T23:56:00Z", "content": "A group of women whose ill health has been ignored for years may hold the key to long Covid, including a simple test that could help diagnose sufferers.While long Covid may seem like a recent phenome… [+17670 chars]"}, {"source": {"id": null, "name": "Canberraweekly.com.au"}, "author": null, "title": "ANU researchers discover possible cure for COVID - Canberra Weekly", "description": "ANU researchers have discovered a low-cost, widely available drug that could fight COVID-19, and treat patients, everywhere, within months.", "url": "https://canberraweekly.com.au/anu-researchers-discover-possible-cure-for-covid/", "urlToImage": "https://canberraweekly.com.au/wp-content/uploads/2022/01/93cdd7f5-388d-4441-6e70-57886dd41801.jpg", "publishedAt": "2022-01-19T23:34:51Z", "content": "ANU researchers have discovered a low-cost, widely available drug that could fight COVID-19. Heparin limits lung damage when inhaled by COVID-19 patients, according to world-first findings from the A… [+3153 chars]"}, {"source": {"id": null, "name": "POPSUGAR"}, "author": "Kate Schweitzer", "title": "COVID, the Flu, Croup, or Strep Throat? How to Understand Your Child's Symptoms - POPSUGAR", "description": "A family doctor explains the varying crossover symptoms between COVID-19 and other pediatric illnesses like the common cold, flu, strep throat, or croup.", "url": "https://www.popsugar.com/family/covid-flu-strep-throat-or-croup-what-child-symptoms-mean-48686878", "urlToImage": "https://media1.popsugar-assets.com/files/thumbor/PIGXlHGHXh4YWZYqjt6Dp-7FOuw/0x154:6699x3671/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-/2022/01/19/977/n/24155406/1df10d0861e8904a29da62.49031222_.jpg", "publishedAt": "2022-01-19T22:49:04Z", "content": "Lately, parents have been trained to have tunnel vision with their children's health. It seems the only diagnosis that matters to keep their kid in daycare or school is COVID-19. Bayo Curry-Winchell,… [+3788 chars]"}, {"source": {"id": null, "name": "Womensagenda.com.au"}, "author": null, "title": "How to look after your mental health if you're at home with COVID - Women's Agenda", "description": "A GP and mental health clinician offers some tips to support your mental health if you get COVID and are isolating at home.", "url": "https://womensagenda.com.au/latest/how-to-look-after-your-mental-health-if-youre-at-home-with-covid/", "urlToImage": "https://womensagenda.com.au/wp-content/uploads/2022/01/file-20220117-14633-kpxnoz.jpg", "publishedAt": "2022-01-19T22:20:48Z", "content": "The COVID pandemic has made living with mental illness even more difficult, and people have had to adapt their normal management strategies to cope, writes Louise Stone, from the Australian National … [+6108 chars]"}, {"source": {"id": null, "name": "Ucsd.edu"}, "author": null, "title": "New Sensor Grids Record Human Brain Signals in Record-Breaking Resolution - UC San Diego Health", "description": "A new array of sensors can record electrical signals directly from the surface of the human brain in record-breaking detail: 100 times higher resolution than today's clinical tools. This could improve neurosurgeons' ability to remove brain tumors safely and s…", "url": "https://ucsdnews.ucsd.edu/pressrelease/new-sensor-grids-record-human-brain-signals-in-record-breaking-resolution", "urlToImage": "https://ucsdnews.ucsd.edu/news_uploads/THUMBNAIL-high-res-brain-grids-SMALL.jpg", "publishedAt": "2022-01-19T19:02:31Z", "content": "A team of engineers, neurosurgeons and medical researchers has published data from both humans and rats demonstrating that a new array of brain sensors can record electrical signals directly from the… [+15494 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Julie Steenhuysen and Manas Mishra", "title": "Prior COVID infection more protective than vaccination alone during Delta surge: study - Sydney Morning Herald", "description": "The CDC study showed that people who survived a previous Delta infection had lower rates of COVID-19 than people who were vaccinated alone.", "url": "https://www.smh.com.au/world/north-america/prior-covid-infection-more-protective-than-vaccination-alone-during-delta-surge-study-20220120-p59poa.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.4221%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_81/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/7508ffe3715d61903ee43a7882eda01e8e204026", "publishedAt": "2022-01-19T18:59:39Z", "content": "Washington: People who had previously been infected with COVID-19 were better protected against the Delta variant than those who were vaccinated alone, suggesting that natural immunity was a more pot… [+1263 chars]"}, {"source": {"id": null, "name": "Drugtopics.com"}, "author": "Karen Berger, PharmD", "title": "Managing Migraine, Part 2: Prescription Preventive Therapies to Reduce Migraine Frequency - Drug Topics", "description": "Preventive medications might be considered in patients with 4 or more migraine days per month.", "url": "https://www.drugtopics.com/view/managing-migraine-part-2-prescription-preventive-therapies-to-reduce-migraine-frequency", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/d6ff6e20e0a26383df4b2aa54016dbc372cf362a-1698x1131.jpg?fit=crop&auto=format", "publishedAt": "2022-01-19T16:23:05Z", "content": "Pharmacists can be a helpful resource in counseling patients with migraine. In part 1, Sara Crystal, MD, a neurologist and headache specialist and medical director of Cove discussed nonprescription m… [+2171 chars]"}, {"source": {"id": null, "name": "FiveThirtyEight"}, "author": "Maggie Koerth", "title": "How Omicron Upended What We Thought We Knew About Natural Immunity - FiveThirtyEight", "description": "After dizzily swelling for weeks, COVID-19 cases seem to be leveling off in New York and Chicago. In the greater Boston area, the amount of SARS-CoV-2 found in …", "url": "https://fivethirtyeight.com/features/how-omicron-upended-what-we-thought-we-knew-about-natural-immunity/", "urlToImage": "https://fivethirtyeight.com/wp-content/uploads/2022/01/COVID-IMMUNITY_16x9.png?w=700", "publishedAt": "2022-01-19T16:22:39Z", "content": "After dizzily swelling for weeks, COVID-19 cases seem to be leveling off in New York and Chicago. In the greater Boston area, the amount of SARS-CoV-2 found in wastewater is going down as quickly as … [+7411 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Oral penicillin, not injectable, advised for people with high-risk rheumatic heart disease - Medical Xpress", "description": "A growing body of evidence indicates that some people thought to have an allergic response to injectable penicillin, the standard treatment for rheumatic heart disease, may instead be experiencing a cardiac reaction to the medicine, according to a new America…", "url": "https://medicalxpress.com/news/2022-01-oral-penicillin-people-high-risk-rheumatic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/heart-diagram.jpg", "publishedAt": "2022-01-19T14:48:35Z", "content": "A growing body of evidence indicates that some people thought to have an allergic response to injectable penicillin, the standard treatment for rheumatic heart disease, may instead be experiencing a … [+5454 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Scientists discover how Zika Virus evades cellular antiviral response - Open Access Government", "description": "The immune system is designed to stop invading pathogens - with over 200 virus species capable of infecting humans", "url": "https://www.openaccessgovernment.org/zika-virus/127897/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2022/01/dreamstime_xxl_97154253-scaled.jpg", "publishedAt": "2022-01-19T14:36:56Z", "content": "In a study from Northwestern University, scientists have discovered a key mechanism used by the Zika virus to evade the antiviral response of the cell it is attacking.\r\nThe finding will contribute to… [+2118 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "3D robotic spine 'twin' and sensor offer new way to preview surgical interventions - Science Daily", "description": "Researchers created a novel 3D printed robotic replica of a human spine modified to include an artificial disc implant with a soft magnetic sensor array to enable surgeons to preview the effects of surgical interventions prior to the operation. The patient-sp…", "url": "https://www.sciencedaily.com/releases/2022/01/220119090842.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T14:12:31Z", "content": "Degenerative disc disease affects about 40 percent of people aged 40, increasing to about 80 percent among those aged 80 or older. The disease, which is the deterioration of one or more intervertebra… [+5271 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Mayo Clinic Minute - Why Black women need to get screened for cervical cancer - Mayo Clinic", "description": "While all women can develop cervical cancer, non-Hispanic Black women are more likely to be diagnosed and die of cervical cancer, compared to white women in ...", "url": "https://www.youtube.com/watch?v=Zvh20yQqeK4", "urlToImage": "https://i.ytimg.com/vi/Zvh20yQqeK4/maxresdefault.jpg", "publishedAt": "2022-01-19T13:35:23Z", "content": null}, {"source": {"id": null, "name": "Biopharminternational.com"}, "author": "BioPharm International Editors", "title": "COVID-19 Vaccines Safe for Use During Pregnancy, EMA States - BioPharm International", "description": "The agency’s COVID-19 task force says latest data shows use of COVID-19 mRNA vaccines during pregnancy is safe.", "url": "https://www.biopharminternational.com/view/covid-19-vaccines-safe-for-use-during-pregnancy-ema-states", "urlToImage": "https://www.biopharminternational.com/welcome_ad_logo.jpg", "publishedAt": "2022-01-19T13:21:28Z", "content": "On January 18, 2022, the European Medicines Agency (EMA) stated that its COVID-19 task force reviewed several studies involving approximately 65,000 pregnancies and did not find any sign of increased… [+1565 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Do healthy kids need booster shots against COVID? WHO`s chief scientist answers - WION", "description": "Soumya Swaminathan, the top scientist of the World Health Organization (WHO), stated that there is no evidence that healthy children and adolescents require COVID-19 booster doses.", "url": "https://www.wionews.com/world/do-healthy-kids-need-booster-shots-against-covid-whos-chief-scientist-answers-445974", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/03/148008-soumya-swaminathan.jpg, WHO, Chief Scientist\" typeof=\"foaf:Image\" />", "publishedAt": "2022-01-19T12:58:45Z", "content": "Soumya Swaminathan, the top scientist of the World Health Organization (WHO), stated that there is no evidence that healthy children and adolescents require COVID-19 booster doses.\r\nIn the case of Om… [+1531 chars]"}, {"source": {"id": null, "name": "Wiley.com"}, "author": null, "title": "Kinetics and persistence of cellular and humoral immune responses to SARS‐CoV‐2 vaccine in healthcare workers with or without prior COVID‐19 - Wiley", "description": "SARS-CoV-2 vaccines are highly efficient against severe forms of the disease, hospitalization and death. Nevertheless, insufficient protection against several circulating viral variants might suggest...", "url": "https://onlinelibrary.wiley.com/doi/10.1111/jcmm.17186", "urlToImage": "https://onlinelibrary.wiley.com/cms/asset/a0d5d5c1-067a-417d-9bc3-fc162391e9d5/jcmm.v26.2.cover.jpg", "publishedAt": "2022-01-19T11:41:21Z", "content": "1 INTRODUCTION\r\nSevere acute respiratory syndrome coronavirus-2 (SARS-CoV-2) spread rapidly around the globe infecting by the end of November 2021 over 250 million individuals and causing over 5 mill… [+41544 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "How many times can one get reinfected with Covid-19? - The Indian Express", "description": "Covid-19 Omicron wave: Doctors say it's not that the antibodies do not work, but there is a possibility that they \"may not be sufficient antibody response to the infection\", due to which the person may not develop adequate immunity and his body is prone to in…", "url": "https://indianexpress.com/article/lifestyle/health/reinfected-covid-19-positive-omicron-variants-antibody-vaccination-7717861/", "urlToImage": "https://images.indianexpress.com/2022/01/covid-testing_1200_express-photo-by-nirmal-harindran.jpg", "publishedAt": "2022-01-19T11:17:48Z", "content": "Of late, many cases of individuals being re-infected with Covid-19 have been reported, prompting health authorities to once again stress on the need to continue taking precautionary measures. As such… [+7042 chars]"}, {"source": {"id": null, "name": "Monash.edu"}, "author": "", "title": "The dreaded 'D' word: The search for a cure to prevent or delay dementia - Monash University", "description": "If there’s one dreaded word uttered by doctors to rival “cancer”, it’s “dementia”.", "url": "https://www.monash.edu/medicine/news/latest/2022-articles/the-dreaded-d-word-the-search-for-a-cure-to-prevent-or-delay-dementia", "urlToImage": "https://www.monash.edu/__data/assets/image/0010/2807902/dementia.jpg", "publishedAt": "2022-01-19T08:00:00Z", "content": "19 January 2022\r\nIf there’s one dreaded word uttered by doctors to rival “cancer”, it’s “dementia”. Patients the world over fear its impacts – the lack of independence; the higher likelihood of endin… [+4701 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 Immunity: Can You Catch Coronavirus Again? | 10 News First - 10 News First", "description": "Antibodies from a COVID-19 infection do not give you immunity from getting the coronavirus again, with health experts saying that you should get your vaccina...", "url": "https://www.youtube.com/watch?v=rCsVDlxLKhA", "urlToImage": "https://i.ytimg.com/vi/rCsVDlxLKhA/maxresdefault.jpg", "publishedAt": "2022-01-19T06:22:56Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Experts reveal why most data-driven initiatives failed to impact COVID-19 public health crisis - News-Medical.Net", "description": "Inspired by their own experiences, representatives of a data-driven initiative to aid the COVID-19 response have outlined what they view as major obstacles to the successful use of novel data released by technology companies in times of crisis.", "url": "https://www.news-medical.net/news/20220119/Experts-reveal-why-most-data-driven-initiatives-failed-to-impact-COVID-19-public-health-crisis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-01-19T06:16:00Z", "content": "Inspired by their own experiences, representatives of a data-driven initiative to aid the COVID-19 response have outlined what they view as major obstacles to the successful use of novel data release… [+2798 chars]"}, {"source": {"id": null, "name": "Nation.lk"}, "author": null, "title": "Osteopath Brendon Talbot shares his secret exercise to strengthen your core and lower back - nation.lk - The Nation Newspaper", "description": "Canadian osteopath, Brendon Talbot, revealed his secret exercise for getting a 'bulletproof' core, strengthening the lower back and improve balance and coordination instead of doing crunches.", "url": "https://www.nation.lk/online/osteopath-brendon-talbot-shares-his-secret-exercise-to-strengthen-your-core-and-lower-back-166995.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/18/23/53092017-0-image-a-14_1642548489931.jpg", "publishedAt": "2022-01-19T04:14:58Z", "content": "An osteopath has revealed his key exercise for getting a 'bulletproof' core instead of doing crunches. \r\nBrendon Talbot, a Canadian health practitioner who specialises in bone and muscle tissue, shar… [+4035 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New study highlights major deficiencies in lung cancer care in Australia - EurekAlert", "description": "Curtin-led research has exposed serious flaws in the services and infrastructure available in Australia for the treatment of lung cancer, which is the country’s leading cause of cancer-related death.", "url": "https://www.eurekalert.org/news-releases/940529", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-01-19T00:56:15Z", "content": "Curtin-led research has exposed serious flaws in the services and infrastructure available in Australia for the treatment of lung cancer, which is the country’s leading cause of cancer-related death.… [+3728 chars]"}]}