{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "What the Food Sector Needs To Know About Reducing Sodium - Technology Networks", "description": "Many of us eat too much salt and a lot of that comes from processed and packaged foods. A recent review looks at strategies to reduce it's use in food production.", "url": "https://www.technologynetworks.com/applied-sciences/news/what-the-food-sector-needs-to-know-about-reducing-sodium-360679", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/360679/what-the-food-sector-needs-to-know-about-reducing-sodium-360679-640x360.jpg?cb=20220419", "publishedAt": "2022-04-19T08:23:57Z", "content": "Sodium is an essential micronutrient, but the amount we need is small. Three slices of bread or one teaspoon of table salt will do it, and chances are your daily sodium intake is far greater. More th… [+5282 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Conor Meehan", "title": "Hepatitis cases are increasing among children in the UK – could COVID have a role to play? - The Conversation", "description": "While COVID-19 hasn’t been ruled out as a potential cause, the leading contender is actually adenovirus, a common infection in children that can lead to hepatitis on rare occasions.", "url": "https://theconversation.com/hepatitis-cases-are-increasing-among-children-in-the-uk-could-covid-have-a-role-to-play-181303", "urlToImage": "https://images.theconversation.com/files/458404/original/file-20220418-26-xlqn7o.jpg?ixlib=rb-1.1.0&rect=0%2C325%2C5873%2C2932&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-04-19T08:06:50Z", "content": "There has been a sharp increase in severe hepatitis cases among children under ten in the UK over recent months. The UK Health Security Agency has been informed of 74 cases since January 2022, with 4… [+5351 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Pfizer's Paxlovid may offer relief for long COVID, more studies needed - CGTN", "description": "Reports of two patients who found relief from long COVID after taking Pfizer's antiviral Paxlovid, including a researcher who tested it on herself, provide intriguing evidence for clinical trials to help those suffering from the debilitating condition, expert…", "url": "https://news.cgtn.com/news/2022-04-19/Pfizer-s-Paxlovid-may-offer-relief-for-long-COVID-more-studies-needed-19lY0BwCH0A/index.html", "urlToImage": "https://news.cgtn.com/news/2022-04-19/Pfizer-s-Paxlovid-may-offer-relief-for-long-COVID-more-studies-needed-19lY0BwCH0A/img/71241717a1c74645b9d0c9f0e97b09a1/71241717a1c74645b9d0c9f0e97b09a1-750.png", "publishedAt": "2022-04-19T07:28:23Z", "content": "Reports of two patients who found relief from long COVID after taking Pfizer's antiviral Paxlovid, including a researcher who tested it on herself, provide intriguing evidence for clinical trials to … [+5150 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Have Eradicated Liver Cancer in Rats Using Non-Invasive Sound Waves - ScienceAlert", "description": "Rats afflicted with liver cancer have demonstrated the efficacy of a fascinating, non-invasive treatment.", "url": "https://www.sciencealert.com/scientists-have-used-sound-waves-to-eradicate-tumors-in-rats", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/histotripsy-ultrasound-array-transducer_1024.jpg", "publishedAt": "2022-04-19T06:37:10Z", "content": "Rats afflicted with liver cancer have demonstrated the efficacy of a fascinating, non-invasive treatment.\r\nUsing focused ultrasound, scientists have managed to destroy up to 75 percent of the volume … [+4331 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Matthew Cantor", "title": "A TikTok dentist says cavities are contagious – is the viral claim true? - The Guardian", "description": "A Houston dentist is confronting TikTok with a brutal truth: you can get cavities from kissing", "url": "https://amp.theguardian.com/society/2022/apr/19/are-cavities-contagious-tiktok-dentist", "urlToImage": null, "publishedAt": "2022-04-19T05:00:00Z", "content": "DentistsA Houston dentist is confronting TikTok with a brutal truth: you can get cavities from kissing\r\nNext time youre considering a passionate embrace, you might want to consult your partners denta… [+3399 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds link between woman's history of infertility and increased heart failure risk - News-Medical.Net", "description": "A new study finds that a history of infertility is associated with increased risk of heart failure. Published in the Journal of the American College of Cardiology, researchers from Massachusetts General Hospital revealed that women who had experienced inferti…", "url": "https://www.news-medical.net/news/20220419/Study-finds-link-between-womans-history-of-infertility-and-increased-heart-failure-risk.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Infertility-620x480.jpg", "publishedAt": "2022-04-19T04:34:00Z", "content": "A new study finds that a history of infertility is associated with increased risk of heart failure. Published in the Journal of the American College of Cardiology, researchers from Massachusetts Gene… [+5173 chars]"}, {"source": {"id": null, "name": "McKnight's Long Term Care News"}, "author": null, "title": "Study: Healthy lifestyle adds to longevity, but not for Alzheimer's patients - McKnight's Long Term Care News", "description": "A healthy lifestyle can go a long way to adding years to your life, but it might not help those with Alzheimer’s disease and dementia.", "url": "https://www.mcknights.com/news/clinical-news/study-healthy-lifestyle-adds-to-longevity-but-not-for-alzheimers-patients/", "urlToImage": "https://www.mcknights.com/wp-content/uploads/sites/5/2022/04/alzheimers-story.jpg", "publishedAt": "2022-04-19T04:09:55Z", "content": "A healthy lifestyle can go a long way to adding years to your life, but it might not help those with Alzheimers disease and dementia. Those are the findings of a new study by Klodian Dhana, M.D., ass… [+1648 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Newly developed genetic risk scores could help patients, physicians make health decisions - EurekAlert", "description": "In a new paper published in Nature Medicine, researchers from Brigham and Women’s Hospital, Veterans Affairs (VA) Boston Healthcare System, and Harvard Medical School developed and validated polygenic risk scores for six common diseases. The team also develop…", "url": "https://www.eurekalert.org/news-releases/949869", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-19T02:01:00Z", "content": "A person’s risk of developing diseases such as type 2 diabetes or breast cancer may be influenced by thousands of genetic differences. Looking at a single DNA difference that has a small effect on ri… [+5672 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Chiral gold nanoparticles increase vaccine efficacy by more than 25%, study suggests - EurekAlert", "description": "Researcheres  tested the nanoparticles on human immune cells cultured in vitro and found that the chiral nanoparticles induced production of substances associated with an immune response even in the absence of an antigen.", "url": "https://www.eurekalert.org/news-releases/949984", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/a8c53637-da2e-4d01-beff-50ecc80d2447/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-19T02:01:00Z", "content": "image: Computational model of gold nanoparticle functionalized with left-handed enantiomers of cysteine and phenylalanineview more \r\nCredit: André Farias de Moura\r\nVaccines can be made over 25% more … [+5513 chars]"}, {"source": {"id": null, "name": "WWLP.com"}, "author": "Kristina D'Amours, Waleed Azad", "title": "Know the differences between COVID-19 and the Flu - WWLP.com", "description": "As flu cases continue to rise here in the state, 22News is working for you on the differences between COVID-19 and the flu.", "url": "https://www.wwlp.com/news/health/coronavirus-local-impact/know-the-differences-between-covid-19-and-the-flu/", "urlToImage": "https://www.wwlp.com/wp-content/uploads/sites/26/2022/04/GettyImages-1297985631.jpg?w=1280", "publishedAt": "2022-04-19T01:59:47Z", "content": "CHICOPEE, Mass. (WWLP) – As flu cases continue to rise here in the state, 22News is working for you on the differences between COVID-19 and the flu.\r\nBoth the flu and COVID-19 can have many different… [+367 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Individual and residency program factors related to depression, anxiety and burnout in physician residents – a Brazilian survey - BMC Psychiatry - BMC Psychiatry", "description": "Background Psychological distress is common among medical trainees. This study aimed to assess the frequency of depression, anxiety and burnout among physician residents and their association with both individual and residency program-related factors. Methods…", "url": "https://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-022-03916-0", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12888.jpg", "publishedAt": "2022-04-19T01:34:15Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The brain's reaction to COVID's inflammatory tidal wave - News-Medical.Net", "description": "Researchers study neuroinflammation in the cerebrospinal fluid and serum of patients infected with SARS-CoV-2.", "url": "https://www.news-medical.net/news/20220418/The-brains-reaction-to-COVIDs-inflammatory-tidal-wave.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_711053_16503211059821677.jpg", "publishedAt": "2022-04-19T01:22:00Z", "content": "In a recent study published on the medRxiv* preprint server, researchers study neuroinflammation in the cerebrospinal fluid (CSF) and serum of patients infected with severe acute respiratory syndrome… [+6587 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New nanotechnology approach developed for the elimination of endometriosis lesions - News-Medical.Net", "description": "Scientists have developed a new nanotechnology approach for locating and removing the painful and dangerous lesions associated with endometriosis, a common gynecological condition in women of childbearing age.", "url": "https://www.news-medical.net/news/20220418/New-nanotechnology-approach-developed-for-the-elimination-of-endometriosis-lesions.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/PLGA_nanoparticles_for_delivery_of_drugs-620x480.jpg", "publishedAt": "2022-04-19T01:18:00Z", "content": "Scientists have developed a new nanotechnology approach for locating and removing the painful and dangerous lesions associated with endometriosis, a common gynecological condition in women of childbe… [+4866 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Poor sleep increases risk of long COVID - News-Medical.Net", "description": "Researchers investigate the presence and impact of health behaviors like smoking and poor sleep in individuals on long COVID.", "url": "https://www.news-medical.net/news/20220418/Poor-sleep-increases-risk-of-long-COVID.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_711052_16503307698289748.jpg", "publishedAt": "2022-04-19T01:13:00Z", "content": "In a recent study published on the medRxiv* preprint server, researchers investigate the presence and impact of health behaviors like smoking, and poor sleep in individuals who contracted coronavirus… [+5264 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Impact of COVID-19 pandemic on vaccination campaigns for diseases preventable by vaccine - News-Medical.Net", "description": "Researchers assess the influence of the COVID-19 pandemic on vaccine-preventable disease initiatives.", "url": "https://www.news-medical.net/news/20220418/Impact-of-COVID-19-pandemic-on-vaccination-campaigns-for-diseases-preventable-by-vaccine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_711049_16503158644384971.jpg", "publishedAt": "2022-04-19T00:48:00Z", "content": "In a recent study published in the International Journal of Infectious Diseases, researchers assess the influence of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) pandemic on vacci… [+5249 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "Lifelong excess weight can nearly double risk of womb cancer – study - The Guardian", "description": "Bristol study finds that for every five extra BMI units a woman’s risk of endometrial cancer increases by 88%", "url": "https://amp.theguardian.com/society/2022/apr/19/lifelong-excess-weight-can-nearly-double-risk-of-endometrial-womb-cancer-study", "urlToImage": null, "publishedAt": "2022-04-19T00:00:00Z", "content": "CancerBristol study finds that for every five extra BMI units a womans risk of endometrial cancer increases by 88%\r\nTue 19 Apr 2022 01.00 BST\r\nLifelong excess weight may almost double a womans risk o… [+3260 chars]"}, {"source": {"id": null, "name": "Insightnews.com.au"}, "author": "rhiannon bowman", "title": "Study confirms vision problems linked to erectile dysfunction medications - Insight", "description": "The risk of developing one of three serious eye conditions increases by 85% for regular users of common erectile dysfunction (ED) medications such as Viagra, Cialis, Levitra and Stendra, new research has found.", "url": "https://www.insightnews.com.au/study-confirms-vision-problems-linked-to-erectile-dysfunction-medications/", "urlToImage": "https://www.insightnews.com.au/wp-content/uploads/2022/04/shutterstock_1507172414-scaled-e1649906326485.jpg", "publishedAt": "2022-04-18T23:23:24Z", "content": "The risk of developing one of three serious eye conditions increases by 85% for regular users of common erectile dysfunction (ED) medications such as Viagra, Cialis, Levitra and Stendra, new research… [+2552 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Impact of previous exposure to SARS-CoV-2 and of S-Trimer (SCB-2019) COVID-19 vaccination on the risk of reinfection: a randomised, double-blinded, placebo-controlled, phase 2 and 3 trial - The Lancet", "description": "Previous exposure to SARS-CoV-2 decreased the risk and severity of subsequent COVID-19\ninfection, even against newly emerging variants. Protection is further enhanced by\none or two doses of SCB-2019.", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00144-X/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/d7e0ce92-4bc1-4838-9b48-062a32b6881e/gr2.jpg", "publishedAt": "2022-04-18T22:38:44Z", "content": "TheLancet.com will be undergoing maintenance on Tuesday, April 19, 2022, from 3:00 am to 8:00 pm BST (10:00 pm April 18 to 4:00 pm April 19 EST). During this window we have temporarily removed the Re… [+295 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "The burden of aortic aneurysm in China from 1990 to 2019: findings from the Global Burden of Disease Study 2019 - BMC Public Health - BMC Public Health", "description": "Background Aortic aneurysm (AA) is a global public health concern. However, little is known about the disease burden of AA in China. Methods Following the general analytic strategy used in the Global Burden of Disease Study (GBD) 2019, we analyzed the mortali…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-13221-w", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-04-18T21:38:52Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Small HDL “Good Cholesterol” Particles May Help Protect Against Alzheimer's Disease - SciTechDaily", "description": "First-ever study to measure high-density lipoprotein particle numbers in spinal fluid led by Keck School of Medicine of USC. Keck School of Medicine of USC researchers found that a higher number of small HDL particles in spinal fluid samples was associated wi…", "url": "https://scitechdaily.com/small-hdl-good-cholesterol-particles-may-help-protect-against-alzheimers-disease/", "urlToImage": "https://scitechdaily.com/images/Holographic-Brain-Scan.jpg", "publishedAt": "2022-04-18T21:17:57Z", "content": "Researchers from USCs Keck School of Medicine discovered that a higher number of tiny HDL particles in spinal fluid samples was linked to two critical markers that the particles may protect against A… [+8385 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Why doctors recommend that your waist measurement be less than half your height - Play Crazy Game", "description": "Philippa Roxby - BBC Health Reporter posted on 4/18/2022 1:01 PM / updated on 4/18/2022 1:02 PM Getty Images - An adult's waist should be less than half its height to reduce health risks, recommendation reads - \r People should be encouraged to measure their w…", "url": "https://playcrazygame.com/2022/04/19/why-doctors-recommend-that-your-waist-measurement-be-less-than-half-your-height/", "urlToImage": "https://midias.correiobraziliense.com.br/_midias/jpg/2022/04/18/675x450/1__124081954_gettyimages_1134340537-7789627.jpg", "publishedAt": "2022-04-18T21:17:06Z", "content": "Philippa Roxby – BBC Health Reporter\r\nposted on 4/18/2022 1:01 PM / updated on 4/18/2022 1:02 PM\r\nGetty Images – An adult’s waist should be less than half its height to reduce health risks, recommend… [+3924 chars]"}, {"source": {"id": null, "name": "Southfloridahospitalnews.com"}, "author": null, "title": "Personalized Feedback Can Reduce Opioid Prescribing Rates, New Study Shows - Florida Hospital News and Healthcare Report - South Florida Hospital News", "description": "April 18, 2022 – WASHINGTON, D.C.—While drug overdose deaths reached an all-time high in 2021, opioid prescribing by physicians and clinicians dropped significantly in emergency departments that prioritized personalized feedback between peers, according to a …", "url": "https://southfloridahospitalnews.com/personalized-feedback-can-reduce-opioid-prescribing-rates-new-study-shows/", "urlToImage": null, "publishedAt": "2022-04-18T21:13:10Z", "content": "April 18, 2022 – WASHINGTON, D.C.While drug overdose deaths reached an all-time high in 2021, opioid prescribing by physicians and clinicians dropped significantly in emergency departments that prior… [+3096 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Psych disorders linked to COVID-19 breakthrough infection in vaccinated VA patients - Healio", "description": "Diagnoses of psychiatric disorders were associated with increased incidence of COVID-19 breakthrough infection in VA patients, with the strongest associations found in older patients, according to a study published in JAMA Network Open.  &ldquo;Prior to the w…", "url": "https://www.healio.com/news/psychiatry/20220418/psych-disorders-linked-to-covid19-breakthrough-infection-in-vaccinated-va-patients", "urlToImage": "https://www.healio.com/~/media/covid-vaccine-draw.jpg", "publishedAt": "2022-04-18T21:02:26Z", "content": "Diagnoses of psychiatric disorders were associated with increased incidence of COVID-19 breakthrough infection in VA patients, with the strongest associations found in older patients, according to a … [+2499 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study investigates the production of a virosome-based COVID-19 vaccine candidate - News-Medical.Net", "description": "In a new study, different signal peptides, baculovirus transfer vectors, cell lines, infection techniques, and formulation buffers were investigated with the purpose of building a scalable bioprocess to generate high-quality S protein for incorporation in a v…", "url": "https://www.news-medical.net/news/20220418/Study-investigates-the-production-of-a-virosome-based-COVID-19-vaccine-candidate.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_711034_16503054953157445.jpg", "publishedAt": "2022-04-18T19:58:00Z", "content": "Severe acute respiratory syndrome coronavirus 2 (SARS-Cov-2) is the causative virus of coronavirus disease 2019 (COVID-19), which was declared a pandemic by the World Health Organization (WHO) in Mar… [+5331 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research shines light on the effects of genomic variation on gut microbiome function - News-Medical.Net", "description": "New research from Cornell scientists is exploring how human genetics impacts functions of the gut microbiome, and is expanding awareness of the role human genetics plays in shaping the microbiome.", "url": "https://www.news-medical.net/news/20220418/Research-shines-light-on-the-effects-of-genomic-variation-on-gut-microbiome-function.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Genetics-620x480.jpg", "publishedAt": "2022-04-18T18:19:00Z", "content": "New research from Cornell scientists is exploring how human genetics impacts functions of the gut microbiome, and is expanding awareness of the role human genetics plays in shaping the microbiome.\r\nT… [+4274 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Beata Mostafavi-Michigan", "title": "Poll: Half of parents give picky eaters dietary supplements - Futurity: Research News", "description": "Picky eaters often turn up their noses at healthy food and some parents compensate by giving them supplements, but don't ask a pediatrician first.", "url": "https://www.futurity.org/dietary-supplements-healthy-foods-kids-2726882/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/04/parenting-food-picky-eaters-healthy-diet-nutritional-supplement-1600.jpg", "publishedAt": "2022-04-18T18:14:00Z", "content": "Over half of parents agree in a new poll that it’s difficult to get their child to eat healthy foods and half say their child regularly takes a supplement.\r\nKids can be stubborn when it comes to eati… [+4144 chars]"}, {"source": {"id": null, "name": "Clinicaladvisor.com"}, "author": null, "title": "How Can Mental Health Affect HIV Prevention Outcomes? - Clinical Advisor", "description": "Mental health struggles may play a larger role in approaching HIV prevention than patients realize. How do symptoms of depression and anxiety affect HIV risk behaviors, and how can health care professionals educate patients and increase prevention?", "url": "https://www.clinicaladvisor.com/home/topics/hiv-aids-information-center/how-can-mental-health-affect-hiv-prevention-outcomes/", "urlToImage": "https://www.clinicaladvisor.com/wp-content/uploads/sites/11/2022/04/GettyImages-507836310.jpg", "publishedAt": "2022-04-18T18:05:00Z", "content": "Health care professionals determining the best course of action to help prevent human immunodeficiency virus (HIV) rates from rising may be seeking information on the factors that can affect negative… [+3232 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "Six Ways Fluvoxamine May Act To Prevent Severe Covid-19 - Forbes", "description": "Fluvoxamine has the potential to reduce the chance of progression to severe Covid-19. Here we describe the mechanisms that enable this ability.", "url": "https://www.forbes.com/sites/williamhaseltine/2022/04/18/six-ways-fluvoxamine-may-act-to-prevent-severe-covid-19/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/625d8322c30d6211e3a2adc7/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-04-18T17:27:10Z", "content": "Portrait of young athlete jumping over a hurdle during training on race track.\r\ngetty\r\nA recent meta-analysis of a small number of fluvoxamine efficacy trials enrolling just over 2,000 patients found… [+6520 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers uncover a key regulator of pregnancy-associated heart growth - News-Medical.Net", "description": "Northwestern Medicine scientists have uncovered a key regulator of pregnancy-associated heart growth, according to a recent study published in the Journal of Clinical Investigation.", "url": "https://www.news-medical.net/news/20220418/Researchers-uncover-a-key-regulator-of-pregnancy-associated-heart-growth.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2022-04-18T17:22:00Z", "content": "Northwestern Medicine scientists have uncovered a key regulator of pregnancy-associated heart growth, according to a recent study published in the Journal of Clinical Investigation.\r\nAn mRNA-regulati… [+2919 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Cancer: Symptoms include bodily sensations, such as tiredness and breathlessness - Verve Times", "description": "Survival outcomes for cancer are poorer than other diseases because symptoms often go unreported in the beginning. This buys cancer precious time to advance, reducing the effectiveness of treatments. This is particularly apparent with lung cancer, wh", "url": "https://vervetimes.com/cancer-symptoms-include-bodily-sensations-such-as-tiredness-and-breathlessness/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1597606.jpg", "publishedAt": "2022-04-18T16:53:27Z", "content": "Survival outcomes for cancer are poorer than other diseases because symptoms often go unreported in the beginning. This buys cancer precious time to advance, reducing the effectiveness of treatments.… [+2769 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Impact of method for assessing occupational pesticide exposure examined - Medical Xpress", "description": "The method for assessing occupational pesticide exposure does not appear to influence risk estimates for prostate cancer, non-Hodgkin lymphoma, or Parkinson disease, according to a study published online April 13 in Occupational & Environmental Medicine.", "url": "https://medicalxpress.com/news/2022-04-impact-method-occupational-pesticide-exposure.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/impact-of-method-for-a.jpg", "publishedAt": "2022-04-18T16:50:01Z", "content": "The method for assessing occupational pesticide exposure does not appear to influence risk estimates for prostate cancer, non-Hodgkin lymphoma, or Parkinson disease, according to a study published on… [+2044 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "Stem cell cure for lower back pain is all in the 'hiPS' - Study Finds", "description": "The new biomaterial can help regenerate tissue in people dealing with chronic lower back pain and spinal issues.", "url": "https://www.studyfinds.org/stem-cell-cure-lower-back-pain/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2020/01/AdobeStock_260304017-1024x683.jpeg", "publishedAt": "2022-04-18T16:33:09Z", "content": "OSAKA, Japan — A new biomaterial can help regenerate tissue in people dealing with chronic lower back pain and spinal issues. Researchers in Japan say the secret to this breakthrough therapy is all i… [+3138 chars]"}, {"source": {"id": null, "name": "Plainsmenpost.com"}, "author": "George Holan", "title": "Devastated mum-to-be finds out she has rare deadly illness six months into pregnancy - The Plainsmen Post", "description": "", "url": "https://plainsmenpost.com/devastated-mum-to-be-finds-out-she-has-rare-deadly-illness-six-months-into-pregnancy/", "urlToImage": "https://plainsmenpost.com/wp-content/uploads/2022/04/Devastated-mum-to-be-finds-out-she-has-rare-deadly-illness-six-300x300.jpg", "publishedAt": "2022-04-18T16:00:25Z", "content": "A 33-year-old expectant mum was left devastated when she found out she had an extremely rare form of cancer six months into her first pregnancy. \r\nAimee Hill, from Port Talbort, Wales, had to decide … [+5492 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Comprehensive care program helped reduce some racial disparities after hip and knee replacement - Medical Xpress", "description": "A \"bundled care\" Medicare program to improve care for patients undergoing hip or knee replacement surgery has led to reductions in some outcome disparities for Black compared with White patients, suggests a study in The Journal of Bone & Joint Surgery.", "url": "https://medicalxpress.com/news/2022-04-comprehensive-racial-disparities-hip-knee.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/kneexray.jpg", "publishedAt": "2022-04-18T15:25:21Z", "content": "A \"bundled care\" Medicare program to improve care for patients undergoing hip or knee replacement surgery has led to reductions in some outcome disparities for Black compared with White patients, sug… [+4606 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Inserting screws in the pelvis for growth-friendly treatment of scoliosis can be painful and lead to infect... - Verve Times", "description": "A new Michigan Medicine study finds that some children with cerebral palsy and scoliosis do not require pelvic fixation when undergoing growing rod treatment, potentially avoiding several complications.Using data from around 20 health systems, resear", "url": "https://vervetimes.com/inserting-screws-in-the-pelvis-for-growth-friendly-treatment-of-scoliosis-can-be-painful-and-lead-to-infection-in-this-patient-population-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-18T15:14:22Z", "content": "A new Michigan Medicine study finds that some children with cerebral palsy and scoliosis do not require pelvic fixation when undergoing growing rod treatment, potentially avoiding several complicatio… [+2394 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Benjamin L. Walter, MD", "title": "Awareness Empowers Care for Patients With Parkinson Disease - Neurology Live", "description": "Parkinson disease is neither imminently fatal nor transient but is incurable, and as it affects individuals differently based on their unique identities, culture, access to health care, and social support, it is vital to empower patients.", "url": "https://www.neurologylive.com/view/awareness-empowers-care-patients-parkinson-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/2484e134e33a69bc804285485ddf963fdd6fabbe-300x300.png?fit=crop&auto=format", "publishedAt": "2022-04-18T15:05:47Z", "content": "THIS MONTHS ISSUE OFNeurologyLive® focuses on Parkinson disease (PD). James Parkinson, who first described the essential clinical phenomenology of PD in his 1817 paper An Essay on the Shaking Palsy a… [+5886 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "A year of research establishes COVID-19 vaccine safety among patients with allergies - Healio", "description": "The allergy and immunology community has achieved significant and hopeful progress in its understanding of allergic reactions to mRNA COVID-19 vaccines, according to a review published in The Journal of Allergy and Clinical Immunology. \n Although reports of a…", "url": "https://www.healio.com/news/allergy-asthma/20220418/a-year-of-research-establishes-covid19-vaccine-safety-among-patients-with-allergies", "urlToImage": "https://www.healio.com/~/media/slack-news/allergy_asthma/stock-photos/covid_vaccine.jpg", "publishedAt": "2022-04-18T15:05:01Z", "content": "The allergy and immunology community has achieved significant and hopeful progress in its understanding of allergic reactions to mRNA COVID-19 vaccines, according to a review published in The Journal… [+3651 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Annie Luis", "title": "The vulnerable people who have spent the last two years shielding - Global Circulate", "description": "Covid-19 poses a significant threat to immunocompromised and vulnerable people (Pictures: Supplied)While most of us have reunited with loved ones over the last year, some people are still living in lockdown.On March 23 2020, the UK went into wha", "url": "https://globalcirculate.com/the-vulnerable-people-who-have-spent-the-last-two-years-shielding/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/04/SEC_99402009_1650290370.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-04-18T14:30:05Z", "content": "Covid-19 poses a significant threat to immunocompromised and vulnerable people (Pictures: Supplied)\r\nWhile most of us have reunited with loved ones over the last year, some people are still living in… [+8452 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Common scoring systems comparably predict mortality in SARS-CoV-2-related CAP - Healio", "description": "Two widely used clinical scoring systems &mdash; the Pneumonia Severity Index and CURB-65 score &mdash; comparatively predicted in-hospital mortality in patients with and without SARS-CoV-2-related community-acquired pneumonia, researchers reported.&ldquo;Tri…", "url": "https://www.healio.com/news/pulmonology/20220418/common-scoring-systems-comparably-predict-mortality-in-sarscov2related-cap", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/endocrinology/h/hospitalbed.jpg", "publishedAt": "2022-04-18T14:15:38Z", "content": "Two widely used clinical scoring systems — the Pneumonia Severity Index and CURB-65 score — comparatively predicted in-hospital mortality in patients with and without SARS-CoV-2-related community-acq… [+2237 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers identify 16 distinct cell populations in a key brain region for substance use disorders - News-Medical.Net", "description": "In a work of systematic biology that advances the field, University of Alabama at Birmingham researchers have identified 16 distinct cell populations in a complex area of the midbrain called the ventral tegmental area, or VTA.", "url": "https://www.news-medical.net/news/20220418/Researchers-identify-16-distinct-cell-populations-in-a-key-brain-region-for-substance-use-disorders.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-04-18T13:23:00Z", "content": "In a work of systematic biology that advances the field, University of Alabama at Birmingham researchers have identified 16 distinct cell populations in a complex area of the midbrain called the vent… [+5101 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Two out of five adults with ADHD have excellent mental health: Study - Devdiscourse", "description": "A new study has found that two in five adults (42 per cent) with attention deficit hyperactivity disorder (ADHD) were in excellent mental health.", "url": "https://www.devdiscourse.com/article/health/2007315-two-out-of-five-adults-with-adhd-have-excellent-mental-health-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_04_2022_12_54_24_8012537.jpg?width=920&format=jpeg", "publishedAt": "2022-04-18T12:54:27Z", "content": "A new study has found that two in five adults (42 per cent) with attention deficit hyperactivity disorder (ADHD) were in excellent mental health. The findings were published in the International Jour… [+3824 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The involvement of the skeletal muscles in long COVID-19 - News-Medical.Net", "description": "Researchers reviewed the mechanisms of muscle tissue injury, aggravating conditions, and associated sequelae in long COVID‐19.", "url": "https://www.news-medical.net/news/20220418/The-involvement-of-the-skeletal-muscles-in-long-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710980_16502858638672371.jpg", "publishedAt": "2022-04-18T12:50:00Z", "content": "In a recent study published in Reviews in Medical Virology, researchers reviewed the mechanisms of muscle tissue injury, aggravating conditions, and associated sequelae in long coronavirus disease 20… [+6913 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Immune cells’ key characteristics in ovarian cancer identified by researchers - ThePrint", "description": "Washington [US], April 18 (ANI): Treatments for ovarian cancer have changed little over the past few decades, with surgery and chemotherapy being the most common therapeutic approaches. Immunotherapy, which is a type of treatment that activates a patient’s im…", "url": "https://theprint.in/science/immune-cells-key-characteristics-in-ovarian-cancer-identified-by-researchers/920981/", "urlToImage": null, "publishedAt": "2022-04-18T12:30:39Z", "content": "Washington [US], April 18 (ANI): Treatments for ovarian cancer have changed little over the past few decades, with surgery and chemotherapy being the most common therapeutic approaches.\r\nImmunotherap… [+3186 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "Eating less helps you lose weight. But it’s exercise that keeps the kilos off - The New Daily", "description": "A new study finds that the key to keeping the weight off is exercise rather than chronic restriction of dietary intake (food).", "url": "https://thenewdaily.com.au/life/wellbeing/2022/04/18/exercise-keeps-the-weight-off/", "urlToImage": "https://thenewdaily.com.au/wp-content/uploads/2022/04/1649843688-GettyImages-977289328.jpg?resize=960,600", "publishedAt": "2022-04-18T12:00:57Z", "content": "Most research has found that diet trumps exercise as a means of losing weight.\r\nThey both play a part, but eating less is the key to shrinking your waistline rather than working out or going for long… [+4322 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers reveal hidden problem of loss of appetite during pregnancy - Devdiscourse", "description": "Researchers have revealed the hidden issues and developed recommendations and principles for multidisciplinary management of anorexia nervosa in pregnancy, according to a new study by Monash University.", "url": "https://www.devdiscourse.com/article/health/2007224-researchers-reveal-hidden-problem-of-loss-of-appetite-during-pregnancy", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_04_2022_11_44_51_7969912.jpg?width=920&format=jpeg", "publishedAt": "2022-04-18T11:44:54Z", "content": "Researchers have revealed the hidden issues and developed recommendations and principles for multidisciplinary management of anorexia nervosa in pregnancy, according to a new study by Monash Universi… [+3505 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds two doses of mRNA or ChAdOx1 vaccines provide excellent protection against severe outcomes of hospitalization and death - News-Medical.Net", "description": "Researchers assessed the effectiveness of COVID-19 vaccines against related hospitalizations and death.", "url": "https://www.news-medical.net/news/20220418/Study-finds-two-doses-of-mRNA-or-ChAdOx1-vaccines-provide-excellent-protection-against-severe-outcomes-of-hospitalization-and-death.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710976_16502763000926116.jpg", "publishedAt": "2022-04-18T10:08:00Z", "content": "In a recent study posted to the medRxiv* preprint server, the researchers assessed the effectiveness of coronavirus disease 2019 (COVID-19) vaccines against related hospitalizations and death.\r\nStudy… [+5633 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Impact of COVID-19 booster vaccination campaign in Israel - News-Medical.Net", "description": "Researchers assess the implications of the COVID-19 booster vaccine on the Israeli population.", "url": "https://www.news-medical.net/news/20220418/Impact-of-COVID-19-booster-vaccination-campaign-in-Israel.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710952_16500561222232296.jpg", "publishedAt": "2022-04-18T07:32:00Z", "content": "In a recent Science Translational Medicine study, researchers assess the implications of the coronavirus disease 2019 (COVID-19) booster vaccine on the Israeli population.\r\nIn June 2021, the Israeli … [+4820 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Convalescent plasma for COVID-19: Donor demographic factors associated high neutralising antibody titres - DocWire News", "description": "Transfus Med. 2022 Apr 17. doi: 10.1111/tme.12868. Online ahead of print.ABSTRACTBACKGROUND: Convalescent plasma containing high levels of SARS-CoV-2", "url": "https://www.docwirenews.com/abstracts/convalescent-plasma-for-covid-19-donor-demographic-factors-associated-high-neutralising-antibody-titres/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-04-18T06:00:00Z", "content": "Transfus Med. 2022 Apr 17. doi: 10.1111/tme.12868. Online ahead of print.\r\nABSTRACT\r\nBACKGROUND: Convalescent plasma containing high levels of SARS-CoV-2 antibodies has been studied as a possible tre… [+1629 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "B cell responses in hospitalized SARS-CoV-2-infected children with and without Multisystem Inflammatory Syndrome - DocWire News", "description": "J Infect Dis. 2022 Apr 18:jiac119. doi: 10.1093/infdis/jiac119. Online ahead of print.ABSTRACTMultisystem inflammatory syndrome in children (MIS-C) can", "url": "https://www.docwirenews.com/abstracts/b-cell-responses-in-hospitalized-sars-cov-2-infected-children-with-and-without-multisystem-inflammatory-syndrome/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-04-18T06:00:00Z", "content": "J Infect Dis. 2022 Apr 18:jiac119. doi: 10.1093/infdis/jiac119. Online ahead of print.\r\nABSTRACT\r\nMultisystem inflammatory syndrome in children (MIS-C) can complicate infection with severe acute resp… [+1018 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Impact of Remdesivir Incorporation along the Primer Strand on SARS-CoV-2 RNA-Dependent RNA Polymerase - DocWire News", "description": "J Chem Inf Model. 2022 Apr 18. doi: 10.1021/acs.jcim.2c00201. Online ahead of print.ABSTRACTRemdesivir was the first antiviral drug that received", "url": "https://www.docwirenews.com/abstracts/impact-of-remdesivir-incorporation-along-the-primer-strand-on-sars-cov-2-rna-dependent-rna-polymerase/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-04-18T06:00:00Z", "content": "J Chem Inf Model. 2022 Apr 18. doi: 10.1021/acs.jcim.2c00201. Online ahead of print.\r\nABSTRACT\r\nRemdesivir was the first antiviral drug that received emergency use authorization from the United State… [+1451 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Different strains of tuberculosis can attack lungs, finds study - Hindustan Times", "description": "It could help break the cycle of rapid transmission of Tb, the second leading infectious killer in the world after covid-19, according to the World Health Organisation. The disease mechanisms uncovered in the study could also provide answers about why treatme…", "url": "https://www.hindustantimes.com/lifestyle/health/different-strains-of-tuberculosis-can-attack-lungs-finds-study-101650260965440.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/18/1600x900/towfiqu-barbhuiya-C-zwLtPSErc-unsplash_1648467640693_1650261014252.jpg", "publishedAt": "2022-04-18T05:52:23Z", "content": "According to a new study, two strains of bacteria causing tuberculosis have only minor genetic differences but attack the lungs in a completely different way.\r\nThe findings of the study were publishe… [+3191 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Children of mothers with clinical depression are at risk to develop depression - Hindustan Times", "description": "Children with a maternal history of depression were more likely to have reduced reward-related brain activity in the ventral striatum, but only if their mothers reported less enthusiastic and more dampening responses to their children's positive emotions, the…", "url": "https://www.hindustantimes.com/lifestyle/health/children-of-mothers-with-clinical-depression-are-at-greater-risk-of-developing-depression-study-101650254537526.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/18/1600x900/depression_and_obesity_final_3_1632740650429_1650255506932.jpg", "publishedAt": "2022-04-18T04:22:33Z", "content": "According to a new study, children of mothers with clinical depression are at three times greater risk to develop depression themselves than their low-risk peers.\r\nThe research was published in the j… [+2939 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Mark Saunokonoko", "title": "UK man solves 'horrible' skin condition that plagued his face for decade - 9News", "description": "<p>A British man has finally solved a 10-year mystery over why his face persistently erupted in large red, flaky splotches, and the answer lay in his office toilet.</p>", "url": "https://www.9news.com.au/world/uk-man-solves-mystery-skin-condition-that-plagued-him-for-10-years/06939bd0-d0bb-4df3-84bd-12a865418515", "urlToImage": "https://imageresizer.static9.net.au/xLQFFZYmEFu56ixZypqIXTvaAJI=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F19a1d77f-d587-45c4-b2a5-a67ed68e4346", "publishedAt": "2022-04-18T02:28:17Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Victoria Gill - Science correspondent, BBC News", "title": "'I felt more joy than I thought possible' - Yahoo News Australia", "description": "How it feels to treat your depression with a hallucinogenic drug.", "url": "https://news.yahoo.com/felt-more-joy-thought-possible-232949793.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Xb5nvW5PfG49kJ5UvWpp6w--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/554654ef2f122b6563e0f649488f58d6", "publishedAt": "2022-04-17T23:29:49Z", "content": "\"I had the full-blown mystical revelatory experience - the big psychedelic multi-coloured light and sound show.\"\r\nThis is how Steve recalls his first dose of a hallucinogenic drug, psilocybin, the ps… [+5202 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Headache disorders afflict 50 percent of people worldwide - The Washington Post", "description": "Headache disorders range from annoying to disabling. They include migraines, tension headaches, cluster headaches and headaches related to things like exercise or sinusitis.", "url": "https://www.washingtonpost.com/health/2022/04/17/headache-disorders-migraines/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JCETBNV444I6ZKJNY5R55AMMEE.jpg&w=1440", "publishedAt": "2022-04-17T14:04:19Z", "content": "Placeholder while article actions load\r\nMigraines, sinus headaches, tension pain. Sound familiar? Almost everyone has experienced a headache at some point in their life.\r\nNew research quantifies how … [+1927 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Tumours change their metabolism to spread more effectively: Study - The Statesman", "description": "The new results show that metastatic tumours suppress the activity of a key enzyme in propionate metabolism, the process by which cells digest certain fatty acids and protein components.", "url": "https://www.thestatesman.com/lifestyle/health/tumours-change-metabolism-1503061445.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/07/QT-brain-metastases.jpg", "publishedAt": "2022-04-17T10:40:23Z", "content": "A new study has found that cancer cells can disrupt a metabolic pathway that breaks down fats and proteins to boost the levels of a byproduct called methylmalonic acid, thereby driving metastasis.\r\nT… [+3177 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Long reproductive span, older age at menopause associated with lower dementia risk: Study - Times of India", "description": "Pregnancy, long reproductive span and older age at menopause are associated with a lower risk of dementia in women, according to a study. The results of the study were published in the journal, 'PLOS Medicine'. It suggested that reproductive and hormonal fact…", "url": "https://timesofindia.indiatimes.com/videos/news/long-reproductive-span-older-age-at-menopause-associated-with-lower-dementia-risk-study/videoshow/90892339.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90892339,imgsize-66914.cms", "publishedAt": "2022-04-17T08:34:58Z", "content": "Apr 17, 2022, 02:04PM ISTSource: ANIPregnancy, long reproductive span and older age at menopause are associated with a lower risk of dementia in women, according to a study. The results of the study … [+720 chars]"}, {"source": {"id": null, "name": "Triple M"}, "author": "Triple M Newsroom", "title": "Aussie’s Urged To Protect Against Mozzie Bites Over Easter Holidays - Triple M", "description": "“Fight the Bite”", "url": "https://www.triplem.com.au/story/aussie-s-urged-to-protect-against-mozzie-bites-over-easter-holidays-197848", "urlToImage": "https://cdn-img.scalabs.com.au/ie4P21EJzLXCFsKLituY7uc1RURxe0G8W4zEEEroMs0/aHR0cHM6Ly9zdy10/cmlwbGVtLXByZC5z/Y2FkaWdpdGFsLmlv/L21lZGlhLzE4OTE2/L21vc3F1aXRvX29w/dGltaXplZC5wbmc_/cHJlc2V0PW1ycHJl/dmFydGljbGU", "publishedAt": "2022-04-14T08:07:49Z", "content": "As Australians embark on family getaways over the Easter long-weekend, health authorities urge holidaymakers to protect themselves against mosquito bites.\r\nThere are around 300 different species in A… [+2384 chars]"}]}