{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": null, "name": "SBS News"}, "author": null, "title": "Victoria records no new coronavirus infections, as restrictions ease across the state - SBS News", "description": "The state recorded zero new COVID-19 infections in the last 24 hours, after two cases were reported on Friday.", "url": "https://www.sbs.com.au/news/victoria-records-no-new-coronavirus-infections-as-restrictions-ease-across-the-state", "urlToImage": "https://sl.sbs.com.au/public/image/file/95e5db83-b60a-4fb7-b14d-8a865b4f7aaf/crop/16x9", "publishedAt": "2021-02-26T23:02:41Z", "content": "Victoria has recorded zero new coronavirus cases in the past 24 hours, as mask wearing rules and gathering limits ease across the state. \r\nSaturday's results come after two new locally-acquired cases… [+1801 chars]"}, {"source": {"id": "four-four-two", "name": "FourFourTwo"}, "author": "PA Staff", "title": "West Brom boss Sam Allardyce feeling ‘much safer’ after receiving Covid vaccine - FourFourTwo", "description": "", "url": "https://www.fourfourtwo.com/news/west-brom-boss-sam-allardyce-feeling-much-safer-after-receiving-covid-vaccine-1614378650000", "urlToImage": "https://cdn.mos.cms.futurecdn.net/guoq9LoRB6x88TwTXmhVDo-1200-80.jpg", "publishedAt": "2021-02-26T22:30:50Z", "content": "West Brom boss Sam Allardyce has expressed his relief at receiving the Covid-19 vaccine after admitting he was terrified of contracting the virus.\r\nThe 66-year-old former England manager was given hi… [+3032 chars]"}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": "Stephanie Nebehay", "title": "H5N8 bird flu human spread risk low: WHO - Nambucca Guardian News", "description": "The risk of human-to-human spread of the H5N8 strain of bird flu appears low after it was identified for the first time worldwide in farm workers in Russia, t...", "url": "https://www.nambuccaguardian.com.au/story/7145346/h5n8-bird-flu-human-spread-risk-low-who/", "urlToImage": "https://www.nambuccaguardian.com.au/images/transform/v1/crop/frm/silverstone-feed-data/99734852-5a36-41c7-959f-ffd209611c24.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-26T20:02:27Z", "content": "The risk of human-to-human spread of the H5N8 strain of bird flu appears low after it was identified for the first time worldwide in farm workers in Russia, the World Health Organisation says.\r\nA sep… [+1564 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Lucy Quaggin", "title": "What is endometriosis? Everything you need to know about the debilitating illness affecting female reproductive organs - 7NEWS.com.au", "description": "7NEWS.com.au has launched an investigation into endometriosis and the different ways it wreaks havoc on women’s lives.", "url": "https://7news.com.au/lifestyle/health-wellbeing/what-is-endometriosis-everything-you-need-to-know-about-the-debilitating-illness-affecting-female-reproductive-organs-c-2184558", "urlToImage": "https://images.7news.com.au/publication/C-2184558/a4fa79e9212731c6db3f146fc41db2c5287334fe-16x9-x0y151w5616h3159.jpg?imwidth=1024", "publishedAt": "2021-02-26T19:55:03Z", "content": "7NEWS.com.au has launched an investigation into endometriosis and how it impacts different peoples lives.\r\nA set of brave women have spoken out about their experiences, including extreme bloating, pa… [+2446 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Christopher Knaus", "title": "'Anxiety and uncertainty': Australian GPs in the dark over their part in vaccine rollout - The Guardian", "description": "Some doctors are worried about shortages of key supplies, while others say they may have to deliver the vaccine at a loss", "url": "https://amp.theguardian.com/australia-news/2021/feb/27/anxiety-and-uncertainty-australian-gps-in-the-dark-over-their-part-in-vaccine-rollout", "urlToImage": "https://i.guim.co.uk/img/media/ffb444148e2aac44e039a1d93155356c9d675f01/0_397_6048_3627/master/6048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=efad102910859e771c3ea4961fd6042d", "publishedAt": "2021-02-26T19:02:00Z", "content": "General practitioners have been left in a state of uncertainty and anxiety ahead of the next stage of the Covid-19 vaccine rollout, with some fearing shortages of needles and syringes, and others say… [+6176 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Melissa Davey", "title": "The great unknown: do Covid vaccines stop you spreading the virus? - The Guardian", "description": "We know vaccination is very effective in preventing serious illness, but whether it stops coronavirus transmission is another story", "url": "https://amp.theguardian.com/australia-news/2021/feb/27/the-great-unknown-do-covid-vaccines-stop-you-spreading-the-virus", "urlToImage": null, "publishedAt": "2021-02-26T19:00:05Z", "content": "Australia newsWe know vaccination is very effective in preventing serious illness, but whether it stops coronavirus transmission is another story\r\nAs Australia joins the worldwide Covid-19 vaccine ro… [+6789 chars]"}, {"source": {"id": null, "name": "Science Magazine"}, "author": null, "title": "Tumor-specific cytolytic CD4 T cells mediate immunity against human cancer - Science Advances", "description": "CD4 T cells have been implicated in cancer immunity for their helper functions. Moreover, their direct cytotoxic potential has been shown in some patients with cancer. Here, by mining single-cell RNA-seq datasets, we identified CD4 T cell clusters displaying …", "url": "https://advances.sciencemag.org/content/7/9/eabe3348.full", "urlToImage": "https://advances.sciencemag.org/content/7/9/eabe3348/F1.large.jpg", "publishedAt": "2021-02-26T18:59:23Z", "content": "INTRODUCTION\r\nAntigen-driven activation of naïve CD4 T cell precursors leads to their expansion and differentiation into a wide spectrum of functionally defined subsets (1). The diverse functional po… [+13871 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Biomarkers in the blood can predict severe outcomes in COVID-19 patients - News-Medical.net", "description": "When patients with COVID-19 arrive in emergency rooms, there are relatively few ways for doctors to predict which ones are more likely to become critically ill and require intensive care and which ones are more likely to enjoy a quick recovery.", "url": "https://www.news-medical.net/news/20210226/Biomarkers-in-the-blood-can-predict-severe-outcomes-in-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/White_blood_cells_releasing_antibodies_%2c_Lymphocytes_fighting_infectious_disease_-_nobeastsofierce_A1_2a59a66f1dd24c7794bd248884987689-620x480.jpg", "publishedAt": "2021-02-26T18:25:00Z", "content": "When patients with COVID-19 arrive in emergency rooms, there are relatively few ways for doctors to predict which ones are more likely to become critically ill and require intensive care and which on… [+5155 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Statin use associated with reduction in mortality of patients with severe COVID-19 - News-Medical.Net", "description": "People who took statins to lower cholesterol were approximately 50% less likely to die if hospitalized for COVID-19, a study by physicians at Columbia University Vagelos College of Physicians and Surgeons and NewYork-Presbyterian has found.", "url": "https://www.news-medical.net/news/20210226/Statin-use-associated-with-reduction-in-mortality-of-patients-with-severe-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Statin-620x480.jpg", "publishedAt": "2021-02-26T18:12:00Z", "content": "People who took statins to lower cholesterol were approximately 50% less likely to die if hospitalized for COVID-19, a study by physicians at Columbia University Vagelos College of Physicians and Sur… [+4352 chars]"}, {"source": {"id": null, "name": "Bustle"}, "author": "Jay Polish", "title": "New COVID-19 Variants Don't Have Different Symptoms From The Original Strain - Bustle", "description": "Doctors explain how the new COVID-19 variants are different from the original strain.", "url": "https://www.bustle.com/wellness/new-covid-19-variants-symptoms-differences-doctors", "urlToImage": "https://imgix.bustle.com/uploads/getty/2021/2/26/126ff22f-644e-4fc6-a357-0438f1f19d67-getty-1302981487.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2021-02-26T18:00:06Z", "content": "With rates of new COVID variants on the rise, people across the country are double-masking and re-upping their social distancing standards to protect against potentially more contagious variants. But… [+3306 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Early PDA closure may reduce adverse outcomes in premature babies - News-Medical.Net", "description": "Extremely low birth weight (ELBW) infants with moderate to large patent ductus arteriosus (PDA) may benefit from transcatheter PDA closure (TCPC) in the first four weeks of life, according to research published by Le Bonheur Cardiologist Ranjit Philip, MD, an…", "url": "https://www.news-medical.net/news/20210226/Early-PDA-closure-may-reduce-adverse-outcomes-in-premature-babies.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Respiratory-620x480.jpg", "publishedAt": "2021-02-26T17:46:00Z", "content": "Extremely low birth weight (ELBW) infants with moderate to large patent ductus arteriosus (PDA) may benefit from transcatheter PDA closure (TCPC) in the first four weeks of life, according to researc… [+4279 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study finds novel way to diagnose Alzheimer's disease before symptoms occur - News-Medical.Net", "description": "Early diagnosis of Alzheimer's disease has been shown to reduce cost and improve patient outcomes, but current diagnostic approaches can be invasive and costly.", "url": "https://www.news-medical.net/news/20210226/Study-finds-novel-way-to-diagnose-Alzheimers-disease-before-symptoms-occur.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/2/Alzheimers_amyloid_plaque_-_Juan_Gaertner_9638f1223d534b518a192c8478871d65-620x480.jpg", "publishedAt": "2021-02-26T17:41:00Z", "content": "Early diagnosis of Alzheimer's disease has been shown to reduce cost and improve patient outcomes, but current diagnostic approaches can be invasive and costly. A recent study, published in the Journ… [+3511 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": null, "title": "Islamic State Exploiting Security Gaps to Step Up Violence, US Partners Warn - Voice of America", "description": "The Islamic State terror group appears to be exploiting security gaps across Syria and Iraq to reposition its forces and help fuel an increase in violence that is reenergizing fighters and supporters.\n\nOfficials with U.S.-backed forces in northeastern Syria t…", "url": "https://www.voanews.com/middle-east/islamic-state-exploiting-security-gaps-step-violence-us-partners-warn", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/2021-02/AP17072457362653.jpg", "publishedAt": "2021-02-26T17:15:00Z", "content": "WASHINGTON - The Islamic State terror group appears to be exploiting security gaps across Syria and Iraq to reposition its forces and help fuel an increase in violence that is reenergizing fighters a… [+4692 chars]"}, {"source": {"id": null, "name": "The Christian Science Monitor"}, "author": "Laurie Kellman", "title": "Israel's 'green passport' raises concerns about discrimination - The Christian Science Monitor", "description": "Israel has declared that a “green passport” showing proof of vaccination will give access to travel, shows, and other social gatherings. But countries around the world see ethical and logistical issues with the idea.", "url": "https://www.csmonitor.com/World/2021/0226/Israel-s-green-passport-raises-concerns-about-discrimination", "urlToImage": "https://images.csmonitor.com/csm/2021/02/1116542_1_0226-Green-Passports_standard.jpg?alias=standard_900x600", "publishedAt": "2021-02-26T17:14:32Z", "content": "Violet light bathed the club stage as 300 people, masked and socially distanced, erupted in gentle applause. For the first time since the pandemic began, Israeli musician Aviv Geffen stepped to his e… [+6576 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Development of an electroceutical to drastically reduce high-risk, preterm labor - Medical Xpress", "description": "Preterm labor comprises 12.7% of all pregnancies. Although the overall rate of pregnancy is decreasing, the occurrence of premature birth due to preterm labor in South Korea has been increasing over the past 7 years. Not only is preterm birth accountable for …", "url": "https://medicalxpress.com/news/2021-02-electroceutical-drastically-high-risk-preterm-labor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/3-developmento.jpg", "publishedAt": "2021-02-26T17:13:05Z", "content": "Preterm labor comprises 12.7% of all pregnancies. Although the overall rate of pregnancy is decreasing, the occurrence of premature birth due to preterm labor in South Korea has been increasing over … [+3906 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Structure of SARS-CoV-2 envelope protein-epithelial cell junction protein complex explains virulence - News-Medical.Net", "description": "A new study by researchers at Brookhaven National Laboratory and Stony Brook University in the U.S. describes the key interaction between the viral envelope (E) protein and the human cell junction protein, PALS1. The latter is necessary to establish and maint…", "url": "https://www.news-medical.net/news/20210226/Structure-of-SARS-CoV-2-envelope-protein-epithelial-cell-junction-protein-complex-explains-virulence.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1675170403.jpg", "publishedAt": "2021-02-26T16:44:00Z", "content": "With the increasing exploration of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) – the causative pathogen of coronavirus disease 2019 (COVID-19) pandemic – it has become clear that vir… [+5835 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Neanderthal-derived protein may reduce the severity of COVID-19 - Medical Xpress", "description": "Researchers at the Lady Davis Institute (LDI) at the Jewish General Hospital have discovered that increased levels of the protein OAS1 are associated with reduced mortality and less severe disease requiring ventilation among patients with COVID-19. Using drug…", "url": "https://medicalxpress.com/news/2021-02-neanderthal-derived-protein-severity-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/2-covid.jpg", "publishedAt": "2021-02-26T16:21:01Z", "content": "Researchers at the Lady Davis Institute (LDI) at the Jewish General Hospital have discovered that increased levels of the protein OAS1 are associated with reduced mortality and less severe disease re… [+4427 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Erik Robinson", "title": "Study advances field of precision medicine - Medical Xpress", "description": "Researchers at Oregon Health & Science University have demonstrated a new method of quickly mapping the genome of single cells, while also clarifying the spatial position of the cells within the body.", "url": "https://medicalxpress.com/news/2021-02-advances-field-precision-medicine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-genetic.jpg", "publishedAt": "2021-02-26T16:00:56Z", "content": "Researchers at Oregon Health &amp; Science University have demonstrated a new method of quickly mapping the genome of single cells, while also clarifying the spatial position of the cells within the … [+2266 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Using artificial intelligence to hunt for breast cancer - EurekAlert", "description": "Endocrine disruptors (EDs) are hormone-like substances that can have undesirable effects on health. For example, chemicals can increase the risk of breast cancer if they act in a manner similar to the female sex hormone oestrogen. Animal experiments are still…", "url": "https://www.eurekalert.org/pub_releases/2021-02/bfif-uai022621.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-02-26T14:30:00Z", "content": "The centre is part of the German Federal Institute for Risk Assessment (BfR). With the help of microscopy and artificial intelligence, the \"E-Morph\" test reliably identifies substances that can have … [+2794 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Denis Campbell", "title": "Life-extending drug for incurable breast cancer approved for NHS use - The Guardian", "description": "About 3,300 women a year may benefit from decision to approve ribociclib", "url": "https://amp.theguardian.com/society/2021/feb/26/life-extending-drug-ribociclib-incurable-breast-cancer-approved-for-nhs", "urlToImage": null, "publishedAt": "2021-02-26T13:57:00Z", "content": "Breast cancerAbout 3,300 women a year may benefit from decision to approve ribociclib\r\nFri 26 Feb 2021 08.57 EST\r\nWomen with incurable advanced breast cancer will be able to get a drug from the NHS t… [+2999 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "UK to prioritize next stage of COVID-19 vaccines by age, not job By Reuters - Investing.com", "description": "UK to prioritize next stage of COVID-19 vaccines by age, not job", "url": "https://www.investing.com/news/coronavirus/uk-to-prioritize-next-stage-of-covid19-vaccines-by-age-not-job-2431513", "urlToImage": "https://i-invdn-com.akamaized.net/news/news_headline_rolled_69x52._800x533_L_1419494221.jpg", "publishedAt": "2021-02-26T13:10:00Z", "content": "By Alistair Smout\r\nLONDON (Reuters) - Police and teachers will not jump to the head of the queue in the second phase of Britain's COVID-19 vaccination rollout, with people instead prioritised by age,… [+1746 chars]"}, {"source": {"id": null, "name": "Ajp.com.au"}, "author": "Facebook", "title": "The week in review - Australian Journal of Pharmacy", "description": "Pharmacists were at the centre of this week’s biggest news: the first COVID-19 vaccinations in Australia There was exciting news in the COVID-19 crisis this week, with the beginning of ...", "url": "https://ajp.com.au/covid-19/the-week-in-review-204/", "urlToImage": "https://ajp.com.au/wp-content/uploads/2021/02/Erica_Tong_pharmacy-1024x683.jpg", "publishedAt": "2021-02-26T13:03:28Z", "content": "There was exciting news in the COVID-19 crisis this week, with the beginning of the Australian vaccination program rollout. Prime Minister Scott Morrison was among the first to be vaccinated, as was … [+2129 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 and Pregnancy - News-Medical.net", "description": "Overall, pregnancy is safe even with more moderate/severe COVID-19 with very little danger to the baby or mother.", "url": "https://www.news-medical.net/health/COVID-19-and-Pregnancy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/2/shutterstock_1752875924.jpg", "publishedAt": "2021-02-26T11:27:00Z", "content": "COVID-19 is a respiratory disease that in most cases is mild/moderate in severity. Pregnant women who get COVID-19 are typically at no further increased risk compared to non-pregnant women; however, … [+6251 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "EU leaders agree to introduce COVID-19 vaccine passports | DW News - DW News", "description": "The European Union has agreed to develop a COVID-19 vaccine passport that could ease border crossings, and allow people more freedom to travel again. EU lead...", "url": "https://www.youtube.com/watch?v=X825o99JHaM", "urlToImage": "https://i.ytimg.com/vi/X825o99JHaM/maxresdefault.jpg", "publishedAt": "2021-02-26T11:05:15Z", "content": null}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "Pip Christmass", "title": "Case 903: Hotel security guard speaks out after COVID infection sparks five-day Perth lockdown - 7NEWS.com.au", "description": "The hotel security guard said he now just wanted to get on with his life after his infection with the UK COVID strain sparked a sudden lockdown.", "url": "https://7news.com.au/lifestyle/health-wellbeing/case-903-hotel-security-guard-speaks-out-after-covid-infection-sparks-five-day-perth-lockdown-c-2247299", "urlToImage": "https://images.7news.com.au/publication/C-2247299/24cff8fe8cda7203b1202b9c170a90d5b23da7ec-16x9-x0y0w1920h1080.png?imwidth=1024", "publishedAt": "2021-02-26T09:39:31Z", "content": "So-called Case 903 - the security guard who tested positive to the mutant UK strain of coronavirus, sending Perth into a five-day lockdown - has spoken out for the first time.\r\nThe man, who has not b… [+3778 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "Coronavirus variant spreads through New York - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-26T09:35:00Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Laurie Kellman", "title": "Vaccination 'passports' may open society, but inequity looms - Martinsville Bulletin", "description": "TEL AVIV, Israel (AP) — Violet light bathed the club stage as 300 people, masked and socially distanced, erupted in gentle applause. For the first time since the pandemic began, Israeli musician...", "url": "https://apnews.com/7a8ce11ce37c309d97969ab71df26e62", "urlToImage": "https://storage.googleapis.com/afs-prod/media/a65c3218d44f486caf5ce475b4912b71/3000.jpeg", "publishedAt": "2021-02-26T09:01:19Z", "content": "TEL AVIV, Israel (AP) Violet light bathed the club stage as 300 people, masked and socially distanced, erupted in gentle applause. For the first time since the pandemic began, Israeli musician Aviv G… [+6539 chars]"}, {"source": {"id": null, "name": "Daily Nation"}, "author": null, "title": "Here are the first people who will get Covid-19 jabs in Kenya next week - Nairobi News", "description": "News,Gossip,Sports and Entertainment from Nairobi.", "url": "https://nairobinews.nation.co.ke/editors-picks/here-are-the-first-people-who-will-get-covid-19-jabs-in-kenya-next-week", "urlToImage": "https://nairobinews.nation.co.ke/wp-content/uploads/2020/12/Margaret-Keenan.jpg", "publishedAt": "2021-02-26T08:38:05Z", "content": "The government on Thursday said that the first batch of Covid-19 vaccines will arrive in the country in the first week of March and it will be given in order of priority.\r\nTop on the list of those wh… [+2312 chars]"}, {"source": {"id": null, "name": "Courier Mail"}, "author": "Janelle Miles", "title": "Four new cases as new vaccination hub opens - Daily Examiner", "description": "Queensland now has 11 active cases of COVID-19 after four new cases were detected in hotel quarantine overnight, with all acquired overseas.", "url": "https://www.couriermail.com.au/coronavirus/four-new-cases-of-covid19-brings-states-active-cases-total-to-11/news-story/b6eeefc55dc2bd2dfd492a5a40df28af", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/26/v3imagesbin93d1c5640a18a484d542da2e0a552a52-bw34w08xtysdiwopxv2_ct1880x930.jpg", "publishedAt": "2021-02-26T07:36:00Z", "content": "Queensland has recorded four new cases of the COVID-19 virus, all detected in hotel quarantine and acquired overseas.\r\nThe new cases take the state's total number of confirmed infections since the co… [+1585 chars]"}, {"source": {"id": null, "name": "NT News"}, "author": null, "title": "Four new cases of COVID-19 brings state’s active cases total to 11 - NT News", "description": "Subscribe to the NT News to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.ntnews.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-26T07:33:00Z", "content": null}, {"source": {"id": null, "name": "PerthNow"}, "author": "AAP", "title": "Hong Kong kicks off COVID-19 vaccinations - PerthNow", "description": "Hong Kong has kicked off its program that will eventually offer free coronavirus vaccinations to all 7.5 million residents.", "url": "https://www.perthnow.com.au/news/health/hong-kong-kicks-off-covid-19-vaccinations-ng-s-2051221", "urlToImage": "https://images.perthnow.com.au/publication/S-2051221/1614324099430_Virus_HK_16-9_20470081_2051221_202102261802168b73e0d1-c9f5-4611-ba1d-d9c9baa37cc4.jpg_sd_1280x720.jpg?imwidth=1024", "publishedAt": "2021-02-26T07:20:00Z", "content": "Hong Kong has began administering its first COVID-19 vaccines to the public, kicking off its program that will eventually offer free vaccinations to all 7.5 million residents.\r\nPeople age 60 and olde… [+1798 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New approach can help treat hypertrophic cardiomyopathy with precision medicine - News-Medical.Net", "description": "Hypertrophic cardiomyopathy (HCM) is a cardiovascular disease characterized by thickening of the left ventricle, otherwise known as the main squeezing chamber of the heart. HCM is best known for causing sudden death in athletes but can occur in persons of any…", "url": "https://www.news-medical.net/news/20210226/New-approach-can-help-treat-hypertrophic-cardiomyopathy-with-precision-medicine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2021-02-26T06:17:00Z", "content": "Hypertrophic cardiomyopathy (HCM) is a cardiovascular disease characterized by thickening of the left ventricle, otherwise known as the main squeezing chamber of the heart. HCM is best known for caus… [+3153 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers propose new mechanism to promote access to COVID-19 vaccines - News-Medical.Net", "description": "Although the value of vaccines for COVID-19 may seem obvious, government action and investment in vaccines have not been commensurate with the enormous scale of benefits they offer, argue Juan Camilo Castillo and colleagues in this Policy Forum.", "url": "https://www.news-medical.net/news/20210226/Researchers-propose-new-mechanism-to-promote-access-to-COVID-19-vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2021-02-26T06:07:00Z", "content": "Although the value of vaccines for COVID-19 may seem obvious, government action and investment in vaccines have not been commensurate with the enormous scale of benefits they offer, argue Juan Camilo… [+1981 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New test can detect viral infections in uncultured bacteria - News-Medical.Net", "description": "The pandemic has made clear the threat that some viruses pose to people. But viruses can also infect life-sustaining bacteria and a Johns Hopkins University-led team has developed a test to determine if bacteria are sick, similar to the one used to test human…", "url": "https://www.news-medical.net/news/20210226/New-test-can-detect-viral-infections-in-uncultured-bacteria.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg", "publishedAt": "2021-02-26T06:03:00Z", "content": "The pandemic has made clear the threat that some viruses pose to people. But viruses can also infect life-sustaining bacteria and a Johns Hopkins University-led team has developed a test to determine… [+2998 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Government faces another vaccine bungle - Queensland Times", "description": "More than 100 doses of the Pfizer vaccine have been thrown out due to a storage error at an aged care centre.", "url": "https://www.news.com.au/lifestyle/health/health-problems/pfizer-vaccines-thrown-out-after-storage-error-at-melbourne-aged-care-centre/news-story/6882f1744dc41457da720d52295ed981", "urlToImage": "https://media.apnarm.net.au/media/images/2021/02/26/v3imagesbinada0f3f494daa45e86ea01039bbdc95c-ctmkzq7487wozn6pxv2_ct1880x930.jpg", "publishedAt": "2021-02-26T05:59:00Z", "content": "More than 120 doses of the Pfizer COVID-19 vaccine have been discarded after a storage error at a Melbourne aged care centre.\r\nAspen Medical confirmed doses at the St Vincent's Care Services Aged Car… [+1526 chars]"}, {"source": {"id": null, "name": "Nambuccaguardian.com.au"}, "author": "Tracey Fairhurst", "title": "Vaccine rollout delay: Mid North Coast COVID jabs put on hold - Nambucca Guardian News", "description": "The vaccination rollout for residents and staff at eight age care facilities scheduled for this Saturday has been reviewed because of \"scheduling issues and logistical challenges\".", "url": "https://www.nambuccaguardian.com.au/story/7145034/vaccine-rollout-delay-mid-north-coast-covid-jabs-put-on-hold/", "urlToImage": "https://www.nambuccaguardian.com.au/images/transform/v1/crop/frm/silverstone-feed-data/aad159a9-1351-48c6-9f81-e2d6b97633e4.jpg/r0_47_800_499_w1200_h678_fmax.jpg", "publishedAt": "2021-02-26T05:25:00Z", "content": "THE vaccination rollout for residents and staff at eight age care facilities across Port Macquarie-Hastings has been delayed.\r\nThe news came after a major announcement earlier in the week by Healthy … [+2834 chars]"}, {"source": {"id": null, "name": "Macleayargus.com.au"}, "author": "Rebecca Gredley", "title": "Virus vaccine safety paramount: Morrison - The Macleay Argus", "description": "Early issues with Australia's coronavirus vaccine rollout are being ironed out as the federal government assures the public safety is paramount. Prime Ministe...", "url": "https://www.macleayargus.com.au/story/7143720/virus-vaccine-safety-paramount-morrison/", "urlToImage": "https://www.macleayargus.com.au/images/transform/v1/crop/frm/silverstone-feed-data/59d7704f-04be-4a84-86e6-8b3c3ed47d19.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-02-26T05:11:25Z", "content": ""}, {"source": {"id": null, "name": "Farmonline.com.au"}, "author": "Andrew Marshall", "title": "Australia regains avian influenza freedom status - Moree Champion", "description": "Federal Agriculture Minister praises dedication of all involved in the Victorian response to bird flu outbreak.", "url": "https://www.farmonline.com.au/story/7143909/australia-regains-bird-flu-freedom-status/?cs=4698", "urlToImage": "https://www.moreechampion.com.au/images/transform/v1/crop/frm/32XghFRykTWK8psrWNhdBMC/773df9a2-0e99-48df-8d33-f0d571b5a569.JPG/r142_163_4566_2663_w1200_h678_fmax.jpg", "publishedAt": "2021-02-26T03:00:00Z", "content": "Following a significant response effort, Australia has this week regained freedom from high pathogenicity avian influenza.\r\nMinister for Agriculture, Drought and Emergency Management, David Littlepro… [+2473 chars]"}, {"source": {"id": null, "name": "Qld.gov.au"}, "author": "The State of Queensland", "title": "Cairns Vaccination Hub up and running - Ministerial Media Statements - Media Statements", "description": "", "url": "https://statements.qld.gov.au/statements/91560", "urlToImage": "", "publishedAt": "2021-02-26T02:26:55Z", "content": "Frontline workers at Cairns and Hinterland Hospital and Health Service are among the first people in regional Queensland to be given the Pfizer COVID-19 vaccine, starting from today.\r\nMinister for He… [+2903 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Modelling the intervention effect of opioid agonist treatment on multiple mortality outcomes in people who inject drugs: a three-setting analysis - The Lancet", "description": "OAT can substantially reduce drug-related harms, particularly in settings with HIV\nepidemics in people who inject drugs. Maximising these effects requires research and\ninvestment into achieving higher coverage and provision and longer retention of OAT\nin pris…", "url": "https://www.thelancet.com/journals/lanpsy/article/PIIS2215-0366(20)30538-1/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/1cbfb870-8674-4cb5-876d-c0303d5d4dd5/gr1.jpg", "publishedAt": "2021-02-25T23:47:55Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2021 Elsevier Inc. except certain content provided by th… [+50 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Anthony Piovesan", "title": "New virus outbreak alert for Victoria - Herald Sun", "description": "<p>Health officials are warning Victorians about a rise in Ross River virus, with the number of infections this summer alone doubling the average number of cases recorded in a typical year. </p>", "url": "https://www.news.com.au/lifestyle/health/health-problems/health-officials-issue-alert-following-outbreak-of-ross-river-virus-cases-in-victoria/news-story/3c9fc5d195d886490128a8adba012c74", "urlToImage": "https://content.api.news/v3/images/bin/22f254eaea3698f221a1f311b19515de", "publishedAt": "2021-02-25T23:45:24Z", "content": "While Victoria has been grappling with the coronavirus pandemic, another infectious virus has been spreading across the state and its prompted a warning from health officials.Health officials are war… [+2916 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Fraudsters offer 400 million `ghost` Covid vaccines in EU, say officials - WION", "description": "Fraudsters have offered 400 million doses of Covid-19 vaccines worth some three billion euros to European Union countries, two officials, showing how criminals seek to capitalise on a botched inoculation campaign weighing on the blocs economic recovery.", "url": "https://www.wionews.com/world/fraudsters-offer-400-million-ghost-covid-vaccines-in-eu-say-officials-366286", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/02/05/181423-covid-vaccination.jpg", "publishedAt": "2021-02-25T16:46:47Z", "content": "Fraudsters have offered 400 million doses of Covid-19 vaccines worth some three billion euros to European Union countries, two officials, showing how criminals seek to capitalise on a botched inocula… [+1405 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Vanessa Chalmers", "title": "The 7 reasons you might be called for Covid vaccine at ANY age – even if you don’t think you have a health con - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/14160033/reasons-you-might-be-called-covid-vaccine-any-age/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2021/02/NINTCHDBPICT000637368207-3.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2021-02-25T13:43:00Z", "content": "BRITS are being called for Covid vaccines despite being younger than the urgently prioritised groups.\r\nCurrently, everyone over 60 and anyone with a health condition that increases their risk of Covi… [+8883 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "support@smarteranalyst.com (Ben Mahaney)", "title": "Moderna Plans To Increase Supply Capacity For COVID-19 Vaccine; Shares Spike 5% - Yahoo Finance", "description": "Shares of Moderna Inc were up by 4.9% in pre-market trading on Feb. 25 as the biotechnology company announced new capital investments to enable additional...", "url": "https://finance.yahoo.com/news/moderna-plans-increase-supply-capacity-133308875.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/qEzp9AJ6DLOmip.ubRo0ng--~B/aD01NDI7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/smarteranalyst_347/5caeda29ecd906a4fc09aab8239c6add", "publishedAt": "2021-02-25T13:33:08Z", "content": "(Bloomberg) -- While 2020 raged, Warren Buffett mostly held his tongue.He stayed quiet through a heated presidential election, a racial reckoning that sparked nationwide protests and an exuberance fo… [+9226 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Riley Griffin", "title": "Moderna’s Covid Deals Top $18 Billion; Medical Chief Exits - BloombergQuint", "description": "Moderna Reaches $18.4 Billion in 2021 Vaccine Pacts", "url": "https://www.bloombergquint.com/business/moderna-reaches-18-4-billion-in-covid-vaccine-2021-agreements", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-02-25T13:11:23Z", "content": "(Bloomberg) -- Moderna Inc. said it has reached $18.4 billion worth of signed agreements for its Covid-19 vaccine in 2021, and Chief Medical Officer Tal Zaks will leave the company in late September.… [+4392 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Melissa Iaria", "title": "Flesh-eating skin infection found in inner Melbourne for the first time - NEWS.com.au", "description": "Flesh-eating skin infection found in inner Melbourne for the first time", "url": "https://www.news.com.au/lifestyle/health/health-problems/flesheating-skin-infection-found-in-inner-melbourne-for-the-first-time/news-story/52b7a12e6f1ddab7cbcea1522e2d870b", "urlToImage": "https://cdn.newsapi.com.au/image/v1/6fb25871a9cc1105ef8ee3a4c9e44263?width=1280", "publishedAt": "2021-02-25T10:45:15Z", "content": "A flesh eating disease has spread to a non-coastal part of Melbourne for the first time, with several cases reported.Chief health officer Professor Brett Sutton issued an alert on Tuesday after sever… [+1835 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Mass 'real world' study confirms Pfizer Covid vaccine 94% effective - Times of India", "description": "Rest of World News: The Pfizer Covid-19 vaccine proved 94 per cent effective in a huge real world study published Wednesday that involved 1.2 million people in Israel, co", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/mass-real-world-study-confirms-pfizer-covid-vaccine-94-effective/articleshow/81202783.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81202794,width-1070,height-580,imgsize-140180,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-02-25T04:20:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Emily Doak, Sofie Wainwright", "title": "Roll out of COVID-19 vaccines delayed in regional aged care facilities - ABC News", "description": "Regional aged care residents, like 88-year-old Marie McNamee, have had their COVID-19 vaccinations postponed, despite expecting to be among the first to participate in the national vaccine rollout.", "url": "https://www.abc.net.au/news/2021-02-25/covid-vaccine-delay-in-regional-aged-care-facilities/13191510", "urlToImage": "https://www.abc.net.au/cm/rimage/13192106-16x9-large.png?v=3", "publishedAt": "2021-02-25T03:42:50Z", "content": "Residents at multiple regional aged care facilities across New South Wales have had their COVID-19 vaccinations postponed, despite expecting to be among the first to participate in the national vacci… [+4257 chars]"}, {"source": {"id": null, "name": "International Business Times"}, "author": "Danielle Ong", "title": "COVID-19 Vaccine May Cause Alarming Side Effect In Women: 'I Panicked' - International Business Times", "description": "Some women who received a coronavirus vaccine shot reported seeing signs associated with breast cancer.", "url": "https://www.ibtimes.com/covid-19-vaccine-may-cause-alarming-side-effect-women-i-panicked-3151686", "urlToImage": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2021/02/17/the-global-vaccine-rollout-and-falling-infection-rates.jpg", "publishedAt": "2021-02-25T02:56:53Z", "content": "KEY POINTS\r\n<ul><li>The coronavirus vaccine may cause swollen lymph nodes</li><li>The side effects mirror signs of breast cancer</li><li>Experts recommend taking a mammogram before getting a shot or … [+2291 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Could the COVID-19 vaccine become a pill? - The World Today - ABC News", "description": "If you're scared of needles - perhaps the idea of taking a pill to protect yourself against COVID-19 is more appealing. Or how about a nasal spray? The developers of the Oxford University/Astrazeneca vaccine have revealed they're considering making the drug i…", "url": "https://www.abc.net.au/radio/programs/worldtoday/covid-pill/13191816", "urlToImage": "https://www.abc.net.au/cm/rimage/9711384-1x1-large.jpg?v=3", "publishedAt": "2021-02-25T01:00:00Z", "content": "Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume."}, {"source": {"id": null, "name": "Gold Coast Bulletin"}, "author": null, "title": "COVID-19 Gold Coast: When mass vaccination centres will open, GPs to administer AstraZeneca - Gold Coast Bulletin", "description": "Subscribe to the Gold Coast Bulletin to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://www.goldcoastbulletin.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-02-24T22:18:42Z", "content": null}]}