{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Sick patients get cosmetic surgery to look healthier - EurekAlert", "description": "Patients dealing with serious illnesses may want cosmetic procedures to make them look healthier, reports a small new study. The patients believe cosmetic surgery may help them feel better in social situations with their friends, family or when they’re at wor…", "url": "https://www.eurekalert.org/news-releases/948835", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-06T02:00:29Z", "content": "Sick patients get cosmetic surgery to look healthier \r\nPatients with serious illnesses believe cosmetic procedures will help them feel more comfortable in social settings \r\n<ul><li>First study to ask… [+4664 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Australian researchers open new insights into genetic causes of Alzheimer's, dementia - Xinhua", "description": "", "url": "http://www.xinhuanet.com/english/asiapacific/20220406/d290cf4cd5f1436491b63be9cd1d6ca1/c.html", "urlToImage": null, "publishedAt": "2022-04-06T01:52:30Z", "content": "SYDNEY, April 6 (Xinhua) -- An international team, including Australian researchers, have identified novel areas of DNA that are linked to the risk of developing Alzheimer's disease (AD) and other fo… [+2375 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Discovery could lead to new treatments for schistosomiasis - News-Medical.Net", "description": "A team led by UTSW researchers has identified a molecule produced by male parasitic worms called schistosomes that prompts sexual maturity in females of these species.", "url": "https://www.news-medical.net/news/20220405/Discovery-could-lead-to-new-treatments-for-schistosomiasis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Schistosomiasis-620x480.jpg", "publishedAt": "2022-04-06T01:33:00Z", "content": "A team led by UTSW researchers has identified a molecule produced by male parasitic worms called schistosomes that prompts sexual maturity in females of these species. The findings, reported in Cell,… [+3543 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Genetic 'hotspots' that speed up and slow down brain aging could provide new targets for Alzheimer's drugs - Science Daily", "description": "Researchers have discovered 15 'hotspots' in the genome that either speed up brain aging or slow it down -- a finding that could provide new drug targets to resist Alzheimer's disease and other degenerative brain disorders, as well as developmental delays.", "url": "https://www.sciencedaily.com/releases/2022/04/220405171804.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-06T01:19:39Z", "content": "Researchers from a USC-led consortium have discovered 15 \"hotspots\" in the genome that either speed up brain aging or slow it down -- a finding that could provide new drug targets to resist Alzheimer… [+3365 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "SARS-CoV-2 ORF8 interferes with antibody-dependent cellular cytotoxicity - News-Medical.Net", "description": "Researchers describe the effect of ORF8 and the immune-evasion activity used by SARS-CoV-2 to escape humoral responses.", "url": "https://www.news-medical.net/news/20220405/SARS-CoV-2-ORF8-interferes-with-antibody-dependent-cellular-cytotoxicity.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709815_16491844452896548.jpg", "publishedAt": "2022-04-06T00:38:00Z", "content": "The sudden worldwide outbreak of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) resulted in the current coronavirus disease 2019 (COVID-19) pandemic. Since its emergence, researcher… [+6107 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Sugary and high glycemic load foods may influence poor oral health - News-Medical.Net", "description": "The foods we eat on a regular basis influence the makeup of the bacteria -; both good and bad -; in our mouths.", "url": "https://www.news-medical.net/news/20220405/Sugary-and-high-glycemic-load-foods-may-influence-poor-oral-health.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Periodontal_Disease-620x480.jpg", "publishedAt": "2022-04-06T00:36:00Z", "content": "The foods we eat on a regular basis influence the makeup of the bacteria -; both good and bad -; in our mouths. And researchers are finding that this collective of bacteria known as the oral microbio… [+3696 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "'Robot scientist' Eve finds that less than one third of scientific results are reproducible - EurekAlert", "description": "Researchers have used a combination of automated text analysis and the ‘robot scientist’ Eve to semi-automate the process of reproducing research results. The problem of lack of reproducibility is one of the biggest crises facing modern science.", "url": "https://www.eurekalert.org/news-releases/948656", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-06T00:23:38Z", "content": "Researchers have used a combination of automated text analysis and the ‘robot scientist’ Eve to semi-automate the process of reproducing research results. The problem of lack of reproducibility is on… [+4594 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New UCI-led study lays foundation for establishing base editing as a one-time, durable treatment for inherited retinal degeneration - EurekAlert", "description": "A new University of California, Irvine-led study indicates base editing may provide long-lasting retinal protection and prevent vision deterioration in patients with inherited retinal degeneration, specifically in Leber congenital amaurosis (LCA) patients.", "url": "https://www.eurekalert.org/news-releases/948840", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/8dea538f-6039-478a-87cd-fba71511a480/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-05T22:07:07Z", "content": "image: Here we show that in vivo correction of an Rpe65 mutation by adenine base editor (ABE) prolongs the survival of cones in LCA mouse model.view more \r\nCredit: Nature Communications\r\nIrvine, CA –… [+5161 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Leah Goggins", "title": "Eating Less Salt Could Improve Your Quality of Life, According to New Research - EatingWell", "description": "Heart failure patients experienced less fatigue when they cut back on sodium.", "url": "https://www.eatingwell.com/article/7959482/low-sodium-diet-quality-of-life-study/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&rect=0%2C124%2C2000%2C1124&poi=%5B880%2C679%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2022%2F04%2F05%2Feating-less-salt-could-improve-your-quality-of-life.jpg", "publishedAt": "2022-04-05T21:50:04Z", "content": "If you've been trying to eat a heart-healthy diet, you may have heard the advice to eat less sodium. The American Heart Association recommends limiting your sodium intake to 2,300 milligrams (mg) per… [+3401 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Heart attack: Treatment to prevent cardiac events may include cereal fibre - Verve Times", "description": "Cardiovascular diseases are a group of disorders that affect the blood vessels. The term encompasses heart attacks and strokes. Both conditions are acute events that result mainly from a blockage that prevents blood from flowing to the heart or brain", "url": "https://vervetimes.com/heart-attack-treatment-to-prevent-cardiac-events-may-include-cereal-fibre/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1591729.jpg", "publishedAt": "2022-04-05T20:17:34Z", "content": "Cardiovascular diseases are a group of disorders that affect the blood vessels. The term encompasses heart attacks and strokes. Both conditions are acute events that result mainly from a blockage tha… [+3407 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Kate Ashton", "title": "More Australians are reporting catching COVID-19 twice, but there's limited data on reinfections - ABC News", "description": "A growing number of Australians are reporting catching COVID-19 twice but with no national data, it's hard to say how common that is. Experts want people who've recovered from the virus to know it's possible to get it again.", "url": "https://www.abc.net.au/news/2022-04-06/covid-19-reinfections-increasing-in-australia/100967706", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/a248c9c4b2dfb47c60850dc5e41cd43f?impolicy=wcms_crop_resize&cropH=2268&cropW=4032&xPos=0&yPos=149&width=862&height=485", "publishedAt": "2022-04-05T20:12:58Z", "content": "A growing number of Australians are catching COVID-19 for a second time as the country grapples with another surge in infections, but a lack of official data makes it hard to pinpoint exactly who is … [+6741 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows superiority of Chocolate Touch device for opening blocked arteries in the leg - News-Medical.Net", "description": "Patients treated for a blocked artery in the leg were significantly more likely to have an open artery without further interventions at 12 months if they received the second-generation paclitaxel-coated balloon catheter known as the Chocolate Touch device com…", "url": "https://www.news-medical.net/news/20220405/Study-shows-superiority-of-Chocolate-Touch-device-for-opening-blocked-arteries-in-the-leg.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Angioplasty-620x480.jpg", "publishedAt": "2022-04-05T19:56:00Z", "content": "Patients treated for a blocked artery in the leg were significantly more likely to have an open artery without further interventions at 12 months if they received the second-generation paclitaxel-coa… [+4849 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Ed Susman", "title": "Cardiac Monitoring Finds Arrhythmias, but Treatment Did Not Improve Outcomes - Medpage Today", "description": "No differences in mortality, hospitalization between monitored patients and control patients", "url": "https://www.medpagetoday.com/meetingcoverage/acc/98049", "urlToImage": "https://assets.medpagetoday.net/media/images/98xxx/98049.jpg", "publishedAt": "2022-04-05T19:30:08Z", "content": "WASHINGTON -- While monitoring for arrhythmias in high-risk patients following myocardial infarction (MI) commonly detected rhythm events requiring treatment within 2 years, treatment did not lead to… [+3355 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Prenatal influenza vaccination and allergic and autoimmune diseases in childhood: A longitudinal, population-based linked cohort study - Plos.org", "description": "Damien Foo and colleagues evaluate the association between prenatal influenza vaccination and diagnosis of allergic and autoimmune diseases in childhood.", "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1003963", "urlToImage": "https://journals.plos.org/plosmedicine/article/figure/image?id=10.1371/journal.pmed.1003963.g001&size=inline", "publishedAt": "2022-04-05T17:48:45Z", "content": "Abstract\r\nBackground\r\nFew studies have evaluated the effect of maternal influenza vaccination on the development of allergic and autoimmune diseases in children beyond 6 months of age. We aimed to in… [+43836 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "New part of the body found hiding in the lungs - Livescience.com", "description": "The newfound cells help to maintain a healthy respiratory system.", "url": "https://www.livescience.com/new-body-cell-discovered-in-lungs", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Bxr5rYnBKvRaJsLana3fKc-1200-80.jpg", "publishedAt": "2022-04-05T17:34:45Z", "content": "Researchers have discovered a new never-before-seen cell in the human lungs, which plays a vital role in the functioning of the respiratory system. (Image credit: Shutterstock)\r\n(opens in new tab)Sci… [+4763 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Fungicide-Treated Fruits May Harbour Deadly Super-Yeast, Study Finds - Gizmodo Australia", "description": "Recent research out of India raises concerns over the transmission risks of a harmful and hard-to-kill fungal infection. The study...", "url": "https://www.gizmodo.com.au/2022/04/fungicide-treated-fruits-may-harbour-deadly-super-yeast-study-finds/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/04/06/9180d9a6aec3dc9fd744a58d186d2a9d.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-05T15:56:00Z", "content": "Recent research out of India raises concerns over the transmission risks of a harmful and hard-to-kill fungal infection. The study found drug-resistant strains of Candida auris on apples that had bee… [+3036 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Cow dung fires linked to black fungus epidemic in India - Medical Xpress", "description": "Cow dung, widely used as a fuel and in rituals in India, is likely behind an epidemic of black fungus that killed or maimed thousands of patients treated in the country for COVID-19 in 2021, say medical researchers.", "url": "https://medicalxpress.com/news/2022-04-cow-dung-linked-black-fungus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cow-dung-fires-linked.jpg", "publishedAt": "2022-04-05T15:47:53Z", "content": "Cow dung, widely used as a fuel and in rituals in India, is likely behind an epidemic of black fungus that killed or maimed thousands of patients treated in the country for COVID-19 in 2021, say medi… [+5623 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Argonne National Laboratory", "title": "Study Investigates Assumptions About Colonoscopy Accuracy - Newswise", "description": "Simulations performed on high performance computers at Argonne investigate assumptions about colonoscopy accuracy.", "url": "https://www.newswise.com/doescience/study-investigates-assumptions-about-colonoscopy-accuracy", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-04-05T15:45:00Z", "content": "Newswise — By using high performance computers to simulate this important and effective test, Argonne can arm healthcare decision-makers with better information.\r\nIf you’re over 45, chances are your … [+8723 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "HIV drug stabilizes disease progression in metastatic colorectal cancer: Using reverse transcriptase inhibitors raises the possibility of a new therapeutic strategy in cancer. - Science Daily", "description": "Many cancers exhibit high levels of the reverse transcriptase enzyme. Single-agent lamivudine, a reverse transcriptase inhibitor, stopped disease progression in over 25% of patients with fourth-line refractory metastatic colorectal cancer. These results provi…", "url": "https://www.sciencedaily.com/releases/2022/04/220405102834.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-05T15:32:19Z", "content": "New clinical research shows that lamivudine, a reverse transcriptase inhibitor widely used in HIV therapy, stopped disease progression in 25% of patients with fourth-line metastatic colorectal cancer… [+3837 chars]"}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Peter Urban", "title": "Avocados Can Provide Heart Health Benefits - AARP", "description": "High in fiber and unsaturated fats, avocados are a staple of a heart-healthy lifestyle and diet. Read more about the health benefits of avocados.", "url": "https://www.aarp.org/health/healthy-living/info-2022/avocado-heart-health-benefits.html", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/healthy-living/2022/04/1140-avocados.imgcache.rev2fa4c3e1d67f4df2cd06f50be3c6c030.jpg", "publishedAt": "2022-04-05T15:01:52Z", "content": "They were followed for about 30 years, during which time they answered dietary questionnaires every four years and underwent health screenings. Researchers documented 9,185 coronary heart disease eve… [+2031 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Peter Rogers", "title": "New technique detects 95% of early-stage pancreatic cancer - Big Think", "description": "If future studies prove it to be successful, this technique for the early detection of pancreatic cancer could save thousands of lives.", "url": "https://bigthink.com/health/pancreatic-cancer-screen/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/03/AdobeStock_181431116.jpeg", "publishedAt": "2022-04-05T14:30:00Z", "content": null}, {"source": {"id": null, "name": "Hippocraticpost.com"}, "author": "Hippocratic Post", "title": "Immune system ‘sentinel’ cell key to response - The Hippocratic Post", "description": "Immune system ‘sentinel’ cells key to maintaining and regulating response to immunotherapy: The presence of", "url": "https://www.hippocraticpost.com/infection-disease/immune-system-sentinel-cell-key-to-response/", "urlToImage": "https://www.hippocraticpost.com/wp-content/uploads/2022/04/shutterstock_138285857.jpg", "publishedAt": "2022-04-05T14:27:07Z", "content": "Immune system sentinel cells key to maintaining and regulating response to immunotherapy: The presence of dendritic cells, so-called sentinel immune cells, is vital to maintain and regulate the balan… [+3538 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "ECG Can Pinpoint Hospitalized COVID-19 Patients at High Risk of Death - HospiMedica", "description": "A new study that examined the association between QT prolongation and long-term mortality in patients hospitalized with COVID-19 has found that ECG can pinpoint hospitalized COVID-19 patients at high risk of death who might need intensive management.", "url": "https://www.hospimedica.com/covid-19/articles/294792268/ecg-can-pinpoint-hospitalized-covid-19-patients-at-high-risk-of-death.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2022-04-05/SDD-294792268.jpg", "publishedAt": "2022-04-05T13:59:54Z", "content": "An electrocardiogram (ECG) records electrical activity as it travels through the heart. The information is displayed as a graph which is divided into sections according to the location in the heart. … [+3767 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "Lung Cancer Progression: Stages, Treatment, & Prognosis - Verywell Health", "description": "Lung cancer progresses in four stages. Diagnosis at an early stage can greatly impact prognosis. Here’s what to expect as the disease progresses.", "url": "https://www.verywellhealth.com/lung-cancer-progression-5221706", "urlToImage": "https://www.verywellhealth.com/thmb/BZr1pyAg0FrwOyb-NIYWoy5iCj0=/723x483/filters:fill(87E3EF,1)/GettyImages-1301122401-9afb6b3b01b14bfe9f7abf3ce2893583.jpg", "publishedAt": "2022-04-05T13:56:20Z", "content": "Lung cancer is the most common type of cancer in men and women around the world, with an estimated 228,820 new cases diagnosed in the U.S. each year. About 85% of lung cancer cases are caused by smok… [+11089 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kassia Byrnes", "title": "Why you haven’t caught Covid yet - news.com.au", "description": "<p>By now, it&rsquo;s likely you&rsquo;ve either had Covid or you&rsquo;ve been a close contact of somebody who did. If you&rsquo;re in the latter group and you haven&rsquo;t caught it yourself, chances are you&rsquo;re feeling very smug right now &mdash; but…", "url": "https://www.news.com.au/lifestyle/health/health-problems/a-doctor-explains-why-you-havent-caught-covid-yet/news-story/d57a08a08278abf27f43c29fcfe87196", "urlToImage": "https://content.api.news/v3/images/bin/6b468a764461eaf1522d17c018826608", "publishedAt": "2022-04-05T13:01:30Z", "content": "If youve been lucky enough to get through the pandemic without a dreaded double red line, this is probably why.By now, it’s likely you’ve either had Covid or you’ve been a close contact of somebody w… [+5259 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Covid might have longer impacts on your brain: Study - WION", "description": "Scientists recently discovered that SARS-CoV-2 virus-infected people show signs of severe brain injury and inflammation, including a reduction in oxygen and blood flow into the brain, neuron damage and even small areas of haemorrhage.", "url": "https://www.wionews.com/science/covid-might-have-longer-impacts-on-your-brain-study-468522", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/04/05/252514-braaiinn.jpg, this study as well as the ones in future that focus on how SARS-CoV-2 impacts the human brain will help in better understanding and treatment of patients suffering from neurological effects of COVID-19 and long Covid.\" typeof=\"foaf:Image\" />", "publishedAt": "2022-04-05T11:45:17Z", "content": "Scientists recently discovered that SARS-CoV-2 virus-infected people show signs of severe brain injury and inflammation, including a reduction in oxygen and blood flow into the brain, neuron damage a… [+2038 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study generates a picture of the myocardial transcriptional landscape of COVID-19 - News-Medical.Net", "description": "Researchers profiled cardiac tissue transcriptomes of COVID-19 patients.", "url": "https://www.news-medical.net/news/20220405/Study-generates-a-picture-of-the-myocardial-transcriptional-landscape-of-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709709_16491541792936424.jpg", "publishedAt": "2022-04-05T10:26:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers profiled cardiac tissue transcriptomes of coronavirus disease 2019 (COVID-19) patients.\r\nStudy: Transcriptomic profiling of cardi… [+6013 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Devlin", "title": "When should I do a Covid test in the UK and do I still have to isolate if positive? - The Guardian", "description": "From tests to masks, we look at advice on what to do now most people in England have to pay for testing", "url": "https://amp.theguardian.com/world/2022/apr/05/when-should-i-do-a-covid-test-do-i-still-have-to-isolate-england", "urlToImage": "https://i.guim.co.uk/img/media/0a9995b4cb010643e9fefd0ab6d283aede3e4acb/0_246_7340_4404/master/7340.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e255b8b41e02982ee588ea2810ea3f86", "publishedAt": "2022-04-05T10:24:00Z", "content": "The official list of Covid-19 symptoms on the NHS has been extended to cover nine new symptoms, including sore throat, fatigue and headache and comes days after the provision of free testing kits for… [+5509 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Stuart Layt", "title": "How worried should we be about the new ‘Deltacron’ COVID hybrid? - Sydney Morning Herald", "description": "The new hybrid strain of the Omicron and Delta variants could be a positive sign as we manage our way through the pandemic, experts say.", "url": "https://www.smh.com.au/national/how-worried-should-we-be-about-the-new-deltacron-covid-hybrid-20220405-p5ab1m.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.4996%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_14/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/f6f8c0c5f029e783cba256bbcdb18cc519a07039", "publishedAt": "2022-04-05T09:44:58Z", "content": "How worried should we be?\r\nThe evidence now indicates that Omicron, in both its recognised forms, is less severe than Delta but more transmissible than previous strains of the coronavirus it spreads … [+2804 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Direction and magnitude of predictors of all-cause mortality following hospitalization with influenza, RSV, or SARS-CoV-2 - News-Medical.Net", "description": "Researchers performed a retrospective cohort study to identify predictors of mortality following hospitalization with influenza, respiratory syncytial virus, or SARS-CoV-2.", "url": "https://www.news-medical.net/news/20220405/Direction-and-magnitude-of-predictors-of-all-cause-mortality-following-hospitalization-with-influenza-RSV-or-SARS-CoV-2.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709693_16491483241971217.jpg", "publishedAt": "2022-04-05T08:50:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic, caused by the rapid outbreak of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has put immense pressure on healthcare systems worldwid… [+5594 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Study unravels neuronal mechanisms that control food cravings during pregnancy - Tech Explorist", "description": "Persistent cravings have consequences for the offspring.", "url": "https://www.techexplorist.com/neuronal-mechanisms-control-food-cravings-pregnancy/46231/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/04/Roberta-Haddad-Tovolli.jpg", "publishedAt": "2022-04-05T08:13:23Z", "content": "Food cravings are very common, especially during pregnancy. It contributes to the maintenance and development of gestational overweight or obesity. However, the neurobiology underlying the distinct i… [+2112 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Influenza vaccine: Where to get your flu jab right now - Toowoomba Chronicle", "description": "Subscribe to The Chronicle to get unrestricted digital access, home paper delivery, Apps for iPad and Android and much more...", "url": "https://dsf.newscorpaustralia.com/thechronicle/subscription/", "urlToImage": null, "publishedAt": "2022-04-05T08:00:00Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Gene map may identify heart disease risk for people with Type 2 diabetes — ScienceDaily - Verve Times", "description": "A risk score based on a gene map predicted the likelihood of high blood pressure leading to heart problems or stroke in people with Type 2 diabetes, according to a study published today in the American Heart Association's peer-reviewed journal Hypert", "url": "https://vervetimes.com/gene-map-may-identify-heart-disease-risk-for-people-with-type-2-diabetes-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-05T06:55:23Z", "content": "A risk score based on a gene map predicted the likelihood of high blood pressure leading to heart problems or stroke in people with Type 2 diabetes, according to a study published today in the Americ… [+4274 chars]"}, {"source": {"id": null, "name": "Bendigoadvertiser.com.au"}, "author": "Maddy Fogarty", "title": "Agriculture Victoria says 'no risk to eating pork' as Japanese encephalitis virus continues to spread - Yass Tribune", "description": "One of Australia's leading agricultural organisations has released a statement clarifying humans are unable to contract Japanese encephalitis...", "url": "https://www.bendigoadvertiser.com.au/story/7687095/agriculture-victoria-says-pork-is-safe-to-eat-as-jev-continues-to-spread/", "urlToImage": "https://www.yasstribune.com.au/images/transform/v1/crop/frm/UCypFkB4pM4QYAHPapbDms/d73099f2-d5bf-45cc-9907-00a7ab811886.jpg/r0_268_2300_1476_w1200_h630_fmax.jpg", "publishedAt": "2022-04-05T06:21:32Z", "content": "One of Australia's leading agricultural organisations has released a statement clarifying humans are unable to contract Japanese encephalitis directly from pigs - and there is no risk when eating pig… [+5 chars]"}, {"source": {"id": null, "name": "The Market Herald"}, "author": "", "title": "Ayurveda Could be the Key to Your Health - The Market Herald", "description": "Ayurveda is a holistic approach to healing that emphasises prevention rather than cure.", "url": "https://themarketherald.com.au/fancy/ayurveda-could-be-the-key-to-your-health/", "urlToImage": "https://themarketherald.com.au/fancy/wp-content/uploads/2022/04/ayurvedic-dosha-diet.jpeg", "publishedAt": "2022-04-05T06:03:36Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Enhancing the effectiveness of chemotherapy and reinvigorating the immune system - Verve Times", "description": "Credit: Tel Aviv University                        Researchers from Tel Aviv University proved that a drug delivery system based on lipid nanoparticles can utilize RNA to overcome resi", "url": "https://vervetimes.com/enhancing-the-effectiveness-of-chemotherapy-and-reinvigorating-the-immune-system/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-nanodrug-that-atta.jpg", "publishedAt": "2022-04-05T02:24:59Z", "content": "Credit: Tel Aviv University\r\nResearchers from Tel Aviv University proved that a drug delivery system based on lipid nanoparticles can utilize RNA to overcome resistance to both chemotherapy and immun… [+4183 chars]"}, {"source": {"id": null, "name": "9News"}, "author": "Mark Saunokonoko", "title": "Nine new COVID-19 symptoms added to UK alert list - 9News", "description": "<p>The United Kingdom has quadrupled its official list of COVID-19 symptoms, which now includes a sore throat, muscle pains and diarrhoea.</p>", "url": "https://www.9news.com.au/world/nine-new-covid-19-symptoms-in-expanded-uk-coronavirus-health-list/bd835a22-2178-4b6e-8cc3-68d5852c2a82", "urlToImage": "https://imageresizer.static9.net.au/U8_5BK2CZy_6s_PBQKGP9mZ5t9Y=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fb44a596e-1faf-4de9-8f9e-86c025c250b8", "publishedAt": "2022-04-04T23:20:12Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Opioid prescriptions for pediatric patients following surgical procedures have dropped significantly: Study suggests larger trend of moving away from routine opioid prescriptions after surgery - Science Daily", "description": "Researchers found that opioid prescriptions for children who underwent one of eight common outpatient surgeries declined over a period of five years. These findings suggest that clinicians are using more discretion when considering which pediatric patients re…", "url": "https://www.sciencedaily.com/releases/2022/04/220404082859.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-04T23:13:13Z", "content": "Researchers from Children's Hospital of Philadelphia (CHOP) and the University of Pennsylvania School of Medicine found that opioid prescriptions for children who underwent one of eight common outpat… [+3443 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Childhood emotional trauma linked to heightened multiple sclerosis risk among women - Medical Xpress", "description": "Childhood trauma may be linked to a heightened risk of multiple sclerosis (MS) in later life among women, finds research published online in the Journal of Neurology Neurosurgery & Psychiatry.", "url": "https://medicalxpress.com/news/2022-04-childhood-emotional-trauma-linked-heightened.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/multiple-sclerosis.jpg", "publishedAt": "2022-04-04T22:30:01Z", "content": "Childhood trauma may be linked to a heightened risk of multiple sclerosis (MS) in later life among women, finds research published online in the Journal of Neurology Neurosurgery &amp; Psychiatry.\r\nT… [+3827 chars]"}, {"source": {"id": null, "name": "Craigmedred.news"}, "author": "craigmedred", "title": "Human guinea pigs - craigmedred.news", "description": "A news analysis More than a year into the SARS-CoV-2 pandemic, doctors in England finally took the bold step of intentionally exposing 36 young and healthy volunteers to the virus in what is called…", "url": "https://craigmedred.news/2022/04/04/human-guinea-pigs/", "urlToImage": "https://i0.wp.com/craigmedred.news/wp-content/uploads/2022/04/sars-viral-load.png?fit=663%2C691&ssl=1", "publishedAt": "2022-04-04T20:59:17Z", "content": "A news analysisMore than a year into the SARS-CoV-2 pandemic, doctors in England finally took the bold step of intentionally exposing 36 young and healthy volunteers to the virus in what is called a … [+14434 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Concern over cases of advanced prostate cancer on the rise - WPLG Local 10", "description": "According to recent research, metastatic prostate cancer rates are rising among men age 45 and older.", "url": "https://www.youtube.com/watch?v=UuCFlFgByZw", "urlToImage": "https://i.ytimg.com/vi/UuCFlFgByZw/hqdefault.jpg", "publishedAt": "2022-04-04T20:54:47Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Middle ear fluid common in kids on ventilators, UTSW study finds - EurekAlert", "description": "Babies and toddlers who need a tracheostomy – a tube surgically inserted into their windpipe to help relieve breathing problems – are at a high risk of accumulating fluid behind their eardrum when on a ventilator. That’s the conclusion of a new study, publish…", "url": "https://www.eurekalert.org/news-releases/948677", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/fd8af3ee-5023-4d30-9443-3f0be63c9664/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-04T20:17:49Z", "content": "image: Stephen R. Chorney, M.D., M.P.H.view more \r\nCredit: UT Southwestern Medical Center\r\nBabies and toddlers who need a tracheostomy – a tube surgically inserted into their windpipe to help relieve… [+5514 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Proteins in saliva could aid in COVID-19 detection and predict severe illness - Medical Xpress", "description": "Researchers have identified a family of proteins that is significantly elevated in the saliva of patients hospitalized with COVID-19. The proteins, known as ephrin ligands, could potentially serve as a biomarker to help doctors identify patients who are at ri…", "url": "https://medicalxpress.com/news/2022-04-proteins-saliva-aid-covid-severe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/mouth.jpg", "publishedAt": "2022-04-04T19:37:18Z", "content": "Researchers have identified a family of proteins that is significantly elevated in the saliva of patients hospitalized with COVID-19. The proteins, known as ephrin ligands, could potentially serve as… [+3179 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Kevin Kunzmann", "title": "Empagliflozin During Hospitalization Improves Acute Heart Failure Symptoms by 15 Days - MD Magazine", "description": "Mikhail Kosiborod, MD, discusses EMPULSE findings supporting hospital-stage treatment with the SGLT-2—regardless of patients' diabetes status.", "url": "https://www.hcplive.com/view/empagliflozin-hospitalization-acute-heart-failure-symptoms-15-days", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/aa9e44bbaa2a88eab4cefbe2893553707156d756-616x616.png?fit=crop&auto=format", "publishedAt": "2022-04-04T19:31:36Z", "content": "Empagliflozin initiated in the hospital for patients with early acute heart failure showed significant improvements in patients symptoms, physical ability and quality of life within 15 days, accordin… [+2304 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Final NACMI registry results show lower in-hospital mortality for STEMI patients with COVID-19 - EurekAlert", "description": "New results from the North American COVID-19 STEMI (NACMI) registry reported a 25% reduction in early mortality in year 2021 compared to 2020 among patients with ST-segment elevation myocardial infarction (STEMI) and COVID-19 infection and zero deaths for pat…", "url": "https://www.eurekalert.org/news-releases/948559", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-04T18:47:39Z", "content": "WASHINGTON (April 4, 2022) – New results from theNorth American COVID-19 STEMI (NACMI) registry reported a 25% reduction in early mortality in year 2021 compared to 2020 among patients with ST-segmen… [+3290 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "GPs rank screening for heart rhythm disorder nearly as important as for common cancers - EurekAlert", "description": "Screening for atrial fibrillation should be integrated into flu vaccination and cancer screening programmes, according to a survey of GPs conducted by the AFFECT-EU project and presented at EHRA 2022, a scientific congress of the European Society of Cardiolog…", "url": "https://www.eurekalert.org/news-releases/948312", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-04T18:34:45Z", "content": "Copenhagen, Denmark – 4 April 2022:  Screening for atrial fibrillation should be integrated into flu vaccination and cancer screening programmes, according to a survey of GPs conducted by the AFFECT-… [+6879 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Parkinson's Disease - KHON2 News", "description": "April is Parkinson's Awareness Month, a time to highlight the effects this disease can have on someone dealing with it, as well as those around them. Learn m...", "url": "https://www.youtube.com/watch?v=s1jdXOyyy8w", "urlToImage": "https://i.ytimg.com/vi/s1jdXOyyy8w/hqdefault.jpg", "publishedAt": "2022-04-04T16:33:40Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Investigational drug vupanorsen achieves modest reduction in non-HDL cholesterol - Medical Xpress", "description": "The investigational drug vupanorsen reduced total levels of non-high-density lipoprotein (non-HDL) cholesterol by up to 28% in patients with high cholesterol who were already taking a cholesterol-lowering statin medication, in a study presented at the America…", "url": "https://medicalxpress.com/news/2022-04-drug-vupanorsen-modest-reduction-non-hdl.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cholesterol.jpg", "publishedAt": "2022-04-04T15:13:56Z", "content": "The investigational drug vupanorsen reduced total levels of non-high-density lipoprotein (non-HDL) cholesterol by up to 28% in patients with high cholesterol who were already taking a cholesterol-low… [+4116 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary DNA Nanotechnology Speeds Up Development of Vaccines by More Than One Million Times - SciTechDaily", "description": "Revolutionary tool will meet future pandemics with accelerated response. A new tool speeds up development of vaccines and other pharmaceutical products by more than one million times while minimizing costs. In search of pharmaceutical agents such as new vacci…", "url": "https://scitechdaily.com/revolutionary-dna-nanotechnology-speeds-up-development-of-vaccines-by-more-than-one-million-times/", "urlToImage": "https://scitechdaily.com/images/DNA-Health-Technology-Concept.jpg", "publishedAt": "2022-04-04T15:00:10Z", "content": "Revolutionary tool will meet future pandemics with accelerated response.\r\nA new tool speeds up development of vaccines and other pharmaceutical products by more than one million times while minimizin… [+5644 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Major bleeding reduced in patients having non-cardiac surgery - Medical Xpress", "description": "A large, international study found a drug that helps the blood to clot reduced life-threatening, major and critical organ bleeding in patients undergoing non-cardiac surgery—without increasing major vascular complications.", "url": "https://medicalxpress.com/news/2022-04-major-patients-non-cardiac-surgery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/major-bleeding-reduced.jpg", "publishedAt": "2022-04-04T13:10:49Z", "content": "A large, international study found a drug that helps the blood to clot reduced life-threatening, major and critical organ bleeding in patients undergoing non-cardiac surgerywithout increasing major v… [+2792 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Levels of a certain hormone could predict or detect bone loss in premenopausal women - EurekAlert", "description": "Physicians may be able to determine if menopause-related bone loss is already in progress or about to begin by measuring the level of a hormone called anti-Mullerian hormone that declines as women approach their final menstrual period. The findings could help…", "url": "https://www.eurekalert.org/news-releases/948261", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/b2bc9776-3a24-4e7f-ba2e-b01f18c6d61d/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-04T12:58:13Z", "content": "image: A 3D rendering of a cross-section of the spine showing bone loss due to osteoporosis. Women experience significant bone loss during a roughly three-year period called the menopause transition.… [+3964 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Aggressive intraoperative warming versus routine thermal management during non-cardiac surgery (PROTECT): a multicentre, parallel group, superiority trial - The Lancet", "description": "The incidence of a 30-day composite of major cardiovascular outcomes did not differ\nsignificantly in patients randomised to 35·5°C and to 37°C. At least over a 1·5°C\nrange from very mild hypothermia to full normothermia, there was no evidence that\nany substan…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00560-8/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a4a06b39-72d5-489f-84e6-e916cba8af07/gr1.jpg", "publishedAt": "2022-04-04T12:32:59Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Case study of multi-system inflammatory syndrome in children in a fully vaccinated teenager - News-Medical.Net", "description": "A new preprint describes the importance of recognizing this complication, reporting a case of MIS-C without a prior history of this infection.", "url": "https://www.news-medical.net/news/20220404/Case-study-of-multi-system-inflammatory-syndrome-in-children-in-a-fully-vaccinated-teenager.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709535_1649068010250937.jpg", "publishedAt": "2022-04-04T10:32:00Z", "content": "The severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has circulated worldwide since December 2019, causing millions of deaths. Newer variants have emerged in quick succession over the las… [+5895 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "The Conversation", "title": "Where you live affects your dementia risk. Should you be concerned? - 7NEWS", "description": "Your postcode plays a role in your memory and risk of developing dementia, a new study showed. But what does this mean?", "url": "https://7news.com.au/lifestyle/health-wellbeing/where-you-live-affects-your-dementia-risk-should-you-be-concerned-c-6295082", "urlToImage": "https://images.7news.com.au/publication/C-6295082/f161a871c84015a612f8d5256aa8485f90ad865e-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-04-04T07:00:00Z", "content": "Socioeconomic status is a key indicator of health outcomes, including access to and quality of health care.\r\nIn 4656 adults across metro, regional and rural Australia, new research from the Healthy B… [+5377 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Smokers have lower chance of surviving heart attack: Study - Hindustan Times", "description": "The study has also found that levels of Alpha-1 Anti Trypsin (A1AT)--a protein in the liver that protects the body's tissues--in smokers were 'significantly less' than in non-smokers. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/smokers-have-lower-chance-of-surviving-heart-attack-study-101649049713624.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/no_smoking_thumb_1646751669997_1649049762546.jpg", "publishedAt": "2022-04-04T05:25:22Z", "content": "A new study led by researchers at the Jordan University of Science and Technology has found that smokers have a lower chance of surviving a heart attack than non-smokers.\r\nThe study was published in … [+1340 chars]"}]}