{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "Studies: Omicron less severe as it mostly avoids attacking lungs - The Times of Israel", "description": "Series of experiments on mice, hamsters all reach same conclusion that new coronavirus strain mainly manifests in upper airway, causing fewer breathing problems", "url": "https://www.timesofisrael.com/studies-omicron-less-severe-as-it-mostly-avoids-attacking-lungs/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2021/12/AP21365607754044-1024x640.jpg", "publishedAt": "2021-12-31T21:00:58Z", "content": "A series of recently published studies found the Omicron variant may be less severe than other coronavirus strains because of the way it attacks the lungs, according to Friday reports.\r\nStudies on mi… [+2080 chars]"}, {"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Penny Bouloutza", "title": "Experts say new Covid variant less severe, caution against infecting the elderly - Kathimerini English Edition", "description": "The spread of the highly transmissible, if milder, Omicron variant of the coronavirus is creating a new reality, whereby the slightest symptom, such as a blocked nose or a scratchy throat, will be considered to be a likely symptom of Covid-19.", "url": "https://www.ekathimerini.com/news/1174790/experts-say-new-covid-variant-less-severe-caution-against-infecting-the-elderly/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2021/09/covid_test_-_intime.jpg", "publishedAt": "2021-12-31T19:35:47Z", "content": "The spread of the highly transmissible, if milder, Omicron variant of the coronavirus is creating a new reality, whereby the slightest symptom, such as a blocked nose or a scratchy throat, will be co… [+2074 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Yes, at least 30% of COVID-19 patients suffer from 'Long COVID' - WHAS11", "description": "Almost two years in and we are still learning about the effects of COVID-19 infections, including how many people suffer from Long COVID–when symptoms of the...", "url": "https://www.youtube.com/watch?v=W2ieFDy5yEk", "urlToImage": "https://i.ytimg.com/vi/W2ieFDy5yEk/hqdefault.jpg", "publishedAt": "2021-12-31T19:31:10Z", "content": null}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "Nasal spray combination of rifampicin, resveratrol could cure dementia - Study Finds", "description": "The potentially groundbreaking treatment combines an antibiotic called rifampicin with resveratrol -- an antioxidant found in plants.", "url": "https://www.studyfinds.org/nasal-spray-may-cure-dementia/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2021/07/AdobeStock_183486296-scaled.jpeg", "publishedAt": "2021-12-31T18:25:31Z", "content": "OSAKA, Japan — A nasal spray that combines the powers of two drugs may be able to treat and even prevent Alzheimer’s disease, the most common form of dementia. Researchers from Osaka City University … [+3884 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "After ‘Delmicron’, it`s ‘flurona’: Israel reports first double infection of Covid and flu - WION", "description": "At a time when the world is grappling with Delta and Omicron variants, and the combination of both called ‘Delmicron’ variant of coronavirus, Israel has reported its first case of flurona— a simultaneous coronavirus and flu infection.", "url": "https://www.wionews.com/world/after-delmicron-its-flurona-israel-reports-first-double-infection-of-covid-and-flu-441504", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/31/230667-isreal.jpg", "publishedAt": "2021-12-31T17:38:46Z", "content": "At a time when the world is grappling with Delta and Omicron variants, and the combination of both called Delmicron variant of coronavirus, Israel has reported its first case of 'flurona' a simultane… [+1650 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": null, "title": "Omicron hospitalisation risk around one third of Delta, UK analysis shows - Sydney Morning Herald", "description": "Scientists analysed more than a million cases of Delta and Omicron patients in recent weeks and determined the risk of hospitalisation was significantly lower for those with the Omicron variant.", "url": "https://www.smh.com.au/world/europe/omicron-hospitalisation-risk-around-one-third-of-delta-uk-analysis-shows-20220101-p59l7c.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.38813657407407404%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_473%2C$y_447/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/ff7b7b3ad91335b754c1ee5271b45a1bd259cff6", "publishedAt": "2021-12-31T17:24:03Z", "content": "London: The risk of hospitalisation with the Omicron variant of coronavirus is about one-third that of the Delta variant, according to a British analysis of more than a million cases of both types in… [+1309 chars]"}, {"source": {"id": null, "name": "UN News"}, "author": null, "title": "UN data helps balance New Year's weight loss resolutions - UN News", "description": "At the heart of many New Year’s resolutions is a fresh gym membership and an intensive exercise regime that promises to deliver quick results. But that is not necessarily the most efficient way for everyone to lose weight, according to a new study by the UN’s…", "url": "https://news.un.org/en/story/2021/12/1108992", "urlToImage": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production+Library/30-12-2021_Unsplash_exercise.jpg/image770x420cropped.jpg", "publishedAt": "2021-12-31T16:06:54Z", "content": "The International Atomic Energy Agency (IAEA) has published helpful new data from its Doubly Labelled Water (DLW) Database, which provide insights on the effectiveness of exercise to spur weight loss… [+3212 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Pascal Nalat", "title": "Dementia breakthrough as a’sweet spot’ of exercise for reversing cognitive decline is discovered. - Brinkwire", "description": "Dementia breakthrough as a'sweet spot' of exercise for reversing cognitive decline is discovered. SCIENTISTS have discovered a \"sweet spot\" for exercise", "url": "https://en.brinkwire.com/news/dementia-breakthrough-as-asweet-spot-of-exercise-for-reversing-cognitive-decline-is-discovered/", "urlToImage": "https://en.brinkwire.com/nerede/uploads/newsimages1/a-breakthrough-has-been-made-for-dementia-sufferers-1543161.jpg", "publishedAt": "2021-12-31T15:52:11Z", "content": "Dementia breakthrough as a’sweet spot’ of exercise for reversing cognitive decline is discovered.\r\nSCIENTISTS have discovered a “sweet spot” for exercise in the fight against dementia.\r\nIt reversed c… [+2464 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: Non-essential patient visits stopped at Nottingham hospitals - BBC News", "description": "Visits are being suspended for two weeks in Nottingham due to the pandemic.", "url": "https://www.bbc.com/news/uk-england-derbyshire-59840068", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11DB9/production/_122554137_qmcnuhtrust.png", "publishedAt": "2021-12-31T15:50:30Z", "content": "Image source, Nottingham University Hospitals NHS Trust\r\nImage caption, The trust runs the Queen's Medical Centre and Nottingham City Hospital\r\nNon-essential patient visits to hospitals in Nottingham… [+1163 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "Peta Rasdien", "title": "Cold or COVID? AMA WA president Mark Duncan-Smith says people should get tested - Herald Sun", "description": "Is it just a cough, or is it COVID?", "url": "https://www.perthnow.com.au/news/coronavirus/cold-or-covid-ama-wa-president-mark-duncan-smith-says-people-should-get-tested--c-5142393", "urlToImage": null, "publishedAt": "2021-12-31T15:45:47Z", "content": "With the rise of Omicron, some doctors are reporting anecdotal evidence of symptoms that are slightly different to those we have come to expect from earlier COVID-19 variants, including Delta.Is it j… [+4595 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Frankie Davies", "title": "Cancer: Symptoms include feeling full after eating small meals - newsconcerns", "description": "Current cancer figures are stark as a result of the pandemic, with the disease claiming millions of lives each year. Worldwide hopes have long remained focussed on a scientific breakthrough to deliver a cure, but with disease-halting treatments in si", "url": "https://newsconcerns.com/cancer-symptoms-include-feeling-full-after-eating-small-meals/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1543205.jpg", "publishedAt": "2021-12-31T15:39:18Z", "content": "Current cancer figures are stark as a result of the pandemic, with the disease claiming millions of lives each year. Worldwide hopes have long remained focussed on a scientific breakthrough to delive… [+3188 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Pfizer's COVID-19 antiviral pill Paxlovid granted approval for adults in the UK - ABC News", "description": "Britain is scrambling to build its defences amid a daily record of new COVID-19 cases as the Omicron variant of the virus spreads quickly.", "url": "https://www.abc.net.au/news/2022-01-01/paxlovid-granted-approval-in-the-uk/100733978", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/ca19195201644dfb30fd6caa5eb20e25?impolicy=wcms_crop_resize&cropH=1125&cropW=2000&xPos=0&yPos=104&width=862&height=485", "publishedAt": "2021-12-31T13:41:17Z", "content": "Britain has approved Pfizer's COVID-19 pill for adults who have mild to moderate infection and are at high risk of their illness worsening, its second easily administered antiviral against the corona… [+2365 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "HTLV-1 uveitis and Graves' disease presenting with sudden onset of blurred vision - The Lancet", "description": "A 25-year-old woman presented to our hospital with sudden onset of blurred vision\nin her right eye. The patient had a history of Graves' disease and had started methimazole\n20 mg daily 2 months earlier: investigations at that time had found her free tri-iodot…", "url": "https://www.thelancet.com/article/S0140-6736(21)02442-9/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/1ea6616e-9afd-4031-8a44-868192b03847/gr1.jpg", "publishedAt": "2021-12-31T11:53:39Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2021 Elsevier In… [+157 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. A new study by UCLA Health has found that cognitive-behavioural therapy (CBT-I) prevented major depression in older adults when compared to sleep education therapy in adults over the age of 60 with insomn…", "url": "https://www.latestly.com/agency-news/health-news-treating-insomnia-with-cognitive-behavioural-therapy-may-prevent-major-depression-in-elders-study-3209575.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/12/desperate-g82391f05d_19202021123110163120211231111122-588x441.jpg", "publishedAt": "2021-12-31T11:40:20Z", "content": "California [US], December 31 (ANI): A new study by UCLA Health has found that cognitive-behavioural therapy (CBT-I) prevented major depression in older adults when compared to sleep education therapy… [+5524 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Impact of a pan-sarbecovirus dendritic-cell targeting vaccine on SARS-CoV-2 variants - News-Medical.Net", "description": "A new study used in silico approaches for designing a next-generation CD40-targeting vaccine, CD40.", "url": "https://www.news-medical.net/news/20211231/Impact-of-a-pan-sarbecovirus-dendritic-cell-targeting-vaccine-on-SARS-CoV-2-variants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_700573_1640949050103757.jpg", "publishedAt": "2021-12-31T11:18:00Z", "content": "The emergence of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) in late 2019 in the Hubei province of China led to disastrous human as well as economic losses throughout the world.\r\nThe… [+7167 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Frankie Davies", "title": "Omicron coronavirus variant: New symptoms may include sleep paralysis - newsconcerns", "description": "Omicron has let rip at such ferocious speed that researchers are still scrambling to gauge how much of a threat the variant poses to current defences. Early data suggests its capacity for reinfection is unprecedented, putting pressure on medical circ", "url": "https://newsconcerns.com/omicron-coronavirus-variant-new-symptoms-may-include-sleep-paralysis/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1543041.jpg", "publishedAt": "2021-12-31T10:59:24Z", "content": "Omicron has let rip at such ferocious speed that researchers are still scrambling to gauge how much of a threat the variant poses to current defences. Early data suggests its capacity for reinfection… [+3765 chars]"}, {"source": {"id": null, "name": "East Bay Times"}, "author": "Ryan Carter, Kristy Hutchings, Olga Grigoryants", "title": "LA County reports more than 20,000 new coronavirus cases, fueled by omicron - East Bay Times", "description": "The number of people hospitalized with COVD-19-related illnesses jumped again on Thursday, to 1,365, an increase of 114 from the previous day; 214 of those patients are in intensive-care units, acc…", "url": "https://www.eastbaytimes.com/2021/12/31/la-county-reports-more-than-20000-new-coronavirus-cases-fueled-by-omicron/", "urlToImage": "https://www.eastbaytimes.com/wp-content/uploads/2021/12/RPE-L-VAXPACE-0211-01-1.jpg?w=1024&h=683", "publishedAt": "2021-12-31T10:16:36Z", "content": "Los Angeles County reported 20,198 new cases on Thursday, Dec. 30, a staggering total that, coupled with 24 deaths, affirms we are, in fact, experiencing the worst of a surge at the moment, said the … [+8362 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Harriet Whitehead", "title": "Statins side effects: Two signs in your sleep - when to speak to a doctor - Express", "description": "STATINS lower the level of low-density lipoprotein (LDL) cholesterol in the blood, which is often referred to as 'bad cholesterol'. Statins reduce the production of it inside the liver.", "url": "https://www.express.co.uk/life-style/health/1543067/statins-side-effects-difficulty-falling-staying-asleep", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1543067.jpg", "publishedAt": "2021-12-31T09:17:00Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Stroke: Reduce risk by not smoking, moderate intake of alcohol, healthy BMI, exercise - Verve Times", "description": "The Stroke Association warns that the catastrophic event occurs every five minutes in the UK, but the sooner a person receives treatment for a stroke, the less damage is likely to happen. If you suspect you or someone else is having a stroke, phone 9", "url": "https://vervetimes.com/stroke-reduce-risk-by-not-smoking-moderate-intake-of-alcohol-healthy-bmi-exercise/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1543044.jpg", "publishedAt": "2021-12-31T08:35:35Z", "content": "The Stroke Association warns that the catastrophic event occurs every five minutes in the UK, but the sooner a person receives treatment for a stroke, the less damage is likely to happen. If you susp… [+3683 chars]"}, {"source": {"id": null, "name": "EUobserver"}, "author": "EUobserver", "title": "Europe experiencing worst bird flu outbreak ever - EUobserver", "description": "Europe is currently facing the worst bird-flu outbreak ever, according to data from the Friedrich Loeffler Institute (FLI), Germany's leading animal-disease centre. In Europe, 675 outbreaks in wild birds and 534 in poultry have been reported between the b...", "url": "https://euobserver.com/tickers/153976", "urlToImage": "https://media.euobserver.com/6e5f90e3e78121ba09aefe7419b47a16-480x.jpg", "publishedAt": "2021-12-31T08:24:30Z", "content": "Europe is currently facing the worst bird-flu outbreak ever, according to data from the Friedrich Loeffler Institute (FLI), Germany's leading animal-disease centre. In Europe, 675 outbreaks in wild b… [+235 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Queensland prepares to farewell another year battling COVID-19 | 7NEWS - 7NEWS Australia", "description": "The countdown to the New Year is underway as we prepare to farewell another year of battling COVID.In 2022, we're being told to live with the virus with no l...", "url": "https://www.youtube.com/watch?v=WmaTtYijgEY", "urlToImage": "https://i.ytimg.com/vi/WmaTtYijgEY/hqdefault.jpg", "publishedAt": "2021-12-31T08:18:48Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "BNT162b2 vaccine effectiveness 92 percent for teens ages 12 to 17 - Medical Xpress", "description": "(HealthDay)—For adolescents ages 12 to 17 years, the effectiveness of full vaccination with two doses of the Pfizer-BioNTech vaccine is 92 percent against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2),  according to research published in the De…", "url": "https://medicalxpress.com/news/2021-12-bnt162b2-vaccine-effectiveness-percent-teens.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/bnt162b2-vaccine-effec.jpg", "publishedAt": "2021-12-31T07:55:34Z", "content": "(HealthDay)For adolescents ages 12 to 17 years, the effectiveness of full vaccination with two doses of the Pfizer-BioNTech vaccine is 92 percent against severe acute respiratory syndrome coronavirus… [+2150 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Study to find why bats live with viruses but don’t get sick - Tech Explorist", "description": "The knowledge could help us to reduce the threat to humans of infectious diseases.", "url": "https://www.techexplorist.com/study-find-bats-live-viruses-do-not-get-sick/43703/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2021/12/Intestinal-organoids-Rousette-bat.jpg", "publishedAt": "2021-12-31T06:48:40Z", "content": "Bats are one of the essential natural reservoirs for various emerging viruses that induce severe illness, including severe acute respiratory syndrome coronavirus (SARS-CoV), Middle East respiratory s… [+5675 chars]"}, {"source": {"id": null, "name": "Brisbane Times"}, "author": "Cloe Read", "title": "Almost 200 health workers, 29 Queensland police infected with COVID - Brisbane Times", "description": "Despite the strain, Chief Health Officer John Gerrard said he expected the pressure on the health system to ease soon, due to changes made to the close contact rules.", "url": "https://www.brisbanetimes.com.au/national/queensland/almost-200-health-workers-infected-with-covid-hundreds-more-in-isolation-20211231-p59l4y.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3858671156860253%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_432%2C$y_219/t_crop_custom/q_86%2Cf_auto/t_brisbanetimes_no_label_no_age_social_wm/a10944ba9e2d63079446f89c0cf54b8f93a4111d", "publishedAt": "2021-12-31T04:31:29Z", "content": "The number of Queensland healthcare workers infected with COVID-19 has more than tripled since last weekend, while more than 650 are in quarantine.\r\nAlso, 32 Queensland Police Service staff, includin… [+1061 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Covid-19 vaccines, can they be mixed? | The Whole Truth | Stuff.co.nz - Stuff", "description": "Having one dose each of two different Covid-19 vaccines is safe - and early research suggests it may even prompt a better immune response. Read more: https:/...", "url": "https://www.youtube.com/watch?v=cQJhvKOAWNo", "urlToImage": "https://i.ytimg.com/vi/cQJhvKOAWNo/maxresdefault.jpg", "publishedAt": "2021-12-31T03:00:15Z", "content": null}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Successful weight-loss intervention before infection associated with 60 percent lower risk of severe diseas... - newsconcerns", "description": "A Cleveland Clinic study shows that among patients with obesity, prior weight loss achieved with bariatric surgery was associated with a 60% lower risk of developing severe complications from COVID-19 infection. The research was published in the jour", "url": "https://newsconcerns.com/successful-weight-loss-intervention-before-infection-associated-with-60-percent-lower-risk-of-severe-disease-in-patients-with-obesity-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-31T02:30:17Z", "content": "A Cleveland Clinic study shows that among patients with obesity, prior weight loss achieved with bariatric surgery was associated with a 60% lower risk of developing severe complications from COVID-1… [+3320 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Healthy diet in early pregnancy reduces risk of gestational diabetes — ScienceDaily - newsconcerns", "description": "Obesity is a significant risk factor for developing gestational diabetes mellitus, and an increasing number of pregnant women are overweight or obese. Dietary habits have an impact on both obesity and the onset of gestational diabetes mellitus.The mo", "url": "https://newsconcerns.com/healthy-diet-in-early-pregnancy-reduces-risk-of-gestational-diabetes-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-31T01:48:17Z", "content": "Obesity is a significant risk factor for developing gestational diabetes mellitus, and an increasing number of pregnant women are overweight or obese. Dietary habits have an impact on both obesity an… [+2117 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How much do mutations reduce vaccine effectiveness in the Omicron variant? - News-Medical.Net", "description": "In new research, scientists from Adaptive Biotechnologies have been investigating the impact of spike protein mutations on vaccine efficiency for the Omicron variant. The study is currently available on the medRxiv* preprint server while awaiting peer review.", "url": "https://www.news-medical.net/news/20211230/How-much-do-mutations-reduce-vaccine-effectiveness-in-the-Omicron-variant.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_700567_16409124770599609.jpg", "publishedAt": "2021-12-31T01:02:00Z", "content": "When the coronavirus disease 2019 (COVID-19) first emerged and spread across the globe, many governments were forced to enact costly and restrictive measures to reduce the transmission of the disease… [+5767 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Harry Jones", "title": "Best time for COVID-19 vaccination during your pregnancy may be now, study finds — ScienceDaily - News Concerns", "description": "COVID-19 vaccination of expectant mothers elicits levels of antibodies to the SARS-CoV-2 outer \"spike\" protein at the time of delivery that don't vary dramatically with the timing of vaccination during pregnancy and thus don't justify delaying vaccin", "url": "https://newsconcerns.com/best-time-for-covid-19-vaccination-during-your-pregnancy-may-be-now-study-finds-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-12-31T00:52:18Z", "content": "COVID-19 vaccination of expectant mothers elicits levels of antibodies to the SARS-CoV-2 outer “spike” protein at the time of delivery that don’t vary dramatically with the timing of vaccination duri… [+4633 chars]"}, {"source": {"id": null, "name": "Cosmos"}, "author": "Amalyah Hart", "title": "Remote Aboriginal communities have the highest rate of rare leukaemia virus in the world - The Murray Valley Standard", "description": "A new study has found that remote central Australian Aboriginal communities have the highest prevalence of human T-cell leukaemia virus type 1 (HTLV-1) in the world.", "url": "https://cosmosmagazine.com/health/body-and-mind/rare-leukaemia-virus-htlv-1-aboriginal-communities/", "urlToImage": "https://www.murrayvalleystandard.com.au/images/transform/v1/crop/frm/jess.wallace/a7b687db-ebc6-46dd-9dc6-70d4e5e33687.jpg/r2_153_2998_1846_w1200_h678_fmax.jpg", "publishedAt": "2021-12-31T00:00:00Z", "content": "A new study has found that remote central Australian Aboriginal communities have the highest prevalence of human T-cell leukaemia virus type 1 (HTLV-1) in the world.\r\nThis devastating virus can cause… [+3712 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "The Editorial Board", "title": "The T-Cell Covid Cavalry - The Wall Street Journal", "description": "Two studies suggest this line of defense reduces Omicron’s severity.", "url": "https://www.wsj.com/articles/the-t-cell-covid-cavalry-antibodies-vaccines-omicron-11640906490", "urlToImage": "https://images.wsj.net/im-460306/social", "publishedAt": "2021-12-30T23:54:00Z", "content": "We hope this isnt forbidden to report by the public-health pessimists, but theres some good news about the vaccine defense against the Omicron variant. A pair of separate studiesfrom the Netherlands … [+417 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "https://www.facebook.com/Worldatlargenews/", "title": "Best 2021 Medical Breakthroughs, Cures And Dramatic Treatments for Cancer, Alzheimer's, Diabetes & More - Good News Network", "description": "Cures, treatments, breakthroughs, tech, 2021 was a big year for medical sciences of all degrees and disciplines from cancer to \"habit cough\".", "url": "https://www.goodnewsnetwork.org/2021-medical-breakthroughs-and-good-news/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2020/06/man-with-gene-editing-animation-brain-DNA-Crisper-CC-National-Human-Genome-Research-Institute-flickr.jpg", "publishedAt": "2021-12-30T23:26:04Z", "content": "Whether a deadly disease like cancer and Alzheimers or a lifelong affliction like diabetes, eczema, or arthritis, 2021 has been a year of breakthroughs and advancements.\r\nBeyond COVID-19 and the deve… [+6412 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Sarah Marsh", "title": "Inquests to be held into deaths of new mothers who died from herpes - The Guardian", "description": "Coroner will investigate if Kim Sampson, 29, and Samantha Mulcahy, 32, contracted virus from surgeon during C-sections", "url": "https://amp.theguardian.com/global-development/2021/dec/30/inquests-to-be-held-into-deaths-of-new-mothers-who-died-from-herpes", "urlToImage": null, "publishedAt": "2021-12-30T23:20:00Z", "content": "KentCoroner will investigate if Kim Sampson, 29, and Samantha Mulcahy, 32, contracted virus from surgeon during C-sections\r\nA coroner will investigate the deaths of two women from herpes following ch… [+3721 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Do Nasal or Throat Swabs Work Better to Detect Omicron? - Inside Edition", "description": "As infection rates rise in the United States, we’ve all seen those long lines for rapid COVID-19 tests. Now, questions are being raised about how reliable th...", "url": "https://www.youtube.com/watch?v=EodBzusWOYg", "urlToImage": "https://i.ytimg.com/vi/EodBzusWOYg/maxresdefault.jpg", "publishedAt": "2021-12-30T23:15:36Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Thousands of birds die amid Israel's 'worst ever' wildlife crisis - CGTN", "description": "", "url": "https://newsus.cgtn.com/news/2021-12-31/Thousands-of-birds-die-amid-Israel-s-worst-ever-wildlife-crisis-16qL0999UuQ/index.html", "urlToImage": "https://newsus.cgtn.com/news/2021-12-31/Thousands-of-birds-die-amid-Israel-s-worst-ever-wildlife-crisis-16qL0999UuQ/img/5609b258e5de479695c22eb03bbc82b3/5609b258e5de479695c22eb03bbc82b3-1280.jpeg", "publishedAt": "2021-12-30T23:14:37Z", "content": "Thousands of birds around Israel's Hula Reservoir were seen struggling, suffering, and dying as an outbreak of avian flu set off alarms throughout the region. More than 5,000 migratory cranes were de… [+255 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Ev Richard", "title": "U.K., With Surging Cases, Is on ‘War Footing’ Against Virus - Verve Times", "description": "England’s National Health Service “is now on a war footing,” one of its top medical officials warned on Thursday, saying its hospitals would erect field wards to help deal with the surge in coronavirus cases that has produced a steep rise in hospital", "url": "https://vervetimes.com/u-k-with-surging-cases-is-on-war-footing-against-virus/", "urlToImage": "https://static01.nyt.com/images/2021/12/30/world/30virus-uk-01/30virus-uk-01-facebookJumbo.jpg", "publishedAt": "2021-12-30T22:54:50Z", "content": "Professor Alison Leary, chair of health care and work-force modeling at London South Bank University, told BBC Radio on Monday that the London hospitals were already seeing a 30 percent increase in a… [+1001 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The use of monoclonal antibodies against infectious pathogens - News-Medical.Net", "description": "Joshua Tan of the National Institute of Allergy and Infectious Diseases at the National Institutes of Health wrote a review article in the journal DNA and Cell Biology about the role of monoclonal antibodies and briefly described a study on bispecific antibod…", "url": "https://www.news-medical.net/news/20211230/The-use-of-monoclonal-antibodies-against-infectious-pathogens.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_700562_16409039443053324.jpg", "publishedAt": "2021-12-30T22:41:00Z", "content": "Monoclonal antibodies are gaining traction as powerful tools for preventing infectious diseases. Recently, the rate of antibody discovery has accelerated, and the Coronavirus disease 2019 (COVID-19) … [+5386 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "Tyler Dawson", "title": "From COVID symptoms to treatment: How to recover from Omicron at home - National Post", "description": "First off: There are no secret at-home cures for COVID-19. There is no evidence that taking vitamin C supplements, for example, is of any use", "url": "https://nationalpost.com/health/from-covid-symptoms-to-treatment-how-to-recover-from-omicron-at-home", "urlToImage": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2021/12/Omicron-recovery-1.png", "publishedAt": "2021-12-30T22:24:19Z", "content": "First off: There are no secret at-home cures for COVID-19. There is no evidence that taking vitamin C supplements, for example, is of any use \r\nTyler Dawson\r\nPlenty of rest and plenty of fluids is th… [+7886 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mark Nichol", "title": "Former top general says ecstasy could be used to treat troops' PTSD - Daily Mail", "description": "General Sir Nick Carter said he wants officials to consider whether ecstasy could be used to treat traumatised troops suffering from PTSD, following research in the United States.", "url": "https://www.dailymail.co.uk/news/article-10357009/Former-general-says-ecstasy-used-treat-troops-PTSD.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/12/30/21/52385897-0-image-a-32_1640900166105.jpg", "publishedAt": "2021-12-30T22:00:46Z", "content": "The former chief of the Armed Forces has highlighted research into the illegal drug ecstasy to treat anxiety disorders caused by combat.\r\nYesterdays edition of the BBCs Today programme on Radio 4 was… [+2276 chars]"}, {"source": {"id": null, "name": "POZ"}, "author": null, "title": "Tivicay Bests Non-Integrase Therapy as First- and Second-Line HIV Treatment For Kids - POZ", "description": "A high-quality trial should improve access to dolutegravir for children worldwide.", "url": "https://www.poz.com/article/tivicay-bests-nonintegrase-therapy-first-secondline-hiv-treatment-kids", "urlToImage": "https://cdn.poz.com/120288_iStock-70305099-LARGE.jpg_d371c177-ab34-439c-bc99-400ccd0f58ad_x2.jpeg", "publishedAt": "2021-12-30T19:54:26Z", "content": "The Department of Health and Human Services (DHHS) already named Tivicay (dolutegravir) as one of two preferred treatments for children living with HIV, but a clinical trial published in the New Engl… [+2590 chars]"}, {"source": {"id": null, "name": "SBS News"}, "author": null, "title": "England is building temporary hospitals to help it cope with Omicron - SBS News", "description": "The UK's National Health Service is now building surge hubs at some hospitals as COVID-19 cases balloon to new levels.", "url": "https://www.sbs.com.au/news/england-is-building-temporary-hospitals-to-help-it-cope-with-omicron/456f729e-6836-4891-b456-a61f96a5c594", "urlToImage": "https://sl.sbs.com.au/public/image/file/ca882372-f332-4dc6-8d82-44ba577f2f9c/crop/16x9", "publishedAt": "2021-12-30T19:35:56Z", "content": "Outside St George's Hospital in Tooting in south London, workers were already putting up a metal framework to support the roof of a new unit, journalists from the AFP news agency saw.\r\n\"Given the hig… [+2621 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "J&J Covid booster highly effective against severe Omicron: study - Daily Telegraph", "description": "<p>A preliminary South African government study published Thursday showed a booster of the Johnson &amp; Johnson Covid vaccine was 85 percent effective in preventing hospitalization from the Omicron variant, a finding that helps revive the shot's reputation.<…", "url": "https://www.news.com.au/breaking-news/jj-covid-booster-highly-effective-against-severe-omicron-study/news-story/0eeec563fb02f32319a4fe3cbc8aaf9a", "urlToImage": "https://content.api.news/v3/images/bin/a759588b53126216361f7f657b76c050", "publishedAt": "2021-12-30T17:30:51Z", "content": "An illustration picture shows vials with Covid-19 vaccine stickers attached and syringes with the logo of US pharmaceutical company Johnson &amp; JohnsonA preliminary South African government study p… [+2347 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Tanya Mohn", "title": "Car Crash Deaths Involving Cannabis Spiked; Alcohol Often Used, Too - Forbes", "description": "Car crash deaths involving cannabis increased in recent years, and were more likely to involve alcohol, a new study has found.", "url": "https://www.forbes.com/sites/tanyamohn/2021/12/30/car-crash-deaths-involving-cannabis-spiked-alcohol-often-used-too/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F61cde6d2fee3d4b64f941f75%2F0x0.jpg", "publishedAt": "2021-12-30T17:23:22Z", "content": "The percentage of car crash deaths involving cannabis and that involving cannabis and alcohol ... [+] combined more than doubled in the United States between 2000 and 2018. \r\nGetty Images\r\nBoth the p… [+3297 chars]"}, {"source": {"id": null, "name": "Clinicalomics.com"}, "author": "Malorye Allison Branca", "title": "Black Prostate Cancer Patients' Radiation Therapy Outcomes Better Even with Higher Risk Disease - Clinical OMICs News", "description": "A meta-analysis of radiation therapy trials by UCLA Jonsson Comprehensive Cancer Center researchers, showed that black men with more aggressive disease appeared to have better outcomes than their white counterparts.", "url": "https://www.clinicalomics.com/topics/oncology/prostate-cancer/black-prostate-cancer-patients-radiation-therapy-outcomes-better-even-with-higher-risk-disease/", "urlToImage": "https://www.clinicalomics.com/wp-content/uploads/2021/12/Radiation-Therapy-157681132.jpg", "publishedAt": "2021-12-30T15:42:35Z", "content": "Black men with more aggressive disease appeared to have better outcomes than their white counterparts in a meta-analysis of radiation therapy trials, according to a study by UCLA Jonsson Comprehensiv… [+3396 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Jeffrey Craig", "title": "Five things research from twins taught us about health, behavior and what makes us unique - Medical Xpress", "description": "Researchers often compare the differences between identical and fraternal twins to better understand health and behavior.", "url": "https://medicalxpress.com/news/2021-12-twins-taught-health-behavior-unique.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/5-things-research-from.jpg", "publishedAt": "2021-12-30T13:29:57Z", "content": "Researchers often compare the differences between identical and fraternal twins to better understand health and behavior.\r\nThe first major insight is that genes and environments almost always combine… [+5809 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Recombinant adjuvanted zoster vaccination associated with lower risk of COVID-19 diagnosis and hospitalization - News-Medical.Net", "description": "A new study suggests that RZV may elicit durable innate immune responses in the elderly conferring heterologous protection against COVID-19. .", "url": "https://www.news-medical.net/news/20211230/Recombinant-adjuvanted-zoster-vaccine-and-reduced-risk-of-COVID-19-diagnosis-and-hospitalization-in-older-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_700537_16408668069033585.jpg", "publishedAt": "2021-12-30T12:22:00Z", "content": "An international team of scientists has observed that the immunity elicited by recombinant adjuvanted zoster vaccine (RZV) offers heterologous protection, reducing the risk of coronavirus disease 201… [+5342 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Frankie Davies", "title": "Menopause: Treatment to relieve symptoms may include maca - newsconcerns", "description": "The average age at which a woman enters menopause in the UK is 52-years-old, but timing is partly inherited. After the moment a woman’s period stops, symptoms will typically last four years, with some women experiencing symptoms for up to 12 years. T", "url": "https://newsconcerns.com/menopause-treatment-to-relieve-symptoms-may-include-maca/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1540449.jpg", "publishedAt": "2021-12-30T11:11:19Z", "content": "The average age at which a woman enters menopause in the UK is 52-years-old, but timing is partly inherited. After the moment a womans period stops, symptoms will typically last four years, with some… [+3488 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": "Pascal Nalat", "title": "Crohn’s disease: The food that increases your death risk by 95%. - Brinkwire", "description": "Crohn's disease: The type of food that increases your death risk by 95%. CROHN'S disease is a long-term condition that causes inflammation in parts of", "url": "https://en.brinkwire.com/health/crohns-disease-the-food-that-increases-your-death-risk-by-95/", "urlToImage": "https://en.brinkwire.com/nerede/uploads/newsimages1/crohns-disease-processed-meat-1542366.jpg", "publishedAt": "2021-12-30T10:58:32Z", "content": "Crohn’s disease: The type of food that increases your death risk by 95%.\r\nCROHN’S disease is a long-term condition that causes inflammation in parts of your digestive system.\r\nA new study has discove… [+2439 chars]"}, {"source": {"id": null, "name": "Newsnationusa.com"}, "author": "Noah hilton", "title": "Vaccinating young children: Omicron raises pressure on policymakers - News Nation USA", "description": "As Omicron-led infections surge across Europe, a drive to vaccinate children aged five to 11 against Covid-19 is dividing opinion: while some parents welcome the opportunity to protect their young, ot", "url": "https://newsnationusa.com/news/world/uk/vaccinating-young-children-omicron-raises-pressure-on-policymakers/", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https://d1e00ek4ebabms.cloudfront.net/production/6c8d41b9-83e4-46a0-ae8a-488a49dd60a9.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2021-12-30T10:00:50Z", "content": "As Omicron-led infections surge across Europe, a drive to vaccinate children aged five to 11 against Covid-19 is dividing opinion: while some parents welcome the opportunity to protect their young, o… [+7213 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "The Role of Magnesium for Cognitive Function in Older Adults - Verve Times", "description": "This article was previously published July 16, 2020, and has been updated with new information.I've previously discussed the synergy between magnesium and vitamin D, and the importance of vitamin D for optimal immune function and overall health — esp", "url": "https://vervetimes.com/the-role-of-magnesium-for-cognitive-function-in-older-adults-2/", "urlToImage": "https://media.mercola.com/ImageServer/Public/2020/July/FB/magnesium-cognitive-function-fb.jpg", "publishedAt": "2021-12-30T06:22:04Z", "content": "This article was previously published July 16, 2020, and has been updated with new information.\r\nI’ve previously discussed the synergy between magnesium and vitamin D, and the importance of vitamin D… [+11964 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Growth-friendly surgeries have more complications than spinal fusion in kids treated with severe scoliosis - News-Medical.Net", "description": "A Michigan Medicine study found that preadolescent children with severe neuromuscular scoliosis who are treated with growth-friendly surgery prior to spinal fusion have more complications and unplanned subsequent surgeries than those who only have the spinal …", "url": "https://www.news-medical.net/news/20211230/Growth-friendly-surgeries-have-more-complications-than-spinal-fusion-in-kids-treated-with-severe-scoliosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/shutterstock_689215504_aa172f48b2a94017b930750da6a268cf-620x480.jpg", "publishedAt": "2021-12-30T06:16:00Z", "content": "A Michigan Medicine study found that preadolescent children with severe neuromuscular scoliosis who are treated with growth-friendly surgery prior to spinal fusion have more complications and unplann… [+3981 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Kylie Mar", "title": "Why Chris Hayes claims Omicron is 'one of the weirdest' moments of the pandemic - Yahoo News Australia", "description": "On Wednesday, the MSNBC host explained why he believes Omicron's contagiousness is changing the pandemic normal.", "url": "https://au.news.yahoo.com/why-chris-hayes-claims-omicron-is-one-of-the-weirdest-moments-of-the-pandemic-055757509.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hyL9OFeSGIlGiYVrSmWkVA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2021-12/62128700-6934-11ec-bf3f-e126b251114c", "publishedAt": "2021-12-30T05:57:57Z", "content": "On All In With Chris Hayes Wednesday, the MSNBC host explained why he believes the COVID-19 Omicron variant's contagiousness is redefining what the parameters of the pandemic.\r\nAs the U.S. set a new … [+2326 chars]"}, {"source": {"id": null, "name": "Southcoastregister.com.au"}, "author": "Aaron Bunch", "title": "NT records 37 new COVID-19 infections - South Coast Register", "description": "The Northern Territory's daily COVID-19 case tally has almost doubled with 37 new infections detected. The spike in cases follows a significant increase in vi...", "url": "https://www.southcoastregister.com.au/story/7566824/us-marines-nurse-among-37-nt-covid-cases/", "urlToImage": "https://www.southcoastregister.com.au/images/transform/v1/crop/frm/silverstone-feed-data/4f4b8076-3c44-4bd8-843b-7772bc8424a0.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-12-30T05:53:32Z", "content": ""}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Promoting exercise as basic need for managing the physical and cognitive symptoms of MS - News-Medical.Net", "description": "Citing recent evidence, experts in rehabilitation research advocate for integrating exercise into the care plans of persons with multiple sclerosis. The central role of the neurologist in clinical care offers an opportunity for this provider to promote exerci…", "url": "https://www.news-medical.net/news/20211230/Promoting-exercise-as-basic-need-for-managing-the-physical-and-cognitive-symptoms-of-MS.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2021-12-30T05:38:00Z", "content": "Citing recent evidence, experts in rehabilitation research advocate for integrating exercise into the care plans of persons with multiple sclerosis. The central role of the neurologist in clinical ca… [+2576 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Does Your Headache Require a Visit to Hospital? A Doctor Explains - Lifehacker Australia", "description": "If you’re wondering how bad your headache needs to be to go to hospital, here’s the advice a doctor gives her patients.", "url": "https://www.lifehacker.com.au/2021/12/when-headache-requires-hospital-doctor-explains/", "urlToImage": "https://imgix.lifehacker.com.au/content/uploads/sites/4/2015/07/Headache.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2021-12-30T04:30:00Z", "content": "I waited for hours in emergency last night with this dreadful headache, but eventually gave up and left. Should I have kept waiting at the hospital?\r\nThis is a surprisingly common scenario I encounte… [+5656 chars]"}, {"source": {"id": null, "name": "Forbesadvocate.com.au"}, "author": "Maeve Bannister", "title": "New bowel cancer treatment on the PBS - Forbes Advocate", "description": "Australians living with aggressive bowel cancer will have access to a more affordable treatment after it was added to the medicine benefits scheme. More than...", "url": "https://www.forbesadvocate.com.au/story/7566488/new-bowel-cancer-treatment-on-the-pbs/", "urlToImage": "https://www.forbesadvocate.com.au/images/transform/v1/crop/frm/silverstone-feed-data/1c1727dc-ca43-4f24-a2a5-3486ef8908a5.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2021-12-30T02:07:09Z", "content": "Australians living with aggressive bowel cancer will have access to a more affordable treatment after it was added to the medicine benefits scheme.\r\nMore than 15,000 Australians are diagnosed with bo… [+1040 chars]"}, {"source": {"id": null, "name": "Riverineherald.com.au"}, "author": null, "title": "Telehealth limits to breast cancer help - Riverine Herald", "description": "Breast Cancer Network Australia (BCNA) is calling on the Federal Government to defer changes to Telehealth that will limit patients’ access to telephone consultation...", "url": "https://www.riverineherald.com.au/news/telehealth-limits-to-breast-cancer-help/", "urlToImage": "https://imengine.public.prod.mmg.navigacloud.com?uuid=2f207d5c-b921-595b-9788-01ad272bae2d&function=original&type=preview", "publishedAt": "2021-12-30T01:03:31Z", "content": "Breast Cancer Network Australia (BCNA) is calling on the Federal Government to defer changes to Telehealth that will limit patients access to telephone consultations with their specialists from Janua… [+1883 chars]"}, {"source": {"id": null, "name": "The Northern Daily Leader"}, "author": "Andrew Messenger", "title": "Testing clinics 'under enormous pressure' as city records 39 cases - The Northern Daily Leader", "description": "HNEH public health physician Dr David Durrheim said the state's testing capacity is \"under enormous pressure\".", "url": "https://www.northerndailyleader.com.au/story/7566374/testing-clinics-under-enormous-pressure-as-city-records-39-cases/", "urlToImage": "https://www.northerndailyleader.com.au/images/transform/v1/crop/frm/andrew.messenger/58ee0507-45ee-44c1-a024-a08b1a46895f.jpg/r0_189_2048_1346_w1200_h678_fmax.jpg", "publishedAt": "2021-12-30T01:00:00Z", "content": ""}, {"source": {"id": null, "name": "Katherinetimes.com.au"}, "author": null, "title": "Keep PCR tests and mask mandates in the NT: Northern Land Council - Boorowa News", "description": "Call for government to 'stand firm for all Territorians' at today's national cabinet meeting.", "url": "https://www.katherinetimes.com.au/story/7566285/", "urlToImage": "https://www.boorowanewsonline.com.au/images/transform/v1/crop/frm/UWYHFAEKnbyAmcM9MqQVJE/53da82a2-3bc5-46d2-9c29-0056a37f7566.jpg/r17_362_6780_4183_w1200_h678_fmax.jpg", "publishedAt": "2021-12-29T23:47:00Z", "content": "PCR testing and mask mandates need to be maintained in the Territory according to the Northern Land Council as it urged the NT government to \"stand firm for all Territorians\" at today's national cabi… [+2728 chars]"}, {"source": {"id": null, "name": "Wpln.org"}, "author": "Caroline Eggers", "title": "Omicron may feel like a common cold, but docs say 'long COVID' is still a risk | - WPLN", "description": "Health experts are warning that people should remain careful during the Omicron variant surge.", "url": "https://wpln.org/post/omicron-may-feel-like-a-common-cold-but-docs-say-long-covid-is-still-a-risk/", "urlToImage": "https://wpln.org/wp-content/uploads/sites/7/2021/12/Covid-19-Oak-Ridge-National-Laboratory.jpg", "publishedAt": "2021-12-29T23:11:52Z", "content": "Nearly two years into the pandemic, there is still a lot of uncertainty regarding COVID-19, and well-intentioned public messaging can be easily misinterpreted.\r\nOmicron became the dominant strain in … [+3399 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Makes mRNA Vaccines So Effective Against Severe COVID-19? - SciTechDaily", "description": "Shots trigger exceptional antibody response by activating key helper immune cells. The first two vaccines created with mRNA vaccine technology — the Pfizer/BioNTech and Moderna COVID-19 vaccines — are arguably two of the most effective COVID vaccines develope…", "url": "https://scitechdaily.com/what-makes-mrna-vaccines-so-effective-against-severe-covid-19/", "urlToImage": "https://scitechdaily.com/images/COVID-Vaccine-Effective-Response-Success.jpg", "publishedAt": "2021-12-29T23:07:50Z", "content": "Shots trigger exceptional antibody response by activating key helper immune cells.\r\nThe first two vaccines created with mRNA vaccine technology — the Pfizer/BioNTech and Moderna COVID-19 vaccines — a… [+5642 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Audio Interview: Covid-19 Vaccination and the Omicron Variant | NEJM - nejm.org", "description": "Editorial from The New England Journal of Medicine — Audio Interview: Covid-19 Vaccination and the Omicron Variant", "url": "https://www.nejm.org/doi/full/10.1056/NEJMe2120098", "urlToImage": "https://www.nejm.org/templates/jsp/_mms/image/NEJM_defaultlogo_200px.png", "publishedAt": "2021-12-29T22:01:46Z", "content": "The continuing spread of SARS-CoV-2 remains a Public Health Emergency of International Concern. What physicians need to know about transmission, diagnosis, and treatment of Covid-19 is the subject of… [+268 chars]"}]}