{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Childhood obesity more likely to influenced by lifestyle factors than mother's BMI - News-Medical.Net", "description": "Researchers from the University of Bristol and Imperial College London have found that a high Body Mass Index (BMI) of a mother before and during pregnancy is not a major cause of high BMI in their offspring – indicating that childhood and teen obesity is mor…", "url": "https://www.news-medical.net/news/20220201/Childhood-obesity-more-likely-to-influenced-by-lifestyle-factors-than-mothers-BMI.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Body_Mass_Index-620x480.jpg", "publishedAt": "2022-02-02T00:30:00Z", "content": "Researchers from the University of Bristol and Imperial College London have found that a high Body Mass Index (BMI) of a mother before and during pregnancy is not a major cause of high BMI in their o… [+2459 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover why patients suffering with hypertension also have diabetes - News-Medical.Net", "description": "The long-standing enigma of why so many patients suffering with high blood pressure (known as hypertension) also have diabetes (high blood sugar) has finally been cracked by an international team led by the universities of Bristol, UK, and Auckland, New Zeala…", "url": "https://www.news-medical.net/news/20220201/Researchers-discover-why-patients-suffering-with-hypertension-also-have-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/High_Blood_Pressure-620x480.jpg", "publishedAt": "2022-02-02T00:15:00Z", "content": "The long-standing enigma of why so many patients suffering with high blood pressure (known as hypertension) also have diabetes (high blood sugar) has finally been cracked by an international team led… [+3888 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single-use sensor strips detect cerebrospinal fluid leaks: Sensor strips, hand-held circuit boards find fluid leaks from brain, spinal cord - Science Daily", "description": "Researchers developed a single-use sensor strip that can be used with a circuit board to detect cerebrospinal fluid leaks. They collected nine clinical samples and introduced the test fluid into a small liquid channel on the tip of the sensor strips. The liqu…", "url": "https://www.sciencedaily.com/releases/2022/02/220201115301.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T23:33:03Z", "content": "Developing rapid clinical testing for cerebrospinal fluid (CSF) leaks after trauma, surgery, tumors, and other defects are vital, because such leaks can cause life-threatening conditions, such as men… [+2365 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "New research sheds light on kids' coughs - 7NEWS", "description": "Bacterial slime in the lungs of children may be the cause of hard-to-beat wet coughs, new research suggests.", "url": "https://7news.com.au/lifestyle/health-wellbeing/new-research-sheds-light-on-kids-coughs-c-5532678", "urlToImage": "https://images.7news.com.au/publication/C-5532678/12ced1aa2344587c29db32dbb4f5dc162d48af91-16x9-x0y75w800h450.jpg?imwidth=1200", "publishedAt": "2022-02-01T23:32:00Z", "content": "Children who experience a nasty and persistent wet cough may be affected by an antibiotic-resistant slime, new research suggests.\r\nSome kids with stubborn coughs had a newly-discovered \"bacterial sli… [+1949 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Patients with severe COVID-19 may have lower oxygen requirements than previously believed - News-Medical.Net", "description": "A new study, led by researchers at Uppsala University, shows that all individual patients suffering from severe COVID-19 may have lower oxygen requirements than was formerly believed. The study was conducted at a Swedish district hospital during the first wav…", "url": "https://www.news-medical.net/news/20220201/Patients-with-severe-COVID-19-may-have-lower-oxygen-requirements-than-previously-believed.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2022-02-01T23:04:00Z", "content": "A new study, led by researchers at Uppsala University, shows that all individual patients suffering from severe COVID-19 may have lower oxygen requirements than was formerly believed. The study was c… [+2637 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Iron Accumulation Linked With Age-Related Cognitive Decline - Neuroscience News", "description": "A breakdown in regulatory mechanisms causes iron to build up in the brain during aging, increasing oxidative stress and increasing the risk of age-related cognitive decline, a new study reports.", "url": "https://neurosciencenews.com/iron-accumulation-cognition-aging-19997/", "urlToImage": "https://neurosciencenews.com/files/2022/02/iron-accumulation-cognition-neurosicences.jpg", "publishedAt": "2022-02-01T22:58:51Z", "content": "Summary: A breakdown in regulatory mechanisms causes iron to build up in the brain during aging, increasing oxidative stress and increasing the risk of age-related cognitive decline, a new study repo… [+5646 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jessica Knibbs", "title": "Cancer: Smear tests could help to determine a women's risk of ovarian cancer says research - Express", "description": "OVARIAN cancer is one of the most common types of cancer in women. A woman's risk of getting ovarian cancer during her lifetime is about one in 78.", "url": "https://www.express.co.uk/life-style/health/1559470/Cancer-smear-tests-ovarian-symptoms-risk", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1559470.jpg", "publishedAt": "2022-02-01T22:38:11Z", "content": "In the study, published in Nature Communications, the use of smear tests in detecting ovarian cancer was analysed.\r\nCervical cell samples were collected from 242 women with ovarian cancer and 869 wit… [+507 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Hormone replacement therapy to be sold over the counter for first time - The Telegraph", "description": "Exclusive: Rule change proposed so women can take HRT menopause drugs without a prescription", "url": "https://www.telegraph.co.uk/news/2022/02/01/hormone-replacement-therapy-sold-counter-first-time/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/02/01/TELEMMGLPICT000284440199_trans_NvBQzQNjv4BqS8u5Eplmrar4rPkapdr9QpF6tpult2aKpZyDLHPQ5Do.jpeg?impolicy=logo-overlay", "publishedAt": "2022-02-01T21:55:00Z", "content": "Some pharmacists already employ trained prescribers who are able to issue medicines on prescription. The latest changes may still require a consultation with a pharmacist, as is the case when the con… [+2455 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "A Man Chopped Off His Penis With Scissors in a Fit of Cannabis-Induced Psychosis, Doctors Say - Gizmodo", "description": "The man's detached member was considered \"too dirty and fragile\" to reattach, though his injuries and delusional symptoms were treated successfully.", "url": "https://gizmodo.com/man-chopped-off-penis-cannabis-induced-psychosis-1848462592", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e8e058dc3dc340da0126e2d42a3d347b.jpg", "publishedAt": "2022-02-01T21:54:00Z", "content": "A man in Thailands bong session went disastrously wrong, according to his doctors. In a new case report, they describe how he completely amputated his penis using scissors, apparently due to a rare e… [+3717 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists discover new insights about lymphangioleiomyomatosis - News-Medical.Net", "description": "Researchers have discovered new insights about lymphangioleiomyomatosis (LAM), a rare lung disease, which affects about 1 in 200,00 Americans and commonly features the growth of abnormal cells in different tissues and organs, including the lungs.", "url": "https://www.news-medical.net/news/20220201/Scientists-discover-new-insights-about-lymphangioleiomyomatosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-02-01T21:47:00Z", "content": "Researchers have discovered new insights about lymphangioleiomyomatosis (LAM), a rare lung disease, which affects about 1 in 200,00 Americans and commonly features the growth of abnormal cells in dif… [+1809 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "NIH study advances personalized immunotherapy for metastatic breast cancer - National Institutes of Health", "description": "Many people with metastatic breast cancer can mount an immune reaction against their tumors.", "url": "https://www.nih.gov/news-events/news-releases/nih-study-advances-personalized-immunotherapy-metastatic-breast-cancer", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2022/202210201-brain-scan.jpg", "publishedAt": "2022-02-01T21:11:53Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "These 4 risk factors may increase your chance of long COVID, study hints - Livescience.com", "description": "Several of these factors can be screened for in a patient's blood.", "url": "https://www.livescience.com/long-covid-four-potential-risk-factors", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cedusPbfDe4D2VQkEpwEv6-1200-80.jpg", "publishedAt": "2022-02-01T20:40:01Z", "content": "Scientists identified four risk factors that may help predict whether a person will develop long COVID, where an individual experiences various symptoms for weeks or months after their initial COVID-… [+10920 chars]"}, {"source": {"id": null, "name": "TCTMD"}, "author": "Shelley Wood", "title": "REDUCE LAP-HF II: Atrial Shunt Device Comes Up Short in HFpEF - TCTMD", "description": "The shunt, designed to relieve pulmonary capillary wedge pressure, was no better than a sham procedure, researchers said.", "url": "https://www.tctmd.com/news/reduce-lap-hf-ii-atrial-shunt-device-comes-short-hfpef", "urlToImage": "https://s3.amazonaws.com/prod.tctmd.com/public/2022-02/REDUCE%20LAP-HF%20II%20Atrial%20Shunt%20Device%20Comes%20Up%20Short%20in%20HFpEF.png", "publishedAt": "2022-02-01T20:00:00Z", "content": "Placement of an atrial shunt device intended to reduce pulmonary capillary wedge pressure (PCWP) during exercise in patients with heart failure and preserved ejection fraction (HFpEF) does not reduce… [+7110 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Felicity Warner, USA TODAY", "title": "How to get smell taste back after COVID-19: Essential oils may help - USA TODAY", "description": "COVID-19 causes loss of taste and smell in a large majority of cases. Smell training with essential oils may help retrain your senses—buy now from retailers like Amazon, Public Goods, CVS and more.", "url": "https://www.usatoday.com/story/money/reviewed/2022/02/01/how-to-get-smell-taste-back-after-covid-19-essential-oils-smell-training-may-help/9283695002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/02/01/USAT/7e99326d-463c-4d39-830d-30d7c871fedd-3.png?auto=webp&crop=1911,1075,x8,y0&format=pjpg&width=1200", "publishedAt": "2022-02-01T19:55:19Z", "content": "— Recommendations are independently chosen by Reviewed’s editors. Purchases you make through our links may earn us a commission.\r\nWith millions of people across the world contracting and recovering f… [+5557 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Kelly Burch, Kailey Proctor", "title": "High blood pressure diet: Foods to eat and avoid - Insider", "description": "If you have high blood pressure, you can help control it with a healthy diet that includes whole fruits, vegetables, whole grains.", "url": "https://www.insider.com/high-blood-pressure-diet", "urlToImage": "https://i.insider.com/61f98b99ef63e10018100e21?width=1200&format=jpeg", "publishedAt": "2022-02-01T19:42:18Z", "content": "High blood pressure, or \r\nhypertension, is extremely common, affecting 47% of American adults. That's a problem since people with high blood pressure are at increased risk for heart attack, stroke, k… [+5064 chars]"}, {"source": {"id": null, "name": "Silverscreenbeat.com"}, "author": null, "title": "In a landmark trial, cannabis is used to treat Long Covid symptoms - Silver Screen Beat", "description": "Drug Science is running the trial. If initial results are positive, it will be scaled-up to a large UK clinical study. Participating GPs will enroll around 30", "url": "https://www.silverscreenbeat.com/in-a-landmark-trial-cannabis-is-used-to-treat-long-covid-symptoms/", "urlToImage": "https://www.silverscreenbeat.com/wp-content/uploads/2022/02/Cannabis-being-used-to-treat-symptoms-of-Long-Covid-in.jpg", "publishedAt": "2022-02-01T18:29:43Z", "content": "An important trial to test cannabis’ use in treating Long Covid is currently being conducted. \r\nParticipating GPs will enroll around 30 patients with long-term symptoms like fatigue, muscle pain, anx… [+5607 chars]"}, {"source": {"id": null, "name": "Becker's Hospital Review"}, "author": "Cailey Gleeson", "title": "'Smart stethoscope' can spot heart failure, study finds - Becker's Hospital Review", "description": "The Imperial College of London and the UK National Health Service found an AI-powered device can screen for heart failure during physical exams, according to a study published Feb. 1 in The Lancet.", "url": "https://www.beckershospitalreview.com/cardiology/smart-stethoscope-can-spot-heart-failure-study-finds.html", "urlToImage": "https://www.beckershospitalreview.com/images/channels/cardiology/3.jpg", "publishedAt": "2022-02-01T17:39:25Z", "content": "The Imperial College of London and the UK National Health Service found an AI-powered device can screen for heart failure during physical exams, according to a study published Feb. 1 in The Lancet.\r\n… [+1033 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Treatment keeps alcoholic monkeys from drinking as much - Science Daily", "description": "A hormone produced by the liver called fibroblast growth factor 21 (FGF21) suppresses alcohol consumption in primates, finds a new study. Vervet monkeys with a strong preference for ethanol that were given an FGF21 analogue consumed 50% less alcohol. The stud…", "url": "https://www.sciencedaily.com/releases/2022/02/220201110624.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T17:32:17Z", "content": "A hormone produced by the liver called fibroblast growth factor 21 (FGF21) suppresses alcohol consumption in primates, finds a study published February 1 in the journal Cell Metabolism. Vervet monkey… [+3271 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Timothy Huzar", "title": "Does SARS-CoV-2 in white-tailed deer raise the risk of a new variant? - Medical News Today", "description": "New research documents SARS-CoV-2 being transmitted between white-tailed deer in the United States. MNT reached out for expert opinions on the study's findings.", "url": "https://www.medicalnewstoday.com/articles/silent-epidemic-of-sars-cov-2-in-white-tailed-deer-raises-concerns", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/01/deer_SARS-CoV-2_GettyImages1288715544_Thumb.jpg", "publishedAt": "2022-02-01T17:29:52Z", "content": "<ul><li>SARS-CoV-2 originated in animals before being transmitted to humans.</li><li>Animals are also able to acquire SARS-CoV-2 infections from humans.</li><li>The present research documents that SA… [+6146 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Daily physical activity boosts cognitive performance in middle-aged and older adults - News-Medical.Net", "description": "A new study by researchers at University of California San Diego School of Medicine adds to the canon of research associating physical activity with cognitive performance, this time using 90 middle-aged and older subjects who wore accelerometers while physica…", "url": "https://www.news-medical.net/news/20220201/Daily-physical-activity-boosts-cognitive-performance-in-middle-aged-and-older-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Physical_Activity-620x480.jpg", "publishedAt": "2022-02-01T17:15:00Z", "content": "A new study by researchers at University of California San Diego School of Medicine adds to the canon of research associating physical activity with cognitive performance, this time using 90 middle-a… [+2614 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Study finds pancreatic cancer cells feed off hyaluronic acid - The Statesman", "description": "\"Hyaluronic acid doesn't only affect tumours by creating this density, which does make it difficult to treat,\" Lyssiotis said.", "url": "https://www.thestatesman.com/lifestyle/health/study-finds-pancreatic-cancer-cells-feed-off-hyaluronic-acid-1503043114.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/01/QT-DNA.jpg", "publishedAt": "2022-02-01T16:54:20Z", "content": "A new study has found that hyaluronic acid which is present in pancreatic tumours also acts as food to the cancer cells.\r\nThe study has been published in the ‘eLife Journal’. “A central driving theme… [+3933 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Diet high in meat may increase risks for multiple sclerosis - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-02-01T16:48:19Z", "content": ""}, {"source": {"id": null, "name": "BioSpace"}, "author": "Vanessa Doctor, RN", "title": "ImmunityBio's Kick-and-Kill Therapy Shows Promise For HIV Patients - BioSpace", "description": "ImmunityBio shared positive results from its clinical trial on its IL-15 superagonist Anktiva (N-803) to treat people living with human immunodeficiency virus (HIV).", "url": "https://www.biospace.com/article/immunitybio-s-new-kick-and-kill-therapy-shows-promise-for-hiv-patients/", "urlToImage": "https://www.biospace.com/getasset/c09c6230-83c1-4a0e-b727-95615ddd331d/;w=625;h=350", "publishedAt": "2022-02-01T14:40:21Z", "content": "ImmunityBio shared positive results from the clinical trial of its IL-15 superagonist Anktiva (N-803) to treat people living with human immunodeficiency virus (HIV). \r\nThe Phase I HIV Cure Study is e… [+2425 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Illustrating the structural diversity of SARS-CoV-2 Omicron spike - News-Medical.Net", "description": "In a new study, a team of researchers used cryo-electron microscopy to determine the spike (S) structures of the SARS-CoV-2 Omicron variant to understand how the mutations that alter its primary sequence impact S conformation.", "url": "https://www.news-medical.net/news/20220201/Illustrating-the-structural-diversity-of-SARS-CoV-2-Omicron-spike.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703172_16437223728221742.jpg", "publishedAt": "2022-02-01T13:44:00Z", "content": "In a recent study posted to the bioRxiv* pre-print server, a team of researchers used cryo-electron microscopy (cryo-EM) to determine the spike (S) structures of the severe acute respiratory syndrome… [+5100 chars]"}, {"source": {"id": null, "name": "Rheumatology Advisor"}, "author": null, "title": "COVID-19 Vaccine Response Assessed in Patients With RA Receiving Rituximab - Rheumatology Advisor", "description": "Researchers studied the humoral and cellular immune responses after 2 or 3 doses of SARS-CoV-2 vaccines in patients with rheumatoid arthritis receiving treatment with rituximab.", "url": "https://www.rheumatologyadvisor.com/?p=88088", "urlToImage": "https://www.rheumatologyadvisor.com/wp-content/uploads/sites/18/2021/06/COVID19.Vaccine.Doctor_G_1289184541-1.jpg", "publishedAt": "2022-02-01T13:20:00Z", "content": "The humoral and cellular immune responses to SARS-CoV-2 vaccines were assessed among patients with rheumatoid arthritis (RA) receiving treatment with rituximab, in a study published in Lancet Rheumat… [+4586 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Ellie Cambridge", "title": "My four-year-old son went to sleep and woke up paralysed... - The Sun", "description": "", "url": "https://www.the-sun.com/health/4586783/little-boy-woke-up-paralysed/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/02/NINTCHDBPICT000708721085.jpg?crop=1px%2C239px%2C827px%2C551px&resize=1200%2C800", "publishedAt": "2022-02-01T13:04:00Z", "content": "A MUM has relived the horror morning her little boy woke up paralysed.\r\nOliver Davis had gone to bed the night before a healthy four-year-old - but when he woke up he couldn't feel his legs.\r\nOliver … [+2946 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Frank Chung", "title": "Twenty Covid mutations in single patient - NEWS.com.au", "description": "<p class=\"story-block__standfirst\">A young South African woman with untreated HIV was infected with SARS-CoV-2 for nine months, during which the respiratory virus accumulated more than 20 additional mutations, a new study claims.</p>", "url": "https://www.news.com.au/technology/science/human-body/covid19-developed-mutations-in-hivpositive-patient-south-african-study-suggests/news-story/6faacd10345d845357ee0f66d064b05a", "urlToImage": "https://content.api.news/v3/images/bin/12219805020da4275b04de1c571b3827", "publishedAt": "2022-02-01T12:35:27Z", "content": "The SARS-CoV-2 virus developed more than 20 mutations while infecting a young woman with uncontrolled HIV for nine months, a new study says.A young South African woman with untreated HIV was infected… [+3227 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring beta-coronavirus neutralization by vaccine-induced murine antibody WS6 - News-Medical.Net", "description": "In a new study, researchers evaluated the neutralizing antibody titers in mice vaccinated with messenger ribonucleic acid (mRNA) encoding SARS-CoV-2 spike (S) protein.", "url": "https://www.news-medical.net/news/20220201/Exploring-beta-coronavirus-neutralization-by-vaccine-induced-murine-antibody-WS6.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_703166_16437178719945419.jpg", "publishedAt": "2022-02-01T12:23:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers evaluated the neutralizing antibody titers in mice vaccinated with messenger ribonucleic acid (mRNA) encoding severe acute respir… [+6809 chars]"}, {"source": {"id": null, "name": "Infection Control Today"}, "author": "Infection Control Today® Editorial Staff", "title": "Long COVID Will Linger Even After the Pandemic Leaves - Infection Control Today", "description": "Many people suffer from long COVID, and since COVID-19 is a fairly recent development experts aren’t sure what “long” means exactly. Weeks? Months? Years? A lifetime?", "url": "https://www.infectioncontroltoday.com/view/long-covid-will-linger-even-after-the-pandemic-leaves", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/infenctioncontrol/e28c8fbc7573383a21d345df7a3b29fceb975528-680x432.png?fit=crop&auto=format", "publishedAt": "2022-02-01T12:18:12Z", "content": "We will never get rid of COVID-19, but we can learn to live with it. Most experts believe it will become endemic, evolving into the sort of illness for which an individual may need a yearly vaccine, … [+7641 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Researchers Discover Key Growth Factor Protein, Effective in Protection Against IBD - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Inflammatory bowel disease (IBD) is an umbrella term used to describe disorders that involve chronic inflammation of one's digestive tract. A recent discovery by Weill Cornell Medicine researchers has sai…", "url": "https://www.latestly.com/agency-news/health-news-researchers-discover-key-growth-factor-protein-effective-in-protection-against-ibd-3316077.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/IBD2022020107473820220201091516-588x441.jpg", "publishedAt": "2022-02-01T11:56:21Z", "content": "New York [US], February 1 (ANI): Inflammatory bowel disease (IBD) is an umbrella term used to describe disorders that involve chronic inflammation of one's digestive tract. A recent discovery by Weil… [+5086 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Researchers identify enzyme that prevents autoimmune disorders - Health Europa", "description": "Researchers have identified an enzyme to correctly identify threats, reducing the risk of autoimmune disorders.", "url": "https://www.healtheuropa.eu/researchers-identify-enzyme-that-prevents-autoimmune-disorders/113208/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/02/iStockenot-poloskun-951668074.jpg", "publishedAt": "2022-02-01T10:50:53Z", "content": "The enzyme was discovered in the thymus, an important organ where immune T cells learn to fight infection. The new findings revealed that the enzyme KAT7 is necessary to activate thousands of genes r… [+3656 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "COVID-19 Deadliest Event This Century In Three Countries Neutral In World Wars - IFLScience", "description": "Due to the COVID-19 pandemic, excess deaths in Switzerland, Sweden, and Spain were higher in 2020 than any other year since 1918, when the Spanish Flu was", "url": "https://www.iflscience.com/health-and-medicine/covid19-deadliest-event-this-century-in-three-countries-neutral-in-world-wars/", "urlToImage": "https://cdn.iflscience.com/images/e33bb151-1810-5b9a-9bbe-ccede28bc12d/default-1643711330-the-national-covid-memorial-wall-in-the-uk-image-credit-devis-m.jpg", "publishedAt": "2022-02-01T10:29:00Z", "content": "Due to the COVID-19 pandemic, excess deaths in Switzerland, Sweden, and Spain were higher in 2020 than any other year since 1918, when the Spanish Flu was spreading across the world.\r\nThe findings su… [+2320 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "谭欣雨", "title": "Aussie researchers develop software to detect potential health problems of newborns - Chinadaily USA", "description": null, "url": "http://global.chinadaily.com.cn/a/202202/01/WS61f8ff54a310cdd39bc846f6.html", "urlToImage": "//img2.chinadaily.com.cn/images/202202/01/61f909e8a310cdd3d82a63c4.jpeg", "publishedAt": "2022-02-01T10:00:09Z", "content": "SYDNEY -- Australian researchers have developed a new software to check for potentially serious health problems of vulnerable babies and infants.\r\nDetails of the medical breakthrough, published in th… [+2049 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "NewMediaWire", "title": "2022 Real Women survivor class use music to inspire others to take charge of their health - Yahoo Finance", "description": "DALLAS, February 1, 2022 — To inspire women to take charge of their health during February - American Heart Month - the American Heart Association today...", "url": "https://finance.yahoo.com/news/2022-real-women-survivor-class-100000486.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/RYUZftyZGE9wziTldPItTw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/uu/api/res/1.2/yckYvDofYoTQERe9mG2XWw--~B/aD0yMDQ1O3c9MzYzNjthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/newsmediawire_165/d69cec884e021407b6fa2e6ca1b68983", "publishedAt": "2022-02-01T10:00:00Z", "content": "(NewMediaWire) - February 01, 2022 - DALLAS -To inspire women to take charge of their health during February - American Heart Month - the American Heart Association today announced 12 heart disease a… [+6232 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Michelle Petersen", "title": "Study on mice: Exercising later in life can keep your muscles young - ZME Science", "description": "Exercising was shown to give elderly mice the muscles of those much younger.", "url": "https://www.zmescience.com/science/study-on-mice-exercising-later-in-life-can-keep-your-muscles-young/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/02/462468304_49691ecea5_b.jpg", "publishedAt": "2022-02-01T09:59:03Z", "content": "Exercising can not only make you feel younger, but it can also actually keep you younger as well. A study on mice suggests that exercising, even later in life, can do wonders for your muscles. In add… [+5455 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Queen's University Belfast", "title": "New research will focus on repurposing existing drugs to treat patients with COVID-19 - Newswise", "description": "Queen’s University Belfast will lead a new £1.6m collaborative project to rapidly identify new treatments for COVID-19.", "url": "https://www.newswise.com/coronavirus/new-research-will-focus-on-repurposing-existing-drugs-to-treat-patients-with-covid-19", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-02-01T09:05:00Z", "content": "Newswise — The project, funded by the Medical Research Council, will bring together experts from Queen’s, University of Liverpool and University of Oxford . The team will use a data-driven approach t… [+4062 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Researchers develop artificial muscles made of natural proteins - Inceptive Mind", "description": "The movements are driven by a chemical reaction that consumes molecular energy for this purpose.", "url": "https://www.inceptivemind.com/freiburg-artificial-muscles-made-natural-proteins/23151/", "urlToImage": "https://cdn.inceptivemind.com/wp-content/uploads/2022/02/robotic-arm.jpg", "publishedAt": "2022-02-01T08:18:38Z", "content": "Researchers at the University of Freiburg’s livMatS Cluster of Excellence have succeeded in developing an artificial muscle solely on the basis of natural proteins. The autonomous contractions of the… [+2436 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Capsule Delivery Brings RNA Vaccine Pill One Step Closer - Genetic Engineering & Biotechnology News", "description": "Nucleic acids therapeutics including vaccines are limited to parenteral dosing when patients and clinicians prefer pills that can be orally administered dosage. MIT scientists have synthesized and screened a library of branched hybrid poly (β amino ester) mRN…", "url": "https://www.genengnews.com/topics/drug-discovery/drug-delivery/capsule-delivery-brings-rna-vaccine-pill-one-step-closer/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/01/diana-polekhina-UGWA843r62Y-unsplash-scaled-e1643659787381.jpg", "publishedAt": "2022-02-01T08:00:55Z", "content": "Diseases ranging from cancer to COVID can be effectively treated with RNA and DNA- based drugs. Until now, these large and labile life-saving drugs needed to be injected, posing an obstacle to treatm… [+4841 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "COVID will soon be endemic. This doesn't mean it's harmless or we give up, just that it's part of life - ABC News", "description": "Endemic doesn't mean we drop our guard, surrender to the virus or downgrade the threat it poses to individuals and the community, write Hassan Vally and Catherine Bennett.", "url": "https://www.abc.net.au/news/2022-02-01/covid-will-be-endemic-but-that-doesnt-mean-its-harmless/100795810", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4e17de37144d5f66e96f0ba2fba7cee8?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=182&width=862&height=485", "publishedAt": "2022-02-01T04:39:41Z", "content": "We have experienced many bumps in the road since 2020 and one would have to be extremely brave to predict what the pandemic may throw at us next.\r\nBut in terms of the endgame, many experts believe CO… [+5555 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Burst of radiation and vesicles-based immunotherapy suppress brain cancer growth — ScienceDaily - Verve Times", "description": "Short bursts of radiation therapy dramatically enhanced the efficiency of targeting glioblastomas with natural nanoparticle-based immunotherapy, thus suppressing growth of the deadly tumor, inducing anti-tumor immunity and prolonging survival in anim", "url": "https://vervetimes.com/burst-of-radiation-and-vesicles-based-immunotherapy-suppress-brain-cancer-growth-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-01T04:02:39Z", "content": "Short bursts of radiation therapy dramatically enhanced the efficiency of targeting glioblastomas with natural nanoparticle-based immunotherapy, thus suppressing growth of the deadly tumor, inducing … [+4049 chars]"}, {"source": {"id": null, "name": "PharmaLive"}, "author": "Andrew Humphreys", "title": "Genetically Engineered Dual Receptor T-cells: Double Trouble for Cancer Cells - PharmaLive", "description": "A multinational team of researchers genetically engineered T-lymphocytes to produce dual receptor rejuvenated T-cells, which exhibit antitumor properties with persistent, unlimited availability in vivo.", "url": "https://www.pharmalive.com/genetically-engineered-dual-receptor-t-cells-double-trouble-for-cancer-cells/", "urlToImage": "https://www.pharmalive.com/wp-content/uploads/2022/02/Juntendo-Cancer-Therapeutics-INFOGRAPHIC_.jpeg", "publishedAt": "2022-02-01T03:32:00Z", "content": "­­­RESEARCH NEWS STORY\r\nTokyo, 31st January, 2021\r\nGenetically Engineered Dual Receptor T-cells: Double Trouble for Cancer Cells\r\nScientists have genetically engineered a new type of cell that could … [+5892 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Brian Oliver", "title": "It's summer, so bushfires and COVID collide. 3 ways one affects the other - The Conversation AU", "description": "Both affect the lungs. Both can have serious health consequences in vulnerable populations. Both can have long-term health consequences.", "url": "https://theconversation.com/its-summer-so-bushfires-and-covid-collide-3-ways-one-affects-the-other-169833", "urlToImage": "https://images.theconversation.com/files/437929/original/file-20211216-21-qltypp.jpg?ixlib=rb-1.1.0&rect=0%2C131%2C2737%2C1368&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-01T03:13:00Z", "content": "Its summer in a pandemic. So as Australia opens its borders and COVID case numbers rise, well likely see the interplay of COVID and bushfires.\r\nOur bodies react to SARS-CoV-2, the virus that causes C… [+4523 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Heart attack symptoms in women look different; American Heart Association: part 2 - ABC 7 Chicago", "description": "Heart attack symptoms in women look different; the American Heart Association and Go Red for Women want to spread awareness. READ MORE: https://abc7.ws/3Gd71pq", "url": "https://www.youtube.com/watch?v=1wdXU0UL1f8", "urlToImage": "https://i.ytimg.com/vi/1wdXU0UL1f8/maxresdefault.jpg", "publishedAt": "2022-02-01T03:00:01Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Food-tracking AI system developed to reduce malnutrition in LTC homes - EurekAlert", "description": "New technology could help reduce malnutrition and improve overall health in long-term care homes by automatically recording and tracking how much food residents consume.", "url": "https://www.eurekalert.org/news-releases/941666", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-01T02:03:26Z", "content": "New technology could help reduce malnutrition and improve overall health in long-term care homes by automatically recording and tracking how much food residents consume.\r\nThe smart system, developed … [+2646 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Open-label placebo shows promise as therapy for disorders of gut-brain interaction in children - News-Medical.Net", "description": "Pain-predominant disorders of gut-brain interaction (DGBIs) in children -; such as functional abdominal pain (FAP) and irritable bowel syndrome (IBS)-; can lead to disabling symptoms, poor quality of life and high use of health care resources.", "url": "https://www.news-medical.net/news/20220131/Open-label-placebo-shows-promise-as-therapy-for-disorders-of-gut-brain-interaction-in-children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2022-02-01T01:14:00Z", "content": "Pain-predominant disorders of gut-brain interaction (DGBIs) in children -; such as functional abdominal pain (FAP) and irritable bowel syndrome (IBS)-; can lead to disabling symptoms, poor quality of… [+2353 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Complications and mortality of non-typhoidal salmonella invasive disease: a global systematic review and meta-analysis - The Lancet", "description": "Complications were frequent among individuals with non-typhoidal salmonella invasive\ndisease and approximately 15% of patients died. Clinicians, especially in African\ncountries, should be aware of non-typhoidal salmonella invasive disease as a cause\nof severe…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00615-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/d1258e10-cb67-4d27-b521-16f801729e65/gr2.jpg", "publishedAt": "2022-01-31T23:35:44Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Womensagenda.com.au"}, "author": null, "title": "Depression and anxiety spiked among pregnant women during pandemic: UK research - Women's Agenda", "description": "Rates of depression and anxiety spiked during the COVID-19 pandemic among expectant mothers, a new report has found.", "url": "https://womensagenda.com.au/latest/depression-and-anxiety-spiked-among-pregnant-women-during-pandemic-uk-research/", "urlToImage": "https://womensagenda.com.au/wp-content/uploads/2022/02/Untitled-design-13.png", "publishedAt": "2022-01-31T23:23:42Z", "content": "Rates of depression and anxiety spiked during the COVID-19 pandemic among expectant mothers, a new report from the University of Essex has found.\r\nThe study revealed an increase in reported rates of … [+2758 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers identify genetic cause of rare interstitial lung disease in a young child - News-Medical.Net", "description": "New research from Washington University School of Medicine in St. Louis has solved the medical mystery of why a 2-year-old child — seemingly healthy at birth — succumbed to an undiagnosed, rare illness.", "url": "https://www.news-medical.net/news/20220131/Researchers-identify-genetic-cause-of-rare-interstitial-lung-disease-in-a-young-child.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-01-31T23:15:00Z", "content": "New research from Washington University School of Medicine in St. Louis has solved the medical mystery of why a 2-year-old child — seemingly healthy at birth — succumbed to an undiagnosed, rare illne… [+6460 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Anna Mason", "title": "Avian Flu detected in geese on hobby farm outside Halifax, owner ‘devastated’ - The News Motion", "description": "The Canadian Food Inspection Agency has confirmed the death of a Canada Goose as a result of Avian Influenza — H5N1.The CFIA is now advising poultry farmers to be vigilant and to apply biosecurity measures at all times.Since the confirmatio", "url": "https://thenewsmotion.com/avian-flu-detected-in-geese-on-hobby-farm-outside-halifax-owner-devastated/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2019/07/canada-dgee-e1562165238365.jpg?quality=85&strip=all&crop=0px,79px,720px,380px&resize=720,379", "publishedAt": "2022-01-31T23:05:35Z", "content": "The Canadian Food Inspection Agency has confirmed the death of a Canada Goose as a result of Avian Influenza H5N1.\r\nThe CFIA is now advising poultry farmers to be vigilant and to apply biosecurity me… [+2162 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 By The Numbers: Coronavirus data in Hampton Roads, 1/31/22 - 13News Now", "description": "13News Now Dan Kennedy breaks down the latest metrics and coronavirus health trends in Hampton Roads and Virginia as of Jan. 31, 2022.Subscribe: https://www....", "url": "https://www.youtube.com/watch?v=wRRI5mYOx28", "urlToImage": "https://i.ytimg.com/vi/wRRI5mYOx28/hqdefault.jpg", "publishedAt": "2022-01-31T22:16:48Z", "content": null}, {"source": {"id": null, "name": "TCTMD"}, "author": "Caitlin E. Cox", "title": "SCAI SHOCK: Update Refines Cardiogenic Shock Classification - TCTMD", "description": "The newly tweaked expert consensus is meant to be concise and to provide even more consistency across the diverse field.", "url": "https://www.tctmd.com/news/scai-shock-update-refines-cardiogenic-shock-classification", "urlToImage": "https://s3.amazonaws.com/prod.tctmd.com/public/2022-01/SCAI%20SHOCK%20Update%20Refines%20Cardiogenic%20Shock%20Classification.jpg", "publishedAt": "2022-01-31T21:45:00Z", "content": "First released in 2019, the Society for Cardiovascular Angiography and Interventions (SCAI) cardiogenic shock categories have gotten a rethink, one that adds nuance to aid decision-making and incorpo… [+8580 chars]"}, {"source": {"id": null, "name": "InDaily"}, "author": null, "title": "Omicron subvariant 'more transmissable', 'immune-evasive' - InDaily", "description": "The BA.2 subvariant of the Omicron coronavirus variant which has quickly taken over in Denmark is more transmissible than the more common BA.1 and more able to infect vaccinated people, a Danish study has concluded.", "url": "https://indaily.com.au/news/2022/02/01/omicron-subvariant-more-transmissable-immune-evasive/", "urlToImage": "https://indaily.com.au/wp-content/uploads/2022/02/20211129001601135549-original-scaled.jpg", "publishedAt": "2022-01-31T21:18:35Z", "content": "Omicron subvariant 'more transmissable', 'immune-evasive'\r\nThe BA.2 subvariant of the Omicron coronavirus variant which has quickly taken over in Denmark is more transmissible than the more common BA… [+2849 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Molly Chiu", "title": "Novel neurodevelopmental disorder associated with mutations or deletions of PAX5 gene - Medical Xpress", "description": "Researchers led by a team at Baylor College of Medicine have identified a novel neurodevelopmental disorder associated with mutations or deletions affecting a gene called PAX5. Their findings are published in the journal Human Mutation.", "url": "https://medicalxpress.com/news/2022-01-neurodevelopmental-disorder-mutations-deletions-pax5.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/15-brain.jpg", "publishedAt": "2022-01-31T21:05:58Z", "content": "Researchers led by a team at Baylor College of Medicine have identified a novel neurodevelopmental disorder associated with mutations or deletions affecting a gene called PAX5. Their findings are pub… [+3062 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "How long after COVID-19 infection can I get a booster? Here's what ATAGI recommends - ABC News", "description": "What happens when you have a booster or vaccination scheduled when you're sick with COVID or soon after you recover?", "url": "https://www.abc.net.au/news/2022-02-01/covid-booster-after-infection-how-long/100787512", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/7a3092159b83cfa1f7d0fa58cf253f1f?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=357&width=862&height=485", "publishedAt": "2022-01-31T18:38:43Z", "content": "In the past month, more than 2 million Australians have tested positive for COVID-19, but the explosion in infections has coincided with the widening availability of booster shots. \r\nAs of yesterday,… [+3359 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "The West Australian", "title": "COVID-19: Rich countries should donate half their vaccine stock, new research claims - The West Australian", "description": "Rich countries should donate half of their COVID vaccine supply to poorer nations, new research has found— or face devastating new virus strains.", "url": "https://thewest.com.au/news/coronavirus/covid-19-rich-countries-should-donate-half-their-vaccine-stock-new-research-claims-c-5511900", "urlToImage": "https://images.thewest.com.au/publication/C-5511900/64560c2bf4e91cac4f4e9b1a12b2abfc5d853626-16x9-x0y0w798h449.jpg?imwidth=1200", "publishedAt": "2022-01-31T18:00:00Z", "content": "Rich countries should donate half of their COVID vaccine supply to poorer nations, new research has found or face devastating new virus strains.\r\nAccording to a new University of Hong Kong study, hig… [+1813 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study assesses the antibody response to additional dose of COVID-19 vaccine in transplant recipients - News-Medical.Net", "description": "A study has begun to assess the antibody response to an additional dose of a COVID-19 mRNA vaccine in kidney and liver transplant recipients, either alone or with a concurrent reduction in immunosuppressive medication.", "url": "https://www.news-medical.net/news/20220131/Study-assesses-the-antibody-response-to-additional-dose-of-COVID-19-vaccine-in-transplant-recipients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/antibody_in_pink_and_red_background_selective_focus_3d_art_-_Mirror-Images_A1_71b890c58eb74b42a6490cfe1b003dce-620x480.jpg", "publishedAt": "2022-01-31T17:32:00Z", "content": "A study has begun to assess the antibody response to an additional dose of a COVID-19 mRNA vaccine in kidney and liver transplant recipients, either alone or with a concurrent reduction in immunosupp… [+3845 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Nina Cosdon", "title": "Genome Mapping Reveals Key Structural Variants Impacting COVID-19 Disease Severity - Contagionlive.com", "description": "The first study to use optical genome mapping to assess severely ill COVID-19 patients identified 7 key structural variants.", "url": "https://www.contagionlive.com/view/genome-mapping-reveals-key-structural-variants-impacting-covid-19-disease-severity", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/ce45b7cab60b48e692ee4bd2b66c20845fb7182e-3600x2400.jpg?fit=crop&auto=format", "publishedAt": "2022-01-31T17:03:58Z", "content": "One of the greatest mysteries of COVID-19 infection is the varying nature of disease severity; COVID-19 causes mortality in some yet no symptoms in others.\r\nOne study, published in iScience, found ra… [+2083 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Nancy Fliesler", "title": "Cerebral palsy has genetic cause in up to one quarter of patients - Medical Xpress", "description": "Cerebral palsy, or CP, has widely been viewed as the result of perinatal oxygen deprivation or other birth-related factors like prematurity.", "url": "https://medicalxpress.com/news/2022-01-cerebral-palsy-genetic-quarter-patients.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/genetics.jpg", "publishedAt": "2022-01-31T15:10:01Z", "content": "Cerebral palsy, or CP, has widely been viewed as the result of perinatal oxygen deprivation or other birth-related factors like prematurity.\r\n\"In CP, the first thing that comes to many physicians' mi… [+6251 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Lower socioeconomic status causes more post-heart surgery health risks - Open Access Government", "description": "Patients with heart disease who come from disadvantaged communities experience more complications after their surgery", "url": "https://www.openaccessgovernment.org/socioeconomic-heart-surgery/128593/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2022/01/dreamstime_m_178507180.jpg", "publishedAt": "2022-01-31T15:05:52Z", "content": "Research finds that patients with mitral valve disease who live in disadvantaged communities are more likely to experience complications and are at higher risk for death  after surgery than those wit… [+4271 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Emily Head", "title": "First global analysis of rare high cholesterol disorder shows vast disparities - Medical Xpress", "description": "Homozygous familial hypercholesterolaemia is often diagnosed late and is under-treated, causing hotspots of cardiovascular disease risk worldwide.", "url": "https://medicalxpress.com/news/2022-01-global-analysis-rare-high-cholesterol.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/first-global-analysis.jpg", "publishedAt": "2022-01-31T13:30:01Z", "content": "Homozygous familial hypercholesterolaemia is often diagnosed late and is under-treated, causing hotspots of cardiovascular disease risk worldwide.\r\nAccording to a new study in The Lancet, carried out… [+4080 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Genes and Environment Combine To Produce the Complexity of Autism - Technology Networks", "description": "A UNIGE team demonstrates how genes and environment interact in autistic disorders, thus explaining the vast variability of the condition’s symptoms. <br /><br />", "url": "https://www.technologynetworks.com/neuroscience/news/how-genes-and-environment-combine-to-produce-the-complexity-of-autism-358053", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/358053/how-genes-and-environment-combine-to-produce-the-complexity-of-autism-358053-640x360.jpg?cb=20220131", "publishedAt": "2022-01-31T10:52:58Z", "content": "A UNIGE team demonstrates how genes and environment interact in autistic disorders, thus explaining the vast variability of the conditions symptoms. \r\nPeople with autism spectrum disorders all have c… [+5248 chars]"}, {"source": {"id": null, "name": "Plainsmenpost.com"}, "author": "George Holan", "title": "A 31-year-old woman checked her body after reading a book about cancer, then was diagnosed weeks later - The Plainsmen Post", "description": "Jade Hills, 31, checked out her breasts after reading her friend's book about her journey with cancer and, to her surprise, discovered two noticeable lumps.", "url": "https://plainsmenpost.com/a-31-year-old-woman-checked-her-body-after-reading-a-book-about-cancer-then-was-diagnosed-weeks-later/", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26092796.ece/ALTERNATES/s1200/0_book-2.jpg", "publishedAt": "2022-01-31T09:04:38Z", "content": "A woman who examined her body after reading a friend’s book on breast cancer received the same diagnosis just a few weeks later. \r\n Jade Hills, 31, had just graduated as a nurse, but she never though… [+3615 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Cameron Webb", "title": "Insect repellents work – but there are other ways to beat mosquitoes without getting sticky - The Conversation AU", "description": "Summer is no fun when mosquitoes are biting. Insect repellent creams, sprays, and lotions are safe and effective but there are alternatives. Here’s what works and what doesn’t!", "url": "https://theconversation.com/insect-repellents-work-but-there-are-other-ways-to-beat-mosquitoes-without-getting-sticky-171805", "urlToImage": "https://images.theconversation.com/files/443310/original/file-20220131-15248-1b08evd.jpg?ixlib=rb-1.1.0&rect=17%2C287%2C5964%2C2982&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-31T05:39:31Z", "content": "Summer can be hot and sticky. And insect repellent creams, lotions, and sprays can make it stickier. \r\nStopping mosquito bites is key to avoiding itchy bumps and mosquito-borne disease. Thankfully, t… [+5210 chars]"}]}