{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Mor-tv.com"}, "author": null, "title": "Study: How often you wash your dog's bowl can affect your health, too - MOR-TV.com", "description": "The U.S. Food and Drug Administration has guidelines for dog dish hygiene, but this study looked into how many pet owners adhere to them and what can happen when they aren't followed.", "url": "https://www.mor-tv.com/article/how-often-you-wash-your-dog-s-bowl-can-affect-your-health-too-study-says/39682574", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/hypatia-h-a5894fdfcd4f7aabb8d5832d5886daf8-h-2db9f6131ccace4f5a564565fea050a4-1649627868.jpg?crop=1.00xw:0.844xh;0,0.134xh&resize=1200:*", "publishedAt": "2022-04-10T22:09:00Z", "content": "How we feed our pets, store their food and wash their dishes can have negative health consequences if not done properly for both humans and animals.\r\nThere have been multiple outbreaks of illnesses a… [+5109 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson", "title": "The next leap in coronavirus vaccine development could be a nasal spray - The Washington Post", "description": "Sobered by the way the omicron variant tore through the population -- including the vaccinated -- some scientists think the next coronavirus vaccine should be a spray up the nose.", "url": "https://www.washingtonpost.com/health/2022/04/10/nasal-covid-vaccine/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IVNIWTFEOMI6ZBRIHWSPVD4HCQ.jpg&w=1440", "publishedAt": "2022-04-10T22:01:13Z", "content": "As the omicron variant of the coronavirus moved lightning-fast around the world, it revealed an unsettling truth. The virus had gained a stunning ability to infect people, jumping from one persons no… [+11982 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": null, "title": "Post-COVID fatigue: When should you worry and what to do about it – expert reveals - Revyuh", "description": "Fatigue is more than just being tired or drowsy. It's a feeling of tiredness that remains despite rest or adequate sleep. It's most likely due to our", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/post-covid-fatigue-when-should-you-worry-and-what-to-do-about-it-expert-reveals/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/04/Post-COVID-fatigue-When-should-you-worry-and-what-to-do-about-it-expert-reveals.jpg", "publishedAt": "2022-04-10T21:30:10Z", "content": "Fatigue is more than just being tired or drowsy. It’s a feeling of tiredness that remains despite rest or adequate sleep. \r\nIt’s most likely due to our bodies’ powerful immune response to the coronav… [+3872 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Richard Bethlehem, Jakob Seidlitz, The Conversation", "title": "Scientists discover how the brain grows and shrinks as you age for the first time - Inverse", "description": "The brain charts can constantly be updated, expanded, and refined. If brain scanning becomes a normal part of pediatric practice, we hope to be ready with the necessary tools.", "url": "https://www.inverse.com/mind-body/brain-charts-first-scan", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/4/8/ec14fab0-f6d1-4978-bfd5-f9487389f4df-gettyimages-1191709886.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-04-10T21:00:25Z", "content": "For decades, \r\ngrowth\r\n charts have been used by pediatricians as reference tools. The charts allow health professionals to plot and measure a childs height and weight from birth to young adulthood. … [+5734 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Consumption of healthy plant-based foods linked with lower risk of developing type 2 diabetes - News-Medical.Net", "description": "New research published in Diabetologia (the journal of the European Association for the Study of Diabetes [EASD]) finds that the consumption of healthy plant-based foods, including fruits, vegetables, nuts, coffee, and legumes, is associated with a lower risk…", "url": "https://www.news-medical.net/news/20220410/Consumption-of-healthy-plant-based-foods-linked-with-lower-risk-of-developing-type-2-diabetes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Insulin-620x480.jpg", "publishedAt": "2022-04-10T20:46:00Z", "content": "New research published in Diabetologia (the journal of the European Association for the Study of Diabetes [EASD]) finds that the consumption of healthy plant-based foods, including fruits, vegetables… [+6959 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Living with COVID: Experts divided on UK plan as cases soar - Japan Today", "description": "For many in the UK, the pandemic may as well be over. Mask requirements have been dropped. Free mass testing is a thing of the past. And for the first time since spring 2020, people can go abroad for holidays without ordering tests or filling out lengthy form…", "url": "https://japantoday.com/category/world/living-with-covid-experts-divided-on-uk-plan-as-cases-soar", "urlToImage": null, "publishedAt": "2022-04-10T20:40:00Z", "content": "For many in the UK, the pandemic may as well be over.\r\nMask requirements have been dropped. Free mass testing is a thing of the past. And for the first time since spring 2020, people can go abroad fo… [+5534 chars]"}, {"source": {"id": null, "name": "Men's Health"}, "author": null, "title": "Why A Workout Can Subdue Depression For Up To 75 Minutes - Men's Health", "description": "Moving your body to alleviate mental malaise is a well-established treatment in tackling poor mental health. But while numerous studies have found raising a sweat to be broadly effective at helping bust the blues, just how impactful is a single workout in boo…", "url": "https://www.menshealth.com.au/why-a-workout-can-subdue-depression-for-up-to-75-minutes/", "urlToImage": "https://www.menshealth.com.au/wp-content/uploads/2022/04/fitness-and-mental-health.jpg", "publishedAt": "2022-04-10T20:37:47Z", "content": "Moving your body to alleviate mental malaise is a well-established treatment in tackling poor mental health. But while numerous studies have found raising a sweat to be broadly effective at helping b… [+3649 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers provide insight into anatomical position of the sacral mesh during laparoscopic procedure - News-Medical.Net", "description": "A May 2022 study published in the Diseases of the Colon and Rectum zooms in on the importance of anatomy. Dr. Argeny and colleagues of the Medical University of Vienna, Austria, provide insight into the anatomical position of the mesh in relation to the sacru…", "url": "https://www.news-medical.net/news/20220410/Researchers-provide-insight-into-anatomical-position-of-the-sacral-mesh-during-laparoscopic-procedure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2022-04-10T20:36:00Z", "content": "A May 2022 study published in the Diseases of the Colon and Rectum zooms in on the importance of anatomy. Dr. Argeny and colleagues of the Medical University of Vienna, Austria, provide insight into … [+1492 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Maja Husaric, Vasso Apostolopoulos", "title": "Should I get the 2022 flu vaccine? And how effective is it? - The Conversation", "description": "Far from a mild disease, the flu can cause serious illness and death, particularly among children and older age groups. The flu vaccine isn’t perfect, but it’s the best way to protect yourself.", "url": "https://theconversation.com/should-i-get-the-2022-flu-vaccine-and-how-effective-is-it-179309", "urlToImage": "https://images.theconversation.com/files/456790/original/file-20220407-24494-8zi1or.jpg?ixlib=rb-1.1.0&rect=0%2C0%2C6720%2C3360&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-04-10T20:08:17Z", "content": "Free influenza (flu) vaccines are now available for eligible groups, subject to local supply arrangements, with health authorities encouraging booking in from mid April. \r\nFor those who arent eligibl… [+5727 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "False sense of safety may cause feelings of invulnerability, study finds — ScienceDaily - Verve Times", "description": "People may feel less vulnerable and take fewer safety precautions about COVID-19 when they are with, or even just think about, their friends instead of acquaintances or strangers, according to research published by the American Psychological Associat", "url": "https://vervetimes.com/false-sense-of-safety-may-cause-feelings-of-invulnerability-study-finds-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-10T20:04:22Z", "content": "People may feel less vulnerable and take fewer safety precautions about COVID-19 when they are with, or even just think about, their friends instead of acquaintances or strangers, according to resear… [+4587 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Insights into the dynamic ultrastructure of the heart — ScienceDaily - Verve Times", "description": "What happens below the cellular level when the heart contracts and relaxes has long been unexplored. Thanks to new ultra-high-resolution electron microscopy techniques, scientists can now watch the heart beating -- almost at a molecular level. Resear", "url": "https://vervetimes.com/insights-into-the-dynamic-ultrastructure-of-the-heart-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-10T18:20:42Z", "content": "What happens below the cellular level when the heart contracts and relaxes has long been unexplored. Thanks to new ultra-high-resolution electron microscopy techniques, scientists can now watch the h… [+2537 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Higher Blood Fats More Harmful Than Previously Thought – Can Damage Muscle Cells - SciTechDaily", "description": "Increased levels of blood fats in people with type 2 diabetes and obesity are more harmful than previously thought, a new study has found. In patients with metabolic diseases, elevated fat levels in the blood create stress in muscle cells — a reaction to chan…", "url": "https://scitechdaily.com/higher-blood-fats-more-harmful-than-previously-thought-can-damage-muscle-cells/", "urlToImage": "https://scitechdaily.com/images/Blood-Fat-Cells.jpg", "publishedAt": "2022-04-10T17:38:58Z", "content": "Increased levels of blood fats in people with type 2 diabetes and obesity are more harmful than previously thought, a new study has found. \r\nIn patients with metabolic diseases, elevated fat levels i… [+3307 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "How to sleep: Lack of exercise ‘is associated with insomnia’ – exercise tips - Verve Times", "description": "The organisation says: “Moderate aerobic exercise can help relieve other symptoms associated with insomnia, too.“For individuals with comorbid insomnia and anxiety, it can significantly lower pre-sleep anxiety, reducing the anxious thoughts that make", "url": "https://vervetimes.com/how-to-sleep-lack-of-exercise-is-associated-with-insomnia-exercise-tips/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1594034.jpg", "publishedAt": "2022-04-10T16:26:21Z", "content": "The organisation says: Moderate aerobic exercise can help relieve other symptoms associated with insomnia, too.\r\nFor individuals with comorbid insomnia and anxiety, it can significantly lower pre-sle… [+1155 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Exercise can lower risk of getting bowel cancer: Study - The Siasat Daily", "description": "London: Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study. The research was published in the journal, 'International Journal of Cancer'. It has been shown that physical activity causes the cancer-…", "url": "https://www.siasat.com/exercise-can-lower-risk-of-getting-bowel-cancer-study-2306347/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/11/exercise-_nov27.jpg", "publishedAt": "2022-04-10T15:28:00Z", "content": "London: Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study.\r\nThe research was published in the journal, ‘International Journal of Cancer’… [+4098 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Maddy Biddulph", "title": "How to follow a vegan diet for weight loss - Livescience.com", "description": "Thinking about adopting a vegan diet for weight loss? We look at how a plant-based plan could help you to get lean", "url": "https://www.livescience.com/how-to-follow-a-vegan-diet-for-weight-loss", "urlToImage": "https://cdn.mos.cms.futurecdn.net/koh42ZHJLaPs9udFQ8SHNc-1200-80.jpg", "publishedAt": "2022-04-10T14:16:45Z", "content": "Eating a balanced diet full of lots of fruit and vegetables is one of the best ways to stay well and maintain a healthy weight. So adopting a vegan diet for weight loss might appeal if you’re looking… [+7368 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers say AI-based approach can predict when someone will have cardiac arrest - Devdiscourse", "description": "A new artificial-intelligence-based approach can predict if and when a patient could die of cardiac arrest, a recent study led by researchers at John Hopkins University has found.", "url": "https://www.devdiscourse.com/article/science-environment/1998219-researchers-say-ai-based-approach-can-predict-when-someone-will-have-cardiac-arrest", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_04_2022_11_14_02_0338592.jpg?width=920&format=jpeg", "publishedAt": "2022-04-10T11:14:23Z", "content": "A new artificial-intelligence-based approach can predict if and when a patient could die of cardiac arrest, a recent study led by researchers at John Hopkins University has found. The technology, bui… [+3343 chars]"}, {"source": {"id": null, "name": "Body and Soul"}, "author": "Holly Berckelman", "title": "Brace yourself: Deltacron cases confirmed in NSW and QLD - Body+Soul", "description": "Brace yourself: Deltacron cases confirmed in NSW and QLD", "url": "https://www.bodyandsoul.com.au/health/health-news/brace-yourself-deltacron-cases-confirmed-in-nsw-and-qld/news-story/05b355f8d1bb00bb8f964ee2c8dcfbca", "urlToImage": "https://cdn.newsapi.com.au/image/v1/2c53caf0dab645bb7988536c92f2969c", "publishedAt": "2022-04-10T11:11:07Z", "content": "Deltacron made headlines after appearing in Europe in mid-February, and now it's in Australia.The Deltacron Covid variant has arrived in Australia, with cases confirmed in New South Wales and Queensl… [+2962 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The #1 Best Fruit To Keep Your Bones From Aging, New Study Says — Eat This Not That - Eat This, Not That", "description": "Fruit is a great way to curb sugary cravings, but this fruit in particular has even more long-term positive effects for the body.", "url": "http://www.eatthis.com/news-best-fruit-bones-aging/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/04/fruit-shopping.jpg?quality=82&strip=all", "publishedAt": "2022-04-10T10:00:32Z", "content": "When you eat fruit, you might be aiming to satisfy a sweet hunger-related craving or be looking for a quick and healthy snack.\r\nWhile apples and oranges are always a delicious choicenot to mention gr… [+2636 chars]"}, {"source": {"id": null, "name": "LancsLive"}, "author": "Fatima Aziz", "title": "Covid daily, April 10 - Thousands of virus patients given cutting edge drugs, NHS patient care at major risk - Lancs Live", "description": "The latest Covid headlines today", "url": "https://www.lancs.live/news/uk-world-news/covid-daily-april-10-thousands-23649669", "urlToImage": "https://i2-prod.lancs.live/incoming/article23649686.ece/ALTERNATES/s1200/0_266243108.jpg", "publishedAt": "2022-04-10T07:24:53Z", "content": "A significant step has been taken in the battle against coronavirus with new drugs being trialled on thousands of patients.\r\nResearch shows the drugs have cut hospitalisations and deaths by almost 90… [+7684 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study finds changes in B-cells of women with postpartum depression - Devdiscourse", "description": "A new study has looked at multiple levels of biology within women with postpartum depression (PPD) to see how women with the condition differ from those without it.", "url": "https://www.devdiscourse.com/article/science-environment/1997987-study-finds-changes-in-b-cells-of-women-with-postpartum-depression", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_04_2022_07_22_27_6093326.jpg?width=920&format=jpeg", "publishedAt": "2022-04-10T07:22:48Z", "content": "A new study has looked at multiple levels of biology within women with postpartum depression (PPD) to see how women with the condition differ from those without it. The study was published in the jou… [+3296 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Japanese encephalitis hits NT feral pigs - 7NEWS", "description": "A number of feral pigs in the Northern Territory have been infected with Japanese encephalitis, health authorities say.", "url": "https://7news.com.au/news/nt/japanese-encephalitis-hits-nt-feral-pigs-c-6377598", "urlToImage": "https://images.7news.com.au/publication/C-6377598/27a787b7a3fc7c68c2c34db1d98d23fe56ea5b59-16x9-x0y75w800h450.jpg?imwidth=1200", "publishedAt": "2022-04-10T04:52:30Z", "content": "Health authorities have detected mosquito-borne Japanese encephalitis in feral pigs in the Northern Territory, raising fears for residents in nearby areas.\r\nMore than 30 people across Australia have … [+1553 chars]"}, {"source": {"id": null, "name": "Mamamia"}, "author": "Anonymous", "title": "\"I can drink coffee\": The 5 lies I’ve told myself about having Irritable Bowel Syndrome. - Mamamia", "description": "A Mamamia writer shares the everyday reality of living with irritable bowel syndrome, including how she manages the symptoms.", "url": "https://www.mamamia.com.au/symptoms-of-irritable-bowel-syndrome/", "urlToImage": "https://new-cdn.mamamia.com.au/mamamia-pwa.appspot.com/cms_images/variations/1200x628.2722513089005-406325051470.jpg?bypass=1", "publishedAt": "2022-04-10T04:30:02Z", "content": "3. It’s all in my head.\r\nSometimes it’s just easier to imagine that I am making this condition up. \r\nThere are days where I have no symptoms and I’m free to do what I want. These days of freedom lull… [+2214 chars]"}, {"source": {"id": null, "name": "KPCnews.com"}, "author": "Dr. Terry Gaff", "title": "'Human challenge' helps science better understand COVID immune response - KPCnews.com", "description": "One of the things I did not expect is that scientists would actually give the SARS-CoV-2 virus to healthy people on purpose to better understand what has happened during the", "url": "https://www.kpcnews.com/columnists/article_faed916f-89a1-55e8-adea-b1639c3df59a.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kpcnews.com/content/tncms/custom/image/1aff2978-bfeb-11e7-b7f9-03867e016f52.jpg?resize=600%2C364", "publishedAt": "2022-04-10T04:00:00Z", "content": "One of the things I did not expect is that scientists would actually give the SARS-CoV-2 virus to healthy people on purpose to better understand what has happened during the pandemic. But the first C… [+4129 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Prostate cancer: ‘Groundbreaking’ radiotherapy can ‘protect healthy tissue’ - Verve Times", "description": "It is estimated that over 14,000 men in the UK are walking around with undiagnosed prostate cancer. Getting tested for the condition might bring with it the concern of cancer treatment and its sometimes dire side-effects. Radiotherapy works by zappin", "url": "https://vervetimes.com/prostate-cancer-groundbreaking-radiotherapy-can-protect-healthy-tissue/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1593840.jpg", "publishedAt": "2022-04-10T03:18:27Z", "content": "It is estimated that over 14,000 men in the UK are walking around with undiagnosed prostate cancer. Getting tested for the condition might bring with it the concern of cancer treatment and its someti… [+4093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Keto diet for weight loss: Foods to eat and what you should avoid - Times of India", "description": "In order to lose weight, we all have tried our hands in different diet and fitness regimes. Restrictive, stringent meal plans either help us achieve our goals or backfire once we fail to be consistent. One such diet programme is Keto.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/keto-diet-for-weight-loss-foods-to-eat-and-what-you-should-avoid/photostory/90732587.cms", "urlToImage": "https://static.toiimg.com/photo/90732608.cms", "publishedAt": "2022-04-10T01:30:00Z", "content": "As we have now explored ketosis and how it helps in weight loss, you may still have certain doubts about the kind of food you can eat and should avoid while on a keto diet. That said, here are some o… [+377 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Turns Out an Avo a Day Can Keep the Doctor Away - Lifehacker Australia", "description": "Eating two or more servings of avocado a week may cut your risk of cardiovascular disease by 16%, according to...", "url": "https://www.lifehacker.com.au/2022/04/turns-out-an-avo-a-day-can-keep-the-doctor-away/", "urlToImage": "https://imgix.lifehacker.com.au/content/uploads/sites/4/2022/04/08/GettyImages-1168149641.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-10T00:30:00Z", "content": "Eating two or more servings of avocado a week may cut your risk of cardiovascular disease by 16%, according to a new study.\r\nResearchers at Harvard University analysed data from two large US studies:… [+3964 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "We May Have Found The Brain Area That Controls Pregnancy Cravings - ScienceAlert", "description": "We know that pregnancy food cravings can include just about anything, but how do they get started? New research in mice identifies the part of the brain that seems to control these urges, which in future could help ensure that human pregnancies are a", "url": "https://www.sciencealert.com/scientists-have-identified-the-bit-of-your-brain-that-control-pregnancy-cravings", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/IceCresmSundaeWithPickleSpears_1024.jpg", "publishedAt": "2022-04-09T23:04:22Z", "content": "We know that pregnancy food cravings can include just about anything, but how do they get started? New research in mice identifies the part of the brain that seems to control these urges, which in fu… [+3124 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "UK study finds symptoms from Omicron 2 days shorter than from Delta - CGTN", "description": "Disease caused by the Omicron variant is on average around two days shorter than the Delta variant, a large study of vaccinated Britons who kept a smartphone log of their COVID-19 symptoms after breakthrough infections has shown.", "url": "https://news.cgtn.com/news/2022-04-10/UK-study-finds-symptoms-from-Omicron-2-days-shorter-than-from-Delta-196UhALVoA0/index.html", "urlToImage": "https://news.cgtn.com/news/2022-04-10/UK-study-finds-symptoms-from-Omicron-2-days-shorter-than-from-Delta-196UhALVoA0/img/ee5bcc30c35c45889b0cd3b2cf2e015e/ee5bcc30c35c45889b0cd3b2cf2e015e-750.png", "publishedAt": "2022-04-09T21:56:15Z", "content": "Disease caused by the Omicron variant is on average around two days shorter than the Delta variant, a large study of vaccinated Britons who kept a smartphone log of their COVID-19 symptoms after brea… [+2074 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "CRISPR gene editing reveals biological mechanism behind common blood disorder - National Herald", "description": "The study, published in the journal Blood, will help researchers investigate new therapeutic approaches for one of the world's most devastating genetic blood disorders, sickle cell disease", "url": "https://www.nationalheraldindia.com/science-and-tech/crispr-gene-editing-reveals-biological-mechanism-behind-common-blood-disorder", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2018-11%2Fd096d882-d2b3-4a5f-8299-bf1ec128b609%2F46487007_403.jpg?rect=0%2C18%2C940%2C494&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-04-09T17:00:44Z", "content": "\"Interestingly, when children are born, they do not show disease symptoms at first, even if they have the mutations, because, at that stage, they are still expressing foetal globin and not yet adult … [+840 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Lauren Aratani", "title": "Millions of bird deaths as US hit by avian flu outbreak - The Guardian", "description": "US officials believe nearly 24m poultry birds, mostly chickens and turkeys, have died of flu since virus strain identified in February", "url": "https://amp.theguardian.com/world/2022/apr/09/bird-flu-millions-birds-avian-influenza", "urlToImage": null, "publishedAt": "2022-04-09T16:10:00Z", "content": "Bird fluUS officials believe nearly 24m poultry birds, mostly chickens and turkeys, have died of flu since virus strain identified in February\r\nMillions of birds have died in the US in recent weeks, … [+3679 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Coffee Beyond Boundaries: Asia's first cafe in Kolkata run, managed by HIV-positive staff - ANI News", "description": "Kolkata (West Bengal) [India], April 9 (ANI): A cafe in South Kolkata, run and managed by HIV-positive staff members, is giving people working there hope and opportunities to earn a living. It is Asia's first such cafe that is run by HIV-positive staff member…", "url": "https://www.aninews.in/news/national/general-news/coffee-beyond-boundaries-asias-first-cafe-in-kolkata-run-managed-by-hiv-positive-staff20220409195024", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/425607cf-8e4d-4c0e-a7ae-b00304030ee82022040913340420220409141955-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-09T14:20:00Z", "content": "Kolkata (West Bengal) [India], April 9 (ANI): A cafe in South Kolkata, run and managed by HIV-positive staff members, is giving people working there hope and opportunities to earn a living. It is Asi… [+1997 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Researchers Discover New Cell Type That May Affect Human Lung Disease. Read Here | Mint - Mint", "description": "The scientists showed that RASCs have stem-cell-like properties enabling them to regenerate other cells that are essential for the normal functioning of alveoli", "url": "https://www.livemint.com/science/health/researchers-discover-new-cell-type-that-may-affect-human-lung-disease-read-here-11649510449508.html", "urlToImage": "https://images.livemint.com/img/2022/04/09/600x338/pollution2-kCE--621x414@LiveMint_1649510730004.jpg", "publishedAt": "2022-04-09T13:37:25Z", "content": "PHILADELPHIA :\r\nA research published in journal 'Nature' has informed that researchers have discovered a new cell type that resides deep within human lungs, the cytoplasm mass might affect lung disea… [+3397 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID Can Infect Pacemaker Cells That Maintain the Heart’s Rhythm, Setting Off a Self-Destruction Process - SciTechDaily", "description": "Are COVID-19-linked arrhythmias caused by viral damage to the heart’s pacemaker cells? The SARS-CoV-2 virus can infect specialized pacemaker cells that maintain the heart’s rhythmic beat, setting off a self-destruction process within the cells, according to a…", "url": "https://scitechdaily.com/covid-can-infect-pacemaker-cells-that-maintain-the-hearts-rhythm-setting-off-a-self-destruction-process/", "urlToImage": "https://scitechdaily.com/images/Heart-Cardiology-Concept.gif", "publishedAt": "2022-04-09T13:31:57Z", "content": "Are COVID-19-linked arrhythmias caused by viral damage to the heart’s pacemaker cells?\r\nThe SARS-CoV-2 virus can infect specialized pacemaker cells that maintain the heart’s rhythmic beat, setting of… [+4681 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Precaution shots help re-expose bodys immune system to immunising antigen, prevent reinfection - News9 LIVE", "description": "Apart from the BA.2 that is a sublineage of the highly contagious Omicron, there are many...", "url": "https://www.news9live.com/health/covid-19/precaution-shots-help-re-expose-bodys-immune-system-to-immunising-antigen-prevent-reinfection-163748", "urlToImage": "https://media.news9live.com/h-upload/2022/04/09/283756-pti02112022000275b1111zon.jpg", "publishedAt": "2022-04-09T13:06:27Z", "content": "Most people who catch COVID-19 are said to develop a certain amount of immunity that keeps them safe from possible reinfection, at least for about three months to five years, reveals an October 2021 … [+2830 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Shanti Das", "title": "Revealed: autism charity chief has links to anti-vaccine movement - The Guardian", "description": "Group received lottery funds while promoting unproven treatments", "url": "https://amp.theguardian.com/society/2022/apr/09/autism-charity-chief-has-links-to-anti-vaccine-movement", "urlToImage": null, "publishedAt": "2022-04-09T12:00:00Z", "content": "Vaccines and immunisationGroup received lottery funds while promoting unproven treatments\r\nA British autism charity that received hundreds of thousands of pounds in national lottery funding has links… [+5774 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "HPV knowledge, screening barriers and facilitators, and sources of health information among women living with HIV: perspectives from the DC community during the COVID-19 pandemic - BMC Women's Health - BioMed Central", "description": "Background High-risk human papillomavirus (HPV) causes 99% of cervical cancer cases. Despite available prevention methods through the HPV vaccine and two screening modalities, women continue to die from cervical cancer worldwide. Cervical cancer is preventabl…", "url": "https://bmcwomenshealth.biomedcentral.com/articles/10.1186/s12905-022-01689-y", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12905.jpg", "publishedAt": "2022-04-09T11:50:14Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Kidney disease patients are at increased risk of cancer - Daijiworld.com", "description": "Toronto, Apr 9 (IANS): Patients with kidney disease may have an increased risk of cancer and may be more likely to die from cancer, suggests a new study.\r\nThe study, published in the American Journal of Kidney Diseases, indicated that patients with chronic ki…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=946222", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_090422_kidny.jpg", "publishedAt": "2022-04-09T10:03:07Z", "content": "Toronto, Apr 9 (IANS): Patients with kidney disease may have an increased risk of cancer and may be more likely to die from cancer, suggests a new study.\r\nThe study, published in the American Journal… [+1336 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers say smoking during pregnancy may not cause ADHD in children - ANI News", "description": "London [UK], April 9 (ANI): A recent study led by University of Bristol scientists shows that maternal prenatal smoking is associated with offspring attention-deficit hyperactivity disorder (ADHD) but is unlikely to be the cause of it.", "url": "https://www.aninews.in/news/science/researchers-say-smoking-during-pregnancy-may-not-cause-adhd-in-children20220409151931", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/dfgsgsgsgsgsgsgsgsgsgsgsgsbfsdnbfsdfsdf2022040909110220220409094910-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-09T09:49:00Z", "content": "London [UK], April 9 (ANI): A recent study led by University of Bristol scientists shows that maternal prenatal smoking is associated with offspring attention-deficit hyperactivity disorder (ADHD) bu… [+1573 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Finds Ill Effect of Carbs, Sugary Foods on Oral Health - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. University at Buffalo scientists have found that higher intake of sugary and high glycemic load foods--like doughnuts and other non-fat yogurts may influence poor oral health and, perhaps, systemic healt…", "url": "https://www.latestly.com/agency-news/science-news-study-finds-ill-effect-of-carbs-sugary-foods-on-oral-health-3570959.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/04/gggggggggggbfgdnfbgdfgdfg2022040909144820220409092912-588x441.jpg", "publishedAt": "2022-04-09T09:46:28Z", "content": "Washington [US], April 9 (ANI): University at Buffalo scientists have found that higher intake of sugary and high glycemic load foods--like doughnuts and other non-fat yogurts may influence poor oral… [+3252 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study: Oestrogen Associated with Woman's Risk of Developing Dementia - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A recent research led by the George Institute for Global Health scientist has found that life events that influence levels of the female hormone oestrogen may be linked to a woman's risk of developing de…", "url": "https://www.latestly.com/agency-news/science-news-study-oestrogen-associated-with-womans-risk-of-developing-dementia-3570947.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/04/dgfgfgfgfgfgfgfgfgfgfgfgfgfgfkjgjdngmjdfg2022040909195020220409092839-588x441.jpg", "publishedAt": "2022-04-09T09:42:25Z", "content": "Washington [US], April 9 (ANI): A recent research led by the George Institute for Global Health scientist has found that life events that influence levels of the female hormone oestrogen may be linke… [+4215 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The SARS-CoV-2 spike residues 616/644 and 1138/1169 delineate two antibody epitopes in COVID-19 mRNA COMINARTY vaccine (Pfizer/BioNTech) | Scientific Reports - Nature.com", "description": "Scientific Reports - The SARS-CoV-2 spike residues 616/644 and 1138/1169 delineate two antibody epitopes in COVID-19 mRNA COMINARTY vaccine (Pfizer/BioNTech)", "url": "https://www.nature.com/articles/s41598-022-10057-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-10057-7/MediaObjects/41598_2022_10057_Fig1_HTML.png", "publishedAt": "2022-04-09T09:38:28Z", "content": "Synthetic peptides representing potential linear B-cell epitopes in the spike protein\r\nTo search for possible linear B-cell epitopes in SARS-CoV-2 spike protein, we used the predictor tool BepiPred-2… [+23906 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Covid hangover increases risk of heart attack and stroke - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://dsf.newscorpaustralia.com/dailytelegraph/subscription/", "urlToImage": null, "publishedAt": "2022-04-09T09:31:20Z", "content": null}, {"source": {"id": null, "name": "Plainsmenpost.com"}, "author": "George Holan", "title": "How long is Omicron's incubation period? – Plainsmen Post - The Plainsmen Post", "description": "", "url": "https://plainsmenpost.com/how-long-is-omicrons-incubation-period-2/", "urlToImage": "https://plainsmenpost.com/wp-content/uploads/2022/04/How-long-is-Omicrons-incubation-period-300x300.jpg", "publishedAt": "2022-04-09T09:24:24Z", "content": "The Omicron variant of Covid-19 has spread around the world at a rapid pace since it was first discovered in southern Africa in November but there is still a great deal we do not know about it.\r\nMore… [+3638 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "360info.org", "title": "Dangerous ticks are increasingly coming in contact with people - EastMojo", "description": "Blood-feeding arthropods, like mosquitoes, insects and ticks are increasingly sharing their environments with humans due to the climate, with chronic", "url": "http://www.eastmojo.com/features/2022/04/09/dangerous-ticks-are-increasingly-coming-in-contact-with-people/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/04/baseimage-8.jpg?fit=1400%2C787&ssl=1", "publishedAt": "2022-04-09T07:50:00Z", "content": "Blood-feeding arthropods, like mosquitoes, insects and ticks are increasingly sharing their environments with humans due to the climate, with chronic results.\r\nEvery organism on earth is experiencing… [+6944 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Use of viagra may lead to blindness: Study - The Tribune India", "description": "Regular use of viagra, used to treat erectile dysfunction, can harm your vision leaving you blind, a study has claimed.", "url": "https://www.tribuneindia.com/news/health/use-of-viagra-may-lead-to-blindness-study-384916", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/4/2022_4$largeimg_1250839685.jpg", "publishedAt": "2022-04-09T07:50:00Z", "content": "Toronto, April 9\r\nRegular use of viagra, used to treat erectile dysfunction, can harm your vision leaving you blind, a study has claimed.\r\nResearchers from the University of British Columbia in Canad… [+2260 chars]"}, {"source": {"id": null, "name": "Nationthailand.com"}, "author": "nationthailand", "title": "Bacteria in tumors help cancer cells metastasize: study - Nation Thailand", "description": "One reason why many cancers are so dangerous is that they metastasize. A new study led by Chinese scientists revealed that the bacteria in the tumor cells assist cancer's relocation and promote cell survival during tumor progression.", "url": "https://www.nationthailand.com/international/40014367", "urlToImage": "https://media.nationthailand.com/uploads/images/md/2022/04/8IY5p50UrBz3GjAOWlxM.webp", "publishedAt": "2022-04-09T07:07:00Z", "content": "The study also showed that those microbes specialized in relocating cancer cells, instead of affecting the carcinoma in situ.\r\n\"Only one shot of bacteria injection into the breast tumor can cause a t… [+999 chars]"}, {"source": {"id": null, "name": "7NEWS.com.au"}, "author": "AAP", "title": "Flu jab mandate for Vic health care staff - 7NEWS", "description": "Victorian health care workers will need to receive an annual flu jab under new state government requirements.", "url": "https://7news.com.au/lifestyle/health-wellbeing/flu-jab-mandate-for-vic-health-care-staff-c-6381240", "urlToImage": "https://images.7news.com.au/publication/C-6381240/d33fef85b0ee1bbbcfb0ec87f33b24330098b4e5-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2022-04-09T07:00:00Z", "content": "Flu vaccinations are now mandatory for all Victorian healthcare workers.\r\nPublic and private hospital staff, ambulance service workers and those in public residential aged care will need to receive t… [+1034 chars]"}, {"source": {"id": null, "name": "The Grand Junction Daily Sentinel"}, "author": "NATHAN DEAL Nathan.Deal@gjsentinel.com", "title": "New report details how COVID-19 pandemic affected Mesa County - The Grand Junction Daily Sentinel", "description": "Everyone in the Grand Valley knows that the COVID-19 pandemic impacted every facet of everyday life in the region.", "url": "https://www.gjsentinel.com/news/western_colorado/new-report-details-how-covid-19-pandemic-affected-mesa-county/article_24b6cf9e-b775-11ec-9f67-27de4165f9c3.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/gjsentinel.com/content/tncms/assets/v3/editorial/b/a9/ba95827a-b776-11ec-9cc0-fbfaf29719ff/62509500de844.preview.jpg?crop=1210%2C635%2C0%2C537&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-04-09T06:15:00Z", "content": "Everyone in the Grand Valley knows that the COVID-19 pandemic impacted every facet of everyday life in the region.\r\nThanks to a new report by Mesa County Public Health, theres now data quantifying ju… [+6050 chars]"}, {"source": {"id": null, "name": "The Courier"}, "author": null, "title": "7 unusual side effects and symptoms of coronavirus - including Covid toe - The Courier", "description": "Most of us are familiar with the typical coronavirus symptoms - either from learning about them over the last two years, or from actually having the", "url": "https://www.thecourier.co.uk/fp/lifestyle/health-wellbeing/3170024/unusual-covid-symptoms/", "urlToImage": "https://www.thecourier.co.uk/wp-content/uploads/sites/12/2022/04/shutterstock_1930821305-qb3ws5fn-e1649332073905.jpg", "publishedAt": "2022-04-09T04:53:00Z", "content": null}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Why Is Salt Bad for You? - Lifehacker Australia", "description": "Despite most of us knowing we should cut down on salt, Australians consume on average almost twice the recommended daily...", "url": "https://www.lifehacker.com.au/2022/04/why-is-salt-bad-for-you/", "urlToImage": "https://imgix.lifehacker.com.au/content/uploads/sites/4/2022/04/08/GettyImages-735898045.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-09T04:30:00Z", "content": "Despite most of us knowing we should cut down on salt, Australians consume on average almost twice the recommended daily maximum per day.\r\nSalt has been used in food preservation for centuries, and i… [+4467 chars]"}, {"source": {"id": null, "name": "Beef Central"}, "author": null, "title": "Govt to import live Lumpy Skin Disease virus to accelerate research - Beef Central", "description": "\"Vaccine crucial to protect Australia\": The Australian Government has today agreed to an industry request to open a pathway to import live lumpy skin disease virus to accelerate diagnostic capability and enable testing of lumpy skin disease vaccines...Read Mo…", "url": "https://www.beefcentral.com/news/govt-to-import-live-lumpy-skin-disease-virus-to-accelerate-research/", "urlToImage": "https://www.beefcentral.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-05-at-2.55.06-pm.png", "publishedAt": "2022-04-09T03:11:23Z", "content": "THE Australian Government has today agreed to an industry request to open a pathway to import live lumpy skin disease virus to accelerate diagnostic capability and enable testing of lumpy skin diseas… [+3629 chars]"}, {"source": {"id": null, "name": "Deseret News"}, "author": "Herb Scribner", "title": "COVID symptoms: Does COVID cause inflammation in the body? - Deseret News", "description": "A new study looked at how COVID-19 infection can cause major inflammation in the body", "url": "https://www.deseret.com/coronavirus/2022/4/8/23013560/new-major-covid-19-symptom-inflammation-in-the-body", "urlToImage": "https://deseret.brightspotcdn.com/dims4/default/865caf8/2147483647/strip/true/crop/3000x1713+0+144/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2Fi7KM-hkPCenOni5UKcwzXt58SKs%3D%2F0x0%3A3000x2000%2F3000x2000%2Ffilters%3Afocal%281500x1000%3A1501x1001%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23158753%2F011022_delticron_v1.jpg", "publishedAt": "2022-04-09T02:30:00Z", "content": "The novel coronavirus can infect immune cells that will trigger a massive inflammatory response and create severe COVID-19 symptoms, according to new research.\r\nDetails: Two new studies one published… [+1801 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Simple interventions reduced radiation exposure to the heart during lung cancer treatment - News-Medical.Net", "description": "Radiation to the heart during treatment for locally advanced lung cancer is associated with an increased risk of major adverse cardiac events within the first two years following treatment. The higher the cardiac dose exposure, the higher the risk of a cardia…", "url": "https://www.news-medical.net/news/20220408/Simple-interventions-reduced-radiation-exposure-to-the-heart-during-lung-cancer-treatment.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-04-09T02:19:00Z", "content": "Radiation to the heart during treatment for locally advanced lung cancer is associated with an increased risk of major adverse cardiac events within the first two years following treatment. The highe… [+2180 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Stanford engineers develop a simple delivery method that enhances a promising cancer treatment - EurekAlert", "description": "A gel composed of only two ingredients can provide a temporary, hospitable environment that helps activate modified immune cells to attack cancerous tumors.", "url": "https://www.eurekalert.org/news-releases/948694", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/69b3b7c1-99b2-41cb-b6ed-5dc7d33ba5f9/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-09T02:04:41Z", "content": "image: As shown in this demonstration, the hydrogel can be easily injected through a needle and then rapidly self-heals after injection to form a solid-like gel. The needle in this image is a 21-gaug… [+7381 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Some gut viruses promote intestinal health, while others contribute to inflammatory bowel disease - EurekAlert", "description": "The findings suggest that patients with inflammatory bowel might benefit from therapies that replace disease-driving intestinal viruses with health-promoting viruses.", "url": "https://www.eurekalert.org/news-releases/949147", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-09T02:04:41Z", "content": "BOSTON – Research in recent years has demonstrated the diverse roles that gut bacteria can play in health and disease, but what about contributions from viruses, which, like bacteria, perpetually res… [+3490 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Hannah Schneider", "title": "Fiber Is a Gut-Health Super Star—But It May Reduce Heart Disease Risk Too - Well+Good", "description": "Foods high in fiber are often included in discussions about healthy digestion, but it turns out it can be helpful for your heart too.", "url": "https://www.wellandgood.com/high-fiber-foods-ehart-health/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/04/Stocksy_txp0268ac64ZyN300_Small_3833325.jpg", "publishedAt": "2022-04-09T01:14:30Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Study finds link between blood tests and mental health problems - Play Crazy Game", "description": "Researchers at the University of Newscastle in Australia have found biological markers in routine blood tests that link them to mental health problems. The data comes from genetic, biochemical and psychiatric studies of more than a million people. According t…", "url": "https://playcrazygame.com/2022/04/09/study-finds-link-between-blood-tests-and-mental-health-problems/", "urlToImage": "https://t.ctcdn.com.br/3nXIwyfN3t6B2YQrTOAWRf6qrOk=/1400x788/smart/i575166.jpeg", "publishedAt": "2022-04-09T01:08:06Z", "content": "Researchers at the University of Newscastle in Australia have found biological markers in routine blood tests that link them to mental health problems. The data comes from genetic, biochemical and ps… [+3980 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "AI model uses electronic health records to identify people at high risk for pancreatic cancer - News-Medical.Net", "description": "An artificial intelligence (AI) model trained using sequential health information derived from electronic health records identified a subset of individuals with a 25-fold risk of developing pancreatic cancer within three to 36 months, according to results pre…", "url": "https://www.news-medical.net/news/20220408/AI-model-uses-electronic-health-records-to-identify-people-at-high-risk-for-pancreatic-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2015/3/Pancreatic_Cancer_89a89cdc7f804d5b8329b646f86bbec6-620x480.jpg", "publishedAt": "2022-04-09T00:52:00Z", "content": "An artificial intelligence (AI) model trained using sequential health information derived from electronic health records identified a subset of individuals with a 25-fold risk of developing pancreati… [+5436 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study defines nonredundant role for T cell-derived interleukin-22 in antibacterial defense of colonic crypts - News-Medical.Net", "description": "Intestinal epithelial cells line the inner wall of the gut, creating a barrier to dangerous bacteria like enteropathogenic E. coli that seek to attach and efface that barrier, causing diarrhea.", "url": "https://www.news-medical.net/news/20220408/Study-defines-nonredundant-role-for-T-cell-derived-interleukin-22-in-antibacterial-defense-of-colonic-crypts.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/6/Anatomical_structure_of_biological_animal_cell_with_organelles-eranicle_1d73b50575dc4546875a4a2fc7d429a6-620x480.jpg", "publishedAt": "2022-04-09T00:45:00Z", "content": "Intestinal epithelial cells line the inner wall of the gut, creating a barrier to dangerous bacteria like enteropathogenic E. colithat seek to attach and efface that barrier, causing diarrhea. Such p… [+6689 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Many clinical trials fail to account for previous or ongoing studies, researchers show - News-Medical.Net", "description": "Clinical trials are a pivotal tool for assessing the safety and efficacy of medical interventions, but sponsors often provide incomplete information for assessing their ethical justification.", "url": "https://www.news-medical.net/news/20220408/Many-clinical-trials-fail-to-account-for-previous-or-ongoing-studies-researchers-show.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/6/Anatomical_structure_of_biological_animal_cell_with_organelles-eranicle_1d73b50575dc4546875a4a2fc7d429a6-620x480.jpg", "publishedAt": "2022-04-09T00:37:00Z", "content": "Clinical trials are a pivotal tool for assessing the safety and efficacy of medical interventions, but sponsors often provide incomplete information for assessing their ethical justification. Researc… [+1195 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover new mechanisms for bone loss in gum disease - News-Medical.Net", "description": "Tokyo University of Agriculture and Technology researchers reported on a new discovery regarding the mechanisms for bone loss in gum disease (periodontitis). They found that double stranded RNA molecules can activate the immune system response that leads to d…", "url": "https://www.news-medical.net/news/20220408/Researchers-discover-new-mechanisms-for-bone-loss-in-gum-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Osteoporosis_stage_3_of_4_-_upper_limb_bones_-_3d_rendering_-_Crevis_M1_62ee9a3e223b497ca6798e45d894de93-620x480.jpg", "publishedAt": "2022-04-09T00:24:00Z", "content": "Tokyo University of Agriculture and Technology researchers reported on a new discovery regarding the mechanisms for bone loss in gum disease (periodontitis). They found that double stranded RNA molec… [+4527 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New Alzheimer’s disease hypothesis could open up diagnosis or treatment possibilities - News-Medical.Net", "description": "Alzheimer's Disease could be caused by damage to a protective barrier in the body that allows fatty substances to build up in the brain, newly published research argues.", "url": "https://www.news-medical.net/news/20220408/New-Alzheimere28099s-disease-hypothesis-could-open-up-diagnosis-or-treatment-possibilities.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-04-09T00:18:00Z", "content": "Alzheimer's Disease could be caused by damage to a protective barrier in the body that allows fatty substancesto build up in the brain, newly published research argues.\r\nA new explanation called the … [+3382 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Drinking Coffee May Alleviate Symptoms of ADHD, New Study Says - Free Speech TV", "description": "Scientists at the Universitat Oberta de Catalunya say the caffeine found in coffee is a viable way to treat many symptoms of ADHD. A mental condition that ca...", "url": "https://www.youtube.com/watch?v=vybRzswel1I", "urlToImage": "https://i.ytimg.com/vi/vybRzswel1I/hqdefault.jpg", "publishedAt": "2022-04-09T00:16:37Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Enhancing deep sleep — ScienceDaily - Verve Times", "description": "Researchers have developed a wearable device that plays specific sounds to enhance deep sleep. The first clinical study has now shown that the device is effective, but not at the same level of effectiveness for everyone.Many people, especially the el", "url": "https://vervetimes.com/enhancing-deep-sleep-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-08T23:15:18Z", "content": "Researchers have developed a wearable device that plays specific sounds to enhance deep sleep. The first clinical study has now shown that the device is effective, but not at the same level of effect… [+4104 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Beth Levine", "title": "Joint Pain Improves With a Combo Vegan and Elimination Diet - Everyday Health", "description": "Adopting a vegan diet, plus eliminating other trigger foods, such as soy, nuts, and sugar, may help minimize rheumatoid arthritis (RA) joint pain.", "url": "https://www.everydayhealth.com/rheumatoid-arthritis/a-combination-vegan-and-elimination-diet-eases-joint-pain/", "urlToImage": "https://images.everydayhealth.com/images/vegan-diet-helps-ra-joint-pain-1440x810.jpg?sfvrsn=b32e77cc_1", "publishedAt": "2022-04-08T22:38:19Z", "content": "Adopting a vegan diet, plus eliminating other trigger foods may help minimize joint pain caused by rheumatoid arthritis (RA), according to a small study conducted by Physicians Committee for Responsi… [+5676 chars]"}]}