{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "sortiraparis"}, "author": "Manon C.", "title": "Covid : Les grossesses plus souvent perturbées par le virus, d'après une étude - sortiraparis", "description": "Une nouvelle étude de l'AP-HP semble montrer que les grossesses sont plus souvent perturbées par le Covid, avec notamment plus de risques de naissances prématurées.", "url": "https://www.sortiraparis.com/actualites/coronavirus/articles/267118-covid-les-grossesses-plus-souvent-perturbees-par-le-virus-d-apres-une-etude", "urlToImage": "https://www.sortiraparis.com/images/58/66131/605667-la-vitamine-d-aurait-elle-une-influence-sur-le-qi-des-enfants-pendant-la-grossesse.jpg", "publishedAt": "2021-12-15T10:12:00Z", "content": "Alors qu'une première étude publiée en pre-print sur MedXriv en aout dernier indiquait que le variant Delta augmentait le risque pour les femmes enceintes non-vaccinées de développer une forme grave … [+1517 chars]"}, {"source": {"id": null, "name": "20 Minutes"}, "author": "Oihana Gabriel", "title": "Médecine : A Massy, on opère les cœurs malades grâce à l’intelligence artificielle - 20 Minutes", "description": "A l’Institut cardiovasculaire Paris Sud, une équipe de cardiologue opère les fibrillations atriales, une arythmie courante et complexe, en testant un logiciel basé sur l’IA", "url": "https://www.20minutes.fr/sante/3196455-20211214-publier-relire-medecine-massy-opere-urs-malades-grace-intelligence-artificielle", "urlToImage": "https://img.20mn.fr/9pAn04aTSLONs-0JYCCZoSk/648x360_deux-medecins-operent-coeur-patiente-atteinte-fibrillation-atriale-hopital-jacques-cartier-massy.jpg", "publishedAt": "2021-12-15T09:15:02Z", "content": "« Moi, ça me fascine », avoue Jérôme Horvilleur, cardiologue à l’Institut Cardiovasculaire Paris Sud (ICPS), à l' \r\nhôpital privé Jacques Cartier de Massy (Essonne). Sous le masque, la charlotte et l… [+5711 chars]"}, {"source": {"id": null, "name": "Medisite"}, "author": "Sarah Ugolini", "title": "Statines : attention à votre cœur si vous arrêtez ces anti-cholestérol - Medisite", "description": "Selon une récente étude, arrêter la prescription de ces médicaments anti-cholestérol augmenterait les problèmes cardiovasculaires majeurs tels que les infarctus ou les AVC chez les personnes âgées sous traitement depuis plus de cinq ans.", "url": "https://www.medisite.fr/cholesterol-statines-attention-a-votre-coeur-si-vous-arretez-ces-anti-cholesterol.5624618.44.html", "urlToImage": "https://www.medisite.fr/files/images/article/7/4/1/4578147/5893162-inline.jpg", "publishedAt": "2021-12-14T14:31:00Z", "content": "Arrêter ces médicaments anti-cholestérol courants est-il un danger pour votre cur ? Destinées à combattre le cholestérol, les statines sont très largement prescrites aujourdhui mais font depuis quelq… [+3372 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "L'asthme protège des tumeurs cérébrales, et des chercheurs pensent enfin savoir pourquoi - Trust My Science", "description": "Il y a 15 ans, des chercheurs ont constaté que les asthmatiques bénéficient d'une certaine protection mystérieuse contre les tumeurs cérébrales. Aujourd'hui, une nouvelle étude révèle une cause potentielle de cette corrélation jusqu'ici incomprise.", "url": "https://trustmyscience.com/asthme-protege-tumeurs-cerebrales-chercheurs-pensent-savoir-pourquoi/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2021/12/asthme-protege-tumeurs-cerebrales-chercheurs-pensent-savoir-pourquoi-couv.jpg", "publishedAt": "2021-12-14T11:18:48Z", "content": "Il y a une quinzaine dannées, les scientifiques ont mis en évidence que les personnes asthmatiques développaient moins de tumeurs cérébrales que les autres. Une étude récente a permis de relever une … [+4145 chars]"}, {"source": {"id": null, "name": "CNEWS.fr"}, "author": "CNEWS", "title": "Ces 5 aliments qui augmentent les risques de cancer - CNEWS", "description": "En France, les cancers représentent la première cause de mortalité chez les hommes et la deuxième chez les femmes. On sait aujourd’hui que l’alimentation joue un rôle prépondérant dans les risques de développer cette maladie. Si certains aliments sont bénéfiq…", "url": "https://www.cnews.fr/nutrition/2021-12-14/ces-5-aliments-qui-augmentent-les-risques-de-cancer-1075005", "urlToImage": "https://static.cnews.fr/sites/default/files/fillet-4336736_1280_6086d1de66fcc_0.jpg", "publishedAt": "2021-12-14T08:05:00Z", "content": "Mis à jour le\r\n14/12/2021 à 09:59Publié le\r\n14/12/2021 à 08:05\r\nEn France, les cancers représentent la première cause de mortalité chez les hommes et la deuxième chez les femmes. On sait aujourd’hui … [+2012 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Des chercheurs conçoivent un vaccin éliminant certaines cellules responsables du vieillissement - Trust My Science", "description": "Une équipe de chercheurs japonais a mis au point un vaccin permettant d'éliminer les cellules dites « zombies » qui s'accumulent avec l'âge et endommagent les cellules, provoquant des maladies liées au vieillissement, telles que la rigidité artérielle.", "url": "https://trustmyscience.com/nouveau-vaccin-eliminer-cellules-responsables-vieillissement/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2021/12/nouveau-vaccin-eliminer-cellules-responsables-vieillissement-couv.jpg", "publishedAt": "2021-12-13T16:50:53Z", "content": "Retarder, voire stopper le processus de vieillissement, est un sujet de recherche à fort intérêt depuis des décennies. Récemment, une équipe de recherche japonaise a déclaré avoir mis au point un vac… [+3769 chars]"}]}