{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNEWS.fr"}, "author": "CNEWS", "title": "Pourquoi les États-Unis vont-ils libérer 2 milliards de moustiques génétiquement modifiés ? - CNEWS", "description": "Deux milliards de moustiques génétiquement modifiés vont être libérés dans certaines régions de la Floride et de la Californie, aux États-Unis. Responsable d’environ 750.000 décès par an, le moustique est l’espèce la plus meurtrière pour l’Homme.", "url": "https://www.cnews.fr/environnement/2022-03-19/pourquoi-les-etats-unis-vont-ils-liberer-2-milliards-de-moustiques", "urlToImage": "https://static.cnews.fr/sites/default/files/000_mvd6742389-taille1200_6235fdfcaeb30.jpg", "publishedAt": "2022-03-19T17:13:13Z", "content": "Mis à jour le\r\n19/03/2022 à 18:12Publié le\r\n19/03/2022 à 18:10\r\nDeux milliards de moustiques génétiquement modifiés vont être libérés dans certaines régions de la Floride et de la Californie, aux Éta… [+1345 chars]"}, {"source": {"id": null, "name": "CNEWS.fr"}, "author": "CNEWS", "title": "Covid-19 : qu'est-ce que «la toux du phoque», ce nouveau symptôme d'Omicron chez les enfants ? - CNEWS", "description": "Un nouveau symptôme du variant Omicron semble avoir fait son apparition, et les enfants seraient particulièrement touchés. La «toux du phoque» se manifesterait par une laryngite provoquant des quintes de toux aiguës et une respiration sifflante, semblables au…", "url": "https://www.cnews.fr/sante/2022-03-19/covid-19-quest-ce-que-la-toux-du-phoque-ce-nouveau-symptome-domicron-chez-les", "urlToImage": "https://static.cnews.fr/sites/default/files/000_9tt8dn-taille1200_6235d07a00a63_0.jpg", "publishedAt": "2022-03-19T14:43:58Z", "content": "Un nouveau symptôme du variant Omicron semble avoir fait son apparition, et les enfants seraient particulièrement touchés. La «toux du phoque» se manifesterait par une laryngite provoquant des quinte… [+2390 chars]"}, {"source": {"id": null, "name": "Futura"}, "author": "Stéphanie Le Guillou", "title": "La Covid-19 ne se transmettrait pas par les surfaces contaminées : pourquoi ? - Futura", "description": "Aurions-nous utilisé du gel hydroalcoolique pour rien pendant deux ans ? C’est ce que semble conclure une étude publiée le 14 février 2022 par des chercheurs de l’Université de l’Utah aux...", "url": "https://www.futura-sciences.com/sante/actualites/coronavirus-covid-19-ne-transmettrait-pas-surfaces-contaminees-97400/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/6/0/a/60a8eda780_50175183_contamination-surfaces-irina-shatilova-adobe-stock.jpg", "publishedAt": "2022-03-19T10:05:34Z", "content": "Aurions-nous utilisé du gel hydroalcoolique pour rien pendant deux ans ? C'est ce que semble conclure une étude publiée le 14 février 2022 par des chercheurs de l'Université de l'Utah aux États-Unis … [+2853 chars]"}, {"source": {"id": null, "name": "Pressesante.com"}, "author": "Marie Desange", "title": "Ces aliments et boisson qui contribuent à réduire le taux de cholestérol - Presse santé", "description": "Les changements de régime alimentaire peuvent avoir un impact significatif sur les taux de cholestérol élevés. Voici quelques-uns des meilleurs aliments à essayer. Si l'on vous a diagnostiqué un taux", "url": "https://www.pressesante.com/ces-aliments-et-boisson-qui-contribuent-a-reduire-le-taux-de-cholesterol/", "urlToImage": "https://www.pressesante.com/wp-content/uploads/2021/10/Cholesterol.png", "publishedAt": "2022-03-19T07:42:33Z", "content": "Les changements de régime alimentaire peuvent avoir un impact significatif sur les taux de cholestérol élevés. Voici quelques-uns des meilleurs aliments à essayer.\r\nSi lon vous a diagnostiqué un taux… [+8148 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Faire la sieste de façon excessive pourrait être un signe de la maladie d'Alzheimer - Trust My Science", "description": "Une nouvelle étude révèle une relation bidirectionnelle entre les siestes diurnes excessives et la maladie d’Alzheimer.", "url": "https://trustmyscience.com/sieste-excessive-pourrait-etre-signe-maladie-alzheimer/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2022/03/exces-sieste-maladie-alzheimer.jpg", "publishedAt": "2022-03-18T13:38:50Z", "content": "La sieste est généralement considérée comme bénéfique pour la santé : elle permet notamment de diminuer le stress, daméliorer la concentration ou encore de réduire les risques de maladies cardiovascu… [+6303 chars]"}]}