{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "BFMTV"}, "author": null, "title": "Des symptômes d'ordre \"psychologique\"? Une étude sur le Covid long fait polémique - BFMTV", "description": "Selon une étude contestée par des patients et des médecins, les symptômes physiques persistants après l'infection au Covid-19 \"pouraient le plus souvent être associés au fait de croire avoir été infecté\" au coronavirus.", "url": "https://www.bfmtv.com/sante/des-symptomes-d-ordre-psychologique-une-etude-sur-le-covid-long-fait-polemique_AV-202111120303.html", "urlToImage": "https://images.bfmtv.com/iRA90pqLFkyDgA08TUpx-7Ng87w=/0x40:768x472/768x0/images/Injection-d-une-dose-de-vaccin-Pfizer-contre-le-Covid-19-le-11-aout-2021-a-Long-Beach-en-Californie-1089102.jpg", "publishedAt": "2021-11-12T15:05:10Z", "content": "Selon une étude contestée par des patients et des médecins, les symptômes physiques persistants après l'infection au Covid-19 \"pouraient le plus souvent être associés au fait de croire avoir été infe… [+4797 chars]"}, {"source": {"id": "les-echos", "name": "Les Echos"}, "author": "Neïla Beyler", "title": "Quelle est l'heure de coucher idéale pour réduire le risque de maladies cardiaques ? - Les Échos", "description": "Les personnes qui s'endorment trop tôt ou trop tard risquent de se déconnecter de leur propre horloge biologique, ce qui a des incidences sur le bon fonctionnement du coeur, selon une étude britannique. Après avoir suivi plus de 88.000 personnes, des chercheu…", "url": "https://www.lesechos.fr/idees-debats/sciences-prospective/quelle-est-lheure-de-coucher-ideale-pour-reduire-le-risque-de-maladies-cardiaques-1363273", "urlToImage": "https://media.lesechos.com/api/v1/images/view/618e73a98fe56f13ad169ee2/1280x720/070300382183-web-tete.jpg", "publishedAt": "2021-11-12T14:01:38Z", "content": "Les couche-tard risquent d'être déçus. Une nouvelle étude démontre qu'il existe un créneau horaire optimal pour sombrer dans les bras de Morphée , du moins pour prendre soin de son coeur. Ni trop tôt… [+4131 chars]"}, {"source": {"id": null, "name": "Pressesante.com"}, "author": "Marie Desange", "title": "Quand faut il faire une cure de vitamine D ? - Presse santé", "description": "La vitamine D également connue sous le nom de vitamine soleil est un élément important pour l’organisme. Une cure de vitamine D apporte des bienfaits considérables pour l’homme. Cependant, cette cure", "url": "https://www.pressesante.com/quand-faut-il-faire-une-cure-de-vitamine-d/", "urlToImage": "https://www.pressesante.com/wp-content/uploads/2019/12/soleil-Vitamine-D.jpg", "publishedAt": "2021-11-12T12:35:05Z", "content": "La vitamine D également connue sous le nom de vitamine soleil est un élément important pour lorganisme. Une cure de vitamine D apporte des bienfaits considérables pour lhomme. Cependant, cette cure d… [+4392 chars]"}, {"source": {"id": null, "name": "Europe 1"}, "author": null, "title": "Dos, articulations... Comment soigner les douleurs chroniques ? - Europe 1", "description": "Sur les 14 millions de Français qui souffrent de douleurs chroniques au dos, aux articulations, les traitements médicamenteux ne sont pas efficaces pour trois personnes sur quatre. La solution pourrait résider dans la technique de la neuromodulation, qui peut…", "url": "https://www.europe1.fr/sante/dos-articulations-comment-soigner-les-douleurs-chroniques-4076605", "urlToImage": "https://cdn-europe1.lanmedia.fr/var/europe1/storage/images/europe1/sante/dos-articulations-comment-soigner-les-douleurs-chroniques-4076605/57838531-1-fre-FR/Dos-articulations-Comment-soigner-les-douleurs-chroniques.jpg", "publishedAt": "2021-11-12T08:04:27Z", "content": "Si vous avez mal au dos, vous faites peut-être partie de ces 14 millions de Français qui souffrent de douleurs chroniques. Près de trois personnes sur quatre n'ont pas trouvé de traitements adaptés, … [+1712 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Des souris paralysées remarchent grâce à un médicament prometteur - LCI", "description": "MEDECINE - Une thérapie \"supramoléculaire\" d'un genre nouveau vient d'être mise au point pour réparer les lésions de la moelle épinière. Les essais sur des humains pourraient commencer d'ici deux ans.", "url": "https://www.lci.fr/sciences-et-innovation/sciences-des-souris-paralysees-remarchent-grace-a-un-medicament-prometteur-2201657.html", "urlToImage": "https://photos.lci.fr/images/1280/720/000_par7779440-410cb7-0@1x.jpeg", "publishedAt": "2021-11-12T05:11:55Z", "content": "La découverte peut redonner de l'espoir aux personnes atteintes de paralysie. Des chercheurs ont réussi à faire remarcher des souris atteintes de lésions de la moelle épinière et qui avaient leurs pa… [+2526 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT en Français", "title": "L'acteur américain Matthew McConaughey s'oppose à la vaccination pour les enfants de 5 à 11 ans - RT en français", "description": "L'acteur américain de 52 ans a affirmé son opposition à la vaccination des enfants âgés de 5 à 11 ans aux Etats-Unis. Il a cependant confirmé qu'il n'était pas contre la vaccination en général et que son fils de 13 ans était vacciné.", "url": "https://francais.rt.com/international/92553-acteur-americain-matthew-mcconaughey-soppose-vaccination-enfants-5-a-11-ans", "urlToImage": "https://cdni.rt.com/french/images/2021.11/original/618d4fdd6f7ccc5a220a8f17.jpeg", "publishedAt": "2021-11-11T17:54:07Z", "content": "L'acteur américain de 52 ans a affirmé son opposition à la vaccination des enfants âgés de 5 à 11 ans aux Etats-Unis. Il a cependant confirmé qu'il n'était pas contre la vaccination en général et que… [+2170 chars]"}, {"source": {"id": null, "name": "Lessentiel.lu"}, "author": "L'essentiel", "title": "Moderna ne va plus être prescrit aux moins de 30 ans - L'essentiel", "description": "LUXEMBOURG - Ce vaccin Arn ferait augmenter le risque de myocardite et péricardite chez les jeunes adultes. Le gouvernement y renonce pour le moment par précaution.", "url": "http://www.lessentiel.lu/fr/luxembourg/story/moderna-ne-va-plus-etre-prescrit-aux-moins-de-30-ans-17376960", "urlToImage": "http://www.lessentiel.lu/dyim/59032f/T786,384/images/content/1/7/3/17376960/5/teaserbreit.jpg", "publishedAt": "2021-11-11T15:29:00Z", "content": "Vous venez de publier un commentaire sur notre site et nous vous en remercions. Les messages sont vérifiés avant publication. Afin de sassurer de la publication de votre message, vous devez cependant… [+2220 chars]"}, {"source": {"id": null, "name": "CNEWS.fr"}, "author": "Chloé Ronchin", "title": "Ces 5 aliments à consommer pour lutter contre le cholestérol - CNEWS", "description": "Le cholestérol est indispensable au bon fonctionnement du corps humain. Mais en excès dans le sang, il peut avoir des conséquences graves sur la santé. Il est donc essentiel de maîtriser son taux et de le réduire si besoin. Voici quelques aliments qui vont pe…", "url": "https://www.cnews.fr/food/2021-11-11/ces-5-aliments-consommer-pour-lutter-contre-le-cholesterol-1003881", "urlToImage": "https://static.cnews.fr/sites/default/files/thought-catalog-emx1ej1bcgu-unsplash-taille1200_618b97496383b_0.jpg", "publishedAt": "2021-11-11T08:07:26Z", "content": null}]}