{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Nice-Matin"}, "author": "Aurore Malval", "title": "Votre environnement est-il à risque pour le réveillon de Noël? Calculez votre risque de contamination à la Covid-19 avec notre simulateur - Nice-Matin", "description": "S'il est un invité qu'on ne veut pas voir à nos tables de fête, c'est bien le Covid-19. Pourtant, comme l'a rappelé ce lundi le conseil scientifique, le risque de contamination lors des traditionnelles retrouvailles familiales est réel. Mais à quel point est-…", "url": "https://www.nicematin.com/faits-de-societe/votre-environnement-est-il-a-risque-pour-le-reveillon-de-noel-calculez-votre-risque-de-contamination-a-la-covid-19-avec-notre-simulateur-733559", "urlToImage": "https://fyooyzbm.filerobot.com/v7/covid.png?ci_seal=36a6775ee7", "publishedAt": "2021-12-23T16:00:00Z", "content": "Il est impossible d'affirmer qu'une personne infectée par le coronavirus le transmettra à coup sûr à une autre. Mais on peut estimer la probabilité que pareil cas se produise, plus particulièrement e… [+3187 chars]"}, {"source": {"id": null, "name": "L'Indépendant"}, "author": "Stéphane Sicard", "title": "Doliprane, Efferalgan, Spasfon, Amoxicilline: Un additif cancérogène interdit dans l'alimentation mais présent - L'Indépendant", "description": "Le dioxyde de titane permet de faire briller et de blanchir les éléments. Cet additif potentiellement cancérogène a été retiré des aliments mais il est toujours présent dans quelques-uns des médicaments les plus courants.", "url": "https://www.lindependant.fr/2021/12/23/doliprane-efferalgan-spasfon-amoxicilline-un-additif-cancerogene-interdit-dans-lalimentation-mais-present-dans-800-medicaments-10010197.php", "urlToImage": "https://images.lindependant.fr/api/v1/images/view/61c496f8d286c225762d3005/large/image.jpg?v=1", "publishedAt": "2021-12-23T15:36:00Z", "content": "Le dioxyde de titane permet de faire briller et de blanchir les éléments. Cet additif potentiellement cancérogène a été retiré des aliments mais il est toujours présent dans quelques-uns des médicame… [+1201 chars]"}, {"source": {"id": null, "name": "Le HuffPost"}, "author": "Margaret Oheneba", "title": "L'épidémie de grippe arrive, l'Occitanie première région métropolitaine touchée - Le HuffPost", "description": "Les passages aux urgences et les hospitalisations pour grippe ou syndrome grippal ont fortement augmenté la semaine du 13 décembre.", "url": "https://www.huffingtonpost.fr/entry/epidemie-grippe-arrive-occitanie-premiere-region-touchee_fr_61c477b2e4b04b42ab69275f", "urlToImage": "https://img.huffingtonpost.com/asset/61c486e6210000f10270249a.jpeg?ops=1200_630", "publishedAt": "2021-12-23T14:39:19Z", "content": "SANTE - Face à des Français moins immunisés, l’épidémie de grippe avance. L’Occitanie est la première région métropolitaine à entrer en phase épidémique, a indiqué ce mercredi 22 décembre Santé Publi… [+2109 chars]"}, {"source": {"id": null, "name": "Midi Libre"}, "author": "Benjamin Polge", "title": "Covid-19 : Pfizer, Moderna... mixer les vaccins est-il plus efficace contre le coronavirus ? - Midi Libre", "description": "Des études scientifiques menées dans plusieurs pays suggèrent une efficacité renforcée en mixant les vaccins. Actuellement en France, en raison d'une insuffisance de stocks en Pfizer, les doses de rappel se font, en majorité, avec le produit de Moderna.", "url": "https://www.midilibre.fr/2021/12/23/covid-19-pfizer-moderna-mixer-les-vaccins-est-il-plus-efficace-contre-le-coronavirus-10010099.php", "urlToImage": "https://images.midilibre.fr/api/v1/images/view/61c486e98fe56f6b455dd346/large/image.jpg?v=1", "publishedAt": "2021-12-23T14:27:00Z", "content": "Des études scientifiques menées dans plusieurs pays suggèrent une efficacité renforcée en mixant les vaccins. Actuellement en France, en raison d'une insuffisance de stocks en Pfizer, les doses de ra… [+2449 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "Audrey LE GUELLEC", "title": "Covid-19 : l'oxymètre, un \"outil malin\" pour se rassurer quand on est testé positif - LCI", "description": "CONSEIL - Si depuis le début de la pandémie certains patients se voient prescrire de petits appareils destinés à surveiller la respiration, il est aussi possible de s'en procurer sans ordonnance, en pharmacie voire en grande surface, \"pour se rassurer\". . San…", "url": "https://www.lci.fr/sante/video-covid-19-coronavirus-pandemie-cinquieme-vague-omicron-l-oxymetre-saturometre-un-outil-malin-pour-se-rassurer-quand-on-est-teste-positif-2205287.html", "urlToImage": "https://photos.lci.fr/images/1280/720/oxymetre-saturometre-d04296-0@1x.jpeg", "publishedAt": "2021-12-22T17:32:03Z", "content": "CONSEIL - Si depuis le début de la pandémie certains patients se voient prescrire de petits appareils destinés à surveiller la respiration, il est aussi possible de s'en procurer sans ordonnance, en … [+4776 chars]"}, {"source": {"id": null, "name": "Www.rci.fm"}, "author": null, "title": "Chlordécone: les cancers de la prostate reconnus comme maladie professionnelle - RCI", "description": "Un décret paru au journal officiel ce mercredi reconnaît que les cancers de la prostate liés à l'exposition au chlordécone sont une maladie professionnelle.", "url": "https://www.rci.fm/deuxiles/infos/Sante/Chlordecone-les-cancers-de-la-prostate-reconnus-comme-maladie-professionnelle", "urlToImage": "https://www.rci.fm/sites/default/files/styles/facebook_share/public/2019-12/couloir-hopital-660x440_0.jpg?itok=1TWHrvJ3", "publishedAt": "2021-12-22T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Futura"}, "author": "Stéphanie Le Guillou", "title": "Rhume : « l'utilisation des vasoconstricteurs expose à des risques », avertit l'ANSM - Futura", "description": "Un vasoconstricteur est un médicament vendu en pharmacie pour les rhumes. Il sert à déboucher le nez. L’ANSM tient à rappeler que leur usage n’est pas anodin. En effet, ils exposent à des risques...", "url": "https://www.futura-sciences.com/sante/actualites/rhume-rhume-utilisation-vasoconstricteurs-expose-risques-avertit-ansm-95686/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/8/c/c/8cca38d8f3_134304_grippe-spray-nasal.jpg", "publishedAt": "2021-12-22T10:45:00Z", "content": "Un vasoconstricteur est un médicament vendu en pharmacie pour les rhumes. Il sert à déboucher le nez. L'ANSM tient à rappeler que leur usage n'est pas anodin. En effet, ils exposent à des risques d'e… [+2924 chars]"}]}