{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNEWS.fr"}, "author": "CNEWS", "title": "Vaccin : les plus de 65 ans sont-ils convoqués pour une troisième dose ? - CNEWS", "description": "Alors qu'une troisième dose de vaccin est recommandée pour les personnes de plus de 65 ans et ayant obtenu leur dernière injection il y a plus de six mois, nombreux sont ceux à se demander s’ils recevront une convocation des autorités sanitaires pour le faire.", "url": "https://www.cnews.fr/france/2021-11-01/vaccin-les-plus-de-65-ans-sont-ils-convoques-pour-une-troisieme-dose-1144518", "urlToImage": "https://static.cnews.fr/sites/default/files/000_9hg9e3-taille1200_617ff16211ddb_0.jpg", "publishedAt": "2021-11-01T16:41:04Z", "content": "Alors qu'une troisième dose de vaccin est recommandée pour les personnes de plus de 65 ans et ayant obtenu leur dernière injection il y a plus de six mois, nombreux sont ceux à se demander s’ils rece… [+1630 chars]"}, {"source": {"id": null, "name": "Trust My Science"}, "author": null, "title": "Alzheimer : des chercheurs identifient la cause de la progression agressive de la maladie - Trust My Science", "description": "Des chercheurs ont mis au point un modèle mathématique expliquant la progression de la maladie dans le cerveau humain, dont notamment la vitesse de différents processus menant à la démence.", "url": "https://trustmyscience.com/chercheurs-identifient-cause-progression-agressive-alzheimer/", "urlToImage": "https://trustmyscience.com/wp-content/uploads/2021/11/cause-progression-agressive-alzheimer-identifiee.jpg", "publishedAt": "2021-11-01T15:34:14Z", "content": "La recherche dans le domaine des maladies neurodégénératives avance à grands pas ces dernières années, de nombreuses études se concentrant sur la plus fréquente d’entre elles, la maladie d’Alzheimer … [+8441 chars]"}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "Regev-Yochay: « Les experts ont peur de parler des vaccins en raison de menaces » - The Times of Israël", "description": "\"Les menaces proférées à l'encontre de Sharon Alroy-Preis sont préoccupantes\", a déclaré la directrice de l'unité d'épidémiologie des maladies infectieuses de l'hôpital Sheba", "url": "https://fr.timesofisrael.com/regev-yochay-les-experts-ont-peur-de-parler-des-vaccins-en-raison-de-menaces/", "urlToImage": "https://static.timesofisrael.com/fr/uploads/2021/08/GILIDROITE-1024x640.jpg", "publishedAt": "2021-10-31T16:45:51Z", "content": "De nombreux experts de la santé ont peur de donner des interviews aux médias au sujet des vaccins COVID-19 en raison des menaces concrètes posées par les militants antivaccin, a déclaré dimanche une … [+2272 chars]"}, {"source": {"id": null, "name": "20 Minutes"}, "author": "Jean-Loup Delmas", "title": "Vaccination : Bientôt des patchs disponibles contre le coronavirus ? - 20 Minutes", "description": "Les vaccins avec piqûre seront peut-être bientôt de l’histoire ancienne", "url": "https://www.20minutes.fr/sante/3161511-20211031-vaccination-bientot-patchs-disponibles-contre-coronavirus", "urlToImage": "https://img.20mn.fr/nso3C2U6S9yoabZTh-txLCk/648x360_epoque-aiguilles-piquent-peut-etre-revolue.jpg", "publishedAt": "2021-10-31T13:47:35Z", "content": "Un vaccin, mais pas d'aiguille. Depuis le début de la pandémie, les projets de \r\nvaccination contre \r\nle Covid-19 grâce à des patchs se multiplient, témoignant d'un mouvement qui pourrait bien révolu… [+2809 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT en Français", "title": "Covid : les vaccinés transmettent autant le variant Delta que les non-vaccinés, selon une étude - RT en français", "description": "Selon une équipe de chercheurs britanniques, la vaccination ne limite pas la propagation du variant Delta, la charge virale étant similaire chez les vaccinés et les non-vaccinés. Pour les auteurs de l'étude, la vaccination n'est «pas suffisante».", "url": "https://francais.rt.com/international/92158-covid-vaccines-transmettent-autant-variant-delta-non-vaccines-etude", "urlToImage": "https://cdni.rt.com/french/images/2021.10/original/617e4a0887f3ec3aef727d99.JPG", "publishedAt": "2021-10-31T08:36:30Z", "content": "Selon une équipe de chercheurs britanniques, la vaccination ne limite pas la propagation du variant Delta, la charge virale étant similaire chez les vaccinés et les non-vaccinés. Pour les auteurs de … [+1915 chars]"}]}