{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Chapare virus: Scientists confirm rare deadly virus in Bolivia can spread from person to person; all about it - DNA India", "description": "The US Centers for Disease Control and Prevention recently discovered a rare virus in Bolivia. The 'Chapare' virus is capable of human-to-human transmission, and belong to a family of viruses that can cause fevers, such as Ebola.", "url": "https://www.dnaindia.com/world/report-chapare-virus-scientists-confirm-rare-deadly-virus-in-bolivia-can-spread-from-person-to-person-all-about-it-2857102", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/11/18/938233-cute-32844121280.jpg", "publishedAt": "2020-11-18T04:12:00Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Shots Race Toward Finish Line in 300-Day Science Feat - NDTV", "description": "In early January, about the only thing the world's scientists knew for sure about the novel coronavirus was its genetic profile. Now, some 300 days later, vaccine developers are on the brink of a major victory against a pathogen that's inflicted untold person…", "url": "https://www.ndtv.com/world-news/covid-shots-race-toward-finish-line-in-300-day-science-feat-2326631", "urlToImage": "https://c.ndtvimg.com/2020-11/li5lkjsg_covid-vaccine_625x300_11_November_20.jpg", "publishedAt": "2020-11-18T03:51:45Z", "content": "Bringing a conventional vaccine from inception to market takes more than a decade on average.\r\nIn early January, about the only thing the world's scientists knew for sure about the novel coronavirus … [+7133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Hepatitis C drugs shown to inhibit coronavirus enzyme - The Indian Express", "description": "Researchers looked at several well-known drug molecules for potential repurposing efforts. These included three hepatitis C protease inhibitors: telaprevir, narlaprevir and boceprevir.", "url": "https://indianexpress.com/article/explained/hepatitis-c-drugs-for-covid-19-7055349/", "urlToImage": "https://images.indianexpress.com/2020/11/Covid-14.jpg", "publishedAt": "2020-11-18T03:16:13Z", "content": "The heart-shaped SARS-CoV-2 main protease enables the virus to reproduce by cutting long chains of proteins that activate the replication process.(Jill Hemman/ORNL)Several Hepatitis C drugs have been… [+2188 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Neetu Chandra Sharma", "title": "WHO rolls out global strategy to eradicate cervical cancer by ’50 - Mint", "description": "For the first time, 194 countries, including India, committed to eliminate cancer, following the adoption of a resolution at the World Health Assembly 2020 in Geneva", "url": "https://www.livemint.com/science/health/who-rolls-out-global-strategy-to-eradicate-cervical-cancer-by-50-11605667225234.html", "urlToImage": "https://images.livemint.com/img/2020/11/18/600x338/729f3970-28d9-11eb-a978-708e052e967f_1605667224373_1605667600566.jpg", "publishedAt": "2020-11-18T02:50:13Z", "content": "The World Health Organization (WHO) on Tuesday launched the global strategy to fast track the eradication of cervical cancer. WHO aims to reduce more than 40% of new cases and 5 million related death… [+2022 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Covid Vaccine Induces Quick Immune Response Within 4 Weeks: Study - NDTV", "description": "Sinovac Biotech's experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday.", "url": "https://www.ndtv.com/world-news/sinovacs-coronavirus-vaccine-coronavac-induces-quick-immune-response-says-study-2326599", "urlToImage": "https://c.ndtvimg.com/2020-11/td6lfc4o_sinovacs-coronavirus-vaccine-650_625x300_18_November_20.jpg", "publishedAt": "2020-11-18T02:08:18Z", "content": "A man works in a laboratory of Chinese vaccine maker Sinovac Biotech, developing an experimental vaccine.\r\nSINGAPORE/BEIJING: Sinovac Biotech's experimental COVID-19 vaccine CoronaVac triggered a qui… [+4155 chars]"}, {"source": {"id": "xinhua-net", "name": "Xinhua Net"}, "author": null, "title": "Brazil's COVID-19 death toll rises to 166,699 - Xinhua | English.news.cn - Xinhua", "description": null, "url": "http://www.xinhuanet.com/english/2020-11/18/c_139524021.htm", "urlToImage": null, "publishedAt": "2020-11-18T02:00:27Z", "content": "RIO DE JANEIRO, Nov. 17 (Xinhua) -- The Brazilian Ministry of Health on Tuesday reported 685 deaths in the last 24 hours from COVID-19, three times the number registered on Monday, raising the nation… [+660 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "All successful weight loss diets have this one thing in common - Times of India", "description": "Your search for weight loss on the internet and there will be thousands of diets claiming to make you shed extra kilos.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/all-successful-weight-loss-diets-have-this-one-thing-in-common/photostory/79264585.cms", "urlToImage": "https://static.toiimg.com/photo/79264727.cms", "publishedAt": "2020-11-18T01:30:00Z", "content": "There are hundreds of diets on the Internet claiming to make you shed extra kilos. But the thing about all the diets is that not all of them work for everyone. Every body is different and thus everyo… [+345 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Dr Sumeet Singhania", "title": "How is COPD different from asthma? Tips for patients during COVID-19 crisis - Times Now", "description": "On World COPD Day, know what exactly chronic obstructive pulmonary disease is, how it is different from asthma, and what patients can do to live well with the chronic lung condition.", "url": "https://www.timesnownews.com/health/article/how-is-copd-different-from-asthma-tips-for-patients-during-covid-19-crisis/683117", "urlToImage": "https://imgk.timesnownews.com/story/copd_0.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-18T01:01:39Z", "content": "Chronic obstructive pulmonary disease or COPD is one of most the common illnesses leading to morbidity and death across the world and its incidence is growing every year. COPD patients develop an ong… [+3885 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "The county with no coronavirus cases (and plenty of suspicion) - Deccan Herald", "description": "Zoom in on the glowing red map of ever-escalating coronavirus cases in the continental United States and you will find one county that has been spared. Only one, from coast to coast. Like a lone house standing after a tornado has leveled a town, Loving County…", "url": "https://www.deccanherald.com/international/the-county-with-no-coronavirus-cases-and-plenty-of-suspicion-916964.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/580835-01-03-916964-1605658830.jpg", "publishedAt": "2020-11-18T00:20:30Z", "content": "Zoom in on the glowing red map of ever-escalating coronavirus cases in the continental United States and you will find one county that has been spared. Only one, from coast to coast.\r\nLike a lone hou… [+9018 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Miyoung Kim, Roxanne Liu", "title": "Sinovac's COVID-19 vaccine induces quick immune response - study - Reuters India", "description": "Sinovac Biotech's <SVA.O> experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday.", "url": "https://in.reuters.com/article/health-coronavirus-sinovac-idINKBN27X35I", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201118&t=2&i=1541569634&r=LYNXMPEGAG1X8&w=800", "publishedAt": "2020-11-17T23:42:00Z", "content": "SINGAPORE/BEIJING (Reuters) - Sinovac Biotech's SVA.O experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had r… [+4422 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Immunity to the novel coronavirus may last many years, repeated vaccination will not be necessary: Study - Deccan Herald", "description": "How long might immunity to the coronavirus last? Years, maybe even decades, according to a new study — the most hopeful answer yet to a question that has shadowed plans for widespread vaccination. Eight months after infection, most people who have recovered s…", "url": "https://www.deccanherald.com/science-and-environment/immunity-to-the-novel-coronavirus-may-last-many-years-repeated-vaccination-will-not-be-necessary-study-916941.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/vaccine-coronavirus-covid-19-reuters-916941-1605665296.jpg", "publishedAt": "2020-11-17T22:34:24Z", "content": "How long might immunity to the coronavirus last? Years, maybe even decades, according to a new study the most hopeful answer yet to a question that has shadowed plans for widespread vaccination.\r\nEig… [+6485 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Andrea Michelson", "title": "Mouthwash may kill coronavirus in a lab but it won't stop transmission among people - Business Insider India", "description": "Using mouthwash is not an effective way to prevent the spread of the coronavirus. Studies have shown that certain oral rinses are capable of killing the virus", "url": "https://www.businessinsider.in/science/health/news/mouthwash-may-kill-coronavirus-in-a-lab-but-it-wont-stop-transmission-among-people/articleshow/79271731.cms", "urlToImage": "https://www.businessinsider.in/photo/79271731/mouthwash-may-kill-coronavirus-in-a-lab-but-it-wont-stop-transmission-among-people.jpg?imgsize=667550", "publishedAt": "2020-11-17T19:24:00Z", "content": "A new study by researchers at Cardiff University found certain mouthwash formulations can kill coronavirus within 30 seconds in a laboratory setting.\r\nThe preprint, which has not yet been peer review… [+3152 chars]"}, {"source": {"id": null, "name": "India New England"}, "author": null, "title": "Many older adults won't treat their depression: Study - India New England", "description": "New York– Nearly two-third (61 per cent) of the people in the US aged 65 or more, who have concerns about having depression, will not seek treatment, said researchers, including one of Indian-origin. A new nationwide poll, the GeneSight Mental Health Monitor,…", "url": "https://indianewengland.com/2020/11/many-older-adults-wont-treat-their-depression-study/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2016/04/depression.jpg", "publishedAt": "2020-11-17T18:48:00Z", "content": "New York– Nearly two-third (61 per cent) of the people in the US aged 65 or more, who have concerns about having depression, will not seek treatment, said researchers, including one of Indian-origin.… [+1283 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Life can continue even after death... - Daily Excelsior", "description": "Dr. (Prof). S.L. Kachroo/Anshu Sharma The History of Mankind is a history of Diseases. Since its inception, the Challenge of multitude of diseases", "url": "https://www.dailyexcelsior.com/life-can-continue-even-after-death/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2018/08/dailyexcelsior.jpg", "publishedAt": "2020-11-17T18:46:00Z", "content": "Dr. (Prof). S.L. Kachroo/Anshu SharmaThe History of Mankind is a history of Diseases. Since its inception, the Challenge of multitude of diseases confronted the human and animal world. Although many … [+4942 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Ricardo Brito, Anthony Boadle", "title": "Brazil to receive China's Sinovac COVID-19 vaccine, eyes Pfizer candidate - Reuters India", "description": "Brazil's Sao Paulo state is set to begin importing the first of 46 million doses of China's Sinovac vaccine against COVID-19 this week, while the federal government takes a more cautious approach with a vaccine developed by Pfizer Inc.", "url": "https://in.reuters.com/article/health-coronavirus-sinovac-brazil-idINKBN27Y077", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201118&t=2&i=1541572261&r=LYNXMPEGAH03L&w=800", "publishedAt": "2020-11-17T18:07:00Z", "content": "BRASILIA (Reuters) - Brazils Sao Paulo state is set to begin importing the first of 46 million doses of Chinas Sinovac vaccine against COVID-19 this week, while the federal government takes a more ca… [+2027 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Teeth grinding, facial pain increase due to COVID-19 stress, anxiety: Study - Zee News", "description": "The stress and anxiety experienced by the general population during Israel`s first lockdown brought about a significant rise in orofacial and jaw pain, as well as jaw-clenching in the daytime and teeth-grinding at night, according to a new study from Tel Aviv…", "url": "https://zeenews.india.com/health/teeth-grinding-facial-pain-increase-due-to-covid-19-stress-anxiety-study-2325219", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/17/899797-covid-world-reuterss.jpg", "publishedAt": "2020-11-17T17:53:39Z", "content": "Washington: The stress and anxiety experienced by the general population during Israel`s first lockdown brought about a significant rise in orofacial and jaw pain, as well as jaw-clenching in the day… [+1970 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Excess egg consumption can increase the risk of diabetes, finds out research - Zee News", "description": "New research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes.", "url": "https://zeenews.india.com/health/excess-egg-consumption-can-increase-the-risk-of-diabetes-finds-out-research-2325218", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/17/899796-egg-ians.jpg", "publishedAt": "2020-11-17T17:50:51Z", "content": "Washington: New research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes. Conducted in partnership with the China Medical University, and Q… [+2528 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rob Waugh", "title": "You can safely wear a mask while jogging, according to science - Yahoo India News", "description": "There is little evidence that masks alter the flow of oxygen, according to US researchers.", "url": "https://in.news.yahoo.com/mask-jogging-covid-174733414.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/iaNKCtCTUxKRuyeoxHLvVA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/os/creatr-uploaded-images/2020-11/b8537940-28fc-11eb-9ffd-97d06ea57692", "publishedAt": "2020-11-17T17:47:00Z", "content": "It's safe to wear a mask when exercising, research has shown. (Getty)\r\nEarlier this year, the World Health Organization warned that people should not wear masks while exercising, saying that they may… [+2710 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Major measles outbreaks forecast for 2021 due to Covid: Study - Bangalore Mirror", "description": "Researchers have stressed that major measles outbreaks will likely occur in the wake of the Covid-19 pandemic as early as 2021 due to many missed vaccinations.", "url": "https://bangaloremirror.indiatimes.com/news/india/major-measles-outbreaks-forecast-for-2021-due-to-covid-study/articleshow/79268988.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-408834,msid-79269092/79269092.jpg", "publishedAt": "2020-11-17T17:30:00Z", "content": "Sydney, Researchers have stressed that major measles\r\n outbreaks will likely occur in the wake of the Covid-19 pandemic\r\n as early as 2021 due to many missed vaccinations\r\n.\r\nMeasles is a highly cont… [+2482 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Polypill in addition to headache medicine and polypill alone reduced cardiovascular sickness hazard - Microbioz India", "description": "A single, daily pill combining blood pressure and cholesterol medications, as well as the addition of a daily dose of aspirin, reduced cardiovascular disease events in people at risk for heart disease, according to late-breaking study presented today in a lat…", "url": "https://microbiozindia.com/health-news/polypill-in-addition-to-headache-medicine-and-polypill-alone-reduced-cardiovascular-sickness-hazard/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/11/GettyImages-97537745-59efa47d6f53ba0011c0070b.jpg", "publishedAt": "2020-11-17T17:27:30Z", "content": "A single, daily pill combining blood pressure and cholesterol medications, as well as the addition of a daily dose of aspirin, reduced cardiovascular disease events in people at risk for heart diseas… [+4893 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Obese people found to be at increased risk of Covid-19 - Bangalore Mirror", "description": "Several observational studies have reported the link between cardiovascular risk factors (such as obesity, high blood pressure, diabetes and high cholesterol) and COVID-19 severity. However, these st", "url": "https://bangaloremirror.indiatimes.com/news/india/obese-people-found-to-be-at-increased-risk-of-covid-19/articleshow/79268803.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-654083,msid-79268899/79268899.jpg", "publishedAt": "2020-11-17T17:20:00Z", "content": "A new study led by researchers at Queen Mary University of London uses a novel approach to investigate the effects of cardiovascular risk factors\r\n on the risk of COVID-19 infection\r\n.\r\nSeveral obser… [+1584 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Volunteers still needed to test variety of COVID-19 vaccines - Economic Times", "description": "Moderna Inc. and competitor Pfizer Inc. recently announced preliminary results showing their vaccines appear more than 90% effective, at least for short-term protection against COVID-19.", "url": "https://economictimes.indiatimes.com/news/international/world-news/volunteers-still-needed-to-test-variety-of-covid-19-vaccines/articleshow/79268514.cms", "urlToImage": "https://img.etimg.com/thumb/msid-79268548,width-1070,height-580,imgsize-75869,overlay-economictimes/photo.jpg", "publishedAt": "2020-11-17T17:06:00Z", "content": "Two COVID-19 vaccines might be nearing the finish line, but scientists caution it's critical that enough people volunteer to help finish studying other candidates in the U.S. and around the world.\r\nM… [+5211 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Health Desk", "title": "Follow these 8 lifestyle tips to take care of your heart by staying at home - India TV News", "description": "Don't let staying at home due to COVID-19 pandemin affect your heart. Keep your vital organ healthy by following these simple lifestyle tips at home.", "url": "https://www.indiatvnews.com/health/follow-these-8-lifestyle-tips-to-take-care-of-your-heart-by-staying-at-home-665534", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/11/heart-2-1605631620.jpg", "publishedAt": "2020-11-17T16:58:42Z", "content": "Image Source : FREEPIK 8 lifestyle tips for a healthy heart\r\nLockdown during COVID-19 pandemic has made our lifestyle sedantary which has had a direct impact on our health. Sitting without much physi… [+1926 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: This woman lost 34 kilos by following Keto and Intermittent Fasting! - Times of India", "description": "Health complications and a back surgery made 31-year-old Soumya Rajan concerned for her health. Determined to make the change happen, the mother of one did her own research and lost all the weight in ten months by following Keto and Intermittent Fasting. All …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-this-woman-lost-34-kilos-by-following-keto-and-intermittent-fasting/photostory/79265608.cms", "urlToImage": "https://static.toiimg.com/photo/79265958.cms", "publishedAt": "2020-11-17T16:30:00Z", "content": null}, {"source": {"id": null, "name": "ThePrint"}, "author": "Kairvy Grewal", "title": "Covid caused ‘significant’ depressive symptoms among young adults in US, finds study - ThePrint", "description": "Study finds 80% of 1,008 respondents had elevated levels of loneliness, depression, anxiety and increased substance abuse among people aged between 18 and 35 years.", "url": "https://theprint.in/health/covid-caused-significant-depressive-symptoms-in-80-young-adults-in-us-finds-study/546404/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/12/Representational-image-depression.jpg", "publishedAt": "2020-11-17T16:18:45Z", "content": "New Delhi: A new study found that the coronavirus pandemic has led to elevated levels of loneliness, depression, anxiety and increased substance abuse among young adults in the US.\r\nAlmost 80 per cen… [+3101 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "Night shift workers at high risk of severe asthma: Study - India TV News", "description": "'This misalignment is associated with a heightened risk of various metabolic disorders, cardiovascular disease, and cancer,' said study authors from University of Manchester in the UK.", "url": "https://www.indiatvnews.com/health/night-shift-workers-at-high-risk-of-severe-asthma-study-665516", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/11/work-1605627594.jpg", "publishedAt": "2020-11-17T15:40:23Z", "content": "Image Source : FREEPIKNight shift affects health\r\nIn a major study, researchers have revealed that shift workers, especially those working permanently in the night rotation, may be at heightened risk… [+2498 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Himani Chandna", "title": "6 in 10 diabetics in India worry about catching Covid, getting hospitalised, study finds - ThePrint", "description": "Study by market research firm Kantar also finds that more city residents are worried about uncontrolled blood sugar levels in general.", "url": "https://theprint.in/health/6-in-10-diabetics-in-india-worry-about-catching-covid-getting-hospitalised-study-finds/546299/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/04/diabetes.jpg", "publishedAt": "2020-11-17T15:11:07Z", "content": "New Delhi: Six in every 10 diabetics surveyed in India have expressed concern about catching Covid-19 and getting hospitalised for the disease, found a study by UK-based market research firm Kantar.\r… [+3623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "World COPD Day 2020: Know Theme, Significance And History More - Doctor NDTV", "description": "World COPD Day 2020: This day tries to create awareness about Chronic Obstructive Pulmonary Disease. Read here to know the date, theme, significance, history and much more about this day.", "url": "https://doctor.ndtv.com/living-healthy/world-copd-day-2020-know-theme-significance-and-history-more-2326502", "urlToImage": "https://c.ndtvimg.com/2020-03/bebpqq7g_supermarket-cough_625x300_27_March_20.jpg", "publishedAt": "2020-11-17T15:02:21Z", "content": "World COPD Day is observed on every third Wednesday of November. This year the day falls on 18 November 2020. This day aims to create awareness about COPD and ways to reduce the burden. Chronic Obstr… [+2443 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Researchers believe this supplement can cut the risk of COVID-19 - Times of India", "description": "While the coronavirus continues to devastate lives, scientists are looking for new ways to control the deadly virus.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-researchers-believe-this-supplement-can-cut-the-risk-of-covid-19/photostory/79264039.cms", "urlToImage": "https://static.toiimg.com/photo/79264182.cms", "publishedAt": "2020-11-17T15:00:00Z", "content": "For the study, scientists sifted through data from Cleveland Clinic's COVID-19 registry. It was found that patients who took melatonin were 30 per cent less likely to test positive for COVID-19 causi… [+464 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Who will be the first to get COVID-19 vaccines? - Moneycontrol", "description": "An expert panel advising the U.S. Centers for Disease Control and Prevention is also considering giving high priority to workers in essential industries, people with certain medical conditions and people age 65 and older.", "url": "https://www.moneycontrol.com/news/world/who-will-be-the-first-to-get-covid-19-vaccines-6127381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/coronaviruscoronavirus-vaccinecovid-19-vaccine-770x433.jpg", "publishedAt": "2020-11-17T14:04:00Z", "content": "No decision has been made, but the consensus among many experts in the U.S. and globally is that health care workers should be first, said Sema Sgaier of the Surgo Foundation, a nonprofit group worki… [+993 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Delhi sees 1 lakh new COVID-19 cases; 1,200 deaths; 94,000 recoveries since November 1 - The Hindu", "description": "On November 12, 104 coronavirus-related deaths, the highest in over five months, were recorded in the city", "url": "https://www.thehindu.com/news/cities/Delhi/delhi-sees-1-lakh-new-covid-19-cases-1200-deaths-94000-recoveries-since-november-1/article33117680.ece", "urlToImage": "https://www.thehindu.com/news/cities/Delhi/1alfol/article33117679.ece/ALTERNATES/LANDSCAPE_615/DELHIKB", "publishedAt": "2020-11-17T12:34:50Z", "content": "Delhi recorded over one lakh new coronavirus cases and around 1,200 deaths between November 1-16 while nearly 94,000 COVID-19 patients recovered during the same period, according to official data rel… [+1955 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shikha Desai", "title": "Effects of air pollution and ways to protect your skin from it - Times of India", "description": "You feel you have wasted your youth at the age of 30 when you see grey hair, wrinkles on your skin and all other vi", "url": "https://timesofindia.indiatimes.com/life-style/beauty/effects-of-air-pollution-and-ways-to-protect-your-skin-from-it/articleshow/79261746.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79261746,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-68915/79261746.jpg", "publishedAt": "2020-11-17T12:32:00Z", "content": "You feel you have wasted your youth at the age of 30 when you see grey hair, wrinkles on your skin and all other visible signs of ageing. You wonder what went wrong, after all, you pumped iron in the… [+2889 chars]"}, {"source": {"id": null, "name": "European Pharmaceutical Review"}, "author": null, "title": "WHO lists first vaccine for emergency use - European Pharmaceutical Review", "description": "The nOPV2 vaccine has received emergency use listing and will be used to combat outbreaks of circulating vaccine-derived polio viruses.", "url": "https://www.europeanpharmaceuticalreview.com/news/133632/who-lists-first-vaccine-for-emergency-use/", "urlToImage": "https://www.europeanpharmaceuticalreview.com/wp-content/uploads/Polio-vaccine-1-scaled-e1605612460426.jpg", "publishedAt": "2020-11-17T11:34:30Z", "content": "Posted: 17 November 2020 | Hannah Balfour (European Pharmaceutical Review) | No comments yet\r\nThe nOPV2 vaccine has received emergency use listing and will be used to combat outbreaks of circulating … [+2512 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Kids Below 2 Should Not be Given Antibiotics, Here's Why - India.com", "description": "Administering antibiotics to children below 2 can lead to severe complications. Read on to know about them.", "url": "https://www.india.com/lifestyle/kids-below-2-should-not-be-given-antibiotics-heres-why-4213334/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/11/Bby.jpg", "publishedAt": "2020-11-17T11:03:18Z", "content": "Most pediatricians presume that antibiotics are safe for kids, however, a new study has revealed the opposite. Antibiotics, if given to children below the age of 2 can cause several illnesses or cond… [+1349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Feeling Stressed? Mediterranean Diet May Help Reduce Its Effects On Health - Study - NDTV Food", "description": "Food plays an important role in leading a healthy lifestyle. A well-balanced diet with every essential nutrient can do wonders for our overall health.", "url": "https://food.ndtv.com/news/feeling-stressed-mediterranean-diet-may-help-reduce-its-effects-on-health-study-2326349", "urlToImage": "https://c.ndtvimg.com/2019-07/mb183rdg_weight-loss_625x300_25_July_19.jpg", "publishedAt": "2020-11-17T10:53:07Z", "content": "In this fast-paced competitive world, stress has been one of the major factors affecting human life across the globe. It is, in fact, one of the major concerns we all are dealing with. Stress not onl… [+1955 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany May Cull Up To 70,000 Chickens After Bird Flu Found On Another Farm - NDTV", "description": "Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to 70,000 poultry is being prepared, authorities said on Tuesday.", "url": "https://www.ndtv.com/world-news/germany-may-cull-up-to-70-000-chickens-after-bird-flu-found-on-another-farm-2326346", "urlToImage": "https://c.ndtvimg.com/2019-09/0isuishs_chicken-generic_625x300_13_September_19.jpg", "publishedAt": "2020-11-17T10:46:50Z", "content": "A series of outbreaks of bird flu have been reported in Europe in past weeks (Representational)\r\nHamburg: Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to… [+1567 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Healthy sleep habits help lower risk of heart failure: Study - The Statesman", "description": "Healthy sleep patterns are rising in the morning, sleeping 7-8 hours a day and having no frequent insomnia, snoring or excessive daytime sleepiness, the study published in the journal Circulation said.", "url": "https://www.thestatesman.com/lifestyle/healthy-sleep-habits-help-lower-risk-heart-failure-study-1502935806.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/11/QT-Sleep.jpg", "publishedAt": "2020-11-17T10:36:34Z", "content": "Researchers have revealed that adults with the healthiest sleep pattern have 42 per cent lower risk of heart failure regardless of other risk factors compared to adults with unhealthy sleep patterns.… [+1944 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes Diet: This Kalonji Paratha May Help Manage Blood Sugar Levels - NDTV Food", "description": "Diabetes is one condition that is irreversible and can only be manged by a good diet and lifestyle. Kalonji is one of those foods that may help manage the blood sugar levels.", "url": "https://food.ndtv.com/food-drinks/diabetes-diet-this-kalonji-paratha-may-help-manage-blood-sugar-levels-2326244", "urlToImage": "https://c.ndtvimg.com/2020-02/ad724kv_aloo-paratha_625x300_06_February_20.jpg", "publishedAt": "2020-11-17T10:27:44Z", "content": "Kalonji or black onion seeds, for instance, is a popular ingredient in Indian curries.\r\nCrispy, hot and topped with ghee or butter, parathas are a weakness of many. But those suffering from lifestyle… [+2668 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus update: Some masks likely to cause skin issues; Here is what experts advise - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2Nvcm9uYXZpcnVzLXVwZGF0ZS1zb21lLW1hc2tzLWxpa2VseS10by1jYXVzZS1za2luLWlzc3Vlcy1oZXJlLWlzLXdoYXQtZXhwZXJ0cy1hZHZpc2UvMjEzMDEyNS_SAZUBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vbGlmZXN0eWxlL2hlYWx0aC9jb3JvbmF2aXJ1cy11cGRhdGUtc29tZS1tYXNrcy1saWtlbHktdG8tY2F1c2Utc2tpbi1pc3N1ZXMtaGVyZS1pcy13aGF0LWV4cGVydHMtYWR2aXNlLzIxMzAxMjUvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T10:23:00Z", "content": null}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "National Epilepsy Day 2020: Know all about symptoms, causes, significance - DNA India", "description": "Epilepsy is a chronic brain disorder that results in recurrent 'seizures' or 'fits'. Seizures occur due to the sudden, excessive electrical discharges in the neurons or brain cells.", "url": "https://www.dnaindia.com/health/report-national-epilepsy-day-2020-know-all-about-symptoms-causes-significance-2856956", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/11/17/938083-national-epilepsy-day.jpg", "publishedAt": "2020-11-17T08:30:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Actively speaking two languages protects against cognitive decline, say researchers - Times of India", "description": "Having command of more than one language is enriching and offers people a doorway to other cultures, according to a", "url": "https://timesofindia.indiatimes.com/life-style/books/features/actively-speaking-two-languages-protects-against-cognitive-decline-say-researchers/articleshow/79259317.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79259340,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-49452/79259340.jpg", "publishedAt": "2020-11-17T08:00:00Z", "content": "Having command of more than one language is enriching and offers people a doorway to other cultures, according to a new study which found that using languages actively provides neurological benefits … [+4903 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "TB treatment during Covid pandemic: Experts raise questions over India’s approach - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL3RiLXRyZWF0bWVudC1kdXJpbmctY292aWQtcGFuZGVtaWMtZXhwZXJ0cy1yYWlzZS1xdWVzdGlvbnMtb3Zlci1pbmRpYXMtYXBwcm9hY2gvMjEzMDA1Ny_SAY8BaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vbGlmZXN0eWxlL2hlYWx0aC90Yi10cmVhdG1lbnQtZHVyaW5nLWNvdmlkLXBhbmRlbWljLWV4cGVydHMtcmFpc2UtcXVlc3Rpb25zLW92ZXItaW5kaWFzLWFwcHJvYWNoLzIxMzAwNTcvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T07:39:00Z", "content": null}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "New diabetes drug Empagliflozin significantly reduces cases of heart failure in both diabetics and non-diabetics - BusinessLine", "description": "This drug did not seem to trigger hypoglycemia, or low blood sugar, in non-diabetic patients", "url": "https://www.thehindubusinessline.com/news/science/new-diabetes-drug-empagliflozin-significantly-reduces-cases-of-heart-failure-in-both-diabetics-and-non-diabetics/article33113920.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/pxihm5/article33113919.ece/ALTERNATES/LANDSCAPE_615/pills", "publishedAt": "2020-11-17T07:30:17Z", "content": "A recently developed drug for diabetes patients Empagliflozin can help in the treatment of heart failure in both diabetics and non-diabetics.\r\nThe findings of the clinical trial were published in the… [+1198 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "These researchers tested Covid-19 positive but the virus wasn’t the cause - Deccan Herald", "description": "In mid-June, Timothy Wannier tested positive for the novel coronavirus. Within 48 hours of receiving his jarring result, he felt almost certain there had been a mistake. “The evidence was overwhelmingly obvious,” said Wannier, a geneticist at Harvard Universi…", "url": "https://www.deccanherald.com/science-and-environment/these-researchers-tested-covid-19-positive-but-the-virus-wasn-t-the-cause-916521.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/17/corona-517467119202-916521-1605611939.jpg", "publishedAt": "2020-11-17T07:19:54Z", "content": "In mid-June, Timothy Wannier tested positive for the novel coronavirus. Within 48 hours of receiving his jarring result, he felt almost certain there had been a mistake.\r\nThe evidence was overwhelmin… [+10817 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Arthritis drug may offer hope for older Covid-19 patients - The Indian Express", "description": "Using artificial intelligence, Imperial team initially identified it as a drug that could have antiviral and anti-inflammatory effects.", "url": "https://indianexpress.com/article/explained/arthritis-drug-may-offer-hope-for-older-covid-19-patients-7054117/", "urlToImage": "https://images.indianexpress.com/2020/11/Covid-13.jpg", "publishedAt": "2020-11-17T07:08:49Z", "content": "A runner passes by a window displaying portraits of people wearing face coverings to help prevent the spread of the coronavirus, Monday, Nov. 16, 2020, in Lewiston, Maine. (AP Photo: Robert F. Bukaty… [+1325 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Covid-19 has potential to induce diabetes, find Indian researchers - Medical Dialogues", "description": "Dr V.K. Shivane, A.R. Lila and T.R. Bandgar from the department of endocrinology, KEM Hospital have...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/covid-19-has-potential-to-induce-diabetes-find-indian-researchers-71507", "urlToImage": "https://medicaldialogues.in/h-upload/2020/10/21/141242-covid.jpg", "publishedAt": "2020-11-17T06:33:29Z", "content": "The research paper has been published in the Journal of Postgraduate Medicine, the official publication of the Seth Gordhandas Sunderdas Medical College and King Edward Memorial Hospital, Mumbai.\r\nAc… [+2069 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "New treatment to treat lung metastasis - Tech Explorist", "description": "Scientists focused on treating the metastasis itself by delivering immune-cell-attracting chemicals into lung cancers via red blood cells.", "url": "https://www.techexplorist.com/new-treatment-treat-lung-metastasis/36193/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2020/11/EASI-system.jpg", "publishedAt": "2020-11-17T06:27:00Z", "content": "Metastasis is the spread of cancer cells to new areas of the body, often through the lymph system or bloodstream. Some kinds of cancer are more likely to spread to the lung than others. This is known… [+6678 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "ISS Experiment Shows Bacteria Can Extract Essential Minerals from Mars and Moon Rocks - News18", "description": "The ISS team believes that bacteria could one day be used to break rocks into the soil for growing crops, or to provide minerals for life support systems that produce air and water.", "url": "https://www.news18.com/news/buzz/iss-experiment-shows-bacteria-can-extract-essential-minerals-from-mars-and-moon-rocks-3088109.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605593818_untitled-design-2020-11-17t114559.898.png", "publishedAt": "2020-11-17T06:24:47Z", "content": "Life in space takes place in mysterious ways. A series of experiments performed by astronauts in the International Space Station (ISS) has shown that bacteria are capable of extracting useful materia… [+1797 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "How is money related to your mental and physical fitness? - News18", "description": ".", "url": "https://www.news18.com/news/partner-content/how-is-money-related-to-your-mental-and-physical-fitness-3088058.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605593078_315x230_02.jpg", "publishedAt": "2020-11-17T06:04:50Z", "content": "Why do we as human beings, worry? What leads us to stress about a particular matter? Why do we overthink ourselves to bits? What leads us to be wary and assume the worst? The answer is uncertainty\r\n.… [+3151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Include these foods in your daily diet to get healthy, glowing skin - The Indian Express", "description": "Ensure you incorporate these healthy foods in your diet to glow from \"inside out\"", "url": "https://indianexpress.com/article/lifestyle/life-style/winter-skincare-diet-foods-glowing-bright-skin-6995288/", "urlToImage": "https://images.indianexpress.com/2020/11/skincare_1200_getty.jpg", "publishedAt": "2020-11-17T05:20:29Z", "content": "Ensure your diet helps you tide over skincare troubles. (Source: Getty Images/Thinkstock)We all want our skin to glow and remain blemish-free throughout the year. However, it requires time and effort… [+2112 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "A change of heart -- new drug for HCM reduces heart mass - ANI News", "description": "Washington [US], November 17 (ANI): For the first time, medication has impacted heart muscle thickness and function for patients with the most common inherited heart condition, rather than simply addressing their symptoms.", "url": "https://www.aninews.in/news/health/a-change-of-heart-new-drug-for-hcm-reduces-heart-mass20201117104503", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Heart_nov15_osiztV9-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-17T05:15:37Z", "content": "ANI | Updated: Nov 17, 2020 10:45 IST\r\nWashington [US], November 17 (ANI): For the first time, medication has impacted heart muscle thickness and function for patients with the most common inherited … [+3776 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "‘Alarming’ levels of loneliness reported amidst Covid-19: Survey - BusinessLine", "description": "A new survey revealed that the coronavirus pandemic has led to “significant depressive symptoms” with over 80 per cent of people struggling with loneliness, depression, and other mental health issues.", "url": "https://www.thehindubusinessline.com/news/science/alarming-levels-of-loneliness-reported-amidst-covid-19-survey/article33113028.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/gkaprt/article33113027.ece/ALTERNATES/LANDSCAPE_615/BL18DEPRESSION", "publishedAt": "2020-11-17T05:10:43Z", "content": "A new survey revealed that the coronavirus pandemic has led to significant depressive symptoms with over 80 per cent of people struggling with loneliness, depression, and other mental health issues.\r… [+2401 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "CDCs new directive says that wearing a mask could keep you from catching the Coronavirus - Firstpost", "description": "by wearing a mask, it blocks out about 60 percent of the amount of virus that comes out of an infected person, the study found.", "url": "https://www.firstpost.com/health/cdcs-new-directive-says-that-wearing-a-mask-could-keep-you-from-catching-the-coronavirus-9020761.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/08/united-nations-covid-19-response-5hp3iqwZXD8-unsplash-1.jpg", "publishedAt": "2020-11-17T04:37:55Z", "content": "by wearing a mask, it blocks out about 60 percent of the amount of virus that comes out of an infected person, the study found.\r\n US health officials are taking a new tack to encourage Americans to w… [+2100 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Combination of polypill and aspirin can reduce cardiovascular events by up to 40% - News-Medical.Net", "description": "Heart attacks, strokes and other cardiovascular incidents can be cut by 20 to 40 per cent through use of a polypill which combines three blood pressure medications and a lipid lowering medication taken alone or with aspirin.", "url": "https://www.news-medical.net/news/20201116/Combination-of-polypill-and-aspirin-can-reduce-cardiovascular-events-by-up-to-4025.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fAspirin-620x480.jpg", "publishedAt": "2020-11-17T04:24:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 16 2020\r\nHeart attacks, strokes and other cardiovascular incidents can be cut by 20 to 40 per cent through use of a polypill which combines three blood pressure … [+7154 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Anoo Bhuyan | IndiaSpend", "title": "Covid-19 got global attention as it affected rich nations, says TB expert - Business Standard", "description": "The sudden focus on Covid-19 has had a significant negative impact on TB because in many countries the Covid-19 response has been built on or has utilised the TB response, says Grania Brigden", "url": "https://www.business-standard.com/article/current-affairs/covid-19-got-global-attention-as-it-affected-rich-nations-says-tb-expert-120111700290_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/misc/2020-07/14/full/20200713096L.jpg", "publishedAt": "2020-11-17T04:18:00Z", "content": "India, with 2.4 milliontuberculosis (TB) cases in 2019, has the most cases (27%) in the world. With attention focused on the COVID-19 pandemic, resources from government TB programmes around the worl… [+22886 chars]"}, {"source": {"id": null, "name": "NEWS HEADS"}, "author": "Ankit Pal", "title": "Why losing belly fat after 40 is difficult? How to overcome the issue - NEWS HEADS", "description": "Belly fat is one of the toughest areas to lose kilos and it becomes tougher after the age of 40. Today we will discuss why it becomes a difficult task after a certain age and how can we overcome it?", "url": "https://www.newsheads.in/lifestyle/health/why-losing-belly-fat-after-40-is-difficult-how-to-overcome-the-issue-article-64005", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/11/17/684412459-belly-fat_1200x675.jpg", "publishedAt": "2020-11-17T03:58:00Z", "content": "New Delhi : Belly fat is one of the toughest areas to lose kilos and it becomes tougher after the age of 40. Today we will discuss why it becomes a difficult task after a certain age and how can we o… [+1751 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr kartikeya kohli", "title": "Finerenone reduces risk of cardiac events in Diabetes with CKD: Study - Medical Dialogues", "description": "DALLAS - Researchers have found in a large, international clinical trial that novel medication...", "url": "https://medicaldialogues.in/nephrology/news/finerenone-reduces-risk-of-cardiac-events-in-diabetes-with-ckd-study-71501", "urlToImage": "https://medicaldialogues.in/h-upload/2020/11/13/142248-heartmonitorthmb.jpg", "publishedAt": "2020-11-17T03:08:23Z", "content": "DALLAS - Researchers have found in a large, international clinical trial that novel medication finerenone reduced the rate of death, heart attack, stroke and hospitalization for heart failure among p… [+2247 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Monoclonal antibody therapy cuts LDL cholesterol by half in high-risk patients - Times Now", "description": "The research team found that subcutaneous administration of the agent at 450 mg weekly resulted in LDL cholesterol lowering of 56 per cent, and 52.9 per cent at 300 mg weekly compared to the placebo group.", "url": "https://www.timesnownews.com/health/article/monoclonal-antibody-therapy-cuts-ldl-cholesterol-by-half-in-high-risk-patients/682650", "urlToImage": "https://imgk.timesnownews.com/story/iStock-498014044.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-17T02:32:30Z", "content": "Washington [US], November 16 (ANI): The investigational drug evinacumab reduced low-density lipoprotein (LDL) cholesterol--the so-called \"bad\" cholesterol--by 50 per cent in patients with severe hype… [+4577 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cardiovascular risk factor control is vital for adults with Type 2 diabetes - News-Medical.Net", "description": "Even when risk factors associated with cardiovascular disease are optimally controlled, adults with Type 2 diabetes still have a greater risk of developing cardiovascular disease compared to the general population, according to new research published today in…", "url": "https://www.news-medical.net/news/20201116/Cardiovascular-risk-factor-control-is-vital-for-adults-with-Type-2-diabetes.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fHeart_Disease-620x480.jpg", "publishedAt": "2020-11-17T00:23:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 16 2020\r\nEven when risk factors associated with cardiovascular disease are optimally controlled, adults with Type 2 diabetes still have a greater risk of develop… [+3749 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Healthcare workers may face PTSD, other mental health challenges from COVID-19 - KENS 5: Your San Antonio News Source", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WS1vcTUyeUNWQ1HSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-16T23:26:28Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Deadly ticks bite man, not his best friend, when temperatures rise - study - Devdiscourse", "description": "By Matthew Lavietes NEW YORK, Nov 16 (Thomson Reuters Foundation) - A type of deadly tick that bites dogs is more than twice as likely to feed on humans as temperatures rise, researchers said on Monday, underlining the health risks of climate change.  Ticks t…", "url": "https://www.devdiscourse.com/article/science-environment/1310006-deadly-ticks-bite-man-not-his-best-friend-when-temperatures-rise---study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/11_03_2020_13_25_51_351326.jpg?width=920&format=jpeg", "publishedAt": "2020-11-16T22:18:49Z", "content": "By Matthew Lavietes NEW YORK, Nov 16 (Thomson Reuters Foundation) - A type of deadly tick that bites dogs is more than twice as likely to feed on humans as temperatures rise, researchers said on Mond… [+1900 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Why antibiotics should not be given to kids below 2 - MENAFN.COM", "description": "<p>New York, Nov 16 (IANS) Antibiotics administered to children younger than two are associated with several ongoing illnesses or conditions, ranging from allergies to obesity, warn researchers.</p><p>For the study, published in the journal Mayo Clinic Procee…", "url": "https://menafn.com/1101135369/Why-antibiotics-should-not-be-given-to-kids-below-2", "urlToImage": "https://menafn.com/updates/pr/2020-11/16/I_6b2c999e-fimage_story.jpg", "publishedAt": "2020-11-16T21:04:23Z", "content": "(MENAFN - IANS) \r\nNew York, Nov 16 (IANS) Antibiotics administered to children younger than two are associated with several ongoing illnesses or conditions, ranging from allergies to obesity, warn re… [+2043 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "This arthritis drug may improve COVID survival in elderlies - The Shillong Times", "description": "Scientists have claimed that a type of arthritis drug called 'baricitinib' may reduce the risk of dying among elderly patients infected with Covid-19.This medication is usually used to treat rheumatoid arthritis, and was initially identified by the I", "url": "https://theshillongtimes.com/2020/11/17/this-arthritis-drug-may-improve-covid-survival-in-elderlies/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2020/06/GRAND-MOTHER-scaled.jpg", "publishedAt": "2020-11-16T19:47:00Z", "content": "Scientists have claimed that a type of arthritis drug called ‘baricitinib’ may reduce the risk of dying among elderly patients infected with Covid-19.This medication is usually used to treat rheumato… [+2410 chars]"}, {"source": {"id": null, "name": "Azadhindnews.com"}, "author": "https://www.facebook.com/arup.mandal.5", "title": "States Vow Extra Scrutiny of Coronavirus Vaccine - Azad Hind News", "description": "Within weeks, the Food and Drug Administration is expected to review safety and efficacy data for what may be the first Covid-19 vaccine in the United States, with hopes of immunizing some Americans soon after. But about a half-dozen states and the District o…", "url": "https://www.azadhindnews.com/world-news/usa/states-vow-extra-scrutiny-of-coronavirus-vaccine/", "urlToImage": null, "publishedAt": "2020-11-16T16:46:00Z", "content": "State officials have said Mr. Trumps loss in the election will not alter their plans for reviews. Indeed, the first F.D.A. authorizations may fall under Mr. Trumps watch. Pfizer announced last week t… [+1291 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Editorial", "title": "Dragging on - Millennium Post", "description": "As 2020 nears its end, the worldwide battle against COVID-19 continues as well, with many nations...", "url": "http://www.millenniumpost.in/editorial/dragging-on-423988", "urlToImage": "http://www.millenniumpost.in/h-upload/2020/11/16/533600-3852xtsqqp7zfwx3q0e3buaekzgdhbkecbq74336977.jpg", "publishedAt": "2020-11-16T16:32:24Z", "content": "As 2020 nears its end, the worldwide battle against COVID-19 continues as well, with many nations facing crippling third waves of infection. Hope for recovery, any real recovery lies with a working v… [+3904 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Giselda Vagnoni", "title": "Researchers find coronavirus was circulating in Italy earlier than thought - Reuters", "description": "The new coronavirus was circulating in Italy in September 2019, a study by the National Cancer Institute (INT) of the Italian city of Milan shows, signaling that it might have spread beyond China earlier than thought.", "url": "https://in.reuters.com/article/health-coronavirus-italy-timing-idUSKBN27W1J2", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201116&t=2&i=1541361048&r=LYNXMPEGAF0TO&w=800", "publishedAt": "2020-11-16T13:51:00Z", "content": "ROME (Reuters) - The new coronavirus was circulating in Italy in September 2019, a study by the National Cancer Institute (INT) of the Italian city of Milan shows, signaling that it might have spread… [+2217 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Researchers suggest SKI complex of SARS-CoV-2 as novel drug target - Drug Target Review", "description": "Researchers have discovered new drug compounds that target the SKI complex of SARS-CoV-2, preventing replication.", "url": "https://www.drugtargetreview.com/news/76256/researchers-suggest-ski-complex-of-sars-cov-2-as-novel-drug-target/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/SARS-CoV-2-9.jpg", "publishedAt": "2020-11-16T12:01:19Z", "content": "Posted: 16 November 2020 | Victoria Rees (Drug Target Review) | No comments yet\r\nResearchers have discovered new drug compounds that target the SKI complex of SARS-CoV-2, preventing replication.\r\nRes… [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Post-Diwali Detox: 5 Go-To Tips To Lose Festive Weight Gain - NDTV Doctor", "description": "Post-Diwali detox tips: Detox isn't about surviving on low-fat salads and celery juices. In fact, it is about restoring good health and losing weight in a sustainable manner. Here's how you can do it.", "url": "https://doctor.ndtv.com/living-healthy/post-diwali-detox-5-go-to-tips-to-lose-festive-weight-gain-2325777", "urlToImage": "https://c.ndtvimg.com/2020-11/hf15558_lifestyle-_625x300_16_November_20.jpg", "publishedAt": "2020-11-16T08:41:24Z", "content": "Post-Diwali detox: Diwali is over. But the guilt of eating kaju katli, laddoo and all of your favourite mithais is definitely not. If you have missed your workouts back-to-back and are now looking fo… [+3523 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Respiratory Failure in COVID-19 Remains a Mystery as New Study Rules Out Cytokine Storm | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The researchers analyzed immune cells and molecules in blood samples from 168 COVID-19 patients, 26 influenza patients and 16 healthy people. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-11-16-mystery-respiratory-failure-covid19-new-study-rules-out-cytokine", "urlToImage": "https://s.w-x.co/in-covid-19_5.jpg", "publishedAt": "2020-11-16T07:45:51Z", "content": "A study from Washington University School of Medicine in St. Louis and St. Jude Children's Research Hospital in Memphis, Tennessee, suggests that only 4 per cent of COVID-19 patients had the \"sky-hig… [+2346 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Engineers develop free mobile phone app for monitoring glucose levels in diabetic patients - News-Medical.Net", "description": "A computer vision technology developed by University of Cambridge engineers has now been developed into a free mobile phone app for regular monitoring of glucose levels in people with diabetes.", "url": "https://www.news-medical.net/news/20201116/Engineers-develop-free-mobile-phone-app-for-monitoring-glucose-levels-in-diabetic-patients.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fInsulin-620x480.jpg", "publishedAt": "2020-11-16T06:17:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 16 2020\r\nA computer vision technology developed by the University of Cambridge engineers has now been developed into a free mobile phone app for regular monitori… [+4747 chars]"}]}