{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Livemint.com"}, "author": "Gireesh Chandra Prasad", "title": "No trace of virus in imported goods, says Jubilant Life Sciences - Livemint", "description": "The firm’s Mysuru plant produces key ingredients for drugs used in treating respiratory tract infections.The company is is also following all protocols for prevention of covid-19, in addition to taking welfare measures for employees and the community, while s…", "url": "https://www.livemint.com/companies/news/no-trace-of-virus-in-imported-goods-says-jubilant-life-sciences-11587318041884.html", "urlToImage": "https://images.livemint.com/img/2020/04/19/600x338/JLS_1587318440253_1587318440580.jpg", "publishedAt": "2020-04-19T17:47:37Z", "content": "NEW DELHI :\r\nJubilant Life Sciences Ltd, which temporarily suspended operations at its Mysuru pharmaceutical plant last month, after a worker tested positive for coronavirus, has said no trace of the virus has been found in the imported raw material sampled f… [+2667 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Israeli scientist granted US patent for novel coronavirus vaccine design - Deccan Herald", "description": "In a major breakthrough, an Israeli scientist at the Tel Aviv University has been granted a US patent for his innovative vaccine design for the corona family of viruses, a press statement by the varsity said on Sunday. The patent has been granted by the Unite…", "url": "https://www.deccanherald.com/science-and-environment/israeli-scientist-granted-us-patent-for-novel-coronavirus-vaccine-design-827474.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/iStock-1210312125-1587315640.jpg", "publishedAt": "2020-04-19T17:00:40Z", "content": "In a major breakthrough, an Israeli scientist at the Tel Aviv University has been granted a US patent for his innovative vaccine design for the corona family of viruses, a press statement by the varsity said on Sunday.\r\nThe patent has been granted by the Unit… [+2153 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Coronavirus update: Maharashtra pulls plug on sanitisation domes & tunnels, says not effective - Livemint", "description": "Maharashtra health department said there is no scientific evidence to show that the sanitisation domes, rooms or tunnels that spray disinfectants on people are effective", "url": "https://www.livemint.com/news/india/coronavirus-update-maharashtra-pulls-plug-on-sanitisation-domes-tunnels-says-not-effective-11587314131840.html", "urlToImage": "https://images.livemint.com/img/2020/04/19/600x338/AFP_1QP0J8_1587314617349_1587314631890.jpg", "publishedAt": "2020-04-19T16:47:26Z", "content": "MUMBAI :\r\nMaharashtra, Maharashtra health department, sanitisation domes, sanitisation tunnels, disinfectants, coronavirus outbreak, coronavirus pandemic, disinfectant-spraying rooms, coronavirus news, coronavirus latest news, coronavirus latest update\r\nThe M… [+797 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "BS Web Team & Agencies", "title": "Covid-19: ICMR bats for Oxford vaccine, WHO lists 3 more as frontrunners - Business Standard", "description": "According to the WHO draft, from a total of 70 candidate vaccines in the race, three leading vaccines which are in human testing phase", "url": "https://www.business-standard.com/article/current-affairs/covid-19-icmr-bats-for-oxford-vaccine-who-lists-3-more-as-frontrunners-120041900954_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-04/18/full/1587206927-9446.jpg", "publishedAt": "2020-04-19T16:14:19Z", "content": "The Indian Council of Medical Research (ICMR) on Sunday said that a potential vaccine called ChAdOX1 a\" being developed by researchers at University of Oxford -- is the frontrunner in the race to take on the deadly Covid-19 pandemic which has infected over 2.… [+3679 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Coronavirus: 99 institutes willing to take part in clinical trial of plasma therapy, says ICMR - The Financial Express", "description": "Convalescent plasma is an experimental procedure for COVID-19 patients. As per the guidelines, hospitals and institutions planning to provide this modality of treatment should do so in a clinical trial with protocols which are cleared by the Institutional Eth…", "url": "https://www.financialexpress.com/lifestyle/health/coronavirus-99-institutes-willing-to-take-part-in-clinical-trial-of-plasma-therapy-says-icmr/1933429/", "urlToImage": "https://images.financialexpress.com/2020/04/COVID-9.jpg", "publishedAt": "2020-04-19T15:52:52Z", "content": "The Indian Council of Medical Research (ICMR) has received 99 applications from institutes expressing interest in participating in a randomised controlled study to assess the safety and efficacy of convalescent plasma to limit complications associated with CO… [+2048 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Do you wear braces? Food items you should avoid - Times of India", "description": "While braces can help in aligning your teeth, they do come with a list of do’s and don’ts. Usually regular brushing and eating soft foods can keep your braces healthy, there are some foods which should be avoided at any cost. Eating the below given foods can …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/do-you-wear-braces-food-items-you-should-avoid/photostory/75218484.cms", "urlToImage": "https://static.toiimg.com/photo/75218645.cms", "publishedAt": "2020-04-19T15:30:00Z", "content": "While braces can help in aligning your teeth, they do come with a list of do’s and don’ts. Usually regular brushing and eating soft foods can keep your braces healthy, there are some foods which should be avoided at any cost. Eating the below given foods can … [+167 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Coronavirus global updates, 19 April: Protests across Brazil, US against lockdown measures - The Indian Express", "description": "Coronavirus (COVID-19) Global Latest Updates: Hundreds of people in trucks, cars and motorcycles took the streets in Rio De Janeiro, Sao Paulo and Brasilia Saturday in an act to denounce lockdown measures already opposed by their president.", "url": "https://indianexpress.com/article/world/coronavirus-global-updates-19-april-europe-death-toll-tops-100000-protests-across-brazilus-against-lockdown-measures-6369029/", "urlToImage": "https://images.indianexpress.com/2020/04/ITALY11-1.jpg?w=759", "publishedAt": "2020-04-19T15:22:09Z", "content": "At least 2.3 million people have been infected and 160,518 have died globally due to the pandemic so far. (Reuters/File)COVID-19 Global Latest Updates:Coronavirus induced fatalities in Europe crossed 100,000, nearly two thirds of the overall global death toll… [+7449 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Dhirendra Kumar", "title": "10 DIY Skincare Hacks That Will Help You Get Rid Of Acne - ScoopWhoop", "description": "Go Acne Go!", "url": "https://www.scoopwhoop.com/health/10-diy-skin-hacks-that-will-help-you-get-rid-of-acne/", "urlToImage": "https://s4.scoopwhoop.com/anj2/5e9bf95b18ac8111b319cd90/a26a343b-2a82-4169-bd99-860a945b80a3.jpg", "publishedAt": "2020-04-19T14:26:54Z", "content": "Do you struggle with acne scars? Acne is normally caused by hormonal changes as a teenager, but it can last much longer. It is one of the most common skin conditions in the world, affecting an estimated 85% of people at some point in their lives. \r\nIf you dis… [+4354 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "DONALD G. MCNEIL JR.", "title": "What’s next for America in the coronavirus pandemic? - Chicago Tribune", "description": "More than 20 experts in public health, medicine, epidemiology and history shared their thoughts on the future during in-depth interviews. https://www.nytimes.com/2020/04/18/health/coronavirus-america-future.html", "url": "https://www.chicagotribune.com/coronavirus/ct-nw-nyt-cb-coronavirus-whats-next-20200419-re4qurwcnfd2nmqkkwrpqxwfgq-story.html", "urlToImage": "https://www.chicagotribune.com/resizer/D_jJJuF_oIbWvy_ZR7kMcKM2SYQ=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/V5XKB5G43VDI3E5PBHO4SRHN2U.jpg", "publishedAt": "2020-04-19T13:57:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK hospital COVID-19 deaths rise by smallest amount in nearly 2 weeks - Reuters", "description": "Britain's hospital death toll from COVID-19 rose by 596 to 16,060 as of 1600 GMT on April 18, the smallest increase in nearly two weeks, the health ministry said on Sunday", "url": "https://in.reuters.com/article/health-coronavirus-britain-fatalities-idINL9N2BW00T", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-04-19T13:28:00Z", "content": "LONDON, April 19 (Reuters) - Britain’s hospital death toll from COVID-19 rose by 596 to 16,060 as of 1600 GMT on April 18, the smallest increase in nearly two weeks, the health ministry said on Sunday \r\nData published on Sundays has tended show smaller increa… [+187 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Professor Luc Montagnier, Who Won Nobel Prize For Codiscovering AIDS Virus, Says Coronavirus Was Man-made In Wuhan Lab - Swarajya", "description": "Professor Coronavirus Was Man-made In Wuhan Lab", "url": "https://swarajyamag.com/insta/professor-luc-montagnier-who-won-nobel-prize-for-codiscovering-aids-virus-says-coronavirus-was-man-made-in-wuhan-lab", "urlToImage": "https://images.assettype.com/swarajya/2020-04/a7be2ced-481a-4d23-bab8-104d450e226e/MjAyMDA0YjY3NzVmZDY2OTk2YmE1OTYxMGRlZDM1MzdiNjU4NTU.jpg?w=700", "publishedAt": "2020-04-19T13:14:46Z", "content": null}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "Here's How Covid-19 Immunity Compares to Other Diseases - WIRED", "description": "To stop the pandemic, it is critical to know how our immune system's antibodies fight the coronavirus. This is what science can tell us so far.", "url": "https://www.wired.com/story/covid-19-immunity/", "urlToImage": "https://media.wired.com/photos/5e98beddd036ef00088bfc29/191:100/w_1280,c_limit/Science_antobodies_6b35cff987_o.jpg", "publishedAt": "2020-04-19T12:39:06Z", "content": "One of the many unknowns about the novel coronavirus SARS-CoV-2 is how we might become immune to it. When you get infected with viruses, along with other baddies like bacteria, your immune system fights back by producing proteins called antibodies. These stic… [+2644 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "ANI", "title": "3,86,791 Covid-19 tests conducted in India so far: ICMR - ThePrint", "description": "Dr Raman R Gangakhedkar, head scientist of ICMR, said of the 37,000 tests conducted on 18 April, 29,287 tests were done in the labs of the ICMR network.", "url": "https://theprint.in/india/386791-covid-19-tests-conducted-in-india-so-far-icmr/404801/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/covid-testing-scaled-e1586165716865.jpg", "publishedAt": "2020-04-19T12:33:45Z", "content": "New Delhi: The Indian Council of Medical Research (ICMR) on Sunday said that a total of3,86,791 COVID-19 tests have been conducted so far in the country. Out of these tests, over 37,000 tests were conducted on April 18 out of which 29,287 tests were done in t… [+1176 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, CNN", "title": "What you need to know about coronavirus on Sunday, April 19 - CNN", "description": "Less than a month ago, Singapore was being hailed as a country that got its coronavirus response right. The city-state seemed to have quashed the epidemic without the need for strict lockdowns.", "url": "https://www.cnn.com/2020/04/19/world/coronavirus-newsletter-04-19-20/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "publishedAt": "2020-04-19T11:45:39Z", "content": "A version of this story appeared in the April 19 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every day.\r\n (CNN)Less than a month ago, Singapore was being hailed as a country that got its corona… [+5035 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Swiss coronavirus death toll rises to 1,135, confirmed infections hit 27,740 - Reuters India", "description": "The Swiss death toll from the novel coronavirus has reached 1,135 people, the country's public health agency said on Sunday, rising from 1,111 on Saturday.", "url": "https://in.reuters.com/article/us-health-coronavirus-swiss-idINKBN2210FO", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200419&t=2&i=1515637445&w=1200&r=LYNXMPEG3I08J", "publishedAt": "2020-04-19T11:23:00Z", "content": "ZURICH (Reuters) - The Swiss death toll from the novel coronavirus has reached 1,135 people, the country’s public health agency said on Sunday, rising from 1,111 on Saturday. \r\nThe number of people showing positive tests for the disease increased to 27,740, i… [+81 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "Daily ethnicity data key to COVID-19 death disparity review: UK - The Siasat Daily", "description": "LONDON: The UK's leading doctors' union on Friday called on the government to ensure its review into the disproportionate impact of COVID-19 on black, Asian and minority ethnic communities must be informed by the real-time data collection for the real effect.…", "url": "https://www.siasat.com/daily-ethnicity-data-key-covid-19-death-disparity-review-uk-1876498/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/Coronavirus-2.jpg", "publishedAt": "2020-04-19T10:15:07Z", "content": "LONDON: The UK’s leading doctors’ union on Friday called on the government to ensure its review into the disproportionate impact of COVID-19 on black, Asian and minority ethnic communities must be informed by the real-time data collection for the real effect.… [+3860 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Sameer", "title": "Males more vulnerable to COVID-19: Are testicles responsible? - The Siasat Daily", "description": "New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system. What…", "url": "https://www.siasat.com/males-more-vulnerable-covid-19-are-testicles-responsible-1876362/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/testicles-.jpg", "publishedAt": "2020-04-19T10:00:00Z", "content": "New York: A study claimed that males are more vulnerable to COVID-19 when compared to women. The reason behind this increased risk for males is the presence of testicles that may not only harbor coronavirus but also give sanctuary from the immune system.\r\nWha… [+1183 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "ANI", "title": "CSIR testing anti-leprosy vaccine Mw for COVID-19, says DG Shekhar Mande - Yahoo India News", "description": "New Delhi [India], April 19 (ANI): Council of Scientific and Industrial Research (SCIR) Director-General Dr Shekhar C Mande on Sunday said that the institute is currently testing Mycobacterium w (Mw), which is a vaccine for leprosy, to treat COVID-19.  \"The r…", "url": "https://in.news.yahoo.com/csir-testing-anti-leprosy-vaccine-mw-covid-19-095143889.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "publishedAt": "2020-04-19T09:51:00Z", "content": "New Delhi [India], April 19 (ANI): Council of Scientific and Industrial Research (SCIR) Director-General Dr Shekhar C Mande on Sunday said that the institute is currently testing Mycobacterium w (Mw), which is a vaccine for leprosy, to treat COVID-19.\r\n\"The C… [+1442 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Genetic variation in immune system may affect coronavirus severity: Study - Deccan Herald", "description": "Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease. The research, published in the Journal of Vir…", "url": "https://www.deccanherald.com/science-and-environment/genetic-variation-in-immune-system-may-affect-coronavirus-severity-study-827261.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/19/microbiology-163470_1280-1587284789.jpg", "publishedAt": "2020-04-19T08:26:29Z", "content": "Genetic variability in the human immune system may affect susceptibility to, and severity of disease due to the novel coronavirus, according to a study which may help identify people at higher risk of the disease.\r\nThe research, published in the Journal of Vi… [+1754 chars]"}, {"source": {"id": null, "name": "Latestly.com"}, "author": "IANS", "title": "No Guarantee Coronavirus Vaccine Will be Developed, Says WHO Envoy David Nabarro - LatestLY", "description": "The World Health Organization (WHO) special envoy David Nabarro has warned that there is no guarantee that a coronavirus (COVID-19) vaccine can be successfully developed in coming months.", "url": "https://www.latestly.com/world/no-guarantee-coronavirus-vaccine-will-be-developed-says-who-envoy-david-nabarro-1693083.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/03/Coronavirus-vaccine-.jpg", "publishedAt": "2020-04-19T08:24:40Z", "content": "London, April 19: The World Health Organization (WHO) special envoy David Nabarro has warned that there is no guarantee that a coronavirus (COVID-19) vaccine can be successfully developed in coming months.\r\nNabarro who is one of the world's leading experts sa… [+1980 chars]"}]}