{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Scientists say this drug may help if you are struggling with long Covid complications - OrissaPOST", "description": "New York: After a Covid infection, its long term effects including brain fog, joint pain, exercise intolerance and fatigue have been affecting the daily lives of millions. Researchers from the University of California, Irvine, report the case of two middle-ag…", "url": "https://www.orissapost.com/scientists-say-this-drug-may-help-if-you-are-struggling-with-long-covid-complications/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2021/04/What-happens-when-coronavirus-enters-our-body.jpg", "publishedAt": "2022-02-14T02:00:08Z", "content": "New York: After a Covid infection, its long term effects including brain fog, joint pain, exercise intolerance and fatigue have been affecting the daily lives of millions.\r\nResearchers from the Unive… [+3129 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "International Epilepsy Day 2022: Surgery an answer to this neurological disorder? Listen to a brain surgeon - Times Now", "description": "Although many people are aware of the causes and symptoms of epilepsy, there are only a few who know that surgery can offer relief from the neuro disorder. This International Epilepsy Day, we sought to find out answers to how surgery can be an answer to this …", "url": "https://www.timesnownews.com/health/article/international-epilepsy-day-2022-surgery-an-answer-to-this-neurological-disorder-listen-to-a-brain-surgeon/858506", "urlToImage": "https://imgk.timesnownews.com/story/epilepsy_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-14T00:34:36Z", "content": "<ul><li>Epilepsy is a neurological disorder wherein brain activity becomes abnormal. </li></ul>\r\n<ul><li>This can include seizures, loss of awareness, strange sensations and unusual behaviour. </li><… [+3854 chars]"}, {"source": {"id": null, "name": "Smallcapnews.co.uk"}, "author": "Camelia Bacchus", "title": "Regenerative medicine has already been successfully applied to cases of knee osteoarthritis - SmallCapNews.co.uk", "description": "the knee joint stiffness It is a degenerative disease characterized by the gradual wear and tear of the cartilage that protects the bones of which it is composed Mutual. Today,…", "url": "https://www.smallcapnews.co.uk/regenerative-medicine-has-already-been-successfully-applied-to-cases-of-knee-osteoarthritis/", "urlToImage": null, "publishedAt": "2022-02-14T00:14:06Z", "content": "the knee joint stiffness It is a degenerative disease characterized by the gradual wear and tear of the cartilage that protects the bones of which it is composed Mutual. Today, thanks to advances in … [+4260 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moderate Calorie Restriction Rewires Metabolism, Immunity for Longer Health Span - SciTechDaily", "description": "Calorie restriction improves metabolic and immune responses that help determine both how long a person lives and how many years of good health they enjoy, a new study shows. “Two years of modest calorie restriction reprogrammed the pathways in fat cells that …", "url": "https://scitechdaily.com/moderate-calorie-restriction-rewires-metabolism-immunity-for-longer-health-span/", "urlToImage": "https://scitechdaily.com/images/Calorie-Restriction-Weight-Loss-Diet-Plan.jpg", "publishedAt": "2022-02-13T20:13:04Z", "content": "Calorie restriction improves metabolic and immune responses that help determine both how long a person lives and how many years of good health they enjoy, a new study shows.\r\n“Two years of modest cal… [+4144 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "COVID reinfections: are they milder and do they strengthen immunity? - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Norwich (UK), Feb 13: We’ve known since early on in the pandemic that COVID reinfections could occur. One of the first reinfections reported was in a 33-year-old man from Hong Kong. His initial infection was diagnosed on March 26 2020, with his second infecti…", "url": "https://www.dailyexcelsior.com/covid-reinfections-are-they-milder-and-do-they-strengthen-immunity/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/02/download-13-6.jpg", "publishedAt": "2022-02-13T19:01:03Z", "content": "Norwich (UK), Feb 13: We’ve known since early on in the pandemic that COVID reinfections could occur. One of the first reinfections reported was in a 33-year-old man from Hong Kong. His initial infec… [+6166 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Long Covid could be linked to effects of SARS-CoV-2 on vagus nerve: Study - Daily Pioneer", "description": "Many of the symptoms such as dizziness and difficulty in swallowing connected to post-Covid syndrome (PCC, also known as long Covid19) could be linked to the effect of the virus on the vagus nerve – one of the most important multi-functional nerves in the bod…", "url": "https://www.dailypioneer.com/2022/india/long-covid-could-be-linked-to-effects-of-sars-cov-2-on-vagus-nerve--study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-02-13T18:47:26Z", "content": "Many of the symptoms such as dizziness and difficulty in swallowing connected to post-Covid syndrome (PCC, also known as long Covid19) could be linked to the effect of the virus on the vagus nerve on… [+2096 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Elizabeth Yuko", "title": "You Don't Have to Suffer From Winter Eyes - Lifehacker", "description": "How can they possibly be both watery and dry at the same time?", "url": "https://lifehacker.com/you-dont-have-to-suffer-from-winter-eyes-1848520098", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/00fe31242ca64f8fc715ebf4621e1ebc.jpg", "publishedAt": "2022-02-13T18:00:00Z", "content": "In addition to our skin and our hair, winter also can take a toll on our eyesand for many of the same reasons. When its cold outside, we want to spend more time inside, where its warm and dry. Unfort… [+1925 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Paralyzed men start walking again after spinal cord implant: study - The bharat express news", "description": "New research and technologies are giving hope to people with paralysis. According to a new study published in natural medicine. \"Using this technology, we", "url": "https://www.thebharatexpressnews.com/paralyzed-men-start-walking-again-after-spinal-cord-implant-study/", "urlToImage": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/640/320/shah-hyperelastic-bone-3-d-printed-spine-copy.jpg?ve=1&tl=1", "publishedAt": "2022-02-13T16:50:16Z", "content": "New research and technologies are giving hope to people with paralysis. \r\nAccording to a new study published in natural medicine\r\n. \r\n“Using this technology, we were able to target people with the mo… [+4645 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Mosquito Vision Could Help in Hiding from Disease Vectors: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A new research led by scientists at the University of Washington has indicated that a common mosquito species (after detecting a tell-tale gas that we exhale) flies toward specific colours, including red…", "url": "https://www.latestly.com/agency-news/science-news-mosquito-vision-could-help-in-hiding-from-disease-vectors-study-3361738.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/Screenshot_20220213-213726__012022021316090320220213161242-588x441.jpg", "publishedAt": "2022-02-13T16:24:25Z", "content": "Washington [US], February 13 (ANI): A new research led by scientists at the University of Washington has indicated that a common mosquito species (after detecting a tell-tale gas that we exhale) flie… [+5457 chars]"}, {"source": {"id": null, "name": "One Green Planet"}, "author": "Holly Woodbury", "title": "Long-term Consequences of a Keto Diet - One Green Planet", "description": "This low-carb diet is promoted in magazines, all over social media, and by celebrities. But is this diet actually healthy?", "url": "https://www.onegreenplanet.org/natural-health/long-term-consequences-of-a-keto-diet/", "urlToImage": "https://149366112.v2.pressablecdn.com/wp-content/uploads/2022/01/shutterstock_1202336755-1200x800.jpg", "publishedAt": "2022-02-13T14:46:34Z", "content": "The Ketogenic diet has gained massive popularity in recent years. This low-carb diet is promoted in magazines, all over social media, and by celebrities. But is this diet actually healthy?\r\nFirst, le… [+4993 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "Omicron may cause brain complications, inflammations: Russian expert - IANS", "description": "According to founder and chief executive of DNKOM research center Andrey Isaev, although Omicron has been touted as causing mild infections, it can lead to long Covid in adults and systemic inflammations among children, TASS news agency reported.The", "url": "https://ianslive.in/news/omicron_may_cause_brain_complications_inflammations_russian_expert-849840/LatestNews/0", "urlToImage": "https://ianslive.in/upload/2022/February/13/r-1644757938202202131842182321_l.jpg", "publishedAt": "2022-02-13T14:43:04Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nMoscow, Feb 13 (IANS) The Omicron strain of the Covid-19 may lead to neurological complications much like other Covid variants, according to a Russian expert.\r\nAccording… [+2217 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Emily Shiffer", "title": "The #1 Best Supplement for Abdominal Fat, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "While diet and lifestyle changes are the way to go when it comes to losing abdominal fat, taking this supplement can also help.", "url": "http://www.eatthis.com/best-supplement-abdominal-fat/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/07/green-tea-supplements.jpg?quality=82&strip=all", "publishedAt": "2022-02-13T13:56:40Z", "content": "One of the most stubborn places to lose weight is in the abdomen. You may notice that the pounds just don't want to come off around your belly, no matter what you try.\r\n\"We store fat all over the bod… [+5113 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Most People are Getting Heart Attacks This Way, Experts Say — Eat This Not That - Eat This, Not That", "description": "Not getting enough exercise can lead to fatty material building up in your arteries causing them to clog which can lead to a heart attack.", "url": "http://www.eatthis.com/news-heart-attacks-causes-experts-say/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/09/woman-chest-pain-heart-attack-problem.jpg?quality=82&strip=all", "publishedAt": "2022-02-13T13:46:01Z", "content": "Heart disease is the leading cause of death in the U.S. and every year 805,000 people have a heart attackthat's one person every 40 seconds, according to the Centers for Disease Control and Preventio… [+5019 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Did you get covid? Here’s How Masturbation Can Help Mild Symptoms - Play Crazy Game", "description": "No, masturbation will not cure you of COVID-19. But when the worst of the symptoms are over and they are relatively better, masturbation can be a great ally and bring benefits such as relaxation, mood improvement and strengthening your immune system. MASTURBA…", "url": "https://playcrazygame.com/2022/02/13/did-you-get-covid-heres-how-masturbation-can-help-mild-symptoms/", "urlToImage": "https://boaforma.abril.com.br/wp-content/uploads/sites/2/2022/02/pexels-dainis-graveris-3773665.jpg?quality=90&strip=info&w=680&h=453&crop=1", "publishedAt": "2022-02-13T13:16:46Z", "content": "No, masturbation will not cure you of COVID-19. But when the worst of the symptoms are over and they are relatively better, masturbation can be a great ally and bring benefits such as relaxation, moo… [+3351 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "The risks of placenta damage & stillbirths - ETHealthworld.com", "description": "The study bolsters evidence from small case reports and it confirms that placenta damage rather than an infection of the foetus is the likely cause of many Covid-related stillbirths.", "url": "https://health.economictimes.indiatimes.com/news/industry/the-risks-of-placenta-damage-stillbirths/89547501", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-89547501,imgsize-39000,width-1200,height-628,overlay-ethealthworld/the-risks-of-placenta-damage-stillbirths.jpg", "publishedAt": "2022-02-13T13:15:00Z", "content": "Contact US\r\nWe have various options to advertise with us including Events, Advertorials, Banners, Mailers, Webinars etc. \r\nPlease contact us to know more details."}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "Eating Habits to Lower Your Cholesterol After 50, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "As you get older, your chances for high cholesterol increase. Here are some eating habits to help lower cholesterol and stay healthy.", "url": "http://www.eatthis.com/eating-habits-to-lower-your-cholesterol-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/Untitled-design-50-8.png", "publishedAt": "2022-02-13T12:46:16Z", "content": "Your body undergoes many significant shifts after you turn 50. For example, your heart health changes as the walls of your heart grow thicker and your arteries begin to stiffen more over time. Becaus… [+3509 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "How Covid variants escape cellular immune response - Ahmedabad Mirror", "description": "The T cell response in humans is genetically encoded by HLA molecules -- this means different individuals have different HLAs, programmed to recognise invading pathogens based on different parts, or &quot;epitopes&quot; of the pathogens.\n\nWhile experimental e…", "url": "https://ahmedabadmirror.com/how-covid-variants-escape-cellular-immune-response/81821120.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1644751996095.jpg-org", "publishedAt": "2022-02-13T11:52:24Z", "content": "The T cell response in humans is genetically encoded by HLA molecules -- this means different individuals have different HLAs, programmed to recognise invading pathogens based on different parts, or … [+1943 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Omicron: COVID patients reporting 3 new unusual symptoms; WHO, other studies explain why - Mint", "description": "Many Omicron patients are also complaining of gastrointestinal symptoms like diarrhoea, skipping of meals and abdominal pain, show studies", "url": "https://www.livemint.com/science/health/unusual-omicron-symptoms-covid-patients-reporting-3-new-symptoms-who-other-studies-explain-why-11644682134546.html", "urlToImage": "https://images.livemint.com/img/2022/02/12/600x338/HEALTH-CORONAVIRUS-SAFRICA-0_1644591271873_1644685014663.JPG", "publishedAt": "2022-02-13T11:42:12Z", "content": "Considering Omicron moves differently from the other COVID variants, one of the worrying factors is that the patients infected with it are showing varied symptoms which are distinct from each other. … [+3748 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Five reasons why coffee is a health food, according to scientists - The bharat express news", "description": "For many people, the day doesn't start until they've had the first or second cup of coffee.Coffee is their start button, their tonic for getting up and", "url": "https://www.thebharatexpressnews.com/five-reasons-why-coffee-is-a-health-food-according-to-scientists/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2022/02/1644557516-GettyImages-508347326-960x600.jpg", "publishedAt": "2022-02-13T11:00:44Z", "content": "For many people, the day doesn’t start until they’ve had the first or second cup of coffee.\r\nCoffee is their start button, their tonic for getting up and going.\r\nPeople have felt this for hundreds of… [+8365 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Vitamin D deficiency symptoms: Signs to spot at home that could signal ‘severe deficiency’ - Daily Express", "description": "DURING the winter it is recommended that people take vitamin D supplements to boost the strength of the immune system as the body does not produce enough from sunlight. If levels of vitamin D are too low this can have serious health complications.", "url": "https://www.express.co.uk/life-style/health/1565247/vitamin-d-deficiency-symptoms-climbing-stairs-walking", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1565247.jpg", "publishedAt": "2022-02-13T10:44:17Z", "content": "This includes severe pain and weakness in the muscles that may cause difficulties in everyday acts such as climbing stairs or getting up from a chair.\r\nAs a result, this can lead to a person developi… [+1714 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "High blood pressure: The ‘powerful tool’ you have at home shown to prevent the condition - Express", "description": "HYPERTENSION, otherwise known as high blood pressure, is a common condition that is easily treatable through a number of dietary and lifestyle changes. There can be any number of causes of hypertension ranging those a person can control to those they can't. N…", "url": "https://www.express.co.uk/life-style/health/1565226/high-blood-pressure-prevent-teeth-brushing", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1565226.jpg", "publishedAt": "2022-02-13T09:38:00Z", "content": "In the case of gum disease these complications include receding gums, loose teeth, loss of teeth, damage to the jaw and the tissue that connects the tooth to the socket.\r\nThese can be avoided through… [+375 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Vitamin D Deficiency Can Reduce Covid Vaccine Efficacy, Increase Infection Severity: Experts - News18", "description": "'Studies have shown how Vitamin D deficiencies can reduce vaccine efficacy and also increase the severity of Covid infection in individuals,' Dr Amitav Banerjee said.", "url": "https://www.news18.com/news/india/vitamin-d-deficiency-can-reduce-covid-vaccine-efficacy-increase-infection-severity-experts-4767161.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/us-hospital-florida-covid-reuters-164196761816x9.jpg", "publishedAt": "2022-02-13T09:23:56Z", "content": "India has started showing declining Covid trends over the past few weeks as the nation is reporting below one lakh Covid infection for the past few days. On Sunday, India reported below 50,000 Covid … [+2065 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "VijayaShankar", "title": "For people with meniscal tears, exercise and surgery are equally effective: Study - DTNext", "description": "In this study, the researchers demonstrated that young people with a meniscal tear initially undergoing surgery did not achieve superior outcome compared to young people starting with exercise and education, with the option of later surgery.", "url": "https://www.dtnext.in/amp/Lifestyle/Wellbeing/2022/02/13143257/1343505/For-people-with-meniscal-tears-exercise-and-surgery-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2022/Feb/202202131432574373_For-people-with-meniscal-tears-exercise-and-surgery-are_SECVPF.gif", "publishedAt": "2022-02-13T09:13:27Z", "content": "In this study, the researchers demonstrated that young people with a meniscal tear initially undergoing surgery did not achieve superior outcome compared to young people starting with exercise and ed… [+4214 chars]"}, {"source": {"id": null, "name": "Portugal Resident"}, "author": null, "title": "Osteoporosis and thyroid disorders - Portugal Resident", "description": "Osteoporosis and thyroid disorders. Two types of cells are constantly at work in our bones to allow the skeleton to grow and repair", "url": "https://www.portugalresident.com/osteoporosis-and-thyroid-disorders/", "urlToImage": "https://www.portugalresident.com/wp-content/uploads/2022/02/osteoporosis.jpg", "publishedAt": "2022-02-13T09:10:40Z", "content": "Osteoporosis is a condition whereby our bones become fragile and are more likely to break. The common areas for breakage are the wrist, spine and hip. Although osteoporosis can be treated, it is bett… [+2620 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "Korean Dish Teaches Us The Secret To A Healthy Heart - Optic Flux", "description": "Heart disease is a major problem that claims the lives of over 700,000 Americans each year. According to the CDC, roughly 805,000 individuals in the United States experience a heart attack each year, although coronary artery disease is the most frequent kind …", "url": "https://www.opticflux.com/korean-dish-teaches-us-the-secret-to-a-healthy-heart/15687/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/02/kimchi-2449656_960_720.jpg", "publishedAt": "2022-02-13T09:02:33Z", "content": "Heart disease is a major problem that claims the lives of over 700,000 Americans each year. According to the CDC, roughly 805,000 individuals in the United States experience a heart attack each year,… [+1778 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medical Dialogues Bureau", "title": "HIV Discoverer Luc Montagnier Dies at 89 - Medical Dialogues", "description": "Paris: French researcher Luc Montagnier, who won a Nobel Prize in 2008 for discovering the HIV virus ...", "url": "https://medicaldialogues.in/news/health/hiv-discoverer-luc-montagnier-dies-at-89-88465", "urlToImage": "https://medicaldialogues.in/h-upload/2022/02/12/170365-luc-montagnier.jpg", "publishedAt": "2022-02-13T07:45:24Z", "content": "Paris: French researcher Luc Montagnier, who won a Nobel Prize in 2008 for discovering the HIV virus has died at age 89, according to local government officials in France.\r\nMontagnier died Tuesday at… [+3168 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Time to wake up! Experts link an early morning symptom to cancer - Times Now", "description": "According to the World Health Organisation (WHO), cancer is one of the leading causes of death globally – as of data released in February 2022. Across its various forms, cancer is a disease that grows over time, through stages, and then starts to show symptom…", "url": "https://www.timesnownews.com/health/article/cancer-symptoms-early-morning-sign-persistent-cough-sore-throat-tumour-tobacco/858372", "urlToImage": "https://imgk.timesnownews.com/story/cancer_early_morning_symptom_sore_throat.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-13T07:44:00Z", "content": "<ul><li>Characterised by uncontrolled growth of cells and development of a tumour, cancer can over its stages spread across the body to become metastatic. </li></ul>\r\n<ul><li>As a result, treatment b… [+3107 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "WHO sounds alarm over Long COVID after Omicron; cautions on signs to watch out - Asianet Newsable ", "description": "Speaking about the risk of suffering from extended COVID following Omicron, the UN health agency stated that while the possibility is high (when compared to other variations), further research is needed.", "url": "https://newsable.asianetnews.com/coronavirus/who-issues-alert-on-long-covid-symptoms-include-shortness-of-breath-heart-issues-more-gcw-r78g0r", "urlToImage": "https://static-ai.asianetnews.com/images/01fv783crmhtmpccb6dgt1ndxp/11111111111111111111111_1200x630xt.jpg", "publishedAt": "2022-02-13T07:41:15Z", "content": "Speaking about the risk of suffering from extended COVID following Omicron, the UN health agency stated that while the possibility is high (when compared to other variations), further research is nee… [+2259 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Fungal infections cause more AIDs deaths than tuberculosis, here’s what we can do about it - Hindustan Times", "description": "As more and more people are treated for HIV infection, deaths will continue to come down. But the fall is slower than it should be, and the reason for the tardiness of this decrease in deaths is fungal disease. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/fungal-infections-cause-more-aids-deaths-than-tuberculosis-here-s-what-we-can-do-about-it-101644736394535.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/13/1600x900/AIDS_1638188907776_1644737660909.jpg", "publishedAt": "2022-02-13T07:40:11Z", "content": "Even though annual deaths from AIDs are coming down from a peak of 1.9 million in 2004 to 690,000 in 2020 - thats still way too many. In 2020, 214,000 people with AIDs died of tuberculosis (TB), thou… [+6255 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Smartphone app can detect how well blood clots with a single drop of it, finds study - ANI News", "description": "Washington [US], February 13 (ANI): Blood clots form naturally as a way to stop bleeding when someone is injured. A team of researchers at the University of Washington developed a new blood-clotting test that used only a single drop of blood and a smartphone …", "url": "https://www.aninews.in/news/science/smartphone-app-can-detect-how-well-blood-clots-with-a-single-drop-of-it-finds-study20220213120612", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Untitledjgfjj-1320220213063551-thumbnail-154x87-70.jpg", "publishedAt": "2022-02-13T06:36:00Z", "content": "ANI | Updated: Feb 13, 2022 12:06 IST\r\nWashington [US], February 13 (ANI): Blood clots form naturally as a way to stop bleeding when someone is injured. A team of researchers at the University of Was… [+5963 chars]"}, {"source": {"id": null, "name": "SCNow"}, "author": "DR. ANIL OM McLeod Interventional cardiologist", "title": "DR. ANIL OM: Heart disease – not just a man’s world - SCNow", "description": "Heart disease has been historically stereotyped as being a man’s disease, but the reality is it can and does affect women as well. Heart disease and stroke are South Carolina’s", "url": "https://scnow.com/lifestyles/health-med-fit/dr-anil-om-heart-disease-not-just-a-man-s-world/article_f6203f28-8ba8-11ec-9d86-430e479c943e.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/scnow.com/content/tncms/assets/v3/editorial/2/a9/2a95450a-8ba9-11ec-8a31-1b290861b508/620717905eca9.image.jpg?crop=1071%2C562%2C0%2C468&resize=1071%2C562&order=crop%2Cresize", "publishedAt": "2022-02-13T05:30:00Z", "content": "Heart disease has been historically stereotyped as being a mans disease, but the reality is it can and does affect women as well. Heart disease and stroke are South Carolinas leading killers for wome… [+1178 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "6 foods that increase glucose and are bad for diabetes - Play Crazy Game", "description": "Diabetes is a condition that affects more than 420 million people worldwide, it is chronic, however, it can be reversible. There are some foods that are capable of harming the disease even more and, for those who deal with this case daily, it is very importan…", "url": "https://playcrazygame.com/2022/02/13/6-foods-that-increase-glucose-and-are-bad-for-diabetes/", "urlToImage": "https://portal6.com.br/wp-content/uploads/2022/02/carne.jpeg", "publishedAt": "2022-02-13T05:24:59Z", "content": "Diabetes is a condition that affects more than 420 million people worldwide, it is chronic, however, it can be reversible.\r\nThere are some foods that are capable of harming the disease even more and,… [+2513 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Harriet Whitehead", "title": "Stomach cancer: Five of the 'first signs' that may arise - they are 'often vague' - Daily Express", "description": "THERE are many possible symptoms of stomach cancer, but they might be hard to spot, and are sometimes 'vague' in nature. Stomach cancer is cancer that starts anywhere inside the stomach or the stomach wall.", "url": "https://www.express.co.uk/life-style/health/1562727/stomach-cancer-signs-heartburn-indigestion-changes-in-appetite-nausea-vomiting", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1562727.jpg", "publishedAt": "2022-02-13T04:00:00Z", "content": "Indeed, Cancer Research UK notes: “Symptoms of early stomach cancer can be similar to the symptoms of other conditions, such as stomach ulcers.” It says your GP should arrange for you to see a specia… [+1666 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals new physiological mechanisms linking chronic pain to disrupted eating behavior - News-Medical.Net", "description": "It has long been known that there is an association between food and pain, as people with chronic pain often struggle with their weight. Researchers at the Del Monte Institute for Neuroscience may have found an explanation in a new study that suggests that ci…", "url": "https://www.news-medical.net/news/20220212/Study-reveals-new-physiological-mechanisms-linking-chronic-pain-to-disrupted-eating-behavior.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-02-13T03:40:00Z", "content": "It has long been known that there is an association between food and pain, as people with chronic pain often struggle with their weight. Researchers at the Del Monte Institute for Neuroscience may ha… [+2774 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Adesola Mojo", "title": "EndoAct Canada promotes endometriosis awareness, treatment - Verve Times", "description": "French President Emmanuel Macron made endometriosis a legally recognized chronic illness in January, which boosted services for millions of women living with the painful and debilitating disease. Now a group of doctors and patients", "url": "https://vervetimes.com/endoact-canada-promotes-endometriosis-awareness-treatment/", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5779455.1644721516!/httpImage/image.png_gen/derivatives/landscape_620/image.png", "publishedAt": "2022-02-13T03:31:05Z", "content": "French President Emmanuel Macron made endometriosis a legally recognized chronic illness in January, which boosted services for millions of women living with the painful and debilitating disease. Now… [+5113 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New class of compounds can improve multiple aspects of metabolic syndrome, mice study shows - News-Medical.Net", "description": "A study in mice -; led by researchers at Washington University School of Medicine in St. Louis -; shows that a new class of compounds the scientists developed can improve multiple aspects of metabolic syndrome.", "url": "https://www.news-medical.net/news/20220212/New-class-of-compounds-can-improve-multiple-aspects-of-metabolic-syndrome-mice-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Insulin-620x480.jpg", "publishedAt": "2022-02-13T03:11:00Z", "content": "A study in mice -; led by researchers at Washington University School of Medicine in St. Louis -; shows that a new class of compounds the scientists developed can improve multiple aspects of metaboli… [+4339 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Post-vax exercise bumps up antibodies - Sentinelassam - The Sentinel Assam", "description": "Around 90 minutes of mild- to moderate-intensity exercise directly after the flu or the Covid-19...", "url": "https://www.sentinelassam.com/topheadlines/post-vax-exercise-bumps-up-antibodies-577959", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/02/12/311980-health.jpg", "publishedAt": "2022-02-13T01:55:03Z", "content": "NEW YORK: Around 90 minutes of mild- to moderate-intensity exercise directly after the flu or the Covid-19 vaccine may provide an extra immune boost, suggests a new study. The study showed that parti… [+1637 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: Tricks and tips to feel full on a low-carb diet - Times of India", "description": "For the same reason when people go on a low-carb diet they often feel weak and famished even after having a plate full of food.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/weight-loss-tricks-and-tips-to-feel-full-on-a-low-carb-diet/photostory/89509657.cms", "urlToImage": "https://static.toiimg.com/photo/89510377.cms", "publishedAt": "2022-02-13T01:30:00Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "Scientists find most transmissible and aggressive HIV variant in the Netherlands – World - Play Crazy Game", "description": "One new variant of the HIV virus described as \"highly virulent and transmissible\" was found in the Netherlands and revealed this Thursday (3) in an article in the scientific journal \"Science\". The information is from BBC News Brazil. Baptized as \"variant VB\",…", "url": "https://playcrazygame.com/2022/02/05/scientists-find-most-transmissible-and-aggressive-hiv-variant-in-the-netherlands-world/", "urlToImage": "https://diariodonordeste.verdesmares.com.br/image/contentid/policy:1.3188845:1644000602/image.jpg?h=630&q=0.6&w=1200&$p$h$q$w=f76cc5e", "publishedAt": "2022-02-12T21:36:11Z", "content": "One new variant of the HIV virus described as “highly virulent and transmissible” was found in the Netherlands and revealed this Thursday (3) in an article in the scientific journal “Science”. The in… [+2493 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Men use condoms more than women in Mexico - Code List", "description": "To remember its importance prior to the International Day of the Condom this February 13, the Ministry of Health reported that there are more mens who use condoms compared to women. According to the 2018-19 National Health and Nutrition Examination Survey, 75…", "url": "https://codelist.biz/2022/02/12/men-use-condoms-more-than-women-in-mexico/", "urlToImage": "https://tvazteca.brightspotcdn.com/dims4/default/de9f6f8/2147483647/strip/true/crop/1280x672%200%20105/resize/1200x630!/quality/90/?url=https://tvazteca.brightspotcdn.com/50/fd/28d9e0a641149619e142bae88842/condom-g452e0b6e4-1280.jpg", "publishedAt": "2022-02-12T20:45:24Z", "content": "To remember its importance prior to the International Day of the Condom this February 13, the Ministry of Health reported that there are more mens who use condoms compared to women.\r\nAccording to the… [+2515 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Using Blood Test And AI, New Method Detects Lung Cancer With 90% Accuracy - India Times", "description": "Could lung cancer be detected by a blood test? Chinese scientists claim to have already developed a way to detect lung cancer using blood tests. The best part? The blood test in question can detect lung cancer in its early stages, implying that countless live…", "url": "https://www.indiatimes.com/technology/news/ai-detect-lung-cancer-with-90-percent-accuracy-561064.html", "urlToImage": "https://im.indiatimes.in/content/2022/Feb/FBImage7-copy_61fb7eca159cd.jpg", "publishedAt": "2022-02-12T20:29:53Z", "content": "Could lung cancer be detected by a blood test? Chinese scientists claim to have already developed a way to detect lung cancer using blood tests. The best part? The blood test in question can detect l… [+2075 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Diet to lose 5 kg in a month - The Times Hub", "description": "Home » Health » Diet to lose 5 kg in a month February 12, 2022 If we want to achieve lasting results, to lose weight goes beyond the simple weightloss. It is about adopting a healthy lifestyle which, even after having been able to lose weight, will allow us t…", "url": "https://thetimeshub.in/diet-to-lose-5-kg-in-a-month", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/02/73093a1c4110f12d33a1fbf097dca2a5.jpg", "publishedAt": "2022-02-12T20:08:54Z", "content": "Home » Health » Diet to lose 5 kg in a month February 12, 2022 \r\nIf we want to achieve lasting results, to lose weight goes beyond the simple weightloss. It is about adopting a healthy lifestyle whic… [+5281 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Fish Oil: A Natural Medicine for Heart Attack Prevention - Rising Kashmir", "description": "An enormous amount of medical literature testifies to the fact that fish oils prevent and may help to ameliorate or reverse atherosclerosis, angina and heart attack", "url": "https://www.risingkashmir.com/displaynews.aspx?news=100647", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637802536730024481_Image_OP_2_(2).png", "publishedAt": "2022-02-12T19:39:58Z", "content": "Fish oil nutrients are one of the most important nourishments that our body needs to function efficiently. Polyunsaturated fatty acids like alpha-linolenic acid (omega-3 fatty acids) and linoleic aci… [+5401 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Lisa Schlein", "title": "WHO: Measles Increase a Danger to Malnourished Afghan Children - VOA News", "description": "Case rise seen as especially concerning because of high malnutrition levels", "url": "https://www.voanews.com/a/who-measles-increase-a-danger-to-malnourished-afghan-children/6439252.html", "urlToImage": "https://gdb.voanews.com/c36e0000-0aff-0242-14fd-08d9ee5c676b_w1200_r1.jpg", "publishedAt": "2022-02-12T19:25:42Z", "content": "GENEVA  The World Health Organization warns a sharp rise in measles cases in Afghanistan is threatening the lives and well-being of millions of malnourished children. \r\nMore than 35,300 suspected cas… [+2335 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study finds cancer patients undergoing treatment are susceptible to COVID-19 misinformation - Devdiscourse", "description": "Researchers have found that cancer patients undergoing treatment are more likely to believe COVID-19 related misinformation than those without a history of cancer.", "url": "https://www.devdiscourse.com/article/health/1920667-study-finds-cancer-patients-undergoing-treatment-are-susceptible-to-covid-19-misinformation", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_02_2022_18_18_08_025196.jpg?width=920&format=jpeg", "publishedAt": "2022-02-12T18:18:09Z", "content": "Researchers have found that cancer patients undergoing treatment are more likely to believe COVID-19 related misinformation than those without a history of cancer. The findings of the study were publ… [+4934 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "5 myths about cholesterol. Do you also believe in them? - Spark Chronicles", "description": "Cholesterol is one of the most famous fatty compounds found in the human body. There was a lot of in", "url": "https://sparkchronicles.com/5-myths-about-cholesterol-do-you-also-believe-in-them/", "urlToImage": "https://gfx.zdrowie.radiozet.pl/var/radiozetzdrowie/storage/images/choroby/kardiologia/5-mitow-dotyczacych-cholesterolu.-czy-ty-tez-w-nie-wierzysz/3948932-1-pol-PL/5-mitow-dotyczacych-cholesterolu.-Czy-ty-tez-w-nie-wierzysz_article.jpg", "publishedAt": "2022-02-12T17:26:28Z", "content": "Cholesterol is one of the most famous fatty compounds found in the human body. There was a lot of information about him, not always true. Learn the 5 most popular myths about cholesterol.MYTH 1: Chol… [+4038 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Understand what herpes is, a disease that became a topic because of Eliezer, from BBB22 – Quem - Play Crazy Game", "description": "+ Eliezer has cold sores (Photo: Reproduction/Globoplay) Leader Jade Picon's party at BBB22 in the early hours of this Thursday (10) brought up a subject about herpes inside the house. Eliezer, with a wound in his mouth, kissed Natalia and was warned by Maria…", "url": "https://playcrazygame.com/2022/02/12/understand-what-herpes-is-a-disease-that-became-a-topic-because-of-eliezer-from-bbb22-quem/", "urlToImage": "https://s2.glbimg.com/qB_2uYEInuV-1KZ0QFyGye68pZ0=/512x320/smart/e.glbimg.com/og/ed/f/original/2022/02/10/eli-herpes.jpg", "publishedAt": "2022-02-12T15:20:41Z", "content": "Eliezer has cold sores (Photo: Reproduction/Globoplay)\r\nLeader Jade Picon’s party at BBB22 in the early hours of this Thursday (10) brought up a subject about herpes inside the house. Eliezer, with a… [+4286 chars]"}, {"source": {"id": null, "name": "Fiorreports.com"}, "author": "Becca Roberts", "title": "This vitamin could extend your life, science says – eat this, not that - Fior Reports", "description": "While no one is guaranteed a long life, there are some steps you can take to increase your chances.Maintaining an active social life, getting some sunlight, and sticking to a sleep schedule that works for your body can help p", "url": "https://fiorreports.com/this-vitamin-could-extend-your-life-science-says-eat-this-not-that/", "urlToImage": "https://i0.wp.com/fior-reports.s3.amazonaws.com/wp-content/uploads/2022/02/12100933/taking-supplement.jpg?fit=800%2C533&ssl=1", "publishedAt": "2022-02-12T15:09:37Z", "content": "While no one is guaranteed a long life, there are some steps you can take to increase your chances.\r\nMaintaining an active social life, getting some sunlight, and sticking to a sleep schedule that wo… [+2320 chars]"}, {"source": {"id": null, "name": "KESQ"}, "author": "CNN Newsource", "title": "Brazil's Covid-19 vaccination drive stumbles as Bolsonaro's disinformation campaign lingers - kuna noticias y kuna radio", "description": "By Camilo Rocha, Rodrigo Pedroso and Marcia Reverdosa, CNN At the beginning of 2021, hospitals in Brazil’s Amazonas state were in a critical state, with ICUs filled to capacity and Covid-19 patients fighting for their lives. “There were a lot of young people …", "url": "https://kesq.com/news/2022/02/12/brazils-covid-19-vaccination-drive-stumbles-as-bolsonaros-disinformation-campaign-lingers/", "urlToImage": "https://kesq.b-cdn.net/2021/05/kesq-us-world.jpg", "publishedAt": "2022-02-12T15:07:55Z", "content": "By Camilo Rocha, Rodrigo Pedroso and Marcia Reverdosa, CNN\r\nAt the beginning of 2021, hospitals in Brazil’s Amazonas state were in a critical state, with ICUs filled to capacity and Covid-19 patients… [+7000 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "First Person Infected With The Rare Rat-borne Lassa Virus In The UK Dies - India Times", "description": "The first person in the UK has died from a rare rat-borne virus called Lassa fever, and two other cases are now being investigated.According to the UK Health Security Agency, the confirmed case of Lassa brought the total cases of the potentially fatal disease…", "url": "https://www.indiatimes.com/trending/social-relevance/man-dies-of-rare-rat-borne-disease-lassa-virus-in-the-uk-561906.html", "urlToImage": "https://im.indiatimes.in/content/2022/Feb/lassa-virus-FB_6207bab9d0ad5.png", "publishedAt": "2022-02-12T14:05:26Z", "content": "The first person in the UK has died from a rare rat-borne virus called Lassa fever, and two other cases are now being investigated.\r\nAccording to the UK Health Security Agency, the confirmed case of … [+2358 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "How to prevent Alzheimer’s? Put your brain to work – Health - Play Crazy Game", "description": "It may sound strange to think that a child who attends school is preventing Alzheimer's, a disease that causes the deterioration of brain functions. But studying and working the brain for many years – preferably for a lifetime – helps to avoid dementia, that …", "url": "https://playcrazygame.com/2022/02/12/how-to-prevent-alzheimers-put-your-brain-to-work-health/", "urlToImage": "https://img.estadao.com.br/resources/jpg/6/6/1644615209766.jpg", "publishedAt": "2022-02-12T14:03:41Z", "content": "It may sound strange to think that a child who attends school is preventing Alzheimer’s, a disease that causes the deterioration of brain functions. But studying and working the brain for many years … [+9335 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "Mortality in the ICU was 30.5 percent at the first peaks of the pandemic – Health - The Goa Spotlight", "description": "Almost 9 out of ten people who have been hospitalized for covid-19 during the pandemic have been ser", "url": "https://thegoaspotlight.com/2022/02/12/mortality-in-the-icu-was-30-5-percent-at-the-first-peaks-of-the-pandemic-health-2/", "urlToImage": "https://www.eltiempo.com/files/og_paste_img/uploads/2022/02/05/61ff1e1540da4.jpeg", "publishedAt": "2022-02-12T12:53:02Z", "content": "Almost 9 out of ten people who have been hospitalized for covid-19 during the pandemic have been seriously or critically ill, while just over 14 percent have had mild or moderate symptoms.\r\n(You may … [+9180 chars]"}, {"source": {"id": null, "name": "D1softballnews.com"}, "author": "James Reno", "title": "Stress and Anger Cause Heart Disease: The Study - D1SoftballNews.com", "description": "Those who suffer from anxiety, stress and get very angry are often at increased risk of developing heart disease. Here is the recent study. Anger (from Pixabay) When people who ... Read more", "url": "https://d1softballnews.com/stress-and-anger-cause-heart-disease-the-study/", "urlToImage": "https://d1softballnews.com/wp-content/uploads/2021/08/colorlogo.png", "publishedAt": "2022-02-12T12:51:04Z", "content": "Those who suffer from anxiety, stress and get very angry are often at increased risk of developing heart disease. Here is the recent study.\r\nAnger (from Pixabay)\r\nWhen people who get angry are told t… [+1970 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Sexual and Reproductive Health Awareness Day: 5 lifestyle changes every woman must make - Hindustan Times", "description": "Poor diet, weight gain, stress and smoking can impact one’s fertility. It is important to take care of your reproductive health and stay healthy by following these vital tips.", "url": "https://www.hindustantimes.com/photos/lifestyle/sexual-and-reproductive-health-awareness-day-5-lifestyle-changes-every-woman-must-make-101644667195448.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/12/1600x900/lifestyle_changes_1644667301046_1644667334067.jpg", "publishedAt": "2022-02-12T12:07:48Z", "content": null}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Older People in Good Shape Have Fitter Brains: Study - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Seventy to eighty-year-olds who train for better fitness are better at solving cognitive tasks and are less likely to suffer cognitive impairment, according to a recent study.", "url": "https://www.latestly.com/agency-news/health-news-older-people-in-good-shape-have-fitter-brains-study-3357315.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/nnnnnnnnnndfbnsbfnsdf2022021211115520220212111705-588x441.jpg", "publishedAt": "2022-02-12T11:30:22Z", "content": "Washington [US], February 12 (ANI): Seventy to eighty-year-olds who train for better fitness are better at solving cognitive tasks and are less likely to suffer cognitive impairment, according to a r… [+6880 chars]"}, {"source": {"id": null, "name": "D1softballnews.com"}, "author": "James Reno", "title": "everyone likes it but aggravates hypertension - D1SoftballNews.com", "description": "Hypertension is a problem that affects over 17 million Italians and nutrition can aggravate health conditions. High blood pressure – Lettoquotidiano.it Sometimes, without realizing it, we put it on the ... Read more", "url": "https://d1softballnews.com/everyone-likes-it-but-aggravates-hypertension/", "urlToImage": "https://d1softballnews.com/wp-content/uploads/2021/08/colorlogo.png", "publishedAt": "2022-02-12T10:51:44Z", "content": "Hypertension is a problem that affects over 17 million Italians and nutrition can aggravate health conditions.\r\nHigh blood pressure – Lettoquotidiano.it\r\nSometimes, without realizing it, we put it on… [+2273 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Ebola Virus Can Lurk in the Brain Long After Treatment, Can Re-Emerge to Cause Fatal Disease: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Ebola virus causes one of the deadliest infectious diseases known to humankind. According to the World Health Organisation, it is still a significant threat in Africa, which saw three outbreaks in 2021 alone. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/health/news/2022-02-12-ebola-virus-can-lurk-in-the-brain-and-recur-long-after-treatment", "urlToImage": "https://s.w-x.co/in-brain_6.jpg", "publishedAt": "2022-02-12T10:48:22Z", "content": "The Ebola virus can persist in the brain and re-emerge to cause fatal disease, even long after treatment with monoclonal antibodies, a study has found. \r\nThis research, published in the journal Scien… [+3228 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Health tips for women above 40: Lifestyle, diet changes to ensure 40s is new 20s - Hindustan Times", "description": "From boosting their calcium and vitamin D consumption to daily Pilates or Yoga sessions and annual mammography, here are some health tips by doctors for women, when metabolism slows around the age of 40 | Health", "url": "https://www.hindustantimes.com/lifestyle/health/health-tips-for-women-above-40-lifestyle-diet-changes-to-ensure-40s-is-new-20s-101644660184059.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/12/1600x900/nate-johnston-daX3ltHx1mw-unsplash_1644661007857_1644661032924.jpg", "publishedAt": "2022-02-12T10:36:19Z", "content": "With the Covid-19 pandemic entering its third year, the odds to create a balance in professional and personal lives continues and women are facing the brunt of it more savagely, be it at home or in w… [+4779 chars]"}, {"source": {"id": null, "name": "Dunya News"}, "author": "https://www.facebook.com/dunyanews", "title": "COVID-19 boosters do not cause positive HIV tests - Dunya News", "description": "COVID-19 boosters do not cause positive HIV tests", "url": "https://dunyanews.tv/en/FakeNews/640950-COVID-19-boosters-do-not-cause-positive-HIV-tests", "urlToImage": "https://img.dunyanews.tv/news/2022/February/02-12-22/news_big_images/640950_52681664.jpg", "publishedAt": "2022-02-12T09:48:00Z", "content": "(Reuters) - Social media users have widely shared a claim that late French virologist Dr Luc Montagnier suggested people who had received a third dose of a COVID-19 vaccine should get tested for huma… [+3271 chars]"}, {"source": {"id": null, "name": "Centralrecorder.com"}, "author": null, "title": "The common sleep problem that can double risk of the disease - Central Recorder", "description": "DEMENTIA and sleep have long been linked.", "url": "https://centralrecorder.com/the-common-sleep-problem-that-can-double-risk-of-the-disease/", "urlToImage": "https://centralrecorder.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=79074&type=play", "publishedAt": "2022-02-12T09:45:55Z", "content": "DEMENTIA and sleep have long been linked.\r\nNot getting enough sleep is associated with developing the disease.\r\n1\r\nDisrupted sleep which results in less than five hours a night could be a problemCred… [+2434 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Stress, diet and genetics: what can raise blood pressure? – 02/10/2022 - Play Crazy Game", "description": "High blood pressure is characterized by a persistent increase in the pressure that the blood makes when circulating through the arteries of the body. This condition happens when the arteries offer some kind of resistance, characterizing the condition popularl…", "url": "https://playcrazygame.com/2022/02/12/stress-diet-and-genetics-what-can-raise-blood-pressure-02-10-2022/", "urlToImage": "https://conteudo.imguol.com.br/c/entretenimento/0c/2022/02/03/fast-food-sobrepeso-obesidade-peso-alimentacao-pressao-alta-hipertensao-1643913462119_v2_615x300.jpg", "publishedAt": "2022-02-12T08:55:39Z", "content": "High blood pressure is characterized by a persistent increase in the pressure that the blood makes when circulating through the arteries of the body. This condition happens when the arteries offer so… [+8614 chars]"}, {"source": {"id": null, "name": "Bordermail.com.au"}, "author": "Nathan Bartlett", "title": "Whats the difference in protection against Omicron between 2 doses and 3 doses of vaccine? - The Border Mail", "description": "Let's break it down.", "url": "https://www.bordermail.com.au/story/7617876/does-a-third-vaccine-jab-make-a-difference-against-omicron/", "urlToImage": "https://www.bordermail.com.au/images/transform/v1/crop/frm/GJZ5TVpAk84wrTzsQfLQRB/1ea2d601-ac4c-413d-85e4-081607f3d4aa.png/r3_213_1198_888_w1200_h678_fmax.jpg", "publishedAt": "2022-02-12T07:00:00Z", "content": "Omicron can somewhat evade the immunity we get from vaccines. Photo: Michael Probst/AP/AAP"}, {"source": {"id": null, "name": "Deseret News"}, "author": "Trent Toone", "title": "New sleep study: Can you lose weight by sleeping? - Deseret News", "description": "Can you lose weight when you’re asleep? A research study by a team from the University of Chicago published in JAMA Internal Medicine has found that increasing the number of hours you sleep can reduce your weight.", "url": "https://www.deseret.com/u-s-world/2022/2/11/22925943/can-you-lose-weight-by-sleeping-research-study", "urlToImage": "https://cdn.vox-cdn.com/thumbor/-S45UMhFraJhZEfuO2L7pqnJl_0=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23233397/nightscale.jpg", "publishedAt": "2022-02-12T05:06:00Z", "content": "Getting more sleep each night can help you shed extra pounds, according to a new research study.\r\nWhy it matters: The research study, published in JAMA Internal Medicine, found that increasing the nu… [+2264 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Clinical Profile and Factors Affecting Outcomes in Elderly Patients Admitted to the Medical Intensive Care Unit of a Tertiary Care Hospital - Cureus", "description": "Background\r\n\r\nIn recent years, there is an increase in the proportion of the elderly population in the world. With an increase in patients' age, there is a change in the comorbidities and causes for Intensive care unit (ICU) admissions. More studies are neede…", "url": "https://www.cureus.com/articles/72624-clinical-profile-and-factors-affecting-outcomes-in-elderly-patients-admitted-to-the-medical-intensive-care-unit-of-a-tertiary-care-hospital", "urlToImage": "https://assets.cureus.com/uploads/figure/file/263924/article_river_41a376108b5711ecbce43da2bc51f7a5-Fig-1.png", "publishedAt": "2022-02-12T03:47:57Z", "content": "Background\r\nIn recent years, there is an increase in the proportion of the elderly population in the world. With an increase in patients' age, there is a change in the comorbidities and causes for In… [+24150 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "MD Editorial Team", "title": "Diabetic nephropathy effectively treated by Dapagliflozin: DAPA-CKD Trial - Medical Dialogues", "description": "Diabetes is a chronic disease that is the leading cause of kidney failure, accounting for 44%...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/diabetic-nephropathy-effectively-treated-by-dapagliflozin-dapa-ckd-trial-88416", "urlToImage": "https://medicaldialogues.in/h-upload/2022/02/11/170267-diabetic-nephropathy.jpg", "publishedAt": "2022-02-12T03:30:10Z", "content": "Diabetes is a chronic disease that is the leading cause of kidney failure, accounting for 44% percent of new cases. Diabetic nephropathy is a serious complication of type 1 diabetes and type 2 diabet… [+1606 chars]"}, {"source": {"id": null, "name": "Mediarunsearch.co.uk"}, "author": "Camelia Kirk", "title": "Exclusive: What are the differences between influenza and Covid-19? The doctor explains - Alexandre Jose - Mediarun Search", "description": "Exclusive: What are the differences between influenza and Covid-19? The doctor explains – Alexandre Jose – News from Blumenau and Valle do Itajai Beginsthe healthExclusive: What are the differences between...", "url": "https://www.mediarunsearch.co.uk/exclusive-what-are-the-differences-between-influenza-and-covid-19-the-doctor-explains-alexandre-jose/", "urlToImage": "https://www.mediarunsearch.co.uk/wp-content/uploads/2022/02/Exclusive-What-are-the-differences-between-influenza-and-Covid-19-The.png", "publishedAt": "2022-02-12T02:39:25Z", "content": null}]}