{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "BusinessLine"}, "author": "The Hindu BusinessLine", "title": "Hepatitis C drugs can be effective against Covid-19: Study - BusinessLine", "description": "Researchers at the US’ Department of Energy’s Oak Ridge National Laboratory found that drugs used to treat Hepatitis C can be effective against a Covid-19 enzyme that helps the virus proliferates in t", "url": "https://www.thehindubusinessline.com/news/science/hepatitis-c-drugs-can-be-effective-against-covid-19-study/article33131863.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/pkvk7g/article33131862.ece/ALTERNATES/LANDSCAPE_615/BL20HEP", "publishedAt": "2020-11-19T09:55:00Z", "content": "Researchers at the US Department of Energys Oak Ridge National Laboratory found that drugs used to treat Hepatitis C can be effective against a Covid-19 enzyme that helps the virus proliferates in th… [+978 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "Is diabetes sneaking up on you? Early signs you should look out for - TheHealthSite", "description": "Diabetes can sneak up on you without any obvious symptoms. But here are telltale signs of diabetes so that you can consult a doctor ASAP!", "url": "https://www.thehealthsite.com/diseases-conditions/diabetes/is-diabetes-sneaking-up-on-you-early-signs-you-should-look-out-for-781318/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/11/Diabetes-2-655x353.jpg", "publishedAt": "2020-11-19T09:52:00Z", "content": "Diabetes can sneak up on you without any obvious symptoms. In fact, most people dont even realise that they have diabetes until they reach that level where it becomes hard for the person to bring it … [+4382 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Not even dog walks allowed: This country has imposed world`s toughest lockdown - WION", "description": "A lot of countries have initiated a second lockdown to contain the spread of coronavirus as many areas observed a second wave with the onset of the winter season. However, one specific area has imposed one of the toughest lockdowns.", "url": "https://www.wionews.com/world/not-even-dog-walks-allowed-this-country-has-imposed-worlds-toughest-lockdown-344054", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/11/19/170353-coronavirus-in-south-australia.jpg", "publishedAt": "2020-11-19T09:31:18Z", "content": "A lot of countries have initiated a second lockdown to contain the spread of coronavirus as many areas observed a second wave with the onset of the winter season. However, one specific area has impos… [+1572 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "PTI", "title": "Study reveals how smoking worsens COVID-19 infection in the airways - The Hindu", "description": "\"If you think of the airways like the high walls that protect a castle, smoking cigarettes is like creating holes in these walls,\" said Brigitte Gomperts, a co-author of the study", "url": "https://www.thehindu.com/sci-tech/science/study-reveals-how-smoking-worsens-covid-19-infection-in-the-airways/article33131495.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/rtkk98/article33131494.ece/ALTERNATES/LANDSCAPE_615/800-x-533", "publishedAt": "2020-11-19T09:14:38Z", "content": "Using lab-grown lung tissue, scientists have pinpointed how smoking cigarettes facilitates more severe lung infection by the novel coronavirus, an advance that may lead to new therapeutic strategies … [+2585 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Use of earphones for working online is causing ear infections - Deccan Herald", "description": "With the Covid-19 pandemic forcing professionals to work from home and students to attend classes online using earphones, doctors are now getting more patients with complaints of pain, irritation and infection in the ears. According to medical experts, use of…", "url": "https://www.deccanherald.com/science-and-environment/covid-19-using-earphones-for-long-hours-causing-ear-infections-917439.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/19/file79b8g1v0qfq13fgvalr7-geetty-917439-1605777214.jpg", "publishedAt": "2020-11-19T09:02:58Z", "content": "With the Covid-19 pandemic forcing professionals to work from home and students to attend classes online using earphones, doctors are now getting more patients with complaints of pain, irritation and… [+2608 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "News18", "title": "Oxford University's Coronavirus Vaccine Shows Encouraging Immune Response in Older Age Groups - Yahoo India News", "description": "The findings published in Lancet' on Thursday based on 560 healthy adult volunteers shows that the ChAdOx1 nCoV-19 vaccine is safe and well tolerated with a ...", "url": "https://in.news.yahoo.com/oxford-universitys-coronavirus-vaccine-shows-084100426.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/qcEyz5bMJqugdCWBA4C8bg--~B/aD0xMDgwO3c9MTkyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/news18_coronavirus_edition_222/c4cbdd309b3b11e7a7ec796fd60ea0ed", "publishedAt": "2020-11-19T08:41:00Z", "content": "London: The coronavirus vaccine developed by teams at the University of Oxford has been shown to trigger a robust immune response in healthy adults aged 56-69 and those over 70 years of age. The find… [+1380 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "News Desk 1", "title": "Take Vitamin D supplements to reduce cancer risk: Study - The Siasat Daily", "description": "New York, Nov 19 (IAN) It seems like we have now one more reason to take vitamin D supplements as researchers have found that vitamin D was associated with an overall 17 per cent risk reduction for advanced cancer.When the research team looked at only partici…", "url": "https://www.siasat.com/take-vitamin-d-supplements-to-reduce-cancer-risk-study-2026698/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/11/Take-Vitamin-D-supplements-to-reduce-cancer-risk-Study.jpg", "publishedAt": "2020-11-19T08:24:00Z", "content": "New York, Nov 19 (IAN) It seems like we have now one more reason to take vitamin D supplements as researchers have found that vitamin D was associated with an overall 17 per cent risk reduction for a… [+2552 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Zarafshan Shiraz", "title": "Here’s how diabetes, hypertension may increase risk of Covid-19 brain complications - Hindustan Times", "description": "Study reveals neurological complications like bleeding in the brain and stroke are common in Covid-19 patients with diabetes and hypertension, here’s why", "url": "https://www.hindustantimes.com/more-lifestyle/here-s-how-diabetes-hypertension-may-increase-risk-of-covid-19-brain-complications/story-hVWAPj7uRyP1h4EXSsTNtJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/_df2980fc-2a3f-11eb-a1f1-9949958d68df.jpg", "publishedAt": "2020-11-19T08:19:57Z", "content": "Some patients with Covid-19 are at higher risk of neurological complications like bleeding in the brain and stroke, according to a new study.\r\nThe study was being presented at the annual meeting of t… [+3385 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "IANS", "title": "Mouthwash can kill Covid-19 virus in 30 seconds: Study - Times Now", "description": "The researchers revealed that mouthwashes containing at least 0.07 per cent cetypyridinium chloride showed \"promising signs\" of virus-killing potential.", "url": "https://www.timesnownews.com/health/article/mouthwash-can-kill-covid-19-virus-in-30-seconds-study/683829", "urlToImage": "https://imgk.timesnownews.com/story/iStock-489430211_0.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-19T08:08:10Z", "content": "London: Researchers have once again claimed that widely-available mouthwashes have killed Coronavirus, responsible for the Covid-19 disease, within 30 seconds of exposure in laboratory conditions.\r\nT… [+1900 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Mizoram Covid-19 situation worsens, 32 test positive - Northeast Now", "description": "Mizoram’s Covid-19 situation worsens with 32 more people testing positive for the novel coronavirus in the past 24 hours. These new cases include 16 policemen. The recent spike in Covid-19 cases has compelled the state government to extend the lockdown in the…", "url": "https://nenow.in/north-east-news/mizoram/mizoram-covid-19-situation-worsens-32-test-positive.html/", "urlToImage": "https://nenow.in/wp-content/uploads/2020/11/Coronavirus-1140x570-1.jpg", "publishedAt": "2020-11-19T07:48:25Z", "content": "Mizorams Covid-19 situation worsens with 32 more people testing positive for the novel coronavirus in the past 24 hours.\r\nThese new cases include 16 policemen.\r\nThe recent spike in Covid-19 cases has… [+707 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Retinas may be new potential clues in diagnosis, treatment of Alzheimer's disease - Times Now", "description": "The images were then analyzed using a new process that could identify certain peripheral regions in the retina that corresponded better to brain damage and cognitive status.", "url": "https://www.timesnownews.com/health/article/retinas-may-be-new-potential-clues-in-diagnosis-treatment-of-alzheimers-disease/683812", "urlToImage": "https://imgk.timesnownews.com/story/iStock-962777986.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-19T07:39:33Z", "content": "Washington: A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found in the back of the eye - that are more affected by Alzheimer's d… [+3356 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "Oxford covid vaccine produces promising response in older adults in early study - Mint", "description": "Those findings will follow a flurry of positive news on the covid vaccine front.Findings from Oxford vaccine's final phase of trials expected in the coming weeks", "url": "https://www.livemint.com/science/health/oxford-covid-vaccine-produces-strong-immune-responses-in-older-adults-11605769978425.html", "urlToImage": "https://images.livemint.com/img/2020/11/19/600x338/AFP_8TQ4U3_1605770061780_1605770085656.jpg", "publishedAt": "2020-11-19T07:16:52Z", "content": "The University of Oxford confirmed that the Covid-19 vaccine its developing with AstraZeneca Plc produced strong immune responses in older adults in an early study, with pivotal findings from the fin… [+2294 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "High-Protein Diet: Eating Protein-Packed Meals May Help You Combat Obesity - Experts Reveal; 9 Food Tips - NDTV Food", "description": "The study found that high-protein meal led to increased fat oxidation and \"negative fat balance\".", "url": "https://food.ndtv.com/weight-loss/high-protein-diet-eating-protein-packed-meals-may-help-you-combat-obesity-experts-reveal-9-food-tips-2327300", "urlToImage": "https://c.ndtvimg.com/2018-09/htl25c88_vegetarian-protein_625x300_18_September_18.jpg", "publishedAt": "2020-11-19T07:15:00Z", "content": "Obesity is a major health concern among people across the globe. Obesity is associated to higher incidence of heart risks, diabetes, high blood pressure and more. As per the World Health Organisation… [+2973 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Kate Kelland", "title": "AstraZeneca COVID-19 shot candidate shows promise among elderly in trials - Reuters", "description": "AstraZeneca and Oxford University's potential COVID-19 vaccine produced a strong immune response in older adults, data published on Thursday showed, with researchers expecting to release late-stage trial results by Christmas.", "url": "https://in.reuters.com/article/us-health-coronavirus-oxford-astrazeneca-idUSKBN27Z0PF", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201119&t=2&i=1541724915&r=LYNXMPEGAI0DS&w=800", "publishedAt": "2020-11-19T07:12:00Z", "content": "LONDON (Reuters) - AstraZeneca and Oxford Universitys potential COVID-19 vaccine produced a strong immune response in older adults, data published on Thursday showed, with researchers expecting to re… [+2527 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com | Edited by Mallika Soni", "title": "Covid-19 and Guillain Barre Syndrome: Relation, causes and symptoms - Hindustan Times", "description": "Guillain Barre Syndrome is a rare autoimmune disorder, a prototype of post-infectious neuropathy that usually develops within two to four weeks after an acute infection, and is caused by a bacterial or viral infection.", "url": "https://www.hindustantimes.com/india-news/covid-19-and-guillain-barre-syndrome-relation-causes-and-symptoms/story-5dyPPPFK7Ijqkva2yHM0OO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/scientist-prepares-samples-calgary-monitoring-coronavirus-disease_6a1a8574-2a33-11eb-a1f1-9949958d68df.jpg", "publishedAt": "2020-11-19T06:52:26Z", "content": "Several neurologists in Mumbai came together last week to conduct a study on a rare neurological complication, the Guillain Barre Syndrome (GBS), in patients of the coronavirus disease (Covid-19). Th… [+2214 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Smeeta Mishra", "title": "COVID-19: What About the Concerns of People With Chronic Respiratory Ailments? - The Wire Science", "description": "COVID-19 campaigns need to address the fact that people with chronic respiratory ailments may find it uncomfortable to wear masks.", "url": "https://science.thewire.in/health/covid-19-what-about-the-concerns-of-people-with-chronic-respiratory-ailments/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/11/18181119/pexels-anna-shvets-3786120-scaled.jpg", "publishedAt": "2020-11-19T06:29:00Z", "content": "Photo: Anna Shvets/Pexels.\r\nWith the onset of winter, recurrent coughs and breathing troubles become more common among people living in most Indian cities. Symptoms of people with chronic respiratory… [+5269 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Exposure to Air Pollution may Impact Mental Health Later in Life: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "When looking at individual air pollutants, the research found that long-term exposure to nitrogen dioxide or fine particulate air pollution was associated with increased depressive symptoms, but with only a small effect. - Articles from The Weather Channel | …", "url": "https://weather.com/en-IN/india/pollution/news/2020-11-19-exposure-to-air-pollution-may-impact-mental-health-later-in-life", "urlToImage": "https://s.w-x.co/in-pollution_6_0.jpg", "publishedAt": "2020-11-19T06:19:25Z", "content": "A new research adds to the growing body of evidence that higher exposure to air pollution may affect mental health later in life. In a study of women aged 80 years and older, published in the Journal… [+1304 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Anushree Gupta", "title": "What you need to know about the Ebola-like Chapare virus recently discovered in Bolivia - Times Now", "description": "According to researchers, the Chapare virus can be transmitted among humans through body fluids. Researchers came across the virus while identifying pathogens that have the potential to cause pandemics.", "url": "https://www.timesnownews.com/health/article/what-you-need-to-know-about-the-ebola-like-chapare-virus-recently-discovered-in-bolivia/683743", "urlToImage": "https://imgk.timesnownews.com/story/iStock-940800024.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-19T06:06:06Z", "content": "<ul><li>The Chapare virus is a newly found virus in Bolivia</li></ul>\r\n<ul><li>Researchers came across the virus while identifying pathogens that have the potential to cause future pandemics</li></ul… [+3201 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can COVID-19 immunity last beyond six months for patients? - Times of India", "description": "Recent researches have evaluated that contrary to evidence, immunity against COVID-19 can last for a long while. But what is the maximum threshold you can possibly stay away from reinfection?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-covid-19-immunity-last-beyond-six-months-for-patients/photostory/79284349.cms", "urlToImage": "https://static.toiimg.com/photo/79284633.cms", "publishedAt": "2020-11-19T05:30:00Z", "content": "It has been largely presumed that patients who fight COVID gain antibodies, however, which start to wane after a while. The most cited confirmation came from a July-based King's College Study which f… [+1030 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Domestic cats can be asymptomatic carriers of SARS-CoV-2, show studies - News-Medical.Net", "description": "Two recently published studies from Kansas State University researchers and collaborators have led to two important findings related to the COVID-19 pandemic: Domestic cats can be asymptomatic carriers of SARS-CoV-2, but pigs are unlikely to be significant ca…", "url": "https://www.news-medical.net/news/20201119/Domestic-cats-can-be-asymptomatic-carriers-of-SARS-CoV-2-show-studies.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2019%2f5%2fFemale_veterinary_doctor_using_stethoscope_for_cute_kitten_-_Image_-_Maria_Sbytova_A1_87d2b43d99c4479d9866e299f000d075-620x480.jpg", "publishedAt": "2020-11-19T05:27:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 19 2020\r\nTwo recently published studies from Kansas State University researchers and collaborators have led to two important findings related to the COVID-19 pan… [+3088 chars]"}, {"source": {"id": null, "name": "SocialNews.XYZ"}, "author": null, "title": "YouTube adds extra info about Covid vaccines in fact-check panels - Social News XYZ", "description": "New Delhi, Nov 19 (SocialNews.XYZ) YouTube has started adding information about Covid-19 vaccines in a second link to its fact-check panels which are shown below the videos on coronavirus and Covid-19 relates themes. Earlier this... - Social News XYZ", "url": "https://www.socialnews.xyz/2020/11/18/youtube-adds-extra-info-about-covid-vaccines-in-fact-check-panels/", "urlToImage": "https://boxoffice.socialnews.xyz/get_ians_img.php.jpg?id=https://ians.in/news/C-1-1296351&txt=YouTube+adds+extra+info+about+Covid+vaccines+in+fact-check+panels", "publishedAt": "2020-11-19T04:48:15Z", "content": "Home » General » Study » YouTube adds extra info about Covid vaccines in fact-check panels\r\nNew Delhi, Nov 19 (SocialNews.XYZ) YouTube has started adding information about Covid-19 vaccines in a seco… [+974 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Children around the world have missed out on measles vaccine due to COVID-19, could trigger an outbreak - Firstpost", "description": "The pandemic has had an effect on the control of vaccine-preventable diseases because campaigns were paused and routine immunisation services were disrupted.", "url": "https://www.firstpost.com/health/children-around-the-world-have-missed-out-on-measles-vaccine-due-to-covid-19-could-trigger-an-outbreak-9029871.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/03/Measles-spot_UN-1.jpg", "publishedAt": "2020-11-19T04:22:56Z", "content": "The pandemic has had an effect on the control of vaccine-preventable diseases because campaigns were paused and routine immunisation services were disrupted.\r\n Major measles outbreaks might occur dur… [+2405 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "Lesbian, gay, bisexual communities more at-risk for dementia, study finds - New Kerala", "description": "", "url": "https://www.newkerala.com/news/2020/200787.htm", "urlToImage": "https://www.newkerala.com/news/news-box.jpg", "publishedAt": "2020-11-19T03:53:02Z", "content": "Michigan , November 18: Lesbian, gay and bisexual -- or LGB -- people are more vulnerable to one of the fastest-growing health concerns in the country: dementia, according to new research from Michig… [+3025 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Boosting immunity: Orange and coriander drink to rev up your immunity - Times of India", "description": "The sudden rains have changed the weather completely.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/home-remedies/boosting-immunity-orange-and-coriander-drink-to-rev-up-your-immunity/photostory/79286776.cms", "urlToImage": "https://static.toiimg.com/photo/79286944.cms", "publishedAt": "2020-11-19T03:30:00Z", "content": "You will need- 2 oranges, 2 coriander springs, 1 medium-sized carrot and 1 teaspoon lemon juice.\r\nHow to make: Peel the oranges, chop carrot and coriander. Put all this into a blender. Strain the jui… [+36 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Mike Ives, Apoorva Mandavilli", "title": "The Coronavirus Is Airborne Indoors. But We’re Still Scrubbing Surfaces. - The New York Times", "description": "Scientists who initially warned about contaminated surfaces now say that the virus spreads primarily through inhaled droplets, and that there is little to no evidence that deep cleaning mitigates the threat indoors.", "url": "https://www.nytimes.com/2020/11/18/world/asia/covid-cleaning.html", "urlToImage": "https://static01.nyt.com/images/2020/11/19/world/19virus-hk-hygiene03/19virus-hk-hygiene03-facebookJumbo.jpg", "publishedAt": "2020-11-19T03:05:00Z", "content": "A range of respiratory ailments, including the common cold and influenza, are caused by germs that can spread from contaminated surfaces. So when the coronavirus outbreak emerged last winter in the C… [+1444 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Mouthwash can kill COVID-19 within 30 seconds, finds UK study - Zee News", "description": "A new study conducted by researchers at the Cardiff University in United Kingdom has found that mouthwash can kill coronavirus within 30 seconds in saliva.", "url": "https://zeenews.india.com/health/mouthwash-can-kill-covid-19-within-30-seconds-finds-uk-study-2325424.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/19/900033-mouthwash.jpg", "publishedAt": "2020-11-19T03:02:41Z", "content": "A new study conducted by researchers at the Cardiff University in United Kingdom has found that mouthwash can kill coronavirus within 30 seconds in saliva.\r\nThe findings of the study were published l… [+2072 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Can Surgical Masks Be Reused? Here's What The Science Says About 'Single-Wear' - News18", "description": "The cost has become an issue, as has the fact so many disposable plastic masks wind up in waterways and the oceans.", "url": "https://www.news18.com/news/buzz/can-surgical-masks-be-reused-heres-what-the-science-says-about-single-wear-3094979.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605753116_untitled-design-2.png", "publishedAt": "2020-11-19T02:35:19Z", "content": "Health authorities say the most widespread anti-Covid weapon -- surgical masks -- must be thrown away after a single use, but environmental concerns are pushing some scientists to question this recom… [+3785 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "‘Those with pulmonary disease more vulnerable to Covid’ - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/chandigarh/those-with-pulmonary-disease-more-vulnerable-to-covid-172516", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/11/Desk/2020_11$largeimg_820281542.jpg", "publishedAt": "2020-11-19T01:44:00Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+465 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Food habits in pregnancy and its association with gestational diabetes mellitus: results from a prospective cohort study in public hospitals of urban India - BMC Blogs Network", "description": "Few studies have explored the relationship between food habits and the risk of gestational diabetes mellitus (GDM) in women from India. We aimed to investigate the associations of food habits and the risk of GDM. As part of the MAASTHI prospective cohort stud…", "url": "https://bmcnutr.biomedcentral.com/articles/10.1186/s40795-020-00388-x", "urlToImage": "https://media.springernature.com/w110/springer-static/cover/journal/40795.jpg", "publishedAt": "2020-11-19T01:21:43Z", "content": null}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "China has five COVID-19 vaccines in phase III clinical trials - Macau Business", "description": "China has five vaccines for COVID-19 currently undergoing phase III clinical trials in some foreign countries, a Foreign Ministry spokesperson said", "url": "https://www.macaubusiness.com/china-has-five-covid-19-vaccines-in-phase-iii-clinical-trials/", "urlToImage": null, "publishedAt": "2020-11-18T23:13:51Z", "content": "China has five vaccines for COVID-19 currently undergoing phase III clinical trials in some foreign countries, a Foreign Ministry spokesperson said here Wednesday.\r\nSpokesperson Zhao Lijian told a ne… [+1507 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Democratic Republic of Congo says it is Ebola free - CGTN America", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9a2FKS05oLVhJQTTSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-18T22:03:18Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "China’s Covid vaccine appears safe, causes immune response - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/world-news/china-s-covid-vaccine-appears-safe-causes-immune-response/story-bj7j47X0oiIuj7ORmJKv4L.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/19/Pictures/protest-against-restrictions-government-berlin-coronavirus-disease_b0733754-29df-11eb-a79c-2fe4f288de49.jpg", "publishedAt": "2020-11-18T20:56:17Z", "content": "Results from an early-phase randomised clinical trial of the Chinese Covid-19 vaccine candidate CoronaVac show that the formulation appears safe and induces an antibody response in volunteers aged 18… [+1425 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "PTI", "title": "AI, virtual reality can help fast track COVID-19 vaccine, experts say - National Herald", "description": "(AI) and virtual reality (VR) can be used to fast track COVID-19 vaccine development worldwide, experts say", "url": "https://www.nationalheraldindia.com/international/ai-virtual-reality-can-help-fast-track-covid-19-vaccine-experts-say", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-11%2F6a92b5be-3294-49a8-97aa-ac3dfb0bac52%2FAI.jpg?rect=0%2C88%2C1200%2C630&w=1200&auto=format%2Ccompress&fm=webp&ogImage=true", "publishedAt": "2020-11-18T20:12:32Z", "content": "Another technology of importance in COVID-19 vaccine research, Faber said, is automation.\r\nWhen customers develop a manufacturing process, he said they have to run a large number of experiments to na… [+1020 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "India's HIV prevention model can be adopted, scaled up in other countries: Harsh Vardhan - ANI News", "description": "New Delhi [India], November 19 (ANI): India has a unique HIV prevention model that can be adopted and scaled up in many countries by tailoring the intervention as per local settings, Union Health and Family Welfare Minister Harsh Vardhan said on Wednesday.", "url": "https://www.aninews.in/news/national/general-news/indias-hiv-prevention-model-can-be-adopted-scaled-up-in-other-countries-harsh-vardhan20201119013947", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/image0014ZZ7REVVE-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T20:09:00Z", "content": "ANI | Updated: Nov 19, 2020 01:39 IST\r\nNew Delhi [India], November 19 (ANI): India has a unique HIV prevention model that can be adopted and scaled up in many countries by tailoring the intervention … [+3523 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Will Feuer", "title": "Sen. Elizabeth Warren says CDC failed to capture the true toll of Covid on people of color - CNBC", "description": "Warren said the CDC's messaging and infographics on Covid-19 mortality rates across racial and ethnic groups \"do not tell the full story.\"", "url": "https://www.cnbc.com/2020/11/18/sen-warren-cdc-failed-to-capture-true-toll-of-covid-on-minorities.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106753300-16032327582020-10-20t221927z_886066567_rc2mmj9nuk1f_rtrmadp_0_health-coronavirus-usa-congress.jpeg?v=1603232814", "publishedAt": "2020-11-18T19:45:00Z", "content": "Sen. Elizabeth Warren is calling on the Centers for Disease Control and Prevention to clarify and revise its estimates for the risk posed to communities of color by Covid-19.\r\nCNBC obtained a copy of… [+2427 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Amla for air pollution: When and how to eat it for maximum health benefits - Times of India", "description": "The citrus fruit possesses compounds that can give a boost to your immune health and decrease the ill-effects of air pollution on your lungs caused due to degrading air quality levels.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/amla-for-air-pollution-when-and-how-to-eat-it-for-maximum-health-benefits/photostory/79283545.cms", "urlToImage": "https://static.toiimg.com/photo/79283923.cms", "publishedAt": "2020-11-18T18:30:00Z", "content": "Contrary to popular belief, winter is not all about cold and flu. The extreme cold weather also increases the risk of heart attack, high blood pressure and respiratory issues, which is predominantly … [+679 chars]"}, {"source": {"id": null, "name": "Modern Diplomacy"}, "author": "Eric Zuesse", "title": "Where Covid-19 Has Already Killed More Than One Person Per Thousand - Modern Diplomacy", "description": "As-of November 15th, more than one person per thousand had already died from the Covid-19 virus (coronavirus-19) in the nations of San Marino (1.2 per thousand) Belgium (1.2 per thousand) Peru (1.1 per thousand) and in the U.S. states of New Jersey (1.9 per t…", "url": "https://moderndiplomacy.eu/2020/11/18/where-covid-19-has-already-killed-more-than-one-person-per-thousand/", "urlToImage": "https://moderndiplomacy.eu/wp-content/uploads/2020/08/coronavirus-women.jpg", "publishedAt": "2020-11-18T16:02:08Z", "content": "As-of November 15th, more than one person per thousand had already died from the Covid-19 virus (coronavirus-19) in the nations of\r\nand in the U.S. states of\r\n<ul><li>New Jersey (1.9 per thousand)</l… [+14518 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Raw almonds vs. Soaked almonds: What's better and why? - Times of India", "description": "Almonds are a great source of nutrients for the body. Whether you eat it raw or soaked is all up to you and your taste bud. However, when it comes to your health, you must go for soaked almonds. Soaking the almond not only makes it easier to take off the peel…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/raw-almonds-vs-soaked-almonds-whats-better-and-why/photostory/79284508.cms", "urlToImage": "https://static.toiimg.com/photo/79284525.cms", "publishedAt": "2020-11-18T15:30:00Z", "content": "Besides being loaded with nutrients and better than raw almonds, here are some other benefits of eating soaked almonds.\r\n- It is extremely good for digestion.\r\n- It makes for a healthy snack and assi… [+267 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Free Press Journal", "title": "Corona Vaccine Tracker on Nov 18, 2020 - Free Press Journal", "description": "Pakistan has earmarked USD 100 million for advance payment to procure the coronavirus vaccine as and when it is available. The funds were approved for the initial purchase with the decision that vulnerable segments like senior citizens, health practitioners a…", "url": "https://www.freepressjournal.in/health/corona-vaccine-tracker-on-nov-18-2020", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2020-11%2F46412795-51e8-4e31-9252-e27a5a6e0709%2Fetc_corona_vaccine_tracker_pakistan_nov_18.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-11-18T14:52:00Z", "content": "Pakistan earmarks $100 million for vaccine\r\nPakistan has earmarked USD 100 million for advance payment to procure the coronavirus vaccine as and when it is available.\r\nThe funds were approved for the… [+1178 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Jacob Koshy", "title": "Kerala to commission genome survey for SARS-CoV-2 - The Hindu", "description": "Study, commissioned on November 11, will collect 100 samples from 14 districts every month, for three months", "url": "https://www.thehindu.com/sci-tech/health/kerala-to-commission-genome-survey-for-sars-cov-2/article33126471.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/ic0zs7/article31489406.ece/ALTERNATES/LANDSCAPE_615/03TH-SCICOV-TESTING-1", "publishedAt": "2020-11-18T14:45:00Z", "content": "To better understand the genomic variation in the strains of SARS-CoV-2 in the State, the Kerala government has tied up with the CSIR-Institute of Genomics and Integrative Biology (IGIB) for a survey… [+1955 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19's harmful neurological effects are more common in patients with hypertension, diabetes - News-Medical.Net", "description": "Some patients with COVID-19 are at higher risk of neurological complications like bleeding in the brain and stroke, according to a study being presented at the annual meeting of the Radiological Society of North America.", "url": "https://www.news-medical.net/news/20201118/COVID-19s-harmful-neurological-effects-are-more-common-in-patients-with-hypertension-diabetes.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fInsulin-620x480.jpg", "publishedAt": "2020-11-18T14:19:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 18 2020\r\nSome patients with COVID-19 are at higher risk of neurological complications like bleeding in the brain and stroke, according to a study being presented… [+3233 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Scientists decode how smoking worsens Covid-19 infection - India Today", "description": "The findings also shed more light on the Covid-19 risks for smokers.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/scientists-decode-how-smoking-worsens-covid-19-infection-1742013-2020-11-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202011/COR-647x363.jpeg?CqRcOMY_NW5k4dU13SN.U0S62PXO4Vg0", "publishedAt": "2020-11-18T14:18:04Z", "content": "Scientists have decoded how smoking cigarettes facilitates more severe lung infection by the novel coronavirus, an advance that may lead to new therapeutic strategies to help reduce smokers' chances … [+2996 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Masks, explained: What percentage of the virus can be blocked, and what it means for the infected and uninfected? - Economic Times", "description": "Here's a look at how what we know about masks has changed.", "url": "https://economictimes.indiatimes.com/magazines/panache/mask-explained-what-percentage-of-the-virus-can-be-blocked-and-what-it-means-for-the-infected-and-uninfected/articleshow/79282831.cms", "urlToImage": "https://img.etimg.com/thumb/msid-79284473,width-1070,height-580,imgsize-373880,overlay-etpanache/photo.jpg", "publishedAt": "2020-11-18T13:00:00Z", "content": "A lot of the effort to slow the spread of the coronavirus comes down to a seemingly simple concept: Wearing a mask.\r\nBut the issue has proven a thorny one. Health authorities have changed their guida… [+4158 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "Tribune India", "title": "Italian study suggesting COVID predates China outbreak sparks scepticism - The Tribune India", "description": "Study’s author says more investigation needed", "url": "https://www.tribuneindia.com/news/health/italian-study-suggesting-covid-predates-china-outbreak-sparks-scepticism-172183", "urlToImage": "https://cmsimages.tribuneindia.com/gallary_content/2020/11/2020_11$largeimg_2002691985.JPG", "publishedAt": "2020-11-18T12:53:00Z", "content": "Rome, November 18\r\nAn Italian study supporting the case that the novel coronavirus was circulating outside China earlier than thought has sparked doubts among some Western scientists who called for f… [+4902 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Artificial intelligence-based tool may help diagnose opioid addiction earlier, finds study - ANI News", "description": "Washington [US], November 18 (ANI): A study published in Ecological Applications suggests that nature around one's home may help mitigate some of the negative mental health effects of the COVID-19 pandemic.", "url": "https://www.aninews.in/news/science/artificial-intelligence-based-tool-may-help-diagnose-opioid-addiction-earlier-finds-study20201118174241", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/asjdhjashjdsjhadshjdhjads-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T12:13:50Z", "content": "Washington [US], November 18 (ANI): Researchers have used machine learning, a type of artificial intelligence, to develop a prediction model for the early diagnosis of opioid use disorder.The advance… [+840 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "BI India Bureau", "title": "Chapare Virus — All you need to know about the deadly virus that causes hemorrhagic fever like Ebola - Business Insider India", "description": "The Centre for Disease Control and Prevention in the US said that the Chapare virus falls in the arenavirus category. It can spread through direct contact", "url": "https://www.businessinsider.in/science/health/news/what-is-chapare-virus-and-symptom-of-this-virus/articleshow/79282571.cms", "urlToImage": "https://www.businessinsider.in/photo/79282571/what-is-chapare-virus-and-symptom-of-this-virus.jpg?imgsize=540325", "publishedAt": "2020-11-18T11:36:00Z", "content": "It’s been one whole year since the first coronavirus case was reported in Wuhan, China – the pandemic that brought the world to a standstill. And now, there’s another virus called Chapare that has re… [+1625 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": null, "title": "Masks don't impair lung function during exercise: Study - Telangana Today", "description": "For healthy persons, the effects of wearing a mask on given physiological markers were minimal, no matter what type of mask was worn or the degree of exercise.", "url": "https://telanganatoday.com/masks-dont-impair-lung-function-during-exercise-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/11/Face-mask_exercise.jpg", "publishedAt": "2020-11-18T11:03:29Z", "content": "New York: While a face mask might feel uncomfortable, researchers have said that they do not significantly change the actual work of breathing or the flow of oxygen and carbon dioxide when worn while… [+2322 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Hina Zahid", "title": "Omega-3 CA did not decrease risk of cardiac events finds STRENGTH trial - Medical Dialogues", "description": "DALLAS - The fish oil-based medication known as omega-3 carboxylic acids or omega-3 CA did not...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/omega-3-ca-did-not-decrease-risk-of-cardiac-events-finds-strength-trial-71564", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/18/123214-fish-oil-supplements.jpg", "publishedAt": "2020-11-18T10:59:59Z", "content": "DALLAS - The fish oil-based medication known as omega-3 carboxylic acids or omega-3 CA did not decrease the risk of cardiac events compared to a placebo, according to late-breaking research presented… [+2926 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Jahnavi Gupta", "title": "E-cigarette users may have increased susceptibility to Covid-19 - Hindustan Times", "description": "In a controlled study of smokers, nonsmokers, and e-cigarette users, University of North Carolina School of Medicine researchers found that e-cigarette users exhibited significantly altered immune responses to a model of influenza virus infection.", "url": "https://www.hindustantimes.com/health/e-cigarette-users-may-have-increased-susceptibility-to-covid-19/story-zhyH8QGE9k0EHlS7Q9EhYM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/18/Pictures/_12b1984c-298c-11eb-bd4c-84783e11e201.jpg", "publishedAt": "2020-11-18T10:58:03Z", "content": "In a controlled study of smokers, nonsmokers, and e-cigarette users, University of North Carolina School of Medicine researchers found that e-cigarette users exhibited significantly altered immune re… [+4653 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Aditi Murti", "title": "2021 Measles Outbreak Is Likely Due to Vaccine Delays: Experts - The Swaddle", "description": "The Covid19 pandemic and related lockdowns have caused families all over the world to fall behind on children’s vaccine schedules.", "url": "https://theswaddle.com/2021-measles-outbreak-is-likely-due-to-vaccine-delays-experts/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2020/11/MS1.jpg", "publishedAt": "2020-11-18T10:39:13Z", "content": "A measles outbreak is likely in 2021 due to disrupted vaccination schedules caused by the Covid19 lockdown, according to an article published in The Lancet. The scientists who authored the article ur… [+3103 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Is COVID airborne or not? Here's what you need to know - Times of India", "description": "The novel coronavirus is a respiratory illness, which is highly infectious and fatal. While people continue to take precautionary measures and maintain social distancing, the discussion around whether or not COVID-19 is airborne seems to rage on.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-is-covid-airborne-or-not-heres-what-you-need-to-know/photostory/79278562.cms", "urlToImage": "https://static.toiimg.com/photo/79278568.cms", "publishedAt": "2020-11-18T10:30:00Z", "content": "Up until today, COVID-19 has not been confirmed as an airborne disease. However, many scientists in the past have suggested the possibility of airborne transmission of the virus. While WHO has confir… [+720 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Karan Thapar", "title": "Oxford Vaccine May Better Fit India Than Pfizer's or Moderna's: Gagandeep Kang - The Wire Science", "description": "However, she expressed concerns about the manner in which the government planned to identify people falling into the four priority groups for vaccination.", "url": "https://science.thewire.in/the-sciences/oxford-vaccine-may-better-fit-india-than-pfizers-or-modernas-gagandeep-kang/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/05/26163744/gagandeep-kang.jpg", "publishedAt": "2020-11-18T10:29:00Z", "content": "Photo: YouTube.\r\nThe following is a paraphrased summary of Gagandeep Kangs interview to Karan Thapar for The Wire. It is not inaccurate but it has been recounted from memory; please watch the full in… [+5712 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Covid-19 from frozen food? | Firms need to be 'mature' in implementing job-sharing | THE BIG STORY - The Straits Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9cEs1bWZLRGNxZ0HSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-18T09:56:38Z", "content": null}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Marnie Willman", "title": "Sugar in Semen Makes HIV Drugs Less Effective - The Wire Science", "description": "High levels of sugar can obstruct antivirals from linking with viruses.", "url": "https://science.thewire.in/the-sciences/sugar-in-semen-makes-hiv-drugs-less-effective/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/11/18072908/6813489183_0b1d983bfc_o-1.jpg", "publishedAt": "2020-11-18T09:29:00Z", "content": "Scanning electromicrograph of an HIV-infected T cell. Photo: NIAID.\r\nWell over half a million people die of HIV/AIDS each year, making it one of the leading causes of death in the world. According to… [+5068 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": "IANS", "title": "Chinese COVID-19 vaccine appears safe, induces immune response: Study - Mid-day", "description": "CoronaVac is one of the 48 vaccine candidates for Covid-19 that are currently in clinical trials", "url": "https://www.mid-day.com/articles/chinese-covid-19-vaccine-appears-safe-induces-immune-response-study/23096239", "urlToImage": "https://images.mid-day.com/images/2020/nov/Covid-Vaccine-Pandemic_d.jpg", "publishedAt": "2020-11-18T08:20:00Z", "content": "Published: 18 November, 2020 13:50 IST | \r\n IANS |\r\n Mumbai\r\nA Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an … [+3328 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Gursharan Bhalla", "title": "Brazil To Get First Doses Of China's Sinovac COVID-19 Vaccine, Eyes Pfizer Now - Indiatimes.com", "description": "Brazil is set to begin importing the first of 46 million doses of China’s Sinovac vaccine against COVID-19, while the federal government takes a more cautious approach with a vaccine developed by Pfizer Inc. The import will begin from Brazil's Sao Paulo state…", "url": "https://www.indiatimes.com/news/world/brazil-to-get-first-doses-of-china-sinovac-covid-19-vaccine-eyes-pfizer-now-527791.html", "urlToImage": "https://im.indiatimes.in/content/2020/Nov/Sinovac_5fb4d32d36027.jpg", "publishedAt": "2020-11-18T08:05:56Z", "content": "Brazil is set to begin importing the first of 46 million doses of Chinas Sinovac vaccine against COVID-19, while the federal government takes a more cautious approach with a vaccine developed by Pfiz… [+2102 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Chinese Covid vax appears safe, induces immune response: Study - Daily Pioneer", "description": "A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an early-phase randomised clinical trial, say researchers.\n\nAccording to the study, published in the journal The Lancet Infe…", "url": "https://www.dailypioneer.com/2020/pioneer-health/chinese-covid-vax-appears-safe--induces-immune-response--study.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/chinese-covid-vax-appears-safe--induces-immune-response--study-2020-11-18.jpg", "publishedAt": "2020-11-18T07:15:48Z", "content": "A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an early-phase randomised clinical trial, say researchers.\r\nAcco… [+2598 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Night Shift Workers at Increased Risk of Severe Asthma, New Study Finds | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "According to the study, published in the journal Thorax, around one in five employees in the developed world works permanent or rotating night shifts. Shift work causes a person's internal body clock (circadian rhythm) to be out of step with the external ligh…", "url": "https://weather.com/en-IN/india/health/news/2020-11-18-night-shift-workers-at-increased-risk-of-severe-asthma-new-study", "urlToImage": "https://s.w-x.co/in-asthma_2.jpg", "publishedAt": "2020-11-18T07:14:17Z", "content": "In a major study, researchers have revealed that shift workers, especially those working permanently in the night rotation, may be at heightened risk of moderate to severe asthma.\r\nAccording to the s… [+2548 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Chinese Coronavirus vaccine appears safe, induces immune response: Study - The Hans India", "description": "A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy ...", "url": "https://www.thehansindia.com/life-style/health/chinese-coronavirus-vaccine-appears-safe-induces-immune-response-study-656957", "urlToImage": "https://assets.thehansindia.com/h-upload/2020/11/18/1012417-coronavirus.jpg", "publishedAt": "2020-11-18T06:50:45Z", "content": "Beijing: A Chinese vaccine candidate -- CoronaVac -- appears safe and induces an antibody response in healthy volunteers aged 18 to 59 years in an early-phase randomised clinical trial, say researche… [+2624 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID-19 vaccines: 5 false myths to avoid and break away from - Times of India", "description": "While scientists and medical professionals are working hard to develop a clinically approved vaccine to treat patients and contain the spread of the virus, people are struggling to keep the vaccine-related mistruths at bay.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-19-vaccines-5-false-myths-to-avoid-and-break-away-from/photostory/79262095.cms", "urlToImage": "https://static.toiimg.com/photo/79262121.cms", "publishedAt": "2020-11-18T05:30:00Z", "content": "Surely, scientists and researchers are burning the midnight oil to develop a vaccine. Additionally, there's also an urgency in the need for a possible cure. However, just because the progress on deve… [+256 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "China's Sinovac COVID-19 vaccine induces quick immune response, study says - DNA India", "description": "CoronaVac and four other experimental vaccines developed in China are currently undergoing late-stage trials to determine their effectiveness in preventing COVID-19.", "url": "https://www.dnaindia.com/world/report-china-s-sinovac-covid-19-vaccine-induces-quick-immune-response-study-says-2857110", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/11/18/938240-sinovac-coronavirus-vaccine-reuters.jpg", "publishedAt": "2020-11-18T05:04:00Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Retinas: New potential clues in diagnosing, treating Alzheimer's - ANI News", "description": "Washington [US], November 18 (ANI): A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found in the back of the eye - that are more affected by Alzheimer's disease than other areas.", "url": "https://www.aninews.in/news/health/retinas-new-potential-clues-in-diagnosing-treating-alzheimers20201118102937", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/brain_feb16_fmjBxGn_qdEpEiY_xTCd2Q3-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T05:01:42Z", "content": "ANI | Updated: Nov 18, 2020 10:29 IST\r\nWashington [US], November 18 (ANI): A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found i… [+3399 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Reuters", "title": "Sinovac's Covid-19 vaccine induces quick immune response - Deccan Herald", "description": "Sinovac Biotech's experimental Covid-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday. While the early to mid…", "url": "https://www.deccanherald.com/science-and-environment/sinovacs-covid-19-vaccine-induces-quick-immune-response-916991.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/file7d8vmmjm6491f0e2c3aj-reuters-916991-1605669193.jpg", "publishedAt": "2020-11-18T03:13:13Z", "content": "Sinovac Biotech's experimental Covid-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, prelimina… [+3749 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "‘Long Covid’ causing organ impairments in 70% of low-risk patients, says UK study - ThePrint", "description": "The study found that heart and lung impairment were just as prevalent in low-risk individuals with long Covid as the older counterparts.", "url": "https://theprint.in/health/long-covid-causing-organ-impairments-in-70-of-low-risk-patients-says-uk-study/545344/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/06/Covid-19-test-scaled-e1591854650355.jpg", "publishedAt": "2020-11-18T02:39:53Z", "content": "New Delhi: Almost 70 per cent of ‘low-risk’ Covid-19 patients have impairment in one or more organs four months after initial symptoms of SARS-CoV-2 infection, according to a new study from the UK.\r\n… [+3585 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Sinovac's Covid-19 vaccine CoronaVac induces quick immune response: Study - Mint", "description": "The study comes hot on the heels of upbeat news this month from US drugmakers Pfizer and Moderna as well as Russia that showed their experimental vaccines were over 90% effective.CoronaVac and four other experimental vaccines developed in China are currently …", "url": "https://www.livemint.com/science/health/sinovac-s-covid-19-vaccine-coronavac-induces-quick-immune-response-study-11605656626675.html", "urlToImage": "https://images.livemint.com/img/2020/11/17/600x338/2020-11-17T233014Z_870212968_RC2B5K926HFO_RTRMADP_3_HEALTH-CORONAVIRUS-SINOVAC_1605657157853_1605657237844.JPG", "publishedAt": "2020-11-17T23:56:00Z", "content": "SINGAPORE/BEIJING: Sinovac Biotech's experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the… [+3961 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Miyoung Kim, Roxanne Liu", "title": "Sinovac's COVID-19 vaccine induces quick immune response - study - Reuters UK", "description": "Sinovac Biotech's <SVA.O> experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday.", "url": "https://in.reuters.com/article/uk-health-coronavirus-sinovac-idUKKBN27X35I", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201117&t=2&i=1541560730&r=LYNXMPEGAG1X8&w=800", "publishedAt": "2020-11-17T23:45:00Z", "content": "SINGAPORE/BEIJING (Reuters) - Sinovac Biotech's SVA.O experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had r… [+3962 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Go easy on the eggs: 'Egg-cess' consumption linked to diabetes - Times of India", "description": "New research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes. Conducted in partnership with the China Medical University, and Qatar University, the longitudinal study (1991 to 2009) is the first to a…", "url": "https://timesofindia.indiatimes.com/videos/news/go-easy-on-the-eggs-egg-cess-consumption-linked-to-diabetes/videoshow/79258899.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-79258899,imgsize-253722.cms", "publishedAt": "2020-11-17T22:30:00Z", "content": "Nov 18, 2020, 04:00AM ISTSource: ANINew research from the University of South Australia shows that excess egg consumption can increase your risk of diabetes. Conducted in partnership with the China M… [+830 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Agencies", "title": "Measles outbreaks likely in wake of COVID-19 pandemic, say scientists - Millennium Post", "description": "Melbourne: A major measles outbreaks might occur during 2021 as an unexpected consequence of the...", "url": "http://www.millenniumpost.in/world/measles-outbreaks-likely-in-wake-of-covid-19-pandemic-say-scientists-424097", "urlToImage": "http://www.millenniumpost.in/h-upload/2020/11/17/533805-3852x8h1zuqde5qi5sn1sbxwaddqbpwztbi85718669.jpg", "publishedAt": "2020-11-17T17:55:24Z", "content": "Melbourne: A major measles outbreaks might occur during 2021 as an unexpected consequence of the COVID-19 pandemic, say scientists in an academic article published in the Lancet journal. \r\nAccording … [+2210 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Himani Chandna", "title": "6 in 10 diabetics in India worry about catching Covid, getting hospitalised, study finds - ThePrint", "description": "Study by market research firm Kantar also finds that more city residents are worried about uncontrolled blood sugar levels in general.", "url": "https://theprint.in/health/6-in-10-diabetics-in-india-worry-about-catching-covid-getting-hospitalised-study-finds/546299/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/04/diabetes.jpg", "publishedAt": "2020-11-17T15:11:07Z", "content": "New Delhi: Six in every 10 diabetics surveyed in India have expressed concern about catching Covid-19 and getting hospitalised for the disease, found a study by UK-based market research firm Kantar.\r… [+3623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany May Cull Up To 70,000 Chickens After Bird Flu Found On Another Farm - NDTV", "description": "Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to 70,000 poultry is being prepared, authorities said on Tuesday.", "url": "https://www.ndtv.com/world-news/germany-may-cull-up-to-70-000-chickens-after-bird-flu-found-on-another-farm-2326346", "urlToImage": "https://c.ndtvimg.com/2019-09/0isuishs_chicken-generic_625x300_13_September_19.jpg", "publishedAt": "2020-11-17T10:46:50Z", "content": "A series of outbreaks of bird flu have been reported in Europe in past weeks (Representational)\r\nHamburg: Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to… [+1567 chars]"}]}