{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "Coronavirus Global Tracker: Trump Plans Immigration Ban - The New York Times", "description": "Hong Kong announced the extension a day after reporting no new cases. And President Trump said he planned to close the United States to people trying to immigrate.", "url": "https://www.nytimes.com/2020/04/21/world/coronavirus-news.html", "urlToImage": "https://www.nytimes.com/newsgraphics/2020/04/09/corona-virus-social-images-by-section/assets/World_promo.jpg?u=1587457898378", "publishedAt": "2020-04-21T08:36:33Z", "content": "The health ministry said on Monday that 1,294 new cases were reported in the past 24 hours and that 91 people had died. Irans official tally stands at 5,209 people dead and 83,505 infected.\r\nIn Iraq, the decision on Monday to lift the curfew will allow some p… [+947 chars]"}, {"source": {"id": null, "name": "Thehindubusinessline.com"}, "author": "The Hindu BusinessLine", "title": "A covid-19 patient shows signs of improvement after plasma therapy - BusinessLine", "description": "The patient recovers and taken off the ventilator, says the Delhi hospital.", "url": "https://www.thehindubusinessline.com/news/science/a-covid-19-patient-shows-signs-of-improvement-after-plasma-therapy/article31395105.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/70nzlv/article31395122.ece/ALTERNATES/LANDSCAPE_615/plasma-theraphyjpg", "publishedAt": "2020-04-21T08:27:59Z", "content": "A 49-year-old man infected with the coronavirus, who was admitted at the Max Hospital in Delhis Saket, showed positive results after receiving the plasma therapy. The patient, who was earlier in a ventilators support, declared out of danger, the hospital info… [+1153 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Business Insider India", "title": "Rugby legend Kirwan tackles COVID-19 mental health - Business Insider India", "description": "Wellington, Apr 21 (AFP) After years battling his own demons, All Black legend John Kirwan is attempting to help fellow Kiwis struggling through COVID-19 lockdown", "url": "https://www.businessinsider.in/sports/news/rugby-legend-kirwan-tackles-covid-19-mental-health/articleshow/75267550.cms", "urlToImage": "https://www.businessinsider.in/photo/75267550/rugby-legend-kirwan-tackles-covid-19-mental-health.jpg?imgsize=64457", "publishedAt": "2020-04-21T07:45:00Z", "content": "Wellington, Apr 21 (AFP) After years battling his own demons, All Black legend John Kirwan is attempting to help fellow Kiwis struggling through COVID-19 lockdown by releasing a mobile phone app he calls \"a mental wellbeing coach in your pocket\".The World Cup… [+3622 chars]"}, {"source": {"id": null, "name": "Thestar.com.my"}, "author": "The Star Online", "title": "Experts: Accusation that Covid-19 virus originates in lab is false and wrong - The Star Online", "description": "BEIJING: The accusations that the Covid-19 (coronavirus) outbreak causing the pandemic was created in the laboratory or in a laboratory in China's Wuhan are false and wrong, several French scientists have said.", "url": "https://www.thestar.com.my/news/regional/2020/04/21/experts-accusation-that-covid-19-virus-originates-in-lab-is-false-and-wrong", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2020/04/21/651835.jpg", "publishedAt": "2020-04-21T07:44:48Z", "content": "BEIJING: The accusations that the Covid-19 (coronavirus) outbreak causing the pandemic was created in the laboratory or in a laboratory in China's Wuhan are false and wrong, several French scientists have said.Driven by a malicious intention of scapegoating C… [+2576 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19: New low-cost, non-invasive ventilator may help fight deadly coronavirus - The Financial Express", "description": "A low-cost, easy-to-build non-invasive ventilator aimed at supporting the breathing of patients with respiratory failure performs similarly to conventional devices.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-new-low-cost-non-invasive-ventilator-may-help-fight-deadly-coronavirus/1935059/", "urlToImage": "https://images.financialexpress.com/2020/04/1-211.jpg", "publishedAt": "2020-04-21T07:25:39Z", "content": "A low-cost, easy-to-build non-invasive ventilator aimed at supporting the breathing of patients with respiratory failure performs similarly to conventional devices, according to new study that may help manage symptoms in those with severe manifestation of COV… [+4971 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The immune system's response to a coronavirus attack - The Hindu", "description": "COVID-19 is not different from how influenza viruses attack the body. Therefore, the immune system has a predictable response to it. A cascade of viral parti...", "url": "https://www.youtube.com/watch?v=jDfpe4OQROw", "urlToImage": "https://i.ytimg.com/vi/jDfpe4OQROw/maxresdefault.jpg", "publishedAt": "2020-04-21T07:05:25Z", "content": "COVID-19 is not different from how influenza viruses attack the body. Therefore, the immune system has a predictable response to it.A cascade of viral particles enters the body through the nose, eyes or mouth. Breathing carries some of these particles to the … [+913 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "K J M Varma", "title": "China plans to give medics Covid-19 vaccines by year-end to protect them: Health officials - ThePrint", "description": "An adenovirus Covid-19 vector vaccine, developed by Institute of Military Medicine in China, is the first in the world that has entered second phase of clinical trial.", "url": "https://theprint.in/world/china-plans-to-give-medics-covid-19-vaccines-by-year-end-to-protect-them-health-officials/405784/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2018/11/Flu-vaccine-rep-img.jpg", "publishedAt": "2020-04-21T06:38:49Z", "content": "Beijing: China plans to inject Chinese medics with coronavirus vaccines by year-end to protect them to deal with any emergency situation, while 11 new confirmed COVID-19 cases were reported in the country with no deaths due to the virus, health officials said… [+3003 chars]"}, {"source": {"id": null, "name": "Newstodaynet.com"}, "author": null, "title": "Corona: Ireland records more deaths in single day - News Today", "description": "A total of 77 COVID-19-related deaths were reported in Ireland on Monday, the highest figure ever recorded in a single day since the COVID-19 outbreak in the country, according to the statistics released by the Irish Department of Health. Continue Reading →", "url": "https://newstodaynet.com/index.php/2020/04/21/corona-ireland-records-more-deaths-in-single-day/", "urlToImage": "https://newstodaynet.com/wp-content/uploads/2020/03/Feb27_2020_CDC_Coronavirus.jpg", "publishedAt": "2020-04-21T06:14:14Z", "content": "Dublin: A total of 77 COVID-19-related deaths were reported in Ireland on Monday, the highest figure ever recorded in a single day since the COVID-19 outbreak in the country, according to the statistics released by the Irish Department of Health.\r\nTo date, th… [+2165 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Japan Tests Show 11 Dead Were Infected With Coronavirus - News18", "description": "Some of the 11 died at home and one was found lying in the street, the Nikkei business daily and other media said, citing the National Police Agency.", "url": "https://www.news18.com/news/world/japan-tests-show-11-dead-were-infected-with-coronavirus-2586095.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587446541_japan-coronavirus.jpg", "publishedAt": "2020-04-21T05:34:23Z", "content": "Japanese police reported last month the deaths of 11 people deemed to be unnatural before tests showed the victims had been infected with the new coronavirus, media said on Tuesday.\r\nJapan, with more than 260 virus-related deaths according to public broadcast… [+988 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Humans to blame for spread of coronavirus and other 'zoonosis' - The Jakarta Post - Jakarta Post", "description": "It is human activity enabled the virus to jump to people, and specialists are warning that if nothing changes many other pandemics of this nature will follow.", "url": "https://www.thejakartapost.com/life/2020/04/21/humans-to-blame-for-spread-of-coronavirus-and-other-zoonosis-.html", "urlToImage": "https://img.jakpost.net/c/2020/03/24/2020_03_24_90542_1585049721._large.jpg", "publishedAt": "2020-04-21T05:05:00Z", "content": "Whether it came from a bat or a pangolin is not certain, but one thing is: the coronavirus outbreak that has killed tens of thousands and turned the world upside down comes from the animal world.\r\nIt is human activity enabled the virus to jump to people, and … [+4970 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Kristen V Brown", "title": "Why there is a big debate over accuracy and results of Covid anti-body tests - ThePrint", "description": "The anti-body test is crucial to understanding Covid-19 & the virus that causes it. It can tell how many people potentially have some level of immunity.", "url": "https://theprint.in/world/why-there-is-a-big-debate-over-accuracy-and-results-of-covid-anti-body-tests/405721/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Sample-test.jpg", "publishedAt": "2020-04-21T04:26:21Z", "content": "San Francisco: As the U.S. begins to consider letting people go back to work and lifting social-distancing rules, a new debate over testing is emerging. Researchers are racing to back-fill the gaping holes left by shortfalls in diagnostic tests for currently … [+8536 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Los Angeles Coronavirus Infections 40 Times Greater Than Known Cases, Antibody Tests Suggest - News18", "description": "At least 17 additional fatalities were recorded in Los Angeles County on Monday, bringing the total to 600, with more than 12,300 positive cases.", "url": "https://www.news18.com/news/world/los-angeles-coronavirus-infections-40-times-greater-than-known-cases-antibody-tests-suggest-2585885.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587437644_los-angeles.jpg", "publishedAt": "2020-04-21T03:14:12Z", "content": "Some 4.1% of adults tested positive for coronavirus antibodies in a study of Los Angeles County residents, health officials said on Monday, suggesting the rate of infection may be 40 times higher than the number of confirmed cases.\r\nThe serology tests, conduc… [+2240 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Teena Thacker", "title": "No symptoms in 80% of Covid cases raise concerns - Economic Times", "description": "The new revelation of asymptomatic or mildly symptomatic infection in India has sparked concerns.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/no-symptoms-in-80-of-covid-cases-raise-concerns/articleshow/75260387.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75262834,width-1070,height-580,imgsize-226823,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-21T02:26:00Z", "content": "New Delhi: With mounting evidence that asymptomatic Covid-19 cases are spreading the infection, India’s top medical research body is grappling with the problem posed by “silent spreaders” and examining the feasibility of starting ‘door-to-door’ surveillance t… [+3810 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Covid-19 not the last pandemic, world has to build resilience - Hindustan Times", "description": "The coronavirus disease (Covid-19), which has already infected 2.4 million people and killed at least 165,000, is the second most devastating pandemic after the 1918 Spanish flu.", "url": "https://www.hindustantimes.com/india-news/covid-not-the-last-pandemic-world-has-to-build-resilience/story-bOrpRseqzhDgTjvxStRFzK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/21/Pictures/_1d79ff1c-8347-11ea-a351-6978c1d205f3.png", "publishedAt": "2020-04-21T00:51:42Z", "content": "Covid-19 is not the first, nor will it be the last , of high-impact, rapidly spreading pandemics to cause disruption and death on a large scale, upend economies, and roil society. Pandemics are emerging with higher frequency and becoming increasingly difficul… [+5248 chars]"}, {"source": {"id": null, "name": "Menafn.com"}, "author": "MENAFN", "title": "Oxford University to Begin Tests of its Coronavirus Vaccine on Humans NEXT WEEK in Hope of Having a Jab Ready for Autumn - MENAFN.COM", "description": "(MENAFN - SomTribune) Hopes of eliminating the coronavirus were raised today after leading British experts revealed trials of a vaccine would begin on humans next week.\nOxford University scientists are confident they can get jab for the incurable disease roll…", "url": "https://menafn.com/1100056200/Oxford-University-to-Begin-Tests-of-its-Coronavirus-Vaccine-on-Humans-NEXT-WEEK-in-Hope-of-Having-a-Jab-Ready-for-Autumn", "urlToImage": "https://menafn.com/updates/pr/2020-04/20/S_af424335-cimage_story.jpg", "publishedAt": "2020-04-21T00:08:28Z", "content": "(MENAFN - SomTribune) Hopes of eliminating the coronavirus were raised today after leading British experts revealed trials of a vaccine would begin on humans next week.\r\nOxford University scientists are confident they can get jab for the incurable disease rol… [+5519 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Mary Kekatos Senior Health Reporter For Dailymail.com", "title": "Coronavirus HAS mutated: Strains that evolved to be far deadlier have spread in Europe and New York - Daily Mail", "description": "Some of the deadliest mutations were Zhejiang, where the university is located, as well as in several European countries, but milder mutations were the varieties found in the US.", "url": "https://www.dailymail.co.uk/health/article-8237849/Coronavirus-mutated-Strains-evolved-far-deadlier-spread-Europe-New-York.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/04/20/20/27430266-0-image-a-26_1587410581103.jpg", "publishedAt": "2020-04-20T22:36:02Z", "content": "The novel coronavirus has mutated which could have very deadly complications for the pandemic, a new small study finds.\r\nA team of Chinese researchers from Zhejiang University say there are at least 30 strains of the virus, known as SARS-COV-2.\r\nStrains withi… [+6115 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Derby consultant Manjeet Singh Riyat dies - BBC News", "description": "Manjeet Singh Riyat was described as \"well loved\" and \"hugely respected\" throughout the NHS.", "url": "https://www.bbc.com/news/uk-england-derbyshire-52362791", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13E3A/production/_111866418_manjeetsingh.jpg", "publishedAt": "2020-04-20T21:29:05Z", "content": "Image copyrightUHDBImage caption\r\n Dr Manjeet Singh Riyat was described as an \"incredibly charming person\" who will be missed \"immensely\"\r\nAn accident and emergency consultant who was \"hugely respected\" nationally has died after contracting coronavirus.\r\nMr M… [+1310 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Hay fever or coronavirus: The symptoms compared - BBC News", "description": "The Royal College of General Practitioners is warning people not to mix up the symptoms.", "url": "https://www.bbc.com/news/av/health-52319536/hay-fever-or-coronavirus-the-symptoms-compared", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/98FD/production/_111856193_p089z7lk.jpg", "publishedAt": "2020-04-20T20:46:19Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Gabby Landsverk", "title": "New study: more children could have COVID-19 than previously thought - Business Insider - Business Insider", "description": "For every child with a severe case of COVID-19, up to 2,318 could be infected, according to an estimate in a new study, more than previously thought.", "url": "https://www.businessinsider.com/new-study-finds-more-children-infected-coronavirus-covid19-2020-4", "urlToImage": "https://i.insider.com/5e9e054e0fc6391335208774?width=1200&format=jpeg", "publishedAt": "2020-04-20T20:38:36Z", "content": "There is still plenty of confusion when it comes to how the novel coronavirus impacts children.\r\nResearch suggests that children and infants may be less susceptible to the virus than adults, and one study found up to 90% of kids who contract the virus are asy… [+3430 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Robert Langreth", "title": "Americans Are Poisoning Themselves in Their Rush to Fight Virus - BloombergQuint", "description": "Coronavirus Cleaning Goes Haywire With Grim Surge in Poisonings", "url": "https://www.bloombergquint.com/business/coronavirus-cleaning-goes-haywire-with-grim-surge-in-poisonings", "urlToImage": "https://images.assettype.com/bloombergquint%2F2018-08%2F3a8e2237-2edb-4494-bcf2-231993fb6108%2FBLOOMBERG_LOGO.png?rect=0%2C56%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-04-20T20:35:05Z", "content": "(Bloomberg) -- Poisonings related to cleaners and disinfectants surged in the U.S. last month as the global pandemic spurred a haphazard rush to disinfect everything."}, {"source": {"id": null, "name": "Thequint.com"}, "author": "Sushovan Sircar", "title": "Mathematical Models Warn Several Lockdowns Needed to Beat COVID-19 - The Quint", "description": "Dr Rajesh Singh, mathematician at Cambridge University, along with Dr R Adhikari of IMS, Chennai told The Quint that the time horizon for an exit strategy (post COVID-19 lockdown) may take at least one year.", "url": "https://www.thequint.com/news/india/scientists-mathematical-modeling-warn-sustained-lockdowns-to-beat-covid-19", "urlToImage": "https://images.assettype.com/thequint/2020-04/a000e1eb-c4fa-469c-b1a9-c22064e3d836/corona_chain.jpg", "publishedAt": "2020-04-20T20:00:56Z", "content": "Scientists who had conducted recent mathematical modelings of the spread of COVID-19 in India say Prime Minister Narendra Modis announcement of an extension of the nationwide lockdown is a vindication of their predictions.\r\nAt the commencement of the lockdown… [+545 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Neetu Chandra Sharma", "title": "Spike in pollution may make people more vulnerable to coronavirus - Livemint", "description": "The ministries of health and environment are slated to meet next week to discuss ways to contain pollution levels.As per the WHO’s 2018 global air pollution cities database, 14 of the 15 most polluted cities are in India", "url": "https://www.livemint.com/news/india/spike-in-pollution-may-make-people-more-vulnerable-to-coronavirus-11587411508979.html", "urlToImage": "https://images.livemint.com/img/2020/04/20/600x338/59a0a866-82fb-11ea-adce-7b536c7ec0a3_1587411508584_1587411684078.jpg", "publishedAt": "2020-04-20T19:45:15Z", "content": "NEW DELHI :\r\nThe Union government is mulling steps to curb pollution, which is expected to spike after the nationwide lockdown is lifted early next month.Air quality in India, home to some of the worlds most polluted cities, improved sharply as the lockdown s… [+3237 chars]"}, {"source": {"id": null, "name": "Keralakaumudi.com"}, "author": "Kerala Kaumudi", "title": "80% COVID-19 cases asymptomatic or with mild symptoms: Health Ministry (Ld) - കേരള കൌമുദി", "description": "NEW DELHI: The Union Health Ministry said on Monday that 80 per cent of the COVID-19 cases are either asymptomatic or with mild symptoms, and assured that they all can be tracked.", "url": "https://keralakaumudi.com/en/news/news.php?id=287640&u=80%25-covid-19-cases-asymptomatic-or-with-mild-symptoms-health-ministry-(ld)", "urlToImage": "https://keralakaumudi.com/web-news/en/2020/04/NMAN0140325/image/covid.1.572953.jpg", "publishedAt": "2020-04-20T19:44:22Z", "content": "NEW DELHI: The Union Health Ministry said on Monday that 80 per cent of the COVID-19 cases are either asymptomatic or with mild symptoms, and assured that they all can be tracked.\r\nAddressing a media briefing, Joint Secretary at the Health Ministry, Lav Agarw… [+782 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Bioinformatics helps pinpoint evolutionary mutations of SARS-CoV-2 - The Science Board", "description": "A new bioinformatics approach to classifying genetic variants of SARS-CoV-2 helps to answer questions such as whether there are one or more circulating strains of the virus with different virulence levels and, if so, which of those strains should be used for …", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=669", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_life/2020_04_20_18_57_5727_RNA_genome_20200420184832.jpeg", "publishedAt": "2020-04-20T19:30:09Z", "content": "Newly emerged viruses have the potential to evolve rapidly in hosts, and they present quasispecies diversity -- a population of viruses with a large number of variant genomes. This viral diversity is due to low fidelity, high polymorphism, and viral polymeras… [+4257 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Wuhan Coronavirus: More than 24 lakh infected | Gravitas - WION", "description": "More than 24 lakh people have been infected by the Wuhan coronavirus worldwide. In India, there are more than 14,000 active cases now. #Gravitas #Coronavirus...", "url": "https://www.youtube.com/watch?v=uexGUk4CGdQ", "urlToImage": "https://i.ytimg.com/vi/uexGUk4CGdQ/maxresdefault.jpg", "publishedAt": "2020-04-20T19:12:28Z", "content": null}, {"source": {"id": null, "name": "Downtoearth.org.in"}, "author": null, "title": "Coronavirus: the puzzle of why the risk of death is greater for men and for the elderly - Down To Earth Magazine", "description": "For COVID-19, age and sex appear to be strong predictors of who lives and who dies\r\n&nbsp;", "url": "https://www.downtoearth.org.in/news/health/coronavirus-the-puzzle-of-why-the-risk-of-death-is-greater-for-men-and-for-the-elderly-70571", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2020-04-20/0.80453100_1587406999_67.jpg", "publishedAt": "2020-04-20T18:30:12Z", "content": "For COVID-19, age and sex appear to be strong predictors of who lives and who dies\r\n For COVID-19, age and sex appear to be strong predictors of who lives and who dies.\r\nThe fatality rate for the disease is estimated to be 0.66 per cent, according to data fro… [+6938 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Spread of coronavirus by children further doubted after French case - The Times of Israel", "description": "Nine-year-old was in contact with 172 people after having unknowingly contracted the disease, but none of them was infected, including two siblings", "url": "https://www.timesofisrael.com/spread-of-coronavirus-by-children-further-doubted-after-french-case/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/04/AP_20111502404521-1024x640.jpg", "publishedAt": "2020-04-20T17:29:19Z", "content": "LYON, France — A 9-year-old who contracted COVID-19 in eastern France did not pass the virus on to any other pupils at three ski-schools, according to new research that suggests infants are not large spreaders of the disease.\r\nThe child was infected in France… [+1571 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "Maternal hypertensive disorders bad for kids' mental health - India New England", "description": "London– Hypertensive pregnancy disorders, especially preeclampsia, a form of high blood pressure during pregnancy, may lead to adverse mental health conditions in children, say researchers. A…", "url": "https://indianewengland.com/2020/04/maternal-hypertensive-disorders-bad-for-kids-mental-health/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2017/11/qtq80-dxxQDB-e1514845548139.jpeg", "publishedAt": "2020-04-20T17:07:02Z", "content": "London– Hypertensive pregnancy disorders, especially preeclampsia, a form of high blood pressure during pregnancy, may lead to adverse mental health conditions in children, say researchers.\r\nA Finnish study, published in the journal Hypertension, of 4,743 mot… [+2198 chars]"}, {"source": {"id": null, "name": "Abcstlouis.com"}, "author": "The Associated Press", "title": "WHO head warns worst of virus is still ahead - WSET", "description": "GENEVA (AP) &mdash; The head of the World Health Organization has warned that &ldquo;the worst is yet ahead of us&rdquo; in the coronavirus outbreak, raising new alarm bells about the pandemic just as many countries are beginning to ease restrictive measures.…", "url": "http://abcstlouis.com/news/nation-world/who-head-warns-worst-of-virus-is-still-ahead", "urlToImage": "http://static-11.sinclairstoryline.com/resources/media/2613380f-fead-46da-a9af-96b6977cec01-large16x9_MGN_1280x720_00417P00ZIVLF.jpg?1587401193328", "publishedAt": "2020-04-20T16:47:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "New York nurses sue state and two hospitals over 'inadequate' virus protection - Reuters", "description": "The New York State Nurses Association sued the state and two hospitals on Monday to force them to provide equipment and adopt safety measures to prevent the spread of COVID-19 among the association's members in the hard-hit state.", "url": "https://in.reuters.com/article/health-coronavirus-usa-nurses-idINL1N2C80SX", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-04-20T16:40:00Z", "content": "April 20 (Reuters) - The New York State Nurses Association sued the state and two hospitals on Monday to force them to provide equipment and adopt safety measures to prevent the spread of COVID-19 among the association’s members in the hard-hit state. \r\nThe a… [+1795 chars]"}, {"source": {"id": null, "name": "Thepostmillennial.com"}, "author": "jocstech", "title": "BREAKING: Ontario has reached 'peak' in coronavirus cases - The Post Millennial", "description": "Ontario says they are expecting 20,000 cases in this wave of the pandemic, aligning it with the \"best case\" that was previously set.", "url": "https://thepostmillennial.com/", "urlToImage": "https://ghost.thepm.media/content/images/2020/04/man2.png", "publishedAt": "2020-04-20T16:24:00Z", "content": "The Ontario government has released their new projections and figures regarding the coronavirus, specifically regarding hospital and ICU capacity.\r\nAccording to the government's figures, COVID-19 \"appears to have peaked,\" despite initial reports saying that t… [+833 chars]"}, {"source": {"id": null, "name": "Upi.com"}, "author": null, "title": "Study links COVID-19 to heart attacks with no blockage - UPI News", "description": "There's something about the stress of severe COVID-19 that may be harming the heart in atypical ways, said one cardiologist who wasn't involved in the report.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/upi/4831587397074/2020/1/d93abbf5922004a9f19f09cc0937e8f5/v1.5/Study-links-COVID-19-to-heart-attacks-with-no-blockage.jpg", "publishedAt": "2020-04-20T16:11:52Z", "content": "Eighteen patients with severe COVID-19 treated at a New York City hospital showed the classic signs of a heart attack on their electrocardiograms.\r\nBut a closer look at each case revealed that more than half of these patients didn't have a blockage in a major… [+3655 chars]"}, {"source": {"id": null, "name": "Sci-news.com"}, "author": null, "title": "Scientists Propose New Approach to Analyze Genetic Sequences of SARS-CoV-2 Coronavirus | Astronomy - Sci-News.com", "description": "Researchers at the Commonwealth Scientific and Industrial Research Organisation (CSIRO) have developed a new visualization platform, underpinned by bioinformatics algorithms originally used to analyze the human genome, to pinpoint differences among the thousa…", "url": "http://www.sci-news.com/astronomy/genetic-sequences-sars-cov-2-08343.html", "urlToImage": "http://cdn.sci-news.com/images/2020/04/image_8309-Coronavirus.jpg", "publishedAt": "2020-04-20T16:02:11Z", "content": "Researchers at the Commonwealth Scientific and Industrial Research Organisation (CSIRO) have developed a new visualization platform, underpinned by bioinformatics algorithms originally used to analyze the human genome, to pinpoint differences among the thousa… [+2937 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "How AIDS vaccine research could help fight COVID-19 - CGTN", "description": "Scientists in California explain how research into vaccines for snake bites and HIV could be the answer to the coronavirus pandemic.", "url": "https://newseu.cgtn.com/news/2020-04-20/How-AIDS-vaccine-research-could-help-fight-COVID-19-PQM6DhPSuc/index.html", "urlToImage": "https://newseu.cgtn.com/news/324d7a4e7a63544f78636a4e796b444f7a63444f31457a6333566d54/img/8052d2db16e042aa90c2eb4016af3739/8052d2db16e042aa90c2eb4016af3739-1.jpg", "publishedAt": "2020-04-20T15:50:52Z", "content": "The race is on to develop a COVID-19 vaccine from the blood of survivors. Scientists from around the world are working together to find an effective antibody against the virus that could also treat the diverse coronavirus family. \r\nAntibodies are a protein pr… [+1087 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK coronavirus deaths rise by 449 to 16,509 - Reuters", "description": "A total of 16,509 people who tested positive for coronavirus have died in hospitals in Britain, an increase of 449 in 24 hours, the health ministry said on Monday.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-toll-idUSKBN22226M", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200420&t=2&i=1515746330&w=1200&r=LYNXMPEG3J1H7", "publishedAt": "2020-04-20T15:31:00Z", "content": "LONDON (Reuters) - A total of 16,509 people who tested positive for coronavirus have died in hospitals in Britain, an increase of 449 in 24 hours, the health ministry said on Monday. \r\nThe number of confirmed cases of the new coronavirus has risen to 124,743.… [+199 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Boston Globe prints 16 pages of obituaries - Moneycontrol", "description": "Several Twitter users took to the social media platform to discuss how they have never seen obituary listings take up so many pages of a newspaper.", "url": "https://www.moneycontrol.com/news/world/coronavirus-pandemic-boston-globe-prints-16-pages-of-obituaries-5168921.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/04/3-coronavirus-robots-770x433.jpg", "publishedAt": "2020-04-20T15:29:23Z", "content": "Readers got a deeper insight into the global health crisis that the world is battling at present, especially America -- which is engaged in a tedious fight to contain the number of novel coronavirus cases when a leading daily published a list of obituaries th… [+2141 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "monitkhanna", "title": "Indian-Origin Doctors In US Have Sacrificed Their Lives Fighting COVID-19 Pandemic - India Times", "description": "Several Indian origin doctors in the US have sacrificed their lives to the novel coronavirus. This has been brought to light by the Indian-American community leaders who state that a considerable number of Indian-origin doctors have gotten infected during thi…", "url": "https://www.indiatimes.com/technology/science-and-future/indian-origin-doctors-in-us-have-sacrificed-their-lives-fighting-covid-19-pandemic-511333.html", "urlToImage": "https://im.indiatimes.in/content/2020/Apr/FB-Image-Quote_5e9dc0acd270e.jpg", "publishedAt": "2020-04-20T15:25:01Z", "content": "While the whole world is dealing with the wrath of COVID-19, the whole ordeal has been more terrible for doctors and medical practitioners in the front line who are risking their lives while trying to treat people with the novel coronavirus.\r\nReuters\r\nAnd a r… [+2071 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Srishti Choudhary", "title": "CSIR to test its new sepsis drug for severe patients of Covid-19 - Livemint", "description": "According to scientists, there are some clinical similarities between patients suffering from gram-negative Sepsis and Covid-19.The drug has recently been approved for marketing in India and would be available commercially as Sepsivac® from Ahmedabad-based Ca…", "url": "https://www.livemint.com/science/health/csir-to-test-its-new-sepsis-drug-for-severe-patients-of-covid-19-11587394617832.html", "urlToImage": "https://images.livemint.com/img/2020/04/20/600x338/CSIR_1585851213110_1587394826417.jpg", "publishedAt": "2020-04-20T15:04:48Z", "content": "NEW DELHI :\r\nRaising hopes for a potential treatment of Covid-19, Indias premier research organization Council of Scientific and Industrial Research (CSIR) has decided to test its new drug against Sepsis to treat critical patients of Covid-19.The drug has rec… [+2688 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "ITU-WHO Joint Statement: Unleashing information technology to defeat COVID-19 - World Health Organization", "description": "<p> </p><p>The World Health Organization, the International Telecommunication Union (ITU) with support from UNICEF are set to work with telecommunication companies to text people directly on their mobile phones with vital health messaging to help protect them…", "url": "https://www.who.int/news-room/detail/20-04-2020-itu-who-joint-statement-unleashing-information-technology-to-defeat-covid-19", "urlToImage": "https://www.who.int/images/default-source/health-topics/coronavirus/who-049360.tmb-1200v.png?Culture=en&sfvrsn=a35df1f7_4", "publishedAt": "2020-04-20T15:03:56Z", "content": "The World Health Organization, the International Telecommunication Union (ITU) with support from UNICEF are set to work with telecommunication companies to text people directly on their mobile phones with vital health messaging to help protect them from COVID… [+3193 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Researchers develop tool to predict risk of death for people suffering from dementia - EdexLive", "description": "The tool asks simple questions about the person during diagnosis and translates it to the chance of dying and of entering a nursing home", "url": "https://www.edexlive.com/news/2020/apr/20/researchers-develop-tool-to-predict-risk-of-death-for-people-suffering-from-dementia-11445.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/4/20/w600X390/download_2.jpg", "publishedAt": "2020-04-20T14:55:42Z", "content": "Researchers have developed a tool to predict the risk of death and admission to a long-term care facility for patients with dementia. The tool may help conversations between health care providers, patients, and their families, according to the study which has… [+2891 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Sumi Sukanaya Dutta", "title": "Marginally higher than flu: COVID-19 mortality rate in India just 0.41%, estimates study - The New Indian Express", "description": "The study has assessed that only 6 per cent of the actual COVID-19 cases are detected globally and this figure varies significantly across countries.", "url": "https://www.newindianexpress.com/lifestyle/health/2020/apr/20/marginally-higher-than-flu-covid-19-mortality-rate-in-india-just-041-estimates-study-2132893.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/20/w600X390/Corona_Bhubaneshwar_EPS03.jpg", "publishedAt": "2020-04-20T14:39:00Z", "content": "NEW DELHI: India may have over 1.32 lakh coronavirus patients as on Monday -- nearly seven times the official figure of less than 18,000 cases. This is as per a calculation based on age-specific infection fatality rates and deaths reported in the country so f… [+2782 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "Pay Attention to In-Hospital Glucose to Save Lives in COVID-19 - Medscape", "description": "Mortality was raised fourfold for those with diabetes and sevenfold among those with hyperglycemia but no diabetes history. Clinicians could save more lives by tuning in to this key aspect of care.", "url": "https://www.medscape.com/viewarticle/928962", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_200420_glucose_level_meter_800x450.jpg", "publishedAt": "2020-04-20T14:16:08Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nDiabetes and hyperglycemia among people without prior diabetes are strong predictors of mortality among hospitalized patients with COVID-19, new research sug… [+5257 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Vaccine developed by 5 groups emerge as frontrunner to combat Covid-19, says ICMR - Livemint", "description": "ICMR said the vaccines developed by five groups of scientists are in the process of coming into human trial phase after passing trials on animals", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-developed-by-5-groups-emerge-as-frontrunner-to-combat-covid-19-says-icmr-11587389337224.html", "urlToImage": "https://images.livemint.com/img/2020/04/20/600x338/virus1_1581012107602_1587389721458.jpg", "publishedAt": "2020-04-20T13:40:05Z", "content": "NEW DELHI :\r\nThe Indian Council of Medical Research on Sunday said that vaccines developed or observed for the novel coronavirus by five groups of scientists are in the process of coming into human trial phase after passing trials on animals.Speaking at a dai… [+907 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Mark Zuckerberg", "title": "Mark Zuckerberg: How data can aid the fight against covid-19 - The Washington Post", "description": "The world has faced pandemics before, but this time we have a new superpower: the ability to gather and share data for good.", "url": "https://www.washingtonpost.com/opinions/2020/04/20/how-data-can-aid-fight-against-covid-19/", "urlToImage": "https://www.washingtonpost.com/resizer/l0J_PVkIjQG5dm5F4uTwUCX_udE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GGP3YEUAOEI6VBGCA6JNQWIZCE.jpg", "publishedAt": "2020-04-20T13:26:41Z", "content": "Getting accurate county-by-county data from across the United States is challenging, and obtaining such focused data from across the whole world is even harder. But with a community of billions of people globally, Facebook can uniquely help researchers and he… [+4848 chars]"}, {"source": {"id": null, "name": "Freepressjournal.in"}, "author": "Asia News International", "title": "Researchers develop novel system that can better treatment of neurological diseases - Free Press Journal", "description": "A team of researchers have recently developed a novel system for switching on the activity of genes that could improve treatments for a broad range of neurological diseases.", "url": "https://www.freepressjournal.in/technology/researchers-develop-novel-system-that-can-better-treatment-of-neurological-diseases", "urlToImage": "https://images.assettype.com/freepressjournal%2F2020-04%2Fdad70475-e7be-44f9-a3dc-42d339cdba5c%2Fdependent.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-04-20T13:12:39Z", "content": "Washington D.C. [USA]: A team of researchers have recently developed a novel system for switching on the activity of genes that could improve treatments for a broad range of neurological diseases.\r\nEsteban Engel, a researcher in viral neuroengineering in the … [+1964 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "COVID-19 may be striking more children than expected - Medical Dialogues", "description": "Studies in the past have revealed that children  are less affected by Covid 19 compared to their...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/covid-19-may-be-striking-more-children-than-expected-65007", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/21/1200x630_125764-corona.jpg?width=1200&height=630", "publishedAt": "2020-04-20T12:30:49Z", "content": "Studies in the past have revealed that children are less affected by Covid 19 compared to their adult conterparts and have less severe disease.\r\nThe number of children infected with the coronavirus is far more extensive than what is currently reported -- a hi… [+3013 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "PTI", "title": "Global coronavirus toll tops 165,000 - Devdiscourse", "description": "The worldwide death toll from the novel coronavirus pandemic rose to 165,216 on Monday, according to a tally from official sources compiled by AFP. More than 2", "url": "https://www.devdiscourse.com/article/international/1015803-global-coronavirus-toll-tops-165000", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_04_2020_17_23_56_1955421.jpg?width=920&format=jpeg", "publishedAt": "2020-04-20T12:12:20Z", "content": "The worldwide death toll from the novel coronavirus pandemic rose to 165,216 on Monday, according to a tally from official sources compiled by AFP. More than 2,403,410 declared cases have been registered in 193 countries and territories since the epidemic fir… [+1370 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Quarantine health tips: When working remotely, stay hydrated, check caffeine intake & avoid junk - Economic Times", "description": "It is extremely essential to complete 8-12 glasses intake of water daily.", "url": "https://economictimes.indiatimes.com/magazines/panache/quarantine-health-tips-when-working-remotely-stay-hydrated-check-caffeine-intake-avoid-junk/articleshow/75249134.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75249304,width-1070,height-580,imgsize-624679,overlay-etpanache/photo.jpg", "publishedAt": "2020-04-20T12:06:12Z", "content": "BENGALURU: One of the biggest challenges one faces when working from home during the lockdown period is to keep nutrition in check, says a nutritionist.\r\nNutritionist Pooja Makhija says being hydrated, keeping a check on caffeine consumption, planning meal ti… [+3813 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Kerala hospital begins HCQ clinical trial even after ICMR says no basis for such studies - ThePrint", "description": "The trial assumes the ICMR-recommended HCQ regimen is an ‘effective treatment’. However, ICMR chief epidemiologist says there isn’t enough evidence behind this.", "url": "https://theprint.in/health/kerala-hospital-begins-hcq-clinical-trial-even-after-icmr-says-no-basis-for-such-studies/405305/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Untitled-design-48.jpg", "publishedAt": "2020-04-20T11:59:13Z", "content": "New Delhi: The Indian Council of Medical Research (ICMR) believes there is no basis for a clinical trial to test the efficacy of hydroxychloroquine (HCQ) as a preventive drug to tackle Covid-19. But a hospital in Kerala has begun work on a trial registered wi… [+4831 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19: Top 3 immunity boosting concoctions to enjoy at home - The Financial Express", "description": "Here are a few concoction options to dive in and give a twist to your regular routine to enjoy good immunity:", "url": "https://www.financialexpress.com/lifestyle/covid-19-top-3-immunity-boosting-concoctions-to-enjoy-at-home/1934196/", "urlToImage": "https://images.financialexpress.com/2020/04/immunity-drinks.jpg", "publishedAt": "2020-04-20T11:24:40Z", "content": "By Nmami Agarwal\r\nCOVID-19: With the sudden wave of fear of coronavirus, all of us have become cautious about our hygiene and our sneezing and coughing behaviour, we should also pay little attention to enhancing our immunity and whats a better way to start fr… [+2778 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Prabhjote Gill", "title": "MIT scientists find a way to protect lungs of Coronavirus patients from ‘cytokine storms’ - Business Insider India", "description": "A team of researchers from the Massachusetts Institute of Technology (MIT) have developed special proteins to help save the lungs of Coronavirus patients.", "url": "https://www.businessinsider.in/science/health/news/mit-scientists-find-a-way-to-protect-lungs-of-coronavirus-patients-from-cytokine-storms/articleshow/75250836.cms", "urlToImage": "https://www.businessinsider.in/photo/75250836/mit-scientists-find-a-way-to-protect-lungs-of-coronavirus-patients-from-cytokine-storms.jpg?imgsize=224556", "publishedAt": "2020-04-20T11:21:00Z", "content": "Just because humans don’t have natural immunity against Coronavirus doesn’t mean that the body doesn’t try to fight back. One of the ways it can do this is by launching a ‘cytokine storm’ — a burst of immune overreaction. \r\nAs the body fights against the viru… [+3347 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Remdesivir shows promise against COVID-19, but more trials needed: Scientists - Economic Times", "description": "Originally developed to treat Ebola more than a decade ago, Remdesivir is a broad-spectrum antiviral drug, according to a study, published in the journal Nature earlier this year.", "url": "https://economictimes.indiatimes.com/news/science/remdesivir-shows-promise-against-covid-19-but-more-trials-needed-scientists/articleshow/75250674.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75250710,width-1070,height-580,imgsize-557189,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-20T11:15:22Z", "content": "HOUSTON: Researchers claim that COVID-19 patients in a clinical trial are responding quickly to Remdesivir, a finding which they said is \"promising,\" while also emphasising the need for more trials to test the effectiveness of the antiviral drug.\r\nAccording t… [+1380 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Abantika Ghosh", "title": "Explained: How pooled testing works, when it helps - The Indian Express", "description": "Coronavirus (COVID-19): Last week, the ICMR brought out an advisory on pooled testing, ideally in districts where incidence of COVID-19 is low.", "url": "https://indianexpress.com/article/explained/coronavirus-infection-how-pooled-testing-works-when-it-helps-6370001/", "urlToImage": "https://images.indianexpress.com/2020/04/pool-testing.jpg?w=759", "publishedAt": "2020-04-20T10:38:33Z", "content": "Written by Abantika Ghosh\r\n | New Delhi | \r\nUpdated: April 20, 2020 4:04:23 pm\r\nThe ICMR has also set an upper limit of five samples that can be pooled; this is to avoid false negatives because of excessive dilution. More samples can, however, be pooled if it… [+5350 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "French Nobel laureate claims coronavirus was made in Wuhan lab - Republic World - Republic World", "description": "A Nobel prize-winning scientist has claimed that the novel coronavirus originated from a Wuhan laboratory in an attempt to manufacture a vaccine against HIV.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/french-nobel-laureate-claims-coronavirus-originated-from-wuhan-lab.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/ywpjdmf4vz9ccbuo_1587376785.jpeg?tr=f-jpeg", "publishedAt": "2020-04-20T10:23:00Z", "content": "French Nobel prize-winning scientist Luc Montagnier has claimed that the novel coronavirus originated from a Wuhan laboratory while attempting to manufacture a vaccine against HIV (Human Immunodeficiency Virus). During an interview with a French news channel,… [+2291 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "Can binge drinkers be tamed via switching off a brain receptor? - India New England", "description": "New York– Binge drinkers, here comes good news. A team of US researchers has found that deactivating a stress-signaling system in a brain area known for motivation and emotion-related behavio…", "url": "https://indianewengland.com/2020/04/can-binge-drinkers-be-tamed-via-switching-off-a-brain-receptor/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2018/12/Alcohl-iStock.jpg", "publishedAt": "2020-04-20T10:07:30Z", "content": "New York– Binge drinkers, here comes good news. A team of US researchers has found that deactivating a stress-signaling system in a brain area known for motivation and emotion-related behaviours can decrease binge drinking.\r\nThe US National Institutes of Heal… [+3457 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "How to Wash Off Germs from Vegetables and Perishables During Coronavirus - News18", "description": "In attempts of cleaning the grocery, do not clean it with soap water or disinfectant which are used on hard surfaces like doorknobs, grills or calling bells.", "url": "https://www.news18.com/news/buzz/how-to-wash-off-germs-from-vegetables-and-perishables-during-coronavirus-2585067.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587376223_untitled-design-5.png", "publishedAt": "2020-04-20T09:54:33Z", "content": "While everyone is staying indoors to contain the spread of coronavirus, stepping out to buy essential commodities, seek medical help and venturing outside for other necessary activities is unavoidable. But we can minimize risk by wearing masks and washing han… [+1895 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Family history-based early screening effective in colorectal cancer detection - Daijiworld.com", "description": "", "url": "http://www.daijiworld.com/news/newsDisplay.aspx?newsID=698835", "urlToImage": "http://www.tvdaijiworld.com/images6/arun_200420_camcr.jpg", "publishedAt": "2020-04-20T09:45:45Z", "content": "New York, Apr 20 (IANS): Researchers, including one of Indian-origin, have found that early screening based on family history may have dramatic effects on colorectal cancer detection.\r\nIn an analysis that included information on adults diagnosed with colorect… [+2022 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Vaccine to treat coronavirus soon? Oxford researchers promise remedy - India Today", "description": "Scientists at the University of Oxford are promising a super fast vaccine, ChAdOx1, against the novel coronavirus and say it will be available by September. They say they're working with different groups and philanthropists to make sure it's available in plac…", "url": "https://www.indiatoday.in/world/video/vaccine-treat-coronavirus-soon-oxford-researchers-promise-remedy-1668933-2020-04-20", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202004/hydroxu.Ap_2-647x363.jpeg?Mdd7VD7LTmnWVR91y_MyP8AVjh5nfdko", "publishedAt": "2020-04-20T06:45:45Z", "content": "Scientists at the University of Oxford are promising a super fast vaccine, ChAdOx1, against the novel coronavirus and say it will be available by September. They say they're working with different groups and philanthropists to make sure it's available in plac… [+43 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK to trial use of COVID-19 survivors' blood plasma for treatment - Reuters India", "description": "The United Kingdom is preparing to collect the blood from COVID-19 survivors to investigate if convalescent plasma transfusions could improve an infected patient's speed of recovery and chances of survival.", "url": "https://in.reuters.com/article/us-health-coronavirus-britain-blood-idINKBN2220JG", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-04-20T06:44:00Z", "content": "LONDON (Reuters) - The United Kingdom is preparing to collect the blood from COVID-19 survivors to investigate if convalescent plasma transfusions could improve an infected patient’s speed of recovery and chances of survival. \r\n“NHS Blood and Transplant is pr… [+788 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "COVID-19 vaccine two-third ready, claims Israeli scientist - THE WEEK", "description": "The scientist said that the vaccine could still take over a year to develop", "url": "https://www.theweek.in/news/health/2020/04/20/COVID-19-vaccine-two-third-ready-claims-Israeli-scientist.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2020/april/covid-vaccine-microscope.-Coronavirus-2019-nCoV-COVID-shut.jpg", "publishedAt": "2020-04-20T06:19:14Z", "content": "An Israeli scientist claims that he is two-thirds into developing a vaccine for COVID-19. Professor Jonathan Gershoni from Tel Aviv University's (TAU) School of Molecular Cell Biology and Biotechnology said that the work his laboratory was doing on corona fam… [+1400 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "'Novel method to understand how coronavirus evolves developed' - Economic Times", "description": "In the study, published in the journal Transboundary and Emerging Diseases, the scientists developed a novel platform, originally used to analyse the human genome, to pinpoint differences among the thousands of genetic sequences of the novel coronavirus, SARS…", "url": "https://economictimes.indiatimes.com/news/science/novel-method-to-understand-how-coronavirus-evolves-developed/articleshow/75244615.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75244671,width-1070,height-580,imgsize-454041,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-20T05:54:29Z", "content": "LONDON: Researchers have developed a new method to analyse the genetic code of the novel coronavirus, an advance that can shed light on how the virus evolves, and help identify new clusters of the disease.\r\nAccording to the scientists, including those from th… [+1344 chars]"}, {"source": {"id": null, "name": "Analyticsindiamag.com"}, "author": "Sejuti Das", "title": "IIT Kharagpur Allocates Funding For Research Projects On COVID-19 Healthcare Technology Development - Analytics India Magazine", "description": "IIT Kharagpur submitted a list of projects to the IIT Council, of which eight projects have been selected to be funded on COVID-19.", "url": "https://analyticsindiamag.com/iit-kharagpur-allocates-funding-for-research-projects-on-covid-19-healthcare-technology-development/", "urlToImage": "https://analyticsindiamag.com/wp-content/uploads/2020/04/IIT-Kharagpur-Allocates-Funding-For-Research-Projects-On-COVID-19-Healthcare-Technology-Development.jpg", "publishedAt": "2020-04-20T05:50:45Z", "content": "IIT Kharagpur has decided to allocate research funding for R&amp;D work related to COVID-19. \r\nIIT Kharagpur submitted a list of projects to the IIT Council last week of which eight projects have been selected to be funded on COVID-19 healthcare technology de… [+2576 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Teena Thacker", "title": "Experts criticise India’s endorsement for use of hydroxychloroquine on Covid-19 patients - Economic Times", "description": "In the absence of credible evidence, a blanket recommendation for chemoprophylaxis might be contentious, the experts said in an article published online by the Lancet on April 17. Prophylaxis refers to treatment given to prevent a disease.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/experts-criticise-indias-endorsement-for-use-of-hydroxychloroquine-on-covid-19-patients/articleshow/75243316.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75243516,width-1070,height-580,imgsize-555329,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-20T04:48:25Z", "content": "New Delhi: Some experts have criticised the endorsement by India’s top health research body for use of hydroxychloroquine (HCQ) on Covid-19 patients and healthcare workers without proper evidence that proves the drug’s ability to reduce the viral load.\r\nIn th… [+2972 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Medical Dialogues Bureau", "title": "Doctor stranded in India lockdown flies back to work at UK hospital - Medical Dialogues", "description": "London - An Indian-origin doctor who had been stranded in Delhi amid Indias ongoing coronavirus...", "url": "https://medicaldialogues.in/news/health/doctors/doctor-stranded-in-india-lockdown-flies-back-to-work-at-uk-hospital-64999", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/09/1200x630_126914-doctors.jpg?width=1200&height=630", "publishedAt": "2020-04-20T04:30:45Z", "content": "London - An Indian-origin doctor who had been stranded in Delhi amid India's ongoing coronavirus lockdown on Friday expressed his relief at being back at work at his hospital in Suffolk, eastern England. \r\n Dr Sushil Misra, a consultant in acute medicine for … [+3440 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "Rowan Quinn", "title": "Covid 19 coronavirus: Up to 30000 surgeries called off during lockdown - New Zealand Herald", "description": "Only the most urgent procedures carried out as elective surgeries put on hold.", "url": "https://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=12325949", "urlToImage": "https://www.nzherald.co.nz/resizer/x6f7-GPzFnnMm1d7cx0AKVbYiU0=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/TFZUMDS675BSPIPXVQLT66UB5E.jpg", "publishedAt": "2020-04-19T19:37:35Z", "content": "From RNZ\r\n Hospitals deferred thousands of operations as they prepared for a possible wave of Covid-19 cases - and to minimise contact under alert level 4.\r\n The most urgent surgeries were still being done under the lockdown but elective surgery had largely b… [+2336 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "The hunt for a vaccine - Daily Pioneer", "description": "Our scientists are working on a multi-purpose antidote. This highlights the need to fund R&amp;D in a post-COVID world\n\nAs ever-increasing numbers of people test positive for Coronavirus daily, Indian scientists, medical professionals and researchers are toil…", "url": "https://www.dailypioneer.com/2020/columnists/the-hunt-for-a-vaccine.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/the-hunt-for-a-vaccine-2020-04-20.jpg", "publishedAt": "2020-04-19T18:31:42Z", "content": "Our scientists are working on a multi-purpose antidote. This highlights the need to fund R&amp;D in a post-COVID world\r\nAs ever-increasing numbers of people test positive for Coronavirus daily, Indian scientists, medical professionals and researchers are toil… [+2888 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Mehul Thakkar", "title": "BMC to put high-risk contacts on anti-malarial drug - Hindustan Times", "description": "", "url": "https://www.hindustantimes.com/mumbai-news/bmc-to-put-high-risk-contacts-on-anti-malarial-drug/story-Ao6SlpXcIk7rfqqmUImUMJ.html", "urlToImage": "https://www.hindustantimes.com/images/app-images/2019/7/960x540.jpg", "publishedAt": "2020-04-19T17:58:33Z", "content": "The Brihanmumbai Municipal Corporation (BMC) on Sunday announced its decision to treat high-risk contacts of Covid-19 patients, with doses of hydroxychloroquine (HCQ), an anti-malarial drug.\r\nHydroxychloroquine is an anti-malarial drug being used to prevent t… [+1490 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK reports 596 COVID-19 deaths as total tops 16,000 - Reuters India", "description": "Britain reported 596 deaths from COVID-19 in hospitals in its daily update on Sunday, raising the country's total to more than 16,000 as a senior minister said the government's testing target remained 100,000 per day.", "url": "https://in.reuters.com/article/health-coronavirus-britain-fatalities-idINKBN2210OL", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200419&t=2&i=1515651174&w=1200&r=LYNXMPEG3I0E1", "publishedAt": "2020-04-19T17:28:48Z", "content": "LONDON (Reuters) - Britain reported 596 deaths from COVID-19 in hospitals in its daily update on Sunday, raising the country’s total to more than 16,000 as a senior minister said the government’s testing target remained 100,000 per day. \r\nBritain has suffered… [+873 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "\"This is not uncommon\": How the coronavirus leapt from bats to humans - Democracy Now!", "description": "As President Trump endorses a fringe conspiracy theory suggesting that the novel coronavirus originated in a Chinese lab, zoologist and disease ecologist Pet...", "url": "https://www.youtube.com/watch?v=dA3oV3vTwmo", "urlToImage": "https://i.ytimg.com/vi/dA3oV3vTwmo/maxresdefault.jpg", "publishedAt": "2020-04-19T15:30:03Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Julian Kossoff", "title": "Medical detection dogs able to sniff 750 people an hour could help identify coronavirus cases, researchers say - Business Insider India", "description": "Scientists in the UK believe that medical detection dogs could be able to help identify coronavirus cases in humans. Medical detection dogs are already being", "url": "https://www.businessinsider.in/science/news/medical-detection-dogs-able-to-sniff-750-people-an-hour-could-help-identify-coronavirus-cases-researchers-say/articleshow/75237387.cms", "urlToImage": "https://www.businessinsider.in/photo/75237387/medical-detection-dogs-able-to-sniff-750-people-an-hour-could-help-identify-coronavirus-cases-researchers-say.jpg?imgsize=196062", "publishedAt": "2020-04-19T15:01:00Z", "content": "Specially trained medical detection dogs could be the solution to the crisis in the lack of testing that many countries are facing during the coronavirus pandemic.\r\nThe dogs are capable of sniff testing 750 people an hour, according to the head of a non-profi… [+1936 chars]"}]}