{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Dtnext.in"}, "author": "Venkatalakshmi", "title": "Experts set out research roadmap to prioritise key areas for future-proofing mental health - DTNext", "description": "The treatment of mental illness currently brings substantial costs to not only the NHS, but also to the individual and wider society, and the need for innovation to promote good mental health has never been greater.", "url": "http://www.dtnext.in/Lifestyle/Wellbeing/2021/05/10114610/1293228/Experts-set-out-research-roadmap-to-prioritise-key-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2021/May/202105101146103270_Experts-set-out-research-roadmap-to-prioritise-key-areas-for_SECVPF.gif", "publishedAt": "2021-05-10T06:25:37Z", "content": "The treatment of mental illness currently brings substantial costs to not only the NHS, but also to the individual and wider society, and the need for innovation to promote good mental health has nev… [+5305 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Combo COVID-flu vaccine protects against current and emerging variants in animal model - News-Medical.Net", "description": "Now, in new research posted to the bioRxiv preprint server, scientists at Novavax, Inc. present a vaccine including recombinant influenza hemagglutinin (HA) antigen along with recombinant SARS-CoV-2 spike protein, with saponin Matrix-M adjuvant. Both have pas…", "url": "https://www.news-medical.net/news/20210510/Combo-COVID-flu-vaccine-protects-against-current-and-emerging-variants-in-animal-model.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/5/2021.05.05.442782v1.full.jpg", "publishedAt": "2021-05-10T05:37:00Z", "content": "The unprecedented development of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) vaccines over the past 12 months appears to be mitigating the COVID-19 epidemic in geographies where impl… [+6377 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Organ Transplant Patients Remain Vulnerable to Covid-19 Infections Even After Second Jab: Study - News18", "description": "Patients, who had organ transplants, remain vulnerable to Covid-19 infections even after a second vaccine dose, finds a study that urges people who are immunocompromised to strictly adhere to wearing masks, and maintain physical distancing, even after vaccina…", "url": "https://www.news18.com/news/buzz/organ-transplant-patients-remain-vulnerable-to-covid-19-infections-even-after-second-jab-study-3722651.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1620618923_untitled-design-2021-05-10t092055.267.png", "publishedAt": "2021-05-10T03:58:38Z", "content": "Patients, who had organ transplants, remain vulnerable to Covid-19 infections even after a second vaccine dose, finds a study that urges people who are immunocompromised to strictly adhere to wearing… [+2063 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Immediate global ivermectin use can end Covid-19 pandemic: Scientists - Free Press Journal", "description": "A peer-reviewed research has claimed that global ivermectin use can end Covid-19 pandemic, as the medicine significantly reduces the risk of contracting the deadly respiratory disease when used regularly. The common antiparasitic ivermectin is being touted as…", "url": "https://www.freepressjournal.in/health/immediate-global-ivermectin-use-can-end-covid-19-pandemic-scientists", "urlToImage": "https://images.assettype.com/freepressjournal%2F2021-05%2F4602a24f-fc45-4b88-8304-14b5612d4ec7%2Fmed.jpeg?rect=0%2C0%2C760%2C399&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-05-10T01:30:00Z", "content": "\"Our latest research shows, once again, that when the totality of the evidence is examined, there is no doubt that ivermectin is highly effective as a safe prophylaxis and treatment for Covid-19,\" sa… [+779 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "'Ibuprofen safe, doesn't raise COVID death risk', says study - Ahmedabad Mirror", "description": "#LONDON\nNon-steroidal anti-inflammatory drugs (NSAIDs), such as ibuprofen, is safe and does not lead to higher rates of death or severe disease in patients hospitalised with Covid-19, according to a new observational study of more than 72,000 people in the UK…", "url": "https://ahmedabadmirror.com/ibuprofen-safe-doesnt-raise-covid-death-risk-says-study/81799544.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1620583623981.jpg-org", "publishedAt": "2021-05-10T00:38:48Z", "content": "<ul><li>Agencies</li><li> 10-05-2021 06:00 AM</li></ul>\r\n#LONDONNon-steroidal anti-inflammatory drugs (NSAIDs), such as ibuprofen, is safe and does not lead to higher rates of death or severe disease… [+737 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Lakshadweep, Haryana, Assam top in vax wastage - Bangalore Mirror", "description": "Amidst increasing COVID-19 vaccine demands in the country, wastage of the key injection has been a matter of concern for the government with reports of highest 22.74 per cent wastage reported in Laks", "url": "https://bangaloremirror.indiatimes.com/news/india/lakshadweep-haryana-assam-top-in-vax-wastage/articleshow/82505035.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-41107,msid-82501473/82501473.jpg", "publishedAt": "2021-05-10T00:30:00Z", "content": "NEWDELHI Lakshadweep, Haryana\r\n and Assam for the second consecutive day on Sunday maintained their position among top 10 states for the maximum loss of COVID vaccines amid the crisis when the countr… [+1983 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "R Sukumar", "title": "Covid-19: What you need to know today - Hindustan Times", "description": "Delhi was short of tests, medicines, oxygen, hospital beds, and ventilators. People wanted help with remdesivir and plasma. Both were being prescribed indiscriminately by doctors.", "url": "https://www.hindustantimes.com/india-news/covid19what-you-need-to-know-today-101620594650261.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/7.AFP_9743GX_1617186417528_1620595189160.jpg", "publishedAt": "2021-05-09T21:30:14Z", "content": "Ive mostly worked from office since March 2020, apart from a few weeks last April (and, of course, apart from Wednesdays when I work on the best weekend section across newspapers in India, HT Wknd, a… [+4816 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Bart Weimer", "title": "Here is an early warning system for the next surge of coronavirus variants - ThePrint", "description": "When it comes to public health, it’s time to integrate genome sequencing with infectious disease tracking. We won’t have to wait for a surge.", "url": "https://theprint.in/science/here-is-an-early-warning-system-for-the-next-surge-of-coronavirus-variants/654770/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/05/Coronavirus-_Covid-19.jpg", "publishedAt": "2021-05-09T20:02:16Z", "content": "Genomic surveillance programs have let scientists track the coronavirus over the course of the pandemic. By testing patient samples, researchers are able to diagnose COVID-19. But theyre also able to… [+7639 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Agencies", "title": "US CDC acknowledges Covid is airborne, says virus can spread beyond 6 feet through aerosolised particles - Millennium Post", "description": "Washington: The US Center for Disease Control and Prevention (CDC) reported that the principal mode...", "url": "http://www.millenniumpost.in/big-stories/us-cdc-acknowledges-covid-is-airborne-says-virus-can-spread-beyond-6-feet-through-aerosolised-particles-439727", "urlToImage": "http://www.millenniumpost.in/h-upload/2021/05/09/564311-38528skhdscdp78cyz6wyhg4d15ktmnupbsj9592231.jpg", "publishedAt": "2021-05-09T19:46:51Z", "content": "Washington: The US Center for Disease Control and Prevention (CDC) reported that the principal mode by which people are infected with COVID-19 is through very fine droplets and aerosolised particles … [+2243 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "ICMR issues advisory on `black fungus` among COVID-19 patients, lists do`s and don`ts - Zee News", "description": "The Centre on Sunday said that  Mucormycosis  a fungal infection detected in COVID-19 patients with uncontrolled diabetes and prolonged intensive care unit (ICU) stay, is likely turn fatal if uncared.", "url": "https://zeenews.india.com/india/icmr-issues-advisory-on-black-fungus-among-covid-19-patients-lists-dos-and-donts-2360868.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/05/10/935300-covid-recovery.jpg", "publishedAt": "2021-05-09T18:46:34Z", "content": "New Delhi: The Centre on Sunday said that 'Mucormycosis' a fungal infection detected in COVID-19 patients with uncontrolled diabetes and prolonged intensive care unit (ICU) stay, is likely turn fatal… [+2444 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "Rising Kashmir", "title": "Covid-management tips, simple ways to increase oxygen levels - Rising Kashmir", "description": "Dr Wani added that timely management of Covid-19 can help in recovery and containment of this virus.", "url": "http://risingkashmir.com/home/news_description/376088/Covid-management-tips-simple-ways-to-increase-oxygen-levels", "urlToImage": "http://risingkashmir.com/uploads/news_image/news_376088_1.jpg", "publishedAt": "2021-05-09T17:44:49Z", "content": "Dr Fayaz Ahmad WaniProfessor Department of Medicine, GMC, Jammu\r\nCovid Helpline numbers0191 2571616 -2520982, 2549676, 2674444, 2674115, 2674908.\r\nJAMMU, MAY 9: Fever, sore throat, loss of appetite a… [+1679 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals smartphone breathalyzer alcohol testing devices vary widely in accuracy - ANI News", "description": "Pennsylvania [US], May 9 (ANI): The latest generation of personal alcohol breath testing devices pair with smartphones. While some of these devices were found to be relatively accurate, others may mislead users into thinking that they are fit to drive, accord…", "url": "https://www.aninews.in/news/lifestyle/quirky/study-reveals-smartphone-breathalyzer-alcohol-testing-devices-vary-widely-in-accuracy20210509222244", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/asdajsdljaks_1DpT0jV-thumbnail-154x87-70.jpg", "publishedAt": "2021-05-09T16:52:00Z", "content": "ANI | Updated: May 09, 2021 22:22 IST\r\nPennsylvania [US], May 9 (ANI): The latest generation of personal alcohol breath testing devices pair with smartphones. While some of these devices were found t… [+3877 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | As India's Covid Cases Surge, Bangladesh Lacks Jabs, Faces Virus Variants - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   India's surge in coronavirus cases is having a serious effect on neighbouring Bangladesh, with health experts warning of imminent vaccine shortages just as the country should be stepping up jabs and as m…", "url": "https://www.latestly.com/agency-news/world-news-as-indias-covid-cases-surge-bangladesh-lacks-jabs-faces-virus-variants-2470612.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg", "publishedAt": "2021-05-09T16:46:08Z", "content": "Dhaka, May 9 (AP) India's surge in coronavirus cases is having a serious effect on neighbouring Bangladesh, with health experts warning of imminent vaccine shortages just as the country should be ste… [+3283 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Lupus patients need attention amidst Covid19: Dr Naresh Purohit - United News of India", "description": "Visakhapatnam, May 9 (UNI) Systemic Lupus Erythematosus (SLE) is a chronic autoimmune condition in which the immune system attacks its own tissues, weakening the body, said Dr Naresh Purohit, Executive Member, Association of Studies for Autoimmune Disorders, …", "url": "http://www.uniindia.com/~/lupus-patients-need-attention-amidst-covid19-dr-naresh-purohit/States/news/2391453.html", "urlToImage": "", "publishedAt": "2021-05-09T15:39:00Z", "content": "More News09 May 2021 | 11:27 PMHyderabad, May 9 (UNI) All India Majlis-e-Ittehadul Muslimeen (AIMIM) Chief Asaduddin Owaisi on Sunday said that Prime Minister Narendra Modi should apologies to people… [+1303 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sruthijith KK", "title": "Indian biotech startup reports early cancer detection breakthrough - Mint", "description": "A team of Indian scientists says it has achieved a stunning breakthrough in early cancer diagnosis with a discovery rooted in a contentious segment of cellular biology that, if validated by additional trials, holds vast market potential in a branch of therape…", "url": "https://www.livemint.com/science/health/biotech-startup-reports-early-cancer-detection-breakthrough-11620326077485.html", "urlToImage": "https://images.livemint.com/img/2021/05/06/600x338/8cc64c7e-ae4b-11eb-a936-0e5204611abd_1620326076776_1620327129579.jpg", "publishedAt": "2021-05-09T15:27:07Z", "content": "A team of Indian scientists says it has achieved a stunning breakthrough in early cancer diagnosis with a discovery rooted in a contentious segment of cellular biology that, if validated by additiona… [+13723 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jack Wright", "title": "Covid UK: UK records just two daily deaths as a THIRD of all adults are now fully vaccinated - Daily Mail", "description": "The latest Department for Health figures published this afternoon show that the number of virus cases rose from 1,671 to 1,770 on last Sunday while the number of deaths plummeted.", "url": "https://www.dailymail.co.uk/news/article-9559305/Covid-UK-UK-records-just-two-daily-deaths.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/09/16/42764396-0-image-a-230_1620574213139.jpg", "publishedAt": "2021-05-09T15:10:36Z", "content": "Coronavirus daily deaths tumbled by 86 per cent from 14 to just 2 in a week while cases rose slightly by 6 per cent in the same period as official figures show a third of UK adults are now fully vacc… [+11908 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Does COVID trigger heart attacks? Top cardiologist has all your doubts cleared - The Federal", "description": "The deadly second, according to Trehan, is fatally affecting young people as low as 33 years old with no earlier signs of heart disease.", "url": "https://thefederal.com/news/does-covid-trigger-heart-attacks-top-cardiologist-explains/", "urlToImage": "https://thefederal.com/file/2020/11/COVID-19.png", "publishedAt": "2021-05-09T14:13:39Z", "content": "After a hectic day at the office, Dinesh Acharya,  just 25, took a shower,  had supper, and hit the bed by 11 pm. At 3 am, he woke up with breathing trouble and was rushed to a Mumbai hospital where … [+3988 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "WSJ", "title": "J&J vaccine pause stoked hesitancy that threatens covid-19 vaccination drive - Livemint", "description": "The 10-day halt in April deepened concerns of many who were reluctant to get vaccinated, according to inoculation sites and a recent survey", "url": "https://www.livemint.com/companies/news/jj-vaccine-pause-stoked-hesitancy-that-threatens-covid-19-vaccination-drive-11620564954776.html", "urlToImage": "https://images.livemint.com/img/2021/05/09/600x338/33b87128-5ffb-11eb-b162-134cbb314c5d_1611716258247_1611716347591_1620565199542.jpg", "publishedAt": "2021-05-09T14:00:11Z", "content": "The 10-day halt in administering Johnson &amp; Johnsons Covid-19 vaccine has made it harder to inoculate the hard-to-reach and hesitant, health officials said, complicating efforts to reach community… [+5712 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Switch of Breast Tumors to HER2-low Might Provide Greater Therapeutic Options - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. The finding that breast tumours can evolve to express low HER2 potentially widens the number of patients who can benefit from new investigational agents, typically novel antibody-drug conjugate therapies…", "url": "https://www.latestly.com/agency-news/science-news-switch-of-breast-tumors-to-her2-low-might-provide-greater-therapeutic-options-2470310.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/05/asdasdasdvvvzxczxcnhjgg_Bm6F8b2_Ksp4ovw_M8oQjZm.jpg", "publishedAt": "2021-05-09T13:34:04Z", "content": "Lugano [Switzerland], May 9 (ANI): The finding that breast tumours can evolve to express low HER2 potentially widens the number of patients who can benefit from new investigational agents, typically … [+3633 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Here's how bullying, obesity can affect girls' and boys' mental health - Hindustan Times", "description": "A new study investigates the connection between body mass index (BMI) or obesity and depressive symptoms and takes a close look at whether being subjected to bullying affects teenage girls, boys and their relationship over time", "url": "https://www.hindustantimes.com/lifestyle/health/heres-how-bullying-obesity-can-affect-girls-and-boys-mental-health-101620565004986.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/09/1600x900/pjimage_(6)_1620565781783_1620565796202.jpg", "publishedAt": "2021-05-09T13:12:04Z", "content": "Depressive symptoms are more common in teenage girls than in their male peers. However, boys' mental health appears to be affected more if they suffer from obesity. Irrespective of gender, bullying i… [+4310 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "India TV News Desk", "title": "Will there be a third wave of coronavirus? AIIMS Director Dr. Randeep Guleria answers | Exclusive - India TV News", "description": "AIIMS Director Dr. Randeep Guleria on Sunday said that any epidemic usually make its impact in three waves out of which it is believed that the second wave proves to be the most dangerous one.", "url": "https://www.indiatvnews.com/news/india/will-there-be-a-third-wave-of-coronavirus-aiims-director-dr-randeep-guleria-latest-news-703530", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/05/randeep-guleria-rep2-1620564017.jpg", "publishedAt": "2021-05-09T12:52:50Z", "content": "Image Source : FILE PHOTOIt is believed that every endemic has three waves, says AIIMS Director Randeep Guleria.\r\nAIIMS Director Dr. Randeep Guleria on Sunday said that any epidemic usually make its … [+2072 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "How do proteins affect processing of information in brain: Study - Zee News", "description": "A complicated interaction between different proteins is needed for information to pass from one nerve cell to the next. A team of researchers now managed to study this process in the synaptic vesicles, which play an important role in this process.", "url": "https://zeenews.india.com/science/how-do-proteins-affect-processing-of-information-in-brain-study-2360822.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/05/09/935260-braininfoprocess.jpg", "publishedAt": "2021-05-09T12:08:12Z", "content": "Halle: A complicated interaction between different proteins is needed for information to pass from one nerve cell to the next. A team of researchers now managed to study this process in the synaptic … [+2052 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "COVID-19 patients are at risk of developing blood clots: Experts - Times Now", "description": "With COVID-19 cases spiking across the country, a common complication that recently started gaining prominence is thrombosis, commonly known as clotting of blood.", "url": "https://www.timesnownews.com/health/article/covid-19-patients-are-at-risk-of-developing-blood-clots-experts/754559", "urlToImage": "https://imgk.timesnownews.com/story/covidtestpti1_1.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T12:00:01Z", "content": "<ul><li>Thrombosis is commonly known as blood clot and can be of different types</li></ul>\r\n<ul><li>Thrombosis is one of the complications arising among COVID-19 patients</li></ul>\r\n<ul><li>Here is w… [+2615 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "What Are The Main Shields Against All Mutants, Future Waves of COVID? Experts Answer - India.com", "description": "As the second wave of the Covid-19 pandemic ravages the country and concerns being raised about a possible third wave, experts have cautioned that the next wave could be less severe if people keep following Covid-appropriate behaviour, provided a large portio…", "url": "https://www.india.com/news/india/what-are-main-shields-against-all-mutants-future-waves-of-covid-experts-answer-4651455/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/05/coronavirus.jpg", "publishedAt": "2021-05-09T11:30:15Z", "content": "Home &gt; News &gt; \r\n India\r\nAs the second wave of the Covid-19 pandemic ravages the country and concerns being raised about a possible third wave, experts have cautioned that the next wave could be… [+4169 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Why is treatment of COVID-19 patients challenging? Find your answer here - Times Now", "description": "Even after recovering, previous COVID-19 patients suffer from health complications. This poses a challenge to the healthcare experts as well as cause obstructions to leading a healthy life.", "url": "https://www.timesnownews.com/health/article/why-is-treatment-of-covid-19-patients-challenging-find-your-answer-here/754764", "urlToImage": "https://imgk.timesnownews.com/story/corona-5401250_1920.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T11:00:01Z", "content": "<ul><li>COVID-19 highly affects the respiratory system of patients </li></ul>\r\n<ul><li>India currently has about 37,36,648 active cases </li></ul>\r\n<ul><li>Recent study suggests why recovered COVID p… [+2963 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Transparency and Accountability Matter Most, And We Must Have It Now - The Wire", "description": "We must demand transparency on two vital issues: oxygen and vaccines. Let all the files and documents be put out in the public domain.", "url": "https://thewire.in/government/transparency-accountability-covid-19-india", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/05/09143348/KE4ICNEPURPS5GDJI7MG5QVXH4-800x400.jpeg", "publishedAt": "2021-05-09T10:00:25Z", "content": "Every time I read or watch the horrific pictures of patients and relatives scrambling for the most elementary of treatment protocol oxygen I wonder how things went so horrendously wrong. The banal ex… [+7177 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Vegetarians have healthier levels of disease markers than meat-eaters: Study - Times Now", "description": "A recent study conducted at the University of Glasgow shows the impact of a vegetarian diet on health markers as compared to a non-vegetarian diet.", "url": "https://www.timesnownews.com/health/article/vegetarians-have-healthier-levels-of-disease-markers-than-meat-eaters-study/754779", "urlToImage": "https://imgk.timesnownews.com/story/salad-2756467_1920_2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-09T10:00:01Z", "content": "London: Vegetarians appear to have a healthier biomarker profile than meat-eaters, and this applies to adults of any age and weight, and is also unaffected by smoking and alcohol consumption, accordi… [+3542 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr. Geeta Dharmatti", "title": "Mother's Day 2021: 5 Diet Tips For Working Mothers That May Help Meet Nutrient Requirements - Doctor NDTV", "description": "Mother's Day 2021: Working mothers often find it hard to manage time. This results in intake of a poor diet. Here are some tips for working mothers that can help consume a healthy diet.", "url": "https://doctor.ndtv.com/living-healthy/mothers-day-2021-5-diet-tips-for-working-mothers-that-may-help-meet-nutrient-requirements-2438210", "urlToImage": "https://c.ndtvimg.com/2020-07/39rj53t8_working-mom-650_650x400_06_July_20.jpg", "publishedAt": "2021-05-09T09:47:54Z", "content": "When the world is struggling with illness, recovery and healing, changing eating habits to boost one's immunity is the key to good health. There is a great need to work on nutrition literacy amongst … [+4631 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mother's Day 2021: 5 Health Tips For Expecting Mothers Amidst The Pandemic - NDTV", "description": "On the occasion of mother's day 2021, Dr Aruna Kalra shares tips for expecting mothers to stay healthy during the ongoing pandemic.", "url": "https://www.ndtv.com/health/mothers-day-2021-5-health-tips-for-expecting-mothers-amidst-the-pandemic-2438180", "urlToImage": "https://c.ndtvimg.com/2020-06/hjn4fpk8_pregnancy-650_650x400_26_June_20.jpg", "publishedAt": "2021-05-09T08:40:05Z", "content": "Mother's Day 2021: Eat a nutritious diet for healthy development of the baby\r\nHighlights\r\n<ul><li>Pregnant women must eat a healthy diet\r\n</li><li>Eat a well balanced meal for optimum nutrition\r\n</li… [+3863 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Associated Press Television News", "title": "Health workers in Chad lack access to any vaccines - Republic World", "description": "While wealthier nations around the world have stockpiled vaccines for their citizens, many other countries have scrambled to secure enough doses.", "url": "https://www.republicworld.com/world-news/africa/health-workers-in-chad-lack-access-to-any-vaccines.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/9ursom0hvi36fhwn_1620548060.jpeg?tr=f-jpeg", "publishedAt": "2021-05-09T08:18:00Z", "content": "At the small hospital near the desert's edge where Dr. Oumaima Djarma works, there are no debates among staff over which coronavirus vaccine is the best. There is simply no vaccine at all. Not even f… [+1855 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Remdesivir not suitable for all Covid cases: Dr Rahul Gupta - India Education Diary", "description": "Jammu: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against use of Remdesivir without proper diagnosis, adding that Remdesivir is not to be used in patients who are not on oxygen support or in home", "url": "https://indiaeducationdiary.in/remdesivir-not-suitable-for-all-covid-cases-dr-rahul-gupta/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/43318850520218018433.jpg", "publishedAt": "2021-05-09T07:28:29Z", "content": "Jammu: Professor and Head of Department, Chest Disease, GMC Jammu, Dr Rahul Gupta today cautioned against use of Remdesivir without proper diagnosis, adding that Remdesivir is not to be used in patie… [+1230 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Covid-19 could cause long-lasting damage to heart: Doctors - Daijiworld.com", "description": "New Delhi, May 9 (IANSlife): A large number of recovered patients from Covid-19 have encountered heart problems and even patients with existing heart problems have felt its affects. The virus can lead to heart injury, heart failure, stroke, and damage to your…", "url": "https://daijiworld.com/news/newsDisplay?newsID=831528", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2021-05-09T07:14:05Z", "content": "New Delhi, May 9 (IANSlife): A large number of recovered patients from Covid-19 have encountered heart problems and even patients with existing heart problems have felt its affects. The virus can lea… [+2959 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Two pandemics clash as doctors find covid spurs diabetes - Livemint", "description": "Among Covid-19’s many ripple effects, the worsening of the global diabetes burden could carry a heavy public-health toll", "url": "https://lifestyle.livemint.com/health/wellness/two-pandemics-clash-as-doctors-find-covid-spurs-diabetes-111620543339003.html", "urlToImage": "https://images.livemint.com/img/2021/05/09/1140x641/diabetes-777001_1920_1620543971635_1620543982033.jpg", "publishedAt": "2021-05-09T07:11:30Z", "content": "(Bloomberg) -- When Ziyad Al-Alys research team told him how often diabetes appeared to strike Covid-19 survivors, he thought the data must be wrong, so he asked his five colleagues to crunch the num… [+7236 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "COVID-appropriate behaviour, speedy vaccination can prevent third wave from happening: Experts - The New Indian Express", "description": "According to experts, in a few months when the immunity people have developed naturally or with the help of vaccination fades, the virus strikes again.", "url": "https://www.newindianexpress.com/nation/2021/may/09/covid-appropriate-behaviour-speedyvaccination-can-prevent-third-wave-from-happening-experts-2300361.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/5/9/w600X390/Ranchi_COVID_Lockdown_PTI_Final.jpg", "publishedAt": "2021-05-09T07:07:00Z", "content": "NEW DELHI: With the second wave of the COVID-19 pandemic ravaging the country and concerns being raised about a possible third wave, experts caution that the next wave could be less severe if people … [+5096 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Covid-appropriate behaviour, vaccination main shields against all mutants, future waves: Experts - Times of India", "description": "Science News: There has been a sharp surge in infections over the past couple of months, making the second wave much worse than the first one that began in early 20", "url": "https://timesofindia.indiatimes.com/home/science/covid-appropriate-behaviour-vaccination-main-shields-against-all-mutants-future-waves-experts/articleshow/82494589.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82494906,width-1070,height-580,imgsize-98763,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-09T06:47:00Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "COVID-19 in children: Symptoms to look out for and how you can treat it at home - THE WEEK", "description": "There has been a 51% rise in the number of children getting infected in Maharashtra", "url": "https://www.theweek.in/news/health/2021/05/09/covid-19-in-children-symptoms-to-look-out-for-and-how-you-can-treat-it-at-home.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2021/5/9/dr-Deepu-Abraham-file.jpg", "publishedAt": "2021-05-09T02:43:01Z", "content": "For much of the COVID-19 pandemic, the disease affected mostly adults. But, as India was engulfed by the second wave of infections, the number of children testing COVID-positive over the last few mon… [+10038 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "'COVID treatment tough due to infectious profile' - Ahmedabad Mirror", "description": "Growing evidence that virus infects both upper and lower respiratory tracts, says Lancet review", "url": "https://ahmedabadmirror.com/covid-treatment-tough-due-to-infectious-profile/81799500.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1620490030580.jpg-org", "publishedAt": "2021-05-09T00:35:31Z", "content": "<ul><li>Agencies</li><li> 09-05-2021 06:00 AM</li></ul>\r\nGrowing evidence that virus infects both upper and lower respiratory tracts, says Lancet review\r\nAs the COVID-19 cases surge globally, especia… [+2341 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Shilpi Madan", "title": "Locking them up - The New Indian Express", "description": "You are done pumping scalp serums, massaging oil pods on your follicles, and wielding haute tongs to make your hair look glossy and voluminous.", "url": "https://www.newindianexpress.com/magazine/2021/may/09/locking-them-up-2299335.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/5/8/w600X390/lock.JPG", "publishedAt": "2021-05-08T23:30:00Z", "content": "You are done pumping scalp serums, massaging oil pods on your follicles, and wielding haute tongs to make your hair look glossy and voluminous. Try going back to the basics—food. Eat healthy to pour … [+3068 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Thalassemia : Challenges In Covid 19 Pandemic - Daily Excelsior", "description": "Dr Sanjeev Kumar Digra On the occasion of world thalassemia day thought goes to trial tribulations of a person with thalassemia, if those were not enough", "url": "https://www.dailyexcelsior.com/thalassemia-challenges-in-covid-19-pandemic/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2021/05/health.jpg", "publishedAt": "2021-05-08T19:29:49Z", "content": "Dr Sanjeev Kumar DigraOn the occasion of world thalassemia day thought goes to trial tribulations of a person with thalassemia, if those were not enough the current Pandemic has compounded the proble… [+5804 chars]"}, {"source": {"id": null, "name": "Telegraph India"}, "author": "Koustubh Panda", "title": "Shot in the dark - Telegraph India", "description": "The Government And Its Health Administrators Have Bungled The Roll Out Of The Covid Vaccine But It's The Citizenry That Will Have To Play A Huge Role In Controlling The Second Killer Wave", "url": "https://www.telegraphindia.com/india/covid-19-shot-in-the-dark/cid/1814979", "urlToImage": "https://assets.telegraphindia.com/telegraph/2021/May/1620493940_vaccine_pti.jpg", "publishedAt": "2021-05-08T19:01:48Z", "content": "This fight against Covid-19 is admittedly the most unprecedented and unpredictable battle that the human race has ever fought against a common enemy; it is not only invisible but also frustratingly e… [+8844 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Choudhari", "title": "Give me some sunshine: Exposure to sun is vital for good health - Times of India", "description": "Nagpur: While work-from-home, online classes and self-imposed social lockdown has prevented many families from getting exposed to the virus, it has al.", "url": "https://timesofindia.indiatimes.com/city/nagpur/give-me-some-sunshine-exposure-to-sun-is-vital-for-good-health/articleshow/82487909.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82487908,width-1070,height-580,imgsize-67433,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-08T18:55:00Z", "content": "Give me some sunshine: Exposure to sun is vital for good health"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Neha", "title": "Can drinking warm water, taking hot water bath protect you from COVID-19? - The Siasat Daily", "description": "New Delhi: Ever since the outbreak of the COVID-19 pandemic, many people are following home remedies to avoid contracting the disease. The popular remedies are drinking warm water and taking hot water bath. But can they really protect you from COVID-19? On Sa…", "url": "https://www.siasat.com/can-drinking-warm-water-taking-hot-water-bath-protect-you-from-covid-19-2134595/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/05/water.jpg", "publishedAt": "2021-05-08T18:25:00Z", "content": "New Delhi: Ever since the outbreak of the COVID-19 pandemic, many people are following home remedies to avoid contracting the disease. The popular remedies are drinking warm water and taking hot wate… [+1419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Mucormycosis fungal infections up among COVID-19 survivors - Economic Times", "description": "In Maharashtra, at least eight COVID-19 survivors have died due to mucormycosis while 200 others are being treated, said Dr Tatyarao Lahane, who heads the Directorate of Medical Education and Research of the state government.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/fungal-infection-cases-rising-in-2nd-phase-of-pandemic-warn-doctors-in-maharashtra-gujarat/articleshow/82482356.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82482364,width-1070,height-580,imgsize-109577,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-08T14:47:00Z", "content": "Cases of mucormycosis, a serious but rare fungal infection, are on the rise among COVID-19 survivors, causing blindness or other serious issues, health officials in Maharashtra and Gujarat said on Sa… [+3325 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Covid-induced black fungus cases on rise in Maha, Gujarat: How deadly is it? - Times of India", "description": "India News: At least eight Covid-19 patients have lost vision in one eye due to mucormycosis, a rare and deadly fungal infection which has a mortality rate of ove", "url": "https://timesofindia.indiatimes.com/india/covid-induced-black-fungus-cases-on-rise-in-maha-gujarat-how-deadly-is-it/articleshow/82482209.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82482240,width-1070,height-580,imgsize-162081,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-08T14:33:00Z", "content": "Covid-sparked fungal infection assuming epidemic proportionsTriggered by coronavirus, mucormycosis, which has a mortality rate of over 50% and can lead to blindness, is sweeping through parts of Maha… [+158 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Advances in ovarian cancer treatment & prevention mechanisms can save many women in India - United News of India", "description": "Kolkata, May 8 (UNI) Women-related cancers although being one of the major causes of mortality in India are less spoken about and cared for.", "url": "http://www.uniindia.com/advances-in-ovarian-cancer-treatment-prevention-mechanisms-can-save-many-women-in-india/east/news/2390669.html", "urlToImage": "", "publishedAt": "2021-05-08T14:08:00Z", "content": "Kolkata, May 8 (UNI) Women-related cancers although being one of the major causes of mortality in India are less spoken about and cared for. Cancers such as ovarian cancer especially have a high mort… [+2302 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Study finds children spread COVID-19 infections faster due to higher 'viral load' - CNBCTV18", "description": "The study found that children spread coronavirus 'more efficiently' compared to adults because they have a high viral load.Get latest Healthcare online at cnbctv18.com", "url": "https://www.cnbctv18.com/healthcare/study-finds-children-spread-covid-19-infections-faster-due-to-higher-viral-load-9235961.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/04/school_children-768x432.jpg", "publishedAt": "2021-05-08T13:41:47Z", "content": "Children spread COVID-19 infections faster than adults as they carry a higher 'viral load’, according to a study published in The Journal of the American Medical Association (JAMA).\r\nThe study found … [+1934 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Eat Jaggery Or Ghee With Roti': Government Shares 'Sample Meal Plan' For Covid Patients - NDTV Food", "description": "Government of India's twitter handle recently shared a simple meal plan for patients with COVID 19.", "url": "https://food.ndtv.com/news/eat-jaggery-or-ghee-with-roti-government-shares-sample-meal-plan-for-covid-patients-2437807", "urlToImage": "https://c.ndtvimg.com/2021-01/1925ap0o_ghee-_625x300_27_January_21.jpeg", "publishedAt": "2021-05-08T12:07:46Z", "content": "The nation is tackling with the second wave of the Coronavirus pandemic. The gap between active cases and recovered cases is still very wide, and as per experts we are yet to hit the peak soon. In ot… [+2607 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Black fungus claims eyesight of some COVID-19 survivors in Gujarat - Economic Times", "description": "In Ahmedabad, at least five patients with mucormycosis are being operated upon every day at the civil hospital at Asarva, a senior doctor said.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/black-fungus-claims-eyesight-of-some-covid-19-survivors-in-gujarat/articleshow/82479932.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82479918,width-1070,height-580,imgsize-142473,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-08T11:43:00Z", "content": "Cases of Mucormycosis, a fungal infection, affecting some COVID-19 survivors are on the rise in Gujarat which has left many patients blind, doctors and officials claimed on Saturday.\r\nMathur Savani, … [+2647 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha", "title": "First case of vaccine-induced blood clot treated with heparin alternatives: Report - Medical Dialogues", "description": "USA: A recent case report published in the Annals of Emergency Medicine, describes the first case of ...", "url": "https://medicaldialogues.in/medicine/cases/first-case-of-vaccine-induced-blood-clot-treated-with-heparin-alternatives-report-77372", "urlToImage": "https://medicaldialogues.in/h-upload/2020/06/30/131049-blood-clots.jpg", "publishedAt": "2021-05-08T11:30:09Z", "content": "USA: A recent case report published in the Annals of Emergency Medicine, describes the first case of a patient with vaccine-induced blood clot who was safely treated with a heparin alternative follow… [+2190 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Black fungus claims eyesight of some COVID-19 survivors in Guj - Devdiscourse", "description": "Read more about Black fungus claims eyesight of some COVID-19 survivors in Gujarat on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1565259-black-fungus-claims-eyesight-of-some-covid-19-survivors-in-gujarat", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/21_11_2020_11_10_50_9857215.jpg?width=920&format=jpeg", "publishedAt": "2021-05-08T10:47:00Z", "content": "Cases of Mucormycosis, a fungal infection, affecting some COVID-19 survivors are on the rise in Gujarat which has left many patients blind, doctors and officials claimed on Saturday.\r\nMathur Savani, … [+2766 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Mucormycosis on rise in Covid-19 patients in Ahmedabad, says doctor - Hindustan Times", "description": "Mucormycosis is a rare fungal infection that is found in immunodeficient patients.", "url": "https://www.hindustantimes.com/india-news/mucormycosis-on-rise-in-covid-19-patients-in-ahmedabad-says-doctor-101620468857557.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/08/1600x900/2021-05-05T092857Z_1_LYNXMPEH440GG_RTROPTP_3_HEALTH-CORONAVIRUS-INDIA_1620468986951_1620469012086.JPG", "publishedAt": "2021-05-08T10:20:29Z", "content": "Fungal infection mucormycosis has been on the rise among Covid patients in Ahmedabad for the last 15-20 days, doctors have said. Around 67 patients are being treated for the same in the Ear, Nose and… [+1662 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Mild COVID-19 infection is very unlikely to cause lasting heart damage - Medical Xpress", "description": "Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, according to a study led by UCL (University College London) researchers and funded by the British Heart Foundation (BHF) and Barts Charity.", "url": "https://medicalxpress.com/news/2021-05-mild-covid-infection-heart.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/3-heart.jpg", "publishedAt": "2021-05-08T09:52:26Z", "content": "Mild Covid-19 infection is very unlikely to cause lasting damage to the structure or function of the heart, according to a study led by UCL (University College London) researchers and funded by the B… [+4318 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Samarpita Yashaswini", "title": "Know the dietary advisory shared by the Centre for COVID 19 patients - PINKVILLA", "description": "The Centre recently suggested a list of food items that should be included in the dietary plan of a person suffering from COVID-19 and that aid in boosting immunity. Read on to know the diet plan and the immunity-boosting food items.", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/know-dietary-advisory-shared-centre-covid-19-patients-729512", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/dietary_advisory_shared_by_the_centre_for_covid_19_patients_social.jpg?itok=bjyY4uoV", "publishedAt": "2021-05-08T07:08:39Z", "content": null}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "OneIndia Correspondent", "title": "COVID-19 related black fungal infections adds chaos amidst a pandemic - Oneindia", "description": "Doctors at a leading private facility in Delhi are witnessing a rise in the number of Covid-triggered mucormycisis cases, according to a statement from the hospital.Mucormycisis is a fungal infection triggered by COVID-19. Black fungus or mucormycosis has bee…", "url": "https://www.oneindia.com/india/covid-19-related-black-fungal-infections-adds-chaos-amidst-a-pandemic-3256381.html", "urlToImage": "https://www.oneindia.com/img/1200x80/2021/05/fungal-infections-1620455439.jpg", "publishedAt": "2021-05-08T06:32:16Z", "content": "New Delhi, May 08: Doctors at a leading private facility in Delhi are witnessing a rise in the number of Covid-triggered mucormycisis cases, according to a statement from the hospital.\r\nMucormycisis … [+3185 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Explained: Cleared for India, antibody cocktail Trump used - The Indian Express", "description": "Former US President Donald Trump had taken the drug when he contracted Covid-19 in October last year.", "url": "https://indianexpress.com/article/explained/explained-cleared-for-india-antibody-cocktail-trump-used-7306415/", "urlToImage": "https://images.indianexpress.com/2021/05/660_060521095039.jpg", "publishedAt": "2021-05-08T01:32:48Z", "content": "An investigational antibody cocktail, from Switzerland-based drug-maker Roche, has got approval from Indias Central Drugs Standards Control Organisation (CDSCO) for use in emergency situations for tr… [+3003 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Antiviral drug 'Molnupiravir' blocks Covid-19 virus within 24 hours: Study - ETHealthworld.com", "description": "Researchers have discovered that the treatment of SARS-CoV-2 infection (Covid-19) with a new antiviral drug, MK-4482/EIDD-2801 or Molnupiravir, completely suppresses the virus transmission within 24 hours.", "url": "https://health.economictimes.indiatimes.com/news/pharma/antiviral-drug-molnupiravir-blocks-covid-19-virus-within-24-hours-study/79583150", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79583150,imgsize-118114,width-800,height-434,overlay-ethealthworld/antiviral-drug-molnupiravir-blocks-covid-19-virus-within-24-hours-study.jpg", "publishedAt": "2020-12-05T13:42:21Z", "content": "New York: Researchers have discovered that the treatment of SARS-CoV-2 infection (Covid-19) with a new antiviral drug, MK-4482/EIDD-2801 or Molnupiravir, completely suppresses the virus transmission … [+2083 chars]"}]}