{"status":"ok","totalResults":70,"articles":[{"source":{"id":"cnbc","name":"CNBC"},"author":"Cory Stieg","title":"Could you get PTSD from your pandemic experience? The long-term mental health effects of coronavirus - CNBC","description":"Could the emotional toll of the Covid-19 pandemic lead to long-term mental health issues, such as post-traumatic stress disorder? Experts weigh in, and provide productive coping strategies.","url":"https://www.cnbc.com/2020/04/17/long-term-mental-health-ptsd-effects-of-covid-19-pandemic-explained.html","urlToImage":"https://image.cnbcfm.com/api/v1/image/106492081-1587057687373window-portrait_t20_1qz6ax.jpg?v=1587057726","publishedAt":"2020-04-18T14:31:12Z","content":"Experiencing intense flashbacks, nightmares, irritability, anger, and fear? In the face of a traumatic event like the Covid-19 pandemic, it's common to feel this way.\r\nWhile many people associate post-traumatic stress disorder with something like war, it's a … [+5397 chars]"},{"source":{"id":null,"name":"Business-standard.com"},"author":"Ruchika Chitravanshi","title":"AIIMS studying effects of HCQ on Covid-19 patients as deaths near 500 mark - Business Standard","description":"About 480 patients wille be observed over 8 weeks; trial results of American drug Remdesivir also awaited","url":"https://www.business-standard.com/article/health/aiims-studying-effects-of-hcq-on-covid-19-patients-as-deaths-near-500-mark-120041800860_1.html","urlToImage":"https://bsmedia.business-standard.com/_media/bs/img/article/2020-04/07/full/1586201559-534.jpg","publishedAt":"2020-04-18T13:38:02Z","content":"The All India Institute of Medical Sciences (AIIMS) is conducting a study on Hydroxychloroquine (HCQ) as a therapeutic and prophylactic drug on Covid-19, the Indian Council of Medical Research (ICMR) has said, even as it awaits the trial results of the Americ… [+2224 chars]"},{"source":{"id":null,"name":"Techexplorist.com"},"author":"https://www.facebook.com/malewar.amit","title":"Space travel makes the human brain bigger, changes its functions, study - Tech Explorist","description":"Microgravity exposure in long-duration spaceflights caused expansions in the astronauts’ brain and cerebrospinal fluid (CSF) volumes. It also developed deformation of the pituitary gland.","url":"https://www.techexplorist.com/space-travel-human-brain-bigger-changes-functions-study/31696/","urlToImage":"https://www.techexplorist.com/wp-content/uploads/2020/04/astronauts.jpg","publishedAt":"2020-04-18T12:24:21Z","content":"Space explorers on long-span spaceflight missions may develop changes in ocular structure and function, which can persist for years after the return to normal gravity.\r\nPast study has suggested that long-duration spaceflight missions impact the vision of astr… [+2057 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"Sanjay Suri","title":"London View | Here's What Britain is Getting Wrong, and Kerala Did Right to Combat Virus Outbreak - News18","description":"If South Korea has become the gold standard for the world, Kerala has to be the gold standard for India. And if more waves of this viral outbreak are to follow, what Kerala has been doing successfully may need to be multiplied and repeated.","url":"https://www.news18.com/news/world/london-view-heres-what-britain-is-getting-wrong-and-kerala-did-right-to-combat-virus-outbreak-2583103.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/04/1586594946_uk-coronavirus.jpg","publishedAt":"2020-04-18T10:56:17Z","content":"A chilling warning presented by a leading medical expert to the British Parliament on Friday this week is not likely to remain a warning or chilling just for Britain. \r\nHe has warned on the basis of new scientific modelling that eight to ten waves of the coro… [+4770 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"Times Of India","title":"Nagpur reports four new coronavirus cases; total 63 - Times of India","description":"NAGPUR: Four new Covid-19 cases have been detected in Maharashtra's Nagpur, taking the number of the infected people to 63, an official said on Saturd.","url":"https://timesofindia.indiatimes.com/city/nagpur/nagpur-reports-four-new-coronavirus-cases-total-63/articleshow/75219822.cms","urlToImage":"https://static.toiimg.com/thumb/msid-75219800,width-1070,height-580,imgsize-80639,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2020-04-18T10:46:30Z","content":"Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"},{"source":{"id":"the-hindu","name":"The Hindu"},"author":"The Hindu Net Desk","title":"Watch | Convalescent plasma therapy for COVID-19 patients - The Hindu","description":"A video on convalescent plasma therapy and its feasibility in COVID-19 patients","url":"https://www.thehindu.com/sci-tech/science/plasma-therapy-for-covid-19-patients/article31373992.ece","urlToImage":"https://www.thehindu.com/sci-tech/science/dr1561/article31374098.ece/ALTERNATES/LANDSCAPE_615/plasma-therapy-device-reutersjpg","publishedAt":"2020-04-18T09:55:14Z","content":"The health community across the world is looking at plasma or antibody therapy to battle COVID-19. Convalescent plasma has been listed as a therapeutic method by Chinas National Health Commission.\r\nIn India, many states have sought and received the approval o… [+641 chars]"},{"source":{"id":null,"name":"Thejakartapost.com"},"author":"The Jakarta Post","title":"Confusion, seizure, strokes: How COVID-19 may affect the brain - The Jakarta Post - Jakarta Post","description":"A pattern is emerging among COVID-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is.","url":"https://www.thejakartapost.com/life/2020/04/18/confusion-seizure-strokes-how-covid-19-may-affect-the-brain.html","urlToImage":"https://img.jakpost.net/c/2020/04/11/2020_04_11_92450_1586584756._large.jpg","publishedAt":"2020-04-18T09:42:00Z","content":"A pattern is emerging among COVID-19 patients arriving at hospitals in New York: Beyond fever, cough and shortness of breath, some are deeply disoriented to the point of not knowing where they are or what year it is.\r\nAt times this is linked to low oxygen lev… [+4769 chars]"},{"source":{"id":null,"name":"Thewire.in"},"author":null,"title":"Why India’s Stated Policy on Hydroxychloroquine Makes No Sense - The Wire","description":"The ICMR's reasoning for why it is recommending hydroxychloroquine as prophylaxis to healthcare workers is just unscientific.","url":"https://m.thewire.in/article/government/why-indias-stated-policy-on-hydroxychloroquine-makes-no-sense","urlToImage":"https://cdn.thewire.in/wp-content/uploads/2020/04/18144100/reuters-800x400.jpg","publishedAt":"2020-04-18T09:40:48Z","content":"In a recent video published by ANI, the chief epidemiologist of the Indian Council of Medical Research (ICMR), Raman Gangakhedkar, made a couple of odd statements about hydroxychloroquine. He said that because there was so little evidence of the drug’s effica… [+10162 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"PTI","title":"Ditch jet dryers: Paper towels more effective in removing coronavirus after washing hand - Economic Times","description":"Viral dispersal to clothing was 5-fold higher with hand dryers compared to paper towels.","url":"https://economictimes.indiatimes.com/magazines/panache/ditch-jet-dryers-paper-towels-more-effective-in-removing-coronavirus-after-washing-hand/articleshow/75200138.cms","urlToImage":"https://img.etimg.com/thumb/msid-75200313,width-1070,height-580,imgsize-474366,overlay-etpanache/photo.jpg","publishedAt":"2020-04-18T09:37:03Z","content":"LONDON: Using paper towels to dry hands is substantially more effective than jet dryers for removing viruses, including the novel coronavirus that causes COVID-19, according to a study. Hand drying is important to minimise the spread of dangerous microbes sin… [+6538 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"UK coronavirus death toll rises to 14576 - Sky News Australia","description":"The United Kingdom’s coronavirus death toll has risen to more than 14,576 after 847 people died in hospitals across the country within the last 24 hours. The...","url":"https://www.youtube.com/watch?v=NbS-S8CSZtY","urlToImage":"https://i.ytimg.com/vi/NbS-S8CSZtY/maxresdefault.jpg","publishedAt":"2020-04-18T09:36:11Z","content":"The United Kingdoms coronavirus death toll has risen to more than 14,576 after 847 people died in hospitals across the country within the last 24 hours. \r\nThe previous day there were 861 deaths and last week the UK death toll peaked at 980. \r\nThe National Hea… [+185 chars]"},{"source":{"id":null,"name":"Easternmirrornagaland.com"},"author":null,"title":"Covid-19 striking more children than expected, states study - Eastern Mirror","description":"Contrary to governments and some scientists' claims, the number of children infected with the coronavirus is more extensive than currently being reported.","url":"https://www.easternmirrornagaland.com/covid-19-striking-more-children-than-expected-study/","urlToImage":"https://www.easternmirrornagaland.com/wp-content/uploads/2018/04/baby-3289174_960_720.jpg","publishedAt":"2020-04-18T09:08:56Z","content":"New York, April 18 (IANS): Contrary to what governments and a school of scientists claim (including Tesla and SpaceX CEO Elon Musk), the number of children infected with the coronavirus is far more extensive than what is currently reported — a hidden detail t… [+3244 chars]"},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Doctors criticise UK government over coronavirus protection shortages - Reuters","description":"Doctors and health workers criticised the British government on Saturday for suggesting that gowns used to protect them while treating coronavirus patients could be re-used, as supplies run low across the country.","url":"https://in.reuters.com/article/health-coronavirus-britain-idINL8N2C605A","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png","publishedAt":"2020-04-18T08:51:00Z","content":"LONDON, April 18 (Reuters) - Doctors and health workers criticised the British government on Saturday for suggesting that gowns used to protect them while treating coronavirus patients could be re-used, as supplies run low across the country. \r\nBritain is at … [+2438 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Coronavirus: How long does it take to recover? - BBC News","description":"Recovery from Covid-19 can be a lengthy process, depending on how seriously people get the virus.","url":"https://www.bbc.co.uk/news/health-52301633","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/C594/production/_111808505_7e495af9-90bd-4870-8b7c-c224197959ce.jpg","publishedAt":"2020-04-18T08:44:02Z","content":"Image copyrightGetty Images\r\nCovid-19 only emerged at the end of 2019, but already there are signs it may take a long time for some patients to get back to full health. \r\nRecovery time will depend on how sick you become in the first place. Some people will sh… [+5142 chars]"},{"source":{"id":null,"name":"News18.com"},"author":"News18","title":"'UK Was Too Slow on Coronavirus': Leading Public Health Prof Says 40,000 Could Die Due to Outbreak - News18","description":"Anthony Costello, a paediatrician who is an expert in epidemiology, said the government should make sure its response to the second and additional waves of infection was not too slow.","url":"https://www.news18.com/news/world/uk-was-too-slow-on-coronavirus-leading-public-health-prof-says-40000-could-die-due-to-outbreak-2582847.html","urlToImage":"https://images.news18.com/ibnlive/uploads/2020/01/Untitled-design-354.png","publishedAt":"2020-04-18T08:20:52Z","content":"London: The British government was too slow to react on several fronts to the novel coronavirus outbreak that could cause the deaths of 40,000 people in the United Kingdom, a leading public health professor told lawmakers on Friday.\r\nPrime Minister Boris John… [+3624 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":null,"title":"On-off social distancing may be needed until 2022: Harvard study - The intermittent approach - Economic Times","description":"A one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said. Their study comes as the US en…","url":"https://economictimes.indiatimes.com/news/politics-and-nation/on-off-social-distancing-may-be-needed-until-2022-harvard-study/the-intermittent-approach/slideshow/75218096.cms","urlToImage":"https://img.etimg.com/thumb/msid-75218096,width-1070,height-580,overlay-economictimes/photo.jpg","publishedAt":"2020-04-18T07:58:00Z","content":"18 Apr 2020, 01:28 PM IST\r\nA one-time lockdown won't halt the novel coronavirus and repeated periods of social distancing may be required into 2022 to prevent hospitals from being overwhelmed, Harvard scientists who modeled the pandemic's trajectory said. The… [+2314 chars]"},{"source":{"id":null,"name":"Eastmojo.com"},"author":"Team EastMojo","title":"40% of COVID-19 positive patients to be sent home in Mumbai - EastMojo","description":"40% of COVID-19 positive patients to be sent home in Mumbai","url":"https://www.eastmojo.com/coronavirus-updates/2020/04/18/40-of-covid-19-positive-patients-to-be-sent-home-in-mumbai","urlToImage":"https://gumlet.assettype.com/eastmojo%2F2020-04%2Ff25bdab1-daf9-431e-b2bc-bf35308d2776%2Fcovid_19_5000022_960_720.jpg?rect=0%2C0%2C960%2C504&w=1200&auto=format%2Ccompress&ogImage=true","publishedAt":"2020-04-18T07:57:43Z","content":"Mumbai: The state-appointed COVID-19 Task Force issued guidelines for positive patients and accordingly, 40% of patients in Mumbai can be shifted from hospitals to COVID care centres or their homes. According to the guidelines, asymptomatic patients without c… [+1036 chars]"},{"source":{"id":null,"name":"Itv.com"},"author":null,"title":"Three million packs of paracetamol from India to replenish British supermarkets shelves - ITV News","description":"After stockpilers emptied paracetamol  from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\n\nThe Government ordered the huge amount from India, where the drugs are made, who have approved…","url":"https://www.itv.com/news/2020-04-18/with-fresh-stock-of-3m-packs-of-paracetamol-from-india-shelves-in-british-supermarkets-would-be-replenished/","urlToImage":"https://news.images.itv.com/image/file/2188978/img.jpg","publishedAt":"2020-04-18T07:31:00Z","content":"After stockpilers emptied paracetamol from shelves of left British supermarket and retailers, Britain has bought around 3,000,000 packs of paracetamol from India.\r\nThe Government ordered the huge amount from India, where the drugs are made, who have approved … [+1291 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"Consignment of COVID drugs arrive in the Dominican Republic - TIMES NOW","description":"A consignment COVID drugs to combat the virus arrive in the Dominican Republic. India has stepped in to ensure the manufacturing and ensuring easy distributi...","url":"https://www.youtube.com/watch?v=P6lNVe-LHVw","urlToImage":"https://i.ytimg.com/vi/P6lNVe-LHVw/maxresdefault.jpg","publishedAt":"2020-04-18T07:16:47Z","content":"A consignment COVID drugs to combat the virus arrive in the Dominican Republic. India has stepped in to ensure the manufacturing and ensuring easy distribution of essential vaccines for serious diseases during COVID 19. Watch!\r\nSubscribe to Times Now | Click … [+685 chars]"},{"source":{"id":null,"name":"Youtube.com"},"author":null,"title":"70 Covid-19 vaccines are in development around the world - TRT World","description":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is develop...","url":"https://www.youtube.com/watch?v=59g5jQRoqHo","urlToImage":"https://i.ytimg.com/vi/59g5jQRoqHo/hqdefault.jpg","publishedAt":"2020-04-18T07:16:28Z","content":"As countries around the world start easing their lockdown restrictions, we're being warned the coronavirus threat will not be over until a vaccine is developed. The World Health Organization says it will be at least a year before a vaccine is ready. Sarah Mor… [+352 chars]"},{"source":{"id":null,"name":"Ummid.com"},"author":null,"title":"Explained: How Hong Kong managed COVID-19 without complete lockdown - ummid.com","description":"As of March 31, Hong Kong had 715 confirmed COVID-19 cases including 94 asymptomatic infections, and 4 deaths","url":"https://ummid.com/news/2020/april/18.04.2020/explained-how-hong-kong-managed-covid-19-without-complete-lockdown.html","urlToImage":"https://ummid.com/news/2020/april/18.04.2020/how-hong-kong-tackled-corona.jpg","publishedAt":"2020-04-18T07:10:59Z","content":"Hong Kong: With widespread testing, contact tracing and population behavioural changes Hong Kong appears to have managed to contain the first wave of COVID-19 without resorting to drastic measures like complete lockdown which now threaten to damage economies … [+4475 chars]"}]}