{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "The West Australian"}, "author": "NCA NewsWire", "title": "Shane Warne's sudden death drives surge in men checking up on their heart health - The West Australian", "description": "The sudden passing of Shane Warne at just 52 from a suspected heart attack has given Aussie men the nudge to take their own health seriously.", "url": "https://thewest.com.au/news/shane-warnes-sudden-death-drives-surge-in-men-checking-up-on-their-heart-health-c-6046073", "urlToImage": "https://images.thewest.com.au/publication/C-6046073/30b37985b87f5eee8dd8658af015a45cc4379c41-16x9-x0y192w2048h1152.jpg?imwidth=1200", "publishedAt": "2022-03-13T23:44:29Z", "content": null}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Unnikrishnan S", "title": "Obesity adds to risk of Covid, say experts - The New Indian Express", "description": "Although some people find it hard to lose weight due to various reasons, diet and physical activities play vital roles in making a difference, according to doctors.", "url": "https://www.newindianexpress.com/states/kerala/2022/mar/14/obesity-adds-to-risk-of-covid-say-experts-2429783.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/3/14/w600X390/Obesity_add.jpg", "publishedAt": "2022-03-13T23:14:00Z", "content": "THIRUVANANTHAPURAM: With the government easing Covid restrictions, health experts are urging people to maintain a healthy weight as obesity and potbelly associated with it are considered to be major … [+2215 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Include these foods in your diet if you have depression and anxiety - Play Crazy Game", "description": "Depression, as many are already aware, is a chronic psychiatric illness whose symptoms are deep sadness, loss of interest, lack of mood and mood swings. It can often be confused with anxiety and can even lead the patient to have suicidal thoughts. Read more: …", "url": "https://playcrazygame.com/2022/03/14/include-these-foods-in-your-diet-if-you-have-depression-and-anxiety/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/depressao.jpg", "publishedAt": "2022-03-13T23:12:05Z", "content": "Depression, as many are already aware, is a chronic psychiatric illness whose symptoms are deep sadness, loss of interest, lack of mood and mood swings. It can often be confused with anxiety and can … [+3544 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Know the signs of dehydration and avoid health problems - Play Crazy Game", "description": "Although it is said that it is important to drink two liters of water a day, this amount can still increase with the habits of each one. For example, people who exercise frequently may need more water in their body, as well as those who live in hot environmen…", "url": "https://playcrazygame.com/2022/03/14/know-the-signs-of-dehydration-and-avoid-health-problems/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/conheca-os-sinais-de-desidratacao.jpeg", "publishedAt": "2022-03-13T21:43:58Z", "content": "Although it is said that it is important to drink two liters of water a day, this amount can still increase with the habits of each one. For example, people who exercise frequently may need more wate… [+1697 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Learn about the diseases caused by high blood pressure - Play Crazy Game", "description": "High blood pressure is a condition in which there is an increase in the pressure that the blood makes when circulating through the arteries for a continuous time. However, this disease is present in the daily lives of thousands of Brazilians and can have diff…", "url": "https://playcrazygame.com/2022/03/14/learn-about-the-diseases-caused-by-high-blood-pressure/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/Saiba-quais-sao-as-doencas-causadas-pela-pressao-alta-scaled.jpg", "publishedAt": "2022-03-13T19:32:00Z", "content": "High blood pressure is a condition in which there is an increase in the pressure that the blood makes when circulating through the arteries for a continuous time. However, this disease is present in … [+1906 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Should public health measures like masking continue beyond the pandemic? Data on viral infections shows their benefits - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Calgary, Mar 13: Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However, surprisingly little attention has been paid to the remarka…", "url": "https://www.dailyexcelsior.com/should-public-health-measures-like-masking-continue-beyond-the-pandemic-data-on-viral-infections-shows-their-benefits/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/03/9-18.jpg", "publishedAt": "2022-03-13T19:29:47Z", "content": "Calgary, Mar 13: Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However… [+6011 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Obesity does not improve! – ARNAUD DRIJARD - Code List", "description": "The new report from the World Obesity Federation came out, and what it mentions is quite alarming. The situation is critical and is a threat to many we know: -Obesity rates are likely to double by 2030, with the highest increases in the lowest-income countrie…", "url": "https://codelist.biz/2022/03/13/obesity-does-not-improve-arnaud-drijard/", "urlToImage": "https://www.record.com.mx/sites/default/files/columnista/tcolumnistas/Arnaud%20Drijard.jpg", "publishedAt": "2022-03-13T17:50:28Z", "content": "The new report from the World Obesity Federation came out, and what it mentions is quite alarming. The situation is critical and is a threat to many we know:\r\n-Obesity rates are likely to double by 2… [+5133 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kevin R Stone", "title": "Arthritis: Prevention, Treatment, and Cures - Times of India", "description": "Arthritis is a silent, insidious, and painful joint disorder that ruins many lives. In the US, it’s the most common cause of disability. The good news is, we have learned that many cases of arthritis...", "url": "https://timesofindia.indiatimes.com/blogs/the-stone-clinic/arthritis-prevention-treatment-and-cures/", "urlToImage": "https://static.toiimg.com/imagenext/toiblogs/photo/blogs/wp-content/uploads/2022/03/Stone-clinic.png", "publishedAt": "2022-03-13T16:14:48Z", "content": "Arthritis is a silent, insidious, and painful joint disorder that ruins many lives. In the US, its the most common cause of disability. The good news is, we have learned that many cases of arthritis … [+6132 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Terri-Ann Williams", "title": "I’m a nutritionist and here’s six ways to cut back on sugar and blast belly fat fast... - The US Sun", "description": "", "url": "https://www.the-sun.com/health/4884251/nutritionist-ways-cut-back-sugar-lose-belly-fat/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/03/NINTCHDBPICT000710551081-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-03-13T15:43:20Z", "content": "WHO doesn't love sugar? Whether it's with a cuppa, the jam on your scone or that 11am chocolate biscuit, it is truly delicious.\r\nBut consuming too much sugar increases your risk of being overweight, … [+4925 chars]"}, {"source": {"id": null, "name": "NewsDio"}, "author": "Danish", "title": "How Your Dentist Helps Maintain Your Overall Health - NewsDio", "description": "Many Canadians appreciate the importance of maintaining good oral health. In 2019, nearly three-quarters of Canadians saw a dental professional within the past year. Almost two-thirds of the population also had dental insurance, which helped with the costs. A…", "url": "https://newsdio.com/how-your-dentist-helps-maintain-your-overall-health/175178/", "urlToImage": "https://newsdio.com/wp-content/uploads/2022/03/health.png", "publishedAt": "2022-03-13T15:13:00Z", "content": "Many Canadians appreciate the importance of maintaining good oral health. In 2019, nearly three-quarters of Canadians saw a dental professional within the past year. Almost two-thirds of the populati… [+3860 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: All you need to know about the next normal that experts are preparing for - Times of India", "description": "The pandemic has been with us for three years almost and it is here to stay. With a substantial number of cases still coming up, there is no end in sight, but, it cannot be denied that the number of cases have decreased and so has the intensity of the current…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-all-you-need-to-know-about-the-next-normal-that-experts-are-preparing-for/photostory/90170727.cms", "urlToImage": "https://static.toiimg.com/photo/90170989.cms", "publishedAt": "2022-03-13T13:30:00Z", "content": "The director of the National Institute of Allergy and Infectious Diseases. Dr. Anthony Fauci categorizes the pandemic into five phases. The first being the pandemic itself, in which the entire world … [+841 chars]"}, {"source": {"id": null, "name": "Montreal Gazette"}, "author": "Jill Barker", "title": "Fitness: Which is the best workout to lose pounds — weights or cardio? - Montreal Gazette", "description": "A quick overview of the science doesn’t make it any easier to take sides in this debate.", "url": "https://montrealgazette.com/health/diet-fitness/fitness-which-is-the-best-workout-to-lose-pounds-weights-or-cardio", "urlToImage": "https://smartcdn.gprod.postmedia.digital/montrealgazette/wp-content/uploads/2022/03/afp_324n7al.jpg", "publishedAt": "2022-03-13T13:02:36Z", "content": "A quick overview of the science doesnt make it any easier to take sides in this debate. \r\nWeight training and cardio both have advantages on their own when it comes to weight loss, but a comprehensiv… [+6885 chars]"}, {"source": {"id": null, "name": "LancsLive"}, "author": "Neil Shaw, Melissa Major", "title": "Symptoms of new Deltacron 'stealth' variant as hospitalisations rise - Lancs Live", "description": "Cases are rising across the UK with an increase in people going into hospitals", "url": "https://www.lancs.live/news/uk-world-news/symptoms-new-deltacron-stealth-variant-23374482", "urlToImage": "https://i2-prod.lancs.live/incoming/article23345002.ece/ALTERNATES/s1200/2_JS254813473.jpg", "publishedAt": "2022-03-13T12:56:06Z", "content": "Despite Brits being told to live with Covid, the number of hospitalisation and cases have been increasing in recent days, with experts saying this was to be expected.\r\nThis comes as doctors have issu… [+2640 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Here's What a Migraine Feels Like, Say Physicians — Eat This Not That - Eat This, Not That", "description": "Migraines can be more than just an inconvenience, they can be seriously debilitating and lay you up for days. Here's how to help prevent one.", "url": "http://www.eatthis.com/news-heres-what-a-migraine-feels-like-say-physicians/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/01/woman-covid-migraine.jpg?quality=82&strip=all", "publishedAt": "2022-03-13T12:46:07Z", "content": "Anyone who's had a migraine knows that sickening stomach feeling that can cause you to stay in bed for hours because you're too nauseous to move. Migraines can be more than just an inconvenience, the… [+4483 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Harriet Whitehead", "title": "How to sleep: The high protein foods you may need to avoid before bed - Express", "description": "SLEEPING through the night is not something everyone is always able to do, and there is a lot of advice to be found around improving your quality of sleep, and adopting healthy sleep routines. This may include avoiding high protein foods straight before bed.", "url": "https://www.express.co.uk/life-style/health/1579886/how-to-sleep-avoid-high-protein-foods-steak-chicken-before-bed", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579886.jpg", "publishedAt": "2022-03-13T12:23:02Z", "content": "The charity adds: “Diet is also multifaceted. It isn’t just one food; instead, it is cumulative, affected by when, what, and how much we eat throughout a day and over weeks, months, and years.\r\n“Indi… [+460 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Ferozan Mast", "title": "If You Do This Every Morning, Get Checked For Diabetes — Eat This Not That - Eat This, Not That", "description": "According to the CDC, there are 37.3 million people in the U.S. with diabetes. Here are five signs of diabetes you should never ignore.", "url": "http://www.eatthis.com/news-if-you-do-this-every-morning-get-checked-for-diabetes/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/media/images/ext/167963949/diabetes-sugar.jpg?quality=82&strip=all", "publishedAt": "2022-03-13T12:15:35Z", "content": "According to the CDC, there are 37.3 million people in the U.S. with diabetes: Type 1 diabetes is also known as juvenile-onset diabetes and typically appears in adolescence, while type 2the most comm… [+3792 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": "Cornelius", "title": "It’s still too early to classify Covid-19 as an endemic disease in Brazil, say experts - The Goa Spotlight", "description": "O Ministry of Health studies downgrading Covid-19 to endemic status in Brazil, which would mean, in theory, that the disease is under control and that the population can live with new case", "url": "https://thegoaspotlight.com/its-still-too-early-to-classify-covid-19-as-an-endemic-disease-in-brazil-say-experts/", "urlToImage": "https://img.r7.com/images/covid-uti-brasil-24032021133005628?dimensions=771x420&", "publishedAt": "2022-03-13T11:34:44Z", "content": "O Ministry of Health studies downgrading Covid-19 to endemic status in Brazil, which would mean, in theory, that the disease is under control and that the population can live with new cases in a punc… [+3254 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "ECMO treatment leads to 'exceptional' lung recovery in severe Covid cases: Study - Mint", "description": "The use of ECMO support for severe COVID-19 can result in exceptional early survival, and these patients who leave the hospital without the need for oxygen therapy are very likely to remain alive and well 1 year later, say researchers", "url": "https://www.livemint.com/science/ecmo-treatment-leads-to-exceptional-lung-recovery-in-severe-covid-cases-study-11647167965815.html", "urlToImage": "https://images.livemint.com/img/2022/03/13/600x338/Virus-Outbreak-China-1_1647013376303_1647169930599.jpg", "publishedAt": "2022-03-13T11:13:54Z", "content": "Patients with severe Covid-19, if treated with extracorporeal membrane oxygenation (ECMO), may see a major improvement in lung recovery, making their return to normal lives much faster, a study, publ… [+2071 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Philip Lewis", "title": "Cancer affects dietary habits. Here's how customised nutrition helps in recovery - Global Circulate", "description": "For patients with cancer, good nutrition is crucial, as consuming the right staples can help improve treatment outcomes and quality of life", "url": "https://globalcirculate.com/cancer-affects-dietary-habits-heres-how-customised-nutrition-helps-in-recovery/", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/12/cancer-640.jpg", "publishedAt": "2022-03-13T10:36:47Z", "content": "For patients with cancer, good nutrition is crucial, as consuming the right staples can help improve treatment outcomes and quality of life\r\nCancer can take a major toll on a person and often affects… [+4885 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Covid-19 pandemic and mental health concerns on Twitter: Here's what study suggests - Hindustan Times", "description": "The investigators collected Covid-19 related tweets between Marth 5, 2020, and January 31, 2021. The eligible tweets were compared with the US daily Covid-19 case counts to reveal a potential correlation.", "url": "https://www.hindustantimes.com/photos/lifestyle/covid19-pandemic-and-mental-health-concerns-on-twitter-here-s-what-study-suggests-101647166788149.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/13/1600x900/charlesdeluvio-FdDkfYFHqe4-unsplash_1647167313663_1647167324981.jpg", "publishedAt": "2022-03-13T10:29:05Z", "content": "According to a study from the University of Rochester, the COVID-19 pandemic had a significant impact on mental health concerns on Twitter in the US, and certain groups of people, such as males and w… [+3598 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Cancer Drug Treatment May Combat Tuberculosis Infection, Finds Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Researchers have found an unexpected link between tuberculosis and cancer, leading to new drug treatments for the bacterial disease that kills more than 1.5 million people each year globally. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/health/news/2022-03-13-cancer-drug-treatment-may-combat-tuberculosis-infection", "urlToImage": "https://s.w-x.co/in-cancer_0.jpg", "publishedAt": "2022-03-13T10:17:13Z", "content": "Researchers have found an unexpected link between tuberculosis and cancer, leading to new drug treatments for the bacterial disease that kills more than 1.5 million people each year globally.\r\nThe st… [+2750 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Izzie Deibe", "title": "High blood pressure symptoms: The six signs your hypertension could be serious - Express", "description": "HIGH BLOOD PRESSURE, also known as hypertension, increases your risk of heart attack and stroke. Here are the six signs your blood pressure could be serious.", "url": "https://www.express.co.uk/life-style/health/1578199/high-blood-pressure-symptoms-signs-hypertension-emergency-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1578199.jpg", "publishedAt": "2022-03-13T10:15:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is Nordic Diet and how does it help prevent cardiovascular diseases - Times of India", "description": "Nordic diet refers to a healthy diet which consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognized as extremely healthy, tasty, and sustainable.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/what-is-nordic-diet-and-how-it-helps-prevent-cardiovascular-diseases/photostory/90183708.cms", "urlToImage": "https://static.toiimg.com/photo/90183720.cms", "publishedAt": "2022-03-13T09:57:30Z", "content": "Nordic diet refers to a healthy diet that consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognised as extremely healthy, tasty, and sustainable. The diet is adapted t… [+814 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Music combined with auditory beat stimulation can reduce anxiety: Study - Hindustan Times", "description": "Anxiety has been steadily increasing, particularly in the adolescent and young adult populations, over recent decades. Studies have previously shown that listening to music can reduce anxiety, perhaps even more effectively than some anti-anxiety medications. …", "url": "https://www.hindustantimes.com/lifestyle/health/music-combined-with-auditory-beat-stimulation-can-reduce-anxiety-study-101647164819972.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/13/1600x900/Mp3_player_1646369764673_1647164921069.jpg", "publishedAt": "2022-03-13T09:50:18Z", "content": "Treatments integrating music and auditory beat stimulation are effective in reducing anxiety in some patients, a recent study suggested.\r\nThe study by Adiel Mallik and Frank Russo of the Ryerson Univ… [+3009 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Changes to Calorie Intake, Physical Activity Does Not Prevent Long-term Weight Gain: Research - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Small changes to calorie intake and physical activity levels do not prevent long-term weight gain better than monitoring alone, according to a trial done by researchers.", "url": "https://www.latestly.com/agency-news/health-news-changes-to-calorie-intake-physical-activity-does-not-prevent-long-term-weight-gain-research-3467574.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/03/bjkbbbbbbbbbbbbbbbbbbbbbbbbbbbkkkkkkkkkkkkkkkkkkkkkkkkkkk20220313092145-588x441.jpg", "publishedAt": "2022-03-13T09:38:21Z", "content": "Washington [US], March 13 (ANI): Small changes to calorie intake and physical activity levels do not prevent long-term weight gain better than monitoring alone, according to a trial done by researche… [+2451 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Protein consumption from multiple sources may lower risk of High BP - PTC News", "description": "The following markup is a basic AMP page.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://amp.dev/static/img/sharing/docs-guide-600x314.png", "publishedAt": "2022-03-13T09:31:05Z", "content": "Toggle Sidebar\r\nToggle SidebarThe following markup is a basic AMP page.\r\n&lt;!doctype html&gt;&lt;htmlamplang=\"en\"&gt;&lt;head&gt;&lt;metacharset=\"utf-8\"&gt;&lt;scriptasyncsrc=\"https://cdn.ampproject… [+2805 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Man who Had Stroke Developed Black Hair on Tongue, Read about the Peculiar Condition - News18", "description": "Black Hairy Tongue is known as lingua villosa nigra. It gives the tongue a dark, furry appearance.", "url": "https://www.news18.com/news/buzz/man-who-had-stroke-developed-black-hair-on-tongue-read-about-the-peculiar-condition-4868675.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-2022-03-13t133802.133-164715902816x9.jpg", "publishedAt": "2022-03-13T08:10:39Z", "content": "A recent report has highlighted the bizarre medical condition known as black hairy tongue or BHT. The case came to light when a man visited a dermatology clinic after the top of his tongue became coa… [+2417 chars]"}, {"source": {"id": null, "name": "MyLondon"}, "author": "Helena Vesty, Lucy Williamson", "title": "The signs you might have an unhealthy gut - and what you can do about it - My London", "description": "Trillions of bacteria live in our guts - and it's important to keep them happy", "url": "https://www.mylondon.news/news/health/problem-poos-disturbed-sleep-bad-23349439", "urlToImage": "https://i2-prod.mylondon.news/news/health/article22789549.ece/ALTERNATES/s1200/1_woman-g9fc9add5f_1920.jpg", "publishedAt": "2022-03-13T08:00:00Z", "content": "When you're gut is happy and healthy, the rest of your body will usually follow suit. There have also been demonstrated links between gut health and mood, mental health, endocrine disorders, skin con… [+3430 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "COVID-19 now less deadly than flu, says an expert - msnNOW", "description": "According to infectious diseases expert Professor Paul Hunter, COVID-19 now could be less deadly than flu in the UK.", "url": "https://zeenews.india.com/health/covid-19-now-less-deadly-than-flu-says-an-expert-2444861", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAUZTGE.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-03-13T07:44:13Z", "content": "© Provided by Zee NewsLondon: Covid-19 now could be less deadly than flu in the UK, infectious diseases expert Professor Paul Hunter said, although he warned another variant could still change this. … [+1176 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Video Desk", "title": "Mental Health Tips: How Can Students Calm Their Exam Results Anxiety And Stress? Watch - India.com", "description": "Stressing and panicking  over exam results is a very normal phenomenon and is seen is seen in almost every student who has taken a test or exam. So, in this video, we will be suggesting you a few tips to soothe and calm down your stress and anxiety levels. Wa…", "url": "https://www.india.com/video-gallery/mental-health-tips-how-can-students-calm-their-exam-results-anxiety-and-stress-watch-5276077/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/HOW-to-deal-with-exam-anxiety.jpg", "publishedAt": "2022-03-13T06:45:00Z", "content": "Mental Health Tips: CBSE is soon going to declare the results of class 10th and 12th Term 1 exams. However, the confirmed date of the same is not yet officially revealed. While some students are eage… [+748 chars]"}, {"source": {"id": null, "name": "Boston Herald"}, "author": "Dr. John De Jong", "title": "Keeping an eye on bird flu outbreak - Boston Herald", "description": "If this H5N1 strain truly became a serious public health concern, the authorities would make sure that the public was well aware of the prevalence and risk and further precautions would be implemen…", "url": "https://www.bostonherald.com/2022/03/13/keeping-an-eye-on-bird-flu-outbreak/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2022/03/AP21007404919305.jpg?w=1024&h=683", "publishedAt": "2022-03-13T05:21:22Z", "content": "My cousin lives in a more rural area and raises chickens primarily as pets, but he and his wife do consume the eggs and share some with their friends and neighbors. He informs me that there seems to … [+2562 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "602,350 Americans died of cancer in 2020: CDC - Ahmedabad Mirror", "description": "A total of 602,350 people died of cancer in the US in 2020, but fatality rates due to the disease have continued to drop in the country, according to the US Centers for Disease Control and Prevention (CDC).\n\nCancer remained the second leading cause of death i…", "url": "https://ahmedabadmirror.com/602350-americans-died-of-cancer-in-2020-cdc/81824488.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1646991468760.jpg-org", "publishedAt": "2022-03-13T04:44:57Z", "content": "A total of 602,350 people died of cancer in the US in 2020, but fatality rates due to the disease have continued to drop in the country, according to the US Centers for Disease Control and Prevention… [+712 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "3 Daily Habits That Help Prevent Cancer Without You Realizing It - Code List", "description": "The Cancer It is one of the main causes of death worldwide, since around 10 million deaths are registered annually, and although the various types of this condition can appear due to a mixture of factors, and sometimes it is even inevitable due to genetics, b…", "url": "https://codelist.biz/2022/03/13/3-daily-habits-that-help-prevent-cancer-without-you-realizing-it/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/3/12/f1280x720-35364_167039_5050.jpg", "publishedAt": "2022-03-13T02:37:20Z", "content": "The Cancer It is one of the main causes of death worldwide, since around 10 million deaths are registered annually, and although the various types of this condition can appear due to a mixture of fac… [+2507 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Difference between animal and plant protein and which is healthier - Times of India", "description": "When talking about protein intake, we normally assume animal meat as the basic source of protein and are unaware of the fact that there are several veg foods that are rich in protein too! The main difference lies in the fact that plant protein has fewer amino…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/difference-between-animal-and-plant-protein-and-which-is-healthier/photostory/90176314.cms", "urlToImage": "https://static.toiimg.com/photo/90176327.cms", "publishedAt": "2022-03-13T02:30:00Z", "content": "Vegetables are full of vitamins and minerals and have lesser calories than meat or egg. However, they don’t contain as much protein per serving as meat. In addition, the proteins that they do contain… [+432 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": "Cornelius", "title": "Anti-inflammatory reduces death of hospitalized with rheumatoid arthritis - The Goa Spotlight", "description": "posted on 04/03/2022 06:00 (credit: JOSEP LAGO) An anti-inflammatory used to treat rheumatoid arthritis reduced the risk of death by 13% in hospitalized patients with the severe form of covid-19. The", "url": "https://thegoaspotlight.com/anti-inflammatory-reduces-death-of-hospitalized-with-rheumatoid-arthritis/", "urlToImage": "https://midias.correiobraziliense.com.br/_midias/jpg/2021/08/04/675x450/1_cbifot040820214978-25593316.jpg?20220303173634?20220303173634", "publishedAt": "2022-03-12T23:47:34Z", "content": "posted on 04/03/2022 06:00\r\n(credit: JOSEP LAGO)\r\nAn anti-inflammatory used to treat rheumatoid arthritis reduced the risk of death by 13% in hospitalized patients with the severe form of covid-19. T… [+3309 chars]"}, {"source": {"id": null, "name": "Newsghana.com.gh"}, "author": "https://www.facebook.com/newsghana", "title": "Desist From Overly Stressing Yourselves At Home, Work - Cardiologist - News Ghana", "description": "Dr. Yugal Kishore Mishra, a Chief Cardiovascular Surgeon and Head of Clinical Services, of the Manipal Hospitals, India, has cautioned females against overly stressing themselves, at work and home which could lead to cardiovascular diseases. He said cardiovas…", "url": "https://newsghana.com.gh/desist-from-overly-stressing-yourselves-at-home-work-cardiologist/", "urlToImage": "https://newsghana.com.gh/wp-content/uploads/2022/03/Health-Women-Stress.jpg", "publishedAt": "2022-03-12T23:04:25Z", "content": "Dr. Yugal Kishore Mishra, a Chief Cardiovascular Surgeon and Head of Clinical Services, of the Manipal Hospitals, India, has cautioned females against overly stressing themselves, at work and home wh… [+3417 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "The Brain-Boosting Foods That Will Help You Get The Most From Your Cerebral Cores, According To Harvard Expert - Optic Flux", "description": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren't eating enough of premised on her experience with hundreds of individuals – consuming them may enhance your mood, enha…", "url": "https://www.opticflux.com/the-brain-boosting-foods-that-will-help-you-get-the-most-from-your-cerebral-cores-according-to-harvard-expert/16782/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/12/louis-hansel-phEaeqe555M-unsplash-scaled.jpg", "publishedAt": "2022-03-12T22:24:16Z", "content": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren’t eating enough of premised on her experience with hundreds… [+1945 chars]"}, {"source": {"id": null, "name": "VENTS Magazine"}, "author": "RJ Frometa", "title": "Does Whey Protein Help in Building Muscles? - - VENTS Magazine", "description": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some pl", "url": "https://ventsmagazine.com/2022/03/12/does-whey-protein-help-in-building-muscles/", "urlToImage": null, "publishedAt": "2022-03-12T21:58:06Z", "content": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some p… [+3724 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Eating Lentils, Grains And Nuts Add 10 Years To Your Life, Says Study - Indiatimes.com", "description": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a longer life-span - marking an improvement of 10 years than th…", "url": "https://www.indiatimes.com/technology/science-and-future/eating-lentils-nuts-extend-life-study-564154.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage18-copy_6229e96c2c834.jpg", "publishedAt": "2022-03-12T20:51:25Z", "content": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a l… [+2028 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "In a new stem cell study, a cure for Type 1 diabetes appears tantalizingly close - Salon", "description": "One researcher called the stem cell study's findings \"transformational\"", "url": "https://www.salon.com/2022/03/12/diabetes-stem-cell-cure/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/type-1-diabetes-management-supplies-0228221.jpg", "publishedAt": "2022-03-12T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Catholictranscript.org"}, "author": "Yvonne Lipsey", "title": "Understand what Acanthosis Nigricans causes dark spots on the skin - The Catholic Transcript", "description": "We all know that all it takes are small changes in our bodies to be...", "url": "https://www.catholictranscript.org/understand-what-acanthosis-nigricans-causes-dark-spots-on-the-skin/", "urlToImage": null, "publishedAt": "2022-03-12T18:45:58Z", "content": "We all know that all it takes are small changes in our bodies to be aware of the symptoms. After all, it is important to identify possible diseases and conditions as early as possible. So if you’ve e… [+1819 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Know everything about Cervical Cancer - Rising Kashmir", "description": null, "url": "https://www.risingkashmir.com/displaynews.aspx?news=102429", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637826770727623748_download_-_2022-03-12T234737.883.jpg", "publishedAt": "2022-03-12T18:29:18Z", "content": "Cervical Canceris a type of cancer that occurs in the cells of the cervix —the lower part of the uterus that connects to the vagina. Various strains of the Human Papilloma virus (HPV),a sexually tran… [+13393 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Agencies", "title": "COVID vaccination benefits cancer patients, claims study - India TV News", "description": "The results showed that most cancer patients had seroconverted, meaning they developed antibodies after receiving the vaccine. Overall, 71.3 per cent of patients seroconverted after the first dose, 90.3 per cent after the second. There were, however, differen…", "url": "https://www.indiatvnews.com/health/covid-vaccination-benefits-cancer-patients-claims-study-2022-03-12-764078", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-2022-03-12t234348-1647108833.jpg", "publishedAt": "2022-03-12T18:20:34Z", "content": "It has been unclear if cancer patients considered immunocompromised could prevent or lessen the risk of COVID-19 infection through vaccination. Moffitt Cancer Center researchers have put together one… [+2600 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Healthy eating and diet tips for women - Rising Kashmir", "description": "Rising Kashmir: Leading English newspaper in Jammu and Kashmir", "url": "https://www.risingKashmir.com/", "urlToImage": "https://www.risingkashmir.com/userfiles/image/safe_imagenow.png", "publishedAt": "2022-03-12T18:17:05Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Losartan off the market: how to proceed if you need the drug | Health - Play Crazy Game", "description": "disclosure Losartan has been withdrawn from the market Sanofi Medley's announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among patients who use the drug to treat high blood pressure or hear…", "url": "https://playcrazygame.com/2022/03/12/losartan-off-the-market-how-to-proceed-if-you-need-the-drug-health/", "urlToImage": "https://i0.statig.com.br/bancodeimagens/6h/2r/5w/6h2r5ws8vnhqfdcbzv91fy3w0.jpg", "publishedAt": "2022-03-12T17:14:25Z", "content": "disclosureLosartan has been withdrawn from the market\r\nSanofi Medley’s announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among pa… [+5007 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rebecca Sohn", "title": "Glaucoma: Cause, symptoms, treatment and prevention - Livescience.com", "description": "The cause of glaucoma is unknown, but it is accompanied by high eye pressure.", "url": "https://www.livescience.com/glaucoma-facts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JhVBi2U5wmR7Zka2tPkypZ-1200-80.jpg", "publishedAt": "2022-03-12T16:37:13Z", "content": "Glaucoma is a group of eye diseases that can cause vision loss and blindness. Though the cause is not entirely known, many people with glaucoma have high eye pressure. Excess fluid builds up inside t… [+10576 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Dexamethasone at discharge for COVID-19 does not reduce readmission, mortality - Healio", "description": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\n      Cheng-Wei Huang, MD, a physician at Kaiser Permanente Los An…", "url": "https://www.healio.com/news/infectious-disease/20220311/dexamethasone-at-discharge-for-covid19-does-not-reduce-readmission-mortality", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/other/steroids_shutterstock.jpg", "publishedAt": "2022-03-12T16:02:18Z", "content": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\r\nCheng… [+1958 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Impact of prior underinsurance on cervical cancer screening among Davidson County, Tennessee, women diagnosed with invasive cervical cancer, 2008–2018 - BMC Women's Health - BioMed Central", "description": "Introduction We sought to investigate the association between insurance coverage history and cervical cancer screening among Davidson County, Tennessee, women diagnosed with incident cervical cancer. Methods We reviewed medical records of women diagnosed with…", "url": "https://bmcwomenshealth.biomedcentral.com/articles/10.1186/s12905-022-01638-9", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12905.jpg", "publishedAt": "2022-03-12T15:08:22Z", "content": null}, {"source": {"id": null, "name": "Oswego Daily News"}, "author": null, "title": "Oswego County Health Department Offers Opportunities To Vaccinate Pets - Oswego Daily News", "description": "The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative measures are subject to change depending on COVID-19 virus activity and resp…", "url": "https://oswegocountytoday.com/news/oswego-county-health-department-offers-opportunities-to-vaccinate-pets/", "urlToImage": "https://i0.wp.com/oswegocountytoday.com/wp-content/uploads/2017/03/rabies-princess.jpg?fit=1200%2C1114&ssl=1", "publishedAt": "2022-03-12T14:58:12Z", "content": "File photo 2017: Princess didnt flinch as she got her shot.\r\nOSWEGO COUNTY The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative mea… [+3291 chars]"}, {"source": {"id": null, "name": "Omegaunderground.com"}, "author": "Laila Azzahra", "title": "X Important Strategies for Preventing UTIs - Omega Underground", "description": "Urinary tract infections range from uncomfortable to painful, so it’s best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of…", "url": "https://omegaunderground.com/x-important-strategies-for-preventing-utis/", "urlToImage": "https://omegaunderground.com/wp-content/uploads/2022/03/X-Important-Strategies-for-Preventing-UTIs-01.jpeg", "publishedAt": "2022-03-12T14:22:09Z", "content": "Urinary tract infections range from uncomfortable to painful, so its best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of a few important strategies.\r\n… [+4740 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "New study sheds light on how blood clots are formed during wound healing - The Siasat Daily", "description": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing. The research was published in the journal, 'Science Advances'. The research examined the behaviour of platelets at a wound site, s…", "url": "https://www.siasat.com/new-study-sheds-light-on-how-blood-clots-are-formed-during-wound-healing-2289858/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/blood-clots-_mar12.jpg", "publishedAt": "2022-03-12T13:40:00Z", "content": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing.\r\nThe research was published in the journal, ‘Science Advances’.\r\nThe r… [+1910 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "What to eat to sleep well? - Play Crazy Game", "description": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other. Between dimming the lights (and also the brightness of the tablet), av…", "url": "https://playcrazygame.com/2022/03/12/what-to-eat-to-sleep-well/", "urlToImage": "https://www.cenariomt.com.br/wp-content/uploads/2022/03/food-g424a820c5_1920.jpg", "publishedAt": "2022-03-12T12:01:57Z", "content": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other.\r\nBetween d… [+921 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "The Best Eating Habit To Prevent Dementia, New Study Finds — Eat This Not That - Eat This, Not That", "description": "Try introducing foods to your diet that strengthen brain health and cognitive function to prevent possible dementia in the future.", "url": "http://www.eatthis.com/eating-habit-to-prevent-dementia/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/eating-fiber-foods.jpg?quality=82&strip=all", "publishedAt": "2022-03-12T12:00:53Z", "content": "The foods that you eat can affect your life in so many ways. Not only do they help determine how much energy you have throughout the day, how your immune system functions, and even how well you sleep… [+2585 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Prajwal Wele", "title": "Serious mental illness may cause high-risk heart disorders, change health behaviours, says expert - News9 LIVE", "description": "The researchers believed this is the first study to examine estimated 30-year (lifetime)...", "url": "https://www.news9live.com/health/covid-19/serious-mental-illness-may-cause-high-risk-heart-disorders-change-health-behaviours-says-expert-158713", "urlToImage": "https://media.news9live.com/h-upload/2022/03/12/255401-operation-doctor-medical-9747111zon.jpg", "publishedAt": "2022-03-12T11:53:18Z", "content": "A study published in the journal of the American Heart Association reported that those diagnosed with bipolar disorder, schizophrenia or schizoaffective disorder might have a higher risk of cardiovas… [+2721 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Fatty liver disease: Subtle personality may signal ‘the liver is struggling’ - Verve Times", "description": "The British Liver Trust (BLT) says liver problems develop silently with no obvious symptoms in the early stages yet the disease is largely preventable through lifestyle changes. The disease tends to develop in people who are overweight or obese or ha", "url": "https://vervetimes.com/fatty-liver-disease-subtle-personality-may-signal-the-liver-is-struggling/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579556.jpg", "publishedAt": "2022-03-12T11:21:09Z", "content": "The British Liver Trust (BLT) says liver problems develop silently with no obvious symptoms in the early stages yet the disease is largely preventable through lifestyle changes. The disease tends to … [+2584 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Superadmin", "title": "Covid causing lot of serious kidney issues: Expert - United News of India", "description": "", "url": "https://www.uniindia.com/story/Covid-causing-lot-of-serious-kidney-issues-Expert", "urlToImage": "https://www.uniindia.com/public/default-image/default-730x400.png", "publishedAt": "2022-03-12T10:43:00Z", "content": "Oscar nominated 'Writing..."}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers say damage to inner ear system can predict fall risk among Alzheimer's patients - ANI News", "description": "Washington [US], March 12 (ANI): A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients' well-documented higher risk of falling.", "url": "https://www.aninews.in/news/science/researchers-say-damage-to-inner-ear-system-can-predict-fall-risk-among-alzheimers-patients20220312160909", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/ddddddddddddddddddfdgdfgdfgdfg20220312095840-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-12T10:39:00Z", "content": "ANI | Updated: Mar 12, 2022 16:09 IST\r\nWashington [US], March 12 (ANI): A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients' well-do… [+3960 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study: Antiseptic drug effective for preventing recurrent urinary tract infections - Devdiscourse", "description": "A team of UK researchers, led by clinicians and scientists from Newcastle-upon-Tyne, set out to test if methenamine hippurate is an effective alternative to standard antibiotic treatment for preventing recurrent UTI (urinary tract infection) in women.", "url": "https://www.devdiscourse.com/article/science-environment/1959715-study-antiseptic-drug-effective-for-preventing-recurrent-urinary-tract-infections", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_03_2022_10_13_36_1891236.jpg?width=920&format=jpeg", "publishedAt": "2022-03-12T10:13:37Z", "content": "A team of UK researchers, led by clinicians and scientists from Newcastle-upon-Tyne, set out to test if methenamine hippurate is an effective alternative to standard antibiotic treatment for preventi… [+3244 chars]"}, {"source": {"id": null, "name": "Ummid.com"}, "author": null, "title": "Researchers re-engineer red blood cells to trigger immune system against Covid - ummid.com", "description": "Red blood cell membranes are embedded with SARS-CoV-2 spike proteins, which then form virus-like particles", "url": "https://ummid.com/news/2022/march/12.03.2022/researchers-re-engineer-red-blood-cells-to-trigger-immune-system-against-covid.html", "urlToImage": "https://ummid.com/news/2022/march/12.03.2022/red-blood-cell.jpg", "publishedAt": "2022-03-12T09:33:26Z", "content": "Toronto: Researchers have teamed up to modify red blood cells to transport viral agents which can safely trigger the immune system to protect the body against SARS-CoV-2, creating a promising new veh… [+1505 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Covid deaths in US 10x higher than from seasonal flu: Report - Ahmedabad Mirror", "description": "The US has a long way to go before the pandemic is over as deaths from Covid-19 remain far higher than seasonal respiratory viruses such as the flu, according to a report.\n\nThe 136-page document by the Covid Roadmap Group was authored by a group of two dozen …", "url": "https://ahmedabadmirror.com/covid-deaths-in-us-10x-higher-than-from-seasonal-flu-report/81824207.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1646819291929.jpg-org", "publishedAt": "2022-03-12T08:00:00Z", "content": "The US has a long way to go before the pandemic is over as deaths from Covid-19 remain far higher than seasonal respiratory viruses such as the flu, according to a report.\r\nThe 136-page document by t… [+2487 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Covid signs: Three symptoms experienced by people with long Covid 6 months later - study - Express", "description": "LONG Covid is the extended experience of symptoms of Covid-19. However, it is far more complex than just experiencing Covid for a long period of time, long covid also has its own symptoms that separate it from ‘normal' Covid.", "url": "https://www.express.co.uk/life-style/health/1579494/covid-signs-long-covid-concentration-sleep-exhaustion", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579494.jpg", "publishedAt": "2022-03-12T07:59:00Z", "content": "Since then, things have changed a great deal.\r\nSince then the UK has been through two more national lockdowns, thousands have passed away from the virus, a vaccine has been introduced effectively, an… [+1259 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Wisconsin-Madison: Antivirals, some antibodies, work well against BA.2 omicron variant of COVID-19 virus - India Education Diary", "description": "The antiviral therapies remdesivir, molnupiravir, and the active ingredient in Pfizer’s Paxlovid pill (nirmatrelvir), remain effective in laboratory tests against the BA.2 variant of SARS-CoV-2, the virus that causes COVID-19.The BA.2 variant also re", "url": "https://indiaeducationdiary.in/university-of-wisconsin-madison-antivirals-some-antibodies-work-well-against-ba-2-omicron-variant-of-covid-19-virus/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/uw-logo-color-flush-300x180-2.png", "publishedAt": "2022-03-12T07:24:40Z", "content": "The antiviral therapies remdesivir, molnupiravir, and the active ingredient in Pfizers Paxlovid pill (nirmatrelvir), remain effective in laboratory tests against the BA.2 variant of SARS-CoV-2, the v… [+2616 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Can drinking cow milk help fight Covid infection? - Ahmedabad Mirror", "description": "Cow milk contains proteins with virus inhibiting properties that can help prevent Covid-19 from replicating in a person&#39;s body and cause infection, according to a study.\n\nThe protein lactoferrin is found in the milk of most mammals.\n\nResearchers from the …", "url": "https://ahmedabadmirror.com/can-drinking-cow-milk-help-fight-covid-infection/81823903.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1646645009571.jpg-org", "publishedAt": "2022-03-12T04:05:48Z", "content": "Cow milk contains proteins with virus inhibiting properties that can help prevent Covid-19 from replicating in a person's body and cause infection, according to a study.\r\nThe protein lactoferrin is f… [+2059 chars]"}]}