{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Kalinga TV"}, "author": "IANS", "title": "Mouthwash Can Kill COVID-19 Virus In 30 Seconds - Kalinga TV", "description": "London: Researchers have once again claimed that widely-available mouthwashes have killed Coronavirus, responsible for the Covid-19 disease, within 30 seconds of exposure in laboratory conditions.The study this time from Cardiff University in the UK,", "url": "https://kalingatv.com/nation/mouthwash-can-kill-covid-19-virus-in-30-seconds/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/11/mouthwash.jpg", "publishedAt": "2020-11-18T08:00:00Z", "content": "London: Researchers have once again claimed that widely-available mouthwashes have killed Coronavirus, responsible for the Covid-19 disease, within 30 seconds of exposure in laboratory conditions.\r\nT… [+1900 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "E-cigarette users may have increased susceptibility to COVID-19 - EdexLive", "description": "The main reason to avoid smoking is the risk of cancer, heart disease, emphysema, stroke, diabetes, chronic obstructive pulmonary disorder, and other lung diseases", "url": "https://www.edexlive.com/news/2020/nov/18/e-cigarette-users-may-have-increased-susceptibility-to-covid-19-15939.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/11/18/w600X390/e-cigarette-1301664_960_720.jpg", "publishedAt": "2020-11-18T07:38:00Z", "content": "In a controlled study of smokers, nonsmokers, and e-cigarette users, University of North Carolina School of Medicine researchers found that e-cigarette users exhibited significantly altered immune re… [+4512 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Reuters", "title": "WHO launches strategy to accelerate elimination of cervical cancer - The Hindu", "description": "“We want countries to aim for 90% of girls under 15 vaccinated, 70% of eligible women identified and treated, 90% of women with invasive cancer treated,” Dr. Princess Nothemba Simelela from South Africa, WHO assistant director general, told a news briefing.", "url": "https://www.thehindu.com/sci-tech/health/who-launches-strategy-to-accelerate-elimination-of-cervical-cancer/article33123325.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/sikiy4/article33123324.ece/ALTERNATES/LANDSCAPE_615/FRUITSOFLABORWOMEN", "publishedAt": "2020-11-18T06:38:56Z", "content": "Vaccinating nine in 10 girls under 15 against cervical cancer, and improved screening and treatment of women could reduce infections by 40% and save 5 million lives by 2050, the World Health Organiza… [+1662 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Immunity to the Coronavirus may last years, new data hint - ETHealthworld.com", "description": "Eight months after infection, most people who have recovered still have enough immune cells to fend off the virus and prevent illness, the new data show. A slow rate of decline in the short term suggests, happily, that these cells may persist in the body for …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/immunity-to-the-coronavirus-may-last-years-new-data-hint/79276161", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-79276161,imgsize-147848,width-800,height-434,overlay-ethealthworld/immunity-to-the-coronavirus-may-last-years-new-data-hint.jpg", "publishedAt": "2020-11-18T06:07:21Z", "content": "By Apoorva MandavilliHow long might immunity to the coronavirus last? Years, maybe even decades, according to a new study the most hopeful answer yet to a question that has shadowed plans for widespr… [+6373 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "Short bursts of exercise significantly improve metabolic health: Study - BusinessLine", "description": "The study indicates 12 minutes of acute cardiopulmonary exercise impacted more than 80% of circulating metabolites, including pathways linked to a wide range of favourable health outcomes.", "url": "https://www.thehindubusinessline.com/news/science/short-bursts-of-exercise-significantly-improve-metabolic-health-study/article33123079.ece", "urlToImage": "https://www.thehindubusinessline.com/todays-paper/tp-opinion/h54nd7/article32691148.ece/ALTERNATES/LANDSCAPE_615/bl25Think2DCGSE7PQQQ93jpgjpg", "publishedAt": "2020-11-18T06:04:05Z", "content": "According to a study by the Massachusetts General Hospital (MGH), short bursts of physical exercise induce changes in the body's levels of metabolites that may help gauge an individual's cardiometabo… [+2446 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID-19 vaccines: 5 false myths to avoid and break away from - Times of India", "description": "While scientists and medical professionals are working hard to develop a clinically approved vaccine to treat patients and contain the spread of the virus, people are struggling to keep the vaccine-related mistruths at bay.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-19-vaccines-5-false-myths-to-avoid-and-break-away-from/photostory/79262095.cms", "urlToImage": "https://static.toiimg.com/photo/79262121.cms", "publishedAt": "2020-11-18T05:30:00Z", "content": "Surely, scientists and researchers are burning the midnight oil to develop a vaccine. Additionally, there's also an urgency in the need for a possible cure. However, just because the progress on deve… [+256 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Coronavirus mutations appearing in Siberia: Russian scientists - WION", "description": "It has been almost a year since the coronavirus pandemic took over the world and affected millions of lives around the globe. While the world is getting used to the new normal now and hoping for a coronavirus vaccine as soon as possible, Russian scientists ha…", "url": "https://www.wionews.com/science/coronavirus-mutations-appearing-in-siberia-russian-scientists-343820", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/10/10/164264-the-novel-coronavirus.jpg", "publishedAt": "2020-11-18T05:24:49Z", "content": "It has been almost a year since the coronavirus pandemic took over the world and affected millions of lives around the globe. While the world is getting used to the new normal now and hoping for a co… [+1920 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Retinas: New potential clues in diagnosing, treating Alzheimer's - ANI News", "description": "Washington [US], November 18 (ANI): A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found in the back of the eye - that are more affected by Alzheimer's disease than other areas.", "url": "https://www.aninews.in/news/health/retinas-new-potential-clues-in-diagnosing-treating-alzheimers20201118102937", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/brain_feb16_fmjBxGn_qdEpEiY_xTCd2Q3-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-18T05:01:42Z", "content": "ANI | Updated: Nov 18, 2020 10:29 IST\r\nWashington [US], November 18 (ANI): A study led by the Cedars-Sinai Department of Neurosurgery has identified certain regions in the retina - the lining found i… [+3399 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Chinese Covid-19 Vaccine Candidate CoronaVac Appears Safe, Induces Immune Response, Preliminary Study Fin... - News18", "description": "According to the findings of the phase 1/2 randomised clinical trial, published in The Lancet Infectious Diseases journal, the vaccine candidate could induce an antibody response in participants within 28 days of the first immunisation, by giving two doses 14…", "url": "https://www.news18.com/news/world/chinese-covid-19-vaccine-candidate-coronavac-appears-safe-induces-immune-response-preliminary-study-finds-3091583.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/11/1605418527_vaccine-1.jpg", "publishedAt": "2020-11-18T04:59:16Z", "content": "Results from an early-phase clinical trial of a Chinese vaccine candidate, CoronaVac, revealed that the formulation appears safe and induces an antibody response in healthy volunteers aged 18 to 59 y… [+4454 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Many older adults won't treat their depression: Study - Daijiworld.com", "description": "", "url": "https://www.daijiworld.com/news/newsDisplay.aspx?newsID=772625", "urlToImage": "http://www.tvdaijiworld.com/images6/asha_181120_dprssn.jpg", "publishedAt": "2020-11-18T04:56:46Z", "content": "New York, Nov 18 (IANS): Nearly two-third (61 percent) of the people in the US aged 65 or more, who have concerns about having depression, will not seek treatment, said researchers, including one of … [+1291 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com | Edited by Karan Manral", "title": "Chapare virus: All about the deadly virus that can spread between humans - Hindustan Times", "description": "The United States’ Centers for Disease Control and Prevention (CDC) announced on Monday that the deadly virus, which causes haemorrhagic fever like Ebola, can now also be transmitted through human-to-human contact.", "url": "https://www.hindustantimes.com/world-news/chapare-virus-all-about-the-deadly-virus-that-can-spread-between-humans/story-B0grsY8R7eGHarP7VQWOQJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/18/Pictures/_466e537a-2958-11eb-bd4c-84783e11e201.jpg", "publishedAt": "2020-11-18T04:45:30Z", "content": "At a time when countries across the globe are struggling to contain the Covid-19 pandemic, the United States’ Centers for Disease Control and Prevention (CDC) has announced that a deadly virus, which… [+1980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "World COPD Day: Here’s everything you need to know about the chronic lung disease - The Indian Express", "description": "This year, the theme of World COPD Day, observed on November 18, is ‘Living well with COPD - Everybody, Everywhere’", "url": "https://indianexpress.com/article/lifestyle/health/world-copd-day-respiratory-condition-7050562/", "urlToImage": "https://images.indianexpress.com/2020/11/COPD-lungs_1200_getty.jpg", "publishedAt": "2020-11-18T04:30:31Z", "content": "Here's what you need to know about the condition of COPD. (Source: Getty Images/Thinkstock)Chronic Obstructive Pulmonary Disease (COPD) is a debilitating condition that obstructs airflow from the lun… [+3412 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "AFP", "title": "Hard-hit Brazil threatened by second wave of Covid-19 - Deccan Herald", "description": "After struggling for months to get its spiraling Covid-19 death toll under control, Brazil is now threatened by the nightmare scenario that has already shaken the United States and Europe: a second wave. Brazil has been one of the countries hit hardest by the…", "url": "https://www.deccanherald.com/international/hard-hit-brazil-threatened-by-second-wave-of-covid-19-917007.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/brazil-afp-917007-1605672479.jpg", "publishedAt": "2020-11-18T04:07:59Z", "content": "After struggling for months to get its spiraling Covid-19 death toll under control, Brazil is now threatened by the nightmare scenario that has already shaken the United States and Europe: a second w… [+3889 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Coronavirus vaccine update: Sinovac vaccine produces immune response, India looking at storage ways for Pfizer vaccine - India Today", "description": "Coronavirus vaccine update: The Chinese coronavirus vaccine candidate developed by Sinovac Biotech, CoronaVac, has triggered an immune response among volunteers in the clinical trials being conducted in Brazil. Meanwhile, India is looking at ways to manage th…", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/coronavirus-vaccine-update-chinese-sinovac-pfizer-vaccine-in-india-moderna-results-1741782-2020-11-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202011/vaccine_pic_reuters-647x363.png?x4oX51gGUwMtp9WOzlhMZMMl6TDpbQVa", "publishedAt": "2020-11-18T04:02:46Z", "content": "The Chinese coronavirus vaccine candidate developed by Sinovac Biotech, CoronaVac, has triggered an immune response among volunteers in the clinical trials being conducted in Brazil. The development … [+2626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Shots Race Toward Finish Line in 300-Day Science Feat - NDTV", "description": "In early January, about the only thing the world's scientists knew for sure about the novel coronavirus was its genetic profile. Now, some 300 days later, vaccine developers are on the brink of a major victory against a pathogen that's inflicted untold person…", "url": "https://www.ndtv.com/world-news/covid-shots-race-toward-finish-line-in-300-day-science-feat-2326631", "urlToImage": "https://c.ndtvimg.com/2020-11/li5lkjsg_covid-vaccine_625x300_11_November_20.jpg", "publishedAt": "2020-11-18T03:51:45Z", "content": "Bringing a conventional vaccine from inception to market takes more than a decade on average.\r\nIn early January, about the only thing the world's scientists knew for sure about the novel coronavirus … [+7133 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Home oxygen therapy for adults with COPD and ILD: ATS Guidelines - Medical Dialogues", "description": "American Thoracic Society has released latest clinical practice guideline on home oxygen therapy for ...", "url": "https://medicaldialogues.in/critical-care/guidelines/home-oxygen-therapy-for-adults-with-copd-and-ild-ats-guidelines-71536", "urlToImage": "https://medicaldialogues.in/h-upload/2020/11/18/142406-image.jpg", "publishedAt": "2020-11-18T03:45:31Z", "content": "The new guideline was borne out of the 2017 ATS workshop on Optimizing Home Oxygen Therapy data, which \"identified the lack of evidence-based clinical practice guidelines for appropriate use of home … [+2828 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "IANS", "title": "Here’s why night shift workers are at high risk for severe asthma - Times Now", "description": "Symptoms of asthma, such as wheeze and airway whistling, vary considerably, according to the time of day or night.", "url": "https://www.timesnownews.com/health/article/here-s-why-night-shift-workers-are-at-high-risk-for-severe-asthma/683167", "urlToImage": "https://imgk.timesnownews.com/story/asthma_3.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-18T03:32:47Z", "content": "London: In a major study, researchers have revealed that shift workers, especially those working permanently in the night rotation, may be at heightened risk of moderate to severe asthma.\r\nAccording … [+2454 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "REUTERS", "title": "Sinovac’s COVID-19 vaccine induces quick immune response: Study - Times Now", "description": "CoronaVac and four other experimental vaccines developed in China are currently undergoing late-stage trials to determine their effectiveness in preventing COVID-19.", "url": "https://www.timesnownews.com/health/article/sinovac-s-covid-19-vaccine-induces-quick-immune-response-study/683163", "urlToImage": "https://imgk.timesnownews.com/story/coronavirus-vaccine_0.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-18T03:20:11Z", "content": "Singapore/Beijing: Sinovac Biotech’s experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the… [+3934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Hepatitis C drugs shown to inhibit coronavirus enzyme - The Indian Express", "description": "Researchers looked at several well-known drug molecules for potential repurposing efforts. These included three hepatitis C protease inhibitors: telaprevir, narlaprevir and boceprevir.", "url": "https://indianexpress.com/article/explained/hepatitis-c-drugs-for-covid-19-7055349/", "urlToImage": "https://images.indianexpress.com/2020/11/Covid-14.jpg", "publishedAt": "2020-11-18T03:16:13Z", "content": "The heart-shaped SARS-CoV-2 main protease enables the virus to reproduce by cutting long chains of proteins that activate the replication process.(Jill Hemman/ORNL)Several Hepatitis C drugs have been… [+2188 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "Reuters", "title": "Brazil to receive Chinas Sinovac COVID-19 vaccine, eyes Pfizer candidate - Zee Business", "description": "Brazil`s Sao Paulo state is set to begin importing the first of 46 million doses of China`s Sinovac vaccine against COVID-19 this week, while the federal government takes a more cautious approach with a vaccine developed by Pfizer Inc.", "url": "https://www.zeebiz.com/companies/news-brazil-china-sinovac-covid-19-vaccine-pfizer-coronavirus-vaccine-140717", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/default_images/placeholder_image-zeebiz.jpg", "publishedAt": "2020-11-18T02:52:29Z", "content": "Brazil`s Sao Paulo state is set to begin importing the first of 46 million doses of China`s Sinovac vaccine against COVID-19 this week, while the federal government takes a more cautious approach wit… [+1864 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ricardo Brito and Anthony Boadle", "title": "Brazil to receive China's Sinovac COVID-19 vaccine, eyes Pfizer candidate - Yahoo Finance", "description": "Brazil's Sao Paulo state is set to begin importing the first of 46 million doses of China's Sinovac vaccine against COVID-19 this week, while the federal...", "url": "https://news.yahoo.com/brazil-receive-chinas-sinovac-covid-021212104.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/CZmNNyY0vDu.sW.jD5yOQA--~B/aD01MzM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/reuters.com/ab08870b45c625418c37f68ec5d30997", "publishedAt": "2020-11-18T02:12:00Z", "content": "By Ricardo Brito and Anthony Boadle\r\nBRASILIA (Reuters) - Brazil's Sao Paulo state is set to begin importing the first of 46 million doses of China's Sinovac vaccine against COVID-19 this week, while… [+2021 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Covid Vaccine Induces Quick Immune Response Within 4 Weeks: Study - NDTV", "description": "Sinovac Biotech's experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, preliminary trial results showed on Wednesday.", "url": "https://www.ndtv.com/world-news/sinovacs-coronavirus-vaccine-coronavac-induces-quick-immune-response-says-study-2326599", "urlToImage": "https://c.ndtvimg.com/2020-11/td6lfc4o_sinovacs-coronavirus-vaccine-650_625x300_18_November_20.jpg", "publishedAt": "2020-11-18T02:08:18Z", "content": "A man works in a laboratory of Chinese vaccine maker Sinovac Biotech, developing an experimental vaccine.\r\nSINGAPORE/BEIJING: Sinovac Biotech's experimental COVID-19 vaccine CoronaVac triggered a qui… [+4155 chars]"}, {"source": {"id": null, "name": "FXStreet"}, "author": "Dhwani Mehta", "title": "Sinovac's covid vaccine triggers quick immune response after Pfizer’s 90% efficacy - FXStreet", "description": "According to the preliminary trial results released on Wednesday, Sinovac Biotech’s experimental COVID-19 vaccine, CoronaVac, induced a quick immune r", "url": "https://www.fxstreet.com/news/sinovacs-covid-vaccine-triggers-quick-immune-response-after-pfizers-90-efficacy-202011180208", "urlToImage": "https://editorial.fxstreet.com/images/Macroeconomics/Events/Coronavirus/coronavirus7_Large.JPG", "publishedAt": "2020-11-18T02:08:00Z", "content": "According to the preliminary trial results released on Wednesday, Sinovac Biotech’s experimental COVID-19 vaccine, CoronaVac, induced a quick immune response although its effectiveness cannot be dete… [+1051 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": null, "title": "Sinovac's COVID-19 vaccine induces quick immune response - study - Yahoo Eurosport UK", "description": null, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2f23f838-9335-40f2-9531-51deb702d3d0", "urlToImage": null, "publishedAt": "2020-11-18T01:32:00Z", "content": "Yahoo is part of Verizon Media. We and our partners will store and/or access information on your device through the use of cookies and similar technologies, to display personalised ads and content, f… [+646 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "All successful weight loss diets have this one thing in common - Times of India", "description": "Your search for weight loss on the internet and there will be thousands of diets claiming to make you shed extra kilos.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/all-successful-weight-loss-diets-have-this-one-thing-in-common/photostory/79264585.cms", "urlToImage": "https://static.toiimg.com/photo/79264727.cms", "publishedAt": "2020-11-18T01:30:00Z", "content": "There are hundreds of diets on the Internet claiming to make you shed extra kilos. But the thing about all the diets is that not all of them work for everyone. Every body is different and thus everyo… [+345 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Early trial results show Sinovac vaccine triggers immune response - Aljazeera.com", "description": "Findings another boost to hope that vaccines can bring an end to accelerating coronavirus pandemic.", "url": "https://www.aljazeera.com/news/2020/11/18/early-trial-results-show-sinovac-vaccine-triggers-immune-response", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2020/11/2020-09-24T113634Z_1507706441_RC2X4J9NUGFK_RTRMADP_3_HEALTH-CORONAVIRUS-SINOVAC.jpg?resize=1200%2C630", "publishedAt": "2020-11-18T01:11:25Z", "content": "Sinovac Biotechs experimental COVID-19 vaccine CoronaVac triggered a quick immune response but the level of antibodies produced was lower than in people who had recovered from the disease, early tria… [+4547 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "The county with no coronavirus cases (and plenty of suspicion) - Deccan Herald", "description": "Zoom in on the glowing red map of ever-escalating coronavirus cases in the continental United States and you will find one county that has been spared. Only one, from coast to coast. Like a lone house standing after a tornado has leveled a town, Loving County…", "url": "https://www.deccanherald.com/international/the-county-with-no-coronavirus-cases-and-plenty-of-suspicion-916964.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2020/11/18/580835-01-03-916964-1605658830.jpg", "publishedAt": "2020-11-18T00:20:30Z", "content": "Zoom in on the glowing red map of ever-escalating coronavirus cases in the continental United States and you will find one county that has been spared. Only one, from coast to coast.\r\nLike a lone hou… [+9018 chars]"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "MarketScreener", "title": "Sinovac Biotech : Brazil to receive first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute - Marketscreener.com", "description": "Brazil's Butantan Institute\nbiomedical center will receive this week the first doses of\nChina's Sinovac vaccine against COVID-19, its director, Dimas\nCovas, said on Tuesday, speaking remotely in a... | November 17,  2020", "url": "https://www.marketscreener.com/quote/stock/SINOVAC-BIOTECH-LTD-5714593/news/Sinovac-Biotech-Brazil-to-receive-first-doses-of-China-s-Sinovac-COVID-19-vaccine-says-Butantan-I-31805271/", "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdgris.png", "publishedAt": "2020-11-17T18:48:48Z", "content": "BRASILIA, Nov 17 (Reuters) - Brazil's Butantan Institute\r\nbiomedical center will receive this week the first doses of\r\nChina's Sinovac vaccine against COVID-19, its director, Dimas\r\nCovas, said on Tu… [+374 chars]"}, {"source": {"id": null, "name": "Trust.org"}, "author": "Thomson Reuters Foundation", "title": "Brazil to receive first doses of China's Sinovac COVID-19 ... - Thomson Reuters Foundation", "description": "HEALTH-CORONAVIRUS/SINOVAC-BRAZIL (CORRECTED, URGENT):CORRECTED-Brazil to receive first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute", "url": "https://news.trust.org/item/20201117175116-dpwml/", "urlToImage": "https://d8zcwdvc14g2e.cloudfront.net/contentAsset/image/c62e907a-e70c-4281-8592-848158de9269/image/byInode/1/filter/Resize,Jpeg/jpeg_q/70/resize_w/1100", "publishedAt": "2020-11-17T18:46:00Z", "content": "(Corrects to will receive from has received)\r\nBRASILIA, Nov 17 (Reuters) - Brazil's Butantan Institute biomedical center will receive this week the first doses of China's Sinovac vaccine against COVI… [+465 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Life can continue even after death... - Daily Excelsior", "description": "Dr. (Prof). S.L. Kachroo/Anshu Sharma The History of Mankind is a history of Diseases. Since its inception, the Challenge of multitude of diseases", "url": "https://www.dailyexcelsior.com/life-can-continue-even-after-death/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2018/08/dailyexcelsior.jpg", "publishedAt": "2020-11-17T18:46:00Z", "content": "Dr. (Prof). S.L. Kachroo/Anshu SharmaThe History of Mankind is a history of Diseases. Since its inception, the Challenge of multitude of diseases confronted the human and animal world. Although many … [+4942 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Brazil receives first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute - Devdiscourse", "description": "Read more about Brazil receives first doses of China's Sinovac COVID-19 vaccine, says Butantan Institute on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/1311222-brazil-receives-first-doses-of-chinas-sinovac-covid-19-vaccine-says-butantan-institute", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_11_2020_16_27_13_1783605.jpg?width=920&format=jpeg", "publishedAt": "2020-11-17T18:02:30Z", "content": "Brazil's Butantan Institute biomedical center this week received the first doses of China's Sinovac vaccine against COVID-19, its director, Dimas Covas, said on Tuesday, speaking remotely in a congre… [+252 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Teeth grinding, facial pain increase due to COVID-19 stress, anxiety: Study - Zee News", "description": "The stress and anxiety experienced by the general population during Israel`s first lockdown brought about a significant rise in orofacial and jaw pain, as well as jaw-clenching in the daytime and teeth-grinding at night, according to a new study from Tel Aviv…", "url": "https://zeenews.india.com/health/teeth-grinding-facial-pain-increase-due-to-covid-19-stress-anxiety-study-2325219", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/11/17/899797-covid-world-reuterss.jpg", "publishedAt": "2020-11-17T17:53:39Z", "content": "Washington: The stress and anxiety experienced by the general population during Israel`s first lockdown brought about a significant rise in orofacial and jaw pain, as well as jaw-clenching in the day… [+1970 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Major measles outbreaks forecast for 2021 due to Covid: Study - Bangalore Mirror", "description": "Researchers have stressed that major measles outbreaks will likely occur in the wake of the Covid-19 pandemic as early as 2021 due to many missed vaccinations.", "url": "https://bangaloremirror.indiatimes.com/news/india/major-measles-outbreaks-forecast-for-2021-due-to-covid-study/articleshow/79268988.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-408834,msid-79269092/79269092.jpg", "publishedAt": "2020-11-17T17:30:00Z", "content": "Sydney, Researchers have stressed that major measles\r\n outbreaks will likely occur in the wake of the Covid-19 pandemic\r\n as early as 2021 due to many missed vaccinations\r\n.\r\nMeasles is a highly cont… [+2482 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "Polypill in addition to headache medicine and polypill alone reduced cardiovascular sickness hazard - Microbioz India", "description": "A single, daily pill combining blood pressure and cholesterol medications, as well as the addition of a daily dose of aspirin, reduced cardiovascular disease events in people at risk for heart disease, according to late-breaking study presented today in a lat…", "url": "https://microbiozindia.com/health-news/polypill-in-addition-to-headache-medicine-and-polypill-alone-reduced-cardiovascular-sickness-hazard/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2020/11/GettyImages-97537745-59efa47d6f53ba0011c0070b.jpg", "publishedAt": "2020-11-17T17:27:30Z", "content": "A single, daily pill combining blood pressure and cholesterol medications, as well as the addition of a daily dose of aspirin, reduced cardiovascular disease events in people at risk for heart diseas… [+4893 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Obese people found to be at increased risk of Covid-19 - Bangalore Mirror", "description": "Several observational studies have reported the link between cardiovascular risk factors (such as obesity, high blood pressure, diabetes and high cholesterol) and COVID-19 severity. However, these st", "url": "https://bangaloremirror.indiatimes.com/news/india/obese-people-found-to-be-at-increased-risk-of-covid-19/articleshow/79268803.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-654083,msid-79268899/79268899.jpg", "publishedAt": "2020-11-17T17:20:00Z", "content": "A new study led by researchers at Queen Mary University of London uses a novel approach to investigate the effects of cardiovascular risk factors\r\n on the risk of COVID-19 infection\r\n.\r\nSeveral obser… [+1584 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Kairvy Grewal", "title": "Covid caused ‘significant’ depressive symptoms among young adults in US, finds study - ThePrint", "description": "Study finds 80% of 1,008 respondents had elevated levels of loneliness, depression, anxiety and increased substance abuse among people aged between 18 and 35 years.", "url": "https://theprint.in/health/covid-caused-significant-depressive-symptoms-in-80-young-adults-in-us-finds-study/546404/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/12/Representational-image-depression.jpg", "publishedAt": "2020-11-17T16:18:45Z", "content": "New Delhi: A new study found that the coronavirus pandemic has led to elevated levels of loneliness, depression, anxiety and increased substance abuse among young adults in the US.\r\nAlmost 80 per cen… [+3101 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Germany May Cull Up to 70,000 Chickens as Bird Flu Found on Another Farm - News18", "description": "Type H5N8 bird flu was confirmed in a farm near Rostock in the eastern state of Mecklenburg-Vorpommern, said a spokesman for the local government authority Landkreis Rostock.", "url": "https://www.news18.com/news/world/germany-may-cull-up-to-70000-chickens-as-bird-flu-found-on-another-farm-3089798.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/10/1602577461_untitled-design-2.png", "publishedAt": "2020-11-17T16:14:08Z", "content": "Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to 70,000 poultry is being prepared, authorities said on Tuesday.\r\nType H5N8 bird flu was confirmed in a far… [+1554 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Himani Chandna", "title": "6 in 10 diabetics in India worry about catching Covid, getting hospitalised, study finds - ThePrint", "description": "Study by market research firm Kantar also finds that more city residents are worried about uncontrolled blood sugar levels in general.", "url": "https://theprint.in/health/6-in-10-diabetics-in-india-worry-about-catching-covid-getting-hospitalised-study-finds/546299/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2020/04/diabetes.jpg", "publishedAt": "2020-11-17T15:11:07Z", "content": "New Delhi: Six in every 10 diabetics surveyed in India have expressed concern about catching Covid-19 and getting hospitalised for the disease, found a study by UK-based market research firm Kantar.\r… [+3623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "World COPD Day 2020: Know Theme, Significance And History More - Doctor NDTV", "description": "World COPD Day 2020: This day tries to create awareness about Chronic Obstructive Pulmonary Disease. Read here to know the date, theme, significance, history and much more about this day.", "url": "https://doctor.ndtv.com/living-healthy/world-copd-day-2020-know-theme-significance-and-history-more-2326502", "urlToImage": "https://c.ndtvimg.com/2020-03/bebpqq7g_supermarket-cough_625x300_27_March_20.jpg", "publishedAt": "2020-11-17T15:02:21Z", "content": "World COPD Day is observed on every third Wednesday of November. This year the day falls on 18 November 2020. This day aims to create awareness about COPD and ways to reduce the burden. Chronic Obstr… [+2443 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Researchers believe this supplement can cut the risk of COVID-19 - Times of India", "description": "While the coronavirus continues to devastate lives, scientists are looking for new ways to control the deadly virus.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-researchers-believe-this-supplement-can-cut-the-risk-of-covid-19/photostory/79264039.cms", "urlToImage": "https://static.toiimg.com/photo/79264182.cms", "publishedAt": "2020-11-17T15:00:00Z", "content": "For the study, scientists sifted through data from Cleveland Clinic's COVID-19 registry. It was found that patients who took melatonin were 30 per cent less likely to test positive for COVID-19 causi… [+464 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shikha Desai", "title": "Effects of air pollution and ways to protect your skin from it - Times of India", "description": "You feel you have wasted your youth at the age of 30 when you see grey hair, wrinkles on your skin and all other vi", "url": "https://timesofindia.indiatimes.com/life-style/beauty/effects-of-air-pollution-and-ways-to-protect-your-skin-from-it/articleshow/79261746.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79261746,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-68915/79261746.jpg", "publishedAt": "2020-11-17T12:32:00Z", "content": "You feel you have wasted your youth at the age of 30 when you see grey hair, wrinkles on your skin and all other visible signs of ageing. You wonder what went wrong, after all, you pumped iron in the… [+2889 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Kids Below 2 Should Not be Given Antibiotics, Here's Why - India.com", "description": "Administering antibiotics to children below 2 can lead to severe complications. Read on to know about them.", "url": "https://www.india.com/lifestyle/kids-below-2-should-not-be-given-antibiotics-heres-why-4213334/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/11/Bby.jpg", "publishedAt": "2020-11-17T11:03:18Z", "content": "Most pediatricians presume that antibiotics are safe for kids, however, a new study has revealed the opposite. Antibiotics, if given to children below the age of 2 can cause several illnesses or cond… [+1349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Feeling Stressed? Mediterranean Diet May Help Reduce Its Effects On Health - Study - NDTV Food", "description": "Food plays an important role in leading a healthy lifestyle. A well-balanced diet with every essential nutrient can do wonders for our overall health.", "url": "https://food.ndtv.com/news/feeling-stressed-mediterranean-diet-may-help-reduce-its-effects-on-health-study-2326349", "urlToImage": "https://c.ndtvimg.com/2019-07/mb183rdg_weight-loss_625x300_25_July_19.jpg", "publishedAt": "2020-11-17T10:53:07Z", "content": "In this fast-paced competitive world, stress has been one of the major factors affecting human life across the globe. It is, in fact, one of the major concerns we all are dealing with. Stress not onl… [+1955 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Ticks choose humans over dogs in warmer temperatures - Guardian News", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9N2w1ZUhua2k5UUnSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T10:49:12Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany May Cull Up To 70,000 Chickens After Bird Flu Found On Another Farm - NDTV", "description": "Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to 70,000 poultry is being prepared, authorities said on Tuesday.", "url": "https://www.ndtv.com/world-news/germany-may-cull-up-to-70-000-chickens-after-bird-flu-found-on-another-farm-2326346", "urlToImage": "https://c.ndtvimg.com/2019-09/0isuishs_chicken-generic_625x300_13_September_19.jpg", "publishedAt": "2020-11-17T10:46:50Z", "content": "A series of outbreaks of bird flu have been reported in Europe in past weeks (Representational)\r\nHamburg: Bird flu has been found on another chicken farm in Germany and a programme to slaughter up to… [+1567 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Healthy sleep habits help lower risk of heart failure: Study - The Statesman", "description": "Healthy sleep patterns are rising in the morning, sleeping 7-8 hours a day and having no frequent insomnia, snoring or excessive daytime sleepiness, the study published in the journal Circulation said.", "url": "https://www.thestatesman.com/lifestyle/healthy-sleep-habits-help-lower-risk-heart-failure-study-1502935806.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/11/QT-Sleep.jpg", "publishedAt": "2020-11-17T10:36:34Z", "content": "Researchers have revealed that adults with the healthiest sleep pattern have 42 per cent lower risk of heart failure regardless of other risk factors compared to adults with unhealthy sleep patterns.… [+1944 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Associated Press | Posted by Deepali Sharma", "title": "With limited Covid-19 vaccine supplies, who will be the first to get it? - Hindustan Times", "description": "Vaccine supplies will be limited at first. There won’t be enough to protect everyone, yet getting the shots to the right people could change the course of the pandemic.", "url": "https://www.hindustantimes.com/world-news/with-limited-covid-19-vaccine-supplies-who-will-be-the-first-to-get-it/story-HZHkDEFstK5HJSMEP6nz3K.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/17/Pictures/medical-syringe-illustration-bottles-labeled-sticker-vaccine_e62b97d8-28bd-11eb-bd4c-84783e11e201.jpg", "publishedAt": "2020-11-17T10:35:22Z", "content": "Who will be the first to get Covid-19 vaccines?\r\nNo decision has been made, but the consensus among many experts in the US and globally is that health care workers should be first, said Sema Sgaier o… [+1087 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes Diet: This Kalonji Paratha May Help Manage Blood Sugar Levels - NDTV Food", "description": "Diabetes is one condition that is irreversible and can only be manged by a good diet and lifestyle. Kalonji is one of those foods that may help manage the blood sugar levels.", "url": "https://food.ndtv.com/food-drinks/diabetes-diet-this-kalonji-paratha-may-help-manage-blood-sugar-levels-2326244", "urlToImage": "https://c.ndtvimg.com/2020-02/ad724kv_aloo-paratha_625x300_06_February_20.jpg", "publishedAt": "2020-11-17T10:27:44Z", "content": "Kalonji or black onion seeds, for instance, is a popular ingredient in Indian curries.\r\nCrispy, hot and topped with ghee or butter, parathas are a weakness of many. But those suffering from lifestyle… [+2668 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus update: Some masks likely to cause skin issues; Here is what experts advise - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMikAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2Nvcm9uYXZpcnVzLXVwZGF0ZS1zb21lLW1hc2tzLWxpa2VseS10by1jYXVzZS1za2luLWlzc3Vlcy1oZXJlLWlzLXdoYXQtZXhwZXJ0cy1hZHZpc2UvMjEzMDEyNS_SAZUBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vbGlmZXN0eWxlL2hlYWx0aC9jb3JvbmF2aXJ1cy11cGRhdGUtc29tZS1tYXNrcy1saWtlbHktdG8tY2F1c2Utc2tpbi1pc3N1ZXMtaGVyZS1pcy13aGF0LWV4cGVydHMtYWR2aXNlLzIxMzAxMjUvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T10:23:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Preksha Jain", "title": "#BeatHeartFailure: Top doctors and government officials shed light on the burden of Heart Failure in Indi - Times of India", "description": "Spotlight News: The third leg of the #BeatHeartFailure virtual series, conducted on November 5, had top doctors and concerned government officials from the state of G", "url": "https://timesofindia.indiatimes.com/spotlight/beatheartfailure-top-doctors-and-government-officials-shed-light-on-the-burden-of-heart-failure-in-india-way-forward-to-a-heart-failure-registry/articleshow/79259873.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-79259931,width-1070,height-580,imgsize-135850,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-11-17T08:37:00Z", "content": "The world is dealing with an unprecedented task of battling the Coronavirus pandemic. People have been trying their best to avoid the spread of the virus by taking necessary precautions. However, due… [+7419 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "National Epilepsy Day 2020: Know all about symptoms, causes, significance - DNA India", "description": "Epilepsy is a chronic brain disorder that results in recurrent 'seizures' or 'fits'. Seizures occur due to the sudden, excessive electrical discharges in the neurons or brain cells.", "url": "https://www.dnaindia.com/health/report-national-epilepsy-day-2020-know-all-about-symptoms-causes-significance-2856956", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2020/11/17/938083-national-epilepsy-day.jpg", "publishedAt": "2020-11-17T08:30:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "TB treatment during Covid pandemic: Experts raise questions over India’s approach - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiigFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL3RiLXRyZWF0bWVudC1kdXJpbmctY292aWQtcGFuZGVtaWMtZXhwZXJ0cy1yYWlzZS1xdWVzdGlvbnMtb3Zlci1pbmRpYXMtYXBwcm9hY2gvMjEzMDA1Ny_SAY8BaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vbGlmZXN0eWxlL2hlYWx0aC90Yi10cmVhdG1lbnQtZHVyaW5nLWNvdmlkLXBhbmRlbWljLWV4cGVydHMtcmFpc2UtcXVlc3Rpb25zLW92ZXItaW5kaWFzLWFwcHJvYWNoLzIxMzAwNTcvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-11-17T07:39:00Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New research: Arthritis drug may offer hope for older Covid-19 patients - The Indian Express", "description": "Using artificial intelligence, Imperial team initially identified it as a drug that could have antiviral and anti-inflammatory effects.", "url": "https://indianexpress.com/article/explained/arthritis-drug-may-offer-hope-for-older-covid-19-patients-7054117/", "urlToImage": "https://images.indianexpress.com/2020/11/Covid-13.jpg", "publishedAt": "2020-11-17T07:08:49Z", "content": "A runner passes by a window displaying portraits of people wearing face coverings to help prevent the spread of the coronavirus, Monday, Nov. 16, 2020, in Lewiston, Maine. (AP Photo: Robert F. Bukaty… [+1325 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Asian News International | Posted by Jahnavi Gupta", "title": "Exercised over nothing: Masks don’t impair lung function during physical activity - Hindustan Times", "description": "In a new study, a team of American and Canadian researchers concluded that while sensations of dyspnea might increase, there is little empirical evidence that wearing a facemask significantly diminishes lung function, even when worn during heavy exercise.", "url": "https://www.hindustantimes.com/health/exercised-over-nothing-masks-don-t-impair-lung-function-during-physical-activity/story-v9v85dDRjocdJtjaiA62AI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/11/17/Pictures/_f774da66-28a1-11eb-bd4c-84783e11e201.jpg", "publishedAt": "2020-11-17T07:03:46Z", "content": "Wearing a facemask helps limit the spread of Covid-19 by reducing respiratory droplets and aerosols spewed into the air when people breathe, talk, laugh, sneeze, or cough, a new study suggests. \r\nBut… [+3071 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Covid-19 has potential to induce diabetes, find Indian researchers - Medical Dialogues", "description": "Dr V.K. Shivane, A.R. Lila and T.R. Bandgar from the department of endocrinology, KEM Hospital have...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/covid-19-has-potential-to-induce-diabetes-find-indian-researchers-71507", "urlToImage": "https://medicaldialogues.in/h-upload/2020/10/21/141242-covid.jpg", "publishedAt": "2020-11-17T06:33:29Z", "content": "The research paper has been published in the Journal of Postgraduate Medicine, the official publication of the Seth Gordhandas Sunderdas Medical College and King Edward Memorial Hospital, Mumbai.\r\nAc… [+2069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Include these foods in your daily diet to get healthy, glowing skin - The Indian Express", "description": "Ensure you incorporate these healthy foods in your diet to glow from \"inside out\"", "url": "https://indianexpress.com/article/lifestyle/life-style/winter-skincare-diet-foods-glowing-bright-skin-6995288/", "urlToImage": "https://images.indianexpress.com/2020/11/skincare_1200_getty.jpg", "publishedAt": "2020-11-17T05:20:29Z", "content": "Ensure your diet helps you tide over skincare troubles. (Source: Getty Images/Thinkstock)We all want our skin to glow and remain blemish-free throughout the year. However, it requires time and effort… [+2112 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "A change of heart -- new drug for HCM reduces heart mass - ANI News", "description": "Washington [US], November 17 (ANI): For the first time, medication has impacted heart muscle thickness and function for patients with the most common inherited heart condition, rather than simply addressing their symptoms.", "url": "https://www.aninews.in/news/health/a-change-of-heart-new-drug-for-hcm-reduces-heart-mass20201117104503", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Heart_nov15_osiztV9-thumbnail-154x87-70.jpg", "publishedAt": "2020-11-17T05:15:37Z", "content": "ANI | Updated: Nov 17, 2020 10:45 IST\r\nWashington [US], November 17 (ANI): For the first time, medication has impacted heart muscle thickness and function for patients with the most common inherited … [+3776 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Prashasti Awasthi", "title": "‘Alarming’ levels of loneliness reported amidst Covid-19: Survey - BusinessLine", "description": "A new survey revealed that the coronavirus pandemic has led to “significant depressive symptoms” with over 80 per cent of people struggling with loneliness, depression, and other mental health issues.", "url": "https://www.thehindubusinessline.com/news/science/alarming-levels-of-loneliness-reported-amidst-covid-19-survey/article33113028.ece", "urlToImage": "https://www.thehindubusinessline.com/news/science/gkaprt/article33113027.ece/ALTERNATES/LANDSCAPE_615/BL18DEPRESSION", "publishedAt": "2020-11-17T05:10:43Z", "content": "A new survey revealed that the coronavirus pandemic has led to significant depressive symptoms with over 80 per cent of people struggling with loneliness, depression, and other mental health issues.\r… [+2401 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "CDCs new directive says that wearing a mask could keep you from catching the Coronavirus - Firstpost", "description": "by wearing a mask, it blocks out about 60 percent of the amount of virus that comes out of an infected person, the study found.", "url": "https://www.firstpost.com/health/cdcs-new-directive-says-that-wearing-a-mask-could-keep-you-from-catching-the-coronavirus-9020761.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/08/united-nations-covid-19-response-5hp3iqwZXD8-unsplash-1.jpg", "publishedAt": "2020-11-17T04:37:55Z", "content": "by wearing a mask, it blocks out about 60 percent of the amount of virus that comes out of an infected person, the study found.\r\n US health officials are taking a new tack to encourage Americans to w… [+2100 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Combination of polypill and aspirin can reduce cardiovascular events by up to 40% - News-Medical.Net", "description": "Heart attacks, strokes and other cardiovascular incidents can be cut by 20 to 40 per cent through use of a polypill which combines three blood pressure medications and a lipid lowering medication taken alone or with aspirin.", "url": "https://www.news-medical.net/news/20201116/Combination-of-polypill-and-aspirin-can-reduce-cardiovascular-events-by-up-to-4025.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fAspirin-620x480.jpg", "publishedAt": "2020-11-17T04:24:00Z", "content": "Reviewed by Emily Henderson, B.Sc.Nov 16 2020\r\nHeart attacks, strokes and other cardiovascular incidents can be cut by 20 to 40 per cent through use of a polypill which combines three blood pressure … [+7154 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Anoo Bhuyan | IndiaSpend", "title": "Covid-19 got global attention as it affected rich nations, says TB expert - Business Standard", "description": "The sudden focus on Covid-19 has had a significant negative impact on TB because in many countries the Covid-19 response has been built on or has utilised the TB response, says Grania Brigden", "url": "https://www.business-standard.com/article/current-affairs/covid-19-got-global-attention-as-it-affected-rich-nations-says-tb-expert-120111700290_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/misc/2020-07/14/full/20200713096L.jpg", "publishedAt": "2020-11-17T04:18:00Z", "content": "India, with 2.4 milliontuberculosis (TB) cases in 2019, has the most cases (27%) in the world. With attention focused on the COVID-19 pandemic, resources from government TB programmes around the worl… [+22886 chars]"}, {"source": {"id": null, "name": "NEWS HEADS"}, "author": "Ankit Pal", "title": "Why losing belly fat after 40 is difficult? How to overcome the issue - NEWS HEADS", "description": "Belly fat is one of the toughest areas to lose kilos and it becomes tougher after the age of 40. Today we will discuss why it becomes a difficult task after a certain age and how can we overcome it?", "url": "https://www.newsheads.in/lifestyle/health/why-losing-belly-fat-after-40-is-difficult-how-to-overcome-the-issue-article-64005", "urlToImage": "https://static.newsheads.in/media/thumbs/2020/11/17/684412459-belly-fat_1200x675.jpg", "publishedAt": "2020-11-17T03:58:00Z", "content": "New Delhi : Belly fat is one of the toughest areas to lose kilos and it becomes tougher after the age of 40. Today we will discuss why it becomes a difficult task after a certain age and how can we o… [+1751 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Asianet Newsable English", "title": "Want to avoid diabetes? Doctor says follow these 10 steps - Asianet News English", "description": "Diabetes -- The one ailment that most of us dread picking up in our lifetime. According to the World Health Organisation, 422 million people across the world have diabetes, particularly in low-and middle-income countries. With certain precautions, you can pre…", "url": "https://newsable.asianetnews.com/gallery/health-life/healthy-habits-to-no-smoking-doctor-suggests-steps-to-avoid-diabetes-vpn-qjx6ww", "urlToImage": "https://static.asianetnews.com/images/01cv6zrwywz8qa6397p0jy367w/diabietes_1200x630xt.jpg", "publishedAt": "2020-11-17T03:01:49Z", "content": "First Published 17, Nov 2020, 8:28 AM\r\nDiabetes -- The one ailment that most of us dread picking up in our lifetime. According to the World Health Organisation, 422 million people across the world ha… [+2461 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Monoclonal antibody therapy cuts LDL cholesterol by half in high-risk patients - Times Now", "description": "The research team found that subcutaneous administration of the agent at 450 mg weekly resulted in LDL cholesterol lowering of 56 per cent, and 52.9 per cent at 300 mg weekly compared to the placebo group.", "url": "https://www.timesnownews.com/health/article/monoclonal-antibody-therapy-cuts-ldl-cholesterol-by-half-in-high-risk-patients/682650", "urlToImage": "https://imgk.timesnownews.com/story/iStock-498014044.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-11-17T02:32:30Z", "content": "Washington [US], November 16 (ANI): The investigational drug evinacumab reduced low-density lipoprotein (LDL) cholesterol--the so-called \"bad\" cholesterol--by 50 per cent in patients with severe hype… [+4577 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Healthcare workers may face PTSD, other mental health challenges from COVID-19 - KENS 5: Your San Antonio News Source", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9WS1vcTUyeUNWQ1HSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-11-16T23:26:28Z", "content": null}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Why antibiotics should not be given to kids below 2 - MENAFN.COM", "description": "<p>New York, Nov 16 (IANS) Antibiotics administered to children younger than two are associated with several ongoing illnesses or conditions, ranging from allergies to obesity, warn researchers.</p><p>For the study, published in the journal Mayo Clinic Procee…", "url": "https://menafn.com/1101135369/Why-antibiotics-should-not-be-given-to-kids-below-2", "urlToImage": "https://menafn.com/updates/pr/2020-11/16/I_6b2c999e-fimage_story.jpg", "publishedAt": "2020-11-16T21:04:23Z", "content": "(MENAFN - IANS) \r\nNew York, Nov 16 (IANS) Antibiotics administered to children younger than two are associated with several ongoing illnesses or conditions, ranging from allergies to obesity, warn re… [+2043 chars]"}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "This arthritis drug may improve COVID survival in elderlies - The Shillong Times", "description": "Scientists have claimed that a type of arthritis drug called 'baricitinib' may reduce the risk of dying among elderly patients infected with Covid-19.This medication is usually used to treat rheumatoid arthritis, and was initially identified by the I", "url": "https://theshillongtimes.com/2020/11/17/this-arthritis-drug-may-improve-covid-survival-in-elderlies/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2020/06/GRAND-MOTHER-scaled.jpg", "publishedAt": "2020-11-16T19:47:00Z", "content": "Scientists have claimed that a type of arthritis drug called ‘baricitinib’ may reduce the risk of dying among elderly patients infected with Covid-19.This medication is usually used to treat rheumato… [+2410 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Editorial", "title": "Dragging on - Millennium Post", "description": "As 2020 nears its end, the worldwide battle against COVID-19 continues as well, with many nations...", "url": "http://www.millenniumpost.in/editorial/dragging-on-423988", "urlToImage": "http://www.millenniumpost.in/h-upload/2020/11/16/533600-3852xtsqqp7zfwx3q0e3buaekzgdhbkecbq74336977.jpg", "publishedAt": "2020-11-16T16:32:24Z", "content": "As 2020 nears its end, the worldwide battle against COVID-19 continues as well, with many nations facing crippling third waves of infection. Hope for recovery, any real recovery lies with a working v… [+3904 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Giselda Vagnoni", "title": "Researchers find coronavirus was circulating in Italy earlier than thought - Reuters", "description": "The new coronavirus was circulating in Italy in September 2019, a study by the National Cancer Institute (INT) of the Italian city of Milan shows, signaling that it might have spread beyond China earlier than thought.", "url": "https://in.reuters.com/article/health-coronavirus-italy-timing-idUSKBN27W1J2", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20201116&t=2&i=1541361048&r=LYNXMPEGAF0TO&w=800", "publishedAt": "2020-11-16T13:51:00Z", "content": "ROME (Reuters) - The new coronavirus was circulating in Italy in September 2019, a study by the National Cancer Institute (INT) of the Italian city of Milan shows, signaling that it might have spread… [+2217 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Researchers suggest SKI complex of SARS-CoV-2 as novel drug target - Drug Target Review", "description": "Researchers have discovered new drug compounds that target the SKI complex of SARS-CoV-2, preventing replication.", "url": "https://www.drugtargetreview.com/news/76256/researchers-suggest-ski-complex-of-sars-cov-2-as-novel-drug-target/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/SARS-CoV-2-9.jpg", "publishedAt": "2020-11-16T12:01:19Z", "content": "Posted: 16 November 2020 | Victoria Rees (Drug Target Review) | No comments yet\r\nResearchers have discovered new drug compounds that target the SKI complex of SARS-CoV-2, preventing replication.\r\nRes… [+2359 chars]"}]}